{
  "id": 1289,
  "title": "Source Code",
  "starring": [
    "Jake Gyllenhaal",
    "Michelle Monaghan"
  ],
  "runtime": 94,
  "genre": [
    "Thriller",
    "Science Fiction",
    "Mystery"
  ],
  "description": "When decorated soldier Captain Colter Stevens wakes up in the body of an unknown man, he discovers he's part of a mission to find the bomber of a Chicago commuter train.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AtQDTlj3MFOXJd5C9OopaRo3rRo.jpg",
  "categories": {
    "plot": 5.363636363636363,
    "acting": 5.666666666666667,
    "ending": 5.925925925925926,
    "soundtrack": 6.0,
    "cinematography": 6.5,
    "familyFriendly": 5.333333333333333,
    "funny": 7.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Overall, I thought this movie was an enjoyable experience in what has been (in my opinion) an otherwise dreary year.  I enjoyed the premise and the acting very much.  Jake Gyllenhaal does a great job and the rest of the cast provides solid performances.  The premise was interesting and reasonably well-presented, although the details are (understandably) never made clear.  However, I found the ending a disappointment that soured the experience somewhat.  I did not feel like it flowed well with what we had seen and experienced to that point.  Going into the end, I would have likely ranked it a 7 or 8, but I was just left scratching my head at the end (and not in a good way)."
    },
    {
      "rating": "5",
      "text": "I initially placed Source Code into the same category of Inception, a film which I did not enjoy to say the least. Surprisingly, this film had me feeling more satisfied albeit there are a list of things I could still complain about. The cast was decent and the film's linear progression was appropriately matching of the storyline. While this film did not catch me in any sort of awe, it was simply entertaining enough to allow for a full sit-through without major regrets. I recommend it to a general audience."
    },
    {
      "rating": "4",
      "text": "Science-fiction creates another far-fetched and effective aid to crime-solving only to have it's life-saving potential dashed by absolute moral values and shallow romanticism. The ending reminds me of the shoddy smile-fest tacked onto Minority Report, but less plausible."
    },
    {
      "rating": "9",
      "text": "I think Source Code is Inception-lite. It is an intelligent movie but doesnt test the viewer like Inception does.  I also think Source Code has become the most underappreciated movie of 2011.  I was blown away by the movie and it rewards repeat viewings as well.  If you were intrigued by the premise of Vantage Point and wish it was done with skill, Source Code is the perfect movie for you."
    },
    {
      "rating": "6",
      "text": "Source Code is a good sci-fi movie featuring one of the biggest stars in todays \"Young Hollywood\". The story is well written, the acting is on par, and the movie wraps up into a neat little package... but this may be it's biggest weakness.  This hour and a half movie finishes with it's main story so quickly, it has time to take on a more philosophical plot before it ends. It is just too bad that these concepts were portrayed in such a clean, unimaginative fashion, forcing the audience approved happy ending (spoiler alert... it has a happy ending). The main concept of life after death is written in a way that anybody could get it, but leaves me wanted more to chew on, perhaps in a more ambiguous fashion (ie. Moon). Instead, I am afraid to say that the Source Code is a good movie that I probably won't care to see again."
    },
    {
      "rating": "8",
      "text": "One of my favorite action movies this YEAR! with a great storyline, and great special effects. I can't think of a reason not to see it. Unfortunately the repetitive going back to the train so it can explode thing gets old eventually."
    },
    {
      "rating": "7",
      "text": "Intriguing, suspenseful story, really wonderful except for certain parts which felt like classic studio meddling - a sappy father moment, a contrived love connection, and an ending that didn't connect with the tone of the rest of the movie.  I really felt a disconnect between these aspects and what seemed to be the original intent of the film, as if a committee of writers were brought in to \"hollywood-ize\" the script or something.  Otherwise an enjoyable film."
    },
    {
      "rating": "6",
      "text": "A summer popcorn flick released in the wrong season that doesn't give the audience any intellectual credit and tries too hard to be \"smart\". You'll go in thinking this is a movie that will leave you talking, and leave with nothing to say. Nothing in this movie is bad, and for the most part it is enjoyable. It's as crazy as Eagle Eye, but with much better direction, slightly better performances, and a little bit more sensibility."
    },
    {
      "rating": "10",
      "text": "Source Code, a fast past and sometimes bewildering movie, it is one that everyone is familiar with, at least in part, as it seems a concoction of several other movies. However, we do not realize this until almost the end of the movie, which is where the beauty of this movie lies. The movie stars Jake Gyllenhaal, as Captain Colter Stevens, who for reasons unknown to him, and to us the viewers, is repeatedly sent into a train that seems destined to blow up, killing everyone on board. As soon as the train blows up, he is sent back into the train by a mysterious team of military scientists to do it all over again. Before going back into the train, he is given a little more information about what his mission is.  He eventually determines his mission is to find the person who is blowing up the train in order to help prevent a future bombing that will devastate the city. Meanwhile, he is unaware of how he came to be in his present situation or when it will end.\rOverall, I give this movie a 5-star rating.  The computer graphics generated in this movie are of an amazingly high quality and really make the viewer feel part of the movie.  I also believe the acting was extremely believable, even if the overall plot is a little flawed.  Despite its flaws, the plot does keep viewers on the edge of their seat and surprised at how quickly the movie seems to go by.  This is a must see movie for those who love both action and adventure."
    },
    {
      "rating": "10",
      "text": "From Moon to Source Code, i can honestly say that Duncan Jones future has a filmmaker is very bright, let's just hope that he can keep this up. I am very much looking towards his work in the future."
    },
    {
      "rating": "8",
      "text": "This is second Jake Gyllenhaal in row I have watched and have come away impressed with his ability to carry a movie.   The script was a well done for a sci-fi with a limited premise.   Think groundhog day meets an alternate reality/time travel episode on star trek.  That being said it is the human element and the characters that drive this movie vs. the sci-fi element the film is based on.  Definitely worth the rent."
    },
    {
      "rating": "7",
      "text": "Source Code has secured Duncan Jones' funding for a few more films as he continues to show what an excellent talent he is in the sci-fi genre. The film started to become slightly repetitive towards the latter stages but all in all this film was very good. I believe that the talents of Jake Gyllenhaal helped to steer the audience throughout this picture."
    },
    {
      "rating": "6",
      "text": "Source code is one of the smarter and more original science fiction movies (It was directed by Duncan Jones who made Moon also worth checking out). I gave it 6 point because, while it is somewhat original, unfortunately can not avoid the usual Hollywood clichés, and becomes predictable. Worth checking out, but will not be remembered much..."
    },
    {
      "rating": "8",
      "text": "Source Code is a great piece of original science-fiction that has intense scenes, really good occasional violence and a strong lead performance from Jake Gyllenhall."
    },
    {
      "rating": "8",
      "text": "While it can't even spit in the proverbial direction of Jones' first classic \"Moon,\" \"Source Code\" is still an interesting action film, making some hard-to-swallow subject matter actually comprehensible."
    },
    {
      "rating": "7",
      "text": "A really smart film. Unfortunately, it was also forgotten by many people, partly due its release date in Spring 2011; it came out in the weird months prior to blockbuster season. The repeating 8 minute scene never gets old as director Duncan Jones (Moon) proves he is a solid director in his second directorial effort."
    },
    {
      "rating": "7",
      "text": "\"Source Code\" is a smart, but also human action thriller. It is flawed but worth watching."
    },
    {
      "rating": "10",
      "text": "AAtrekkerI loved this movie.  It had so many positive qualities.  The Story was most interesting, the leads were charming and very ingratiating.  The story was a combination of \"Groundhog Day\" and the TV series \"Seven Days.\"  I found it very engrossing and was on the edge of my seat during the entire film.  If I have one criticism, it is the title but it's too late for that.  This film shows very clearly that you don't need profanity, excessive violence or gratuitous sex to be enjoyed.  The prime ingredient is a good story. But please pay very close attention to the early dialogue; it will help you to stay focused.   Please more, more, and more of this type of fun, entertaining, and satisfying film."
    },
    {
      "rating": "8",
      "text": "This is a very well-done film. On par with, if not better than, Moon. This director has a bright future ahead of him, and I look forward to following his work."
    },
    {
      "rating": "9",
      "text": "The trailer makes this film look very ordinary, but very early into the actual movie, you realize something interesting is going on. Don't want to spoil anything by comparing it to other films or TV show, but the writing is terrific. The way layers of the onion are peeled back is artful and entertaining. One of the best \"major\" releases of the young year in my book."
    },
    {
      "rating": "9",
      "text": "Dr. Sam Beckett(Scott Bakula) never overstayed his welcome. In  \"Quantum Leap\", the great science fiction series that enjoyed an inspired four-year run on NBC in the early-nineties, the time-traveling physicist would supplant body after body like a benevolent demon, solving their dilemmas with the utmost expediency before dispossessing his hosts in a self-induced exorcism that worked like a trigger mechanism predicated on situational closure. This would prove to be beneficial for our nowhere man because sooner or later, hypothetically(Al, played by Dean Stockwell, a hologram, always kept track of Sam's departure time) the loved ones and acquaintances of the newly-consumed person would eventually discern that they were dealing with an impostor. If Sam took up full residence in one of the host bodies, this new lease on life couldn't possibly pan out due to his lack of shared histories with the people he'd be expected to be intimately familiar with. Travel-weary, from all that bouncing along his own chronological timeline, the quantum leaper yearned for a sedentary existence, but the only possible happy ending for Sam would have been for him to return as himself. To settle down as somebody else, learning the supplanted person's persona like a new language, strikes me as being a little insidious, not to mention, parasitic, and that's the nagging flaw of \"Source Code\", an otherwise ingenious sci-fi thriller which unfortunately, doesn't know when its time is up. Once Cpt. Colter Stevens(Jake Gyllenhaal) averts the intended expression of the secondary crisis(the bomb poised to level Chicago that never detonates), thanks to the Afghanistan veteran's time-sensitive(Sam had forty-two minutes, Colter has eight) on-the-fly detective work, his superior, Colleen Goodwin, in gratitude for the captain's hand in apprehending the perpetrator, allows the military's guinea pig to die gracefully, by giving him a chance to save the doomed train commuters with one final rewind of the source code. (In a sense, \"Source Code\" is like Woody Allen's \"The Purple Rose of Cairo\". The real Colter is in a life-support chamber, while the digital Colter, is essentially, playing a part in a movie(the source code can be read as an eight-minute action-short. In the end, like the Mia Farrow character in the Allen film, the heroine falls for the simulation.) As in Harold Ramis' \"Groundhog Day\", through repeated stints in the time loop, the self-actualized person accumulates information to affect a different outcome. By trial and error, Colter learns that the bomb up in the ventilation shaft comes equipped with a backup trigger, a secondary cellphone, which he defuses, therefore changing the predetermined outcome of the program's allotted eight minutes. Instead of a violent explosion, engulfing the train with an all-consuming fire, the last tick of the program's timecode corresponds to a freeze-frame where the once-victimized passengers' laughter is captured in mid-regale during the last moment of their filmic existence. Meanwhile, Colter is engaged in an petrified kiss with the woman he grows to love, Christina Warren(Michelle Monaghan), the passenger who happens to be seated across from his train compartment when the soldier leaps into the body of Sean, her teaching colleague from work. This is how \"Source Code\" should end: a film-within-the-film happy ending. It's \"Groundhog Day\" in miniature. Colter learns to live life to its fullest in eight minutes. Reality-wise, these people are all dead, but in the altered source code, the victims of the terrorist attack now get to live, not die, after their running time is up. The filmmaker ruins the poetry of the moment. But Hollywood, not known for its poetic gestures, especially within the context of a would-be blockbuster, is not going to make allowances for any art-house pretensions, so instead of going out like Anthony Doniel, last seen on the shoreline in Francois Truffaut's \"Les quatre cents coupe\", \"Source Code\" tells us that there's life beyond a pre-recording, and sadly, the freeze-frame unfreezes. That's where the film loses me. Since the soldier sends a text message to Coleen(from within the source code), it must mean that he has his own memories, not Sean's, the man he usurped. As aforementioned, Sam Beckett never overstayed his welcome. How long will it take before Christina realizes that the man she's with is not actually Sean? How will she react? Colter can't blame his unfamiliarity with the schoolteacher's life on amnesia, or else he wouldn't be cognizant of Christina. The digitalized woman seems to be in love with an amalgamation(her old feelings for Sean mixed in with Colter's heartfelt pursuance of her). How confusing for her. It's a paradox that \"Source Code\" may not be aware of. The filmmaker, perhaps under pressure from the studio, simply rams a happy ending down everybody's throats. Logic, be damned!"
    },
    {
      "rating": "9",
      "text": "Very good movie, was entertaining and kept me in anticipation throughout the entire film. Saw it at a drive-in movie theater and was super fun! I would recommend this movie to just about anyone with half a brain; it will hold your interest."
    },
    {
      "rating": "5",
      "text": "Decent movie, expected more after all the great reviews that it received.  From viewing the previews, Iknew this movie was going to be mediocre...I should have went with my first instincts and waited for the DVD."
    },
    {
      "rating": "7",
      "text": "\"Source Code\" smells like a Hollywood movie with a extreme Hollywood ending. But overall, the movie is nothing like it. It mesmerizes the audience with its powerful cinematography and innovative plot. Truly a movie that is worthy of a Oscar nomination."
    },
    {
      "rating": "5",
      "text": "I was looking forward to this film, with a good cast, interesting story line, a director whose debut film \"Moon\" was one of my favourites of 2009.  However, unfortunately with all the ingredients right, the film never quite grasps the audience and remains a collection of moments."
    },
    {
      "rating": "5",
      "text": "I can not see what all the fuss is about. This movie lacks everything that makes a movie good. Donâ"
    },
    {
      "rating": "4",
      "text": "Flat and rushed is the best way to describe this film. No character development, unanswered and half answered questions, unsatisfying \"Hollywood\" ending. It felt like if they didn't know the answer to some questions, they left it out. There was no real explanation on how they were able to do what they did. They could've made it longer and added anything to make it better. Although rushed only describes the writing. The production, acting, and anything that's not the story is good. It's what makes this movie watchable."
    },
    {
      "rating": "5",
      "text": "The movie feels like a bad attempt to make a very good short story into a full length movie. It doesn't work and it while one remains curious, one soon loses interest. It also has that awful Hollywood ending which makes a great arty movie into a rubbish weekly rental at the local video store."
    },
    {
      "rating": "5",
      "text": "\"To Confusing for its own Good , Source Code may come as a turn off to action fans , its not your average no holds bar action flick , it feels watered down and just mere sloppy. Everyone can do much better then this movie a huge disappointment\" .. C"
    },
    {
      "rating": "10",
      "text": "The movie was entertaining throughout the movie. This movie was a awesome sci-fi action movie that left you with an ending that had you questioning. At the end the \"source code\" was more then you first thought. It was interesting, and entertaining. I highly recommend to people who aren't going to a movie to tear the plot limb from limb."
    },
    {
      "rating": "4",
      "text": "Going into this movie, and hearing how the mechanics of the Source Code was suppose to work.  I turned off my brain and went along with the lore, which I know you must do in most science fiction movies.  I could go on and gripe about the idiotic science that the directors has spat into the faces of the American people.  I realize that through this science, Jake Gylenhaal's character should not have been able to do the things he did.... but honestly, i just grinded my teeth together and took the movie for what it was and nothing more and tried to have fun.  Actually...I did, this movie was VERY entertaining, it kept you on the edge of your seat with the suspense that the movie had built, great character development, and great characters in general, and acting was excellent.  Don't get me wrong, in the back of my mind, I knew that the science they had presented was contradicting and was nonsense, but I was actually having an VERY good time with this movie.  So why such a low score???  The movie done something extremely unforgivable, the ending had ruined it.  The movie had drilled into the viewers mind a simple rule, and it was that the Source Code was just an 8 minute relay that Gyllenhaal's character was going through, and guess what happens at the end??...HE GOES BEYOND THE 8 MINUTES.  Don't get me wrong, if the movie had set this plot hole up to be plausible, it would have been alright.  For example:  imagine if you are watching a movie and it had simply said \"the sky can not be red,\" and then for no reason whatsoever, the sky turns red at the end of the movie.  Source Code gave the excuse that \"well no one really understood the source code,\"  there was another problem with that, Gyllenhaal's character died, so he should not have been able to live in the Source Code because he was not alive in reality.  And that's not the only thing that was wrong with the ending, it also seemed forced, it seemed like the writers just wanted to have a \"feel good\" ending which was completely unnecessary.  The scene where the time in the source code had paused, Gyllenhaal's character is kissing Monaghan's character, and everyone is happy...the screen should have just turned off then and it would have been a perfect ending.  It's too bad too, i saw the movie in theatres and I was absolutely \"in\" on these characters, but the ending shattered the whole movie.  The Good:  Great cast and characters, great action.  The Bad:  Contradicting story, strong unnecessary undertones, and an absolutely awful ending.  To give an example of how much the ending shattered the movie, if it would have ended more sensible, i would give this movie a 9, but how it stands.... this movie is good for the brainless but awful for anybody with standards for what they call art."
    },
    {
      "rating": "8",
      "text": "This is a little movie that in some ways (A list actor, big budget) acts like a big movie. But this is is not a movie focused on great effects but is instead focused on storytelling. Duncan Jones (Moon) is getting closer to his masterpiece certainly."
    },
    {
      "rating": "8",
      "text": "Source Code was a great movie, and for me it was the best one of the year so far. The best part of this movie is how it pays tribute to Alfred **** with the sound track and style. Acting was great, and there were a couple twists throughout that were nice. This movie is very similiar to a movie like Inception, so if you liked Inception, you will probably like this one."
    },
    {
      "rating": "9",
      "text": "Background and insight:Pure Science Fiction is often regarded as too complex for film audiences, which is why so often we see it mixed with other genres. Fine examples are the likes of Star Wars and The Matrix (etc), where you get action/westerns mixed with Science Fiction. I have always been a fan of science fiction films. They present a higher (usually) level of imagination than most genres. The rules are not always confined to real world, realistic events or physics. The only real limitation is the imagination of the writer. Science Fiction relies on its audience to suspend belief, which can be a step too far for some viewers, but for me this is one of the reasons I have always loved film, the chance to escape and experience things that only the silver screen can allow you to experience (in the visual sense). I really enjoy writing science fiction, but like the examples above I also tend to mix the genres and stay clear of pure science fiction. Duncan Jones on the other hand has been looked upon as being a modern day saviour of science fiction with his first film Moon. A master class of indie film making that was so well made, it was (and still is) almost impossible to figure out how it was made for a tiny budget of $5 million. But Iâ"
    },
    {
      "rating": "5",
      "text": "I heard so many good things that I went in expecting something deeper, that was my mistake.  This is a movie you could easily watch slightly drunk, cuddling up to your S.O. on the couch, occasionally talking about something completely different from what you're watching.  It's not horrible, it's just very mediocre.  there's no tension because there's no one to save.  The ending is suppose to prove that there was someone to save but after sitting for 120 minutes believing no one is in danger, then I spent 120 minutes not being invested and a cheesy, illogical, fairy tale twist at the end doesn't change that.The best thing i can say about this film is that is a decent balance between action and chick flick which makes it a solid compromise to the \"what should we see\" conversation."
    },
    {
      "rating": "8",
      "text": "There are some movies that I see, and on my way out I will consider complaining to the staff and asking for a refund. Then I can't be bothered and end up moaning along with who ever I'm with about the time we just wasted. This isn't one of those films. I enjoyed it, and whilst it isn't perfect I would definitely watch Source Code again, and I recommend you see it when you can.8/10    gameandmoviereviews.com"
    },
    {
      "rating": "6",
      "text": "Source Code is a more convoluted, faster paced Ground Hogs Day [1993] with guns and a ticking time bomb. Although not that well made Source Code is a reminder that audiences prefer complex story lines, even if they aren't completely coherent.  6/10Source Code stars Jake Gyllenhaal as a Colter Stevens, a helicopter pilot who is trapped in some sort of machine simulator. The beginning of the film starts with Stevens waking up on a train in a body that is not his own. He's sitting across from Christina Warren played by Michelle Monaghan, a female companion who he will learn latter on has a small crush on him, or at least who she thinks Sean Fentress. Stevens lives 8 minutes of Fentress's life trying to gather himself when a bomb suddenly explodes killing everyone on the train. Stevens awakens in a metal dome disoriented and locked into a harness. Without knowing who or where he is an image and voice appear when he is contacted by Luit Goodwin played by Vera Farmiga. Goodwin tells Stevens that he must identify the bomber of the train so that they can prevent another terrorist attack. Steven's doesn't quite understand what's going on with his last memories being aboard a helicopter in Afghanistan. Before too many of Stevens' questions are answered he is to told to try again and abruptly plugged back into the source code. This process continues over and over until bit by bit is revealed what the source code is. Apparently source code allows a certain someone to be plugged into the consciousness of another certain someone and live out an alternate reality, something involving string theory and such. The rules are that he only he can only live out the last 8 minutes of that someone's life because that's how long the \"flash\" lasts when someone dies. Also, whatever he does in that reality will not affect any other reality. So Gyllenhaal is plugged into the source code relentlessly by his military commanders over and over until he finds the bomber. Over the course of his multiple reenactments Stevens narrows down the bomber and develops a relationship with Ms. Warren and Luit. Goodwin. Gyllenhall and Monaghan are good but nothing spectacular. Jeffrey Wright plays the nerdy mastermind quite well. He's cruel, discordant and tunnel minded; just what you'd expect from a scientist who's spent his whole life dedicated to his pet project. But it is Vera Farmiga who really shines in her role as the intermediate officer between the enslaved Steven's and the heartless scientist. In every scene Framiga battles with the two conflicting personas of her character. The female empathic side trying to soothe and care for Stevens as he's used as a cog in the high tech military defense machine; and also the military stratagician (stratagician is not a word???) who must convince Stevens to finish the mission while withholding the painful truth of Stevens' condition. The music in Source Code is a little pretentious and is abnormally noticeable. Its special effects are not the greatest with explosions and slow motion looking like they had been done by a sub par video game company. However it's not just the special effects, nor its mediocre cinematography but also Source Code's erratic pacing and editing for my undistinguished rating. The scenes don't flow well together and you feel just as pushed around as Gyllenhaal's character as you bolt back and forth between scenes. This feeling may have been deliberate on director Duncan Jone's part but watching the movie you feel like you've been riding the old bumpy wooden roller coaster you'd find at the boardwalk. At the end of the film you're constantly teased with false endings. As soon as you think it's going to end, they tag on and extra scene which tangles the plot even further. During the last 20 minutes they start abandoning the rules of source code and begin cramming in new content. It's like they shot multiple endings of the film and instead of choosing one, they decided to put them all in. Source Code is an intriguing film with a lot of complexities and philosophical metaphysics involved which I think is the reason for its success at the box office and among critics. As we know from Inception and The Matrix audiences today are really drawn to these alternate reality movies. However Source Code is not particularly well constructed and i'll be re-watching Ground Hog's Day numerous times before I even think about re-watching Source Code."
    },
    {
      "rating": "8",
      "text": "Good,  well written film - but it didn't reach its full potential. The concept is a good one, but it doesn't materialise as good as it sounded on paper but does work well and it's high points are definitely high, but I found the sub-story a little confusing and a little hard to follow. It it wraps up well - if a little cheesily and the mystery story is good, and I felt satisfied walking out of the theatre. Not exactly jumping for joy screaming 'It was the best film ever' but something I can and do recommend for a fun engaging story."
    },
    {
      "rating": "8",
      "text": "Interesting twist of reality using technology to relive the past. This type of movie always presents idealogical meanings of life and death that will never be answered. I would recommend this movie to anyone that likes movies that present outside of the box concepts."
    },
    {
      "rating": "3",
      "text": "Source Code is confusing on all levels which it makes it nearly impossible to stay interested in. The ending of the movie is so far-fetched for even movies that it becomes completely unrealistic."
    },
    {
      "rating": "5",
      "text": "Quite good for most of the movie, its fun watching the investigation unfolding but unfortunately the plot kind of falls apart in the last 15 minutes and I'm not sure the ending actually makes sense."
    },
    {
      "rating": "4",
      "text": "What a convoluted mess. If I had to go back on that damn train again, I would have had a seizure. The film's premise is only partially clear and that is big failure. It simply makes no sense. In addition, the film steals from  Avatar and Memento and others. I tried to understand the concept but it is useless. A major headache is all I got."
    },
    {
      "rating": "6",
      "text": "If you've seen the trailer don't expect that level of excitement from the real thing. Jake Gyllenhaal plays a soldier who's placed on a train that's headed for a disastrous explosion. He has 8 minutes to find the bomber and must repeat this sequence until he accomplishes his mission. Watching the story unfold is interesting, but lacking in surprises or suspense. There's also time wasted trying to build an emotional connection. While it's never boring, it will quickly be forgotten as an average sci-fi tale."
    },
    {
      "rating": "10",
      "text": "Very complex and deep yet easy for the general public to follow and appreciate. Well worth watching at least once. Most movies of this style (inception, shutter island) are usually very difficult to watch as if you don't hear and see everything the movie tends to become very confusing very fast. But the way that Source Code plays out makes the movie very accessible and fun to watch even if it isn't your type of movie."
    },
    {
      "rating": "7",
      "text": "Initially, the audience will be left thinking of this film as okay but wondering how it could possibly do anything to make itself stick in your mind. Rest assured, it does develop and proves itself to be an emotional piece of work and cleverly written."
    },
    {
      "rating": "2",
      "text": "Being from Chicago I love Chicago based movies from Blues Brothers to Ferris Bueller's Day off. But, this did not do it for me. Okay I'm not a Jake fan, but I am a Duncan Jones fan. I guess ending did it in for me."
    },
    {
      "rating": "2",
      "text": "For me, the movie was disappointing.  Trailers looked wonderful.  But they twisted a romance into this weird story about a guy who was in Afghanistan and got his body blown off so they use him as a lab-rat to find a bomb on a train - and be a Hero one more time in the eyes of the American hopefull.  SO, they decide to go through these little weird scenes to try and make the movie tricky and witty.  Not really working.  It disturbing that Hollywood is more and more becoming a huge advertizement for the \"American Way\".  I mean ... did he REALLY have to be part of the Afghanistan \"War\" to make this movie work, did he REALLY have to be a \"Veteran\" who saved lives?  A veteran who could potentially be a \"Hero\" after saving more and more people.  Geez, that glam stuff gets so repetitive and pathetic it makes me want to hurl.Most viewers shrug it off as nonsense, but the Studios are really sending messages to the people watching these kind of movies.  Maybe your right, maybe I am \"looking to deep\" into it, but if you look under all the BS plot on top - at the heart of these things is a message, and the message has nothing to do with the quality of the movie or the continuity and excitement.  Unfortunate.  It really could have been a great modern Sci-Fi flick. Surprised Coca-Cola or Nike hadn't hung like a banner on the outside of the train from tip to tip.  Oh, and the ending.  Geez!  Did a 13 year old girl write that?  WOW."
    },
    {
      "rating": "4",
      "text": "\"Source Code\" is definitely the stinkiest steaming pile of Hollywood CRAP I've seen in a long time!!!A gross and tactless use of every philosophical one-liner clichÃ© in the book while plagiarizing bits and pieces of nearly every parallel-reality movie out there. For a movie like this to be acceptable, the action needs to be relentless and breathtaking ... it's not!EVERYTHING in this movie is just sloooooow and predicatable while the script is just down right embarrassing (could you pah-lease have used the line \"It's gonna be OK\" just one more time for me? I don't think there were enough of those).How on earth Duncan Jones could go from making a masterpiece like \"Moon\" and sink into this total waste of time and money is beyond me.As for Jake Gyllenhaal ... I get it man, you're making lots of money playing these parts and who can blame you, I'd probably do the same, but can't you give us a good ol' indie drama part like you used to every now and then to remind me why I love you so much?? Could ya mix it up for me a bit there ol' buddy, ol' pal? How about a \"Bubble Boy\" for each \"Prince of Persia\"? A \"Donnie Darko\" for every \"Source Code\"? 'Cause to tell you the truth man, I'm starting to forget how good you REALLY are!!!To conclude: If you like crap that \"thinks\" its deep and intelligent, this is the movie for you!!!"
    },
    {
      "rating": "2",
      "text": "I just don't understand all the positives for this movie at all.There are some plus points, as a story about the mental makeup of the main chafachter it works, as a kind of suspense movie it sort of works, unfortunately that is all the positive I could come up with.That is vastly outweighed by the negative.  Whenever you set about telling a story in the science fiction genre you have two options, either to go all out on the fiction or to root it in reality, this movie has everthing rooted in reality from the present day(ish) setting to present day computers and issues.  For a movie based like that the science simply has to be plausable.  Not only is the science of Source Code implausable but it is actually impossible.The premise is that a scene can be reconstructed by using the last 8 minutes of peoples memories, mayeb that is possible, maybe not, I don't know, that isn't my issue.  My issue is that 8 minutes is a tiny amount of time, with sufficient memories and thoughts I'm sure a computer model could forcast what a person would do if a specific in the timeline changed, 8 minutes isn't enough so there is no possible way to determine how each charachter would respond, making the intelligence gained useless.  Even worse than this is that despite only having memories from those who died on the train they are trying to find a bomb that none of those memories would contain.  The only brain that had those memories is driving around in van somewhere so realistically even if Stevens found the right location, thee would be no memory of the bomb being there.To top everything off we get an idiotic parrallel world style ending just so the cripple and the idiotic bint who has only known him for 8 minutes can walk off happily into the sunset.I'm sorry but anyone who actually understands anythign about logic or science is going to hate this film by about 20 minutes in.  The worst part is that it looks like there was a decent premise fo a film in thre somewhere but it appears to have been battered around by hollywood screenwriteras need to dumb down science, raise action and needlessly include romance like they try to do in every film.  Normally it's an annoyance but nothing more, this time it has created stupidly large plot holes that simply ruin the film."
    },
    {
      "rating": "1",
      "text": "Ground Hog Day without the laughs on a train. Totally unoriginal, totally silly, totally couldn't wait for it to end.\rJake is taking anything on that seems to come along. I guess good for him but I'm out 6 bucks for the rental. Watch Groung Hog day."
    }
  ],
  "recommendations": [
    "annihilation",
    "arrival",
    "coherence",
    "lucy",
    "what_happened_to_monday",
    "the_cloverfield_paradox",
    "captive_state",
    "chaos_walking",
    "anon",
    "maze_runner_the_scorch_trials",
    "zero_dark_thirty",
    "the_midnight_sky",
    "the_purge_election_year",
    "the_hunger_games_mockingjay_part_1",
    "donnie_darko",
    "elysium",
    "maze_runner_the_death_cure",
    "the_matrix_reloaded",
    "the_tomorrow_war",
    "sunshine",
    "prometheus",
    "the_butterfly_effect",
    "interstellar",
    "predestination",
    "antebellum"
  ]
}