{"id": 1602, "title": "Space Jam", "starring": ["Michael Jordan", "Wayne Knight"], "runtime": 88, "genre": ["Family", "Animation", "Comedy", "Science Fiction"], "description": "Jokes fly as the Tune Squad takes on the Nerdlucks in a hardcourt game to decide if the Looney Tunes remain here... or become attractions at a far-off galactic off-ramp called Moron Mountain. The Nerdlucks have a monstrous secret weapon: they've stolen the skills of top NBA stars like Charles Barkley and Patrick Ewing and become Monstars. But that's not all, folks. The Tune Squad’s secret weapon just happens to be the finest player in this or any other universe. He's outta this world. So's the fun.", "releaseYear": "1996", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/6V2qY14LFLxl4V4wdyVHCyIjbdF.jpg", "categories": {"plot": 7.222222222222222, "acting": 7.625, "ending": 7.333333333333333, "soundtrack": 7.25, "cinematography": 7.0, "familyFriendly": 6.894736842105263, "funny": 7.458333333333333, "action": 10.0}, "reviews": [{"rating": "10", "text": "The Most famous Basket Ball Cartoon Live Action Movie off all time!, I like Michael Jordan, he's a likable person in this movie but The Looney Tunes are the most Iconic Cartoons on earth. 10/10, You should watch it again :)"}, {"rating": "7", "text": "I remember renting the VHS tape from the local video store when i was a kid. Putting aside the fact that i know every second this movie perfectly - i think it's very entertaining for kids, adults and pretty much everyone. An oldschool animated comedy that will remain in the history forever!"}, {"rating": "9", "text": "An enjoyable family friendly movie with great humor and a lot of good ideas. On paper it does sound so crazy and insane but it delivers an entertaining experience. The story starts when Michael Jordan ended his NBA career in 1993 to become a baseball player (This really happened in real life and we all are still baffled why this even happened). Meanwhile the evil alien Mr. Swackhammer owner of a failing space amusement park need something to stop the decline. He wants the Looney Tunes and send his minions to get them no matter what (= persuasion with immense firepower;-). However his minions are tricked into giving the Looney Tunes a chance and because all are small and physically not intimidating they chose a game of basketball. Of cause this does not work as planned and the Looney Tunes need a tiny bit of help to quote Bugs Bunny. Like I said it sounds crazy but works well on the screen. It is just great slapstick, humor and entertainment in combination with Michael Jordan and basketball. There are so many that criticize this movie for its story and I cant understand them. This is a sports comedy with cheesy fun intended and not the Godfather, Schindlers List or a Shakespearean play. You would in reverse not criticize a drama for lack of humor. For me the story is a good vessel for the humor, characters and slapstick. It does a bit more than it needed. Then there is the cast. I don't need to introduce the Looney Tunes like Bugs Bunny, Daffy Duck, the Tasmanian Devil, Elmer Fudd, Yosemite Sam and all the others. They are popculture legends and probably in the most know fictional characters lists. They added a new character here with Lola Bunny. She worked well and was added to the rooster for the Looney Tunes and is still there today. For the human actors we have Michael Jordan as himself or the public image he has to keep up ;-). Then we have Bill Murray also as himself and he is as always an entertaining actor (Is it acting if he is himself?), Wayne Knight as Stan Podolak who delivers and of cause some of the best NBA players of that time like Charles Barkley, Shawn Bradley, Patrick Ewing, Larry Johnson and Mugsey Bogues as themselves in smaller roles. All deliver and I see no missteps here. Then there is the humor and slapstick. You get what you expected. Hilarious fun, great jokes and some abstruse cartoon violence. The humor works well and makes this movie worthwhile. The animation looked really good and captures the style of the Looney Tunes. After rewatching I say they created something that ages well and will not be criticized for it even after all the years. The soundtrack is also remarkable. The Monsters Anthem which actually is named Hit em High is a really powerful (bad guy) theme song, Fly like an Eagle by Seal is still excellent and R. Kellys I believe I can fly was still played in radio (until something happened which I will not mention here).  A good soundtrack with some memorable tracks. Overall this is an enjoyable movie you can watch and relax with. It is not perfect nor 10/10 material but still fun and with good humor."}, {"rating": "9", "text": "Space Jam is a high-energy comedy that mixes live action, animation, cornball storytelling and rowdy humor into an energetic, gee-whiz confection that will probably delight just about everybody."}, {"rating": "8", "text": "Space Jam is a happy marriage of good ideas--three films for the price of one, giving us a comic treatment of the career adventures of Michael Jordan, crossed with a Looney Tunes cartoon and some showbiz warfare."}, {"rating": "10", "text": "Space Jam is a good fun, Goofy and Looney film. I know that having one of the best NBA player ever team up with one of the best cartoon character ever is a stupid idea. But that idea actually work."}, {"rating": "7", "text": "Space Jam. What's up, doc? A funny and cute comedy that I often watched as a child. Also worth noting is a good soundtrack and a basketball match between toons and Michael Jordan."}, {"rating": "10", "text": "Es una pelicula muy divertida,no se porque tanta mala critica,evidentemente no es una pelicula pra tomarse en serio,es para los amantes del baloncesto"}, {"rating": "10", "text": "A thrilling reimagination of the hallucinations Michael Jordan had when he dropped a ton of acid before game six of the 1993 NBA finals. Jordan sees Scottie Pippen turn into Bugs Bunny, the Phoenix Suns turn into giant aliens who absorb talent from NBA players, and the world around him literally become a cartoon. Perhaps the most bizarre part is that Jordan is absolutely convinced that he is a mediocre AA baseball player, which he has said inspired him to become a mediocre AA baseball player soon after the experience. I highly recommend this movie if you want to study the effects of LSD on professional athletes from a first person perspective."}, {"rating": "10", "text": "I watched this movie as a kid and now  my kids enjoyed this movie too . They even said its way better than the new one. Too bad my kids didn't get to see Jordan play in in real time during the hype of his prime  years."}, {"rating": "10", "text": "Great movie. I watched it again after the new sequel. Way better than the new one."}, {"rating": "7", "text": "Space Jam is a high-energy comedy that mixes live action, animation, cornball storytelling and rowdy humor into an energetic, gee-whiz confection that will probably delight just about everybody."}, {"rating": "7", "text": "Добротный фильм из 90хСередина затянута, а вот концовка держит в напряжении!"}, {"rating": "8", "text": "A Lot Of FunWith a nice blend of Live Action and Animation, Great performances, and Exciting basketball scenes, Space Jam is worth watching for fans of both Looney Tunes and the NBA."}, {"rating": "7", "text": "A fun Nike commercial that I loved as a child. A film that does not hold up as well as an adult but that is not the target audience. An enjoyable film that says your kids want to see Bugs Bunny taking steroids whilst listening to R. Kelly's I Believe Can Fly"}, {"rating": "8", "text": "Classic 90's movie where anyone and everyone is completely fine with the strange events taking place right before their very eyes. In today's day in age, one could say it brings a cringe but you can't argue against this film being a all time classic."}, {"rating": "7", "text": "90s cheese classic rented it back in the day and loved it now days seems a little rushed."}, {"rating": "7", "text": "A fun and cool movie, but in some scenes, the rhythm of the movie was boring."}, {"rating": "10", "text": "90's Greatest live action - animated crossover filled with good ideas a well rounded story and a conclusion to the greatest nba player that ever lived and the GOAT Michael Jordan. no other movie will ever come close to this masterpiece, even the soundtrack is a timeless classic. this movie is my childhood."}, {"rating": "7", "text": "this is a movie that has a certain charm about it and its not just nostalgia though i do have a lot of nostalgia for the movie i have watched this with my younger relatives and they loved it as well"}, {"rating": "10", "text": ""}, {"rating": "10", "text": "I remember seeing this movie, calling it a fan favorite, featuring Michael Jordan and the Looney Tunes, what a great film, who cares about what the critics say."}, {"rating": "7", "text": "Una película muy divertida para los chicos, tengo un agradable recuerdo de ella."}, {"rating": "8", "text": "Space Jam is a high-energy comedy that mixes live action, animation, cornball storytelling and rowdy humor into an energetic, gee-whiz confection that will probably delight just about everybody."}, {"rating": "10", "text": "how this is not a 10 I do not know. Lebron james may be better than MJ but this is an all time classic. too bad the sixers are going to be the new dynasty and joel embiid is the perfect candidate for the next space jam character if its not Lebron"}, {"rating": "10", "text": "Literally one of the best movies ever made. Most euphoric nostalgic trip ever. Every second an absolute throwback. Tears of joy stream down my face when I watch this 90s masterpiece."}, {"rating": "10", "text": "Perfect Perfect Perfect Perfect Perfect Perfect   Perfect Perfect Perfect Perfect Perfect Perfect"}, {"rating": "10", "text": "Another case where i totally differ with the Metascore. This movie is fun and innovative, and still holds its ground as a true classic to this day. Everyone should watch it at least once."}, {"rating": "8", "text": "It is a very good movie. Space jam is a mix of real-life and cartoon. Bugs Bunny and Michael Jordan are a good team. The songs are amazing and fit with the plot. Every time I see this movie I remember when I'm was a child, it's a part of my childhood. The story is short and simple, but they have bugs bunny and looney tunes and nothing else matters."}, {"rating": "5", "text": "It had a weird plot on slavery, riddled with plot holes and overly sexualized rabbits."}, {"rating": "2", "text": "this film maybe its fun for kids but not for adults this film dont have a storyage +6"}, {"rating": "3", "text": "This does not aged well. It has good animation, but the humor, the story, and the new looney tune character just didn't work. This feels like a product for little kids."}, {"rating": "6", "text": "A classic 90's film that doesn't live up to what I thought it was back when I was a kid watching."}, {"rating": "6", "text": "When you combine a basketball star, Michael Jordan, to team up with Looney Tunes icon, Bugs Bunny, in a goofy and fun adventure, you will get something out of it to remember. Fortunately for 'Space Jam', it is a lot of fun, but unfortunately for the movie, it is too commercial. Angry and ambitious leader, Scratchhammer (voiced by Danny DeVito) is upset that his theme park is losing tourists and that nobody is interested in visiting anymore. He then tells his minions to grab the \"Looney Tunes\" in order to make them be able to attract tourists to the theme park. Meanwhile, we see Michael Jordan (played by himself) trying to cope playing baseball after retiring from basketball. He is then accompanied by Stan Podlack (Wayne Knight) who tries to offer what's best for him. Back at the animation world, the Looney Tunes come across the Scratchhammer's minions who try to blackmail them into working for the theme park. However, the Looney gang come up with an idea to challenge them to a basketball game since they're so small, the Looney gang won't have to lose. But, the little aliens have an idea in which they steal the talents of some big-name basketball players and end up absorbing it hence they inherit the skills of these respective players. The Looney Tunes then see this as an act of trouble, as they are so desperate, they kidnap Michael Jordan and bring him into the animated world. Trying to suspend disbelief, Jordan seems reluctant to help as he hasn't played basketball in a long time, and is worried that this may not be a good idea. 'Space Jam' benefits from a lot of good-natured humor that is fine for young audiences, and is silly enough for adults to even laugh at most of the physical slapstick jokes. It's a whole lot of fun as it moves at a fast pace, and is a visual feast. The big name cameos including Bill Murray himself, are also something adults can enjoy, not forgetting the references to these cameos. However, the movie is very commercial, and at times, some of the acting, even from Jordan himself - who is not an actor, so I shouldn't be harsh - is a little stale. The movie tries its best to combine the basketball superstar and the iconic animated characters, but, it's an uneasy mix of both. I admired 'Space Jam' more than I liked it or loved it, it's good for kids, fun for adults, and harmless overall. But maybe, don't try and shove too may plugs or else, it's just one big commercial."}, {"rating": "5", "text": "\"Space Jam\" was a good movie, because the animation mix with real action, was good, and the interpretation of Michael Jordan was unexpected, but the plot did not like anything."}, {"rating": "6", "text": "In the rap-music, slam-dunk, hysterical tumult of visual clutter that makes up most of Space Jam, the traditional Warner Bros. 'toons get scant attention. In this marriage of corporate logos, the manic little characters serve simply as more names to be dropped. What Space Jam really lacks is respect for an irreverent tradition."}, {"rating": "1", "text": "loved it as a ten year old...not so much now...looking forward to Space Jam 2 :)"}, {"rating": "6", "text": "just one more shot..Space JamIt's slow on a scale of comedy but definitely not on entertainment especially when the cartoon and real world collides which just results into explosion of fun."}, {"rating": "3", "text": "Eye roll. Why did this have to happen? Basketball is entertaining! The Looney Tunes are fun! There is no correlation between the two! I never laughed and groaned basically the entire time."}, {"rating": "5", "text": "I'd honestly say, most of the scenes with the looney tunes characters and even Wayne Knight and Danny Devitos characters are pretty good but apart from that, it's not a good movie. Also, the CGI effects have aged so badly and dont hold up very well, especially the scene where Michael Jordan gets turned into a basketball, oh my god!!"}, {"rating": "5", "text": "A corporate commercial cash-grab that doesn't hold up years later. Michael Jordan is clearly not cut out for the acting gig, and basic slap-dash plot doesn't help matters. The tonal differences in direction between the real-world and Toon world is interesting but nothing special. The film has a nice pace, and the music choices work well for the story. However the film doesn't work as a film, and the Looney Tunes have never been more unfunny."}, {"rating": "6", "text": "I undersatand why people like so much this movie but i really dont like it that much, it´s funny and thats the best thing that the movie has."}, {"rating": "0", "text": "This is a beloved classic, why? This movie comes off as if it were written by a typewriter monkey tweaking out on Acid while watching **** basketball highlights...and not in the good way."}, {"rating": "4", "text": "Space jam 1996I had to see this before seeing the sequel.A conglomeration of many genres done in a looney fashion. For the time it was made, I guess the CGI was good or okay"}, {"rating": "7", "text": "I notice that there are people who like \"Space Jam\", but others who don't so much. While I think it has flaws, I think it is an entertaining and energetic film, not as good as \"Who Framed Roger Rabbit\" and \"Looney Tunes:Back in Action\" but an entertaining movie for Looney Tunes and basketball lovers(I admit I am more of a Looney Tunes fan). The story is a very nice idea, but there were parts when it was rather juvenile, likewise with some of the dialogue. Michael Jordan is a great athlete, and his skills are put to great use, but his acting isn't as impressive, it seems as though he is playing himself at times. Flaws aside, it is very funny with some great jokes and constant energy, and excellent supporting characters. Bill Murray, wearing clothes that you shouldn't ideally wear on a golf course, steals every scene he's in, and Danny DeVito is great fun as evil Swackhammer. The Looney Tunes are hilarious, especially Daffy, and technically with all the radiant colours the film works wonders. Overall, I like \"Space Jam\", it isn't Oscar worthy material, but it is fun to watch. 7/10 Bethany Cox"}, {"rating": "5", "text": "I have been watching this movie long before Metacritic can even make this a page, but I only managed to write a review of this movie because someone managed to mix the main theme of this movie (named Space Jam) with the classic remix of Rooftop Run seen on Sonic Generations. That attempt alone proves whether I should bring love to either the movie or the soundtrack thanks to the popularity of this movie even after 20 years of existing. Looking back to this movie now, it does get its major flaws from the attempt to bring the Looney Tunes to theaters. The only things that are nearly perfect compared to all the flaws in this movie are, of course, Lola Bunny's appearance and personality and the soundtrack alone. This movie is nearly harmless, which means this movie has its target audience set to the kids for easy positive reviews, and the fun wears off after the first time you see this movie. It also may not be the classical comedy you have seen on regular Looney Tunes cartoons, but it makes up a good chunk amount of laughs which unfortunately only last once or a few amount of times."}, {"rating": "6", "text": "Pure 90s cheese.  Nothing extravagant, but it is fun enough to pass the time."}, {"rating": "4", "text": "So bad it's good time!Ditemi quel che volete, ma questo è un pessimo film, ma anche una pubblicità a dir poco geniale (oltre ad essere estremamente nostalgico per me).Consigliato? Sì, ma credo che buona parte di voi l'abbia già visto."}, {"rating": "8", "text": "Classic Nostalgic and an awesome movie, The looney toons with basketball and bill murray it was a killer combo. The story was short and simple with the amazing animation and reality blend and amazing music, The references were awesome like \"mickeymouse company to name such thing\" said by bugs, The pulp fiction entrance at game it was awesome and The Wb inc property stamp by daffy it was good, The starting intro of usual looney toons music and the 3d and 2d world entrance in underground the similar entrance like intro it was awesome, The starting with micheal and his career shift to baseball and the stan as awesome fat man, The moron mountain exhibition icon search and fixed by taking looney toons as slaves the 5 members threatens the gang and bugs being bugs challenging them to play basketball judging by there height then the whole NBA players ability theft by 5 members and the micheal's involvement with looney toons for winning match the training and fun basket ball game by all characters was amazing, The michale's shoes getting scene at house by bugs and daffy the children of michal and the dog it was amazing sequence and then the ending game were the looney toons are lossing at 1st half and in 2nd half the bugs idea of secret recipie and it works for team then the whole game of dominating until the final 10 secs the teams about to lose, the substitute stan replace with bill then at last the stretched basket by micheal for win it was an awesome end, Overall it was an nostagia ride and an awesome movie."}, {"rating": "6", "text": "Una buena película con Michael Jordan; la trama es decente, la animación es buena y las escenas del partido de baloncesto son muy divertidas; la recomiendo si te gustan las películas que combinan live-action con animación."}], "recommendations": ["looney_tunes_back_in_action", "over_the_hedge", "madagascar", "robots", "rio_2", "madagascar_escape_2_africa", "puss_in_boots_the_last_wish", "rio", "penguins_of_madagascar", "the_angry_birds_movie", "ice_age_the_meltdown", "flushed_away", "bolt", "hotel_transylvania_3_summer_vacation", "sonic_the_hedgehog", "jumanji_welcome_to_the_jungle", "trolls", "spies_in_disguise", "wreck_it_ralph", "shaun_the_sheep_movie", "despicable_me", "kung_fu_panda_2", "kung_fu_panda", "scoob", "the_ant_bully"]}