{
  "id": 24,
  "title": "Space Jam: A New Legacy",
  "starring": [
    "LeBron James",
    "Don Cheadle"
  ],
  "runtime": 115,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Science Fiction"
  ],
  "description": "When LeBron and his young son Dom are trapped in a digital space by a rogue A.I., LeBron must get them home safe by leading Bugs, Lola Bunny and the whole gang of notoriously undisciplined Looney Tunes to victory over the A.I.'s digitized champions on the court. It's Tunes versus Goons in the highest-stakes challenge of his life.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5bFK5d3mVTAvBCXi5NPWH0tYjKl.jpg",
  "categories": {
    "plot": 2.142857142857143,
    "acting": 1.4736842105263157,
    "ending": 0.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 1.4,
    "funny": 1.1428571428571428,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Poor acting. It was akward and cringy. I turned it off halfway. What’s style points basketball"
    },
    {
      "rating": "0",
      "text": "What a huge disappointed when the original was so good.  Bad acting in addition to weak plot."
    },
    {
      "rating": "2",
      "text": "The first movie was a shoe commercial and it still felt like less of a corporate synergy fest. It had a lot of things helping it's mediocrity: the soundtrack (quad city dj's epic opening), it had the most beloved athlete in the world, the novelty of the animation blended into real life. It was a commercial the same that the Lego movie is a commercial. This new movie has none of those elements and it was painfully cringe at times."
    },
    {
      "rating": "0",
      "text": "I love the original one but this one ... come on what a pile of trash. Go watch something else don0t waste your time here."
    },
    {
      "rating": "1",
      "text": "Advertising disguised as a movie. One of the most soulless, corporate, empty films ever made."
    },
    {
      "rating": "0",
      "text": "A really bad, super long, WB commercial. Makes no sense that its even named space jam."
    },
    {
      "rating": "1",
      "text": "If you look at the structure of the movie or lack of it  misses the mark completely.Has little to no humour in it the movie dragged out and lebron was socially awkwardI wanted to love this movie so bad but all it ended up being was a huge mess and a huge shameful plug for WB and blatant advertising."
    },
    {
      "rating": "3",
      "text": "Really disappointed that LeBron James did not effort to act good in this picture. Even the first one was more comic than this one. There little bits funny, but the picture is really long."
    },
    {
      "rating": "3",
      "text": "A marketing product of the lowest level.I think the little that was invested in the thinking of this film during its conception was, ''Let's get everything stuck with as much as we can and let's call it a day.''There's no more.Well, the animation is good, but that doesn't really help at all.Maybe for the marketing department it will be something they could call a success, but the only reason this film exists and has more attention than it deserves is because the 90's film has a strange and undeserved status of a classic.Otherwise this would never have been created.Perhaps it influences that after Jordan, LeBron James is an equally important figure for the NBA, but not even his presence, fame and poor performance save this debacle.And the Looney Tunes?They're just the animated characters that got just a little more attention.I'm all for saving the theaters, but thank god I didn't pay a ticket for this."
    },
    {
      "rating": "0",
      "text": "This movie is a complete and total disgrace. While the original was no masterpiece, this was a joke of a movie with a lazy creep (LeBron) playing a bored jerk who clearly didnt want to be in this \"movie\""
    },
    {
      "rating": "0",
      "text": "This is the worst movie I've ever seen. It's astounding how low effort and unfunny this movie is. I'm actually  baffled at how something this horrendous was conceived and released. There is literally nothing good I can say about this movie. No one involved with this movie cared and it's blatantly obvious."
    },
    {
      "rating": "3",
      "text": "When you see a movie with 2 directors and 6 screenwriters, you can figure things will be a mess. That many different voices can’t be a good sign of a unified creative approach. Sadly, this lives down to those expectations. LeBron James is as stiff as his predecessor Michael Jordan in this reboot of the 1996 film. He and his young son (played by an actor) get trapped in a digital world where they’re pitted against each other by AI (Don Cheadle, desperately trying to bring the funny). James enlists the classic Looney Tunes characters for his team, which should be where the comedy comes, but alas, their wisecracks never land…they just play to their physical gag stereotypes. Not only is the movie never funny, but in an attempt to add a family friendly heart, there’s too much time wasted on the father/son relationship. Young’uns will be able to enjoy the animated whimsy, but anyone with any standards will just yawn or stop playback early."
    },
    {
      "rating": "0",
      "text": "You know, I was expecting it to be bad... but WOW, this movie is just straight up garbage. It's worse than I thought it'd be! It's just so all over the place. The original Space Jam did a good job at retaining a Loony Tunes feel despite having real actors. But this doesn't even feel like Loony Tunes. This movie was done by a completely different director and it really shows. This director paid zero homage to the original movie and did his own thing. And for what it's worth, I enjoyed the original Space Jam."
    },
    {
      "rating": "3",
      "text": "If this is where movies are going, then I'm deleting my account.When Martin Scorsese said Marvel movies are theme park rides, this doesn't just apply to Marvel, but movies like this that throw in characters from different movies and put them in the background, as a way to advertise Warner Bros. World theme park and HBO MAX. I spent more of my time looking at the background just to see how many characters the studio put in, while I wasn't watching the actual game. Very distracting. I nearly fell a sleep watching this.It will be interesting to see people try and defend this ****"
    },
    {
      "rating": "1",
      "text": "Space Jam 2, aunque a decir verdad no se porque se llama así porque hay nulo espacio y nulo basquet ball. Resultó ser algo infumable, a tal grado que no pienso hacerles perder el tiempo leyendo sobre esta bofetada a los espectadores, Reparto 3/10, Guión 1/10, Visual 7/10.Comentario final, honestamente no se la recomiendo a nadie, si quieren ver algo medianamente decente del estilo, miren Pixels, que no es la gran cosa pero le da 1000 vueltas a esta película."
    },
    {
      "rating": "0",
      "text": "I’m glad I didn’t pay to watch this trash in the theater. Unfortunately, I can’t have the time completely wasted watching this trash. To everyone involved in making this, please find another career because you suck at making films."
    },
    {
      "rating": "0",
      "text": "Lebron James acting in this was sooooo bad. He destroyed this movie with his performance!"
    },
    {
      "rating": "1",
      "text": "Obnoxious and tone-deaf trash. It's less about the basketball and Looney Tunes; and more about shoving every single IP in your face like an annoying hyperactive child. IPs that are either inappropriate for kids or ones that they wouldn't understand (Pennywise the child-murdering clown in a kid's movie...great idea). The original Space Jam isn't a masterpiece but it's fun and has heart and gives the Looney Tunes time to shine with genuinely funny moments. This just feels absolutely soulless."
    },
    {
      "rating": "3",
      "text": "The only good thing about this movie was Daffy Duck. Literally everything else was garbage."
    },
    {
      "rating": "0",
      "text": "Lebron not only can't carry a basketball team, but he can't carry a movie either lol"
    },
    {
      "rating": "0",
      "text": "Is a boring movie with a terrible actor. Dissapointed from begin and ending"
    },
    {
      "rating": "1",
      "text": "This \"movie\" would have been better if Pepe Le Pew was in it. But once again sjw politics ruined everything. Aaaaand I'm sorry but LeBron is no Michael. Period."
    },
    {
      "rating": "0",
      "text": "This movie was a huge disappointment. I kept waiting for some ground shattering societal commentary from my favorite b ball player and twitter commentator. But LeBron didn't deliver and I was saddened by this."
    },
    {
      "rating": "0",
      "text": "Lebron James allows to be humilliated along The Looney Tunes. The movie is way beyond bad. No dialogues, no sfx, no jokes, no acting, no soundtrack. I dint expect anything, yet i was dissapointed."
    },
    {
      "rating": "0",
      "text": "This movie has no real soul. Everything is force, there is no moments that actually feel like the original. With in the 1st 5 mins you will have seen and heard children and adults cussing for no reason. The og movie 1st 5 mins is Micheal judan dad saying you can do anything.  The opening of this movie show what it is a spoiled brat with no hopes or dreams, just give me you money, a classic case of cash grab."
    },
    {
      "rating": "0",
      "text": "I expected a Space Jam movie. Very disappointed. I guess most sequels can be disappointing."
    },
    {
      "rating": "0",
      "text": "Space Jam: A New Legacy is perhaps the worst entertainment that has ever been created - 0 stars."
    },
    {
      "rating": "0",
      "text": "Absolute garbage, anything that Lebron touches is to make profits off the Chinese"
    },
    {
      "rating": "0",
      "text": "God awful player for a movie that shouldn’t cast a fowl player like him. Sad and won’t stan."
    },
    {
      "rating": "0",
      "text": "Terrible movie. I tried hard to like it. I had the first one and didn't meet the expectations."
    },
    {
      "rating": "0",
      "text": "The Story is utter trash and hard to follow. most characters are stupid and implausible, all in all big disappointment"
    },
    {
      "rating": "0",
      "text": "Not even close to what the classic Space Jam movie was. Such a huge disappointment."
    },
    {
      "rating": "0",
      "text": "I will never watch ANYTHING with LeBron James.  He hates my daughter because of her skin color.  Shame on these film makers destroying a great property."
    },
    {
      "rating": "1",
      "text": "So I waited to see if this was even worth watching and of course it wasn't. If you can watch it for free I'd tell you not to because they should be paying you to test out this disappointment. This movie had it coming with making Lola less attractive (and attacking people for it great job!) Taking out a character because weak reason that even a child can destroy, changing the already corny plot, making this movie more diverse ( by that they meant putting a ton of black actors and barely anything else that's diversity right?) And finally putting Le James and knowing people don't like the guy was the biggest blow they could've done. Hire anyone besides a person who isn't a actor it's like hiring a lawyer who isn't a lawyer or a plumber who isn't a plumber because it'll go well right? What people forget is the damage they do to the characters and everyone involved.They lost money no way are they using the loony toons again in something. James will get dunked on by everyone for failing to act and making a decent movie. Black actors will look bad and say \"it's because something something racism\" No that doesn't work that way. Just because you bombed doesn't mean it's a race problem just make a freaking good movie. The real problem with this movie is how it does everything wrong and doesn't get a cancel mob on it. Media in general is killing off every single thing that was good and now we get this \"diversity\" woke trash (again hiring 80% or more black cast isn't diversity its the same problem but the other way around) hope you like Anime andKorean webtoons because thank God they know what sells!"
    },
    {
      "rating": "0",
      "text": "Speaking of living in the shadow of the greatest player of all time… lebron is no MJ on the court or in this terrible movie."
    },
    {
      "rating": "0",
      "text": "This movie is so bad can i give -1 stars ? Lebron try but nothing compares with the original MJ version this one sucks, is stupid and not funny at all ."
    },
    {
      "rating": "1",
      "text": "Felt like an ad more than a movie. Having seen the original in the theater, was eagerly awaiting this sequel, even watching at home. The acting was poor and too long. Will there be a third?"
    },
    {
      "rating": "1",
      "text": "An absolute shameless piece of Warner Brothers marketing that doesn't even bother to have some good jokes to make it more bearable."
    },
    {
      "rating": "1",
      "text": "Just a god awful movie. Here’s the plot: Lebron was a bad dad, and changed. All while WB promotes itself for 90 mins. Do not waste your time on this disgraceful film."
    },
    {
      "rating": "3",
      "text": "Pros:- the film has a good mood, it manages to make us laugh.- Visually it is very beautiful.Cons:- Mixed up the present time of electronic games with basketball.- They made fun of Michael Jordan, instead of the WB being more endearing and trying to convince him to have a cameo in the film.- WB bragging about what they have (that's why the film was approved), they put in a lot of unnecessary stuff they have. Server Verse, because it's fashionable to put a multiverse and there's no creativity for new things.- I consider this film to be anything but Space Jam. They used the name only as bait to catch people.Worst:Very hypocritical movie. Send the message to be ourselves, but change the look of the less sexualized Lola Bunny.Sexualized.... A current world where sexualization is exposed everywhere: fluid gender, non-binary, homosexuality, women showing off on the internet naked, girls cosplaying in tiny clothes to gain a following on social media, women showing off intimate parts on Tik Tok to earn likes and money... But the look of a 1996 cartoon is not good. 1996 was better than 2021. Do you know why? The minority had access to the internet. Today, with globalization, everyone can communicate: those who think and those who have the brains to decorate.They sealed Pepe le Pew accusing it of being a harassment cartoon, instead of the fabulous geniuses of the WB board putting Pepe le Pew just romantic but without grabbing Penelope.They almost sealed the Ligeirinho, accused of racism and prejudice against the Mexicans. But building a wall to separate the United States from Mexico and killing anyone trying to cross the border is very ethical.Society is preventing society itself from living. It will get to the point where everyone is lying vegetating on top of a bed. If you try to walk, you're going to be bothering someone."
    },
    {
      "rating": "2",
      "text": "After watching this film, it appears that you'll have the urge to miss watching the original Space Jam in theaters."
    },
    {
      "rating": "2",
      "text": "Gives Wonder Woman 1984 a run for worst movie of the year. Near unwatchable. The heartless bang bang cameos were just gratuitous and pointless. Terrible acting, terrible script, and why does Bugs Bunny not sound like Bugs Bunny anymore?"
    },
    {
      "rating": "1",
      "text": "The old Space Jam, show a charismatic Michael Jordan, who is a good father, and tries to help tha Looney Tunes characters to win a basketball game, this new movie show us a despicable father as Lebron James, even seeing that his son don't want to be like him, forces him to play basketball, even his kid showing that a young age he is a genius in programming, this movie triggers so many bad memories in my mind, that's incredible someone inside Warner, thought that this movie was a good idea Now everybody outside US simply hates Lebron James for no reason, also the animation is poor, that looney tunes characters don't have flavor, the movie is bloated as Synder had directed it Simply go watch the old one, is still a good vibes movie"
    },
    {
      "rating": "1",
      "text": "Pensé que seria una buena secuela de Space Jam, pero lamentablemente este pelicula no me gustó. No termine de verla y salí de la sala de Cine al igual que otras personas. La historia es un desastré, la actuación no se nota bien. Los modelos 2D están bien, pero los 3D de los Looney Tunes son un desastre y por razones politicamente correctas retiraron a Pepe Le Pew, hecho que se pudo apreciar."
    },
    {
      "rating": "5",
      "text": "A film that is very superficial and stupid in terms of story and beautiful in terms of CGI .... It is so confusing that even he's doesn't know what he's wants!"
    },
    {
      "rating": "1",
      "text": "It just shows how desperate lebron is to try and be MJ. Bad acting, terrible concept, and so much forced bad references."
    },
    {
      "rating": "1",
      "text": "I understand this movie was made for kids however as a parent I am the one who has to endure these kid movies. I don’t know about some of you parents if my kids want me to spend time with them watching a movie then I’m spending time with them. Not only that with all that’s going on I wanted to be right there to make sure they weren’t trying to push some ideas onto my kids. With that being said this movie was terrible. I gave it a chance I really did. Don Cheadle carried the movie which says a lot since Lebron was the main character. I cringed the whole time they referred to him as a king. My kids actually thought he was a king and I of course had to explain to them that he in fact wasn’t. The voices of the Looney Tunes sounded like cheap knock offs. Zendaya being “a great actress” couldn’t even pull off a cartoon voice as always because she can’t act. The only funny parts about the movie was when they referenced GOT “Winter is coming” and when Daffy thought Michael B. Jordan was Michael Jordan. Other than that my kids got bored and we put on the Space Jam with Michael Jordan. They ended up having more laughs with that one. They’ve been watching that one on repeat ever since. Overall I give this a generous 1 for the king."
    },
    {
      "rating": "2",
      "text": "This movie didn't quite have the charm of the original 1996 Space Jam. This movie felt like it was more of an advertisement for Warner Bros products than a movie about Basketball. The Looney Tunes were great but I felt that they were barely on screen. LeBron's acting was flat but it was goofy and I did feel he tried his best. Overall the movie was a movie of references and LeBron James. I wish there was more Loony Tunes characters than the real life ones."
    },
    {
      "rating": "1",
      "text": "Sucks. Original was so much better. Lebron James is not an actor. Be original. He wants to be Jordan so bad."
    },
    {
      "rating": "1",
      "text": "Most of the characters are unlikable, especially LeBron. Gets inflated to two hours and the last 45 minutes dragged on, and not to mention this movie gets dragged down by all the forced references to other better Warner bros movies and shows. The only good parts were Don Cheadles performance, daffy ducks introduction and Lola bunny’s introduction. This movie is not very enjoyable and overstays its welcome."
    }
  ],
  "recommendations": [
    "doctor_strange_in_the_multiverse_of_madness",
    "teenage_mutant_ninja_turtles",
    "the_smurfs",
    "pixels",
    "dolittle",
    "yogi_bear",
    "free_birds",
    "alvin_and_the_chipmunks_chipwrecked",
    "diary_of_a_wimpy_kid_the_long_haul",
    "the_emoji_movie",
    "coming_2_america",
    "uglydolls",
    "home_sweet_home_alone",
    "spy_kids_all_the_time_in_the_world",
    "national_treasure_book_of_secrets",
    "dark_phoenix",
    "dragonball_evolution",
    "minions",
    "red_dawn",
    "the_twilight_saga_breaking_dawn_part_1",
    "night_at_the_museum_battle_of_the_smithsonian",
    "kangaroo_jack",
    "transformers_revenge_of_the_fallen",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "the_lego_movie"
  ]
}