{
  "id": 4298,
  "title": "Spaceballs",
  "starring": [
    "Bill Pullman",
    "Rick Moranis"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Science Fiction"
  ],
  "description": "When the nefarious Dark Helmet hatches a plan to snatch Princess Vespa and steal her planet's air, space-bum-for-hire Lone Starr and his clueless sidekick fly to the rescue. Along the way, they meet Yogurt, who puts Lone Starr wise to the power of \"The Schwartz.\" Can he master it in time to save the day?",
  "releaseYear": "1987",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o624HTt93iIJIc1Sg5hNkDTnk5l.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 9.0,
    "ending": 5.833333333333333,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 7.82051282051282,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I love this movie. I must have watched it at least 25 times. First it was a comedy, then I came to appreciate Mel Brooks' creation as a work of art. For those of you who like an incredibly clever (with some slapstick) comedy, I will send out my recommendation for this movie."
    },
    {
      "rating": "8",
      "text": "i grew up loving the flat out goofyness of mel brooks movies . seeing this as a kid in the theaters was really funny. brooks does a great job lmapooning star wars . rick moranis how ever steals the show as dark helmet who zaps people in the crotch when you piss him off... LOL!  if only they made the sequel \"space balls 2 the search for more money\""
    },
    {
      "rating": "9",
      "text": "This movie is one of the few comedy films that will keep you laughing from beginning to end, and when it's over, you'll feel like time went by at \"ludicrous speed\"."
    },
    {
      "rating": "10",
      "text": "Possibly the funniest movie on Earth. With enough gags and skits to keep you laughing on end, this is a true work of art. Mel Brooks, may your legacy of comedic movies always be remembered."
    },
    {
      "rating": "10",
      "text": "This is one of the funniest movies of all time. A true classic. I do not know what critics think, but they are truly wrong about this one. Funny all the way through, and even a little action. A little romance, but mostly comedy. Not one joke is too over the top, and not one joke isn't funny. Simply my favorite comedy yet."
    },
    {
      "rating": "9",
      "text": "First, let me say that I am a huge Mel Brooks fan. Movies like \"Spaceballs\" are the reason why. from the time the movie began all the way up until the final credits rolled, I did nothing but laugh hysterically. Some of the jokes do border on crudeness, but, that doesn't stop them from being an absolute scream. The best performance in this movie comes from the late, great John Candy as Barf, an obvious takeoff on Chewbacca. Rick Moranis is also very funny as a short Darth Vader-like character. The movie tends to lose a little momentum near the end. But, because of a very funny script and some great actors, I am willing to forgive this one minor flaw. For anyone who likes a good, cheap laugh, I highly recommend \"Spaceballs.\""
    },
    {
      "rating": "8",
      "text": "Frickin funny, but History of the World and Blazing Saddles."
    },
    {
      "rating": "8",
      "text": "Back when Spoof films knew what they were doing came this little gem. This mocks everything STAR WARS-y and TREK-Y and does not take itself seriously. There are some really stupid, ridiculous and fun moments and the cast is pretty much perfect. Dark Helmet being known for being the comic character from Honey I Shrunk the Kids and Ghostbusters means the bad guy really is just funny.\rIf you have any knowledge of the films it is mocking I would be surprised if you don't like this film. Yes the ending is not great but it doesn't matter. How else would you end a movie like this? This is a film that will always be in my movie collection and I will watch over and over and show my kids. I just wish that modern spoofs could have as much skill as with this film."
    },
    {
      "rating": "8",
      "text": "While it's certainly not the most sophisticated or subtle satire, all flaws are forgiven for the simple fact that this is about as funny as a comedy can get."
    },
    {
      "rating": "10",
      "text": "Screw the critics. This movie is awesome and incredibly fun. I remember I watched this movie in nineties, and that was even before I saw Star Wars, and I laughed very loud."
    },
    {
      "rating": "9",
      "text": "The movie is a spoof of an extremely popular sci-fi movie series. It's going to be somewhat bad. Get over it. But this one was a whole lot better than I expected. It was really funny, with a lot better budget than the other parodies that I've seen."
    },
    {
      "rating": "8",
      "text": "I enjoyed seeing Spaceballs on blu, not having watched it since it hit the theatres when I was a teenager. Though unlike Brooks' masterpieces, the humour is sometimes forced here, but he's smart enough to surround himself with a fine supporting cast and making sure the special effects and set design are at least as good as, if not greater than, the original films he's lampooning. Looking at his films shows how much better his efforts were than any genre spoofs since."
    },
    {
      "rating": "8",
      "text": "Space balls is a Mel brooks movie, so it will definitely be wacky. It is a very clever, wacky and funny parody movie. It takes parts from different movies such as alien or Indiana Jones, then adds a wacky twist onto it. Abioustly though it is souly based around Star Wars. The comedy is quite ridiculous, so if you don't like wacky comedy's this definitely not for you. Also if you don't like parody's then this yet again, isn't for you. Overall it is a worthwhile watch."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious! It's non-stop action and non-stop laughs all the way through! It's probably not recommended for kids as there is a bit of suggestive themes here and there but the movie's definitely worth seeing if you're older! This is coming from a Star Wars fan."
    },
    {
      "rating": "7",
      "text": "Mel Brooks' hilariously quirky Spaceballs is everything you expect (and want) in a Star Wars spoof: it's funny, it's random, it's weird, and it's fun!"
    },
    {
      "rating": "8",
      "text": "A hilarious and underrated Mel Brooks comedy. I was literally holding my sides with laughter and though it's certainly no \"Blazing Saddles\" it's far from a bad movie. The scene where they suggest a sequel called \"Spaceballs 2: The search for more money\" is one of the wittiest jokes Mel Brooks ever came up with. As a huge fan of both Star Wars and Star Trek, I can easily say this is a great and witty parody that will appeal to fans of both franchises."
    },
    {
      "rating": "6",
      "text": "Mr. Brooks's vision of ''Star Wars'' and its underlying silliness cannot help but wear thin. But Spaceballs has none of the aggressively unfunny humor that has marred some of Mr. Brooks's other recent efforts, and its spirits remain consistently high."
    },
    {
      "rating": "9",
      "text": "Star Wars and Star Trek all mixed together into one hilarious comedy hit."
    },
    {
      "rating": "8",
      "text": "I'm not sure how to say this aside from this is my favorite bad movie. It's so overly bad that it is almost impossible not to laugh. Rick Moranis just steals the show. It's almost like they went out of their way to cast the worst possible choices for the roles, and funnily enough it works like a charm. Overall a fun movie that I'll be watching for decades to come, because the older it gets the worse it gets and the worse it gets the funnier it is."
    },
    {
      "rating": "3",
      "text": "There are good satire comedies and then there are bad satire comedies. This is one of the bad ones. With little left to recognize from star wars in the film and probably the worst physical humor ever demonstrated on screen, this isn't silly it's just stupid. I remember laughing when I was younger at this film, guess its only funny to five year olds because this was a complete waste of time!"
    },
    {
      "rating": "2",
      "text": "Charmless, boring and unfunny. It's ninety minute running time feels like two and a half hours. The only memorably amusing moment was the \"virgin alarm\"."
    },
    {
      "rating": "3",
      "text": "A quite poor spoof in terms of the jokes you can put on star wars, breaking the fourth wall often works in spoofs but in this case, no.....it's a shame because the film was funny to begin with until dark helmet appeared."
    },
    {
      "rating": "1",
      "text": "If, before my time is come, i don't see \"Super Mario Brothers,\" then \"Spaceballs\" is my Worst Movie Ever. I will make my explination brief: Mel Brooks made a Star Wars spoof 10 years following its release (and 8 or 9 after the time was appropriate). he spun a yarn about unintimidating people-looking aliens, commandeered by Rick Moranis and Mel himself, that wanted to steal another planet's air, the princess of which was getting married. She runs away with her dumpy-looking feminist robot and escapes with a loner in a Winnebago and his uninspired Mawg; parts man and canine. stuff about Yogurt, Semitic master of the Schwartz and cynical marketing, is said; we see a repulsive pizza-resembling monster; Mel shows his lack of faith in the material with riffs of other sci-fi (and, in the one gag saving this from a goose egg rating, Michigan J. Frog), the production value is rock-bottom; the whole thing is unfunny and ends with a twist I didn't care enough about to see coming; for the time being, Star Wars was dead, and Mel Brooks was holding the smoking lightsaber."
    },
    {
      "rating": "5",
      "text": "Call me whatever you want, but Spaceballs is not that funny. It's painful to watch and relies on toilet humor and bad jokes as backbone. Just as I said in my review of Scar MoVie, the whole spoof genre is collapsing, thanks to movies like these."
    },
    {
      "rating": "9",
      "text": "This is one of the movies I think of when I think of the golden age of spoof movies. It's a very silly, enjoyable movie that I keep coming back to, and like many others, I don't understand why it got a mixed critical reception."
    },
    {
      "rating": "9",
      "text": "The amount of memes coming from this movie, still nowadays in the 2020's, says enough. As far i'm concerned, this is a cult classic. And all who disagree might want to grab their private parts otherwise Lord Helmet will melt your b*lls away!"
    },
    {
      "rating": "10",
      "text": "One of the best spoof movies of all times and a testament for Mel Brooks humor and creativity. The movie is mainly a parody for the original Star Wars trilogy. With side jokes for Star Trek, Alien, Transformers and Plant of the Apes. It has so many good references and jokes that you will practically not stop laughing. The actors are brilliant parodies. You have Dark Helmet which is as powerful and feared as Darth Vader but played by the mismatched Rick Moranis . For Yoda you have Yoghurt (Played by Mel Brooks himself) who taught the hero to use the Schwartz (Force) and the secrets of Merchandising. For the heroes you have Lone Starr (Luke and Han in 1 person), Barf (Chewbacca) and Princess Vespa (Leia). All of them are hilarious over the top parodies of the stereotypes of their Star Wars equivalents. You will finally know why the foot soldiers are so incompetent and how the bad guys use piracy of movies for their advantage. Also you will know that warp is not fast enough, an alternative use for stunt doubles and a good pun about one loan shark / fast food chain. This movie is the source of so many tropes and jokes. But don't take my word for it. Just watch this movie and be entertained. It is at least better and more entertaining than the Last Jedi and The Rise of Skywalker."
    },
    {
      "rating": "5",
      "text": "A movie scratchily made to attract people's laughter. We basically get it... we love this movie and all, but this movie felt dated don't you think? As some sort of Star Wars, Star Trek, Alien, and Planet of the Apes spoof and released in 1987, it sorta felt dated."
    },
    {
      "rating": "10",
      "text": "I love this movie. I must have watched it at least 25 times. First it was a comedy, then I came to appreciate Mel Brooks' creation as a work of art. For those of you who like an incredibly clever (with some slapstick) comedy, I will send out my recommendation for this movie. Although it does make time delays for the new Star Wars movie."
    },
    {
      "rating": "8",
      "text": "Absolutely HilariousSpaceballs may be simple, But it’s humor is f*cking excellent."
    },
    {
      "rating": "9",
      "text": "Classic Movie, when filmmakers didn't bend the knee to SJWs. My kids love this movie every time we see it."
    },
    {
      "rating": "10",
      "text": "an absolute classic. funny, witty, and sometimes just plain stupid in all the best ways. a must watch for a star wars fan"
    },
    {
      "rating": "8",
      "text": "It's just funny to the core. It made fun of 'Star Wars' and I'm actually pretty satisfied that they did. If I watched it before 'Star Wars Episode VIII: The Last Jedi' came out, I would've been pretty offended, but I don't regret watching it after the whole mess happened."
    },
    {
      "rating": "10",
      "text": "A classic Mel Brooks movie that does a great job on doing a parody of the Star Wars original trilogy. Growing up watching Mel Brooks movies with the family, Spaceballs is, and always will be, one of the greatest."
    },
    {
      "rating": "10",
      "text": "This movie is funny, to say the least. the movie is a must-watch for anyone who likes star wars"
    },
    {
      "rating": "8",
      "text": "It's miles better than the Sequel Trilogy, the first 2 Prequels, and Rogue One. Very entertaining, witty, and charming, that is what a Star Wars movie should be like."
    },
    {
      "rating": "10",
      "text": "I love this movie. It is easily my all time favorite because it makes fun of stars wars in a hilarious way. It is very funny. 10 for sure."
    },
    {
      "rating": "10",
      "text": "What happens when you have Mel Brooks make a parody of Star Wars? You have Spaceballs! Loveable characters like Barf,  Yogurt and Dark Helmet. Great cast with John Candy, Mel Brooks & Rick Moranis. This movie is lots of fun, if you haven't watched it already, what are you waiting for?"
    },
    {
      "rating": "8",
      "text": "One of the world's greatest works of comedic genius is this. In my opinion, Spaceballs is Mel Brooks' best movie. A successful slapstick comedy suitable for all ages. And a fantastic cast makes the Space humour come to life. Must I say more?"
    },
    {
      "rating": "10",
      "text": "HOBBIES  CARD GAMESHow to Play UNOBy DANIEL NATIONS Updated on 03/27/20 Pin Share EmailHappy friends playing game of cards UNO Prostock-Studio / Getty ImagesThe rules to UNO are simple once you get used to them. We've also included a few common house rules to spice up the game.UNO is a fast-paced card game played similar to Crazy 8s that includes special cards that ramp up the fun. Just like another game by the makers of UNO called Phase 10, UNO is suggested for ages 7 and above, but younger kids can still enjoy the game. It can even be a good game to reinforce numbers and colors.The ObjectiveThe goal of UNO is to be the first person to play the very last card in your hand. The fun of UNO is the requirement to yell \"UNO!\" when you are down to that last card. When playing multiple games, the winner is the player with the lowest score.How to Set up the GameThe dealer is determined by shuffling the deck and each player drawing a card. The player with the highest number on their card is the dealer. If a player draws a special card that does not have numbers, like the Wild card, the player should return that card to the bottom of the deck and draw a new card. If two or more players draw the same high number, those players should return the cards to the deck and draw new cards until one player draws higher than the other(s).After the dealer is chosen, each player is dealt seven cards. The remaining cards are placed face-down. These cards are called the \"draw pile.\" The dealer takes the first card on the draw pile and places it face-up next to the draw pile. If this card is a Wild or Wild Draw 4 card, that card is placed in the middle of the draw pile, and a new card is drawn.The player on the dealer's left is the first person to play unless the initial card flipped over is a Reverse card. The Reverse is considered active even if a player did not play it, so it would be the person to the right of the dealer.A common house rule is to alternate dealers when playing multiple hands of UNO, moving the dealer to the person on the left in a clockwise direction from the last dealer. When playing with younger children, an alternative to drawing for the highest card is to allow the youngest child to be the initial dealer.How to PlayThe gameplay of UNO consists of each player taking turns that consist of either matching the upmost face-up card in the stack or playing one of the special cards.At the beginning of their turn, a player can match either the number or the color of the face-up card with a card in their hand. If the card is matched, play continues to the next player.If the player does not have a matching card but has a Wild Card or Wild Draw 4 Card in their hand, they can choose to play the card. Wild cards allow the player to choose any color.The player must take the topmost card from the draw pile if they cannot play a card from their hand. If the drawn card cannot be played, they continue taking cards from the draw pile until they can play a card.The player is not forced to play a matching card from their hand. They can choose to play a Wild card or take a new card from the draw pile. If the player elects to draw cards, they must continue drawing until they receive a playable card. They cannot play a card that was originally in their hand after choosing to take a card from the draw pile.After the player matches the face-up card, play continues to the next player. At the start of the game, play continues to the left of the player in a clockwise direction. As the name implies, the Reverse card will change the direction of the next player from left-to-right or right-to-left.A Reverse card played in a two-person game acts like a Skip card.If the last card is taken from the draw pile, all of the cards that have been played except the topmost face-up card should be shuffled and used as a new draw pile. This can continue as many times as it may take for someone to finally run out of cards in their hand.Special CardsThe fun of UNO is all of the special cards that can change the game in a heartbeat. These cards add a certain amount of strategy to a game that would otherwise be the luck of the draw. In some decks, these cards are only marked with a symbol. Other decks also spell out the special card's name.Reverse: This card reverses the order of play, switching it from left-to-right or right-to-left. It's great to use to stop a player from going out of cards. Reverse uses a symbol with two arrows going in opposite directions, one on top of  new cards for not saying he draw pile until they can"
    },
    {
      "rating": "8",
      "text": "One of the best parodies of Star Wars ever made, though you need to see the original Star Wars trilogy (4,5,6) to see its true brilliance. The whole movie is full of brilliant puns, gags, and parodies of the original Star Wars trilogy, right down to the characters being actual parodies of Star Wars characters."
    }
  ]
}