{
  "id": 4810,
  "title": "Spanglish",
  "starring": [
    "Adam Sandler",
    "Téa Leoni"
  ],
  "runtime": 130,
  "genre": [
    "Comedy"
  ],
  "description": "Mexican immigrant and single mother Flor Moreno finds housekeeping work with Deborah and John Clasky, a well-off couple with two children of their own. When Flor admits she can't handle the schedule because of her daughter, Cristina, Deborah decides they should move into the Clasky home. Cultures clash and tensions run high as Flor and the Claskys struggle to share space while raising their children on their own, and very different, terms.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1qwj0wKFsDoC3w2i2kDhXY330TU.jpg",
  "categories": {
    "plot": 7.7,
    "acting": 7.5,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I don't typically watch movies like this, so I'm not sure exactly how to review it. The only reason I picked it up is because I'm a huge Adam Sandler fan. The characters are well acted and the script is well written. It's funny, sweet, and at the same time heartbreaking. I really enjoyed this movie, but I do have some complaints, like I wish they had focused more on the clasky's kids. The son character is practically nonexistent in the movie, and I would have enjoyed more scenes so that we could learn more about how the daughter character is dealing with the rejection by her mother. But maybe it's best that they didn't as even without them the movie still manages to be great. And while the final product still pleases, I'm still left wondering what this movie would have been like if they had included them more. Still it's a great movie and one I do recommend."
    },
    {
      "rating": "7",
      "text": "This is a pretty entertaining dramedy. The acting was good, the story was interesting, most of the characters were believable and likeable and the ending was good. While some people may be put off by the fact that Adam Sandler is one of the main characters, he does put a great performance. In the end, it's a pretty effective movie."
    },
    {
      "rating": "6",
      "text": "Spanglish is a heavy-handed dramedy that hasn't aged particularly well, but when it works, it REALLY works. There are lot of well acted, honest moments, and this is one of Adam Sandler's better performances. It feels real and truthful, and the script actually isn't half bad either. There is a lot of wasted space and time in the movie, but if you like a good melodrama or family comedy, this isn't a bad choice."
    },
    {
      "rating": "7",
      "text": "Adam Sandler egyik komolyabb hangvételű filmjéről van szó. Aki jól akar szórakozni, azoknak ajánlom."
    },
    {
      "rating": "10",
      "text": "This movie loves all its characters, each with their own foibles and hardships. The script bubbles with whimsy and intelligence. There are many laugh out loud moments, but the humor always emerges from characters naturally, and advances their development. Two families converge, a Mexican immigrant turned au pair and her pubescent daughter, and a successful chef, his wife, their son and daughter and her alcoholic mother. Nearly every adult family member hurts the others incidentally--most sadly their children--as they pursue their own, not unworthy goals. But through the grace of a platonic romance between the chef and au pair, the convergent families nudge each into mindful repair of their relationships and a healthier view of themselves. Wonderful acting, especially a superlative Tea Leoni. This movie inspires and delights so, you won't walk away from it, you'll float. And your feet won't have to touch the ground, for a little while at least."
    },
    {
      "rating": "10",
      "text": "I really liked this movie. Mainly because I am Mexican-American and can relate to a lot of it. The spanish didn't pose a problem for me because duh! I understand it. I really would recommend this movie. It was awesome. ^.^"
    },
    {
      "rating": "0",
      "text": "The worst movie I've seen in years. Misogynistic crap: i.e. we are meant to laugh at a woman because she makes faces while having an orgasm, wants sex, and is bored since losing her job. And the contrast made with the supportive, maternal, sensual, and 'salt-of-the-earth' Latina maid is just a counterpoint of stereotypes (racial, gender, and class). Most of all though the film is all about support for Sandler (your hardworking everyman with a dream) and mean brutal hatred for his one-dimensional wife (Leoni). Invidious and evil stuff."
    },
    {
      "rating": "9",
      "text": "It's pretty understandable that some women dislike this movie, it leaves the average American women naked sex and emotionalwise. Awesome."
    },
    {
      "rating": "9",
      "text": "I don't know why so many critics panned the film. I suppose if hypersensitive far left liberals may be offended by some character depictions or question the motives of the director. But I do believe that fair-minded intellectuals will appreciate the superb performances and the comedic tragedy of the film."
    },
    {
      "rating": "10",
      "text": "Loved it!"
    },
    {
      "rating": "2",
      "text": "With such poor direction it is hard to tell if the actors are that bad or just lazy/demotivated. Predicatable plot, cliche ridden, schmaltzy - read a book instead."
    },
    {
      "rating": "3",
      "text": "This movie drove me literally insane. Everything happens so slowly, and everyone struggles so much to build relationships and communicate with one another that it is ultimately exasperating."
    },
    {
      "rating": "7",
      "text": "I have always enjoyed this movie. I enjoy the premiss and the plot is for the most part pretty good. The mom in this movie does bug me but her character is very important and you're not meant to like her all that much. I have watched this movie more than once and it's still a good time to watch a second or third time. I also like to see Adam Sandler in a more serious movie that's not always like his bad comedies. Spanglish is worth watching."
    },
    {
      "rating": "9",
      "text": "I am not Mexican-American nor am I a huge fan of Adam Sandler, but I found this film to be surprisingly well-made and effective.  I found Paz Vega in particular very good."
    },
    {
      "rating": "6",
      "text": "This clash of cultures comedy was supposed to have something to say in its favor, but it's loaded with stereotypes that barely provoke the slightest laugh; not to mention that the development of the plot feels slow at times. What is at least appreciated is a moderate Adam Sandler, without his crude humor."
    },
    {
      "rating": "5",
      "text": "Just an ok movie. Some parts are funny. It's just your average family who hires a nanny. She gets to witness all the families problems. The husband is attracted to hi immigrant live in nanny."
    },
    {
      "rating": "10",
      "text": "It is a comedy, and yet it's a very serious movie too, there is a moment that we all laugh so hard and there is a moment that is so serious, very serious, and it's really really good, Spanglish is another movie that will prove you wrong about Adam Sandler's acting, because he is so good in here, and not forget to mention all of the cast was incredibly superb too, Spanglish is a funny, sweet, and yet a very good serious movie."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡¡●●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    }
  ]
}