{
  "id": 2820,
  "title": "Spartacus",
  "starring": [
    "Kirk Douglas",
    "Laurence Olivier"
  ],
  "runtime": 197,
  "genre": [
    "History",
    "War",
    "Drama",
    "Adventure"
  ],
  "description": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
  "releaseYear": "1960",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/biaUMHb8xsdQHlEF6rHmlKxSARy.jpg",
  "categories": {
    "plot": 8.8,
    "acting": 8.666666666666666,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "While aside from the awesome big battle, Spartacus may not feel much like a Stanley Kubrick film, it does feel like a moving classic Hollywood epic with great characters and iconic scenes.It's corny at times and it drags quite a bit during its three hour runtime, but manages to mantain its status as a true Hollywood classic and an important, if at times unsubtle criticism of McCarthyism from writer Dalton Trumbo (the main villain literally has a list with the names of all \"enemies of the state\")."
    },
    {
      "rating": "10",
      "text": "A true movie, better than Gladiator. Kubrick was a really genius, we miss him!"
    },
    {
      "rating": "9",
      "text": "From my point of view on the greatest films directed by the legendary director Stanley kubrick. Also my favorite film about the Ancient Rome, the battles are spectaculars, incredible legendary actors its a true masterpiece. I would to remain after Gladiator 2000 by Ridley Scott there's no more epic and good films about Ancient Rome, I sugest to make more films about romans with this high quality. We have nowadays a lot mediocre and awful films about Rome. Spartacus, Ben Hur and Gladiator are most greatest of all the times!"
    },
    {
      "rating": "10",
      "text": "Classic movie with a big budget and you can see it: costumes, the amount of people involved, the lengts. I appreciate the most, that there were the political scenes with intelligent dialogues."
    },
    {
      "rating": "9",
      "text": "Spartacus, the Stanley Kubrick directed, Kirk Douglas produced story of slave revolt in ancient Rome, is a special experience; a classic epic with a distinctly modern sensibility. It’s a sharp, subtly risqué piece of work, in line with what I expect from Kubrick."
    },
    {
      "rating": "10",
      "text": "One of the greatest examples of Roman cinema. The little more than three hours of footage are justified with the correct mix of genres, and with an empathetic and hard-to-forget character."
    },
    {
      "rating": "4",
      "text": "Un péplum typique de son temps et un long-métrage très… long (typique de son temps, on vous dit…) ce qui signifie des longueurs qui rallongent encore le métrage qui semble alors ne plus en finir… Cela étant, il n’est pas le pire d’entre eux (de tous les péplums à rallonge) et avec un peu de bonne volonté, on tient à peu près la distance… des plus de trois heures bien pesées !On note en dehors du grand spectacle (surtout les déplacements de troupes à la fin) une certaine violence (surtout vers la fin) avec même du « sang », ce qui est inhabituel en termes de péplum hollywoodien déclamatoire mais on note également quelques excellents personnages, quelques uns seulement qui donnent une grandeur et un allant inattendus : ceux de Charles Laughton, Laurence Olivier et Peter Ustinov, vraiment épatants. Kirk se débrouille tout à fait mais reste hélas coincé en mode « héroïque »… et trop poseur.Quant à sa douce moitié dans le film, même si elle dispose apparemment de jolis attributs, elle demeure une bécasse fadasse du début à la fin : crispante comme c’est pas permis, chiante comme pas possible. Presque aussi chiante que la musique criarde envahissante, lancinante… bien crispante elle aussi !Malgré par ailleurs sa guimauve plus ou moins appuyée, ce Spartacus n’en reste pas moins assez cruel, ce qui dénote aussi en termes de péplum (à dormir debout) : un étrange et bien curieux mélange donc ! je ne suis en tout cas globalement pas convaincu malgré de beaux numéros d’acteurs, d’autant qu’on sent un agenda pré-SJW un peu trop évident et un Crassus qui se pose trop de questions, les questions d’un scénariste communiste, évidemment. Bref, belle tentative que tout cela mais ça reste trop lourdingue dans l’ensemble."
    },
    {
      "rating": "9",
      "text": "The Fifties and Sixties saw a proliferation of epic films made around the Bible or the Roman Empire. Based on a precise moment in the history of Rome, the Slave War, this is one of the best despite not having a comma of historical rigor.The film focuses on the historical figure of Spartacus, a Thracian slave who begins by being a gladiator and who will become famous when he takes over the leadership of a huge group of slaves who, in the middle of the Italian peninsula, revolt and desperately fight for their own freedom and the right to abandon the empire's lands. The film creates around it a huge fictional plot and a somewhat sugary romance with another slave, and emphasizes the division of the Romans and political issues. Skillfully directed by Stanley Kubrick, it's one of the most palatable films in his filmography. The film follows the entire trajectory of the revolt until its bloody end.One of the strongest points of the film is the extraordinary performance of the cast, led by Kirk Douglas in one of the roles that would give him immortal notoriety. He is perfect in the way he gave life to Spartacus, although perhaps Kubrick exaggerated the amount of pompous speeches and pouch phrases attributed to the character. Jean Simmons was excellent in the role of the slave he falls in love with and Laurence Olivier is impeccable in the role of Crassus, the famous Roman politician and consul responsible for ending the slave revolt. The film also features John Gavin, Charles Laughton, John Dall and Peter Ustinov in smaller roles, but where everyone did a job worthy of praise.Technically, it is a film full of value and extremely positive grades. Let us start by mentioning the excellent cinematography, the impeccable filming work and the magnificent colors and light that accompany the entire work, which lasts about three hours. It is in fact three hours well spent, where we rarely feel we are seeing a scene that can be removed or shortened until we reach the last half hour... in fact, from that point on, Kubrick seems more concerned with creating a hermetically closed ending in spite of using the dramatic climax for a great and impactful ending. Thus, and as a result of this hesitation, the film drags on for unnecessary thirty minutes. All the sets and costumes were meticulously done and look incredible, although, like much of the script, they are more guided by the visual impact than by the historical rigor of the recreation. As in other epics of this time, many people are involved and the film was an imposing collective effort. The soundtrack, by Alex North, is effective and works quite well."
    },
    {
      "rating": "10",
      "text": "Es emocionante, épica y emotiva, es una de las mejores películas de la historia."
    }
  ]
}