{
  "id": 2051,
  "title": "Species",
  "starring": [
    "Natasha Henstridge",
    "Ben Kingsley"
  ],
  "runtime": 108,
  "genre": [
    "Science Fiction",
    "Horror",
    "Action"
  ],
  "description": "In 1993, the Search for Extra Terrestrial Intelligence Project receives a transmission detailing an alien DNA structure, along with instructions on how to splice it with human DNA. The result is Sil, a sensual but deadly creature who can change from a beautiful woman to an armour-plated killing machine in the blink of an eye.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yEAEULEn5rraRIpymMACticTfBD.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 5.666666666666667,
    "ending": 4.6,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Species is a great Sci-Fi thriller. The acting by Kingsley, Molina, Whitaker, Henstridge, Helgenberger & Madsen is impeccable. The special effects are first rate as well."
    },
    {
      "rating": "8",
      "text": "Species is a first rate sci-fi thriller with marvelous special effects, plenty of twists and great acting from a talented cast."
    },
    {
      "rating": "8",
      "text": "kakekdmckvmoiiuwqqefgocmmsmdkcmkdmvkdmksmskcmosmdkkfkehhauiywydhkcmckcmdkmfmk"
    },
    {
      "rating": "8",
      "text": "●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪"
    },
    {
      "rating": "8",
      "text": "Sil is an ectogen - a person who was, or is being, gestated in an artificial womb."
    },
    {
      "rating": "8",
      "text": "$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&$&,,,,,,,,,,,,,,,,,,,,,,,,,,,,,°°°°°°°°°°°°°°°°°°°°°°°°°°°"
    },
    {
      "rating": "8",
      "text": "Plot holes The team goes back to the hotel, and after having drinks they go to their rooms. A member of the hotel staff is seen knocking a door, saying \"Housekeeping\" and Sil then obtains her keys. However no-one would be making housekeeping rounds in the evening."
    },
    {
      "rating": "9",
      "text": "Species is a 1995 film, the year of great movies such as Assassins, Casino, The Quick and the Dead and a few others but also probably in 1995 some stinkers were made. Species directed by Roger Donaldson is a basic and rather simple story and it's basically some scientists found alien DNA or something and created a monster. Not sure if that's correct so don't quote me, however I am sure the alien creature is named Sil and is played by Michelle Williams (Dawson's Creek) and she's still a child. They decide to gas her and kill her but she escapes from a glass chamber and helicopters and everyone are out hunting for her. A group of people \"Michael Madsen,  Marg Helgenberger, Forrest Whitaker and some other dude lol are called in for a search and destroy mission to terminate the alien lifeform before it mates and potentially becomes a threat to earth but first they must hunt her (the alien) down and find her because she's on the loose after escaping. SPECIES stars also Natasha Henstridge (Ghosts of Mars) as the alien creature and is packed with explosions, violence, blood and extremely well done sex scenes and beautifully executed nudity scenes. This film is excellent!!!"
    },
    {
      "rating": "4",
      "text": "I happened to recall hearing about a year ago, when I first watch \"Under the Skin\", there existed a movie from the 90s that it took the concept from. Fast forward to now and, I hear that the film in question was \"Species\".From a purely conceptual level, Species has a great premece. A woman who goes around seducing and killing people. That's about were the good in the writing ends. Every character is completely flat and definied by what they do in the story. Main character, knows where the alein is, love intreset, exposition and, death fodder. If you've seen species, you know exactly who each character is based on that description. Also the alein who is evil.The acting is actually pretty decent overall. Nothing crazy great or crazy bad, just some solid performances that keep this movie above rock bottom. For how barren the material the actors are working with, they end up doing a decent job. So, in that sense, the acting is impressive I guess.The special effects and make up, when they are done practiacally, end up looking pretty great. At least up until the film's climax when everything devolves into mid 90s cgi. I guess they might've looked good for the time but, they've aged poorly. However, the practical effects in the brief dream sequences look very good. It's definietly reminicent of Alein but, go figure since HR Giger designed the alein in this movie, so no shock there.The camera work and cinematography is the millionth thing in this movie that falls into the category of \"Just alright\". \"Just alright\" ends up being the word I'd describe most of this film with. Very little of it is done in a way that is special. However, the reason to watch this movie is because it's really funny bad. So, I honestly reccomend watching this if you are a fan of Under the Skin because you can see how it improved and evolved on this concept."
    },
    {
      "rating": "6",
      "text": "Una alienígena que siempre está caliente y que ni leyendo la Biblia se le quita.Por añadir: Natasha Henstridge se ve hermosísima aquí."
    },
    {
      "rating": "5",
      "text": "The classic scifi trope of a beautiful yet deadly woman from outterspace. All the ingredients are here and yet something just feels off. The cinematography, editing, pacing, screenplay, direction all just didnt hold up as well in 2022 as back in the day. The cast is fantastic and tries their best with the weak material."
    },
    {
      "rating": "7",
      "text": "To be fair while I liked the movie it is a bit in „The so bad it is good“ realm. However the ideas are good, they got talented actors and H. R. Giger for the practical effects. This saved the movie. The story starts with the SETI project (Search for extraterrestrial intelligence). Like in real life they search for alien life aka signals. After sending a message out with information about Earth, mankind and our civilization including our DNA structure they receive an answer. The first message is an instruction for a device that produce large amounts of clean energy. The second message is an introduction how to splice Alien DNA into humans. Because of the benefaction first message they do this expecting a teacher of knowledge and a human looking girl named Sil is conceived. I stop to avoid spoilers. I like the ideas and story. There is a lot to like and discuss but I have to admit that it is a bit in the B movie territory. If you expect something more artistic you will be disappointed. Surprisingly they got a really good cast of actors for a science fiction horror movie with Ben Kingsley, Forest Whitaker, Alfred Molina and Michael Madsen. Also I like the performance of Natasha Henstridge as Sil. For the genre we get a good performance by the whole cast. The special effects are top notch as H. R. Giger delivers disturbingly good effects. It improves the movie for me. Overall I enjoyed this movie but think it barely doges the guilty pleasures realm for me. However it also created a franchise and was a success by Hollywood standards (= Earning 2,5 / 3 times its production costs). Worth to watch but will probably not end on many top 10 lists. Bonus knowledge: There is the dark forest theory to explain why there are no signals out there for SETI. The premise is that it is safer to annihilate any intelligent species you discover before they do it in reverse. Because of the limit of light speed and great distances it will be far to late if you learn that those became something dangerous. It is like a hunter in a dark forest that does not know what is lurking in the shadows and should be cautious. It is best to not be seen."
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,,...........@#$%^&*(),.?!;:\"÷×+=/€▪○●□■•°⊙☆¤《》♤♡◇♧¡¿[]~~~~°•●●●■■▪▪▪▪•°\"°°"
    },
    {
      "rating": "8",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●¡●¡●¡●¡●¡●¡::;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:"
    },
    {
      "rating": "9",
      "text": "This is the ultimate bloke film bar none. Well except maybe Predator (1987). I love the way that this is full of topless women, violence and aliens. Absolutely perfect. Here, take a handy hint: fill your belly with beer and then almost pass-out from the awe that is generated from every second of this killer alien-human-hybrid movie. I never get tired of watching Natasha Henstridge as an alien. Never ever."
    }
  ],
  "recommendations": [
    "prometheus",
    "underworld",
    "sunshine",
    "daybreakers",
    "monsters",
    "independence_day",
    "the_last_days_on_mars",
    "alien_resurrection",
    "after_earth",
    "event_horizon",
    "twister",
    "i_am_legend",
    "war_of_the_worlds",
    "the_shallows",
    "mirrors",
    "the_darkest_hour",
    "priest",
    "aliens",
    "alien_covenant",
    "elysium",
    "battle_los_angeles",
    "terminator_salvation",
    "the_tomorrow_war",
    "science_fiction_volume_one_the_osiris_child",
    "spectral"
  ]
}