{"id": 3122, "title": "Spectral", "starring": ["James Badge Dale", "Emily Mortimer"], "runtime": 109, "genre": ["Science Fiction", "Thriller", "Action"], "description": "A special-ops team is dispatched to fight supernatural beings that have taken over a European city.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fYtIWhTDgPTcutD24f53Dcc7BAE.jpg", "categories": {"plot": 6.2631578947368425, "acting": 5.846153846153846, "ending": 9.25, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 6.285714285714286}, "reviews": [{"rating": "5", "text": "Somewhat intriguing premise but doesn't really do anything interesting with it."}, {"rating": "8", "text": "A good, sci-fi war movie. It was entertaining throughout and had several moments that made me go \"that was really cool\". There are plenty of well-worn tropes in Spectral, but they're executed well. If you like movies like Dredd, Red Dawn, or Aliens, you'll probably enjoy this one too."}, {"rating": "8", "text": "Spectral: Spectral is about American special forces fighting the remnants of government troops during a civil war in Moldova. During the battle, the special forces are attacked by what appears to be ghosts and call on a DARPA scientist (James Badge Dale) to come investigate and help the US Army counteract this new threat.The Good: Spectral pulls off a neat trick. It is a movie about science and technology and the hard-working scientists behind it. Despite all the hoo-rah action scenes, it is the thinking men that will get them out of this mess. The movie sets this tone well and keeps it throughout the film. The fact that it manages to do this without talking down to the audience too much is an amazing feat.The solid acting across the board and a solid science fiction foundation are matched with a good pace and good action scenes. The film does manage some very nice set pieces with good practical effects mixed with the CGI.The Bad: If one goes a looking there might be a plot hole or two. (You need a hundred laser cannons using brand new tech? I am going to need half an hour and some duct tape). In addition if while the film certainly uses science throughout I wouldn’t exactly quote some of those theories on Friday's physics exam.Actual citizens of Moldova can also feel free to criticize the wrong city, wrong language and ridiculous description of your government.In Conclusion: Though marketed as a Netflix original; Netflix actually picked Spectral up on the cheap from Universal/Legendary who was unhappy with all the science stuff and possible realized too late that Emily Mortimer is not going to open a summer blockbuster. That said one can certainly see the not inconsiderable budget on the screen.How Universal shelved this film and opened The Mummy is a mystery for another day. Solid Sci-fi actioner with an elevator script sounding like a cross between Black Hawk Down and Aliens. A fun film that is better than one might suspect."}, {"rating": "6", "text": "While much better than many films with similar plots (the CGI is top notch) Spectral suffers from an inherent problem of this \"genre,\" to wit, if the enemy is categorically \"soulless,\" for whatever reason, they are categorically less interesting as an enemy. Same problem I have with puerile \"Zombie Apocalypse\" movies. I want my protagonists battling antagonists who are evil incarnate... and, to be that, you have to have free will and a soul... even a very dark one."}, {"rating": "7", "text": "For a netflix original film, this was a solid effort with some really innovative ideas. An interesting action/paranormal/scifi with great effects and awesome visuals. While in the end it's essentially a syfy original with better effects and acting, it was worth watching."}, {"rating": "6", "text": "Cool concept, but it doesn't quite execute it an innovative or interesting way. The characters are rather cut and dry and don't have a lot of depth, but they service the story(what little there is) sufficiently. The special effects are the only real high point of this film. Watching it, it honestly feels like it would have made a better video game than a film."}, {"rating": "10", "text": "I'm giving it a 10/10 for the willingness to tackle a different sci-fi topic, which is so hard in an age where sci-fi is cluttered with established franchises long past their expiration date. I hope they keep going."}, {"rating": "10", "text": "Starts slowly but slowly becomes frenetic in action and special effects. The subject gives for a second movie, I got lost in the explanation of how this energy matter is created."}, {"rating": "3", "text": "I don't understand how anybody is talking about this being a copycat of Final Fantasy: The Movie. Same premise with a weaker execution.Some nice visuals and better-than-average acting for a TV-Movie, that's all."}, {"rating": "4", "text": "nah, it gets minor ups for the special effects but overall the story was trite, the reaches far, and the overall experience wishing i had those two hours back"}, {"rating": "3", "text": "This movie had a very interesting concept, but it wasn't able to pull it off. Once I started watching it I was very interested, but throughout watching the film I felt that it fell into a lot of cliches. I just feel like there was a lot of wasted potential, because the idea behind the movie is interesting, but it falls short and just turns into another average action movie."}, {"rating": "6", "text": "Pretty OK scifi with some interesting ideas that are only scratched and sometimes implemented badly. Nice CG effects. It should probably have been better as a mini series"}, {"rating": "2", "text": "Mal... Mala película... El concepto es muy interesante, la trama puede ser impresionante, pero se desarrolló de manera simple, intuitiva y lo peor que puede tener una película: OBVIA. Uno se imagina el final, es predecible qué va a pasar con los personajes, las batallas no generan nada... Triste porque podría ser TREMENDA película y es una mala."}, {"rating": "6", "text": "An ok supernatual/action flick. Decent performances but nobody really stands out. Starts off as a ghosthunting movie. Initially we don't know what the \"ghosts\" are and the tension is ramped up nicely until first contact. Then it turns into a kind of action movie reminiscent of \"Aliens\". with a small squad of jarheads being led by two scientists types (I was expecting a romance between the two scientists but it doesn't happen). There's a part in the plot which let everything down imho. The lead scientist suddenly figures everything out; what the \"ghosts\" are and how to defeat them. Then he takes a few crates of random equipment and within a single montage he has designed and built enough plasma rifles and advanced power armour to equip a small army. It really is quite ridiculous. We then have the climactic battle scene. CGI is top notch and some of the scenes were quite thrilling, but the fact that none of the leads really stand out and we lack a main antagonist (the \"ghosts\" are only partially explained) leaves everything feeling a little flat. Decent effort but don't expect to be blown away like you're watching \"Aliens\" for the first time."}, {"rating": "8", "text": "It's not bad at all. Doesn't overreach, doesn't preach, it's just an action movie, with a bit of sci-fi."}, {"rating": "8", "text": "Good B movie with:- Tight, concise script,- AAA special effects and - committed actors and directing.  Has a terrific Gears of War look to the production design--most of which I think is digital, flawlessly done, mostly by Weta."}, {"rating": "4", "text": "Spectral starts off very promising with its amazing cinematography and interesting story, but that story soon becomes trite and cliche. The action just doesn't succeed at being suspenseful-horror and instead comes off as entertaining, due to not caring about any of the characters. For the premise that the movie had, this was a huge missed opportunity. There are two characters during the second act who were litterally just plot devices, and only one of them was really even needed. Both characters stick around for over twenty minutes, and their last scenes in the movie felt forced and abrupt. But those aren't the only forced moments in the film.The most interesting thing to me is that when the movie starts, we are interested in the questions the characters are trying to answer. But when we find out the answers, we already don't care anymore because the movie hasn't been focusing on that question enough. I was loving this movie up until the very first action scene; There was mystery, suspense, but the action doesn't keep that up. The main character was interesting and just so cool, but he doesn't even take part upfront in the first action scene, and we slowly lose interest in him. The movie loses its mysterious feel somehow, and the solution is not surprising or jaw-dropping or satisfying, instead just uninteresting, imagination-lacking and cliche. Spectral could've been something special but instead it is a below-average-movie and gets a 4 out of 10."}, {"rating": "6", "text": "Spectral is a decent action scifi movie. The story is barely interesting until the very end, where you have some measures of explanations. The FX is really good in general, but the action camera work and filming were not always interesting. The main actors are just average and strangely, it's the side characters that were the most interesting. The shortcut magic solutions (in very little time) made me cringe twice in the movie. I still give it a 65% because I think that overall, there was some good production value and a good premise. Not always well told and showed but ok if you miss the genre."}, {"rating": "6", "text": "Spectral es una película de ciencia ficción con un portagonista que en personalidad me recuerda un poco al Doctor de \"Doctor Who\", por su forma de pensar y ciertas decisiones que toma, aunque quitando eso y ciertos giros de guion, no es del todo interesante y llamativa, incluso llega a ser genérica, pero eso no quita que sea entretenida de ver."}, {"rating": "10", "text": "I love this movie: good visual & Sonic effect, perfect story and good characters.Starts slowly and reach an epic sci fi climax at end accompanied by a dramatic genre at the end reflecting questions on mind and death.Indeed, different from other sci fi movies.THE GREATEST MOVIE IN MY OPINION."}, {"rating": "8", "text": "This is a good movie. The acting was very good and the effects were surprisingly effective. The story had its ups and downs but it was mostly ups."}, {"rating": "9", "text": "Ok so I'm almost done with this movie and I feel I can write an honest review. This movie starts with a mystery slightly slow, but it's still well paced. Something is killing soldiers in a War Zone and bullets go right through it. A researcher teams up with a government organization and soldiers to stop the \"Spectral\" from killing soldiers and people. It has a good plot and the action is pretty decent. The special effects are decent and above average. Overall the actors are excellent and this is worth your time. Check it out."}], "recommendations": ["captive_state", "hunter_killer", "the_last_days_on_mars", "battle_los_angeles", "science_fiction_volume_one_the_osiris_child", "monsters", "pacific_rim_uprising", "sunshine", "cube", "upgrade", "surrogates", "elysium", "the_tomorrow_war", "jupiter_ascending", "infinite", "alien_outpost", "the_last_witch_hunter", "riddick", "the_matrix_reloaded", "bloodshot", "extinction", "minority_report", "wrath_of_man", "maze_runner_the_scorch_trials", "project_power"]}