{
  "id": 600,
  "title": "Spectre",
  "starring": [
    "Daniel Craig",
    "Christoph Waltz"
  ],
  "runtime": 148,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/672kUEMtTHcaVYSVY4eiHEliHFa.jpg",
  "categories": {
    "plot": 4.75,
    "acting": 5.428571428571429,
    "ending": 5.545454545454546,
    "soundtrack": 6.25,
    "cinematography": 5.555555555555555,
    "familyFriendly": 5.9375,
    "funny": 5.571428571428571,
    "action": 5.7
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Strangely boring and tired entry to the franchise. It felt like the re-heated leftovers from every spy and super hero movie of the last 10 years. Not a single witty line. In fact, the script felt like a boilerplate place holder that someone was supposed to go back and replace with actual writing... only never did. My expectations were somewhat low going in because some early reviews I read said it was a dreary film. It wasn't just dreary in tone, it had no life at all. Really disappointed."
    },
    {
      "rating": "3",
      "text": "SPECTRE grabs everything Casino Royale did to get 007 back on track and flushes it down the toilet. It's the Diamonds are Forever of the Daniel Craig era in the way that it's a Roger Moore era movie but with a different actor. So long for the days when Bond had development and complexity.\rThe paper-thin story is basically a poor man's Captain America: The Winter Soldier (it revolves around privacy invasion to defend security), and it keeps with the Skyfall tradition of insisting that James Bond is still super relevant in the internet era despite relying on pandering throwbacks to the previous films to drive the point home. Ironically, it makes you wonder if Bond still has a place in the contemporary world.\rWe're back to the old days when women are one-dimensional plot devices and sexual interests rather than actual characters with personalities and arcs. Daniel Craig and Lea Seydoux have to go through a forced and chemistry-free romantic subplot that adds nothing to the picture. All while Seydoux tries too hard to be sexy and cool, and I'm sorry, but she's no Eva Green or Honor Blackman. More like a female Jai Courtney.\rChristoph Waltz is the same over-the-top cartoonish villain he plays in most of his films, and his motivations are pretty silly. How are we supposed to take him seriously when his catchphrase is \"cuckoo\"? Not to mention his twists are insulting to the audience's intelligence and seem taken from Austin Powers in Goldmember.\rMost shockingly, it's not even an interesting movie in the visual departments. The action scenes are a snoozefest due to poor editing and low stakes, and the monochromatic cinematography makes every location look the same (except for the opening sequence in Mexico, the only one with a wide color palette).\rBring back Martin Campbell!"
    },
    {
      "rating": "10",
      "text": "Spectre is by far one of the best bond films ever so far. It is amazing and exciting and leave me wondering if the series can continue after it i for one would be ok if the series ended but on the other hand if the writes could think of a way to continue on james bond will return with daniel craig one more time"
    },
    {
      "rating": "6",
      "text": "After the amazing Skyfall, there was another fall called Specter. The locations were great, but they didn't have a Skyfall, and especially the overall story faltered quite a bit. Although the action scenes were great, there weren't many of them, but the music was great. Overall, I would say it's a good movie that I can recommend."
    },
    {
      "rating": "8",
      "text": "Unpopular opinion but I prefer this over skyfall.While skyfall was amazing from a directorial standpoint it just felt bland and had no energy whereas here I felt like Craig was bond once again and was having fun in the role and eproved himself again to be the awesome spy we grown to love this decade.The cinematography is beautiful and the soundtrack was stellar ,not to mention some of the best action set pieces & sequences I've seen in a while especially the opening however it could have benefited from being at least twenty minutes shorter ,two hours and thirty minutes is a lot to ask for today's generation to sit through Definitely the second best bond in the Craig trilogy in my opinion.P.S writings on the wall was a masterpiece and smith deserved all the recognition."
    },
    {
      "rating": "6",
      "text": "Spectre was a marginally decent movie, it followed the outline of the past Bond movies structurally, but the story was a bore. Some scenes seemed too goofy to be in the film - almost a parody of itself, other scenes were mediore and a couple were fun. If you have money to blow, and have nothing else to see, then go for it. For the rest of you... it's a netflix movie for sure."
    },
    {
      "rating": "6",
      "text": "People are giving this movie the benefit of doubt purely because of the Bond brand, but the truth is that it makes for poor watching. Sure there's some great special effects and fantastic cinematography featuring a montage of some of the most beautiful places on earth, but the plot itself completely ruins anything the film had going for it. The storyline is unbelievably predictable but filled with more holes than Swiss cheese. The actions of the villains are moronic and their aims and motivations are so underdeveloped that you simply don't care. Bond is nothing more than an action hero with luck at every step. There's nothing smooth about how he operates in this film - he's not charming, not devious, not cunning, not smart and most certainly not subtle. In fact he could easily be described as a one man Delta force team because he just moves from location to location, wreaking havoc and running around guns blazing, leaving behind a trail of destruction. It is far more Rambo than it is Bond.\r Basically if you're a huge Michael Bay fan and love movies where things get blown up or where heroes are able to escape any situation completely unscathed through no logic whatsoever, then you'll love this film. However if you're a classic Bond fan, you'll be bitterly disappointed - not because any of the casting, directing or music was that bad but simply because the writing was so absolutely dreadful it makes Transformers look like a masterpiece."
    },
    {
      "rating": "5",
      "text": "The critic reviews are mostly on target for this film. Thanks to the inevitable comparison with its predecessor Skyfall, this one falls well short of expectations. Lets see how it fares VS Skyfall\r1. Opening Scene: Skyfall was much better, intense, and believable. Here, the shots of helicopter spinning out of control gets repetitive and boring\r 2. Plot: Both movies have a good plot but Skyfall edges ahead because it maintains sense of threat and danger till the very end, while here the sense of threat and danger gets diluted when Bond enters villain's headquarters in Morocco. Thereafter, its all boloney.\r 3. BGM: Skyfall all the way...here the music feels rehashed from Skyfall in some scenes and in others, lacks the punch to create the sense of danger/thrill\r 4. Cinematography: Skyfall again....watching this film makes me realize why people were praising Skyfalls cinematography to no end. Roger Deakins, you're sorely missed.\r 5 Title Song: Adele all the way.....Sam Smith's song sounds like a lullaby in comparison. Also, the VFX in opening credits looks creepy with octopus sliding on the screen\r 6.Action: Skyfall again - here the action looks kind of convenient and stupid - specially the way in which Bond gets onto a plane to rescue Lea in Austria and his plane crashes exactly where the villains were driving. Also the climax where he's able to rescue Lea and drive out of MI6 in a boat within 2 minutes, then take out the villain by shooting his helicopter!! That was laughable :D\r 7. Villain: The villain in this film is supposed to be the boss of all past Bond villains and in his introduction scene he exudes a sense of dread and respect out of fear. But everything changes once we hear him talk to Bond at his headquarters in Morocco. One feels this guy has lost it! Inviting your enemy to your den, showing him around like a guided tour, and then getting blown away! How moronic.....there is no sense of threat or danger to Bond from this idiot! Even in the climax, he tries to get away from the blast site in a helicopter before getting shot down by Bond. Oh come on! How silly of the BIG BOSS OF ALL CRIMINALS to do something like this!\r All in all, Spectre comes as a BIG DISAPPOINTMENT because of the amateurish and cliched writing in the second half, alongwith direction to show that stupidity on screen"
    },
    {
      "rating": "5",
      "text": "This movie should be called \"Jumping the shark\", I didn't like or relate to any of the actors actors, bad acting, bad story, bad action scenes, boring music. Nothing new, they again try to present Bond as traumatized by losing women. I also feel the love scene with the Bond girl was forced, since a human just died, they decide to \"celebrate\" it by having sex, wtf.  I think the main problem was the weak villain, compared to Skyfall. They just seem to try to cash in on the success of Skyfall by trying to throw some of the same elements over and over without developing the characters, including the villains, further than in the previous movies, which is getting boring fast."
    },
    {
      "rating": "5",
      "text": "This movie is film-making at its laziest.  There are many points where your reaction is \"Wait... Why did that just happen?\"  And it is horribly predictable.  Spectre is not a terrible movie--in fact, the beginning is brilliant--just not a very good one."
    },
    {
      "rating": "5",
      "text": "Feels like a mess of ideas smashed together rather than being edited down to a more cohesive script. The central plot is utter nonsense, the love story completely annoying and unrealistic there's far too much location hopping purely for the sake of it.  Average at best and a shocking follow up to the amazing Skyfall."
    },
    {
      "rating": "6",
      "text": "After a stand-out Skyfall, SPECTRE fails to be anything more than a supbar and admittedly disappointing chapter in the Bond saga with nothing playing out to it's full potential"
    },
    {
      "rating": "6",
      "text": "SPECTRE isn't a bad film, but the plot and the role of the main villain are incredibly week. The action is good, the acting isn't bad, but this movie is not as good as Skyfall. Sad way to say goodbye to Daniel Craig as James Bond, as he suits the role perfectly in my opinion."
    },
    {
      "rating": "5",
      "text": "'Spectre' may be the most disappointing Bond film in a long time. It fails to match the drama and intensity of 'Skyfall' with horribly slow pacing, and entertaining, but ultimately useless, time-filling action sequences. The first two-thirds of the movie give you no clear indication of what threat the SPECTRE organization actually is, beyond being a secret organization, and by the time the audience is filled in, it feels too little too late. Bond's interactions with his cohorts, and attempts at humor, fall flat almost every time. Christolph Waltz is a wasted talent as the villain, almost like how Venom was jammed into the ending of Spider-Man 3. There are too many times that the movie breaks suspension of disbelief, with many characters surviving what should be clear deaths, and the plot twists near the end of the film can be seen coming a mile away. While the last act of the film had some engaging moments and interesting ideas, their value is undercut by the plodding pace of the first hour and half/two hours. It's just a shame that 'Skyfall' set such a high bar to reach, as 'Spectre' may have been a fine sequel to 'Casino Royale,' (definitely better than 'Quantum') but unfortunately the film crashes the Bond series back down to Earth. There's enough popcorn entertainment for those just sitting back to enjoy the ride, but not enough substance for those looking for real good value out of their high ticket prices."
    },
    {
      "rating": "2",
      "text": "Okay, so I will try to write a full review of this horrendous \"Bond film\" without giving any spoilers, but I doubt that you will want to watch this movie after reading this review.\r First of all, the rating you will give to this film will change dramatically if you have seen the previous films of Sam Mendes & Daniel Craig, the perfect combination that bring the elegant, charismatic and cool yet fragile Bond to life. Spectre's Bond, however, does not display these qualities as much as the previous Bonds do.\r Story: Right before I entered the cinema I read online that Pierce Brosnan, the previous Bond as you may know, says that Specte has a weak story and is too long. I sincerely hoped that he was solely jealous of Craig's brilliance on the role, but that was not the case. Not that Craig is anything short of great as James Bond, but Spectre actually does have quite a weak story and is unnecessarily long. Do not worry, I will not spoil anything but I will say this: the story is extremely shallow compared to Skyfall and Casino Royale, moreover gives absurd roles and qualities to iconic characters we are used to always see on screen with Bond. Also it leaves quite a lot, and by that I mean really a lot of plot holes behind to make you wonder if they actually deleted part of the script. Overall, story is one of the most important aspects of a Bond movie and it is mainly what makes CR and Skyfall great, while bringing Quantum of Solace and Spectre very much below the standard we expect from Sam Mendes.\r Cinematography: Remember the \"Take the bloody shot\" sequence at the beginning of Skyfall that gave every one of goosebumps? What about the beautiful shot of Bond with colorful Chinese decoration that reminded us that films are forms of art? Yes? Well you get none of that in Spectre. Spectre is all about fast sequences with big explosions, cause who doesn't love explosions, right? I'd classify this movie as quick entertainment like \"fast food\", rather than a form of art.\r Bond: As I said in the beginning, Spectre's Bond is like a Chinese replica: it tries to be elegant and cool but does not get it quite right. I totally agree with Brosnan in saying that Spectre is not Bond-ish, since THE factor that makes a Bond film a Bond film is James Bond himself. Bond strips himself from being a smart and wise MI6 agent who actually has reason behind his actions, while taking more of a mindless action-movie hero-role, making stupid decisions without thinking about consequences and creating dialogue that is nothing but a reason to display 2 characters together on-screen. I also mentioned that Bond was not at all invincible in previous movies, remember Casino Royale and the beginning of Skyfall. However, Spectre's Bond is a man that even Iron Man himself will be jealous of. You will see what I mean.\r Supporting Cast: Supporting cast are just there to, as you may have guessed from their role, \"support\" Bond. Yep, that's it. They do not really have stories of their own, they are just there when need be and gone when Bond is to take the spotlight. Extremely shallow characters. We get no backstory on what happened to them, why they are doing what they are doing, and what they want from Bond.\r That sums up my opinion on Spectre. I'd love to write even more but I have other stuff to do, unfortunately. I hope my review gave you another point of view, apart from all those 10/10 and 9/10 reviews which I'm sure have reasons of their own to give such high ratings.\r I don't know about you, but I will reconsider twice, maybe thrice before watching the next Bond."
    },
    {
      "rating": "6",
      "text": "On the good side, it is the second most expensive film ever made, and it looks like it. The cinematography is gorgeous, and Thomas Newman clearly had fun writing this score.\r On the bad side, the actual events that are being filmed aren't that interesting. The Bourne-style action and ruggedly humorless Daniel Craig characterization are more than a little tired, as is the series of references to Bond tropes. It isn't a great showing for the supporting cast either; Christoph Waltz and Monica Belucci might seem like casting coups, but they're both wasted, and Lea Seydoux is of course very, very pretty, but her character's archetypically fickle and irrational Bond girl behavior feels increasingly out of touch in a gritty 2010's movie.\r Plot holes abound, the henchmen have the level of marksmanship you'd expect, and you'll wonder what kind of intelligence agency builds a massive prominent headquarters out of glass. None of this is really outside of the Bond ouvre, but it's getting tired. It's a fun movie at times, but it's trying to be realistic, unrealistic, and tongue-in-cheek all at the same time, and that just doesn't work."
    },
    {
      "rating": "6",
      "text": "While Spectre has its moments, specifically in the beginning and the end of the film, it ultimately falls flat. The film moves at a very sluggish pace, which leaves the audience terribly bored. Additionally, Christoph Waltz is completely underutilized as a villain. He is in the film for a solid 10 minutes at disjointed scenes. However, Spectre does manage to keep the action (when it actually exists) intense and Craig is still a great 007. It's unfortunate that the Daniel Craig Bond era ends on a very \"meh\" note."
    },
    {
      "rating": "7",
      "text": "It was a nice throwback to classic Bond but the bits of humor didn't really mix in with the seriousness of Craig's Bond films nor did it really mix well with Spectre. Craig's Bond just doesn't have the kind of personality to pull it off, He looked far too stone face through out. Waltz and Bautista played the villains perfectly and were enjoyable to watch on screen.\r Overall, Spectre may not be a masterpiece but it's still a good movie."
    },
    {
      "rating": "5",
      "text": "After the more serious focus on character and motivation in SKYFALL, director Sam Mendes again lets the movie's motivation drive the human side of James Bond (Daniel Craig). The plot is convoluted paranoia about worldwide surveillance, but it's not especially threatening (neither is villain Christoph Waltz). There are international locales, but none are special. The woman aren't memorable and the love scenes are underplayed. With the proliferation of action flix these days, it's hard to make the action exciting or inventive. None of these deliver much new and some even evoke earlier Bond movies. Craig is steely serious and has almost no dialogue with the typical 007 smirk. At a running time of 1:48, the momentum winds down well before it's over. There's the typical franchise flash, but little of it ignites much fire or fun"
    },
    {
      "rating": "4",
      "text": "Ridiculously boring, absolutely cliche, and very uninspired Bond movie. From a terrible song to a terrible Bond girl to the terribly under-recognized villain to awful fight scenes. The only thing redeemable about this movie is the fact that it has some very well shot pictures, but even then it has an awful mustiness to it."
    },
    {
      "rating": "7",
      "text": "60 out of 100 seems a little bit too hard for me. The first half of the film is as good as Skyfall or Casino Royal, which is as good as a Bond film can get. Then it suffers problems with the pacing and also a few silly situations and especially the way Bond gets out of them are a little bit weak. I´d give it a 70 out of 100.\rDaniel Craig is perfect as always, the supporting cast good as always, love Q and the whole team. The new Bond girl does a great job too in this film. Spectacular scenery and action as always, with so much class. You won´t regret watching it. The first 10 minutes are some of the best openings ever in any Bond film."
    },
    {
      "rating": "5",
      "text": "Craig still fits the role incredibly well and the use of practical effects and solid camerawork are present, but Spectre misses the mark on its plot, its attempts to be more campy than its last three predecessors, and its stunning lack of Christoph Waltz.  Spectre tries to match with the amazing Bond films like Casino Royale and Skyfall, but instead reaches the points of Quantum of Solace."
    },
    {
      "rating": "5",
      "text": "I am actually surprised by how disappointing this film is. The action is redundant and dull, the pacing is often too slow., the sub-plot is boring and the villain is too weak ( Christop Waltz did great but underused ). Mission Impossible : Rogue Nation executed it so well, but Specre simply failed to do so."
    },
    {
      "rating": "6",
      "text": "Spectre is a fun film that follows the Bond formula and gives you everything you’d expect. The film does get a little too convoluted later on. There are a lot of twists and turns for an epilogue that is quite obvious. Nonetheless, the hero, villain, girl, etc. are all well done and the film is well shot. Regardless of length or convoluted the film is still worth it if only for the opening sequence, which might be the best thing in the film. Not as good as Skyfall but enjoyable."
    },
    {
      "rating": "6",
      "text": "Great opening sequence before titles, but rest of the film was a relatively plotless hunt. Lots of nods to classic Bond set pieces, but ultimately a boring travelogue with guns."
    },
    {
      "rating": "6",
      "text": "Spectre was definitely a good film, but this is the case whereby the sequel did not pass it's predecessors . First of all the opening scene of the movie was great, it was well shot and fun but the tempo for the rest of the film went downhill from there.What this movie really had was solid performances, like Daniel Craig's  performance as James Bond(gold as always), Benjamin Whishaw as Q was also good, and  Ralph Fiennes as M who surprisingly filled Judi Dench shoes well, but Christoph Waltz as the villain  was rather disappointing,he never really feels like he is part  of the movie because his screen time is short and even when he is there he really didn't do much as Oberhauser(Blofeld), in the last act there was some hope, but all potential was wasted, don't get me wrong he wasn't a bad villain it's just that he didn't do much.The run-time of the film was okay for me, it didn't feel too long because of the chemistry between Léa Seydoux and Daniel Craig(even at times it felt a bit forced).Going in to this movie it was always going to be compared to Skyfall,which was amazing and going out of this film i wasn't as amazed, the plot was rather small compared to Skyfall making the risks not quite as big, which came off as a huge disappointment, but the film covered up with some one liner humour which the film pulled off so well and the action was okay not great but satisfying especially the car chase scenes which were awesome. Spectre was definitely not perfect, but i enjoyed this film, it tied up all of Daniel Craig's films neatly,came to a satisfying end, so overally not as great as Syfall but a good film in it's own right."
    },
    {
      "rating": "4",
      "text": "Clocking in at nearly, 3 hours, this movie couldn't hold my attention. Which is a shame since the Bond series used to be very engaging-special effects, hotties, etc. Craig \"called this one in\" with his acting, while the story itself (although LONG) was not very intertwined or fresh (\"james, they're gonna kick you out...you're suspended, etc). I'm glad I didn't spend two cents on this.Further, I hope the talk of a new James Bond is true, cause I can't watch more of Craig,"
    },
    {
      "rating": "4",
      "text": "Great choice to bring the humour back, after a couple of dark episodes; but, what with the Simpsonian couch gag and the usual convenient escapes, there's really no point in trying to keep the plot dark. What I mean is, Spectre suffers from double personality disorder: while the action sequences and the general way in which Bond manages to slink his way out of anything just by sheer luck are light-headed and cartoonish, one feels the underlying plot of international conspiracy a bit too harsh.\r On another note, I don't quite like this tendency to reveal details of Bond's past, as I feel his charm relies heavily on the mystery of it. Skyfall, for instance, was good as a one-off thing, but with Spectre delving further in, we might just now too much about Bond, now, for him to be still as intriguing as he was in the beginning.\r Daniel Craig confirms himself in a role that seemed unfit for him when Casino Royale came out - now it's difficult to find anyone who doesn't agree he was one of the best Bonds ever."
    },
    {
      "rating": "6",
      "text": "People who are giving this a 10 are the people who don't understand the point of the 0 - 10 scale. If they hate it they give it a 0. If they love it they give it a 10. For me this was a good movie, but not a great movie. The opening scene was the best part and unfortunately in a 2 and a half hour movie, isn't a good thing. The biggest problem is the villain. He's hardly in the movie and he just doesn't deliver. It was all very underwhelming. I couldn't even tell you the film's climax because it just seemed like they were going through the motions and it just eventually ended. Its a classic cat and mouse chase and as usual the villain instead of just killing the protagonist, plays games with him and makes it possible for him to escape. There were a lot of spy movie cliches. Car chases, shootouts, fist fighting and he gets the girl. Its the same old routine. It was an entertaining movie but I wouldn't put it at the top of my list. If you like Bond movies, go see it."
    },
    {
      "rating": "8",
      "text": "Spectre didn't reach the same heights that Skyfall did in my eyes; but it is still a solid Bond film in its own right. Skyfall afterall was the film that finally sold me on Craig as Bond. It was a pleasant surprise seeing a classic Bond nemesis return as well. Spectre cleverly ties together all of the Craig Bond films in a way other Bond films have never done. Craig's films have a continuity all their own and should Craig reprise the role for another film I look forward to seeing where they go next."
    },
    {
      "rating": "4",
      "text": "I am a James Bond fan. I couldnt' wait to see this one. The first hour is great but the last 30 minutes is flat. There are thing in this movie, that many other actions movies have educated us aren't realistic to happen but in this movie they do.... aaarruuggh. Instead of the action speeding up it is a mix of too fast or too slow editing with illogical relationships. The director Sam Mendes has lost his touch. Something went terriblly wrong in finishing this movie. Go see Casino Royale or wait until it comes to TV (so you can fast forward), or go to another movie in the last 30 minutes so the good feeling won't be wasted. Movies live and die by the endings and you can watch this one die in the last 30 minutes with absurdities. It insults my intelligence. If this wasn't a James Bond film it would be rated lower."
    },
    {
      "rating": "7",
      "text": "\"Skyfall\" it ain't, but it's still a generally entertaining installment in this long-running franchise. The action sequences, as usual, are terrific, and it's refreshing to see the overall story arc stretching from film to film. The inclusion of contemporary issues makes for smart and relevant storytelling, and the decision to involve supporting characters more in the overall narrative adds interesting new wrinkles. However, uneven pacing issues, an occasionally muddled script and plot devices that stretch credibility even for a James Bond movie really work against the film's strengths, keeping the picture from being as good as it might have otherwise been. It may be a bit of a letdown from the last installment in this series, but it's definitely not the end of 007."
    },
    {
      "rating": "3",
      "text": "I love Daniel Craig as 007. I loved Pierce Brosnan as well. If Pierce was a Formula 1 race car, Daniel would be a Top fuel dragster. Both fun to watch in different ways. Spectre took a Top fuel dragster and tried to run it in the Monaco Grand Prix. The story was disjointed bordering on incomprehensible. The plot, if you can call it that, was slow as molasses in January. 007 was popping up all over Europe in scene after scene after scene instantly wearing dozens of wardrobes GQ magazine would envy, and all with only a duffel. At first it was campy 007 artistic license, but for me it became so obvious it became a mild distraction. There were way too many Sherlock Holmes-esque slow motion meanderings occasionally punctuated by gun fights that reminded me of Westerns from the 50's & 60's when the bad guy fired a thousand blanks and the good guy's bullets were real and unerring. The realism was squashed and the campy approach had been made inappropriate. Even the million dollar luxury sports car chase was a waste of million dollar sports cars. They didn't know the kind of movie they really wanted, and neither did I. The last 20 minutes and I was looking at my watch."
    },
    {
      "rating": "8",
      "text": "Daniel Craig is for me one of the best Bonds we've had. Its a shame this is is last. He has tremendous screen presence and makes somehow believable what is fantastical in the Bond worldIt's the usual Bond formula. Aston Martins and style every man wishes he could have. Multiple locations, one desert and hot, one cold and Alpine, Rome ( where else..perfect) ,of course London  and  a great single shot opening sequence from Mexico city during the day of the dead festival. 2 1/2 hours flew by.I've heard some complaints about the new French Bond girl not being beautiful enough. I disagree and Monica Bellucci is stunning. Hard to believe she is 51.Slight grumble about Andrew Scott who plays Moriarty so well in Sherlock. They could have done a better job with him.All in All ..loved it.."
    },
    {
      "rating": "6",
      "text": "Spectre is uneven to say the least. There are scenes that are everything Bond fans could wish for, and there are scenes that are borderline absurd. The most brilliant thing about Spectre is the pairing of Daniel Craig and the glamorous Léa Seydoux. Those two make a beautiful couple with the most intense romantic chemistry, and if Craig were not already married, one would swear that he fell in love on the set. Seydoux brings out the best in Craig.\r Be that as it may, Spectre has glaring flaws. It would seem the producers, director, and writers had plenty of time to develop the script; nevertheless, the script is half-baked, and Craig does most of his acting during chase scenes and rescue scenes. His lines are terse and laconic, if not positively epigrammatic. Director Sam Mendes must have read the criticism about the female roles in Skyfall, because every Bond girl in Spectre (there are four of them!) is intelligent, fearless, and undeniably strong. Seydoux plays the main love interest in the role of Madeleine Swann, and although she fiercely denies being a damsel in distress, Bond has to rescue her at least three times (possibly four, if you count the train scene, where there is a question mark about who rescued whom). The first rescue scene in the Austrian Alps, where Swann is abducted by the bad guys, brings back the Bond of yore. Bond not only shows up on the tail of the bad guys who escape in their Range Rovers, but he is skillfully piloting a BN-2 Islander military plane commandeered on very short notice. Nothing in the script explains how he absconded so quickly with an airplane borrowed from the British Army. He simply shows up in the cockpit, and he proceeds to rescue Swann by crashing the plane. Unfortunately, it is precisely that kind of illogical plot with its preposterous premises that got Pierce Brosnan replaced by Craig in the Bond franchise.\r Naomie Harris is back with a strong supporting role as Moneypenny. Ben Whishaw as Q has an improved persona, and he is no longer just the kid who still has “spots.” Ralph Fiennes continues as M,  a role which he had just taken over at the end of Skyfall. He’s been rehearsing at home, it seems, because he has developed his M to perfection. Fiennes has turned M into a force to be reckoned with, at almost Oscar-level intensity and nearly out of place in a Bond film. We do not get to see enough of Monica Bellucci, now on record as the oldest Bond girl (age 50 at filming). She is dark, mysterious, and quintessentially beautiful, but her presence in Spectre is too brief. The fourth Bond girl is Stephanie Sigman, who hails from Mexico, and one suspects she nearly ended up on the cutting room floor. She shares an opening scene with Craig, who then leads her into a hotel room ostensibly to make love. Next thing she knows, he’s climbing out the window. She has one line for the entire film: “Where are you going?” And then she’s out. Christoph Waltz is not quite as evil as he was in Inglorious Bastards, but he gets scarier toward the end.\r Mendes tries to pay homage to classic Bond, but his directorial heart is not in it. Bond mistakenly asks for a martini, shaken not stirred, at a health bar where he is instead served a green smoothie for vegans only. The classic Bond car shows up as a brand new Aston Martin DB10 intended for Agent 009, but Bond steals it and trashes the magnificent vehicle in a canal in Rome. When Bellucci’s character asks him his name, he doesn’t say it with his usual austerity because he is too busy kissing her, so he is still panting when he says, “Bond. James Bond.” Not the same effect.\r Nevertheless, Craig is still handsome, dynamic, and charismatic. He’s good to go for another round, as long as he publicly apologizes for saying he would rather slit his wrists than play Bond again."
    },
    {
      "rating": "6",
      "text": "... Overall, \"Spectre\" has great action scenes and beautiful cinematography, but falls flat in its writing and plot, and becomes one of the biggest disappointments of the year."
    },
    {
      "rating": "2",
      "text": "I think I understand why Daniel Craig is sick of playing Bond.\r The film just feels tired and uninspired. It's like they took a formula of what a Bond film should have, threw in a bunch of cliches, and called it a day. The plot is boring, predictable, and full of holes.\rThe last 30 minutes in particular are absolutely laughable and make zero sense.\r There aren't even any action sequences that stand out in the film, they all feel completely bland and forgettable. By comparison, you can watch the action scenes from Casino Royale multiple times and they're still amazing.\r There is NOTHING memorable about this film at all."
    },
    {
      "rating": "7",
      "text": "While Spectre delivers on style, compared to Skyfall it lacks some substance.  Don't get me wrong this is still a pretty good time, but compared to Skyfall and Casino Royale I wanted more.  B+"
    },
    {
      "rating": "5",
      "text": "Spectre is admittedly an underwhelming and unsatisfying watch that is filmed with Bond fandom to try keep die-hard fans interested.\rStill a far better watch than QoS, it is far inferior to Casino Royale and Skyfall. The opening tracking shot of the day of the dead Mexico setting feels like a clear but lovely hint of foreshadowment for a hopefully depressing and dark instalment of the Bond franchise, but it doesn’t lead up to anything. The action sequence here is relatively entertaining, and is shot well with a few bits of added comedy but fails in comparison to CR and Skyfall.\rFrom here on out with have too much half assed moments. A car chase which isn’t exciting but more made for comedy, an Oberhauser (Waltz) who is horrendously under used, a menacing bad guy (Bautista) who is like the Darth Maul of Bond villains, and action set pieces which are trying to be big but don’t really excite. The plane sequence down the mountain is actually quite boring to be honest, and the train fight is pretty cool but just doesn’t end well; you can easily see what’s going to happen. The relationship between Bond and Seydoux’s character also seems rushed, forced and unbelievable, and to top things off the final sequence of the film is just such a punch below the gut, wholly unsatisfying. Even certain deaths of this film (almost all) are just underwhelming and not memorable, it’s like their deaths were written in as an after-thought in the script to get them out of the way.\rDaniel Craig is still pretty charming as Bond in this film but still he can’t save the film. Also, Monica Bellucci’s character was completely dumped as soon as she was introduced, asking the question why did they promote her when they announced the cast if she has about 2 minutes of screen time.\rA very unsatisfying end for Daniel Craig to go out as Bond. Hopefully he will return just one more time.\r4.9/10"
    },
    {
      "rating": "4",
      "text": "Slickly done and good performances from the main actors. However Mendes misses the point of James Bond again and does not allow the characters to develop or shine. The whole story is just a rehash of James Bonds greatest hits and 'homages'. Please let this be the last. I can understand that Daniel Criag's had enough."
    },
    {
      "rating": "9",
      "text": "Spectre was great. Bond fans will love the call backs to other bond films. I wish we would've seen more of the villains motives and less of that jaws like character"
    },
    {
      "rating": "7",
      "text": "In Spectre, as in The Dark Knight Rises, here is a film as much anticipated as it was doomed from the outset. For Bond's latest outing and in reference to The Batman's most recent adventure, Spectre follows directly on the heels of, and was perhaps unfairly expected to top a series best.\rSkyfall, like The Dark Knight, delivered the knockout punch critics, audiences and the box office were all screaming for. After the success of both films, their respective studios and the film makers involved were tasked with what must've seemed like mission impossible; recreate that same magic whilst giving audiences something they had never seen before.\rCut to 2015 and Spectre arrives, much like The Dark Knight Rises did back in 2012, to mixed reviews, diminished expectation and division among it's series fans.\rBut is it all doom and gloom? No. While the film itself is not quite the well oiled machine it's predecessor was, and although it's stab at tying up all that has come before is thinly executed and is therefore annoyingly less than convincing, Spectre is however a worthy entry in the Bond cannon and the Daniel Craig era of Bond films. It succeeds in scope as a globetrotting action adventure, it is beautifully photographed and it's set pieces rival if not better much of what has come before, particularly it's pre credits sequence.\rUnfortunately, like the film I've referenced here and for all that Spectre does have going for it, it will forever live on in Skyfall's shadow. Watchable, fun, sexy and cool but achingly and perhaps annoyingly running a close second to Craig's best."
    },
    {
      "rating": "7",
      "text": "Despite the fact that Spectre is undoubtedly so far the most popular movie of 2015, it seems that neither critics, nor the audience really appreciated it. That's probably because this is the most dark and thoughtful James Bond movie.\rFor the first time in Bond history the bad guys are not just one ridiculous and eccentric person (ex. Goldfinger) but a massive network of legitimate companies and white collar criminals. The enemy is in fact modern capitalism. The main themes in Spectre is that you can't really divide humanity into good and bad guys and that Information is today's most valuable asset. This is the first Bond movie that parodies itself, since even the use of the special agents is put under criticism. Bond operates under no authorization and seems powerless against this massive conspiracy like a \"kite dancing in a hurricane\", as one of the bad guys states in the movie. Moneypenny is now black, Mr Q is a young hacker and even the \"bad guy\" is using technology and not muscles to torture Bond. In a nutshell this is the most modern movie of the series. Sam Mendes' direction is a bit different and strange (what did you expect from the guy behind American Beauty?), Bellucci becomes a Bond girl just for a night, Lea Seydoux is sexy, Daniel Craig is (as always) tough and sarcastic and Christoph Waltz is just fantastic (possible oscar nomination). Worth mentioning is that Spectre features a great sense of humor that lacked earlier entries. All in all those new elements mixed together in this modern James Bond version give a new breath of life to the series but might puzzle the old school action driven fans. Still, there is plenty of action in this film and Bond always manages to succeed in an explosive way, just to make sure that the series remain on track."
    },
    {
      "rating": "7",
      "text": "A little more humor from Craig this time, not all seriousness. He's still shaping the character. The opening scene is spectacular. One of the best Bond openings. It's a drawn out shot, a long sequence, and it sucks you into the movie, wham, you're there. Make sure you go see it in a theatre with a great sound system.  It's a long film, almost 2.5 hours, for better and for worse. Mostly for better. In Quantum of Solace, the pace was so high it just blurred by, all action, bang, bang, bang. SPECTRE is more drawn out affording to linger in certain scenes, giving more texture, more detail, more the feel of what it's like to BE there. It's what makes Bond Bond, time for a drink, time to take in the scenery rather than only breathless action. Sam Mendes, and his cinematographers have brought real beauty to the Bond franchise. Nothing beats Deacon's color palette in Skyfall, however. I miss his cinematography in this film. It would have heightened the beauty of it more than van Hoytema's love of grainy images. It's not bad, yet I think Deacon would have made more of it. Other improvement points? I had huge expectations on outrageously skilled Christoph Waltz, but he's sort of not capitalized upon. He begins well, and he's creepy but it doesn't go beyond that. Javier Bardem was sensational in Skyfall. A tough act to follow, perhaps? I get the feeling it's the script that holds Waltz back. There's not much in it. In fact that's the major issue: the Bond movies need better scripts. They shouldn't start until  there's a rock solid story. In addition, perhaps it's time to bring in some more evil forces, real scary stuff, going on in the world, rather than villains who seem sort of harmless, even though they're creepy. As for Léa Seydoux, she's great and plausible in her role. Great natural looking make up as well. Only a few faux pas, also script wise (no details, don't want any spoilers). Lastly, the title song. I remember reacting to the song, really listening during the opening. I wasn't sure whether it was a man or a woman, or both. Captivating. Sam Smith's singing is fantastic. All in all, what stays in my mind after this film is really the opening, the laughs, a sweaty sequence in north Africa, and the feeling it was worthwhile to see it for its entertainment value."
    },
    {
      "rating": "8",
      "text": "Spectre was a very entertaining film which adds new elements to the Bond saga and brings back some aspects of earlier bond films. I liked that Bond, even in the face of his doom, was unwavering in his quest in this film. The film peers a little more into Bond's upbringing and factors of his pre secret agent past. Much like some of the earlier Bonds (Roger Moore, Sean Connery, Pierce Brosnan) there were always some silly moments for comical relief. They had removed most of those from the Daniel Craig era, but have brought some of that back in this film which I liked. The movie still maintains the adrenaline of high stakes situations by displaying the brutal possibilities James could face. I found the film to be suave and entertaining, however I will deduct a couple of points for a few times when things were a little too convenient to be realistic, but not deal-breakers by any means. Go see this for sure if you are a Bond fan!"
    },
    {
      "rating": "6",
      "text": "Bond is bland. Chasing chasing chasing, womanizing, chasing chasing chasing.  There is one fight scene that is amazin.  Other than that, meh.  This is no Skyfall. But I still love 007."
    },
    {
      "rating": "9",
      "text": "Excellent mixture as always, Craig at is best, gorgeous voir splendide panorama, good twisted scenario and you get the BOND SAUCE.\r 2 Hours 30 minutes pass so fast , i had a great time with my son and is friend , really great souvenirs to remember!\r The only false note : Monica Belluci !\r Two thumbs up for the vilains, i realy appreciate the darker side of Blofeld !!!!\r Bond will always be Bond , don t expect they change the recipe !!!! lol"
    },
    {
      "rating": "7",
      "text": "As my first proper exposure to Bond, I didn't agree with most criticisms people had (like how much of a rehash it was). That's probably why I enjoyed it so much, apart from the good performances from Daniel Craig, Ben Wishaw, and Christoph Waltz. Apart from a few flaws, and its surprising similarity to Austin Powers 3, SPECTRE is a truly fun and enjoyable flick."
    },
    {
      "rating": "8",
      "text": "A film that needs no introduction, Bond lovers get yourselves to a cinema pronto and see one of the best James Bond movies yet. If you thought it couldn't get any better than Skyfall you were wrong, this is everything a Bond movie should be and more. The very first scene reels you in instantly and keeps you there for all of the 148 mins. The longest, biggest Bond movie to date.\rChristoph Waltz an exceptional villain matched with a unique henchman, flashy cars, great fight scenes and Daniel Craig being Daniel Craig, need I say more. Highly recommended."
    },
    {
      "rating": "8",
      "text": "The critics rate this as the third worst Bond film ever, but don't let these put your mood down on wanting to watch an action packed film. The action and stunts are fun to watch, as the film gets you hooked on Bond escaping the clutches of Christoph Waltz's men, protecting the brilliant Lea at the same time or chasing an important character who has the capability of executing a terrorist attack. The story has an interesting touch, one to still not let go of previous Craig Bond films, maybe the scripting could've needed a bit of work. Other than that, the actors were great, the action was awesome, and I highly recommend if you can, IMAX. Spectre may not be up there with Skyfall and Casino Royale, but sill not only better than the accident that was Quantum of Solace but around the middle pack of Bond films."
    }
  ],
  "recommendations": [
    "quantum_of_solace",
    "the_world_is_not_enough",
    "no_time_to_die",
    "casino_royale",
    "tomorrow_never_dies",
    "mission_impossible_rogue_nation",
    "creed_ii",
    "skyfall",
    "for_your_eyes_only",
    "die_another_day",
    "mission_impossible",
    "mission_impossible_ghost_protocol",
    "boss_level",
    "sherlock_holmes_a_game_of_shadows",
    "mission_impossible_ii",
    "ant_man_and_the_wasp_quantumania",
    "the_bourne_legacy",
    "thunderball",
    "angel_has_fallen",
    "the_magnificent_seven",
    "spider_man_far_from_home",
    "the_equalizer",
    "avengers_age_of_ultron",
    "the_bourne_supremacy",
    "top_gun"
  ]
}