{
  "id": 3255,
  "title": "Species II",
  "starring": [
    "Michael Madsen",
    "Natasha Henstridge"
  ],
  "runtime": 93,
  "genre": [
    "Science Fiction",
    "Action",
    "Horror"
  ],
  "description": "Having just returned from a mission to Mars, Commander Ross isn't exactly himself. He's slowly becoming a terrifying alien entity with one goal -- to procreate with human women! When countless women suffer gruesome deaths after bearing half-alien offspring, scientist Laura Baker and hired assassin Press Lennox use Eve, a more tempered alien clone, to find Ross and his brood. Before long Eve escapes to mate with Ross.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bTZOYPnbnTaeiiybtByzWkeb1Gl.jpg",
  "categories": {
    "plot": 1.0,
    "acting": 1.0,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 1.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Oh my goodness,    this is one of the most stupid movies    EVER.................."
    },
    {
      "rating": "1",
      "text": "Species made in 1995 had everything, some humour, sex, nudity, gore, action and violence and was beautifully directed and and made and it felt interesting and entertaining.... A few years later in 1998 we had SPECIES II which is a sci-fi horror sequel and I've seen this movie. Michael Madsen, Marg Helgenberger and Natasha Henstridge from the original made in 95 return for this sequel. Some astronaut gets infected with alien DNA after some mission to Mars then starts mating a dozen women when he gets back to earth and 4 minutes later the women give birth with their stomach's popping open and blood all over the place and alien babies sticking their head out of the dead women's stomach's.. Justin Lazard is the man infected with the alien DNA and he's the main character unlike the original it was Natasha Henstridge as the alien seductress and she returns in Species II as some half human/half alien named Eve with Justin Lazard as the alien main character not her.... Like the original Michael Madsen and Marg Helgenberger hunt it down but Species II even with all the gore, blood, excessive violence, action, sex scenes and Natasha Henstridge fully naked still felt dull and uninteresting and basically ugly compared to the original. Species made in 1995 was gorey, bloody, had action and violence and nudity and sex scenes but it felt interesting to a degree and entertaining and beautifuly directed and had a fairly decent story. Species II was just an ugly mess and even a few naked pornstars couldn't save it let alone a fully naked Natasha Henstridge because Species II even with all the violence and sex and nudity was still crap and even the sex scenes were rubbish which is laughable. Species II just feels horrible, depressing and an ugly mess compared to the original and a step down in quality. Justin Lazard can't act to save his life and Species II is one of the worst sci-fi movies ever made and certainly one of the worst sequels in film history. Horrible and crap film."
    },
    {
      "rating": "1",
      "text": "It's laughable that anyone would give this movie a 10 score.  What were you thinking? Watch the first one, forget the rest."
    },
    {
      "rating": "7",
      "text": "SPECIES IIAlthough it's not actually a good movie this creative sequel with a super hot astronaut who comes home to earth infected and begins mating is a trashy, fun overly entertaining genre monster fest. Natasha Henstridge pregnant at the time of filming is back as Sil who is his number one target. The special FX are awesome and the creature design is inspired. Unlike the superior original it doesn't take itself seriously which is a good thing because the screenplay is not as well written. That being said the movie flows well moving from one gory setpiece to the next and it's never boring.7/10"
    },
    {
      "rating": "10",
      "text": "Its a fun B Movie nothing more and nothing less, great creature effects but some really bad script writing."
    },
    {
      "rating": "4",
      "text": "Species 2 may have some cool scenes throughout this movie, but overall it was flawed and dull. It had bad acting, and a predictable, awful ending. C-= 42 (4.2/10 rounds to 4/10)"
    },
    {
      "rating": "4",
      "text": "Es más entretenida que la primera y tiene mejor ritmo, es lo único que se puede rescatar de esta absurda secuela, o sea, no me cabe en el cerebro que a expensas de todo lo ocurrido en la primera parte hayan creado a otro híbrido alienígena con el ADN de Sil sin ningún motivo convincente, tampoco me cabe todas las estúpidas ideas que le siguen, como la de enviar gente a Marte sabiendo el tremendo riesgo que eso significaba y que el único propósito de dicha raza alienígena sea aparearse como perros en celo apenas si funcionó a la primera, pero a la segunda ya se vuelve predecible."
    },
    {
      "rating": "0",
      "text": "This movie is STUPID! The ending left everything up in the air paving the way for a Species 3; thank God that never came about."
    }
  ]
}