{"id": 4006, "title": "Speed Racer", "starring": ["Emile Hirsch", "Christina Ricci"], "runtime": 135, "genre": ["Family", "Action", "Adventure", "Comedy"], "description": "Speed Racer is the tale of a young and brilliant racing driver. When corruption in the racing leagues costs his brother his life, he must team up with the police and the mysterious Racer X to bring an end to the corruption and criminal activities. Inspired by the cartoon series.", "releaseYear": "2008", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/x800OyHuJ9JDuhHLtdPLkH1vBjw.jpg", "categories": {"plot": 8.842105263157896, "acting": 9.0, "ending": 9.0, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 8.0, "funny": 10.0, "action": 9.6}, "reviews": [{"rating": "1", "text": "Sneek preview was awful. Can they fix it before wide release. Almost comically bad. Lots to make fun of. You might want to go high."}, {"rating": "0", "text": "A dizzying mess of colours. A film with nothing in it - no heart, no soul, no cinema. A film which really should not appeal to true anime fans as it fundamentally and obnoxiously misunderstands the genre. Hard to follow. Basic rules of what the eye can follow on screen are forgotten. Headache inducing and pointless. Incompetent. Will infuriate adults, and the patience of children will be tested through the pointless and overcomplicated lectures about stock-prices and economic forces. A talented cast are wasted, and are evidently as bemused by this film as most of the audience will be. In short, why?"}, {"rating": "0", "text": "Another Hollywood CGI-filled piece of CRAP."}, {"rating": "0", "text": "Bad film. Bored. Bad history. Xtremely confused action. too much colors to enjoy the action. is a pity that the original comic was destroyed for Wach brothers..... I spect some better from they. I hate you, wachosky brothers!"}, {"rating": "10", "text": "I really do not understand the critics on this one. So many critics refer to the jaded nature of the film, when it appears, they are in fact the jaded ones. I was dragged to this movie by my 3 boys, aged 7, 5, & 4. They all loved it and never have they all sat through a 2 hour long movie without once becoming bored. I went in expected what the critics said, and was completely surprised and blown away by the movie's entertainment and quality. It wasn't until after I saw the movie that I checked out my own local paper, The Dallas Morning News, which awarded this movie an A. This movie was top notch, and I highly recommend everyone to ignore the critics on this one."}, {"rating": "10", "text": "Like all progressive movies, Speed Racer has very bad reviews and critic. Maybe because it´s critic of capitalistic system of America directed by two brothers for major studio. Speed Racer is played anime or manga, with over-playng actors and narrative complexity - flashbacks with flashfords, change of point of view in one race! Little editing, maximum use of 36O° place orientation and combination of 2D and 3D. It´s masterpiece!"}, {"rating": "10", "text": "Speed Racer is visually groundbreaking and yet still hits all the right buttons emotionally...very good movie!"}, {"rating": "10", "text": "Excellent family fare. Great message. A winner."}, {"rating": "10", "text": "Not sure what movie the 'critics' saw but this was a great story which brought to life the cartoon while improving the visuals and offering pure heros in a difficult environment. Shockingly, even my wife liked it!"}, {"rating": "0", "text": "Most definitely the worst drivel I have ever seen on the silver-screen."}, {"rating": "10", "text": "This is an excellent adaptation of the original series. In fact, it not only draws from the original but improves upon it, featuring amazing car combat scenes and some of the most exhilarating racing visuals ever done. It takes the best from the original and condenses it into a modern, hyper-real action flick that's like nothing else Hollywood has ever done. My biggest concern was the length of the movie, but I was relieved to find out that there's hardly any filler dialogue in this movie: there are plenty of action sequences, and the races take a good portion of the movie. It's crammed with the stuff that matters. There's a plot in there too; a seemingly thin veil that pulls all the action sequences together. What surprised me is that it not only treats the source material respectfully, but it adds just enough to give it a new, engaging twist. Yes, you know the hero probably triumphs: the fun part lies in watching how the good guys manage to win. Don't go watch it expecting a live-action movie: look at it as a psychedelic racing animé that's fun for everyone, and certainly out of the ordinary."}, {"rating": "10", "text": "The best movie I've seen in a while. It was like an orgasm in my eyes."}, {"rating": "9", "text": "I loved it, great story, funny, and best of all the racing was crazy."}, {"rating": "10", "text": "LOVED THIS MOVIE. CRITICS SUCK! This is a movie with truly great writing and a great new style of computer graphics and live action combined. I realize that you have to suspend your disbelief and buy into the storyline to appreciate it. There were some great monologues in that movie done beautifully cinematographic-ally and acting wise."}, {"rating": "10", "text": "Excellent movie! Wachowski brothers really know how to take risks to produce the best entertainment movies ever seen !!"}, {"rating": "10", "text": "Great graphics and action. Best so far in 2008. Worth watching, don't listen to people who don't know squat."}, {"rating": "10", "text": "The Wachowski brothers see the world with laser eyes, they are able to cut through all the bullSh** and question the driving force of this world, which is MONEY. This movie is about breaking chains and beating down the MAN, it has a pro family, anti capitalist message that many critics and corporations obviously did not want a younger audience observing. I am 21, i thought it was an amazing movie with an amazing message, backed by visuals never before conceived by filmmakers. dont let the slander campaign led by the Wall Street Journal fool you, this movie was made for the people, not the man."}, {"rating": "10", "text": "I went in thinking \"Well everyone hated this but I might still enjoying it.\" I came out thinking \"WHY DOES EVERYONE HATE THIS?\" I can't really describe what it was that I really liked about this, as a whole it just came across really well. Entertaining, genuinely funny and family friendly (GASP!). The World needs more films like this."}, {"rating": "10", "text": "Speed Racer is a movie about who owns who. Before you see this picture, read all those scathing pile-on critical reviews. The, do yourself a favor and watch this very hip movie. You'll be glad to have seen it on the big screen. If you're an old fart and your yarbles haven't shriveled up, remember eating three bowls of sugar cereal and watching the early-morning cartoon, and then running around the yard singing the addictive theme song. 'Cause it just nails that. When it's over, think of the Wonder that is Hollywood Distribution. And who owns who."}, {"rating": "5", "text": "The films suffers a lot from its feelings of fake like elements and advance technology that distinctly feels different from its television show; similar to the Star Wars prequel franchise, but despite the slightly weak and dark plot, the film works okay. The narrative and acting was subpar, but I couldn't help to admit that the racing scenes were good. Though it takes a darker turn to a cartoon that is more lighthearted, it works a little in its favor, but also works worse in its favor as well. \"Speed Racer\" may suffer from its narrative and usage of technology, the film has dark twists and a nice racing sequence."}, {"rating": "10", "text": "It's more than a year after this movie was released. Few even knew there was a Speed Racer movie it seems, and even fewer cared to see it. I was one of those people and oh boy, am I ever sorry. A trailer means NOTHING for this type of movie. While one their own, certain scenes might appear unwatchable and the dialogue too sappy for most, as a whole this movie has escalated to the top of my list of favorite movies in the past couple years. I can't get it out of my head. The shmaltz, the eye-ravaging colours, the exhilarating soundtrack, the heart pounding races, and the comic genius --- When you become obsessed with everything related to a movie, you know it was something special. If you're gut tells you to avoid this movie, it's probably just gas."}, {"rating": "3", "text": "This is a disservice to even fans of the original Speed Racer cartoon and any references (which are too many) to the original are painful. The effects are weird and unfitting and don't suit the original series."}, {"rating": "8", "text": "This Christmas, my brother and sister-in-law gave me a $35 gift card to Target.  To date, I've spent $2.75 of it.  Speed Racer on Blu-Ray at clearance price.  Honestly, I saw the previews several years back and thought it looked, for lack of a better word, stupid.  That's why I never bothered to see it.  But after having bought it at bargain basement price and watching it, I am pleasantly surprised.  My review score is 8 out of 10 simply because of length.  I agree with reviewers who claim it is too long.  It is.  But that's the only flaw I could spot.  I sit back and let myself enjoy this film for all it set out to be.  From the opening sequence of brilliantly blending Speed's present with older brother Rex's past to the psychedelic special effects and standout color scheme that added to the quirkiness and hilarity of the film to the heart of the story raising family and virtues above greed and power, I loved this film.  I often do not understand comparing new to old, revamp to original, which is usually where a lot of negativity creeps into reviews for films like this one.  Taking the film as a standalone, it is original and full of heart, and if one allows oneself the pleasure, they can have a lot of fun watching.  I thought the cast was picked well, and all played they're roles perfectly.  Do yourself a favor, and go rent or buy this film for your own viewing enjoyment, or sit and watch it with the whole family.  It's a crowd-pleaser for any age."}, {"rating": "9", "text": "A gas! Beaufiul, manic and just a wee bit too long."}, {"rating": "10", "text": "This movie was unbelievable. the attention to detail was uncanny and the story was done very well. It took the original anime and really transformed it."}, {"rating": "9", "text": "Considering the source material for the movie, I don't think the Wachowski's could have crafted a better film. I was prepared for the worst, and came out of the film with the biggest, stupidest grin on my face since...well...I don't remember. I normally follow the general critical consensus when deciding what movies to see, but I noticed that there is a definite divide between the critical consensus and the moviegoer's consensus on this movie. It's not deep, meaningful, moving, or thought-provoking. It's not an angsty re-envisioning of the story. It does EXACTLY what the original Speed Racer anime set out to do, and that is mindlessly entertain you. On that note, I haven't seen a movie as mindlessly entertaining in Speed Racer in years. Don't listen to the critics. I think they're waiting for the second coming, when Speed Racer already lapped them at 750 kilometers per hour."}, {"rating": "10", "text": "this movie was amazing. Its inspirational, the message is great, the storyline and characters are awesome... Its like one of my favorite movies now. The style they did it in was absolutely amazing too."}, {"rating": "10", "text": "It's a (master)piece of art. Futurist art: cars, speed, 'intuition' (Bergson)...\rAnd it could be a perfect 'prequel' of 'The Matrix' trilogy: from the problem of Choice... to the problem of Motivation..."}, {"rating": "8", "text": "Completely stunning. The critics are right in that the narrative was simple and the acting nothing to write home about, but they aren't bad. The whole film feels anime, the black and white story line, the typical characters. It hit what it's supposed to be right on the nose. Incredibly fun and beautiful, a summer film."}, {"rating": "7", "text": "A pure, technicolor spectacle that, despite its flaws, is pretty much impossible to resist. The Wachowski brothers might have their shortcomings as writers, but they always know how to make a movie that is fun to behold."}, {"rating": "9", "text": "I've been a huge fan of the Speed Racer series ever since I was a little kid and I am almost certain that that is why I absolutely loved this film. The movie knows that it is an homage to the anime that's why it doesn't mind throwing a few conventions out the window in spite of a few people not getting it. The cast fits almost perfectly, the races are really well done. Everything fits a live representation of the anime. However, I believe that the creators knew that their target audience would be fans of the series who hadn't really watched the show since they were 10 or 12 and didn't change that target throwing in lot's of kid-friendly plot and slapstick humor. Overall though, the only thing missing out of the show was a speed crank up for the dialog."}, {"rating": "10", "text": "A fun ride what eles did you expect!!!!!!!!"}, {"rating": "9", "text": "SO GAUDY!!!"}, {"rating": "9", "text": "Flat out amazing. All the reviewers that said it was stupid and childish are too stuck up to realize its not a serious movie. All it sets out to do is create creative and lovable characters and dynamic and pulse pounding action. The final ten minutes are literally breath taking and I think it finishes better than most movies I have seen lately. It creates lavish environments and over the top action to make one of the Wachowski brothers best films."}, {"rating": "7", "text": "I agree with the Onion reviewer...experimental, tests the limits of visual perception. It's insane, wacky, oftentimes really bizarre, sometimes eye-rollingly corny, but audacious and worth a look at the theater (as long as you're not an epileptic or you aren't prone to severe motion-related sickness)."}, {"rating": "9", "text": "Speed Racer. The film is full of heart, vivid imagination and some of the most exciting action sequences I've seen in years. It presents a visual onslaught as unique as it is unrelenting. How the Wachowski's convinced studio execs to get this movie made I will never know but I commend them for making this film, and this is coming from someone who wasn't particularly a fan of the Brothers last 2 films. The story and characters are literally straight out of the original cartoon, thanks to the excellent cast. Of course, the visual effects are in a league of their own and the Wachowski's show that they understand not only the source material but the anime medium as well. This is as faithful an adaptation as you could expect, you can tell that this is a film made by people who truly appreciate what they are adapting. This film will apeal to kids, it will appeal to long time fans of the original series, and it will appeal to adults who still haven't completely buried that kid deep down inside of them. Without a doubt the most unique movie you will see this summer. Please go out and see this film as it merits for audiences to experience it and make up their own mind about it."}, {"rating": "10", "text": "I am starting to think that critics are using their emotions when they write about any movie. I saw the other day at tvguide a massive negative critic about speed racer that shock me, because she wasn"}, {"rating": "10", "text": "The critics do not know what they are talking about. This is a great movie and lots of fun. You don't have to be a product of the 70's to like this film. I took my whole family and the general consensus was \"Totally Awesome\" and \"Wonderful\". It has everything you would put into a \"Speed Racer Movie\" and more. I remember the critics said the same type of crap when they reviewed Star Wars, and we all know how well that series did. I hope the Wachowski's make a sequel to this Masterpiece. \"Go Speed Go\""}, {"rating": "10", "text": "I have not seen this movie yet!!! I watched the original cartoon on reruns as a teenager in the 80s, and loved it. I was dressed as Speed Racer this past Haloween, walking around the Las Vegas strip with my wife and son. I can't wait to see the movie!!! It's not that movie critics are arthouse or whatever. Art poses the question to the audience of placing creativity and wonderment in things that have happened. Just as I am doing in this critique of the critics. Like the general criticism of formulaic movies, a reviewer's review can be not art."}, {"rating": "8", "text": "Great movie. Like nothing else I've seen, and refreshing."}, {"rating": "9", "text": "The writing in this movie is at worst redundant and, at best, ridiculous. But that's really not what it's about. It's all about the amazing spectacle and the absurdity of how over-the-top it is. If you go into this movie expecting to take something serious away from it, you are going to be sorely disappointed."}, {"rating": "10", "text": "I have a difficult time comprehending how someone could hate this movie so much. If you want to see a serious, deep, or meaningful film, you don't go and watch a movie based on the cheesiest, corniest cartoon that has ever entered pop culture. This movie is visually breathtaking and a wholly entertaining piece of film; by far the most exciting film I've seen all year."}, {"rating": "10", "text": "The critics will pan this, but most of those critics probably didn't like the cartoon (or perhaps, based on the few reviews I've read, they've never even watched it). The movie is very true to the spirit of the cartoon -- it's got shallow intrigue, crazy races with crazy obstacles and impossible physics, tommy guns, Chim Chim and Spridle saving the day, and staccato dialog. There was no attempt to modernize the characters or make them edgy or \"extreme.\" There was no darkening of the mood or story. This is a fun movie with a light, goofy spirit -- much like, I don't know -- THE CARTOON IT WAS BASED ON. If you appreciated the cartoon as much as I did, you'll more than likely enjoy the hell out of this. If you're looking for \"The English Patient,\" then don't go to see a movie based on a cartoon. Critics may pan this, but it will stand the test of time and I guarantee, if nothing else, it will be a cult classic."}, {"rating": "9", "text": "It might be kiddish, it might be something out of this world, but anyone who has lived in the 70s and saw the anime when he was still a kid, will love to see something he used to watch on a Tube Tv. The Wachowskis Brothers outdid themselves in this new Masterpiece."}, {"rating": "10", "text": "I thought with the exception of a few lengthy monologues this film was perfect! It went beyond fulfilling its own purpose and created an amazing movie going experience."}, {"rating": "8", "text": "A visual movie unlike anything before it. The story of a small independent company up against the big conglomerate that tries at every moment would surely get a thumbs down rating from the Rupert Murdoch owned Wall Street Journal. A great family movie that shows with pure intention and sound will there is nothing stopping you!"}, {"rating": "10", "text": "This movie was amazing. I loved it. No reason not to. AMAZING movie to bring your kids to. Great values, fun ride. I do not understand why people hated it."}, {"rating": "9", "text": "I find it a little discouraging that the 'professional' movie critics are too bedazzled and too stubborn to see a breakthrough when it smacks them in the face. Speed Racer is new... It is fantastic... It is a PG film that is a spectacle and a wonderful example of a new generation... Just because it moves too quickly for the critics to keep up doesn't mean that the target market (kids) won't get a better understanding..."}, {"rating": "10", "text": "I'm genuinely sorry to see such low reviews by the critics for this movie. I would hope that most people who are familiar with the Speed Racer series would be able to appreciate that this is one of the sincerest, most carefully done, and true to the original big screen adaptations of a cartoon / comic book series that has been done in the past few years. The casting for each of the roles (Trixie, Racer X, John Goodman as Speed's Father) is near perfect, quite authentic, and definitely amusing. I don't see what more you could ask for from a movie adaptation of Speed Racer: perhaps the critics would appreciate something more heavy-handed and less tongue-in-cheek."}, {"rating": "10", "text": "This is absolutely shameful that the critics have killed this beautiful film. These brothers have made history with this cinematic marvel. On what backwards planet would somebody rate this movie low? Are you expecting a Brokeback Mountain or a La Vien Rose? I have great taste in film ranging from Murials wedding to Fay Grim. Take my word for it. All though this is a movie that would entertain anybody with a soul, this is a kids movie. It should be rated as a kids movie. in fact... no. This is not a kids movie. Its a movie for anyone who appreciates perfection. I cant say enough about this wonderful film. It is solidified imagination. Perfection."}], "recommendations": ["the_lego_movie", "tmnt", "my_little_pony_the_movie", "tomorrowland", "zootopia", "warcraft", "ready_player_one", "john_carter", "beowulf", "paranorman", "bright", "the_13th_warrior", "morbius", "vanilla_sky", "atlantis_the_lost_empire", "smurfs_the_lost_village", "chappie", "minions_the_rise_of_gru", "sonic_the_hedgehog_2", "serenity", "ratatouille", "free_birds", "guardians_of_the_galaxy", "ralph_breaks_the_internet", "shaun_the_sheep_movie"]}