{
  "id": 1147,
  "title": "Spencer",
  "starring": [
    "Kristen Stewart",
    "Jack Farthing"
  ],
  "runtime": 117,
  "genre": [
    "Drama"
  ],
  "description": "During her Christmas holidays with the royal family at the Sandringham estate in Norfolk, England, Diana decides to leave her marriage to Prince Charles.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7GcqdBKaMM9BWXWN07BirBMkcBF.jpg",
  "categories": {
    "plot": 4.1,
    "acting": 6.580645161290323,
    "ending": 5.0,
    "soundtrack": 8.5,
    "cinematography": 8.25,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "kristen Oscar nominee and winner soonshe is the momentwe love to see it she is an it girl"
    },
    {
      "rating": "9",
      "text": "Kristen Stewart is the absolute star of the film and that makes it wonderful. The space, the shots, the colors, the costumes, a magnificent experience from a point of view that we are not used to witness. The only downside are the metaphors, which sometimes become too obvious."
    },
    {
      "rating": "10",
      "text": "A film that breaks the conventions of a biopic by taking a real person and placing them in a real life event while being abstract and looking at how the person thought instead of how the people around her felt. It’s everything I wanted it to be and more. I have to say that Kristen Stewart’s performance as Princess Diana is absolutely amazing. It’s my favorite performance of the year so far and absolutely deserves the Oscar for Best Actress next year. Stewart is unrecognizable here and I loved that. All of the other performances were great as well especially from Timothy Spall and Sally Hawkins. The costumes are on point here. Each of them helps contribute to Diana’s mood and tone of the overall scene which was amazing. The costumes help us understand Diana’s mood and what she is thinking without directly telling us. The direction, cinematography, and writing are all amazing as well. Pablo Larraín does an amazing job at showing and not telling us Diana’s mood unless it was absolutely necessary and his style contributes greatly to the final product. The writing does a fantastic job at showing us someone who is crumbling under the weight of being a member of the Royal family and feeling the need to just run. The cinematography looks stellar here. It looks like a film that came straight out of the 1990s in a good way. The music has a jazzy feel to it which helps us show the impulsiveness of Diana in this film. I also loved how we get almost dream sequences here where we see how Diana is feeling and what she wants to do. Those scenes feel very uncomfortable at points and it works beautifully. All of these qualities come together beautifully to show us the inside of Diana Spencer. Please go check this out when you can but know it’s a much more different kind of biopic."
    },
    {
      "rating": "10",
      "text": "Kristen Stewart is AMAZING!!! Beautiful storytelling, thanks Pablo Larraín for one of the best movies of the year"
    },
    {
      "rating": "8",
      "text": "Stewart Captured Diana's soul and her body language, her performance is more credible than Emma Corin's take, on the crown."
    },
    {
      "rating": "7",
      "text": "Director Pablo Larrain (the “Jackie” biopic) and Writer Steven Knight (“Locke,” “Serenity,” “Eastern Promises”) offer fair warning.  In the opening moments of “Spencer,” a vanity card tells us this will be “a fable from a true tragedy.”  We are fully aware that this portrait of Princess Diana will not be a by-the-numbers recitation of historical facts.  But there is scant preparation for a film that unfolds much more like a fever dream.All of the action takes place in December, 1991, at Sandringham, the estate where the royal family spends Christmas each year.  Diana and Prince Charles are eleven years into their marriage, with their breathlessly-followed separation occurring exactly one year later.Some of the film is clearly reality-based.  Diana’s bulimia, which is depicted quite graphically, is well-known.  It’s also accurate that all royal gatherings are highly structured events, down to the specific outfit changes required of Diana for each meal. (There’s a rack of dresses with labels indicating when each piece of clothing must be worn.)  The ever-presence of Camilla Parker-Bowles is similarly reality-based.  In this case, the creative team has Charles giving identical pearl necklaces to Diana and Parker-Bowles as Christmas gifts.  (The giving of identical gifts did happen on another occasion, but involved different jewelry.)Some of the film is clearly imagined.  Knight’s script delves deep into Diana’s psyche.  What emerges is a series of hallucinations, culminating with imaginary conversations between Diana and Anne Boleyn, with whom she identifies.  It all comes together to form a searing depiction of a woman in psychic agony.  This tone of unrest, dread and impending doom is accentuated by the powerful score of Jonny Greenwood (“Phantom Thread,” several Radiohead music videos).  Greenwood’s work underscores Diana’s anxiety, fear and desperation as he moves from discordant jazz to simple piano melodies to other musical idioms, all without a single false note.What doesn’t work is the royal family as anti-hero.  Diana’s single interaction with the Queen is cordial and instructive (the Queen observes that all the members of the royal family are “just currency” for an insatiable press).  Diana’s major conversation with Prince Charles, while devoid of warmth, is not overtly threatening.  The “oppressive” demands of the royal family as a group seem to center on the request that Diana show up on time for dinner.  While it’s starkly evident that Diana is consistently being controlled and monitored, the dreaded “other” that is clearly crushing Diana never comes into clear focus.What makes this film a must-see is Kristen Stewart.  With “On the Road,” “The Clouds of Sils Maria” and various other serious films, Stewart has demonstrated her intention to become a versatile, multi-faceted actress.  “Spencer” reflects the culmination of all that hard work and development.  While showing an uncanny ability to reflect Diana’s mannerisms, gait and facial expressions, Stewart moves well beyond mimicry to owning and inhabiting this role in a way that’s powerfully mesmerizing.After viewing “Spencer,” my feelings about Princess Diana were essentially unchanged.  I still wish I had deeper insight into an iconic figure who was publicly kind, thoughtful and accessible while privately disintegrating."
    },
    {
      "rating": "10",
      "text": "Kristen interpreta de forma emocionante as vivências de Lady Di, realmente a atriz deubo seu melhor na trama \"Spencer\""
    },
    {
      "rating": "7",
      "text": "It seems like the life and times of Princess Diana are on the top of the mind for the entertainment industry. The most recent season of \"The Crown\" depicted Princess Diana joining the House of Windsor and all of the turmoil surrounding. There is also a Broadway musical called Diana. Guess what that's about. Now, Princess Diana gets the big screen treatment in Spencer, but it's not one of those cradle-to-grave biopics but something more specific. I took in this rather inscrutable drama at a theater near me, and here's how it went.Pablo Larrain's Spencer sets the tone with the following title card: \"a fable of a true tragedy.\" Essentially, as much as this is a depiction of Princess Diana on a fateful Christmas holiday in the 1991, it is very clearly a fictionalized account of this time. In the beginning, Diana arrives late and alone to the Queen's Sandringham Estate after the rest of the family has already settled in. It seems Diana's goal is just to get through one last weekend with the House of Windsor before her separation and ultimate divorce from the Prince of Wales. Spencer depicts the mental and physical struggles that Diana goes through enduring this holiday isolated and dictated to by a family that doesn't want her.Kristen Stewart gives a remarkable performance as this version of Diana. Her look is an approximation of what we've seen of Diana - the wig, the makeup and the clothes. Stewart has mannerisms, a voice and accent that suggest the princess, but don't amount to mimicry. Stewart does her best to embody, as well as convey, the difficulty that must have been plaguing Diana at this time. She is the reason to see Spencer as no other actors really register in the film. It is a one woman show, and it's a good show at that.If there is another star, it has to be Pablo Larrain's direction. Now, I can't entirely get on board with the whole show, but Larrain definitely was going for something different. For the most part, he achieved it. Who would have considered this biopic to be almost a horror film or a psychological thriller? It was really shocking at points when things you think you saw are maybe not exactly what they seem to be. I don't want to get too spoiler-y because it is good to be caught off guard. Some may not appreciate the flights of fancy that pop up throughout, but I thought it makes what is otherwise a well-trodden subject interesting again.Side Note: the score by Jonny Greenwood is so fascinating and discordant that it gets distracting at times.Spencer is another in an ever-growing line of Princess Diana depictions. Pablo Larrain takes some strange chances telling this story and attempts to get inside the head of the troubled princess with varying degrees of success. Kristen Stewart's performance is stellar and is worth a viewing. Grab a bowl of popcorn for a matinee of Spencer."
    },
    {
      "rating": "9",
      "text": "It's wonderful how this movie bring together real and ethereal the same time. Repulsion and Rosemary baby are the first movies that comes in my mind when I watched this. And Goooooosh how Stewart are fantastic here"
    },
    {
      "rating": "10",
      "text": "o filme impecável!!!!! fotografia linda, trilha sonora INCRÍVEL e a atuação da kristen tá divina!!!!!!! digna de oscar SIM"
    },
    {
      "rating": "8",
      "text": "A beautiful, disturbing and dramatic look at Diana’s feelings on the system over Christmas. It’s dense, it’s one note almost the whole way through, and it’s very good."
    },
    {
      "rating": "8",
      "text": "Spencer is a great surprise that I rate 16/20. First, I noticed the desire of the director to pay a tribute to Stanley Kubrick. Shot on film in 4:3, the movie refers several times to 'The Shining'. The hotel corridors, the cellars, the kitchens, the cold room, the majordomo, the bathroom scene with the old woman, a green bathroom similar to 'The Shining', the nightmarish sequences, the escape in the cold night... Everything is more or less related to 'The Shining' or 'Barry Lyndon' for the aristocratic side, and Kirsten Stewart's interpretation is great, enhancing the quality. ( Watched in Warsaw, Poland on November 17, 2021 )"
    },
    {
      "rating": "0",
      "text": "Um dos piores filmes do ano! Kristen parece não ter saído dos seus personagens vampirescos e ainda encarna uma vampira nesse filme ridículo."
    },
    {
      "rating": "0",
      "text": "This woman should just get stuck doing silly vampire movies made for teenagers than venturing into plots she can't handle."
    },
    {
      "rating": "0",
      "text": "How daring to put that talentless girl of that stupid vampire movie made for spoiled teenagers to play Lady Diana..."
    },
    {
      "rating": "3",
      "text": "The movie is just boring. There are no stakes or any real plot. However, the cinematography and acting is top notch."
    },
    {
      "rating": "0",
      "text": "Who allowed this h0e to play Lady Diana? Damn this movie was gross, definitely not worth the wait!"
    },
    {
      "rating": "3",
      "text": "The story is so nonsensical, Kristen looks great, but the script didn't help.Terrible movie, the actress was what she saved minimally"
    },
    {
      "rating": "0",
      "text": "Worst movie of the year, critics are only pushing for sympathy because of the pain of the royal family, but if you were to judge Kristen's acting alone, this movie would be bombed!"
    },
    {
      "rating": "10",
      "text": "I really loved this movie. Stewart's performance, the cinematography, that score omg, everything came together and create a masterpiece. One of my favorite movies of the year"
    },
    {
      "rating": "1",
      "text": "boring movie but kristen was somewhat good, so 1 point ................................."
    },
    {
      "rating": "0",
      "text": "A boring movie, Kristen doesn't look like Princess Diana at all, and has no reputation for playing her. Kristen, stick to your teen bait movies, your talent is limited to movies like that."
    },
    {
      "rating": "10",
      "text": "I think this is it. This is probabbly the best film of the year. I'm a huge fan of Pablo Larraín's filmography, but this has to be top tier. Both The Club and Spencer are very beautiful but very disturbing films, where all the weight is on their protagonists. In this case, Kristen does one of the best performances in recent years."
    },
    {
      "rating": "0",
      "text": "Kristen should be sued by the Royal Family for turning Lady Di into an emotionless clown!"
    },
    {
      "rating": "10",
      "text": "This a piece of art, love this movie, one of my favorites, like, of my life"
    },
    {
      "rating": "10",
      "text": "Amazing movie and an Oscar-worthy performance from Kristen Stewart! Everything about the movie was impeccable but she carried it on her shoulders."
    },
    {
      "rating": "6",
      "text": "Diana Spencer is a tragic figure. Basically everything that happened to her in her adult life was tragic. From the miserable life she had with the English royal family, to the overwhelming media harassment she received after her divorce, which culminated in her death trying to escape the paparazzi. And now, after so long since her death. Her tragic death. Her figure and her presence continue to be exploited.In this case, well actually in all the current cases that represent these people, I find it incredibly surprising.I say this because Diana Spencer had to be a perfect princess for the royal family. And nowadays, Diana Spencer has to be the perfect figure for all the people who have mythologized her. Pablo Larraín plays in that arena with his newest film. Basically evoking everything he did in Jackie, but for some reason it's always been said that you can't use the same trick with an audience that already expects or knows it, and Spencer is basically the romanticized version of a series of events that the screenwriter decides to imagine in his own way, giving all the spotlight to his protagonist, but leaving aside any substantial elements at its core.And yes, Kristen Stewart even with her bad accent gives what is perhaps the best performance of her career, but once you notice all the nuances that she was able to impregnate into her performance, there's no more, because the story doesn't give her something else to do.Everything is speculative. And the film defends that with its \" A fable from a true tragedy\"It would be so much more interesting if this had not already been so thoroughly explored.Spencer is a well-made film, I can't deny that, but the setting and the style can't make up for the lack of a better narrative, and more than anything, a different dynamic.Larraín plays the same notes through the whole thing, and never wanders outside the box, so he delivers a correct but inconsequential film.It will certainly give Stewart the Oscar because we know how the business works, but beyond that, I'm not taking anything with me from this fable.Spencer doesn't humanize Princess Diana, it does something much worse. It idealizes her."
    },
    {
      "rating": "10",
      "text": "Incredibly beautifully shot movie, about a woman going through the worst time in her life. Movie about a woman, not a princess, her emotional state, an incredible mother, whose priority is her children. Looooved every part of it. Incredible performances, especially the lead actress, the impact is so fresh in my mind, I can't seem to calm down. Good job, to everyone involved and thank you for this experience"
    },
    {
      "rating": "0",
      "text": "The worst movie of 2021! Boring and the acting is very lame and didn’t delivered it. Worse worse worse!!!"
    },
    {
      "rating": "3",
      "text": "Kristen Stewart did a great job but overall the movie is boring, she portrayed Diana so well. For sure she deserves a nomination"
    },
    {
      "rating": "0",
      "text": "This movie was pretty boring. There was no plot. It was just the family being awful to Diana. It felt like there was no progress made throughout the movie until the end when she decides to take her sons and run away."
    },
    {
      "rating": "0",
      "text": "This movie is a very bad one, I went to see it in the cinema with my family and friends and almost everyone hated it."
    },
    {
      "rating": "0",
      "text": "Um lixo de filme nao perca seu tempo assistindo esse filme a atriz parece engessada demais"
    },
    {
      "rating": "10",
      "text": "Kristen Stewart is absolutely amazing in it!She's incredible, she totally disappears into Diana.The movie is an explosion of art (photography, music, direction, costumes and acting are sublime).Kristen Stewart deserves all the attention and certainly deserves a lot of awards for her performance."
    },
    {
      "rating": "10",
      "text": "Brilliant brilliant brilliant film , Stewart is sublime one of the best performances ever , Mathon's cinematography is magical , Greenwood's score is from another world , Larraìn is a master"
    },
    {
      "rating": "10",
      "text": "This is a aesthetic movie with amazing cinematography and costumes. And now people must stop saying that Kristen Stewart can't act."
    },
    {
      "rating": "10",
      "text": "A phenomenal and career best performance by Kristen Stewart elevates this hypnotic, emotional and wonderful movie."
    },
    {
      "rating": "10",
      "text": "Stunning film with an Oscar-worthy performance from Kristen Stewart. Everything about this is just beautiful, from the costume design to the production design to Jonny Greenwood's spellbinding score."
    },
    {
      "rating": "10",
      "text": "Everything in Spencer is perfect! Kristen Stewart is the best actress of the generation. Just give her Oscar!"
    },
    {
      "rating": "10",
      "text": "One of the best films and performance of this year. ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏ ͏"
    },
    {
      "rating": "0",
      "text": "The worst movie of 2021 by far!!! Boring, weak, cheap and the acting is very lame and didn’t delivered."
    },
    {
      "rating": "3",
      "text": "Positives:.Kristen Stewart shows her range and dominates as Diana.Fantastic Cinematography Negatives.Incredibly pretentious score, extremely un-matching and felt like it belonged to some poet jam club.Kristen Stewart overacts in a lot of scenes, on the verge of tears in almost every scene.Movie portrays Diana as an absolute nutcase and a terrible mother.It tries to cast Diana in a tragic period where she's trapped and wants to be freed..Yet conveys none of that in this nonsensical storyline.It isn't realistic and nothing in the movie happened in real life.Casting choices for the Royal Family is questionableAll in all, it's a complete bored, pretentious and portrays Diana as an unlikable sociopath that intentionally puts her children through trauma, not even hiding her disorders and being extremely rude to everyone she knows. If you knew nothing about Diana going in, i'd be surprised if you came out liking her. The plot tries and fails to cast it as a trapped bird wanting to be free. Instead showing us that she's an extremely bratty person and there's literally nothing trapping her in this. I genuinely cannot see what people find enjoyable in this film, it's not haunting, it's not spellbinding..it's a genuine attempt at sabotaging Diana in the guise of a tragic story."
    },
    {
      "rating": "10",
      "text": "great movie and great performance by kristen stewart, also the score is brilliant"
    },
    {
      "rating": "10",
      "text": "Woah the movie is soooo good! The music! The costumes! The scenery! Kristen Stewart!"
    },
    {
      "rating": "7",
      "text": "The story is breathtaking by itself. Kristen Stewart is the best ever, in my opinion, Spencer."
    },
    {
      "rating": "0",
      "text": "A rather pretty film but which lacks coherence. The film is very boring and the performance of the actors apart from Kristen is very bad ..."
    },
    {
      "rating": "10",
      "text": "it's not a typical biopic but i really liked. Kristen carried the movie and she did a great job."
    },
    {
      "rating": "10",
      "text": "kristen is truly a gifted actress, she embodies diana in a fantastic way and gives one of the best performance of the year."
    },
    {
      "rating": "10",
      "text": "Spencer is definitely one of the best movies this year！Brilliant performance！To be honest，she deserves an Oscar this time. MUST WATCH"
    },
    {
      "rating": "0",
      "text": "Don't watch this movie! This girl should only have been making movies for teenagers as it is evident that she cannot play characters and dramatic plots."
    }
  ]
}