{
  "id": 2796,
  "title": "Spenser Confidential",
  "starring": [
    "Mark Wahlberg",
    "Winston Duke"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Action",
    "Thriller"
  ],
  "description": "Spenser, a former Boston patrolman who just got out from prison, teams up with Hawk, an aspiring fighter, to unravel the truth behind the death of two police officers.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fePczipv6ZzDO2uoww4vTAu2Sq3.jpg",
  "categories": {
    "plot": 6.529411764705882,
    "acting": 6.642857142857143,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.857142857142857,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "5",
      "text": "With occasional fast cuts and an overall uneven tone, Spenser Confidential does not exel in neither action nor comedy. Story is straighforward enough, yet none of the characters are particularly interesting."
    },
    {
      "rating": "7",
      "text": "Quite entertaining action buddy movie. Simple story, well told with likeable good guys and obvious bad guys. Nice to see an 'old fashioned' movie like that. Highly improbably ending notwithstanding, I thoroughly enjoyed it throughout. Hope they make a sequel."
    },
    {
      "rating": "9",
      "text": "I didn’t expect too much from this movie....But I was very surprised...It made me smile a lot"
    },
    {
      "rating": "4",
      "text": "The most Boston thing that Mark Wahlberg has ever done!Well, there is The 'Departed'."
    },
    {
      "rating": "8",
      "text": "Good blend of humor, action, tenderness and visuals make this solid B-movie entertainment. Works as a stand-alone or the first of a series."
    },
    {
      "rating": "8",
      "text": "A fun take on the Spencer novels and TV show. I see a lot of negative reviews from critics, but if you're looking for something fun to watch this will work. If you are seeking Great Art, look elsewhere."
    },
    {
      "rating": "8",
      "text": "Un bon film d'action, des moments drôles, biensure ne chercher pas le scénario de l'année mais sa tien la route même si prévisible. Si comme prévu Netflix en fait d'autres le résultat serra meilleur maintenant que les presentations sont faite."
    },
    {
      "rating": "10",
      "text": "Good mix of action & comedy. Great movie. Really had a sense of good directing."
    },
    {
      "rating": "5",
      "text": "If you're looking for a fun movie to burn about two hours watching, go for it. But IMO it's neither a good action movie nor a good comedy. It feels like a made for TV movie. I won't spoil anything, but there are just so many plot holes and things that don't make sense in the movie. I had to wonder if it was laziness, very dry humor or just the creators assuming that the audience would be too dumb to notice.If Mark Wahlberg wasn't the lead actor, it wouldn't be worth watching. But Mark Wahlberg adds his usual flare to the movie, so it somehow remains enjoyable despite bland acting from basically everyone else with the exception of the blonde woman(Iliza Shlesinger). She was definitely the comic relief, her character and lines made me laugh pretty hard. This honestly would've been a better movie if they just made it a romance comedy rather than whatever the hell the nonsensical plot was supposed to be."
    },
    {
      "rating": "7",
      "text": "Wahlberg eats up the screen and is such a good lead here. The story is predictable but simple, its a good mix of action and comedy"
    },
    {
      "rating": "6",
      "text": "Entertaining but nothing original.Probably the 100th movie with this type of storySome good laughsPredictable time filler"
    },
    {
      "rating": "4",
      "text": "Another film by Michael Wahlberg and Peter Berg. Their fifth in a row.So far this is the worst one and it's not that I liked Mile 22 but at least had more attitude.You can see here that both of them participated to cash their check and walk away quickly from the result.Maybe another collaboration shouldn't happen.Right now this film is the number one film on Netflix Mexico, so this is Netflix responding me why they add these mediocre productions to their catalog.For buddy cop films you could do so much better elsewhere."
    },
    {
      "rating": "8",
      "text": "Spenser Confidential was a really funny, cool, and entertaining movie, this is my 2nd favorite comedy movie of 2020, one of my favorite movies of 2020, and one of my favorite movies of all time. The chemistry between Mark Wahlberg, Winston Duke, Alan Arkin, and Iliza Shlesinger was outstanding, they were hilarious together and just played off of each other perfectly. The performances from Mark Wahlberg, Winston Duke, Iliza Shlesinger, and Alan Arkin were were stupendous, they gave very funny and entertaining performances. The writing was fantastic. The makeup and hairstyling was terrific especially on Winston Duke and Iliza Shlesinger. This was a great movie."
    },
    {
      "rating": "8",
      "text": "This was a fun popcorn flick  to watch while stuck at home social distancing. Could set up a sequel. Will watch again."
    },
    {
      "rating": "10",
      "text": "Very entertaining movie!  We used to live in Boston and I greatly enjoyed the Boston accents :).  The movie was funny and had good action.  I liked it and so did my teenagers!"
    },
    {
      "rating": "7",
      "text": "Five years after a confrontation with Police Captain Boylan (Michael Gaston) sent him to prison, former Boston Police Officer Spenser (Mark Wahlburg) is released from prison. Staying in a boarding house run by his former mentor Henry (Alan Arkin) he plans to build a new life in Arizona as a Truck Driver until a gangland style murder of a former colleague forces him to re-confront the corrupt Boston underbelly that got him locked up all those years ago. Finding unlikely allies in his silent giant of a roommate Hawk (Winston Duke), his crazed ex-girlfriend Cissy (Iliza Shlesinger) and boat dwelling ex-reporter Wayne Cosgrove (Marc Maron), Spenser will have to solve one last case if he ever wants to earn his freedom.Spencer Confidential is Netflix's big release for March 2020. An almost two hour R-rated Mark Wahlberg vehicle that succeeds on skill of its all star cast. Mark Wahlberg plays our protagonist Spenser, a good hearted yet immature man who can't help but get involved in situations if he sees injustice. This is definitely to his character's detriment making him a literal glutton for punishment. There's not a scene in this movie where Wahlberg isn't bloodied or bandaged. Wahlberg plays a character we've seen him play countless times (the solve your problems with your fists charmer) and his performance would be almost unremarkable if he didn't TOTALLY nail the comedic side of his character. Winston Duke plays our side kick Hawk with a restrained intensity. It's very interesting to learn more of his background as the story progresses. That being said I wish there was more character development for Hawk especially when you consider this movie is almost two hour long. The only problem for Duke is the script makes Hawk out to be a young tech savvy guy compared to Spenser, while thirty three year old Duke seems too old for this role, especially after his performance as Dad Gabe Wilson in 2019’s horror hit “Us”. For me Iliza Shlesinger is the stand out role in this movie. As a professional stand-up her comedic timing and line delivery is perfect. While her character is written with an almost outdated misogynist crazy girlfriend trope, she brings some of humanity to the role. She makes Cissy a real person with needs and wants and gives her the most depth out of anyone in the movie. There are several other stand out performances from Bokeem Woodbine, Alan Arkin and Dustin Tucker (who manages to do a LOT with such a small role) that any fan of crime comedies would enjoy. The only character that disappointed was Post Malone as the Inmate Squeeb. Post Malone's face was all over the marketing I saw for Spenser Confidential which had me excited. It shocked me to find out he only has roughly six minutes of screen time. This disappointed me at first but was actually a blessing in disguise. His character is all over the place, from reasonable inmate doing what he needs to do to get by to full psychopath. It's a very strange and very flat performance from a character that only exists as a tool to move the plot along.Speaking of the plot, the story beats may be the most jarring part of the movie next to the editing. While the initial execution of the story is solid, the writing takes over and forces the story to progress unnaturally. I found it almost derailed the third act by having the weakest and out of nowhere set up for a final showdown I've seen in recent memory. Without the great action in the third act the movie could have been ruined by the story's forced conclusion. The writers could have added an extra ten minutes to the run time and gotten there naturally, especially with this being a Netflix release. The editing also doesn't do Spenser Confidential any favours. The action scenes have a lot of cuts which work for one or two sequences, but can't cover up some shotty staging. Characters disappear between cuts and it hurts the enjoyment of the fight scenes. While the dialogue is witty and engaging the editing again shows its ugly side with some very simple conversational scenes containing lots of cuts. It attempts to create tension but it breaks immersion with what would otherwise be a great scene.In the end Spenser Confidential is a funny and enjoyable ride filled with some grade A talent. While the writing and editing may fall short the cast definitely saves the day. This movie is worth the watch if you need laugh to stave off the COVID-19 Blues. For those reasons I'm giving Spenser Confidential a B- and a Netflix Thumbs Up. If you liked this review please let me know. I would love to hear your thoughts on Spenser Confidential. If you have a movie you would like me to review please let me know!"
    },
    {
      "rating": "8",
      "text": "Did not have high expectations but ended up being a really good movie, pleasantly surprised."
    },
    {
      "rating": "5",
      "text": "Give Mark Wahlberg good credit, without him, Spenser Confidential would be less entertaining than it was. A very inferior action comedy compared to 21 Jump Street."
    }
  ],
  "recommendations": [
    "logan_lucky",
    "the_nice_guys",
    "contraband",
    "rocknrolla",
    "the_italian_job",
    "tag",
    "jumanji_the_next_level",
    "spy",
    "keeping_up_with_the_joneses",
    "2_guns",
    "16_blocks",
    "alex_cross",
    "red_2",
    "the_guardian",
    "central_intelligence",
    "this_means_war",
    "knight_and_day",
    "deadpool_2",
    "red",
    "lucky_number_slevin",
    "the_spy_who_dumped_me",
    "grudge_match",
    "american_ultra",
    "jack_reacher",
    "red_notice"
  ]
}