{
  "id": 252,
  "title": "Spider-Man: Into the Spider-Verse",
  "starring": [
    "Shameik Moore",
    "Jake Johnson"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Adventure",
    "Animation",
    "Science Fiction"
  ],
  "description": "Miles Morales is juggling his life between being a high school student and being a spider-man. When Wilson \"Kingpin\" Fisk uses a super collider, others from across the Spider-Verse are transported to this dimension.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iiZZdoQBEYBv6id8su7ImL0oCbD.jpg",
  "categories": {
    "plot": 9.106060606060606,
    "acting": 9.272727272727273,
    "ending": 8.875,
    "soundtrack": 9.454545454545455,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 9.352941176470589,
    "action": 8.764705882352942
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Best Spiderman Film since the Sam Raimi's Adaptation.This film is an Art a Masterpiece, and a jaw dropping beautyI just can't stop awe-ing at every scenes especially the best parts in the movie,because the animation is just so damn eyegasm and unique There are no flaws in the story and Under-developed Character...Every character is developed perfectly, Miles Morales his character itself is likeable and relatable.I love this movie, it is a must see to every Spiderman fansI WOULD LOVE TO SEE A SEQUEL"
    },
    {
      "rating": "7",
      "text": "Apparently my score will seem low and while I wasn’t blown away by this like everyone else, I found this film colorful, fun and surprisingly poignant. The climax gets pretty cluttered in all that’s going on, but by that time you’re invested in the characters. Oh, and the Stan Lee cameo is an accidentally brilliant sendoff to the legend."
    },
    {
      "rating": "0",
      "text": "Blurry animation, lame cliched multiple-universe plot, and ultimately the whole thing is just derivative of the real Spider-Man story with fake affirmative action characters. Hard pass!"
    },
    {
      "rating": "9",
      "text": "Absolutely awesome, thoroughly enjoyed this movie. To be honest, initially I was skeptical, but the animation as well as the storyline blew me away. Great job."
    },
    {
      "rating": "9",
      "text": "One of the best comicbookmovies ever made, the animation is fantastic ,its funny, the action is good, and it is also a very emotional movie, with his uncle being the villain !Great movie 9,5/10"
    },
    {
      "rating": "9",
      "text": "This movie was excellent! First of all, this has some of the most stylish and unique animation I have ever seen! It’s unlike anything I’ve seen from an American animated film before, it was fantastic to see! The story was really great too with a lot of heart and lots of twists and turns! I do think that there probably were too many characters in the movie, but that’s the only issue I have with it. This is a must-watch for any superhero fan and fans of animation in general! It looks stunning, the action is thrilling, and it has all the feels! Highly recommended if you haven’t seen it yet."
    },
    {
      "rating": "9",
      "text": "Truly original.I thought I had seen almost everything I could see in relation to Spider-Man, because he is one of those characters who insists on returning to the cinema with some regularity. To make matters worse, the industry, and particularly Marvel, flooded theaters with films about cartoon characters, from the most famous to the most obscure, and this became repetitive, trivializing the genre.But this film has nothing to do with the others. In fact, instead of following the path of ultra-realism that other animated films have followed or limited to being a spin-off or reissue of the character's story, the film transports us totally to the world of comic books, assuming for you that stylized look that these publications have, and bringing a totally new and different story, with an African American Spider-Man who tries to succeed the original, after witnessing his death, and save the world from destruction with the help of several versions of the hero from various parallel universes. Even the famous Spider Pig (even those who have never seen the Simpsons know) will appear!The film features several famous actors who give the voice to the various characters (Shameik Moore, Jake Johnson, Mahershala Ali, Hailee Steinfeld, Nicolas Cage etc.) and is visually impressive, full of effects taken from the comic books on paper and a CGI state-of-the-art. The sound is also impressive, both in the action scenes and in relation to the soundtrack, where Hip Hop and suburban rhythms predominate. The pace of the film is quite fast, with breathtaking scenes.I had little expectations when I went to see this film, but I have to admit that it is truly exceptional. However, it turns out to be so bold and so different from the ordinary that this can make it indigestible to some audiences."
    },
    {
      "rating": "9",
      "text": "O filme é otimo, boas referências e aquela cena pos credito foi bem engraçada, mas acho que a homenagem para o stan lee deveria ser bem maior."
    },
    {
      "rating": "10",
      "text": "Simply the best superhero movie ever. No false note, no errors, supports a lot of vision. PERFECT."
    },
    {
      "rating": "10",
      "text": "Oh wow. I am blown away. How on Earth did an animated film such as this do so well? And how were they able to take all these separate characters and give them so much development without the film feeling like a drag."
    },
    {
      "rating": "10",
      "text": "I don't typically go for superhero movies (although I love the superheroes behind them), and I had little faith in Sony's animation team at the time. That being said, Spider-Man: Into The Spider-verse has proven to me to be among the most memorable films of the last decade. It has this incredible sense of charm, humor, and whimsy in way Spider-Man hasn't been able to capture since Spider-Man 2 in 2004. What's more, this is the most well-animated film I have ever seen, seamless blending a smorgasbord of styles while maintaining a magnificent sense of stylistic cohesion so as to not allow the numerous styles to crowd one another out."
    },
    {
      "rating": "9",
      "text": "An animated superhero masterpiece. Great animation and visual designs. Please watch."
    },
    {
      "rating": "10",
      "text": "Best superhero movie in my opinion. This is just a masterpiece through and through. The soundtrack is absolutely incredible. Animation as everyone has pointed out is breath taking to say the least. Character development throughout the movie is great. Really felt like by the end of it no one was underused or overused. All played their part well. And it was just a really satisfying movie altogether. Would recommend to, pretty much everyone."
    },
    {
      "rating": "10",
      "text": "Spider-Man and Miles Morales enter an animated world with Into The Spiderverse, one of the best Spider-Man movies that mixes a good story, good animation and good humor."
    },
    {
      "rating": "10",
      "text": "This is my second favorite Spider-Man film and easily a strong contender for best Spider-Man movie ever made right up there with Spider-Man 2. I gave the movie a 10 but it is a light 10 as I do have some problems with it. He has some of the most stylish and unique animations I have ever seen! It’s unlike anything I’ve seen from an American animated film before, it was fantastic to see! The story was really great too with a lot of heart and lots of twists and turns! I do think that there probably were too many characters in the movie, but that’s the only issue I have with it. This is a must-watch for any superhero fan and fans of animation in general!"
    },
    {
      "rating": "10",
      "text": "This was a thoroughly enjoyable and awesome movie! The music was spot-on, the animation slick, and it made me laugh and sit up in my chair more than once. Peter B Parker was fantastic when contrasted with Peter Parker, and I'd have liked to see more of Spiderman Noir! Totally blew me away."
    },
    {
      "rating": "10",
      "text": "On one point I stopped watching animated movies. And spider man is really not my favourite character. But as the trailer came in and the critics who had already have seen the movie have been so positive about the movie I thought, OK, let's give it a chance. And wow. I was so surprised: this is the best animated movie I have seen. There are parts of the settings where I was blown away by the visual ideas. The tone, the mood, the style. Everything was just mastrefull. The story was well structured, although the twist was not that hard to figure out. Still: worth see as it hits you a little bit emotionally. No spolers, so you should get that experience yourself.I hope we will get a second part … This is my approach to spider man. And I like it."
    },
    {
      "rating": "10",
      "text": "This movie was amazing. Visuals were great, the best media that Spiderman was attached to and just an interesting idea that had a great execution. Also Nicolas Cage was in it."
    },
    {
      "rating": "10",
      "text": "Everything is great on this tape.I love the color balance,bright in every way."
    },
    {
      "rating": "9",
      "text": "To be honest I didn't know what to expect from this movie it came from a studio that made amazing Spider Man films like SpiderMan 1 and 2. Then Sony made mediocre and almost bad films with The Amazing Spider-Man series and SpiderMan and Sony's animation films are hit and miss but some how they nailed it with this one.First off the visuals and animation were amazing at first I thought it would be jarring but that wasn't the case as usually films which try to do movies in comic book style usually fails...cough Hulk(2003)cough.but luckly this is an animation movie so it works brilliantly so well done Sony. The characters in this movie are also well fleshed out and contributed to the story significantly in one way or another.Miles Morales and Peter Parker and Spider-Gwen were the best characters and each were a delight to watch,funny and more. And shout out to (spiderman) the peter parker voice actor who usually acts in comedy did great voice work for Peter Parker and I can confirm is very different to what you see in love action films but really captures the feel of Spiderman.The movie was really bold as well from the different visuals the story involving parallel dimensions and universes which worked because you could see from glimpse that every universe felt different and unique.Also the film felt really mature even from a PG movie it felt like a hardcore PG film with its themes,drama and consequences especially the Kingpin charcter and a heartbreaking arc involving Peter Parker and I for one enjoyed that.The music was also nice.Miles Morales who the story is based on is a good lead from the voice acting and up. You could see the struggle he was dealing with trying be Spiderman and the responsibility of it and that's what Spidernan has always been about with great power comes.....you know the line.His character grows and develops over time as he dealt with the trails and tribulations of being Spiderman and by the end it payed off which was nice to see. The main Villain Kingpin had a compelling reason for his evil actions and has kind of intimidating a bit like like the Netflix Kingpin, which was a really mature take on a pg movie so agian another plus for the movie although there some generic bad guy things and dumb decisions that villians make in this movie but since its a kids movie i'll just let it slide.The other Spiderman people were really good too like Spiderman Noir, Spiderham and Pennie Parker were really entertaining with the screen time they were on though sometimes they felt have much variety sometimes compared too Spider Gwen,Peter Parket or Miles Morales.The action is pretty good as well and its done well with the comic book style animation as words or phrases would pop up on the screen like a comic book so that was fun and the comedy was really well timed and hasn't forced unlike the MCU movies it balanced the drama and humor aspect well in the movie.However my biggest gripe about the movie is that some character arcs weren't would fully resolved or plot holes per say especially for Miles Morales' Dad and his Uncle I cant go into details without spoiling but there was an issue that happened that semed it was forgotten about and never fully solved. Also just minor nitpicks is that you dont get to see Miles Morales be Spiderman for really long or really show off what he can do but I understand its an origin story so its understandable and sometimes the movie wanted to do some fourth wall breaking like Deadpool but only in minor moments which felt kind of out of place.So in the end there was very little wrong with this movie, I enjoyed almost every bit of it. It was funny, fun,colorful with really good animation,bold art style, amazing characters, blanced humor,great lessons about responsibility and courage and the drama was really well and was just an overall great movie. So again Well done Sony for making one of the best Spiderman movies ever and one of the best films of 2018."
    },
    {
      "rating": "8",
      "text": "By far the best Marvel movie since Spider-Man 2, Into the Spiderverse reinvigorates the comic book movie genre by perfectly integrating the comic book art form with cinematic conventions. It succeeds as both an art film and as a kid-friendly studio franchise film in unexpected ways. There are a few moments where the animation and story veer towards \"direct to video\" kiddie cash-grab territory, but overall this film accomplishes more than most big-budget live-action superhero franchise films even attempt."
    },
    {
      "rating": "9",
      "text": "Amazingly how SpiderMan has come to animation. I love every characters in this movie and I really want to watch it twice"
    },
    {
      "rating": "10",
      "text": "I came into this movie with larger-than-life EXPECTATIONS. After a horde of online praise from both critics and users alike, not to mention instant Oscar buzz, I was primed for disappointment as i thought a movie can never be that good.I was huge Spider Man fan, from the first Sam Raimi movie to the 2nd, and then it stopped there. I watched the third movie in the franchise (and had to re-watch it just to make sure I didn't see it on a bad day) and was just thoroughly confused. The Andrew Garfield movies were just awkward to me and I just gave up.This new movie however? BALL-BUSTERS!From the opening image referencing the Comics Code Authority (I promise that would be the last and only spoiler this will have!) I knew right then and there that this movie means business, the business of not taking itself too seriously.I had my doubts about having \"another\" Spider Man or any other Spider Man for that fact. I never was a fan of the early nineties story arc of cloned versions of Peter Parker. I thought this would be another way of today's media just pissing on already existing beloved IP like the way CW is doing to Superman in their Super Girl series. I was ready for Sony to just poop all over Spider Man, especially now that he's part of the MCU. More on this point later.We're introduced to Miles Morales, a brilliant kid from Brooklyn who just wants to make his own mark in the world and find his own special place, just like everyone of us. He is a character that all us can relate to with his constant struggle with the mundane. Even worse, being a teenager while he's at it.It is a totally down-to-earth story filled with everyday stories about growing up and handling expectations, until that is, he gets bitten by a radioactive spider. If you feel like that's a spoiler, where the hell have you been hiding the past few decades? It's every Spider Man's right of passage, get bit by a Spider, be Spider Man.He then gets thrust into a the bizarre world of being Spider Man and along the way realizes that it's not all fun and games and yes, indeed, with great power comes great... No I won't finish that sentence, Peter!Being a comic-book movie, the action is non-stop but what really sets it apart from a sea of such movies is the absolute grandeur of all it.The wonderful set-pieces beautifully drawn and rendered, will make you believe that this alternate universe of Brooklyn really does exist, and makes you wish you live there instead. It's captures Brooklyn's hipster and art culture beautifully, just that short of being artistic. Mind you not Blade Runner 2049 artistic, It wont give you headaches and make you think about the meaning of life or anything. Just wonderful.The best part, apart from the visual orgasm, is the soundtrack. It is never obtrusive and always on point. Lead by the promotional singe \"Sunflower\" by Post Malone and Swae Lee, the hip-hop and pop inspired score and soundtrack is absolutely blissful. Ever since the Black Panther soundtrack blew me away, I feel that i now love this music in EVERYTHING.This may be a super-hero movie but this is an offering I highly suggest the whole family watch. It has everything for everyone, with nostalgic (and I do mean NOSTALGIC) easter-eggs and shout-outs for even the snootiest of fans to references to the culture for today's youth. I give that an absolute perfect score. This is what a super-hero movie should be like. Hands down MY favorite movie of the year."
    },
    {
      "rating": "9",
      "text": "E-Value: 9Acting: 9Plot: 9Similar to Venom which was released months ago, this is one of the perks from sharing the movie rights of Spider-Man between Sony and Disney. Unlike the previous Spider-Man movies, not only did Spider-Man receive an animated movie with a theatrical release for the first time but it also stars Miles Morales as Spider-Man instead of Peter Parker.Miles Morales (Moore) is a boarding school student, who admired Spider-Man as a hero. One day while hanging out with his uncle, Aaron Davis, in an abandoned subway, he was bitten by a radioactive spider which gives him similar abilities like Spider-Man. Later on, he discovers a secret laboratory where he witness notorious crime lord, Wilson Fisk/Kingpin (Schreiber), who is building a particle accelerator for some evil purpose and Spider-Man is trying to stop him.Although Spider-Man successfully disables the machine, Kingpin manages to kill him due to Spider-Man being wounded from the fight. With his death and identity exposed, the city mourns their beloved hero. Inspired by his death, Miles wants to fight crimes to honour him. He is then approach by what appears to be Peter Parker. Confused at first, Miles soon realise that this Peter Parker (Johnson) is actually from another universe where Miles does not exist and he is still Spider-Man but having trouble with his personal life.Both Peter and Miles learn that Kingpin’s particle accelerator have brought him to Miles’ universe. Peter reluctantly trains Miles to be Spider-Man while working together to stop Kingpin and brings Peter back to his universe using the same machine. They soon find out that Peter isn’t the only one in Miles’ universe as they are join by other Spider-Men from their respective universe including Gwen Stacy/Spider-Woman. Meanwhile, Kingpin is restoring his particle accelerator to use again for his upcoming plan.Although this movie is not made by Marvel Animation, the movie’s animation done by Sony Pictures Animation is very good and very artistic which actually resemble the actual comic book. The story of using multiverse concept for the movie is well written and utilised without making it complicated or confusion.The decision of using Miles Morales as Spider-Man is pretty much a good choice in my book because he is lesser known superhero to most people and Peter Parker’s Spider-Man have been very well known to everyone. This is a perfect opportunity for Miles Morales’ Spider-Man to shine.The voice acting is very good and the casts are managed to deliver their best performances. There are many funny moments which I laughed so many times and those moments make the movie very fun and entertaining to watch. This could be the best Spider-Man movie I have seen so far. Stan Lee had a voice cameo in this movie posthumously which I won’t spoil it here and you may not want to miss this movie. Having said this, I highly recommend you to watch this movie. Be sure to stay back for a post credits scene which could be a hint for future movies."
    },
    {
      "rating": "9",
      "text": "Great movie. The only thing that bothered me was the Sony product-placement. They have to stop doing that one day and actually start believing in themselves. Otherwise there is absolutely nothing bad to say about this movie. If you like Spider-man, you'll probably enjoy this movie more than all the previous movies. It's really pretty darn great. If you're a dad with a bit of a soft spot for Spidey, with kids around that age (you know what I mean), must see, really."
    },
    {
      "rating": "9",
      "text": "This is a great animated movie, and a great Spider-Man movie. The animation is unique, fun, and refreshing from other animation styles. The voice actors fit the characters very well. The story was awesome. The beginning wasn’t amazing for the first few minutes, but after that it was funny and exciting. The middle was filled with interesting characters that each had their own stories and reasons for who they are. The ending was amazing. The action scenes were detailed and spectacular. The characters got better and you could see how the progressed from the begging to the end of this movie. Miles Morales is a great character, as a person and a Spider-Man. I recommend it."
    },
    {
      "rating": "9",
      "text": "divertida, muy buen estilo de animación la película en general estuvo bien aunque ya me esta cansando del tema de la inclusión"
    },
    {
      "rating": "9",
      "text": "The must-see movie of 2018, not 'superhero movie' but 'movie' as a whole. Stunning art, an emotional story, humor and intense action all make a perfect balance in this amazing flick everyone can get behind."
    },
    {
      "rating": "9",
      "text": "Estamos ante una buena película de superhéroes que sale un poco de lo convencional donde tendremos una buena dosis de emoción y risas de mano de la pandilla de arañas.En cuanto a la calidad de animación fue simplemente impecable uno sentía como una rara especie de comic explosivo, lo cual fue sin duda alguna una de las ventajas que esto no lo haya hecho Disney por que dio vida a nuevas libertades creativas. El diseño de personajes estuvo excelente(exceptuando a los dos casos que mencionare al final) donde los colores llamativos y esas líneas de diseño fluidas creaban un ambiente muy contemporáneo sobre todo con el atuendo de Morales donde esas Nike air force one lucían en toda su gloria con ese traje negro.Lo que no me acabo de convencer fue la implementación de los dos personajes que no eran Spiderman, sobró un poco el spider pork, ya que si da risa pero tampoco es que sea un personaje muy memorable, que valga la pena recordar y con respecto al segundo personaje si lo se sony es japonesa pero no había la necesidad de implementar eso  o por lo menos no de una manera a lo Big Hero, se sintió algo antinatural a mi gusto.El apartado musical estaba presente con ese hip hop cuando debía estar y en ningún momento se sintió que interfiriera con la experiencia así que muy bien por ese lado.El cierre de trama fue espectacular, sin embargo se pudo haber explotado un poco mas el terreno de la familia de Kingpin donde había posibilidades para entender mejor a este personaje y sus motivaciones.El cameo de Stan Lee fue un lindo detalle además de esas frases que salieron en el momento de crisis del personaje, ya que forman momentos genuinamente conmovedores sin caer en ridiculeces ni amor familiar incómodo.Si bien hubo momentos donde sentía un poco lenta, casi en su totalidad pudo llamar mi atención y la de la mayoría de la sala donde todos estábamos expectantes de ver que sucedía con nuestro “amigable vecino”.En cuanto a mí me encanto esta versión, se siente como algo fresco para el cine de superhéroes donde no están grandes actores y presupuestos récord sino simplemente una historia interesante con una animación de calidad. Deben ir obligatoriamente  a verla, lleven a sus hijos, sus hermanos, sus primos o sobrinos créanme que la disfrutaran y le alegraran el día a alguien."
    },
    {
      "rating": "10",
      "text": "Into the Spider-Verse is a real treat. An animated, family friendly film that manages to please general audiences and hardcore comic fans at the same time. All carried by a unique comic like animation style that puts the film in a league of its own."
    },
    {
      "rating": "9",
      "text": "The best animated film...let me correct that, one of the best film of 2018, is a thrilling, heart breaking film of epic proportion.  The fact that it is animated is the icing on the cake: it has an art style that is bold and different, emphasizing that this is literally a comic book that comes to life. However, such razzle dazzle will all be for nothing without an incredibly solid and engaging story line and characters. The fact that this film has loads of Spider-'men', each having their own arc is an amazing feat.  It has also action set pieces that are incredible, the best in 2018.  Literally, the best Spider-man flick since Sam Raimi's saga many years ago."
    },
    {
      "rating": "9",
      "text": "Kind of animation which Spiderverse is paradoxically the comic artistic and realistic, which for itself is pure innovator. More than a superhero movie full of battle, Spiderverse knows how develops their characters, especially Morales, beyond uses humor in form absolutely precise."
    },
    {
      "rating": "8",
      "text": "A fun Spiderman story.  It is familiar but with a twist.  I think any fan of this character should see this movie. It is also Visually pleasing with a unique animation that feels straight from the comic pages."
    },
    {
      "rating": "8",
      "text": "At first I was like what are you kidding me!? After a long struggle, I watched it and turns out it is not that bad. Amazing introduction of the multiverse, nice comic-like storytelling and the structure. Love it!"
    },
    {
      "rating": "10",
      "text": "Однозначно лучший фильм года и один из лучших фильмов, что я смотрела за всю жизнь."
    },
    {
      "rating": "10",
      "text": "I have to  say I wasn't sure what to expect from this movie when it was announced. After seeing it, I'm convinced it has to be one of the most beautifully animated movies I've ever seen. The direction and art style is truly visually stunning and the story is actually pretty nice. It helps expand the mythos behind the Spider-Man mythos in new and interesting ways without doing too much. I especially liked the fact that they used Miles as the main character instead of Peter. It showed an appreciation for diversity that is often lacking in films. Top notch film that will be on many people's favorites list."
    },
    {
      "rating": "10",
      "text": "At last, the first success of Sony Animation. The animation work is so far the best job of the favorite web-slinger of comics. Mixed elements of humor, emotive details and action makes it the best choice of winter 2018. Perchance the one who will rain the parade of Disney-Pixar. Everyone are SpiderMan."
    },
    {
      "rating": "10",
      "text": "Before we start,I just need to point out that the best Spider-Man Movie (and best Comic-Book movie of 2018) is made by the same animated studio that delivered movies with fart and poop jokes as their trend. Onto the review.Let’s talk about the ‘Set-Up’ Movie. A ‘Set-Up’ Movie is a term that I often use to point out some cinematic garbage that milks money out of its production value just for the sake of setting up a big Cinematic Universe (that started all the way back in 2008 with Marvel Studios,precisely with Iron Man). Sony started this 4 Years Ago with The Amazing Spider-Man 2,a movie with some decency in its runtime,but still ruined by the likes of Alex Kurtzman’s “JJ Abrams Mystery Box” style writing,but it was later taken to a new level by Universal Pictures (Jurassic World Fallen Kingdom or The Mummy with their 3rd Acts).Now Sony is still trying to start their own Universe as of 2018 with movies like Venom (“When I get out of here...And I will...There’s gonna be Carnage”) and now Spider-Man Into The Spider-Verse,a movie that may be the best movie out of all these Set-Up Movies for the reasons it’s not supposed to work (but somehow,it does).Literally everything about this movie is flawless. Yeah,sure,there are some jokes that didn’t land as much as the previous one...Yeah,the Animation was interchangeable at times and yes,it has a soundtrack with classic hits (aside from Sunflower and What’s Up Danger?) that feels perfect for a dumb YA Movie,but who cares? There’s a real Entertainment value behind this movie,and it shows all its hard work put into this. It may also be the most Personal movie I’ve ever seen,considering the fact that Miles Morales (the main character of the movie,played by Shameik Moore) is me,but black and Spider-Man.Difficult relationship with his dad? Check.Being in the wrong school because of the dad’s reasons? Also Check.Always trying to save/help somebody out? Umm,hell yeah.This is my favourite Screenplay of the year for all these reasons and so much more,but also because it manages to combine all the previous Spider-Man outings (for example,the Raimi trilogy for its Origin story,the character getting beaten to the ground morally and….maybe too many villains?) and still trying to be a movie of its own,with new characters,frenetic action scenes (some of them brutal for a kids movie,where even Japanese media ain’t got nothing,even if that means whatever the hell that was in Akira),brilliant character development (we get to care about a living pork,for Pete’s sake) that is all accompained by fantastic animation. Sometimes it’s a living comic-book,sometimes it’s a Borderlands game,and sometimes a PS2 game (mainly for character animation),which keep in mind,makes sense for the world we’re watching.Th screenplay also manages to get excited for its future Cinematic Universe (with a sequel and an all-female spin-off already in development). When’s the last time you’ve seen a non-MCU Movie that got you excited for its universe of future movies? As I said before,the Screenplay also manages to get brutal at times,with a punch by a big buff dude like Kingpin that feels like the Apocalypse and a gunshot that kills a character. Again,when’s the last time you’ve seen a brutal non-Pixar animated movie?It also doesn’t stop to reference something classic for laughs and be Deadpool or LEGO Batman for a second,no no no,because the references are actually in favor of the story,whether it’s a character introduction or a post-credit sequence.Oh,and the 3D is so good,it’s honestly the best use of 3D since Avatar. Not even a second to be on screen and the colors pop out the screen on purpose,making this movie the best acid trip since 2001 A Space Odyssey. The Comic-Book effects leap as if we’re seeing a literal comic-book,and the image sometimes feels worthy of a Best Cinematography award.Overall,there’s really nothing to complain about in here. After walking out of the theater,I said to myself “Man,this one will be hard to write because everything about it is really good”,but no. I really had fun doing this. This is also the kind of guts a typical movie critic has. Usually,we enjoy talking TNTs about a bad movie,but sometimes,a good movie can feel like a new quest,a new journey in a movie critic’s life,and I didn’t think a Spider-Man movie would accomplish that (But again,this was a year where an Action Movie made me scream at an IMAX). I will come back at a new Sony Spider-Man movie full of hope,and luckily,with pure excitement. Please,go see this movie.It's really worth your time and pennies."
    },
    {
      "rating": "8",
      "text": "Sony made a good (dare I say great) superhero movie!Spider man into the spider verse is a piece of modern art. With stunning visuals and funny characters it is hard to be disappointed, it felt like reading a graphic novel front to back!The down fall is the plot. It is the best depiction of different universes I have ever seen but the story line is taken over by the visuals. Some of the characters felt mismatched (the anime girl with the robot) but in the end it came together.Most importantly, we need a spider man noir sequel!"
    },
    {
      "rating": "10",
      "text": "Was that very hard to make a very decent Spider-man movie, Sony?Spider-man: Into the Spider-verse is directed by Peter Ramsey, Robert Persichetti Jr. and Rodney Rothman, screenplay by Phil Lord and Rodney Rothman, and voices-starring by Shameik Moore, Jake Johnson, Hailee Steinfeld and Mahershala Ali.Story by Phil Lord, and it's about Brooklyn teen Miles Morales, and the limitless possibilities of the Spider-Verse, where more than one can wear the mask.First time I heard about this movie I wasn't that hype about the idea of the movie or the animation. The trailer wasn't so clear about its animation, or the very bold storyline! When I went to see this movie I was blown away by the striking animation and the bold storytelling.. I think it's a very risky step for Sony to take, to make a very unique, new and comic-alike animation, I mean what if the audience didn't like it? It could have been a big disappointing movie, because it has an amazing story, I think this story is definitely the best story of the whole Spiderman movies, also the animation is amazing, it's flawless! When an animation movie brings the live-action movies down, it means that it's definitely unique and bold!!The story didn't take so long to get you into the main plot, it went with its surprising \"scene\" -I'm not gonna spoil anything in this review- and though it made a very good introduction of the characters, so the first act was very good, shocking and humorous too!The second act still a very funny and thrilling as the first act, introducing the rest of the characters, so it took more time to get us back to the main plot, and I loved it, because some characters wasn't that clear in the first act that I wanted to know more about, and others that I wanted more of their backstories because I liked them! After introducing the \"rest of the characters\" we get another shocking scene, driving us to another shocking scene.. excuse me if I'm mysterious about some stuff, but I don't want to spoil anything, and still, if you watched the movie, you're gonna understand me very well.The third act was very predictable though, but still very thrilling because of its amazing animation combined with the amazing action, and emotions... Oh yeah, the third act is completely emotional, and action-full!There're not any subplots like Fantastic Beasts the Crimes of Grindelwald or something, it's very straight and clear.. very good for kids, and amazing for Spider-man fans and adults as well.I think that Spider-Man Into the Spider-verse is the Spider-Man that we deserve as fans of Spider-Man and it's definitely the best Spider-Man movie of all the time.! And of course, Spider-Man Into the Spider-verse gets an A+!Alright, guys.. thank you as always for reading and supporting my work, and if you liked this you can click on my name above and read all of my reviews, lots of movie-reviews are coming ahead.. thanks again!"
    },
    {
      "rating": "9",
      "text": "I really liked the movie. A wonderful soundtrack, a picture that pleases the eye, I really liked the plot, not intricate, but with sharp turns. Could squeeze a tear.Why then 9/10? There was a thought: \"When will it end?\"Sony, you are not there **** such a cool movie to do?I'm a child from Russia, so forgive me for the clumsy translation."
    },
    {
      "rating": "9",
      "text": "It felt like this film will be a major influence on future films (animation or live action). A wildly successful experimental art film in a genre that allows it to make perfect sense! A must see."
    },
    {
      "rating": "10",
      "text": "Amazing, just amazing. Don't start wondering why this would be good, trust me, it is. Just go watch it, especially if you are a Spider-Man fan."
    },
    {
      "rating": "10",
      "text": "I didn't know it was possible, but somehow Into the Spiderverse brings freshness and innovation to the superhero genre. What is even more impressive is that it takes a new spin on the age-old Spiderman origin story. From a structural standpoint, this movie is the complete package. The animation style and character design are a aesthetically pleasing mix of vintage and digital. The script packs emotional punches and hilarious laughs. The voice acting cast is great. This is a rollercoaster of a movie that has no right being as good as it is. Easily one of the best animated pictures of 2018."
    },
    {
      "rating": "9",
      "text": "I don't want to say much of anything about this movie, as it needs to be experienced. The less you know about it going into the viewing, the better. It's almost perfect in every way. If I HAD to come up with something to complain about, it would be that Miles' personality gets a little too smug in places towards the end, but even that is really reaching. There's also one logic issue in the movie, but it's very minor. Other than that, it's perfect."
    },
    {
      "rating": "9",
      "text": "The movie has a distinct visual style, which I thoroughly loved for the entire film. There was also an excellent music soundtrack that accompanied every scene of the movie, and I appreciated the hip hop influences on the music and the characters. The story was fun, although I thought that some of the characters were a bit superfluous. It also followed many of the superhero origin tropes, which I wasn't expecting based on some of the reviews calling this \"like nothing you've seen before\". Overall, very enjoyable and I look forward to a sequel."
    },
    {
      "rating": "9",
      "text": "Absolutely incredible in every sense of the word. The visuals, the story, the music, the voice acting (especially Cage, Steinfeld and Johnson) are stellar. I'm not a fan of Miles Morales or the character but this movie far exceeded my expectations in every way."
    },
    {
      "rating": "9",
      "text": "This movie was a huge - and pleasant - surprise, 'Spider-Man: Into the Spider-Verse' isn't another live-action Spider-Man reboot from Sony, nor is it part of the Marvel Cinematic Universe. It's well and truly its own story that focuses on the character of Miles Morales (Shameik Moore) and his pretty ordinary teenage life. Dealing with his father's moral ways because he's a cop, coping to get through school even though it's boring for him. Everything just gets routine for him, except for the one person he looks up to, his uncle Aaron Davis (Mahershala Ali) who gives him the right amount of confidence boost that he needs in his daily life. Miles also meets a young girl in his class, Gwen Stacey (Hailee Steinfeld), and she appreciates his wit and even odd - yet quirky - personality. One day, Miles stumbles across an incident that involves the evil Kingpin (Liev Schreiber) who has invented a device that can create portals from one universe crossing paths with another. A rift causes another Peter Parker (Jake Johnson) to slip through the vortex and enter the universe that Miles is in. Miles aspires to be just like Peter after he was also bitten by a radioactive spider, but Peter tells him that there is much to learn. It seems that Peter isn't the only one that crossed paths with Miles, as there are a handful of other \"Spider-People\" that somehow got lost into this universe too, from; Spider-Noir (Nicolas Cage), Spider-Gwen, Peni Parker (Kimiko Glenn) and Spider-Ham (John Mulany). They all team up to try and come up with a plan to get each of them home back to their own universes. The movie certainly is a breath of fresh air into a character we have seen in the movies so many times before. This may just seem like Sony - once again - trying to cash-in on the character, but thanks to a script by Phil Lord ('The LEGO Movie') and Rodney Rothman, it has heart and very self-aware humor that keeps it afloat. It acknowledges its silliness and embraces that, it's overstuffed but also is aware of that too. Most importantly, it captures the spirit of the Spider-Man character and the world (or 'worlds') that he inhabits. Sony has been desperately trying to adapt a Miles Morales story for years and years, and this is the best introduction for him, especially for people who may not be familiar with his story. The animation is eye-popping as well, making it feel like a comic book leaping off the pages. Overall, this movie is fun, fast-paced, touching and wildly funny. If you love Spider-Man, this might just be the movie you've been looking for since 'Spider-Man 2' (2004)."
    },
    {
      "rating": "9",
      "text": "this movie was genuinely fresh, beautiful and kinetic, a perfect comic book visual style movie, with the blend of sound and movement. story in it self is not extraordinary, theme also remains somewhat similar to old movies, but the execution is great, which makes it unique in its own style."
    },
    {
      "rating": "8",
      "text": "Spider-Man: Into the Spider-Verse is one of the best movies of the year.A different and unique animation, a perfect soundtrack and a narrative and incredible characters.Spider-Man: Into the Spider-Verse is the Spider-Man movie that was already needed."
    }
  ]
}