{
  "id": 123,
  "title": "Spider-Man: No Way Home",
  "starring": [
    "Tom Holland",
    "Zendaya"
  ],
  "runtime": 148,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uJYYizSuA9Y3DCs0qS4qWvHfZg4.jpg",
  "categories": {
    "plot": 5.947368421052632,
    "acting": 6.285714285714286,
    "ending": 6.636363636363637,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 10.0,
    "funny": 6.0,
    "action": 7.222222222222222
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie is something so epic, so exciting, so cool. It's such an ambitious and risky film project. It's something never seen before, and that makes it something special and unique. To have all three Spider-Men from all the franchises and with their respective villains together is glorious. Nothing more to say. Thank you Sony and Marvel."
    },
    {
      "rating": "6",
      "text": "es buena, pero es puro fan service :vademas de tener varios huecos argumentales"
    },
    {
      "rating": "10",
      "text": "I thought that this movie would disappoint me as I was worried to see how the MCU handles the older beloved characters. But I am glad to say this is one of the best Spider-Man movies ever made. I Still think Spider-Man 2 is better but this one is really good."
    },
    {
      "rating": "10",
      "text": "Absolute dream come true for Spider-Man fans. I really loved this movie as I enjoyed every second of it from beginning to end."
    },
    {
      "rating": "10",
      "text": "Best Spider-Man movie out there!! This movie was so emotional, as it was happy, sad, and overall just a very highly emotional crowd-pleaser from start to finish."
    },
    {
      "rating": "6",
      "text": "The poorly written, awfull dull, CGI overwhelmed superhero opera, fails to retrieve any emotional impact from the packed theatres. The film that emotionally bland as well as putting in lots of nostalgia and commendable character development to the spider man saga, that is more than enough to draw in thousands of blinded Marvel fanatics and keeping them away from real cinema power."
    },
    {
      "rating": "6",
      "text": "I made a decision not to see any more Spider-Man movies after Spider-Man: Homecoming. The adaptations were clearly not aimed at me, they felt very kiddy and I was done. Well I think we all know why I’m back now to see this particular adaptation, I finally caved and went to see the new Spider-Man. No spoilers but if you’ve made it this far without knowing any major plot points then you must be living off the grid because by now the spoilers are everywhere you look.Picking up immediately after Spider-Man: Far From Home with Spider-Man’s identity now revealed to the entire world, Peter (Tom Holland) looks to Doctor Strange (Benedict Cumberbatch) for help undoing this situation. Well the spell doesn’t exactly go according to plan and soon dangerous enemies from other worlds start showing up and causing havoc. Peter must then embark upon a journey to discover what it really means to be Spider-Man, “with great power comes great responsibility” and all that. It’s not a Spider-Man movie if you don’t have the responsibility quote.Look my main issue with the Holland Spider-Man movies was that they never actually felt like Spider-Man movies but more like an Iron Man movie featuring Spider-Man or in this case a Doctor Strange movie featuring Spider-Man. At this rate Spider-Man is getting overshadowed in his own movies. I missed the more focused Spider-Man films in the Tobey Maguire era (not you Spider-Man 3). I liked the simple costume, one main villain and enough room to develop the characters. With each new adaptation of Spider-Man they became more overblown with mediocre villains. Well there’s plenty of villains to go around this time with one in particular stealing the show. Also it’s worth mentioning that J.K. Simmons played a character so well in the Sam Raimi movies that not only did they not even try to recast him for The Amazing Spider-Man movies but for No Way Home they just got him back as the iconic J. Jonah Jameson. He is one of the few on-screen characters that looks like he was 100% lifted straight from the comic book pages and onto the big screen.It’s very cheesy and it had some great moments that I thoroughly enjoyed but let’s not pretend that Spider-Man: No Way Home didn’t just look at the success of Spider-Man: Into the Spider-Verse and copy that format. One scene set in the woods particularly stands out and almost looks like a complete remake. There is a strong sense of paying fan service here and attempting to keep everyone happy. But as we all know, you can’t keep every group of fans happy but No Way Home was probably the best attempt so far. As I’ve said before, nostalgia sells and the opportunity here to get every single Spider-Man fan into the cinema to see No Way Home was too great to miss. At least it tried to fix some of the issues that the other films messed up on, I enjoyed it but nothing will ever come close to the first two Sam Raimi Spider-Man films. Recommended for all the Marvel and/or Spider-Man fans."
    },
    {
      "rating": "10",
      "text": "Best Spider-Man movie ever! This movie is fan service done right and is my new favorite Spider-Man movie."
    },
    {
      "rating": "6",
      "text": "By trying to do so much, they end up doing nothing of worth. It's fun, but ultimately forgettable."
    },
    {
      "rating": "6",
      "text": "Too much stupid jokes, the fights could be so much better and the moment when Tobey and Andrew appears was so **** anticlimatic..."
    },
    {
      "rating": "5",
      "text": "+2h de moralismo sin sentido,  reinserción de presidiarios y cosas que ya habíamos visto. Escenas emocionalmente aburridas. En general la película no tiene mucho sentido y se hace larga"
    },
    {
      "rating": "6",
      "text": "- wierd ending - happy isn’t the same personality as in homecoming or far from home"
    },
    {
      "rating": "9",
      "text": "The anticipation for a Marvel movie certainly hasn't been this high since 'Avengers: Endgame' two and a half years ago! In this one, Peter Parker (Tom Holland) finds his life spiraling out of control after his identity as Spider-Man is revealed to the world following the events of 'Far From Home, and he soon seeks out Dr. Strange (Benedict Cumberbatch) for help in order to try and undo the events from occurring, which inadvertently opens up the multiverse and unleashes several familiar villains, including the likes of Doctor Octopus (Alfred Molina), The Green Goblin (Willem Dafoe), Electro (Jamie Foxx), and many more. Now I know what some of you may be here for, and some of you (or at least those of you who don't mind spoilers) more than likely want me to tell you whether past Spidermen Tobey Maguire and Andrew Garfield are in fact in the film, which of course has been the biggest rumor swirling around this film. And to that I say to simply just do what I did prior to walking into this film, and just go in expecting this to be a great film regardless of what that outcome may or may not be, because this film delivered in so many other fantastic ways! The action is incredible, the emotions run surprisingly high, and there's plenty of winks and nods and Easter eggs galore that call back to several past 'Spider-Man' films. For those of you worried about excessive fan service, you needn't worry, as it's only ever used to serve and progress the story further without being too overbearing. As for the performances, while you usually wouldn't expect much from a superhero film, Tom Holland delivers what I'd easily call his best performance to date. Furthermore, his  chemistry with Zendaya remains one of the most charming and endearing aspects of these films. Another one of my favorite things were the villains and seeing all their familiar faces, cause trust me when I say that the nostalgia factor here is going to run VERY high with almost any audience member who grew up watching both the Sam Raimi trilogy and the two 'Amazing Spider-Man' films, and the villains all undoubtedly play a great and huge part in that. Really if there's any issue I have at all with this film, it's that it maybe even gets a little too overly sentimental a time or two, but most people probably won't even mind that, and this film is already near perfect as is! So overall, I'd say that this is EASILY the best Spider-Man film to date, and even one of the best superhero films of recent memory! Quite simply put, it's the ultimate love letter to Spider-Man, and I really don't think anybody's gonna to be disappointed with this one, trust me on that!"
    },
    {
      "rating": "10",
      "text": "SpiderMan No Way Home is Goosebumps Goosebumps Goosebumps !!!!! That's the review in short .Fan service actually, full on #spiderman treat to everyone loves Spidey ,Marvel is marvelous team of entertainment .Once again they provided utmost pleasure of entertainment with high standard of film making !!!VFX is spectacular, background score and it's technical side is perfect.Performance vice every one has their time to steal the show : tom holland , Zendaya & Benedict Cumberbatch all did well !Over all spiderman no way home is emotional fantabulous marvelous entertainment to enjoy again' and again for me."
    },
    {
      "rating": "6",
      "text": "Before all the hype, I wanted to see Spider-Man in the movies, and the hype only made me want to see more. I didn't know what to expect, but I certainly expected better than what I saw. In addition to being a snooze festival, it was so corny and saccharine that I made an appointment to visit the dentist during the film.The film began to deteriorate the moment Peter Parker (Tom Holland) went to Doctor Strange (Benedict Cumberbatch) for a spell to make everyone forget about him. It wasn't a bad idea for Peter to go to Doctor Strange to fix his little revealed identity problem, it was just weirdly dumb of Doctor Strange to actually accommodate Peter. Dr. Strange really tried to make everyone in the world forget who Peter Parker was. It was a massive spell that felt too excessive just to fix a man's problems. The movie went into silly mode as Parker kept interrupting Doctor Strange as he did the spell. The result was a multitude of old enemies from different universes converging on this universe to find Parker. If it was explained, it was poorly explained.At this point, the film was on shaky ground, but it didn't budge. \"No Way Home\" would suffer another setback when Parker fought Strange to stop him from sending all these villains back to their respective universes. See, if they came back, they would meet death at the hands of, or because of, this universe's Spider-Man, and this universe's Spider-Man was too moralistic to allow that to happen. No, Parker would fix this so everyone could go home and live happily ever after.Everything after that part of the movie was immaterial to me in the grand scheme. To me, when a plot is based on a flawed or just plain bad premise, everything that follows is equally wrong and pointless. Not that the things that follow can't be aesthetically cool; they are just empty.Parker was acting on the fair advice of his Aunt May (Marisa Tomei). By his wisdom, Parker had an obligation to help these poor misguided men, no matter what the exponentially more experienced Doctor Strange said. Doctor Strange wanted to do the most logical thing which was to send each villain back to their own universe and let fate take over from there. Parker, with his oversized heart and undersized common sense, wanted to keep them in his own universe as pet projects until he could fix them and then send them back. Forget that he would actively tamper with the course of events from another universe, massively altering their timelines with incalculable consequences, he simply wasn't old enough, wisdom, or experience enough to know what the best thing to do was. Also, it was a slap in the face to the other Spider-Men. As if to say, \"You guys are screwed, I'm going to find a better, healthier solution because I'm a better Spider-Man.\"I was so disturbed by this new Spider-Man mission to save these villains that everything after that started to bother me. The attempts at comedy were awkward and grossly bland. The emotional moments were very frequent and long. The last nail in the coffin of this was execution time. Man, they dragged this. I could tolerate a didactic and flawed plot if you explained it to us in a quick and exciting way, but in their attempts to send this great spider-man, we had to suffer through an ocean of tears, an abyss of emotions and an abundance of silence with slow music. Everything was set up for them to restart Spider-Man if necessary, but at this point I could use a break and no more Spider-Men about \"home\"."
    },
    {
      "rating": "6",
      "text": "I didn't like nor the concept of this new movie, nor the plot. Plus, I thought it was all explained in a rush, so that it couldn't be considered as th end of the movie."
    },
    {
      "rating": "9",
      "text": "I've seen this movie now twice, and I can safely say it's my favorite Spider-Man film. This movie had no business being this good. All it needed to be was a quirky introduction to the multiverse slathered with fan-service. Tom Holland could have just joked around with his buds and the movie would have made billions, and it would have accomplished what it set out to do. But instead, what we got was a slugger to the gut. One of the finest casts I've ever seen in a film with each one bringing their A game would have been enough as well (and we got just that), but NO. The writers decided to ALSO hit us with a death blow to Aunt May, fulfilled character arcs for several characters--in this universe and others--and the perfect conclusion to Tom Holland's Peter Parker trilogy wrapped in gut-wrenching depression with a tinge of bittersweet satisfaction. The MCU Spider-Man saga could have ended here and I'd have been blown away ultimately, but they still intend to do more with this character going forward: this poor, distraught, heroic, broken, courageous boy who sacrificed literally everything to be the hero the world needed in that moment. He carries the burdens of his failures into a world where no one else will have to face the ramifications of them but himself. I am still feeling pain for Peter, and I did not go into this calling myself a Spider-Man fan. This film has made me one, and I love it to my core.What I liked most were the acting performances, most notably from Andrew Garfield, Jamie Foxx, Willem Dafoe, and Tom Holland (who has his career performance to date in this film). Andrew's Peter got a wonderful completion to his forgotten saga and Tobey's Peter is clearly arced during this film, and he plays the role of the elder Spider-Man excellently. I also loved the execution of Aunt May's death. They made her relevant in a believable way and gave her the end that would propel this Spider-Man into a league of his own. The thematic conclusion for Tom's Peter was the cherry on top of a bombastic, yet darker blockbuster epic.The elements I was not a fan of, however, were the way in which the Spider-Mans were introduced, some of the villains having questionable motives, and the fact that I'm still nervous about what this does to the MCU as a whole, but probably only because I have no real idea where they go from here with Peter, and I have my concerns about what they might be gearing up to do, but I'll hold my breath until the next one. There were also some sloppy editing moments, especially in the final one-on-one fight with the Green Goblin. But ultimately I can look past a lot of the heavy CGI and excessive action-sequence cuts because there were far more strong suits, such as the CGI fight with Doctor Strange that had little to no cuts at all and was a beautiful sequence.All in all, this was a spectacular film for what I went in expecting. Not a perfect one, but if you're expecting the Godfather, you're in the wrong theater. This is a fun, colorful, exciting, eventful, emotional flick that should have any moviegoer pleased with the result. Marvel still deeply cares about its work some thirteen years later, and that does put a smile on my cynical face. For me, it gets a 9.2/10.FULL SCORE:Production: 22/30--Acting: 8/10--Direction: 7/10--Crew/Effects: 7/10Story: 26/30--Plot: 9/10--Characters: 9/10--Theme: 8/10Immersion: 24/30--Soundtrack: 7/10--Visuals: 8/10--Style/Vibe: 9/10Personal Enjoyment: 9.2/10Analytical Score: 81.2% B(S: 96-100A: 87-94B: 75-84C: 65-74D: 55-64F: 0-54)"
    },
    {
      "rating": "5",
      "text": "Very overrated film, there was no purpose to it, didn't need to be made, the acting was sublime and so was the plot."
    },
    {
      "rating": "4",
      "text": "spider man no way home is a bad movie whit a poor writing only thig wy is not terrible is the aparacion of all tree spiderman"
    },
    {
      "rating": "10",
      "text": "Spider-Man: No Way Home exceeded my expectations and blew my mind with how action pact and exhilarating it was!"
    },
    {
      "rating": "6",
      "text": "Ну такое, единственное что вытянуло этот фильм, (СПОЙЛЕР) были старые паучки"
    },
    {
      "rating": "4",
      "text": "Very little character development ontop of a stupid plot. I am a huge spider man fan and have liked all films leading up to this one, but this is the worst one byfar."
    },
    {
      "rating": "4",
      "text": "It was a good movieIt was almost what I expectedBut it could have ended better because it somehow removed parts of the first part of the second"
    },
    {
      "rating": "6",
      "text": "Not a good movie but old spiders return is a good though I don't know what's those makeHowever i don't want to blame themIt's could be a blow minder story from multi-verse and returns of Tobey and Androw"
    },
    {
      "rating": "6",
      "text": "One of the worst from Tom Holland series.Too fast, too much fan service, too little valuable content. The story does not hold to the hype, but more importantly, it does not hold to an actual consistent one.Plenty of action, tire. But not worth it for me..."
    },
    {
      "rating": "5",
      "text": "C'mon, the cameos were cool and all but there was no meaningful plot; magic and the multiverse is not a plot!  or it's a lame, kiddie plot, which is what this movie is.  I like Tom Holland but I am so sick of lame, whiney, **** spiderman who can't do anything because of \"feelings.\"  i hope this is the end of his lame-o spiderman career."
    },
    {
      "rating": "4",
      "text": "This movie is great throughout the first half, but it gets to emotional and akward."
    },
    {
      "rating": "5",
      "text": "Not a bad idea, but a terrible end, adding old villains, they embodied a new life in them, it looked interesting, but in the end they decided to erase the memory of the whole world, thereby giving rise to a multitude of inconsistencies"
    },
    {
      "rating": "10",
      "text": "This movie had the makings of one the would surely disappoint from all the hype that was built up and the absurd amount of plot lines going on. I was expecting a Spider-Man 3 level of wasted potential... But somehow they were not only able to pull it off, they exceeded my expectations... Everything I was hoping for was there and they still managed to surprise me multiple times. This is also the moment I've been waiting on. Tom Holland's Spider-Man finally became Spider-MAN. He finally got out of the shadow of Tony Stark and stopped being the kid that screws up and has to fix his mistakes. I can't wait to see what direction they take it from there because that ending is perfect and not one I ever expected them to go."
    },
    {
      "rating": "6",
      "text": "Preface: I am a massive Tom holland spiderman fan. Say what you will but Homecoming and Far from home are in my top 10 of the MCU. With that said:This film attempts too much and so too much is rushed. The pacing seems strange to me, scenes where we might expect more exploration and didnt get it. The amount of plot armor in this movie is ridiculous. It tries so hard to be a heart string puller but none of that really illicits a response from the audience. Its like they saw how people reacted to the end of End Game and thought \"hells yeah lets PUMP this movie FULL of it\". The jokes and gags were funny as always. But instead of it being a light hearted entertaining film, they tried to make it a serious sad film with some light hearted aspects. It almost contradicts the whole character building that took place in the previous 2 movies. I enjoyed it but i didnt love it.Tom Holland is still a total GC though. Play golf with me!"
    },
    {
      "rating": "10",
      "text": "It was amazing, all what I want in a movie.The only thing that didn't enjoy was the evangelization of the villians."
    },
    {
      "rating": "4",
      "text": "Aside all the fan service, it is only an average Marvel movie. It loses a lot value as a piece of individual art as it depends so much on nostalgia and all the background from previous movies, as there is almost no character set up and the only character with real developement is the protagonist. It also makes it somewhat unique, for it works as a sort of conclusion for movies from other sagas."
    },
    {
      "rating": "6",
      "text": "When you take out all the fan service, what you find beneath is a poor acted movie composed of many separate ideas that struggle to get together. Albeit this, the movie has it's positives like bringing to the MCU's Spider Man the conflicts which the comics' Spider Man faced. This deeper emotional aspect helps to fill the void left by the movie's lack of quality acting. Exception is Willem Dafoe's acting, which clearly stands out as a better one. Tobey Maguire just seems completely out of it while Andrew Garfield tries to bring the Amazing Spider Man back. With exception of the Green Goblin and Doc Oc, the other villains just look like fillers, also Doctor Strange feels completely out of character again as he is the main culprit ot the movie's plot."
    },
    {
      "rating": "6",
      "text": "This film isn't bad but it isn't that great either. The story is quite bad; no multiverse film has managed to create a good, interesting story so I am not surprised that this film failed too. The first hour is incredibly dull and uninspiring; it does nothing unique or interesting. The returning villains are somehow swept aside as if they are just playthings. They take no longer than 5-10 minutes to defeat which is crazy considering there was once a whole film dedicated completely to them. Tom Holland's Spiderman isn't this powerful, its just a bit ridiculous. The film gets better in the the second half when the other spidermen come into the film. They really transform the film and create the best moments. Andrew Garfield's and Tobey Maguire's spidermen have amazing chemistry and really improved the film. Tom Holland's spiderman is, simply put, dull compared to the other actors' adaptations. Aunt May's death means nothing; we barely know her so why would we care so it wasn't sad at all. The only part of the film that was sad was when Andrew Garfield's spiderman saved MJ as he was finally strong enough to save someone spiderman loved. Despite these criticisms the film isn't bad; the other spidermen turn the film from mediocre (rating of 5) to quite good (rating of 6). There were some really good moments but the film suffered from a bad story and a poor portrayal of spiderman from Tom Holland. I'm not saying he is a bad spiderman because he's not but his story just doesn't appeal to me, its nothing that hasn't already been seen and is just boring.Overall, the films ok with some good moments sprinkled towards the end of the film."
    },
    {
      "rating": "5",
      "text": "Massive plot holes, character assassination (Dr. Strange is written as an idiot), contrivances, and character flips for no established reasons, drag this down.  It is fun, but vapid.  Dr. Strange's power levels has no continuity in this, as he now can causally alter the entire MULTIVERSE, which makes him far more powerful that the entire Infinity Gauntlet (with all the stones).  This means he should be very easily to do anything, yet the plot does not allow that.  Also, you need to ignore that Spider-man (at least one of them) gets innocent people killed yet just shrugs it off.  Nice to see that heroes do not blame themselves for reckless behavior.  The excuse of many defenders of this movie is that they had \"good intentions\" and this just shines a light on modern society and it's failure to understand that is not acceptable, especially for a hero."
    },
    {
      "rating": "5",
      "text": "What a EPIC movie man. My mind is BLONEAWAY it's Oooosam you must watch it on biggest screen possible"
    },
    {
      "rating": "6",
      "text": "Honestly im truly disappointed, but i had fun. The directors brought in major actors and villains from the previous movies like the original and the amazing spiderman. Sadly i wasnt a fan of the new take of MCU's spiderman in the first place, its less spiderman like and less peter parker, less NYC, and more Tom holland and his fellow friends. It aint a 9-10 as some claim it to be, tho i wish it was! It really needed more of toby and andrew in it and also more of the villains which were completely discarded in this movie, to a point that they are pretty much forgettable which is sad! You have the green goblin, dr octo octavius, electron etc.. and you barely get a background check on them nor rewind, and here is tom to save the day, defeat bad guys, and take place for tobey and andrew. Overall, i would say, just wait till you can rent it on youtube for cheap. I really wanted to see more tobey save the day, with andrew and tom, and have a longer, more enjoyable time knowing the characters. But i didnt get that, and the action was so little, and the movie is so short so dont worry about holding your weewee the entire movie."
    },
    {
      "rating": "0",
      "text": "The filmmakers put their faith in a character, not fireworks, and the result is"
    },
    {
      "rating": "5",
      "text": "Una película insulsa, sin ritmo, con un guion muy mejorable. Desde mi punto de vista tiene muchas incongruencias. Dr Strange no le puede quitar un caramelo a SpiderMan?? Por otra parte la aparición de Garfield y Maguire, me parece que sobraba, no ha aportado nada que no pudiera aportar May cuando le dice la mítica frase poco antes de morir, o incluso Happy o algún recuerdo de el mismo con Tony. El medio sacrificio que hace Maguire al final perfectamente podría haber sido Ned. Vamos que la aparición de los otros Spiderman es innecesaria."
    },
    {
      "rating": "6",
      "text": "It's likely not too much of a stretch to say that Spider-Man could be the most widely marketed superhero of all time, with only maybe Batman giving him a run for his money in that department. I've seen the character in so many different forms and incarnations over the years that after Far From Home I honestly thought I was getting Spider-Man'd out. Upon finishing this however, I'm now wondering if instead I'm just not that much of a fan of the MCU's take. Seeing all the bits and pieces pulled from the previous silver screen adaptations of Peter Parker made me realize exactly how much I'd be down for a fourth Raimi movie or even a third Amazing. Another Tom Holland standalone though? Despite loving Homecoming and there being nothing inherently wrong with this or its other direct sequel, I'd pass in favor of seeing his story continue in one the universe's shared outings for a few reasons.The first might simply be Jon Watts. It's no secret that when you sit down to watch a Marvel flick you're in for lengthy ride. Their very best releases however are able to somewhat prevent you from realizing this in the moment by how well they keep you engaged with the studio's established mix of humor, heart, and action. Watts is using the exact same formula, but has been unable since his first entry to apply it a manner that's kept me from feeling every excruciatingly long second of the 2 hour+ running-times in either of his two Home (Far From and now No Way) follow-ups. Then there's the supporting cast. I don't care about the likes of Ned Leeds or \"Happy\" Hogan the way I have the Harry Osborns and Gwen Stacys of the past, while the original interpretations of returning staples such as Aunt May and MJ are nowhere near as endearing. An unfortunate fact given what a large role they all play in these films and probably the best example of how not every aspect of the MCU's unique vision for Spider-Man has been for the better.None of that is to say this isn't worth watching. It's just what kept the biggest MCU event since Endgame from hitting home with me personally. When it's delivering on all of its wildest rumors however, even I was elated. Not every of promise gets fulfilled as it turns out stuff like the mid-credits scene in Let There Be Carnage was a complete waste of everyone's time, but there's enough here to make for a longtime Spidey fan's ultimate wet dream. I particularly loved how it gave me the slightest bit of insight into what the lives of certain characters were like after where they ended up the last time I got to see them onscreen. The whole thing also serves as a soft reboot of the titular hero that takes him back to his roots so the future is as always open to a wide range of interesting possibilities. Whether one of those potential directions it can go in will cause me to finally embrace Holland the way I did Tobey and, yes, even Garfield is another matter, but at least my curiosity as to what may come next has cautiously been piqued following a period when it had waned almost entirely."
    },
    {
      "rating": "6",
      "text": "There’s no attempt to hide that the film is pure fan service, a greatest-hits mashup of Spider-Man’s cinematic legacy"
    },
    {
      "rating": "5",
      "text": "They nailed it. Great movie. Easily in top 5 of all Marvel movies. Believe the hype on this one."
    },
    {
      "rating": "5",
      "text": "This is an epic film that plays on the nostalgia and feelings of the spectator, a great fan service that is too enjoyable."
    },
    {
      "rating": "0",
      "text": "Nostalgia cashgrab the movie, felt like an SNL skit. Iron Man Jr Tom Holland still sucks"
    },
    {
      "rating": "6",
      "text": "Just not convincing enough. The story was interesting enough but didn’t have the epic moments that made you think ‘wow’. Tom Holland, doesn’t do a convincing American accent and for some reason makes his role a little less authentic and likeable. The film really was more a biopic of Spider-Man and all the other actors etc are there to support his storyline. In many Marvel films, there’s bigger stories weaving it’s way throughout to add depth, But here, none. Just Spidies internal struggle. Dr Strange’s role in the film was whimsical.The bad guys were mainly just their to fill the narrative and not create any real surprise. (Except one major surprise).Worth the watch but forgettable."
    },
    {
      "rating": "5",
      "text": "its a guy from fortnite guys WAKE UP! they at least made so 2 copys of him and changed a suits but they did give credits so this movie is so mid and i cant give more than 5"
    },
    {
      "rating": "4",
      "text": "The one redeeming quality is having the other spidermen play off each other which to be fair is a really interesting concept but the problem is that's all the movie has going for it. I would like this movie much more if into the spiderverse didn't already do this type of plot, I think that movie did much more with the multiverse setup where as No Way Home just uses it for fanfare. Overall not a terrible movie but not that great either."
    },
    {
      "rating": "6",
      "text": "You’ll love this movie if you like every other Marvel movie and if you saw the original Spider-Man and Amazing Spider-Man movies. You’ll be very confused if you don’t remember or haven’t seen those past Spider-Man movies. With that said, that’s all that’s special about No Way Home is the fan fare. The plot is a good idea, but not played out right. Character setup without any spoilers is done poorly. The action is way too goofy and over the top. The dialogue is for the most part bad. There were a few funny jokes, but nothing great. Overall just another mediocre Marvel film."
    },
    {
      "rating": "4",
      "text": "Fan-service?!, many bad reviews just claim this. In my case, this is the only reason why I am giving this movie 4/10 but the truth is... the plot doesn't hold up, the acting is mediocre, the special effects are truly bad (Doc Oc. looked more realistic in Spider-man 2 nearly 20 years ago), and oh God, the cars that are smashed in the bridge fight are so awfully rendered that the PS4 Spider-man game looks way better. Yeah, it had many great characters, yeah it had many great heroes and villains from the other movies, but still... I left the movie so disappointed!!! It really felt that Marvel and Sony wanted to copy everything that worked in all the other Spider-man movies and Avengers and throw everything in a single 2:30 movie, the result is that no single character is developed in this movie! Yes, I watched every other single movie but I really couldn't care less about any character this time, because each character screen time was completely insignificant. Not to mention the scene in which Ned brings the two spidey's to help, oh God, what a mediocre and absolutely ridiculous scene!!! I honestly have no idea how so many people that claim to be fans have been giving this absolute mass of a movie a 10/10 or 5-start rating..."
    },
    {
      "rating": "6",
      "text": "Good movie. Probably the biggest film of the spiderman series. I don't hate it but I also don't like it. Please don't come at me for this."
    }
  ]
}