{
  "id": 71,
  "title": "Spider-Man: Far From Home",
  "starring": [
    "Tom Holland",
    "Samuel L. Jackson"
  ],
  "runtime": 129,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4q2NNj4S5dG2RLF9CpXsej7yXl.jpg",
  "categories": {
    "plot": 8.071428571428571,
    "acting": 7.458333333333333,
    "ending": 7.928571428571429,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.684210526315789,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Quite a few funny moments. Has a very teenage vibe to it. Plenty of action keeps you interested. Suffers from being the first Marvel movie after Avengers: Endgame as it doesn't live up to the hype still fresh in memory."
    },
    {
      "rating": "7",
      "text": "While “Far From Home” lacks the small scale of “Homecoming” that gave it a personal touch, it mostly makes up for it with wonderful action, an absolutely hilarious script, brilliant performances, and a plot that manages to be both a solid follow-up to “Avengers: Endgame”, and also an entertaining high-school romance-comedy."
    },
    {
      "rating": "7",
      "text": "I may like this incarnation of Spiderman the best.  I love that Peter Parker actually seems like a high school kid, as do most of his classmates.  Though it's definitely not part of the comic book storyline, I love the hot Aunt Mae. SFFH is the first entry into this next phase of the Marvel Cibenatic Universe, and it blends in previous movie elements well.Though Jake Gyllenhaal was excellent in his part, I had logical difficulties with his whole storyline.  I'm also did not love the final CGI battle,which of course is unfortunate my de rigeur for the genre.But the film is earnest.  The background romance is sweet.  There are other cute romantic side pkots. It feels like how a high school kid would process these situations.Special effects are always getting better and they're great here.  The main acting is great for the genre. The first post-Endgame film dutifully advances the franchise."
    },
    {
      "rating": "9",
      "text": "Its Fantastic !!tomholland rocked zendaya I liked her ;cutie special This spiderman movie is fun, romantic , full of action packed and very smart and cool Don't miss the post credit and wait till the very end of the movie!Perfect ending of an area and entering into new marvelcinematicuniverse with a bang!I love ma spidey very much this time"
    },
    {
      "rating": "10",
      "text": "Amazing movie! Adds humor and is nice that they decided to do something new with Spider-Man unlike doing the whole story again which we all know."
    },
    {
      "rating": "9",
      "text": "I grew up loving Mysterio and thought I would never get to see him on the big screen; they nail him. Holland continues to shine and Zendaya is as dorky as ever. All hyperbole aside: this is the best MCU film of 2019 and the best Spider-Man movie since 2004."
    },
    {
      "rating": "0",
      "text": "Its a bootleg spiderman 2. The actor tom holland is just not as good as the og tobey"
    },
    {
      "rating": "7",
      "text": "Очень круто снят фильм. Эффекты и экшн получились отлично. Понравилась тема с путешествием."
    },
    {
      "rating": "7",
      "text": "a very entertainig movie with great pacing, it does have a lot of problems in the story and some things just do not make sense. 7,5/10"
    },
    {
      "rating": "8",
      "text": "Far From Home might as well have a laugh track throughout. Dont get me wrong, I still like this movie, but I wanted to love it. The movie tries way too hard to make you laugh constantly that it feels like you can never take it seriously. Homecoming, as well as other Spider-Man movies, at least balance out the humour with serious and emotional moments. But onto the positives, like Homecoming, Tom Holland and the rest of the cast gives great performances and the story overall is really cool. I like how it takes place in Europe rather than New York, which is very unique for a Spider-Man movie. Jake Gyllenhaal as Mysterio is great; I like how rather than being a straight up villain from the get go he appears to be a good guy. But its pretty predictable that he was going to turn against Peter. The action in the movie is great, especially those scenes where Peter/Spider-Man is moving through Mysterio's visions (those scenes are simply amazing and should have been way longer). Overall its a good movie that Spidey and MCU fans will still enjoy, despite maybe being a little too heavy on jokes."
    },
    {
      "rating": "7",
      "text": "The MCU has now become so interconnected that it seems impossible to talk about it without spoiling the previous films. Heck, even the trailer for Far From Home came with spoiler warnings. So if you're the one person who hasn't got round to watching Endgame yet and you don't want to know any details about the \"surprise\" villain in Far From Home, spoilers ahead.Still reeling from the events of Endgame and the massive weight on his shoulders of everyone wanting him to be the next Iron man, Peter is looking forward to the chance to not be Spider-man for a while and hang up his costume to go on vacation with his friends at school. But when elemental monsters appear to be attacking European landmarks, Nick Fury enlists Spider-man to help save the world with the new mysterious hero Mysterio.But in the most shocking twist since it was revealed in Superman that Clarke Kent wasn't just a mild mannered reporter, it turns out the the famous Spider-man villain Mysterio is actually the antagonist of the film. He's a disgruntled Tony Stark employee who was manipulating Spider-man to obtain a dangerous A.I. designed by Stark which controls orbital weapons. So obviously Spider-man has to find Mysterio and save the day, whilst still trying to have fun on his trip and find a way to confess his feelings to MJ.As a villain Mysterio is fine. He's not the show stealer like some of the other recent villains like Killmongerer or Thanos have been, but he's not a forgetful dud like Zemo either. Gyllenhall has enough charisma that he can pull off being both a melodramatic perfectionist yelling at his team to get his performance as Mysterio right but still be completely intimidating as a psychopath willing to kill anyone to get what he wants. Plus Mysterio gets a fantastic Arkham Asylum style of nightmare sequence where he forces Spider-man in to one of his illusions. It's full of so much twisted and creative imagery that it rivals Doctor Strange for the trippiest sequence of the MCU.Though just like Homecoming, most of the films best moments comes from it being less of a superhero movie and more of a high school comedy. There's Ned who's still coming up with increasingly strenuous ways of keeping Spider-man's identity a secret. Flash is posting everything that happens to instagram whilst being an obnoxious whiny douche to everyone around him. And Brad the rival to Peter for the affections of MJ who has become far more butch than his classmates since he was one of the survivors of the snap.But the real stand out of Peter's school group is MJ, with the film cementing Zendaya as being the best on-screen version of Mary Jane. Largely because her nihilistic charm and random irreverent comments make for some of the funniest moments in the film. Plus Zendaya and Tom Holland have a great on-screen chemistry, largely because they genuinely see like awkward teenagers stumbling through their conversations and never sure of what to say to each other.Though in terms of capturing the character of Peter Parker from the comics, the MCU isn't quite there yet. Tom Holland is definitely the best on-screen version of the web slinger so far capturing both the quick wit of the web slinger and the relatable teenager that Stan Lee had always envisioned him to be. But a core aspect of the character has always been his ability and burden to overcome tragedy. They definitely make an attempt to capture this here with Tony Starks death casting a large shadow over the film, however through the films lighthearted nature it doesn't seem capable of reaching the heights of the franchises most memorable moments like Uncle Ben or Gwen Stacey which were essential building blocks for Spider-man in the comics. Holland has shown that he is capable of bringing dramatic weight to the character where he can, so I hope that the future films will be tonally confident enough to try capturing these moments.But for anyone who enjoyed Homecoming, Far From Home continues to capture the same humour whilst also upping the scale with some more ambitious sequences. It's a lighthearted epilogue to the epic scale of phase 3 of the MCU and a strong promise of the continued potential for the future of the post-Endgame MCU."
    },
    {
      "rating": "8",
      "text": "Spider man is gooddhdhdhdffhdhdhdhdhdfffffhffhfjfhfufurududjdhdfhfhdhsjdjdhfhffufufufuf"
    },
    {
      "rating": "7",
      "text": "Amazing movie tbh doesnt really feel like spiderman plot is eh characters are great i laughed alot overall its average"
    },
    {
      "rating": "7",
      "text": "The new spiderman movie lacks from a geniune villian. Really? The same reason as Michael Keaton´s villian? Sadly Jake Gyllenhaal is too much good actor for the kind of role he was doing (I was expecting soemthing with a better background). Don´t misunderstand me, the movie on the other hand was so much fun. Original and with big heart. Definitely the film of the summer and another good addittion into the MCU. Excited to see the future new Spiderman 3. Tom Holland´s spiderman is full of charisma and his chemistry with Zendaya is believable."
    },
    {
      "rating": "8",
      "text": "En mi opinión es la mejor película de Spider-Man, entretenida, buena historia y buenos efectos, sobretodo los de los poderes de Mysterio que uff disfrute mucho esas partes. Y la escena post-créditos con el regreso de un icónico personaje con una terrible noticia, fue muy épico. Me encanto.PD: muchos de las críticas negativas tienen 1 crítica mmm"
    },
    {
      "rating": "9",
      "text": "E-Value: 9Acting: 9Plot: 9Although Avengers: Endgame was supposed to be the final chapter of The Infinity Saga, Marvel Studios president, Kevin Feige has recently confirmed that Spider-Man: Far From Home, which is the twenty-third instalment in Marvel Cinematic Universe, is not just the final movie of Phase 3 but also the movie is officially the final chapter of The Infinity Saga.Eight months after the events of Avengers: Endgame, Midtown School of Science and Technology restart its academic years to accommodate the students who were resurrected by “the Blip”. The school also organise a two week summer field trip to Europe. During a fundraising event organised by May Parker, Peter Parker/Spider-Man (Holland) is told by Happy Hogan that Nick Fury (Jackson) will contact him soon about something but he refuse to speak to him.Still mourning the death of his mentor, Tony Stark/Iron Man, and wanting to take a break from superhero duty for a while, Peter decided not to bring his Spider-Man suit on his field trip but his aunt still pack for him anyway in case of emergency. During a trip in Venice, Peter and the other students encounters one of the mysterious entities known as the Elementals. As the Elemental known as Water Elemental is wreaking havoc on the city, a mysterious superhero called Mysterio (Gyllenhaal) shows up and defeats the Water Elemental.Later at night, Peter is approach by Fury who wants him to meet Mysterio, whose real name is Quentin Beck. He claims that he is from another universe of Earth and he is here to stop the Elementals from causing more destruction. Peter refuses to be part of this mission and chooses to return back to his field trip. Unknown to him, Fury secretly change the school field trip from Paris to Prague where the other Elemental will strike next.Once again, Spider-Man: Far From Home is not just another good instalment in the franchise but also great sequel similar to 2004’s Spider-Man 2. The plot of the movie is very well written and executed especially the plot twists which you never seen it coming. Even before the movie was released in cinemas, the trailers have already done a great job in hiding the plot twists and even had Tom Holland to warn viewers about some spoilers from Avengers: Endgame. There is not a single boring scene at all and lots of funny moments. It is all fun and enjoyable to watch.The cast have done an impressive performance especially Tom Holland and Jake Gyllenhaal, whom they deliver an amazing performance in their role as Spider-Man and Mysterio. The on-screen romance between Tom Holland and Zendaya are very natural and great. The depiction of teenage drama and romance subplot between the two of them is very well done. It was really fun and romantic to see them interacting with each other and better than any romance movies.Like all Marvel movies except 2008’s The Incredible Hulk and Avengers: Endgame, there is a mid-credits scene and post-credits scene. You definitely cannot miss both of these scenes at all cost. This is because there is a certain someone who is also iconic from the comic book show up unexpectedly. It was really a surprise for me and caught me off guard. Regardless, those two scenes not only serve as clue for Phase 4 but also a future direction for this franchise."
    },
    {
      "rating": "9",
      "text": "Spiderman far from home is the best movie i have ever seenAnd you must watch thim movie"
    },
    {
      "rating": "7",
      "text": "I didn't get the uplifting feeling of a funny/quippy Spidey. It was still fun to watch though. They payed nice homage to the comic books and IMO the old Spider-Man 2 game that was on the PS2.Without spoiling you'll understand what I mean if you've played the game and seen this movie."
    },
    {
      "rating": "8",
      "text": "One of the best Spiderman movies of all time. Twists were awesome. But post credits is more of a mixed feelings."
    },
    {
      "rating": "7",
      "text": "A good, not great, addition to the MCU. I will say that Tom Holland and Zendaya do justice to their characters. They make the movie relatable and fun. The humor is neither forced nor over the top. Jake G. does a great job with Mysterio and the special effects are really great for the most part. It was a bit too slow in the beginning by focusing on Peter and MJ's potential relationship. I am also not a fan of the high-tech spider suit. I prefer the neighborhood Spiderman in his traditional spandex. And to cap it all off, Tony Stark is creating villains and resources for those villains beyond the grave..."
    },
    {
      "rating": "7",
      "text": "A fun, funny movie to end off the current phase on MCU movies. It's nothing spectacular but is still worth a watch for one scene involving Mysterio alone."
    },
    {
      "rating": "7",
      "text": "Entretenida, la escena donde misterio ataca por 1ra vez a spiderman es lo mejor de la peli. Lo malo es que es mucho chiste, los efectos no son muy buenos al principio, cae muy may la MJ, El misterio no tiene al final nada para admirar."
    },
    {
      "rating": "7",
      "text": "I have to admit, this movie is pretty good, though not that pretty good since Spiderman is another victim from MCU.I liked the point that Mysterio still count on his special effects like the comic, but i kinda didn't like on how the movie showing his plan. The story is almost similar to The Incredibles but at the post credit scene, that plan disappear and it almost seems like that he's changing his plan so suddenly by \"unmasking\" Spiderman publicly. At least J.K Simmons back :DAnother thing that i'm not following is Tony's intention on giving EDITH, the most intelegent, security AI in the world given to some young lad. Sure he's different but i still need some explanation on why Tony did that, also EDITH is somehow became less interesting in the halfway through the movie.The movie isn't bad on my opinion, but at least they need more explanation for some parts of the movie."
    },
    {
      "rating": "10",
      "text": "Far from home was a spectacular movie from start to finish it entails with a heroes struggle to be the best spiderman he can be."
    },
    {
      "rating": "8",
      "text": "Its fun, entertaining and very funny. Really wasn't expecting anything else just the fact that its Marvel. You already know what you're gonna get."
    },
    {
      "rating": "8",
      "text": "Fun and moving at the same time. There are some excellent scenes, but just a average movie overall."
    },
    {
      "rating": "10",
      "text": "I was impressed with the writing in this one! The script is very tight, it's paced probably better than any of the Avengers films, with less downtime and more action. Not strictly epic battle scenes, but plot action. There's lots of characters, and they're all funny (except for Sam Jackson who is fat and bored). Marvel also continues to outdo themselves in special effects. Mysterio's powers look amazing, exactly as cool as I hoped. Try not to spoil this one for yourself."
    },
    {
      "rating": "7",
      "text": "Spiderman: Far From Home is a fun MCU movie, and a vast improvement over the lacklustre Homecoming.This film being post-Endgame, it shows Peter Parker struggling to fill Tony Stark's shoes. He's still a reckless teen boy prone to stupid mistakes even though he's fought against Thanos in space. Also Peter Parker comes close with MJ, but Zendaya is clearly miscast as MJ, Spiderman's classic girlfriend (although she's never called Mary Jane, just MJ). Anyway, there's absolutely zero chemistry between Tom Holland and Zendaya.I liked the movie's version of Mysterio. He fits well into the film's premise, because in an world full of gods and superheroes, if you don't shoot lasers from your hands you are nobody. And if you stage a show, people will believe anything. That's exactly what the master of illusions is about to do. But this political message isn't handled as well as in The Winter Soldier's \"give up your freedom for security\" theme, or Civil War's, well, civil war.As with every MCU movie, Far From Home is a comedy action hybrid. It's consistently fun, with plenty of situational jokes, although it's not up to the comedy level of Deadpool.My only complaint is that Tom Holland's Peter Parker still doesn't feature the classic Spiderman personality. He's supposed to be delivering fun one-liners, but there is nothing like it so far in the MCU's Spiderman. Then again, being arrogant and speaking one-liners was Tony Stark's second nature, so maybe if Peter Parker comes to really succeed Iron Man in the future, he'll become more like Tony Stark as well.SPOILER ALERT: The mid-credits scene is a blast from the past. Spiderman's true identity is revealed to the world by J. Jonah Jameson, with actor J. K. Simmons returning from the Sam Raimi movies. I find it hard to believe that they haven't set up the Sinister Six hunting down Spiderman in the sequel. After all, Vulture and Scorpion are already present in the MCU, and we can't rule out Mysterio is dead for good. Get 3 more villains, and the Sinister Six are ready for Spiderman.Overall, Far From Home is a good and fun sequel to Homecoming."
    },
    {
      "rating": "10",
      "text": "I love this movie. It's totally different and fresh. It have's a good villan, a really good plot and obviously a great cast."
    },
    {
      "rating": "8",
      "text": "Enjoyable although not as good as Homecoming. The film is fun, funny and extremely dynamic but unfortunately this film features yet another MCU villain that lacks emotional weight. Apart from Thanos and Loki who is more of an anti hero rather than a legit bad guy, Vulture is the best written MCU villain so far."
    },
    {
      "rating": "7",
      "text": "Spider-Man: Far From Home is a good movie and a good follow up to the events of Endgame. Here are the negatives. The first 30-45 minutes kinda suck. It’s paced awkwardly and incredibly rushed. Scenes just kind of start and stop with no rhyme or reason. It gets a whole lot better after that point though. Peter Parker still MOSTLY has the same internal struggle of Spider-Man: Homecoming. Peter is trying to figure out if he should be a friendly neighborhood Spider-Man or be more than that and I wished they had not kept that internal struggle from the first film. Half of the jokes in this movie weren’t that funny to me. The visual effects in some areas were a little shotty but most were really good. My final issue is that there is a literal plot device item that comes into play about halfway through the movie and it doesn’t make a lot of sense at all for me. Here are the positives. The acting is really good. Tom Holland, Jake Gyllenhaal, Samuel L. Jackson, and Jacob Batalon are standouts from the film. Jake Gyllenhaal and Tom Holland have outstanding chemistry together and it’s a joy to watch them on screen together. I really hope those two work together again in the future. The rest of the actors do a good job. Most of the visual effects are really good for a Marvel movie. There is a sequence in the film that I think is absolutely amazing that I can’t talk about due to spoilers. The Elementals look lifelike and both Spider-Man and Mysterio’s visual effects look really good. I absolutely love Mysterio’s actual costume. It just looks amazing. The action in this film is really good. You understand what is going on and who is who in each action sequence. I like the story for this film. It has this kind of spy thriller vibe while mixed with a romance comedy that I think works really well together and I like how each destination the group goes to is essential to the plot. I do enjoy the score a lot even though I prefer Homecoming’s score. The cinematography is fine. It’s not extraordinary but it’s decent. The tone mostly remains consistent except for a couple scenes and after the first 30-45 minutes, the film is paced really well. Overall, Spider-Man: Far From Home is a good follow up to Endgame with great acting, action, and good visual effects even if the first part of the film sucks. I give Spider-Man: Far From Home a 7.5/10."
    },
    {
      "rating": "10",
      "text": "Far From home is definitely one of the best superhero movie ever and the best MCU movie. The storyline, the haracters, Peter and Mj romance and obviously the outstanding work with the cgi couldn't be better."
    },
    {
      "rating": "8",
      "text": "It's a great movie. Despite its flaws, it is seriously enjoyable. There are two main plots: the one regarding Peter and the one regarding Spiderman. The first one is perfect. High school kids acting like high school kids. It's a great quality. Peter struggle is real, relatable and amazing to watch.    The villain part... Sucks. It doesn't make any sense. But I'm willing to forgive the movie because it's just fun to watch."
    },
    {
      "rating": "8",
      "text": "SPIDER-MAN: FAR FROM HOME is a movie with a very good development of a plot where the villian shines in its capacity of creating problems without the necessity of having super-powers. The movie has a good implementation of funny moments, but again, it exploits sometimes this element a lot that ridicules the Spider-Man character who does not a big personal growing. Besides, the actress who represents MJ does not finish fitting with total naturalness. In other words, the movie is better than the previous one since it has better action scenes, a better villian and a better recreation of the spider-man universe spite of we cannot find a spider-man that convinces a lot as a superhero totally.--8/10--"
    },
    {
      "rating": "8",
      "text": "This is a beautiful spider-man story. Tom Holland is just as adorable as ever as a young Peter Parker. As an avid reader of the 90s Spider-Man comics I really like the tone and atmosphere. It is funny, nice action scenes, nice comic book story, everything a good spider-man movie needs."
    },
    {
      "rating": "8",
      "text": "In proper sequel fashion, \"Spider-Man: Far From Home\" not only looks to improve upon the things that didn't work in \"Homecoming,\" but it even aims to take some of the predecessor's better elements and somehow tune these things up as well. The humor's been toned down to a much more tolerable level. The characters have all been refined. The action is clearer and more interesting. And even the thematic intent is much easier to grasp this time around. Top it all off with one of the MCU's best villain performances to date and you get one of the summer's best rides thus far."
    },
    {
      "rating": "8",
      "text": "I walked out of the theater happy, amazing highs, great reveals, but definitely a lot of that was dumb/eh? moments too.Great use of Mysterio.I really dislike all of the classmates including Peter they are all lame characters, he's a great Spiderman but a terrible Peter Parker."
    },
    {
      "rating": "8",
      "text": "My fiance and I went and saw the new Spider-Man film last night on a Dolby Cinema screen. The movie picks up shortly after Avengers: Endgame and does a good job at continuing the Marvel Cinematic Universe into it's next phase, paying homage to lost Avengers and moving forward with it's remaining characters. The movie is lighthearted and funny. Tom Holland (Peter Parker / Spider-Man) and Jake Gyllenhaal (Quentin Beck / Mysterio) carry the film with exceptional acting. Special effects were awesome, especially for Mysterio's bit. And you'll want to stay after the movie for two after-credit scenes. One is half way after the credits (having huge circumstances), and the other at the very end. Overall, I quite enjoyed the movie. Spider-Man Homecoming was a bit better in my opinion, only because Michael Keaton did such a great job as The Vulture. However, Far From Home was still a great entry into the series."
    },
    {
      "rating": "10",
      "text": "Amazing spider-man movie! We can relate so well with Peter Parker and Mysterio is great in the movie. The movie is going to leave you excited waiting for the next one already and future marvel movies."
    },
    {
      "rating": "10",
      "text": "Just osm"
    },
    {
      "rating": "10",
      "text": "The characters are new and interesting and it’s impeccable story wise. The end credit scenes were some of the best marvel has to offer and left me wanting more and actually caring about the characters."
    },
    {
      "rating": "10",
      "text": "Far From Home succeeds with an unusual, troubling virtue: The best parts are"
    },
    {
      "rating": "7",
      "text": "Good film for moviegoers. Bad film for Marvel fanboys.I literally had my brother express his rage after it was done. It was apparent from the look on his face he was angry. So now I've decided not to take him to any movies at all anymore."
    },
    {
      "rating": "7",
      "text": "Billed as the epilogue for phase 3, this Spider-Man movie didn't do much to move the needle for me. A lot of the things you expected to happen did, and the story kinda faltered towards the end with a lackluster final fight scene. Gyllenhaal was pretty good as Mysterio but there wasn't really anything in this movie that blew me away. Bout the only reason to go see it in theaters, IMO, is to see the end credits scene as I'm sure that they will be announcing some new material of stuff for the future of the MCU soon as Comicon. However after the big piece that was the last two Avenger movies, this felt more similar to what the Ant-man and Wasp movie was to me. Something that is nice to see but doesn't really do much for the overall Marvel product. It's not a bad movie but there's nothing spectacular here and, coming off Endgame, it was always going to be hard to maintain that level of enthusiasm for these movies."
    },
    {
      "rating": "7",
      "text": "Good action, once you get past the really slow start, some nice romance, just a shame that in the story it just turns out that nothing is as it seems. It takes away from how good this movie could have been. Still a good time, as long as you don't start thinking about it too hard. There are a few times when you might wonder what the uninspired writers were thinking but I'll give it a 7 for the CGI that was just great, even if a 6 may be more appropriate."
    },
    {
      "rating": "10",
      "text": "Very fun and fantastic! This movie is the best Spider-Man movie ever! And Mysterio is wonderful!"
    },
    {
      "rating": "8",
      "text": "It is a great movie, good action and development (esprcially for spiderman). A transition kind of movie."
    },
    {
      "rating": "10",
      "text": "The movie deals with the struggles of a teenage boy trying to balance his personal life with the superhero life. P.S stay till the end!!!!!!"
    },
    {
      "rating": "8",
      "text": "Impressive write up with matching cinematography. Absolutely loving Tom Holland as Spiderman. The way he conveys hid emotions and body posture is truly magnificent. The movie seems to prep us for some of sort surprises Marvel is planning to hit us with. No over bloating of scenes and they kept it a universal pleasing tone. Characters handled their roles perfectly well and I'm impressed. A great movie for the MCU and its fans."
    },
    {
      "rating": "9",
      "text": "Really Enjoyed ItFar From Home is funny, terrifically acted, and visually stunning."
    }
  ]
}