{"id": 104, "title": "Spider-Man", "starring": ["Tobey Maguire", "Willem Dafoe"], "runtime": 121, "genre": ["Fantasy", "Action"], "description": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/gh4cZbhZxyTbgxQPxD0dOudNPTn.jpg", "categories": {"plot": 9.033333333333333, "acting": 8.7, "ending": 9.0, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.5, "action": 8.882352941176471}, "reviews": [{"rating": "10", "text": "This, along with X-Men from 2000, paved the way to the great comic book movie renaissance of the 2000s. A true masterpiece that will be remembered by many Spider-Man fans all over the world."}, {"rating": "10", "text": ""}, {"rating": "9", "text": "Before the \"Amazing\" era began, there was another Spider-Man outing with Sam Raimi at the helm, leaving behind his horror roots to try his hand at the superhero craze that was sweeping Hollywood, and bring the webbed creature to the big screen, and he did so in a big way.\rWe get an origin tale with a light-hearted tone to show how Peter Parker, played by Tobey Maguire, gets bitten to the an infected spider and starts to develop superhuman abilities such as web swinging and strength, something he keeps secretive from everybody else, his aunt, his best friend Harry  James Franco) and the \"girl next door\" Mary Jane Watson (Kirsten Dunst).\rBut with every hero comes a villain, and the perfect storm is brewing I'm the form of Norman Osborn (Willem Dafoe), father to Harry and an almost father to Peter, a man obsessed with bettering the human condition, something he does to himself by administering a powerful drug which unleashes another side to the man, and not a very good side.\rThe concept of Spider-Man was always interesting as the likes of Norman Osborn being a primary villain played very close to the heart, he knows the people he is hurting, making the the pacing of the film much more personal and relevant. Each character has a connection and relationship with the next person and it feels much more fluid for this.\rThe film itself is a visual marvel, with the scenes of Spidey swinging through the city quite a delight to watch, and this is blended in with a humorous opening that takes a much more mellow and less serious approach which is a welcome change, they have colourful characters including the undeniable brilliance of J.K. Simmons playing J. Jonah Jameson, his wit, loudness and larger than life personality are standout moments of the film, Tobey Maguire also delivers a convincing performance as our masked spider, he is like a little child at Christmas bouncing around the screen, giving a different feel to the average superhuman.\rBut with the light tone there does come a sense of it being very cartoon-like, with a musical score that reflects this, but there is plenty to be said about the the emotional punch the film has to pack, with very quotable and heart-wrenching dialogue throughout.\rIt's a real kickstarter to a very successful story, and perhaps one of the benchmarks to the overwhelming craze of superhero films today."}, {"rating": "9", "text": "Tobey Macguire's excellent performance"}, {"rating": "9", "text": "Tobey  played Peter Parker Spider-Man perfectly and Norman Osborn / Green Goblin half nutty and very charismatic. Love fine line between Parker and Mary Jane. The special effects are good, but the story is good. All the main characters in this film are losing loved ones. The film is funny, cool, interesting, and not where it is not sagging."}, {"rating": "10", "text": "One of the greatest movies of our time, \"Spider-Man\" brings to us a whole new genre of heroism and action. Even in 50 years, this movie will be widely revered like it is today."}, {"rating": "9", "text": "In light of the release of its reboot ( a little bit too soon though), the original Spider-Man paves the way for super heroes to be portrayed (spandex and all) as accurate as possible on the silver screen. It has uneven special effects in comparison to what you have these days (it did come out 10 years ago), but Spider-Man encapsulates the best of the super hero genre: heart felt, action packed, pulse pounding.  You'll laugh as Peter Parker discovered his powers for the first time. You'll cringe when he was beaten to a pulp by the goblin in its finale. It paved the way for the new Batman trilogy by Chris Nolan and other Marvel Studios films.  A classic."}, {"rating": "4", "text": "this movie really, really does not age well at all. sure Tobey and William are excellent but that's all"}, {"rating": "9", "text": "Sam Raimi’s Spider-Man redefined the superhero genre. Yes it is cheesy and green goblin’s costume looks like a power ranger suit. Tobey maguire is a great Peter Parker but not the best Spider-Man. But other than that, this is not only a great superhero movie, but a great movie in general."}, {"rating": "9", "text": "You can take your Tom Holland and Andrew Garfield with you. Tobey Maguire is the best Spider-Man of all time and no amount of CGI can change that!"}, {"rating": "9", "text": "Definitely made the list of greatest comic book adaptations. Wish we had more of these today."}, {"rating": "9", "text": "Normally I don't enjoy comic book adaptations, but this is one of the very few exceptions."}, {"rating": "8", "text": "\"Spiderman\" is a movie that flows like a comic; its rough but smooth, has deep character depth with witty dialogue, and most of all its pure fun just to watch your friendly neighborhood swing into widescreen action."}, {"rating": "8", "text": "The original Spider-Man in my eyes and while its probably been overshadowed now by the remake I still really enjoyed this one. A little corny perhaps but in a way that simply works thanks to the actors and characters in the film they play. Maguire plays a respectable Peter Parker and gives the character a likability that other actors would not have given. It's a great storyline also that moves well with a villain that was actually pretty creepy. Overall a solid comic book film with good sequels!"}, {"rating": "9", "text": "I remember when i was little i always rented this movie from the video store and didn't wanted to give it back. Classic! An amazing experience i will never forget!"}, {"rating": "8", "text": "An instant classic for superhero movies, succeeding with it's emotionally engaging and strong story, clever dialogue and well developed characters. Even the humor is extremely well done. Spider-Man is a great movie (Final Score: 8.65)"}, {"rating": "9", "text": "Spiderman is a fantastic film that brings the pages straight to the screen seamlessly mainly because of the fantastic effects, action, performances and character development."}, {"rating": "9", "text": "I love the first two entries of Sam Raimi's Spider-Man movie adaptions! They make me feel all giddy inside! I always loved Tobey Maguire as Spidey as well as Cliff Robertson and Rosemary Harris as Peter Parker's Aunt & Uncle. Overall, great cast as well as memorable action sequences! By far some of the best superhero films of all time."}, {"rating": "9", "text": "Always been a fan of Spider-Man and the comics. Alot of the story and premises of Spider-Man the movie are very superb and the cast, mainly Tobey Maguire give a good performance."}, {"rating": "0", "text": "Overrated garbage. Garbage effects, the only good actor is William Dafoe. Cheesy as hell"}, {"rating": "9", "text": "Like I need to tell you but Spider-Man tells the story of Peter Parker, A relatively normal kid who gets bitten by a genetically enhanced spider which turns him into part human, part spider. He discovers he now possesses the ability to shoot webs, to scale walls and a 6th sense when it comes to danger. That being said there are obvious growing pains and Spider-Man handles them with beauty and heart with characters you really care about starting with Parker, who is played to perfection by Tobey Maguire. The rest of the cast also shines with Kirsten Dunst and Rosemary Harris standing out as the women in Peters life. The direction is everything you expect from a popcorn flick but is also incredibly unique with Spidermans movements through the air looking majestic while completely realistic (considering the story). In fact there are very few flaws to Spiderman with it showing that everyone has put their all into the film. If I was forced to pick a problem it would be the slightly disappointing end fight between Spiderman and the Green Goblin (Willem Dafoe) but even that is clutching at straws. Overall as origin stories go this ones got real class."}, {"rating": "10", "text": "Spider-Man was fantastic the story was well written and the characters were amazing. The acting was superb Tobey Maguire was the perfect Peter Parker, and Kirsten Dunst shined in her role as Mary Jane Watson. The Green Goblin was played fantastically by Willem Dafoe, and Rosemary Harris as Aunt May was terrific.This was defiantly the best movie of the original Spider-Man movies in my opinion. And perhaps the best film version of a comic series."}, {"rating": "10", "text": "A ultimate movie......................................................................................................................................."}, {"rating": "8", "text": "Sam Raimi did a good job. Tobey was great as Peter Parker/Spider-Man and James Franco was great as Harry Osborn. The Green Goblin reminded me very much of the Joker although his suit was a little silly. Some of the dialogue was cheesy but it doesn't matter. I liked the Stan Lee cameo even though they're all great. Its a really good Spider-Man movie."}, {"rating": "10", "text": "Greeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaatttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmooooooooooooooooooooooooooooooooooooooooooooooovvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvviiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiieeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee"}, {"rating": "10", "text": "One of the best superhero movies out there, Spider-man delivers the kind of summer blockbuster punch that movie junkies are looking for without all the extra bull**** that some big-budget movies tend to do nowadays."}, {"rating": "9", "text": "Before superhero movies got all dark and gritty, there was Spider-man.  A movie that showed that being a hero could be fun, though.. of course... with Great Power... well you know the rest.  It's a blast watching Peter Parker discover his powers and decide how to use them.  The villain in the Green Goblin might be a little \"one note\" and crazy for the sake of being crazy, but it doesn't detract from the film too much.  But seriously, the ability to shoot webs and swing through the skyscrapers of New York City is one of the most original and ingenious super powers and it's just so much fun to watch it come to life."}, {"rating": "8", "text": "Geek gets bitten by \"special\" spider, gets spider powers, in love with mates girlfriend, mate has rich weird dad, look out here comes the Spiderman.Very good Superhero flick with fast-paced action & big effects. Decent cast & Willem Dafoe is as good as he usually is.Shame they had to ruin all the good work by playing the thoroughly dreadful Nickelback at the end."}, {"rating": "8", "text": "Having been bitten by a radioactive spider nerdy teen Peter Parker suddenly finds himself endowed with spider-like abilities. Able to sense danger and cling to walls he uses these powers to stop crime around New York City.\r The story of Spiderman is of course well known amongst comic and movie fans and the first in the trilogy deals with Peter Parkers attempts to deal with his new found abilities whilst fighting off the unwanted attentions of The Green Goblin. The movie is of course action packed featuring some breathtaking scenes but director Sam Raimi also brings the humorous dialogue from his days working on Xena: Warrior Princess making for a thoroughly enjoyable watch."}, {"rating": "8", "text": "Good movie. It has a great way of telling the story, even though it is slow in some parts. I wish that there could have been more action though. It is a good superhero movie."}, {"rating": "7", "text": "An alright Spider-man movie. Sam Raimi did a decent job at telling his origin story. However the special effects were a bit sloppy at times and the Green Goblin's costume was just a joke. William Dafoe on the other hand was extremely good as Norman Osborn and really did a great job capturing his mentality (overdoing it a tad at time, but overall a good effort on his part.) Overall: Considering when it came out, it was a very good movie that had allot of minor flaws but it was still enjoyable none the less."}, {"rating": "10", "text": "Uno de los comienzos más galardonados de una trilogía. Esta película dio orígen a lo que sería una gran época dorada para Spider-man, un film espectacular que da gusto ver y ver sin un día que te canses."}, {"rating": "7", "text": "A decent starting point in the Spider-Man franchise which is only weakened by some Sam Raimi cheesiness and the worst Green Goblin costume ever featured."}, {"rating": "10", "text": "Everything in this movie was done right. The story , the iconic lines, the characters. Tobey Malgory couldnt have done it any better, his humble role as the underdog teen felt realy perfect with this movie, making the audiance realy support him."}, {"rating": "10", "text": "This was the most defining moment in Marvel movie history. The action scenes between the Goblin and Spidey are unmatched even today, 12 years after its release. Spider-Man is an epic superhero film with terrific acting and amazing fight sequences; it's a real treat to big time Spider-Man fanatics, like myself.\r10/10."}, {"rating": "10", "text": "I have seen this movie when i was little i was amazed that the  talent Toby Maguire had as Spider man/ peter parker and the cast also Willem Dafoe as  the posessed  Villon . Any movie that has  talent  that a director who knows the story and tells the story from not his or her version but based on a writers version of it thats what tim burton has or any director.   I have seen Sam Raimi's work on evil dead trilogy, darkman, drag me to hell. He creates characters like example  Ash who knows what hes doing he's a hero that kicks ass he risks everything that a hero would do. hero or a villian  that had a good side or a bad side. thats what classics heros do  like batman or superman , or whatever hero that had a bad time like in the past or whatever. thats what Raimi Created a ultimate classic by Raimi. Grade A"}, {"rating": "9", "text": "Spider-Man is a thrill to watch Tobey Maguire plays a great Peter Parker. Willem Dafoe is a awesome Green Goblin. The opening sequence is great and the fighting is fantastic. Danny Elf man's score great as always  I`ll always enjoy watching this."}, {"rating": "10", "text": "Sam Raimi delivers comic book fans the long-awaited Spider-Man film adaption we have been waiting for for decades! With a semi-original origin story, Raimi's take on the web-slinging, wall-crawler will have you respecting this particular version of the masked vigilante more so than you did the Spider-Man in both the animated series and the original comic books! Spider-Man is one of the greatest film adaptions of any comic book character we have seen on the big screen with talented actors, excellent action sequences, and of course, how could anyone forget, the amazing upside down kiss between Spider-Man and Mary Jane Watson! Spider-Man is genre-defining masterpiece!"}, {"rating": "10", "text": "Ethan's Review: I would like to say, this movie is the greatest marvel movie of all-time.Sequoyah's Review: This movie changed my life.To sum it all up, Spider-man"}, {"rating": "10", "text": "I keep telling people that this is the real Spider-Man and I will always stand by that. Tobey Maguire the real MVP!"}, {"rating": "9", "text": "I've watched the movie Spider-Man with my father and younger brother at least 30 times since it came out on DVD, and a few more times on my own. It's the only film I've ever seen that I can watch over and over again and never get sick of. I was seven years old when it first came out and I was thrilled by it, but unlike many other movies I liked as a little kid it still holds up really well. Willem Dafoe was the perfect choice for the Green Goblin, and I have no complaints about the rest of the cast either, though I have heard some about Tobey Maguire and Kirsten Dunst being chosen for their respective roles. Aside from that, the action scenes are exhilarating and the drama was compelling enough to make this movie really memorable for me. The only reason I don't give it a perfect 10 is because I get a bit nostalgic when I watch it, and I'm afraid that makes me the tiniest bit biased."}, {"rating": "7", "text": "It wasnt that bad. The acting wasnt as good as I expected but the story was solid and Green Goblin was a great start off villian for the film. I think fans of the series would enjoy it."}, {"rating": "9", "text": "Spider-Man is a great movie. The character development is incredibly well done, and the action of the movie is good as well. It has impacted what superhero movies of the 21st century. It was the first Marvel movie, after X-Men of course, that blew up at the box office. An amazing movie that deserves a watch even by those who are not Spidey fans."}, {"rating": "9", "text": "el hombre araña mantiene la acción y emoción que cualquier fanático necesita para ir a comprar un disfraz a la primera impresión, peter parker demostró un comienzo de un superheroe sensacional."}, {"rating": "10", "text": "The best Spider-Man movie, best origin, and what really laid the foundation for all the superhero movies we have today..even if a lot of them vary in quality due to character changes for social reasons, etc. This was so well acted that even when it should feel cheesy, it doesn’t. Sam Raimi is a genius, the actors are great, and this movie along with the sequel are top notch."}, {"rating": "9", "text": "The only worth of Raimi's films........................................................................................................................."}, {"rating": "9", "text": "The first Spiderman movie is one of the films that paved the way for the super hero films we see today. There would be no Marvel Universe without this trilogy of films and the X-Men series. This film gets the origin story right, it does not drag it out and the film becomes fairly action packed after we find out the story behind Spiderman. Tobey Maguire is great as Spiderman and Peter Parker and I think he has gotten a lot of undeserved hate since the series was rebooted. As soon as you watch this film you member how good he was and it is difficult to say that Andrew Garfield is more suited to play Spidey. Willem Dafoe also plays an excellent Green Goblin, I thought his performance was great although like in most origin movies the Green Goblin doesn't always pose a threat. Spiderman paved the way for an excellent sequel that is probably better than the original film."}, {"rating": "9", "text": "One of the best superhero movies I've ever seen with great acting and hilarious dialogue performed by the character of J. Jonah Jameson. The casting's great particularly with the William Dafoe as the Green Goblin."}, {"rating": "9", "text": "The first installment of the Spider-Man trilogy is excellent and very entertaining to watch. The soundtrack was very good and original, and the acting was superb. The special effects were top-notch as well, and the plot keeps you thinking all the way to the end. All in all, this is a great action/superhero movie and one of Marvel's best productions."}, {"rating": "9", "text": "I love spider-man 1 it was one of the first movies i saw. The things i liked in it is the action was good. The score/music was really great. The cast form Peter Parker to the green goblin i loved and uncle ben and aunt may were great as well. I read spider-man comics i love the character of spider-man i all was have liked him since i was 2 years old. The bad things in the movie would be green goblins costume i dont like it. It looks like a power ranger costume and thats not what the green golbins was in the comics and MJ was all was getting in truble all the time and at the end i just got tried of it happen. Some parts of the movie comes off very cheesy. And the effects of the movie are a bit dated but they were good in 2002 when  this film came out. So i really liked spider-man 1 i would give it a 8/10"}], "recommendations": ["the_amazing_spider_man", "spider_man_homecoming", "the_amazing_spider_man_2", "superman", "pirates_of_the_caribbean_the_curse_of_the_black_pearl", "spider_man_far_from_home", "thor", "daredevil", "the_batman", "iron_man", "man_of_steel", "the_incredible_hulk", "the_dark_knight", "hook", "captain_america_the_first_avenger", "spider_man_into_the_spider_verse", "superman_returns", "fantastic_four", "hulk", "robin_hood", "true_grit", "hellboy", "oz_the_great_and_powerful", "die_another_day", "edward_scissorhands"]}