{
  "id": 69,
  "title": "Spider-Man: Homecoming",
  "starring": [
    "Tom Holland",
    "Michael Keaton"
  ],
  "runtime": 133,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Drama"
  ],
  "description": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c24sv2weTHPsmDa7jEMN0m2P3RT.jpg",
  "categories": {
    "plot": 6.466666666666667,
    "acting": 6.283018867924528,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 6.391304347826087,
    "action": 7.615384615384615
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Can't believe I waited until now to write a review for this movie. Homecoming is a reboot done right. It's Spidey done right! The ideal adaptation of the webshooter. Another triumph for the MCU. Welcome home, Spidey!"
    },
    {
      "rating": "8",
      "text": "A Spider-Man film that while being large in the MCU, has a small feel about Peter Parker growing into Spider-Man.  Tom Holland is great and the way that he is handled in this film is spot on.  All the other cast is solid and adds depth to Parker's High School experience.  Marisa Tomei is good as Aunt May and Robert Downey Jr. is great as always as Peter's role models.  Michael Keaton is good as Vulture and they do a good job of flushing out his motivations.  I don't think we got the most impactful fight scenes we could have gotten but it was overall fine.  Overall I thought this was a great come back for the character and I'm excited to see where they take him.  A- (Isn't it stunning these are the same writers who wrote Vacation.)"
    },
    {
      "rating": "6",
      "text": "Although I am huge spiderman fan, I find this movie lacking in many way. This movie does feel like nothing more like an avengers filler before the big finale. The appearances of Robert Downey felt forced just to amp up the movie a little more, the movie seemed a bit too teeny bopper for the avengers universe. they could have done without the whole high school backstory. I really had high hopes for this movie. However, I do believe that the younger fan base will enjoy this movie a bit more than the older fan base. We get it, its a younger, immature spiderman that still needs to get used to his abilities and what not. However, going a little overboard to a point where it was just plain old annoying to watch. I hate to say it, but Tobey Maguire and his many faces was less annoying to watch. They really should have stuck with Andrew Garfield."
    },
    {
      "rating": "8",
      "text": "The enduring presence of Spiderman on the big screen over the past fifteen years presumably caused a little fatigue once news spread of the third depiction of the crime-fighting hero. However, Spiderman: Homecoming fails to induce such feelings as the exuberant Tom Holland masters the role as Peter Parker in almost every way. After seeing him briefly in Captain America: Civil War and now under the wings of Marvel Studios, the introduction of Spiderman into the ever-expanding MCU proves to be an incredibly entertaining ride.Spiderman: Homecoming is a very well directed film, as Jon Watts gives us a joyful adventure of the teenager Peter Parker who troubles to find the balance between his personal and superhero life. Still consumed by the actions he took against the likes of Captain America in Civil War, Peter Parker becomes a desperate man, hoping to join the Avengers and impress Tony Stark aka Iron Man, who acts as his mentor. It is with this mentality that he becomes entrenched into the Spiderman persona that has severe ramifications on his social life, both at home and at school. And as the nerdy and unpopular teenager, he uses his hidden persona to define his own sense of duty and morals. As seen in one of the trailers, Tony Stark chastises Peter, quoting, \"If your nothing without this suit, you shouldn't have it\". Tom Holland develops great chemistry with Robert Downey Jr in all their scenes, however, Tony Starks appearance doesn't shy away from the fact that this is a Spiderman film. This is a film that is grounded to Spiderman, and Spiderman only.His high school story was very intriguing to watch, as we meet Ned (Jacob Batalon) who aids Peter Parker as his nerdy and funny best friend, Michelle (Zendaya) as the quirky, yet the lonely student who stands in the background, and Liz (Laura Harrier), Peter's accessible love interest. With Spiderman, Peter becomes less involved with the school, causing dysfunctional relationships to occur between him and many other students. Likewise at home with Aunt May (Marisa Tomei), who we see Peter become more distant with her as his agendas begin to take over.The main villain, the Vulture, is unlike many of Marvel's villains, in that he is the most human out of all of them. He despises the rich and the powerful messing up the lives of those below them, in this case, Tony Stark and he cares deeply about his family, wanting to do everything in his power to keep them safe and happy. His backstory, seen in the opening of the film, and the effects of his actions proves that Adrian Toomes (his hidden persona) has more redeeming qualities than one might expect of a villain. Michael Keaton brilliantly plays the role, adding hidden depths rarely seen in a Superhero villain.Overall, the action was solid, yet the film serves better as a character-driven story rather than the usual action we tend to see in other Marvel movies which may disappoint some fans. However, comic book films are about the characters and Spiderman: Homecoming accomplishes that extremely well. Tom Hollands gifts us with a great performance of the crime-fighting, friendly neighborhood Spiderman, accompanied by a great villain acted superbly by Michael Keaton, and a host of secondary characters that really complete a very well written film."
    },
    {
      "rating": "10",
      "text": "the best spiderman movie the MCU webs an exciting tale for comic fans and MCU ones Tom Holland delivers on his role the actions scenes are to the point and some times funny as spiderman should be"
    },
    {
      "rating": "3",
      "text": "This guy doesn't behave like Spider-Man. No wisecracks. And he has no spider sense! The movie lacks nearly all of Spider-Man's supporting characters: no Gwen Stacy, no Harry Osborn, no J. Jonah Jameson, no Robbie Robertson, no Betty Brant, no Mary Jane Watson - though inexplicably there is a character named Michelle who goes by the nickname, MJ. And Aunt May is 30 years too young, not the feeble woman who fills Peter with such a sense of responsibility. Those supporting players created the dynamic that made Spider-Man interesting. Add to this all the hyperactive Tony Stark tech and this movie just isn't Spider-Man, not to this longtime reader of the comics. And the film is politically preachy. I gave it 3 stars rather than 0 for Michael Keaton's dialog with Peter Parker when Peter goes to pick up his date. That scene was the only worthwhile moment in the movie."
    },
    {
      "rating": "8",
      "text": "For years, fans of the web-slinging character wanted to see him join the MCU, so when Sony and Marvel decided to share rights to the character, this is the result we get. A fun, colorful and energetic superhero movie that feels rather fresh. 'Spider-Man: Homecoming' is one of the best \"Spider-Man\" movies in a while, just a step below 'Spider-Man 2' (2004) and 'Spider-Man' (2002). What makes this movie work is Tom Holland's young and cheeky performance we see as the teenage hero of whom we got a glimpse of when he debuted in 'Captain America: Civil War' (2016), and now here he is, leading his own battle. We see that he faces the challenge of trying to live a normal, teenage, high school life, while at the same time, coping with being a street-level superhero, especially since Tony Stark (Robert Downey Jr.) is his mentor. He waits and waits for Tony to notify him for a mission so that he can become an avenger, but time passes, and not a single ring on his phone. He lives quietly with Aunt May (Marisa Tomei), who has no idea that he is Spider-Man, and hangs out at school with his rather dimwitted friend, Ned (Jacob Batalon), who, if you saw the trailer, you'll know that he finds out that he is Spider-Man... it even happens early on in the film, so it's not really a spoiler. The movie's main villain is Adrian Toomes (Michael Keaton), who becomes the \"Vulture\". Keaton is fantastic as the main villain, and is probably the most memorable Marvel villain since Loki and/or Ultron. Watching Peter living the double life of trying to be a hero and being a teenager is something we haven't seen since 'Spider-Man 2' (2004), the idea that he has to juggle and balance his life out so things could work, but nothing goes according to plan. This is something we need to see more of, as that is what his character is about. Nobody knows his identity, and he needs to remain level-headed since he's so young. Many may be concerned that Robert Downey Jr's \"Iron Man\" character is involved too much in the film, as the trailers and promotional marketing will show, all I can say without spoiling too much is that there is no reason to fear. Downey has about as much impact on this movie as Jared Leto did in 'Suicide Squad' (2016), but if you want my advice, do not watch all the trailers if you haven't already. There are some key cameos that are spoiled, and maybe on or two plot details. The cameos by other actors are funny though, if you don't see them coming. I will admit that there are too many references to the MCU, as obviously, this movie is trying to state that this is the MCU's version of Spider-Man, and not another stand-alone reboot. At times, the references can bog the movie down a little, as it seems it cannot stand on its own. I thought Zendaya's character was rather pointless as she is only in it for about a total of 10 minutes, and her character is rather bland and not so memorable. Other than that, I had a blast with this movie. I think that director Jon Watts did a capable job of crafting some really good action sequences, and that it shows that this is where the character belongs. However, with some things, you can tell that this is a product of two different studios, it's clear that producers Kevin Feige and Amy Pascal had different ideas that both tried to get in this movie. At times it worked, and then, it didn't. Go and have fun with this movie... it is the \"Spider-Man\" movie Marvel fans have been waiting for."
    },
    {
      "rating": "8",
      "text": "A fun time, no doubt about it. To start out, I really enjoyed Michael Keaton's adaption of The Vulture, he plays the character so well and so brilliantly as he goes from psychotic madman to sympathetic father. Tom Holland was solid if not okay, thought i still prefer Andrew Garfield's adaption to his I found his performance as Peter/Spider-Man to be commendable. Nothing against Holland but with Holland's adaption we return to the wide eyed Tobey Maguire-ish days of Spider-Man as opposed to Garfield's version which can best be described as whip-smart and likably cheeky, with an undercurrent of teenage angst as well as a sense of arrogance which gave those movies a unique, restless, reckless energy and a welcome sense of danger. Holland's interpretation also feels too relying upon Tony Stark and almost feels like an Iron-Spider-Man than actual Spider-Man. Its the same sense that people take with Christain Bale and his interpretation of Batman. Bale's batman didn't feel as \"Batman\" enough to some fans, to which I agree but I got that same feeling with Holland here. Though like Bale, Holland did a fine job in the role and its not really a knock on him as much as it is a knock on the script. That being said, I did enjoy it's lighthearted tone to go along with its likable cast with Keaton, Downey Jr, Marissa Tomei and Zendaya being the standouts here. The movie is a good time nontheless, some of my main gripes with this movie is that I felt the movie was trying too hard to be something different when it didn't need to do that, it made no mention of Uncle Ben which to some can be good but Uncle Ben is an core part of what makes Peter who he is. They didn't need to show him getting shot but him going completely unacknowledged throughout the movie bothered me. With that being said, the direction is solid but the script fails it at times but the way that it undercuts some of those small, heartfelt moments for a cheap laugh just came across to me as needless. Overall grade: B"
    },
    {
      "rating": "4",
      "text": "Dear Spiderman,I’m writing this to say we’re done. Officially it’s over. Just so we’re clear it’s not me it’s you. It’s been 15 years and although there were some good times more recently it’s more bad than good. I guess you’ve just changed so much and honestly I can’t take it anymore and I’d like to move on with my life. So by all means make your sequels, sell yourself to the MCU and down the line I’m sure yet another reboot is on the cards but I won’t be there to see it. I’m done.It’s not that Spiderman Homecoming is terrible and it’s definitely not the worst Spiderman movie you could watch. Aside from all the high school scenes, there are some redeeming moments, most of which feature Michael Keaton. Let’s face it, he makes a good villain but it’s hardly a memorable performance. Tom Holland do I like you as Spiderman? No I don’t. You’re annoying and you have no off switch but I understand that this reinvention of the character is not aimed at me. So bring your kids to this overly long, generic Iron Man movie featuring Spiderman. It’s got the action, the endless references to the Avengers but it never gripped me. The jokes were constant and too many fell flat, the story was a drag and unfocused. I was never on the edge of my seat. There was no amazing story, no soaring score, nothing that stands out. I forgot I was supposed to be watching a Spiderman movie and I was relieved when it finally ended. So relieved I didn’t even stay for the two post credit scenes. Recommended for the fanboys, as for everyone else just skip it. Goodbye Spiderman."
    },
    {
      "rating": "8",
      "text": "Spider-Man: Homecoming is probably the best reboot for the iconic Spider-Man this far. If you think Guardians of the Galaxy Volume 2 wasn't that great enough, you should see the results of Spider-Man: Homecoming. It puts every installment in the opinionated \"The Amazing Spider-Man\" franchise into shame. That's how great it is."
    },
    {
      "rating": "8",
      "text": "Best Spider-Man ever seen on screen. No doubt.When Holland was chosen for the role I was a little bit weirded, but his performances since Civil War changed my mind. Holland is the Peter Parker we dreamed about reading the comics and the feeling with RDJ is impressive.About the movie, the screenplay is solid and the editing is great technically. All is great in a breathless movie the finally bring Spider-Man in the right place of MCU. So, just can't wait to see him back in Infinity War with the boys... Good job Marvel!"
    },
    {
      "rating": "7",
      "text": "Finally A Spider-Man film that truly captures the spirit of the legendary wallcrawler. The film eschews the origin story and gives a fresh and exciting take on Spider-Man. No longer is he sequestered from The Marvel Universe. He's home in The MCU. This film also delivered something that most comic book films fail to do, create a fleshed out three dimensional villain. That alone makes it stand out from this year's crop superhero films. It's the only one that bothered to create a compelling villain"
    },
    {
      "rating": "0",
      "text": "What a waste of time.The Raimi original was much better, better pacing, cinematography, score, etcI can't believe even the effects look better on the original than in this one."
    },
    {
      "rating": "0",
      "text": "Wow where do i beginOverhypedBlotted Cringy mess filled with over the top jokes and action.Easily the worst Marvel film to date..glad i fell asleep in this mess"
    },
    {
      "rating": "10",
      "text": "Amei esse filme, muito melhor que a versão do Tobey Maguire. Tom Holland interpretou o homem aranha muito bem."
    },
    {
      "rating": "10",
      "text": "Absolutely love this film, it was very fun to watch, had a compelling villain and was very good at showing the movie from Peter Parker’s prospective as a super hero."
    },
    {
      "rating": "7",
      "text": "While not the best Spiderman the movie is a lot of fun to watch and Tom Holland does in fact deliver a great performance. The Vulture was also an awesome villain and is easily one of the best MCU villains. I just wish the writing on Tom Hollands character was better."
    },
    {
      "rating": "0",
      "text": "this is not a spider-man film, this is an iron-boy film. its extremely overrated the story is played super safe and they try to copy the spider man 2 train scene. peter/spider-man earns nothing everything is just given to him. he doesn't struggle with anything bcuz his spider tech suit does it for him. peter doesn't even act like a nerd his version is like 2017 animated spider-man forced unfunny jokes that follows mcu disney formula, they also race swaping and changing mary jane name to Michelle jones/mj its garbage Virtue signalling  and they made aunt may super young. there's no uncle ben so its replaced with iron man. ppl hype this mcu version bcuz of his suit but everything that surrounds this version of spider-man as for as side characters is not comic book accurate, and NED Is annoying! and there is no miles morales. too many race swaping characters, too man unnecessary changes just so it can stand out from pervious versions of spidey (toby & andrew) its a trash spider-man movie its up there with amazing spider man 2 lol keaton's vulture has the most generic villian motivations ever the dumbest plot twist of all time.and he can't never keep his spider man secret identity a secret, he either tells everyone and makes it obvious that peter parker is spider-man even aunt may finds out. he's clumsy and so out of character."
    },
    {
      "rating": "8",
      "text": "It was okay to good, I guess. Tom Holland was surprising for me not expecting too much of him. I like Andrew Garfield more as Spider-Man and Tobey Maguire over Andrew Garfield but Tom Holland himself did a solid job. He was a bit too young as Spider-Man for my taste but that was not the problem. Certain things in the movie felt very forced and that is never a good thing for me in games or movies, no matter the direction, whether its \"forcing to meet expectations\" or \"forcing to do something exactly different\". At times it worked, and sometimes it just felt weird in the movie. Yes, Peter is in this incarnation also a troubled teen and he has to \"find himself\" to see that HE is Spider-Man already and yet, even if he has to find that out, Spider-Man seems TOO incompetent here. Where is his spider sense? If it is in the movie then it definitely was not shown well. And overall his abilities. Or him being afraid of a certain height being reached. It should not matter if \"that is his first time\". He is this guy who should not even care about such a thing. So what if he falls? He should have no problem swinging back. Same for his strength. This is kind of touched in the end \"when he finds the strength after finding his inner Spider-Man\" but still. He seemed like an RPG Spider-Man that was on Level 1. And it is a bit weird because I know Spider-Man, even relatively unexperienced still as ridiculously good enough simply because that is what those comic heroes are. However - it was fine. Michael Keaton as Vulture was probably the best thing of the entire movie, so was Peter's AI Lady friend \"Karen\". Now here's the thing: \"MJ\" is re-introduced. Yes, I know it is said \"she is not Mary Jane\" and \"there are other people in Peter's life\", however, well ... she is still Mary Jane. She does not like her. She does not have the same name. But of course there will not be a second character named \"MJ\" introduced just so we have a literally named Mary Jane Watson with read hair as romance for Peter. We already have an \"MJ\" who is a female \"not yet but somewhat love interest\". This is really nothing but another interpretation of Mary Jane after reducing her to her nickname and \"potential romance\". The most literal way to bring in \"Mary Jane\" without bringing in Mary Jane - as that will surely not happen; it would be awkward to have two Mary Janes. I guess the point can be quite gotten. Mary Jane lives on in this character. And that is just another one of these things that \"are just different\". I am not sure how much I like this or a very young Peter, a Flash that reminds me nothing of flash or an Aunt May that gets younger and more attractive in every movie incarnation she appears but as mentioned before, it was okay nonetheless. It was entertaining and I would say with that it did what it should do. But I would definitely want one of the other two Spider-Man incarnations as part of this Marcel CU canonicity. Still great respect to all people working on this movie."
    },
    {
      "rating": "7",
      "text": "Spider-Man Homecoming is one of those feel good popcorn movies even if the plot of the movie is lacking wide scale elements. Peter Parker played that pinnacle dumb kid with good intentions plot point and it worked for the most part. I really enjoyed this movie for what it was and that was a popcorn movie."
    },
    {
      "rating": "10",
      "text": "Genially aware of itself and terrifically likeable. Only now is this series coming"
    },
    {
      "rating": "10",
      "text": "Spider-Man: Homecoming is an amazing new entry to not only the MCU but a great entry and reboot to the overall Spiderman IP. The cast of characters are diverse and rather than making a origin story, they decided to dive into the world of Spider-man. Great cast of characters, lots of action. Way different than the previous incarnations of Spiderman with a bit of MCU flare - its a fantastic movie and I highly recommend watching it."
    },
    {
      "rating": "7",
      "text": "This movie was good and I would be lying if I said I didn’t enjoy it, but I just can’t like it. I grew up with the Tobey Maquire Spider-Man so I am definetely biased on that front, but I just couldn’t enjoy this movie. It doesn’t have a great love story and the villain is just okay.I don’t know. I can’t deny this movie is good but I can’t help but hate it either.Rating - 68%"
    },
    {
      "rating": "7",
      "text": "Spiderman: Homecoming was actually good, I really didn't want to see this film because I was starting to get tired of super-hero films especially marvel movies, apart from the guardians of the galaxy movies they all feel the same, I got tired of the avengers or captain America, but my friends obligied me to see it and I really liked it.The story was fine, it was fresh compared to the other marvel movies, this was more of a comedy than a super-heroe movie, it stayed consistent but I never felt invested in what was going on...But that twist in the last third of this film was a pleasant surprise, it gave a more weight in the climax between Spider-Man and the vilain and it made me feel more invested in the story.The problem with the story is that it has to many jokes so it does take the intensity of the scene sometimes and the humor can be hit and miss but other than that the story was a descent.The characters made this film fun, Peter Parker is just a kid who wants to impress the guy he idolises (Tony Stark) and her love interest, he's relatable and not annoying.The vilain was the character that surprised me, the other marvel movies rarely had a good vilain in my opinion, this vilain howether is great, you can understand why he decided to do what he does in this film and he can be intimidating,iron-man was also great, he tries to be a father figure but he is flawed so it's a difficult situation and he didn't over stay his welcome and the other characters were fun and had their moments.I was impressed with this film, it feels like a different marvel movie and I'm really glad that I saw it, it's easily in my top 5 marvel films and it's a great summer movie."
    },
    {
      "rating": "7",
      "text": "A more immature version of the famous superhero, that is an enjoyable ride of self-discovery, adulthood and classic “save the day” action. The film takes several small and teeny steps, one at a time to develop the plot -- but it ultimately works as a standard story of great, but meager originality to its main premise. Twists and fun action are big pluses, but fragments of anticlimactic humor and poor character development are forcefully pushing the film down. But in the end it still serves as a fun one timer popcorn event, and that successfully restores the magic to the character that 'The Amazing Spiderman'- franchise totally ruined.Personal rating: 70/100Critical rating: 70/100"
    },
    {
      "rating": "7",
      "text": "Tom Holland and Michael Keaton are awesome!  Marisa Tomei needed more screen time.  I think all the high school scenes are a little too \"Disney Channel movie\" for me.  Some of the writer's decisions to change around the mythos of the characters are daring and only time will tell how that pans out.  Overall, it's fun and"
    },
    {
      "rating": "7",
      "text": "Tom Holland does an amazing job as both Peter Parker and Spiderman however there was little that WOW'ed me about the film. It still has plenty of charm though."
    },
    {
      "rating": "10",
      "text": "I've seen other spider-man movies, I've looked at what Peter's supposed to be like, and Homecoming perfectly nailed that by both being faithful to the comics and adding some new things to them. I love the costumes that Peter has been wearing in the movie, I love the story and how Marvel was kind of focusing on Peter's life outside of Spider-Man. I love the backstory of the Vulture and how he reacted in response. Literally everything was planned out so well! I also love how Civil War was going on around the same time, that part was pretty funny!"
    },
    {
      "rating": "3",
      "text": "So putting the not so subtle progressive check boxes and the not so subtle virtue signaling nonsense aside is this another fun superhero movie? Well Spiderteen has the wonderment of a five year old and in a five year old that would be cute, but in a teen that just makes him look very infantile. Keaton is so obviously Hollywood star material, but the rest of the cast were as bad as any daytime TV soap opera actors. Keaton performance just showed how lame the other performances were. This is a movie just for kids and not for families. Just like every Saturday morning cartoon is just for kids and not for famlies. I was bored by this brain dead kids movie full of trash actors by the hour mark."
    },
    {
      "rating": "10",
      "text": "This Movie Was Spectacular, Sensational, Astonishing; The Ultimate Spider-Man Movie, Being Superior To All Others; It Has Unlimited Lines To Quote From As Well As An Amazing Amount Of References. I Hope This Movie Holds Up Till 2099.If You Couldn't Guess, I Know My Spider-Man And This Is By Far The Best Spider-Man Movie I've Seen Since Spider-Man 2. Favorite Supporting Cast Is Ned And Karen Who Have Some Of The Best Lines. Also A Twist I Did Not See Coming. After My Second Viewing, I'm Happy To Say That I Enjoyed Spider-Man: Homecoming The Exact Same Amount Throughout (Noticing A Few More References I Missed The First Time, Having Donald Glover Play The Prowler Was A Stroke Of Genius). All In All, I Wish I Could Mark This Film Down For Something, Anything. But I Can't. This Is, Hands Down, The Best Superhero Movie I Have Seen (And I've Seen Them All). Something So Crucial Was Missing In The MCU And It Was This; A Superhero Movie Dealing With A Dual Identity. Out Of Marvel's 15 Films To Date, I Used To Be Able To Count The Good Villans On One Hand, Not Anymore, Although I Can Still Count The Villians Who Live Through Their Movies On One Hand."
    },
    {
      "rating": "9",
      "text": "Awesome movie. Great action, unexpected plot twists and intense fights. Would definitely recommend it to someone who has never watched a superhero movie before (like I had before)."
    },
    {
      "rating": "7",
      "text": "\"WHAT THE F***\"I had my doubts with \"Spider-Man: Homecoming\" and I wasn't really looking forward to it. There were something about the way it was marketed that turned a lot of people off, including me. With Tony Stark taking over half of your movie poster is pretty bad and made me worried that the movie isn't going to be all that focus. And the fact this is the third reboot of the character. I don't know why Marvel always hire indie film markers to direct these type of big budget films after one or two hits. However, after seeing John Watts previous work with \"Cop Car\" and \"Clown\", I was slightly interested.Luckily, my fears didn't come true.What could have been a stale and boring, since this is the third reboot, but surprising turned out to be a breath of fresh air with the new direction it took. \"Spider-Man: Homecoming\" is more of a comedy than anything else. It took things and toned down in terms of it trying to be cinematic. I love how small the scale is. The world isn't at strike and not every superhero story needs to have a scenario where the world will literally end if the heroes don't stop it.Tom Holland (as for right now) might be the best on-screen version of Spider-Man I've ever seen. Holland performance sells the awkward and the nerdy side to Peter. He makes mistakes and only wants to do good, so he must literally become the Spider-Man. Just to be clear, it's not doing the origin again, but taking this character in a direction that I've never seen in the other adaptations.Michael Keaton as the Vulture was by far a much better villain compared to the previous ones. It also helped that Keaton performance was pretty terrific and the scene when he threatens Peter was pretty intense. Like, you understand his character and most of the time he isn't even in the Vulture suit. He's isn't out for revenge, just a businessman dealing with weapons and Spider-Man keeps getting in the way.Without spoiling anything, but there's a twist in the movie that I thought was so brilliant and the way it was executed was superb. It actually did shock me and added more conflict to Peters life. How I didn't see it coming was beyond me.The weakest elements of the film are the same with other Marvel movies, which is characters (mostly one of the Avengers) showing up for the soul purpose of setting up upcoming movies. Feels more shoehorned in than having these characters not have a presence to the story. Good thing Tony Stark and Happy Hogan (Jon Favreau) have characters to them and didn't drag the film down. However it still feels shoehorned in.Just like in \"Civil War\", it isn't visual pleasing when it comes to cinematography and color.The movie was hilarious for the most part, although some humor was trying a little too hard for a laugh. I couldn't take the movie serious when it needed it to be.Overall Rating: While \"Spider-Man: Homecoming\" is missing the heart and soul of the Raimi films, but stands on it's own as a fresh start. The writing was great, the performances from everyone was great, and did things that actually surprised me."
    },
    {
      "rating": "7",
      "text": "Spiderman Homecoming is a fun movie, you will get laughs and great visual effects. Tom Holland makes the character even more likeable than Tobey maguire and Andrew Garfield, but that doesn´t compensates that the movie has its flaws. First, the movie has action scenes, of course is a superheroe movie so it has to have action scenes, but this ones (except of one in the climax of the movie) are forgettable. They should have been like two or three and be awsome and unforgettable, that the movie be identify with that action scene, to be the best moments of the movie, but the best moments are with Peter Parker being a normal kid, and have teen issues. Peter´s friend is a good character, it makes you laugh for the way the character is, not because suddenly it has to be funny, is the essence of the character. Also Aunt May and Michelle are funny in the same way as Peter´s friend. The movie has great jokes but, as in all of Marvel movies, it has some moments when it wasn´t nessesary. Michael Keaton is great in this movie, his villan is understandable, but i wish i could have seen more of him. In the end, this new spiderman movie is entertaining, funny and charming at times, but it´s not the best of the character movies (the best is 2002 spiderman 2) but you could have a great time. If you´re a true Marvel and comic fan you have to stay to the post-credicts scenes, if you just like this movies but not loved them at an insane level or just want to have a good time don´t stay."
    },
    {
      "rating": "7",
      "text": "A peine 3 ans après le très sympathique The Amazing Spider-Man 2: Le Destin d'un héros, Sony Pictures nous sort un second reboot à la franchise de l'homme araignée intitulé Spider-Man: Homecoming.Quand on introduit l'univers de Spider-Man dans un Summer Teenage Movie, cela donne Spider-Man: Homecoming. Disons le tout de suite, ce nouveau reboot de la franchise du tisseur de toile plaira aux adolescents, aux fans de l'araignée au cinéma et en dessin animé... mais pas aux fans des comics et fans hardcore. L'univers n'est pas respecté et cela peut choquer certains fans de la première heure.Peter Parker y apparait comme un adolescent en seconde année de lycée, accro à la plus belle fille de l'école, et torturé entre son envie de faire ses preuves à son mentor Tony Stark, et son envie de reconnaissance. Ce qui est censé être une présentation du personnage dans un film lambda s'étale dans un film long de 2h14. C'est long, très long pour un teenage movie.Le costume est un peu trop \"Starkisé\" avec son HUD et son intelligence artificielle, trop de gadgets pour être un vrai Spidey à mon gout. Le Vautour quand à lui est plutôt original, avec des ailes volantes assez ingénieuses qui, il faut l'avouer, étaient un peu obligatoire pour rendre le personnage crédible à notre époque, rappelons que \"Vulture\" est à l'origine un retraité chauve en body vert avec de la fourrure autour du cou et des ailes métalliques. Shocker apparait dépourvu de costume et cantonné à la place de second villain, tout comme Scorpion que l'on voit quelques secondes sous les traits du talentueux Michael Mando (Le méchant Vaas de Far Cry 3 pour les fans du FPS).Certains personnages secondaires font tache comme Flash Thompson qui apparait comme un fils à papa blindé plutôt qu'un sportif écervelé (on voit mal Tony Revolori devenir Venom par la suite). De même pour tante May qui apparait comme une quinqua-cougar, loin de la grand-mère dépendante de Peter Parker. Tony Stark fait juste le raccord entre le MCU et Homecoming. Les caméos sont plutôt sympathiques avec l'habituel Stan Lee, Captain America et une Pepper Potts qui serait apparemment de retour avec Tony Stark (Le couple était censé être séparé dans Captain America: Civil War).Côté effet visuel, la qualité film est irréprochable mis à part quelques scènes un peu fouillis notamment la scène finale (no spoil). Les effets spéciaux sont assez impressionnants et collent bien à l'univers.Pour conclure, Spider-Man: Homecoming est un bon film d'été, amusant et rafraichissant mais il n'arrive pas aux chevilles des sagas de Sam Raimi et de Marc Webb. Homecoming est une vision adolescente d'un héros que les fans du comic-book ne reconnaitront pas. Le film est clairement destiné à un jeune public. Coup de chapeau spécial à la scène post-générique qui est tout simplement épique."
    },
    {
      "rating": "10",
      "text": "It's a good movie, considering that we are flooded with years of bad spiderman movies and it's difficult to find something new or fresh about them"
    },
    {
      "rating": "9",
      "text": "The movie was one of my favorite movies of 2017. It has everything to love about Spider-Man but then adds more, it's extremely fun but it just needed more action."
    },
    {
      "rating": "7",
      "text": "Recupera el humor y el color de Spider-man, sin dejar, al final, de colocar un sabor amargo por las consecuencias; aunque quizás sí se pasaron un poquito con el humor y no estuvo del todo nivelado. Keaton se mira como un villano a la medida del héroe; aunque creo que es un poco más de lo mismo."
    },
    {
      "rating": "6",
      "text": "I wasn't sure whether to give this movie a score of 5 or 6 but I chose 6/10 due to the fact that Tom Holland was only 19/20 when he started playing Spider-Man and the fact that someone that age can overcome the pressure of playing such a huge role is amazing. However I believe this film is highly overrated and is not worthy of 90+ percent on Rotten Tomatoes due to the fact that it is just the same basic hero Vs villain as it is in every Spider-Man film. The high school parts of this film were very entertaining though and is not a huge disappointment."
    },
    {
      "rating": "3",
      "text": "This was a very disappointing movie, especially because Tom Holland is actually very good in this. That's about it though. Spiderman is not only underpowered, but a moron throughout the movie and really bothered me how much he depended on Iron Man/Tony Stark and his suit. Really bad attempt at one of the most beloved characters from comic books."
    },
    {
      "rating": "10",
      "text": "Not only is this my favorite Spider-Man movie but also one of my favorite superhero movies. Don't listen to all the Sam Raimi fans that seem to be giving this movie a 0/10? Even if this isn't your favorite Spider-Man movie you can deny that it is still a really fun and entertaining movie and by no means deserves a 0. It has great action, comedy, story, and tie-ins to the MCU. The introduction of the superhero clean up organization, Damage Control, was also great. It finally explains who is responsible for cleaning up after all these amazing superhero fights and where all of the debris goes. Overall I had an awesome time at the theater watching this and so did everyone I went with. I highly recommend."
    },
    {
      "rating": "10",
      "text": "This film brings back the youthfulness and fun that we all enjoyed from the Spiderman cartoons as a child. This movie is the most lighthearted of all the MCU movies. Tom Holland does an extremely good job at portraying the comical and nerdy side of Peter Parker. The movie has a way of making you feel as if your discovering Spiderman all of again due to his new suit and gadgets, friends, and also his placement in this new universe. If you're one of those people pissed off that Tony Stark is in the movie and afraid that hell take the shine away from Spiderman, don't. Stark makes brief but necessary appearances. He's mostly like a guru to Peter. Michael Keaton brings a humanity to the vulture which makes him a more complex character. And big praise to Ned and Michelle (played by Zendaya and Jacob Batalon) who provides most of the movie unexpected comical relief."
    },
    {
      "rating": "3",
      "text": "Tom Holland said he watched the other Spider-Man movies, but never really inspired them, along with his team of writers. This reboot does not even mind the character's identity, it's no longer necessary. In Captain America: Civil War, Tom Holland's character is a worthy inclusion, merging the previous other Spider-Man trilogies. And now this? \"I'm nothing without my suit\"?"
    },
    {
      "rating": "8",
      "text": "A solid superhero outing as well as an impressive coming of age tale, Spider-Man: Homecoming conjures the best reboot for the titular character thanks to Marvel finally getting the tone of the character right, Tom Holland's star-making turn as Spider-Man, as well as Michael Keaton's soaring portrayal of The Vulture."
    },
    {
      "rating": "3",
      "text": "I had high hopes for this movie given the good reviews, etc., but I found this new, Avenger-in-training version of spidey pretty disappointing.  Gone are many of the trademark characteristics that make spider-man interesting, like his trademark sarcasm, the personality contrasts between Peter and his alter ego, and his overriding sense of purpose based on the murder of his uncle.  Instead we get goofy over-earnestness, no interesting character conflicts, and a single-minded drive to become an Avenger.  Really?  This combination for me at least just didn't work."
    },
    {
      "rating": "9",
      "text": "Spiderman:homecomming is a wonderful movie. Great visual effect and story telling . A lot of funny dialog and above all it really stick close to the comic. You will see a difference spiderman with more bright and energetic than 2 previous sequel. Bad guy in film is another plus point they fix the problem from other MCU with is forgettable bad guy, Vulture in SPI:HC really good and intimidating"
    },
    {
      "rating": "10",
      "text": "This is it. The Return of the King.  And in an excellent way. I didn´t care for the cultural changes of the movie except por 1 but is a spoiler so Im not going to say anything.  Lot´s of easter egg for the spidey fan. Lot´s of Bendis love for it´s ultimate spiderman respect.  And now we know Miles lives in this universe (this is not a spoiler unless you are a super super geek, and if you are a super geek, you should have seen it by now) maybe we can expect some  Peter Parker be the reason of MIles become Spider Later on..."
    },
    {
      "rating": "7",
      "text": "A very fun time at the theater, but I couldn't help shake the feeling like it was trying a little too hard. It undercuts some heartfelt moments for a laugh, and it just comes across as cheap writing. The villain is a standout, being extremely relatable, and at the same time, incredibly horrifying."
    },
    {
      "rating": "2",
      "text": "It used to be adults made these kind of movies for general audiences, but now geeks make them for geeks, which you have to be to go for this junk!  It's an uninspired, juvenile, scattered, weakly plotted, unsuccessful attempt at humor, typical way over-the-top action, annoyingly pc mess.  The Peter Parker character was always supposed to be a teen.  Tobey Maguire, the man boy, was just right to walk the line between that and also be believable and worthy as a superhero.  The new actor is young and underwhelming, and the title should be \"Spider-Boy\". It's so very stale of Marvel to be relying on the same computerized suit shtick as Iron Man not to mention Downey Jr. yet again playing that character in a movie falsely titled Spider-Man whatever.  And contrary to jackass opinion it's not so clever tying all these superheroes together and Marvel has become sickeningly contrived bending over backwards to do so with any ties to reality and plausibility increasingly disregarded.  Silly s---!"
    },
    {
      "rating": "7",
      "text": "Is a good movie, Holland did an amazing job, is the fresh air that Marvel really needed.The movie is totally focused on a familly audience, it contains so many pop / AAA story and I expected this, yes, I expected, but not too intense.The villain is normal, Keaton did a good job but is not at the level as the typical marvel (avengers) enemies and I thought that it would be better.The gadgets of Spiderman really annoyed me because, he lost all the naturality of his powers, it turns like a robot as Iron Man.The good part of the movie is Tom Holland, again, Marvel (Disney) planned the cast very, very well.Good movie, very familiar, not nothing new."
    },
    {
      "rating": "2",
      "text": "First Spider-man movie I have no interest in ever seeing again. In my mind, there is one good scene (on the ship) and one funny line. The rest is pretty worthless. The acting is fine but the writing and characters are 100% Disneyland. The favorable rating on Metacritic for Spider-Man: Homecoming is highly suspect."
    }
  ]
}