{"id": 73, "title": "Spider-Man 3", "starring": ["Tobey Maguire", "Kirsten Dunst"], "runtime": 139, "genre": ["Fantasy", "Action", "Adventure"], "description": "The seemingly invincible Spider-Man goes up against an all-new crop of villains—including the shape-shifting Sandman. While Spider-Man’s superpowers are altered by an alien organism, his alter ego, Peter Parker, deals with nemesis Eddie Brock and also gets caught up in a love triangle.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qFmwhVUoUSXjkKRmca5yGDEXBIj.jpg", "categories": {"plot": 5.146341463414634, "acting": 4.913043478260869, "ending": 5.428571428571429, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.8, "funny": 7.7272727272727275, "action": 5.526315789473684}, "reviews": [{"rating": "10", "text": "To be honest, I didn't what was so bad about this movie! I've heard complaints about Venom, too many villains, etc. Well, whatever! I don't care for any of that! As long as I'm entertained, that's all that matters for me!"}, {"rating": "0", "text": "sugarnite here is the definition of an average raimitard. giving spider-man 3 a higher score than the batman lmfao, giving all mcu spider-man films bad scores. a perfect textbook example"}, {"rating": "7", "text": "Amazing looking scenes, visual effects are first class and funny. However, there was too much going on. And, what was the story-line again? Fight his best friend; Harry Osborn? Nope, that only happened for 5 minutes... Get rid of the Black Suit? No, that only happened for about an hour... Fight Venom? Still no; that was for around 15 minutes... (Next time we should see more of the uber villain) And what in tarnation did Maguire do to his hair half way through? Back to basics with the next one (if there will be) please."}, {"rating": "6", "text": "I agree with what someone of this board said... this kind of movie should be done for he broad masses or for the fan base... sadly, i feel it doesn't satisfy any of them. As a movielover, i dont need corny and cheesy dialogues, or for the fx to overlap the stoyrline, or predictable plots (i really hate that the Sandman was the \"killer\" of Ben), or an overthrown of supervillains one after the another, I appreciate and I'm thankful (as a movielover) for the popcorn kind of movie -as it allows me (is it all the profits come from the tickets or also from the snacks for a movie that lasts over two hours)-, i appreciate the sometimes well executed comedy (honestly, the scene of the dancin' is, as a lack of a better word, amusing), and some action. As a fan, I hated (as much as I like Haden and Grace) the casting for the villains... why don't you make a movie about spidey and venom, the brock's approach to aunt may and the battle in the beach? Venom is really really deep and funny and cinic (please, can anyone hire Todd Mc Farlane as a writer for the next film?)why don't you make a movie about the Harry's obsesion to tell the world who's Spidey, introducing Liz, Raxton and even, Norman jr.? the hatred, the complexity... Is it me or in the movie left a piece of the alien symbiote in Connor's lab?"}, {"rating": "3", "text": "[***SPOILERS***] This movie is bad. It is not good. I repeat, it is bad. However, I must add that I am 29 years old. I saw this movie with a group of 26 people, ranging from 9-35. Everyone over the age of 18 hated it. And most of the people under the age of 18 liked it. So where do we begin? First off, as many have noted, there are too many villains. They all contriibute to the themes of the movie but none are fully fleshed out. And I am sick of movies using predictable coincedences to move the plot along. [**SPOILERS***] Seriously, the one guy who happens to fall into a pit where scientists are changing the molecular properties of sand just happens to be the guy who killed Peter's uncle? And the one person on earth that happens to stumble upon the alien symbiote just happens to be Spider-Man? When Peter and MJ are fighting, Gwen Stacy just happens to be eating in the same restaurant? When Spider-Man gets the alien suit off, Eddie Brock just happens to be in the same church? You can not be serious! Most movies rely on one or two coincidences to move the plot along, but this is just absurd. The fights just seem to drag on as does this movie. Peter's dark side is portrayed so comically, it's laughable. Sand Man's power is so ill-defined that it is not clear at all what this guy can do. Overall, this movie is the biggest movie disappointment since Matrix Revolutions. It gets an A for special effects, and Venom is nicely done (for the whole 10 minutes he appears in this movie), but the movie is a mess. And did I mention how bad this film is? I know you're going to watch it anyways. But you were warned."}, {"rating": "6", "text": "i am one of the biggest spidey fans...saw the premier show on 2 may ... but the movie was not upto my expectations... a lot of money has been spent on special effects(there r bout 7 to 8 fights as there are 3 villans) but its all hooj paoch.. story line is not as good as spidey 1 and 2... ending has been extended.. i think it could have been made much better if concentration was on only main characters like black spidey and sandman... toby could be seen without his spidey mask in action and hary osborn character is cool as green goblin!!"}, {"rating": "10", "text": "A very interesting movie. This movie kept me on my toes, was touching, and was hillarious. From a film critic's point of view, it was okay. But the fact that it kept me roaring, laughing throughout, as well as showing its gripping poignancy shows that it is a brilliant underrated film of the DECADE!!! Also, Tobey Maguire was brilliant when he started to go bad, because it shows that people should take on moral responsibility and shouldn't hold grudges."}, {"rating": "3", "text": "Easily the most disappointing movie I've ever seen. Not fun at all, way too cheesy for a Spidey flick (seriously, the whole teaming up part at the end, and then the shamefully ridiculous dance scene). Bad guys don't seem like they should be bad. All the characters are emotionally distant. The fight scenes are all right, but nothing like those in the previous movies. Clearly wanted to take the Batman aproach and be more dark and sinister, but failed so bad. Sam Raimi can do better, but now he'll probably never get the chance to redeem himself with the series. There have been talks of going on without him, and now it's obvious why."}, {"rating": "0", "text": "This is what it looks like when a franchise turns a gun on itself."}, {"rating": "8", "text": "I enjoyed this film and the review ive given it is possibly skewed having just witnessed \"The Condemned\" which enters the top 10 worst films of all time. Spider-man takes a different approach from the first 2 films coming to blows with friends and loved ones from the start. His character is developing and more so in this film than the previous 2. I'm not a fan of the comics, so im not sure about the history etc and can understand some fans anger, however purely as someone new to the film/series, i enjoyed it overall. I enjoyed seeing something a bit different. What irritated me was the lack of explanation, what on earth was that evil black thing? SPOLIER - When Harry pinned Mary Jane up against the wall then she dumped Peter, what was actually said there? The film however does provide some answers. Combine a decent script with a mega budget, plenty of action and a good cast and you're set. A good film to watch on a Saturday night with the family or a few mates...or the girlfriend. Personally i watched it alone and that was fine too!"}, {"rating": "5", "text": "A poor portrayal of Venom, a bland Sandman, and terrible relationship problems with Peter & MJ. Spider-Man 3 is overly stuffed and has a very sloppy story, but I think it's finally growing on me. It's so bad it's good."}, {"rating": "5", "text": "Look, this tends to happen: a threequel ends up far worse than the fantastic predecessor. Blame it on sequelitis, blame it on overstuffing, blame it on standards, but regardless, threequels aren't often very good. Case in point, \"Spider-Man 3.\" Sure, it's still pretty to the eyes and features some intense action, but it's clear that Sam Raimi was pushing too much into the film: too many villains, plot lines and lore contradictions, poor characterization, and...the awful dance scene. Overall, I'm very torn about what to think of \"Spider-Man 3.\" It's not BAD, but it's not GOOD, and I honestly have no idea who to recommend this to. I guess I can say if your curiosity is piqued, give it a go. Otherwise, just ignore it. That's the best I've got for you."}, {"rating": "4", "text": "First let's start with the good things. The Sandman is a tragic character and a damned good one at that. The new goblin is horrendous, Venom... my god what did they did to you!! I dislike Tobey as Spider Man, but I hate!!!! Topher Grace as Venom, seriously at least stick to the comic archetype of the character. Convuleted mess of plot, too many villains, EMO SPIDEY with one of the most horrific and unnecessary dance scenes in history. just gotta erase that scene from my mind again!"}, {"rating": "6", "text": "WHAT I LIKED: The plot has more layers than other Spider Man films, plus it shakes some of the cheesier aspects of the previous ones. The acumilation of everything at the end is great too.\rWHAT I DIDN'T LIKE: All the good work with chacters and relationships in Spider Man 2 is undone, and Peter seems to have gone back to his old self. It also felt like 2 films were going on at once for the most part, and some of the elements of the plot are completely ridiculous. It's great that they explored Parker's inner demons, but the black Spider-Man thing isn't neccessary and feels comical, the damsel in distress ending seems familiar as well...\rVERDICT: The Spider Man universe is starting to feel very samey in tone. Raimi's Spider Man 3 is an okay film, and arguably not as bad as it's generally made out to be, but it is a bit of a mess until the end."}, {"rating": "4", "text": "Spider-man 3 is as thrilling and full-of-heart as its predecessors (especially the interpretations are better every time), but it may leave you exhausted for the excess of characters (and, thus, villains), the choppy storytelling and the almost forcefulness-free result."}, {"rating": "5", "text": "Spider-Man 3 may not be a good movie, but that doesn´t make it bad either. The special effects are great, some of the dramatic moments are really well done, the music is pretty good (though not as good as the last two) and the action scenes are great. However it´s filled with lots subplots that don´t complement each other well, the villains are underwhelming to say the least, and there are a more than a few plotholes. Overall, this film may be really dissapointing, but it´s kinda entertaining on the first watch and at least it´s better than the Amazing Spider-Man 2 (though not by a whole lot)"}, {"rating": "5", "text": "Spider-Man 3 lands well below the bar which was set by its predecessors. The cheesiness is excessive. The storyline is convoluted and weak. The Sandman twist was terrible. The interpretation of Venom was just bad. Overall, it was a forgettable end to the Raimi trilogy."}, {"rating": "6", "text": "Spider-Man 3 is, as everyone knows, the worst movie in the trilogy. However, it does not mean that it is bad. Moreover, it is acceptable if above all you are attentive to what does not fail, such as the action scenes or the performances of the actors (except the moments of \"Emo Parker\", which are to laugh at the ridiculous they are).The main problem of this film is the number of enemies of Spider-Man, which can not develop properly, especially Venom, which is a total nonsense.Then we have the plot of MJ, that all he does is to destroy the character of Kirsten Dunst, and that of Gwen Stacy, an absolute ****And then we have the stupid Bernard Houseman, which is directly why Harry Osborn's stupidities.In short, Spider-Man 3 has good ideas, but the little freedom that Sony gave to Sam Raimi is noticeable, creating a film that had a lot of potential and that vanished.**** you Sony."}, {"rating": "5", "text": "The weakest of Spiderman trilogy movies.This movie is the end of the Spiderman trilogy, and the follow-up to the previous two films. Of all three, it is undoubtedly the weakest and the most fragile.The script brings together, in a movie, four action figures from the Spider-Man universe: himself, the Green Goblin, the Sandman, and the Venom. The movie shows the birth and clash of the four, and perhaps that's why it all seems a bit forced and cliché, especially in the end. The development of the characters did not have the care and attention to detail we have seen in the previous two films, and the script looks more like an outline than a finished product. I didn't like to see Spider-Man go through a phase of malice, but I understand the reasons and realized by doing some research that comics really give us this story associated with the birth of Venom. So what we saw in this movie has a strong foundation in the original comic books, something I don't despise.Tobey Maguire and Kirsten Dunst kept up the good work on their respective characters. Dunst, I dare say, even improved her performance from film to film. Topher Grace was an exclusive addition to this movie but seems like a serious and capable actor, but has received little and bad material. Thomas Haden Church did an excellent job as a Sandman. JK Simmons and James Franco kept up well. Bryce Dallas Howard was more unlucky ... her character is basically just a pretty face for Spider-Man to save.Technically, it is the most visual film of the three in this trilogy. Bet everything on impactful CGI. Powerful to the point of clearly being false. Does the movie lose any credibility with this? Well, just because we know well that all we are seeing is done through a computer, green screen and other features. It has great special effects and sound, a range of good camera angles and action scenes to suit every taste.The movie is not brilliant. In fact, as a movie, it is the worst of the trilogy and it is a pity that the director did not give the script the same relevance as he did to the special effects. But Spiderman will definitely be back in the movies soon ..."}, {"rating": "3", "text": "As soon as the ending credits began, the person sitting next to me leaned over and sarcastically whispered two words in my ear, “nailed it!”. I laughed and thought, ‘that’s about right’. If you have seen my previous reviews, you would have seen how much I LOVED Spider-Man 2. Therefore, it’s understandable how I was super excited to watch the last chapter of the Tobey Maguire Spider-Man trilogy. It’s also understandable how big of a DISAPPOINTMENT 3 was. It has worse CGI and special effects than its predecessor (seriously, what the heck? This movie was made three years after 2, and I expected an improvement or it staying the same, not a step backwards! This was 2007, not the 80s!). In addition to this, the story suffered from having too many villains (one is great, because you get to focus on one conflict. Two is nice because they have intertwining tales that spice things up, but three? Why do we need three? It just makes everything confusing and hard to follow. Have you seen the movie, Batman & Robin? It features three villains also, and it was such a great movie! [Haha, that was a joke]). The film also was hurt by mere stupidity. How many revivals did they have to have, and what the heck was with all that “probably just a bird” idiocy? Was the extensive strutting scene absolutely necessary, or the black-suited Spider-Man? Why couldn’t Venom just have found Eddie and save us all that cringiness during that time. And that instant side-change of the New Goblin? Why? Possibly it was just an excuse for a couple of fight scenes. Also, if someone took a grenade to the face in real life, no way could that person survive. The plot line is also super predictable at times. Bottom line: if you haven’t seen Spider-Man 3, good for you. Watch the first two and skip this one. I haven’t seen The Amazing Spider-Man yet as of this writing, but I can almost guarantee it’s better than this movie, so watch that one instead."}, {"rating": "5", "text": "While Spider-Man 2 excelled and created a sequel that was more than excellent for its times. I must say, that I hate Spider-Man 3. Truly, I used to love this film but once I grew up I could see more than just one mistake. The producers attempted to pack way too much within the film and suffers the usual Sam Raimi trilogy issues when it comes to expressions and acting. Overall, it's not a bad watch, but its level is way lower than Spider-Man 2. Last note, but not least important, the rendition of the Symbiote suit highly disturbs me. The comic book one is definitely better."}, {"rating": "5", "text": "A big step down from the previous movie, weaker story and the villains are not as good as Dr Octopus and the OTT Goblin."}, {"rating": "2", "text": "Just when I thought Sam Raimi got his crap together. I honestly thought they were going to revive this series, but thank God it's over."}, {"rating": "5", "text": "I have to be honest with you, I really liked this movie when I was a kid. I still can't say with my hand on my heart that I hate it. Perhaps sentiment puts this production above Webb's two mistakes. My biggest problem with this picture is emo Peter Parker. Instead of showing the temptation to have more power when wearing a symbiote costume, the creators decided to demote Peter to the role of an unbalanced teenager who stompes his leg every now and then to be noticed. Due to the construction of this film, which does not differ much from the two previous movies, I will take a closer look at the treatment of antagonists. I will begin with a character who is well known to the audience from the earlier movements. Harry Osborn's motif in the finale of the trilogy has been ruined. In 'first one' we met him as Parker's best friend and an underestimated son of an eccentric businessman. In the sequel, he sought revenge on Spider-Man for allegedly murdering his father, and finally got to know the identity of the New York City hero. Here he follows a simple \"Spider-Man killed my daddy, so I have to kill him\", and then he finds out that he was wrong and wants to help him fight Sandman and Venom. That's right, Venom... The producer of the show, Avi Arad, convinced the director to include Venom in the film because he is a popular character, which will attract more fans to the cinemas. He was right, because the Sony and Disney account was credited with almost 900 million dollars. However, I have a lot of objections to this interpretation of the villain. Topher Grace, who plays it, is not at least a bit like Eddie Brok from the comic book. And although I liked the effect of tangled black nets, the opponent for the spider doesn't necessarily. Apparently 2007 was not a date to animate such a demanding CGI enemies for superheroes. For dessert I left myself the discussion of Sandman, whom Sam Raimi had wanted in the film for a long time, to show the way of our protagonist, rushing not in the direction of revenge but forgiveness. Flint Marco was supposed to be the true killer of Uncle Ben in this story. This is the best written motif, the most attention was paid to it, and the studio presented a high level of realization during the sensational action scenes.To sum up, the 'third' Spider-Man, despite being the black sheep of the trilogy, is a culmination worth seeing mainly due to the fact that the plot of the 5-year story was completed."}, {"rating": "5", "text": "This movie was extremely disappointing to watch. The pacing is horrible, and there are also some cringey scenes. I wouldn't go as far as to call it bad, but it definitely isn't good."}, {"rating": "6", "text": "Although I'd say that Sandman's acting was pretty on point, I still feel like he could've been cut out from the movie and it still would've made sense."}, {"rating": "4", "text": "You are good woman, I am good man. Everyone is familiar with the issues this film has. Too many villains were difficult to juggle so there was a real imbalance in development yada yada baby yoda. BUT, how many super hero movies can claim multiple musical numbers and dance scenes? I'm just gonna say it. Spider-Man 3 walked so Joker could run. Does any of that make sense? No? Well then I've captured this film. Even with the memes, this one was a bit of a slog to get through. Bouncing between all of the stories is tiring and there's not much BUT memes to chew on or wait for on rewatch."}, {"rating": "3", "text": "Too many villains, too many pale plot strands, too many romantic misunderstandings, too many conversations, too many street crowds looking high into the air and shouting “oooh!” I do admire Sam Raimi’s ambition for this movie, but it felt a bit uneven at the end."}, {"rating": "5", "text": "This is the movie that had so much potential but sadly didn't live up to the predecessors. I still love it. I enjoy this movie more than Spider-Man 2. 3 villains didn't work. SandMan didn't need to be in the movie. It retconned Spider-Man 1. Harry becoming the New Goblin was very rushed. Venom, man It sure ruined his character for sure. Topher Grace is not Eddie Brock at all. Gwen Stacy and her father shouldn't have been in the film. I love the third act. I love the overall message about forgiveness."}, {"rating": "3", "text": "Definitely the weakest of the three (what is it with Marvel #3's? X-Men 3 reaked as well). The audience I was with seemed bored throughout and laughed only once. And that was the Jonah Jameson pill scene. Not a good sign. I say let's leave it alone at 3 and NOT suit up for any more."}, {"rating": "10", "text": "The goo also sticks to Peter, but scale back on your expectations for a dark side. If you want to see a truly malevolent Maguire grab the DVD of The Good German in which he forces Cate Blanchett into rough anal sex and then punches her out. The worst the goo does to Peter is turn him into a finger-snapping hipster recalling the Buddy Love character in The Nutty Professor (both the Jerry Lewis and Eddie Murphy versions). But Raimi knows we'll never buy Peter as a dick. So he uses the scene for comic effect -- babes laugh at his cool act -- and in the process liberates Maguire from the goody-goody goo that Peter wears like a second skin. The worst thing Peter does is use Gwen to make MJ jealous. And in a typical Raimi touch, the director finds time to show Gwen apologize to MJ for letting herself be a pawn in a man's game.\r Spider-Man 3 is full of Raimi nuances. But the attack dogs are out in force. They see the film's budget (a reported $250 million) and the huge box-office take of the first two installments ($1.6 billion) as evidence that the filmmakers are in it for the money. Now there's a shock. Internet wags point out that Raimi, from a conservative Michigan family of Polish Jews, contributed $900 to Dubya's reelection campaign in 2004. What's next? Did Raimi phone in votes for Sanjaya? The third chapter in the Spidey saga (a fourth is in the planning stages) is uneven, ungainly and frayed at the edges but there's lively mischief in it still. My guess is that when the summer blockbuster season finishes pummeling us with formula, Spider-Man 3 is going to look like one of the few that was touched by human hands."}, {"rating": "6", "text": "Along with the corny lines, Harry's $2 costume, the flurry [and rushing] of story lines, one thing disturbed me more than anything else: the depiction of supposedly Spiderman's most feared supervillain, VENOM. First of all, Venom lasted about 15 MIN of the entire 140 min! They don't even refer to him once as \"Venom\" either! He says \"I\" instead of \"We.\" And according to the 90s cartoon he's supposed to be large, muscular, intimidating. Topher Grace played him, and I guess the directors decided to stick to the Ultimate Spiderman idea. He did a decent job playing Brock. But they should've either dedicated the entire film to one of the villains like Venom, or saved Venom for a 4th Spiderman and introduce him at the end of 3. Venom is the true anti-Spiderman. All these villains and *plotlines* has the audience not caring about the gravity of evilness the villains possess. It makes them look like a joke to viewers. CGI and nice special effects won't save a movie. Once again, Venom's in and out in 15-20. A dude who's supposed to be a big bad bastard, the scariest supervillain. Sam Raimi/Avi Arad/the other directors missed key plotpoints and overlooked a ton of things. They should've thought this one through longer, they had 3 years to do it! Reminds me of how Jay-Z disappointed w/his new album since he didn't spend much time recording/perfecting it."}, {"rating": "8", "text": "i really liked this movie alot. i was hesitant at first when all my mates were saying it was awful but i was happy with what i saw. the action scenes were great, the strong work around all the characters was where the true brilliance in the film was. i think so many people thought less of it because they were expecting this uber gritty and dark film, but thats just not how the spiderman films have ever worked. sure it was a little cheesy but i loved every secong of it"}, {"rating": "10", "text": "This film is a masterpiece.  Just ask the critics and the IMDB fans.  This division is what creates nothing short of brilliance.  If you want, you can disagree with it.  But no one can argue that this movie certainly is entertaining, and that it has a heart to it and is a gripping tale of bitter humanity."}, {"rating": "8", "text": "Not as good as #2, more action, but just seemed that it was all forced to finish up the trilogy. Storyline good, but for the first time felt a few reaches to put things in order. Much scarier that previous movies. Would NOT take my youngest to see this one. Venom and his screams would give him nightmares. Still the best, by far, superhero movies ever. This one is the 2nd best of the three. If I were to think about it a few more days, I may even move it up a bit more."}, {"rating": "6", "text": "its the most entertaining film from the trilogy. I would recommend this movie to others. However, there are a few flaws in this movie,which is why it is known as the worst film of the trilogy"}, {"rating": "3", "text": "O filme Homem-Aranha 3 tem ótimos efeitos especiais, Tobey Maguire(Homem-Aranha) ainda continua mandando bem, o vilão Homem de areia ficou bem legal e a trilha sonora ainda é muito boa.O filme falha em quase todo resto, Venom é ridiculo, Green Stacy muito sem grasça, Homem-Aranha emo, roteiro bagunçado,resumindo uma forçação de barra imensa, sem dúvida o pior filme do Homem-Aranha."}, {"rating": "8", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;;;;;;::::::;;;;;;:;:;:;:;:;:;:;:"}, {"rating": "7", "text": "As much as this movie was spectacular it had too much going, Too much Sandman, not enough new Goblin and Venom, The scene where Peter cries cause MJ boke up with him was so frustrating, he was basically being a sook. With the exception of Topher Grace, casting was spot on. It's a fun filled ride but it isn't as fun as the first two were. still it's a worthy addition to your movie collection, especially blu-ray."}, {"rating": "8", "text": "wasn't as good as the first two movies, but its visuals were still great"}, {"rating": "2", "text": "Didn't care for it when it came out, Didn't care for it now. I felt have multiple villains was a huge mistake as it kind of muddled the story. Couple that with the worst acting of the series and you have yourself a stinker."}, {"rating": "8", "text": "Spider-man 3 sure has it's faults and flaws. The final cheapter in the spider triogy wraps up the francise greatly and the CGI is dazzling as anything. Sadley though spider-man 3 is so desprate to out-live the amazing spider-man 2 that it works too hard with way too many villans. First of all, if your gonna go ahead with spidey 3 then keep in mind that,ll you either be blown away or damn right disappointed. Mixed reviews are everywhere on the internet so watch with an open mind. First of all the fight scenes are amazing! oh and there's action! Real action with mind blowing CGI. However though, the film spins a messy plot going to the next character and then to the next one. It's also to note that once spidey goes bad, the film even try's to be funny showing a dance scene with peter ( no! you read that right!) a dance scene! You may just be mad with laughter or myble you,ll come across the WTF factor. Either way though despite the films flaws, spider-man 3 has a darker tone and message then the other two films and also  has the beatiful message of forgiveness and choices in the film which to me, was what i found to be the best part of the film. The film wraps the triogly up greatly and by doing so changes the wall clawers orgin story. A riskly move i know and some people thought wrong of this but i for one thought that it payed off as it makes peter grow up more with forgiveness in his heart rather then revenage. Something that are own hearts lack and need to be taught with as well. We always have a choice to do the right thing and its why that this film has the best theme in all of three spider-man films. Spider-man 3 may not live up to spider-man 2 which is a true fact but bear in mind though that it has more heart then spider-man 2 and message. that even the best of us need to learn. Venom was myble a pointless figure in the film but to be honest i just think that venom was a relection of what peter could of become and also what we could become if we live with revenage in our own hearts forever. Don't expect venom to great in the film, let alone be that much in the film either but Raimi didn't even want this guy in the film but instead used him to tell the next story of peter parker.  Oh and there's also a death in the film as well, two deaths actualy ( one a villian by no surprise since this a spider-man film)  and one is just another message as well. A message that shows even if we can redeem are are selfs from bad choices, we,ll stay have to pay for what we chose to dofor making the wrong choice's in life. To sum it all up, spider-man 3, depsite it's faults, is the best spider-man film with a heart and message. Despite not reaching the level of spider-man 2, the final film has bearth taking CGI and finsh's off the triogy on level. Say what you what about this film, love it or hate it, people say only fans who read the comics only know how this is a bad film. Well guass what? This is coming from a big spider-man who loves the comics and also loves this film as well! There's troll's every where on the internet who rip this film to shreds but i don't care. There's more postive then negative reviews on this site, user's put a more postive reviews here which has out-weighed the bad ones so i know that there's other people who think the same as i do. It's not a bad film but a damn good fllm in it's own light. Besides, despite that spider-man 4 may be cancelled, spider-man 3 wrapped the franise up greatly and it did a damn fine job to end one of the most loved super-hero series ever to come."}, {"rating": "6", "text": "What the hell was this crap? Sam Raimi, after your masterpiece superhero film, Spider-Man 2 I expected so much more from you. Sure, the movie was funny in some points but the story was downright terrible. Venom had like three minutes of screen time and the Sandman was just lame. The dialogue was cheesy and there was nothing to go on. Spider-Man 3 was one of the biggest disappointments for movie-goers and Spidey fans, both."}, {"rating": "9", "text": "Spider-man 3 was an epic superhero adventure. Everyone will love this movie. With intense violence, a great plot, and  Marvel's coolest superhero, you can't help but like Spider-man 3."}, {"rating": "4", "text": "A grim misstep that ultimately amounts to being one ludicrous moment after the next. Sam Raimi loses the semblance of what made his previous films good."}, {"rating": "3", "text": "This is what I thought after watching the film first time. ARE you kidding me? Venom, Sandman, so many villains, but none of them was good. The action sequence might have been good at the time, but now, it's just trash."}, {"rating": "0", "text": "Burdened by its overstuffed story and distasteful character decisions. Spider-Man 3 nonetheless would be able to overcome those obstacles with an excellent performance from Tobey Maguire who infects the audience with a pleasing amount of cringe. To be serious though, the mostly positive message is driven by an impressive amount of emotional weight that works very well as a final chapter to this classic spidey trilogy. Unfortunately, the typical damsel in distress has elevated to an insufferable level that dooms this film as an unbearable watch."}, {"rating": "7", "text": "\"Spider man 3\" is very impressive and astounding; Sam Raimi manages to give the obvious fresh joy and humor from the previous sequels and even throws in more villains. The Result? Perfect."}, {"rating": "10", "text": "I thought this movie was the best in the series. I loved every Spider Man movie and this one was my fave. I don't understand why everyone is downing it so much. I was just like the other Spider Man's. This movie had great action, great story, and great dialogue, i loved everything about this movie. It was funny but also serious. This movie pulled off everything. Easy 10."}, {"rating": "4", "text": "Compared to the other Spider Man movies, this is bad. The history isn't nice as the first movie's and it's way less enjoyable. The enemy: Venom, is the nicest thing of the movie...probably one of the only things nice in it."}], "recommendations": ["spider_man_no_way_home", "iron_man_3", "batman_v_superman_dawn_of_justice", "x_men_apocalypse", "iron_man_2", "ant_man_and_the_wasp_quantumania", "bumblebee", "i_am_legend", "max_steel", "riddick", "man_of_steel", "jumper", "terminator_genisys", "teenage_mutant_ninja_turtles", "i_am_number_four", "kingsman_the_golden_circle", "underworld_blood_wars", "morbius", "justice_league", "king_arthur_legend_of_the_sword", "avengers_age_of_ultron", "surrogates", "pirates_of_the_caribbean_dead_men_tell_no_tales", "infinite", "priest"]}