{
  "id": 1142,
  "title": "Spies in Disguise",
  "starring": [
    "Will Smith",
    "Tom Holland"
  ],
  "runtime": 102,
  "genre": [
    "Animation",
    "Action",
    "Adventure",
    "Comedy",
    "Family"
  ],
  "description": "Super spy Lance Sterling and scientist Walter Beckett are almost exact opposites. Lance is smooth, suave and debonair. Walter is… not. But what Walter lacks in social skills he makes up for in smarts and invention, creating the awesome gadgets Lance uses on his epic missions. But when events take an unexpected turn, Walter and Lance suddenly have to rely on each other in a whole new way.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/30YacPAcxpNemhhwX0PVUl9pVA3.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 7.0,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.454545454545454,
    "funny": 7.4,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I loved this film. There are a lot of LOL moments. The message is clear. Peace!! The story is simple. It is easy to follow. I loved the birds. They are so cute and hilarious. Both Will Smith and Tom Holland did amazing jobs! Japanese characters of Kimura and Yakuza are villains. They speak native Japanese. Probably, Japanese voice actors did.This is a funny movie!"
    },
    {
      "rating": "10",
      "text": "I just watched the movie, and i can say that it was actually very fun.  I like it!"
    },
    {
      "rating": "9",
      "text": "Great enough to become a franchise. Sad and happy in equal doses, full of unexpected scenes. Notable for depicting a young \"millenial\" inventor kid as the wave of the future while the old-school hero spy suffers his comeuppance."
    },
    {
      "rating": "10",
      "text": "Expected Will Smith to carry the movie, but actually found the whole supporting cast to be entertainingly likable as well.  The story is very creative and does not fall into modern narrative cliches.  I genuinely laughed out loud a few times.  This is the perfect holiday movie for the whole family that is also creatively satisfying."
    },
    {
      "rating": "9",
      "text": "Classically Will Smith, Spies in Disguise is an action-packed, humor-filled journey laced with adult innuendos and a substantive plot. Genuinely funny with a unique animation style, the movie provides a fresh and unique take on the classic spy/sidekick adventure, keeping the viewer engaged from start to end."
    },
    {
      "rating": "8",
      "text": "With almost same style of 007, Lance Sterling is a sophisticated and arrogant spy with license... to make fun all audience. Armed by witty script that mixes action and humor, free of gross jokes, and Will Smith and Tom Holland in the voice cast, you get 103 minutes plenty of amusement that deserves a combo of popcorn, soda and chocolate bar (just like me, in my birthday)."
    },
    {
      "rating": "7",
      "text": "This or Frozen II? This or Frozen II?.... Whatever, both movies had mindforks during the end credits.To say that Spies In Disguise reeks of \"I've watched this film before\" may be just enough to make you think of the kind of movie you'll be watching. But to say this was the best Will Smith performance of 2019 (between this, Aladdin 2019 and Gemini Man) was enough to give it a passing grade.And when I mean \"I've watched this before\", I mean it. From the first second, you already know where it'll be going, even if there's still a bone in its body to make it stand out amongst other Animated Movies this year, thanks to the whole \"Spy gets turned into a Pigeon\" concept, which almost reaches its full potential once the \"buddy cop\" part of the movie goes on.It's from there that the movie goes full-throttle, being busy just to make sure you're having a wild ride, between Action Sequences that feel like that's where the $110 Million budget mostly went to, a score that wants to be 007 but also wants to be emotive because Animated Movie.The cast perfectly plays off of each other (obviously Ben Mendelsohn as the villain was Awesome as always) and the humor is hit or miss. Yes, even with a 50 Shades joke that I let it slide just fine, especially considering how Universal will soon destroy the magic of LEGO in theaters. And there's a nice message for kids too. Go weird and go wild, even if you're from somewhere else.It could've been all great had it not been a \"seen it, done it\" situation. A big example of how familiar it is can be The LEGO Batman Movie. And, for being an Animated Movie, it sure doesn't have a look of its own. Sure, they play off \"the characters need to look like the actors playing them\" expertly, but other than that, it's your standard run-of-the-mill Animation, backgrounds and everything.It also helps that I had a mindfork during the credits, since, apparently, Andrew Stanton (a Pixar veteran) and Meg LeFauve (writer of Inside Out) were credited as Consultants for the movie. Again, hard to decide if Frozen II was the better mindfork or this one.Regardless, this is still an entertaining romp with a great duo, and iit easily features the best secondary character (besides Tom Holland) in an Animated Movie this year (ironically played by DJ Khaled). Like yeah, it's familiar and all, but it's better than Star Wars, that's something."
    },
    {
      "rating": "9",
      "text": "Spies in Disguise is one of my top 10 favorite animated movies of 2019, one o my favorite movies of 2019, one of my favorite animated movies of all time, and one of my favorite movies of all time. The animation and character designs were outstanding especially the designs of the pigeons, Lance Sterling, Walter Beckett, Joy Jenkins, Killian, and Katsu Kimura. The voice acting from Will Smith, Tom Holland, Reba McEntire, Masi Oka, DJ Khaled, Rashida Jones, Karen Gillan, and Ben Mendelsohn was phenomenal. The writing was stupendous and really funny. This was overall a great movie."
    },
    {
      "rating": "8",
      "text": "Não esperava nada, mais conseguiu me divertir e achei algumas cenas engraçadas, a quimica dos protagonistas funciona muito bem"
    },
    {
      "rating": "10",
      "text": "Another great animated film to end the year! The cast was awesome and the film was great from start to finish!"
    },
    {
      "rating": "10",
      "text": "Kept me laughing the whole time even at age 27! Blue sky has really upped their game and will smith and time holland make a great duo."
    },
    {
      "rating": "3",
      "text": "Another cringe worthy and predictable animation, covers the exact same themes and stupid stuff as the others but gets the same high praises from the likes of RT critics. Kids may like it sure, but if you are an adult please stay away from this film. For the best"
    },
    {
      "rating": "8",
      "text": "This movie is actually kind of a surprise because I had low expectations for it. I found it really entertaining and charming. The action scenes, Will Smith playing a spy that gets transformed into a pigeon, and the animation are just enjoyable. It has cliques yes, but the charm of the characters makes up for it."
    },
    {
      "rating": "5",
      "text": "this film is really disappointing aside from that opening scene. other than that it's painfully mediocre"
    },
    {
      "rating": "9",
      "text": "Will Smith movies are great! This one is the same breath as shark tale. Spies In Disguise was super good."
    },
    {
      "rating": "6",
      "text": "It's a decent family friendly animated comedy and nothing else. The humor was consistently good. Sure, sometimes it fell flat (I mean, there's a 50 Shades of Grey joke) but most of the time I liked the humor. The leads develop a fun dynamic and the performances of their voice actors were pretty solid. It doesn't really want to be taken seriously (and when it tried, it was extremely cheesy) and that's fine. It isn't bad but it wasn't like a great movie or anything, it was fine, if you want to watch it just go ahead."
    },
    {
      "rating": "4",
      "text": "The voice acting is pretty good but otherwise this film is all sorts of stupid."
    },
    {
      "rating": "8",
      "text": "Wow! A lot better than I thought this would be. Going into this animated film, this could have been the standard, generic run by the lines animated kids’ movie, but it’s not. It’s clever, funny, not cheesy, even though there’s still a few childish moments and all-out fun. I mean, James Bond meets pigeons and animation? Come on. It’s a weird concept in itself but does such a great job of making it interesting and amusing. The only complaint would be the underused villain, Killian, actually. I did appreciate that the filmmakers went with a more “villain in the shadows” concept, but it may have worked out better if there was more screen time for Ben Mendelsohn’s character. Overall, it’s visually charming, headed by a great cast, with quirky and fun aspects in a very digestible format of animation."
    },
    {
      "rating": "10",
      "text": "10/10 Will Smith said that's hot10/10 Will Smith said that's hot10/10 Will Smith said that's hot10/10 Will Smith said that's hot"
    },
    {
      "rating": "8",
      "text": "A fun movie. That everyone should enjoy liked it a lot.A must see family film Rating- 83%"
    },
    {
      "rating": "10",
      "text": "I live to enjoy new fun filled adventures. This movie puts the family in a great place and feeds our imagination! Great flick! Ignore the superficial reviews!"
    },
    {
      "rating": "9",
      "text": "----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%"
    },
    {
      "rating": "3",
      "text": "I only bothered to see this movie because I had to babysit my two little cousins, but to tell the truth, it wouldn't have been so bad if I'd taken them to an R-rated movie. Movies 'Spies in Disguise' gives us a good explanation for Disney and Pixar continuing to dominate film animation. It pushes absurdity while at the same time throwing heavy-handed, disorganized and overly-sentimental messages of pacifism. I've gotten to the point where animation has lost a lot of its charm and appeal, and films like 'Spies in Disguise' are the reason why."
    },
    {
      "rating": "5",
      "text": "Simple summary. Not funny. Weirdly divorced from any real sense of fun making suitable for children and adults. Oddly tone-deaf 'themes' handled badly, with completely random 'side-kicks' included as if they had been parachuted from different movies. Smith is unusually without charisma in this movie, and Holland like wallpaper. Only 1-2 LOL moments in an otherwise dull (when is going to finish?) animation-by-the-numbers outing."
    },
    {
      "rating": "7",
      "text": "Sin ser una gran película, es lo suficientemente entretenida y efectiva para que funcione"
    },
    {
      "rating": "6",
      "text": "Cheesy, with cliches but quite enjoyable for first 40 min, then it gets very predictable. Humour is good! Didn't like the gluten free part being pushed 3 times.Its family movie good to watch with kids. Intro and ending montage is nice. Animation is top notch! Production is just great."
    },
    {
      "rating": "5",
      "text": "Muy cliche, predecible, con un humor muy forzado y si bien tiene sus momentos que valen la pena ver, después crean un momento absurdo de comedia que rompe con lo que intenta transmitir en esa escena seria, ademas de que solo alarga artificialmente la trama y no aporta nada que no haya visto mil y un veces en otras películas animadas."
    },
    {
      "rating": "10",
      "text": "Good movie, excelent animaron and a good actutation of Tom Holland and Will Smith"
    },
    {
      "rating": "6",
      "text": "Uma ótima experiencia HDR, mas nada muito além disso.A qualidade visual do filme é o que mais chama atenção. O nível de cores, junto com a rica complexidade do mundo ao redor tornam esse filme um espetáculo audiovisual. Os planos fechados sabem bem explorar as expressões faciais dos personagens e, mais uma vez, o nível de cores aqui é de deixar impressionado. O reflexo no rostos dos personagens e no cenário deixa tudo incrivelmente lindo. O áudio também não deixa a desejar. A utilização dos graves é bem conduzida, principalmente nas cenas de ação.Por outro lado, Spies in Disguise , peca um pouco no que se diz respeito a trama. Desde o inicio, a ideia da subversão do ideal de \"bem vs. mal\" não funcionou tão bem, soando cringe, mesmo até pra crianças. Esses ideias não funcionam pois sua data de validade é curta. Com o tempo a criança vai entendendo como as coisas funcionam, daí esse tipo de frase perde todo o efeito. Chega até ser estranho quando o personagem do Will Smith tem argumentos melhores quanto a esse tema. Por outro lado, gostei da escolha do animal. Há vários momentos cômicos, uns que são fracos e outros que são bons - muito devido a dinâmica do \"Pombo squad\"Audio: English, with portuguese subtitles. Q60T 50' TV Speakers [DTS 5.1]Quality: 4K HDR [Bluray]"
    },
    {
      "rating": "9",
      "text": "Extremely charming, animation has never looked as lovingly made as this, the character design on the pigeons is also very endearing"
    },
    {
      "rating": "6",
      "text": "In the beginning Walter's mom dies. They don't tell us how, why nor did they show character development between Walther & his mom. Walters moms death is a motivation to Walther & is referenced by other characters in the movie. But, to us as the watchers; when its brought up we don't care due to lack of character development. In the film its said that Walther graduated MIT when he was 15. So, how did Walther become so smart? What motivated him to build things as a kid(even before his moms death)? How was he so advanced at building & generally being smart at such a young age? This is also unanswered by this film.That's just me being picky but, there is other big faults in this movie. Like for one: Why is Lance so respected like, how did he build his status? Why is he so good at being a spy; seems like he's the only spy there who gets gadgets made for them specially & the only one who goes on solo covert ops. Also, What keeps him motivated as a spy besides the generic \"I like saving people\". Cause it seems like he rather has no family or doesn't care about his family. Lance only cares about the agency so, there must be something motivating him to care for it so much. What kind of connections does Lance have to Killian(Main villian of this film).Lance said \"I'm sorry what happened in Krpytistan\"(I forgot how to spell it but, the film doesn't care so why should I) this meaning he was involved but, they don't tell us nor show us anything. Like, why was Lance & the agency over there? What did the agency do while they were there? How did & what did they do to Killian's friends that was so gruesome? Why was Killian so close to his partners? Guess we have to imagine. This is the biggest thing that was glanced over. Killian motives are because his partners died but, I'm not going to be sad because they didn't show any character devolvement between Killian & his buddies. This film is good for the family, very casual watchers, people who just want something to put them in a good mode. This film can be fun, it just has some pretty big faults. I was going to give this film a 5/10 but, since it has some fair jokes, tried something unique & wasn't a 100% bore fest. I think 6/10 is good enough for this film."
    },
    {
      "rating": "5",
      "text": "Eh. The film is in my opinion an alright movie. A good way to shut your children's mouth. It's ok. But not the best animayed movie of 2019, nor of the 2010 decade. I think you ought to see other animated releases of this year, of 2019."
    },
    {
      "rating": "6",
      "text": "Will Smith is pretty good throughout this movie and he says one of his famous quotes which is \"now that's hot!!!\""
    },
    {
      "rating": "7",
      "text": "Es una experiencia disfrutable y divertida para niños; la trama es genérica pero efectiva, las escenas de acción son entretenidas y la música es buena; un digno final para Blue Sky Studios."
    },
    {
      "rating": "5",
      "text": "This movie is average. There is no creativity to be found here and characters are hard to connect with because they are so cliche like rest of this movie. I think, aside from cliches, the biggest problem is villain. I think they could place moment were Lance kill villains friends in beginning. It would establish Lances personality and, with some bonding moments between villain and his friends, meaning of that killing to villain that is called Killian, i think. It would make movie much better. Original ideas would make movie better, too. Good things are animation and action. Will Smith is making this movie better. Message is really dumb and UNORIGINAL!!! I give it 5/10."
    },
    {
      "rating": "5",
      "text": "some scenes were to disturbing, three out if 5. trying to hard to be funny mayve"
    },
    {
      "rating": "4",
      "text": "A decent animated movie with a few chuckles to be had. Nothing all too special but it is enjoyable."
    }
  ],
  "recommendations": [
    "hotel_transylvania_2",
    "despicable_me",
    "penguins_of_madagascar",
    "despicable_me_2",
    "ice_age_the_meltdown",
    "megamind",
    "shazam",
    "madagascar_escape_2_africa",
    "robots",
    "bolt",
    "minions",
    "peter_rabbit",
    "the_croods",
    "hotel_transylvania",
    "puss_in_boots_the_last_wish",
    "incredibles_2",
    "captain_underpants_the_first_epic_movie",
    "storks",
    "turbo",
    "the_secret_life_of_pets_2",
    "hotel_transylvania_3_summer_vacation",
    "deadpool_2",
    "the_angry_birds_movie",
    "the_lego_movie_2_the_second_part",
    "zookeeper"
  ]
}