{
  "id": 24,
  "title": "Spirited Away",
  "starring": [
    "Rumi Hiiragi",
    "Miyu Irino"
  ],
  "runtime": 125,
  "genre": [
    "Animation",
    "Family",
    "Fantasy"
  ],
  "description": "A young girl, Chihiro, becomes trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free her family.",
  "releaseYear": "2001",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/39wmItIWsg5sZMyRUHLkWBcuVCM.jpg",
  "categories": {
    "plot": 9.827586206896552,
    "acting": 9.941176470588236,
    "ending": 9.333333333333334,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 10.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is the best movie of   Hayao Miyazaki . I have seen it over 7 times and I think it deserves a 10/10.  All I can say is a epic movie it is great ."
    },
    {
      "rating": "10",
      "text": "Not only is this from Studio Ghibli, but it's also their magnum opus and most likely the greatest anime movie of all times. Anyone rating this below 10 did not understand the intricacies of this masterpiece. Trust me, this movie would be worth even more than a 10 if the rating system allowed it."
    },
    {
      "rating": "10",
      "text": "MIYAZAKI IS AN ANIMATION GOD. Spirited away gets an 11/10. Best animated film I've ever seen in my entire life, and if you haven't seen it, you have not lived."
    },
    {
      "rating": "10",
      "text": "Unbelievable. This movie left me in an infatuated daze a week after viewing it. Great characters, great story, AMAZING designs, and, in my opinion, the best animation I've ever seen. The great thing about it is that it is so good at showing little vignette-like moments that pace unbelievably well. Aside from one little nitpick that is dwarfed by the rest of the movie, this is my favorite film of all time. The only negative is that it has made every movie after it a slight disappointment."
    },
    {
      "rating": "10",
      "text": "This is my favorite Miyazaki film. Every few years I end up watching it again, and it's always enjoyable. It's an adorable film that people of all ages are capable of appreciating."
    },
    {
      "rating": "9",
      "text": "This is one of the great movies in Japan. I moved the state which Chihiro hang on working for getting her parents back. Good picture, good story... Everything is good."
    },
    {
      "rating": "10",
      "text": "Perfect From Start To Finish"
    },
    {
      "rating": "10",
      "text": "I do not have the gift of prose, but I do know that this was one of the best films I have ever seen. Animate or Non-Animated. It draws you in and takes you to another world, another realm, another universe. many movies claims to do that, this one just does. Please see it."
    },
    {
      "rating": "10",
      "text": "The very best film animation."
    },
    {
      "rating": "10",
      "text": "I watched the japanese version which was amazing. Miyazaki is a grand-master of animation. Every detail is nicely done and very beautiful. I would give the disney version 2 points less because I didn't like the english synchronisation at all. Much better to watch it in japanese, with subtitles."
    },
    {
      "rating": "10",
      "text": "This is, without doubt, one of the best movies I have ever seen! Animation at its best. Spirited Away is another masterpiece from Hayao Miyazaki, and it does not disappoint. I've watched this movie countless times, and it's never boring. Tears, every time."
    },
    {
      "rating": "10",
      "text": "It is by far one of the greatest movies I have ever watched. Ever since I was little, this was the movie I thoroughly enjoyed watching. The animations are so detailed and structured, the characters so well developed, And everything falls into place. Simply a masterpiece for it's time, for it's company, and for everything else. It seems that Studio Ghibli, and particularly Hayao Miyazaki, can't make a bad movie."
    },
    {
      "rating": "10",
      "text": "If you want to talk about a perfect film, then look no further than this one here. it is by far the best studio Ghibli film, probably one of the best animated movies, and just a really good movie overall. Some could be turned off from these type of movies for its different type of animation compared with Disney, but get over it and explore some variety. Some of the aspects of this film that make it so good are the characters, Chihiro is suppose to be this wining little girl, but in the end is mature. An evil witch named Yubaba, such a classic villain in my opinion, showing her cold heart with such nefarious acts as turning Chihiro's parents into pigs! All the rest are magical and full of creativity, there's no weak leak in characters. The setting is beautiful, showing the rich culture of Japan and the spectacular animation just makes one feel great. I cannot think of one problem about this movie, none, it's that good. Go watch it right now, or your missing out."
    },
    {
      "rating": "10",
      "text": "The cultural significance of Japanese animation has many, many historical gems within its filmography, however, Spirited Away has to be one of the finest of them all. Hayao Miyazaki has been one of animation’s most vital directors since the late-‘70s and an example of his greatness rests in the heart, mind and spirit of this classic. The coming-of-age themes surrounding its protagonist’s character development, the dazzling animation, the imaginative designs of the spirits and landscapes, it’s a Holy sight nobody, child or elder or in between, should miss. It’s an inspiration from the first minute to its very last. And for once, I’d recommend it in English dubs or subs, as Walt Disney made an excellent attempt to match it with its Japanese counterpart almost entirely and the English voice actors are just as memorable as the original actors."
    },
    {
      "rating": "10",
      "text": "Best animation movie of all time. It shows Hayao's fantastic art direction, storytelling, characters, etc. Nothing can stand in front of it and nothing can hold up to these standards. Masterpiece of brilliant intelligence."
    },
    {
      "rating": "10",
      "text": "The magical, mysterious atmosphere as well as the wonderfully, thoroughly genius plot makes this animation movie a masterpiece not only beyond animation or anime movies, but the movie industry in general. Miyazaki created an undisputed masterpiece that will not lose its magic and beauty any time soon. It will always be my Number 1 favorite movie of all times."
    },
    {
      "rating": "10",
      "text": "I rarely watch anime, but since I heard such great things about this movie, I decided to check it out, and it was a mesmerizing experience. This movie exceeded my expectations in every way. Brilliant story, amazing characters, wonderful visuals, and beautiful music. The life lessons and symbolism found in the film was a magnificent touch. No person can exceed Hayao Miyazaki's ability to make you feel inside his world, and feel that everything that is happening is natural. It doesn't feel as if you're watching drawings move around, voiced by voice actors, it feels as if you're spectating this natural and realistic world, just like Chihiro is. I never knew an animated movie could feel so real, and it truly does blow me away. This movie is a masterpiece. Whenever you are into anime or not, this is a must-see."
    },
    {
      "rating": "10",
      "text": "A Viagem de Chihiro é um dos melhores filmes que eu já vi. Um dos pontos altos da cinematografia oriental! Uma animação espetacular que tem um roteiro impecável e uma história linda, cativante e instigante. Esse filme consegue agradar a (quase) todos."
    },
    {
      "rating": "10",
      "text": "a beautiful film and original plot. I only saw the dubbed version, but it captured my heart. there was an original plot and an ordinary herione. Its a beautiful movie and I suggest any one of any age to look into it."
    },
    {
      "rating": "10",
      "text": "Even if you've never heard of this movie and are curious as to why it's on this top 10 list, you have reason enough to see it. You'll thank yourself later."
    },
    {
      "rating": "10",
      "text": "Beautiful Art. Beautiful Scenery. Beautiful Music. This is a beautiful movie. I was captivated by the story line. I was taken in by the character. I got absorbed into this movie. Every aspect of this movie was done far above par. I can't think of another Anime, much less an animated movie that even comes close to this one. It is a modern day Alice in Wonderland, that has something for everyone. Adults and children, critics and average viewers, anime lovers and anime haters will find something in this movie that grabs them deep down and drags them along through the whole thing."
    },
    {
      "rating": "10",
      "text": "This is the greatest movie ever! From a great plot, to excellent animation, to originality, to the awesome music, this movie is the perfect movie that everybody much watch! Another great from Hayao Miyazaki!"
    },
    {
      "rating": "10",
      "text": "This movie is a phenomenon. The animation is so beautiful that one can hardly describe it in words. Some of the characters may seem strange, but that's what makes the story so enchanting. I highly enjoyed it and could have given it a rating of a hundred billion if I could. Japanese anime has never let me down. Each background scene is so gorgeous that it puts the dull real world in shame. I don't feel that the movie is at all forced-up at all. The characters are very natural (Chihiro and Haku are so cute!), and there are a lot of attention to the details (e.g. the times when Chihiro trips). If you hate this film, it just shows much about your close-mindedness, doesn't it? (Well, maybe I'm being a bit too stereotypical) Anyone who has a young heart and who is full of imagination would appreciate this work greatly. I was simply mesmerized by the movie. (Bring a box of tissue paper when you watch this movie.. It can get quite emotional at times.)"
    },
    {
      "rating": "10",
      "text": "This film has everything an animated film should have: great voices (Suzanne Pleshette giving two very different characters two very different voices), cutting-edge animation (in a world of computer animation, its hand drawn beautifully), and best of all: an amazing, and innovative story."
    },
    {
      "rating": "10",
      "text": "A truly beautiful piece! The animation is flawless, the characters fascinating, and the story very touching. The artwork especially blew me away, as did Chihiro's maturation."
    },
    {
      "rating": "10",
      "text": "Everything Miyazaki does has at least a touch of genius, but \"Spirited Away\" is his triumph -- pure brilliance on every level. Beautiful animation, compelling characters, set in a fantastic world as layered, convincing, and magical as \"Lord of the Rings\", but with a vastly different flavour. I know little about Japanese mythology, but I suspect there's a lot of it in this film, yet its appeal is universal and immediate. This is a film well worth buying the DVD for, as it will reward repeated viewings in a way few other films can match."
    },
    {
      "rating": "10",
      "text": "Studio Ghibly never ceases to amaze me with its wondrous animation and beautiful stories. Those who say that this plot is ridiculous or weak, they are wrong. It would only seem like that to those who truly have not embraced childhood and imagination, those who have grown up and are 'lost' in the adult world. How amazing it is that Miyazaki can relate so well to a 10-year-old. The animation and gestures and movements and dialogue even have subtly yet effectively captured Chihiro's liveliness and courageousness. Chihiro shows us how indepth and underestimated that children really are. Now, it's not to say that this movie does not have any faults. Sure, sometimes, its logic is a bit abnormal, but the abnormalcy isn't always bad. Fantasy is just like that, and it usually adds a touch of amusement or a touch up to the project itself. All in all, this is a movie that everyone is sure to remember, by its wonderful and relateable characters, by its amazing and breathtaking imagery and lastly, the one I will remember most, the message that Life is bittersweet, and you may have obstacles to overcome, but you mustn't be afraid."
    },
    {
      "rating": "10",
      "text": "Hey Louis and Louis's Brother, I find it funny that two kids with the IQ of a squirell have the nerve to criticize a movie that you are clearly too stupid to understand. Miyazaki is a master. If you don't appreciate Miyazaki, go watch some crap that you understand: Deuce Bigalow, License to Wed, Superbabies. Don't worry there are plenty of fart jokes to enjoy."
    },
    {
      "rating": "10",
      "text": "Not much to say. Fantastic movie, the best cartoon movie of all time by far and a masterpiece in cinema's history. Once again Miyazaki made a memorable movie."
    },
    {
      "rating": "10",
      "text": "I try not to give all the films I \"like\" a 10/10 because two films I like, per se, might not be on the same level; not all films I like are 10/10 movies.. Therefore I try to give films an honest rating, there are only a few of my favorite movies that are 10/10 movies, those being, for example, the lord of the rings films, the green mile, and a few others, Spirited Away is one of them as well. I think I was maybe 10 or 11 years old when Spirited Away popped up on cartoon network, I caught maybe the second half of it but I was enthralled so (get this, so old fashioned) I grabbed the newspaper and looked through the TV schedule to find the next viewing. I ended up watching it every time it was on TV until they stopped showing after like two weeks, my dad thought it was unhealthy for me and encouraged me to go outside anyway. I ended up forgetting about the movie for a long time, and I mean a long time. As a grew up I kinda picked up bird watching as a hobby and am actually now turning it into a profession, but I remember doing some research on barn owls and watching a video where the top rated comment was \"barn owls always remind me of no-face from spirited away\"  holy crap, I've heard of that movie, yeah, it was that one on TV years ago, gosh I need to watch that again. I got my hands on the movie and as I sat down to watch it, for the first time in like 9 years, I thought to myself, \"hmmmm... I hope this movie still appeals to me now that I'm almost 20\"  two hours later, there's me wiping tears from my eyes, grabbing my computer and looking up every other ghibli film out there. It was like I was immediately addicted, I needed my fix of ghibli films so I, eventually, over a year or so, got my hands on all of them; honesty, most of them are quite fantastic as well, especially mononoke and totoro. But back to this movie; as someone who watched dragon ball z and digimon and pokemon and anime like that and eventually grew out of it, I was completely astounded at how 'real' this film felt. No, obviously, the things that happened in the film took place in a fantasy world that was expertly crafted and just stretched the imagination beyond belief, but the characters felt real, they were tangible and believable, I connected with them and I cared about them because their emotions were earnest and connected with me so vividly. The character development was fantastic and that was one of the things that made it such a joy to watch. And some people might say that the story is haphazard and confusing; I didn't think so, I think the things that were unexplained in the films or ambiguous were meant to be that way, it adds to the mystery of it, and that's another that I loved so much; being able to make those decisions for yourself as to what you believe the writers implied. Not only that, but the animation itself was absolutely fantastic! The most visually breathtaking drawings and scenes I've ever seen are from this movie. And, as a musician and student of music, I'd like to say that Joe Hisaishi absolutely perfected this film with his impeccable score! Since I first re-watched it almost a year ago, I've probably watched it 5 or 6 times since and I just cant get enough of it. I listen to the soundtrack all the time and it's just beyond beautiful, as I mentioned before. This film is an absolute gem of a film, many people write off animated films before they give them a chance, but this is a film that could easily be translated into a live action film with real actors and it would work just as well; the medium with which a film is presented doesn't always dictate the quality or style of the film. I never thought that an anime film would be one of my favorite films of all time but indeed it is, I will watch Spirited Away a hundred more times, and when I have kids, I'll make sure it's one of the first films they watch as well."
    },
    {
      "rating": "10",
      "text": "I loved it.  Very dreamy, beautiful scenes, some heavy themes.  I'm not sure what age the target audience is, but I could easily see children and adults both loving it for different reasons, or maybe the same reasons.  Worth a watch, good movie to put on just before bed."
    },
    {
      "rating": "10",
      "text": "Spirited Away is a masterpiece in cinema by creator Hayao Miyazaki. This coming of age story is truly inventive, wonderful, suspenseful, sad, and leaves you with a bittersweet feeling in your heart. This is truly an animated masterpiece that is not to be missed."
    },
    {
      "rating": "10",
      "text": "Spirited Away is one animation movie really stands out the crowd. The director Hayao Miyazaki's imagination and story telling with signature visual sequence of flying scene is phenomenal. The sky and cloud is something he always depict. He is really detailed in depicting small scenes."
    },
    {
      "rating": "10",
      "text": "This is a great children's adventure movie. The music, animation, story are all fantastic. This is a movie that will stand the test of time and I highly recommend showing it to your kids as they will love it straight on through to adulthood. Rating it a 10 as there is nothing I would change about this movie."
    },
    {
      "rating": "10",
      "text": "An unbelievable piece of Japanese art. It makes you to watch it again and again"
    },
    {
      "rating": "9",
      "text": "\"Spirited Away\", made by the Japanese animation king Hayao Miyazaki, is a amazing film. It has the capacity of diving deep into the characters and script and transforming them into a mature state. Its a film that knows what its doing and perfectly executes it's job. It's just simply amazing..."
    },
    {
      "rating": "10",
      "text": "The most enchanting film I've ever seen. An emotionally, intellectually, and spiritually complex masterpiece that defies categorization."
    },
    {
      "rating": "8",
      "text": "This is one of the very best movies I have ever seen. No exaggeration. I won't lie, I can see why people wouldn't like it. I can see how it would completely go over some people's heads, but this is a movie which you don't need to keep up on. You can simply sit back and let it happen. But, it can also make you think about it too. There are numerous ways which you could watch this film. The story depth is fantastic. It delivers a complex plot which can sometimes be hard to keep up on, while still delivering a clear simple message whenever you watch it. The art and the animation is just stunning. There are too many ways to describe this movie. Yes. The hype is true. Watch it and find out for yourself."
    },
    {
      "rating": "10",
      "text": "This is my third attempt at starting to write this review. Simply because I feel like nothing I could write would manage to encapsulate the transcendent beauty of this picture. Staring at a blank page, though, I felt this is what Hayao Miyazaki must have encountered during his work. Yet, unlike me, for him that did not feel as a burden, but rather an opportunity.Pictures speak louder than words in 'Spirited Away', a landmark for animation; a piece of art so ravishingly beautiful that even the juggernauts from Disney or Pixar should bask in its glory. The story revolves around Chihiro, a 10 year-old innocent girl lost into a magic world ruled by gods, spirits and witches. But she does not enter there though some fancy flashy portal. It is clear that Miyazaki completely masters the power of animation and of story-telling. The way in which this surreal world is designed is by being constructed by elements from reality. There are buildings, resorts, oceans, villages, trains and train stations. Yet through masterful concepts, it feels surreal not because of how it looks, but rather because of the beings encompassing it and its unusual rules. It is a landmark way of portraying fantastic elements almost like a parallel realm of existence suspended over reality.Indeed, Chihiro often finds herself gazing towards the sunset and far-away villages from her prison-like resort where she is obliged to work as a staff member for tired spirits. And while these creatures are of great and terrible variety, as incredible as they are, I often found myself staring at the set decoration behind them which is painted with such awe, love and dedication that it often feels as if Miyazaki loses himself in this surreal world by crafting amazing artful and detailed backgrounds, inviting you to wonder and ask yourself what other secrets it holds.But, with 'Spirited Away', beauty is not only skin-deep. Every single inhabitant of this world is carefully designed to represent his/her personality, the resort in itself being a metaphorical cleansing of one's soul. But in this magical world, Miyazaki weaves animation like no one else does. Emotions like greed, hatred, love, happiness and sadness materialize into weird but beyond-perfectly crafted drawings with bold black lines and color. You can see one's greed literally consuming people when a so-called No Face spirit shows up and begins devouring everything in its sight, even the staff! Also, Chihiro's parents being transformed by their gluttony into pigs... literally! Yet, Chihiro, through her childish innocence remains pure, and is her purity which guide her through this insane realm by befriending every single inhabitant of it.I could go on forever, but I know my limits in writing. If I was as good at expressing myself as Hayao Miyazaki is at animation, this review would have been able to comprehend this film's greatness. But I am not, and so I will stop and encourage you to experience it for yourself."
    },
    {
      "rating": "10",
      "text": "Spirited Away is imaginative, adventerous, thrilling, heartfelt, visually beautiful and funny. Hayao Miyazaki has definitely created the best animated movie yet. I give this movie 98%."
    },
    {
      "rating": "10",
      "text": "One of the best films I've ever seen. By far the best animated film. Infact, I'd go as far to call this my favorite film of all time. This goes with saying I'm a huge fan of film making in general, and hope to start my own studio one day with several collaborators that are forming ideas with me."
    },
    {
      "rating": "8",
      "text": "@Levente S \"\"Why is it, in Miyazaki films, that evil characters, once neutralized will suddenly join the hero's side and become all helpful? Why is there no treachery? No deceit? Does nobody in this crazy fantasy world have principles? Why does the villain's twin wear identical clothes? Why are stairs no longer a reliable method of vertical transport? Why does the villain give a final test before honouring her word, rather than be, say, villainous and betray someone?\"\" I loved how you try to rationalize a movie about imagination, mythology, and a different world. and i don't see why there must be deceit, that's the problem with the world...people like you who have built in \"feed me plot, feed me deceit, feed me treachery?\" Why cant the world of a animation be filled with fairy tales and good creatures who are simply misunderstood?"
    },
    {
      "rating": "10",
      "text": "The most imaginative film to come from Miyazaki. This film was an absolute joy to watch."
    },
    {
      "rating": "10",
      "text": "\"Spirited Away\" is one of the first animated films I have seen that really had some thing to say. The classic animation as we know it from Disney's films, have created a image of animated film as movies for children only. Although their universes can be called seductive and fascinating especially for kids of young age, there isn't any challenge watching them. At least if you are an adult. Don't get me wrong, Disney have my deepest respect. Their are a great and fun to experience the basic human feelings like love and hate, good and evil. But at the same time they don't seem to be able to put anything else into the films. They always use stereotypes so one can't get confused about their intentions and they also idealize everything, all this for the children to enjoy. This have created the tendency of animation films as children's films. Miyazaki's film isn't like that. The little Chihiro is a typical girl of the modern age and like Alice in Wonderland she enters a parallel universe. Here she finds a world of long forgotten spirits and gods that sees the humans as dirty and as creatures not to be trusted. She has to go through several challenges and have to chose the right choices so she and her parents can come back to the \"real\" world. As observers we get a much more nuanced idea of who she really is and what emotions she has to deal with. This is just one of many examples where Miyazaki differs from the classic animation. Although there is more to think about it can still be watched by smaller children! (It can be quite scary, though) It is a Great film! Enjoy it. Niels Wee"
    },
    {
      "rating": "10",
      "text": "This is a beautiful masterpiece. When i watched this for the first time i felt like i was a kid again, and it was kind of like my imagination had been put into this film. It's magical, it's quite funny, it's graphically beautiful and the storyline is intense and touching. The best cartoon-anime ever created, better than any Disney movie at least. Definitely in my top 10 movies of all time. Amazing"
    },
    {
      "rating": "10",
      "text": "This film is a complete masterpiece, combining gorgeous animation and a beautiful plot. It is my absolute favorite movie of all time, and it will always go down in my book as classical. To those who hated it, I have the utmost respect for your opinions, but you don't have to go and make up pathetic excuses like how it has a weak plot. Appreciate a masterpiece like a masterpiece."
    },
    {
      "rating": "10",
      "text": "Awesome movie and anyone who says otherwise is either blind, a communist, or hates puppies. No movie has effected me this much since Toy Story. Love it"
    },
    {
      "rating": "10",
      "text": "This move is the best Miyazaki film and the story is really good.I,ve seen it over 5 times and I think ,ts the best.The animation is really good and I think the characters are grate."
    },
    {
      "rating": "10",
      "text": "This Is A Amazing Movie!\rEveryone Should See It (Even If You Dont Like Anime Or Animation)\rA Great Family Movie, The Animation Style Is Amazing! A Perfect Movie!"
    },
    {
      "rating": "10",
      "text": "I saw the first fifteen minutes of this movie in Chinese and was totally spellbound. I then refused to watch the rest until I could find it in English - it took me one year. It's the best animated film I have ever seen, better than Fantasia 1 and 2 or Allegro non Troppo. The music is haunting and evocative. The graphics are colorful and beautiful and fascinating. (Wait until you see the transformations of people into animals and vice-versa, then you'll see how an animation can be fascinating). The story and characters are imaginative and sympathetic. The whole thing is incredibly imaginative and well done, for example Spider Grandfather was brilliant and the witch when her fingers started to creep up the side of Chiharo's body like a spider crawling slowly up a piece of meat ... creepy, spooky, chilling, and wow what a way to set a mood , intimate motivaton, and generate tension ... see this and understand why japanimation is the best in the world. \"Spirited Away\" was how I felt too while I was watching it."
    }
  ]
}