{
  "id": 259,
  "title": "Spiral: From the Book of Saw",
  "starring": [
    "Chris Rock",
    "Samuel L. Jackson"
  ],
  "runtime": 93,
  "genre": [
    "Horror",
    "Crime",
    "Mystery"
  ],
  "description": "Working in the shadow of an esteemed police veteran, brash Detective Ezekiel “Zeke” Banks and his rookie partner take charge of a grisly investigation into murders that are eerily reminiscent of the city’s gruesome past.  Unwittingly entrapped in a deepening mystery, Zeke finds himself at the center of the killer’s morbid game.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qkl6mRoFexK2FGWCbAsvrRxjWaF.jpg",
  "categories": {
    "plot": 7.078947368421052,
    "acting": 6.483870967741935,
    "ending": 6.571428571428571,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.5,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The political point of the film worked just fine, but I still left feeling disappointed. I got a feeling of contempt from the writers for Saw fans while watching this film. The Jigsaw 'copy-cat' has no interest in subjecting his victims to games - he is woefully uninteresting, merely another madman seeking revenge. I think this film was originally supposed to be its own thing until Lionsgate picked it up and retroactively pulled it into the Saw universe. At no point does this film feel at all indicative of a previous Saw film. There are no real choices to be made by the people in these traps. The killer simply wants to execute people, which is just not interesting at all. In fact, this kind of character has already been vilified and punished by Jigsaw in the past (e.g. Amanda, Hoffman). What hurts the most is that the sheer discrepancy between the copy-cat killer and Jigsaw himself is never really address by the film. This movie has absolutely no sense of what the core appeal of Saw is: Jigsaw's messed up ideology. The screenwriters think all the audience want is blood and gore with no regard for how or why the blood and gore is happening. No doubt, many people will buy tickets for just that reason, but that's not where the franchise's 1 billion dollar net profit comes from. This franchise would be nothing without its fans and ignoring what makes these films appealing to fans is such a disservice. At this point in the film one of two things should have happened:1) Have either a new character with actual screen presence and charisma or a returning apprentice finish the film and trump the copy-cat's twist by subjecting him to a real game with a real choice, ending with his death and a real Jigsaw killer on the loose again.2) Just straight up delete Saws 3-8 from the canon and start again with Tobin Bell, the only reason any Saw fan goes to see these films.Can you think of a better ending? Making a political point about trigger happy cops is fine but this just feels awkwardly shoehorned into the Saw franchise. Apparently this film is considered to be a spin off with little to do with the OG films anyway. Spiral is not Saw IX, so I guess I just won't watch Spiral 2."
    },
    {
      "rating": "3",
      "text": "Coming from a huge fan of the Saw franchise this movie is disappointing. I really wanted to like it but kind of fault like a drama film with a couple gore scenes."
    },
    {
      "rating": "4",
      "text": "Unfortunately Spiral is a lazy film that relies mostly on the gore and over-dramatic acting than actually being grounded in reality. It feels like Chris Rock really wanted to make his version of the film Se7en, but it comes out an awkward and unintentionally funny mess."
    },
    {
      "rating": "10",
      "text": "Spiral: From the Book of Saw is one of the most hyped movies of this year and OMG it lived up to everything I wanted I was really worried it was just another Saw Movie nope this is my fav because of the impactful character that is Zeke I loved his character played by Chris Rock I am so glad he was part of this movie an and producer on the movie I feel like this is what this franchise needed was something fresh and this movie brings that and all the characters were enjoyable on screen more like the other movies in this franchise which are not at all and all this hate on this movie I am so confused about to me this is one of the best movies of the year one of the best saw movies made and they said the ending you could see a mile away i did not see it at all actually I thought it was one of the cops but one of them got killed so i got confused who it was and this movie had an idea of an story that hit me and that's why i am glad Chris Rock got involved with this movie thank you Chris Rock of what you did to put together a Saw Movie what has an acutally purpose so This was an Big suprise on how good this movie was too me and now is my fav Saw Movie so I give Spiral: From the Book of Saw an A"
    },
    {
      "rating": "5",
      "text": "Has some good ideas, but ultimately is too safe and familiar for its own good. Plus the “twist” is obnoxiously obvious if you’ve seen any cop movie of the last 20 years."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "4",
      "text": "In a nutshell, Spiral is a movie that claims to be unique and original without being either of the two. The only things really going for it is that Rock is a capable lead and it was directed like an actual movie and not a soap opera. The rest of the film was just a nightmare. The traps weren't scary, The story is bland/predictable, You can see the twist coming from a mile away, and the cast is incredibly forgettable. It's a tolerable movie that is certainly above the worst films of the franchise but that isn't saying much. It is still deeply flawed and nowhere near as good as it could have been."
    },
    {
      "rating": "7",
      "text": "Pros:- Interesting new concept for the franchise- Traps are ACTUALLY terrifying and make sense- Chris Rock gives a (mostly) solid performance, along with Samuel L. Jackson Cons:- The story feels rushed/predictable - Wonky editing- Bad execution"
    },
    {
      "rating": "7",
      "text": "Detective Zeke Banks (Chris Rock); is a man under stress. His decision to report a corrupt cop has made him enemies within his precinct and set him at odds with his father Marcus (Samuel L. Jackson); who also happens to be the former Chief of Police.This tension has caused Zeke to be shot in the line of duty when fellow officers refused to respond to his calls for backup which even further inflamed a tense situation and made Zeke a Lone Wolf who is hesitant to work with others and has cost him his marriage.Unfortunately for Zeke; a grisly murder happens and he is assigned a new partner named William Schenk (Max Minghella); to investigate what appears to be a copycat of the long-dead Jigsaw.The fact that the victim is a fellow cop inflames the office and when Zeke is sent a package from the killer which promises more killings to follow as the corruption within his department needs to be stopped.As the victims begin to mount; Zeke and William find themselves in a race against time to discover the identity of the killer and stop the killings.“Spiral: From The Book Of SAW”; is an interesting new entry into the franchise and in keeping with “Jigsaw:’ was more engaging than several of the last films in the main franchise as it gives audiences deeper characters and scenarios than normally shown in the series.While the traps are as clever and gruesome as fans of the series would expect; the decision to target cops is an interesting choice and in many ways reflects the growing cries for reforming the Police but does it in an extreme way and balances out that there are good cops in the mix who serve and protect.Chris Rock also served as a Producer was good in the role and it was refreshing to see him play a darker and more dramatic character. While he still has moments of clever riffs; they are appropriately placed within the film and do not take away from the fact that Zeke is a troubled and driven individual.The supporting cast is solid and while I was able to identify the individual behind the killings fairly early; there were enough Red Herrings along the way that may keep audiences guessing.Director Darren Lynn Bousman who directed the second to the fourth film in the series has made a solid return to the franchise and keeps the dark and dirty look of the film’s trap sequences and while they are gory; there is a cleverness to them that should delight fans of the series.In the end “Spiral” has enough of what fans of the franchise expect and infuses some interesting new characters and scenarios to make one of the more complete and enjoyable entries in the series.3.5 stars out of 5Skewed and Reviewed"
    },
    {
      "rating": "7",
      "text": "Surprisingly one of the better Saw movies. The acting is very good and the opening scene is actually very well directed. Sadly this movie is very predictable, the final plot twist will probably not surprise you."
    },
    {
      "rating": "9",
      "text": "The feeling is very much Saw. You know it's a definite Saw movie, and though not hard to top, it is better than 3-6 combined. The concept of Spiral was great, new, and kept me thinking for a long while after the fact. It had a fresh feeling that kept me connected to the characters I was watching. For the first time in a long time, the gore in this Saw film wasn't the plot of the movie. It was used as a part of the plot while the main plot felt like something the Saw movies back then could have learned a thing or two from."
    },
    {
      "rating": "8",
      "text": "As much fun as 2017's Jigsaw was, it being one of the better entries in the series overall, there were some clear signs that these movies were in need of a shakeup moving forward. Keeping John Kramer's story going for so long after his death like that was just getting convoluted and more than a little ridiculous, while also making it nearly impossible for newcomers to jump in. That's part of what got me so excited for Spiral. A big portion of the pre-release marketing was centered around how this was meant to take the franchise in a new direction, while still remaining true to its roots. Something I think it succeeds at marvelously.This is no reboot. Rather, it's the next chapter in the Saw universe. By going the copycat killer route the film is able to acknowledge and be connected to the original storyline in order to ensure there's a sense of continuity for longtime fans, while cleverly giving itself the freedom to do its own standalone thing and put some unique spins on familiar elements in the process to potentially bring in some new ones.Things play out much more like a crime-thriller this time out as we watch an honest cop try to uncover who is killing the corrupt police officers in his precinct (a plot device that feels very topical these days). The pace may be a bit slower than that of its predecessors in the first half, but the mystery is compelling and Chris Rock's surprisingly effective attempt playing against type makes even the most plodding moments at least moderately engaging. I was a bit worried about the comedian's acting ability going into this, and while some aspects of his performance are suspect I feel feel he did a fine job with his sarcastic wit going a long way towards making the protagonist likable for more than just his sympathetic backstory.The signature traps are smaller-scaled than any of the ones we've seen from Saw II and up, but they are memorable in their simplicity. The deaths themselves are also noticeably less gory. The thrills and chills you would expect are still in place. The horror is just handled in a way that allows more of the tension to come from the actual nature of the situation, as opposed to only the sight of blood and metal. All of which cause Spiral to hearken back to the very first title that started it all, which you can catch it giving more than a few affectionate nods to.To help pay for some of the bigger names in the cast, including a criminally underutilized Samuel L. Jackson, the visuals have taken something of a hit. These films have always been rather low-budget, but this is easily the cheapest looking of the bunch. The effects for the guts and mutilation are fine, but things like the dollar store quality fake facial hair really stick out like a sore thumb. I get part of the reason Lions Gate has no problem keeping this property going is because it costs them little to make and has always brought in massive returns, but if they're going to start hiring more recognizable talent like this maybe they should put some more money into them as well. Can you imagine Saw with the financial backing of a modern day blockbuster?Outside of that there's nothing I could really complain about as Spiral accomplishes everything it set out to do. It's just enough of a reinvention to be the fresh start the franchise needed, without betraying what made it so popular in the first place. I hope it gets some sequels because this got me excited to \"play a game\" again in a way a more direct continuation or full-on, slate-wiping reboot wouldn't have."
    },
    {
      "rating": "10",
      "text": "Me ha gustado mucho esta película. Me pareció una bocanada de aire fresco dándole otro tono mas enfocado a lo policiaco y al thriller, pero me parece una secuela digna sinceramente.Las trampas son tan difíciles y duras de superar que parecieran haber sido hechas por Amanda o Hoffman, pero dejando oportunidad de liberarse. Por otra parte, el nuevo antagonista, a mi parecer supo interpretar muy bien la filosofía y metodología de Jonh Kramer... Esos acertijos mentales y las brutales trampas lo demuestran.Finalmente, la escena final me parece hermosa, en el sentido que cuando la vi, me hizo sentir como cuando estaba viendo las primeras películas por primera vez. Lo mejor de las películas de Saw son las trampas y escenas finales, y la trampa del títere me pareció genial... haciéndome recordar a las trampas ejecutoras de las demás películas: El susto de Adam, la impotencia de Eric Matthews, la ira de Jeff, la sorpresa de Daniel Rigg, la desesperación de Peter Strahm, la adrenalina de Hoffman, la satisfacción de Gordon y la resignación de Brad Halloran... pude sentir todo eso con la escena final.Sinceramente, esta película me ha encantado."
    },
    {
      "rating": "7",
      "text": "Its decent and offers some good scenes, but nothing groundbreaking. For a one time watching its fine."
    },
    {
      "rating": "3",
      "text": "I just saw Spiral and I wasn't a fan of it.What I liked:• The traps and how simplistic yet cringey they were.• The style of editing and how similar enough to the other Saw movies it looked.Things that I thought were okay:• The acting.• The pacing, which sometimes felt too fast (especially for the traps).Things I didn't like:• The timing of the traps. Most of them didn't give enough time for the victims to escape, and the glass crusher trap gave too much time and by the time the key came out, the guy was pretty much already dead.• The twist at the end, which was pretty dumb and predictable.• The SEVERE lack of Samuel L Jackson. His character was only given about 10 minutes (give or take) of total screen time with only 3 scenes.• The killer's voice, for hopefully obvious reasons. At first, I liked it but the more he talked, the less threatening he sounded.How I would rank the Saw movies from my favorite to my least favorite:162345Jigsaw and Spiral are tied.7"
    },
    {
      "rating": "9",
      "text": "Seriously this was a realy good movie it was the best acted Saw movie and it manages to tread the fine lime between being fresh and yet retaining a link to The Book Of Saw  ( so to speak ).The plus points - its the freshest Part 9 of a franchise EVER!Its helped the seriea pass 1billion dollars markMe are finally moving past John Kramer, Jill, Hoffman et, Billy, Adam, Gordon etc... However i wouldnt put it past them doubling back and linking the new killer back to a previous character at aome point.None of it feels stale which is surprisingthe negative -The End was great but not as big an impact as some oif previous endingsNot enough saw musicThe new.killer's voice on tapes irritiating at best and too high pitchedNeed to stop refeencng to Jigsaw Copycats as  -'you aint jigsaw ****Need to move back to games being done for a purpose what ever that may be i(f not.valuing life) and less of he unwinnable typesLet us invest in characters before said trapsI would like  what one other reviewer mentioned at the end of Saw X we Should dispense with serial killers as chief baddies n end with a True believer of tha Book Of Saw as a cult leader And that peraion should be Eric Matthiews kid who could  trap Spiral's killer and. set up hia final test...Bring on Saw X"
    },
    {
      "rating": "7",
      "text": "Nice gruesome spinoff to the original saw franchise. With a fresh look and revival of what the saw franchise has already given us."
    },
    {
      "rating": "9",
      "text": "Ottimo ritorno del franchise di Saw. Dopo un prequel che spiegava come nasceva il percorso della enigmista illudendoci nel finale con vivi e morti che riappaiono, Spiral torna alla ribalta con una chiave più leggera ma al tempo macabra e ingegnosa. Tutto torna."
    },
    {
      "rating": "8",
      "text": "Movie was much better than expected. Good story. Good acting and good comedic relief"
    },
    {
      "rating": "9",
      "text": "Surprisingly one of the better Saw movies. The acting is very good and the opening scene is actually very well directed. Sadly this movie is very predictable, the final plot twist will probably not surprise you.Read Full Review:- https://firstaker.com/spiral-movie-review-story-cast-and-trailer-firstaker/"
    },
    {
      "rating": "4",
      "text": "La peor de la saga, la secuela que nadie pidió, aburrida, forzada y carente de creatividad, Chris Rock será un buen comediante, pero un pésimo actor para este tipo de películas en donde simplemente no encaja, lamentablemente no hay por donde verle el lado bueno."
    },
    {
      "rating": "6",
      "text": "Streamers! We have a jam packed weekend full of entertainment. From new streaming tv shows like The Underground Railroad on Prime Video (check out our free trial link on the side below), Halston on Netflix, Those Who Wish Me Dead on HBO Max, and, of course, the theaters are opening back up across the country. And what better to come out this weekend but Spiral. This movie, lead by world class entertainer Chris Rock as Zeke, follows him as a maligned detective that is caught up trying to figure out a case that is eerily similar to the mass murderer Jigsaw. This updated Jigsaw copycat is focused on the police force and some possibly dirty cops. Let's see if Zeke has what it takes to get us off the couch, into the theaters and risking our lives and wallets.Ok, let's be honest about this flick. Chris Rock is an all time great comedian, so it should be expected that the comedic pieces of the film work. The problem is the comedic pieces throughout work better than everything else, and that's just not good enough for a horror thriller. Surprisingly, Rock was a remotely believable detective in this movie but it still so hard to separate him from himself. Same goes for Samuel L. Jackson. Sam actually played his part well but at one point I was thinking that I'd rather have Sam from Black Snake Moan in this flick. Bring that guy back because he fits the Saw extended-nightmare universe. After all, we really just came here for the brutality. Am I right? We came here to be disgusted and to have to check our backs for creepy little tricycle pigs. None of that happened to me, and I literally watched this movie in a theater by myself and wasn't worried a bit. Compared to the first Saw film, which had me not wanting to walk down my freshmen dorm hallway by myself at night, this film was like watching Peppa Pig at night (in perpetual fear she's going to hang up on me because I can whistle). Now, what I will say is Spiral was creative in the little games it had but they aren't as gross or bloody as Saws 4-7, which began only to do shock value and gore. I appreciate the filmmakers scaling back in that way while still attempting to push the envelope. But truly the plot was not enough. The move is straight forward compared to the the complicated web of stories in Saw. This is basically just the first level of Candy Crush where they basically just give you the win. It was quite disappointing but was executed well, I guess.Let's be honest, the Saw franchise is horror-iconic. It struck fear in people so much they started to be better people, but I didn't get any of that from this flick. Spiral tries to pick up the Saw mantle but the execution landed better with the comedy than it did with the horror and thrills. Moviegoers, I beg you to support the theaters especially as more movies debut, but Spiral isn't one to risk your life for. Check this handful of popcorn out when it hits the streaming services and even Redbox."
    },
    {
      "rating": "10",
      "text": "chris rocks performance was much better then i thought, i loved the plot and the writing of the characters of the movie, this is a must see movie and it has a diffrent take on saw with a diffrent thing. still one of the best movies of 2021 so far, if you like gore this one wont disappoint and this has a balanced theme between gore and the story."
    },
    {
      "rating": "9",
      "text": "Excellent film for fans. Decent thriller over all. I quite enjoyed Spiral. It's not perfect but it does a lot things right."
    },
    {
      "rating": "8",
      "text": "The first SAW was actually a revelation; a gory horror film with thriller overtones. Subsequent films focused more on the gore and I for once avoided them. Spiral on the other hand is an attempt to reinvent the franchise. Surprisingly, I liked it a lot. Think of it as an amalgamation of the SAW franchise with SEVEN and you get what they are aiming at. It's gory as usual, and seeing Chris Rock in a serious role was a bit jarring at first, but it is a fun and scary ride. Too bad it was released during COVID, it would have been a hit otherwise."
    },
    {
      "rating": "6",
      "text": "I went and saw this movie twice today in imax absolutely baked with two separate friend groups. This movie is bad. BUT compared to other saw movies, it’s passable. Looking back saw is one of my favorite series and I re watched them before this film. They are cheesy and convoluted, but always so much fun. This one has a great cast. Chris rock is absolutely awful and Sam Jackson is on auto pilot, but it’s so fun to watch. The level of mental reasoning these cops have in this film are so hilarious. Constantly these people go in on their own and get kidnapped it makes no sense why they aren’t more cautious. Especially with them knowing the jigsaw history. The traps aren’t very good in this one because they are sidelined for the story. The twist is obvious, but it’s saw. It’s a fun time in the theater and is forgettable."
    },
    {
      "rating": "10",
      "text": "This a great addition to the saw franchise and can’t wait to see more follow up movies with Chris Rock"
    },
    {
      "rating": "10",
      "text": "Its a MINI version of Seven with a Saw spin to it. What more could fans ask for. As a fan of the SAW franchise and somebody that absolutely hated the 'JIGSAW' reboot. I absolutely loved this movie. Please give it a watch and ignore all the people riding the hate bandwagon. Chris Rock nailed the role"
    },
    {
      "rating": "5",
      "text": "This new version of the SAW franchise is more a cop drama than a string of horrible encounters that end in extreme bodily harm. Sure, there are still victims subjected to grisly fates, but this time they are all cops being dispatched because of some wrong in their past. Until this movie, I never considered Chris Rock to be the obvious choice for son of Samuel L. Jackson, but it works. They’re both known for their brash, humorous style and expletive laden language. Rock plays the officer assigned to the case, while Jackson (as his father) has a few moments. The real reason people come to this series is to squirm at the awful predicaments where people find themselves. This time the gruesome situations don’t have the same horrifying effect of earlier versions, making this more a murder mystery with some grisly killings."
    },
    {
      "rating": "4",
      "text": "Ich bezeichne diesen Versuch mal als Saw Light. Die Schauspieler sind ok aber der Rest ist deutlich schwacher wie man es aus Teil 1-3 gewöhnt war.Das ist lange her und dieser Neuversuch Saw wieder profitabel zu machen scheitert in meinen Augen. Zu sehr haben die Fortsetzungen ab Teil 4 Schaden angerichtet. -----I call this attempt Saw Light. The actors are ok, but the rest is much weaker as we were used to from parts 1-3.That was a long time ago and this new attempt to make Saw profitable again fails in my eyes.The sequels from Part 4 onwards did too much damage.----J'appelle cette tentative Saw Light. Les acteurs sont corrects, mais le reste est beaucoup plus faible comme nous en avions l'habitude des parties 1-3.C'était il y a longtemps et cette nouvelle tentative de rentabiliser Saw à nouveau échoue à mes yeux.Les suites à partir de la partie 4 ont fait trop de dégâts."
    },
    {
      "rating": "4",
      "text": "Fun fact: This is the longest episode of 'The Chris Rock Show' ever.Jokes aside,I appreciate Chris Rock for trying to breathe new life in this dead franchise while also bringing something topical into the mix. They tried at least.Not the best in the series, but not the worst either. Although I thought some of the Saw traps were really lackluster this time around. Bland and nothing special. Chris Rock and Samuel L. Jackson were fine, but I couldn't shake of the feeling this was the longest comedy sketch that kept building its punchline.And why is it called 'From the Book of Saw'? Where's the box filled with saws in it!?Also, it's weird how the movie 'Forrest Gump' exist in the Saw world, because Chris Rock's character makes a joke about it early in the movie. So Tom Hanks and the goofy looking Robert Zemeckis exist in this sick world....well our lives.So yeah, those were my random thoughts on the movie. It kinda says a lot about the movie itself."
    },
    {
      "rating": "4",
      "text": "If someone told Chris Rock that his idea was good, maybe that person was right, and if he really believed the idea, he certainly had grounds to asume he was on the right track.However, something was lost along the way, And he, both as a producer and leading actor, either did not realize it, or chose to ignore it.Spiral: From the Book of Saw is a clear attempt to do something that might seem a little more serious in this pitiful horror franchise.It is perfectly understandable what this film was trying to do, at least from what I personally inferred, but from the results that are seen, it can be recognized that the people involved didn't know how to give an adequate voice to that plot.Don't be fooled. Spiral is just another Saw movie.It doesn't change the game or the rules, it just tries to give it another approach.Chris Rock may not be the right choice when it comes to horror or drama, but his work here was decent enough, yet it's far from turning this franchise around, which I think everyone was waiting for.At least speaking of the audiences that aren't fans, because if there were 7 sequels of the same thing, it's clear that those fans weren't expecting a reinvention.I can't say that I'm disappointed, because I didn't expect anything from this movie.Because even in the face of the little things that can be rescued, at this point to wait for a change has become futile. So if this is not the last nail in the coffin of this franchise, then the end will never come, and they will continue to exploit its notorious mediocrity in the years to come."
    },
    {
      "rating": "5",
      "text": "This unfortunately was a pretty disappointing saw movie.In some parts the acting was so cringy that it got kinda annoying , I am not sure if thats because of the actors or the way it was written but it was pretty bad. The twist can be seen a mile a way and it was incredibly obvious what would have happened  there was nothing new added and there were barely no interesting new elements to it. The only things I enjoyed were the devices some of them were pretty good."
    },
    {
      "rating": "4",
      "text": "A great new addition to the Saw franchise! Builds on existing lore while expanding it in new and interesting ways. Great acting and a wild ride of a movie."
    },
    {
      "rating": "5",
      "text": "at this point the plot takes a different and somewhat confusing course, it is somewhat overloaded and I think it is overexploited, the meaning is lost and becomes boring, losing the essence of the first films of this wonderful saga"
    },
    {
      "rating": "3",
      "text": "Никогда не смотрел пилу, но знаю что там есть какой то сюжет, крутые ловушки и тд. А что это за недоразумение я так понять и не смог."
    },
    {
      "rating": "6",
      "text": "Kid whose dad was killed by a corrupt cop infiltrates the police department so that he can play \"jigsaw games\" with the bad cops."
    },
    {
      "rating": "10",
      "text": "Muy buena y fácil de entender para la gente que recién está viendo su primera película de está saga"
    },
    {
      "rating": "6",
      "text": "Decent to watch one time but nothing special overall. Eh, I prefer the older ones."
    },
    {
      "rating": "3",
      "text": "The more you watch this movie, the more you realise the director wants to prove that he/she can come up with more ways to be gruesome than the last and that's bloody great but the director gets really caught up in that forgetting he actually has a story that needs proper telling. A good watch but the errors are also staring right back at you."
    },
    {
      "rating": "4",
      "text": "Now even a mighty saw, like a small stationery knife. You can only cut a little, but not deep."
    },
    {
      "rating": "5",
      "text": "1) No character development.2) So many stupid dialogues.3) Chris Rock was trying to be funny but I didn't like his acting at all.4) Editing in some places was bad, the camera was shaking in few scenes and the color grading was irritating.5) The ending was too bad.6) Mystery is predictable with zero action.7) Movie had potential but the writing was awful.8) There were some good traps and good moments. The storyline was decent but written poorly."
    },
    {
      "rating": "5",
      "text": "This movie should not be concidered as a continuation of the genious SAW series, but more as a spinoff. They tried to keep up with the original movies with the editing (fast cuts, spinning camera, scary noises etc.) but often failed. The acting wasn't the greatest, too \"lazy\", too \"unbelievable\" in some parts. About the predictability for me: i didn't see the twist coming. If the whole movie was like the last 20 to 25 minutes, it would be an 8/10."
    },
    {
      "rating": "5",
      "text": "hile this had some good moments and good traps and a decent storyline, this isn't anything special or new, and should have been far more superior than it was. Chris Rock was better than I expected but I still think I'd like to have seen someone else in the role. Unfortunately though this was far too predictable as it's very obvious early on who the Jigsaw copycat is. Unlike other films there wasn't much subtlely. A shame as they had an opportunity here to make something really exciting."
    },
    {
      "rating": "2",
      "text": "The best part of this movie is the flashback scene where Chris Rock is 20 years old but hasn't been aged down except for a backwards cap and Samuel L. Jackson wears a fake mustache. The worst part of this movie is everything else."
    },
    {
      "rating": "7",
      "text": "Spiral surprised me. The acting, CG, and gore was on point. It did not feel like \"saw\" at times but I think there is a lot here to improve on moving forward."
    },
    {
      "rating": "7",
      "text": "I enjoyed it. Maybe was not typical saw movie where it is usually more oriented on the devices - in that sense yes its more about the effect of devices than something else but still was enjoyable and suspenseful movie."
    },
    {
      "rating": "7",
      "text": "The point is, beyond the main sequence plot line, Saw is no longer fit for adaptation since, no matter how to replicate Saw's outstanding torture and death technique, the future sequels would simply be copycats, like in the case of Spiral: Not enough to be considered Saw IX, but a spin-off from the Book of Saw."
    },
    {
      "rating": "4",
      "text": "I didnt like the film, it was vere boring, the traps were uninteresting, except for the fact that with the fingers, the atmosphere and music did not fit the film at all."
    },
    {
      "rating": "8",
      "text": "Definitely one of the better movies in the Saw Franchise the acting is pretty good but over-dramatic at times"
    }
  ]
}