{
  "id": 3274,
  "title": "Splice",
  "starring": [
    "Adrien Brody",
    "Sarah Polley"
  ],
  "runtime": 104,
  "genre": [
    "Horror",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Elsa and Clive, two young rebellious scientists, defy legal and ethical boundaries and forge ahead with a dangerous experiment: splicing together human and animal DNA to create a new organism. Named \"Dren\", the creature rapidly develops from a deformed female infant into a beautiful but dangerous winged human-chimera, who forges a bond with both of her creators - only to have that bond turn deadly.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4oqaWnO3dKYAt3vZWAD4oLfOXOC.jpg",
  "categories": {
    "plot": 4.681818181818182,
    "acting": 5.5,
    "ending": 4.375,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.083333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Couldn't believe the series of irrational decisions by the leads. Great effects, though. Outright prolonged laughter at the movie by the audience I saw it with."
    },
    {
      "rating": "7",
      "text": "\"Spice\" is a movie that urges you not to observe the plot, but to observe the maturity and growth of a CGI'd SF creature. The movie's pretty fun to watch like looking at a science experiment."
    },
    {
      "rating": "3",
      "text": "I've haven't seen such a fundamentally flawed movie in ages. Brody and Polley have absolutely no screen chemistry together. I didn't believe them as a couple for even a second so when their creation invariably threatens their romance, I could not care less. Moreover, the Brody and Polley characters are supposed to be cutting edge scientists but they seem clueless about the imminent danger even though the warning signs are so obvious that a 7 yr old in the audience would be able to pick them out."
    },
    {
      "rating": "10",
      "text": "A truly disturbing and thought-provoking movie, far better than your average pop-corn scary flick - so I can see why some viewers disliked it. But the creepiest scenes aren't gratuitious at all. What's human? What's a beast? Are our behavioral patterns dictated by nature or culture? And most of all... was Sigmund Freud right? These are some of the questions posed by the film which. Good work, Natali, and congrats for casting two real actors and not random bimbos (like other horror movies.)"
    },
    {
      "rating": "5",
      "text": "Really, don't expect anything stellar here. The biggest fault of the movie is that it tries to blend elements from various genres into one, mediocre package. The premise is intriguing; you are in a reality where gene splicing is already being used to cure many diseases of creatures other than humans (or something along that line). Two scientists who are in a romantic relationship decide to do the bold, and try using human genes in the splicing process. It is from that moment where they create the hybrid creature until the next hour which you must endure what can be called a \"child-raising\" sequence. However, right as you begin to think this is what the movie is all about, it takes a huge right turn and puts it in more of a horror-movie style setting, but only for a couple of minutes. Literally. It's obvious this was just put in there so they could snag the horror fanatics in their marketing, but if you come into this expecting a deep, compelling, and thought-provoking Sci-Fi film, or a scary and thrilling Horror film, then you may have come to the wrong place."
    },
    {
      "rating": "1",
      "text": "Adrian Brody should be ashamed of himself. The movie completely falls apart into the ridiculous half way through. It got so bad, people (including me) were laughing, one couple walked out. NPR's Science Friday should also be embarrassed they gave the director credibility by having him on the show."
    },
    {
      "rating": "9",
      "text": "I really liked this movie. It was a mash-up of a lot of good concepts from previous movies that work well...I see that many of the negative reviews were from people who obviously don't get the idea behind \"black humor.\" Yes, parts of it are supposed to be intentionally funny, and this does not mean it's a bad movie; horror and comedy can mix (intentionally) believe it or not. Save your money on Saw 5 (or whatever they're on now) and see this instead. Thought-provoking with real-world implications on where science is taking us."
    },
    {
      "rating": "2",
      "text": "I can't believe that they spent so much money making such a completely terrible movie. I walked out of the theater thinking that I haven't seen a movie this bad since I made the mistake of renting \"half cast\". The upside, and why I gave it a 2, it was entertaining. It kept my interest, and it had me nearly rolling on the floor laughing - I think this wasn't the director's intention however. If you're expecting a good horror/sci fi flick, look elsewhere, if you're looking for some entertainment, and possibly to laugh your ass off, this might be a decent choice. It's just too bad the laughs were all unintentional."
    },
    {
      "rating": "0",
      "text": "The summary under the raiting section of this movie sums it up best when it says \"disturbing\" this movie was tasteless and repulsive. If you enjoy watching mythical creatures change sexes and rape women then this movie is for you, but if you enjoy everyday entertainment we today call \"movies\" then save your money or go see marmaduke"
    },
    {
      "rating": "4",
      "text": "A fusion of \"The Fly\" and \"Species\" with a some disturbing pseudo incestuous sex / rape scenes. All in all, not very scary and predictable. The characters were some what irritating as well. Wait for the DVD. I was surprised to find a few families bringing their young children. This movie has very disturbing and graphical sexual content. DO NOT BRING CHILDREN! I guess R-ratings aren't sufficient warning anymore."
    },
    {
      "rating": "9",
      "text": "This movie owned. I can see why some might not like it. If you are looking for a movie that truly tackles the real life politics of genetic splicing or really explores the morality of it all, then you probably want to look elsewhere. Sure it touches those briefly, but what we really have here is a fun, HILARIOUS semi horror movie that leaves you feelling as weird as the content matter. Personally I had a blast, laughed my tail off and was weirded out. I got to the movies for entertainment. And this definitely hit the spot."
    },
    {
      "rating": "1",
      "text": "The critics got this one TOTALLY wrong. Can't understand how it got good reviews. Dumb, dumb dumb! The audience was howling with laughter at serious scenes (not a good sign....)."
    },
    {
      "rating": "1",
      "text": "I'm not sure I saw the same movie that all the pro-critics saw. The Splice I saw was terrible. One of the worst films I've seen in a long time. Not scary, not funny, not intelligent. The only reason I stayed in the theatre was that I kept hoping it might improve but it never did. A truly moronic effort."
    },
    {
      "rating": "2",
      "text": "As i left this movie half-way thru, i'm giving it half the rating i probably would if i'd stuck it out. i figure i left just before the alien smooching scene. i mean, if i want a good alient smooching scene i can always ask the ex to send over vids or her and her shall we say friends. people acting in movies like this, understandably, do it for the bucks (not withstanding that there's a harsh name for it)."
    },
    {
      "rating": "4",
      "text": "Yeah, the Metacritic score is so off! While little of this is truly bad (except for the creature-lovin'), it's all truly predictable, so you find yourself glancing at your watch waiting for the scenes you know are coming to finally get here. Which might be forgivable if this horror film had any scares to it. Aren't horror films supposed to be scary AND unpredictable?"
    },
    {
      "rating": "5",
      "text": "The ending made the whole movie fall flat for me, it was just too grotesque by the end to be the perfect ending. [***SPOILER***] Without giving everything away, the story could have handled Dren better other than \"it went crazy and had to be killed\". It's too bad, I liked the premise of exploring what creating a human-beast hybrid entails, ethics/morality of dabbling with nature (or creating a monster, depending). It's not an awful movie, just felt like the director forgot where he was going with it somewhere in the middle."
    },
    {
      "rating": "3",
      "text": "Just plain horrible. People were laughing in the movie at some of the more ridiculous moments. God, how could anyone like this move?"
    },
    {
      "rating": "1",
      "text": "This movie isn't good. It isn't scary, but it is quite disturbing. Although Dren looks human, she is mostly other animals, so Adrian Brody has sex with an animal. Bestiality isn't something I wish to see, and even when the animal looks human, it just creeps me out."
    },
    {
      "rating": "5",
      "text": "Average sci-fi movie. It's worth watching it for free, but I'm not sure I would pay to see in the theater or on DVD. It's a hair better than the made for SyFy movies."
    },
    {
      "rating": "8",
      "text": "The spawn of Adrien Brody and Sarah Polley takes after her two lab nerd parents in the sci-fi shocker Splice. Genetically concocted Dren - loopy, endearing and freakish - has the smarts of both rebellious scientists Elsa and Clive. Dren's got the unpredictable, relentless will of Elsa, and the soulfulness of Clive. Very much like E.T., she wants to phone home. Alas, she has no home except where she finds herself now, in the spooky land of her creators.\r With spot-on acting by Brody and Polley as hotshot splicers who are romantically involved, Splice soon becomes a horror treat.  It immerses us in the ethical drama created by the two scientists. The violent scenes whet one's horror appetite, and only become gratuitous later in the film.\r Chafing at the restrictions set by the pharmaceutical company that sponsors them, Elsa and Clive have set up their own lab (called \"Nerd,\" from which they derive Dren's name). It is here where Dren is born.\r The pleasant surprise here is Delphine Chaneac as Dren, whose complex performance rivals her computer generated chicken legs and barbed tale. She's all yearning and devilish mischief. Howard Berger crafted the special effects.\r Oscar winner Brody is the conscience of the film. Exasperated, he reminds Polley about right and wrong even while he crosses that line himself. The plot is predictable as we worry about genetically engineered creatures run amok. The puzzle of Dren's fate is a smart, perplexing understory. Dizzying wealth drives the company's research while remaining its ultimate motive in creating genetic cures.\r Polley renders a particularly cold, hungry, vulnerable genius in Elsa. There's a subplot about Elsa's insane mother. While she doesn't avoid the possibility of passing along those genes to Dren, her Dr. Frankenstein creature will yield precious cures for chronic diseases. Splice is chilling to the very end, and makes one wonder whether creatures like Dren already exist here on Earth."
    },
    {
      "rating": "0",
      "text": "disturbing + boring plot = don't bother    Not nearly as good as an hour long episode of outer limits, sorry I watched it. Scifi horror is one of my favorite film genres, and I have watched a lot of disturbing crazy horrible stuff in my days, but this was the only one I wished I had not watched. Nothing high minded here, don't even bother to watch. Especially sad since Adrien Brody usually makes every movie worth watching."
    },
    {
      "rating": "3",
      "text": "whoever thought that adding weird manimal sex scenes to this movie was a a good idea should be ashamed of themselves it was an extremely unpleasant and disturbing way to make a bad movie even worse"
    },
    {
      "rating": "2",
      "text": "I haven't seen a movie this bad in awhile.  The audience I saw it with was laughing along with me at all the really stupid people on the screen that kept making stupid decisions.  One after the other.  If this was a typical scary movie that might be acceptable, but these are supposed to be brilliant scientists.  There are so many eye-rolling moments in this film you have to see it to believe it.  I was in the mood for a good Sci-Fi movie because I hadn't seen one in awhile, and this was a total disappointment."
    },
    {
      "rating": "6",
      "text": "I don't really know how to rate this movie.  It freaked me out and really disturbed me.  It's not scary, but is just morally confusing.  The acting isn't great, the plot could be better, and some of the effects were a tad on the lame side, especially the giant living boogers they make."
    },
    {
      "rating": "7",
      "text": "When it comes to sci-fi monster movies, Splice offers up something completely different. It is creepy, disturbing, and thought provoking. It follows two scientists who work splicing together animal DNA. It"
    },
    {
      "rating": "10",
      "text": "Simply amazing. This movie is smart and entertaining!"
    },
    {
      "rating": "1",
      "text": "Totally predictable, seems to take forever to tell the predictable story"
    },
    {
      "rating": "8",
      "text": "\"Splice\" is horror of an almost Raimi-esque level. Like the recent \"Drag Me to Hell,\" \"Splice\" is damn funny and horribly disgusting at the same time. It's a gross-out freak show with an agenda. It does a great job of criticizing genetic experimentation, parenting methods, and all the more disturbingly, human sexuality."
    },
    {
      "rating": "3",
      "text": "Found it neither enjoyable nor thought-provoking."
    },
    {
      "rating": "10",
      "text": "From neonate to grown-up, Dren, the flawless handiwork of CGI animators, is never less than convincing as a living thing. When Elsa(Sarah Polley) decks out her genetic deviation that she co-created with Clive(Adrien Brody), a fellow genetic engineerist and bedmate, Dren stops being a special effect and starts to have a visceral impact on the moviegoer. She's simulacrum like Gollum was simulacrum, a technologically alive being that intergrates itself among the animate and inanimate objects which describe the natural world, instead of announcing its \"otherness\" through distraction, courtesy of such typical, self-evident pixelated fakery found in so many computer-generated characters(i.e. Jar-Jar Binks, for starters). Dren enchants. As a result, the filmmaker can go anywhere he wants to, and does, with Cronenberg-ian gusto(psycho-sexual politics, check; splatter effects, check), in which \"Splice\", among other things, works as a Mia Farrow-like revenge fantasy. In \"Husbands and Wives\", Farrow's last movie with veteran writer/director Woody Allen(her then-lover and collaborative partner), the moviegoer feels privvy to their common-law marital discord, but the auteur stops short of full disclosure, electing not to divulge the root cause. Allen's on-screen nebbish alter-ego, arguably the biggest nerd in all of filmdom, made his debut in Clive Donner's \"What's New Pussycat?\", and Clive just happens to be the name of the scientist(***SPOILER ALERT***), who initiates a sexual relationship with Dren(\"nerd\" spelled backwards), a creature that Elsa treats like her own daughter. Clive should know better. Hands off. Polley, a risk-taking actress(Hal Hartley's \"No Such Thing\": the beauty doesn't f*** the beast) and accomplished filmmaker(the elegant \"Away From Her\"), is probably best-known for her role as a schoolbus crash survivor in Atom Egoyan's \"The Sweet Hereafter\", seems perfectly suited for the subtext at hand, when you consider the reluctant ingenue's track record for kinky sex(Nicole's consensual affair with her father) and revenge(Nicole's false testimony at the accident deposition after dad calls it quits). Since Dren enchants the moviegoer, it's perfectly plausible that Clive would fall under her spell. They dance. She has the scent of a woman. Soon after, they make love. When it's Elsa's turn, the moviegoer is hard-pressed to get a read on the mother figure's face during this incestuous coital act. The implications are disturbing, to say the least. \"Splice\" is the most thought-provoking science fiction film since David Cronenberg's \"Existenz\"."
    },
    {
      "rating": "7",
      "text": "If you like Cronenberg-esque body horror then this film is for you. 'Splice' has Great special effects, amazing acting and an intriguing storyline."
    },
    {
      "rating": "7",
      "text": "Definitely worth a rental .. the chimera they breed is [spoiler alert] really a device to encapsulate the 'lifetime\" of a family into a few short weeks .. the strongest theme of the film [spoiler alert] is the helplessness of the child especially at the hands of the parents."
    },
    {
      "rating": "0",
      "text": "Absolute train wreck of a movie. Perhaps the worst I have ever paid to see in a theater. The title \"Splice\" probably refers to the writers linking scenes from terrible B horror movies and bad sci fi serials into a full-length movie. Not a single redeeming quality to this movie, and I would strongly recommend people avoid at all costs."
    },
    {
      "rating": "7",
      "text": "Part Cronenberg, part Corman, this briskly-paced, well-written sci-fi/horror/comedy stars Adrien Brody and Sarah Polley (both excellent) as a pair of scientists who genetically engineer a monstrous new creation by splicing together human and animal DNA. In the tradition of all great Frankenstein stories (not to mention King Kong, Creature From the Black Lagoon, etc.) the true heart of the story lies in creating real sympathy for a creature (called Dren in the film and played by Delphine Chaneac) who may be a deadly monster but who is simultaneously a misunderstood child. An entertaining creature feature full of blood, gore...and a little bit of heart."
    },
    {
      "rating": "3",
      "text": "Usually I agree with the metacritic average score, but this 65 is way, way off. The first half of the movie works, but it decays into confused swirl of stupid ideas. It's not consistent, not intelligent, and not entertaining. If you want a similar gross-out, but with intelligence, see The Fly (1986)."
    },
    {
      "rating": "5",
      "text": "This ending was pretty bad...and I agree with @Petey, pretty predictable. Then my gf took me to Killers...I wasn't prepared for how good that was! Pretty funny. I'll give it to Ashton."
    },
    {
      "rating": "8",
      "text": "SPOILERS AHEAD: Smart monster movie with amazing creature effects. I felt repulsion and then compassion towards the creature as it developed, both physically and emotionally. I thought the movie was a sly criticism of modern-day parenting. Starting with Ms. Polley's indulging the creature at every turn, defying all common sense, and then changing her parenting philosophy when the 'offspring' decides to act out on her own. Mr. Brody, on the other hand, is a distant parent until the creature is old enough to be intellectually, emotionally, and physically interesting. The couple discuss their parenting plans in the build-up of the plot and references are made to Ms. Polley's emotionally disturbed mother. Then their subconscious parenting desires come to the forefront when the birth of Dren occurs. Definitely worth watching."
    },
    {
      "rating": "0",
      "text": "For people calling this a thought provoking film about the politics of genetic splicing, you are wrong. Very little, if any actual science comes even remotely close to what was portrayed in this film. Along with this, the plot was solely based on the poor decisions of a the lead woman to keep a hazardous creature alive because she wanted a child to control. This was supposed to be explained by events of her childhood, but the movie mentions this issue once, and then forgets it. This movie was made to be oggled at as the freakiest of all freak show movies, but even fails to do that by being tiresome for all but the last 10 minutes. Please, no sequel."
    },
    {
      "rating": "9",
      "text": "Good stuff. An in your face provoking film."
    },
    {
      "rating": "0",
      "text": "Absolutely nothing works in this movie. It's unredeemably bad, so bad that I am shocked that anyone gave it a good review."
    },
    {
      "rating": "3",
      "text": "This movie failed on so many levels. It started out faily strong and compelling, but fell apart once the plot started bobbing and weaving. I wanted it to be a good movie. it was like seeing your favourite team get slaughtered. The acting was well done I thought, but the direction and the way the story unfolded failed miserably. Slightly entertaining, but unless you're bored out of your mind and have a 20 spot to burn steer clear of this one."
    },
    {
      "rating": "8",
      "text": "Not a bad film, just not great.  It reminded me of a classic 80's horr film that started out very strong and then moved just slightly too far from it's initial promise,  Good? yes, Great, no.  A little to ham-fisted in it's drive to discuss the implications in genetic manipulation, while still telling an interesting story. Worth seeing at least once."
    },
    {
      "rating": "7",
      "text": "Smart and funny pretending to be dumb and serious and cranking the lunacy to 11. A ridiculous script and tonal clunkiness are well compensated by a genuine sense of overall wrongness and transgression not seen since Cronenberg's venereal horrors. This mad scientist, my-god-what-have-we-done creature feature will make you gasp and thoroughly creep you out. And I'm not talking about the \"scary scenes\" or inter-species sex/rape/incest interludes. Not quite in the league with \"Dead Ringers\", but miles ahead of fluff like  \"Species\" and most of the CGI driven contemporary SF/horror films."
    },
    {
      "rating": "3",
      "text": "its like  the movie spieces except not even near as good as that movie was. its basically 90 min of absoulutly nothing going on then in the last 10 min some thing starts to happen but by then you wont care and just want this mindless dribble to end ."
    },
    {
      "rating": "3",
      "text": "I thought that this was going to be some type of scary, suspenseful sfi-fi creature flick and was very disappointed to find out that it was just a boring, un-scary, STUPID movie. Believe me a (3) rating is quite generous, the main characters were bland and the majority of the movie was about a couple of rouge scientists raising their pseudo human/kangaroo/bat/fish creature in a barn as their own child. And if you start to feel like this is some type of ET movie halfway through, that will change when they have sex with their man made humanoid, like I said, STUPID. Some of the reviews that I read here said that this movie is funny or hilarious,  perhaps, if you are completely baked, don't waste your time or money."
    },
    {
      "rating": "6",
      "text": "What began as a truly interesting and unique piece of sci-fi somehow ended up an absurd mess of impossibilities.  It's as if the director decided to throw in every plot twist imaginable into the last half hour of the film.  As a whole, credit is due for the unique content but the atmosphere established throughout is spoiled by the insane ending."
    },
    {
      "rating": "5",
      "text": "I didn’t enjoy this film as much as I was expecting to; I guess I wanted better from the director of Cube. I felt there wasn’t enough character development and so I found it very hard to sympathise with either of the leads. It is alluded to that one of them may have had psychological problems as a child but this is just skated over and when it later becomes a major plot point it has lost all of the impact it might have had. I thought the performances were all right with nobody really standing out. I do have to give a little praise to Delphine Chanéac though for her portrayal of Dren though; it was more of a mime because there’s no dialogue, but I thought she did it well. Over all, a disappointing film that promised much but failed to deliver by the end. It all became a little too predictable from the point the cat appears on the scene; you *know* it’s going to end badly for the cat  what is it with filmmakers and cats!? Let kitty live! It might gain you an extra point!\r SteelMonster’s verdict: NOT RECOMMENDED\r My score: 5.2/10"
    },
    {
      "rating": "6",
      "text": "I thought this sci-fi/horror film was well done. Some parts were very disturbing which I like to see in a horror film. But for me it just kinda went on too long. But I enjoyed it very much and I would watch it again. But it's probably one of those movies where you can only watch once and think it's good. I give it a good and a MEH."
    },
    {
      "rating": "7",
      "text": "As a Canadian I can tell you that we are are much less prude like in our examination of sexual topics. This film bring Canadian deals with some weird stuff that I imagine makes audiences uncomfortable. That's why everyone is laughing I would suppose; they don't understand it or it makes them uncomfortable. I'm not saying it's a great movie, but it's entertaining and examines some weird/controversial topics that I imagine freaks people out. It's definitely an unsettling movie"
    },
    {
      "rating": "3",
      "text": "A really bad horror movie not one part of this movie will scare you. the plot is very weak and is so so., The climax is built very slow and the ending is very dissapointing dont go see this movie unless its free."
    }
  ]
}