{
  "id": 786,
  "title": "Split",
  "starring": [
    "James McAvoy",
    "Anya Taylor-Joy"
  ],
  "runtime": 117,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lli31lYTFpvxVBeFHWoe5PMfW5s.jpg",
  "categories": {
    "plot": 7.215686274509804,
    "acting": 7.564516129032258,
    "ending": 7.416666666666667,
    "soundtrack": 7.5,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 5.5,
    "action": 7.384615384615385
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Most of the negative reviews I see about this movie aren't about the movie itself; one guy was lacking sleep and blamed the movie for falling asleep during it and left a review about the movie while they clearly wouldn't have seen the movie if he was sleeping?. Only see this movie if you enjoy thrillers with that little bit of mystery. Everything about this movie is deep, and don't expect to be told everything. This is what I love about the movie. The ending, some people didn't like because it felt 'unfinished' but I suggest not thinking to much into it, because the ending (no spoilers) is meant to leave you thinking about it; not everything needs to be shown to you. I think they did a very good job with character development, and my god, James McAvoy played the different people very well, so well that you could tell he was someone else with a simple facial movement. Again, a negative reviewer complained about how they say he has 23 personalities, and they didn't show all of them. I dont think the point of the movie was to show all of them, I dont think the movie would have been as interesting if they had James play every single personality. They had the ones they needed, and who knows, maybe they filmed more personalities, but having to many characters, as we all know, can make a movie feel like a mess. I love the small cast. It really is a small cast, but it feels like there were so much more people because of how well James played the different characters. I really want to stress that this movie is meant to get you thinking, and not going to tell you everything. There is deeper meanings within the movie that made me and my girlfriend cry. Give this movie a chance before thinking about boycotting. It isn't a bad 'view' on people with this disorder. I think they gave a lot of respect to those with the disorder actually."
    },
    {
      "rating": "7",
      "text": "While Split is dotted by a few needless, cheap horror moments, the execution of it's interesting premise is generally outstanding largely due to director M. Night Shmalayan's skill for twisty narratives and James McAvoy's powerhouse central performance."
    },
    {
      "rating": "7",
      "text": "Is very hard to write a review of split.Is hard because the film is mediocre (Not bad or good in any sense). The plot is intriguing but shifts from a psychological horror to a supernatural one in a blink of an eye.The characters are both incredibly well developed (Kevin and Casey) and incredibly shallow (The two girls nobody gave a **** about).What makes it good? James McAvoy was outstanding, without him the film would be a 5/6 out of ten at its best. But McAvoy delivers one of the best acting performances i've seen in the last years. Just look at him. His facial mimics, body language, everything is great. And this while managing to give each of the various personality a well defined nature.To summarize this film:The film is mediocre but the acting is so good is worth seeing it. (Both McAvoy and Taylor-Joy performances)"
    },
    {
      "rating": "7",
      "text": "The one scene where Anya Taylor Joy's boobs jiggled as she ran was phenomenal. McAvoy is what you would expect, and performs his role superbly. Storyline is solid, but not incredible. This isn't the kind of movie you save onto your harddrive because it's good enough to keep. The 'plot twist' at the end came out of nowhere and confused most people, to my knowledge. A watchable movie, but not one you would watch a second time."
    },
    {
      "rating": "8",
      "text": "Shyamalan is back and the best he's been since \"Signs,\" which might not sound like all that much on its face. But considering that that film came out in 2002 and the fact that we've had a 15-year drought of Shyamalan mediocrity since then, even the presence of a passable film would have been a welcomed departure. Though \"The Visit\" this is not. This is quite the film, indeed. Yes, the twist is good (and I mean really, really good) but beyond that is a movie with a supremely well-crafted lead performance, incredibly solid visuals, and a surprising amount to say about the horror genre as it stands today. It's a movie that demands trust from its audience; trust that is rewarded in the film's pulse-pounding and ultimately revelatory final act. So please. Please go to the theater, vote with your dollar, and see this. Let the filmmaker know that we want more movies like these and not a \"Last Airbender\" sequel."
    },
    {
      "rating": "8",
      "text": "Split serves as an incredible showcase for James Mcavoy's talent, and creates a slow-moving, yet horrifying thriller that relies on the audiences' devote attention to detail for it to all make sense in the end."
    },
    {
      "rating": "7",
      "text": "This movie has one good thing going for it: potential. The plot has so much potential to have created one of the best/strongest movies ever. But the movie didn't fully realise it's potential. It wasn't bad by any stretch but it wasn't as great as it could have been. I hope if there's a sequel that they do better. The movie needs more action (by action I don't necessarily mean fighting and all but faster paced scenes), better acting even from supporting characters and tighter execution. Could have been a 9 or 10 but a 7 would have to do."
    },
    {
      "rating": "7",
      "text": "Split is terrifying and mysterious on the most part, but once the mystery fades, the true psychological horrors the film presented the audience with disappear. Regardless, it is a thrilling movie and the first two thirds are particularly engaging."
    },
    {
      "rating": "8",
      "text": "Razor-sharp film-making from M Night Shyamalan with an excellent central performance (or should that be performances) from James McAvoy. Definitely a return to form."
    },
    {
      "rating": "7",
      "text": "M. Night Shaymalan is offically back and as good as ever. Split is definitely his best movie since Signs. Not only is it the best Shaymalan movie in years, but it is also one of the best horror movies of the past few years."
    },
    {
      "rating": "7",
      "text": "M. Night Shyamalan was lost in what we thought was an inescapable hole of awfulness. Then came the visit and even though it was far from a great movie it showed signs of life, and glimmers of hope for a return to form. Split is Shyamalan's full fledged rebirth. It may not be as deep dramatically or as nuanced or emotionally mature, etc as his first 3 films were but it's such an extreme improvement on such disasters as the Happening and After Earth that it's almost amazing to think about. With an impressive, albeit somewhat campy, turn from McAvoy, another impressive performance from Anya Taylor Joy, creepy atmosphere, disturbing tiwsts, and impressively focused direction overall, Split turns out to be a very satisfying thriller. This is what we've been waiting for from Shyamalan for years and it's his most complete work since Signs. With his talent rediscovered I'm looking forward to what he'll do next and desperately hope he doesn't fall back into that dreaded pit of mediocrity."
    },
    {
      "rating": "8",
      "text": "Im shocked. Not in a bad way I'm shocked that shamaylan made another great film after years of crap and unnecessary cartoon movies (I'm looking at you the last Airbender) yes this film is great. It is well acted especially James McAvoy's main antagonist. The personalities displayed here are of a high caliber and feel real and downright disturbing at times. The antagonist Kevin is a haunting human being with 23 personalities who kidnaps 3 teens and well it doesn't go well. I won't spoil anything but it's a very dreadful time for the characters but a downright interesting and creepy journey for the viewer. I highly recommend this If you love thrillers and psychological horror. the story, back story, acting are all amazingly done and well worth experiencing. One of the best films shamaylan has ever created proving that he too can evolve as a director and move past his mistakes. 8/10"
    },
    {
      "rating": "0",
      "text": "M. Night Shyamalan should have stayed, \"retired.\"This film is simply disturbing, especially the scenes depicting two of the girls being eaten by the, \"beast.\"Apparently, it is not okay for Producer/Directors to make edgy jokes (James Gunn) but it is fine for people to make movies about terrified people being eaten by cannibals with D.I.D.Hollywood/society is sick.I don't know why people want movies like this."
    },
    {
      "rating": "8",
      "text": "Split is a thrilling thriller that offers some originality to the the genre. The story itself is told very well and in a unique way. The main characters are very interesting and all have something about them that makes them interesting. The main character, Kevin, is the best out of the bunch as the acting and writing for his character is very interesting and intimidating. Casey is a girl who's had a trouble and abusive past and is smart and calm enough to know her way out of a situations. The therapist herself is a character trying to help, but also figure out the problems and a solution to Kevin's mental state. The other main female characters don't really get that much time or development to make us care, and their acting isn't the best either. The plot itself is very interesting, as each act builds upon itself and creates more tense moments. The way the film is shot is very dynamic, with each frame capturing the moments in the film very well. Split is a very interesting movie, and is m night's best film since sixth sense,and I would give it a watch."
    },
    {
      "rating": "7",
      "text": "Split is the latest movie from M. Night Shyamalymalmaylmalmalmya, and though it is not his worst work, it is just...okay.Acting: James McAvoy was fantastic, delivering a memorable performance. It takes a lot to pull off multiple different characters, and he pulled it off amazingly. Otherwise the acting was just okay. The main girl was fine, but one of the two girls wasn't very good, and other almost felt like she was over-acting a bit.Characters: I wish that either we spent more time with all 23 personalities, or there were less of them, because we only got to spend a lot of time with about 5 of them. Otherwise, there's not much development going on besides the main girl and a little bit of McAvoy's character(s). The other two girls have nothing to do besides wearing nearly nothing and freaking out.Plot: The plot is pretty basic, but I thought the movie did a great job of building up suspense at times, mostly towards the beginning as it started wearing off towards the end. Even the few jumpscares that were spoiled by the trailers still got my heart beating. Even the initial capture of the girls got my pulse to speed up, even though I know what's going to happen.Script: Meh. Probably should have had an actual scriptwriter write the film. But it doesn't drag the movie down completely. It's passable at the least.Directing: I think it is better for Shyamalan to be working on lower budgets in his recent films, as he becomes a bit less ambitious and doesn't try and show off. Of course, a twist is still present though not too satisfying, but it feels like Shyamalan is trying to take a step back. All the money can go to your head, especially after his initial successes.Overall, Split is successful at creating suspense and tension, but is otherwise not terribly memorable, and I know some people who are upset at the way they portray mental illnesses as bad and dangerous, especially DID (Dissociative Identity Disorder)."
    },
    {
      "rating": "7",
      "text": "Overall: 7.5/10James McAvoy: 8.5/10This thriller and a little hint of horror movie lightened up my night. That super satisfying feeling after watching such a good movie in the cinema was all I could feel stepping out of the theatre. I'm very very very overwhelmed by the acting of James McAvoy. I gave him my invisible standing applause throughout the movie. He incredibly nailed the role of an identity dissociated man. It's beyond words.Meanwhile, the plot, is enough. Not super good, but okay. It doesn't really explain the real issues there. There are a lot of unanswered questions that I know I won't get the answers of, and that kinda makes me unease.Do I recommend this movie? **** YES."
    },
    {
      "rating": "8",
      "text": "This is a thrilling movie with a good story and weird/quirky characters. Since it's based on the multiple personality disorder it gives a fun spin to the already juicy story. The makeup and costumes aren't very good though, it looks like it was made with a kids makeup kit. Nonetheless, it's a good movie."
    },
    {
      "rating": "7",
      "text": "When we talk about M. Night Shyamalan, most people think about sixth sense. Others think about Lady in the Water or The Happening. I think Split has a little bit of both. It has the quality from Sixth Sense and the humor (internationally this time) from The Happening. The plot is about a guy who has multiple personality disorder kidnapped three girls and plans to sacrifice to “the beast”. This is as much as I can say without spoiling the plot. The less said the better about the plot. There is also a psychiatrist who is played by the crazy old lady in The Happening, who is trying to figure out the nature of the guy’s condition… ya there is a lot going on.I think what makes this movie stands out is the amazing performance from James McAvoy and Anya Taylor-Joy. For me, a good movie should have some characters I care about and this movie have it. McAvoy’s performance can be categorized as over the top which reminds me of Paul Giamatti in Lady in the Water. But here it works. His character feels funny at first and then gradually it started to be downright creepy. I think the best thing about his performance is that every personality feels almost realistic. The scariest one is his lady personality. You almost feel like he is actually transgender. His calm and almost unnerving attitudes to the kidnapped girls is creeping me out. There is no action and no over-the-top emotion but there is something there that makes whole tension unbearable. You never know what he is going to do next. Bottom line: James McAvoy will make you forget everything about the roles he played before. Taylor-Joy’s character is someone you are worth to root for. She had a really messed up childhood which is described throughout the film. She is the victim even before the kidnapping and you sympathize what she has been through. She is trying to escape smartly and tried to gain the trusts James McAvoy’s character. She is extremely successful in making a very understandable character and she is perfect for someone who you want to root for. Considering she is a model before acting, I think she did pretty great and I hope to see her in more roles.    I love the execution of the film. The setting looks very rough and reminds me of those rooms you saw in cheap B-movies. It gives you a feeling of cluster phobia and you feel like you are being trapped in a basement and there is no stairs and doors that you can escape. It gives you sense of dread and despair. However, the big problem comes from the middle. They spent way too much time explaining how did the split personality happens, which (I won’t spoil) is really stupid, you know like all the M Night films. Most importantly all the other characters are not interesting enough, especially the other two girls kidnapped, their acting were terrible. But the third act saved the entire movie. This is one of the best nail bitter horror scene I have seen in recent year. No jump scare and no other scary stereotypes, it just pure scare. The music and the lighting emphasize the unbearable tension and you are always on your seat. In the end, this is one of the best M Night Sharmalan movie. It is a very enjoyable and tense movie but not without its flaws."
    },
    {
      "rating": "7",
      "text": "So I saw Split in January and it was good. It is your typical bewildering thriller. The only reason this gained so much attention is because Add to dictionary directed it. It is not a bad movie, but it is not Shyamalan’s best. This is his return to form, but this is not his best. Shyamalan directs with subtlety and it does not fail in this movie. There are so many subtle moments in this movie that could really benefit from a second viewing. The the performances are top-notch especially James McAvoy. It is heart-pounding and intriguing like any other thriller and in fact more bewildering than normal thrillers. However, the plot may be too loose for some and the movie lacks focus on certain ideas. The movie really wants the dark tone to be added with comical levity which at times work but at other times do not work. There are some really awkward moments both in a good way and in a bad way, but I really do not want to give anything away because I think people should watch it. It is not perfect, but it is definitely worth a watch. I really like it to the point of 8/10, but I decided to give this movie a 7/10 just for some minor inconsistencies. Overall it is a good movie."
    },
    {
      "rating": "7",
      "text": "This was a very intense movie. We were drawn to it by the commericals of James McAvoy portraying the different characters in the trailer. I think he did an amazing job of carrying the movie. When I first saw M. Night Shymalan's name pop up all the past notions of his failures started making me think this was about to become a terrible movie but he managed to pull it through. Overall a pretty good movie"
    },
    {
      "rating": "7",
      "text": "Impressive movie with a perfect ending. The story itself made me attracted from the first minute and the representation of the 23 personalities is very good. The 'beast' part made a bit disappointed though because i think it exceeds a bit the way he get 'transformed'. But i think this movie deserves a positive note in the end and i would recommend it to anyone."
    },
    {
      "rating": "8",
      "text": "Spoilers Ahead. You have been warned.First Viewing: A fresh horror film with some unexpected turns. After my viewing I have to say it was a solid 8/10 with some of my expectations blown away. Now upon the first look of this movie I turned it away thinking it to be a bottom tier quick buck horror film until I noticed some positive reviews and I have to say that I was quite impressed. The movie managed to entertain while giving a unique insight into the mind of Kevin. An astonishing performance by James McAvoy who previously has never before in my eyes been that capable of an actor. It was enjoying to see him spread his wings and play a unique role that an other actor might have squandered. It it interesting to see Night's movies on the upswing with his recent string of movies tanking at every turn. It seems Night has rediscovered a bit of what has made his previous movies so great, though I won't say this movie was perfect it has some issues as do most but it was still refreshing to watch. As for the credit scene with the nod to the movie being inside the same universe as Unbreakable was a true unexpected mind blower. I can only hope this is a promise for a sequel which some fans have been desperately craving. I really home Night keeps this trend with making better movies and we don't see him fall back into the pits of Avatar and The Happening. This concludes my review and for those who are thinking of seeing this movie I would recommend watching it. Though I would advise not to think too far into it and try to remove your suspension of disbelief and you will find it much more entertaining."
    },
    {
      "rating": "6",
      "text": "An original plot and fair cinematography. Really good script and great pacing. Casting could have been better. The film could have been far better with just a few minor changes."
    },
    {
      "rating": "7",
      "text": "From the very first frame of this film, I felt inescapable dread. It became clear that things would only escalate, especially after Split quickly got through the setup in the trailer. With Kevin (James McAvoy) kidnapping the girls practically immediately into the film, Split allows itself to quickly get into the unknown. It got past the setup and now drops three young girls - Casey (Anya Taylor-Joy), Claire (Haley Lu Richardson), and Marcia (Jessica Sula) - into the lion's den and leave them no way of escaping. From there, M. Night Shyamalan is free to explore the possibilities of this unknown building and the incredible mind of Kevin, a man trapped inside his own body with 23 distinct personalities. Frequent warnings about \"The Beast\" only add to the tension and the end result is a film that leaves your stomach churning for nearly two hours.That said, while the thrills and horror are top-notch and akin to films such as The Silence of the Lambs in that is not a film about viscera, but rather an exploration of the mind of a mentally ill man, Split is not explicitly a horror film. It is one that finds horror in the situation of the girls, but instead of focusing on them, the star here is Kevin's mind. The true thrill and insanity of Split is derived from his mind, rather than the situation the girls find themselves in. The latter is often quite derivative and predictable, with obvious implications regarding a gun and Casey learning to hunt proving far too overt to actually become effective. The plot itself is relatively straight forward as these girls simply are trying to get out. Once the film really hones in on Casey and her back story, it becomes equally clear that it will come down to a face-off between her and \"The Beast\" to escape. Thus, the more straight out thriller/horror elements really do not provide much to chew on. It feels merely superfluous to the real show: Kevin.With 23 personalities trapped inside his mind, Kevin is a man with a lot of walls up. One personality, Dennis, is brutally evil and has OCD. He is also responsible for kidnapping the girls to sacrifice to \"The Beast\". Others make appearances throughout the film and some are entirely stable, some are diabetic, some are women, and some are even young children. He is a man that is thoroughly fractured and, unfortunately, the bad personalities are gained the \"light\" and preventing Kevin himself and the more adjusted personalities from being active. It is in this playground of personalities that Shyamalan truly as fun, as he creates great mystery as to who is actually in control of Kevin's body and what they may be capable of doing. While often quite scary, Shyamalan saves it at the end from being a film that demonizes the mentally ill. Upon saying Kevin's real name, Casey gets to interact with the real Kevin. Trapped in September 2014 within his own body, Kevin begs her to kill him before he loses control again. Tragic, heart wrenching, and entirely moving, this sequence shows that while Shyamalan finds fear in the illness suffered by the mentally ill, he does not demonize the mentally ill themselves. Rather, he paints Kevin as a sympathetic figure who desperately needs help and is trapped just like the girls kidnapped by Dennis.The sympathetic portrayal continues in the explanation of Kevin's past. These personalities were created by his mind to help cope with the mental and physical abuse undertaken by Kevin's mother. In one terrifying scene, we get a point of view shot of Kevin hiding under the bed as his screaming and irate mother calls out his full name and closes in with a weapon to harm him. However, just as the calm and docile personalities are byproducts of Kevin's coping, the evil ones - Dennis, Patricia, and \"the beast\" - are all byproducts as well. Recognizing weakness, the mind has created these darker personalities out of pain. \"The Beast\", for example, originates from a train because his father left on a train and never returned. As such, all 23 personalities are coping mechanisms and methods by which the mind tries to protect Kevin from further mental strain and hardship. It is via this reveal that Split takes on a very depressing tone as though we see the damage he can cause when \"fully evolved\", it comes from a place of pain and agony. Though he must be stopped, it is hard not to shed a tear over the agony he still endures while trapped inside his own body and buried beneath coping mechanisms.However, this portrayal does explain his approach to the girls. Claire and Marcia are the true targets. Having stalked them for weeks, he had decided upon them because they were impure and perfect for the Beast to consume. They were impure because they had never suffered pain. In his messed up post-traumatic state, Kevin's personalities have reasoned that to reach purity, one must suffer. Thus, he does not kill Casey since she bears the scars of either self-harm or her Uncle raping her to this very day."
    },
    {
      "rating": "7",
      "text": "I almost did not see this movie because seeing people imprisoned by anyone is hard for me to watch.  However, this movie was so well made and so interesting, it drew me right in.  James McAvoy should be an Oscar contender next year for his portrayal of a man with 23 distinct personalities.  MNS has finally made a movie that deserves the early acclaim he won for his first few movies (although I did enjoy The Visit).  There is plenty of suspense and nail biting moments and some cool surprises as well.   This movie is not for everyone.  But those of us who enjoy a good scary movie will enjoy it."
    },
    {
      "rating": "9",
      "text": "This movie had everything that I was looking for from action to a little hint of horror, that was believable. I think that M. Night Shyamalan has done it again. Split is the best movie of 2017 so far. It did have one problem of having too much different personality sometimes it was hard to keep track of them all."
    },
    {
      "rating": "10",
      "text": "Some have compared this with \"Unbreakable\". It's nothing like it. That one was a sleeper by comparison.What makes it so special is that the whole story is solidly based on actual science.And doesn't label people who suffers from this mental \"disorder\" as just freaks or weirdos. Or the usual cliches.It goes way beyond that. Good performances from all actors, terrific story. What more could you ask ?It left a deep impression on me. It's one of those movies that you remember for a long time. And  makes you wonder. What is the human mind capable of ?"
    },
    {
      "rating": "9",
      "text": "A very  great mind boggling experience. Amazing sci-fi and I loved it to a point where I even started asking questions whether it is possible and I have to say great split performance act by James McAvoy (Split, I know) Great film and spectacular directing and the cast was brilliant. 9/10"
    },
    {
      "rating": "7",
      "text": "The movie doesn't end in the best possible way, but the mood and the set-up are superior to most everything he's done in recent years. McAvoy is amazing, as is the indelible Betty Buckley.  Loved her in \"8 is Enough\" - can't believe she's still kicking so much ass. Joy is also really good - her career seems to be off to an amazing start."
    },
    {
      "rating": "10",
      "text": "M. Night is back, and I'm glad. This is a return to form. He's created something that rivals The Sixth Sense. This movie is creepy, and mysterious. Surprising. The best psychological thriller I've ever seen. But I won't get into details about it, because it will spoil it. Just go out, and watch this."
    },
    {
      "rating": "7",
      "text": "After making numerous amount of failures, Split breaks the line and it's unusual for Shyamalan to make such a big returning point in movie careering from terrible movies to great movies. Forget the fact that this is horror bait, it's actually a welcome back sign for M. Night Shyamalan."
    },
    {
      "rating": "2",
      "text": "James McAvoy and Betty Buckley gave fine performances.  The plot isn't worthy of them.  In addition to a script that heavily relies on the convenient and popular fears of Disassociative Identity Disorder, it disregards any type of sensible behavior.  While teenage girls might be stupid enough not to immediately open their car doors when a stranger gets into their car and their dad vanishes, the absolutely astonishing \"haha dude good joke\" when one of the girls gets her hands on a walkie-talkie - I could no longer suspend my disbelief and began judging the script much more harshly than I wanted to.  When the doctor goes to see her patient, at night, without anyone else - and then is killed!  But when the same girl DOESN'T shoot him in the head, I was done. Kevin Wendell Crumb's weakness is a shout out to Rumpelstiltskin - and maybe the girl is a survivor-damaged-Beast like he, but then to link it to Mr. Glass and Unbreakable?!  How many things do you want one movie to be? A commentary on child sexual abuse buried within a horror film with callbacks to fairy tales that's also a commentary on social norms and mental disorders - and a sequel to a comic book hero/villain.  Holy f*ck - choose one story telling device."
    },
    {
      "rating": "7",
      "text": "Its no Sixth Sense but Shyamalan gives us lots to ponder in his latest thriller. Although admittedly, the entire premise would have fallen through if not for a legendary performance by James McAvoy."
    },
    {
      "rating": "8",
      "text": "M. Night has created a new villain for our age and done a fine job setting up a very thought-provoking premise:  What if being broken makes you pure of heart? And what if once being broken you gained immense strength as a result? James McAvoy steals the entire film with a finely nuanced performance as a \"special needs\" patient in therapy, who we first meet as Barry. Betty Buckley provides marvelous support as his therapist, Dr. Fletcher, and whose patients have become her life and her world, leading her to lose her objectivity to a degree.  Within the plot, Shyamalan plays with a Jekyll and Hyde theme with a big twist:  \"You can be who you think you are\" sans the experimental potion used in the original Jekyll & Hyde story.  Several horror tropes are at work in Split, but I found it to be more of a psychological thriller, one with an extremely satisfying ending."
    },
    {
      "rating": "8",
      "text": "Lets start with the basic question, is it worth it? yes it is!, is not amazing, is not going to blow your head, but it is definitely a great thriller, i greatly appreciated that MNS dont try to force over your throat another \"wait till the end\" over the top twist and rather build it consistently through the narrative of the movie, it feels much more of a mature movie than The Visit for example, and give McAvoy the Oscar already, what a performance!, could have been from good to great with a better story telling around Casey, felt like a wasted opportunitty"
    },
    {
      "rating": "8",
      "text": "I was quite surprised with how I wasn't surprised how good 'Split' was. James McAvoy is one of my favourite actors and he shines, channeling Sally Field in 'Sybil' but also being completely charismatic playing multiple mentally unstable personalities. M. Night returns to form and has not made a film this strong since his 2002 hit 'Signs'. Funnily enough I was routing for every character and hoping that everyone could just get along."
    },
    {
      "rating": "6",
      "text": "So here we go for my first ever review on \"metacritic.com\". In the beginning I was pretty much amazed of this movie. How it started of, the story, absolutely genius. When seeing the trailer, I suspected that this is the movie for me to watch. But... Why do I give it only a \"six\" then? It´s what remained to be watched. Until that one point in the story line (if you watched the movie you´d know what I am talking about) it seemed like they wanted this to become more and more of an action-movie. A few spots pointed out on the story to develop that way indeed, but I didn´t think the people behind \"Split\" would realize it the way they did. In order to not spoil you I will only say that the ending does not go well with the movie. \"Split\" is not bad overall, but it´s also not as good as it should be. An alternated ending, if the scenes they made aren´t even more that just the \"ending\" would have been worth beeing rated 8 or even 9. I´ll still give them a \"six\" for the idea and because of \"Split\" having it´s moments and despite the massive deterioration towards the end \"Split\" is a somewhat well staged and the psychological way pretty scary thriller and it´d be unfair to give it less than 51% of the points, as Split is pretty enjoyable over all, despite the really disappointing \"genretwist\" I´d claim they tried to craft."
    },
    {
      "rating": "7",
      "text": "This is honestly the best film Shyamalon has made in years. It perfectly captures a blend of comedy, horror, and suspense with surprisingly good storytelling. There are some clunky lines and obvious exposition dumps at times though the film remains entertaining and engaging. There are definitely some shortcomings in the film such as \"The Beast\" actually being a thing and some bad CG being involved, the ending where it turns out it was all inspired by a zoo where the DID victim works, and the aforementioned exposition dumps/clunky lines. The good though is the lead's performances; McAvoy in particular is fantastic with switching between roles while being absolutely maniacal and Taylor-Joy does a great job as well considering her character's backstory and motivations. The biggest drawback on the movie though is the ambiguous ending as to what will happen as well as an awkward tie-in to Unbreakable which seemed odd and out of place to me."
    },
    {
      "rating": "7",
      "text": "It gets points for originality. The concept is remarkably well-executed and despite a familiar kidnapping aspect the movie really is unlike anything else out there. James McAvoy is absolutely incredible. I've always thought of him as an incredible actor, but here he goes above and beyond by giving us multiple fantastic performances all in the same film. It's not just the voices either. Each person he plays feels fully fleshed out and unique from one another. Even little facial quirks are brought to life by him.The tale itself seems to be a parable about human cruelty. The writing is mostly fantastic except for the fact that some of the characters fall into that predictable horror movie trapping of overstepping their ability and doing things that prolong the danger of the scenario when they could have ended things by just making the smart decision. The movie's real flaw though is a disappointing lack of true fear. There's a sense of tension, but nothing that will keep you on edge. What keeps you invested is the weirdness of it all. The mystery is inviting enough to keep you watching.M. Night Shyamalan is making his comeback. Whether or not he can keep this up following this and The Visit is to be seen. Split proves to be another reason of why we should risk it. It's not perfect, but it's a welcome dose of creativity and uniqueness. Plus it serves as a pathway into a sequel for one of Shyamalan's more celebrated movies. There's plenty of potential in the future for Shyamalan movies, but right I recommend you enjoy their present and give Split a chance."
    },
    {
      "rating": "8",
      "text": "The 24th's about to explode!The much needed break for the director Shyamalan. It has been over a decade since the last time he was lauded like this for his work. On the paper, it was a simple split personality disaster theme, but cinematically clicked so well. Firstly the performance of James McAvoy made this film a very success. I have seen his lots of films, but if I had to choose only one of his great, that's would be easily this one. A straightforward story, no complication to understand, or needed to explain everything it revolves. Then suddenly the final act turned into a different mode. With a twist, all comes to end.The three teenage girls have been kidnapped at the beginning. Following that, the victims do not know the situation, but makes a couple of bad moves, except one girl. As the film progress, many secrets revealed to us, particularly about the kidnapper. It all developed to lead in one direction where an unimaginable thing going to happen. How and what result it brings told in the following parts.The perspective of the story was not really a thing in this. That means it does not take sides, but gives you the option to choose. And most of the viewers would root for the weird girl. It was Anya, and she's having a wonderful career in early stage. Could becomes one of the best if she contributed all her performances in the same pace and intensity. The music was equally awesome. Created the perfect atmosphere along with the visuals. I could have not asked the better one. Best thriller of the year. You will be stupid to miss it out if you love films.8/10"
    },
    {
      "rating": "8",
      "text": "The drought is finally over M. Night Shyamalan has easily made his best film since Signs.  The film takes many different chances and with the film's phenomenal finale I'm happy to say the chances are a success. A-"
    },
    {
      "rating": "9",
      "text": "A solid script, amazing acting by James McAvoy and Anya Taylor Joy, and the sure direction of M. Night Shyamalan make Split a resounding success. Split really surprises."
    },
    {
      "rating": "7",
      "text": "Finally got around to checking this out and I'd say that this definitely a decent little comeback from M. Night Shyamalan. While it might not be enough to re-win over all of his passionate haters completely, I'd say it's got enough good going for it for the most part anyway, from James McAvoy's dynamic performance to the overall story and premise that for once isn't wasted potential (which is quite unusual for a Shyamalan film nowadays.) Overall, it's certainly no \"The Sixth Sense\", nor is it absolutely mind-blowing by any means, but McAvoy's committed performance and the story and it's often-enough intriguing premise keeps this well-above most of Shyamalan's past efforts, which I think says enough. I'd say it's also worth noting that the surprise cameo at the very end also manages to make things a little more interesting as well."
    },
    {
      "rating": "7",
      "text": "Split is a sort-of throwback film for M Night Shyamalan in that it recalls some themes and material found in some of his earliest films (especially his second film -  can't say too much).  What is different here is, there is no hokey or contrived surprise ending like in some of his weaker films like Lady in the Water and The Happening.  Split comes to an ending with a few loose ends still out there, but as with good entertainment, it leaves us wanting more.James McAvoy is tremendous here.  I would say, tremendous times 23 for the number of personalities.  He shows a lot of depth and some real solid acting chops.  So does Anya Taylor-Joy as the quirky and \"different\" protagonist.My main critique of this film is, frankly it was a little boring.  I like Shyamalan's pacing and I enjoy the way his films seem to have a rolling boil instead of a vigorous one, but this one lacked any big scares or moments.  The film can feel very claustrophobic at times, which is probably on purpose, but at the end, when the protagonist and antagonist have their showdown, the film just kind of peters out.There is talk of a sequel to one of his earliest films, and this one sets it up beautifully, but my wife hasn't seen that earlier film so she was a little confused.  I had to explain it to her without giving away the plot of the other movie.All in all, this is a nice return to the slow thriller for Mr. Shyamalan and I'm looking forward to where he goes from here."
    },
    {
      "rating": "8",
      "text": "Very intense drama. Probably would have scored it a 7 in generality but the main character's acting was so impressive I felt the need to upgrade the score."
    },
    {
      "rating": "8",
      "text": "Went into this movie with big expectations with James McAvoy and Mr. Shymalan directing. I felt like the first time since Signs we have finally gotten a great movie from Shymalan again and I sure hope he can continue this. James McAvoy wow! what can be said here? He gives the best performance that he has ever given and better not be left out of awards season. The story was absolutely original and I loved it! Anya Taylor-Johnson once again gives another stellar performance and should now be talked about as an up-incoming star. The other characters were okay. And that twist that i did not see coming. Shymalan proves once again he is the master of the twist finales."
    },
    {
      "rating": "8",
      "text": "McAvoy is absolutely terrifying! The second film in a short while where M. Night Shyamalan successfully has managed to scare the living hell out of us. The previous being The Visit of course.Now I know that there have been quite a few thrillers that make use of the Dissociative identity disorder or multiple personality disorder (MPD) and that at this point there is very little that can be done to truly surprise you. But by god M. Night has succeeded in a way that will put you on the edge of your seat multiple times. Not all the time mind you since the film dials down a few notches a couple of times. And this could make it seem the film drags here and there. In hindsight though it was M. Night teaching us what a master of horror he truly can be since he plays around with the tension to keep your interest peaked. Trust me on this that even when some of the plot developments may appear predictable it goes into different directions entirely. Especially at the very end of the film since it gives us a twist that is so meta that it will make your head spin. Very daring and incredibly effective. It is like he is saying, I told you that I am still very much on top of my game. But aside from this, the film in itself is incredible brilliant. James McAvoy was having a blast and he shows us what an amazing actor he is by switching up personalities like it's nothing. Still I do have to remark that Anya Taylor-Joy as Casey Cooke made a good impression as well. I did not even recognize her as she also was in The Witch. Split is one of those movies that does a lot of things really good and has you singing praise right after. But of course there will always be people hating on this film just because Shyamalan is involved. He does tend to make films that require you to suspend disbelief and have somewhat of an imagination. Doesn't always mean you have to like or agree with his vision because I am pretty aware he can make terrible films as well. Still Split is certainly is one of his better ones and deserves to be watched by many. So go forth ladies and gentlemen and enjoy yourselves. I certainly did!"
    },
    {
      "rating": "8",
      "text": "Who: James McAvoy, Kid James McAvoy, Woman James McAvoy, Sexual Assault James McAvoy, Metro-sexual James McAvoy, Artsy James McAvoy, Diabetic James McAvoy, and more!What: The comeback M. Night Shyamalan deservesWhere: A weird guy's basement; like most great movies.When (Can I watch again): You'll probably need to watch it immediately due to disbelief that M. Night Shyamalan actually made a good film post 2003. Why: This is M. Night's 4th best film, and gives me hope for the future of this once incredible director's career."
    },
    {
      "rating": "8",
      "text": "James McAvoy's committed performance in Split lead to his best performance he's ever given and one worthy of an Academy Award nomination. But it's not solely him driving this film, Ana Taylor-Joy was fantastic in this film as well and M. Night Shyamalan proves why he wasn't a one hit wonder. Through tense direction and suspense, he patiently takes the audience on a great character study that held my attention. And of course, THAT ending. Simply unexpected, I almost love this film."
    },
    {
      "rating": "8",
      "text": "James MacAvoy delivers an incredible performance as he switches between personalities in this well-directed and well-acted horror thriller \"Split\" which is as intriguing as it is thrilling. The director M. Night Shyamalan proves with \"Split\" that he is more than capable of making a good movie, despite the confusing flashbacks and ending."
    }
  ],
  "recommendations": [
    "the_machinist",
    "the_prestige",
    "gone_girl",
    "the_next_three_days",
    "the_accountant",
    "prisoners",
    "good_time",
    "maggie",
    "shutter_island",
    "the_invisible_man",
    "10_cloverfield_lane",
    "the_loft",
    "colossal",
    "orphan",
    "glass",
    "hereafter",
    "what_happened_to_monday",
    "a_history_of_violence",
    "no_country_for_old_men",
    "unbreakable",
    "tenet",
    "the_call",
    "a_walk_among_the_tombstones",
    "man_on_a_ledge",
    "predestination"
  ]
}