{
  "id": 176,
  "title": "Spotlight",
  "starring": [
    "Mark Ruffalo",
    "Michael Keaton"
  ],
  "runtime": 129,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "The true story of how the Boston Globe uncovered the massive scandal of child molestation and cover-up within the local Catholic Archdiocese, shaking the entire Catholic Church to its core.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rBkptJyAMqCfoMwUGQfCpubroec.jpg",
  "categories": {
    "plot": 8.352112676056338,
    "acting": 8.27450980392157,
    "ending": 8.5,
    "soundtrack": 7.0,
    "cinematography": 7.2,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An incredible film that generates the same momentum and excitement that All the Presidents Men did. Michael Keaton has never been better, and Mark Ruffalo is outstanding as usual.  I'll also mention the always terrific Stanley Tucci - he's brilliant here.  It's an important story, and the filmmakers handle it with care. In a way, it restores your faith in what quality investigative journalism can produce.  It's only November, but this is my movie of the year so far."
    },
    {
      "rating": "8",
      "text": "Very well made. Kept your attention all the way through. The story is a bit thin so you have to admire the top notch acting, directing, writing, and editing. If you believe journalists are not this altruistic and more agenda driven this will be a bit difficult to swallow. A bit political in that it focused exclusively on the negative and ignored the 94% that are good though I get why they did this for the sake of the story."
    },
    {
      "rating": "10",
      "text": "Incredibly directed, perfectly acted and beautifully executed, Spotlight is not only one of the best movies of the year, it is one of the most important movies I've ever seen.  This is a film with touchy subject matter that is shown incredibly well, being both understanding to the victims while still being impartial.  No one is a hero in this film, but Spotlight is a marvel to watch."
    },
    {
      "rating": "10",
      "text": "Spotlight is brilliant, devastating, and my favorite film of the year so far.  I can't say enough about the performances, each one is magnificent and Oscar caliber.  This film is a masterpiece mainly because it didn't get bogged down in thriller type elements.  There was no threatening letters, or people stalking them.  This stuck to the investigation and the continued links that are uncovered.  I can't recommend this film higher.  A+"
    },
    {
      "rating": "10",
      "text": "Often compared to All the Presidents Men, I would go so far as to say it is better. A thrilling movie that does not seek to make heroes out of the people it depicts but rather explores their faults as well. This movie is the perfect example of the danger posed by unchecked power for any institution. This movie is not only my favorite movie of the year, but possibly my favorite of the decade."
    },
    {
      "rating": "10",
      "text": "Great job of telling how the cold, cowardly Catholic church used the \"power of God\" to protect & move known pedo-priests, & they knew exactly what they were doing.  This is an organized crime movie, with the most gutless gangsters.\r It is chilling to hear the interview with Fr Pacquin, who readily admits to the Globe that he molested a bunch of children, as if it was no big deal because all the other priests were doing it, too.\r The movie shows how hard it was to get the truth out of the Catholic church, which intentionally protected these pedophiles, moving them to new locations where their evil wouldn't be known, never warning the new community, and sometimes not even warning their own Catholic leaders.\r This pedophile protection came from the top, from Cardinal Law, (and undoubtedly the pope) and was passed throughout the hierarchy, which worked like the Nazis, just doing what they were told, despite Jesus in Matt 18:6-14.\r You can feel the awesome power of the Catholic church, which they use at every opportunity to get away with evil, and never to help children.  The characters in the movie are sickened by the truth, and the intention of the organization to protect every child rapist, with no regard for the victims.\r This is an organized crime movie, without the honor of the mafia."
    },
    {
      "rating": "10",
      "text": "With a fantastic cast, coupled with a fantastic and powerful story, Spotlight proves to be the Best Picture Oscar frontrunner right now. Very entertaining and fast (for what sounds like a slow story). It is a fantastic film that is definitely worth seeing when it hits wide release. One of 2015's best so far."
    },
    {
      "rating": "8",
      "text": "The second best journalism-based film ever made after All the President's Men, Spotlight is a brilliant work that brings tension, drama, and true hardcore emotion, to a very sensitive topic that it handles gracefully. Director Tom McCarthy does not shy away from the hard-hitting and tough to listen to facts that surround this case. The acting here is phenomenal. Michael Keaton, Mark Ruffalo, Rachel McAdams, Liev Schreiber, John Slattery, Billy Crudup, Stanley Tucci, Brian d'Arcy James, Neal Huff, Paul Guilfoyle, Len Cariou, and the list goes on. Everybody who had any single line in this film was great. This film is built around the powerful performances delivered by these talented people and the passion their real life counterparts brought to their job, which really shines through. This film has power in spades and as the onion is peeled back, you are left stunned at this true story. A film that makes you overwhelmed and needing a long bath to try and cleanse all the grime of the world off of you, Spotlight is a great work that deserves all of its forthcoming accolades."
    },
    {
      "rating": "10",
      "text": "Amazing film, told with such nuance and complexity. As much as it engages and thrills the viewer, it observes systemic human moral frailty in ways that leave none of us untouched. Mark Ruffalo has never been better."
    },
    {
      "rating": "10",
      "text": "This movie is one of the best films I have seen in a long time. It reminded me very much of \"All the President's Men\" with its steady, sometimes slow, yet inexorable march toward the truth: the Catholic Church's cover-up of sexual abuse of children by pedophile priests. An editorial shake-up at the Boston Globe leads to the assignment of a team of ace reporters to investigate allegations that a few priests in the area may have abused children. The scope of the investigation widens as the reporters gather more information implicating dozens of priests and the Catholic Church in what turns out to be a massive cover-up. This movie deserves an Oscar nomination at the very least. I thought that Mark Ruffalo, in particular, did an excellent job.  In fact, the whole cast was outstanding. There are several heroes in this movie--only they wield notepads, cellphones and laptops, rather than knifes, guns or bombs--or arrows. I highly recommend this film."
    },
    {
      "rating": "9",
      "text": "Up there with \"All The President's Men\" as a Journalistic tour de force. Never over or underplayed, incredibly intelligent script with a slew of great actors willing to share the screen almost anonymously. Like an unraveling detective story about a subject we know too much about, and yet not enough. They walk among us still."
    },
    {
      "rating": "8",
      "text": "The only truly good and important feature film I've seen this year. Far from perfect, but solid writing and acting and a story that needs to be heard and paid attention to."
    },
    {
      "rating": "10",
      "text": "A master's class in pace and storytelling.  Stories about the media themselves can often feel too self-important, but this story about the special investigation team at the Boston Globe (Spotlight) really feels the way a story about storytellers aught to.  While I think the actors all deliver incredible performances (particularly Ruffalo, who will likely earn a nomination for Best Supporting Actor), it is most notable that they do not steal any of the drama of the story itself.  I thought the film would be too dry for friends of mine that only really like action movies, but the subject matter is just so gripping that even they liked it.  This will be a contender for Best Picture, for sure."
    },
    {
      "rating": "8",
      "text": "Who: Mark Ruffalo, Birdman, Roger Sterling, and the girl detective from the terrible season of True Detective as Sacha Pfeiffer\rWhat: A much cooler movie than anything I watched in 8 years of Catholic school\rWhere: Boston, MA; 272 years before the events of Fallout 4\rWhen (Can I watch again): When you want to annoyingly convince everyone all Catholics are evil, or when you want to annoyingly convince your parents why church \"isn't for you\"\rWhy: For better of the worse, this movie is gonna win best picture. You don't wanna be the person who goes to work the day after the Super Bowl not knowing who Left Shark is"
    },
    {
      "rating": "10",
      "text": "Lets just make predictions that this movie will definitely be nominated for an Academy Award for the most interesting plot I have ever seen. Enjoyed this film from beginning to end because it hits the spot where it gets you hooked in seconds. Every actor involved in this masterpiece did an amazing job. The intensity builds in even when nothing exciting is happening, but you still got that feeling and it's the goosebumps you get when something is up and you know who did it. Best Movie I have seen this year so far."
    },
    {
      "rating": "8",
      "text": "It's difficult today to grab an audience without special effects or a lot of action, however Spotlight succeeds.  The pace of this movie was initially a bit slow and the audience was less than enthusiastic, but as the story enfolded the audience grew less restless, eventually becoming riveted to the screen.  The movie depicts the hunt for a story within its own story, but the significance of whether the struggle to hunt for the facts or whether the facts themselves are more important is not well enough defined.  Had better attention been paid to the dilemma of reporting for the sake of truth versus for the sake of sales dollars this movie would have far more merit."
    },
    {
      "rating": "6",
      "text": "Interesting tid bit, I was a young Catholic boy when these events were taking place (Kind of). Started to fade out a bit when this overarching, all-power, deity can't decide whether gay marriage is a burden on the sanctity of marriage or all his children get his love equally. Or if murdering people grants me 15 infinity years on fire, or if I can come to his party bus if I just wish upon a star. Enough about questioning the Catholic religion let's talk about Spotlight. Going in I heard that this movie treated both sides, Catholic and reporters, equally. Also that it doesn't actually make you question the logistics of religion. Either that person was deliberately lying so I'd have a bigger reaction, or he accidentally walked into Alvin and the Chipmunks: Road Chip, without noticing. This film knows how to set up the sensitive subject, it attempts to  \"fairly\" represent the Church's side in the beginning. We start with one incident of sexual assault, or rather the aftermath. It's a short scene and it doesn't show a mother weeping over her victimized child praying for the blood of the Pope, while a priest twists his handle bar mustache. It's just one of the head whatevers, talking to the kids saying the priest will be moved and never seen again. This scene cleverly, and decietfully, shows this as a one-time incident that the church regrets happened. Then we arrive with our main reporters Mike Rezendes (Mark Ruffalo), Walter Robinson (Michael Keaton), Sacha Pfieffer (Rachel McAdams), and Matt Carroll (Brian d'Arcy James) they all work for a reporting group called Spotlight. They are known at covering large stories and getting to the bottom of them. This movie spends a lot of time with these characters, but it's really hard to remember their actual names. Honestly it wouldn't be that ill advised to say these characters mean very little, at least as their personalities are concerned. But that's kind of the point; as they get deeper in they find themselves being completely, and unintentionally surrounded by the disgusting reality of what the church is doing. They are simply representations of the actual spotlight crew that found the truth as been around every person. This films likes doing reveals, appropriately. There are several instances where camera and editing choices reveal the true damage or gravity of this situation. Sometimes a character will just blurt out commentary over the imagery either right away, or late. Spotlight members relationships with other people can also be spelled out too much. Specifically with someone's (trying not to spoil) blood relative.Also when a Cardinal does something dastardly, the film just kind of shrugs it off. Those things hurt the film in my opinion. But this film does certainly do a good job of not saying some things, for example the emotional state of the reporters is tracked very fluently. When a character feels panicked, rushed, angry, or scared you feel the weight because what the film is saying is dramatic, and you've been following the characters emotions the whole time. Those are all the things in the actual writing and directing I really liked, but there is another reason to watch this film. It's subject. Films like these are important things to watch, we can really take away a lot from it. This film could very well piss you off, if you are a devote follower of God. It tells you that the Church is corrupt, has too much power, and is blindly followed. Or at least at this time it was. It's hard to deny the credibility of the film when you see the final statistics on display in the film. It reminds me of two things. One, Spike Lee's Do the Right Thing. I don't think this movie quite utilizes it's full potential like Do the Right Thing, but they both say something that is tough to swallow. They choose to show the world the state it is certainly in. We aren't perfect but we can at least try to do something. The second thing I am reminded of is a quote from Stanley Kubrick's A Clockwork Orange. Alex is watching brutal violence, rape, and the Nazi regime and he says \"its funny how the colors of the real world, only feel really real when you vivid them on a screen\". I think he mean we can only learn from what is in front of us. Well that's it God Bless you."
    },
    {
      "rating": "8",
      "text": "Spotlight is a well made film. Nicely showing the struggle to expose the church combined with a great performance from Ruffalo. It doesn’t have the best cinematography and isn’t as riveting as All the President’s Men. Still that’s the thing with Oscar films they are well made but often not enjoyable."
    },
    {
      "rating": "9",
      "text": "Normally, the most one can hope for from a movie is that it is well made, entertaining and not stupid.  I realize that's a low bar.  But there are many stupid movies too.  Spotlight is an intelligent, thoughtful and important movie.  The cast is great.  Mark Ruffalo, who I usually do not like, was more of a distinct character than he has ever been in a film.  There is tension and a great payoff.  The only movie I have ever seen like this is All the President's Men.  Granted, that had the whole government aspect, but the Catholic Church, especially in Boston, is a quasi government.  Spotlight makes one sad that real investigative journalism is on the decline in this country, due to all of the corporate mergers of newspapers and their goals.  But it highlights an important and unique role the media can, and truly should, play in our society."
    },
    {
      "rating": "8",
      "text": "It's obviously award bait at the highest order...great cast, style reminiscent of '70's procedural and a heavy topic.  It's a good film and an illuminating one to boot, highlighting the cover up that permeate the Catholic Church as of late.  Will probably win a lot of awards, but will anybody see it in the cinemas?"
    },
    {
      "rating": "8",
      "text": "“Spotlight” is a MUST SEE for many reasons first being that if you think you know everything, or just a lot, about the cover-up regarding the Catholic church and the pedophilia priests this film will show you that you don’t. This is the best, if not better, newsroom movie since “All The President’s Men” and shows investigative reporting as it is done and what it accomplishes. The cast is an evenly matched crew of actors in their prime and though all should get an Oscar for best ensemble, there is a scene with Mark Ruffalo that will make you hold your breath not wanting to miss a word.\r Ruffalo is one member of a team consisting of  editor Michael Keaton who is the leader and Rachel McAdams along with Brian d’Arcy James who answer to managing editor John Slattery and they all have  a new Jewish, single, editor-in-chief  previously of New York and Miami Live Schreiber.\r This is not a pounding on the desk, “STOP THE PRESSES” but an even moving film of reporters doing research, asking inquisitive, invasive questions. There are quiet but very effective scenes like that between Schreiber and Len Cariou as Cardinal Law or the reporters interviewing survivors such as Neil Huff , or Richard O’Rourke, a priest who molested children but saw nothing wrong with it and in both cases no histrionics. Whether it is lawyers like Jamey Sheridan and Stanley Tucci or members of the church like Paul Guulfoyle or supporting players such as Billy Crudup and Michael Cyril Creighton among others all deliver the goods.\r Screenwriters Josh Singer and Tom McCarthy, the latter also directed, make a mystery and create suspense tale of a fairly well known Pulitzer Prize winning story that will get you deeply involved.\r “Spotlight” is definitely one of the best movies of the year!"
    },
    {
      "rating": "7",
      "text": "A journalistic fight against morality that, is more than a true & depressing story, its a need to know -- a story that’s well worthy of the Oscars. The realism & intensity of the plot is a stunning trace. It’s like a tense documentary with these diverse & well visualized characters that, tries to bring this incredible story to life, a story that will bring both suffering and horror to them. It’s a pure dialog-driven film that might be too plot-centric, and due to that fact are characters not given that much playground for any depth nor development. A fact-based drama like this flick isn't for everybody, but it is based on a true story -- just the realism, clever and flawless directing, might bring an Oscar to the ’Spotlight’.\r Personal rating: 75/100\rCritical rating: 96/100"
    },
    {
      "rating": "9",
      "text": "It certainly left me and everyone else in the theater with a strong feeling of uneasiness at the very end, however, that's what made it all the more powerful and notable for me! I was only somewhat familiar with the subject matter of the film going in, but that made it all the more interesting and informative to me! The script was clearly very well thought out, as the dialogue was crisp and engaging! Among many of these great aspects of the film, the best was easily the film's ensemble! It served as a great showcase for everyone involved, most notably Michael Keaton and Mark Ruffalo who both deserve supporting actor nominations at the Academy awards this year! Overall, despite some slow moments, they're easily made up for through the film's intriguing screenplay and fantastic acting! Definitely the best fact-based drama I've seen all year!"
    },
    {
      "rating": "10",
      "text": "Wow what a movie, after the disappointment of the Revenant and the Hateful 8, this movie will redeem your faith in the industry. A powerful story told with incredible tension, I was so disappointed when it finished."
    },
    {
      "rating": "8",
      "text": "I thought Spotlight was a really good film.  It takes a very difficult subject matter and handles it very well.  I think it could have gone one step further with it, but by the end it does feel like a very good movie.  To borrow a quote from Kyle Kallgren from Brows Held High, the bravery showing the film is not the reporters breaking the story, but it’s the holding on of the story until they have all the facts straight so that they can really make a difference and I don’t think I could sum it up better myself, hence my borrowing that quote.  It’s very well acted and its a decently written film.  It has a couple of issues, particularly with it’s early pacing and it does feel a bit too much like it’s deliberately aiming for an Oscar, but it’s a lot better than many other films that fit that category.  It’s a really good drama, however I wouldn’t recommend rushing to the cinema to see this one, you might want to wait for this one to come out on DVD.  It’s just good, that’s what I would say.  I’m not sure I would give it the Oscar for best picture, which I don’t suspect it will win, the bookies are predicting The Revenant at this point and they are probably right, but I wouldn’t mind if this one stole it on the day."
    },
    {
      "rating": "7",
      "text": "It may be too harsh and unclear for some, but Spotlight focuses more on its characters as people first before heroes and the result is a well-acted and written film, one of the best that 2015 has to offer."
    },
    {
      "rating": "8",
      "text": "Well made and well acted movie about sexual abuse in the Catholic church in Boston. It is both informative and shocking. However, as a movie, it moves along at a single pace, slowly revealing the story of how the abuse was uncovered, which is not such a big deal given this is how journalism work. However, the one knock on this film is that it lacks dramatic climaxes and anti-climaxes and a strong sense of urgency, especially towards the end."
    },
    {
      "rating": "8",
      "text": "When I first found out about this movie, I was probably reminded most of \"Michael Clayton\" or \"A Few Good Men.\" Based on the strength of the actors, and the intense nature of the topic, I expected a thrill ride. Interestingly, you won't find that here. \"Spotlight\" is very subdued. It features a Mark Ruffalo performance on par with his work in Begin Again, proving just how versatile he is and how passionate he can be. Michael Keaton is tasteful, graceful, and maybe even a little boring, but in a good way; it's as if his acting career has been completely reinvented after Birdman. Besides those two things, this movie wasn't what I expected it to be. Upon exiting the theater, I remarked this exactly: \"It feels like a great story about a great newspaper story about a terrible story.\" In other words, you might have felt much more suspense if you had read the Boston Globe article back in 2002. I assumed the point of this film was to tell the story that might have been drowned out by the attacks of 9/11, and I was right. With this, the underlying story feels more important than the film, but it is very well done and well acted. I would absolutely go to see it in the theater, but I would manage my expectations somewhat. If it's plot you're banking on, you'll be disappointed. However, if you love film for the aspects that make film great, you'll see a great film by choosing Spotlight."
    },
    {
      "rating": "9",
      "text": "Spotlight is an engaging and thought-provoking film with amazing performances and an excellent script. The actors were all amazing- Mark Ruffalo was great, Michael Keaton was great, Stanley Tucci was great... The list goes on! The scenes with the victims telling their stories were horrifying. It really opens your eyes. Of course, the movie might be too disturbing for some (and too talky for others) but if you like movies such as \"All the President's Men\" then this is the movie for you. A remarkable film, and one of the best of the year."
    },
    {
      "rating": "10",
      "text": "A grippingly powerful and intense movie, that has no problem holding your attention and hitting nerves for the entire movie. Handles the delicate subject matter very well with a perfectly chosen cast, particularly Michael Keaton and Liev Schreiber. Recommended for a one time viewing."
    },
    {
      "rating": "10",
      "text": "Bravo. Really good in every way. Intelligent. Restores my faith in American movie making. A Ron Howard or Clint Eastwood would have \"juiced it up\" with silly manipulative plot turns, overdrawn characters or predictable conceits. All of the actors seemed like they were chosen for their potential contribution rather than box-office appeal, and they were very good. The depiction of Boston is spot-on, for anybody who has lived there and knows the place. I think it is better than All the President's men. How could it have been better? I think slightly more development of some characters where you felt a bit more personal investment in them, and where you believed even more that they were personally affected by the unfolding events. Possibly a touch more exposition of the actual victims- the one interviewed guy was very working class and accurately depicted, but there could have been more. Mark Ruffalo works the hardest and is the best."
    },
    {
      "rating": "7",
      "text": "This movie is based on real events, it is about Boston Globe investigation of sexual abuses by Catholic priests, prying on young boys and girls, especially those from troubled families.\r I remember the huge scandal that story caused in 2002 when made public. The story is incredible, and it is the strongest part of the movie. Performance is strong overall. Many critics especially praise Mark Raffalo while to me he looked a bit too much and out of his character. I like him as an actor but not particularly in this movie.\r Cinematography, script, music are all quite decent. I completely agree with those who underscore the importance of this movie, since many young people do not know or remember events depicted there. Overall, it is a good movie but not a spectacular one as many critics claim. Nevertheless, I do expect to see this film in the Oscar’s list."
    },
    {
      "rating": "9",
      "text": "Spotlight was a phenomenal film regarding the ongoing scandal surrounding the Catholic church and allegations of molestation committed by its priests around the world. Spotlight was about delivering a message and garnering attention towards an issue that is in immediate need of it. There was no unnecessary drama, the movie focuses solely on the issue of the controversial story it tells so well. The emotional impact of this movie is so significant because of the reality that surrounds the actual cases that are portrayed. The film suffers from a few pacing issues during the first act but quickly recovers and doesn't slow down. The reality of the story being told is what makes this movie essential to watch. The importance of the the issues discussed throughout is never understated and every character plays their role to perfection in contributing to the unfolding of this unique and true series of events. Religion plays a role in this narrative as it naturally contrasts and opposes the scandalous nature of the cases highlighted in this movie. Religion and morality are constants throughout the film as they compliment the nuanced narrative and contrast the tragedy being focused on. Spotlight is an important film that deserves to be acknowledged for the role it plays in communicating the significance of a substantial and controversial story in need of attention and ongoing in the world even today."
    },
    {
      "rating": "8",
      "text": "Spotlight treats one of the biggest dilemmas that our society had been involved in and we are talking about something that day by day is testing the faith of lots of people, the magnitude that reaches is due to the falling of one of the most ancient pillar of civilization, religion. The movie develop two big topics, the first one is about predator priests molesting children and the hierarchy of the church covering up their actions; the second one is about investigative journalism and how we has mankind depend on it in order to reveal conspiracy and abuse to ourselves. The mixture between both results on a thrilling plot, full with suspense and that certainly will make you question the church as an organization all the way up the pope. This incurable illness plus the ineptitude of church authorities left a mark of self-esteem problems, personality disorders, trust issues and even suicidal behavior on hundreds of people. It reaches a point when society looks at the topic as a failing to place children out of priests, and not backwards, it assumes that is impossible in the other way. With an amazing cast, highlighting Michael Keaton, Stanley Tucci and Mark Ruffalo, clever script, precise camera positioning and firm direction, this film hooks you till the end. PS. Thanks Spotlight of the Boston Globe for having the persistence and courage of revealing the reality of this manipulating institution as is the church today."
    },
    {
      "rating": "9",
      "text": "It's no easy task to take on a controversial story such as the one told in SPOTLIGHT. Writers Tom McCarthy and Josh Singer, along with the entire cast, respectfully and passionately honor the real-life heroes and the victims of this disturbing time. SPOTLIGHT is a subtle, but detailed, adventure through investigative journalism with true dedication to share a story and passion worth telling."
    },
    {
      "rating": "7",
      "text": "Spotlight isn't some groundbreaking film by any means but it is a well paced, strongly acted film that is  interesting. The best way to describe Spotlight is a Law and Order SVU episode from the view of journalism instead of law enforcement."
    },
    {
      "rating": "10",
      "text": "This was an incredibly subtle movie in the way it made you really feel the moral and emotional dilemmas of the various characters without resorting to grand gestures or shocking revelations. While many movies on such a topic would rely on the viewers disgust with these predators, Spotlight in fact all but ignores this side of the story, showing the viewers the respect of assuming they already know how terrible child abuse is. Instead they focus on the way the story came out, how it remained hidden for so long, and even manages to make you see it from the point of view of those who were part of the cover up - creating an understanding without the necessity of sympathy. Masterfully done."
    },
    {
      "rating": "10",
      "text": "Must watch!! People, don't ignore this movie! This is not a movie against religion! It's a movie against the church! God is not a ginnie who makes your dreams come true! God is a way of life! God is not in heaven! God is in us! And going to the church won't remove your sins and won't make you a better person! The priests are also humans! Or... are they? :D Just kid'n. Watch this movie! A true masterpiece with great message to all journalists, priests and to the system!"
    },
    {
      "rating": "9",
      "text": "Spotlight handles its sensitive subject matter deftly, treating the victims well and not glorifying the heroes actions. The film itself is engrossing from start to finish."
    },
    {
      "rating": "6",
      "text": "The material for the movie was great -  a story worth telling, but it was so disappointing.. It felt almost like documentary movie in some sense, but it lacked facts and evidence material. Most actors were flat, Keaton seems back to his own routine after good performance in Birdman last year, McAdams was like always the same and not convincing at all. Only Ruffalo put some good effort into his role. Overall very shallow and boring movie, it doesn't give any value to the viewer from cinematic perspective."
    },
    {
      "rating": "9",
      "text": "Spotlight ( 9 out of 10)  Everyone has pet peeves when it comes to movies. We hate romantic comedies based entirely on misunderstandings, we hate horror films where no one's cell phone works,  or we simply hate movies that have either the word Adam or Sandler on the poster.I hate true story movies that simply make things up. You know the type. We need a bad guy so let's take a real person and turn him into a racist (Hidden Figures), a murderer (Titanic), or a woman (Patch Adams). We need to condense the timeline and change real historical events (Oscar-nominated Hidden Figures again). We need to change the character's sexuality so modern audiences can relate (The Danish Girl). We need facist slaveholders to talk about democracy and freedom (300). And the list goes on and on. This is without even mentioning Mel Gibson historical dramas that might as well have dinosaurs wandering through them.One of my other pet peeves? Movies that take place in an office or business world made by people who clearly have never spent more than a day working in one. Like ahistorical true stories, this is ripe territory for rage. We have the office politics of Catwoman’s evil beauty cream manufacturer. Not to be outdone the less said about how Wayne Industries is run ( a publicly traded company mind you) in the Batman universe the better. It isn’t just superhero movies either. Romantic comedies often need a trip to HR and no making everyone an architect does not solve that. (Seriously do these movies even know what architects or museum directors or magazine publishers actually do during their work day?)Spotlight easily could have fallen into both these traps. It simply doesn’t. The timeline is correct. The discussions between professionals sound well professional. There are no made up heavy’s to create drama, no fake romantic love interest, no surprise terrorist attack. Okay, it does have the last one but in all fairness, the movie’s timeline starts in August 2001 and runs through the end of the year. But even in that moment, the movie handles it with intelligence and in a realistic manner. There is a calmness and a professionalism in this movie that is refreshing. It rings true in both the big and small things. It is one of the best films I have seen this year."
    },
    {
      "rating": "8",
      "text": "Spotlight is one of the most interesting films of 2015. Spotlight is a film that has gone somewhat under the radar so far but will surely gain some attention around Oscar time. This may even be a potential Best Picture film. The cast in Spotlight will be what draws you in. With stars like Mark Ruffalo, Michael Keaton and Rachel McAdams involved its hard to ignore. Spotlight is the story of a Boston Globe crew who looks to uncover the cases of child abuse by the catholic priests. For a film that deals with such heavy subject matter it does very little to boast itself up. The crew of reporters are merely doing their job so they really do not get over dramatic or really appear to be telling a biased story.\r Tom McCarthy has just made a complete 180 with this movie. It has only been a year since the Cobbler, one of my personal least favorite films of all time let alone the year. He redeems himself with this true treasure. I love a good comeback\r Now the cast is excellent although there is really not any that truly stand out. The ensemble really works well for this story, but I'll be shocked if we see Oscar nominations for these actors because there is no one who really takes the lead. Mark Ruffalo has truly done everything this year. He's been comedic with Infinitely Polar Bear. He's been a box office draw with Avengers: Age of Ultron and he may be the only actor in the film that gets Oscar consideration. To me he was the stand out. Michael Keaton shows that his comeback role in Birdman was no fluke. Not only is Keaton back but he is better than ever. Then you have Rachel McAdams who shows some dramatic chops and it seems like she becomes more and more dependable as her career continues. Liev Schreiber plays the new editor for the Boston Globe and I thought he was excellent. I can only wish that he had a heavier involvement because I think that it was the best that I have ever seen from him.\r Spotlight is a film that needed to be made and now the world just needs to realise that it needs to watch it."
    },
    {
      "rating": "7",
      "text": "Methodical.\r I don't know if this is a great movie. It has great acting and a good story but it was more like homework than entertainment. You literally get to watch as a group of reporters methodically (and tediously) put together one of the most important stories of the 21st century. I was fascinated throughout but it might read as dull to some less inclined to pick through the details."
    },
    {
      "rating": "8",
      "text": "'Spotlight' A backstory in investigative point of view of the journalists aiming their weapons on the Boston clergy. This movie is highly appreciative for its written work. Kudos to Tom McCarthy and Josh Singer who provided a very interesting screenplay. Initially, it is slightly boring with random dialogues and same old uninteresting direction and camera work, but as the time passes one can get highly involved in the movie due to its arresting screenplay and top notch performance from all the actors namely Mark Ruffalo, Michael Keaton, Rachel McAdams, Liev Schreiber, John Slattery and Stanley Tucci. Music by Howard Shore is pleasant and also cinematography, editing and production design etc is up to the mark. Keeping all the controversies aside, it is one of the top three best movies of 2015. I predict this movie is going win Oscar for its original screenplay. So don't miss this..."
    },
    {
      "rating": "9",
      "text": "This is easily one of the best live action films of 2015. At the end of the year this movie will likely get a lot of Oscar attention, and it truly deserves it. Spotlight holds nothing back, features an ensemble of amazing performances, and tells a haunting true story. This story is recent enough that many people probably still remember, but old enough that many people will probably find it educational.\rPerhaps the film’s greatest strength is it’s story, which is incredibly dense with information. Not to spoil the film, but to give context the film is about a large scandal involving the Boston Catholic Priests in 2001. The story is so dense that it would have been easy to hold back information or gloss over plot elements, but somehow the filmmakers behind this film were able to fit it all into the film, in just over 2 hours. The film is unapologetically real, despite the occasional moments of theatricality, which all films have.\rThe entire cast is magnificent in this film, lead by Mark Ruffalo and Michael Keaton. Both of which will probably receive Oscar nominations for back-to-back years. In a film that relies on a slow-burn approach, with a more emotional grip on the audience, the acting was paramount, and the entire cast delivered. It’s most impressive, because they are able to every moment and make it feel important through their portrayals. These performances also help to make the characters feel more real, and relatable.\rThe performances support one other major strength of the film, which is the haunting tone of the film. The film is scary in an very real way, as the film showcases that even in large hubs with millions of people, massive secrets can be hidden. At a time with drones, and widespread public mistrust it makes the film even scarier. It’s the haunting story and tone that helps elevate the acting, to form a truly great film.\rIn the end the film tells a relevant story that every american should know, without compromising its source material. Spotlight is a film so good that even the churches it condemned had to admit that it was great. The film will likely receive a lot of award recognition, and rightfully so, as it stands as one of the best movies of 2015. It’s a haunting film that tells a story so compelling and unbelievable it becomes a must see film."
    },
    {
      "rating": "9",
      "text": "Spotlight is a tremendous piece of film making that will make you go completely speechless with some of the scenes in this movie. Michael Keaton, Brian d'Arcy James and Rachel McAdams all gave superb performances, as it was both convincing and realistic with their reactions. But Mark Ruffalo was absolutely phenomenal in this movie and he stole the show.\r The director of this movie (Tom McCarthy) did the Adam Sandler film \"The Cobbler\". Now, let that sink in for a minute."
    },
    {
      "rating": "9",
      "text": "Can't dispute the overall rating.  Actually it is spot on. Probably more interesting to a Catholic audience of course.  Well casted with  Michael Keaton delivering his usual superb acting skills. Can't understand the 16 negative reviews. My advice is ignore them.  Well worth the price of a ticket"
    },
    {
      "rating": "10",
      "text": "Spotlight is one of the best films of the year. The film is filled with plot twists, has a stellar cast, and overall is a must-see movie that you do not want to miss."
    },
    {
      "rating": "8",
      "text": "Spotlight is shocking and engaging. The whole cast is bringing everything to the table here, especially Mark Ruffalo who had a great performance. This movie is sad and tragic but needed. Spotlight is a great movie."
    },
    {
      "rating": "9",
      "text": "Spotlight is a powerful drama with brilliant performances from Michael Keaton, Mark Ruffalo and Rachel McAdams, a well-written script by Tom McCarthy and Josh Singer, and a message that is still relevant today."
    }
  ]
}