{
  "id": 4617,
  "title": "Spree",
  "starring": [
    "Joe Keery",
    "Sasheer Zamata"
  ],
  "runtime": 93,
  "genre": [
    "Thriller",
    "Horror",
    "Comedy"
  ],
  "description": "Desperate for an online following, a rideshare driver has figured out a deadly plan to go viral and he will stop at nothing to get his five minutes of fame.",
  "releaseYear": "2020",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hJUA4wfvw0A6l3niOfxourqpERA.jpg",
  "categories": {
    "plot": 6.875,
    "acting": 7.75,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.5,
    "familyFriendly": 4.0,
    "funny": 8.4,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Hollow. Absolutely hollowSpree is a simple and mediocre mention of how in social media we're the directors of the life we choose to present to a fake world.This is about the life of a dangerous and damaged person but still is meaningless.It's neither satire nor criticism. It's just a reflection, so there's no surprise nor shock, because it exists.You can find the worst **** online and those are actually real.This could've been a short film and I think it would've created a better impression that way, because after about 25 minutes it's quite evident that its narrative resource wasn't enough to sustain a complete film."
    },
    {
      "rating": "0",
      "text": "The worst film ever. I've tried to watch but I gave up. So terrible. I want back my wasted time...."
    },
    {
      "rating": "0",
      "text": "What on earth was that? The worst film I’ve seen in ten years. That’s what. Absolutely woeful."
    },
    {
      "rating": "8",
      "text": "Really fun! Wish I could have watched it with some friends or in a crowded theater, but still is a light (if not totally undemanding) dark comedy"
    },
    {
      "rating": "7",
      "text": "Some fascinating and authentic UI designs with camera angles, and a realistic slur of comments all add to the atmosphere of this dark satire. Joe Kerry delivers an electric performance as a Norman Bates styled 'everyman' serial killer as he attempts to grow his online media presence with a spate of live publicly streamed executions. It's hard not to think of natural born killers as I watched through this with my teenage son as the irreverent kills rack up in service of protagonist Kurt's need to connect with a larger online audience to express his developing 'online persona'. Some of director Eugene Kotlyarenkos choices seem at odds as he attempts to navigate the line between satire and horror comedy but the unique split screen format and keerys performance won me over in the end. This is an essential watch if the subject matter is of interest to you."
    },
    {
      "rating": "7",
      "text": "Not sure why critics didn't care for this, but as per usual, I, and many users, disagree with them. I dug this. I thought it was clever and timely. It pokes fun at both the gig economy and social media."
    },
    {
      "rating": "10",
      "text": "Amazing!! Great dark black mirror esc satiric commentary on our social media driven world and how young kids and teens know the world only through the new norm of social media. \"If you're not documenting yourself are you even alive\"? Interesting story, Joe Keery gives an incredible performance as and awkward young person who had a very tough upringing and clearly has unaddressed issues. He's performance gives the feel of the bland awkward boring online personality which makes sense that he doesn't have any followers despite his extensive uploads but his desperate need and want for attention and trials of becoming something and failing show layers of the character and really lets Keerys performance shine.The film also if one of the first to succeed in the technical way in terms of the new age found footage esc film. So many films before like \"darknet\" and \"unfriended\" tried to make the webcam social media found footage film but grossly failed. Spree not only gives you a lot of action and angle coverage through its many cameras setup by our fame hungry protagonist and other social media personalities it also fully justifies all the cameras being there without the viewer questioning the likeliness of them being there. Everything flows very smoothly and there isn't a single angle which is not from a phone, go pro, or cctv cameras. Spree is comparable to Taxi Driver as Taxi Driver was a timecapsule of the 1970s LA Spree is a very much time capsule of 2020 and how this very new social media filming and posting everything and living vicariously through other can and is harmful to everyone and in the case of our protagonist Kurt can lead a man to do Crazy, unjustifiable actions just to get viewers and likes.Truly an amazing film and recommendable to everyone who can think a bit more about the themes and commentary and not dissmiss the character or his actions just because you dont understand social media mr. Newspaper journalist movie reviewer who probably still has a flip phone. Recommended to everyone!"
    },
    {
      "rating": "7",
      "text": "So indicative of society today, where existing on social media is all that matters. Of course, this takes it to the extreme, but the message is still relevant. Good use of alternate cinematography; similar to Searching (2018)."
    },
    {
      "rating": "9",
      "text": "Spree shows the despertate need of attention and social media clout that we need and the extreme places we can go for some attention and aproval of complete strangers.Powered by Keery's performance Spree is a fun ride that achieves it's whole purpose by sticking to the fun filmmaking tecnique that social media provides and show us the idiosyncrasy that a psycopath seeking for attention has.The multicamera makes this as 90 minute YouTube video and Instagram LIVE and that is horrifyngly brilliant yet incredibly fun."
    },
    {
      "rating": "10",
      "text": "honestly?? i love this movie so much, the style that it was edited and shot in was really great, and they were able to mix comedy in with the genre of the movie really well without making it campy. Joe is absolutely amazing, but I think that Sasheer's performance stole every scene she was in, she's great. I loved how they eventually tie up the entire movie."
    },
    {
      "rating": "6",
      "text": "This is very much an MTV type 'found footage'-esque film, which would mainly appeal to a teenage audience, I'd imagine. Its pretty high octane, once it gets going and it doesn't take long to get going, all things considered. It's very much 'in your face' style - fair enough. I found it distracting trying to read some of the live stream comments that appear in the bottom left hand corner constantly - it uses the split screen feature a lot too, with multiple camera views showing different angles (of the same place usually).While there is undoubtedly violence, some bloody violence, depicted, there isn't much in the way of especially gory or explicit detail shown (thankfully). I suppose its more about a moral story than it is about showing every inch of everything that happens - its obvious enough what becomes of certain people, we don't really need to see everything in complete detail, I reckon.The themes interest me but it does have a bit of a trashy, throw away feel to it, which will alienate many people I imagine. There's no doubt there have already been people in real life who have ended up committing dangerous acts partly to get some form of online notoriety, so it should perhaps make for some sobering thoughts but this film felt a bit too immature and doesn't really question or answer things fully in the way that perhaps me, as an adult in her 30s, would ideally like. So yeah, maybe I am a bit too old for this kind of film but what can I say? I remember (just about!) life before the internet was available to all, life as a kid prior to social media. I've got numerous social media accounts and I dont have the biggest number of followers ever I suppose but im glad to say I've never felt the drive to pursue my supposed owed '5 minutes of fame', though I can understand some people do crave it.This is nearly a good film but not quite, in my opinion. It poses more questions than it answers but it'd be a good starting point for discussing the points it covers."
    },
    {
      "rating": "0",
      "text": "This is a movie about black empowerment. The protagonist is a black woman. If that's what you're into, you'll love it. If you were expecting a movie about a white social media killer, you're going to be disappointed. This is a clear bait and switch."
    },
    {
      "rating": "0",
      "text": "Abysmal movie. The mediocre acting was the only highlight of this entire garbage pile of a movie, if that. It was all over the place, extremely repetitive, unfunny, and had no redeeming features whatsoever. None of the characters were likeable at all. From start to finish, it felt like this was no consequence. Whatever  commentary was intended with this \"film\" was completely lost in all the nonsense, unrealistic actions and empty dialogue in it. This movie is as vapid as social media itself. Don't waste your time."
    },
    {
      "rating": "7",
      "text": "honestly, not bad. joe keery was made for this role (i'm not sure if it's even okay to say that). dark comedy and the athmosphere were great, i would have liked to see this at the movie theather and see people's reactions to everything."
    },
    {
      "rating": "10",
      "text": "Love the main characters unethical methods to becoming viral. It's really funny watching how desperate he is. I can definitely see him as a real person"
    }
  ]
}