{
  "id": 2072,
  "title": "Spy",
  "starring": [
    "Melissa McCarthy",
    "Rose Byrne"
  ],
  "runtime": 120,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "A desk-bound CIA analyst volunteers to go undercover to infiltrate the world of a deadly arms dealer, and prevent diabolical global disaster.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6On9Ed52fz8W1h9PzaDQ12ZfHdn.jpg",
  "categories": {
    "plot": 6.071428571428571,
    "acting": 5.85,
    "ending": 7.555555555555555,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.7560975609756095,
    "action": 7.72
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Melissa McCarthy stars in 'Roseanne Blart: Spy Cop', playing a desk-bound CIA analyst who volunteers to go undercover and find a deadly arms dealer. Okay, i'm sorry, let's try and be professional.\r 'Spy' is the first Melissa McCarthy film i’ve seen, and without doubt it will definitely be the last. It’s written and directed by Paul Feig, the man who thinks he understands the Ghostbusters franchise so well he wants to reboot it with a female cast, because that’s the cool thing to do these days, right? Is there an agenda in Hollywood that is pushing Feig and McCarthy? Did i miss a meeting or a memo?\r Anyway, despite an impressive cast featuring Rose Byrne, Jude Law, Jason Statham, and Peter Serafinowicz, the film is the most mediocre garbage i’ve seen this year. Thumbs up to Byrne and Statham playing characters out of their comfort zone but the tired, forced stupidity was overbearing. Throw in an eye rolling cliche cameo from rapper 50 Cent, and you're all set for a complete waste of time. I feel dirty just thinking i spent two hours watching this. Why is it two hours long? It’s ‘comedy’ consists of jaw dropping, bottom of the barrel material such as fart jokes, dick pics, racial stereotypes, racist abuse, fat woman shouting and fat woman falling over. I wasn't fooled by the 'razor sharp wit' that is actually random, dumb, irrelevant humour which will appeal to the lowest common denominator. It's the go-to structure for lazy mainstream comedies today.\r Do you remember intelligent, well written spy/agent comedies such as Pink Panther, Naked Gun or more recently Red and The Kingsman? Well you won’t find anything remotely similar here! It’s shocking Spy is being praised as ‘progressive’ and full of ‘belly laughs’. More like ‘formulaic’ and full of **** Despite her tag as the female Kevin James, I gave McCarthy a chance. Despite the trailer looking average, i gave the film a chance. Boy, should i have gone with my instincts."
    },
    {
      "rating": "0",
      "text": "Spoiler Alert!  Let's sum it up:  Juvenile vulgarity?  Check.  Predictable writing and humor?  Check.  Melissa McCarthy in all her typecasted glory?  Check.  Unbelievably athletic obese women?  Check.  Dick picks?  Check.  The old overly stupid men/ smart women cliche?  Check.  Gay 50cent cameos?  Check.   Predictable plot?  Check.  Incredibly unintelligent?  Check.  Complete waste of 2 hours?  Check.\r If you've been waiting for a vulgar version of \"Mall Cop\" then your wait is over.  Spy is truly deserving of a single star."
    },
    {
      "rating": "10",
      "text": "This is a really funny movie. There was so much laughing from the crowd, you even missed some of the jokes! Many great performances. Don't believe any negative reviews from people who can't laugh. Go see it!"
    },
    {
      "rating": "0",
      "text": "Easily one of the dumbest movies I've seen. Melissa is pathetic, the action is boring & the movie is corny scene after corny scene. A movie that should not exist."
    },
    {
      "rating": "0",
      "text": "The movie is so bad. Rather than trying to make a good movie, the director choose, again, to bring feminist fight on the screen. In this movie, if you are an ugly woman, you make awesome stuff. If you are a beautiful woman, you do crap stuff. If you are a man, you can't make great stuff, you will fail or be saved by an ugly woman. All along the movie, men make sexual harassement on the woman \"hero\". For the rest, it's just bad written, it's boring. Only the first scene is nice, when you see the spy and his agent (a \"normal\" person) working together to make the mission successful. They should have work on that. I was out of the movie when the \"normal\" person started to act like a superhero. It was 3 painfull hours. I almost regret to have watching this crap. I didn't enjoy the movie. It's a bad spy movie. Don't waste your time here. Those great actor skills are wasted in this movie."
    },
    {
      "rating": "4",
      "text": "OK, so this looks like an interes...oh my God! its another bloody Bond parody!! seriously!!! Yes the modern age feminist hipster, Paul Feig, takes a swing at the Bond genre, and oh what an original concept that is, gee I wonder what we'll see here...ugh!\r So naturally its an adult comedy with lashings of semi-serious action, CGI blood, swearing and a whole heap of Melissa McCarthy and other actresses. Basically the plot revolves around McCarthy playing Cooper, a desk jockey CIA analyst who helps the very suave, completely clichéd character of Fine played by Jude Law. Yep, if you ever wanted to see what it would be like having Jude Law as Bond, well here you go. After a botched mission Fine is supposedly killed off and the CIA need someone to take his place, an unknown, hence they can't use Statham who plays another totally clichéd agent character we've all seen before. We then follow Cooper around as she slowly but surely sinks deeper and deeper into a mission, which she was never really suppose to get into in the first place (she was only meant to be surveillance).\r Oh geez where to start, the plot is unoriginal sure, we all know that, but how about some original ideas...oh too late. From the very first scene I had a good idea what this film was aiming at and how the characters would play out. Spoiler alert! but the minute you see Law as this debonair spy, you know he's obviously gonna die early on, he's clearly the plot setup for McCarthy's Cooper, I mean come on, who didn't see that?! But wait! as the film progresses and more and more characters are introduced, we start to see double agents and characters popping up outta nowhere who are suddenly spies or assassins. All of sudden characters we saw at the start who appeared to just be the butt of a joke or background fodder, are now main characters out to kill the protagonist. Its at this point you know that anyone is fair game and anyone can surprisingly come back from the dead when you thought they had been killed off. So I quickly realised that Jude Law probably wasn't dead at all. Seeing as we didn't actually see him die, clearly he can come back, and he did...*groan*\r The plot is a mess of characters bouncing back and forth between the goodies and the baddies. Seriously, there are characters popping up all over the place, getting whacked, and then replaced minutes later by new ones, only to get killed just as quickly. The ones that don't get killed, you just know are probably gonna turn out to be secret agents, but on either side. I honesty thought Law's character of Fine was gonna keep flippin' sides! he was a goodie, then a baddie, then a goodie again, but at this point I genuinely suspected he would turn on Cooper yet again right at the death, and then get properly killed off. Amazingly the film beat me on that one, but this film could of kept spinning these characters round and round, one double agent twist after another.\r The actual characters are a completely mixed bag of nuts that all had one thing in common, none of them managed to actually make me laugh...at any point. McCarthy was...well, pretty much like McCarthy is in every bloody movie she's ever done (whilst looking oddly like Dawn French at one point), whilst her sidekick, played by Brit Miranda Hart, was just simply annoying and unfunny. I swear, an early scene near the start has McCarthy and Law in conversation at dinner, they are both talking about themselves and offering basic foreshadowing of things to come. Now initially there are moments that made me smile (as there were throughout this film), but this obviously intended funny sequence just went on and on and on...it just didn't f*cking stop. Like seriously, the moment has passed, the joke is over, its not funny anymore its just awkwardly embarrassing, stop flogging this dead horse!!\r The only characters that did offer some genuine giggles were Statham as a dumb, cocky but tough agent, nothing gobsmackingly funny mind you, but reasonable. Next to him I quite liked Peter Serafinowicz as the slimy Italian (yet another secret agent) Aldo who can't keep his hands off the ladies. Sure this character felt like a cheesy 'Carry- On' character (something I would of thought was beyond the realms of acceptance for Feig), but his antics were amusing. Other than that everyone was just there, doing exactly what you expected them to be doing with these character types. Get a load of Law by the way, how much flippin' makeup?? Oh and both Statham and the main baddie fall into the lake from that helicopter at the end, so why does only Statham survive?\r I know this movie was relatively successful but I don't really understand why. Yes some parts were good such as the gadgets sequence near the start which is obviously yet more parodies of a certain franchise, and I did quite like how the main female villain was a spoilt bratty Princess type, although again that did become annoying at times too. But in general everything just felt very generic to me and relied far too much on feeble visual gags including male genitals and slapstick, lots of profanity and lots of weight/looks shaming jabs. Even the inclusion of lots of blood and a bit of gore didn't do anything for me, that just felt unnecessary and shoved in to appease the male audience. I would say this was more enjoyable than 'The Heat' which was pretty dire, but at the end of the day, I found this to be an infantile, factory assembly line, cookie cutter of a flick."
    },
    {
      "rating": "9",
      "text": "I saw the unrated version of this film and it was hilarious, full of vulgar language, extreme violence and some very graphic nudity that involves a selfie and a man and his \"junk\". Melissa McCarthy is brilliant as were Jason Statham, Rose Byrne and British comedic actress Miranda Hart. If you get a chance watch, all of the end credits all the way through, as they have a bunch of other possible scenarios of future \"Susan Cooper\" adventures. I smiled through almost the entire film and even laughed out loud several time. It's very entertaining and a huge improvement over \"Tammy\", which may be one of McCarthy's worst films."
    },
    {
      "rating": "8",
      "text": "This movie made me crack up countless times. Not just a belly laugh. I'm talking a real crack-up. A hit my leg kind of laugh. Engaging story, direction, photography, as expected. The performances, especially Byrne's and Statham, are hilarious. But obviously, the real winner in this film is McCarthy. She just walks on with her sad costume and proves everyone just how bad-ass and agressive she can be while remaining the character with the wittiest, funniest one-liners. Paul Feig: you are a genius and can't wait for your Ghostbusters movie to come out next year."
    },
    {
      "rating": "7",
      "text": "Some scenes in the movie does make me cringe of Melissa McCarthy's performance, but she was surprisingly good in her role as \"Spy\" turns out to be a jolly-solid comedy spy film."
    },
    {
      "rating": "6",
      "text": "Messy and formulaic but hugely enjoyable nevertheless, Paul Feign and Melissa McCarthy's third team-up Spy is a fun genre film with plenty of laughs and solid performances."
    },
    {
      "rating": "10",
      "text": "Melissa is the star of the film and shines. This is McCarthy at her best.\r Watch it here for free http://www.watchfree.to/watch-2a2bd2-Spy-movie-online-free-putlocker.html"
    },
    {
      "rating": "9",
      "text": "This film is one of the funniest films of the year so far. The jokes weren't plain and boring, I loved Allison Janney and Miranda Hart in this film because they were really amusing and weren't used in places they weren't needed but used appropriately. This film is senses of humour and Melissa did a fantastic job, as did all of the cast"
    },
    {
      "rating": "7",
      "text": "Funniest movie I've seen in a while. Thought it isn't exactly awe-inspiring (some jokes don't hit the ground), it's still well-acted and enjoyable for the most part. Gotta love Jason Statham and Rosa Byrne's characters respectively.\r Final Score: 7.5/10"
    },
    {
      "rating": "6",
      "text": "A movie without a heart\rjokes that hit one two\rbut only one lands, the other with a thud\rThe Beaches watch is the funniest moment\rJason Statham is quite good, though"
    },
    {
      "rating": "10",
      "text": "Spy is witty, hilarious and doesn't rely on cheap jokes, even the over the top insults are clever. We witness a quiet desk bound CIA analyst's descent into a strong and wild character. Definitely makes us oversee the feeble attempts of \"Tammy\"."
    },
    {
      "rating": "9",
      "text": "Great movie with characters that are consistently funny.    Jason Statham plays a hilarious parody of his other roles, and McCarthy as the lead shines as a desk jockey coming out of her shell.  \"Spy\" also avoids dumb plot-driven humor, instead favoring hilarious characters.  People who like \"da dum, cha\" punch-liney comedies might be let down, but who cares about those idiots?  \"Spy\" is smarter than it lets on while still delivering belly laughs.  There isn't much to not like about this movie, it's great escapist fun."
    },
    {
      "rating": "8",
      "text": "A redefined wonderful spy movie.\r I know Melissa McCarthy since 'Gilmore Girls', but never thought she would rise this far, especially to dominate in a movie with the presence of the big names around her, that too in an action film equivalent to top quality. She's one of my favourite actresses, even I enjoyed thoroughly her under-appreciated 'Tammy'. So this is where the action stars become comedians and comedians action stars. Indeed, it worked out so well.\r It shames comedy-spy flicks like 'The Pink Panther', 'Johnny English' etc. From the director of 'The Heat', helmed another perfect female oriented comedy. Jude Law was a decent as usual, but Jason Statham was unbelievably awesome in his tiny part. I had plenty of good laughs, the loud ones after a long time. I still remember the unicorn joke and I can't stop laughing. And roof over a bike, gadgets and so on... I find Melissa McCarthy's line deliverance are so funny and I enjoy her films specially for that reason.\r I know they used a stunt double and blue/green screens in the crucial segments for a better result. But still she excelled in all stunt sequences that required physically herself in front of the camera. One of the trivia says, after the end of each day shooting, she looked like fell down an elevator shaft. Her hard work definitely paid off very well.\r There are lots of adult oriented comedy, so strictly it is for grownups only and may be matured teens. I'll be definitely disappointed if they won't make a sequel for this. If they do, I hope they retain all the cast, especially Statham along the lead actress. And finally I'm looking forward the director-actress's the third collaboration, 'Ghostbusters'.\r 7½/10"
    },
    {
      "rating": "8",
      "text": "Just when I thought that Melissa McCarthy had worn out her comedic welcome (thanks to Tammy and Identity Theft, a bad one-two punch), I guess all she needed was her Bridesmaids and The Heat director Paul Feig to get her out of her slump. The plot is very similar to Get Smart (or even Johnny English). When all the other agents are compromised, a lower level assistant is recruited to field work. The difference is that McCarthy's character is very good at her job. And it's the characters she bounces off of and their interaction that makes this movie work, beside the chase scenes and action sequences (which are all staged well) . Jason Statham plays off his macho image brilliantly, with every manly boast getting more absurd. Rose Byrne continues her comedy streak as the **** And just as Fieg introduced Rebel Wilson to American audiences in Bridesmaids, Brit Miranda Hart is great as the gawkward best friend. A pleasant surprise."
    },
    {
      "rating": "9",
      "text": "Pretty good film. Totally filled with humor under humor sauce. Only problem is that it's 90% vulgar (if not all 100%) but it makes film even funnier. Plot is very interesting and plot twists are really unpredictable especially 1 in the end with nuke trade (don't worry, it's not a big spoiler). I think, if you're not opposed to vulgar stuff, you really should give it a chance. Or at least sacrifice 120 min of your free time for Statham. It's his best role in his career. Really. Best."
    },
    {
      "rating": "9",
      "text": "If you need a good laugh - in fact, lots of laughs, go see Melissa McCarthy's new movie \"Spy\".  It is wonderfully funny!  And, it has a fabulous cast.  McCarthy is an underused CIA employee who has a secret bad ass side.  Her boss, Allison Janney, decides to put her into the game when the identities of the guy spies are compromised.  Watching her get her gadgets and new identity are hysterical.  Jude Law is suave as any James Bond and McCarthy is always in his ear bud saving his butt.  Jason Statham provides great laughs as a hyper gonzo fellow spy who just can't let himself be outdone.  Especially by a girl.  Rose Byrne is wicked funny as the gorgeous villainess who wears skirts so tight and heels so high, she needs assistance to walk!  The laughs keep coming.  Finally, McCarthy has a movie that doesn't dumb things down for the audience."
    },
    {
      "rating": "9",
      "text": "Like with Bridesmaids, Paul Feig managed to make a great comedy that would still be a great movie even if there were no funny moments in it. What really makes this movie work is that it is just as much of a spy thriller as it is a comedy. It is thoroughly entertaining in both aspects. Another reviewer said she just randomly turns into a competent agent, but I don't think that is the case. I think she was competent from the beginning. The problem was just that they didn't believe in her. There's often talk of badass females in action movies and this is one of them. The story in my opinion is intelligent and layered, which makes for an exciting movie going experience. Definitely one of the most entertaining movies I've seen this year."
    },
    {
      "rating": "10",
      "text": "Wow. I had thought it would be good but this really was the funniest film I have seen for quite sometime and definitely Melissa McCarthy's best performance. She portrays her character in such an endearing way yet at the same time is utterly hilarious. The rest of the cast is also fantastic. Rose Byrne is great with her constant put downs and a scene with her and McCarthy on a plane is hysterical. Miranda Hart is also terrific even though I initially thought her out of place but once she moved out into the field in the second half of the film I could not take my eyes off her and found that she stole scenes with great one liners or even just funny mannerisms. Jason Statham was perhaps not as funny as I was expecting but he was still great delivering his lines in a comically dead pan voice.The most plaudits must however go to Paul Feig for managing to create a film that was hilarious yet also riveting through its many plot twists and action sequences. His writing was so brilliantly specific to each character, something that only heightened the comedy. There were also many occasions during the film when lines became inaudible due to the laughter of myself and the audience at a previous line or action."
    },
    {
      "rating": "7",
      "text": "McCarthy is made for physical comedy, and she certainly made it work here. Of course, much is due to her bulk and the numerous ways she exploits it for comic effect. Then there are her priceless facial expressions. Hilarious. I would have given this flick an 8 if it weren't for the overuse of the f-bomb. It seemed as though the screenwriter opened that spigot in the last quarter of the movie, and those bombs soon felt contrived and utterly gratuitous. I served 20 years in the Navy, and I don't remember sailors using such language. Have never understood why Hollywood writers feel so inclined to use it with such a heavy hand . Is it supposed to be earthy? Beats me."
    },
    {
      "rating": "10",
      "text": "After \"The Heat\"  director Paul Feig proves that he is capable of directing smooth/funny action, now he teams up with McCarthy for the third time. Susan Cooper is an unassuming, deskbound CIA analyst, and the unsung hero behind the Agency's most dangerous missions. But when her partner falls off the grid and another top agent is compromised, she volunteers to go deep undercover to infiltrate the world of a deadly arms dealer, and prevent a global crisis.  After \"tammy\" happened  people didn't like her for writing/staring in it, but this is her  comedy triumph. What's funny is the fact that the film makes fun of the spy movies cliche's, which Feig has achieved in writing the script; when Jason Statham is popping jokes, when McCarthy's one-liners are 'filthy-volley' and isults Rose Byrne you have to watch this film. Grade A-"
    },
    {
      "rating": "9",
      "text": "Spy is the best constantly hilarious slapstick romp since \"It's A Mad Mad Mad World.\" After the first 15 minutes, it's an hour and forty-five minutes of laugh-out-loud banana peel and gag-writing antics.\r --GG"
    },
    {
      "rating": "8",
      "text": "Before watching this film: N/A\r Premise: A parody of spy films.\r Pros:\r 1. Hilarious all around and Melissa McCarthy has done a great job.\r2. Jason Statham in his best work yet in a long, long time. (From the films I have seen, his previous good (at least a 4/5) work was Snatch with Brad Pitt in 2000 though I haven't seen Furious 7, and he only had a cameo in Fast and Furious 6.) Furthermore, he's not good here because of his usual capabilities but because he was ridiculously funny! You haven't seen him this funny in any other film.\r Con:\r 1. The twist towards the end wasn't explained properly and this twist is the reason for a couple of events earlier in the film.\r2. It is rated R, but it was unnecessarily violent and unnecessarily full of vulgarities.\r3. Rose Byrne's character was not consistent and a bit hard to believe.\r 4/5 (no half scores). Good enough to pay to watch in the cinema."
    },
    {
      "rating": "10",
      "text": "This is definitely the best comedy of the year so far, and the best movie by Melissa McCarthy. The plot wasn't as predictable as The Heat, and the movie just made me laugh so hard. Jude Law, Rose Byrne, and Jason Statham were also fantastic in this movie and the plot was just so fun! I really want Paul Fieg to keep teaming up with Melissa McCarthy and keep making comedies like this."
    },
    {
      "rating": "10",
      "text": "The movie has action just like a James bond movie, but it also has the awesome humor of Malissa McCarthy. If you dont like Malissa McCarthy and her style of humor you probably wont like this much. I think it is funny, original, and worth a high score..."
    },
    {
      "rating": "9",
      "text": "An unexpected delight! This was a fast paced, tongue in cheek satire that was clever, intelligent and punctuated by frequent hilarity. Mcarthy is brilliant, and Statham displays a hitherto unseen sense of comic timing that was utilised to great effect. A surprising script peppered with every expletive you can think of, and probably some you can't, and some rather visceral violence ensures that Mcarthy will be thought of alongside other famous on-screen spies. The action sequences were excellent and the dialogue was absolutely superb, with so many memorable lines. In the same league as Kingsmen, though not quite as polished, this was a thoroughly enjoyable film. 8.79/10"
    },
    {
      "rating": "8",
      "text": "Though Melissa McCarthy is on the verge of being typecast (or has she already) this film is funny, smart and sassy. I loved the deadpan humour and action. Jason Statham though does need to work on his comedic timing."
    },
    {
      "rating": "9",
      "text": "\"I once drove a car off a freeway, on top of a train, while I was on fire. Not the car -- I was on fire!\" Growls Jason Statham’s Super macho super spy during one of many hilarious scenes in this Over the top spy comedy.\r Subtle this isn’t! What it is, is stuffed with Hilarious performances from all the lead actors and an absolutely scene stealing performance from Jason Statham’s as a super Macho parody of his normal action hero persona.\r Spy is a raucous  in your face Spy comedy that also has really good amount of entertaining action, McCarthy is excellent in the comedic elements and surprisingly proficient in the action scenes.\r The standout action sequence being a brutal hand to hand and knife to knife (and frying pan to knife and.... on and on ) that was not only the best fight in the film but on par with some of the best action scenes in the genre (yes I would include the Bourne fights).\r McCarthy manages to be swing between awkward secretary and bad ass super spy and does so in a convincing and entertaining way.\r The plot plays around in  silly spoof territory with just enough serious elements thrown in to make this feel like more then just a spoof but actually a pretty competent spy thriller,  between this and Kingman we are having a pretty good year for the spy genre so far 8.5 out of 10 but I rounded the score up to 9."
    },
    {
      "rating": "8",
      "text": "Paul Feig and Melissa McCarthy collaborate for a third time in Spy and this film is far more action packed than the pairs other movies. This movies got a great cast with some pretty funny actors in the mix. Melissa McCarthy tones herself down as well and he performance does not resemble her other roles in films like Tammy and the Heat. However the true highlight of this movie is Jason Statham. This guy is really funny and he is really only parodying himself. The funniest moments in the film involved him almost all the time and its nice to see him doing something a little different. If you were a fan of Bridesmaids and The Heat you will likely like this film but the action in the film could bring on a new audience."
    },
    {
      "rating": "10",
      "text": "This is a movie that does to spy films what Shrek did to fairy tales.  It turns conventions upside down, yet retains an entertaining and funny story.  An obvious riff on James Bond and Casino Royale (the more recent one), it starts by taking us down the conventional spy genre from the start.  The first few minutes could easily be a James Bond movie with Jude Law in the role, but soon we are taken on a different path.  When Melissa McCarthy is thrust into the field, we get surprised and delighted as she ends up being effective despite (or perhaps because of) her non-conformity to role expectations.  The film manages even to argue feminism while being hilarious, no mean feat.  Highly recommended."
    },
    {
      "rating": "9",
      "text": "one thing funny about this movie is when you have a bunch of wild plot twists, crazy ideas, and some balls to do the shooting, also a sufficient amount of money to make your crazy and wild ideas real, then you just have the urge to make it, ei? this movie is \"for entertainment use only\". i mean, Jason Statham playing useless arrogant spy and Melissa McCarthy gone full-world-class-action-movie-spy? oh come on if it's not \"just for laugh purpose only\", what is it? overall plot is twisty, tricky, and full of surprises. the opening is epic, later on it's become wilder and wilder."
    },
    {
      "rating": "6",
      "text": "Well that was surprisingly funny and not terrible as I thought it was going to be.\r The story is about a CIA analyst who just so happens to be responsible for the success of some of the most dangerous missions. But when her partner suddenly disappears and another top agent is compromised, she finds herself going from behind the desk to into the field - deep undercover to infiltrate the inner circle of an arms dealer and prevent a global catastrophe.\r Spoof movies on spy films isn't anything new, we seen some good and we also seen some really bad ones that are not written very well and the jokes are just flat and retarded. Spy starring Melissa McCarthy looked the same and I didn't really care about until the film got it's early reviews from critics and it got positive reviews. So I just seen the movie last night and I thought the film Spy is a very funny comedy and it's ten times better than Tammy that we got last year.\r Melissa McCarthy can be a hit or miss with me, because I know she can do a great performance in comedy movies I mean she got nominated for Oscar in Bridesmaids so that's saying something. In this movie I thought she was going to be a clumsy over weight women who always slip up and makes things worse, you know the cliches in those comedy's, but I was extremely surprised that this didn't happen in this movie as Meliassa McCarthy character has a comedic ark to her but she also played a different character and not the ones that she normally pick. Melissa McCarthy did a good comedic performance in this movie and she did better in this movie then in Tammy.\r The director of the Paul Feig who previous did Bridesmaids, The Heat and he's doing the upcoming Ghostbusters movie. He directed the movie pretty good and although out the film I keep thinking of The Heat that he did and I'm saying that in a positive way as it shows he can mix action with comedy very well. Great work Paul Feig.\r The rest of the cast in the movie like: Jude Law, Rose Byrne and Jason Statham all three did great in the movie as both got they own funny lines and at least they wasn't wasted like in some other movies seem to do with a big cast like this, but luckily it worked out fine.\r The writing was good, the one liners in the movie has to be funniest one liners I've heard since the movie Whiplash and some of jokes really worked.\r Now for the problems: Some of the jokes in the movie are sometimes predictable and just fell flat to me. I know this may sound like a small little nick pick to most people but the movie has a Jame Bond like opening just like Bond films always open but of cause this movie does it's own take on it and it really wasn't all that good, as I said before it's a small little nick pick but it could have been a lot better, I'm just saying.\r Overall Spy is decent comedy and it's way better then some spoof movies on spy films. The acting was good, some of the jokes worked, Paul Feig directed the movie with style by mixing the action and comedy and the movie is enjoyable to watch."
    },
    {
      "rating": "10",
      "text": "A lighthearted good time in this thoroughly entertaining movie you can bring your teenagers to. Expect it to be a great movie to bond with friends or family over. Perfect for a girls night out. You'll share some good laughs, and enjoy an uplifting story."
    },
    {
      "rating": "9",
      "text": "well i should not have watched it with mom but it was a smart entertaining film with a great mix of funny and kill bill style action. everyone does a perfect job here giving a long film that never gets old i mean just when you stop expecting surprises it throws in 50 cent!!! thats awesome. and the movie is filmed great too. sure some wont like this and again if your a kid watch it alone. im 14 and it was very odd watching with a groan up but i never stoped me if you like who is in it they wont disappoint. its still in theaters go get some nachos and watch this film!"
    },
    {
      "rating": "7",
      "text": "An entertaining and hilarious film where Melissa McCarthy was for once in the limelight and not statham. Overall well acted and met the intentions of being funny."
    },
    {
      "rating": "8",
      "text": "My girlfriend and I ended up seeing this as a backup after Jurassic World sold out and I was presently surprised. Pros: The jokes are consistently good and this is easily's McCarthy's best work to date. Cons: Over stayed it's welcome a bit with a 2+ hour run time. Bottom line: I'd almost guarantee Spy is a better movie than what you're expecting."
    },
    {
      "rating": "7",
      "text": "Maybe I set my expectations on this one a little too high, because after reading the rave reviews I went in expecting a lot. And while it was undeniably entertaining, it did fall a bit short on laughs for me. But on the plus side, the whole cast gives great performances. Melissa McCarthy once again does what she does best, owning every scene she's in with great and humorous results. Jason Statham was also surprisingly funny, as was Rose Byrne, who departs from her usual sweet and innocent roles as the film's villain. Jude Law also gives a funny and worthwhile performance. The action was also fun to watch and never let up. Overall, while it wasn't quite as funny as I had hoped it would be, there wasn't a dull moment in the film and it kept me entertained from start to finish, which is enough for me. It may not be Paul Feig and McCarthy's best (I still like Bridesmaids the best) but it is a step above their last film The Heat."
    },
    {
      "rating": "6",
      "text": "User Score is spot on.  My wife enjoyed it & I laughed a few times due to funny lines & occasional funny scenes. I'm not a big Melissa McCarthy fan so that doesn't help. Some of the characters were believable but others weren't.  An overweight middle aged woman casted in a role to fight professional killers is a bit much. So I give it a 6.5 overall and that is being generous"
    },
    {
      "rating": "8",
      "text": "***   The movie's not over till the fat lady zings. (Isn't there a verb for “zinger”?) Oh, she sang, all right; she's down in the dressing room getting dry-humped. In other words, the movie is funny. It's not a spook spoof, it's a spy comedy, with lots of kinetic talent, instant classic lines (aforementioned zingers) in the vein of “Top Gun” and a great sideshow of Statham spoofing Statham."
    },
    {
      "rating": "10",
      "text": "This is really **** great movie all of the scenes are funny this is the best movie in 2015 together with pitch perfect 2 and insurgent I will watch it again ^_^"
    },
    {
      "rating": "10",
      "text": "One of the best films I have seen in a long time. Very well thought out characters, comedy, and storyline. I can't say enough positive things about this movie. It's a must watch, it'll have you laughing from the beginning to the end."
    },
    {
      "rating": "1",
      "text": "Someone compared Spy to Mall Cop. No I don't think so. I enjoyed Paul Bart Mall Cop it was funny it was cute heartwarming family entertainment. Spy is unnecessarily vulgar and graphic, none of it amusing and once again McCarthy is just over the top. Rose Byrne was a huge disappointment. I really wanted to like the movie I had high hopes but it was just too noisy, unfunny and underwhelming."
    },
    {
      "rating": "7",
      "text": "Spy doesn't always work but all the performances are great. The film has timely comedy but its the way the actors deliver the lines that keeps the film entertaining. McCarthy holds the lead but its Jason Stratham steals the show."
    },
    {
      "rating": "8",
      "text": "No question Paul Feig just gets Melissa McCarthy.  In this film not only is she funny but she's tough while keeping a real vulnerability.  Along with McCarthy you also get Jason Statham, Jude Law, and Rose Byrne giving great performances.  This is a funny movie in which you still care about the spy elements.  A-"
    },
    {
      "rating": "8",
      "text": "In spite of at moments REALLY ridiculous, impossible and parody-like plot, this movie made me laugh out loud so many times! Although, most of those moments came in the first half of the movie and was mostly due to Melissa Mc., Miranda H. and Rose B. and their chemistry. Three ladies made this movie better than it really is. Jason S. had his moments as well, but the ladies take the crown. Even though I'm usually not a fan of this type of comedy, I gotta admit that Byrne's snarkyness, Hart's goofyness and McCarthy's (almost) everything made my evening."
    },
    {
      "rating": "9",
      "text": "Spy is one hilarious movie. Melissa McCarthy has made some duds lately by be type-casted as the same old \"fat slob\", but this movie is different. Everything  in the film feels fresh and exciting: the locations, the cinematography, the jokes, the sight gags, the satirizing of the espionage genre, and the A-list cast. I was never once bored in this flick; it even features 50 Cent! This is ten times better than Bridesmaids."
    },
    {
      "rating": "10",
      "text": "After a bunch of critical failures following Bridesmaids, I though McCarthey's career was over. But after seeing her dramatic work in St. Vincent this year, and her returning to a great comedic role in Spy (for which she was nominated for a Golden Globe), it looks like she may go back to making good movies again"
    }
  ]
}