{"id": 1033, "title": "Spy Kids", "starring": ["Alexa PenaVega", "Daryl Sabara"], "runtime": 88, "genre": ["Action", "Comedy", "Family", "Adventure"], "description": "Carmen and Juni think their parents are boring. Little do they know that in their day, Gregorio and Ingrid Cortez were the top secret agents from their respective countries. They gave up that life to raise their children. Now, the disappearances of several of their old colleagues forces the Cortez' return from retirement. What they didn't count on was Carmen and Juni joining the \"family business.\"", "releaseYear": "2001", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/urb5Wf4yffJQ2KwAuSPxCbOM8HA.jpg", "categories": {"plot": 6.909090909090909, "acting": 6.5, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.714285714285714, "funny": 7.5, "action": 7.0}, "reviews": [{"rating": "10", "text": "Robert Rodriguez's  Spy Kids is amazing  but machete kills is something i enjoy more .  I love the cast and including Robert Rodriguez . but spy kids 3 is much more enjoyable"}, {"rating": "7", "text": "Un muy buen recuerdo de mi infancia, grandes personajes efectos malos pero un poco impresionantes y una trama interesante."}, {"rating": "8", "text": "I enjoyed it a lot. The acting was surprisingly good. The story was interesting, from start to finish. The special effects were very low quality though. Worth a watch."}, {"rating": "10", "text": "I loved it."}, {"rating": "7", "text": "Unpredictable, joyful, and crazy. Robert Roderiquez's new family kid film \"Spy Kids\" can be described with these 3 words."}, {"rating": "10", "text": "It is the laugh of the season!!"}, {"rating": "10", "text": "Great fantasy movie."}, {"rating": "9", "text": "awesome kids movie!"}, {"rating": "10", "text": "Like it !"}, {"rating": "7", "text": "Spy Kids was a fun and entertaining movie , especially the excellent work of Daryl Sabara and Alexa Vega , children who are now grown , also congratulated Robert Rodriguez for his new move into the family genre."}, {"rating": "9", "text": "Spy Kids is kick ass awesome! It may not hold up as well but this was one of my favourite movies as a kid! Its got good characters, an interesting story, cool action, and an overall interesting premise."}, {"rating": "10", "text": "e    p    i    c    d    u    d    e"}, {"rating": "4", "text": "I cashed out at the McDonalds advertisement. Robert Rodriguez is very talented, with movies like El Mariachi, Desperado and recently Alita, he portrays quick witted protagonists.  This is well photographed, nicely edited and very well acted.  The red alert for parents in trouble came at a weird time. I find it difficult these days to sit through movies about happy families, loving and loyal.  Every family I ever saw was about competition and manipulation, with every member of the family having no other priority except to sabotage the others."}, {"rating": "7", "text": "It's a good movie, decent effects, likeable characters, and the sequel is pretty good to. It's to bad they released 3-D and the horrible spin-off Shark boy and Lava Girl."}, {"rating": "6", "text": "I was expecting a lot from Spy Kids. From the trailer it looked like cool and smart fun. Well, I got something completely different from what I expected. The film was cool with its gadgets and gizmos, neat one-liners and brilliant kid?s action sequences (which are not developed enough or long enough), but in the long run, this film was a disappointment. The plot was stupid beyond belief. I didn?t laugh that much. The film has high potential, is endlessly imaginative and brings up some cool creations, but I found the story laughable and the whole brother story just tired. The film was predictable and as soon as we get to Floop?s castle thing, the stupidity takes over. Those thumbs are just plain lame and although the flawless visuals are good to look at and the art direction is stunning, the walking-see-sensing thumb-people and colourful Floop TV companions are just stupid. The movie would?ve been much better if they had come up with something just as creative but not as laughable. The acting was pretty. The direction was pretty impressive and the visuals excel the most. The film dreams up excellent ideas and is creative, but the story and script are really quite low-key. With the sequel, get rid of those dumb-ass thumbs and companions, come up with a better story, cut the corn and get to the good stuff."}, {"rating": "6", "text": "Spy Kids isn't something terribly great, but kids will enjoy it with It's great performances, and a good voice acting. Overall, a good movie, that I recommend it mostly to children."}, {"rating": "7", "text": "Do not know if this movie is for adults or children."}, {"rating": "6", "text": "Spy Kids is actually better than I thought it would be. I looked awfully cheesy and disappointing. Instead it brought zany humor and weird plot elements. Its pure fun for everyone."}, {"rating": "10", "text": "Spy Kids is fresh, energetic and joyous with energy flowing the screen. Iam a big fan of Robert Rodriguez and his awesome films. This trademark film starring Alexa Vega and Antonio Banderas is gripping and fun. He has made a great film for kids and adults to enjoy. It does have flaws that are forgetful but overall, it's a GOOD movie, just plain cheesy fun for anyone who watches it. Spy Kids is epic."}, {"rating": "8", "text": "Playful and quirky, mixed in with a story of a dysfunctional and unorthodox family's struggle, fueled by a humorous sibling rivalry. The animation works into the eccentricity, and the acting is  well enough for 'Spy Kids' to be like a spontaneous roller-coaster, and a fun one at that. I had fun watching it, even today, while I'm in high school."}, {"rating": "7", "text": "Spy Kids is an enjoyable kids movie that may try to hard sometimes and take itself too seriously in some places, but ultimately is good for what it is."}, {"rating": "8", "text": "A spy comedy / family movie. It takes itself not that serious and just wants to entertain. This works well for me. The story is about the retired top spies Gregorio and Ingrid Cortez who have retired and are happily married with children. However they never told their kids about their past days as spies. One day they are called back into action and this starts the events of the movie. I am avoiding spoilers here. The story is humorous and entertains from start to finish. A lot comes from the strong cast and I will just praise all characters. Special bonus for Danny Trejo ;-). The humor is spot on and I laughed a lot during the movie. I want to praise the creativity and the up to eleven spy gadgets. Even Q from James Bond will be jealous. The effects looked good back then but I am not sure how those hold up. Overall I give an 8/10 and recommend it for its fun entertainment. Might not be art or an all time classic but don't needs to be."}, {"rating": "8", "text": "It is pretty awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "8", "text": "Spy Kids is another adventure waiting for you kids and adults out there. It may be out-of-place in some scenes, but nevertheless... it's an enjoyable movie."}, {"rating": "7", "text": "Spy Kids is a typical family movie for kids. Robert Rodriguez created a great film, one of the most recognizable children's films of the early 2000s. Not a bad cast, absurd plot and cheap CGI. Here's a formula for success. Surprisingly, Spy Kids can make you laugh and looks interesting. This is rare in children's films. Spy Kids have launched a whole franchise, for many, the first part will seem the best. Only the absence of a distinct antagonist and a crumpled ending disappoints. For me personally, Banderas's role in Spy Kids is one of the most familiar. Spy Kids can be recommended for viewing by all families with children."}, {"rating": "7", "text": "Gran película y una gran franquicia. A pesar de que la primera en algunas partes es algo densa, y a pesar de que los efectos especiales no envejecieron muy bien, mini espías siempre la recordaremos como unas aventuras épicas."}, {"rating": "7", "text": "this film it's for kids this film has a good story but some scenes are a bit unrealistic...you must see it if you like spy filmsage +5"}, {"rating": "10", "text": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film"}, {"rating": "7", "text": "A pretty decent kids movie. Probably the second best of the trilogy, from what I remember."}, {"rating": "8", "text": "----------------------------------8.4/10-----------------------------------"}, {"rating": "7", "text": "\"Spy Kids\" is an enjoyable, action-packed movie that would especially appeal to kids, but could please anyone watching it."}], "recommendations": ["jumanji_welcome_to_the_jungle", "monster_house", "hotel_transylvania_2", "puss_in_boots_the_last_wish", "hotel_transylvania", "alvin_and_the_chipmunks", "shazam", "spies_in_disguise", "ice_age_the_meltdown", "ice_age_continental_drift", "the_karate_kid", "despicable_me_2", "megamind", "goosebumps", "herbie_fully_loaded", "the_angry_birds_movie", "diary_of_a_wimpy_kid_dog_days", "peter_rabbit", "spy_kids_all_the_time_in_the_world", "ice_age_dawn_of_the_dinosaurs", "captain_underpants_the_first_epic_movie", "zathura_a_space_adventure", "jack_the_giant_slayer", "rise_of_the_guardians", "night_at_the_museum_battle_of_the_smithsonian"]}