{
  "id": 1141,
  "title": "Spy Kids 3-D: Game Over",
  "starring": [
    "Antonio Banderas",
    "Holland Taylor"
  ],
  "runtime": 84,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Family",
    "Science Fiction"
  ],
  "description": "Carmen's caught in a virtual reality game designed by the Kids' new nemesis, the Toymaker. It's up to Juni to save his sister, and ultimately the world.",
  "releaseYear": "2003",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oP53PyexPlQd1xDt8kkvX5LdQdT.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.555555555555555,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.5,
    "funny": 6.333333333333333,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Somebody Ring the Dinkster? Best part of the entire film. A perfect film for a perfect delivery of an iconic line from the most iconic character from the entire series."
    },
    {
      "rating": "7",
      "text": "i remember going to the theaters for this and it was lit. looking back at it now days its a mid level movie but was fun."
    },
    {
      "rating": "4",
      "text": "Spy Kids gets worse and worse with every new installment: the acting, the plot, the dialogue. The only thing that gets better is the special effects. Apparently, that is all people care about anymore."
    },
    {
      "rating": "4",
      "text": "The idea of 3-D is wisely used for \"Spy Kids 3-D\", but the other components, such as the story or acting, kinda lowered the bar for this film."
    },
    {
      "rating": "1",
      "text": "57? Are you kidding me? People think this movie is good? Did this director make me want to hate Sly Stallone? This movie was worthless **** The worst thing Elijah Wood has ever done and he was in it for 30 seconds"
    },
    {
      "rating": "9",
      "text": "it beats the second movie in just one shot and its an excellent movie in 3D."
    },
    {
      "rating": "2",
      "text": "The spy kids series just gets worse and worse as it goes along, not to mention the concept is a ripoff from the matrix series. 3-D doesn't make it any better. What ruined it the most, as did the other spy kids movies, is that the villians always turn good in the end!!! It's not cool, it's dumbness defined."
    },
    {
      "rating": "4",
      "text": "Horrible this movie is almost as bad as the Alex Rider film. Terrible acting way too much cgi and not many real actors. I mean compared to the first films this one falls apart."
    },
    {
      "rating": "4",
      "text": "La tercer entrega de la saga me pareció super innecesaria, las anteriores estuvieron muy bien con efectos bastante aceptables a su época, pero esta es una burla."
    },
    {
      "rating": "4",
      "text": "Spy Kids 3-D: Game Over has these flaws:1. Most of the movie takes place inside a video game called Game Over. Game Over is the equivalent to a book called \"The End\".2. TRASHY 3-D effects.3. Dumb jokes.4. Mediocre acting.5. Dull plot and ending.Plus side:1. More action.2. Not as bad as Spy Kids 4: All The Time In The World."
    },
    {
      "rating": "0",
      "text": "It's worst film which has been saw.This register want to drink my mocha in my toilet"
    },
    {
      "rating": "2",
      "text": "This movie sucked the first one was actually good but the seccond one got worse and this one just sucked."
    },
    {
      "rating": "4",
      "text": "Yeah, there were some good action sequences and all, but mostly, this movie was uneventful and, maybe between you and me, slightly boring."
    },
    {
      "rating": "4",
      "text": "THe main thing that ruined the movie was the THey have a lot of lines such as \"If you win, I get bonus points.\" It's following the same trail as JAWS."
    },
    {
      "rating": "4",
      "text": "The movie wasn't funny or gripping. But I don't hate the movie which is why I'm gonna give the film a 4."
    },
    {
      "rating": "4",
      "text": "It's bad .. it really is ... GAME OVER."
    },
    {
      "rating": "9",
      "text": "Spy Kids: Game Over 3D is well filmed and acted, with its corny humour added as a joke. Sly Stallone is our Rambo but not a comedian! He wasn't funny and was added for FUN. Rodriguez has also added excellent 3D popcorn magic that will boost the sales for this film. It was really good corny fun that satisfies. Must watch with flaws."
    },
    {
      "rating": "3",
      "text": "It fails to catch the charm of the first two movies or the aura of the video game community. It relies on the viewers understanding of the previous films' characters without attempting to expand upon them or the new ones introduced. Family themes and comedic spy jokes are now replaced with unfunny video game quirks that are too generic for even a gamer to enjoy. Mix in some terrible CGI and little relevant messages or references, Spy Kids 3D was as dated then as it is today."
    },
    {
      "rating": "9",
      "text": "Robert Rodriguez made a spy kids 2 which is okay  but then he made a 3rd one . Finally Robert Rodriguez made a spy kids action pack . the effects are stunning  and the fact that there playing a video game ."
    },
    {
      "rating": "10",
      "text": "only 3d movie besides AVATAR that is actually in 3D    =)"
    },
    {
      "rating": "7",
      "text": "I enjoyed the movie but have to amid it is not a masterpiece or art. It hits my soft spot for B-movies and is probably a bit in the “So bad it is good realm”. So be warned. It is the third movie in the “Spy Kids” franchise. This time like the title suggest it is set in a video game like virtual reality. The story starts when Juni Cortez is persuaded to a last mission as his sister is trapped in a virtual reality video game called “Game Over”. Because it will be released in a few hours million people can be trapped too. This is the set up for the story. It is a fun video game themed story. Maybe a bit to cliche and too many tropes but enjoyable for me. The cast of the previous movies return and deliver their roles. However the new characters area bit mixed. Especially Sylvester Stallone earned his golden raspberry well deserved (Not his fault as I think it was the script). The special effects were nice and fit the theme of the movie. Overall I think this is fun to watch and you should not overthink it too much. It is one of the turn your brains off movies to enjoy which to be fair can be hit or miss."
    },
    {
      "rating": "5",
      "text": "\"Spy Kids 3- D Game Over\" was a film entirely regulated by the visual and special effects , especially the 3-D vision was to overcome but it was not, even as we are left to wonder 8 years that was the last of the saga of Spy -Kids ?."
    },
    {
      "rating": "5",
      "text": "This Spy Kids repeatedly loses lives before it even get started, leaving itself with a game over, forcing us to replay it a second time, instantly to a third time, etc."
    },
    {
      "rating": "6",
      "text": "Spy Kids 3-D: Game Over is a pretty weak film in comparison to the first two movies. The premise of the movie is kinda cool, but it is ruined by the poor CGI environments and effects. I realize they are supposed to be in a video game, but the graphics are so bad that it makes the movie hard to keep watching."
    },
    {
      "rating": "5",
      "text": "I don't like watching this one. The acting was good, yet again though. The story was promising, but wasn't that good. The special effects seem worse also. It is worth a watch if you watched the other two."
    },
    {
      "rating": "4",
      "text": "This movie had it's chance to be the best in the series and had a lot of potential. Spy Kids 3 is a failure with awful visual effects that are easy to notice, tons of dull characters, dull gaming references (They just said the words Sega, Atari, Namco, Metroid and Halo), moments that barely have any emotions and a really terrible ending and plot twist (Villian is just asked to give up and the main character has to give up his crush, which really disappoints me)."
    },
    {
      "rating": "6",
      "text": "Mini Espias 3D le tengo muchísima nostalgia y tengo que decir que es la mas divertida de ver en lo personal, sin embargo, desde un punto de vista mas objetivo, creo que esta es la peor, a pesar de tener conceptos muy interesantes, y al menos a mi me gusto pasar de lo que inicialmente fue una parodia a James Bond a videojuegos en general, sin embargo, la ejecución debe bastante. Si no fuera por sus problemas creo que seria fácilmente la mejor de la saga.Primero que nada, de la trilogía se siente la mas apurada a nivel general, hay muchas cosas que quedan sin explicar como la relacion entre Toymaker y el abuelo y que hizo este para ser su enemigo y dejarlo discapacitado, así como la famosa frase \"Quien sabe, fue hace años\", cuando Juni pregunta sobre porque encerraron a Toymaker. Enserio, esta tiene que ser una de las excusas mas baratas que he visto en una pelicula para \"justificar\" un hueco argumental. Los guionistas eran tan vagos?!Tambien graficamente hay partes en las que destacan pero otras no... y el 3D... es bastante malito la verdad. No todas las escenas, pero si la mayoria. La pelicula tambien hace referencias a videojuegos pero estas se sienten desaprovechadas. Aun asi muchas escenas de accion son muy buenas, como la carrera por ejemplo, de las mejores escenas con diferencia. Ademas el DVD trae cosas muy interesantes, incluyendo un minijuego muy entretenido.La considero la peor de la trilogia, sin embargo, creo que esta lejos de ser mala, ya que en sus puntos mas altos creo que supera a la 2 que es mi favorita, aunque también tiene sus puntos mas bajos. A día de hoy la sigo viendo y me sigue divirtiendo. Solo espero que si llegan a hacer otra similar a esta no pongan una excusa barata como \"Quien sabe fue hace años\" o algo así porque los huecos argumentales son fallos importantes, y que se burlen del espectador de esa forma no es gracioso."
    },
    {
      "rating": "10",
      "text": "Ready Player One is but a shallow knock off of Spy Kids 3-D. Where Ready Player One is filled with vapid fan service and shiny CG, Spy Kids has heart and the characters show growth throughout their journey. The relationship between Juni and Dmitria had a a strong impact on me, much more than Wade and Artemis could ever have. Dmitria's sacrifice for Juni had weight, as she presumably died when the game was shut down. There were also strong themes about family ties and family being bigger than your bloodline which I appreciated."
    },
    {
      "rating": "3",
      "text": "What is this film? Elijah Wood shouldn't have agreed to be in the movie. The film is bad.The 3-D effects are bland, minus 1 point;The CGI was awful for 2003, and even worse than the first two movies' CGI. Also, they overused CGI, and it doesn't hold up, it did not age well at all, minus 1 point;There are MANY cliches in the film, from the concept of \"The Guy\" is WAY too similar to the Matrix's \"The One\" and Harry Potter's \"The Chosen One.\" And then comes the worst part, Elijah Wood's appearence that only lasted seconds until he immediately died. Minus 1 point;But the actors did an alright job at performing their famous roles, so there goes the only plus 1 point.All in all, the film gets a 3/10 from me."
    },
    {
      "rating": "10",
      "text": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film"
    },
    {
      "rating": "8",
      "text": "This movie is so over the top crazy and cheesy that it somehow is better than the movies that are trying harder than it. Amazing."
    },
    {
      "rating": "6",
      "text": "----------------------------------6.4/10-----------------------------------"
    },
    {
      "rating": "4",
      "text": "A blah, overdone third movie in the Spy Kid series that should have just been left out.  Not to mention the CGI is really bad."
    }
  ],
  "recommendations": [
    "tomb_raider",
    "teenage_mutant_ninja_turtles",
    "doom",
    "mortal_kombat_annihilation",
    "hitman_agent_47",
    "rampage",
    "mortal_kombat",
    "transformers_revenge_of_the_fallen",
    "silent_hill_revelation_3d",
    "prince_of_persia_the_sands_of_time",
    "monster_hunter",
    "lara_croft_tomb_raider",
    "hitman",
    "battleship",
    "the_mummy_tomb_of_the_dragon_emperor",
    "resident_evil_damnation",
    "uncharted",
    "spy_kids_all_the_time_in_the_world",
    "silent_hill",
    "the_angry_birds_movie",
    "bloodshot",
    "yu_gi_oh_the_movie",
    "i_am_number_four",
    "pixels",
    "xxx_return_of_xander_cage"
  ]
}