{"id": 1885, "title": "Spy Kids: All the Time in the World", "starring": ["Jessica Alba", "Joel McHale"], "runtime": 89, "genre": ["Family", "Comedy", "Action"], "description": "Eight years after the third film, the OSS has become the world's top spy agency, while the Spy Kids department has since become defunct. A retired spy Marissa is thrown back into the action along with her stepchildren when a maniacal Timekeeper attempts to take over the world. In order to save the world, Rebecca and Cecil must team up with their hated stepmother. Carmen and Juni have since also grown up and will provide gadgets to them.", "releaseYear": "2011", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/9pUVarhiXfCu8amjmyadzJJJITi.jpg", "categories": {"plot": 3.25, "acting": 2.1, "ending": 3.6, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 1.4545454545454546, "funny": 1.2, "action": 3.0}, "reviews": [{"rating": "2", "text": "For once, I'm a big fan of the Spy Kids movies, all 3 of them. Although Spy Kids 3 wasn't that great for 3-D viewing just the 2-D is way better. A fourth installment with no Carmen and Juni may seem feel a little queasy and with a long set of casting, I have no other choice but to make Spy Kids: All the Time in the World needs to put this franchise into bedtime. And on second thought, a wasteless movie of the so-called \"4-D\" \"Aroma-Scope.\" It will make your eyes scanned into a lava pit."}, {"rating": "1", "text": "Super blah!!!! This is a huge disappointment to the spy kids series. This is a slap in the face for the spy kids lovers. Super boring and nothing intresting. But the movie was hilarious to me....because it sucked so much. I kept laughingn because the movie is horrible. Writing, directing, acting sucked every bit."}, {"rating": "1", "text": "Skip-it - This spy family film's \"clever\" 4-D concept with scratch-and-sniff cards might be more intriguing if the movie didn't smell like poop and puke - but maybe director Robert Rodriguez just wanted the fourth dimension to stink as bad as the other three?"}, {"rating": "1", "text": "Why ? Just why they had to destroy the perfect trilogy of '' Spy Kids \" ? But no, they had to make a fourth one. The kids weren't that adorable. They seemed like ordinary children fighting with one and another. Plus, the girl named Rebecca (Rowan Blanchard, whoever she is) is a little brat, not likable as a character. The jokes are stupid and immature. Once in the movie, there was literally three fart jokes in a row. The humor was cheesy and painful to watch (because of the embarrassment for the actors). There was also a spy dog (of course) named Argonaut, with a British accent. It's like if it's supposed to make the audience think that there having a good time. It has cheesy spy lines and scenes (for example, when the villain says '' you're to late '' or some **** like that). The '' action '' is sometimes ridiculously exaggerated. When the kid throws balls on the floor, the guards are falling so hard (like there doing back flips). I like the fact that they brought back the original spy kids (Carmen Cortez and  Juni Cortez). It was fun seeing them older. So has a kid, I enjoyed the first three Spy Kids movies, but the fourth one was unnecessary to make."}, {"rating": "1", "text": "With incredibly large amounts of cheap-looking CGI, unfunny toilet humor, bland and uninteresting characters, and the fact that it has even more terribly implemented gimmicks than Game Over did (now with a repertoire of indistinguishable smells), Spy Kids 4D is proof that the franchise has seriously lost its charm and - fittingly - its identity. Stick with the first two movies, as they are vastly superior to this load of gimmicky tripe."}, {"rating": "1", "text": "This is one of the worst films I have EVER seen. I literally fell asleep from boredom of it and that's a first. NONE of the actors can actually act and they are awful at it. The director has made an awful mess of it. For example in one scene they're all fighting, then the little girl stops and start talking and you can see that all around her the baddies are just jumping up and down on the spot. Finally, the film is just plain stupid. For example the dad actually creates a spy tracker which can actually detect real spies. That's just ridiculous. Also, in the end it wouldn't have mattered whether they had or hadn't stopped the baddie which just makes the whole thing pointless. The only good thing about this film was the talking dog."}, {"rating": "1", "text": "This is a total waste of time if it wasn't aimed at children. You don't want to see this without your child that is for sure. I felt that the movie was weakly written (except for the dog in the movie). This movie is offered in 4D and that means that we got a card and it was in Smell-O-Vision of some sort. The thing that turned me off this movie the most was the fact that they aim it at children, but have to say \"OH Shi---taki mushrooms. What the heck is that all about. The comedy that the dog gave was funny. I guess they were trying to keep the parents who had to suffer through this entertained, but they failed miserably. You have to take your child to go see this only for the fact that they're going to love it and it is always fun to watch the children react to the different scenes. The 3D was good and my daughter kept trying to reach for the things floating around. You are going to laugh at some points, but for an overall movie, you might want to skip this. They make you smell poop for heavens sake!"}, {"rating": "1", "text": "What a way to ruin my childhood memories it wasnt good and lame. they should a stayed with 3 and not make 4. THANKYOU FOR RUINING MY CHILDHOOD MOVIE FAV. =("}, {"rating": "1", "text": "disgustingly bad.  So afully bad and so painful to watch that it is possibly, the 2nd. Worst Movie of the Decade (followed by GR2)..!!!!!!!!! And I really mean by the mother of the worst 2011 movies!"}, {"rating": "3", "text": "First and foremost, realize that this is a movie for young kids.  That said, the fact that your making a movie for kids does not mean that it does not need a coherent plot, sincere acting or thoughtful direction.\r The movie is cute.  The kids, played by Rowan Blanchard and Mason Cook, are by far the best part.  They're cute, they seem to enjoy themselves for the most part.  Rowan Blanchard in particular showed a good range of character and emotion.  As well Jeremy Piven was great.  He seemed to have fun with the role, and seemed to really try to do what he could within the constraints of the script and the direction.  Ricky Gervais as the voice of the dog was also great, but again, within the script and direction.\r I can't help but feel that they, and this movie as a whole, could have shined, if only ....\r First, the biggest problem with this movie is that the vast majority of the humor involves farts, vomit and poop.  I think that's an insult to kids everywhere.  You can walk up to a kid almost anywhere, make a funny face and say \"Poo-Poo\" and get a laugh.  It doesn't mean it's actually funny.  The humor was an embarrassment.\r The script needed to be tighter.  It's like they started with a great idea, and then a whole bunch of people got involved and said \"Yeah, but wouldn't it be better if ...\"  No.  It wouldn't.  The script needed a lot of trimming, especially with the throwaway subplot of the Dad's failed TV career.  It was just too rushed.  And that's just ONE example.  Ironically, in a movie absolutely overflowing with idioms and metaphors about TIME, the writers tried to cram too many ideas into too little time.  Focus, people!\r The movie would have been better without the baby.  I would just eliminate her from the plot completely. What I really liked in the writing was the message about spending time with family.  They did sort of bludgeon the message to death, but I liked the fact that they focused not only on the time parents spend with their kids, but the time kids are willing to spend with their parents.  They showed neglectful parents AND neglectful kids, and I liked that.  That message, in a better, more focused plot, would have gone down a lot better.\r Finally, I enjoyed seeing Alexa Vega and Daryl Sabara back as Carmen and Juni Cortez ... BUT, I feel that they were only really INTO this movie when they were TOGETHER.  Together, they had chemistry, and familiarity and fun.  Apart ... they just seemed distant and dislocated.  And again, we COULD have made the movie without them.  It was nice to see the original Spy Kids all grown up, but it was subplot we could have trimmed and not really known it was gone.\r Overall, this was NOT a horrible movie, but it could have been a lot better."}, {"rating": "0", "text": "I think Rodriguez was surprised that this was his movie. It loses it's Spy Kids taste with no humor (or should I say nice try at trying to be funny) and unflavored action. It also gives us awful performances by not only Alba and the family but also by the reuniting cast of the old Spy Kids, which also made the film unneccesary. Robert Rodriguez's worst direction ever."}, {"rating": "0", "text": "Not good and even it is not a paper thin fun, the worst movie ever that is meant to give families a good time."}, {"rating": "1", "text": "This movie is just very god-awful  its loses the humor and the action that all spy kid movies have it is very stupid I had to watch this movie it was awful in every level story, action and elements. I loved the spy kids movies now it felt like the director was just being cheap and lazy. The actors just sounded lazy when they did this move."}, {"rating": "3", "text": "8 Years after of the third movie of \"Spy Kids\" this movie is totally worst than I thought , and the worst movie of the saga as to script and visual effects."}, {"rating": "5", "text": "I took my 8 yr old grandson to see this movie.  He seemed to enjoy it. Out theater didn't show it in 3D. I found it to be quite borring.  The theater gave us cards to smell at different times and I thought thay all smelled the same.  My grandson they all smelled like soap."}, {"rating": "5", "text": "A very disappointing movie. After 8 years it seems that Robert Zemeckis has lost the charm of the original movies. Also, there is an extremely high overusage of CGI. About 80% of the movie is filmed in front of a green screen."}, {"rating": "8", "text": "I have seen all four spy kids movies. This movie was good, but not good enough. You like the kids, and i likes how they showed the original kids as adults in the movie, but it just wasn't enough. The movie itself was good. It mimiced the first movie very well. If you had to compare movie one to movie four, movie one wins. On it's own, however, it is pretty good. I don't believe it deserves to be bombed, but it doesn't deserve anything above an 8 at all. Also, let me warn you. The aromascope didn't work, and I never expected it too. Being able to smell things on the screen doesn't enhance the movie at all. It isn't a proper use of any future 4D tools."}, {"rating": "5", "text": "Yes, it certainly is disappointing  that Robert Zemeckis lost the magic of these movies, especially since he has had nothing to do with any of them. This is unabashedly a movie made for kids. It isn't meant to be a new Kill Bill. I'm sure the target audience will love it."}, {"rating": "7", "text": "This was a good spy movie with cool gadgets and a decent silly story.I like the 4-D,it was wonderfull and weird with the smells.the hammerheads and the electro-whip were sweet and worthy of the action like it promised,but this movie is better than the others.that dog was the robot action hero I have seen for the story,but the ending wasn't that much of a fight."}, {"rating": "8", "text": "It's practically impossible, 8 years after Game Over, but Robert Rodriguez makes a higher than adequate fourth instalment that still seems fresh. I don't see why this has the rating it has. Most of this is fast-paced nostalgic kiddie fare. If more kids were logged in to Metacritic, I can see a higher rating than this."}, {"rating": "7", "text": "All the reviews I've read here are based on the perspective of adults who've seen all the previous Spy Kids movies. Here's the perspective of two kids, aged 7 and 9, and their parents, none of whom were actually aware (shock horror) that other Spy Kids films existed:\rWe all thought it was a lot of of fun: silly, funny, hyperactive fun. I chuckled and was engaged, and the insubstantial silliness of the plot was just fine with me: it sort of reminded me of the old Batman TV series.\rMy kids rated it 10 and 9 respectively.\rI do think, when reviewing a kids' film it's worth remembering:\ra: Despite film-makers' strenuous attempts to make kid's films appeal to parents, what the kids think of it is pretty much the main thing.\rb: Under-10s watching a film released in 2011 will not be comparing it with other, related films made before they were born, so the comparison is academic: do try to judge a film on its own terms.\rSo, if your kids are miniature Mark Kermodes, or you've seen the other films and demand a fulfilling movie-going experience for yourself, probably best to steer clear. Otherwise, dare I say it, it's really cool."}, {"rating": "1", "text": "Spy Kids 4 is a film, whose target audience - children under 12. Despite this fact, film is full of toilet humour and jokes, which children can't understand. Aroma-scope is the next advertising course, smells even at first have seemed to me identical. 3D effects has been done very bad even in difference from Spy Kids 3: Game Over. Undoubtedly,Spy Kids 4 has been created to earn more money on children and fans of the Spy Kids. Do not  spend money for visiting this film, visit theater or circus with family is better"}, {"rating": "7", "text": "I've seen better in a way none of the franchise seguencias the family managed to meet Roberto Rodriguez, the first movie was well produced, in a way, this film brings a totally new experience visual effects and content, as long shorts, their films are gone, like the movie because it is not a definitive final sequence, but a definite beginning"}, {"rating": "0", "text": "Do not see this movie. This movie, is an utter disgrace to the genre of spies. The acting is downright horrible, the CG is horrible, and the jokes are utterly painful to sit through. And if people were to say to me: \"Well what do you expect? Its main audience is children.\", that still does not give it a free pass (No one in the theatre even laughed, not even the kids). Oh and one last thing: The villian is completely stupid. His mask is so bad that it makes me laugh to tears, and his plan, if done in reality, would bring about the end of time. Overall, it is a stupid movie."}, {"rating": "0", "text": "the worst !!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "1", "text": "Almost thirty years ago, John Waters released a version of his absurd satire Polyester with a scratch and sniff card he called Odorama. The gimmick was a loving throwback to the 1960 film Scent Of A Mystery that was shown in Smell-O-Vision, but like most of Waters’ homages, the olfactory obnoxiousness actually fit the tone of the film. With a female protagonist cursed by an acute, almost uncanny sense of smell, a son who regularly got high on glue and a plot featuring a skuzzy porn theater and foot fetishes, those occasional whiffs of rancid putrescence were like horrifying and hilarious sniffs inside Polyester’s outlandish world. The film may not have needed Odorama, but it certainly benefitted from it. The same cannot be said for Spy Kids: All The Time In The World. Robert Rodriguez is a good director. He’s made some wonderful movies in the past, but focus has to be altered based on subject matter. Traditionally, it is better for characters to have heart and clearly defined reasons for their actions, but in a film as absurd as Spy Kids 4, those specifics don’t really need to waffle, alter and say something bigger about life. More is not always better, especially when it suffocates the joy that should be inherent in a project like this. It’s not a total loss. There are a handful of scenes in Spy Kids 4 that really do work. Somewhere, hidden beneath all the forced hugs, there’s a lot of fun to be had, but ultimately, that digging just isn’t worth it, even if you do get some cool scents along the way."}, {"rating": "0", "text": "Worst Film EVER!!!\r Pros\rNONE\r Cons\rTerrible Story\rWorst Screenplay in film history\rBoring\rBaby\rNot even appealing to kids\rAwful Characters\rPredictable"}, {"rating": "3", "text": "Terrible film. Spy Kids 3 was pretty cool to me, and I was so shocked to see this fourth installment go down so quickly. One of the reasons you should never see any Robert Rodriguez movies (except Sin City)."}, {"rating": "3", "text": "This is the final nail in the coffin for the spy kids franchise, the third movie should have been the conclusion but years later they shoot it in the head with this garbage"}, {"rating": "2", "text": "It is impossible for a movie that children can be secret agents be this low-graded, but Spy Kids: All the Time in the World (and it is the first 2010 movie and the first in the series to use the Aroma-scope) manages to have overblown the family ride."}, {"rating": "5", "text": "Spy Kids: All The Time In The World is an unenjoyable movie. The new characters are just not the same as the original, the movie isn't able to live up to the level of the original unfortunately."}, {"rating": "6", "text": "Better than three, worse than the original two. The acting needed some work, but not much at all. The special effects have improved, but still are not good. It is worth a watch though."}, {"rating": "0", "text": "Spy Kids is a horrible franchise movie, an unnecessary and stupid remake/sequel."}, {"rating": "3", "text": "Mini Espias 4 no resalta en nada, y ha perdido toda la personalidad y carisma con respecto a las anteriores. Se siente como una de las secuelas mas perezosas que he visto en mucho tiempo. Las únicas escenas medio salvables son en las que aluden a la nostalgia en algunas partes con Carmen y Juni, pero el resto es horrible, una historia predecible, genérica y mal ejecutada, los nuevos espías son muy irritantes y poco inteligentes y el villano ni hablar. Hasta debo de decir que los extras que vienen con el DVD me gustaron incluso mas que la película en si!La saga ha muerto... al menos por el momento."}, {"rating": "4", "text": "The charm of Jessica Alba really makes this movie so much better than it would have been otherwise... lmfao honestly it’s one of the only good aspects of this movie"}, {"rating": "0", "text": "I think I speak for everyone when they said they ruined one of their best possible movies with people in those years,Spy Kids: All the Time in the World is rubbish NO use"}, {"rating": "1", "text": "Guys why do you gotta keep bringing back kids movies that are trilogies and then ruining every single aspect of thembesides the dog he's cool"}], "recommendations": ["diary_of_a_wimpy_kid_the_long_haul", "the_smurfs", "the_boss_baby_family_business", "chicken_little", "alvin_and_the_chipmunks_chipwrecked", "home_sweet_home_alone", "ice_age_dawn_of_the_dinosaurs", "free_birds", "rim_of_the_world", "herbie_fully_loaded", "minions", "night_at_the_museum_battle_of_the_smithsonian", "the_game_plan", "the_babysitter_killer_queen", "the_angry_birds_movie", "we_can_be_heroes", "yogi_bear", "alvin_and_the_chipmunks_the_road_chip", "uglydolls", "cloudy_with_a_chance_of_meatballs", "alvin_and_the_chipmunks_the_squeakquel", "the_croods_a_new_age", "kangaroo_jack", "diary_of_a_wimpy_kid_dog_days", "g_force"]}