{
  "id": 3552,
  "title": "Stand by Me Doraemon 2",
  "starring": [
    "Wasabi Mizuta",
    "Megumi Oohara"
  ],
  "runtime": 96,
  "genre": [
    "Animation",
    "Family",
    "Science Fiction"
  ],
  "description": "He and her beloved Shizuka are finally married! Nobita's childhood dream was supposed to come true on his wedding day, but for some reason, Nobita doesn't show up... One of the most popular episodes from the original story transcends time and space, and leads to Nobita's future. Doraemon and Nobita's great adventure begins in order to fulfill his grandmother's wish to see his bride at first sight. This is a story of tears and bonds, set in the past, present and future.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vBv8iOFPLnXmtELUjcFc7OKHsR4.jpg",
  "categories": {
    "plot": 8.636363636363637,
    "acting": 8.5625,
    "ending": 9.333333333333334,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 8.333333333333334,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I saw Stand By Me yesterday for the first time in one and a half years, (I'm 17) and I absolutely loved it, and it is definitely one of my favourite Stephen King adaptations. I will say I absolutely loved Shawshank Redemption, and despite the fact that it was unfaithful to the book, and badly flawed, I liked It too.Stand By Me, based on the novella by Stephen King, which I admit I haven't read, not only has a wonderfully engaging story, but it is both funny and moving. This is helped by the strong and wholly believable performances from the entire cast that include Kiefer Sutherland, John Cusack, Wil Wheaton, Corey Feldman, Jerry O'Conell and River Pheonix especially.The script was very well-crafted, and the film tells brilliantly of the values of friendship and standing together. Other strengths were the beautiful photography and the fine direction from Rob Reiner. But what impressed me most about Stand By Me was not only its nostalgic feel, but despite the hour and a half running time, the characters particularly Chris were so well developed. And I mustn't forget the beautiful song Stand By Me over the end credits.A beautiful, unforgettable film, with a definite 10/10. Bethany Cox."
    },
    {
      "rating": "10",
      "text": "Stand By Me was so great! I loved it so much! It was really heart warming and a generous film."
    },
    {
      "rating": "1",
      "text": "Its hard for me to watch the movie Stand by me or to  listen to the song. A little girl I babysit & her family died after watching this movie. They were living in a duplex it caught fire! The night this movie was playing she went to watch it at the theatre with another little girl I babysit. On her way home they were singing that song. There was a lot of questions about her death her mom & 2 brothers deaths! Her dad left shortly after. They said supposly a wire malfunction. But there were way too many unanswered questions!!"
    },
    {
      "rating": "10",
      "text": "I wholeheartedly recommend this film to everyone. It's amazing in every way and, if is the first time you see it, it will surprise you. If it is the twentieth time you've seen it, it still keeps all of it's magic intact. for full review: https://latetothegame.blog/2018/04/12/key-movies-of-my-life-stand-by-me-1986/"
    },
    {
      "rating": "7",
      "text": "In my mind, it suffers when you compare it to other teen flicks of the time such as The Goonies or The Lost Boys, but it's still an example of look-back nostalgia with mature dialogue coming out of teenage boys' mouths, which I can get behind."
    },
    {
      "rating": "10",
      "text": "This is one of the greatest films of all time. A life-affirming tale of going on your own, relying only on friends after family support falls through, and having the courage to face constant disparagement from the world. A rare movie that has stayed with me in the back of my mind my entire life."
    },
    {
      "rating": "8",
      "text": "Growing up is tough, but somehow magical as well. Stand By Me is about four friends who set out on what is most likely going to be their last adventure together before reaching junior high and going their separate ways. Of course they don't know this at the time. They're just a bunch of kids who want to see a dead body. The trip there is a doozy though, and in more ways than one. On top of finding themselves in some crazy and even dangerous situations, these youngsters must come face-to-face with some of life's hard truths as well as the first taste of their own mortality. It's some pretty heavy stuff. Especially with the likes of the already world-weary at the age of 12 River Phoenix and the forgotten by his own parents Wil Wheaton leading the way.It's not all gloom and doom though. In fact, Stand By Me much less dreary than the Stephen King novella \"The Body\" that it's based on. There are plenty of comedic moments stemming from the kind of silly, risky hijinks and vulgar banter that could only come from a group of young males. It's got all of the original story's heart, and none of it's occasional mean-spiritedness. What it doesn't have is good child acting. While I'm sure it was fine for the era, unless people are just watching it now through rose-tinted glasses, nobody is really going to view these youngsters as the crème de la crème at that point in time, despite them all growing up to be much more talented. Luckily, their genuine devotion to the material and strong direction from Rob Reiner ensure that none of the emotion is lost.It's the kind of movie that will bring back fond memories of childhood friends and the time you spent with them. You'll be nostalgic for the fun, mystery, and even the heartbreak of youth. An effective drama that will reach the kid in you by getting in touch with the adult who more fully understands the real reasons these kids are struggling with their lives in a way one just can't at that age. It has the power to make you laugh and maybe even cry. In a way Rob Reiner has made it possible to feel like you're going along with the kids onscreen. To me, it's worth putting up with the poor acting and low-budget production in order to experience something like that.8.2/10"
    },
    {
      "rating": "10",
      "text": "One of the few occasions that Stephen KIng strays from the horror genre. Never before has the end of innocence been portrayed like this, with a bittersweet but pleasant nostalgic flavor. One of the essentials of the 80s."
    },
    {
      "rating": "8",
      "text": "The source material, director, and young actors all wondrously caught lightning in a bottle with this timeless ode to adolescence."
    },
    {
      "rating": "8",
      "text": "its beauty and horror..Stand By MeStand By Me is a character driven drama about a group of guys leaving for an adventure without any supervision into the wild nature which changes them through its beauty and horror. As the premise guides you, it is layered and has a metaphorical tone that is depicted through a bunch of teenage kids which is pure masterful storytelling. The chemistry among the characters communicates fluently and the credit goes to the writer who installs these little tactics that can easily resonate with each generation. The structure doesn't divide itself into various acts, it's just a big marvelous adventure of love, laugh and life. The writing is adaptive and strong with humorous sketchy bits that never leaves the bridge of practicality. It follows probably the best structure of the script as in, it starts funny and light and then grows a bit sensitive and sensible with a heartfelt ending that echoes through the audience even after one leaves the screen. The background score may not be up to the mark but the cinematography and editing is purely magical in here. Devouring the nature in each aspects, the camera work is beautiful with stunning visuals and mesmerizing location that helps foliate it. Having said that, it also has a poignancy that can be inedible for the viewers and some boldy essential questions are raised too.The young cast shows some promising skills, if doesn't go as anticipated it certainly works, the performance is in safe hands. Reiner's execution delivers unflinchingly in here and shows tremendous amount of finesse with the help of explicit adaptation. Teenage bonding, stunning visuals and a poetic tone are the high points of the feature. Stand By Me is not one's typical teenager feature, it speaks to all generations and has the potential to walk through decades."
    },
    {
      "rating": "9",
      "text": "\"Stand By Me\" is the definition of a classic. Wheaton, Phoenix, O'Connell, and Feldman's dynamic, as well as the nostalgic, relaxed setting of the 1950s make it no wonder that Stephen King stated this was his favourite adaptation of any of his works."
    },
    {
      "rating": "9",
      "text": "An iconic 80's film. A film about kids who search for a dead body who knew that it would be an amazing film. I bet most people would say its just kids walking on railroads and talking. So, SCREW THEM!!!"
    },
    {
      "rating": "8",
      "text": "This is absolutely stunning. Watching this was an emotionally draining experience of varying proportion, each one perfect. The main cast is phenomenal!"
    },
    {
      "rating": "8",
      "text": "A warm film that stirred memories of growing up. Well acted and well-formed characters represented well by the child actors. A deserved classic."
    },
    {
      "rating": "10",
      "text": "How any \"professional\" movie critic gives this film anything less than an 8 is beyond me.  It's a classic.  Story is phenomenal, characters are great.  Demenstrates the relationship/friendships that young boys have growing up accurately.  Definately recommend"
    },
    {
      "rating": "6",
      "text": "Es una corta película, con personajes carismáticos y momentos conmovedores."
    },
    {
      "rating": "10",
      "text": "يرتكز هذا الفيلم حول فكرة أساسية : الصداقة في زمن الطفولة. الصداقة الحقيقية والتي تعبث بها السنون كلما تقدم بنا العمر. ولكن يبقى أثرها محفورا في نفوسنا!قصة أربعة مراهقين في الثانية عشرة من العمر، يخوضون مغامرةً بحماس المراهق المستكشف بحثاً عن جثة طفلٍ مفقود في بلدتهم الصغيرة. الجثة ليست هي محور القصة، بل الصداقة وما تُخبؤه لهم ثنايا رحلتهم العجيبة. هذا المرحُ الكبير الذي يتسلل إلى كل طفلٍ في نفوسنا حينما نشاهد الفيلم. أداءٌ  مبهرٌ لتلك الفتية المميزة : غوردي (ويل وايتون) وتيدي - كوري فيلدمان - و ڤيرن - جيري أوكونيل - و كريس - ريفر فونيكس والذي ترشّح لاحقاً لنيل جائزة الأوسكار عن فئة أفضل ممثل ثانوي لدوره في فيلم المعلم العظيم سيدني لاميت Running on Empty ولكنّ الأخ الأكبر للممثل الموهبة جواكين فينيكس لم يحظَ بفرصة جيدة في السينما بسبب وفاته المبكرة المفجعة في العام ١٩٩٣ بجرعة كوكايين زائدة! غوردي فقد أخاه الأكبر قبل شهور خلت. أخوه الذي دعمه في موهبته - الكتابة--وسانده وسطَ عدم اكتراث أبويه لا بل استهزاء والده الدائم وسخريته. يواجه غوردي كابوساً دائمأ حيث يرى أباه يلتفت إليه لحظة دفن أخيه الأكبر ويهمس إليه : كان يجب أن تكون أنت الميت، أنت بلا فائدة!في البرية، وحينما يصلون إلى الجثة، يقف غوردي شارد المخيلة بالجثة،. هائماً على وجهه. هنا يلتفت كريس إليه، وهو الصديق الأقرب إليه في المجموعة، يتقدم إليه ويسأله : ما بك؟! يسرد عليه غوردي كابوسه المؤرّق قائلاً : كان يجب أن أكون أنا! أبي يقول ذلك دوماً، أبي يكرهني يا صديقي! هنا يرد كريس على خوفه بإجابة مذهلة، فيها الكثير من عبق الصداقة الحقيقية :لا يا صديقي، أبوك لا يكرهك، أبوك فقط لا يعرفك! بالله عليكم تفكروا في تلك الكلمات المدهشة. هذا المشهد يُسجل ضمن المشاهد الخالدة لروب راينر. التصوير في هذا الفيلم بالكامل هو خارجي.تتنقل كاميرا المخرج بين أحياء البلدة والمزرعة والبرية وخط سكة القطار، مما ساعده على إضفاء ألوان الحياة على فيلمه. الموسيقى المنتقاة صائبةٌ جداً. أغنية every day لـ Buddy Holly ،واختتام الفيلم بأغنية stand by me لـ Ben E King والذي انبثق إسم الفيلم منها!الإخراج كان هادئا رصينا ومتقناً، اعتمد راينر أسلوب السهل الممتنع، وزاد رونق الفيلم جمالاً براعة الممثلين الأطفال... باختصار، هذا الفيلم يدخل ضمن قائمة الأفلام العظيمة..."
    },
    {
      "rating": "8",
      "text": "A captivating story about a group of friends setting off on a journey that confronts them with situations that force them into the harsh realities of growing. A wonderful coming of age story."
    },
    {
      "rating": "8",
      "text": "this one is always close to me, River Phoenix such an amazing actor with so much potential, it's an easy movie, flow amazingly with the friendship and journey but also depicted it with instinctive and natural way. The essence of coming of age is also near and brought up nicely."
    },
    {
      "rating": "8",
      "text": "Pure nostalgia. I gotta admit that I found some of the characters pretty annoying, but I also discovered some of my all-time faves as Will Wheaton's Gordie and River Phoenix's Chris."
    },
    {
      "rating": "9",
      "text": "A youthful recollection of 1950's childhood, \"Stand By Me\" uses nostalgia not as an easy bargain, but as a loving exchange between two bright stakeholders- the audience and the film crew as they both embellish exuberant delight.\u2028 A special mention to the young cast of actors here for pulling off believable shenanigans and dramatic revelations."
    },
    {
      "rating": "10",
      "text": "A writer who is devasted by the loss of a life-long friend reflects on his most pleasant memory with him is a message that he is a fully dedicated individual. I have a slight comparison to this character by not having many friends, and when I watched this film, it took a load of my breath away."
    }
  ],
  "recommendations": [
    "call_me_by_your_name",
    "the_glass_castle",
    "the_florida_project",
    "captain_fantastic",
    "lion",
    "a_monster_calls",
    "moonrise_kingdom",
    "five_feet_apart",
    "christopher_robin",
    "the_age_of_adaline",
    "lady_bird",
    "belfast",
    "gifted",
    "about_time",
    "blue_valentine",
    "the_perks_of_being_a_wallflower",
    "the_spectacular_now",
    "minari",
    "me_before_you",
    "the_big_sick",
    "20th_century_women",
    "the_edge_of_seventeen",
    "me_and_earl_and_the_dying_girl",
    "legends_of_the_fall",
    "goodbye_christopher_robin"
  ]
}