{
  "id": 263,
  "title": "Star Wars",
  "starring": [
    "Mark Hamill",
    "Harrison Ford"
  ],
  "runtime": 121,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
  "releaseYear": "1977",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
  "categories": {
    "plot": 9.333333333333334,
    "acting": 9.588235294117647,
    "ending": 8.8,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 9.5,
    "action": 9.090909090909092
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This was the movie that started it all. The reason the Star Wars saga still influences us in our daily lives was because of this one movie. Thank you George Lucas for giving us a masterpiece and creating the best saga ever!"
    },
    {
      "rating": "9",
      "text": "This was a revolutionary movie that established scifi as a financially popular genre and allowed many more movies to come to the fore. The backstory might even be better than the actual movie."
    },
    {
      "rating": "8",
      "text": "I don't think anyone can doubt the cult and classic status of this film. Great characters,original idea and  an interesting storyline make it a good film. However, why not a 9 or a 10 then? Well, it probably doesn't help that I'm not the biggest fan of sci-fi blockbusters and to some people the chase sequence near the end is the best part but for me it goes on a little to long. Although vader is a classic image I don't think he is enough of an enigma. A shout out to Harrison Ford though,a great performance."
    },
    {
      "rating": "10",
      "text": "Definitely one of the best movies of all time, a classic that forever changed the Sci-Fi genre forever with its improvised special effects visuals and sounds that became staples of the Sci-Fi movies, TV shows and Video games of the future. The musical score was absolutely amazing, John Williams is a great composer who added a lot to many great Hollywood films. The main characters were all great actors and actresses. (only the minor characters sucked \"look sir droids!\", etc. lol). The movie even accidentally spawned an amazing line of toys too! This film was epic and very few come to mind when I try to think of movies as epic that have been released since then."
    },
    {
      "rating": "9",
      "text": "虽然没有炫目的特效，但本片仍是所有科幻电影中的佼佼者，电影故事精彩，配乐激赞，拥有丰富的人物角色，外星人的设计都很有趣，现在看1977年的特效还是很为当时的电影人感到佩服。"
    },
    {
      "rating": "8",
      "text": "Yes, this is a good movie, but not QUITE the classic I'd always been conditioned to expect. (That honour I reserve for 'The Empire Strikes Back'.) While the action is pretty thrilling, it also takes a while to get off the ground (no pun intended), which may have something to do with how heavy it is on the exposition, especially with the opening crawl. (Even if the movie was being funded by a then-dying studio, that's no excuse to disregard that old rule 'show, don't tell'.)\r Having said that, I can see why this flick is so beloved. There's going into space, two protagonists who are more like us than we want to admit, and of course, what nearly everyone wants to do: saving the world. It looks really good, especially for 1977, though seeing as I had to watch the remastered version, the CGI sticks out pretty clearly.\r It's worth your time to watch it, just a bit less so than its first sequel and later works like 'The Matrix' and 'Serenity'."
    },
    {
      "rating": "8",
      "text": "This sci-fi classic was the perfect start to one of the greatest film sagas of all time, featuring great characters, good performances, an intriguing story and the greatest villain in cinema history (who also has the most famous breath in cinema history)."
    },
    {
      "rating": "10",
      "text": "Anyone who says this movie is crap is crazy. Star Wars IV a New Hope is and will always remain an epic classic. It's so well done with a nice balance of action, comedy, and a brilliant story. A New Hope is like nothing you've every seen or will see. It remains to be the best of the Star Wars franchise."
    },
    {
      "rating": "10",
      "text": "Anyone who gave this a negative review were clearly out of their mind or they like Twilight. Who knows?\r Star Wars... Come on, do I really have to go any further than just saying those two gorgeously combined words? This is where the franchise began. This is where the epic story would continue into many other forms of media beyond film.\r Star Wars is simply the greatest movie ever made and gave birth to the Hollywood blockbusters we know and love today. A wholly epic piece of cinema that continues to live on after its theatrical release 35 years ago."
    },
    {
      "rating": "10",
      "text": "A classic, pure imagination, creativity, and innovation went into creating this movie and it really stands out. The greatest sci-fi movie ever created."
    },
    {
      "rating": "10",
      "text": "Ok, movielonely94, you need to take a look at the DVD case again. A New Hope was the FIRST and the best of the STAR WARS series. Anyway, this movie has everything: story, actors, genius director, and the great mystery of Darth Vader. A-MAZING!"
    },
    {
      "rating": "10",
      "text": "A outstanding movie and the best of all the Star Wars movies, a true classic that is still a blast to watch today again and again, and because of this it gets a perfect 10, you must watch this movie."
    },
    {
      "rating": "10",
      "text": "Just watched it for the millionth time... as always, I wanted to watch it again right away. Very few movies give me that feeling. The story is predictable, but in all the right ways. Besides, the unpredictability was to be saved for the sequels... The acting? Does it LOOK like I care about the \"bad\" acting? Everyone is great. The characters are now so beloved, that there's no way for me to hate on them or the actors. Just go watch it again..."
    },
    {
      "rating": "9",
      "text": "This is where all of the magic begins. George Lucas' great cinematic adventure takes off just as it should. It's one for history. More than revolutionary for science-fiction in 1977."
    },
    {
      "rating": "10",
      "text": "Great action scenes,story and mind blowing special effects for the time(They still look good today).Without a doubt this is not just the best star wars movie but also the best sci-fi film ever made."
    },
    {
      "rating": "10",
      "text": "It's quite laughable how some people compare movies like this to things like some Mission Impossible - Ghost Protocol movie. You think the effects aren't that good? Oh, I wonder why. This movie was made in 1977. Most of the half-brained morons who are giving this movie bad ratings were probably not even within 10 years of being born. Great movie."
    },
    {
      "rating": "10",
      "text": "Innovative, beautiful, and thrilling to watch. Star Wars: Episode IV is a benchmark film that still hold up in 2016. Without question, one of the greatest films ever made."
    },
    {
      "rating": "9",
      "text": "While I'm not a Star Wars fan like many people out there, that doesn't mean I can't like the movies. I would not say this is my all-time favorite movie, but Lucas definitely succeeds here. The intricate world he has created is tough to beat. The fact that there are still stories left untold is amazing to me."
    },
    {
      "rating": "10",
      "text": "Star Wars in a whole is awesome. I cannot believe that it doesn't have an 100 rating. This classic movie is among the most influential movies of all time, I believe its popularity will stay huge just like wizard of oz."
    },
    {
      "rating": "10",
      "text": "Star Wars: Episode IV - A New Hope is without any doubt the greatest film ever created - and will remain in that prestigious position for years to come."
    },
    {
      "rating": "10",
      "text": "I personally do not give you 10 followed, but this movie is super entertaining, with a shuddering sound, unforgettable music and a wonderful story.\rAlthough it is unrealistic, this will be the best science fiction movie."
    },
    {
      "rating": "9",
      "text": "Watching it now you cannot help but notice some of the funny special effects but thats pretty irrelevant, for its time it is a beautiful film and of course its the film that started it all, fantastic film especially for its time and a must watch."
    },
    {
      "rating": "9",
      "text": "Star Wars is a fantastic Sci-Fi & Fantasy Action Adventure movie that takes place:\"A long time ago, in a galaxy far, far away...\" and tells the story of a young boy who wants to become something more than what he was raised for.But without any preparations he enters in this dangerous adventure, finding dark secrets of his past, in order for him to become a hero that will save the universe.The movie is filled with fantastic quotable lines of dialogue and a classic adventure of good vs evil."
    },
    {
      "rating": "10",
      "text": "Anybody that thinks this movie is bad, doesn't have good taste. This was the movie that changed the way films are made, the special effects were amazing for it's time."
    },
    {
      "rating": "10",
      "text": "A new hope is a fantastic science fiction film with a story that resembles that of greek mythology but brings it in the most exciting of ways with great characters and dialogue moments between eachother and the cherry on top is the groundbreaking special effects and action sequences."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies i've seen and this movie revolutionizes the whole cinema. This movie is a timeless classic.There is nothing to hate in the movie. The story is simple and great.The VFX were mind blowing when it was released in 1977. And it still holds up till now. Darth Vader is one of most iconic villian's I've seen on the big screen. All the characters are likeable and you care for these characters too. The action was great in the movie. Han solo and Chewbacca brings all the laughs to the movie. The chemistry between obi wan and Luke was so good. The movie explores well the universe. The score of the movie is one of the best things which made the movie great. The only issue I had with the movie was the last fight between obi wan and Darth Vader wasn't impacting.\r In the end star wars is a must see movie for all generation and your going to have a blast with it."
    },
    {
      "rating": "10",
      "text": "Star Wars. What can I say about it that hasn't been said before. To me Star wars is one of those films where you watch it over and over again. I think this film is full of almost every genre. Science-fiction, adventure, action, etc. Ever since I saw this film, I have become a total movie fan and a star wars fan. If my life didn't have star wars in it, my life would be a dark place. I've seen this movie so many times that when I finish watching a screening, I feel like I haven't seen it enough times."
    },
    {
      "rating": "10",
      "text": "Without it, I doubt that many of today's blockbusters would exist. It may not have changed the way movies were told but it certainly changed the way they were made, introducing to us many new ideas and concepts in the visual effects medium. It is without a question the ultimate blockbuster, and that is just scraping the surface of how influential and great it is. Easily in my Top 10 Favorites list along with Episode 5."
    },
    {
      "rating": "10",
      "text": "This is possibly the best overall film ever made. The one that started the legacy of the biggest film franchise in history. Creating the craziest fanbase of all time. Redefining the movie making medium. From the script to the acting to the soundtrack to the visual effects. Storytelling at its finest."
    },
    {
      "rating": "10",
      "text": "Star Wars will forever be that timeless film we can watch time and time again and still feel the same way about it as we did in our youthful years."
    },
    {
      "rating": "10",
      "text": "How many other films do people watch over and over?"
    },
    {
      "rating": "9",
      "text": "Michael. H., you are in denial. this film happens to be the most successful and popular movie ever made. i guess everyone's a nerd, because everyone's seen star wars."
    },
    {
      "rating": "10",
      "text": "The best movie of the decade and almost best of the century. The excellent characters, first rate performances and John Williams perfect musical score make it near perfect."
    },
    {
      "rating": "10",
      "text": "fantastic"
    },
    {
      "rating": "10",
      "text": "If i know my star wars, this is probably the original version. if it is, then i would like to say this is way better than that crappy special edition one."
    },
    {
      "rating": "10",
      "text": "I'm not sure what happened to the two sequels to this movie on Megacritic, but they were superb too. But the prequels were piles of crap. The story of the original Star Wars is the reason why I'm proud to say that I love the Star Wars franchise. Except for episode 1-3. Oh well."
    },
    {
      "rating": "10",
      "text": "Star Wars (Episode IV - A New Hope) is an old movie yet it's one of the most awesome movies ever! if anyone wanted to watch other popular sci-fi stuff I would recommend Star Trek, or BBC's Doctor Who (i meant no offense)"
    },
    {
      "rating": "9",
      "text": "The first star wars i saw the commercials for the special edition in 1997 and thought it was a new movie then my mom tells me that's already out and she went to the local video store and rented it i most of watched it ten times before returning it to find their where sequels...i actually saw return of the jedi before empire..which was confusing..but this movie i now today live by the jedi way or at least try i am a fanboy and feel foolish not to of seen it till i was 8 now i can't comprehend not knowing it i even have a darth vader tattoo on my should so this is the one that started everything and is still amazing today."
    },
    {
      "rating": "8",
      "text": "Star Wars is fun. The characters and story are simple and nothing too deep, that’ll come later but they are functional. They are all effective at what they do and are people I’ve become invested in, the story is effectively based starting out exciting then slowing down and gradually speeding up constantly keeping the plot moving while slowly revealing information about the world as we need to know it.  I feel like a lot of the love for this movie is nostalgia as again there’s nothing too deep about it and the film is a tad cheesy. There is one thing that holds up about Star Wars and even now blows me away and that’s the visuals. The visual spectacle is strong with this one. The costumes, score, and action all a wonder to look at as its become iconic for a reason. Star Wars is a fun movie but the particularly effective presentation combined with tons of nostalgia make it an enjoyable movie that I’m always willing to back to. It’s good to remember going into The Force Awakens that Star Wars was a fun movie with a lot of visual spectacle and didn’t have a deep story. While nostalgia may win allow this classic to win out in the end it makes me reason that even if the new movie is good that doesn’t mean that it failed because at the end of the day the original was a fun movie with presentation being an especial highlight."
    },
    {
      "rating": "10",
      "text": "Truly unique and inspired, Star Wars (A New Hope) is a hallmark in film making and one of the best films ever made, it redefines it's genre and and set the groundwork for 5 sequels (unfortunately only 3 where good), countless spin off video games and easily a multibillion dollar franchise."
    },
    {
      "rating": "10",
      "text": "One of the most (if not THE most) revolutionary and groundbreaking science fiction movies of all time, \"Star Wars\" (or \"Episode IV: A New Hope\") is a brilliantly inventive and always engaging science fiction adventure filled with characters who we come to know and love in the history of cinema and great special effects that may not hold up to this day, but for a movie made in 1977, you got to give it the benefit of the doubt.\r Mark Hamill stars as the movie's main protagonist, Luke Skywalker, who is a young man that discovers that he can be so much more after meeting Obi-Wan Kenobi (Alec Guinness) who tells him about his history with his father and how he was trained.\r Luke ends up meeting some more colorful characters on his journey to saving the Princess Leia (Carrie Fisher) from the evil Darth Vader (voiced by James Earl Jones) whose plan is to destroy the Rebel Alliance. More characters that help out include Han Solo (Harrison Ford), his Wookiee Chewbacca (Peter Mayhew) and two droids, C-3PO (Anthony Daniels) and R2-D2 (Kenny Baker).\r What writer and director George Lucas has created is a fantasy world of his own, and it became one of the most legendary, and culturally significant pieces of motion picture ever. The story is engaging and well told, and even well thought out. We come to care for the characters as soon as we're introduced to them, and we would never know where the motion picture would be today, if \"Star Wars\" never happened.\r Little do we know, that there would be more engaging stories that follow."
    },
    {
      "rating": "8",
      "text": "Star Wars-the mother of all blockbuster films to come! If you haven't seen any if these movies yet, you're not a true movie lover. Darth Vader is the best movie villain of all time, and Han Solo is definitely one of the best heroes. If there was one problem I had, it would be Grand Moff Tarkin-Peter Cushing played him really well and all, but he kind of got in the way during some scenes. Darth Vader is definitely a more interesting character. Anyway, despite minor problems, it's a great movie with great characters and a great story. A treat for sci-fi fans. P.S, a message to all the fans to make something clear-Han. Shot. First."
    },
    {
      "rating": "8",
      "text": "Possibly the most iconic sci-fi film to date, Star Wars is a thrilling adventure with a few small flaws, but it is still one hell of a ride. Lucas delivers a fantastic blockbuster after his two other films (also quite good), THX 1138 and American Graffiti."
    },
    {
      "rating": "10",
      "text": "(97/100)The one that started it all. A New Hope is a fantastic movie that deserves every single penny it ever made."
    },
    {
      "rating": "9",
      "text": "Easily one of the greatest films of all time. A New Hope is a classic original sci-fi film that established George Lucas as one of the premire directors of our time. The only flaw is that the acting could have been a lot better."
    },
    {
      "rating": "10",
      "text": "Star Wars: Episode IV - A New Hope is a classic movie that I must have watched a million times when I was a boy. Now I'm old and have children of my own and sharing Star Wars with them was a magical moment. They love it! Stars Wars is a truly timeless film that still excites to this day."
    },
    {
      "rating": "8",
      "text": "It is always good to see a film that relies on character development, and this is what we get. A wonderful mixture of science fiction action and clever ideas, which not only accompanies a journey to destroy the Death Star, but also a quest to connect a brilliantly-acted group of characters. If you don't see this film, you don't known what good science-fiction is..."
    },
    {
      "rating": "9",
      "text": "One of the best films ever made only topped by episode V . It begins the best Sc-fi series of films ever made. George Lucas' second best film. Enough Said :)"
    },
    {
      "rating": "10",
      "text": "It started it all. This movie was the best back then and quite simply is just as magnificent and engaging now. It is a pivotal moment in American cinema and culture. You can't deny the genius of this movie"
    },
    {
      "rating": "10",
      "text": "This is without a shadow of a doubt the finest sci-fi film ever made and, I dare say, the greatest overall movie of all time. Should have won the best picture oscar instead of \"Annie Hall\". Absolute Classic!!!"
    }
  ]
}