{
  "id": 2569,
  "title": "Stargate",
  "starring": [
    "Kurt Russell",
    "James Spader"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "An interstellar teleportation device, found in Egypt, leads to a planet with humans resembling ancient Egyptians who worship the god Ra.",
  "releaseYear": "1994",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kLacy1TrSedHrZcsup1JNHl1upk.jpg",
  "categories": {
    "plot": 6.117647058823529,
    "acting": 5.2,
    "ending": 7.0,
    "soundtrack": 8.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.642857142857143
  },
  "reviews": [
    {
      "rating": "10",
      "text": "\"Stargate\" is just how I had envisioned it- a fun, thrilling space adventure 3,000 years in the making. And being a sci-fi fan, it wasn't too hard to enjoy this movie."
    },
    {
      "rating": "10",
      "text": "One of the great sci-fi classics.  If you're a fan of the genre, this is absolutely a must watch film."
    },
    {
      "rating": "10",
      "text": "Surprise for me: I had low expectations, so maybe thats why I enjoyed the movie. the story is a bit classic, but still interesting, because it mixes old egyptian culture with sci fi. The visual effects were good and surely great for 1994."
    },
    {
      "rating": "9",
      "text": "This is how a Sci-fi/adventure movie should be like, truly fascinating and groovy to watch!!!\r The opening plot was amazing, totally love the historical background!\rStargate is a highly unique science fiction film that truly is packed with adventuristic events that really is entertaining. The amount of action is wonderful, and combined with great music from David Arnold couldn't the film be more awesome as it is. I'm going to give this spectacular movie a 9/10, because it didn't really feel as a 10, and the ending and the CGI could have been better.\r Stargate is a fantastic movie, that's at least ten times better than that awful movie called Gravity (2013).\r Stargate gets a 9/10"
    },
    {
      "rating": "10",
      "text": "Well, i just recently re-watched this, and I still LOVE It, Stargate will forever reside as classic sci-fi action flick! I saw this film very young as a kid, and all i liked and remembered it is just the action scenes. I could say i've seen this film about 125 times by now. I love everything about this film!\r Now im an adult and after re-watching it, (just so i could do this review.) it still lives up. Stargate will hold its place as the Best Sci-Fi film from 1994 for me."
    },
    {
      "rating": "10",
      "text": "Great and engrossing story, brilliant acting skills. Stargate is one of the best science fiction movies what i saw. I love everything about this movie!"
    },
    {
      "rating": "10",
      "text": "This movie is so FRICKIN MIND-BLOWING since Star Trek: The Motion Picture!!!!!!!!!!!"
    },
    {
      "rating": "6",
      "text": "Certainly outlandish, Stargate is a well-thought out space adventure which links itself to Ancient Egypt. Despite questionable acting, the film is exciting and unique."
    },
    {
      "rating": "4",
      "text": "Stargate is a mess, as in time traveling mess. I mean sure it takes us a million light years from home, but I'm pretty sure we'll be stuck in this messy work done by Roland Emmerich."
    },
    {
      "rating": "3",
      "text": "This film is based on a crazy, but real, theory about the visit of extraterrestrial beings to our ancient civilizations, namely ancient Egypt.The script is based on the discovery of a portal during excavations in Egypt. Dr. Daniel Jackson, an unorthodox egyptologist, is called in by the military to investigate the finding and finds that the portal links two worlds together and can be rebuilt and opened. He then embarks on an expedition that crosses the portal and finds himself in another desert world, where people live under the slavery of strange, extraterrestrial beings, very similar to the Egyptian gods.Personally, this movie has only interested me recently. Unlike the two TV series it gave rise to, it seems to me to have some quality... but, after all, is not very good. There are a lot of problems, starting with the lack of logic that arises when we analyze the details: for example, how can those people, used to using primitive tools, instantly handle and fire modern machine guns? The most logical thing would be they don't even know how to grab them! And how did Dr. Jackson manage, within a day, to discover the real usefulness of a portal that has puzzled academics for decades? There are a lot of problems like these ... little details that, when clearly analyzed, make no sense and undermine the credibility of the plot.As for the cast, I believe everyone did the best they could, but there are some obvious casting errors. James Spader is good as a strange scholar, but slips when he has to do action scenes. Kurt Russel is more suited to pure and hard action, but all attempts to make his character denser and give him a heroic accent are too cliché. Jaye Davidson was very unlucky with his character: a weak villain, effeminate to the point of being almost feminine, who doesn't scare and seems almost dependent on the tough guys who protect him. There is also a poor attempt to do romance between Spader and Mili Avital's character, but it always seems unnecessary and predictable to the point that we immediately know how it will end.The film is poor, has an uninspired script, a very amateurish direction (assured by Roland Emmerich), actors who can do little to help make things better, predictable action scenes, and dated visual and sound effects. I won't say it's a movie that can't entertain us... it entertains the audience, but it's perfectly forgettable."
    },
    {
      "rating": "4",
      "text": "And this is why you should never follow the audience score of a movie. This movie is Sci-Fi for people who don’t really like Sci-Fi. Kurt Russell must have had some debt in the early 90s because he sure made some **** movies during that time. Oh, and Roland Emmerich is just the original Michael Bay. So, if you like mindless, one-dimensional movies where the characters are essentially stereotypes, you’ll love it. And don’t forget, Emmerich sure loves to spell out even the simplest of information in his movies so all the JV football players watching won’t be confused. This movie is perfect for adults who passed high school through remedial classes."
    },
    {
      "rating": "6",
      "text": "Certainly outlandish, Stargate is a well-thought out space adventure which links itself to Ancient Egypt. Despite questionable acting, the film is exciting and unique."
    },
    {
      "rating": "6",
      "text": "Director Roland Emmerich may not be a great filmmaker in the classical sense, but he no doubt understands how to make an entertaining blockbuster. In this Egyptian mythology science fiction action adventure film, Emmerich displays this in spades with a thoroughly entertaining film that may be infectiously silly, but also knows how to satisfy the audience's craving for easy breezy entertainment. This is a classically Emmerich film with rousing speeches, a macho army man lead, and heavy reliance upon scientists for exposition about what is going on. Together alongside Emmerich's Independence Day, Stargate certainly touches on many of the same themes in regards to extraterrestrials and how it is best to probably stay away from them, for fear of them opting to destroy our world. Here, a group of soldiers and scientists unlock a portal to a far away star where the Egyptian inhabitants slave and worship the sun god Ra.As with any huge dumb spectacle, Stargate is incredibly light on character development. A tough macho guy, Emmerich tries to soften Kurt Russell's rough exterior by having his son be dead from an accidental gunshot or something. Regardless, he plays a Kurt Russell type of character who literally kills an Egyptian guy and says, \"Say hi to King Tut for me, **** Taking on Ra all by himself and charging into the pyramid well ahead of the rest of his men, Kurt Russell is set to save Earth even though he does not wish to return and face the fact that his son is dead again. Instead, he would rather die on this star or planet or desert thing. Alongside him is Dr. Daniel Jackson (James Spader), a nerdy and brilliant expert on Ancient Egypt whose controversial and different beliefs regarding Egypt get him ostracized by his fellow scholars. Now presented with an opportunity to explore this old discovery from 1928 that contains mysterious hieroglyphics or some other design, he is able to prove his previously insane theories to be true.What ensues is the men pissing off Ra, Daniel having sex with an Egyptian slave babe, and the men starting an uprising with the youth to overthrow Ra's tyrannical leadership. With glowing eyes, girlish clothes and features, and an ability to suck a person's brain from their head via his fingers and some glowing waves, the apparently male Ra is a terrifying villain. For all of the film's sheer insanity in regards to developing Ra and his limited backstory, Emmerich's direction of him never ceases to create intensity. With every step he takes, there is considerable power and it is readily apparent that he is not a being to be trifled with to any degree. Rather, he is a powerful being that is willing to kill his own people in order to maintain power. In the film's plotting as a whole, Emmerich manages to create a variety of feelings. From a sense of wonder and awe when the world is first explored and reached to great tension as the men traverse the land and encounter Ra, Stargate manages to be a blockbuster with tremendous scope and gravitas that really elevates it into being phenomenal entertainment. In playing its absurdities quite straight, the film makes them oddly believable and not cheesy. Rather, this science fiction world of Ancient Egypt blending with our own is an incredibly believable one with excellently presented mythology and satisfying feelings of wonder, adventure, and thrills.Thematically, as with many films about alien encounters, Stargate shows the dangers inherent in involving the military. Escalating the situation through following orders, Kurt Russell puts Earth at risk by angering Ra. Focused on executing their missions and not in exploring the land, the soldiers are often saved by Daniel and his willingness to explore and to learn. However, on the other hand, Daniel learns to take risks and to fight from the soldiers, highlighting the symbiotic relationship that forms between the two entities. By the end of the film, both Kurt and Daniel take paths neither of them had previously anticipated and are willing to embark on their greatest personal journeys of discovery and perseverance. Yet, it is in that thematic discussion of a tough man being forced to embrace life once again and a nerdy guy learning to toughen up sometimes that the film really begins to hint at its cliches. This is what really drags the film down as it is far too like every other summer action blockbuster. With numbing action that lacks any sense of staging and disorients more than it thrills along with a shoe-horned in romantic angle, Stargate winds up being far too run-of-the-mill and overdone. The climax further demonstrates the way in which the film is just stretched too thin with  Kurt Russell fighting the same nameless guy for nearly five minutes. The scene goes on for far too long, as do scenes of them meeting with the villagers. However, in contrast, scenes of the men learning about the stargate and entering it seem incredibly rushed."
    },
    {
      "rating": "8",
      "text": "A classic of science fiction. It also is the source of a successful franchise while being neither financially successful or critical acclaimed enough for it to get founding by the studios. It is the story of Daniel Jackson that is shunned about his archaeological theories until he is contacted by the US military. Reality is even weirder than his theories. It is also the story of Colonel O’Neil and his tragic backstory as it is about ancient Egypt and things I wont spoil. It uses some good conspiracy theories to tell an interesting story. I even thing it is somehow original in some areas. The acting is solid for this kind of movie. I especially like Kurt Russel, James Spade, Jaye Davidson, Alexis Cruz and Erik Avari. The special effects look pretty good for its time and aged also well. The soundtrack was really good and remember-able. The main appeal is the combination of characters, story and world building. The sum is more than its part. It created a lot of fan interest and over the years a cult following. Overall while I enjoyed the movie it is not in the realm of the best of its kind. It is however entertaining and worth watching."
    },
    {
      "rating": "7",
      "text": "Very specific Sci-Fi. The name seems familiar to everyone, but when you start watching you realize that it is a delusional plot, scenes even by the standards of the 90s look gray and boring. And only the setting itself is surprising, well, really where else in full seriousness you can see a flying ship in the form of a pyramid. The ending is even more ridiculous, and this benefits the film. Once you should look, a vivid example of films that were shot only in the 90s."
    },
    {
      "rating": "4",
      "text": "I loved stargate growing up and was looking forward to this, but this was sooo sooooo sooooo bad, the plot wasn't well thought out, the character direction is terrible, the acting of the main characters is abysmal at best, it just feels like a bad high school play. Utter disappointment."
    },
    {
      "rating": "7",
      "text": "It’s GoodStargate isn’t really anything special, But it’s still pretty cool."
    },
    {
      "rating": "8",
      "text": "Kind of a fun adventure movie with a mix of disaster movie vibes which is a blast if you don’t take it too seriously. Spader is entertaining as always and the score is pretty good too"
    }
  ],
  "recommendations": [
    "mortal_engines",
    "the_league_of_extraordinary_gentlemen",
    "the_matrix",
    "reign_of_fire",
    "the_martian",
    "arrival",
    "independence_day",
    "hellboy_ii_the_golden_army",
    "sunshine",
    "interstellar",
    "avatar",
    "total_recall",
    "elysium",
    "captain_america_the_winter_soldier",
    "contact",
    "annihilation",
    "they_live",
    "the_13th_warrior",
    "lucy",
    "upside_down",
    "x_men_days_of_future_past",
    "aliens",
    "europa_report",
    "minority_report",
    "chaos_walking"
  ]
}