{"id": 3810, "title": "Star Trek: The Motion Picture", "starring": ["William Shatner", "Leonard Nimoy"], "runtime": 132, "genre": ["Science Fiction", "Adventure", "Mystery"], "description": "When a destructive space entity is spotted approaching Earth, Admiral Kirk resumes command of the Starship Enterprise in order to intercept, examine, and hopefully stop it.", "releaseYear": "1979", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/wfiAfNwH6CMKxz4vRaW8CPTabtk.jpg", "categories": {"plot": 5.714285714285714, "acting": 5.2105263157894735, "ending": 5.909090909090909, "soundtrack": 4.0, "cinematography": 5.75, "familyFriendly": 6.0, "funny": 5.0, "action": 4.5}, "reviews": [{"rating": "2", "text": "This film debuted at a time when sci fi were very popular and came about following a TV series that reached levels of popularity that are still enviable today. These assumptions could have made this movie into an icon but that never happened. The director's exaggerated ambition has created a nearly three-hour film that does little or nothing good. The rhythm of the film is almost a torture session: it creeps into unnecessary scenes without any reason. It even seems that the editing team just did not want to get bored doing their job decently. The film has no screenplay for such length. In fact, it has no script, it has an idea for a script that did not find any happy development. The main actors (William Shatner, Leonard Nimoy and DeForest Kelley) were perfectly up to the challenge, but the rest of the cast left unwanted, lifeless interpretations to match the scenery and costumes that look like pajamas or nurse's robes. In fact, everything on that ship looks like a hospital corridor. If all this had been different, we would probably be facing a classic as dear as the original series. Unfortunately this did not happen."}, {"rating": "7", "text": "I give this film a solid 7. It has a great opening and great ending but like a badly made pie it sags very badly in the middle. The klingon attack at the beginning, Spock on Vulcan, Kirk at starfleet, the enterprise leaving drydock, so far the film is really exciting. However once into deep space everything becomes very slow and boring. Even Spock's arrival doesn't save it and we have to suffer an hour of cast members looking at the viewfinder commenting on how big v'ger is. The ending is good but by this time most people will have fallen asleep. Such as shame as parts of the film, in particular the special effects and stunning score by Jerry Goldsmith, really are the best of Trek. The follow up, Wrath of Khan, is easily a better film overall but I still have a soft spot for the first Trek film."}, {"rating": "10", "text": "This movie brought back the crew of the U.S.S Enterprise since the Animated Series ended. The movie was great by all standards. A true science fiction movie to watch. 10/10."}, {"rating": "7", "text": "Not a great way to introduce Star Trek to the silver screen. Is Star Trek: The Motion Picture a bad movie? No. Is it a great movie? No. This film has the bad reputation of being bad because it's boring. While, yes it is boring, it is not bad. It has an intriguing plot and gorgeous visuals. Yes, the movie would have been a lot better if more happened, but it is in no way bad. It's an intriguing and visually gorgeous, boring movie. C"}, {"rating": "7", "text": "This movie gets flack as being dull and while I can understand this point of view this more sci fi than over the top action. It reunites the crew and has great visuals and while there is no antagonist the reveal of what VGER is, I find really interesting."}, {"rating": "7", "text": "It has an awesome start and a great final act but nearly everything in between feels stretched out. I recently discovered that it was planned for a never produced TV series Star Trek Phase Two before the decisions was made to use this as groundwork / plot for this movie. This explains a lot. Also some shots are far too extended. Someone made the comment that they want to capture the feeling from 2001 A Space Odyssey. This is accredited by the fact that Douglas Trumbull and Richard Yuricich did the visual effects here and in the past for 2001. While no failure it does not work as good here as it does in 2001. I might sound to negative but I enjoyed this movie. It is more that I used fast forward to skip parts of it. What should I say about the cast? You have a team of pop culture legends. Kirk, Spock, Mc Coy, Sulu, Chekov, Scotty and Uhura are know by people that have never even watched Star Trek. I like the crew and characters so there is no way that I complain in the slightest way. We got 2 new characters with Ilia and Willard Decker. Ilia has not much time to shine but delivers a really good performance. Willard Deckers character is someone who was interesting enough that I want to see more of him. Story: The set up for the story is great and could easily lead to a 10/10 movie. The revelation and the conclusion of the story is brilliant and had potential. I will admit that this is a hit or miss case. It can also be viewed as failure by some. Overall it was an enjoyable movie with some lengths that started the movie franchise. Bonus knowledge. A German comedian had made a good joke about Scotty. Kirk: Scotty how long does it take? Scotty: 4 weeks captain. Kirk: You have 2 hours. Scotty: I will do it in 1 ;-)."}, {"rating": "7", "text": "Although Robert Wise's experience saved the film from being nothing, it does suffer from a general lack of well-established character development. However, the grand science fiction setting allows those characters to become part of a consistent universe that hypnotizes the viewer through its slow pace, costume and set design, and especially the soundtrack. An overall worthy and solid experience that manufactures its own \"final frontier\" derivative from the Star Trek franchise."}, {"rating": "7", "text": "To think this this film came out when I was just one year old, just like Star Wars which came out a year before I was born, makes me think...my God Jim...I'm old!\r I've never been a huge Star Trek fan and never will be in all honesty. I did always enjoy the films with the original classic crew but never got into any of the TV series, especially the new stuff. I always preferred the Star Wars franchise for many reasons but mainly because it always looked so superior in virtually every department. This first Trek movie really does show the difference between the two franchises which both appeared in the same era, not taking anything away from Star Trek but it always did look more fake and plastic looking.\r The effects in this first movie are a mixed bag really. The sequences towards the finale inside V'Ger don't look too bad (nice 2001-esque fantasy lighting effects), various spaceship shots look nice throughout and the costumes although drab don't age too badly. For the most part this film has aged badly if we're brutally honest about it, I don't wanna keep comparing it to Star Wars but there is a clear difference in quality which still stands to this day.\r What I did always like about Trek was the way it tries to be realistic or at least approach things in a realistic fashion. I'm Not sure if they are merely homaging or copying '2001' but you can clearly see the influences in one sequence as we are treated to a grandiose panorama of the Enterprise as she sits in her docking bay accompanied by a stirring Trek instrumental score. This epic approach is a far cry from the flashbang blaster fire and roaring starcruisers of a certain George Lucas affair. Star Trek is definitely aiming at the grown-ups here, the real sci-fi enthusiasts who name Kubrick's space opus as their holy bible...which Wise clearly did too.\r I do like the way Wise gave the film a slow pace. Lots of character and background building alongside plenty of mission dialog and technical problems that might occur in reality for such a scenario. Its all classic Star Trek as you would remember from the original series but on a sexier scale with props that actually do look kinda real. In fact there's even more politically correct...goody two- shoes...prime directive...Federation type babble than you can wave a stick at, and Shatner loves his speeches.\r The film was criticised for this slow unadventurous style but personally I like it, its one of the more realistic Trek movies offering exactly what you got with the original TV series...but prettier. I still to this day don't really understand why some folk (even Trek fans) don't like it. The main aspect of this film I like is the plot, yes the plot. Seems straight forward enough as the team are sent to intercept a mysterious alien phenomena heading towards earth, but I liked how the plot has its intriguing twist at the end. Again just like the classic show you get the danger and mystery with a cute little twist to keep you on your toes. Its not groundbreaking but it just makes you think a little, right up to the very end you're unsure what the hell will happen. How Kirk will save the day and what's the deal behind the alien cloud thing, that's good story telling right there methinks.\r The continuity from the TV show to the big screen was handled well I thought although I'm no Trek expert. You have all the crew doing what they are best at of course, some new crews members (redshirt fodder perhaps?), plenty of well known typical Trek visuals and sounds, the crew handle most of the action from the ships bridge via the good old big screen on the wall and the Enterprise looks slick with a bit of spit n polish to tart it up for the big screen.\r Sure its not an in your face phaser fest with hand to hand fights against large lizard men but I for one thought the serious route was a good way to go. The film is more of an exploration adventure, it takes its time, slowly builds up, lots of space jargon...you don't know what their on about half the time but it just sounds good...I use my realism card again. It feels like a point n click strategic adventure game for your PC...I guess?\r One of the oddest things when you think about it was the fact Wise directed this. You tend to remember Robert Wise for the Hollywood epics 'The Sound of Music' and 'West Side Story' which are two of the greatest musicals ever made probably. So its kinda funny to think he directed the first Star Trek movie, then again he did direct 'The Andromeda Strain' and 'The Day the Earth Stood Still' so he did have some good sci-fi experience.\r Overall the special effects look fuzzy in places, lots of beige colour schemes going on with the ship and crew, plenty of nasty bluescreen evident I'm afraid...but its still very enjoyable sci-fi. Star Trek has its own little niche of being semi-serious and approaching everything logically but still utilising just enough fantasy to make it a charming pleasant ride."}, {"rating": "7", "text": "Not a great start, The Motion Picture feels an awful lot like 2001 just worse, the visuals and special effects are great, but the story revolving around a cloud isn't, still an enjoyable film."}, {"rating": "5", "text": "Awesome special effects barely save this movie from it's dull and dialogue-heavy pace."}, {"rating": "7", "text": "Star Trek The Motion Picture  ,had  Nominated for 3 Oscars. Another 2 wins & 15 nominations ,For me Star Trek The Motion Picture is the best  i like strange story's"}, {"rating": "5", "text": "Star Trek: The Motion Picture is by no means a trainwreck, but it is also just not very good. Overlong with a nonsense plot, Star Trek certainly drags at times and really would have been well advised to pick up the pace. The special effects look dated, but for 1979, they are not too bad. At times, they are quite bad, but at others, incredibly impressive. The acting comes in and out. Moments are comically bad due to bad delivery, but at others, they really do a solid job. All of this being said, Star Trek is still quite a fun film that does entertain for the most part. For me, this one is better than the original Star Wars for that reason. The decent special effects, solid acting, and entertaining aspects of this one, are all improvements over its sci-fi franchise rival. Above all, the world and characters it introduces seem intriguing enough for me to keep trucking through this series. All in all, a non-disaster of a start."}, {"rating": "4", "text": "To be fair, for its time, it wasn't that bad. It was a big step up from the original series in almost every regard, writing, effects, \"acting\" and overall plot. But, it was far too slow paced that almost all the magic gets sucked away while you are waiting for something interesting to happen.\r Overall:\rI give it credit for what it is: the first of many and paving the way for the rest of the franchise to follow. The movie might have sucked a little, but at least it stood for something."}, {"rating": "5", "text": "It doesn't capture all of what made the original series so brilliant. Many might say it's a long screensaver. I think it tried to be 2001: A Space Odyssey, epic and almost feels like a Disney world ride. That said it does have some remarkable stunning visuals, some tension, good soundtrack and SFX and decent enough story. Anyway it's still Star Trek, so no hate."}, {"rating": "0", "text": "I'm a huge Star Trek fanatic I love every series and every movie except for The Motion Picture. This is put simply the weakest Star Trek entry ever. Every now and then I watch it because it's Star Trek but I still hate it. Most of the problem is the pacing it's way too slow and painful, theirs a lot of long and slow sequences where it's just not interesting and quite boring. Theirs also barely any action at all.\r Star Trek at it's weakest. But Star Trek becomes great again The Wrath Of Khan forwards because the pacing issues are resolved."}, {"rating": "5", "text": "Star Wars efsanesinden sonra ortaya çıkan Star Trek efsanesi biraz daha uzayda araştırma amaçlı bir film olarak karşımıza çıkıyor. Star wars gibi aksiyon veremeyen film bana göre kötünün iyisi olarak izlediğim filmler arasında yer alıyor. İki filminde aşırı Fanboyları kavgalar içinde tutuşurken iki seriden de keyif almaya çalışan biri olarak beklenileni veremediğinin düşüncesindeyim."}, {"rating": "5", "text": "a misguided plot dipped into a space-fest..Star Trek : The Motion PictureThe makers takes too much time to sink their teeth in their characters and the surrounding offered to them, leaving them spending away their first act which is clearly not feasible as they suffer for it latter on their second act which grows obvious as it ages on screen, creating an enormous amount of pressure on the last act to pull it off, which they do, but it isn't glorifying enough to save the almost sunken ship. It is rich on technical aspects like visual effects, make-up design and production design but is short on editing. Robert Wise's execution is appreciative but it could have been a lot better and so could have been the screenplay by Harold Livingston which never even attempts to seek the attention of the viewers. The returned characters have hold on to their roles especially by Leonard Nimoy and William Shartner, although the maturity seemed to be missing in there. The writer uses the magnitude of the characters and their chemistry among each other and chooses their moments wisely which helps the feature survive for a bit longer period. Star Trek : The Motion Picture is a misguided plot dipped into a space-fest of unknown creatures and regions whose well written characters are the only thread to hold on to."}, {"rating": "3", "text": "Its A Torture although Visually Stunning but sometimes little dumb!the music was epic but the impact was missing,the story and screenplay is bad it felt like a simple premise stretched into a 2-hrs movie,As per 1st star trek experience the characters were forgettable and there math and science throughout the movie was like i'am in a class it was way too much and watching whole things explained in detail and then the ending outcome of all that was literally torture,the starting intro was amazing the ship and visuals and all then the intro to characters and fast paced situation overview after that the slow and stretched actions till the end it was too much to handle,the simple premise of attack and defend and explore unknown thing has to be more engaging and interesting whereas we got is A class of math!some things in whole movie felt little mind-blowing and good the Visuals obviously and the ship and Voyager twist and all but apart from that the characters,the story and screenplay and the dumb thing it was all a mental torture,as per starting star trek series freshly better watch TV series,Overall its a Worst Movie!"}, {"rating": "7", "text": "El sueño de todo fanático de la serie, cumplido. No sé si cumplió con sus expectativas pero, es cierto que los efectos especiales son mejores; el problema es que el desarrollo es un poco lento y el giro de tuerca final es bastante tramposo. A ver y juzgar."}, {"rating": "4", "text": "Some viewers say that this movie is boring with its endless panning of the ship and other scenes. I agree that scenes are way too long, but I did not find the movie boring.  However, I would like to edit out about 30% of the movie.  There are too many long pauses between dialogue, and the camera drags along a scene way too long.While I prefer movies that are too slow (this one) than too fast (\"action–action–action\" millennial movies), this was the slowest movie I ever saw in my life.  I could leave the movie and go to the bathroom, and when I came back, the screen was still showing the same thing.  Heck, I could take a shower… go shopping… take a weekend trip, and still, same frame.The movie left me cold.  Something didn’t work right with the characters.  It was like they were all constipated and uptight.  Kirk lacked his typical backbone and seemed confused throughout the show.  He didn’t take command.  They didn’t show how awesome he was as a Captain.What I *did* like was how they introduced the cast, one at a time.  They showed what each character was like during the 5-year lapse before they each re-enetered Starfleet.  For example, when asked, “What are you going to do now?”, Kirk responded “I’m just going to go home.”  He seemed defeated.Spock was first shown with long hair on Vulcan, entered the Enterprise with a haircut, but still wearing his Vulcan attire, a black cape.Bones came on with a full beard and civilian clothes, well dressed.Scotty unfortunately grew a mustache.I didn’t understand Spock's yo-yoing.  When he was a young adult, he was more emotional (with Uhura as his girlfriend).  During the Original Series, Spock was, well… the Spock we all know.  Then, in “The Motion Picture”, he’s emotionless, even after he refused the “Be Emotional-less and only Logical” ritual on Vulcan.  In the later movies when he got older, he was much more emotional.  When he’s an old man and visits his younger self, he made peace with his human side, and even embraced it.  However, in this movie, Spock was funny when he finally was his old self and said to McCoy, “As typical, your ramblings are insignificant” after McCoy insulted him.McCoy was the only character who was himself.  Maybe Scotty was too.When they showed the ship’s red alerts, I was surprised it was now in English.  In the original series, it was just a red light, which I would think is more advanced than English in a multi-cultured and diverse crew… and not just multi-cultured or multi-global, but multi-galaxy-ed!  English, really?The transporter malfunction was an intense scene. The sound of the screams were well done, very creepy.  Cool how the visual was left to imagination, similar to the awesome effects that Hitchcock used to do.  Now days, they would show it—a glob of flesh and blood melted in a pool on the transporter floor. I did like when they revealed that “V-ger” was Voyager.  When Kirk rubbed the dust off the “ova” in the word VOYAGER that was on the 1977 ship, that was cool.  It reminded me of the scene in PLANET OF THE APES when it was revealed they were in a NYC subway."}, {"rating": "7", "text": "Ok this has all the pacing of 2001 Space Odyssey. Which this story could of been told in one episode of the serialized show. Star Trek is about character development and not long drawn out special effects. This is a tv episode stretched into a overtly long film. I still like it, but it is the slowest of slow burns."}, {"rating": "5", "text": "The criticisms of this movie that have been made are mostly similar and reasonable. The old pun \"Star Trek: The Slow Motion Picture\" neatly sums them all. And for significant stretches of time, this movie is indeed \"slow.\" Many people have probably seen the parody vids of Kirk gazing lovingly at his old ship while the camera wanders about the Enterprise for about five minutes, or later when the crew arrives at V-ger and we are given an endlessly long look at an uninteresting blue screen special effect. I would suggest to just watch the TV shows instead works way better than a movie but not all movies are terrible."}], "recommendations": ["star_trek", "star_trek_beyond", "star_trek_insurrection", "star_trek_into_darkness", "star_trek_nemesis", "star_wars_episode_i_the_phantom_menace", "star_trek_first_contact", "star_trek_v_the_final_frontier", "valerian_and_the_city_of_a_thousand_planets", "mortal_engines", "rogue_one_a_star_wars_story", "jupiter_ascending", "aliens", "battle_los_angeles", "serenity", "spectral", "alien_outpost", "captive_state", "oblivion", "rise_of_the_planet_of_the_apes", "star_wars_episode_ii_attack_of_the_clones", "armageddon", "hunter_killer", "mission_to_mars", "the_matrix_reloaded"]}