{
  "id": 2849,
  "title": "Star Wars: Episode I - The Phantom Menace",
  "starring": [
    "Liam Neeson",
    "Ewan McGregor"
  ],
  "runtime": 136,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "Anakin Skywalker, a young slave strong with the Force, is discovered on Tatooine. Meanwhile, the evil Sith have returned, enacting their plot for revenge against the Jedi.",
  "releaseYear": "1999",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6wkfovpn7Eq8dYNKaG5PY3q2oq6.jpg",
  "categories": {
    "plot": 5.384615384615385,
    "acting": 5.947368421052632,
    "ending": 7.0,
    "soundtrack": 4.75,
    "cinematography": 5.0,
    "familyFriendly": 5.142857142857143,
    "funny": 3.75,
    "action": 5.25
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Dear George, the story was okay, just okay, but the very boring race, jar jar binks and the failed tries to be funny just made it a long annoying movie..."
    },
    {
      "rating": "10",
      "text": "George Lucas's epic masterpiece before the dark times."
    },
    {
      "rating": "4",
      "text": "What happens when you take one of the biggest franchises of all time, its creator and his never-revised first draft script for a prequel, and then surround him by enablers? Nothing good. The aesthetics of the characters is there, certainly, but every decision made is lacking precision and second, third, and fourth thoughts in its execution. Jar Jar Binks is supposed to appeal to the younger audiences, but was taken too far and became a caricature that only annoyed most. Darth Maul is a villain with with a ton of potential...but then is killed off without any further character development. These decisions, clearly, were based on merchandising statistics vs great storytelling motivations. A kid-friendly character sells better as a stuffed animal/pillow case than a villain, right? Add to this dialogue that is incredibly difficult to penetrate and understand for an audience member that is supposed to be driving the plot forward. Add to this dialogue that is really cliche and dumb that is supposed to entertain the kids. Total loss of tone in the story."
    },
    {
      "rating": "8",
      "text": "I really liked this when I was a kid, of course it has silly acting from kid playing Anakin and everyone hates Jar Jar, but as a kid I really enjoyed it, maybe made more as movie for kids than adults, but still."
    },
    {
      "rating": "7",
      "text": "Both the best and the worst of all Star Wars movies. That's because it has a completely different and unique tone from all the other episodes, and you will either love it or hate it.  To alot of people it's too boring and childish, but I think it's good for what it is - an adventure movie for kids with deeper themes that adults and star wars nerds can ejoy too. My only real complaint is there's too much Jar Jar and not enough Darth Maul, if you swapped their screentime the movie would've been perfect."
    },
    {
      "rating": "4",
      "text": "How do I review The Phantom Menace? I'd say it's one of those so bad its good kind of films, but the film has plenty of boring elements that really drag things down. Darth Maul is cool no doubt, but his now iconic battle with that great music score, is not gripping since nothing is going on besides the fight. No drama, no character connections, just there for the spectacle. Just like the speeder race, which made a decent video game, but very dull to watch. Jar Jar Binks is yes beyond annoying, Natalie Portman's weird voice in this is well just weird. The story makes no sense and is not engaging at all. Nowadays your better off watching the Darth Maul battle clips, other than that I can't recommend you take the time to watch this film beginning to end."
    },
    {
      "rating": "9",
      "text": "Complex plot, the characters were sublime and full of personality and character, there was loads of backstory and lore added to the SW franchise with this film. Darth Maul looked so cool. The best thing about this film was how the Jedi Order took Anakin away from his sexy Mother, as a black man who adopted a white son, this film truly showed that diversity is a strength when a group of strangers took a boy away from his genetically close Mother for the greater good, the diversity is strong with this one."
    },
    {
      "rating": "8",
      "text": "Pros: Good characters, Amazing effects, Cool fight scenesCons: Jar Jar, a bit to much talking"
    },
    {
      "rating": "8",
      "text": "Okay, it wasn't the best, but it did include lots of things which were absent in Episode 3. The droids didn't run away from battle like un-trained civilians, they marched steadily forward, like a droid is supposed to. Also, the pod racing scene wasn't too shabby, either. All of this included with the best lightsaber duel in the series makes this movie very much worth watching."
    },
    {
      "rating": "8",
      "text": "When I first watched this I was about 16 and I have to admit that it blew me away at the time. It was a completely fresh aproach to the saga with cool enemies and set pieces. Who could forget the pod race, the first time you see the destroyer droids rolling into action and the Darth Maul battle at the end? Yes it isn't as good as the originals but IMO it's more than good enough to sit alongside them."
    },
    {
      "rating": "9",
      "text": "Till today I can watch this movie over and over again just like the rest of its family. Thank you George Lucas for this works of art."
    },
    {
      "rating": "8",
      "text": "Darth Maul and Qui-Gon-Jinn are the BEST Obi-Wan went crazy at the final battle scene That was the best battle scene of the series I hate that Darth Maul died He is so cool Same with Qui-Gon Everything else was okay"
    },
    {
      "rating": "8",
      "text": "I remember the hype for this movie right after the special editions the new amazing character jar jar binks whom ended up hated by fans but whom i liked over the films anakin...other than that the movie was great....way better than attack of the clones..the darth maul is one of the best lightsaber duels in all the movies it was a sin the amount of time he got in the film after all the publicity it was an upset but what we get is great and qui gon was quite possibly the best performance in the whoel prequal trilogy."
    },
    {
      "rating": "6",
      "text": "By far the weakest of the Star Wars episodes. It only gets a 6 because it is Star Wars. Jar Jar Binks is perhaps the most annoying character ever created. Remove him and cut 80% of that damn pod race and I'd give it 7.5, maybe even an 8."
    },
    {
      "rating": "6",
      "text": "This is probably the least pleasant star wars film. The story was quite ok but the acting in it is very bad compared to the other films. I am quite disappointed."
    },
    {
      "rating": "4",
      "text": "Honesty when i saw this movie i was very disappointing. the story was okay, just okay, but the very boring race, jar jar binks and the failed tries to be funny just made it a long annoying movie.Im going to give it a 4 because the lightsaber duel was good."
    },
    {
      "rating": "4",
      "text": "George Lucas helped usher in a new era in filmmaking with The Phantom Menace, but he also lost track of what made Star Wars special to millions of people around the world. Make no mistake, the visual effects here were mind-blowing at the time of release, but there are so many issues plaguing the film. Empty dialogue and stilted direction lead to bad performances from actors who are typically very good, and heavy use of CGI in its infancy has result in the film aging poorly. The production design is great, and a few action sequences thrill, but everything else is either shockingly misguided or downright boring."
    },
    {
      "rating": "4",
      "text": "When it's not grating and incredibly annoying, it's banal. There are somewhat positive aspects, to an extent at least. But there outweighed by all the just below mediocre aspects."
    },
    {
      "rating": "5",
      "text": "Pretty bad but if you watch the fan edited version with Jar Jar having an alien language and no pod racing makes it actually about a 6-7."
    },
    {
      "rating": "4",
      "text": "The phantom menace uses potty humor annoying characters and weak acting it brings shame to the franchise."
    },
    {
      "rating": "6",
      "text": "The first episode in the prequel trilogy came with a lot of high expectations, unfortunately it failed to meet those expectations. The first 3/4 of this movie is not that great, the introduction of Jar Jar Binks is not well received. The gungan city underwater scenes are strange and lets the story get carried away. The pod racing scene is alright, is exciting but it is just okay. What saved this movie for me is the Obi-Wan & Qui-Gon vs Darth Maul battle, this was amazing, so well done. Duel of the Fates music to go along with it was the icing on the cake."
    },
    {
      "rating": "7",
      "text": "A worthy start to a great trilogy. well done,with an exiting plot and an interpretation worthy of the series"
    },
    {
      "rating": "9",
      "text": "Excellent film which starts the prequel series of the Star Wars Trilogy."
    },
    {
      "rating": "1",
      "text": "The only positive thing I can say about this movie is that it's better than \"Attack of the Clones\". Faint praise, I know, but apart from the terrible writing, ridiculous plot, and failed execution of filmmaking, there are still some amazing musical and visual cues to be had. If only there was a way to mute the dialogue."
    },
    {
      "rating": "10",
      "text": "I hope to be anakin skywalker when i become 8 years old like him :D he seems so cool"
    },
    {
      "rating": "7",
      "text": "To this day still of the more beautiful movies I've watched, a true escape from reality. I've always viewed this as the Renaissance of Star Wars. People have often criticised the dialogue as 'wooden' but I think George did a great job extinguishing it from the previous entries. Boasting an excellent soundtrack and iconic battle between Darth Maul, Qui-Gon Jinn and Obi-Wan Kenobi. Only cons I can say about this movie would the heavy feature of Jar-Jar in it, though I don't mind the character, felt a bit too much at times. The podrace always dragged on a bit and was a bit of bore. Despite that, Phantom Menace will always remain a classic and mainstay on my shelf as the years go by."
    },
    {
      "rating": "5",
      "text": "With unimpressive acting, a poor script and an over-reliance on cgi, The Phantom Menace is a less-than-satisfying start to the infamous prequel trilogy. The pacing was painfully slow, and even Liam Neeson seems bored. Then of course, there's the character of Jar Jar Binks, one of the most annoying characters in the history of cinema. Seriously, who thought HE was a good idea? Darth Maul was a cool villain, but he's barely even in it! The character development is practically non-existent, and much of the film is just a bunch of Jedi sitting around talking about taxation. The special effects were great, but the filmmakers seem to value them over story and characters. And just so you know, I am a HUGE Star Wars nerd. That's why this movie feels like a punch to the gut. FINAL VERDICT: This is a disappointing addition to a great franchise, and lacks the depth of previous instalments. 4.5/10."
    },
    {
      "rating": "10",
      "text": "The Phantom Menace is an UNDERRATED MASTERPIECE!!!!!\"The Phantom Menace\" WOW! The audience went ape s-(well you know the rest) every time I saw it. I couldn't get it out of my head, I read the novel 3 times (after I seen the film) that summer, as well as the screenplay. Man I love this film, and the more I see it the more I love it. Qui-Gon, Darth Maul and Watto three of my top ten favorite characters. 8 times between May and Dec. of '99, and every time I seen it the crowd cheered, and at the end erupted in applauds. It was cool, very cool. For me I didn't want to see a rehash of ANH, and what I got was a new twist to and old universe. I was pleasantly surprised by the out come, of all three prequels.To this day I still LOVE this movie. It's just gets better and better!"
    },
    {
      "rating": "0",
      "text": "A catastrophe in almost every imaginable way, The Phantom Menace is a near-unwatchable fiasco of a Star Wars movie, filled with god-awful performances, laughable dialogue, some of the messiest and most dated-looking CGI action sequences ever put to film, a needlessly complicated, cliché-ridden story that still doesn't make a lick of sense almost 20 years since the film's release, disgraceful racial stereotypes and intolerable, insomnia-curing pacing that stretches out the jumble of failed political plot threads to form an unforgivably long runtime."
    },
    {
      "rating": "10",
      "text": "This is the best star wars ever. a terrifc beginning to the saga. a little predictable but u dont even notice it."
    },
    {
      "rating": "5",
      "text": "An candy shop of visuals and lightsaber fights which is too easily consumed leaving a sick feeling of dry characters and the most tedious dialogue known to man. Jar Jar Binks you worthless excuse for comic relief. But, the visuals of battle are always nice to see and the pod race was surprisingly intense...and you can appreciate how cheesy it is for that extra burst that doesn't make this movie complete garbage along with some added nostalgia."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I have ever seen. With dull writing, dull characters, and a dull plot this movie makes starring at a wall more fun and exciting"
    },
    {
      "rating": "4",
      "text": "The actors are wallpaper, the jokes are juvenile, there's no romance, and the dialogue lands with the thud of a computer-instruction manual. But it's useless to criticize the visual astonishment that is Star Wars – Episode I: The Phantom Menace. With this epic and the trilogy that preceded it, George Lucas has built a pop-culture monument that packs all of history – war, religion, myth, art, science and those old reliables, good and evil – into a mystical grab bag that plays like a kiddie cartoon. There's a less fancy explanation for why Phantom Menace will inspire fetishistic worship: It's loaded with cool stuff. And reasonable facsimiles thereof are on sale at your local Force emporium.\r Episode I is set thirty years earlier than the original saga, Episode IV: A New Hope, but some things never change. A royal babe is in trouble. Not Princess Leia; this time it's Queen Amidala (Natalie Portman). The Trade Federation sends battleships to her planet, Naboo, to persuade her to sign a dodgy treaty. To her rescue come two Jedi knights: old pro Qui-Gon Jinn (Liam Neeson) and his apprentice, Obi-Wan Kenobi (Ewan McGregor). You'll recall that Alec Guinness played Obi-Wan the first time, and McGregor does a deft job of matching up with him vocally. ^Vhen Federation types send in droids for the kill, the Jedis link up with Anakin Sky walker (Jake Lloyd), a nine-year-old slave who will grow up to marry the queen, father the twins Luke and Leia, and turn from the Jedi cause to the dark side as Darth Vader. Got that?\r Good; here's what else you should know: Phantom Menace, which cost $115 million, lacks the crude freshness that Lucas lavished on the low-budget ($10 million) original in 1977 and the fluid storytelling that director Irvin Kershner brought to The Empire Strikes Back in 1980 – still the best in the series. But Menace is light-years ahead of the uneasy mix of furry Ewoks and Freudian psychology in Richard Marquand's 1983 Return of the Jedi. As for Lucas' directing skills, his work with actors still belongs to the \"Don't emote, just stand there\" school. But in terms of visual sophistication, already discernible in 1973's American Graffiti, Lucas ranks with the masters. He has always been more articulate with images than with words. Harrison Ford, who played Han Solo in the original, has famously chided Lucas, \"You can type this **** George, but you sure can't say it.\"\r McGregor is saddled with lines like, \"I have a bad feeling about this.\" And Neeson must answer, \"Be mindful of the living Force, my young Padawan.\" Ouch! Is it a coincidence that Phantom Menace and James Cameron's Titanic – whose box-office record ($1.8 billion worldwide) Lucas is chasing – were made by men with a poet's eyes and tin ears?\r Comic relief – and, boy, does this movie need it – arrives with scene-stealer Jar Jar Binks, a gangly, floppy-eared Gungan, voiced hilariously by Ahmed Best but otherwise a fully digital creation. Jar Jar is an alien amphibian who lives in an underwater city and speaks in a pidgin English that still gets the point across. \"Mesa in bombad troubles,\" says Jar Jar as he nabs food off plates with his long tongue and guides the Jedis in a submarine that gets chewed by a killer fish. Digital marvels abound, along with appearances by old favorites such as Jabba the Hutt and Yoda, who leads the Jedi Council on the planet Cor-uscant, along with Mace Windu (Samuel L. Jackson). Lucas surpasses himself in the creature department. Jar Jar's nemesis, Boss Nass, is a wonderfully odious menace. And Watto, the slave driver, is a fat-slob fly who manages to levitate on tiny hummingbird wings.\r The human element is hard put to keep up. Neeson has a natural warmth but too few opportunities for humor. Portman, a beauty and a gifted actress at eighteen, is stuck with an underwritten character – at least Carrie Fisher was allowed to bring her verbal snap to Princess Leia. And McGregor, a live wire in Trainspotting and Velvet Goldmine, spends the film's first half trailing Qui-Gon like a lap dog. Happily, McGregor comes into his own in the final scenes, suggesting that the next two episodes, due in 2002 and 2005, will let him cut loose.\r For now, the human focus is on Anakin, and the demands of the role – a messiah and an anti-Christ – put undue pressure on Lloyd, who was eight at the time of filming. You will search Lloyd's face in vain for the Darth Vader to come or for the agony of a boy forced to leave behind his slave mother, Shmi (Pernilla August), to begin his Jedi training. Lloyd shines in the lighter scenes, especially when Anakin enters a Podrace so perilous that ordinary humans can't tolerate the speed. The race is pure exhilaration. \"Whoopee!\" yells Anakin. Indeed. In this virtual universe – the video game supreme – Lucas is the king.\r Still remains the most disappointing films of all time. It's rubbish."
    },
    {
      "rating": "5",
      "text": "George Lucas, the once masterful director, has lost his way, and there is no-where that this is  more prominent than in Star Wars: Episode I- The Phantom Menace. Coherent storytelling, memorable dialogue and technological brilliance is replaced by a disorientating CGI whirlwind of effects driven action and wooden dialog. Great, snarky, laugh-out-loud humour, is replaced by a computer designed, rabbit eared lump of flesh that steps in a pile of poop.And an engaging plot is replaced by tedious, boring, Government committees that no adult or child has ever shown the least bit of interest in. The few redeeming factors that stops this film from being absolutely terrible are Liam Neeson and Ewen Mcgregor's characters, Darth Maul (obviously), and the fact that John Williams made the soundtrack. Because who doesn't want to hear another score from Williams?"
    },
    {
      "rating": "6",
      "text": "Although this movie gets a lot of negative response, I found there are a lot of things to love here. Even though the story is fairly boring and some of the characters are badly written, George Lucas succeded in the most important aspect of this movie. He managed to create an original and exciting universe set before the rise of the empire in episode IV. Apart from this the movie manages to impress with, for its time, outstanding visuals. The movie may not be a masterpiece, but it held my attention to the end. It does an ok job as a standalone movie, but it excells in universe building."
    },
    {
      "rating": "3",
      "text": "Okay, let's face it: If episode I would have been the first star wars movie, there would not have been a episode II. If the only (good) thing everybody remembers about a movie are some eye-candy scenes (and I am talking of course about the pod race and the double light sabre duel), you know your movie is in trouble, because it fails on all other levels: storytelling, character development, acting, pacing and tone. This movie feels like a well-calculated commercial product that should deliver to all audiences, but it's all about a shiny surface and nothing beyond that. And let's not forget about Jarjar, the most annoying character ever to be put in a movie."
    },
    {
      "rating": "4",
      "text": "When people say this movie is good, they can't back themselves up with the story, only with the effects. The movie continuously adds on to the characters character, we always question their decisions, and don't understand why anyone doesn't act like a normal person."
    },
    {
      "rating": "7",
      "text": "I know a lot of people hated the star wars prequels, because of overuse of cgi, But i still love them as equally as the the originals. this movie does have it's flaws but it's not a horrible movie actually  i find more interesting than the original because there's more color, in \"a new hope\" it was mostly in spaceships or tatooine so it's either all grey or orange, this movie makes star wars a lot more colorful, and the lightsaber battles are way better then they were in the originals, in the older films it looked friggin ridiculous in the prequels they made them badass. This movie is not horrible, but's not a masterpiece either, some of the acting is wooden but still worth watching because it's STAR WARS for crying out loud."
    },
    {
      "rating": "10",
      "text": "The locations and scenery are beautiful and exotic; the extremely well-done overall design of each planet and the specific places we are taken to is proof of that. From the lush and delectable beauty of Naboo to the vast and overwhelming city-planet of Coruscant, the environments are simply wonderful to behold. I simply don't understand why the use of CGI in the film is ridiculed as it is-CGI is something created by humans, just like animatronics-I don't believe CGI is \"less human\" than animatronics. The CGI enhances the visual quality of the environment and the characters that are CGI; this was what CGI was created to do, after all. The action sequences are amazing to behold, especially in the film's 20-minute climax; the pacing was perfect-the quick cuts between the three major conflicts matched the intense, fast-paced style of the battle-George Lucas' mastery in the visual arts was evident in the film. The symbolism and mythology-a Star Wars hallmark-is still a force to be reckoned with. Darth Maul's image, the duality in characters like Palpatine, and the symbiosis between prevalent organizations are all compelling, as well as the character types. Speaking of characters, I enjoyed Qui-Gon, Obi-Wan, Padmé, and Anakin. I was interested by each of their journeys, and where they began and ended. I cared about them, as well; they weren't \"wooden\" and \"boring,\" and nor were the performances behind them. The writing was good-not written by a 5-year-old-Lucas kept me interested in the characters and the story. I liked the politics involved in the story, as I am very interested in politics. The pacing for the story was good, as well. The supposed \"plot-holes\" are easily explained and/or easily ignored, and are more like nit-picks than actual criticism. I realize the problems both certain fans and critics alike have with this film-I understand their criticisms, but, to me, they either hold no water, or aren't significant enough to undermine the film, as I see it. I thought at least some of Jar-Jar Binks' antics were funny; he didn't annoy me, and I'm willing to bet he didn't annoy most of the kids who watched the film. Not only was Jar-Jar a character for kids, but he represents a \"wise fool\" in the film. Additionally, I hope people realize that this film isn't \"universally hated;\" look at this site-62% of fans gave this film a 3.5/5, and 57% of critics, just 3 points under \"fresh\" status, gave the film a positive review. All in all, Star Wars: Episode I: The Phantom Menace is an excellent film, and a more than worthy beginning to the saga; if you haven't seen it already, it is at least worth watching once."
    },
    {
      "rating": "7",
      "text": "While not being a terrible film, the first installment in Lucas' prequels just leaves audiences with an empty stomach. There is a lot to love in the film, cool characters, Darth Maul, good action sequences and a lot of eye candy (for 1999).  But there is also a lot to hate, not a lot of substance, some bad acting (Anakin), some bad and awkward dialogue, terrible characters like Jar Jar Binks and effects while ok for 1999 that look extremely bad today. But if you love Star Wars, it is definitely watchable and enjoyable, most of the time."
    },
    {
      "rating": "3",
      "text": "Yes it does have impressive action and visual effects to spare, but Star Wars: The Phantom Menace fails to match the original trilogy's unique blend of characters, moments and scale."
    },
    {
      "rating": "8",
      "text": "Holds a special place in my list as the first movie I can remember seeing in a theatre with my father.  It's a good movie, but the prequel trilogy is no comparison to the original films."
    },
    {
      "rating": "9",
      "text": "A great movie, not much else to say. It's sad how some people prefer hypocriticy over bias. Sure, you were born 100 years ago and that gives you the right to bash on the prequels because you saw the original trilogy first? That is hypocrisy."
    },
    {
      "rating": "5",
      "text": "Phantom Menace could have been so much better. What ruined it was the needless long pod race, the Gungans, and the laughable kid actor who played Anakin. It's one of those films I'd love to see remade because it truly could have been a masterpiece."
    },
    {
      "rating": "2",
      "text": "While living up to the brilliance of the revolutionary original trilogy could not be expected. The first instalment of Lucas's 'Prequel Trilogy' really sets the tone for how low star wars would sink. This tale, unlike the first three, contains a story no human could understand and fails at its job to keep even the hardest of fans from shedding a tear at what star wars has become. The only reason I have rated the movie above 1/10 is simply due to John Williams once again incredible score, with 'Dual of the Fates' being a soundtrack masterpiece."
    },
    {
      "rating": "7",
      "text": "Yes, this film had Jar Jar Binks and annoying little Anakin. But look again; it also had Darth Maul, Qui Go Jin, an epic pod race, a huge land and space battle, epic light-sabre combat, a great score, and lots of original ideas (unlike the recent \"Force Awakens\", which was just a rehash of bits of the original trilogy). For me this is a much better film than people give it credit for, and was unfortunately very much a victim of its own hype when it was released."
    },
    {
      "rating": "3",
      "text": "The reboot or return to the widely successful and acclaimed Star Wars saga was disappointing in just about every way. With the exception of the Ewan McGregor and Liam Nesson, the acting was underwhelming, the dialogue made me barf in my mouth, the pacing was awkward and often slow, and the villains were not only unclear and underdeveloped, but lacked the threat and power that Darth Vader and the emperor had in the original trilogy. The ending was a little better, with some solid action, and throughout there were some decent effects, but many of the actions scenes had no real weight to them and felt like they were there just for the sake of being there. Episode I is disappointing, boring, and not worth your time if you are a Star Wars fan."
    },
    {
      "rating": "8",
      "text": "I didnt like this movie much before, but compared to the roaring dumpster fire that is Episode 8, I think this movie was just miles better."
    },
    {
      "rating": "5",
      "text": "Problems: Death mauls death (should have kept him alive.), Jar Jar Binks (awful character), two pointless battles. Bad attempt at trying to funny."
    },
    {
      "rating": "8",
      "text": "I liked this movie, even though the acting could have been better.  Darth Maul is a real badass, loved the Duel of the Fates. Compared to TFA it's a masterpiece."
    }
  ]
}