{
  "id": 1887,
  "title": "Star Trek Beyond",
  "starring": [
    "Chris Pine",
    "Zachary Quinto"
  ],
  "runtime": 122,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "The USS Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cnQp8GmOWahIgQaH60Kwez3TNzw.jpg",
  "categories": {
    "plot": 4.476923076923077,
    "acting": 4.553191489361702,
    "ending": 4.833333333333333,
    "soundtrack": 8.0,
    "cinematography": 3.25,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 4.0606060606060606
  },
  "reviews": [
    {
      "rating": "5",
      "text": "By comparison the 2009 reboot is a classic. So much more thought went into Abrams' effort. Also, whoever wrote that 'Beyond' is like TOS hasn't seen TOS. The positive reviews MUST be bought and paid for.\r The good: Sofia Boutella, the guest actress, was one of the few good things about this movie consistently and, even better, it appears they are setting her up to become a member of the crew, which would be great as she has more attitude and life in her than most of the other actors. Another good thing: the opening few minutes, which were funny and well done; and the final scene, Kirk's birthday party, where the characters finally showed their personality and had some dialogue beyond yelling for help or saying 'hang on!' or 'over there! behind you!' Ok, I don't know if they said those things in the movie exactly but almost the entire film used only short choppy action scene dialogue about where to go and what to do next in order to escape trouble or get the bad guy. But in the last scene the actors showed a lot more color and personality, finally, for a few minutes before the credits.\r The bad: the plot. In the next few sentences I reveal minor plot basics, probably no more than professional reviews. A bad guy once again wants to destroy the Federation for vague reasons he cannot quite articulate - something about having been a soldier and now feeling useless because there is peace in the galaxy (it's news to me that there's peace in the Star Trek universe but whatever), and also feeling abandoned when he was left behind by people in Star Fleet a hundred years earlier (he's discovered the secret to some sort of life extension, you see, which was vaguely explained in five seconds). He has also changed his form completely, which is also unexplained but I suspect he did it by putting on an alien costume left over from the show Star Trek Enterprise, and he is going to take out as much of Starfleet as he can with a super weapon he can now use thanks to the fact that he has found some alien artifact he needs to make it work. You can't really give a spoiler because there's nothing to spoil. What I just told you is about the level of detail the movie gives. He sets this stone artifact in place like Indiana Jones, but instead of opening a door to treasure it powers up a weapon. No explanation as to why this weapon exists or its origins is even attempted. It's just some bs they threw together so they could trigger nonstop action which continues uninterrupted for almost the entire movie. Without room to breathe the movie just goes from one set piece to another, using closeups almost exclusively, so that often you don't know exactly where people are; and when they show one person running then cut to another, you don't know where those two are in relation to each other and if one is chasing the other and if so, which one; and when people are running through exploding ships I sometimes had no idea what was going on the visuals were such a busy mess. Whoever is in charge of maintaining the clarity of what is happening physically on screen utterly failed with this movie. Perhaps most importantly, the way they finally defeated the bad guys made no sense at all. I would tell you so you can understand how ridiculous it was, but I don't want to spoil it. Though it's crap so I'm not sure that you'd care anyway.\r Zachary Quinto gained a little weight in the face so he no longer has the angular Spock look. He looks puffy like the face of Darth Vader when Luke finally removed the mask (OK that's an exaggeration but he was puffy). Chris Pine starts off a little heavy in the face but quickly loses it. He apparently lost several pounds during filming. I'm sorry but I paid $12 to see Bruce Springsteen perform for 3 and half hours in 1978, an incredible classic performance. So if I'm going to pay over twice that much merely to see a 2 hour movie (3D iMax), then the script better be great, the visuals better be great, the acting better be great, and the actors better be fit and trim and look their best. If the actors can't get in shape for all the millions they are paid, then they have an entitlement problem. Zachary wasn't ready to shoot. Chris wasn't but he fixed it fast during filming. Zoe Saldana, who I love and think is beautiful, looks so severe throughout almost the entire movie (until the Kirk birthday scene when finally she looks like herself again) that she was unpleasant to watch. Mostly she just stared at things severely. They gave her little to do. Maybe she was still channeling Nina Simone and hadn't broken out of that character fully. The best of the regular cast this time around was Bones, who was great. Though there vulgar dialogue that was a bit jarring to hear in Star Trek, jokes about horse sh!t. Like a Farley brothers movie briefly invading a couple of times. It was weird. Overall, a paint-by-numbers action movie, vague and poorly shot or maybe just poorly edited action. Not much spirit of Star Trek to be found."
    },
    {
      "rating": "3",
      "text": "Man this was one boring badly written script. No substance don't understand how so many people gave it positive reviews. The story line was as typical as you can get with no substance. It was like many start trek movies stitched into one crap movie.When the jokes came through the film so bad they weren't funny anymore,seriously ! The previous movie was way better than this.\rWatchable on DVD only, very disappointed."
    },
    {
      "rating": "1",
      "text": "I was really so incredibly disappointed in this movie.  By the middle of the film, there was no going back for me.  Hated it more than Insurrection and Nemesis.  My sons (17 and 24), raised on Trek and fans of action films in their own right, hated this movie as much as I did.  This is TREK!  Not some empty-headed, existing only for thrills and profit  \"summer blockbuster\" action film.  Such a shame...\r It was so terrible, it doesn't even deserve eloquence in a review.  Instead, a list:\r The BAD\r 1.  The action.  Good God, the action.  Way too much of it, way too dark and hard to see, way too blurry, too much use of camera shake, far too disjointed and ambiguous in communicating there wheres/whys/hows/whos, and stupidly unrealistic.  Kirk is a human, not a superhero.  The physical feats accomplished at points were simply too ridiculous to enjoy.\r 2.  The science was shoddy as hell, making the black hole concept in the first reboot seem entirely credible by comparison\r 3.  The cliched one liners.  We get it.  It's Trek.  Being a Trek fan for 38 or my 43 years, I'm all into the iconic  things that make the characters who they are.  But it needs to go BEYOND the cliches.  After all these years, depth of character is possible, welcome and expected... not these one dimensional facades we were given in STB.  After an hour of mindbogglingly boring action sequences, I found myself not able to care about the forced heart-to-hearts between characters.  Too little, too late.\r 4. Speaking of one dimensional... the bad guy.  Who cares?  I certainly didn't.  He was just Generic Bad Guy.  His motivations, which were largely missing for 99% of the film, once revealed were simply silly.  Fabricated.  Under-developed.  Vacuous.\r 5.  Considering the enormous amount of destruction, I was baffled by Kirk's relative lack of reaction.  We all know his ship is his baby.  Where was the emotion?  Where was the urgency in evacuation orders when it was clear, within minutes, that there was not a chance of saving Her?\r 6.  Music as a weapon?  Give me a break, please...  PLEASE!\r The GOOD (which all together elevate this review to a 1)\r 1.  The box\r 2.  The space dock concept was interesting.\r 3.  The dedications at the end.\r I'm going to file this film away with The Last Airbender, The Phantom Menace and every Chuck Norris movie ever made as being UNWATCHABLE & ENTIRELY FORGETTABLE.\r Such a shame."
    },
    {
      "rating": "1",
      "text": "Just saw \"Star Trek Beyond.\" More like \"Star Trek Beyond Belief.\" Quite possibly the worst Star Trek film ever. So much pain. Who piloted those bee ships? WTF with VHF? WTF with Sabatoge blowing up bee ships? What was this disaster bomb Idris Elba wanted? Why is destroying a Space Station somehow revenge for... what? If he had the power to leave the nebula for 400 years why didn't he? How many people were left from his crew? Why did they take Enterprise crew hostage? To \"eat\" them? Why did a ship built in the vacuum of space need to reach terminal velocity to start its engines? What happened to the people on the planet Idris Elba landed on? Did he eat them all? why did his face turn human at the last minute? I mean, the whole movie is a tissue of nonsense. This was nothing more than Fast & Furious in outer space. A complete waste of talent. It was not Star Trek. It wasn't even a pale imitation of Guardians of the Galaxy. I can't make any sense of this film. The worst of the original series movies made more sense than this film."
    },
    {
      "rating": "0",
      "text": "Huge disappointment. Can't believe anyone could have any enthusiasm for this paint-by-numbers corporate turd. Completely betrays the tone and themes of the original Star Trek, and leans heavily on cheesy action movie tropes (like the butt-kicking 120-lb waif) to slap together a story. Easily the worst yet in this rapidly-declining series."
    },
    {
      "rating": "6",
      "text": "Thankfully, this movie was not as bad as Star Trek Into Darkness. It wasn't so obsessed with saluting an older, better movie (unlike the past two Abrams flicks) that it was able to branch out and create it's own story in the Star Trek universe. Still, some pitfalls remain.\r First, what it did well:\r This movie provided a solid, entertaining lazy summer flick. The special effects were good. The story was okay (minus the plot holes listed below). And the acting was adequate. It didn't knock things out of the park, but it checked all the boxes to provide a passable movie experience.\r I thought the movie did a good job capturing the emotions of the main characters. Kirk is reflecting on the fact that he is now a year older than his dad ever was. Spock is confronting his mortality as his alternate reality self dies (a tribute to Leonard Nimoy). The tension in these short scenes is real, although unfortunately it is never tied together in a conclusion. They don't resolve the conflicts with their inner demons, so these moments end up being space fillers.\r What it did bad:\r Character development. Character development. Character development. I can't harp on this enough. Not for the Enterprise crew, we know them after three movies. For the new characters that were introduced. At the end of the movie, we still know absolutely nothing about them. \"Lassie\" for example (I don't even know her actual name, that's how weak the character development was). The only thing I know about her is that her father died getting her out of the prison, and yet she's popping corks with Kirk at the end of the movie like all the backstory on her is cemented.\r The villain: character development was very weak on him as well. We never got a sense of what he wanted to achieve, or why he was doing what he was doing. Abrams also has this bad habit of trying to rush in a major surprise 15 mins before the credits roll, and he usually does it in a very sloppy way. Uhura walks past a monitor and realizes the bad guy alien is really a century old Federation Captain? Yeah right. So let me get this straight, he crash lands on this planet, somehow lives to the age of 150 and turns into an alien, creates a new crew of shock troops with alien techno-wank (everything from energy phasers to swarm ships capable of taking down the Enterprise) and he wants to destroy the federation base for...reasons. None of this is ever explained.\r And then, at the climax of the battle with the alien swarm, we need to easy button to get our heroes out of the massive attack that the alien launches on the station. Solution: they just play the radio at full blast and the swarm dies. No really, that's what they did. VHF causes the networked drones to blow up? Maybe if they were playing Nickelback.\r Also, that motorcycle. No way in hell it would run after sitting there for 150 years. The gas alone would have gone bad. The Jurrasic World jeeps had a better chance."
    },
    {
      "rating": "6",
      "text": "The story, plotting and villain feel so generic and slight; neither Roddenberry Trek nor even the writing touch of Pegg are noticeable. The cast is still spot on (new character Jaylah is a delight) and there's fun to be had but it's not anything that would feel unique or special outside the Trek fan service, homages and universe."
    },
    {
      "rating": "6",
      "text": "Star Trek Beyond is a decent entry into the series. It makes a lesser impact than the previous reboot films, though, as it is very inconsequential. It feels more like the later Next Generation Star Trek movies like Insurrection and Nemesis than epic fare like First Contact or Wrath of Khan. Still an entertaining flick, however."
    },
    {
      "rating": "7",
      "text": "When theirs rescue mission failed...It's not like I'm a big fan of 'Star Wars', so I disliked it. I have seen many space adventure films, but I never felt this series so interesting. I enjoyed some of the 'Star Trek' films though. I know this sequel is not good the previous ones, but for me this look okay than those. Because it was so simple, particularly story wise, and the rest of the film was action and adventure.No offense, but this series is like the collection of the rejections from other franchises. I mean, look at the cast, most of them are comedians and some of them are the category two actors and the rest are, I don't know what they are, bur decent actors. But these films pulled off successfully at the box office. Not a big impact like the recent 'Star Wars' film or any Marvel's films, but quite an impressive figure knowing the above fact I stated.From the Taiwanese director who made four 'Fast and Furious' films, handled his best for this. This film tells the story of the captain James Kirk, who leads his ship and crew to a rescue mission to a distant planet where some alien race who had stranded. But when they reach their destination, an unknown space army takes them by surprise and they too take a refuse on the same planet. From there how they plan to escape and to learn who were those attackers, all comes in the next half.This id full of action adventure. The story was little, but quite neatly developed characters, I mean the new ones with some good stunt sequences. As usual, there's no complaint about the graphics. I mean for the casual viewing, but who knows if you carefully look for the flaws, you might get a few. I suggest you to watch it just for an entertainment, but it might fail to satisfy the die-hard fans of 'Star Trek'. I think overall, it is not a bad film, even the two hours long is not an issue due to the good pace. 7/10"
    },
    {
      "rating": "8",
      "text": "Star Trek Beyond felt like a refreshing palate cleanser after its predecessor, Into Darkness. The latter, while obviously attempting to ape the franchise high notes of social commentary and character development, fell a bit flat by relying too much on unsurprising twists and forced nostalgia. Beyond only flirts with social commentary and steers clear of being overly self-referential. It's just a fun adventure, one that would have fit in well with the 1960's TV show."
    },
    {
      "rating": "5",
      "text": "Star-trek's sheer repetitions of fast speaking scenes, cliches situations, quips and characters made it a personally painful experience to watch.In the end you can not hide the fact that Star-Trek baseline is 50 years old, based upon a captain's hierarchical crew and a sadistic will to sacrifice every member of his crew in gratuitous scenes of violence but for 5 caricatural characters stuck in their assigned pre-defined personality.Sure, the modern declination is full of good ideas and impressive CGI.This latest iteration brings lots of ideas from Avatar, Game of Thrones, science fiction tropes like the grey goo and funny situational one liners.But all of it is still stuck in the Star-Trek dogma, where nothing changes and hundreds of dead crews are forgotten in the blink of an eye, where any scientific materiality is drowned into ad nauseam speeches of mumbo jumbo to justify any scenaristic whim.Star Trek Beyond is an impressive fast paced action movie that is sadly boringly conservative in the storytelling it offers."
    },
    {
      "rating": "8",
      "text": "Not your usual space adventure.  Kirk, Spock, the crew have new thoughts about life and their purpose after the initial glow of \"going where no man has gone before\" wears off.  This was a twist on the old TV show where the good guys always won.  There were ties to the previous movies, which give it the continuity that Trekkies love.  Don't know if I like the ending, it was almost a send off, like this was the last Star Trek with this cast."
    },
    {
      "rating": "0",
      "text": "AVOID THESE \"STAR TREK\" movies. Finally the box office reflected the crap that these movies deserved all along.Just a shoot em up movie that has a Star Trek name on it."
    },
    {
      "rating": "5",
      "text": "Too many rubberheads. Too little physics. Too cheap props. Too much pathos. Too much phony acting. Too much goofiness. Too weak an opponent. Too weird a(n almost) final battle. Too lame a plot.\r Why half of the cast is never called by name? Why 'lieutenant' has no insignia? Why was that movie made at all? Who can tell..."
    },
    {
      "rating": "7",
      "text": "Star Trek Beyond lacks the emotional heft of the first film and isn't as powerful as the second but as a summer flick, delivers with an entertaining old-school adventure that honours the Star Trek brand along with great visuals and plenty of action."
    },
    {
      "rating": "8",
      "text": "This is a much smaller Star Trek film in both tone and story.  Unlike the first two films in this franchise Beyond feels like an extended episode.  Not as big in scale but still a whole lot of fun.  A-"
    },
    {
      "rating": "2",
      "text": "If you love Star Trek, avoid this like the plague and save your money.\r If you love mindless action and get distracted by pretty / shiny pictures... this is for you. Enjoy!"
    },
    {
      "rating": "3",
      "text": "What (according to the second trailer and the beginning of the movie) promised to be an unusual incisive character developing story and a movie with a dark feeling set in a vast Star Trek universe, turned out to be blunt and unthoughtfully action packed without any character depth.\rScotty said \"lets hope this doesn't get messy\". However, it did.\r -----\r-- Antagonist has no (clear) motives\r-- Hardly any character development of crew members to last an entire (or another) movie\r-- Hard to oversee action scenes (flipping of the saucer disk)\r-- Another enterprise destroyed: death of countless crewmembers and destruction of the entire ship has totally no emotional resemblance anymore\r-- messy, unclear and unconvincing storyline\r-----\r +++++\r++ Producer JJ Abrams keeps inventing new visual effects, like the visually attracting warp bubble and the peculiar but interesting onboard camera looking at the Enterprise while it is shot away.\r++ Architecture of the Yorktown starbase\r+++++"
    },
    {
      "rating": "4",
      "text": "I didn't like the film. Let's get that out of the way. Usually with metacritic user scores that means that you are expected  to give whatever your are reviewing a zero, but in the interest of fairness I'll rate it a four. It was mediocre. The action sequences, cinematography and choreography were all fine. Simon Pegg and co. did their best to continue channeling the characters which Nemoy, Shatner, Kelley et al. birthed back in the day. Whenever I watch one of these Kelvin Timeline films, though, I always feel like there is something missing ... like I am watching a film made by people who have never actually seen Star Trek. Think the prisoners in Plato's allegory of the cave, except in this case, director Justin Lin never managed to escape and view the reality that was behind those shadows dancing across the walls. I know some people enjoyed the scene with Beastie Boys blaring in the background, but when I compare this with an episode of TNG like The Inner Light, I'm forced to shed nerd tears."
    },
    {
      "rating": "7",
      "text": "To begin with, just so you know where I'm coming from, I loved 2009's Star Trek. After seeing it, I was incredibly optimistic about the future of this franchise. Into Darkness nearly dashed that optimism. I've seen it a couple of times, and I just can't get into it. So, I was very reserved going into Star Trek Beyond. I'd seen only one of the trailers, and no other promotional material. I had no real expectations for it.\r Star Trek Beyond is actually quite entertaining. The movie moves at a good pace, and I didn't feel like it got bogged down at any point. In fact, I wouldn't have minded if they slowed down and developed their new characters a bit. Krall never quite rises above \"generic villain\" status, and even Jayla, who plays well off the rest of the cast, isn't a very complex.\r The returning cast are all very fun to watch. They have great on-screen chemistry, though they tend to blend together a bit. For most of the film, you could easily swap out one for another in a scene. They don't play as very unique individuals. Some of their individual arcs - where we see them struggle with who they are or what they want - are too briefly addressed to make an impact.\r The action and effects were great. There were so many thrilling sequences. They didn't always make a ton of sense, but they were incredibly fun to watch. I will say, though, that there's one alien race which is entirely CG, and it's very jarring. Practical creature effects would have been better.\r Overall, it was an enjoyable film. It didn't reach nearly the heights that it was capable of, but as summer blockbusters go, it was well worth seeing it in cinemas."
    },
    {
      "rating": "6",
      "text": "Not as strong as its predecessors, but an entertaining movie none the less. The best way to describe Beyond is it feels like a tv movie as oppose to a big motion picture like the previous two. But, this movie is fairly well done, it has a decent script, decent score, great actors, decent visuals, and it isn't too overlong. There is a lot of flaws in this one, but what the movie does right, it does do right. The best stuff Beyond has to offer is a decently fun movie that does entertain."
    },
    {
      "rating": "4",
      "text": "For an action flick, I would give it a 6 out of 10.  It had good action scenes at times, but mostly the type of stunts you'd see in fast and furious not in a star trek movie.  This is the problem with this...  I am a Star Trek fan and you know what?  I watched those shows to satisfy my interest in the unknown - the galaxy.  Every episode was a new experience, they had to discover it and figure out what was going on and why and really break down how to fix the problem.  This movie - \"We're sliding down the ship weeeeee!  Yes it's half exploding!  Yes there's jagged metal things everywhere and a normal human would die when landing after this but weeeeee!\"\rThis is not Star Trek.  Star Trek is coming across the unknown, or trying investigate what a potential hostile species is up to.  It's about the crew, working together, to discover information that might help them solve the problem ahead.  It's slow, methodical.  This is fast, furious, and cars in space.\r *SPOILERS*   When they show his video of him talking about how he's going to get revenge, he says he only has a couple crew members left.... then where did he get this army of 10,000 flying space marines who's helmets never come off?  If he can make 10,000 ships then why is his infrastructure looking like a homeless person on a mountain?  It's one of those self-fullfilling stories where everything is convenient and in place so the story moves along regardless of how absurd it is that they are so PERFECT at everything they do.  Star Trek was methodical, slow and thought provoking.  None of this was in this film.\r Hasn't A Game of Thrones taught anyone about movies/shows/entertainment?!  Ground your show in a bit of reality, make the people human not gods, and you'll get a better involvement from the audience."
    },
    {
      "rating": "2",
      "text": "When did Star Trek become all about running around and fighting and shooting? Weren't there supposed to be interesting sci-fi wonders and strange moral dilemmas and things like that?"
    },
    {
      "rating": "2",
      "text": "A hollow movie that would have been more fitting as a filler episode in a TV series rather than a feature movie.  The biggest problem was lack of character development for the antagonist and support cast. On top of that, the results of the movie have no impact on anything. This is why it felt like a filler episode. The drive behind the plot is some guy went nuts from loneliness. You can fill in the rest with just that one sentence. Its very predictable and not thought out at all. Another sign its a bad movie is the existence of a lovely alien female in tight clothes to help distract you so you don't notice just how bad the movie is. When she was not on screen, there was just mindless action and by mindless I mean it was so unmemorable that I cant even remember any of it."
    },
    {
      "rating": "3",
      "text": "Forgettable, overly frantic waste of time and money. No charm, no wisdom, no visual restraint or actual suspense. I guess that's why I have 0 interest in the fast and furious movies. The director infused his nothingness into the brilliance that J.J. Abrams established. Unless they dump this director, I will not be watching future Star Trek movies."
    },
    {
      "rating": "7",
      "text": "I didn't know that another star trek was coming until I saw a trailer of it around 3 months ago. This one, just like what the others said, was definitely not good enough to outbeat its prequels. But there were still some good plots in it and so it deserved what it deserved. I was disappointed AND suprised that this sequel didn't have an emotional scene between the two Kirk/Spock unlike the first 2. These scenes was really what that hooked me into the series."
    },
    {
      "rating": "0",
      "text": "As a long-time Trekkie, I have to say that the writers andJ.J. Abrams have destroyed the heart and soul of Star Trek The Original Series. Spock openly yells out in pain, laughter, etc. They disrespected the time-honored tradition of the characters and opted for costumes and special effects instead of halfway decent story.\r In opening the story, Kirk accepts a mission that was senseless and pointless. Clearly, the Federation was being drawn into a trap and sacrificing its greatest asset on the word of an unknown alien.\r Somehow McCoy end up having to join Spock in an escape pod wherein McCoy becomes the pilot.   That's right - \"I'm a doctor not a ....\"  actually comes up in the movie.\r Mr. Spock is informed of some devastating news that he would never want to know about as a Vulcan.  However, other Vulcans present him with this information in the beginning of the film.   The relationship between Spock and Uhura is confounded because Spock all of the sudden wants Vulcan-only children. Did he not know this in the first film where they annihilated Vulcan?  They had Spock as emotional in the film as a bride.   Taking the cool, logic away from Spock is detrimental to the entire film.\r Seeing Sulu with a family picture on his console was a homosexual agenda nod. His role in the film was, clearly to appease the LGBT community especially when he joined his daughter and man in the beginning of the film. The only reference to Sulu's sexuality in the Original Series was in \"Mirror Mirror\" where his character in an alternate universe, clearly, was heterosexual as he was after Lt. Uhura.\r Lt. Uhura's role in this film was minimal. After being captured, she was standing warning the villain of the Federation.\r The 3D special effects were mostly in the titles and closing credits and some other points with in the movie from time to time.   Please do not think you will see top to bottom 3D like Avatar.   Perhaps instead of forcing the 3D element, the writers could have looked at The Original Series and any films directed by Leonard Nimoy to gather inspirations.\r Why continue to mess with a classic like Star Trek which included Science, Adventure, a bit of humor and great stories showing humanity clashing and working with aliens and one another? This formula has lasted 50 years!"
    },
    {
      "rating": "2",
      "text": "Star Trek Beyond is one of the worst movies I have ever seen! And I love Star Trek, so I really wanted to like it, but seriously, my friend and I both left the theater totally bewildered and our minds were just completely blown from all the awfulness. Even the action fell flat, because it was horrendously edited and incoherent at best, which made it very tiresome to watch. And the lack of visual continuity was a problem in general, because it was (too) often hard to tell where they were exactly, how they got there or how much time had passed - not that it mattered, because almost nothing really made sense anyway thanks to the stunningly atrocious writing. It was just one insane train wreck of a movie. Trust me, don't pay to watch this."
    },
    {
      "rating": "8",
      "text": "I must say, I was pleasantly surprised. I liked Star Trek 09 (7/10), but I wasn't a fan of Into Darkness (5/10). I had high hopes that a more competent writer like Pegg would steer the series in the right direction. To my horror, the first trailer for Star Trek:Beyond made it seem like they were completely destroying the series, making it STAR TREK PRESENTED BY: MOUNTAIN DEW CODE RED. Subsequent trailers and interviews eased my anxiety so I went into this movie last night with an open mind. And WOW this is one of the better modern Star Trek films that I've seen!\r It had the perfect blend of the old star trek \"exploration\" and \"philosophy\" mixed with great action and amazing visual effects. There was actual character development this time around, but I feel like the writing hindered some of the characters from reaching their true potential. Still, the stories that were presented are passable for a summer flick. They also made big references to the Star Trek: Enterprise and TOS shows,  so that was really awesome. Lastly to my biggest surprise, the Beastie Boys scene that caused me so much cringe in the first trailer gave me the biggest smile in the theater! I'm actually surprised they pulled it off so well.\r All in all I'd say this deserves a 8/10. Much better than Into Darkness, about on par with Star Trek 09, but with more emphasis on the story and less lens flair. It was as close to a Mass Effect movie as I'll ever get, so if you're a fan of that series I think you'll like this."
    },
    {
      "rating": "4",
      "text": "been a fan for a long time but i found this film a bit contrived it spent so long paying tribute to the past the story or lack of story slipped through without notice the story was like store brand coffee thin and weak and without much flavor and easy to forget it was the 50th anniversary and it sucked i think a quote general chang would have liked with slight update first sack all the writers  sorry but that's how i feel on another note i hope the re cast Chekov  maybe make him a cousin saying pavel chekov is a common name in russia in the 23rd century and has a tribute to actor Anton  Yelchin, make his middle name Anton"
    },
    {
      "rating": "1",
      "text": "My previous negative review was removed.    Downgrading my rating from 1 to 0.    STB is not review worthy nor is it Netflix worthy.    Not only is STB not a good Trek movie, it is just not a good movie at all."
    },
    {
      "rating": "6",
      "text": "Slightly too goofy for my taste, at times this can feel more like Galaxy Quest than Star Trek. Good action, fairly boiler-plate plot, mediocre script. The most glaring issue was the awful editing, and I mean BvS bad. Lines that weren't audible or trampled over by a quick cut, unnecessary scenes spliced in that added nothing, or fast-paced cuts that obscure the action. Every major blockbuster of 2016 has featured this slap-dash editing, and it defies all reason. You've already shelled out hundreds of millions to get the stars and effects on screen, why not spend at least a little time making sure that the movie is watchable?"
    },
    {
      "rating": "3",
      "text": "For me it was a missing opportunity, I liked the other two reboots but not this one.\rThe movie has a predictable screenplay, you will foresee what will happen in every scene and what the dialogues will be.\rBoth main villain and co-protagonist have two dimensional personality, clichéd appearance and speaks only platitudes sentences.....consequently they both fail to inspire menace or sympathy.\rIf you are looking for an action movie you will be disappointed because the action is there (plenty of it) but is a little silly and not good enough to be the film's main course.\rSadly It's an unsatisfying film also if you want \"Star Trek franchise\" to be something more than a outer space action flick, with familiar characters tossed into a standard mix of pew pew, punches, jokes, bad language and scenes of cities going boom.\rSpecial effect are of mixed quality: ships,planets are really great but aliens, suits and some weapons seems too fake.\rA little part of the plot remind me of wing commander iv....in that game it worked really well but here not so much."
    },
    {
      "rating": "4",
      "text": "Love Star Trek always have.  This is a by the numbers shoot em up Western disguised as sci fi for kids with ADD that like to watch video games.  The story line is just ridiculous as is the ending.  Very disappointing!"
    },
    {
      "rating": "7",
      "text": "Even considering the fact that it may as well be the weakest of the Star Trek reboots (so far), Director Justin Lin uses his unique talents to turn Beyond into a wonderful mix of action, humor, and story."
    },
    {
      "rating": "4",
      "text": "Star Trek Beyond (Spoiler Alert)\rDrake Preatorius, writer for IDiSF.com\r I waited in anticipation for this film. I was the first person in the theater on Friday morning. As a fanfiction writer, I was looking to see how closely the plots of my Krall stories measured up to actual plot of the film. I was surprised by the outcome. Mine are much better.\rJ.J. Abrams, creator of Fringe, director of Star Trek Beyond and Star Wars decided to step aside for this film. Instead, they selected Justin Lin as the director. As you all probably know, Lin has directed the Fast and Furious franchise for several years. Therein lies the first problem with this film. It is no longer a science fiction franchise. It is now an action film franchise, replete with motorcycle chases, fighting scenes and a constant barrage of phaser fire.\rWithout revealing the plot, which was threadbare, it would be sufficient to say it was like eating a bowl of stone soup. Kirk is bored with his role of captain and after only three years as a captain, with no Starfleet degree, he applies for a job as a vice-admiral. He seemed to feel that the job was unchallenging, yet throughout the film he constantly announces that he would be nothing without Spock. This leads us to the next shortcoming of the film, the triad.\rStar Trek fanboys whined like babies who had been pulled from their momma’s teets when Uhura replaced McCoy as one of the lead characters in the first two films. The Star Trek powers finally relented and attempted to recreate the “bromance” between these fellas, but they failed. The truth is, it cannot be done on film. The relationship between Kirk, Bones and Spock developed over three seasons as the actors worked closely together. The relationships between these three characters in the film seemed inauthentic. Kirk is in love with Kirk, which is not too far from case in the television version and although there is banter between Spock and McCoy throughout the film, the chemistry that existed in the television show just doesn’t exist between Karl Urban and Zachary Quinto.\rThis leads us to the third misfire in the film. It is a rehash of the Star Trek 2009. We get to see the same stunts, over again and this time there are no surprises, falling ships rising, Kirk floating in space, fancy transporter tricks and most disappointing, the amber effect from the Abram’s TV series Fringe. I found myself falling asleep halfway through the film.\rWhat they did right was add a bit more content about the female characters. Uhura and Jayla kick butt and take names. There is also a low level female villain and the last minute addition of Shohreh Aghdashloo as Commodore Paris which contributes little to the plot. It comes across as tokenism. One is left wondering if she was related to Lieutenant Tom Paris and his father Admiral Paris from the Voyager show, or if Pegg just couldn’t think of any other names.\rI hear that there is another Star Trek in the works. The best thing Paramount can do is wrench this franchise from the hands of J.J. Abrams and Roberto Orci and hire some DS9 and Voyager writers. They, at least, are familiar with the Star Trek canon. The other thing they can do to save the franchise is to stop courting the video game crowd, who prefer Star Wars anyway, and put the science fiction back into the Star trek franchise."
    },
    {
      "rating": "6",
      "text": "Star Trek Beyond was exactly what I expected; it had humor, action, and suspense. What I liked about the film was it kept the original cast, but that's basically it. Unfortunately, this film failed in my eyes. I wasn't excited by how director Justin Lin did all his video touches (he enjoys inverting his video - filming upside down first then coming back around), it was very annoying to say the least.\r Furthermore, the main issue I had with this film is it never left you at the edge of your seat. Yes, they had large battles (a bit much if you ask me) and some neat special effects, but it was just 'dry' and predictable. Less effects, more story, please. The battles went super quick - rapid scenes every second vs just watching the devastation unfold made me dazed and sometimes confused. Not to mention, I never had the true sense that Krall (main villain) was actually evil, it didn't feel genuine like the previous films.\r All in all, the film was mediocre, but nothing like the first two as far as action, humor, storyline. I feel this has to do with the Justin Lins vision vs the original director - too many variations between the films, but still something to watch. Hopefully Justin Lin sticks to the Fast and Furious franchise."
    },
    {
      "rating": "7",
      "text": "This movie had plenty of redeeming qualities. It is definitely the worst of the Chris Pine Star Trek movies so far, but it is still a very good movie, mainly due to Idris Elba's villainous character, Krall. if you're a Star Trek fan, and you have enjoyed the other Chris Pine/Zachary Quinto Star Trek movies, you'll like this."
    },
    {
      "rating": "8",
      "text": "I was as much a skeptic as anyone, but the switch to Justin Lin as director has produced the most enjoyable of the rebooted Star Trek movies. Granted, it still isn't high art, but if you go in for a popcorn movie and take anything else you get out of it as a bonus, you'll be happy.\r More interestingly, it may also be the Star Trek-iest of the new movies. Beyond the references to the original cast and the series they inhabited, the script also bears obvious similarities to elements of Generations and First Contact and even Insurrection. The pace of editing has dropped out of warp enough to have some shots of what old-school fans would call \"spaceship porn\", and Michael Giacchino, while he's no Jerry Goldsmith, clearly is attempting to channel him with some of the action cues.\r The plot is apt enough, and conveys a sense of exploration and general goodwill (rather than one feeling like Starfleet is a miltary organization). I liked it on some levels, but felt it needed some more rewrites. It has its moments, but the villain and his conflict never really has enough weight or meaning, and some of the dialogue was rather utilitarian and in need of a dose of poetry.\r The action, however, isn't in need of much else at all. It's as pretty and modern as JJ Abrams Trek was, but more intelligible, engaging, and with less lens flares. The inherent drawbacks one now expects from the reboots; the kitsch of the original series and a certain sense of cheapness that comes with excessive CGI, and it lacks the seriousness and weight that a few of the best bits of Star Trek carry. But honestly, this movie is as good as or better than many of its cinematic predecessors, and for a film that was picked by some to damage the franchise, I don't think it will."
    },
    {
      "rating": "3",
      "text": "Whether you are a longtime fan who has seen it all before or a newcomer to the Star Trek series, how you could not be bored out of your mind sitting through this is unfathomable.  On the one hand it's recycled rehash with no spark of originality much less intelligence.  On the other, if you haven't seen it all before you would be baffled by this insider reboot-sequel.  Either way, it's very thin.  The only thing it's beyond is boring!\rPut it this way, I might even take the very first Star Trek movie from 1979 over this, because as dreadfully boring as that non-eventful debut was, it at least had a true sci-fi gothic space opera realism to it.  This thing is wall to walk cartoon action, and as I've warned so many times - non-stop over-the-top action is every bit as boring as no action!\rThe visual effects are the best part, but at this stage in cinematic history great VFX is a given.  That said, there are some clunky shots in this!\rThe director is a mechanic for hire veteran of the laughably awful, silly \"Fast and Furious\" series.  Obviously he can manage a set and technically understands \"moviemaking\", however he is not a gifted storyteller nor what a real director is, or at least used to be since the studio monkeys hire a lot of these types to helm their tent poles and otherwise now.  We don't need more dime a dozen technicians Hollywood, we need those better at story craft!\rThe previous two JJ Abrams directed entries were good (both 8 ratings here), with the first being a true origin story prequel, and the second being a sequel/remake with twist which turned off most and infuriated some old fans.  For some reason I went with it.  Without really giving anything away, we can expect whales in the next entry because it's clear they are remaking the original movie series film by film while spinning it to something they are selling as new.  Yeah, right.  Well the house of mirrors aspect isn't the problem, it's the lack of involving story here that is.  JJ the executive producer now gets sloppy with the property.  Besides the weak story he stupidly goes without the anamorphic flare aesthetic established in the previous two.  Why?  Your wife told you to lose them?  Put on a pair of pants pc leftist p---y!  Criticisms in general of the flares being overdone?  So maybe scale it back a bit, but don't lose that aesthetic altogether!  Now this one doesn't match!  Besides, the flares were fine and a great new visual motif that fit this futuristic content perfectly.  If he had done it for \"Star Wars\" too, that would have been a terrible mistake of course.  Here it's fine.  Stand your ground wimpy nerd!\rLastly, a word on the cast.  All three principles are doing impersonations.  That's not good acting!  Imagine if Daniel Craig or his predecessors did impressions of Sean Connery?  Chris Pine is a solid actor with a look for sure, but he is no Bill Shatner and he never will be.  Not even close, because one thing true stars have is personality.  Say what you will about Shatner, but he became a big star because he's a true original and has personality galore.  He also has proven to be a very fine actor many times out, granted not always.  What sets Pine apart from dozens of good looking capable young Hollywood actors who could just as easily slip into this role?  Not much."
    },
    {
      "rating": "4",
      "text": "I wonder if J.J. Abrams got Lin to have this movie be so awful, folks would forget about their complaints about the last movie. \"Oh you wanna see bad Star Trek? I'll show you bad Star Trek!\""
    },
    {
      "rating": "8",
      "text": "Wow. That is perhaps all you need to say after seeing this film because of how well it was truly handled. I was worried by the director Justin Lin going to carry this Star Trek into a direction that wouldn't gel well with this reboot universe but I actually believe he handled the reigns almost better than JJ Abrams. This film does something that the previous Star Treks didn't seem to do, callbacks to the original series. Comedy is more of the focus of this film but not in the way that is much in the way of jokes but playing off the banter of the crew along with clever and enjoyably goofy scenes. The performances of the reboot crew is as strong as ever for I got the feeling that I was watching an extended episode of the original series in a good way. The special effects are as strong as ever for scenes of destruction have impact and fun. The only major complaints that I have at the film is the villain is a weak one complemented by his explanation and backstory and that one character's tragedy and how you think it is going to resolve doesn't even come through and feels pointless to throw into the story.    Honestly this film more deserves an 8.5/10 but Metacritic doesn't allow half points but all and all this film is certainly worth seeing even more than one time and is in my consideration of top ten films of the year"
    },
    {
      "rating": "1",
      "text": "This is a quote of a review I read on here - \"Every piece of the formula that has ever made a great Star Trek movie is present and accounted for in Beyond. \" 10/10 - really? a formula movie with recycled ideas makes for a great movie? I'm personally tired of leaving my brain at the door. Also, I believe review score sheet is misunderstood, 10 - I like, 0 - dislike; how about a 4, 5 or 6?"
    },
    {
      "rating": "8",
      "text": "One of the better Trek movies. I thought the villain was weak until I didn't (hint)--so the middle of the movie confused me until it didn't (hint). Movie reminded me of one of the better episodes of TOS or TNG--plus more action. A little much too action for me--but that just goes to my personal taste. Really strong supporting character who comes in about a third of the way into the movie. She was awesome. Pretty good humor and a nice message about team work and finding your way in this crazy crazy place we call the universe. Good movie."
    },
    {
      "rating": "8",
      "text": "Live long and prosper indeed! This is a thoroughly enjoyable film which is much truer to the spirit of the original series than previous films, probably due to the influence of Pegg's considered and, at times hilarious, script. Nicely paced, with some stunning cinematography, there's a lot to take in, though some of the editing in fight sequences does occasionally become disorienting. The soundtrack provides an excellent accompianment both tonally and thematically, and there's enough here for both fans of the franchise and new viewers alike. A fun, engaging experience that's worth your time. 8.23/10."
    },
    {
      "rating": "7",
      "text": "Star Trek Beyond may not be the best space voyage for many, but it's a great summer film if you're only looking for a fun silly time at the movies.\r The energy, the character's and the bold scope are the things that makes Beyond watchable. Chris Pine, Zachary Quinto and the rest of the cast are all fantastic in the roles. And this actually feels like an actual Star Trek movie and not a full on remake like \"Into Darkness\" was. All thanks to Justin Lin.\r If only the editing and the villain was improved then this would have gotten a stronger rating. I didn't think the villain was terrible or anything like that, but it was a waste of Idris Elba. I mean, yeah his motivations are relieved at the climax of what he's trying to do and it kinda makes sense. The villain himself wasn't that interesting to me.\r Overall rating: Star Trek Beyond is right up there with \"X-Men: Apocalypse\" as the most fun I had at the cinema. While I liked the first movie a lot more, I still think this a solid third entry to this new franchise.\r Rest in piece Leonard Nimoy and Anton Yelchin. Live long and prosper."
    },
    {
      "rating": "8",
      "text": "It's pretty good overall just like the first one. That into fartness was pretty bad lol lets be honest. That movie is like a 5...\r But this one actually makes sense for the most part, has a villain that isn't trash, and actually has funny jokes. Bones in particular is hilarious. The film also pays respect to the original trekkies which was nice. Unlike that last movie which got Khan all wrong... Ugh.... Anyways believe it or not this new one did a good job for the most part. Easily a 7/8/9 out of 10. I never give 10's because there is no such thing as a perfect film but this one is still worth the money to go see in theaters.\r Letting Simon Pegg write instead of that hack David lindolhoff or however the heck you spell his stupid name made a huge difference obviously lol.\r Clearly Abrams focused more on star wars than he did with into fartness. The changes of developers behind beyond was for the best and it worked out pretty good. This was totally better than the last one. You can't really hate this film. It's a good star trek film.\r Bonus... The new characters added to the cast are VERY good in this film. Best part of the movie honestly."
    },
    {
      "rating": "1",
      "text": "Trek (and it's Trekker, not Trekkie!) has been a thread throughout my whole life and was a big, big thing between me, my Dad and my kids. As a scientist and people-watcher it ticks all my boxes. I cannot express how disappointing STB is and can only say it is for those with a short attention span, hooked on effects and non-stop action. Most reviews haven't yet been posted by life-long fans. JJ, why did you desert the directors chair! Was Jonathan Frakes busy as well?? BIG mistake.\rVery, very thin plot, in spite of the quality and the easy interaction (spot on) of the Enterprise cast to exploit. Trek is ALL about the detail and the human condition and Roddenberry would have been appalled. With the huge universe of possibilities out there and all of Roddenbury's \"what-if\" plots from past TV episodes is yet another disaffected bad-guy all they could come up with? I know almost nothing about him, where he got his technology from; whose artefact was it and why was it being given from one unseen race to another (never to be seen again); what part of the galaxy/universe was it? Where there aliens or droids in those ships? What was the nature of the weapon and who developed it and why? etc, etc, etc. On top of this, Spock, fat-faced, blubbing and indecisive? NEVER!\rWhere was the onward development of the continuing crew story, to connect past and future. Where were the beloved references to our reality? The \"proper\" science? The trashing of the Enterprise was over in moments and without much drama with the crash landing of the saucer section not A PATCH on the one covered with huge emotion with the Next Generation crew, the personal moments between the crew where fleeting and the same old banter. No new information. Nothing I cared about.The dare-devil manoeuvre with the USS Franklin diving into the water was also a \"blink and you miss it\" potential stunner.\rBasically, all been done, and better, before, Fast and Furious in Space is the best description I've seen so far. I've had a terrific ride for 50 years and it was bound to end eventually but it's sad to see it come to this. Not even an Idris moment of tenseness to drool over. Thank God for the series boxed sets."
    },
    {
      "rating": "0",
      "text": "childish, useless, boring, predictable ... my god.... where is the real star trek? why don they pay soeone to write the plot instead of asking children in schools?"
    },
    {
      "rating": "7",
      "text": "The crew of the U.S.S. Enterprise is back for an adventure in uncharted space, where they encounter the inevitable new enemy. Justin Lin, director of the \"Fast & Furious series, has added plenty of dizzying action, but it's often hard to follow. The interaction between the characters holds up the terse comic style that's kept relationships so enjoyable. There are the expected cool efx, amazing environments and neat creature makeup. Even though the plot lacks imagination, there's enough going on to make it enjoyable. BTW, the gay Sulu moment feels shoehorned into the film just to make a statement."
    }
  ]
}