{"id": 2589, "title": "Star Wars: The Clone Wars", "starring": ["Matt Lanter", "Ashley Eckstein"], "runtime": 98, "genre": ["Animation", "Action", "Science Fiction", "Adventure"], "description": "Set between Episode II and III, The Clone Wars is the first computer animated Star Wars film. Anakin and Obi Wan must find out who kidnapped Jabba the Hutt's son and return him safely. The Separatists will try anything to stop them and ruin any chance of a diplomatic agreement between the Hutts and the Republic.", "releaseYear": "2008", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/d6YOfi0T9GowglzIkDQGGvGYVTM.jpg", "categories": {"plot": 5.52, "acting": 4.9411764705882355, "ending": 4.0, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 6.333333333333333, "funny": 3.8, "action": 4.571428571428571}, "reviews": [{"rating": "5", "text": "It was ok for an animated film but it doesnt really establish much for the Star Wars franchise. Its more like an experiment that was a minor sucess. The entire film is really just a build up to the animated series, Thats it."}, {"rating": "4", "text": "Let me just say that I was super excited for this movie(it was the first star wars movie I got to see in theaters). I was very disappointed to see that this was just a 98-minute commercial for the tv show. There is practically no plot, and Ahsoka is annoying, and doesn't fit into the timeline."}, {"rating": "4", "text": "(38/100)It wasn't entertaining in general. Plot felt lacking and in the end it was just about handing over a captured mini-slug to a gangster mega-slug."}, {"rating": "4", "text": "The beginning part of this movie is good, but it all falls short toward the middle and end."}, {"rating": "7", "text": "I saw an early screening of The Clone Wars yesterday and was pleasantly surprised after the debacle that was the prequel trilogy. This is in no way meant to be the 7th Star Wars movie (or even 2.5), nor does it try to be. Instead you get a straightforward story, with some very good animation, and the most character development from a SW movie since Jedi. We actually see Anakin mature as a leader and Jedi Knight. Points are certainly lost on the cheesy dialogue of those annoying droids, the brother-sister yapping between Anakin and his Padawan, and the androgynous Hutt uncle. But overall this movie makes for a fun outing if not taken too seriously."}, {"rating": "10", "text": "Something stinks in these first reviews. First of all, how many C's do we need to review this film? Second, they are all filled with typos and horrible grammar. Third, they all score the film a 0 and several instruct people not to see the movie. Finally, they all have--apparently--seen the film before its release. There is something fishy here."}, {"rating": "8", "text": "I enjoyed the original cartoon network animations and found this on par with those, plenty of action to keep a REAL star wars fan happy."}, {"rating": "7", "text": "It was definitely not a traditional Star Wars movie, but still enjoyable. For those of you who are strictly SW purist, you will not like the movie. If, however, you enjoy SW for the plot along with the cool tech, then you will probably like it. Keep in mind this is the plug for the tv show coming to TNT sometime in the near future."}, {"rating": "0", "text": "This movie was never interesting.  When it wasn't boring, it was just plain stupid and asinine.  I feel bad for George Lucas to have been forced to be guilty of this worthless crap by association.  I saw it in theaters, and it had awful voice acting.  I was stupid enough to expect something like...say, an animated version of part of Episode II--when the Clone Wars took place in the Star Wars saga.  I can't believe how STUPID I am!"}, {"rating": "3", "text": "After watching the film, I began wondering why I bothered watching it at all. I mean, seriously, there's no point in producing something like this. I think that if you're a hardcore Star Wars fan, you still don't like it."}, {"rating": "3", "text": "\"Star Wars: The Clone Wars\" ultimately cannot bring enough to match itself with its live-action franchise, and its story lacks much of the wit put into their world. With its constant usage of action, without finess, the film suffers to be nothing more than a movie made to make a few bucks. Though kids will be fine with it, older kids and adults will probably want to spend their money on other movies out there."}, {"rating": "3", "text": "Star Wars: The Clone Wars is a waste of time. I don't care how big of a Star Wars fan you are this movie is really hard to like. The film offers a major role for a new character Ahsoka Tano, who is so annoying. The banter between her and Anakin was so lame and childish. Most of the voices for the characters are new and completely flat. The movie also is way to confusing for kids but the dialogue is certainly dumbed down for kids. Don't bother with this crap."}, {"rating": "2", "text": "This is a movie that I didn't think was going to be bad. I was like 10 years old at the time when this came out. Instead of an awesome movie, I got a piece of **** movie. I love every single star wars movie, even the first one, which might be my favorite (Sorry). But, this movie was SO BAD that I could not even finish it because I was in shock of how **** awful this thing was. This is not star wars, nor a mediocre movie. I would rather watch Freddy gets fingered 10 times than watch this piece of **** once."}, {"rating": "4", "text": "the animation is fine with some decent moments but the characters are awfully written and film is extremely boring mainly because the plot and pacing are fractured in their structure."}, {"rating": "4", "text": "To describe this movie in a review, Star Wars: The Clone Wars doesn't feel like a good installment... in the franchise or not. As a matter of fact, this felt like it should've been a straight-to-TV movie or felt like a pilot episode of the Clone Wars separated into three (or four if there's an extension scene) parts airing on Cartoon Network."}, {"rating": "3", "text": "Originally intended to be a series of episodes for the eventual TV show, The Clone Wars ultimately was a poor decision to create as a movie. It introduces characters that will play well down the road, but this movie is disjointed and lacks a cohesive vision for how to be satisfying in a cinematic sense. See this movie if you want the origin story for Asokha Tano, Anakin's bratty padawan who slowly wins you over through several seasons of the strange but fun CGI animated series."}, {"rating": "2", "text": "Seriously? It's a lot worse than episode I. I was happy to see old characters, but storyline was so messy and I couldn't really focus on the film because it was just bad."}, {"rating": "2", "text": "Huge disappointment, I feel that’s this movie Is just dumb and should’ve never been made. I’m a huge Star Wars fan but the animated one is a terrible movie. It’s boring and doesn’t make sense at all. This is the one Star Wars movie that I’ve seen is bad. Not even gonna bother watching the holiday special or the Ewok movies,"}, {"rating": "10", "text": "The problem is people are looking at this movie and expecting something like Episodes I-VI. It isn't. This was simply an hour and a half pilot for the only good show on Cartoon Network. And as a TV pilot, it was great. I'm sure that had this been released straight to TV rather than theaters, there would've been way less negativity."}, {"rating": "3", "text": "\"Star Wars: The Clone Wars\" is basically for the Star Wars fans and kiddies. If your not into it, this will NEVER appeal to you. Never...."}, {"rating": "7", "text": "I don't get it.I've read review after review of this movie. Every fact has been accurate. My problem is with the emotional translation of the expectation.The Clone Wars was a good movie. If you are 8-12 years old. At 35, I was able to enjoy it for what it was: a good kids movie set in the Star Wars universe.What are these other reviewers wanting? I was 5 when Star Wars came out. 8 when Empire came out. 11 when Return came out. Most people who now claim to have been Star Wars fanatics fell right around the same age. This meant, at the peak of our hysteria, we were around 8. We thought (and still do) Empire was the best movie. And it is.We were 8.We wouldn't have, for a minute, been able to appreciate the dialogue of Pulp Fiction, the directing of Out of Africa, the story of Avalon or the acting in Glengarry Glen Ross.We were 8.So...I took my 8 year old to see The Clone Wars. And he was entranced. The action, the humor, the battles, Ritto the huttlett. Everything I've read as a complaint to this movie.You know why? Because it was made for an 8 year old.So was the original Star Wars trilogy.Hey...my generation. Stop criticizing George Lucas for making movies for kids. It's what he did from the minute he made Star Wars until the day he gave into the mid-30's fanboy and created Revenge of the Sith. He enjoys it. That's why he made another Indiana Jones. It's why he can't stop making Star Wars things. HE LIKES IT. He does a great job appealing to that age. And the kids love it.You aren't going to get the amazement of an 8 year old out of these movies while critiquing it with the intellect of a 36 year old. So stop trying.If you have young kids who love Star Wars, take them to see it. Show George that there is a reason to keep making these things. Kids love it."}, {"rating": "2", "text": "This was utterly painful to sit through. Don't get me wrong I LOVE STAR WARS, but this isn't the Star Wars that we loved back in our childhoods. Where did all this go wrong? My guess is that George Lucas wanted to extend the lifespan of Star Wars merchandising by making a new Star Wars movie made up of the first 3 or 4 episodes The Clone Wars TV series, only to expand on the merchandising when the series came out.\r This is not Star Wars. This is Star Wars: The Bored Wars. The battles are not exciting or engaging; they are the most formulaic thing in the film, and there is nothing much to add aside from how poorly edited this movie really was. Hell, the episodes, if they were kept in their original forms, would probably be just as bad as before even without the clumsy sandwiching they used to put them together in one under-produced film."}, {"rating": "5", "text": "not a terrible movie, but its just wasn't good enough. the animation was kind of cheesy and the storyline was kind of messed up, but the acting wasn't that bad and the visual effects were very good. Star Wars fans would like this one."}, {"rating": "10", "text": "I do not get it. You realize this has been released much before the series within. And it should be serving it like a prologue, showing the originality of each character. If you do not get the reason of having this, then, shut up.\rFirst of all, I am sorry that I have seen this muuuuch before I finished the series. And too bad it was cancelled. After all I understand a big part of the action.\rI am over 15 and I like this. It it like an ordinary episode from the series, but a bit longer and rolling out for showing us the characters and the progression.\rStop arguing with fans. If you are not a fan, you will never understand. I do not get the scores. It has sense, it has story progression, it has everything... So... give us real reasons for hating this!"}, {"rating": "4", "text": "Es aburrida. Mientras que la serie tenia unos momentos algo tontos, estos te daban al menos alguna risa. También la serie es mas pausada, no lenta si no pausada, se toma momentos para poner a los personajes a hablar y evolucionar. Aquí no hay de eso y lo poco que hay no se siente nada natural. Asooka y Anakin interactuan como si se conocieran de hace mucho con una relación aprendiz-maestro con mucha confianza, pero en el contexto se han conocido apenas hace unas horas. Además todo el dialogo que en la serie resulta interesante y llevandose mas tiempo, aquí, lo cambian por peleas constantes y se vuelven aburridas.\r No esperaba algo como un episodio de la saga actuada en vida real, pero esperaba algo mas que 1 episodio sumamente alargado con peleas. Es literalmente eso, un episodio al cual le añadieron mas peleas para alargar su duración de 1-2 capitulos a una película. 04/10"}, {"rating": "9", "text": "While not as good as the show, the Clone Wars is a stellar Star Wars film that's definitely worth seeing. The introduction of Matt Lanter as Anakin and Ashley Eckstein as new Padawan Ahsoka Tano are great choices!"}, {"rating": "0", "text": "I suppose this movie was intended for a younger audience, seeing as the rating bar cannot go any lower. I consider this film to be the most despicable, disgraceful, dishonorable, disgusting, disenchanting, disregarding, demoralizing, dismal piece of **** I have ever seen. George Lucas, why did you have to go throw up on the Star Wars saga and then take a BIG @$$ **** ON IT?!?!?!"}, {"rating": "3", "text": "It still baffles me that they had to replace the fantastic cartoon network animated series that came out in early 2000'S, for this one. The original animated clone wars kept it simple, and linked the 2nd and third movies together perfectly, but this... this just adds a bunch of unneccessary characters, and adds cannon that doesnt fit, compared to the original animated series, which doesnt try to hard to cram in crap that clearly doesnt fit. like Anikan having a padawan, completely unneccessary. Youd have to be really young, or a very accepting star wars fan to get any enjoyment out of this. it does have good lightsaber duels, and its awesome to see more backstory on jedi in the council, but they executed the story in a completely wrong way, and the animation comes off as very kiddy as well. im not a huge star wars fan anymore, as ive basically grown out of it, and while i do still consider myself a starwars fan, and i do look foward to seeing 7, 8, and 9 in the theaters, this entire movie and animated series im just going to pretend didnt happen. this score is completely opinion based, but i stand by my opinions, and the opinions of many others, on this movie and even the tv series. good seeing jedi and great action scenes, but a story that doesnt fit and all together seems completely unneccessary, which makes it hard to get into."}, {"rating": "1", "text": "A disaster movie made ​​only for those who saw the bad set of 'Star Wars: The Clone Wars'. The movie is terrible."}, {"rating": "3", "text": "When I was sitting in a theater during the summer of 1977 enthralled by the spectacle that was Star Wars, never did I imagine that, some 31 years later, I would find myself wishing it would go away. Overmerchandising, fan unfriendliness, and greed have sapped all that was magical about the Star Wars name. The Clone Wars, as obvious a money-grab as there has ever been, stands alongside the infamous 1978 Star Wars Holiday Special as officially sanctioned productions that are better ignored or forgotten. The Clone Wars is the last nail in a coffin that has been propped up ever since George Lucas sold his creative soul in the quest for a few more pieces of gold.\r It has been 25 years since the Star Wars saga has moved forward. In that time, we have gotten three movies' worth of back story, but there really hasn't been anything new. The prequels work well enough in the overall picture of things, but there's something a little underwhelming about watching the pieces fall into places where one knows they'll end up. The tragedy of Anakin's fall is less compelling because we know what will happen to him after that fall. Now, with the latest cinematic installment of Star Wars, does Lucas finally give us something new? No. He returns to the time period of the prequels (specifically, the gap between Attack of the Clones and Revenge of the Sith) and gives us more back story. Only this time, we know the specific fates of all the characters. It's hard to imagine a more pointless endeavor.\r To add insult to injury, this isn't even a live-action episode. It's animated. In fact, the movie is really the pilot for a TV series and looks about as stilted as one might expect from something with that pedigree. This isn't quality computer generated animation, it's cut rate stuff. It might look okay on a television but, blown up on the big screen, it looks cheesy. The space ships and droids are okay, but the humans have the appearance of old-time Christmas tree ornaments. The Star Wars action figures have more personality. Then there are the voices. Most of the actors declined invitations to provide their vocal talents, so we have a group of unfamiliar actors giving voice to the animated likenesses of Anakin, Obi-Wan, Yoda, and Padme. Only Samuel L. Jackson (as Mace Windu), Anthony Daniels (as C3PO), and Christopher Lee (as Count Dooku) provide a tenuous link to things past. (This gives Daniels the distinction of being the only actor to have participated in all seven Star Wars motion pictures.)\r The Clone Wars is a good example of how action can be boring. Roughly 50% of the movie features droids and clone troopers blasting each other. Repetitive doesn't even begin to cover it. A lot of the other stuff is anti-climactic. For example, there's a lightsaber duel between Anakin and Count Dooku, but since we've already seen the final confrontation between the two in Revenge of the Sith, this feels more than a little unnecessary. From the moment it begins, we know it's destined to end in a stalemate, so what's the point?\r Throughout the six live action films, Lucas created a number of memorable sidekick characters - some successful, some not so successful. C3PO and R2D2 rank at the top of the former category, and are viewed by many as the most endearing inhabitants of the Star Wars universe. Then there's Jar Jar Binks, and the less said about him, the better. (To his credit, Lucas heeded the negative feedback and phased Jar Jar out of the series after The Phantom Menace.) The Clone Wars gives us Ashoka Tano, a bratty teenage girl who is nearly an annoying as Jar Jar, but without the accent. Since she's nowhere to be found by the time we get to Revenge of the Sith, one must assume she's not going to make it through the TV series. Sadly, her demise does not occur at any time during The Clone Wars.\r There's just enough of John Williams' main title to trick us into momentarily believing this is a true Star Wars movie, but even that has been re-mixed so it doesn't sound quite right. The incidental music is adequate but, considering what we have come to expect from the Star Wars features, it sounds pedestrian. It's another example of how much the entire project feels like a cheap knock-off - an attempt to prey on whatever little good will still exists in Star Wars fandom. Judging by the surprisingly sparse audience at the \"free\" promotional screening, however, there's not much enthusiasm out there for The Clone Wars. Gatherings for pre-release screenings of Revenge of the Sith were madhouses, with lines circling blocks. There were rows of empty seats for The Clone Wars. This surely won't be the last time Lucas attempts to wring blood from his Star Wars stone, but perhaps this golden egg is hard-boiled."}, {"rating": "0", "text": "Yes, a little fan of Star Wars, with high expectations from Phantom, astonishingly surprised myself with a cheesy cornstock of complete patheticness (ignore the horrible spelling grammar). My expectations for the Star Wars tirlogy from Attack of the Clones, to Revenge got much lower. The second one was good, but the third had corny lines and bad acting (Hayden Christenson, razzi winner, mind you). I see a trailer in the cinemas while watching Get Smart on Aug. 1, and I see an animated Star Wars thing on the big screen. First of all, you can tell the script is awful by the cheesy lines they added in the teaser and theatrical. But then I randomly saw it, judging most aspects of the film to see how bad it really was after all. The special screening was interesting, and goodness, when this crap comes out in the cinemas, people will avoid it. Lioke seriously, what's the point of adding a remake of Revenge of the Sith, by changing almost everything around. It was very confusing. I don't know what Lucas was thinking while making this, but I think he's either on meth, or he's expecting to lose his career and laugh while people are watching him fail at his life -mostly taking back the reason why he won a life achievement award. But what a huge downfall in his career. In anutshell, its bad."}, {"rating": "7", "text": "A pretty smart idea by the people who made this movie and the TV show, they get the commercial for this show on Cartoon Network, kids who are Star Wars fans see it and tell there parent's about how much they want to see it, and parents take their kids to see it to make their kids happy and saying \"Hey, it's a new Star Wars movie so I wont be bored out of my mind taking my kid/kids to see it\". All the while the creators are raking in the money for the movie while simultaneously getting people pumped for the new TV show. As for the movie itself it's not that bad, it may only please the younger Star Wars fans, but older fans can get into it if they keep an open mind. It's basically just one battle scene after another with a simple plot behind it, and even adds some lightsaber duels and some touches of humor here and there, and does a good job of introducing a few of the new characters that you will be seeing in the TV show. It all turned out well in the end but I still can't help but feel like the movie could have been better, but it's not the worst thing that's happened to the Star Wars series (I'm talking about you Hayden Christensen)."}, {"rating": "5", "text": "Better than the new trilogy but not great in its own right, intermittently entertaining."}, {"rating": "8", "text": "I liked it. Shame there wasn't the real voices of the characters like Hayden Christiensen or Ewan McGregor. Good thing you got Christopher Lee back in tho. Its much like the prequels, but theres not Jar Jar or anybody or anything that annoys you. Great... for an animated movie I mean. This isnt a good movie compared to the real-life Star Wars films, but it's as good as an animated movie is going to get."}, {"rating": "8", "text": "its 4 episodes of the clone wars TV SHOW turned into a movie, great battles, great locations, very creative retarded story. Its actually cool i remember, seeing it in Lisboa i was like wow cool im still like, k\rR I P Christopher lee"}, {"rating": "6", "text": "When I was in the theatre for this I was quite disappointed. After all tho, Disney proved it could have been a lot worse and the movie at least had character.The tv show is a solid 9/10 from season 3 to end, tho."}, {"rating": "10", "text": "I think this movie is better than all the prequels. It has more developed characters, great animation, and a start to a new series. The plot is a bit stupid, but it is easily forgiven by the great action scenes. Rotta the hutt can get annoying at times, but not too much. Overall I enjoyed this movie, and it feels just like the cartoon."}, {"rating": "7", "text": "Far from perfect but still entertaining unlike new movies nowadays. At least we have real force users."}, {"rating": "8", "text": "Im going to be completely honest, I actually think this is a solid movie. Even though the plot is pretty dumb, and some of the characters needed development, this was a fun star wars movie. The animation, action, and story were what made me like this film."}, {"rating": "7", "text": "This film is enjoyable, but I personally wasn't that enamored with the story. The animation is well done, and it does a good job setting up one of my favorite TV series of all time, but I think this film could have and should have been done better."}, {"rating": "7", "text": "As more star systems get swept into the Clone Wars, the valiant Jedi knights struggle to maintain order. Anakin Skywalker and his Padawan learner Ahsoka Tano embark on a mission that brings them face-to-face with Jabba the Hutt. Plotting against them is evil Count Dooku and his agent, Asajj Ventress, who would ensure that the Jedis fail. Meanwhile, Yoda and Obi-Wan Kenobi lead the clone army against the forces of the Dark Side."}, {"rating": "10", "text": "I don’t understand the whole hate towards this series, I personally liked how this period was shown in star wars and how Anakin fell to the dark side"}, {"rating": "0", "text": "It"}, {"rating": "5", "text": "I gave it 5 for the graphics, I wasnt sure I would like the style but it grew on me in the end, but the movie didnt. It just didnt seem to fit into the other star wars movies which mostly I enjoyed far more than a 5. This just didnt cut the mustard. Wait for the dvd... you kids will enjoy it.. they really lucked out with the PG rating should have cut a bit of the violence and gone with a G because young kids are the only ones who will enjoy it. My kids 6 and 9 thought it was okay... but didnt get that excited. Maybe the next one??"}, {"rating": "0", "text": "I am a religious star wars fan and this film is blasphemy. I can't believe Lucas let this happen. Star Wars is not fucking funny, it's not a f*cking comedy, this is serious shit and I piss on this movie."}, {"rating": "10", "text": "This is the best star wars movie ever, with the best graphics ever! Ok so no one has actually seen this movie so you can safely ignore all the haters below. I'm sure it is a nice little marketing movie, but if it is half as decent as the Clone Wars series was on Cartoon Network then I'll still probably watch it. I might wait for DVD though, who knows. Those who bitch about the graphics haven't seen the Clone Wars series and have no clue why they look the way they do. It's called \"style\" people, they picked the style the animated series was made in and stuck with it. If you don't like it, tough. So it's not super fake looking CGI like the last three movies were, I don't care! At least it looks fake on purpose. So all you basement dwelling nerds can get off your high horses and go away until you've actually seen it."}, {"rating": "1", "text": "This was the first time I ever walked out of a movie."}, {"rating": "1", "text": "What has happened to George Lucas? After three of the greatest movies of all time... He gave us three of the most disappointing movies of all time. And now this! The company that pioneered CGI did such poor \"cartoonish\" work in the 3 star wars prequels, it looks like they've decided to do away with real actors, and just give us straight cartoons. And the overall quality continues to decline. GEORGE! Get out your DVD player and watch the original star wars again! It was groundbreaking and incredible. You can do it again! Give up on the kiddie flicks, and re-do the last 3 movies to the quality of the first!"}, {"rating": "2", "text": "Richard K. they have these things called pre-screenings. you can see the movie before it comes out. nothing fishy, you're just poorly informed. i saw this and i was stoked to get my 'star wars' on and i was so let down from this p.o.s story. i love the graphic style and direction, but a movie with no or poor story direction is as entertaining as staring at a wall for 98 mins. you'd have to have a mind of a 5 yr. old to think this movie could ever become a 10. no taste."}, {"rating": "0", "text": "Another nail in the coffin of the once inspiring and transcendent legacy of Star Wars. Do I need to see this to rate it zero stars? No. Do you need to see this to rate it zero stars? No. Please do not see this movie you will only encourage Lucas to continue the slaughter and desecration of the Star Wars legacy. Some one with the power in Hollywood please bar Lucas from making any more movies. It should be a crime for him to make any more movies. I"}], "recommendations": ["solo_a_star_wars_story", "rogue_one_a_star_wars_story", "star_trek_nemesis", "star_trek_beyond", "star_trek_insurrection", "red_dawn", "star_trek", "star_wars_episode_ii_attack_of_the_clones", "superman_ii", "star_wars_episode_iii_revenge_of_the_sith", "star_wars_episode_i_the_phantom_menace", "terminator_genisys", "star_trek_into_darkness", "john_carter", "serenity", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "tmnt", "dragonball_evolution", "underworld_rise_of_the_lycans", "ice_age_collision_course", "battle_los_angeles", "the_matrix_revolutions", "batman_v_superman_dawn_of_justice", "percy_jackson_sea_of_monsters", "underworld_blood_wars"]}