{
  "id": 4834,
  "title": "Star Trek: Nemesis",
  "starring": [
    "Patrick Stewart",
    "Jonathan Frakes"
  ],
  "runtime": 117,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "En route to the honeymoon of William Riker to Deanna Troi on her home planet of Betazed, Captain Jean-Luc Picard and the crew of the U.S.S. Enterprise receives word from Starfleet that a coup has resulted in the installation of a new Romulan political leader, Shinzon, who claims to seek peace with the human-backed United Federation of Planets. Once in enemy territory, the captain and his crew make a startling discovery: Shinzon is human, a slave from the Romulan sister planet of Remus, and has a secret, shocking relationship to Picard himself.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cldAwhvBmOv9jrd3bXWuqRHoXyq.jpg",
  "categories": {
    "plot": 5.5625,
    "acting": 5.153846153846154,
    "ending": 7.357142857142857,
    "soundtrack": 7.0,
    "cinematography": 3.0,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 7.1
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Quite simply, the worst film in the franchise. Far too much is wrong with this film for me to write in one review. 5,000 characters isn't close to enough, it'd have to be an entire series of video responses for me to detail all of this movie's faults."
    },
    {
      "rating": "7",
      "text": "A movie shouldn't be loved if your a fanboy of the movie series, it should be loved for the quality. Not ot say I hated this movie, the plot is a good Idea, but the action scenes are getting to tiresome, and the special effects are great, but all of the other star trek movies (except for the first) are better, and i'm not saying that as a fanboy, but as a movie buff."
    },
    {
      "rating": "2",
      "text": "Star Trek is best when it gets its Characters to do compelling, interesting things in the face of existential, moral, or even philosophical threats and dilemmas.  Lacking that, which this movie certainly does, a tightly constructed good vs. evil showdown makes a passable substitute, as worked so well in the Wrath of Kahn, or The Undiscovered Country, which incorporated several elements to craft a great film.In this film we watch them drive dune buggys around a planet they shouldn't be on to find Datas developmentally challenged replacement.  We see a villain suffering from constipation bent on destroying the Federation and watch as the Enterprise fails at every turn to be sufficiently capable, in spite of being the greatest ship Starfleet has to offer, to even dent the enemy ship.  We've certainly seen this before.As this disaster wheezes to an end, we find Data gone, most of the rest of the crew tired from making sure to be as ordinary and unremarkable as possible, and ourselves wishing that they had just stopped after 9, or, better yet, 8 movies if they weren't even going to try."
    },
    {
      "rating": "7",
      "text": "I was a fan of the Star Trek TNG TV series, in fact to this day it is my favourite TV series of all time. But like Generations and Insurrection, this one just ended up being mediocre.  With the exception of Star Trek: First Contact with was absolutely great, there were TV episodes equal and in some cases better than the TNG movies. I'm still bitter about them cancelling the series while it was the number one rated TV show just so they could make 3 mediocre movies and 1 good movie. SPOILER ALERT: I can't believe they killed off data. I mean I knew one main character was going to die ahead of time, but Data? BTW: I was hoping they'd make 1 more TNG movie just so they could bring him back, it was pretty obvious how they laid the ground work to do so, Data's memory chip was in his android (er... artificial lifeform) brother's head although his brother couldn't access the memories there was the potential for him to expand his hardware/programming later to bring Data's memories back and incorporate them, but I guess Data is gone forever since they will never make that movie now :("
    },
    {
      "rating": "10",
      "text": "NEMESIS is a pure delight for fans and non-fans.  This film is filled with great acting performances by Patrick Stewart as Captain Jean-Luc Picard and Tom Hardy as the evil villain Praetor Shinzon.  We for the first time in the Star Trek universe get to explore the Romulan Senate, political structure, the twin world Remus and see for the first time the Remans.  While there are great action sequences the main heart of NEMESIS is Shinzons struggle for his identity over Picard.  This is a must see for fans of philosophical dramas as well as those who love science fiction.  A must see!"
    },
    {
      "rating": "6",
      "text": "Here you can see that the TNG crew is getting a little tired and stale. It was better than Insurrection, but not by much. I did find the premise interesting but it's execution felt a little underwhelming and flat.\r Overall:\rIt is a decent movie that could have been better. If I had to some it up in one word: Underwhelming."
    },
    {
      "rating": "10",
      "text": "Great movie. Visually awesome. Philosophically intriguing. Emotionally dramatic. I loved it, as a Trek film and as even a regular movie, and I really don't understand why people didn't like it. I'd give it a 9, but I'm giving it a 10 because it deserves better than it got."
    },
    {
      "rating": "9",
      "text": "NEMESIS, a generation's final journey is exactly that and more. Finally a Next Generation feature that stands well on its own and offers a fitting finale for a crew that began their onscreen voyages in 1987. Much has happened since but this series' achievements should not be underestimated from the oversaturation that came later, and this movie is a magnificent coda to the crew and cast of the Starship Enterprise. Very few things could have been done to make it even etter, and as such I rate NEMESIS a full 9."
    },
    {
      "rating": "10",
      "text": "A Wonderful movie, I totally disagree with the reviews above. In no way was this movie predictable, the ending fit well but manythings could have happened with in the last 10 minutes that you just didn't know which one it was going to be. The only thing predictable about this movie is that ...... Although the movie does not throw in any events from the tv series, the story moves well from event to event. I was amazed at the resemblance of the android b-4 and data. I was waiting for someone to say he lookd just like data's brother from the tv series (who's name i have forgotten). This is the movie making makeup that goes along with most movies. Not everyone has seen the episoeds and this is generally the best way to keep things rolling with a new audience. Being a fan of star trek, and not the other star.... star something moive, I liked this film. I did the best i could to not throw in any spoilers so get to the movies and see how the end of a generation starts your weekend."
    },
    {
      "rating": "8",
      "text": "Excellent movie, and a satisfying end to the Next Generation stories. I am now and probably always will be baffled by the negative critical response to this one. It's not quite \"Wrath of Khan,\" but I put it just a little behind \"First Contact\" as one of the great Trek movies."
    },
    {
      "rating": "1",
      "text": "Nemesis was so bad and juvenile that I cringed during the showing. The dialogue and acting was a complete joke. Patrick Stewart must be puking after wathcing his own performance in this DREK? Gene has to be turning over in his grave with Capt. Kirk probably grateful that he is already in his. Even the writing for Data has been done before in earlier ST movies but with Mr. Spock. What were the screenwriters thinking of?... It is time for all ST fans to abandon ship! Just terrible."
    },
    {
      "rating": "5",
      "text": "Overall, to me, this is by far the worst of the Star Trek films, in fact it is worse than the abysmal Star Trek V The final Frontier. Final Frontier at least kept fairly true to their characters though so it wins out. While there is much good in it, like Darth Vader, it deserves death. Unlike Vader, there is little chance for redemption. (yes, I mixed my Star Wars with my Star Trek, fight me.) https://latetothegame.blog/2019/02/22/retro-tv-review-movie-edition-star-trek-nemesis-1998/"
    },
    {
      "rating": "2",
      "text": "This movie is story is like a regular episode of the Star trek next generation tv show. Most of the main characters do not get ant screen time and are used as extras. I didn't liked it so much"
    },
    {
      "rating": "6",
      "text": "The movie that broke the rule (of two;-). Until this the even numbered Star Trek movies were the great ones. This movie while not as bad as Star Trek 5 does not deliver. It fells like the parts of the story were patched together without polishing the edges. For itself the story arcs have potential. I can retell the story in a way that you will be excited until you actually saw the movie. It is about mayor intrigues in the Romulan government, the relations between Romulus and the Federation, about Data and a long abandon plan involving Picard that could have shaken the foundations of the Federation. Even with this spoiler safe wording you should see the potential. Sadly it does not deliver. I wont even blame the actors. They did a good job. I like especially Data, Picard and Shinzon. I will point out that Tom Hardy did a good job as Shinzon but is a mismatch for the role (Cant spoil). I will even say it is unwillingly funny or gives you the feeling of disbelieve. The special effects are good as are the battles. My complaint is that the final battle is nothing new and much is predictable. Also the commanding officers are morons for getting this started there. Even I would or could avoid this disadvantage. I would say there could be a good or even awesome movie with this premise but it doesn't get me hooked. Overall this movie ended the TNG era. I would have wished for a better and more satisfying ending but don't see this as failure. At least it is worth watching."
    },
    {
      "rating": "6",
      "text": "this movie is decent but there are a lot of problems in it. Let's start at the beginning where we see two of the Next Generation grew getting married. I won't say witch two character are getting married because I do not wish to spoil parts of the movie. Of course if you've seen a of TNG the two that are getting will not be a surprise. however this event has no importance in the plot what so ever. Then before they can settle down they get reading of android being on a nearby planet which begins a sup-plot for data since he has an android feels a connection with the other android that they find. this is one of the good parts movie because we get to see data evolve as character. Now let's address the main villain Shinzon. He is a great villain to be last one for the TNG cast to face. The only real problem with him is that the way he goes about accomplishing his goal is confusing. Hell at one point he take time out of his plan to mind rape Troi, which does nothing for his goal. another problem is if your new to star trek you will not be able to understand most of what's going on. In conclusion if your new to star trek stay away from this film, however if your a fan of TNG then you might want give it watch."
    },
    {
      "rating": "7",
      "text": "The final showdown for the next generation crew and FINALLY the Romulans get a chance to shine. Thing is they are overshadowed and pushed to the side by the Remans, guess the Romulans had to wait for the reboot.\r Sooo here we are again, Earth in danger from an alien race and Picard is also being abused by another alien race, again. First he's assimilated now he's being mentally tortured by his power crazed clone who wants his blood...literately, some days huh.\r I must admit I can't get my head around film responses at times, I've read this was looked upon negatively. Why? its actually a pretty good Trek adventure and possibly the slickest of the next generation films, maybe the best of the four. Certainly better than 'Insurrection' and 'Generations' and much more open for everyone instead of just the Trekkies, which is probably for the best if you think about it.\r Plot wise this is total Star Trek, exactly as you would expect with overblown ideas and fantastic notions of sci-fi. Its not original and its not gonna surprise you but at the end of the day it does the job and entertains for the run time. Hardy is the bad guy dressed in shiny black armour (and am I the only one who forgot all about him being in this?! I was like...hey that's Tom Hardy!), He's bald, he sounds like David Thewlis and he's unpredictable with bouts of sulky anger down to his young age, I presume that was intended. Put simply he was a darn good villain (finally) who was perfectly slimy enough to get under your skin, just what the franchise needed.\r The rest of the bad guys all look really decent too. The Reman makeup/prosthetics are excellent in fact, first really good Star Trek aliens I've seen to be truthful. OK they do look like a race of Nosferatu, in fact a bit too close really, almost a complete rip- off, but I must admit they look damn good, highly aggressive and imposing visually, kudos.\r Actually the bad guys in this film coupled with the nice makeup and regal work/designs on the Romulans completely steal the show from the Enterprise crew. We all know the next gen crew are dull but they pale in comparison to the villainy on screen here, I actually wanted the bad guys to win this, would of been much more interesting.\r It was also weak to see they finally got the balls to kill off one of the next gen crew (Data) only to basically have him survive on by introducing an earlier model. I could see that coming miles away, and of course Data conveniently manages to upload all his personal 'data' into the earlier model before he sacrifices himself. So basically Data was killed but low and behold the replica earlier model takes his place complete with all Data's personal memories and attributes, as if he had never left *groan*.\r As I said earlier this is easily the best looking of the next gen films, probably all the Trek films. Production values look high with pretty much everything in the film, all sets look quite swish with depth and a solid appearance. Picard and his crew look as boring as ever in their grey uniforms but as I said before both the Romulans and Reman outfits all look superbly crafted and border more on Star Wars quality.\r Space sequences look delicious as they tend to in these films but this time the starships look much better than before. Its mainly CGI as usual but clearly much sharper and with some good looking weight to them, still not quite up to Mr Lucas' spaceships but getting close, the cloaking effect still looks a bit dodgy. Must mention the rather sweet looking cityscape on Romulus at the start of the film, very much on form with another certain popular sci-fi fantasy, dare I say quite Naboo-ish. A big kudos to the death sequence of the Romulan Imperial Senate also at the start. The infection and fast decay shown is some of the best CGI mixed with real time model work I've seen. These effects really put the film in good stead showcasing a newer sexier Trek offering.\r I guess you could say this one film is merely an action film in Star Trek clothes and not exactly what Star Trek is all about. Where has all the exploration gone? the seeking out of new worlds and new civilisations etc...There is definitely more bias towards fighting, death, multiple laser blasting and even the obligatory action film 'car chase' sequence. But its hard to win with Star Trek, either its too flashy and gun-ho, not Trekkie enough for the core fans. Or its too dull and slow for everyone like some of the older Trek films or its too in depth for non core fans and more of a Trekkie treat fan film.\r Its not very original and is pretty much a cookie cutter production but what do you expect with Star Trek. Plenty of decent action in space and a bit on land with a moon buggy chase, some of the best effects so far (about time), great visual designs throughout with the usual high caliber imagination but maybe it loses the true Star Trek essence along the way?\r Entirely predictable to the last minute but ultimately very enjoyable like most of the good Trek adventures. Another good franchise bookend, this time for the next generation crew. It hasn't been as memorable as the classic crew films in my opinion but a valiant effort none the less."
    },
    {
      "rating": "5",
      "text": "This film is the tenth of the franchise and marks the farewell of Patrick Stewart, and the end of a stage of this long franchise, which has never managed to match the quality and popularity of the series that gave rise to it. This film, like its predecessor, never surpasses the middleweight, with an uninteresting and forgettable script, something tiresome special effects and CGI and actors that do no more than comply with the minimum that is demanded to them. Stewart is the most outstanding actor, but he is not particularly brilliant in his participation, as also Brent Spiner. Perhaps its not the fault of these actors but the absolutely basic script and the undemanding direction of Stuart Baird. Anyway, this phase of the film franchise \"Star Trek\" ended without glory, but also without great shame."
    },
    {
      "rating": "3",
      "text": "Another dark Star Trek movie - literally. Seems like the director is trying to use lighting (again *sigh*) to make the bad guys bad. This movie is visually unappealing. It's unnecessarily dark. The big bad is a cliche and lame. With so much to work with this was the best they could do? skip this one."
    },
    {
      "rating": "7",
      "text": "Little Disappointing,its a Decent Movie!The story was good the whole plot of Clone and politics it was awesome but the way its showcased its not that impact-full,the music was great so does the visuals,the all action scenes were fast-paced quick-cut and stretched but amazing,the acting was great tom hardy was amazing as clone of Picard and all others are amazing too!The starting intro to Romulus and there politics the blast it was awesome,on other side the captain's speech as last day cut with the best man's speech at Deana's and Will's wedding it was awesome,then the mission in near Planet the Data's lookalike brother B-4's discovery and rescue and the planet's action was good although after that it was way too Annoying for Crew as professionals transferring all memory of data to B-4 it felt over the top,then the order for talk from federation to the ship of cloned Picard and his entry and conversation was awesome,the whole Deanna's and Cloned Picard's Attraction thing was little odd and the whole telepathy sleeping thing was over the top!The main plot for picard's clone and his quest of having Picard's DNA felt side-lined,until 1st half the whole movie was surprisingly entertaining from the 2nd half every thing wasn't that engaging,the Picard's Clone and his political friends sided with Picard and the whole Data's trick in Mission it was predictable and then the whole stretched Fight in space and Continuous teleportation of people's it was like its just happening then the ending 30-mins it was little good the Picard's play and fight at last with his own clone it was chills and the data's sacrificing end it was heart-breaking although it was too quick and somethings were literally trash like the whole telepathy thing of Deanna for ship's info and the Will's fight with Reman's guy it was lazy,after all that the whole 20 mins were amazing the remembering data and good-bye's with amazing B-4's Memory thing it was a Emotionally satisfying end!Overall its a Decent movie as 1st half was entertaining and surprising with the emotional ending although as a last send-off to TNG it wasn't that great but good,its a One time Watch!"
    },
    {
      "rating": "0",
      "text": "a MASSIVE miss use of the term that i don't want to say, but i will say the word but the letters will be switched around, erap."
    },
    {
      "rating": "4",
      "text": "So this is it if you want to witness the ultimate space combat. You're a long way from seeing a Star Trek: The Next Generation goodbye film that is similar to The Undiscovered Country. That's what this movie was marketed as, but what it actually is is unfaithful to Roddenberry's creative vision and a tremendous disappointment for all fans. Baird's comments makes clear that he had no idea how to direct a ST movie. The story of this movie is extremely silly, and the visual is dark and grainy. The score itself is dismal. As Picard's clone, Tom Hardy fails, and Ron Perlman overacts as Viceroy Reman. This movie felt like an hour-long space fight."
    }
  ],
  "recommendations": [
    "star_trek_beyond",
    "star_trek_insurrection",
    "star_trek",
    "star_trek_into_darkness",
    "star_trek_v_the_final_frontier",
    "terminator_3_rise_of_the_machines",
    "star_trek_first_contact",
    "solo_a_star_wars_story",
    "star_trek_the_motion_picture",
    "rogue_one_a_star_wars_story",
    "x_men_apocalypse",
    "star_wars_episode_ii_attack_of_the_clones",
    "fantastic_four_rise_of_the_silver_surfer",
    "the_matrix_revolutions",
    "riddick",
    "terminator_genisys",
    "terminator_salvation",
    "battle_los_angeles",
    "edge_of_tomorrow",
    "pirates_of_the_caribbean_on_stranger_tides",
    "superman_ii",
    "predators",
    "infinite",
    "star_wars_episode_i_the_phantom_menace",
    "surrogates"
  ]
}