{"id": 3528, "title": "Star Wars: Episode III - Revenge of the Sith", "starring": ["Hayden Christensen", "Ewan McGregor"], "runtime": 140, "genre": ["Adventure", "Action", "Science Fiction"], "description": "The evil Darth Sidious enacts his final plan for unlimited power -- and the heroic Jedi Anakin Skywalker must choose a side.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/xfSAoBEm9MNBjmlNcDYLvLSMlnq.jpg", "categories": {"plot": 9.12, "acting": 8.909090909090908, "ending": 9.4, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 8.0, "action": 10.0}, "reviews": [{"rating": "8", "text": "Finally Lucas manages to create the final epic conclusion to his SF saga with a dark morale and splendid acting from Mcgregor with high tech CGI."}, {"rating": "9", "text": "this movie was the best out of the new trilogy, but i think the only major flaw was how padme dies after giving birth and in episode 6 leia says she remembers her mom as a sad but beautiful woman. WTF is that?? great job george lucas, its your own story and you add obvious holes in it. other than that i think it was cool how it ties in to episodes 4-6."}, {"rating": "10", "text": "The movie's great, the casting is great, it's all great."}, {"rating": "8", "text": "Best one ever...what i've been waiting to find out for years now how he went to the darkside, brilliant, superb, electryfying."}, {"rating": "10", "text": "Ok, this movie was one of the greatest movies I've seen. Now i understand that episodes I and II weren't up to snuff, to put it softly, but, to say that the second trilogy had little or no plot or character development, is to discredit yourself of all intelligence. Anakin begins in epsiode one as a boy, wanting to do good. As he gets older, he becomes disillusioned with how the jedi council is treating him; he thinks he deserves more, and instead of keeping him from turing, they only make it worse. There is no need for breaking ANakin, because he is already broken. He wants his love to survive, but he knows she might not. Since he trusts Palpatine, he belives in his words, that there may be a way to save her. He's not bad, his misguided, and to say that is not true plot or character development, is just crazy!"}, {"rating": "10", "text": "This is the best film of the year and the best Star Wars film yet, even surpassing The Empire Strikes Back."}, {"rating": "10", "text": "Insanly good movie. Good acting and graphics all around. Should buy it even if you're not a star wars fan."}, {"rating": "10", "text": "Pure brilliance. Leaves you in awe."}, {"rating": "8", "text": "I have seen all the Star Wars pictures(hey, I'm from North America, folks) even though I'm not particularly a Star Wars buff. Of all the Star Wars pictures, this is the only one with any serious emotional resonance for me. In the all the early Star Wars pictures, George Lucas was trying to recapture the old Flash Gordon serials in high tech terms with an overlay of New Age mysticism. Sometimes it worked, sometimes it didn't. This is the only movie, to be blunt, where I think George Lucas is doing some serious thinking. He's contemplating why someone might turn to (if one might use an old-fashioned term here) evil. This gives the whole thing a gravitas that the rest of the series simply doesn't have. While I suppose this film gives the viewer (to use a degraded bit of modern-day post-modern jargon) closure in respect to the character of Darth Vader, and the film ties up various plot and thematic odds and ends, it cuts much deeper. George, who has clearly read Oscar Wilde's \"The Picture of Dorian Gray\", depicts how Anakin Skywalker's outer deformity grows out of his inner deformity. And George's perceptions here are on a higher level than the rest of the films. He appreciates that Evil (if, again, I may use the term) is often a strange combination of bad intentions and good intentions. That is a very 21st century perception, miles away from the original \"Star Wars.\" And, surprisingly, there is even some wit here. At one point, a character arrives at a planet, proclaiming,'I have come in regards to the War.\" The alien replies,\"There is no War here. Perhaps you brought one with you?\" Ho, ho! Leave aside the whole question of highbrow and lowbrow. This is a great shaft of wit, period. If George had only written this one line, he'd deserve to live forever. This is, figuratively and literally, the darkest Star Wars picture and quite rightly so. The sadness and the sense of dark inevitability are oddly haunting in their way here. It is said that Japanese popular culture is obsessed with the Star Wars mythos. This is the film, in my opinion, that justifies the fascinationg. If I had to have only one Star Wars picture, this would be it. Greg Cameron, Surrey, B.C., Canada."}, {"rating": "8", "text": "This is the best movie in the prequel of the original trilogy \"Star Wars\". Anakin Skywalker is now officialy called Darth Vader and the best is yet to come!"}, {"rating": "10", "text": "this movie is the best. i have the high ground. other people underestimate my power though."}, {"rating": "10", "text": "By far the best Star Wars movie! The story line is amazing and is a must watch for anyone who has not seen yet. Hayden and Ewan did a beautiful job"}, {"rating": "10", "text": "Very Vivid Special Effects and Sounds is Great! Congrats!"}, {"rating": "7", "text": "Eh, i've seen better. it was very entertaining but and the acting from hayden christansen was terrible, he should be nominated for a razzie, but the other actors did a fine job,christansen was the wrong guy to play anakin... i think this was better then the second one, but not as good as the phantom menace, and none of the prequals will ever match up with the originals."}, {"rating": "7", "text": "Without a doubt the best in new trilogy (which isn't saying much) and probably better than Return of the Jedi (despite the duel between Luke and Darth being sweet, the ewoks are dreadful). The Dialogue is still terrible but finally some decent acting, the effects look better, and the story is obviously better."}, {"rating": "10", "text": "How could anybody think that was a bad movie?"}, {"rating": "7", "text": "Has the same issues as the other prequels: bad dialogue, bad acting, bad story. It has a few memorable moments and a satisfying ending, but it still doesn't come close to the original trilogy."}, {"rating": "10", "text": "Of the new Trilogy AND the movie to tie all 6 together, great job Lucas, thanks for waiting for the technology on these three, too bad people forget they are a Family Fantasy Series based around the classic Good vs. Evil concept. I'm not sure what these morons were expecting, but thanks for giving ME more incredible Star Wars content."}, {"rating": "10", "text": "Definately the best movie of the year."}, {"rating": "10", "text": "Pros: The fight on mustafar, Great dialog, Amazing lightsaber combat, \"Hello there\" Cons: it ended"}, {"rating": "10", "text": "Great fight scenes with amazing choreographing , Emotional moments and easily the peak of the prequel trilogy and maybe even the entire franchise."}, {"rating": "10", "text": "Seriously, I don't understand all those bad ratings. This film is like the incarnation of the word \"epic\". The final fight scene is among the best ever created, filled with epic dialogues, awesome music composed by Mr. Williams and a fight with speed, power and energy. That's how a fight is supposed to be. And yet the film has more to offer than just action. It has a very dark atmosphere and a quite deep story for an action movie. Palpatine's corruption is well written and you even can see the movie as a metaphor to our real life in a few ways. This movie is just one of the best movies ever made, and it's even better than the original Star Wars a new hope. Why? Because it grew up, it's not just about good vs. uberevil, but it's a story of the chosen one, Anakin, who falls to the dark side because of love, and you can see what people are willing to do because of love. Tragic story and awesome movie, hands down."}, {"rating": "10", "text": "Episode III is by far the greatest film in the new trilogy, and it stands against the original 3 in epic awesomeness. An incredible conclusion to the greatest saga ever told."}, {"rating": "10", "text": "Best Movie, I have got to say that this has got to be my favorite, it contains humor, action, love, suspense, and so much more. Awesome prequel to the series, a must watch for anyone."}, {"rating": "10", "text": "[Portuguese] É o melhor filme de Star Wars , na minha opinião, pois mostra a \"aparição\" de Darth Vader, e mostra bastante sobre o lado Sith da série."}, {"rating": "9", "text": "One of the best movies in the entire franchise and succeeds where the Sequel trilogy is currently failing: delivering a good story and evoking emotions while expanding the universe."}, {"rating": "9", "text": "Ignore all the bad things you hear about this movie. Any negative reviews are mostly star wars fan boys (or more likely 30-40 year old men) who are too nostalgic about the original trilogy from their childhood, and are still bitter about how awful the phantom menace was. This is a fantastic movie, arguably the best in the franchise (at least on par with Return of the Jedi) and you should not let it's reputation put you off."}, {"rating": "10", "text": "revenge of the sith is my favorite star wars movie of all time. people give it crap but this film deserves an oscar compared to that piece of crap TLJ"}, {"rating": "8", "text": "This movie is my favourite in the prequel trilogy.  It reaches the emotional level the others fail to get near and the added dark 12 Rating element is exactly what was needed.  Every base is covered to lead into Episode 4 and this is sure to give satisfaction to Star Wars fanatics."}, {"rating": "10", "text": "Lucas logra con el Episodio III mejorar grandemente el desastre cometido en The Phantom Menace. Tiene esa escencia de las anteriores y es satisfactoria. La verdad es que es digna la mejoria que ha hecho, pero ni siquiera se puede explicar que le paso por la cabeza cuando escribio The Phantom Menace. Revenge of the Sith tiene grandes momentos de accion, un mejor guion y mejor conclusion que la anterior y es se puede comparar con la trilogia anterior."}, {"rating": "10", "text": "The best and final chapter of the prequel trilogy. A sequel that is darker than Return of the Jedi. The acting is good, action is great, the cg, the story, and the direction."}, {"rating": "9", "text": "My third favorite Star Wars film after V and IV, this movie is a huge improvement over I and II. The story is intriguing, emotionally resonant and linked with the original trilogy, the dialogue is much better, Hayden's bland and emotionless acting works as he turns in Vader and for once you feel involved and that the stakes are high. The SFX are also improved and still look decent today. A surprisingly more than satisfying ending for the prequels trilogy."}, {"rating": "10", "text": "Utapau is rocky and barren, like Tatooine and Geonosis, but the sinkholes make it distinguishable from the other planets that are of arid climate. Mustafar is one of the most unique planets in the saga, being a volcanic hotbed of fire, not only setting the stage of the final battle, but representing the psychological state of one of the main characters. The opening sequence is amazing; I felt like I was being whisked through a massive space battle-this was an amazing feeling. The additional CGI action sequences also look very good. Complimenting these battles are 5 lightsaber duels-the most in an individual Star Wars episode. Each features its own intriguing and interesting aspects, but, of course, the most iconic is the duel between Obi-Wan Kenobi and Anakin Skywalker/Darth Vader on Mustafar. The duel's combatants are both lightning fast-in fact, the duelists are the fastest in lightsaber use than any other duel in the saga-not only that, but the duel takes place in the most hazardous environment, which increases the tension. The emotional impact of the duel cannot be overstated; best friends/brothers fighting each other is undeniably a tragedy. Speaking of which, Anakin is the tragic/fallen hero in the film, while Palpatine is a devious mastermind who acts as a twisted father figure to Anakin. Obi-Wan, meanwhile, completes his transition from a High Jedi General-a commander in the Grand Army of the Republic, and a Jedi Master-to a hermit on Tatooine. Finally, the children of Anakin and Padmé are born, symbolizing the birth of hope. George Lucas' writing is still very good; the scene where Palpatine declares himself Galactic Emperor is one of the most chilling moments ever in a non-horror movie. The interactions between characters are well-done, and the dialogue makes sense, in those scenes. Episode III is the most tragic film of the saga-that is undeniable. The feeling of impending doom during the first half of the film is nearly palpable. When the second half begins, so does all the tragedy. I really felt for the 3 main characters as their worlds came undone around them, especially Anakin-during the entire prequel trilogy, he endures so much hardship and loss; he, in my opinion, is one of the most tragic protagonists in film history. Star Wars: Episode III: Revenge of the Sith is an immensely satisfying conclusion to the prequel trilogy-the first half of the Star Wars saga-and perfectly sets up the original trilogy. What more could a Star Wars fan ask for?"}, {"rating": "10", "text": "this is my favorite star wars movie because it shows how a anakin becomes darth vader. also great special effects and 5 different light saber battles. Epic!"}, {"rating": "7", "text": "An improvement. I think that people liked this movie WAAAAYYYY better than 1 and 2 because everyone was expecting crap. And I don't think we got crap."}, {"rating": "6", "text": "Episode 3 engages with an emotionally powerful story but can't escape the prequel curse of embarrassingly stiff performances and an over-reliance on CGI. It's a solid conclusion to this trilogy and also one of the franchise's biggest missed opportunities."}, {"rating": "10", "text": "In short, this movie is phenomenal. This movie has some cringey dialogue, but very little compared to the AotC. The romance scenes are a lot better and don’t feel forced. The plot is consistent, face paced, and entertaining. Unlike in Attack of the Clones, I never felt bored watching this movie. It’s full of action, suspense, and emotions.Watching how the Republic fell and Anakin’s turn to the dark side were amazing and finally gave context to the OT. Ian McDiarmid is amazing as Palpatine, especially in scenes like Order 66 and the Tragedy of Darth Plagueis the Wise. Hayden Christensen got a lot better and portrays Anakin excellently as a young adult confused with emotions he has been forced to hold back until they finally erupt inside of him and fuel his turn to darkness. Ewan McGregor and Natalie Portman are gems as usual. The scene between Obi Wan and Anakin on Mustafar has to be one of the greatest scenes in movie history. “I HATE YOU!!!!!”“You were my brother Anakin... I loved you...”Both actors did that scene perfectly. The emotions were passionate and real. Seriously, if you are a Star Wars fan and haven’t seen this movie, go see it. It saved the prequels after the disaster that was AotC. This movie is up there with Empire. 10/10 for me. There are some flaws, but the highs of this movie are so damn good that I have 0 regrets watching."}, {"rating": "10", "text": "Episode III is the best of the Star Wars prequel trilogy, which reveals the story behind Anakin Skywalker's transformation into Darth Vader and a couple other surprises."}, {"rating": "10", "text": "By far one of my all time favorite movies, and the movie that sealed my fate as a die hard star wars fan and introduced me to the treasured original trilogy. Excellent film!"}, {"rating": "10", "text": "Sorry, Episode III.  I liked you.  You were several orders more interesting than Episode VII.  You didn't deserve the hate. Here, you get some stars to balance out all the haters."}, {"rating": "10", "text": "I come away from \"The Last Jedi\" feeling much the same way I felt about \"The Force Awakens,\" but a little more. These movies aren't for me, anymore. The spectacle is great, the special effects are great, the performances are mostly great, but the written material doesn't work for me. The humour, the use of characters, even basic narrative structure. Every single creative decision, big and small, felt wrong, to me. Every part of this film is the opposite of what I find dramatically satisfying. It left me feeling somehow empty. Without hope for the future."}, {"rating": "8", "text": "Albeit flawed, Revenge of the Sith brings Star Wars to a satisfying close, is able to rectify George Lucas into a good film maker and draw many lost fans back into the universe. Don't expect another Empire, but also don't get into the mindset of it being as bad as the previous. All things considered, Revenge of the Sith is well filmed, well thought out and with a fantastic performance by Ewan McGregor and a substantially improved performance from Hayden Christensen, Revenge is a pretty great film and worthy conclusion."}, {"rating": "10", "text": "The very best Episode from the prequels with a lot of  revelations and stunning moments.\rAn epic conclusion with splendid acting performances of Ewan Mcgregor and Hayden Christensen."}, {"rating": "10", "text": "This movie will be a classic in ten years. However, I didn't like jar jar binks at padme's funeral. But other than that, perfect movie made by George Lucas."}, {"rating": "10", "text": "Amazing the best of the prequels ...the darkness that was not seen in attack of the clones showers through in revenge of the sith and the movie gave me more than i was expecting to get plus they killed the worst character to me count dooku who is played by the great christopher lee who i loved in lord of the rings but hated in attack of the clones so his death was a great thing to me..plus brutle made it better for me....the clone war scenes are just what fans had been waiting for since the 70's when it was briefly talked about."}, {"rating": "7", "text": "I watched all Star Wars movies. I like SF movie.  I like Yoda. Yoda is  very strong. I want to be  a  je dai.\rThis movie is great and strong. æ"}, {"rating": "8", "text": "Revenge of the Sith is a great conclusion to the series, but also works as an independent movie. Lucas is a genius here, and it shows. A thing of admiration it is."}, {"rating": "8", "text": "Revenge of the sith took the inevitable story and made it heart wrenchingly sad. By far not a flawless film, but not an insult to the standard of the original trilogy. Although reliant on special effects, the characters emotional journeys and the performance of the actors really bring the tragedy of Anakin Skywalker to life. A film that does justice to just how sad it ought to be. 8/10"}, {"rating": "9", "text": "The most mature Star Wars film along with Episode 2....enough said. World Class acting by Ian McDiarmid in one of the most 'beautiful' bad roles ever portrayed on a fantasy film. Hayden Christiansen and Evan McGregor deliver some fantastic moments. The meeting of Anakin and Palpatine in the Theater is masterfully directed and perhaps one of the greatest scenes of the entire Star Wars saga. Dialogues are priceless throughout the movie. To summarize it, AAA+ acting and a fantastic conclusion to the prequel trilogy. Certainly very dark and not suited for younger audiences. The old trilogy doesnt even come close to this one in terms of direction, dialogues and actors...."}, {"rating": "7", "text": "Just as we were giving up hope of ever seeing another decent Star Wars film, Revenge of the Sith comes along. And it finally satisfies us. It's not as good as 4,5 and even 6 but it comes close. Grevious is really epic and ALMOST comes close to being as cool as Darth Vader. The Palpatine-v-Yoda battle was EPIC. It really makes you anticipate The Force Awakens without worry. Still, there could have been a Han Solo character. And here's my biggest complaint-if R2D2 had all those guns and gadgets built into him all along, why on earth couldn't he use them in the originals? That was rather forced"}], "recommendations": ["rogue_one_a_star_wars_story", "star_wars_episode_ii_attack_of_the_clones", "war_for_the_planet_of_the_apes", "solo_a_star_wars_story", "terminator_2_judgment_day", "captain_america_the_winter_soldier", "superman_returns", "star_wars_episode_i_the_phantom_menace", "star_trek_nemesis", "the_matrix_revolutions", "black_widow", "x_men_days_of_future_past", "captain_america_the_first_avenger", "avengers_endgame", "gladiator", "troy", "rise_of_the_planet_of_the_apes", "man_of_steel", "captain_america_civil_war", "the_lord_of_the_rings_the_return_of_the_king", "the_lord_of_the_rings_the_two_towers", "terminator_3_rise_of_the_machines", "the_dark_knight", "creed", "the_dark_knight_rises"]}