{
  "id": 2825,
  "title": "Starship Troopers",
  "starring": [
    "Casper Van Dien",
    "Dina Meyer"
  ],
  "runtime": 129,
  "genre": [
    "Adventure",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Set in the future, the story follows a young soldier named Johnny Rico and his exploits in the Mobile Infantry. Rico's military career progresses from recruit to non-commissioned officer and finally to officer against the backdrop of an interstellar war between mankind and an arachnoid species known as \"the Bugs\".",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cxCmv23O7p3hyHwqoktHYkZcGsY.jpg",
  "categories": {
    "plot": 6.6923076923076925,
    "acting": 6.269230769230769,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 8.421052631578947
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A moderately entertaining but incredibly stupid action flick that doesn't even come close to the book. Grab some popcorn and turn off your brain and it'll be pretty decent, but don't expect anything incredible."
    },
    {
      "rating": "10",
      "text": "Starship Troopers is one of the most misunderstood﻿ movies of all time. Its cheesy acting, its extreme violence, its incredible visuals. It does these things so well that people misunderstand it. It pretends to be an action movie while it's much more than that. What's so incredible about the movie is that it suggests that Americans and Nazi's with their propaganda are just the same when it they are at war. They were/are both full of irrational hatred(''First comes sorrow, then anger'') when they are at war. This movie has a message, it's an anti-war movie. ''People seem to have this strange idea that films can influence people to be violent, but in my sincere opinion film only reflects the violence of society.'' a quote from the director himself.  He did the same with Robocop, but in this movie it's harder to notice.\r I find it very hard to explain it's message so if you think this movie is just a dumb action movie watch the film-commentary of the movie. It explains it all."
    },
    {
      "rating": "5",
      "text": "One thing that immediately struck me about the film was the absolute gender equality that seemed to be present in this society. Such an aspect starts out as being novel and inspiring, until you realize it's just an excuse for the filmmakers to put hot women in scenes which would otherwise be all-male. In addition, the themes of war and violent conflict are addressed, as well as the morality of the destruction of life that may be sentient and intelligent. But these thought-provoking concepts are quickly thrown away for more entertaining things like dramatic visuals and gore. It is an entertaining picture, I'll give it that. The \"brain bug\" that is apparently intelligent looks like it has a vagina on its face. Yet, there are so many ridiculous things... the prominent one being the strange ability for overgrown bugs to attack other planets, yet without any kind of tool use other than \"throwing a meteor\". Additionally, I was constantly wondering why these troopers went around blasting fruitlessly at this unaffected bug-monsters with rifles, when they could just drop a huge bomb and be done with it! Oh, right, classic weapons make better cinema. I mean, despite the faults, one should watch it for free on hulu.com, while it's up. Otherwise... you could skip it."
    },
    {
      "rating": "10",
      "text": "Perfect movie ,original and violent ,with dark humor.Very fun to see, a little more than 2 hours of movie its like 10 minutes ,very entertaining experience !!!"
    },
    {
      "rating": "10",
      "text": "Best movie of all times. This movie is the reason why I love sci-fi stuff.Very sad, it didn't get the sequel it deserves. Apparently, critics weren't happy, figures... critics hate the good movies and praise utter garbage"
    },
    {
      "rating": "10",
      "text": "The year in the movie is 2197. The film won Saturn Awards for Best Costumes and Best Visual Effects at the 1998 Academy of Science Fiction, fantasy and horror films, USA Awards."
    },
    {
      "rating": "10",
      "text": "A thought-provoking, entertaining sci-fi action film based on Robert A. Heinlein's Hugo award winning classic sci fi military novel..that is not for the squeamish, the humorless or the knee jerk, politically correct."
    },
    {
      "rating": "8",
      "text": "Starship Troopers was one of Robert A Heinlein's most widely known novels and was one of his best-selling books. It won the Hugo Award for Best Novel in 1960.  The movie is loosely based on the novel.I'm completely embarrassed to rate this movie as high as an 8.  And, I hate to admit it... I want to rate it 9.Every film student should watch this movie and try to understand why people love it and critics hate it.Obviously this movie is satirical.  Any attempt to take it seriously would be absolutely ridiculous.  The bombastic and over-the-top fascist tropes along with overt sexuality and nudity are hard for a lot of individuals to cope with."
    },
    {
      "rating": "9",
      "text": "Awe man where to start with this one. The film is ultimate cheesy goodness. The plot, dialogue, and a few of the action scenes are goofy as hell and make it hard to take the movie seriously at times but then you get awesome alien killing action and the overall tone of the film feeling like a parody of modern war films. All of the war propaganda and the whole reasoning for the war seemed to share a lot of similarities despite the fact that these are alien bugs we are fighting. I suppose the message would be that war is war no matter who the enemy. Back to the cheesyness tho since this seems to be where the movie really gets it personallity. Spoiler time! Dizzies character constantly made me laugh. The way shes always trying to hard to get her man and making obviously jealous faces and denise richards. This was, well, cheesey and then when she passes you feel bad for her character but cant help but laugh at her passing words. Another part that had me constantly shaking my head was how each character \"coincidentaly\" continue to run into each other no matter where they go, its incredibly unbelievable but its easy to get over because in a money like this, it kind of fits. One other notworthy part would be the stupid football play they do where buddy does the funny looking flip over his oponents and then they decide to use it in combat, you all  know what part im talking about, its comedy. Now going hand in hand with the cheesyness is the awesomeness, and by this i mean the battle scenes against the aliens. These scenes are incredibly gory to a point that its almost suprising and unexpected. I loved every inute of it.\rStarship troopers is a badass sci fi, alien war movie that has to be seen to believe. Check it out."
    },
    {
      "rating": "10",
      "text": "It has a unique story and is worth a watch. It is light-hearted and involves some big topics at the same time."
    },
    {
      "rating": "10",
      "text": "An awesome science fiction book converted to film, and outdoes the original work to become a 90s classic film. The special effects still look great today."
    },
    {
      "rating": "10",
      "text": "They don't make movies like this anymore. Genius in my opinion, the way the universe is characterised by the movies creators, portrayed by the perfect cast and seamless screenplay. I recommend the book as well, as both movie and novel are brilliant in their own right."
    },
    {
      "rating": "10",
      "text": "Best movie ever made, citizen kane eat your heart out this is better 10/10."
    },
    {
      "rating": "10",
      "text": "♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡"
    },
    {
      "rating": "10",
      "text": "One of my favourite movies of all time. Some people went in to see some political revival of the novel series, but the director took a more light and satirical look at the premise. The technology simply wasn't there at the time to do bugs, power armour and realistic other races etc. There was no point in having any of that being done half-assed. They went with the Core, the bugs, then built a story around that.\r I can watch this movie over and over, and only 4 other movies have that same award, True Lies being one of those.\r This movie was nothing like the book, and it wasn't supposed to be. I liked the book a lot, and I liked this movie a lot. They were different entities, anyone not getting that missed the point.\r Sure, if they do a revival they can expand on some of it, but to capture the book they will need to make a trilogy or more films, and that is doubtful, as it isn't a recent Teen-bought novel series."
    },
    {
      "rating": "8",
      "text": "This movie has not aged well. Blu Ray and DVD ports look terrible. Clearly no one in production took the possibility that one day Hi-Def would become the norm. Honestly, the movie's CG effects look on par with something from the 80s.\r Enough with my b**ching. I still love this movie. I remember watching this in the cinema on opening night. It was AWESOME! Clearly not meant to be taken seriously and felt very much like a camp version of Aliens. At the time this movie felt different and its almost goofy approach was different and made this movie stand out amongst the sea of Sci-Fi movies that saturated the late 90s.\r I will grade this movie based on what I think of it now and when I first saw it. DVD/Blu Ray quality do not factor.\r Overall:\rStarship Troopers is a silly stupid high budget Sci-Fi movie that knows what it is and plays that angle to the extreme. While I do get why there are those who do not like it. I loved it and this movie will always hold a special place in my Sci-Fi heart.\r Side Note:\rCan some one PLEASE make a better Hi-def adaptation of this! The current versions are truly awful."
    },
    {
      "rating": "8",
      "text": "Heinlein's \"Starship Troopers\", along with his \"Double Star\", \"Between Planets\" and \"Orphans of the Sky\", was one of the first books that began my acquaintance with the Science fiction genre. Then, at the first reading in adolescence, \"Starship Troopers\", as I now realize, had an opposite influence on me to that conceived by the author, although it caused an intense inner dialogue. Perhaps it is due to its peculiar \"extremist\" philosophy, conjugated with an idealized description of an army life and the nuances of the officers' service, I've remembered this book among hundreds and thousands of others which I've read at the same period. Although at the time it was seen by me more like an action adventure, and not as political manifesto of the author. Over time, of course, the book is perceived quite differently, and I fully agree with and support the decision of the publisher, who refused to publish the \"Troopers\" for young audience, because instead of novel of professional science fiction writer, young readers would've received novel of an unprofessional philosopher. Although, I must stress this again, at my teen age book had the opposite effect on me than what was intended by the author.\r The irony is that the same story has happened with the adaptation of \"Troopers\" by Verhoeven - what the director intended as a vicious satire on militarism in general and in particular on Heinlein's book, which was almost forgotten, served as the book's advertising. Despite the different tones, narrative styles and incorporated ideas, in an artistic sense I would call the book and the movie to be equal. If the book is more sincere and deep, actual science fiction and social modelling, the film is more social satire, caricature and propaganda poster on the verge of trash. It is difficult to say which is better or worse, because they are completely different art expressions. And although to me either Heinlein's idealistic military meritocracy and Verhoeven's leftist pacifism are equally unsympathetic, I can not help but admit that aesthetically I like both the novel and the film - each in its own way. That, of course, does not negate the madness of the inflated to absurd ideas underlying both works. Actually, I would advise to watch a movie to those who are able to separate the ideological background from the artistic value of these works. After all, the movie has a fascinating story, there are intense action, beautiful actors, love melodrama, as well as an original, colorful cartoon aesthetic and political satire."
    },
    {
      "rating": "10",
      "text": "The director of this masterpiece clearly delved into the Warhammer 40k for inspiration. Truly a shame the sequels do not live up to this quality. Many people who are unsure or dislike the movie are looking for far more in it than what it is. Sit back and enjoy a grim dark future where the only rule is \"humanity above the xenos\"!"
    },
    {
      "rating": "10",
      "text": "It may not be the most original, epic or awe-inspiring movie ever, but it's FUN. You remember that? FUN? The thing we used to have before every movie is now rejected if it isn't a Jane Austen drama?"
    },
    {
      "rating": "7",
      "text": "Works much better as a satire then an action movie and as a satire it's pretty good. Not exactly 'Dr Strangelove' or 'Brazil' but still works in it's own way! The major problem I have with this film is they're the least convincing high school students ever to be put into film. Also Satire is supposed to be at least a bit light hearted while this takes itself more seriously then 'The Postman'"
    },
    {
      "rating": "10",
      "text": "Starship Troopers is one of the last true satire films ever made. Posing as a mere dumb action movie about killing space bugs, the movie serves as a poignant and hard hitting criticism of the **** of warfare by American society. Everything about this film is extraordinarily \"meta\", and your opinion of the film upon its completion really demonstrates your psychology with respect to fascist imagery and propaganda. I highly recommend it!"
    },
    {
      "rating": "9",
      "text": "Very humoristic movie and entertaining, it's a pity that the sequels didn't get to the same level. First thought this as a B-class movie, and that it was, in the best possible way."
    },
    {
      "rating": "8",
      "text": "This movie is a guilty pleasure, but is nonetheless one of my favorite sci-fi movies. Starship Troopers embraces its over-the-top characters and cheesy sci-fi action to make a fun movie which still presents some truly interesting ideas. Unlike the novel on which it is based, this film is all about action rather than thoughtful reflection. If you want a deep movie then look elsewhere, but if space soldiers fighting giant bugs sounds like a good time, then this will keep you entertained."
    },
    {
      "rating": "9",
      "text": "cult classic, nuff said. i love how the washington post said its like star wars, the only thing this movie and star wars have in common is there is space ships."
    },
    {
      "rating": "10",
      "text": "An absolutely awesome cult classic, and a great book adaptation. A movie with sky high replay value. Top notch action scenes. Great female representation, one of the first movies to do this right in its time. Brenda Strong plays a memorable character and should be praised for it. Dina Meyer is a treasure, and her character (the best) should not have died in this movie. Verhoeven is a genius at directing. It doesn't get any better than this."
    },
    {
      "rating": "8",
      "text": "It's actually a pretty good film, which tries to portray the negatives of a militarized society in a deadly war, and manages to accomplish the opposite. There is political and social commentary here; there is a terrible \"meat-grinder\" war, in which poor strategy and planning are offset by the courage and sacrifice of the men (and women) on the front-lines. There is some anti-war message which is swallowed by the patriotic fervor that the brutality of the non-human insects inspire.There are also love triangles between virtually all the main characters, which serve to personalize the impersonal face of a war on such scale. I didn't care much for the love stories, but they do provide motivation for the characters, and generally work.While not truthful to the source material, this is a proper sci-fi film, that stands on its own right, and still has value even 21 years after its making."
    },
    {
      "rating": "8",
      "text": "This is incredibly entertaining on multiple levels, very simply. I don't now how else to explain it. It's incredibly fun to watch, although a bit awkward at parts... *ahem* Anyways, I really do like it a lot, in an odd sort of way."
    },
    {
      "rating": "8",
      "text": "It's boring at the beginning,the acting performances are not all on point and some CGI effects are pretty horrible but overall it's a pretty good entertaining movie.Bloody,action packed and well made, Starship Troopers just wants to be a fun movie to watch on a friday night."
    },
    {
      "rating": "7",
      "text": "Great representation of an advanced fascist society, and it doesn't take itself seriously. The characters are a little over the top, but the story is pretty entertaining. A cult classic that's fun to watch with friends."
    },
    {
      "rating": "9",
      "text": "One of the few masterpieces of misinterpreted but entertaining art.One of the few masterpieces of misinterpreted but entertaining art.One of the few masterpieces of misinterpreted but entertaining art.One of the few masterpieces of misinterpreted but entertaining art."
    },
    {
      "rating": "7",
      "text": "A surprisingly engaging watch, verging on guilty pleasure. Doesn't take itself too seriously and touches upon some deeper points regarding war, with plenty of Sci-fi action to enjoy!Pros:- News segments are always funny with their satirical nature- Embraces B movie vibe which makes some questionable 90s acting still engaging and fun- Over-the-top gore special effects add to the wacky nature of the film- I genuinely ended up caring about the characters and their relationships when these developed during training and warCons:- Felt some of the underlying themes regarding war could have been explored a bit more- Main character is least likeable of the lot, so often end up caring more about the supporting cast- Ending leaves a bit to be desired, from reviews it looks like the sequels definitely didn't address this- Plot holes regarding the use of infantry when the humans appear to have very advanced weaponry anyway"
    },
    {
      "rating": "5",
      "text": "It’s a satire not intended to be taken literally it’s just a fun goofy way to escape for a an hour"
    },
    {
      "rating": "8",
      "text": "They rarely make films like these any more. Unpretentious military SF fun, and a light-hearted nod to classic Heinleinian 'masculine space opera'. The fictional non-fiction elements (the little recruitment videos peppered here and there during the film) were a breath of fresh air at the time this came out."
    },
    {
      "rating": "9",
      "text": "Still hands down one of my personal favorites to this day.  No doubt due to the fact that it reminds me of Warhammer 40k.  So many classic line in the movie to just do yourself a favor and watch this movie."
    },
    {
      "rating": "6",
      "text": "Much like Transformers, you can only enjoy this movie if you can settle with solid special effects, boatloads of bullets, severed limbs and explosions, and awful characters and horrendous script. And causal nudity. Nothing more then a guilty pleasure, through and through."
    },
    {
      "rating": "10",
      "text": "They're doing their part. Are you? Join the Mobile Infantry and save the world. Service guarantees citizenship.\r i'm doing my part.\rwould you like to know more????"
    },
    {
      "rating": "8",
      "text": "Starship Troopers is the tongue-in-cheek sci-fi adventure set in a 23rd century, militaristic society in which the United Federation of Earth is at war with the \"Bugs\", an arachnid, hostile species half a century away who humanity scapegoats for launching meteors at Earth. We follow a young soldier Johnny Rico and his friends as they wage war with the Bugs. The movie is fun and its visuals are top-notch. It also does a good job satirizing fascistic attitudes. Directed by Paul Verhoen of Robocop and Total Recall."
    },
    {
      "rating": "7",
      "text": "Tongue and cheek sci fi at its best. Doesn't take itself too seriously and once you don't take the movie too seriously either and enjoy it for what it, is a human kick alien butt sci-fi action movie with major plot holes, unbelievable swings/changes in how the aliens act and characters so wooden you could build a raft with them, 50's B movie stock given a nineties twist....classic."
    },
    {
      "rating": "6",
      "text": "Different at the time.... rather funny and great anti war type of message to it. I saw it on cable first but I have to admit I've watched it a few times since through the years. Worth watching and there is definitely much worse ways to spend time."
    },
    {
      "rating": "2",
      "text": "I absolutely loathe this film. While the visual effects may be impressive, the acting and the script is pure Hollywood hogwash. The main characters are so irritating, with their arrogant and cocky nature and hammy script that I was hoping that a giant insect would appear and gobble them all up instantly.\rThis film has no merit in terms of imagination, acting or story telling, and so I would recommend it only to spotty 15 year old boys who have no intelligence or imagination and think that playing on Call of Duty for 23 hours a day is cool. One of the worst films I've seen."
    },
    {
      "rating": "8",
      "text": "Paul Verhoeven's films are kind of a guilty pleasure of mine. Incredibly juvenile, obnoxious, and loud, Starship Troopers is a ton of fun. However, it is an incredibly smart film that aces its satirical goals. The acting is bad, the nudity is unnecessary, and the gore is excessive, but it is fun and has some great special effects. The satirical element, as I said, is great. It really skewers the military industrial complex of our country and the blind loyalty we have towards the military. Honestly, it is not hard to draw comparisons between the depicted conflict and the ones we currently find ourselves in. Thus, no matter how loud and juvenile it can be, this fantastic satire truly elevates it multiple levels for me. Plus, as I said, Paul Verhoeven's films are a guilty pleasure of mine at this point. The aesthetic and visual style he uses is great to me. As a whole, Starship Troopers is very much imperfect, but more than accomplishes the goals it set for itself."
    },
    {
      "rating": "1",
      "text": "Astonishingly awful film, thanks to the plot and dialogue and acting. I think that's why I dislike it so; since they had the special effects and budget and even the fascist satire angle to make a good film. They just ruined it with the impossibly insipid cutie teen actors and the complete idiocy of their every action. If you completely unplug your brain you might be able to sit through this one for the pretty colors and explosions, but any thought will doom your enjoyment. Why do humans go down on planets that are death traps? Why don't they have insecticide or lasers or virtually anything that would work better than the completely ineffective machine guns? Why don't humans just nuke all the planets? How did the bugs evolve their abilities to shoot things into orbit? How do the bugs live without any food or water on their planets? How do they throw a rock millions of lightyears through space in a few months without space ships or any sort of technology? How can they aim it once they throw it? Why didn't they just throw a rock big enough to extinguish life on earth in the first place? I could go on and on, but you get the idea. Dumbest movie ever."
    },
    {
      "rating": "8",
      "text": "Starship Troopers follows Johnny Rico through his training and eventual deployment in a futuristic interstellar war against an insect like species known as Arachnids.Upon release back in 1997 it received a lot of negative reviews but has since gone on to be a bit of a cult favourite thanks to its biting satire of military propaganda (something a lot of critics either missed or apparently didn’t like!) and over the top comic book style violence. And of course Neil Patrick Harris always helps any movie or TV show."
    },
    {
      "rating": "3",
      "text": "Horrifically cheesy. I'm still trying to decide whether or not this film wants its audience to take it seriously. Even if it doesn't, as a satire it still remains as a big fat nothing of a blockbuster - all attempts at drama die in seconds and tragedy doesn't seem to exist in this ridiculous space age. Of course the themes are 'there' but what of them? The film makes no effort to extend a single message, or point. If it's not supposed to be taken seriously, the film sure fails at making that clear in the first place."
    },
    {
      "rating": "8",
      "text": "Whilst the dialogue isn't perfect and the love triangle is cheesy and hysterical, starship troopers is one of the most hysterical and most action packed sci fi films I've ever watched littered with impressive effects for the time and an eerie presence of threat that you experience along with the characters."
    },
    {
      "rating": "8",
      "text": "This movie is a surprise, because the beginning is awful. Everything so clean, you have 2 actors like Barbie and Ken smiling all the time and you have even more very young actors who dont fit well in my view. The \"football\" match is so ridiculous. And did you notice the many unrealistic scenes with strong women? Ridiculous. The first hour is about 3/10...unbearable. There are some situations, that were interesting, for example the TV commercials.But the 2nd half becomes great: brutal, much darker and finally dirty. In addition you see, what kind of society they show: a militaristic and faschistoid dictatorship with 2 classes, the civilians and citizens. So a 10/10."
    },
    {
      "rating": "7",
      "text": "Surely a not bad sci-fi flick but what lacks was the struggle. The struggle between the characters and the resolution at the end when they together on the attempt to destroy that bugs may be so intriguing and that might be a good watch. Anyway, the period was so important but Hollywood products were crossed across that adolescent age of visual treatments where Cameron's beautiful ones were early on the stage. Downloaded it because it was on the must-watch English movies of IMDb list not much as disappointing but feel a 50:50."
    },
    {
      "rating": "1",
      "text": "I gotta say... I **** hate this goddamn movie. It's sad, cause I remembering being a kid, sitting in a theater and first seeing the trailer for the movie back in the day, and thinking that this was gonna be the greatest movie ever made. Because it looked like everything a 12 year old boy would like. It was a huge galactic war against hordes of giant vicious aliens and there were enormous military starships and marines with big guns and they use nukes and there's blood and guts and heroism. What's not to like, right? It basically looked like a 90s version of James Cameron's Aliens, with all the advantages of modern CGI (This was back in 1997, back before we learned how **** CGI could be). Also, I read the book, and really liked it. So... big big fan and uh, eagerly awaited the release.And then it finally came out and... man, it was NOT a 90s version of James Cameron's Aliens. Not at all. It was this ****ty mess with horrible acting from terrible yet attractive actors and this silly comedic tone and idiotic tactics like parking your starships all together so they're sitting ducks and crashing into one another with the slightest provocation. And uh, Dina Meyers was flat.Probably the most disappointing film I've ever seen."
    },
    {
      "rating": "10",
      "text": "This movie was underrated like hell back in 1997. It was marketed as a action scifi movie, while in reality it was a comedy society critical anti-fascism movie. It's perfect in so many ways. All the weirdness and possible misunderstanding is intentional. One of the most important and best movies in recent history."
    },
    {
      "rating": "8",
      "text": "So bad it's good cult classic with amazing CGI my first ever DVD I still enjoy it."
    }
  ]
}