{
  "id": 4052,
  "title": "Star Trek V: The Final Frontier",
  "starring": [
    "William Shatner",
    "Leonard Nimoy"
  ],
  "runtime": 107,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "The crew of the Federation starship Enterprise is called to Nimbus III, the Planet of Intergalactic Peace. They are to negotiate in a case of kidnapping only to find out that the kidnapper is a relative of Spock. This man is possessed by his life long search for the planet Sha Ka Ree which is supposed to be the source of all life. Together they begin to search for this mysterious planet.",
  "releaseYear": "1989",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uiXr41VLYsuug3CZbFrKLSNahuZ.jpg",
  "categories": {
    "plot": 3.65,
    "acting": 2.9166666666666665,
    "ending": 3.2,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.75,
    "action": 3.6
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I find very little right with this movie. While it is nice to see Kirk & crew in another movie, the premise and overall narrative here is just so stupid. Clearly this movie was trying to find some common ground between science and religion in order to pull in people from both groups. Unfortunately it just ends up angering both.\r Shatner is just a terrible director. Most of the performances were just not up to the usual standard or too over the top to be taken seriously. Effects were OK at times, but generally rather bland and dated for what was available at the time.\r Overall:\rClearly the weakest entry to the movie series. But, at least Nimoy is doing his best, as usual."
    },
    {
      "rating": "4",
      "text": "The worst Star Trek movie by far. It is sad because the story has potential and you see the sparks of great ideas. If you don't believe me think about the following: Could you summarize the story in a way that another person will be excited to watch this movie? For me it is a clear yes and the result for him/her would be a disappointment. That is my point. The execution is flawed or lets say the ideas are underused. When I first watched this movie on TV I fell asleep and later re-watched it a few times. For the good parts: Sybok is an interesting character and his arc / goal is the stuff you can use for a legendary movie experience. The planet Nimbus III and the ambassadors / leaders of the factions have potential for great backstories. General Korrd was one of the most brilliant military leaders and ended here. The scenes where the hidden mistakes / life decisions are revealed were great but could be definitively used better (or more?). Think about it what you learned about McCoy and how it shaped him.   For the bad parts: The characters are not used as good as in the previous movies. The action / battles are underwhelming and the humor is gone except for 2 or 3 moments. The climax is a disappointment. Star Trek used characters in this category far better (Wont spoil and cant even give examples because of it). Overall this is the worst Star Trek movie but far away from the worst movies of all time. At least you could watch it once for comparison."
    },
    {
      "rating": "3",
      "text": "I remember when this was released many people thought it was the old crews final film due to the title. Then once people had seen it most thought that maybe it would be best if it was their final film...zing! But seriously they did.\r This fifth adventure starts off on a good note with some nice sequences. A short intro with the main antagonist on the sandy world of Nimbus III which looks good (sandy desert like worlds always seem to look good in sci-fi films). Then its straight into some good old fashioned soppy Star Trek humour courtesy of Kirk, Spock and Bones as they enjoy their leave in Yosemite National Park. I can't deny that rock face climbing sequence was pretty amusing and virtually the highlight of the entire movie!\r Following that we get a brief intro back on board the Enterprise where everything is in the process of being fixed as its not working too well. Obviously this is the cue for Scotty to huff n puff with frustration at the circumstances yet we all know full well he will fix absolutely everything with time to spare. God bless that light- hearted Star Trek nonsense.\r After this pleasant start which all point towards the beginning of a good fun film things take a bit of a nosedive. Basically there is no real plot here and little explanation for anything. Oh OK, Sybok wants to hijack the Enterprise and use it to find the mythical planet of Sha Ka Ree...yes you read that right and I spelt it right. This planet is at the centre of the galaxy and is supposedly where all creation began...highly doubtful I would imagine seeing as there are millions of galaxies beyond our own. Why don't the crew ever venture outside our Milky Way galaxy and explore another? now that would be exploration alright.\r Renegade Vulcan Sybok isn't really explained at all unless you count Spock's brief flashback where we are given more big news that he and Spock are half brothers. We have no reason for his religious crusade, where he came from or how he ended up on Nimbus III. There is also no explanation for Nimbus III, its inhabitants, its name (the planet of galactic peace?), why there are horses from Earth on it and why exactly everyone is on Sybok's side. Beats the Dinks outta me!\r It also kinda amused me that originally Shatner wanted Sean Connery to play Sybok but for whatever reasons he declined. Thusly we have the mysterious Laurence Luckinbill who just happens to look very much like Sean Connery with a beard. I mean really Shatner...OK you wanted Connery and he said no, you didn't have to use another actor that looked like a poor mans Sean Connery, surely it wasn't that necessary.\r Of course the main issue here is the fact they all run off looking for God at the centre of the galaxy. Personally I really can't think of a more risky idea than this! apart from possibly alienating a huge amount of the audience who will have their own religious views and beliefs that are sure to conflict. The flip side is you know straight away they won't actually find God as how could a sci-fi film proclaim what God would look, sound or behave like. How could the film makers preach or force their own beliefs and ideals of God on a world where there is such religious diversity.\r So right away you know the plots outcome and thusly the film becomes pointless. On top of that the obvious alien creature/power (that isn't God) which they come across is not explained. No idea what it may have been, what it wanted, how it lead them to believe it was the one true God etc...\r Another issue that bewilders me with the Star Trek film franchise is how or why the special effects seem to have gotten worse as the sequels progressed. As discussed in my review the first film really did have an epic feel to it with some beautifully sweeping model shots, but this fifth entry really does look dire. As usual we get more dodgy looking bluescreen shots and yet more hokey looking shaky sets which I have come to accept (sign of the franchise I'm afraid). The actual models are sound and are clearly well made but it just looks as though the act of putting them on film has been rushed. From what I've read it does appear things were done as cheaply as possible and without the best folk available. To be honest you expect a lot more from a huge franchise and its fifth sequel.\r So a very silly choice of plot which could of completely back fired (amazed it didn't), plus it has too many similarities to the first Star Trek film with the V'Ger story. Dull pacing, poor effects, weak characters and the rather creepy and definitely un-sexy fan dance by the aged Uhura was also a bit ewww.\r Not much really happens in this film after the events on Nimbus III in my humble opinion. Its a very mediocre outing throughout with a very predictable anti-climactic finale which almost killed off anymore adventures for the original cast for good. Striving for glory clearly...but alas a supreme failure on all accounts truth be told."
    },
    {
      "rating": "0",
      "text": "This was the last movie I saw with my grandfather before he passed away. So, yeah, this movie doesn’t put in a good mood. Bill **** should never direct a movie again. It’s stupid. I hate it. Enough said."
    },
    {
      "rating": "2",
      "text": "accurately titled on terms of its production..Star Trek : The Final FrontierThe franchise has failed to offer the essence and spirit of the series since, but this one shatters the lower expectations of the franchise and begs the question of its existence. There isn't anything rhythmic let along be poetic in here, just a mere misguided action flick that can't even be called sci-fi for its failed attempt to go mythical back fires very poorly on itself. The script never had enough crisp or meat to make it to the screen in the first place addition to that, the execution by Leonard Nimoy seems to have gone loose rather than getting it all together or improving. The performance is decent but not something outstanding not that it could have saved the feature, for there wasn't much range or space for the actors to factor in. It is short on technical aspects like visual effects, sound department and editing. The only sequence to look forward is the conversation among Spock, Kirk and McCoy. Star Trek : The Final Frontier is accurately titled on terms of its production of the features as it brings into halt on every single aspect of it like characters, plot-line and the spark of creativity that made it's predecessor what it is."
    },
    {
      "rating": "1",
      "text": "This film is the fifth film of the franchise and addresses, in the worst way, a spiritual theme: the search for God. The whole script is based on an unsuccessful space travel in search of the creator of all things. When a script starts from a bad idea it is lost, and this case proves this theory. The story of this movie sucks from beginning to end, and I do not even know how it was possible that such idiocy was actually carried on. The special effects are within what has been done in the previous films, the performance of the actors was not particularly inspiring, but what really put the film to waste was the plot with such absurd ideas. A missed opportunity."
    },
    {
      "rating": "4",
      "text": "Disappointing!The music was good,the acting was amazing and the Comedy was awesome but the Visuals and CGI it was worst than all prequels and the story it has lot of potential but the way it was directed its a Dumb Movie!The main plot of God's meet thing was revealed very late and it played as if its a shock.the whole movie has really awesome moments specially the intro with all characters in there Leave enjoying it was amazing!The whole starting intro of Nimbus planet and the Unknown vulcan with amazing tactics getting Everyone to Mission of finding god with capturing members of republic and using them to take rescue ship it was good.the starting 30 mins of Movie was amazing,the Crew's sudden mission in between Leave the Un-repaired Enterprise and adventure it was awesome,the Klingon's plot was little Unnecessary but the tension of both fight and all it has potential but it was wasted,the Nimbus planet rescue mission by crew the Dancing of Uhura to Divert enemies it was Odd and the rescue fight resulting in Whole other plan and the Twist of Unknown Vulcan is Spock's brother it was awesome but the impact was clearly missing,most of the moments in movie just like this was impact-less as it was fastly done and Cut it was little Odd like the Emotions scene it has powerful meaning but it was showcased Fast-ly without any Proper pay-off,the Klingon vs enterprise battle and Clever escape to God's planet by Kirk was amazing.the last act is literally a Piece of Trash the meeting of god and the star-ship thing it was like \"WTF\" and ended with god's fighting with Crew and Spock's brother sacrifices to save everyone it was outta nowhere S#!T it was literally \"What the Hell\" moments although it ended with Kirk's quote \"God's in our heart\" and closing shots with Klingon's and Everyone at peace WOW what an End!Overall its One time watch for crew and there awesome humour apart from that the story has real potential but the whole direction it was Flawed and its a Dumb Movie although not as bad as Motion picture considering Worst in Franchise!"
    },
    {
      "rating": "8",
      "text": "William Shatner himself and other sources have reportedly said that this movie lacks a plot or at the very least doesn't seem to know where it's heading. While I don't want to contradict Captain Kirk, I've always thought that this movie has a very obvious storyline, and I don't think it's only because I have a theology degree. In keeping with the series' history of exploring philosophical concepts, this film allowed Star Trek to do so, and it does so successfully. The film doesn't advocate for a specific faith and retains the compassion and humour of the earlier films as well as Star Trek in general."
    }
  ],
  "recommendations": [
    "star_trek_insurrection",
    "star_trek_into_darkness",
    "star_trek_beyond",
    "star_trek_nemesis",
    "prometheus",
    "terminator_salvation",
    "sunshine",
    "the_matrix_revolutions",
    "star_trek_first_contact",
    "alien_covenant",
    "the_cloverfield_paradox",
    "star_trek",
    "jurassic_world_dominion",
    "the_tomorrow_war",
    "transformers_the_last_knight",
    "the_matrix_reloaded",
    "captive_state",
    "independence_day_resurgence",
    "stowaway",
    "jurassic_world_fallen_kingdom",
    "war_of_the_worlds",
    "the_core",
    "surrogates",
    "chaos_walking",
    "mortal_engines"
  ]
}