{
  "id": 3266,
  "title": "Star Wars: Episode II - Attack of the Clones",
  "starring": [
    "Hayden Christensen",
    "Ewan McGregor"
  ],
  "runtime": 142,
  "genre": [
    "Adventure",
    "Action",
    "Science Fiction"
  ],
  "description": "Following an assassination attempt on Senator Padmé Amidala, Jedi Knights Anakin Skywalker and Obi-Wan Kenobi investigate a mysterious plot that could change the galaxy forever.",
  "releaseYear": "2002",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oZNPzxqM2s5DyVWab09NTQScDQt.jpg",
  "categories": {
    "plot": 7.804347826086956,
    "acting": 7.4186046511627906,
    "ending": 6.142857142857143,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 7.4,
    "funny": 5.5,
    "action": 6.814814814814815
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The locations are memorable and interesting; the craggy canyons of Geonosis and the torrential storms of Kamino were immediately imprinted in my head when I first saw them. The CGI strengthens the film-the action sequences look amazing, from the speeder chase at the film's beginning, to the ending confrontation between the Jedi and Count Dooku. Seeing Yoda finally whip out his lightsaber and fight was very exciting. I don't get why people complain about him jumping around during the fight, though; such acrobatics show an interesting contrast between Yoda's age, and his actual power in the Force, and skill in lightsaber combat. No one would expect a 874-year-old green troll to have such mobility. Each of the planets is a representation of what is happening on the planet. Coruscant is shrouded in fog, Kamino is shrouded in mystery, and Geonosis is shrouded in violence; each is part of the shroud of the dark side that is ever-present in the film-in one of the main characters, and in the events that move the story along. I liked the characters of Obi-Wan, Padmé, and Anakin, as well as each of the conflicts and struggles they faced in the film. Again, I didn't get the accusations of \"wooden\" acting and \"boring\" characters. When watching the film, I believed that the characters were the characters, not actors playing characters. Lucas delivered another good screenplay, with some help from Jonathan Hales, and the politics-as well as the machinations of the Sith, and the slow erosion of the Republic-are fantastically done. Not only that, but the characters are believable and realistic for the situations they are placed in. The romance between Anakin and Padmé has been ridiculed for being \"cheesy\" and \"clichéd,\" but I think the moments and dialogue between them are perfect for their situation, as well as the universe that they live in. Besides, I love a romance between \"star-crossed\" lovers. Star Wars: Episode II: Attack of the Clones is a wonderfully-done film, and it is certainly worth your time to watch the second episode of the Star Wars saga."
    },
    {
      "rating": "10",
      "text": "This was the best Star Wars film of the entire franchise, the film is nearly perfect outside of few scenes in middle of film that drag a bit."
    },
    {
      "rating": "9",
      "text": "Chapter two of the Star Wars Saga is an energized and highly enjoyable two hours at the movies. A unique blockbuster of personal vision as well as high-tech fun."
    },
    {
      "rating": "10",
      "text": "This movie is wonderful. I may just be a nerdy fanboy who loves star wars, but I know my stuff. As a stand-alone film it would've been a disaster, so I can understand why people hated it right when it came out. But now with the third installment in the prequel trilogy being released, we really get to see Anakin grow, and I love seeing how loyal Obi-Wan stays to the Jedi order. Its nice to see how Obi-Wan questioned his master at the time Qui Gonn on his decisions, and then when Obi-Wan is Anakin's Master Andkin questions Obi-Wan. It's nice to see how they can relate because once they were both very similar in their wiseness. Now moving on to actual story plots in this film, I think that Count Dooku is a very compelling character and had some great power. The problem is the way they portrayed him in this film that I don't love because he just comes off as boring. I believe the Star Wars animated series The Clones Wars was a much better portrayal of Count Dooku. Even still no matter how much you hate this film you must admit that the epic Clone, Jedi, Droid battle is incredible. It may be filled with CGI but It still feels like you're right there. And let us not forget this film's predecessor The Phantom Menace! This film was... well a train wreck. They focused more on politics and less on what stars wars is all about, which is an insanely entertaining story and amazing special effects. I will say that the characters were written well. There are many reasons to enjoy this entertaining film and that's why I'm glad its a part of the fantastic series that is Star Wars."
    },
    {
      "rating": "4",
      "text": "The script, acting and romantic theme are definitely pretty weak, but like The Phantom Menace, the entertaining moments and epic battle scenes topple the bad parts"
    },
    {
      "rating": "6",
      "text": "For me the weakest of all the Star Wars films. Hayden Christensen went a long way to killing this movie on his own as his performance was so wooden. Zero chemistry between him and Natalie Portman. Even Jango Fett and a cool clone wars battle at the end of the film couldn't save it."
    },
    {
      "rating": "5",
      "text": "Star wars: episode II: attack of the clones is alright, it's an improvement on episode I (only a small amount of an improvement, mainly because jar jar binks is hardly in it and that it has a little more action in it). The good: some exciting action, good music, not much jar jar binks, clones, cool Yoda (not weird puppet). The bad: boring politics, really cheesy, terrible acting (except from Samuel l Jackson as mace windu)."
    },
    {
      "rating": "7",
      "text": "Not the best star wars film but still an awesome film. The story of  Anikin/Darth vader is really getting me curious and how it is going to evolve in episode ."
    },
    {
      "rating": "10",
      "text": "My personel favorite movie ever. Great character development, amazing action; never bored me for a second. I feel like this movie just gets way too much hate, I would highly recommend it to any sci-fi lover!"
    },
    {
      "rating": "10",
      "text": "Showing an intriguing incite into how the galaxy works and how the republic fell, plus some of the greatest battles in the entire franchise makes this an enjoyable film."
    },
    {
      "rating": "7",
      "text": "I liked it, unlike most people. The first half was a 6, the second half was a 8, so I made the final score a 7. The acting needed improvement, but wasn't terrible. The story was great and put everything together from 4-6. It is worth a watch."
    },
    {
      "rating": "6",
      "text": "Horrible acting, ok action, and ok plot.Plot: 4.5/5Action/ Entertainment: 3.5/5Music/ Visuals: 4/5Acting: 1/5"
    },
    {
      "rating": "10",
      "text": "I used to have this as my least favorite star wars movie but attack of the clones was still a solid entry in the saga. compared to TLJ it deserves a 10."
    },
    {
      "rating": "7",
      "text": "This film shows the beginning of rebellion movements within the Galactic Republic and the events leading up to the start of the war. Directed by George Lucas, it was written by him, in collaboration with Jonathan Hales, and count's with the participation of Ewan McGregor, Natalie Portman, Hayden Christensen, Christopher Lee, Samuel L. Jackson and Ian McDiarmid, among other actors.George Lucas has learned an important lesson from the previous film: special effects and action can make a bearable movie, but cannot make a quality movie. And it's not hard to see that the Director made an effort to ensure a more careful script this time. The script looks cleaner of expendable elements and worthless characters, and the characters exhibit much more psychological depth, particularly Anakin and Amidala. However, Lucas was unable to print passion to the loving bond that the couple starred. If there is love there, the public never see it or feel it. It seems friendship or affection, but never love so, they managed to become one of the most frigid romantic couples that cinema ever portrayed. Jar Jar continues to be a funny character but there are certain scenes when he's just stupid. The performance of the actors wasn't brilliant or inspired, with the exception of Samuel L. Jackson and Christopher Lee, who deserve congratulations, and Natalie Portman, who was not bad but could have done better. The soundtrack also does not bring anything new and does it's role with confidence. The special visual and sound effects were at the highest level, providing breathtaking action scenes and moments of great dramatic tension. The costumes, characterization and scenery were always up to the challenge, not disillusioned the most enthusiastic fans."
    },
    {
      "rating": "5",
      "text": "Torpedoing a decent movie, the cringe dialogue and wooden acting between Padme and Anakin seems written by someone who's never watched (or had in real life) a romance. One of Natalie Portman's worst performances. Still, a lot to like here, though. Still a far better movie than TLJ."
    },
    {
      "rating": "10",
      "text": "I really do not see all the hate for this movie. There are too many trolls out there that are so upset because it doesn’t compare to the originals. Do not let that deter your from watching it. Of course the movies do not compare to the originals they are prequels!The good:1. The action scenes on Geonosis2. The fight between Obi-Wan and Jango Fett both on Kamino and in space3. The chase for stopping Zam from escaping4. The subtleties of Chancellor receiving emergency powers is quite similar to how Hitler obtained dictatorial powers5. The first intense meeting between Obi-Wan and Jango Fett6. Count Dooku Vs Obi-Wan, Anakin, and Yoda7. The scene Anakin slaughters the Tusken Raiders signals his vulnerability to the dark sideThe bad:1. The romance drags on at times 2. The lines between Anakin and Padmé are cheesy but a lot of lines from the movies are cheesy3. The reliance on CGI is quite noticeableAgain the movie isn’t perfect but none of them are as they all have flaws."
    },
    {
      "rating": "8",
      "text": "Excellent action and cgi. Expands the Star Wars universe with interesting new places and explains more of the back story for episodes 4-6."
    },
    {
      "rating": "10",
      "text": "This is my favorite episode on this saga. It's my childhood's favorite movie."
    },
    {
      "rating": "10",
      "text": "The story line is amazing and is a must watch for anyone who has not seen yet. Hayden Christensen did such an amazing job!"
    },
    {
      "rating": "8",
      "text": "Pros: Great storyline, The big fight scene in the arena, Jango Fett, just a great movieCons: Anakins and Padmés romance story"
    },
    {
      "rating": "9",
      "text": "The movie have a better and easier story than the previous one, a better performances, a better visual and special effects, and the world is still look large and rich, the Anakin and Padmé romance thing feels unnecessary but it's necessary and if it's not because of the Luke and Anakin father and son story it is very unnecessary, but i'm still fine with it, i just feel it that way, the rest of Attack Of The Clones is just as fascinating as before."
    },
    {
      "rating": "9",
      "text": "SKIP TO THE END FOR REVIEW SUMMARY.Attack of the Clones, like its predecessor, is yet another highly controversial and underrated installment in the Star Wars saga.The movie is, for the most part, split between two stories. The first follows Anakin Skywalker and Padmé Amidala which is largely a romance story. The second is a detective-esque story in which Obi-Wan Kenobi discovers two separate armies that are being built to begin the Clone Wars. Ewan McGregor's superb acting definitely makes Obi-Wan's side of the film more entertaining and mysterious, but Anakin and Padmé's story is by no means awful.I'd be one of the first to say that the Anakin and Padmé love story has some cringe-worthy dialogue but it makes sense within the context of the universe and the characters. Anakin, a Jedi, has been taught to not love anyone and to have no emotional attachments. Obviously, he would be a little awkward when it comes to these things. Their story takes a more interesting turn when Anakin returns to his home planet in search of his mother.The entire third act of the film is simply phenomenal. A fight with monsters in an arena, followed by the first battle of the Clone Wars, and then a lightsaber battle between Count Dooku (Christopher Lee) and Yoda really help elevate the last 45 minutes or so of the movie to among the best in Star Wars history. The first act also had some solid action and intrigue with an assassination plot against Padmé. The second act is definitely the weakest, mainly because it drags on a little.The discovery and intrigue elements of Attack of the Clones definitely make it a great addition to the Star Wars saga. It's a little too long for my taste but other than that, I have no huge complaints.Review was redone ahead of The Last Jedi."
    },
    {
      "rating": "6",
      "text": "Attack of the Clones is not bad. To me, people who have a major hatred towards this film look at the originals with nostalgia glasses on. While Episodes V and VI are great, A New Hope is horrifically bad at times. Featuring awful acting and even worse special effects and writing, the original Star Wars film seems to be the basis for the prequel trilogy, as Attack of the Clones has some awful, awful writing (particularly the cringeworthy romance scenes) and some bad sequences of CGI. However, I will say that the special effects on the whole are vast improved. The acting, while not good, is nowhere near as bad as it was in the original. The original felt like amateur hour. In this one, you can tell these people are professionals, while is good. The action sequences in Attack of the Clones are all very good and the fight choreography is vast improved when compared to its predecessors. Finally, there is some killer cinematography in this one that really underscores how much time was put into making this one good. Overall, Attack of the Clones is not as good as the best of the Star Wars franchise, but is far from being the worst entry in the series."
    },
    {
      "rating": "9",
      "text": "A great movie that I enjoyed more than Force Awakens and the old trilogy combined. And not so much because of its effects and technology but the fantastic flow of the story and the world Class acting by EVERYONE...even Hayden Christiansen delivered some amazing moments and had obviously great potential as an actor. His slow transition into the Dark Side is perfectly presented. Ian Mac Diarmid (Palpatine), Evan McGregor and Cristopher Lee deliver fantastic emotions and AAA+ acting. I consider this along with Episode 3 the most mature Star Wars film. I dont understand why this movie has a 6.0 user score. It just doesnt make sense."
    },
    {
      "rating": "4",
      "text": "Attack of the clones is the second installment in the star wars prequel trilogy saga, I will start off by saying that attack of the clones could have been a could have been a fantastic movie it just needed a few tweaks for example if the relationship between Anakin and Padme was not written so awkwardly, if they didn't write Anakin like such a brat and if they had have put a bit more focus on the character building and we also could have used a lot more of Obi Wan Kenobi as he is the best character in the prequels, it could have been great, but that's not to say AOTC is terrible the action sequences are a lot of fun to watch and are well crafted, Ewan McGregor is brilliant as Obi Wan giving a lot of wit, sarcasm and bad assitude to the character and not to mention the movie has beautifully conceived landscapes and cinematography.\rVerdict: Attack of the clones is aesthetically pleasing as it does have some great action sequences and cinematography and obi wan's sarcastic humour is very well written but the characters and story are nowhere near as fleshed out as I would have liked them to have been."
    },
    {
      "rating": "2",
      "text": "Easily the Worst Film in the \"Star Wars\" Universe. a boring Story that goes on Forever, Makes Anakin Skywalker look like a Miserable Shell of a Human, and even Ruins Yoda by having him do all those Cheesey Flips in a fight scene. shoeing us how Stupid we were for Wanting it."
    },
    {
      "rating": "9",
      "text": "If I was head of LucasFilm, I'd officially call this film the '3rd best Star Wars movie ever'. Dooku makes a superb thought provoking anti-hero who shows he's more than capable of holding his own against youngsters which I love so much as it shows that the elderly can identify themselves to be strong and powerful if they want. The beauty of Coruscant at night was mesmerising, every time I watch the bar scene I always get drunk and happy, it's such a great scene which encourages people to have so much fun so it's a great thing. The beauty of the Outlander Club in the film makes me so sexually aroused. There's loads of intelligent aliens in this film which promotes that diversity is a true strength, with many sexy aliens there as well. It could've been better though if Anakin found his Mother and brutally sexually abused her fat butt, his Mother should've liked the sex eventually before killing her because she selfishly gave him up to strangers and didn't bother visiting him for 10 years. The sex scene between Anakin and his Mother would've also helped promote that it's okay to have sex with your Mum as everyone's the same anyway, if everyone wasn't the same diversity wouldn't be a strength. And killing her like that would show that Anakin is normal and doesn't care about people who are closely genetically related to him more than people who aren't closely genetically related to him. Due to George Lucas, Anakin's a racist who treated his evil Mother far more nicely than what her fat butt deserved."
    },
    {
      "rating": "0",
      "text": "The only good thing I can say about this movie is that Jar-Jar is not in it... thank god..."
    },
    {
      "rating": "0",
      "text": "So bad as to beggar the imagination. Bad as in dull, soul-numbing bad, not as in campy, amusing bad. That's right, folks, it's another massive eruption of anti-art from the bottomless well of idiot's drool otherwise known as Hollywood. The theater was pulsing with energy; spontaneous cheers went up at the appearance of the Lucasfilms logo. The next audience sound, other than low, embarrassed laughter, happened more than two hours later (when Yoda .....). The rest was silence. As we were filing out past the incoming crowd of victims, one was heard to comment, \"They don't look happy.\" We were not happy. Don't waste your time and money on this garbage; and please help discourage Mr. Lucas from committing further aesthetic war crimes by mercilessly ridiculing him and any of his blind, tone-deaf, mentally-challenged supporters."
    },
    {
      "rating": "6",
      "text": "Star Wars: Episode II  Attack of the Clones has the biggest problem of any of the Star Wars films. Namely the romance between Padme and Anakin. Anakin spends most of the movie sneering and acting like a bottled up psychopath... And yet we're supposed to swallow that someone as smart as a senator falls head over heels in love with him? Unconvincing to say the least. Aside from that, however, Attack of the Clones impresses with some great action scenes, a terrific final reel and an appearance from Christopher Lee. Which pretty much balances things out in the long run."
    },
    {
      "rating": "6",
      "text": "Attack of the Clones is much better than the Phantom Menace, undoubtedly the worst Star Wars ever made. But its not a New Hope, an Empire Strikes Back, or even a Return of the Jedi...sadly. Attack of the Clones succeeds in many areas but fails in many more. As said with the Phantom Menace review, the key things that made the original trilogy so magical were its story and characters, universe, and the good acting. Attack of the Clones ties together many, many loose ends lying around with the series, and brings in adult Anakin Skywalker played by Hayden Christensen, who is ultimately dull and boring as an actor and feels sadly even worse than his younger version seen in the Phantom Menace.\rEwan McGregor is however, much better in AotC than Phantom Menace, seeing an overall stronger performance. Natalie Portman has improved slightly too, but still gives a bit of a \"I'm only here to fill in the role\" look off. The performances are overall average, and nothing compared to the original trilogy.\rThe characters are interesting and while Jar-Jar Binks is briefly seen we don't have to deal with his abomination of a character on screen for long. We see Boba Fett's father, the birth of the stormtroopers, and Anakin Skywalker's looming fate, and its all very great. The new CGI produced Yoda and other aliens makes the experience all the more realistic and is cool.\rBut when it adds up for what it is, AotC is still a very, very, very flawed piece of work, that while action packed and fun, lacks the flair or audacity of the original three, and what made them so great."
    },
    {
      "rating": "5",
      "text": "Like 'Phantom', this entry in the beloved 'Star Wars' saga is too much like a video game, and has a terrible script. Hayden Christensen and Natalie Portman were wooden,and Ewan McGregor wasn't much better.\r The unnatural romance between Anakin and Padme is probably the film's biggest weakness. It portrays Anakin as a creepy stalker, and the script makes it worse. \"I don't like sand.\"\r Finally, it's too goddamn long! The war scene at the end becomes so boring, it's easy to lose track of who the hell is who and where the hell they are.\r So, while defiantly an improvement on 'Phantom,' story-wise (but only marginally), Attack of the Clones doesn't do this beloved saga much justice."
    },
    {
      "rating": "5",
      "text": "A slight improvement over Episode I. Still a poor movie. Written with horrible dialogue, bad effects, stupid plot, bad acting. It really is just a mess. The main part of the movie, the love between Anakin and Padme, is just terrible."
    },
    {
      "rating": "1",
      "text": "Attack of the Clones is the worst Star Wars movie yet it boasts awful performances and bad chemistry from Padme and Anakin."
    },
    {
      "rating": "7",
      "text": "Probably the weakest of the prequels, but still very watchable and infinitely better than the sequels."
    },
    {
      "rating": "3",
      "text": "What was George Lucas thinking? Has he completely lost his mind? As a long time Star Wars fan, this movie was so disappointing. The acting is awful, downright awful, and the plot has nothing going for it. The only good things about it were the light-saber fight at the end with Yoda, and that Jar Jar Binks wasn't in it. What a waste of talent, and expectation."
    },
    {
      "rating": "4",
      "text": "This is without a doubt the worst of the six star wars films. The action is way too sporadic, and Hayden Christensen cannot act for toast. Having said that there is one good scene, but one good action scene does not a good movie create, and this is not a good movie. It also doesn't really explain or add to the overall storyline very much so you might as well just skip this one."
    },
    {
      "rating": "4",
      "text": "This is a joke right? Here is absolute proof that less Jar Jar doesn't necessarily equal good movie. What I wanna know is, who the €&@/ wrote the script? They weren't even TRYING! And furthermore, it's almost impossible to get over the fact that Anakin was a child when Padmè was already an adult making their romance just creepy. Combine this with the fact that they have no chemistry (their so-called \"love story\" revolves around Anakin stalking her and becoming possessive of her) and it gets even worse. This is the WORST movie in the prequel trilogy- in fact, make that the whole franchise."
    },
    {
      "rating": "9",
      "text": "Attack of the Clones is the weakest of the prequel trilogy, but only because it tried to do so much in such a short space of time. It also was wholly different than any Star Wars that had come before or since. Because of the extreme risks the film took - in both story & style, and in the way it was filmed - it stumbles sometimes. Still, it is a fantastic piece of the Saga and far better than anything Disney has created."
    },
    {
      "rating": "5",
      "text": "George Lucas, similar to \"The Phantom Menace\", doesn't really give anything except for a high quality CGI battle in \"Attack of the Clones\"."
    },
    {
      "rating": "8",
      "text": "It may be all cgi but hey it's still worth watching, definitely an improvement from the first one \"phantom menace\" especially the huge jedi battle AWESOME, all the lightsaber action is great, and all the new jedi's even though a lot of the cool one's don't have a big part in the movie, they're still pretty cool. This is a must watch for star wars fans. And all the people saying this movie is bad is honestly just trying to act like a 1970's fanboy copying whatever other people say negative about the prequels."
    },
    {
      "rating": "8",
      "text": "Still nowhere near as good as any movie in the original trilogy, but unlike Episode I, at least this one is actually watchable if you can put up with the lame dialog. It's a mediocre movie but there are some really cool scenes in it so I have bumped it up to an 8/10."
    },
    {
      "rating": "3",
      "text": "Although it has some good scenes, like Shmi Skywalker's death, and the duel between Anakin, Obi-Wan, and Count Dooku, Attack of The Clones still stands as the worst of the prequel series and as the worst in the entire saga due to atrocious dialogue and horrid characterisations."
    },
    {
      "rating": "7",
      "text": "Its just like Phantom Menace, but with less Jar Jar and more greatness! That massive Jedi battle? Awesome. Christopher Lee? Sweet. Hayden Christiensen? Well... he looks just like what I thought but his acting? Eeh... its okay I guess. CGI Yoda? Looks better than the Phantom Menace one! Those massive battles? Great. Origin story of Boba Fett? Not so great.\r Overall: Great movie, go see it."
    },
    {
      "rating": "7",
      "text": "Ten years after the events in \"The Phantom Menace,\" Jedi Obi-Wan Kenobi (McGregor) and Anakin Sywalker (Christensen) are summoned to protect Padme Amidala (Portman) after an assassination attempt is made on her life. Anakin's love of Amidala grows when the pair returns to Naboo, and Obi-Wan's investigation of the death plot reveals sinister designs that threaten to bring the Galactic Republic to the brink of war."
    },
    {
      "rating": "7",
      "text": "[Portuguese] Como o primeiro, este filme é um pouco chato porém há bastante ação e explica a criação dos clones, então é um filme que tem suas partes interessantes."
    },
    {
      "rating": "7",
      "text": "As many have stated before me, this movie is not perfect. I know it gets a lot of hate. However, I really enjoyed this movie. I think it has great special effects and the story it pretty entertaining, except for some of the love parts. The dialogue is also very basic and just doesn't always work. But there is still enough to enjoy in this entry, like the scenes with lightsabers and obi wan. Don't believe what the critics are saying and go see it for yourself."
    },
    {
      "rating": "10",
      "text": "Why do so many people dislike this movie. There are only two bad actors and 4 bad characters but it has great characters we have seen before and some awesome new characters a good story and less Jar Jar Kit Fisto, Jango Fett, Obi-Wan, and Anakin are awesome despite Anakin not having the best acting well voice acting his facial acting is very good and the movie has good fight scenes and 3 awesome bad guys and once again 2 bad ones but they are from the last movie. Overall it is a great movie and has some flaws."
    },
    {
      "rating": "3",
      "text": "For me this was the worst of the six star wars movies. As a matter of fact I wouldn't call it a movie until the last 20 minutes. The begining and middle of this film was boring and predictable. Only the dule between Dooku and Yoda saved this movie from being a big fat 0. But even then it was to little to late."
    },
    {
      "rating": "10",
      "text": "Just a great movie! It's a very welcomed comeback to star wars, after the childish Phantom Menace. I think it is probably my favourite of the new trilogy because Revenge of the sith is a lot darker (not that it's a bad thing but I like it when the clones are on the Republic's side.)"
    }
  ]
}