{"id": 3799, "title": "Star Trek: Insurrection", "starring": ["Patrick Stewart", "Jonathan Frakes"], "runtime": 103, "genre": ["Science Fiction", "Action", "Adventure", "Thriller"], "description": "When an alien race and factions within Starfleet attempt to take over a planet that has \"regenerative\" properties, it falls upon Captain Picard and the crew of the Enterprise to defend the planet's people as well as the very ideals upon which the Federation itself was founded.", "releaseYear": "1998", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/xQCMAHeg5M9HpDIqanYbWdr4brB.jpg", "categories": {"plot": 6.705882352941177, "acting": 6.7, "ending": 6.0, "soundtrack": 8.5, "cinematography": 5.0, "familyFriendly": 7.75, "funny": 6.5, "action": 6.3}, "reviews": [{"rating": "5", "text": "One has to wonder why anyone would make a major motion picture that is weaker than a third of the Next Generation TV episodes."}, {"rating": "4", "text": "One of my least favorite Star Trek movies. One problem is, I just can't stop cheering for the bad guy. They're working for the greater good of billions of people, and, as Spock said, \"the needs of the many out weight the needs of the few\", which in this case is less then a thousand people who are probably going to end up on a smiler or slightly better planet anyway. The film lacks substance and edge compared to most of the other movies and TV show episodes, and for this reason I don't like it."}, {"rating": "8", "text": "I've always found that I enjoy watching this movie, and I've probably watched it 10 times.. more than any other Star Trek movie. No idea why, I just find it moving. Of course the same plot attempted in another franchise or a stand alone movie, without the solid base of established characters like Picard would certainly be nowhere near as enjoyable."}, {"rating": "8", "text": "Of all the Star Trek films I like this one the best. The plot is, perhaps, a little tame compared to the others but thats why I like it - its not the same. I think the soundtracks better too."}, {"rating": "5", "text": "As for a production standpoint, this film was a nice change of pace from the insane action film that was First Contact. They knew they would never top themselves after that film so they didnt try, they just made a solid STNG film that felt like it could have easily been part of the television series itself. https://latetothegame.blog/2019/02/20/retro-tv-review-movie-edition-star-trek-insurrection-1998/"}, {"rating": "10", "text": "INSURRECTION does what Star Trek does best, take a socially relevent problem and explore how to solve it.  Out of 'The Next Generation' films this one is the most light-hearted and enjoy-abe for casual fans or for those who have no knowledge of the Star Trek universe.  Rather than J.J.Abrams STAR TREK (2009) film, INSURRECTION is a better starting point for people who know little to nothing of the Star Trek universe.  There are great character moments, humorous moments as well as great acting from Patrick Stewart, F. Murray Abraham, Anthony Zerbe, Michael Welch & Donna Murphy.  This is just a great film!"}, {"rating": "7", "text": "This should be called \"Star Trek Inerection\" because it fails to \"get up\" to the job of being a great Star Trek movie. I was a fan of the Star Trek TNG TV series, in fact to this day it is my favourite TV series of all time. But like Generations and Nemesis, this one just ended up being mediocre. With the exception of Star Trek: First Contact with was absolutely great, there were TV episodes equal and in some cases better than the TNG movies. I'm still bitter about them cancelling the series while it was the number one rated TV show just so they could make 3 mediocre movies and 1 good movie. The way they tried to make everyone young later in the film by putting tonnes of makeup on in the start of the movie to make them look older at the start was so blatantly obvious that it was lame."}, {"rating": "5", "text": "Totally bland and boring. The movie really does nothing wrong, the cast do their job, the effects are good and the story is deep and well thought out. Yet, there is nothing wrong, it just feels so boring and uninteresting, almost like you've seen this a hundred times before.\r Overall:\rWhile not terrible, it also isn't that good either. As average as star trek can be."}, {"rating": "2", "text": "This movie was based on one episode of the TV show, and not even one of the best ones. It looks like the characters forgot most of their progress through the show and most of the relationship between the characters are gone too. Thus is not a good move. And I can't recommend it."}, {"rating": "8", "text": "I like this movie and its change of pace. Not everything must be about saving the galaxy, the universe or defeating an unstoppable mastermind / tread. This is more character driven with philosophical questions or should I say problems. It shows more of the dark side of the Federation or its hypocrisy. Before you ask, yes the Federation is a better society than ours but it has its downsides. TNG and DS9 showed this really good. For example: Remember that the Federation could have freed the Bajorans during their war against the Cardassian Union but don't do anything to stop the oppression, slavery and mass murdering. But back to this movie. Like I said it is about philosophies and the values you believe in. Sadly I cant say much more without spoilers. I will say that there are some good plot twist that are carried well by the actors or should I say characters. The whole crew delivers with Picard, Worf and Data as best performers in my opinion. From the new characters Ahdar is a well chosen antagonist, Admiral Dougherty delivers and with Anji and Gallatin we have good characters that improve the movie. The special effects are good here. Only the space battles feel a bit underwhelming for me. At last I want to praise the excellent humor in this movie. There are some really good scenes and jokes. Overall a good movie that you can rewatch once in a while. I like it a lot but will admit that it is not the kind of Star Trek movie everyone wants."}, {"rating": "3", "text": "The next generation crew steps up to the plate with a third film but does it knock one out of the park? Well not to beat around the bush no it doesn't, its a full strike if you ask me.\r I'm not gonna sugar coat it, gotta be cold here. For me this was easily the weakest Trek film so far, even worse than 'Star Trek V'. I know I have used the term 'outstretched TV episode' a few times in previous reviews with Star Trek but this one term really sums up this film to a tee.\r Apart from the quite dreadful grey scale shaded tone that accompanies every scene on board the Enterprise which somehow now seems more intrusive than in the previous two films, the plot is utterly non-engaging or even remotely interesting. A planet which harbours immortal regeneration powers that Starfleet and the alien race Son'a wish to keep for themselves whilst at the same time evicting the local hippie population. Say what now?? yes that's right, its basically all about evicting some perfect happy go lucky boring blonde haired blue eyed farm folk off their planet...and that's it. I'm not even sure if there were any bad guys in this! I suppose they were naughty, not really much of a threat though, it was just a few groups fighting amongst themselves really, nothing more.\r The whole film is so so utterly pointless and dull for virtually the entire run time! It only kicks into action for a small segment near the finale and even that was very mediocre stuff. Everything looks exactly as it does on the TV show, there is nothing that would make you think this is a big budget movie. The effects are no better! you would think they might be getting better but no, this film actually goes a step backwards.\r There is just something about the next generation design, even though these are movies they just can't seem to shake the look and feel of the TV series. The classic crew movies didn't always look tremendous but they were always much better looking than the original show, they always had real silver screen moments. I'm afraid to say this entry has none what so ever.\r It seems as though everything is now fully CGI here, I'm not a fan of computer generated effects and I think this is a good example why. The only thing that looks good and realistic in this film are the space panoramas, nebulae, planets etc...which is exactly what CGI is good at. Starships can be done well but here they are no better than their TV counterparts, satisfactory at best. There are still the age old issues of dodgy bluescreen going on but now they also have the added downside of completely fake CGI sequences on top.\r So apart from the dreadful plot and god awful CGI are there any plus points? I guess F. Murray Abraham does add a sprinkle of class onto the proceedings, its just a shame he does completely nothing of interest for the whole film. The alien race he portrays (Son'a) are such a generic concept with little to no imagination in design, their faces are simply plain grey just like all the uniforms of the Enterprise cre...zzzzz.\r So the film ticks along with tonnes of dialog including so much space jargon I felt completely bewildered and detached. I'm sure this one film has more Trek technical mumbo jumbo speeches than any other, by the end of the film I had actually lost how or what they were all suppose to be doing.\r Add to this some really vomit inducing romance with Picard, really hokey sets, really fake plastic looking props, hokey fights and the very annoying practically perfect farm civilisation in their typically 'I'm a goodie' beige/white loose fit garments. Yeah I know its a Star Trek film and you come to expect this kinda stuff but by this point I think certain aspects of this really should be better. The classic Trek crew were loved for their quirky comedic like adventures and Shatner's fluffy fist fights. The next generation crew just can't pull that off, they are too serious and too dull basically. For me they can't get away with the charming nonsense that the classic crew got away with.\r This film lacks punch and energy, its a complete non entity and in my opinion will only please Trekkies. For fans it basically has all you need as its pretty much a very long TV episode so you can't go wrong. For neutral non-fan folk it will be a slow arduous slog through some heavy dialog that will probably leave you dizzy whilst offering no reward at the end."}, {"rating": "7", "text": "Slow paced but entertaining. Star Trek: Insurrection is definitely not one of the better Star Trek movies, it mostly feels like an extended episode with a big budget. The special effects though are quite sub-par, they haven't aged as well as the other Star Trek movies. Insurrection is also slow-paced, it takes an hour for anything of real interest to happen. But it is entertaining and it does have an intriguing ethical question, it just didn't need to be made into a movie. C+"}, {"rating": "6", "text": "This movie is the ninth of the franchise. The script is based on a conspiracy in which the Federation plans to destroy a planet defended by the Enterprise crew, who decides to mutiny. Honestly, it's not a bad idea but we've seen so many movies about high-level conspiracies (governments, states, etc.) that everything becomes a bit predictable from a certain moment. Patrick Stewart did not disappoint the fans and did quite well in this film, as did Brent Spiner, who plays a very important role in the screenplay. It is a film with a dramatic charge more intense than some of its predecessors. CGI and the special effects seemed good to me and were used consciously, without exaggeration but, despite these merits and being a movie worth watching, there's nothing to make this movie striking or memorable."}, {"rating": "10", "text": "ANIJ \"Let me ask you a question; have you ever experienced a perfect moment in time?\"PICARD \"A perfect moment?\"ANIJ \"When time seemed to stop... and you could almost live in that moment...\"PICARD \"Seeing my home planet from space for the first time...\"ANIJ \"Yes. Exactly. Nothing more complicated than perception. You explore the universe. We've discovered a single moment in time can be a universe in itself... full of powerful forces... most people aren't aware enough of the now... to ever notice them...\"This Movie gives me so much perfect moments... It feels like a romance, but not only between two persons... but also between Reality and Time...For Me the BEST Star Trek Movie! And for me it is clear what Picard does after he leave the Fleet... He dont make so stupid choices and married Crucher (like in the Books.. so unrealistric) or stay frustrated on Earth (like the Picard Series from 2020).  No, he goes back to Ba´ku and lives there FOR EVER in Peace! All another Storys plays in diferent Universe. Watch the Movie and you know it."}, {"rating": "9", "text": "Awesomely Entertaining movie from start till end!the music was phenomenal,the story was good,the visuals were decent not as great as prequels but okay,the plot of federation making good connection with others to be strong and the Baku's planet concept of healing and all it was mind-blowing,the overall movie has some flaws but literally the pacing is great it was entertaining from start to end,the action scenes were less but the ending little fight was good although not that impact-full.the starting intro of planet as if its old times the greenery and joy it was amazing then the data's attack and malfunctioning then Crew's rescue it was good as we go the admiral from federation in good deeds with some alien race and there plan revealed after sometime it was mind-blowing,the sudden change in everyone's personality after a walk in planet the Deanna's and Riker's romance and Geordi's vision healed with captain's mood swing it was like \"WHAT\" then as we go the Planet's concept reveal and Love to see Captain in love relation it was amazing,the puberty of Klingon and the jokes around it throughout the movie is fun and the Data's exploration as kid was sweet,the Admiral's plan to take planet by shifting all people in illusion craft it was mind-blowing and then the captain and crew's mission against them the whole planet people's rescue against Admiral the fight of Alien's and Riker as captain on other side it was awesome then the whole Alien's race Twist reveal \"they are same race as people in planet\" it was mind-blowing,then the whole last 30 mins it was amazing the admiral changing mind and suddenly killed by Alien and then the captains turning whole illusion checkmate to them it was amazing and the last fight at shuttle it was good then the ending with good-byes and the planet's family meetings it was sweet!Overall its a Decent plot amazingly paced adventurously funny and entertaining movie!"}, {"rating": "2", "text": "The absolute worst of all the Trek films, simply not even worthy of the name."}, {"rating": "7", "text": "Insurrection, a pleasant, semi-spiritual, but all-too-predictable episode of the ST series, raises a number of intriguing concepts that are never fully developed or addressed. The fact that Director Frakes chose to concentrate on the action and humour rather than some of the deeper and even lighter philosophical/spiritual issues merely alluded to in the 101-minute film surprised me. I was moderately disappointed with Insurrection after his directing of the darker and more completely realised ST:First Contact, feeling as though I had eaten Chinese takeaway with the proverbial hunger an hour afterwards. Excellent beginning, solid middle, and predictable, hurried conclusion. Do Frakes, Stewart, and the others have a place to go?"}], "recommendations": ["star_trek_beyond", "star_trek_nemesis", "star_trek", "star_trek_into_darkness", "star_trek_v_the_final_frontier", "star_trek_the_motion_picture", "battle_los_angeles", "star_trek_first_contact", "riddick", "surrogates", "the_tomorrow_war", "x_men_apocalypse", "star_wars_episode_i_the_phantom_menace", "independence_day", "serenity", "the_matrix_revolutions", "captive_state", "rise_of_the_planet_of_the_apes", "jupiter_ascending", "rogue_one_a_star_wars_story", "mortal_engines", "independence_day_resurgence", "the_core", "terminator_3_rise_of_the_machines", "elysium"]}