{
  "id": 3557,
  "title": "Star Trek: First Contact",
  "starring": [
    "Patrick Stewart",
    "Jonathan Frakes"
  ],
  "runtime": 111,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "The Borg, a relentless race of cyborgs, are on a direct course for Earth. Violating orders to stay away from the battle, Captain Picard and the crew of the newly-commissioned USS Enterprise E pursue the Borg back in time to prevent the invaders from changing Federation history and assimilating the galaxy.",
  "releaseYear": "1996",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vrC1lkTktFQ4AqBfqf4PXoDDLcw.jpg",
  "categories": {
    "plot": 7.964285714285714,
    "acting": 8.65,
    "ending": 8.0,
    "soundtrack": 10.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 8.210526315789474
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Awesome movie."
    },
    {
      "rating": "10",
      "text": "This movie is Jonathan Frakes' directing at it's best. With the almost Star Wars-like space battles and epic action it is easily one of the best sci-fi movies of the 20th century. The acting talents of the lead characters are absolutely their best performances."
    },
    {
      "rating": "10",
      "text": "This movie brings together everything that is star trek, a rich history, clever story line, and the fate of humanity at stake."
    },
    {
      "rating": "10",
      "text": "I'm an original Star Trek series (you know, Kirk, Spock) fan myself, but I can honestly say that this is not only one of the best Star Trek films ever, but this may be one of the best Sci-fi movies ever. Period. Kudos to Jonathan Frakes."
    },
    {
      "rating": "6",
      "text": "Second film (or sequel?) for the next generation crew and this time there is no hint of the classic crew what so ever, its all new now baby.\r So this next Trek rumble is a lot more straight forward plot wise and probably has the most action seen for awhile. Quite simply the Borg are on the rampage and out to assimilate pretty much everyone they can, namely all of Starfleet. This goes a little pear shaped for them so they jump through time to assimilate the entire Earth...the naughty rascals. Is time travel a regular function for everyone in the Trek universe? handy if so.\r I liked this film for the simplicity of everything and the fact you get some basic action mixed with some genuine tension along with the insecurity of not knowing what may happen, seeing as its the Borg. Bottom line there are plenty of deaths or assimilation's (close enough), a decent baddie, some good back story to Earth's future and plenty of phaser action. Its not exactly a top notch sci-fi action flick lets be honest here, this is no Die Hard in space. Visually most things still have that TV show quality only on a slightly grander scale. Everything looks a bit plastic amongst the obvious plastic sets.\r Effects again are more CGI based than models unfortunately. The space battle against the big Borg cube ship thing at the start actually looks like a video game sequence, obvious CGI without weight or depth. I know this is still only 96 but geez you'd think they could do better, compare this to Star Wars! The deadly Borg look quite decent with some good facial makeup but their cyborg body armour, weapons and general body attachments do look pretty rubbery and plastic.\r I really don't know who decided to put silly little flashing lights all over the shop, it just makes everything look so childish and fake. Data again suffers with this indignity, when his android under layers are revealed it just appears to be bare grey plastic with stupid flashing fairy lights all over, so very crap looking.\r As for the bad guys I do like them, space zombies if you will, lets face it that's what they are really. Part robotic and part organic space zombies from the planet Romero. I do like the Borg as they do actually come across as creepy plus they manage to add real tension and dread to a Star Trek film. Can't really over look the fact they are a mixture of various ideas from various other sci-fi/horror films all pieced together ('Hellraiser' springs to mind). Plus the fact that they transform whole areas into cold dead robotic hives that visually appear the same as the Borg themselves kinda copies ideas used in 'Aliens' but hey ho.\r Apart from that the Borg are quite a cool creation and do actually add a genuine threat to the Star Trek universe. Yet at the same time they kinda don't fit in the Trek universe, they're almost too cold, calculated and merciless for the family friendly franchise. Not sure I ever really liked the design of their ship (I guess its a ship), why is it merely a large cube? what's the deal with that? On a final note why are they called Borg? are they Swedish?\r The Borg queen is a nice touch to the faceless enemy that does come across as an interesting character, not just a cyborg on auto pilot. She also has some really good prosthetic makeup on the face and chest regions, looks that bit more realistic than the other drones.\r A definite improvement over the last rather dull film, a basic story which is more savage and quite dark in places, although not too extreme of course. I did notice this is another film where actually having some knowledge of a previous TV episode/s is slightly required. They got away with it for 'Star Trek II' and I believe they got away with it for this film also, but seeing that particular episode would appear to help when watching this film."
    },
    {
      "rating": "4",
      "text": "Cheeeeeeesy omg... only the original trek gang was worth watching.. now this cast and story, its a total cliche and flooded with nonsense creativity. Also, SFX doesn't make a movie score 10."
    },
    {
      "rating": "4",
      "text": "For me the movies were a great disappointment.    The only thing I liked about the movie is that it was about the Borg.  But, not worth watching again."
    },
    {
      "rating": "0",
      "text": "You guys are all wrong!! Dis movie is really boring and no fun, it was soooo boring that it keeps making me fall asleep."
    },
    {
      "rating": "2",
      "text": "I'm gonna go ahead and explain one of the biggest flaws I found with First Contact. And this isn't one of the common ones like Picard being an action hero or Cochrane being silly or whatever. Those have all been covered.The flaw is... the Borg Cube at the beginning of the film is destroyed.Now, this wouldn't be a problem if it was destroyed in some way that made sense. Like at the end of The Best of Both Worlds, that was a really creative and interesting way to defeat the Borg. Also, it was really the only choice they had, because the Borg were **** unstoppable juggernauts of no-resistance-making and you couldn't defeat them through sheer firepower or combined arms. That was what Q Who and Best of Both Worlds taught us. I mean, the Battle of Wolf 359 is still scarred into every Trekkie's living memory, right? That's for a reason. Wolf 359 was probably the most memorable space battle on the series, and it was one we never even saw! That sorta thing stays with you for a long time.Well, First Contact comes around and shows us that Q Who and Best of Both Worlds were both wrong. You apparently can defeat the Borg through sheer firepower and combined arms. And that's just wrong, man. That is straight up **** retarded. The Borg are as scary and powerful as they are for a very big reason. It is not because they build giant **** cubes. That helps, but that by itself wouldn't make them all that special.The Borg's main advantage comes from their ability to adapt. It always has been. This is the trump card that they revealed in Q Who. You fire phasers and photon torpedoes at a Cube, and you'll be able to get in a few shots, but afterwards they will adapt, regenerate, and your weapons are now completely useless. This is an amazing ability which means that they are able to access God mode from the console after you hit em a few times. Even with changing phaser frequencies, you'll only buy yourself a few more shots before they adapt. This has been shown over and over again in the series.Well, for some reason... the Borg Cube in First Contact seems to have lost the ability to adapt. It's true, don't think I'm making this whole schtick up. After the battle begins, the Enterprise E goes from the border of the Romulan Neutral Zone to the Sol System. This presumably takes some time. I dunno how long, let's just say a couple of hours at least, right? That's probably pretty reasonable. And the cube battle begins from the Typhon sector and ends up at the Sol System. So from start to finish, it's a couple of hours. And the Cube apparently doesn't adapt in that amount of time. Because when we finally get to see the battle, on Earth's doorstep, the Borg Cube's still taking hits from phasers, photon torpedoes... all manner of crap. Enterprise E shows up and fires phasers and quantum torpedoes... no adapting on the Cube's part. Where did this adapting ability go? It was on the TV series, but didn't make the transition to the films? WTF guys?And don't tell me that the Enterprise E's quantum torpedoes worked because they were new weapons and the Cube hadn't had time to adapt yet. Yes, the quantum torpedoes were new, but you can't honestly expect me to believe that the Enterprise E was the first ship at the battle to employ them. There was an enormous fleet fighting the Borg for several hours before the E arrived, surely some of them must have had quantums. I mean, the Defiant has quantum torpedoes, doesn't it? The Defiant sure fought the Cube for a long time. So it surely must've used quantum torpedoes.So they're peppering it with everything, and the Cube's taking all kinds of damage, even though the Cube from Best of Both Worlds decimated the entire Wolf 359 fleet without taking a scratch. Because they adapted to phasers and photon torpedoes in Best of Both Worlds. Something this Borg Cube apparently can't do. Now Picard on the Enterprise E hears something in his head that lets him know to fire at a certain spot. So all the remaining ships fire at this spot and the Cube blows up.Now, this is ridiculous in several ways. First of all, how the hell does Picard know what the Borg are thinking? He hasn't known what the Borg were thinking during the last few goddamn seasons of TNG. He was completely cured and rehabilitated after Best of Both Worlds. They drained all the borg nanites and implants and whatnot from his body, right? He doesn't have any Borg stuff on him anymore. So what the hell, how is he receiving it? And why would he be receiving nothing other then the exact way to destroy the Cube? Why would the Borg feel like telling him the exact weakness to exploit to destroy them? In I Borg, did the Borg also somehow tell Picard to insert a virus into Hugh to destroy them as well? And if he has the ability to read the Borg's thoughts, doesn't that mean it could also work both ways?"
    },
    {
      "rating": "8",
      "text": "Star Trek: First Contact is a good movie, it does however lack here and there, but I think that can easily be ignored."
    },
    {
      "rating": "10",
      "text": "First Contact takes the battle Jean-Luc had with the Borg in TNG and made the climax into a movie. Finally seeing a Borg offensive is nice, and seeing how cleverly the humans fend them off is pretty entertaining. The movie also gives a pretty graphic picture of the Borg assimilation process throughout. This movie was most definitely Star Trek, and anyone who liked TNG, the Borg or both will find much to like about First Contact."
    },
    {
      "rating": "8",
      "text": "OK movie, better since Enterprise came out."
    },
    {
      "rating": "10",
      "text": "This is an absolutely fabulous movie that everyone should see! I probably liked it even better that the new Star Trek movie in 2009. Great acting, special effects, suspence,etc. Seeeee this movie!"
    },
    {
      "rating": "10",
      "text": "If there's one thing I can say about this movie, that will state my love for it, one stupid, but frank line, it's \"Damn, that was fun!\""
    },
    {
      "rating": "10",
      "text": "Let me give it to you straight, it was awesome. From the moment Picard feels the Borg to the death of the Cenobite like Borg Queen (played by Alice Krige) herself it is a none stop amusement park ride featuring everything you could possibly want from a second Borg invasion. I remember going to the cinema so excited for another adventure with the members of the TNG crew and better yet, we get to see the new USS Enterprise E! https://latetothegame.blog/2019/02/18/retro-tv-review-movie-edition-star-trek-first-contact-1996/"
    },
    {
      "rating": "10",
      "text": "FIRST CONTACT is considered to be the best TNG film.  And when you watch it you see why.  FIRST CONTACT features the Borg, perhaps the most popular villain in science-fiction history or at least in the Star Trek universe.  Picard and crew return aboard the new Enterprise-E and in order to save the future must travel back in time to 2063 to save the past.  At the time FIRST CONTACT was the most successful Star Trek film (world wide) up until J.J.Abrams STAR TREK (2009) film.  There are great action sequences, acting (notably Patrick Stewart gives his best performance second only to NEMESIS, as well as Alice Krige as the Borg Queen).  Simply put, FIRST CONTACT is one hell of a film!  A must see!"
    },
    {
      "rating": "8",
      "text": "A surprisingly good Star Trek movie that actually feels like a feature film rather than an extended television episode. Well acted and professionally written. Jonathan Frakes adds his own spice as a director, and the fact that he also acts as Riker makes him a suitable choice to direct."
    },
    {
      "rating": "8",
      "text": "The best of the TNG films and unfortunately the end of quality Star Trek on any format. It has a great story that uses ST lore properly and efficiently with sharp direction by Frakes. It's smart, funny and has you entranced by its themes and ideas. The effects are great and the acting and dialog are the best that the TNG cast have had. It's up there with the other previous even numbered ST film classics."
    },
    {
      "rating": "7",
      "text": "STAR TREK: FIRST CONTACT is great, yes, and certainly fun, even as the eighth entry in the overall film series (and the second based on STAR TREK: THE NEXT GENERATION), but especially for a Star Trek flick, Jonathan Frakes (who played Commander Riker in this one), turned what could have been a straightforward, serious masterpiece into a whacked-out, somewhat sickly gross (in its first PG-13 style), science fiction thrill ride. Imagine SAW with aliens instead of Jigsaw and camera cutaways before we can even see the gore we know is coming. There's the apparently new STAR TREK way to create a twisted PG-13 flick."
    },
    {
      "rating": "10",
      "text": "One of the best original Star Trek movies without doubt. The film has a brilliant begginning, a marvelous ending and a fabulous, action packed, Borg filled middle which I am sure all film critics will look for in films. Excellent!!!"
    },
    {
      "rating": "7",
      "text": "Succeeds, despite its obvious flaws. The time travel story is sketchy a best, and has some considerable loopholes, such as, why don't the Borg do it again? or, why don't they go back into the past 30,000 light years from Earth, where Starfleet couldn't blow the hell out of them, and then go and assimilate Earth?There are a lot of things in this film that I loved style wise, the new design to the Borg for instance made them extremely menacing, and the Borg attack scenes coupled with Jerry Goldsmith's out and out FANTASTIC score for this film made the fight scenes palpable, suspenseful and great. They did get a bit repetitive after a while, however. The story focus on Picard in this film is definitely good; we have a story of a captain who thus far, has lost two Starships under his command, the second - the Enterprise D - because he wasn't there. You know that Picard is the kind of captain who would wonder if it had been different if he had been there - if his presence had made the difference. Now, he faces losing his newest ship, and to his most hated nemesis - the Borg. We've scene from Family, I, Borg and Descent (as well as the Deep Space Nine pilot) how he feels about the Borg; how he feels personally defeated, violated by them, and now he faces losing his ship and most of his crew to that enemy; making it unthinkable to do so. The big criticism I would direct at this movie is the Borg Queen. A character introduced only because Studio Executives wanted to have a \"focal point for the villainy\". Well, you got one, and at the cost of making the Borg look ridiculous. The Borg don't have a single leader, we've been told that's why they're so efficient; a single leader would be liable to make mistakes. The Borg Queen was not in any way an embodiment of the Borg Collective, she was seductive, emotional and individualised. I wouldn't have minded if she was something along the lines of Locutus or Seven of Nine (when she was allowed to converse with the Voyager crew in Scorpion Parts 1 and 2). In all, Johnathan Frakes' first outing as a theatrical director is quite impressive, although the film is definitely lacking in its writing."
    },
    {
      "rating": "10",
      "text": "Alright when I heard there was gonna be a Star Trek movie about the Borg called First Contact I was dreading the thought that it might just be a movie remake of the episode where they had first contact with The Borg. I was relieved to find out this was not the case. Out of all the TNG movies, this is the only one I absolutely loved. The other three TNG movies were mediocre but this one was excellent. Maybe it was because this one was a really dark no BS movie that got to the point of the TNG crew having to confront and deal with their most menacing , dangerous and scary enemy. This movie is also friendly to people who might not be familiar with TNG or the Borg in that there is a human character introduced who also isn't familiar with them and Picard has to explain to her what is going on. While it gets TNG newbies up to speed it's done in a way that isn't cheesy and doesn't ruin the film for us Trekkies/Trekkers. SPOILER ALERT: I like the way this movie actually has Picard acting irrationally because he is psychologically scared from the time in the TV series when he was assimilated, it was realistic.\r Excellent movie, I wish all the TNG movies were this good. 10/10"
    },
    {
      "rating": "8",
      "text": "Granted this movie has allot of technical flaws that I'm sure the Trek-Elite will moan about, butI still enjoyed it. Great effects, great character development and a fantastic introduction to the Borg Queen, who i n my opinion was alittle odd considering the whole idea behind the Borg, yet I understand why she was created and approve.\r I got to say the whole timetravel angle has been done before, but at least it wasn't to the present (late 90s at the time.)\r Overall:\rI found this to be the most memorable and enjoyable of the series, but not as good as ST2."
    },
    {
      "rating": "3",
      "text": "This movie is mediocre. It's looks like it is not continuing to previous movie, and not what happened with the Borg in the TV show. Too bad their line if story is not consistent"
    },
    {
      "rating": "10",
      "text": "The best TNG movie. It uses two of the most interesting assets. The Borg and time travel. Also it explores Picards mental scars. I recommend you should have watched the TNG episodes “Q Who” and the two parter “The best of both Worlds”. All are truly excellent (or legendary?) 10/10 episodes and fan favourites. The Borg are the most dangerous and frightening enemy the Federation has ever encountered. It was a new and unique idea for the show and entered pop culture history. The dread is so serious. The Borg are a force that cannot be reasoned with and wont stop until you destroy them. Furthermore they will assimilate everything you have and use it against you (people, resources and technology). Then there is the legendary first contact. It is the starting point for the Federation. There is no weak point in the story. For the characters: You have Picard in one of his best performance. Behind his calm appearance you have a tortured man with scars on his soul that will never heal. Then you have Zefram Cochran. This is the result of heroes worship. The reality cant keep up with the legend that was created. A praiseworthy performance. While all characters deliver a good performance I want to praise especially Lily Sloane, Worf and Data. I must also praise Jonathon Frakes as director for his performance. Overall this is the best movie they did with TNG (by far) and a must see recommendation. Bonus knowledge 1: The Star Trek Destiny novels are a must read for fans. This time it is serious as the Borg see the Federation as treat after the destruction the Voyager crew did in the final episode (= Full scale Borg attack with all available assets!). It closes also all loopholes I am aware of and gives a fascinating origin and praiseworthy conclusion to the Borg. Bonus knowledge 2. There is the gardener theory. It says that the Borg attack in small forces (1 cube / ship) to advance the technological development. The final assimilation occurs only if the civilisation can keep up or they become to close to be a real threat."
    },
    {
      "rating": "10",
      "text": "The best Trek movie. Period. It includes the Borg. Time travel. New uniforms. New ship. And some of Patrick Stewart's finest acting. His Ahab moment is legendary. Worf's \"If you were any other man\" line is phenomenal. Nothing negative to say."
    },
    {
      "rating": "9",
      "text": "Easily the second best Star Trek film. First Contact balances its story, action, and characters beautifully. The story is very interesting, the crew of the Enterprise has to go back in time to stop the Borg from preventing First Contact. If I had one complaint about this movie it would be that Zephram Cochrane is kind of annoying at first. As I have already stated, the film handles its story, action, and characters beautifully. There's not a dull scene in the movie. It also has one of the best scenes in all of the Star Trek films when Lily and Picard argue over blowing up the Enterprise and he gives his fantastic we draw the line here speech. Overall, definitely the second best Star Trek, it just doesn't quite deserve that A+ and top spot. A"
    },
    {
      "rating": "7",
      "text": "This movie is the eighth of the franchise. It has two great points: the excellent performance of Patrick Stewart and an interesting and entertaining script that shows us how was the first contact of the human race with beings from another planet, as well as the way the Warp engine was invented. The film moves between drama and comedy in a very elegant and pleasant way, with some well-thought-out humor and excellent dramatic scenes. The use of good special effects and CGI brightened the movie without losing focus. There are many sci fi movies that get all the special effects available and forget the story, but that did not happen here. Stewart was exceptional, probably getting one of his best performances in the role of Captain Picard. James Cromwell gave birth to Warp's father, Zefram Cochran, who appears to be some sort of rebel and alcoholic scientist. I confess that I enjoyed the performance of the actor but, in fact, I couldn't like his character."
    },
    {
      "rating": "10",
      "text": "Awesome Sequel to Generations!its a Fun Adventure with Amazing action and thrills!the music was phenomenal,the story was brilliant,the visuals were stunning and the acting was great!the whole plot of time-travel just like 4th movie it was fun the crew's interactions in past and intense mission with awesome Borg's plot it was amazing!the starting scene of captain's dream and Borg's connection from past it was mind-blowing and the fight of Borg's in planet and the Enterprise rescue and win over Borg's resulting in Awesome plan of Borg's going in past it was amazing,there plan of wiping-out of humans and the stopping of Wrap speed discovery for Changing History and Future it was Mind-blowing,Then the Crew mission in past fighting against Borg's Intention saving Humans with-out altering present,the crew in Past there funny situations like the Deana's drunk over and the number 1's finding Doctor(Inventor of Wrap speed) then the whole plan reveal to him and the Crew's attempt to let things happen in same time as past it was adventurous the Crew's reaction to doctor as there idol it was funny and the doctor's reaction to Future Achievements of himself and he's trying to escape was fun to watch.the doctor's friend and Captain's relation was amazing the Dancing sequence while fighting Borg was awesome,the Borg's taking over whole Enterprise and there intro as a Zombie it was terrifying the Crew tackling Borg's and fighting was intense and the Crew members sacrifices were sad and the Data's whole story after that with Borg's leader was Brilliant.other side the cap and Klingon's upside down magnetic mission was intense and on the earth side the Doctor's ready to pilot ship it was amazing then literally the last 30 mins were Fun and awesome to watch,the Crew ready to Sacrifice Enterprise and Captain's reaction to it and the conversation it was strong and the Borg's and Data's Conversation it was cheesy although mind-blowing and the earth side the Warp speed mission in ship with awesomely hilarious actions of Doctor and the Captain's meet at last with Borg's leader and there past thing ended with Awesome Data's twist of being with Borg and his firing against Doctor's ship while in mission and sudden change of Data's true trick and last fight against Borg resulting in awesome end it was amazing and the ending with Alien ship landing after the Wrap speed mission on earth The Vulcan connection it was literally the incredible and satisfying End!Overall its a Edge-of-the-seat,adventurous,thrilling fun Movie with awesome action,Visuals and Music it's a brilliant sequel and A Masterpiece!"
    },
    {
      "rating": "7",
      "text": "among the top Star Trek motion pictures. The fact that the Borg were given a \"queen bee\" twist, in my opinion, rendered one of the greatest sci-fi foes of all time useless. Because of this, any Borg storylines that come after this film (Voyager) are also damaged. Beyond that significant issue that was incorporated to the Trek universe, the film was excellent on its own."
    }
  ],
  "recommendations": [
    "aliens",
    "star_trek_nemesis",
    "star_trek_insurrection",
    "star_trek_v_the_final_frontier",
    "star_trek_beyond",
    "star_trek_into_darkness",
    "independence_day",
    "star_trek_the_motion_picture",
    "star_trek",
    "alien_covenant",
    "stargate",
    "the_matrix_revolutions",
    "battle_los_angeles",
    "star_wars_episode_i_the_phantom_menace",
    "armageddon",
    "mortal_engines",
    "sunshine",
    "rogue_one_a_star_wars_story",
    "terminator_salvation",
    "reign_of_fire",
    "rise_of_the_planet_of_the_apes",
    "pitch_black",
    "prometheus",
    "the_matrix_reloaded",
    "star_wars_episode_ii_attack_of_the_clones"
  ]
}