{
  "id": 3580,
  "title": "Stardust",
  "starring": [
    "Claire Danes",
    "Charlie Cox"
  ],
  "runtime": 127,
  "genre": [
    "Adventure",
    "Fantasy",
    "Romance",
    "Family"
  ],
  "description": "In a countryside town bordering on a magical land, a young man makes a promise to his beloved that he'll retrieve a fallen star by venturing into the magical realm. His journey takes him into a world beyond his wildest dreams and reveals his true identity.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AsCrevARwF6eCrF2v8zpLdn0gth.jpg",
  "categories": {
    "plot": 7.730769230769231,
    "acting": 5.916666666666667,
    "ending": 8.0,
    "soundtrack": 6.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Favorite movie by far. There is a twist around every corner that makes you laugh or move to the edge of you seat. The kind of movie you could watch over, and over, and over."
    },
    {
      "rating": "10",
      "text": "What a treat! I walked into the theater expecting to see one of the worst movies of all time, but I was delighted to find that the movie was filled with stars who portrayed their roles perfectly, a wonderfully original, comical and surprisingly cohesive story.\r The story is an interesting mixture of the Chronicles of Narnia, The Lord of the Rings, Harry Potter, and Titanic, but it all comes together quite well to tell an adorable tale of adventure and love with a perfectly simple yet tear-jerking ending.\r The acting was marvelous. Michelle Pfeiffer and Robert De Niro were especially fun to watch, but every character shines at one point or another.\r I'm still a little confused because it was so perfectly random and unexpected, but it's one of the first movies I've seen in a long time where I haven't noticed or cared about the length. It's a legitimately fun move to watch and well worth seeing."
    },
    {
      "rating": "10",
      "text": "Best fantasy movie I've ever seen. Real fairy-tale with perfect music, characters and fascinating plot. You'll never regret watching this movie. 66 critics score is a  it's a 1010 movie."
    },
    {
      "rating": "10",
      "text": "My wife and I both loved this movie. What a fun fantasy romance."
    },
    {
      "rating": "10",
      "text": "Wonderfully entertaining, with a surprise turn by De Nero that had me rolling with laughter."
    },
    {
      "rating": "9",
      "text": "My children, my wife and I all loved it! \"PRINCESS BRIDE\" is a family favorite. Now we have another movie we can all watch over and over again and love it every time. PURE MAGIC!"
    },
    {
      "rating": "9",
      "text": "Anyone who loves magical, romantic, mystical movies should see this. This was well written and had an amazing cast. I originally rented it, but am now definately going to buy it."
    },
    {
      "rating": "10",
      "text": "Great movie. I knew nothing about it going in to watch it. I didn't remember seeing any previews for it which is sad because a lot of people will miss seeing this fantastic movie. One of the best movies of its type in many years."
    },
    {
      "rating": "10",
      "text": "Magical and romantic."
    },
    {
      "rating": "9",
      "text": "A light, but fun filled fantasy. Worth seeing at some point."
    },
    {
      "rating": "9",
      "text": "A lot of fun. I took my adult daughter who is a major Neil Gaiman fan, she rated it above \"The Princess Bride\". Michelle Pfieffer is a great evil witch. Much of it is derivative ( a nice way of saying stolen). I guess I have seen too many movies and read to much to not footnote everything."
    },
    {
      "rating": "10",
      "text": "It will be years before another fantasy as good as this one comes to the screen. Karger with Roeper said the plot is \"nearly impossible to describe\" and I agree. So that's a plus in my book. A truly good fantasy/magic movie has to be seen to be understood. Some comparison to the classic Princess Bride was made, and that's fair. Beats Harry Potter on several fronts, IMO. It also comes out as one of the best \"happy ending\" and \"feel good\" movies of the year. I suppose some folks can't relax, suspend judgment and just go with the fantasy and enjoy it but if the there's still a little kid inside you - MUST SEE."
    },
    {
      "rating": "10",
      "text": "An awesome film that makes you smile all the way through."
    },
    {
      "rating": "10",
      "text": "One of the most fantastic movies I have seen in the last five years."
    },
    {
      "rating": "9",
      "text": "Fantastic movie. The ideal setting to watch it would be with your girlfriend in an open air cinema, but even if you are solo in your parents basement its still a great film!"
    },
    {
      "rating": "10",
      "text": "Excellent movie throughout, filled with tiny things which complete a perfect film"
    },
    {
      "rating": "8",
      "text": "This film is lovely to look at, with lavish costumes and beautiful sets. The music is lovely too, with the beautiful Take That song over the end credits, and Ian McKellan lent his wonderfully distinguished voice to the narrator. Michelle Pfeiffer also is very good as Lamia, and Claire Danes is perfectly tolerable as the \"star\". I will say though that Charlie Cox was not entirely convincing at times as the hero, and the film is overlong. However, there are plenty of things to recommend it, particularly a chance to see Robert DeNiro in drag doing the can can. The direction, while not the best direction in existence, is competent, and does give some thrills here and there, like the princes who decide to kill each other. The script is quite witty, a little underdeveloped at times, but not that bad at all. In conclusion, an enjoyable film, not the best I've ever seen, but well worth watching. 8/10 Bethany Cox."
    },
    {
      "rating": "8",
      "text": "Magic, romance, hero, what can we expecting more from a movie like this one."
    },
    {
      "rating": "4",
      "text": "This is a real misfire. The script definately needed to be tightened, as the story just rambles along, and feels like the filmmakers are just throwing in anything that pops into their heads to fill time, until the climax. Danes and male lead are both bland, do little more then smile at each other as they walk through movie, and have no chemistry together. The male lead actually has a lot more chemistry with Sienna Miller than with Claire Danes, and thus you'd rather have him wind up with Danes. Consider that Danes is a star that fell to earth, no imagination went into her character, that makes her seem anything else but your standard helpless movie heroine, in need of rescuing. I was a big fan of all the Lord of the ring movies, all the Pirates of the Caribbean movies, and also a big fan of \"The princess bride\", \"Ladyhawke\", and \"Willow\". I was really disappointed by this one."
    },
    {
      "rating": "3",
      "text": "Yikes, this is really bad. Discerning viewers, don't trust the meta-scores on this one folks."
    },
    {
      "rating": "2",
      "text": "Put Pirates of the Caribbean, Harry Potter, Lord of the Rings and Basic Instinct together and mix it with 2 stars and lots of trumpets and horns and one should be able to get at least a decent movie, one thinks. Instead this movie is a real waste of time! Too bad for what could have been nice, really nice; if the director only would have had some individual personality."
    },
    {
      "rating": "2",
      "text": "If you want to see a good fantasy film go see Narnia or Bridge to Tarabithia.Both are excellent. This film is not in the same league-not even close. The story is unnecessarily long. The entire segment with Deniro is unnecessary, and why did he do this film anyway? Not Since Rocky and Bulwinkle has he laid such a egg!! The soundtrack wasn't memorable and it was way to loud , but that's the least of the weak points in this film. Bill C."
    },
    {
      "rating": "5",
      "text": "Entertaining movie but a little to sappy. yeah yeah love conquers all blah blah. De Niro's character adds much needed humor. The plot twist was very weak. This is a rental movie, watchable but don't waste your money on the theatres."
    },
    {
      "rating": "9",
      "text": "They need to start including Aaron Mesh's reviews."
    },
    {
      "rating": "1",
      "text": "After reading all of the great reviews, I was expecting this to be really good. It wasn't. It's way too long. The story is convoluted and forced. And I'm so tired of UK filmmakers subjecting American audiences to their narcissistic infatuation with royalty, blond-haired, blue-eyed princesses/queens and the sounds of their annoying accents. Speaking of annoying accents, I wish American actors would stop perpetuating this narcissism by proving to us all that they can do an English accent. Actually, the real reason I couldn't get into this movie is because I was constantly distracted by the sight of Claire Danes' huge schnoz peering out from between those curtains of bleach-blond locks."
    },
    {
      "rating": "8",
      "text": "On first glance, Stardust seems to be a rather indefinite story, poorly brought to light. Somehow its odd that the plot starts from a childish bet and ends in kingdom-ship. Yet if you look at the elements distinctively, the story brings many interesting and unique elements, like the binding chain, or the trans-morphing of stars into human aspects. The Background story of fight over the throne was a bit cruel and unpolished, yet the love story between Yvaine and Tristan was really interesting. It evolved from nothing to the consumption of their relationship in less than 2 days? That's odd even for a fantasy story. The thing which puzzles me is why take the effort to write (i mean the actual novelist) about kings and witches? It doesn't really fit in with the world conceived. Pirates, sky merchants... I guess the kingship is a little farfetched and doesn't really serve a purpose. If there was just the love story it would have absolved itself. But technically the movie has many pluses for use of original elements of fantasy, skillfully sown together with a dark wire. And yes indeed too many people dying, not enough positive motive to explain all the extreme acts of negativism."
    },
    {
      "rating": "10",
      "text": "Brilliant! Brilliant! Brilliant! Anyone who thinks differently clearly had their eyes shut or brain switched off. This is a family film with so much going for it. Magic, murder(s), comic mayhem, romance, fantasy, cross dressing pirates and some very good swordplay not to mention some very well done effects. Robert De Niro and Michele Pfeiffer were excellent as indeed was the whole cast, even that idiot Ricky Gervais (sorry can't stand the bloke) who thankfully had only a small part and suitable end. The sword fight at the end of the film is probably the finest sword fight I think I have ever seen in a film as well some of the best comedy fights which prospective viewers can find out for themselves. I only wish the score thing could move further to the right, because this film deserved it. To those who gave bad reviews, what can I say \"losers\" I think comes close."
    },
    {
      "rating": "1",
      "text": "The world that's created is nice to look at, but the stereotypical nature of the female roles,  and the clownlike portrayal of a gay man (by robert deniro!)  really took the magic out of the film for me.  In a modern fable is it still necessary  that the only women with power are evil witches, and that even a female 'star' seems to have no power on her own except to shine with love for a man?  Also, that the line of inheritance in a magical kingdom can only pass to a male heir, skipping a female heir who has suffered imprisonment for many years and only gets rewarded by being reunited with a guy who got her pregnant and left her many years ago?  And, seriously, Robert Deniro's performance was considered acceptable?? It's a shame for all the visual beauty and reasonable acting ( I have to say, not stellar) to be devalued by these outmoded concepts. I think we can do better than this."
    },
    {
      "rating": "3",
      "text": "Confusing and nonsensical. Stardust is one of the most chaotic pieces of fiction I've seen in recent memory. Many characters are pointless and do nothing for the plot, the only redeeming party is Michelle Pfeiffer's role in the film."
    },
    {
      "rating": "10",
      "text": "I thought this was a masterpiece, well cast, charming story (that flows beautifully) I can't believe that of could get bad reviews after trashy plots like pirates. Its just a romantic story in a magical world, great for kids and adults. don't miss it."
    },
    {
      "rating": "7",
      "text": "It was ok but my 9 yr. old sister had a lot of ?'s afterward i liked the scenery but to many people die."
    },
    {
      "rating": "9",
      "text": "The movie was great. It really mixed a lot of fantasy elements into a light fairy tale for adults. The cast was great and the story flowed well. What some found to be cluttered I felt added to the story and character development. Definitely worth watching."
    },
    {
      "rating": "9",
      "text": "Its a real sweet movie. It's just so lovable and kind. Its a movie that most people will feel a \"aww\" effect."
    },
    {
      "rating": "10",
      "text": "Highly entertaining escapism with great visuals and amusing characters. Watching Michelle Pfeifer morph into various incarnations of her character is worth the price of admission alone!"
    },
    {
      "rating": "7",
      "text": "A pretty good movie, it needed some more work on its story which is nothing but a star falling down to Earth, with two random people going beyond and realizing the importance of the star. That's not much, it should be more. But all in all, enjoy it, its a fun movie with stupid and badly charactered humor. But it has fantasy including adventure the same way the Harry Potter movies have. Maybe for those who didn't think Harry Potter 5 was a very good movie then I wouldn't suggest this and wait for the DVD. But seriously, I can't wait to see more reviews, because there are all kinds of things in this film."
    },
    {
      "rating": "7",
      "text": "I put off seeing this movie; it looked kind of sappy and silly to me. But a sentimental friend dragged me to the theater and I really enjoyed myself. Stardust is an unabashed fairy tale with a 21st century sensibility that keeps the story from feeling cliched and predictable. But in the end it's the tale of a boy and a girl, and the magical, mystical --and occasionally political -- forces that battle to push them together or pull them apart. A light, entertaining night at the movies."
    },
    {
      "rating": "8",
      "text": "Good solid family entertainment."
    },
    {
      "rating": "10",
      "text": "Great film..love it."
    },
    {
      "rating": "9",
      "text": "Back in 1987, while I was a university student, Imy roommates convinced me to go with them to see a movie premiere at the local cinema. It was for a new movie I'd heard nothing about called \"The Princess Bride\". I was amazed at how good PB was, and have always thought it was a unique and special movie. I'd heard that a new movie named 'Stardust' was a similar style to \"Princess Bride\". I thought, nah, \"Princess Bride\" is such a great classic movie that there's no way this 'Stardust' can compare. I watched 'Stardust' on Sunday night. Wow - it surprised me. It's actually a really good movie! Some parents might think that Stardust is a movie for children - it's not. The movie can be a bit dark and frightening at times. Overall, it's a wonderful soty with good acting, great special effects - and a charming love story. I highly recommend this movie!"
    },
    {
      "rating": "10",
      "text": "Finally a film comes along without the shackles of a Hollywood crusade. Long have I waited for something to simply exist simply because it can. No soapbox here, no platform for world changes or thinly veiled allegories to make us loathe the current fall of Rome"
    },
    {
      "rating": "10",
      "text": "I saw this movie last night and it was fantastic! It reminds me of the fantasy movies that were out in the 80's but with some oddly placed humor I wasn"
    },
    {
      "rating": "10",
      "text": "Easily the best film I've seen this year. VERY likable characters (Danes is easily the weakest actor, but she's passable), good music (though sometimes utterly stolen from films like Bram Stoker's Dracula), flat-out awesome set design and cinematography, and many interesting and complicated plot elements that ALL get gracefully resolved! (which is impressive, and appears to have been lost on many critics who I believe just have too short an attention span or lack of focus.)"
    },
    {
      "rating": "9",
      "text": "This movie is wonderful, a thoroughly entertaining work of escapism. It has something for everyone -- adventure, romance, humor, magic, fantasy, and, oh yeah, a unicorn. It may sound like a cliche fairy tale, but it's so well done that it works completely. I didn't find a moment of it slow or boring, as some users have said, I was enchanted from beginning to end. Nitpickers. Okay, I admit that I'm hopelessly in love with Claire Danes, but still, she's radiant in this film -- literally."
    },
    {
      "rating": "10",
      "text": "Instant classic! I recommend this movie to everyone I meet. It's a classic romance done in a nostalgic,magical way that I haven't seen reproduced since \"The Princess Bride\". It was wonderfully acted by veterans like DeNiro, Michelle Pfieffer, Peter O'Toole, and great new stars like Claire Danes and the beautiful Kate Magowen.(she is going to be big). Fantastic, 5 Stars, 2 Thumbs up!"
    },
    {
      "rating": "10",
      "text": "This is a very exciting movie, which takes you through pretty much non-stop adventure. I like the plot, how everything just falls together; as well as the comedy, with the spirits of the dead Princes tagging along the movie. The romance of the movie is very touching without being over bearing. I've been walking out of every movie for the last few months and this is the first movie I stayed and loved from the beginning till the end."
    },
    {
      "rating": "9",
      "text": "I was surprised - I quite liked it, a lot. It has many elements of many other fairy tale movies such as Shrek, but it all just worked really well together in this movie. This one, I'd pay movie theater prices to see again."
    },
    {
      "rating": "9",
      "text": "Hey, it might not be the smartest movie around, but if you believe, like I do that levity is harder to create that gravity, then you will enjoy it. In an industry that creates million dollar babies to pull your heart out and smash it with a hammer, this movie does something really worth your time and money, it leaves you light and refreshed and feeling like a kid again."
    },
    {
      "rating": "10",
      "text": "\"Laura W. gave it a10: A fabulous film with an amazing cast - it truly leaves you with a smile on your face and feeling better about the world!\" I wholeheartedly agree!"
    },
    {
      "rating": "9",
      "text": "Terrific film. I didn't think id like it from the very poorly put together tv adverts, however it was excellent from start to finish. Such fantastic ideas and a script that used such imagination is rare, its honestly one of few films you could recommend to anyone of any age group."
    },
    {
      "rating": "9",
      "text": "Delightful film. One that I can watch over and over again. And there are very few films that I can say that about."
    }
  ],
  "recommendations": [
    "the_princess_bride",
    "maleficent",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "onward",
    "maleficent_mistress_of_evil",
    "let_me_in",
    "snow_white_and_the_huntsman",
    "the_lake_house",
    "alice_in_wonderland",
    "ella_enchanted",
    "alice_through_the_looking_glass",
    "the_vow",
    "tomorrowland",
    "the_illusionist",
    "red_riding_hood",
    "ghostbusters",
    "the_lucky_one",
    "shazam",
    "last_christmas",
    "rise_of_the_guardians",
    "cruella",
    "super_8",
    "ghostbusters_afterlife",
    "pan",
    "peter_pan"
  ]
}