{"id": 617, "title": "State of Play", "starring": ["Russell Crowe", "Ben Affleck"], "runtime": 127, "genre": ["Thriller", "Drama", "Mystery"], "description": "When a congressional aide is killed, a Washington, D.C. journalist starts investigating the case involving the Representative, his old college friend.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4f8nhHESDhAVKow2M1khmqDdatp.jpg", "categories": {"plot": 6.555555555555555, "acting": 6.787878787878788, "ending": 5.7272727272727275, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 5.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "5", "text": "The tension in the newsroom in \"State of Play\" between the traditional print edition and the online-bottom-line present provides an interesting backdrop for this generally taut, well-directed drama, and the tantalizing suggestion of post-9/11 conspiracies within the government is potentially provocative. But, unfortunately, the film doesn't follow through on its promise, and the drama eventually devolves into a denouement that looks like it was fabricated by the \"Warren Commission\"-like agency in Alan Pakula's \"The Parallax View\". Also, having Ben Affleck's character's fling with an underage girl punished at the end doesn't work as well if Russell Crowe's character is implicitly hitting on a girl (Rachel McAdams) young enough to be his daughter. So much for high-mindedness."}, {"rating": "5", "text": "Ninety-five percent of this movie is a smart, engrossing, well-acted thriller. I wasn't crazy about how it was shot -- too much washed out color and hand-held camera for this type of story -- but the script was tight and the performances good. Then came the ending. Without giving away what happens, let me just say that it's hard to imagine how a film this big makes it through all the studio execs and test screenings without somebody realizing that the ending simply doesn't make sense. I spent a good amount of time trying to go back through the events and figure out how the various characters knew what they supposedly did, but it doesn't come together. Then I went online and found that it doesn't make sense to anyone else either. It's really too bad, because this could have been a great movie if they'd just left it alone. It didn't even need the extra twist which wound up killing the overall experience."}, {"rating": "7", "text": "Good film. Solid performance from Crowe. above aberage overall."}, {"rating": "10", "text": "The New York Post review was pure spittle.Really a zero? SOP is a well made ,well-acted movie ,which apparently made some points that rankled some reviewers.Snark on the internet is a chronic problem."}, {"rating": "9", "text": "Excellent thriller except for the very last twist, which seemed forced. Crow and Mirren shine as always. Affleck is OK."}, {"rating": "9", "text": "This film is based upon an intriguing story, it has a fascinating script, and some great acting performances. It is Ben Affleck's standout performance of his career, and one which shows he has finally stepped out of the whole 'Bennifer' & Gigi shadow. The more investigation is done by Russell Crowes character the deeper the mystery gets. The twists are amazing, but are nicely understated. 9/10 from me. I notice some of the weaker critics reviews are carried out by the bloggers that the film does have a sly dig at, by hinting, and then showing how they are not real journalists."}, {"rating": "9", "text": "Very good movie. Some incredible performances by Russel Crowe and Rachel McAdams, plus a complex and interesting story, make this one of the best movies of this genre i've seen."}, {"rating": "4", "text": "State of Play is a sloppy, incoherent thriller that's too long and seems to forget the fact the its playing to an audience, and rather just drones on."}, {"rating": "7", "text": "This was an intriguing political thriller. It's not the Oscar contender it could have been, but still worth seeing. Robin Wright Penn, Jason Bateman, and Rachel McAdams were the key navigators of the plot, and sometimes steal scenes from Mirren and Crowe, who are good as always. Affleck had a weird approach to his character, but is still believable. The twist was intelligent but the movie didn't build enough suspense to reach that twist effectively. This has a marvelous backstory which I want to give away but won't, and is also an example of cliches well-executed and excellent. That said, it could have used some more originality. Without the performances of Penn, Bateman, and McAdams, this probably would have gotten a 6."}, {"rating": "9", "text": "Excellent thriller, that's well acted and fairly easy to follow with quite a few twists and turns that will keep you till the end."}, {"rating": "7", "text": "Okay but lacked the punch that would have made it great. Great performances by Robin Wright and Jason Bateman."}, {"rating": "9", "text": "Fires on all cylinders until the last few minutes -- at which point a desire on the part of the filmmakers?/studio execs? to contrive a tidy ending, lets all of the air out of it. Having said that, this is a beautifully paced political thriller with terrific performances from everyone, and with dialogue that's right on the money."}, {"rating": "9", "text": "We saw this tonight and thought it was far better than the New York Times gave it credit for. Great performances and dark atmosphere; wonderful photography of iconic DC landmarks taken from angles that make them different from anything you've seen before. See it!"}, {"rating": "5", "text": "It's like they took the original mini-series and accidentally washed it in the pocket of a pair of jeans. Rachel McAdams is operating at her usual old-style-Hollywood level of charisma, but Russell Crowe plays Cal as a cartoon, not as a character. And it may be crass to speak thus of the Queen herself, but I liked Bill Nighey better when he was being played by Bill Nighey, not by a watered-down Helen Mirren. I guess you know you're in trouble when the most convincing acting in a film comes from Ben Affleck. Watch the original mini: this is nothing but Cliff's Notes by comparison."}, {"rating": "7", "text": "To underline the increasing irrelevance of the newspaper in our everyday lives, the filmmaker shrewdly undercuts Cal McAffrey's bloated sense of self-worth with editing choices which democratizes the working relationship that the seasoned reporter has with \"His Online Girl Friday\". In another era, when newspapers were thriving, this subdued scene would have been much ado about something. As Cal(Russell Crowe) pulls Della Frye(Rachel McAdams) out of a meeting, her online colleagues give her only a cursory look and continue forward with their conversations without the slightest notion of envy visible on their faces. By the standards of the past, Della, a blogger(an intern of sorts), is a proper journalist now, but as the cub reporter speaks to her experienced mentor, nobody behind the glassed-in conference room looks all that impressed. A lot has changed in the fifteen years since Ron Howard's \"The Paper\" was released into theaters. \"State of Play\" is a love letter to the newspaper industry, but if you read between the lines, it reads like a \"Dear John\" letter. Case and point: a veteran writer such as Cal, in all likelihood, would be hesitant to share his byline with a rookie, but \"State of Play\" has cheating on its mind. While it sings the praises of old school journalism, the film privileges the enemy, the blogger, by giving her more credit than she deserves. Cal doesn't give Della co-authorship on his article, \"State of Play\" does. Finally, when Cal leaves the newsroom, his triumphant walk pass the cubicles is spoiled, as Della hogs some of his spotlight, symbolically denying hard news journalists like Cal and his ilk, a graceful bow from the public sector."}, {"rating": "8", "text": "A surprising gem. Gripping, and a twisting plot that has you engaged the entire time. Better than I thought it would be!"}, {"rating": "8", "text": "Great political thriller! Keeps you glued to the edge of your seat. Acting was terrific, the plot ever twisting, camera and editing steady. The movie is very timely for it's comments on newspapers. We have relied on the better newspapers for in depth reporting. Will that be lost with profit driven chains and the dominance of the internet??? Would highly recommend the film."}, {"rating": "7", "text": "Maddening Movie Alert Ouch. This may be one of the most memorable cinematic shooting-yourself-in-the-foot exercises of all time !! Here is a powerful, savvy, entertaining and insightful film that is decidedly disturbing in the entirely believable and timely political material it presents"}, {"rating": "7", "text": "Fascinating and complex thriller, fine acting, excellent score. Suspenseful and it always holds your interest. The general plot isn't that original, but it's very well done."}, {"rating": "4", "text": "It's too long story... the twist is just predicted by half the film. The plot was to slow, no heart beating, no adrenaline paced. 2 hours of boring film, I almost sleep while seeing."}, {"rating": "5", "text": "\"State of Play' is an American adaptation of a BBC 6 hour mini-series. Hollywood should have left well enough alone. Although the performances of Crowe and Afleck are very good, This version of 'State of Play' is no 'All the President's Men' which it tries at times to emulate. The film unsuccessfully tries to be an adult political thriller. It fails miserably. There is enough of an interesting plot in tis verion that I want to watch the original BBC production. I can only hope that it does not have the same off-the-wall, illogical, and dumb ending, or if it does, that the explanation and logic behind the ending is more understandable than this lame thriller."}, {"rating": "4", "text": "Not a good movie, the story was ok, but the acting was horriable. Russell crowe and bEn should never ever ever do a movie again."}, {"rating": "10", "text": "I really enjoyed this movie. What a great pleasure to have a well acted and well written adult film."}, {"rating": "6", "text": "I thought that the plot should've created more tension and intrigue, but only found predictable scenes and near boredom. I Can't recall when I looked at my watch so many times during a movie."}, {"rating": "9", "text": "Good movie, worth seeing on the silver screen. Russell Crowe is awesome. This story was complex, but they pieced it together pretty darn well. MacAdams is good, too."}, {"rating": "10", "text": "Russell Crowe is on my Oscar-watch."}, {"rating": "6", "text": "A disapointment. Casting mistakes. See the orignal: the British TV show. American version might have been better if done in 6 episodes on cable network"}, {"rating": "7", "text": "I think it's gonna be great political thriller if still 'keep low'. State of Play deliver slow-paced, twist and well-acted but I think a little cliche."}, {"rating": "9", "text": "Sensational film based upon the BBC series of the same name. Russell Crowe is magnificent as journalist Cal McCaffrey while Ben Affleck is convincing as congressman Stephen Collins. The supporting cast are incredible also with Helen Mirren as a ruthless head editor and Rachel McAdams as rookie, up and coming Della Frye. State of Play focuses upon Stephen Collins (Affleck) a rising star of his political party until his lead researcher Sonya Baker is murdered. Her death leads to lies, conspiracies and secrets spilling out. Investigative journalist Cal McCaffrey is old friends with Collins and is handed the story by his ruthless editor Cameron (Helen Mirren) Cal and his partner Della find themselves involved in a cover-up that threatens to shake up America's power structure. They soon discover that with billions of dollars at state no ones life is ever safe. A very well written script by Billy Ray, directed brilliantly by Kevin McDonald State of Play is a political thriller you simply cannot afford to miss!"}, {"rating": "6", "text": "\"State Of Play\" one line review!Just saw \"State of Play\". Fairly slow, well acted, ok script. It was above average. Worth seeing, but probably forgettable in the long run."}, {"rating": "10", "text": "This movie is exceptional, and even with its crazy twists it manages to entertain and mystify for its entire running time.  The characters are amazingly acted, and most of them knock 'real' straight out of the ballpark, while Russell Crowe delivers an Oscar-worthy performance.  Well-written and executed on all fronts, State of Play is a movie I will definitely come back to time and time again."}, {"rating": "7", "text": "Pretty well-crafted and acted political-thriller with a familiar but gripping plot and Crowe in top form."}, {"rating": "6", "text": "A political thriller with all of the right needs: dependable leads (Russell Crowe, Rachel McAdams), an interesting script and taunting direction from Kevin Macdonald."}, {"rating": "8", "text": "I really liked this one. It was incredibly engaging and tense from the very beginning and kept you guessing, you never really knew what was coming around the corner. I really liked all the performances and the directing was incredibly well done and honestly, this is how a political thriller should be."}, {"rating": "8", "text": "With a tightly-wound story that never ceases its flow of intrigue, a delightfully passionate ensemble cast that impresses while it entertains, and a solid directorial foundation from Kevin Macdonald, \"State Of Play\" makes for a worthy addition to the \"journalism thriller\" sub-genre."}, {"rating": "10", "text": "Um filme dissidente,aquele tipo de filmes que precisamos mais, No cinema americano.Intrigas de estado já no início começa com grande suspense, três assassinatos dão início a uma investigação comandada por um jornalista Cal Macaffrey (Russel Crowe) que trabalha para um grande jornal, dois dos assassinatos possui ligações, um é um ladrão que roubou uma pasta com fotos um tanto esquisitas, a outra vítima a testemunha do assassinato. a terceira morte aparentemente sem ligação, envolve uma mulher que foi morta jogada num trilho de um metrô.Logo descobrem que a mulher jogada no trilho do metrô, trabalhava como consultora chefe de um caso movido pelo congressista Stephen Collins (Ben Affleck), velho amigo de Mcaffrey, tudo piora quando Collins por meio de uma declaração no congresso se emociona ao comentar a morte da sua consultora de caso, revelando-se que tinha relação com a mulher morta, No Jornal onde Mcaffrey trabalha as coisas começam a ficar difíceis a chefe do jornal (Helen Mirren) e principalmente a novata jornalista interpretada por (Rachel McAdams), fazem pressão ao amigo de trabalho Cal Mcaffrey por acharem que ele pretende ser parcial na investigação agora que seu velho amigo congressista é o principal suspeito, logo McAffrey descobre que o assassinato da amante e consultora de Collins era de alto interesse da empresa Pointcorp, empresa que collins e sua amante estava montando um caso contra, sobre enriquecimento ilícito com a guerra no Iraque, e a trama conspiratória parece não ter fim.Russel Crowe e Rachel McAdams com suas ótimas atuações conseguem elevar mais ainda a qualidade do filme, juntamente com um excelente e envolvente roteiro. Helen Mirren está fenomenal, Ben Affleck é convincente e incrível, Robin Wright é brilhante.Intriga de Estado é altamente recomendável para quem gosta de suspense e jornalismo investigativo e é claro um inteligente entretenimento."}, {"rating": "6", "text": "A good plot, even though not exactly original, with enough twists and turns to keep you watching without making your head spin. Based on a 5 hour BBC mini-series of the same name, and obviously having to omit a lot to condense into a film, you do not feel like there are unexplained aspects to the story by the end of it.\rKudos to all the actors involved. Crowe carries the film  a last minute replacement for Pitt, you get the feeling that this would have been an entirely different film if Pitt were involved. Crowe is excellent as the scruffy, truth-seeking newspaper journalist. McAdams puts on a good performance as the young, talented, somewhat naive and yet ballsy, eager-to-learn newspaper blogger. Mirren is, as always, a treat to watch. Bateman's performance as a bisexual, sleazy \"P.R\" man is amazing. Why, even Afflect, as congressman Collins, is surprisingly good in this film! I've heard various comments about his performance here, but honestly this was a difficult role to play (many emotional aspects) and he delivered.\rThe pace of the movie was just right, up to the last minute, where the climatic ending you were probably waiting for never comes, and everything wraps up in a rather anti-climatic way. Still, Crowe typing away as the whole newsroom peer over his head, seems like a befitting ending. The truth has been told. Now it's up to the public to read about, in what appears to be the dying age of the newspaper."}, {"rating": "7", "text": "State of Play is a fresh concept.\rThe acting is decent, but the script is exceptional. Well paced, well directed and extremely entertaining. The characters are all humanized with their own personalities, and flaws making them all feel real. A very good thriller, a few plot holes here and there, but nothing easily noticeable."}, {"rating": "6", "text": "State of Play: 6 out of 10: State of Play is two hour plus big budget thriller without one memorable scene and only one memorable performance. The memorable performance is Helen Mirren who brightens up the screen whenever she appears. The rest of the performances are more stereotypes than individual characters.\r Russell Crowe plays a reporter for a Washington Post stand-in. He looks and act like the stereotypical beat reporter. His best friend is Congressman Ben Affleck who is your standard movie congressional representative (Noble but battling demons.) He is caught in an affair with a now dead staffer and his best friend is on the case. Tagging along with Crowe is neophyte cub reporter Rachel McAdams who Jimmy Olsens it up despite the fact she is a lead blogger at a major national newspaper. Robin Wright Penn plays Affleck’s cuckolded wife and seems to be in a different movie than the rest of the cast.\r Mirren is the newspapers publisher and gets the films best lines, which she dishes, with aplomb. Everyone else seems to be playing along at half speed. For a thriller there is a strange lack of action or tension. The twists seemed preordained and the characters behave exactly as they are programmed.\r The film certainly has star power and a big budget but it simply does not seem to know what to do with it. Part of the problem is that it is condensed from a 2003 British mini-series of the same name. Condensing the 300 minutes of plot into 120 or so minutes leaves little room for character development or nuance. The players seem to be quickly checking of plot boxes.\r The films other big problem is that it is a overwrought love letter to the newspaper business, including groan worthy dialogue about the magnanimous printed fourth estate and an end title sequence that can only be described as porn for publishers.\r Somewhat entertaining and yet eminently forgettable State of Play is worth a look. Just do not expect that good a time."}, {"rating": "10", "text": ".........................................................................................................................................Russell Crowe killed with a great performance"}, {"rating": "8", "text": "Something that we must give thanks is that a story of who did it was given a suspenseful structure that, as spectators, keeps us in suspense for two hours, despite the long sequences of dialogues. Each actor and actress did their homework well and they leave a good taste in our mouths."}, {"rating": "3", "text": "A slow and boring movie. Russell Crowe's performance is the only redeeming thing about it."}], "recommendations": ["breach", "all_the_money_in_the_world", "primal_fear", "money_monster", "a_most_wanted_man", "widows", "knives_out", "arbitrage", "inside_man", "body_of_lies", "insomnia", "broken_city", "american_hustle", "triple_9", "conspiracy_theory", "the_score", "the_lincoln_lawyer", "morgan", "casino", "american_gangster", "catch_me_if_you_can", "murder_on_the_orient_express", "the_little_things", "suburbicon", "the_iceman"]}