{"id": 4373, "title": "Stay Alive", "starring": ["Jon Foster", "Samaire Armstrong"], "runtime": 85, "genre": ["Horror", "Thriller"], "description": "After the mysterious, brutal death of an old friend, a group of teenagers find themselves in possession of \"Stay Alive,\" an ultra-realistic 3-D videogame based on the spine-chilling true story of a 17th century noblewoman, known as \"The Blood Countess.\" The gamers don't know anything about the game other than they're not supposed to have it... and they're dying to play it. Not able to resist temptation, the kids begin to play the grisly game but soon make a chilling connection -- they are each being murdered one-by-one in the same way as the characters they played in the game. As the line between the game world and the real world disappears, the teens must find a way to defeat the vicious and merciless Blood Countess, all the while trying to... stay alive.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/hsSJwroE7jugEROB8tmyxJP91Ho.jpg", "categories": {"plot": 4.894736842105263, "acting": 3.411764705882353, "ending": 4.2, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 3.3333333333333335, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "I think people that gave negative review did not understand the originality of the film. To me, Stay Alive is one of the best psicological horror I have ever seen..."}, {"rating": "10", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "10", "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%#$%#$%@##%@#%$#@%$#@#$%%$#@%$$#%$#@%$%$#@%$#@%$#@%$@#%$#@%$#@%÷%÷%÷%"}, {"rating": "10", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "7", "text": "The movie is great, is not the best horror movie, but it's very entertaining and original."}, {"rating": "1", "text": "An unforgettably and unforgivably terrible film. It is completely laughable, and is a pathetic horror turn with a dimwitted plot, terrible acting and irritating direction."}, {"rating": "3", "text": "Stay Alive did a better job then I thought it would but it left a whole lot of questions. One being why in the heck did an evil ghost woman come back in the form of a video game to kill people? This is never even addressed apparently she just looked down from her tower and said \"well all the young kids are into the videa games I guess thats as good a way to kill them as any\" The other thing is at the end how the game imitates real life. I just can't believe malcom in the middle drops a crow bar in the game and it appears in life. Another problem with the movie is who the hell named these people? With great names like Hutch, October, Swink and Phineus. This group of friends had the worst parents ever. Another issue was the romance between Abby and Hutch. It seemed very forced and really stupid. The last problem was after the characters figured out that if they die in the game they die in real life they make the logical choice to just stop playing the game. So the movie comes out and just says \"no, you stop I will just play for you. Yeah that will work\" Through out the movie it seemed very forced and just hard to believe. Not the worst horror movie around but there are far better options out there to watch instead."}, {"rating": "5", "text": "Stay Alive was decent, it was a unique story but still fairly predictable. It lacked a lot of the eye candy and cheesy jokes you expect in this type of film. I think the director was expecting people to take this seriously, but it's far from being the exorcist."}, {"rating": "0", "text": "Inept on almost every level. Only the weakest of minds will find this tripe entertaining."}, {"rating": "6", "text": "The acting was not that bad and the original concept was interesting.The lack of blood and the fact that the movie is pretty boring at times just drag that movie down more than it should.Overall, it's a friday night movie to watch with friends and with low expectations."}, {"rating": "1", "text": "Boring, actors are bad choosen. You Can see the ending already at the beginning."}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●●⊙●⊙●⊙●⊙●⊙●⊙●⊙●⊙●⊙+*+*+*+*+*+*+*+*+*+"}, {"rating": "3", "text": "Laughably bad. The acting was some of the worst I've seen in a long time. I really want to know did the research for this movie because even some of the facts are blatantly wrong. For example, the movie uses the story of Elizabeth Bathory, who was a real Hungarian countess that lived from 1560-1614, as its backdrop but the movie is set in New Orleans? It just doesn't make any sense. New Orleans wasn't even around back in that time period, the United States had yet to become a country even."}, {"rating": "0", "text": "This is by far the worst film I've seen this year. It's about as stereo-typical as a horror film can get. Cheap animation, some really bad special effects, and you'll never be surprised due to the fact it's so by-the-book. Other ways this movie fails is that quite a few scenes are purely for in-movie-advertisement; other times you can see the actors/movie maker equipment in the scene. It also fails at making the video game actually appear presentable with any connections to real life video games. Instead it's just one big cheap animation-athon. It also makes some very stereo-typical references to video game \"nude codes"}, {"rating": "0", "text": "This movie was so bad you'd think it was a Uwe Boll movie, but it didn't have \"needlessly added car chases\". Even so it is just as laughably bad as one."}, {"rating": "0", "text": "Um...so i was unfortunate enough to sit through a screening of this garbage...and i really wish i had been in a position to leave...but was an unwilling guest of someone involved in this (so-called) production. i swear there must be some form of nepotism involved here, because i am pretty sure the \"movie\" my friends and i made in 8th grade and edited between a pair of VHS decks far outclassed stay alive in writing, production value, acting and certainly in direction and effects. it is no wonder these guys have never been involved in a movie before (pa on payback does not really count) and i pray they are never involved again... so back to the nepotism thing...that can be the only possible way that the writers of this horrible excuse for entertainment could have gotten this project off the ground... in summary...please stay home and just watch a Lifetime Movie of the Week...i guarantee it will be less expensive and certainly scarier. or i can send you a copy of \"My Housekeeper is a Ninja\" its a cult classic from 8th grade."}, {"rating": "3", "text": "People who gave this movie 8 and up must be getting paid. seriously. it sucks. read w00f w00f's review, he nails it right on the head."}, {"rating": "3", "text": "Slightly interesting...very bad though."}, {"rating": "6", "text": "Okay, so it wasn't very good, but I didn't hate it either. Although, I would have loved to have been able to kill Frankie Munoz's character myself. Talk about irritating. Although, there is one excellent line he gives (hint: he's using a gaming glove). Anyway, I would give this one the benefit of the doubt. But I have to wonder: in this era of production synergy, where is the game to tie in to this movie? I have a feeling the game would be more fun to play than having to sit through the inevitable sequel."}, {"rating": "1", "text": "[***SPOILERS***] If you've seen the television ads for this dreadful flick, you've already seen the best it has to offer. Don't waste your money on the price of a ticket. \"Stay Alive\" is poor film making at its worst. We're talking about one scene in which a boom mike is visible, and another in which a profile shot of an actress reveals a large orange object (an earplug, I think) in her left ear. It's THAT kind of bad. It's the kind of bad film making in which characters have knowledge of conversations that took place while they were elsewhere. Phineas, for instance, has been out driving while the rest of the cast has been talking about how people are dying when they die in \"the game,\" yet when he receives a call on his cell phone responds that he'll be alright because \"That's right! I haven't died in the game!\" It's the kind of bad film making that puts a notorious Elizabethan-era mass murderer (Elizabeth Bathory) in New Orleans and changes the name of a very famous book about witch hunting, \"Maleus Malificarum,\" to \"Maleus Demonium\" but forgets to change the title of the book that a character is holding in her hands WHILE she is telling someone else about the contents of the book. It's the kind of bad film making wherein the performances are so paper-thin that, clearly, if this were bad in any sort of memorable way (instead of merely being sloppy and formulaic), Frankie Muniz would surely be up for a Razzie for his stilted, twitchy, downright annoying performance. It's the kind of bad that has the main weapons of the oh-so-horrible ghostly antagonist turn out to be a pair of scissors and a horse-drawn carriage that can be vaporized by throwing a rose at it. It's the kind of bad that has a main character suddenly blurt out her entire life story while riding in a van with no apparent provocation, and her story has absolutely no connection to anything in the rest of the movie at all. None. WHY? Clearly, the writers were unable to string together anything coherent here. To make matters worse, the film takes itself seriously yet fails utterly to deliver on the gore. There isn't a single good scare in the film; it's all hand-on-the-shoulder, bump-in-the-night stuff here. In fact, we never really see a death scene other than one or two knife strokes. Most of the time, the lights go out, there's a scream, and suddenly another one's bit the dust. Either that or a quick cutaway. Truly gutless stuff here. No doubt the producers realized that nobody over the age of 14 would buy into this pablum and decided to go after a PG-13 rating. I've heard stories told around campfires that were ten times as scary as this mess. Even the special effects look cartoonish, and real video games have better graphics than most of what we see in \"Stay Alive.\" \"Stay Alive\" is bad in every conceivable way. The patently predictable ending of this lurching wreck of a movie leaves open the possibility of a sequel, of course. I doubt there will be one, though, because I can't imagine anyone wanting to sit through another two hours of something as bad as this. We're talking \"Darkness Falls\" and \"Fear Dot Com\" bad stuff here. Save your money. The most frightening thing about \"Stay Alive\" is the price of admission."}, {"rating": "10", "text": "Call me crazy but I loved this movie! I can't believe all of the negative reviews it's recieved. I saw it with four friends who loved it as well. It was very terrifying at times (scored a few screams in the theater), but also very funny. The characters were amazing, as was the acting, especially Sophia Bush as October. The death scenes were not very bloody (the whole film was cut down to avoid an R rating, so I'm looking forward to the original director's cut on DVD), but they were creepy enough to give you chills. You'll never look at video games the same way again. So \"Stay Alive\" definitely gets a 10/10 from me."}, {"rating": "8", "text": "This movie was really good. It made me jump a few times in my seat, and I also love how it was based on a real pesron. Making it more scary than it would be if it was based on someone from the writers own imagenations. Having it based on the real Elizabeth Bathory had made it more creepy because you realize that there was a real person that would really do all the things in this movie. This movie was really good it will really creep you out if you see it."}, {"rating": "8", "text": "One of the best horror movies I have seen this year. Considering what has come out in the past including House of Wax and the Amittyville Horror, this movie has a stable plot with generally good acting. It was suspensful and, if not somewhat overdone, origional plot using Elizabeth Bathory. The use of history was very unique and actually fairly accurate with the exception of being set in New Orleans. If you are looking for a movie that makes you jump and outlines the life of the \"female Dracula\" than Stay Alive is the movie to watch."}, {"rating": "7", "text": "I really, really liked this movie. It was fun! The acting was much better than recent \"horror\" flicks, and the storyline, though cliched, kept my interest. I loved the references to games like fatal frame and silent hill. And the game in the movie actually looked like a game i would want to play, which has never been done before in the history of movies involving games. Most of the scares in the movie are bump-in-the-night, cheap-jump moments and i would have liked more gore, but overall it was acceptable. Most horror movies of late have totally sucked, and it's nice to see one that entertained me."}, {"rating": "10", "text": "I think as a gamer it was good because it was creepy,and horrorfining. They should make a part 2 and it should be rated R. Me and my friends think there should be a video game for the playstation 3 because it would be a very good game!!!!"}, {"rating": "0", "text": "My girlfriend rented this discount movie at blockbuster, and omfg what a total pile of inept trash. Anyone who finds this movie even remotely good must be mentally retarded."}, {"rating": "1", "text": "OK, if you've seen the previews last year that's all there is to this movie. Once one guy is dead you know what's going to happen to every guy. Even i knew the solution to this problem before they did. Everything was easy and predictable. The Countess looked fake and actually kind of comical. There was little suspense and we only get brief glimpses of blood and gore. Instead of scaring me to death this movie made me laugh."}, {"rating": "0", "text": "This movie was so bad, it almost reminded me of the movie Hackers. I walked out of it half way through, because of the sheer overwhelming scent of crap eminating from the celluloid. The only character that was any good got killed off within the first twenty minutes. Not even a good shocker scene could be pulled off, and the strange unreality of the appearance of the hardcore gamers, i.e., why such attractive people, real gamers have pot bellies and enormous bifocals. Goth kids will be raving about this. If you see them, please hit them in the mouth with a brick covered in shards of glass, stuck together with anthrax. Actors please go back to your respective TV shows, we do not want you. Big thanks to William Brent Bell, simultaneously ruining a very good first name and taking a nice heaving dump all over movies."}, {"rating": "8", "text": "This movie was a WOW!! it is so scary and the point isn't very gray like i seen in a lot of horror movies! it has good acting...good script..the only thing that i didn't like so much was, the camera angles...they were difficult to see everything at once but w/e. You will get chills for ever if u c this movie."}, {"rating": "10", "text": "This movie was pretty scary and in my opinion very good."}, {"rating": "4", "text": "Meh...boring and unscary...an R rated version would have been better."}, {"rating": "10", "text": "Loved it. Suspense and horror, nice plot. Waitin' for DVD."}, {"rating": "10", "text": "One of the best movie's I'v ever seen. For those who think the movie was a total waste of time, you are way off. You'r just mad because you can't make a movie."}, {"rating": "10", "text": "This Is One Tense, Creepy, Atmospheric Gaming Movie. It's Like Brainscan Meets Silent Hill Coming Together In A Very Enjoyable (And Creepy) Way!I am a fan of horror. In these later years, there has been a proliferation of bad horror movies on the market. Most begin with four or five kids, heading to a remote location for a weekend, they are stalked by whatever antagonist, and all die but one or two of them. Voilas, there is the rote formula for nearly all your B-class horrors of the last two decades.This one starts out with six or so kids, and therefore, I was expecting nothing whatsoever in the way of innovation or fun. I thought I would be writing a different kind of review than the one I am currently writing.While the premise used in Stay Alive is nothing new, it feels a bit like the original Saw in its atmosphere, without plodding. It feels a lot like Brainscan in its realism, without coming off campy. But more importantly, it feels quite a bit like Silent Hill in its atmosphere, without leading us into the pseudo-religious, dogma-filled prattlings.In essence? This was one creepy little film, if you can allow yourself to become involved in the story, that is. But you must suspend disbelief in order to let yourself be drawn into most any cinematic work.Above the atmosphere, which is the real star of the work, the story itself is quite compelling. Beyond the premise, which HAS been done before, the plot itself is pretty fresh, and goes a long way towards preventing this work from feeling rehashed, recycled, or otherwise done and done.I have to say that I enjoy this venture to the fullest. It has some VERY tense moments, features some great (although wholly goreless and pretty much bloodless) kills, and delivers a fine execution of the concept."}, {"rating": "8", "text": "Swink: I just figured out how to strip one of those zombie concubines naked. Phineus: How do you do it? Swink: Up, up, down, down, left, right, left, right, B, A.Stay Alive is an immersive film, with a terrific concept.The film accomplishes what it's trying to do, as it gets you invested, but it falls away late with an unrewarding conclusion. Could be better if they were to go back into the game as a group, after Phineus died. The cops should of been involved somehow at the end also, as these deaths aren't going to be dismissed. I like the characters, but unfortunately the more enjoyable personalities are the ones that die. Samaire Armstrong, who was exceptional in her one time appearance on the \"X-Files - Lord of the Flies,\" isn't given much to work with here and is just sorta there. I thought her character might of been involved somehow, since she remains at the end and still underwritten."}, {"rating": "8", "text": "A killer of a video game.This thriller will raise the hair on the back of your neck. Thrills and chills will frost your blood. Following the brutal death of an old friend, a group of teen friends are in possession of a video game that has yet been allowed for public participation. \"Stay Alive\" is a video game based on the true story of a 17th-century plantation dweller known as \"The Blood Countess\". Horror arrives almost from the get-go when the group actually become characters in the game and the way they meet their deaths in the game is how they meet death in the real world. But how in the hell do you survive this game?Participating are: Jon Foster, Sophia Bush, Frankie Muni, Samarie Armstrong, April Wood, Jimmi Simpson and Wendell Pierce. I originally thought I wasn't going to like this movie; but the suspense, very disturbing images, brief sex and horrific violence changed my mind. You may not like STAY ALIVE, but I sure did."}], "recommendations": ["unfriended", "would_you_rather", "slender_man", "chernobyl_diaries", "the_curse_of_la_llorona", "paranormal_activity_4", "the_ring_two", "silent_hill_revelation_3d", "paranormal_activity_the_marked_ones", "the_devil_inside", "unfriended_dark_web", "the_haunting_in_connecticut", "silent_hill", "paranormal_activity_2", "ouija", "rings", "the_bye_bye_man", "the_eye", "texas_chainsaw_3d", "dead_silence", "brightburn", "wish_upon", "the_blair_witch_project", "devil", "shut_in"]}