{
  "id": 2790,
  "title": "Step Brothers",
  "starring": [
    "Will Ferrell",
    "John C. Reilly"
  ],
  "runtime": 98,
  "genre": [
    "Comedy"
  ],
  "description": "Brennan Huff and Dale Doback might be grown men. But that doesn't stop them from living at home and turning into jealous, competitive stepbrothers when their single parents marry. Brennan's constant competition with Dale strains his mom's marriage to Dale's dad, leaving everyone to wonder whether they'll ever see eye to eye.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jV0eDViuTRf9cmj4H0JNvbvaNbR.jpg",
  "categories": {
    "plot": 6.461538461538462,
    "acting": 6.6,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Truly terrible. Shockingly bad. Horrifically unfunny, with rare exceptions. Also, surprisingly mean-spiried, nasty, and \"woman-hating\" (and I'm a man saying this, not a reactionary hyper-feminist). Vulgar without being funny, which is the worst sin a comedy can commit. I've really enjoyed both lead actors' work in the past, so the awfulness of this was a real shock. 98 minutes of your life that you will never get back, and will regret having spent with this atrocity. I would award negative stars if that were possible."
    },
    {
      "rating": "9",
      "text": "Very Good Movie. I Like The Part where brennan goes at dales drumset. Will Ferrel is always funny, every quote is funny. I usually laugh at the F word in this movie."
    },
    {
      "rating": "8",
      "text": "Step Brothers is a hilarious movie, Will Ferrell's first really funny movie since Talladega Nights, this is a movie I would recommend for more mature (or rather older) audiences, do to language and sex jokes, but it's a great movie, if you like Ferrell or Reilly you'll like this movie."
    },
    {
      "rating": "10",
      "text": "Will Ferrel and John C. Riley are a great comedy team yet again in this movie about 2 grown men in their 40s without jobs, and still living at home. When Their single parents meet at a conference and then they marry making the two men in their 40s's lives a living hell"
    },
    {
      "rating": "8",
      "text": "Sure its pretty immature but its a fantastic comedy because its insanely funny. The script is only sometimes faulty but overall a sausagefest for the ages."
    },
    {
      "rating": "10",
      "text": "Honestly, this movie doesn't have that great of a plot, or production. It's so silly and immature that it is somehow funny, I really don't know why I love this movie so much. I feel the reason that I have watched it so much really lies with how the characters and actors portray themselves. It is such a stupid movie that I can quote it around people and they will almost instantly know what I am talking about and that's why I love it. I can bring it up around people and we can laugh about it without even watching the movie. A lot of people haven't even seen the movie but they still know the quotes and that's why it is one of my all time favorite movies. Yes it is stupid and honestly not that great production wise, but the quotes make it worth the while."
    },
    {
      "rating": "8",
      "text": "Step Brother continues to be just as funny now as it was when it was released. I know its not a movies for everyone because it does have some pretty stupid humour but I'm a sucker for that stuff. This is one of the many Will Ferrell classics that have been released in the past 15 years. John C. Reilly is great beside him as he is equally as funny. It would be nice to see these two share a lead again (they were great together in Talladega Nights as well. Adam Scott is great as Ferrell's douchebag brother its a role that I wasn't expecting from him after watching him in Parks and Recreation but it suits him. Anyone who loves a good laugh will love Step Brothers."
    },
    {
      "rating": "10",
      "text": "One of the funniest movies I have seen, top 5 comedy all time for sure....."
    },
    {
      "rating": "10",
      "text": "I own very few movies, but I do own Step Brothers on DVD.  For my money, it doesn't get better than Step Brothers.  The characters are extremely over-the-top, the plot is hilarious and the jokes never stop.  From the opening credits to the final scene, this movie delivers the funny.  You can't expect any high-brow humor here.  But the cursing, potty humor,   clever plot twists, obscure references and subtle comedy is by far one of my favorite movies.  It's full of one-liners that you feel compelled to imitate.  As a side note, the DVD has great extra features.  If you get a chance, listen to the commentary.  It's just as funny as the movie itself.  Best: John C. Reilly and Will Ferrell's AWESOME comedic chemistry.Worst: No sequel."
    },
    {
      "rating": "6",
      "text": "The movie might lose its focus in the second half, but the whole thing has that crude charm that only Will Ferrell and John C. Reilly together can give us."
    },
    {
      "rating": "1",
      "text": "If it weren't for \"Disaster Movie\", this would probably be the worst comedy of the year. When you are happy to see Seth Rogen in a WILL FARRELL movie, you know the times have changed. There's such a thing as dumb comedy done right (Dumb and Dumber, Old School), and then there's such a thing as dumb comedy that's just plain dumb (i.e. a complete and utter absence of wit or creativity). There was hardly anything to appreciate at all in this movie. You can thank Horatio Sanz (!) for me not giving this film a zero, as his two-minute screen time as the singer in a 80's-only Billy Joel cover band was the only piece of inspired comedy in the entire movie. Piano Man!"
    },
    {
      "rating": "10",
      "text": "One of the funniest movies I have ever seen, it gets funnier each time I watch it. Also, all the one-liners in this movie are great, way too funny."
    },
    {
      "rating": "3",
      "text": "Watched this  for the first time ever, and to be honest I don't see what everyone found so funny about it. I rarely laughed. The writing was very poor and so where the characters. It was crude but unfunny. One of Will Ferrell's worst films."
    },
    {
      "rating": "10",
      "text": "Funniest movie I have ever seen, my favorite movie for decades to come. Whoever trah talks this movie can kiss my a**."
    },
    {
      "rating": "4",
      "text": "Really dumb and silly comedy, Will Farrell is still playing the same one note character he always plays. At least there is Richard Jenkins and Mary Steenburgen, they are terrific. Only occasionally amusing."
    },
    {
      "rating": "3",
      "text": "This movie misses more than it hits th funny bone. Too much way-over-the-top stupidity and swearing spoil what might have been a goofy masterpiece."
    },
    {
      "rating": "7",
      "text": "Step Brothers is another really funny comedy from McKay & Ferrell. It doesn't quite hit the same highs as Anchorman or Talladega Nights, but there is more than enough belly laughs to see the movie through and the chemistry between Ferrell and John C. Reilly is still incredible."
    },
    {
      "rating": "3",
      "text": "What might one expect from the combination of Will Ferell and John C Reilly? They gave us that inane Nascar race flick, so we should know well just what exactly their product would be. I do like their daring and resourcefulness though - in a time of serious, realistic movies, they dare producing something so inane and ludicruously and purposely-funny and yet, they turn in performances that are just right for their parts. The movie's theme might be a bit too unusual, but both Ferell and Reilly are perfect in their depictions. I do wonder - if a 40-year-old man WERE unemployed and staying home with their parents, would they also be as child-like and immature like these two? Or is it just a comedy no-brains flick that Ferell and Reilly would have us believe?? I would like to hope that there is a social message here somewhere, but of course, if they had acted like grownups, that might have totally ruined it! Robert Jenkins and Mary Steenburgen are good together, but at times, I really cringed at how low Jenkins might stoop to - his character is empty and has absolutely no substance. I do feel for Steenburgen, her empathy for her two sons, her moving-on-with-what-my-life-really-is countenance is impressive. But obviously, if the perfect ending hadn't happened, if Jenkins and Steenburgen's characters hadn't got back together again, and the elder brother, Derek, hadn't piped down, it wouldn't have been a comedy flick, would it? Seriously, Ferell's testicle-scene was the last straw - it was totally unnecessary and absolutely disgusting. But then again, what reason and logic do we expect from Ferell anymore? I'd go with his Megamind depiction anyday than this disgust of a movie! This doesn't mean that he's not funny, he is, but at times, he can just be too uncontrollable and too inane. If only Ferell-Reilly could come up with a serious, mature subject and show their true talents, I'd be delighted!"
    },
    {
      "rating": "2",
      "text": "Horrible. Is one of many negative things I could say about this movie. I probably laughed once or twice, and I don't even remember when that was. That's how forgettable this movie is or unforgivable considering Will Ferrell and John C. Reilly star in this piece of crap. The f word can be funny in a lot of instances, but this movie finds a way to make it offensive to EVERYBODY. Good job guys way to make this movie fun for nobody. The story, the acting, and the humor is all wrong. I was excited to see this film for the stupidity and escapism, but I feel cheated. Anybody can act like a child, so who really wants to see somebody else do it?"
    },
    {
      "rating": "6",
      "text": "Going into this film as NOT the biggest Will Ferrell fan and only lukewarm to past performances of John C. Reilly, I had average expectations of how this film would turn out. Needless to say, I was decently surprised of how bad it didn't turn out. Sure, it wasn't a comedic blockbuster but it did produce some laugh out loud moments which had me chuckling. However, it should be noted that the two standout performances (in my opinion) were that of Adam Scott as the egotistical younger brother and his suffering wife played by Kathryn Hahn."
    },
    {
      "rating": "7",
      "text": "Step Brothers isn't the funniest Will Ferrell movie but it's such an enjoyable viewing experience because the chemistry between he and John C. Reilly is great. The amount of epic one-liners in this film alone make it worth watching. Is the plot ridiculous? Is the acting over the top? Is it crude and offensive? Yes, yes, and hell yes but that's Will Ferrell. It isn't his best movie but it's still a must see for Ferrell fans."
    },
    {
      "rating": "7",
      "text": "While it does fad quite a bit through out the last 30 mins of the movie, Its still hilarious and well worth the watch. Reily and Ferrell are an amazing comedy duo."
    },
    {
      "rating": "2",
      "text": "Aggressively unfunny, Step Brothers seems to think that the only way to make people laugh is through jokes that were only kind of funny in the third grade. Unfortunately, this line of thinking is severely misguided and it makes the film almost unbearable to watch at times. After an hour and a half of nothing but things that were supposed to be funny, but were not, it was refreshing to see the ending, which actually was kind of funny and oddly touching. It ultimately left a good taste in my mouth as this one ended, which is why I was less harsh than I thought I would be. In addition, Will Ferrell and John C. Reilly, did have some good chemistry and were well-matched. Unfortunately, they were let down by a horrible script and tasteless joke after tasteless joke. Damn shame, really."
    },
    {
      "rating": "7",
      "text": "Will Ferrell and John C. Reilly are enjoyably idiotic in \"Step Brothers,\" Adam McKay's absurdist love letter to the American family dynamic and what it means to be a child."
    },
    {
      "rating": "2",
      "text": "Too much (stupid) over-the-top humor for me to bear. The cast really gives it their all here, and it shows; Ferrell and Reilly are alarmingly convincing, and there are a couple of good laughs, but for the most part, Step Brothers is almost unbearable to watch."
    },
    {
      "rating": "5",
      "text": "Where there are way too many jokes that fall flat, Step Brothers has enough brotherly comedy to keep me entertained and not too bored. The realism and little titbits to real life with siblings really works."
    },
    {
      "rating": "3",
      "text": "Never was a fan of this movie. I read one user say it was, \"Aggressively unfunny\" and I'm one to agree. The cast give it there all and Will Ferrell and John C Reilly really go all out here but there is almost nothing funny about this movie. The only thing unforgettable about this film was just how forgettable it is."
    },
    {
      "rating": "7",
      "text": "The movie was pretty entertaining and it had its moments. The story wasn't original but it didn't really matter.The acting was good and the jokes were funny most of the time. It isn't one of the funniest movies out there but if you're looking for an hour and a half to kill, you should give it a try."
    },
    {
      "rating": "6",
      "text": "Mainly generic films tend to have a shortish review to sum up a response, I believe this to be true seeing as I cant really say much on \"Step Brothers\" behalf, I'll try to keep my points minimalistic and brief.\r Am not a major of generic films, to me there just marketing devices designed to be irreplaceable because in short they get to the point, whether that be horror or comedy. This film however I did like, I don't know if its Will Ferrell (whom I just find generally funny) or just the premise of the film, I mean this film is stupid, its meant to be but its funny because of that, Yes the second half of the film is where everything goes down hill, with repetitive jokes and simple and not that effective storytelling to wrap everything up. But you can tell Ferrell and Reilly are having a whale of a time, and that's were its at, this film would have worked better as a tv show but the relation between the two stars is what makes this film, two 40 year old men behaving like infants is just funny pure and simple, so take this film with a big pinch of salt and focus on the comedy they bring because to be honest its a breath of fresh air from most of the trash produced from a seemingly tired genre of films.\r Will Ferrell and John C.Reilly are the best with Ferrel having a soft spot for the rest of the cast seemingly stereotypical, but what do you expect, the film focuses on there relation and how it affects others, it does tend to use its repetitive formula and goes downhill after about an hour but the laughs are defiantly there, obviously not one of the best comedy films but a good effort and a different approach with by my books one of the finest comedy actors from America."
    },
    {
      "rating": "6",
      "text": "Alli for the return of Will Ferrell and John C. Reilly , after Talladega Nights: The Balad of Ricky Bobby , as the great friend brokers now become like brothers who behaved like children but do not mature comedy Oh God up as ?, grown and living with potatoes and behaving like children ? jaj !"
    },
    {
      "rating": "7",
      "text": "Ever since Adam McKay and Jude Apatow launched family-friendly comedy movies like “The 40-Year-Old Virgin” and “Anchroman”, the track record of comedies got back on track, and Step Brothers is one of the examples of their collaboration as director and producer. Will Ferell and John C. Reilly play overgrown but slow-learning men who have to get along and be step brothers after their parents (Steenburgen & Jenkins) got hooked.    Ferell and Reilly's chemistry as childish 40-year-olds are effective while watching on screen. Some gags work frequently and have a substance to the development of their characters and relationship. Moreover, the roles of Steenburgen, Jenkins and Scott also help to add entertainment value and balance the family-themed tone of the story.Yes, Ferell and Reilly share the same vibe, interests, charisma and humor, but that is also the main flaw of Step Brothers. The movie mistakenly becomes a joke as two of the lead actors play the same one note juvenile character.VERDICT: Too juvenile it becomes sort of a sketch comedy, which is a good thing."
    },
    {
      "rating": "6",
      "text": "Finding The Voice TogetherStep BrothersMcKay's daunting task to bring two comic energies on screen that is of such high caliber with an eerie relationship to work on, is an average brawler sparked up by illuminating performances. A gullible world as such of McKay is his core strength, and he makes sure he uses it whenever the script gets damp, lucky for him, there is very little space to do so. The husbandry gags that the film relies upon for the most part of it, ought to have installed by Reilly and Ferrell and is thoroughly steered by them. From banal notions and hilarious illogical one liners, this comic drama, contradictory to popular beliefs, has witty sense of humor.To pull off your typical dinner-conversation-gone-wrong case with intertwined complicated equations bubbled up by irrevocable actions shines a new light every time. The physical sequences are convincing and flat out hilarious spiced up by irregular yellings of their deepest darkest secrets that tickles you. McKay's clean trial of putting up these two hilarious personas on stand makes us see through and through of their nature which works immensely on dramatic bits no matter how little they are.Ferrell as the shy Mama's boy, obliged but never to admit sort of stature is sculpted on screen by him where his flamboyancy on melting down and cheering up welcomes you to join this unfathomable emotions. Reilly, on the other hand, the impossible to live with guy, is where the antics move accordingly, and his reach to grasp Ferrell's schemes has merits of its own. These two twinkling stars are the heart of the film, if the camera seeks someone else, the energy wears off quickly. Step Brothers feels like real brothers for their constant bickering and petty fights, with all the crisp from surface to the core, this family is fun."
    },
    {
      "rating": "4",
      "text": "There is a certain beauty in Adam McKay's 'Step Brothers'. A childish innocence which could have been this film's mark to greatness. Unfortunately this approach is often ignored in favor of screwball comedy which would be fine, but a few set-pieces at attempting humor are more screwball than comedy.To be honest, I expected more from the man who directed cult classics like the 'Anchorman' series and even tackled with Oscar-worthy material in 'The Big Short'. Here, though, the story of two middle-aged men living with their parents is often riddled with awkward pacing and failed attempts at comedy. One such example is when Brennan Huff (Will Ferrell)'s brother, which has a successful career and an apparently happy family arrives into the scene and his wife, mentally damaged by his mannish control is having sexual intercourse with Dale Doback (John C. Reilly). They are nearly caught by the family but through a ridiculous explanation they get away with it. I was prepared to turn a blind eye to this in favor of comedy, but it happened twice.Do not get me wrong. This film has funny moments. Just about enough to grant it a passing note, but then getting close to the ending, everything turns into the typical idealistic pathos. Seriously, is like watching a prolonged yogurt commercial. Also, this decay starts really early being a transitional slope from mediocrity to lackluster happy ending shtick.Screwball comedy is a dangerous concept to work with. It is fragile and has a cheap and immature aesthetic which needs to be balanced carefully. When it works is brilliant, tongue-and-cheek; but when it doesn't, it can get a bit stupid. So yeah, 'Step Brothers' definitely has humor, thanks in part to Reilly and the screwball master himself, Will Ferrell, is just that it breaks too often."
    },
    {
      "rating": "1",
      "text": "The first 15 minutes are bearable. Then they expect us to laugh at different shirts, Chewbacca masks, and using the f word. The full theater I was in was mostly silent for the last 20 min of the movie. Not smart. Not original. And above all not funny. One guy clapped at the end. I booed."
    },
    {
      "rating": "8",
      "text": "Great joke after joke, it seems they forced the cussing in at points which was out of place but hey it's there movie, I'm a totally buy it and those 2 are great pair and this with talledega nights totally showed that."
    },
    {
      "rating": "6",
      "text": "I will first say that I did not \"like\" this movie. It was funny and even hilarious in parts, but it didn't come together as a complete movie. funny but not enjoyable."
    },
    {
      "rating": "10",
      "text": "Funny. Just funny. I was laughing the entire movie, and then about a half an hour after the movie ended. Funniest movie this year."
    },
    {
      "rating": "9",
      "text": "This movie is hilarious. At times slightly uneven, Too much for little kids. Think combination of funny 40 year old virgin, American Pie(s), and Sleepless in Seattle."
    },
    {
      "rating": "6",
      "text": "This is the type of movie that you REALLY want to hate but can't. What makes it funny is that it's so ridiculous that you can't help but laugh. I said \"what??\" aloud at least 5 times during this movie, while laughing. Half the time you'll be saying, \"This movie sucks\". The other half you'll be too busy laughing."
    },
    {
      "rating": "9",
      "text": "HIGH-LARIOUS! This is a stupid, bralinless, awesome comedy."
    },
    {
      "rating": "9",
      "text": "I thought it was really funny. My family enjoyed it a lot and we would, definitely, all go see it again."
    },
    {
      "rating": "3",
      "text": "Better writing could have went a long way to set up the physical comedy.not a smart comedy, not a good story. Making immature 40yr olds get a job in 1 day or get out of the house seems a bit cold harded considering all the years of enabling. and they share a room because of a drum set? Many of the situations in this comedy are unbelievable or lame at best and everyone giving this movie a 10 really has low standards."
    },
    {
      "rating": "9",
      "text": "All the negative user reviews on this film sound like their coming from the uptight, tight -haired school marm from your local all girls prep school. Sniveling and pretentious. This movie is funny folks, hands down. If you haven't seen already, do so this weekend."
    },
    {
      "rating": "9",
      "text": "I am fed up of these kind of comedies being criticized. The only comedies that get a fair review are the Little miss sunshine/Darjiling Limited type comedies. Step Brothers was very funny and has kept us laughing since."
    },
    {
      "rating": "2",
      "text": "It's all stuff we've seen before. They played it safe, Ferral and Reilly have played idiot man-cild role to death, there is no new unexplored territory, I wanted to like it, but it was like seeing a tamer Talladega Nights."
    },
    {
      "rating": "0",
      "text": "Wow, bad, and i loved talladega nights."
    },
    {
      "rating": "9",
      "text": "This movie really reminded me of myself and my brother when we were say, 10 and 12. So I laughed a lot. The critics are stupid, they don't understand what true comedy is. Movies critics have said are hilarious have sucked horribly, and ones they hate I usually love."
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie, i really did. I'm a huge fan of Ferrell, but, he just didn't deliver in this. As for Reilly, i don't expect much. I'm not against cussing in movies, but, the language in this movie just didn't flow, they emphasized on the explictives, and took from the humor."
    },
    {
      "rating": "10",
      "text": "For people who say they like Farrell and Reilly and really wanted to like this movie. I cant see how they didnt like this movie. Sure it wasnt appropriate for kids its rated R for a reason. It made me laugh through out the whole movie. Alot of the humor was raunchy and crude but it was still humor and funny at that.!!!"
    },
    {
      "rating": "10",
      "text": "This movie is awesome! It was so funny! Im still laughing when i think of it... \"boats and ho's\" Two thumbs up!"
    }
  ]
}