{"id": 3599, "title": "Step Up 2: The Streets", "starring": ["Briana Evigan", "Robert Hoffman"], "runtime": 98, "genre": ["Music", "Drama", "Romance"], "description": "When rebellious street dancer Andie lands at the elite Maryland School of the Arts, she finds herself fighting to fit in while also trying to hold onto her old life. When she joins forces with the schools hottest dancer, Chase, to form a crew of classmate outcasts to compete in Baltimore s underground dance battle The Streets.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7YGUxMoQIysZCRMk3r1sza0EX4t.jpg", "categories": {"plot": 5.916666666666667, "acting": 6.285714285714286, "ending": 4.0, "soundtrack": 8.5, "cinematography": 1.0, "familyFriendly": 4.5, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "5", "text": "Not as bad as I predicted."}, {"rating": "5", "text": "Completely predictable plot with more than a fair share of \"laugh at the movie\" moments, where you shake your head and try to forget the bad dialogue or bad scene that just happened. The best part about this movie is obviously the choreographed dancing. If you decide to see this, ignore the cheesy plot (if you can) and just focus on the moves."}, {"rating": "8", "text": "Completely ridiculous. Full of cliches. Totally predictable. And absolutely amazing. You have to go into this movie knowing what you're getting. It's a genre piece, and it's done brilliantly. The dialogue is atrocious, but it doesn't matter. The dancing and the directing way more than make up for it. Spend the money, see it on a big screen, it will leave you smiling."}, {"rating": "8", "text": "Better than the first one. Love it! The last scene - in rain -is totally fabulous!"}, {"rating": "10", "text": "I think that this film is out standing i really like the film and its much better than the first one i hope that there will also be anoghtther film to."}, {"rating": "3", "text": "Critics are ridiculous; this worthless, cliche piece of sh*t averages above 50% while movies that push boundaries or say f*ck you to the rating system get torn apart by these guys....... really quite pathetic IMO of course."}, {"rating": "9", "text": "this is way much better than the first movie"}, {"rating": "4", "text": "No idiot plot, no crisis; all Andie(Briana Evigan) had to do was tell her guerrilla dance troupe(?) that it's either performing arts school, or Texas, but no communication leads to expulsion from the 401. Andie, however, is too raw for the Maryland School of the Arts, and conversely, her new possee of eclectic hoofers are too cooked for the streets. Perversely, \"Step Up 2: The Streets\" will have the audience rooting for the rich kids to school the ghetto kids at their own game. Even worse, Chase Collins(Robert Hoffman), the privileged white guy, gets the girl...and street cred, as well. Chase is the Pat Boone of street dancing. Meanwhile, Tuck(Black Thomas), 401's founder, like so many black performing artists before him(including Little Richard; Boone's version of \"Tutti Frutti\" ousold Richard's), is forced to watch his white counterpart have more success with the artform he pioneered."}, {"rating": "8", "text": "Good dancing scene, great music... not a really good plot."}, {"rating": "10", "text": "I loved it. There was some cussing but the amazing dance moves made up for it. There was everything in it from love to determination and the best movie I have seen in a while."}, {"rating": "1", "text": "This is the kind of garbage that our youth think is cool? Wow, I feel bad for my fellow teenagers then. This movie sucks so bad, I don't know where to begin. All the people giving this high reviews have no idea what the word cinematography means and clearly never want to learn it. They would rather watch mindless crap (the plot) with a touch of cardiovascular aerobics and ass shaking (the \"dancing.\") Don't get me wrong, I like a good ass shaking myself, but I don't need to go pay $9.50 for it. I can get that in real life, or worse comes to worst the internet for free. This movie is for idiotic teenie-bopper girls with nothing better going on in their real life... yea maybe one day you'll be in this girls shoes... only you'll be a stripper at a dirty nasty strip club in the ghetto."}, {"rating": "10", "text": "I love this film. Loads of reviewers are saying it's terrible but to be fair it is a film for teenagers not some old adult who has no sense of humor. So don't listen to the reviews it rocks!"}, {"rating": "8", "text": "It is a well thought out film, i like it, it is full of young beautiful girls, dancing, it is the film of the outlaws who fight for their rights."}, {"rating": "10", "text": "This movie surely kept my eyes open! I am definitely going to buy this! When i walked out of the theatre, i heard good and bad comments - like the first one was better. I found this movie better than the first one because there is a better story line. The music was fantastic. I bought the soundtrack last year and i probably only listened to 4-5 songs. This years soundtrack i love about 90% of the soundtrack. Great Acting Guys! PLEASE BE A SEQUEL!"}, {"rating": "10", "text": "Finally we have clean and goooood movie. Great dancing movements. The one in the rain, there is one of the dancers his name is Monster the boy could dance..."}, {"rating": "10", "text": "This is a cool flick, people! Definately go see it and you'll love it! This flick is better than You Got Served!"}, {"rating": "10", "text": "Dancing is fabulous--see this on the big screen. Yes, the plot is formulaic, but it works."}, {"rating": "10", "text": "I thought the moves and the charcters were awesome! it was a lot better than that balarina dancing movie step up! This movie is what steping up is all about! the last scene really made the movie stickout! this is a defenant crowd pleaser!"}, {"rating": "9", "text": "It is a predictable movie, maybe saw it before, but still it's an attracting movie for dancer."}, {"rating": "8", "text": "The acting wasn't amazing because they aren't trained professional actors. on the other hand, the dancing was absolutely fantastic."}, {"rating": "10", "text": "This is the best movie i have ever seen."}, {"rating": "10", "text": "I loved this movie. The dancing was awesome, I wish I could dance like that. Those people are the best dancers i have ever seen in my life I will never forget it!!!"}, {"rating": "10", "text": "The movie was so awsome and I just felt like getting up and start moving but I was to ashamed to so yeah I'll give that movie a 10 out of 10 of if it was out of 100 it will be 100."}, {"rating": "8", "text": "This movie is good! not bad not great but good. it is a good follow up to the first which ties it's self in at the start and shows some great dance moves, it's the kind of movie that makes you wanna get up and dance in your living room!"}, {"rating": "10", "text": "I really love this film, their dancing is amazing i would love to be able to dance like that, i also love dancing and this film is just the best."}, {"rating": "2", "text": "The only reason why I gave it any stars is becasue of the level of talent of dancers in this movie. Chu has to challenge a children'ts television personality to a breakdancing \"dance off\" because he is a LOSER!"}, {"rating": "4", "text": "Why they made a sequel to a bad unsuccessful movie escapes me. Ghetto melodramatics, uninspired acting and the dancing isn't even that good. The plot is just a rehash of many previous films."}, {"rating": "6", "text": "It depends on how you felt about the first movie that will probably dictate where you come down on the second. Step Up 2: The Streets has flashier moves, somewhat-more interesting characters but almost completely abandons the stories of the first, which is a bit surprising given that sequels usually follow the story setup by the first movie(s). Step Up 2 does, but only by technicality. Still, I liked it more than the first because, when all is said & done, I'm here to see some sweet dancing more than anything else. The acting isn't atrocious either."}, {"rating": "5", "text": "So far, this is my least favorite of the Step-up movies. The plot is average and the male lead had no charisma.  It gets 5 points because the female lead was pretty good and the  dancers of the supporting cast were very impressive (they danced much better than the leads). Despite the good dancers, I still thought the choreography could have been better."}, {"rating": "8", "text": "This was a decent sequel to the first Step Up film, despite being pretty corny. Anyone that loves a good dance flick will obviously enjoy it, but if it's not what you like then stay away. I personally liked it as I like these types of films and the dancing looks great. It lacked a little in substance but made up for in visuals I guess, and even the acting was so-so at times, but the starts did shine when they needed to. Overall a decent sequel and a worthy addition to the series."}, {"rating": "6", "text": "Enjoyable for a while, but not that great of a movie, again. The first 'Step Up' was mostly ballet, but 'Step Up 2: The Streets' is all street dancing. The break dancing moves are actually pretty good for this sequel and and there's better character's in this as well. However, the acting and the plot are completely lackluster. Most of the actor's in this film aren't even actors or actresses, besides Briana Evigan and Will Kemp, but they can't even dance. It really is hard to find the right people who can dance and act at the same time for a film like this, and it shows."}, {"rating": "4", "text": "As this film is a sequel from. step up, the quality really fell down. First of all, the story was too centred on the two main characters. One thing I liked in the first movie was the fact that there was a story, and a developement of the characters. In this one, the guy had already known everyone and suddenly joined the group without any problems. I wouldn't call them secondary characters, but extras, as their participation had no influence in the story. They mostly danced and hardly acted, they were only used to fill the girl's group.\rAlso, the story was very predictable. (Sarcasm alert) A talented and beautiful young girl who dreams of being dancer is dropped out from her group! She then meets a (suposely) handsome and charismatic guy, Who imediately offers his help, by joining an entire group, just for her. Besides already having boyfriend she gives him hopes  and becomes interested on him. Then, there are two other characters: the friend who is in love with the guy and a boy that loves her( the guy's friend, not the main girl). The group, in order to obtain respect from the girl's old companions, forget about their dignity and enters some street competition just to show them they're the best  oh! Clichê, what would be of the production without you...). And they win, what a surprise!  end of sarcasm)\rThe soundtrack also didn't surprise me. In my opinion, the objective of a sequel should be to make a movie in order to supass the previous one. This one gave me the feeling it was only made to sell. There was no realism at all, they just gave the viewer what he wanted: a perfect story.\rIf you liked this movie, you should watch the first one to understand what I'm talking about."}, {"rating": "8", "text": "Some time ago I was a huge fan of this franchise. It all started with this sequel because I thought the first was a little lackluster aside from a mega hot Channing Tatum. Well he's topped here in my opinion by a gorgeous and very talented Robert Hoffman and a sexy and fierce Brianna Evigan (Sorority Row). This time around we are introduced to a competition called the street in which a group of MSA students gather to become a crew and compete. The politics are expected but effective and the dance sequences are electrifying. I'd be lying if I said this wasn't a guilty pleasure filled with melodrama but it's the best of the series, overly entertaining and filled with some diverse, colorful characters. Funny, romantic and thrilling.Budget: $17.5MBox Office: $150.8M7.5/10"}], "recommendations": ["step_up", "magic_mike_xxl", "step_up_revolution", "burlesque", "footloose", "magic_mikes_last_dance", "mamma_mia_here_we_go_again", "black_snake_moan", "step_up_all_in", "grease", "pitch_perfect_3", "hairspray", "baby_driver", "pitch_perfect", "aquamarine", "the_karate_kid", "sing_2", "we_are_your_friends", "catwoman", "high_school_musical_3_senior_year", "my_little_pony_equestria_girls_rainbow_rocks", "hannah_montana_the_movie", "pitch_perfect_2", "midnight_sun", "mean_girls"]}