{
  "id": 4355,
  "title": "Step Up All In",
  "starring": [
    "Briana Evigan",
    "Ryan Guzman"
  ],
  "runtime": 112,
  "genre": [
    "Romance",
    "Drama",
    "Music"
  ],
  "description": "All-stars from the previous Step Up installments come together in glittering Las Vegas, battling for a victory that could define their dreams and their careers.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bM9U2WDQKeQhdQX4kwdk72Drpaz.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 4.230769230769231,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 0.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "One of these days Step Up will realize that it's better for the characters to just whimsically dance like in old musical movie without forcing an already stagnant plot. The movie boasts a dynamic choreography and stellar music to go with it, some are timed just right and they are admittedly entertaining. It commendably tries to bring a dancer's perspective on their life style and tribulation, but the plot often contradicts the effort by putting overly flamboyant characters or tired plot. In the end it's just another drawn out excuse for a dance battle, albeit a rather spectacular one.\r Story revolves around characters from previous installments, collaborating to make a crew to win the high stake dance competition. No Channing Tatum though. If this sounds familiar, it is. There are monetary issues, personal issues and dances in between. For what it's worth, the two leads try to bring more emotion to the mix, although only a few good moments come out of it. Adam Sevani (Moose) is a star, the uncrowned lead of the series. It's quiet amazing that his side story resonates more than the actual main plot.\r Problem arises when the movie attempts to exaggerate flamboyant lifestyle, especially those of celebrity's and their reality television. It's far from witty; in fact the humor tends to fall and becomes tiresome to watch. The main antagonists are mediocre unsavory characters; the male is copied directly from the typical random thug that messes with Chuck Norris or Steven Seagal at a bar, while the female is a botched version of Stanley Tucci's character from Hunger Games.\r When the characters don't banter they perform well. Using odd props and good dance moves, they manage to produce a spectacle. Most of the cast are primarily dancers, so they convince the audience better using motion than poorly written script. Wardrobe looks good, each dance is represented with unique costume, the steampunk one is particularly exceptional. With simple yet effective effect, these dance sequences are the heights of the movie.\r Like any other installments, the plot is almost a hindrance as audience waits for another dance scene to erupt. It does try to make audience relate, although it misses the mark more often than not, which is a shame since it invests plenty of time for it. The glossy choreograph and heart-thumping soundtracks present an enjoyable light flick, and to be fair it's what viewer would expect, but sadly nothing more."
    },
    {
      "rating": "5",
      "text": "I was one of the first people to see the movie. In my coutry it released really early, I think it was 11th or 18th of July.\r People go to see Step Up movies not because of acting skills or special effects or story, but because of dancing skills and music. I've seen every single Step Up movie and all I can say, is that the 3rd installment of the franchise was the best one.\rStep Up 1 had great story and it kicked the sequels going\rStep Up 2 was nice, but the final dance was a diseaster in my opinion.\rStep Up 3- its story was nice, characters were great, music was amazing ( I can still hear some tracks in my head! ) DANCE WAS AMAZING. And the final dance was great. The best movie\rStep up 4 worse than the previous one but still enjoyable. Its story wasnt great, it was pretty generic, but the dancing was cool, as well as music. It felt original in some way.\rStep up 5 - Personally, I think it had a lot of potential that was wasted. A bunch of marvellous dancers and nothing spectacular that came out of it. Mainly because I think that we've seen al of this already in the previous movies. The only character that I'm gonna remember is Iza Miko's portrayal of Alexxa Brava, just because when i saw her on screen, I was in an actual shock. If I hadn't seen The Hunger Games prior to that, I am not sure if my body would be able to handle it.\rDancing was ok, i liked it, but as I said previously, we've seen it before. What i hated tho, was the music. God it was awful. It was a typical techno-dubstep mush-up. Nothing original, nothing that went outside of the box. Music in this types of movies is a very important aspect and here it didnt work out. Thus I think it was below average, below the level, that the prevous movies established."
    },
    {
      "rating": "4",
      "text": "Step Up: All In is the 5th installment in the forgettable Step Up franchise. It is so formulaic, cliched and very predictable that if you have seen the trailer you have seen it all."
    },
    {
      "rating": "0",
      "text": "Step Up: All In is a boring dance movie. Really. If you've seen the trailer, don't bother to watch this spoiled opportunity. STAI follows Sean played by Ryan Guzman who teams up with the previous actors from the previous instalments battle to see who is the best dancer of all. Sounds good, right? Well, director Trish Sie has done a poor, horrible and bad job on this film. The story is loose, the characters don't tie together, and the dance is also CGI made. It's just Battle Of The Year 2! Step Up 2 and Revelution were both good movies, but All In is an example of the series going downhill."
    },
    {
      "rating": "0",
      "text": "This movie is just bad, really bad.  The script is just a constant fail, I felt shamed.\rIt could be nice if at least it was properly directed and the dacing coreographies were nice, but nope, they were not.\rIf you like dancing movies, don't watch this.\rBad and Boring movie."
    },
    {
      "rating": "5",
      "text": "The people in step up: all in, can do better at dancing. Sound mixing: OK. Storyline: hmmm. I'll will have to say mixed between ok and terrible. Also the editing is a problem. Dancing was ok, but they need to do better."
    },
    {
      "rating": "10",
      "text": "T    -    h    -    i    -    s    A    M    -    o    -    s    -    t    M  -    o   -    v    -    i    e    D    -    a    -    n    -    c    -    i    -    n    -    g    In The World"
    }
  ]
}