{
  "id": 2385,
  "title": "Step Up Revolution",
  "starring": [
    "Mia Michaels",
    "Megan Boone"
  ],
  "runtime": 99,
  "genre": [
    "Music",
    "Drama",
    "Romance"
  ],
  "description": "Emily arrives in Miami with aspirations to become a professional dancer. She sparks with Sean, the leader of a dance crew whose neighborhood is threatened by Emily's father's development plans.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ab9T58BlOPauWd9tMnK0HhwYY7u.jpg",
  "categories": {
    "plot": 5.793103448275862,
    "acting": 6.75,
    "ending": 5.5,
    "soundtrack": 7.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 0.0,
    "action": 6.2
  },
  "reviews": [
    {
      "rating": "6",
      "text": "It's not about a complicated and thrilling plot, or a cast of incredible actors that make you believe every part of this is real.  No, Step Up Revolution is simply about intricate and intoxicatingly-good choreographed routines involving \"mobs\" of people.  Taking on the phenomenon that became the flash mob over the past few years, Step Up is simply offering up a tribute to the times.  Film critics: you're going to nit-pick this film to death.  But if you are easy-going and know what to expect, the movie is definitely watchable.  I did feel that they borrowed the plot direction from Step Up 3 and only tweak it slightly at times, but overall it's entertaining.  If the franchise were to find some real substance in the story and write the dialogue a little better, it would be quite an experience.  As is, though, Revolution is just passable.  That okay for me, since I came to see some dancing.  In Step Up Revolution, there are some of the most diverse and cool routines of the franchise.  So if you've already seen the first three, why not see a fourth?"
    },
    {
      "rating": "4",
      "text": "Step Up doesn't offer anything beside quite eye-popping mob sequence. The 3D rocks big time, but it's TV movie, doesn't worth cinema viewing at all."
    },
    {
      "rating": "6",
      "text": "Let me say if you go into the theater looking for excellent story telling and plot lines then avoid it, but if you just want to see a fun movie and amazing dance sequences then watch it. 1. Acting: Eh it's not bad I mean it is believable, but come on, Its not Inception. 2. Plot: It kept me interested with the girl and the father. then the guy and his brother. Its pretty good. 3. Music: They finally found dubstep. 4. Dance: As always the dancing is spectacular the best thing about these films. 5. 3D: I will say like the previous film the 3D does work however it just seems like the 3D only comes in for the dances and the opening and ending scenes. Watch if you want to be entertained but if your looking for something more I guess skip it. But if your a fan of dance this is your movie. Excpecially the opening and ending dance scenes."
    },
    {
      "rating": "5",
      "text": "They don't make these things to win awards. The plot is simple and cliched and the acting is borderline bad (they're dancers who can act, not the other way around). That being said, all the dance scenes are well choreographed and feature some catchy music. So if you know what you're going into and aren't expecting to have your mind bent like a Nolan film then you should be fine. I was dragged by a girlfriend and only contemplated running once."
    },
    {
      "rating": "0",
      "text": "Ok, a new Step Up, in 2010 we watch Step Up 3D, but the thing that I don't understand is the reason for do a new movie, because Step Up Revolution is same than the other 3 movies, we don't watch any new, the show now is very boring and rest is terrible."
    },
    {
      "rating": "5",
      "text": "Honestly This Is Not A Bad Movie.. Everyone Of Them Is A Dancer Not A Actor.. I Give The Whole Cast A A+ For Effort.. The Plot Is Very Simple.. The Soundtrack Is Amazing (Soundtrack Of The YEAR!)\rWhat Drags This Film Down To A Mixed 5 Is The Acting Is Very Bland And Boring!"
    },
    {
      "rating": "10",
      "text": "I have to disagree with all the negative appraisals this movie has gotten. It's an excellent film. The dance routines are spectacular, the story is meaningful and coherent, the acting is more than competent, the cinematography is excellent, and there's a chemistry between the leads that charms. Moreover, the 3D really adds to the film. It improves the perception of spaces, objects and curves. I wish all the people who can't afford it would stop trying so hard to convince themselves and everyone else that 3D is a gimmick. It's an amazing advance. Or maybe you're all one-eyed and just can't see it."
    },
    {
      "rating": "5",
      "text": "Nothing about this movie is Revolutionary: the plot is as thin as it was in previous Step Up movies, and nothing sets it apart from any dance movie ever created. The dancing itself is decent enough, but the attempts at story-telling are worthless."
    },
    {
      "rating": "7",
      "text": "To put it out there: No it's not a good movie in terms of acting, story, plot etc. but, it is fun which is why I'm giving it the score I am. So to get it out of the way, I'll talk about the negatives of the films first. The problems in this film shouldn't come as a surprise to anyone. The story and plot are pretty much non existent, what a shocker. Though, I do applaud the filmmakers for moving past dance battles. However, as unmemorable and cliched the plot was in the third movie it was better than the story and plot in this movie. The dialog in some parts was good but laughable in others. The next and last thing is the acting. Now this has been a problem for all the Step Up movies. The actors (specifically the leads) were always good at the dancing part that was required of their roles but when it came to the actual acting parts, they were all terrible. The same thing is evident here. While the performances between Guzman and McCormick weren't horrendously bad, they could have been much better. These two have potential, had they been under the direction of someone else they could have been good. I will say that there was at least some chemistry between Guzman and McCormick which was missing in the last film. There were also some nice scenes between them but, like every other Step Up movie the romance aspect gets shoved aside in favor of the dance sequences. I really had no problem with the supporting cast since none of them really had to do much. So now to the positives of the film. Like in the previous movie the dance sequences are exhilarating. They are incredibly well choreographed and they're the main reason why people come to see these films now. As I stated in my review of the third movie, this really sets the bar high for any dance movies in the future. The visuals as well are amazing and have improved from the last movie. These dance sequences were fun and engaging and thankfully took up 60% of the running time. The 3-D was definitely worth it. This is the way 3-D should be used and this is probably one of the best uses of 3-D this year (along with Prometheus and Avengers) as well as the past few years. It enhances the experience by bringing us into the dancing and feeling like were a part of it with diversions (like sand, water, and sparks being thrown at our faces) and dancers coming out of the screen into our faces. It helps that this movie was filmed in 3-D like Prometheus was. Director Scott Speer not only uses the 3-D effectively but manages to avoid the common pitfalls of it. Such us dimness, and blurriness. It's crisp, clear and bright. The setting is beautiful and it's nice to be out of Manhattan. The production designs were fantastic my favorite being the art gallery. That was just incredible. Scott Speer manages to get some nice shots of Miami that they look like they could appear on a postcard. In fact in some scenes while the actors were talking my attention diverted to the beautiful backgrounds with the nice palm trees and clear blue waters. The soundtrack was great, each song fit the dances perfectly and the danced to each beat perfectly and accurately. Conclusion: Like every other Step Up movie there was hardly a story or plot, some laughable dialogue, and some wooden performances. Everything else was great, the dance sequences were terrific, they were extremely well choreographed, the 3-D was used effectively, the production designs were good, the setting was beautiful, the leads at least had chemistry even if their performances were that great, there were some nice moments in the romance, and the soundtrack was just as good this time around. For the next movie, if there ever will be one. The filmmakers should either abandon a story altogether and make a 90 minute 3-d music video rather than trying to shoestring in a story to connect the films impressive dance sequences or actually hire real actors who can act and someone who can come up with a decent screenplay. If the movie had a better story, better acting, better screenplay, to accommodate the dance sequences this would have been an amazing film. For those of you who just want to see this movie for the exhilarating dance sequences and can ignore the horrible story, wooden acting, and sometimes laughable dialogue like me, you won't be disappointed and you'll probably have as much fun as I did. For anyone who is looking for a good story etc. look elsewhere."
    },
    {
      "rating": "0",
      "text": "This movie tells the love story of Whitey McCheese (maybe his name is Jason, or Trevor) and Dancey McRichgirl...or at least that's what I'm guessing since I'm watching the whole thing on an airplane without bothering with the sound. One might think that impedes an understanding of the delicate intricacies of the writer's prose or perhaps the actors' delivery in key scenes...but I doubt that very much. No one associated with this film should have any delusions than that it is anything more than some horrific attempt to cash in on a combination of self-published web videos, dance crews, flash mobs, (insert filler here) to try and make money. I'm surmising the plot centers around Mr. McCheese, a vaguely employed layabout who also mostly runs a dance crew/performance group known as 'The Mob'. They put on ludicrously complex and lavish productions that would cost thousands if not tens of thousands of dollars to pull off, all in the name of their art. Good for them.  Yay freedom. Go kids and free spirit. Oh...and how they do this while mostly being street rats isn't clear.  In real life they'd either have to all be independently wealthy to pull off the crap that they do, or in reality they'd be meth heads living in abandoned buildings because none of them seem to have time for actual \"work\" outside of a few pointless vignettes that definitely wouldn't pay more than minimum wage, but I suppose reality isn't the focus here. Anyway, in addition to his miraculously high paying, low-demand job that allows him infinite time to run 'The Mob', McCheese falls in love with Dancy McRichgirl, who is also apparently his super-rich hotel über-bosses daughter, naturally. She just *loves* to dance, but can't catch a break with normal productions. Maybe she's too edgy, maybe she's not good enough, maybe she's too rich or pretty or people hate her dad or whatever...who cares.  Either way, we know she's gonna wind up on 'The Mob' somehow. Of course, this eventually breeds trouble with Douchey McCheese, who may or may not be Whitey's brother (sound would have helped here...but ultimately it's irrelevant). He's obviously jealous that Dancey likes Whitey and turns 'The Mob' against both of them, using her evil father and his plans for hotel domination of Miami or San Diego or Panama City Beach or whatever random, crappy, semi-tropical town this was filmed in, as a backdrop. That, of course, gets the whole 'The Mob' in trouble, gets Dancey mad at Whitey because she thinks he's in on it, and makes her father mad because now he knows she's a naughty underground dancer/flash mob performer. Yawn. I could go on and on with predictable clap trap like this...but honestly it doesn't matter. We all know how this ends and it's pointless. Everyone gets redemption, there's always a happy ending, and all the clean, beautiful kids are happy.  Not having sound actually *helped* this movie because the narrative I made up was probably actually better scripted and narrated and performed than the one presented. Are flash mobs, dance crews, etc. actual examples of talented individuals creating and performing *real* art that they're self-creating and publishing, largely without any external or professional support?  In a lot of cases yes.  ..but this move doesn't celebrate that - it horrifically tries to cash in on a trend and whore it out for cash. This is totally what is wrong with Hollywood...but sadly, I'm sure this piece of crap turned a profit. I've got an idea - I'm going to make a movie.  I'm going to call it \"Parkour Dubstep Revolution Dance Crew Flash Mob Tube\" and it will...oh **** pretty much already been done. Guess I'll have to wait for a few more stupid trends and memes to bubble up before I can cone up with my next *brilliant* masterpiece. Until then, we'll have to settle for this. That, or silence. Sweet, sweet silence.  You want a dance movie?  Make an actual documentary that features real artists and tells real stories - not this contrived crap."
    },
    {
      "rating": "0",
      "text": "not a very great movie , wasn't great as i thought i would be . The last dance was GREAT , Without the main girl dancer and guy dancer. Wouldn't recomend ! (:"
    },
    {
      "rating": "5",
      "text": "This film isn't as terrible as people make it out to be. Yes, there are no good actors and the story is just garbage, but what people don't factor in is that this meant for people who love dancing or love to watch dancing, so if you do not meet that criteria I suggest not watching this film. I give it a 5 because even if the story was terrible, we still got a pretty hot lead actress and the dancing wasn't bad either."
    },
    {
      "rating": "8",
      "text": "I've now watched all four Step Up films and despite them all being quite good this one would have to be my least favourite. It now focuses on flash mobs which became popular with the rise of YouTube but gone are the likable characters we were introduced to in the earlier films. Dancing is still good, as always, but it needed a little more to be up there with the quality of the first three films. Visually the film looked great, in particular the last scene which was very well done."
    },
    {
      "rating": "7",
      "text": "Step Up 3D was a total bummer, and I expected nothing from this one. But to my surprise, \"Revolution\" comes up with an improvement in storyline and most importantly, directing. The story is predictable, cheesy, and there's a lot of plot holes; sure. But the choreography is obviously much better than the last two movies. Then again, I'm giving out 7 considering that the cast consists of dancers who can act, not the other way around; and I appreciate their efforts."
    },
    {
      "rating": "10",
      "text": "I liked this film. Good moral and the best part was that it had many styles in it.The story was also related to the real time happenings of the newly opening companies, but ending was not that much promising,"
    },
    {
      "rating": "5",
      "text": "Step Up Revolution is mildly entertaining, with a cliched love story that actually works, and with superb choreography, but I have seen it all before."
    }
  ]
}