{"id": 2518, "title": "Step Up", "starring": ["Channing Tatum", "Jenna Dewan"], "runtime": 104, "genre": ["Music", "Drama", "Romance", "Crime"], "description": "Tyler Gage receives the opportunity of a lifetime after vandalizing a performing arts school, gaining him the chance to earn a scholarship and dance with an up and coming dancer, Nora.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9Y2i54Etpx7JvCxj6D8P3VAH152.jpg", "categories": {"plot": 6.823529411764706, "acting": 6.333333333333333, "ending": 5.5, "soundtrack": 8.666666666666666, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 5.0, "action": 8.666666666666666}, "reviews": [{"rating": "10", "text": "I loved this movie so much! Channing and Jenna are so cute together, all the synchronized dancing is so cool to watch!  The plot is a little cliché but there is definitely new meaning in the story, as seen by the life lessons which both of them learn at the climactic ending.  I will definitely buy this on dvd!"}, {"rating": "10", "text": "Best film ever. The ballet bit at the beggining was incredible. I only hope that one day i can dance like that. It was incredible music, incredible dancing, and incredible muscles on channing's chest (oh yes!). I loved it."}, {"rating": "1", "text": "It's almost a novel, it has no interest at all, they just looked to a specific public, not to all the spectators, it is 1 and the 1 is for the try, the history is pure Reality Show / Teenage Series."}, {"rating": "8", "text": "This is where the saga began and it will probably remain the best of the bunch, and least 'street' if that makes sense. Both Channing & Jenna play likable leads and as corny and predictable the storyline is, its a nice film with some slick dance moves, which can make you forget that the storyline slacks a little. Anyone who loves a good dance movie will probably have this at the top of their list and theres no shame in that as its probably one of the best out there."}, {"rating": "10", "text": "BEST MOVIE EVER. channing tatumn is so HOT in it ;) the music was awsum and the dance moves were fkn mad!! if you didn't like the movie you dont have any taste in movies or music loved it."}, {"rating": "5", "text": "\"Save the Last Dance,\" \"Dance with Me,\" \"Take the Lead\" What movie was this? They all basically the same. If you liked any of the others, you'll like this too. Nothing new or special, but it was okay."}, {"rating": "10", "text": "This is one of the best dance movies of all time. It is rare to find a dance movie that has both excellent dancing and good character development. It also helps that the lead actors, who were very like able,  were also very accomplished dancers. As a result, the dancing was a lot more fluid, because they didn't have to hide behind camera tricks and stunt doubles to look impressive. I enjoyed Step Up II and III, but the first movie will always be my favorite."}, {"rating": "10", "text": "I really enjoyed this movie. I thought it was one of the best movies I"}, {"rating": "10", "text": "Dance inspirational love, wonderful!!!"}, {"rating": "6", "text": "An editing overhaul to lift out the extraneous scenes and a tighter, more realistic screenplay would have been a great benefit to the clunky, uneven plot. Still, the dancing sequences and the actors ability put this one just over the line. If you have an interest, check it out...but video is most likely the best option."}, {"rating": "1", "text": "If I hadn't seen this movie plot used fifty times already... it still would have sucked. Seriously, how can anyone watch this crap over and over again in different forms with different titles? 1/10."}, {"rating": "9", "text": "Ok, it was predictable like all chick flicks but it was a great movie - Channing is the bomb he is as hot as any boy can be--he can move.  Jenna is gorgeous and definetley knows how to dance. This movie really sucked me in being a dancer myself. I even bought the bloody thing."}, {"rating": "10", "text": "Best Movie Ever!!"}, {"rating": "6", "text": "This movie has some great dancing in it; Channing and Jennin really know how to move. Apart from that, the script is poor and the story is just typical."}, {"rating": "10", "text": "A great movie.Great choreography.Caninning and Jenna fit to each other very nicely.Love this movie ; )"}, {"rating": "6", "text": "This movie will not go down as one of the greatest dance movies of all time but if you enjoy good dancing and get off your buns music this one is for you. It is the typical teen movie but i enjoy a good teen movie every now and then. It is not a bad movie but it is not the greatest of all time either."}, {"rating": "10", "text": "Love the chemistry and the dancing is AWESOME"}, {"rating": "9", "text": "I thought this was a great movie. Their was a good cast and awesome and beautiful dancing. It is very sad at one part, but it was kind of predictable. Channing Tatum, in my opinion did a good job. I loved this movie and I think you should see it."}, {"rating": "10", "text": "I absolutely loved this movie. It was a great chick flick with some neat dance routines. The majority was pretty predictable, but that's ok with me. The characters had great chemistry, and it was overall very adequate. On the other hand I do have to agree with what many people have said about it leaning towards a \"Save the Last Dance\" rip off."}, {"rating": "0", "text": "How could anybody give this movie a 10 or compliment Channing Tatum. He is by far the worst actor in the history of film. This movie has nothing going for it but the garbage."}, {"rating": "8", "text": "I just left the theater from this movie and I actualy just saw the previews tonight and thats why I wanted to see it. I thought that it was a really good movie, thats at least worth seeing in the theater once and buying later. It was a fast going movie that had a drwn out good story."}, {"rating": "0", "text": "This movie was complete and utter crap. The plot was insanely predictable and the acting made me want to shoot myself. I couldn't even finish this movie it was so bad."}, {"rating": "10", "text": "I thought this movie was great! The dancing was excellent, the actors had great chemistry, and it was a good story line."}, {"rating": "10", "text": "I loved this entire movie, the dancing was great and the story was good as well."}, {"rating": "10", "text": "Amazing dancing chemistry galore."}, {"rating": "7", "text": "My wife wanted to rent this movie, I thought it would be another \"Save the last dance\" type of movie. While watching the movie, I noticed it wasn't as corny as I originally thought. The dancing was fairly entertaining, the acting wasn't too bad, the story was decent enough to keep me awake. I really think they should have put a little more effort into developing the characters back story. The story was good enough to make my wife cry, but with a little extra effort it could have made movie viewers develop a richer bond with the characters, that would have involved alot more emotion towards the ending sequence."}, {"rating": "10", "text": "In my opinion, choregraphy (if necessary for a certain movie), characters, and a good storyline all make for a great movie. Step Up had all three."}, {"rating": "4", "text": "In \"Flashdance\", there's a reason to root for Alex(Jennifer Beals) to make it as a proper dancer. The working class girl is staring at a hard luck life of stripping and welding if she doesn't dance like a \"maniac\", and dance \"like she's never danced before\". It's a miscalculation, I think, to profile the dreams of a rich girl. If Nora(Jenna Dewan) doesn't cut it as a hoofer: oh, boo-hoo, she has to go to Cornell(!), or Brown(!!). Director Gordon(Rachel Griffiths) tells Tyler(Channing Tatum) that her students sacrifice everything to achieve their dreams. Instead of providing \"Step Up\" with scenes of Nora's single-minded determination to avoid the hardships of an Ivy League education, the filmmaker makes sure she's well-rounded(boyfriend, parties); when in real life, I'm sure prospective up-and-comers have no time for emotions. Not satisfied with being \"Fame\" meets \"Good Will Hunting\", \"Step Up\" takes a time out from the main storyline to be \"Boyz in the Hood\", before returning to the inevitable finale of \"Good Will Fame\" and its inevitable results. To be fair, this movie is about Tyler's attempt to escape the streets. But once he becomes Nora's dancing partner, a social hierarchy, perhaps unwittingly, takes over and her story takes precedence. The rich steals \"Step Up\" away from the poor. Backstage, after their performance, the realization of this narrative power-play becomes all the more clearer, when Tyler's good news sounds like an afterthought to Nora's great news."}, {"rating": "10", "text": "OMG What a great movie. I love you Channing Tatum you are by far the hottest guy ever if that means anything coming from me. But anyways Channing made the movie great."}, {"rating": "10", "text": "It was the best movie i ever saw."}, {"rating": "10", "text": "Channing is absolutely gorgeous, his dancing and bad boy attitude make him even hotter, you could really see the chemistry between the two, very hot, cant stop talking about it with friends"}, {"rating": "0", "text": "Had Duane Adler not also have written Save The Last Dance a couple of years ago this film would be called plagiarism. Instead what we have is capitalism. Like Girl Cosmo this movie relies on the hopes that young females cannot remember what they read/saw a couple of years ago. Instead of black and white now we have rich and poor. Shes still trying to get into a prestigious program. He's still coping with a life and friend of psuedo crime. Its still hip hop meets ballet. People, don't prove to them that they can get away with this crap. Don't see it. I know I didn't."}, {"rating": "2", "text": "A terrible, terrible film in all ways. Bad acting, bad writing, bad directing. However...this film has some stunning dance coriography. That is not something you expec from a movie but it was the only pleasant suprise becausethis film is still aqful in every other way."}, {"rating": "10", "text": "This was an amazing movie i loved it! I love watching dance movies because they make me proud to be a dancer expecially this one! It had great dance choreography and i liked that it also had other things going on other than just dance and not to mention channing tatum is very good looking! This movie was amazing!"}, {"rating": "6", "text": "Nothing really special but if you can appreciate the skill and technicality required that is good dancing, choreographed or not, you'll find enough to like about Step Up. It's a lesser Save The Last Dance story-wise, but with better moves."}, {"rating": "6", "text": "not my favorite, but hey. at least it was worth a shot."}, {"rating": "10", "text": "A great movie for life !!! I see and review several times !! I love dance movies are exciting ..."}, {"rating": "6", "text": "----------------------------------5.5/10-----------------------------------"}], "recommendations": ["step_up_2_the_streets", "burlesque", "work_it", "step_up_revolution", "hairspray", "mamma_mia_here_we_go_again", "magic_mike_xxl", "grease", "step_up_all_in", "footloose", "sing_2", "hannah_montana_the_movie", "we_are_your_friends", "the_karate_kid", "no_reservations", "cats", "the_vow", "midnight_sun", "mamma_mia", "pitch_perfect", "aquamarine", "magic_mikes_last_dance", "the_lucky_one", "stardust", "black_snake_moan"]}