{
  "id": 4128,
  "title": "Steve Jobs",
  "starring": [
    "Michael Fassbender",
    "Kate Winslet"
  ],
  "runtime": 122,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Set backstage at three iconic product launches and ending in 1998 with the unveiling of the iMac, Steve Jobs takes us behind the scenes of the digital revolution to paint an intimate portrait of the brilliant man at its epicenter.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/92vhEJ6xWoDJ8UHECAJaRofaSCZ.jpg",
  "categories": {
    "plot": 5.019230769230769,
    "acting": 5.955882352941177,
    "ending": 5.75,
    "soundtrack": 7.333333333333333,
    "cinematography": 6.2,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.285714285714286
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This film is brilliantly written by Aaron Sorkin with terrific performances from Michael Fassbender and Kate Winslet.  Be prepared this film is pretty much just dialogue.  Dialogue that teaches you everything about the lead character.  A-"
    },
    {
      "rating": "9",
      "text": "Let´s face it. Some people doesn´t dislike this film at all,they hate Steve Jobs,one of the most irritating person of all time who made billions of dollar due to it´s ego and inteligence.\rA biopic of him sounds like something almost nobody would like to watch.\rBut Extraordinaire Director Danny Boyle (Trainspotting,Slumdog Millionaire) controlled 3 moments of steve jobs life that were crucial. And i know,it doesnt show the beginning of Jobs and wozniak with too much detail,but i guess they didn´want to do again what Hollywood had showed in Kutcher´s Jobs.\rYes,Jobs is two hours of complaining,but at least show us who and how was steve jobs,not all what he has done...Fassbender,Daniels,Rogen (surprisingly)and Winslet shine in this project...and all thanks to Screenwriter Aaron Sorkin and Director Danny Boyle."
    },
    {
      "rating": "10",
      "text": "Boyle's film is gripping and Aaron Sorkin's screenplay is flourishing, not to mention the film's score by Daniel Pemberton has tension. The talented Michael Fassbender owns the rule of Steve Jobs also makes a beyond brilliant performance so does Kate Winzlet, Jeff Daniels and Seth Rogen. The film takes place in three acts, Jobs is back stage preparing for three launch products: the Macintosh in 1984, the Next Computer in 1988, and the iMac in 1998, and in the iMac in 1998, after Jobs had been fired from Apple and then brought back in utter vindication to the company he co founded. People who make a dent in the universe usually do serious damage to their relationships. Through the years, Jobs battles his ex-girlfriend (Katherine Waterston) denying the paternity test of their daughter Lisa, with his longtime partner Steve Wozniak (Seth Rogen) his programmer (Michael Stuhlbarg), and with the professional manager he brought in to run the company, Pepsi's John Sculley (Jeff Daniels). He agonizes over the double rejection of being put into adoption and then being brought back by the first people who tried to adopt him. Sorkin's screenplay is smart and Boyle has exhilarating style. It's one of the best films of the year including one of the best performances so far. Grade A+"
    },
    {
      "rating": "9",
      "text": "Steve Jobs was a man who made a huge impact on millions of lives all over the world despite most people not knowing much about the man who made their PC or their IPhone. Steve Jobs also deserved a worthy biopic about his life as well, which he sadly did not get with Ashton Kutcher's version. This film was film with talent in front and behind the camera and that is why it is so effective.\r I must start with the great screenplay by Aaron Sorkin, who is my favorite for best screenplay so far at this years Oscars. Sorkin crafted some of the best dialogue in a film this year. The film is written in just three different time periods rather than just play right through Steve Jobs' life.\r Now Michael Fassbender is outstanding as Steve Jobs and there is never a moment where you feel that he is acting. He was Steve Jobs in this film. I know a lot of people were commenting on Fassbender not looking very similar to Jobs but that never bothered me. Fassbender's performance says so much about this man and I'm sure that he will have to get some attention for best actor this year and as of right now he just might have my vote.\r Now for the supporting cast. Seth Rogen was great, I thought he was maybe going to struggle with this role, but there is nothing I like more than an actor breaking his typecasting and he did it here. There are several scenes here the Rogen holds his own against Fassbender and the same can be said about Jeff Daniels and Kate Winslet. Winslet will surely be nominated for an Oscar as well.\r Danny Boyle did not exactly steal the show like he sometimes does in his films. This seemed more like a showcase for Michael Fassbender and Aaron Sorkin than anyone else involved and that certainly doesn't drag it down. Props to Boyle for delivering on a great script and excellent performances. Undoubtedly one of the best films this year."
    },
    {
      "rating": "9",
      "text": "Alan Sorkin = scenariusz wart każdej nagrody.\r Steve Jobs to nie kolejny film biograficzny ukazujący na końcu śmierć tytułowego bohatera. To byłoby zbyt proste. Nie ukrywa tego kim tak na prawdę Jobs był, jakie problemy miał i co musiał robić, żeby osiągnąć sukces. Dlatego rozumiem rozczarowanie wielu osób po obejrzeniu Steva Jobsa. W mojej osobistej opinii jest to film bardzo dobry. Zaskoczył mnie przede wszystkim sposobem opowiedzenia historii. Danny Boyle (reżyser) wybrał 3 przełomowe momenty z życia głównego bohatera, żeby skupić się psychice Jobsa, a nie jego kariery.\rMoim zdaniem film obowiązkowy do zobaczenia."
    },
    {
      "rating": "8",
      "text": "\"Steve Jobs\" was an interesting movie , but was only reported in the moments before your important presentations in the years 84 ' , 88 ' and 98 ' and there was a little interesting , was excellent, and even perfomance of Michael Fassbender, and Kate Winslet that like me."
    },
    {
      "rating": "9",
      "text": "I guess it all comes down to how you want to remember Steve Jobs -- the guru who inspired a following of devoted Apple users or a self-absorbed entrepreneur who seized the moment, leaving behind him a trail of disgruntled co-founders, workers and former lovers.  This movie takes the latter approach, but contrary to what some may think, Boyle and Sorkin make Jobs human, richly so in fact, and I think in time even those who have criticized this movie will come to regard it as the best testament of his legacy.\r Whether or not Lisa was his daughter matters little.  What matters is how Lisa becomes the muse around which Jobs built his ideas.  From the start, the Apple was designed to be a user-friendly home computer that would become the \"bicycle\" for our ideas.  A young Lisa immediately seizes its potential and in three highly-charged acts she also becomes Steve's sharpest critic.  She represents the generation that has been brought up on the PC and is now shaping it into an image of themselves through the Internet.\r Woz is Jobs' foil throughout the movie, determined to make Steve give the core Apple team its due, long after Jobs has dismissed this crew as B-players.  This will no doubt rankle the Techies who probably don't see Jobs as anything more than over-hyped promoter.  In fact, Woz accuses him of that in the movie, to which Jobs responds that he is the conductor and Woz is one of the musicians, first row of course.\r The most interesting character is Joanna, a largely fictional construction who becomes Jobs \"work wife\" over the course of the film, reminding him of his moral responsibilities.  This is probably what miffed Jobs' real wife, who is not even mentioned in this film.  But, the filmmakers chose to take a theatrical approach, narrowing the essential characters down to a handful and building Jobs' life around them.\r You can quibble with the authenticity of the film, but that's not what's at stake here.  This is more about  what made Steve Jobs tick.  What drove him to be the leading innovator in the PC industry and how he reconciled this with those around him?  I have to hand it to Boyle and Sorkin to turn this into a richly entertaining film that held this viewer spellbound throughout."
    },
    {
      "rating": "10",
      "text": "Steve Jobs, arguably the most impactful pioneer in recent history, began to picture his most iconic product – the iPod, later iPhone – when he started to build on himself before his product; it's a story of finding the hardware before the design.\rIt is exactly at the moment when the man, who is obsessed with elegance in his designs and knows he is a big name, confesses to his daughter, saying, “I’m poorly made,” that changed everything about the movie for me. I definitely think it is one of the most stunning quotes from a movie."
    },
    {
      "rating": "4",
      "text": "I have seen a lot of Sorkin's work and, alas, this reinforces my growing impatience with his inability to create people who speak in different voices from each other. That, and the relentless walking that seems to be the action of this film - a la West Wing and pretty much everything else he writes, made for an exhausting cinema experience - and not in a good way. I found the portrait of Jobs, about whom I know little, as uninteresting as it was unilluminating. Why people kept coming back to be abused by Jobs was disturbing - was everyone in his sphere so in awe and so helpless?"
    },
    {
      "rating": "7",
      "text": "It's a weird movie. I'd call it a pretty poor biopic, but then it seems not really intended to fill that niche anyway. Instead, it's a philosophical piece on the nature of genius. Does great progress require that one dreamer be so stubborn and such an **** that nothing will take his eyes off the prize?\r There are elements of truth, but many of the factual details are just wrong, and it's hard to say whether the character in the film is a fair portrait of the real man or not. Michael Fassbender does not particularly look or sounds like Steve Jobs, but he's certainly playing something interesting. The odd notion of using hurried discussions before product launches as a framing device is a pretty effective tool, but renders the film incomplete. After all, there were many more important things that happened than can fit into the length of the film.\r It's a Danny Boyle joint, so you know it's high energy and fun to watch. Go in with measured expectations and you're likely to be happy."
    },
    {
      "rating": "5",
      "text": "If you like people walking down halls, reciting lines that can only be delivered like in a high school play or a reading of Green Eggs and Ham even by the best actors, and passive-aggressive slam pieces about celebrity figures, go ahead and see this and every Aaron Sorkin thing ever made. If you either didn't see Jobs or Steve Jobs: Man in the Machine or need to contribute more to overblowing this mildly intelligent, morally gray and overcredited computer engineer's popularity, just go for a Sunday matinee.\r If this thing is even nominated for an Oscar I'm going to feel like eating my own head. So unoriginal, so overwrought (as another reviewer commented), such a throwaway subject. Should Sorkin do a movie about Kim Kardashian next because she is popular? What other scenarios can we have characters unrealistically spouting cringeworthy dialogue in fast foward that sounds like an English major put it through 10 drafts before the actor delivered it? Will Danny Boyle ever stop doing that slightly tilted camera shot? Will Jeff Daniels ever stop playing a guy in a suit in a boardroom? Answering these questions should be about as thought provoking as considering Steve Jobs's life."
    },
    {
      "rating": "7",
      "text": "I’m not an Apple guy and I knew little about Steve Jobs prior to seeing this movie.  I thought the movie was mildly “interesting.”  It depicts Jobs as both a “marketing genius” who saved the company from bankruptcy and a thoughtless ass-pipe, who was unkind and uncaring toward pretty much everyone human being in his life.  I’ve been told that the movie skips over large segments of Job’s life, and thus some feel the movie is unbalanced or an unfair in its portrayal of him, while others have told me that the guy was, in many ways, even more bizzare than what the movie shows.  All in all, I think it’s fair to say that the movie attempts to give you a sense of who he was without laboring over every detail.  I leave it to others to debate the accuracy of the material presented, but if you’re an Apple aficionado, you may not care for this movie because it colors pretty much all of the company founders as timid or inept buffoons who couldn’t run business selling beer to beach goers in July, much less a computer company."
    },
    {
      "rating": "4",
      "text": "I didn't know much about Steve Jobs' personal life outside of his public persona and I still don't after watching this, which for a movie called \"Steve Jobs\" is a pretty big failure to me. There are so many flaws with the concept of the movie... First off, you basically have to have read his biography to understand what the heck is even going on which is a lot to ask from the viewer, secondly it's not even interesting it's the same 40 minute scene repeated 3 times with little variation. No character development, no story, no nothing, just people pissed at that one guy that's it. Even Fassbender's performance which received massive praise is nothing special if you've seen him in other movies, he's a very charismatic actor but it's not like he's stretching his range by any mean here it's the same thing he always does, there's no point in the movie where you think \"this is Steve Jobs\"."
    },
    {
      "rating": "7",
      "text": "It's ok.\rSteve Jobs has a great theme, showing how far you need to go to achieve greatness.  However, Steve Jobs as a movie is underwhelming.  The story is very crooked, and Mr. Jobs himself is a very unlikable character, and isn't the inspiring protagonist that everybody likes; not even an anti-hero.  There are some boring parts, and in a movie where the directors wanted it to be inspiring, it made it hard to be inspired when you just see angry business men shouting crap at each other.\rOverall, while this movie can be inspiring and powerful, and in no way bad, there are some parts that struggled to be engaging.  If you want to go see this movie, by all means, go see it; it's just disappointing, and I expected better from Boyle and Sorkin.  Ultimately, this movie is just meh.\r Steve Jobs gets a 7/10."
    },
    {
      "rating": "0",
      "text": "An absolute yawn. The \"weaving in\" of elements from Walter Issacson's dry and scathing book fall as short as said publication did in portraying the full depth of Steve Jobs. Fact-checking was obviously not a priority for Aaron Sorkin in this - yet again - character assassination of the man behind Apple. I did watch the entire debacle, but had it have been on the small screen this production would not have passed my ten minute test."
    },
    {
      "rating": "6",
      "text": "The first \"event\" movie of 2015 that I feel has been terribly overrated.  It's got a few powerful moments, but as one of the critics noted, it feels like a bunch of product launches strung together, and it lacks that spark of magic that made The Social Network so special. I will say that Kate Winslett is phenomenal in the film.  I think Sorkin is MUCH better with TV."
    },
    {
      "rating": "0",
      "text": "Disappointing and unrewarding.  I was looking forward to this movie... I figured how could you go wrong when an epic story of failure-to-triumph already happened in real life.\r When the movie ended in the theatre, instead of cheers or satisfaction, I heard several people say out loud, \"Wait... what?\" or \"Wait... that's not the end, is it?\"\r Not a good sign.\r I went to dinner afterwards and I was trying to figure out what was wrong with the movie... a movie that had ZERO impact on me whatsoever.\r Nobody is going to say that it was poorly acted - they had an A+ cast and they all did a great job with what they were given.  There wasn't any bad dialogue or moments where you groan at how something is presented...\r It wasn't poor execution of anything... it was the complete lack of story telling and character development...\r The movie was just one scene after another of intense dialogue and no story elements whatsoever.\r I know everyone hates the idea of a formula, but every great TV show or movie follows the following pattern:\r You get a glimpse into the current life of the main character.  You see them somehow unfairly wronged (so you feel sympathy for them and bond with them).\r An opportunity presents itself and the main character pursues that... and then, about 10% into the movie, the real quest begins...\r Through the course of the movie, we watch the main character pursue their main goal and deal with the challenges that come up in the meantime -- challenges that force the main character to push past his inner and outer challenges more than he/she ever has before.\r At the 50% point in the movie, you reach a \"point of no return\", where the character can't go back to their old life / old way of being, even if they wanted to...\r The rest of the movie winds up at an ultimate test where the main character has to fully and irrevocably step into their new self and overcome their most challenging inner block.\r EVERY good movie and TV show has this.  Star Wars.  Breaking Bad.  Dead Poet Society.  Fight Club.  The 40 Year Old Virgin.\r (I'm not saying those are all the best movies/TV shows ever, I'm just illustrating the breadth of content that all follows this format.)\r This movie did none of the key storytelling milestones, so you end up watching two hours of characters who you couldn't give a flying f*** about arguing with each other about subject matter you have zero investment in as an audience member.\r One of my tests as to whether it's a good movie or not is if one of the main characters got shot dead in a scene, would I care?\r In this movie, a bomb could have dropped on every product launch and I couldn't have cared less.\r If you haven't seen the movie, please do... I'm tired of seeing movies like this that lack any satisfying substance get high rating on Metacritic and Rotten Tomatoes...\r You think movie studios with 9 figure budgets don't know how to fudge ratings on these things?  Of course they do!!!  So please, watch the movie and rate it accordingly..."
    },
    {
      "rating": "10",
      "text": "Full disclosure, I am an Aaron Sorkin sympathizer. His critics (who are steadfast in their grudge against Sorkin) be damned, this is another masterful bit of storytelling. On its face value, a movie about three separate tech launches in the world of Steve Jobs has potential to be somewhat of a bore. But this striking and impassioned acting and writing display is nothing short of pure adrenaline. If you have any appreciation for the written word and how it can move like music when put in the hands of the right actors and director, then there's no way you walk away from this movie unsatisfied. The arc does a great job of illustrating the cunning determination in Jobs' pursuit of perfection, and how he used his genius to, both, trample over those that stood in his way and defy those championing the safe investment of sticking to the status quo. They may have glossed over how or whether he mended relationships with those he cast aside - and were vital to his success - but the end result was a moving picture of a flawed genius. Not every movie has to make you feel like your protagonist should be worshiped, and I don't believe this story does, but it makes you feel something about standing for your principles. And there are plenty of times not compromising on your principles can destroy you or the people around you (Jobs certainly did plenty of this), but, I believe, it's fair to say there were at least a few times his uncompromising/self-absorbed persona helped change the world - and it's all right to marvel that."
    },
    {
      "rating": "1",
      "text": "Two hours of relentless, overwrought, annoying, repetitive conversations between angry people you care nothing about.  A hugely disappointing, unrealistic, lazy mess of a movie."
    },
    {
      "rating": "5",
      "text": "I am a big Aaron Sorkin fan, but Steve Jobs is probably the worst thing he has ever done. The story is so strangely cliche, it's over melodramatic, and the dramatic payoff is somehow simultaneously unbelievable and a huge let down. Michael Fassbender gives an okay performance, but he makes Steve Jobs come off as a gigantic, passionless jerk for no reason. This movie is too boring, too long, too predictable, and has entirely too much scenery chewing that tries to disguise itself as dramatic action. The movie is produced competently, but it's completely unremarkable."
    },
    {
      "rating": "0",
      "text": "It just feels so directed\" and over-acted.  Enough of the endless face shots of angst. I just don't get all the hype of this film. It is the dog of the season."
    },
    {
      "rating": "0",
      "text": "This movie was a HUGE disappointment. There isn't any kind of character development, and Steve Job's life is pretended to be summarized to very short and lame episodes of his life. You will go out of the movie not having a remote idea about who Steve Jobs really was. :-("
    },
    {
      "rating": "8",
      "text": "A lot of people say this is boring and repetitive, but I think that people just don't understand the movie. It's not supposed like a big-budget blockbuster movie, it's just supposed to tell the story of three different moments in Jobs' life. It has a phenomenal cast and script, and the pacing was almost musical. One of the best movies of the year!"
    },
    {
      "rating": "8",
      "text": "Steve Jobs is an interesting film about an interesting person. Michael Fassbender was brilliant as the title character and really succeeded in portraying Jobs as unlikeable but weirdly appealing and charismatic at the same time. Seth Rogen, Kate Winslet, Jeff Danials and Michael Stuhlbarg were all great as well. They all deserve Oscar nominations! Looking at what went on backstage at the launch of various important Apple products, the movie focuses on Steve Jobs' relationships with his co-workers and with his daughter. The movie is never boring despite being set almost entirely in different rooms and corridors. The dialogue is rapid and really compelling. In short, Steve Jobs is an intriguing look at one of the great pioneers of technology."
    },
    {
      "rating": "1",
      "text": "I am totally AMAZED that this movie is not rated a bomb across the board!  Tedious and contrived.  Let's have dialogues that are not particularly good \"tell the story\" vs. employing good movie making.  And the title of the movie should have included his daughter, Lisa, as that is what this is pivoting around - not that this is not important - but really great intricacy's of the man were completely not shown.  Read \"Becoming Steve Jobs\" - this is the real deal on who Steve Jobs was, flaws and all, but balanced."
    },
    {
      "rating": "0",
      "text": "I should confess that I WALKED OUT after just over 40 minutes of this non-stop VERY tedious Talk-fest.....the story seemed to be stuck.....paralyzed .......incapable of moving beyond its opening scene....it felt like a REALLY BAD ONE-PLAY with utterly banal dialogue and two dimensional characters.....it like watching one of the soap operas my grandmother loved so dearly in the 1960s.....and THIS from DANNY BOYLE the genius who created \"Slumdog Millionaire\", \"127 Hours\" and \"28 Days Later\".......that's two bombs in row Danny (\"Trance\" and now this )......hope you get your mojo back soon; you are an amazingly talented film maker."
    },
    {
      "rating": "1",
      "text": "My 30-year-old Mac Classic, my first computer ever, still works.  I never had to read a single page of instructions to use any of my Macs that I owned  (until 2014).  Mr. jobs knew exactly what the personal computer had to be for the users, long before the users ever did.  He had to fight his engineers, because Mr. Jobs knew that the engineers wanted to make something different from what he wanted to make.  He was a \"Meister,\" not a money-monger CEO. Mr. Jobs came to be known to the world for his accomplishments not for his faults.  I greatly appreciate his accomplishments, but not what this movie describes about him.  This movie is good for someone who would enjoy seeing how a formula 1 racing car does when it plows the field."
    },
    {
      "rating": "2",
      "text": "What a wreck!  You know how the book is always better than the movie except in a handful of cases such as:  \"Psycho\", \"The Godfather\", \"Jaws\", maybe \"The Shining\"…  here the book (though a biography not a novel) is about a thousand times better.  The first big mistake was Sorkin writing the script.  He's not a moviemaker but a playwright and one who is in love with his own concocted witty banter and not so much interested in a good movie.  It worked well for \"The Social Network\" but dreadfully does not here.  The subject is highly verbal yes, but this film is way too much so and a director like say Polanski would have smartly thrown out half of the wall to wall dialogue.\rDanny Boyle's (a director I have always liked) stabbings at a cinematic treatment of the stagy script do not work including the use of grainy film stock in the beginning and subliminal cuts to get in back story that appear as errors.  These choices are a complete blunder.  Michael Fassbender is an excellent actor, but incredibly I might prefer the lousy Ashton Kutcher whose portrayal in the lame \"Jobs\" was at least a better and more accurate overview.  Kate Winslet plays an annoying contrivance of a character that is ridiculously unbalanced to the real story.  And what can you say about the casting of a fat slob of a talentless over-paid lucky as **** phony actor playing Steve Wozniak?  They could have cast any fat slob with a beard and that actor (or non-actor) would have done just as well or better.\rThe worst move of all was the silly Hollywood emphasis on Steve Job's illegitimate daughter who takes over the whole story!  A story that could have and should have been epic!  What about his other kids for that matter?  What about his wife who he didn't find until late in life and really might have saved him from himself in many ways?  The film's focus is narrow and dumb, and that is said knowing full well that dramatic license and drastic cuts and economies must be made in adapting such a book and life.  This movie feels very small while something like \"The Social Network\" felt big.  I read the biography in whole, and any other iteration imaginable would be superior to this film.  Isaacson must be hugely disappointed in this hack job.\rOne thing is for sure, Steve Jobs would be appalled by this piss poor movie and would be livid over its shabbiness!"
    },
    {
      "rating": "1",
      "text": "If you are a fan of Apple and Steve Jobs, you might like this movie. However, it is hard to see why anyone would like it very much. Kate Winslet is good but that is not nearly enough to carry the film which has almost nothing else to recommend it. It is not an interesting story, not good character development, not good dialogue, not entertaining, not educational, not enlightening, nothing worth watching. I hate to agree with Rex Reed who is the most uneven critic in the country but he is right on this one."
    },
    {
      "rating": "9",
      "text": "Fast paced, incredibly directed and a performance by Fassbender that is sure to be noticed come awards season, Steve Jobs is all the right things that a biopic should be.  Sorkin's script and strong performances by the entire cast make this the best movie about the co-founder of Apple to date."
    },
    {
      "rating": "0",
      "text": "Apple propaganda from start to finish. I found nothing good about this movie while watching it. The whole movie focuses on Steve Jobs and exaggerates his genius. The company is obviously behind this movie and are interested in boosting Apple sales. I will wait for a more accurate portrayal of Steve. Until then, this movie will not do."
    },
    {
      "rating": "5",
      "text": "An overacted, over dramatic mess for the most part. Aside from a few good scenes, the entire movie felt like an argument that never stopped. The acting is solid and music helped at times but overall an average biopic at best."
    },
    {
      "rating": "5",
      "text": "A solid movie showing us the true Jobs. A Self loathing man who cares nothing for his family including his daughter who he removed from his life. A man who obsessed more for his vision than understand how to treat his employees. Jobs was a marketing giant who treated his employees as bad as his family. Remember, this is a man who even after a court decided it was his daughter after numerous DNA tests decided to character assassinate his ex girlfriend in order to prove that wasn't his daughter. Who he ended up ditching for half her life until he gave her $20 million to keep his name and hired a great PR team. Don't be fooled by this media loving BS Jobs was a horrible human being."
    },
    {
      "rating": "3",
      "text": "Incredibly boring film. It seems Jobs spent his entire life attending new product presentations. I don't like Apple products but I wanted to know more about this extraordinary man - unfortunately I feel I learned nothing about him from this 2 hours of tedium."
    },
    {
      "rating": "8",
      "text": "Aaron Sorkin is a genius and Danny Boyle is a master.  No wonder that their collaboration results in a piece which I did not want to end.  When the credits rolled up, I was crying to see another \"episode\", another product launch, another proof of why Steve who couldn't write code, was not an engineer nor a designer and couldn't put a hammer to a nail was called a genius a dozens of time a day..."
    },
    {
      "rating": "10",
      "text": "It is often stated that the line between insanity and genius is measured only by success. When discussion turns to that of one’s genius, we find it difficult not to equate that genius with some level of insanity. This is especially true when that discussion focuses on Steve Jobs, the man behind machines that allows us to hold the world in the palm of our hand. Steve Jobs is not simply a film, but is an experience of perception; of history; and of a household name.\r When evaluating Steve Jobs the film, one has to stop and admire the genius of writer Aaron Sorkin. The Academy Award winner extends the parameters of his brilliance through a film that not only allows us an understanding of a complex mind, but accurately illustrates the torments, criticisms and neglect that shaped the man entrusted with its ownership. Based on Walter Isaacson’s non-fiction memoir, Sorkin’s script rockets off the tongues of the film’s talented cast and grabs your attention as you dance through every nuanced conflict of Jobs’ life. Daringly mimicking theatre in its three-piece act structure, the film presents the events of three major launches, and three very different pictures of Steve Jobs (Michael Fassbender), in real time.\r The first, shot in low-resolution 16mm film, set in Cupertino, California, shows a grainy and young Jobs moments before his inaugural Macintosh in 1984, days after the infamous science fiction based Apple commercial. The second, showing the recently axed Jobs, in 1988 at the historical San Francisco Opera House before his infamously disastrous NeXT cube launch in wide-screen 35mm film displays a vengeful and highly orchestrated Jobs. Finally, in 1998, returning to Apple, this time as CEO, utilising high-definition digital film at San Francisco’s Davies Symphony Hall, before his presentation of the iMac. The last act presents to the audience the most human yet morally flawed version of a man no one ever really understood. Each scene, running close to thirty five minutes each, is as enthralling, entertaining and orchestrated as the next.\r Jobs has always maintained a very muddled and misguided personal life; one that includes a young daughter Lisa with a college sweetheart Christen Brennan (Katherine Waterston), very uninspiring social skills as well as a knack for being referred to as unlovable. Sorkin’s script looks to answer one of the biggest questions plaguing the late great tech genius: can a great man still be a good man? Thanks to an electric script by the great Aaron Sorkin, phenomenal performances on all fronts, masterful direction and a brilliant neo-classical score by Daniel Pemberton, Steve Jobs is easily a crowning cinematic achievement and the best film of 2015, in spite of not being the most audience alluring film released this award season.\r From the beginning, the film is a pish-posh of gossip and rumours. Not that anyone thought the film would bow down to the atrocious Ashton Kutcher vehicle Jobs in 2013, but the film did suffer a slew of “technical difficulties” going into production. Once in the hands of David Fincher, the film was always setup to be as great, if not greater than The Social Network. With Christian Bale initially cast, the film went through directors, stars and crew like a Daytona racetrack, eventually settling on director Danny Boyle, and stars Michael Fassbender and Daniel Pemberton instead of a roster that may very well have included Fincher, Bale, Trent Reznor and Atticus Ross. Luckily for audiences, Steve Jobs is not an unwanted and pumped out studio biopic, and focuses less on the look of Jobs and more on the essence of a man struggling with himself more than the struggles of an economically competitive technological world.\r While the film is presented in a very basic three act structure, there is nothing simple about the film. Driven by dialogue, its characters and three very crucial times in the life of Steve Jobs, the abstract delivery of these highly regarded singular events of the 20th century are presented with ease and class.\r In a world where recognition is everything, and being pointed out in humiliation and failure could forever change your reputation professionally, Steve Jobs, logically speaking, had no right becoming a pioneer of technology. He was no engineer, designer or programmer, yet, the world knew his name and the ramifications of his brilliance. In one of the many powerful scenes of the film, when confronted by his cohort and early friend, Apple Co-Founder Steve “Woz” Wozniak (Seth Rogen) what he does. In response, Jobs says, “I play the orchestra!” Often times being measured next to Leonardo Da Vinci, Julius Ceasar and God himself, Jobs was often misconceived as a diabolical man with a plan, giving out the passes to whomever came in his way."
    },
    {
      "rating": "0",
      "text": "BORING!!!!!  Too much geeky over the top blabbering. A misplaced homage to Jobs at the expense of a layman audience.  A better movie would have been Jobs' place in the technology revolution.  SAVE YOUR MONEY!!!  Ps.  MY wife and I NEVER agree.  We did this time"
    },
    {
      "rating": "0",
      "text": "Imagine a movie where a bunch of characters you don't care about have intense but uninteresting arguments for the entire time.\r That is this movie.\r--"
    },
    {
      "rating": "7",
      "text": "With a definite Best Actor Oscar nomination for Michael Fassbender, Best Supporting actress nomination for Kate Winslet and probable nominations for screenwriter Aaron Sorkin and director Danny Boyle along with Jeff Daniels and/or Seth Rogen for Best Supporting Actor I wish I could say “Steve Jobs” is a ‘must see’ movie but the most I can say is the fast smart dialogue  while walking fast, a trademark of Sorkin’s, along with director Boyle’s kinetic use of the camera, aided by the soundtrack of Daniel Pemberton, add up to an interesting movie. Sorkin has written a 3 act screenplay, each act revolving around a creation by Jobs such as the Apple II, the NeXT and the iMac computers, while Doyle films the first act in 16mm film, the second in 35mm and digital for the third act.\r It is generally known and accepted that Steve Jobs was a cold, dictating boss who never gave credit to anyone keeping it all for himself, gave more love to his technological creations than to any human being, never treated anyone around him fairly, was an impossible perfectionist, always composed, cool and in charge, comparing himself to G-d, Julius Caesar and seen as a bully but even those who hated him acknowledged him as a visionary.\r The fact that he was adopted and given back after a month to be adopted again, being brought up as a Catholic, refused to acknowledge the birth of his own daughter until she was in her teens and his long time, non-sexual, working relationship with Joanna Hoffman (Winslet) who was one of the few who could and did stand up to him, are never dealt with in depth which may have helped explaining the man himself. We learn little about the man himself which is a big failure of the film.\r There is no faulting of the actors from the three, Makenzie Moss, Ripley Sobo and Perla Haney-Jardine who play the daughter at different stages, Katherine Waterston who plays the mother, Mac collaborator Andy Hertzfeld, played by Michael Stuhlbarg, to all the supporting and bit players. Daniels takes his character from “The Newsroom” a step higher!\r Fassbender IS Steve Jobs even though he may not look like him to start with eventually he is the man you have seen on large stages introducing his products. He handles the pacing of Sorkin’s words and Doyle’s camera along with the anger he feels not knowing how to deal with feelings. The relationship between Winslet and Fassbender though her loyalty to him and why he would listen to her and not others is never explained but because of the actors you accept that it is just what it appears.\r For excellent acting, snappy, sharp dialogue and above average unobtrusive directing plus award conversations “Steve Jobs” is a film to see."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant. This script is amazing and so far is my choice for Best Adapted Screenplay at the Oscars, and will be surprised if it isn't on Oscar night. The cast is great especially, Fassbender, Winslet, Daniels and Rogen. My favorite movie of the year so far. Go see it!"
    },
    {
      "rating": "7",
      "text": "Oddly structured around recurring arguments at three major product launches, it plays more like a stylized history lesson in parts. Still, the cast is phenomenal and the script is often exciting and funny even if it does dip into ridiculous melodrama."
    },
    {
      "rating": "9",
      "text": "When you've got a biopic with a great, acclaimed director like Danny Boyle, an absolute genius screenwriter like Aaron Sorkin, and a brilliant A-list cast, that instantly sounds like a recipe for a great film, and that's exactly what this film was! Michael Fassbender's a great actor and I always love his performances, but I honestly couldn't picture him taking on the role of Steve Jobs at first. However, I'm more than happy to say that he gives a performance that's without a doubt worthy of an Oscar nomination! Seth Rogen and Kate Winslet also gave memorable supporting turns and I really think they deserve Oscar nods for this as well. Sorkin's screenplay flows very smoothly with some great dialogue and back and forth exchanges between characters throughout. And Boyle's direction is as confident as ever. Overall, it's certainly not the best biopic, but I can say that it's definitely up there with some of the best films I've seen all year!"
    },
    {
      "rating": "3",
      "text": "A biopic that rings hollow and phony from start to finish. Yes, we're well aware of the title character's shady reputation from news reports and other films, but this stagey, pretentious, poorly written and at times needlessly cryptic account of his life becomes truly laughable and tiresome. Michael Fassbender's overwrought, constantly mugging for the camera performance screams \"I dare you not to nominate me for an Oscar for this portrayal\" (sheesh). Were it not for the solid supporting performances of Kate Winslet and Jeff Daniels, there would be nothing to recommend here. It's now easy to see why the early reviews weren't so kind to this release; it doesn't deserve the praise it has received since."
    },
    {
      "rating": "0",
      "text": "Great if you like drama, horrible if you appreciate anything close to the truth. This movie feels like it has a very personal vendetta, and may forever ingrain a false image of a man who was certainly not an evil genius."
    },
    {
      "rating": "8",
      "text": "Unlike the typical biopic, screenwriter Aaron Sorkin has set this one backstage just before the launch of 3 different products (Macintosh, NeXT, iMac). While the tech gets a nod, the focus is on the man and his relationships with 3 primary people (Steve Wozniak, John Sculley, his daughter Lisa). Sorkin has brilliantly combined a lot of information into a crowded, time-limited backdrop. Director Danny Boyle has added a frantic, intimate style to keep the focus on the people (all of whom are superb, esp. Michael Fassbender in the title role and Kate Winslet as his \"work wife\"). While demonstrating Jobs' genius, this film clearly shows his gruff professional style and challenges with relationships. A fascinating, informative and compelling glimpse into his life."
    },
    {
      "rating": "9",
      "text": "If you go into this movie expecting a film about Steve Jobs numerous achievements in the world of technology, this isn’t quite that movie, this is more a movie about Steve Jobs the father. The film is anchored by terrific acting, character development, and pacing, which help make the film quite enjoyable. The story revolves not around Jobs entire life, but 3 separate events, and the minutia of the rest of his life, the structure to clarify is similar to last years Birdman, and the film is very different from 2013’s Jobs.\rThe acting in Steve Jobs is superb, perhaps most impressive of all is Kate Winslet’s performance, as through most of the movie she transformed into her character, as did Michael Fassbender. Michael Fassbender will surely receive an Oscar nomination for this performance, as he literally transforms before the audience’s eyes. Jeff Daniels is as was expected reliable and equally as great, but may get drowned out by the other performances. The other notable performance was that of Seth Rogen, who made a turn for the dramatic, and hit a home-run, completely selling himself as Steve Wozniak.\rThe plot of the film is character driven, and in many ways the greatest strength of the film is the character development, especially that of Steve Jobs. Boyle and Fassbender perfectly capture the psychotic, frenetic, genius, bipolar attitude of Steve Jobs, while also showing a great character arch, as he evolves as a person. The film could have been a little too melodramatic, but the direction and acting save it. The acting and character development also help form the surprisingly frenetic pacing of the film. The film is paced like a day in a beehive, where every character is running in circles, never taking a moment to breath.\rOn top of all of the acting, character development, and pacing the film is also funny, at times touching, and different from the other Jobs films. The film represents an award caliber performance by screenwriter Aaron Sorkin, director Danny Boyle, and most of the cast. The only complaint may be the film’s computer and business lingo is occasionally, not often but occasionally, too confusing for a non computer whiz to understand. Using great character development, acting, and pacing Steve Jobs is another great entry in Danny Boyle’s ever impressive filmography."
    },
    {
      "rating": "9",
      "text": "Who: Michael Fassbender, Dale Denton, and that girl in Titanic who was too selfish to share her door with a drowning Leonardo DiCaprio\rWhat: An enjoyable film similar to The Social Network but not quite as good\rWhere: The auditoriums where Steve Jobs' three most iconic product launches took place\rWhen (can I watch again): 1-2 months\rWhy: If you thought The Newsroom was cancelled prematurely, and Kelso from That 70's Show is not an adequate portrayal of a genius billionaire/entrepreneur, then this movie is for you"
    },
    {
      "rating": "10",
      "text": "Extremely well told story in a unique method. Didn't slant his personality one way or the other. It was intense from the beginning to the end. Pulled back the curtain on the life of Steve Jobs."
    },
    {
      "rating": "8",
      "text": "Steve Jobs takes us behind the scenes of the digital revolution, a portrait of the man at its epicenter. The story unfolds backstage at three iconic product launches, ending in 1998 with the unveiling of the iMac.\r Directed by Danny Boyle, from a screenplay by Aaron Sorkin, this biopic could easily have been David Fincher at the helm starring Christian Bale or Leonardo DiCaprio, but settling on Boyle to direct and Michael Fassbender as the Jobs is no slack reshuffle. I went in with low expectations despite the quality in cast and crew, due to reports of a limited release now cancelled in the US. As a tech fan i feel it's came too soon, only two years since the poor Ashton Kutcher effort and five years since the death of Jobs.\r However, despite those criticisms, Boyle and Sorkin have created a highly entertaining drama. Although Fassbender may not look like the Apple mastermind, the mannerisms, voice and overall performance are spot on. You believe him as the arrogant visionary behind the products who will bully his team so he can have his face on Time magazine. Yet we also see the reluctant father, finding it difficult to break down emotional barriers, and eventually making it right with his daughter before it's too late.\r The solid supporting cast includes Jeff Daniels as CEO John Sculley, Seth Rogan as the co-founder and betrayed friend Steve Wozniak, but i was most impressed with Kate Winslet's role as Jobs' right hand marketing woman Joanna Hoffman, chatting and arguing in a soft Polish accent mixed with American English. All of them bounce and clash with Fassbender's commanding Jobs, almost like a dance of egos.\r Most biopics take artistic license to tell a story over reality, and that nagging feeling never really leaves when watching this. However the unconventional narrative and structure presented here is what makes it stand out. The film is broken into three segments, each filmed in a different format. The Apple Macintosh launch in 1984 is filmed in 16mm, the NeXT computer reveal of 1988 is in 35mm, and the iMac event from 1998 was filmed in today's digital format. It's not obvious at first but certainly will be appreciated in repeat viewings.\r There is of course a slight repetitiveness to the events but the two hours runtime flew by. The intense tone comes and goes, with great dialogue and humour. The retro, synthesised score matches up brilliantly and plays a big part for key scenes, sometimes beating softly and other times reaching a crescendo.\r Danny Boyle's 'Steve Jobs' is a tribute to a man that was difficult to figure out, second guess. It's a window to a time in our recent history, so important to our future, shaped by someone we'll never see the likes of again within the tech industry."
    },
    {
      "rating": "10",
      "text": "Steve Jobs is a amusing archetype of biopic movie history. It's a movie mitochondria. Best acting. Best climax. Best settings. Best effort. It can win so many oscars and golden globes and I guarantee it will. The point of view looks so significant."
    }
  ]
}