{
  "id": 598,
  "title": "Stillwater",
  "starring": [
    "Matt Damon",
    "Camille Cottin"
  ],
  "runtime": 139,
  "genre": [
    "Drama",
    "Crime",
    "Thriller"
  ],
  "description": "Bill Baker, an American oil-rig roughneck from Oklahoma, travels to Marseille to visit his estranged daughter, Allison, who is in prison for a murder she claims she did not commit. Confronted with language barriers, cultural differences, and a complicated legal system, Bill builds a new life for himself in France as he makes it his personal mission to exonerate his daughter.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cPdmPwcIcmu0ugfKcdFtI3vmOJq.jpg",
  "categories": {
    "plot": 6.096774193548387,
    "acting": 6.483870967741935,
    "ending": 6.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Loved it and still thinking about the movie. I was suprised in a very positive way about M. Damons Acting. Great Score as well by M. Danna."
    },
    {
      "rating": "9",
      "text": "Well worth the 9/10 I gave it. Gripping and emotionally heavy. In a good way."
    },
    {
      "rating": "10",
      "text": "I fully enjoyed this film.  I saw it in a real movie theater, not on my couch [where I have been viewing many films over the past year due to the pandemic].  It was engaging and engulfing from the get go.  Some of us prefer a slowly developing format with twists and turns.  The acting performances were stellar.    From reading other reviews, it appears people do not have patience for a story to unfold at its own pace,  and prefer fast action and violence.   It is loosely based on a true story, but does not present itself as art imitating life.  It was refreshing to see a good drama on the big screen."
    },
    {
      "rating": "8",
      "text": "Feels real. Sometimes too real. It's a movie that left me wishing it would take a left turn into a Hollywood cliché to make everything alright. It refuses and ends up being a slice of life on film. Someone wrote that it feels like you spend real time with real people going through some really tough sh*t. I couldn't agree more. I liked spending that time with these people."
    },
    {
      "rating": "9",
      "text": "Matt Damon is amazing. Its good to see him back in the drama genre he does it so well!. Really enjoyed the movie."
    },
    {
      "rating": "5",
      "text": "Decent performances and some good drama, but the audacity to be 140 minutes when the story can really only justify 100 of them weighs things down."
    },
    {
      "rating": "6",
      "text": "I can't say I didn't enjoy parts of this, but it wasn't the plot. Amanda Breslins character was poorly written and poorly acted. Damon was generic Murican, though he did have the stoic resolution of a man whose been thru some sheeit. I did love Virginnie and Maya. They were gems in a otherwise lackluster legal thriller? Camille Cottin is gorgeous and magnetic."
    },
    {
      "rating": "8",
      "text": "A beautiful film where the time is taken to thoroughly explore the story of the main character. While the story gets off to a slow start, it is eventually expanded into an emotional portrait. Mat Damon plays excellently and gives his character weight within the plot.  The realistic ending ultimately makes it an excellent film. Just don’t expect a action filled plot."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "0",
      "text": "is just so so bad not worth any scrap !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "Movie of the year material.  The acting is absolutely first class.  There is the perfect amount unsaid and answered to leave you dizzy with excited concern.I think this is my first movie review, I was prompted to leave this comment after looking at the Metacritic aggregate reviews and in particular reading the Guardian's review.  In my opinion whomever wrote that was not present during the movie: - as an the attempted suicide scene underpins Bill's abduction of the boy- one of the final moments between Bill and his daughter in the kitchen really gets to the crux of the attempted suicideWatch this movie when you have the appropriate time & focus, this is a big, heart wrencher. Dim the lights and enjoy."
    },
    {
      "rating": "7",
      "text": "Lacking the high octane action of the previous installments, This time we meet a more sedate Jason and travel with him to Marseille as he tries to unravel the conspiracy of his daughters incarceration.While not as exciting as it's predecessors it is still a great 6th installment to the Bourne series, there is clear effort made by the writers to return Stillwater to the roots of the Bourne series and this movie almost entirely glosses over the non-sensical events of the 5th film in which Jason had became trapped on Mars."
    },
    {
      "rating": "5",
      "text": "Stillwater follows an interesting drama concept overshadowed by Matt Damon's lead casting. Ultimately it seemed a solid concept spoiled by the need to provide a 'complete' ending. Though it was enjoyable and clearly well produced with a fantastic cast, the screenplay just never quite sat right with me."
    },
    {
      "rating": "6",
      "text": "When it comes to writer-director Tom McCarthy's latest offering, one can't help but wonder, is this the story of an amateur crime investigation or the touching tale of a father with a past seeking redemption? Well, it appears to be some of both and not much of either. Based loosely on the headline-grabbing story of American college student Amanda Knox, who was falsely convicted of murder and imprisoned in Italy, this fictional work employs a similar narrative, with the venue relocated to France and supplemented by the accused's roughneck Oklahoma dad seeking to find the perpetrator in the slums of Marseilles. In the course of his investigation, he meets, befriends and moves in with a single mother and her young daughter, who help him with his sleuthing and provide him with an opportunity to redeem himself for past transgressions and oversights. However, these two story threads don't mesh particularly well and never quite engage the audience as effectively as they could have. And, despite the excellent lead performance of Matt Damon and the fine supporting portrayals of Camille Cottin and Lilou Siauvaud, any speculation that this overlong saga could be an early Oscar contender is significantly overblown. The film has also drawn considerable criticism from Ms. Knox, who contends that the production is profiting from her story and conveying false impressions about her character and reputation, despite official claims that this is purely a work of fiction. In any event, \"Stillwater\" falls far short of expectations in many respects, and viewers would be wise to bear that in mind before taking the time to give this one a look."
    },
    {
      "rating": "6",
      "text": "You could be forgiven for thinking this is one of those Liam Neeson-esque movies where he punches his way through all the bad guys in order to rescue his daughter/wife etc. Stillwater is a much more toned down movie than the trailer would have you believe.Bill (Matt Damon) flies out to Marseilles to visit his estranged daughter Allison (Abigail Breslin) who is currently in prison for the murder of a college student she was sharing an apartment with. Allison is insistent she did not commit this crime and is trying to get the investigation reopened. Bill is determined to prove his daughter’s innocence and starts some of his own investigation into a possible new lead. He soon realises that as an American navigating his way through Marseilles with the language barrier and culture shock is more difficult than he imagined. If you feel this idea rings a bell, it is very loosely based on a real life case, there are some similarities but Stillwater has no “based on true events” quote at any point nor does it claim to have any connection with real life events.There’s a few themes running at once, and it’s drifting between family drama and legal thriller. Damon’s character particularly as the out of place American going through a journey as he spends more time in Marseilles and develops a friendship with Virginie (Camille Cottin). Bill could have been a difficult character to pull off and have the audience sympathize with and care about. With a different actor it could have been a disaster but Damon was 100% the right choice. I liked Stillwater for the most part but at almost 2 hours and 20 minutes, it’s far too long for this type of film. It’s very drawn out and a bit dull in places. There was no need for it to drag on so much and could have easily lost 20 minutes. That aside the performances from Damon, Breslin and Cottin are the strongest thing you can take from Stillwater and really hold the film together. Recommended."
    },
    {
      "rating": "6",
      "text": "My expectations were perhaps too big in the face of the very basic drama that Tom McCarthy ends up delivering.All the execution, drama, tension and mystery are from inside the box. There's no outside thinking for more engaging ideas.Even Matt Damon's good performance is just normal and moderate, nothing exceptional, just him doing his job in a good way.While Abigail Breslin isn't given much that she can explore and it's understandable, because Damon is the star, but certainly everything around him is too conventional and one-dimensional.The drama is entertaining, it's true, but it's also absolutely ordinary.What it builds is totally predictable, this even despite the quality.That's why Stillwater feels like a movie that plays all its card in the safest way possible, and never tries to risk anything.Only the conclusion gives it a different depth because it gives another perspective to what Damon's character risked, but that's only in the final minutes. By then it's already too late to improve its impression"
    },
    {
      "rating": "6",
      "text": "(Mauro Lanari)The relevance of this latest film by Tom McCarthy does not lie in its comparative comparison between the two transoceanic cultures: despite an exhausting and devoid of sobriety style, it opposes the drift of Hollywood and the Damon of \"The Last Duel\" towards the quicksand of the political correctness: the lesbian daughter is a murderer and at the moment it is the  bravest twist that today's cinema can and must afford."
    },
    {
      "rating": "6",
      "text": "1. Stillwater reminds me of The Edge of Heaven(2007).They seem to have extended the final third of The Edge of Heaven for 140 minutes!2. In Stillwater there are two presuppositions of the story. The first half of the film is about one of them and the second half is about the other. This makes the ending of the film emotionally confusing. \"Savior Father\" and \"Man in a New Life\" could have overlapped, but now the film is fragmented."
    },
    {
      "rating": "6",
      "text": "The first 2/3rds of this movie are really good, and well written. I found myself sympathasizing w/Matt Damons character. And I liked how well written his daughters character possibly wrongly stuck in prison.  I even liked the single Mom and wise beyond her years daughter and how they basaically adopted this stranger in a strange land.  But then in the last act? Matt Damons character loses his mind, and the movie goes off the rails. I liked 2/3rd of it, but the last half hour or so really disappointed me and didn't fit the rest of the movie."
    },
    {
      "rating": "5",
      "text": "It was a good movie to watch. This movie had some good points and some bad points.Good Points: Matt Demon was excellent and thoroughly convincing as Bill. His character development and performance were brilliant. There were some good emotional moments and the love plot was too good.Bad Points: This movie was 2 hours long and most of the time was spent on the love story and character development. They almost forgot the crime and thrilling part of the movie. Also, the ending was rushed and unsatisfying. It was boring as the first act was too long and they drag the movie without any reason."
    },
    {
      "rating": "7",
      "text": "How to survive in France, step by step, without stamps of cliché.It's not the best, but kind of trying to be."
    },
    {
      "rating": "1",
      "text": "The female lead and her daughter were great and she carried to story.  The story could of been amazing.  Matt Damon was awful.  His daughter was unlikeable. They should of built out the love story between her and the middle eastern lover more. You really didn’t care one way or the other is Matt or his daughter lived loved or died. They made Americans look bad and it just wasn’t realistic at all.  Roughnecks make A LOT of money. Any American who makes 150-200k a year could afford 12,000 dollars for a private detective.  It wasn’t realistic in the slightest.  Matt Damon is carried bc his mom works at Harvard and he is part of the A lost friend circle but he ruined this movie. Another actor could of done amazing things with this material."
    },
    {
      "rating": "8",
      "text": "Naturalistic in its pacing, writing, performances and direction. Avoids the expected fish-out-of-water tropes of “A roughneck in Marseille”. An odd, slow combination of family drama and thriller. Matt Damon is endlessly watchable and I was excited to see Camille Cottin shine whilst avoiding the camp of her Call My Agent role. Beautiful. Loved it. Stays with you for a while."
    },
    {
      "rating": "10",
      "text": "Good movie. Not many people deserve a father like the one portrayed by Matt Damon. Simple man with good upbringing, down to earth and brave."
    },
    {
      "rating": "7",
      "text": "It is a film with a somewhat bad aftertaste. Matt Damon plays a bumbling father. In order to save his daughter from being convicted, he also makes mistakes and loses many things. It makes me think that life is all about the little mistakes we make that cause us to fall."
    }
  ],
  "recommendations": [
    "the_unforgivable",
    "the_accountant",
    "white_boy_rick",
    "child_44",
    "donnie_brasco",
    "prisoners",
    "beirut",
    "arbitrage",
    "into_the_wild",
    "gone_baby_gone",
    "the_good_shepherd",
    "the_place_beyond_the_pines",
    "knives_out",
    "me_before_you",
    "hereafter",
    "predestination",
    "a_most_wanted_man",
    "widows",
    "gone_girl",
    "before_i_go_to_sleep",
    "manchester_by_the_sea",
    "flight",
    "the_curious_case_of_benjamin_button",
    "the_lincoln_lawyer",
    "the_intern"
  ]
}