{
  "id": 3047,
  "title": "Still Alice",
  "starring": [
    "Julianne Moore",
    "Alec Baldwin"
  ],
  "runtime": 100,
  "genre": [
    "Drama"
  ],
  "description": "Alice Howland, happily married with three grown children, is a renowned linguistics professor who starts to forget words. When she receives a devastating diagnosis, Alice and her family find their bonds tested.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yY6ypZPQl67J4RwOA6YBALNS3Wj.jpg",
  "categories": {
    "plot": 7.344827586206897,
    "acting": 7.578947368421052,
    "ending": 7.428571428571429,
    "soundtrack": 9.5,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.6,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Beautiful and powerful movie. A stripped back and realistic performance from Julianne Moore, yet it has as twice as much impact as any performance i have seen in a long time. Beautifully supported by a strong cast, the most powerful scenes are with Kristen Stewart, who plays the free-spirited daughter that Alice has found the hardest to relate to due to their different career interests. Yet, it's Lydia who proves the most capable of supporting Alice in her time of need. There is really no need to go into any more detail. It's a simple story, well told.  Sad (bring tissues) yet it is an important reminder of how lucky we are to have good health and how devastating alzheimer's can be. See it!"
    },
    {
      "rating": "9",
      "text": "Terrific performance by Moore; the film displayed the debilitating effects of this dreadful affliction in a poignant yet never cloying way. The only negative was the dreadful performance of Kristen Stewart, who really should stay in kiddie vampire romances as she doesn't know how to act."
    },
    {
      "rating": "7",
      "text": "Julianne Moore gives a convincing performance that gives the movie some life. As the movie progressed it became more and more engrossing even if it didn't reach its full potential on a hard to talk about topic."
    },
    {
      "rating": "7",
      "text": "Much as I like Julianne Moore as an actress, I was not going to watch this movie because I thought it was going to be predictable and depressing. Turns out it was neither... well, actually rather melancholic but not depressing. The slow fall of the Moore character into Alzheimer is described with tact and realism. I was also pleased to see that for once the Academy awarded the Oscar to an actress truly deserving it. The supporting cast was also good, inclusive of Stewart who proved to be a better actress than I thought."
    },
    {
      "rating": "9",
      "text": "Julianne Moore has most certainly locked up her first Oscar with this performance, if there's any justice in awards shows (which, of course, there is not). The closest to her is Marion Cotillard in the outstanding Two Days, One Night. But Moore is entirely convincing in this daring role. The plaudits lobbed at actors who portray those with disabilities and afflictions are the subject of criticism, but this didn't strike me as that type of role. She (with the help of terrific writing and directing) really nail the human side of this terrifying illness."
    },
    {
      "rating": "7",
      "text": "With a lesser actress in the lead, this movie would be a dull bore. Julianne Moore is the glue that holds this otherwise messy film together. With a better script and bolder direction, this might have been great."
    },
    {
      "rating": "5",
      "text": "Very pedestrian but watchable TV movie treatment of frightening subject with good acting but not very deep emotionally and nothing exceptional as a film."
    },
    {
      "rating": "5",
      "text": "A difficult film to dislike, \"Still Alice\" has its heart and head in the right place. Julianne Moore's performance, as always, is terrific. However, on the whole, it falls flat.\r This story of a brilliant, vital women afflicted by a rare, congenital form of early onset Alzheimers fails in not fully exploring the emotion in the relationships between her and family, particularly hubby Alec Baldwin. Adding to the gap between audience and film is an excess of documentary education regarding this awful disease. All that and the redolence of Oscar bait.\r Plainly, hubby acts a moron. His motivation in the midst of his wife's swift decline is a plum new job. He literally abandons her to move to Minnesota from New York. Throughout he is neutral by maintaining a cold, clinical outlook. He speaks nary a word regarding the intellectual and emotional loss of a wife he's spent decades beside. The filmmakers, either intentionally or not, portrayed his exit as a convenient way to move on. The tears he sheds before splitting smack of relief, not grief.\r It's not only hubby foregoing real emotion. Moore's eldest, pregnant daughter reacts with an \"It's okay\" after discovering she has the gene and is doomed to a similar fate. While hysteria would push the story into unwanted melodrama, the non-reactive portrayal is similarly unwanted.\r Moore's great concern with her youngest daughter is nagging about eschewing acting for the stability of a college education. It is this daughter who volunteers to caretake Mom. An odd final scene finds the daughter reading the play \"Angels In America\" to a far gone Moore. As if trying to wring something from her she is unable to give, the daughter asks, \"What is the play about?\" to which Moore haltingly replies, \"Love.\" \"That's right. Love,\" the daughter replies. Saying 'Love' does not infuse a story with the emotion. Showing love does, and it's absent here. Those close to Moore simply look at her with a morbid curiosity reserved for strangers.\r Moore's decline is heartbreaking, particularly when a pre-planned suicide fails. It's a shame she's surrounded by matter-of-fact robots.\r Audiences should not be required to fill in blanks of emotion between Moore and others. There have been far more affecting Disease of the Week made for TV movies. Disconnecting to emphasize the least important aspects of dealing with a person afflicted by this awful disease is more tragic than this story."
    },
    {
      "rating": "7",
      "text": "A terrific vehicle for lead actress Julianne Moore, who gives one of the best performances of her career, and a highly informative and enlightening examination of a truly heartbreaking health condition. However, nearly everything and everyone else on the periphery of these elements feels a little underdeveloped, which doesn't exactly encourage audience involvement with the story or the characters to the degree one would think a film like this would engender. Overall, a good film, but one that doesn't quite ascend to the level of greatness to which it aspires."
    },
    {
      "rating": "9",
      "text": "Another amazing film    ."
    },
    {
      "rating": "7",
      "text": "Dark and very real, Still Alice hides no pains about dealing with Alzheimer's disease. Julianna Moore plays the lead character to perfection and steals the movie and probably an Oscar. Moore let's the viewer know what it is truly like to live with this disease and thus in doing so makes the movie worth watching. Supporting turns by Alec Baldwin and Kristen Stewart give the movie just that little extra boost of realism that makes the movie a true treat to watch if you're looking for a film that deals with the topic."
    },
    {
      "rating": "1",
      "text": "I want my money back. This was the most depressing film we attended this year or last. There was no real emotions shown by the actors or actress. The film used may be recyclable. Having family the suffers from metal illness from aging this movie did not speak to that or the future."
    },
    {
      "rating": "8",
      "text": "\"Still Alice\" stars Julianna Moore, Kristen Stewart, Alec Baldwin, Kate Bosworth and Hunter Parrish. The film  was directed by Richard Glatzer and Wash Westmoreland and is based on the book by Lisa Genova who together with Messrs. Glatzer and Westomoreland wrote the screenplay. This is a difficult movie to watch yet a necessary part of the education the general public needs to get in order to understand Alzheimer’s Disease and the effect it can have the victim as well as those around him or her. Ms. Moore is outstanding in this most difficult role as she and the creative cinema photographer take the viewer through the early and then almost full blown stages of the disease. It is certainly not comfortable to watch the deterioration of any individual, let alone a vibrant and once sparkling character played so admirably by Ms. Moore but intellect and curiosity compel us to stay with it.. This is more of a scholastic exercise rather than an entertainment vehicle and could well be mistaken for a promotional film displayed at a fund raiser for the Alzheimer Association. Although the film will probably not do well commercially because of the subject matter and the scenes portrayed in it, it nevertheless is a \"must see\" for anyone interested in understanding the illness and the fact that statistically so many of us will face its impact, either directly or indirectly. I give the film an 8, not only for the performances of the actors, but for the information contained in it and the sensitive manner in which it is conveyed."
    },
    {
      "rating": "8",
      "text": "Julianne Moore is in almost every frame of this film, often in close-up, and she makes it mesmerizing. She plays an accomplished linguistics professor, who is diagnosed with early onset Alzheimer’s. Needless to say, with a subject like this the journey is intense and it focuses closely on Moore's slow struggle to maintain her mind and retain the relationships with her husband (Alec Baldwin) and 3 children. The supporting cast is strong and the directing duo has fashioned a sensitive story. It does occasionally feel the need to provide us factual information about the disease, but mainly stays on course with many downer moments and lots of tears. This is not a great film, but it is a great performance."
    },
    {
      "rating": "10",
      "text": "Movies can be important and make people think about serious issues and the human side of it. good filmmakers don't need to make it artsy or weird to bring to it the quality and substance dialogs to make it more than a \"Hallmark type more\".\rStill Alice is an outstanding character driven movie,  with its precise tone music score, simple but elegant Cinematography with incredibly amazing performances. The support characters are really there to support the main character and the support actors really até conscious of that, making the outstanding job of gives to Julianne Moore all the conditions for do we job. Kristen Stewart,  as always, go along, at the same level, with the monster actors and actresses of our time.  The scenes between her and Moore are the best of the movies. There are so deep, real and simple. They really are living the moment. All the other actors do an amazing job to. Great Ensemble cast.  Moore do her thing as always. What an amazing actress.\rSo.. Still Alice is one of the best movies of 2014 and between the best movies of all times about serious and important diseases that affect hugely all human beings.\rI, as a 54 yrs old woman with a familiar history of dementia and minor autism,  could not be more affect and freaked out. The book was very difficult for me to read but the movie did justice to it.\rDon't miss it. Go and see Still Alice! If not just to watch Julianne Moore and Kristen Stewart to give outstanding performances."
    },
    {
      "rating": "7",
      "text": "It is a drama about how an extremely bright and relatively young person loses\rher memory to Alzheimer disease. Julianne Moore is starring in this movie, and she is fantastic.\rShe carries the whole film; without her it would be just mediocre. No wonder she won Oscar's Best Actress for this role.\rShe deserved it."
    },
    {
      "rating": "10",
      "text": "Julianne Moore is finally getting her Oscar. Her character really affected me. I keep going back to Alice every time I suffer a memory lapse, which is quite frequent at my age of 60. She did an excellent job of showing the symptoms by the despair and agony of the disease. The supporting cast completed the picture of how the entire family suffers."
    },
    {
      "rating": "6",
      "text": "Still Alice is a walk through the impact of Alzheimer’s disease, not only on the patient but also on his family. As the story goes by we see the protagonist facing the different steps of an illness: first denial about the possibility and desperation to uncertainly, second fall apart at knowing the diagnosis and third, acceptance and surrender to the disease. Then we have the family,  with each one of family members we notice distinct ways to cope. The changing of expectations on what she can or can't do, moving on with one's life, stepping aside and staying for the time remaining. Either way it's possible to empathize with this scenario. Julianne Moore gives a brutally realistic performance, reaching unimaginable levels of depression, with a climax at the scene of the speech. The problem is the passiveness in which the story is told, making it very hard to follow, really an exhausting movie (but hey, that's life with a sick relative)."
    },
    {
      "rating": "7",
      "text": "Rather surprisingly I found out this little film is opened in Cairo this weekend, just after Moore’s Oscar triumph, as happiness often befalls unexpectedly, one year ago, I would never imagine this could happen to my favourite actress, at an age considered as the dead-end for most actress, she manages to pull off a such a landslide victory for late bloomers, more unbelievable is that it is from such a low-key director-team Glatzer and Westmoreland, whose previous Errol Flynn biopic THE LAST OF ROBIN HOOD (2013) is a total fiasco.\r Life is always unfair, in BIRDMAN (2014, 8/10), the has-been actor Riggan Thomson motives himself with a hip mantra “sixty is the new thirty”, but not for for Dr. Alice Howland (Moore), a linguistic professor at Columbia University, who has just passed her 50-year-old birthday, her life will slump into the worst scenario due to the early onset Alzheimer’s disease. Her previous perfect life, with a loving husband John (Baldwin), three grown-up children with the forthcoming twins from her eldest daughter Anna (Bosworth), plus a plum profession, will all be predestined to plunge into a void.\rkeep reading my review on my blog, google: cinema omnivore, thanks!"
    },
    {
      "rating": "8",
      "text": "The journey of Alice as she slowly slips into early-onset Alzheimers is a tough one to watch because of Moore's amazingly realistic performance. She more than desire any and all praise she received for her role and I'll give a shout to Baldwin as well because he did a great job playing Alice's husband. I guess Moore's powerhouse performance just overshadowed him but that's how it is when you are up against one of the best performances of the year.So with that compelling story and great acting by the cast, It really does make Still Alice a must watch. My only issue with the film was that the pacing kind of dips in and out, Especially in the second half."
    },
    {
      "rating": "7",
      "text": "Julianne Moore gives a complete embodiment of one of the most devastating and tragic diseases known to man. We instantly feel for this woman, her life and her family. Still Alice is written poetically and realistically--reflecting not only on true life but also what is ultimately desired."
    },
    {
      "rating": "8",
      "text": "“Still Alice” is a very difficult film to watch not because of the subject matter but because Julianne Moore inhabits the persona of Alice so you feel, and see, everything that is happening, and what will happen, to this woman.\r Alice Howland is a very successful linguistic professor at Columbia University in New York who has written books on language and traveled the world teaching it. She and her equally successful husband, John (Alec Baldwin) live in a brownstone in which they have raised their three children, now on their own paths, and have a summer home on the shore. In everyway she is successful as a professional, a mother and a wife.\r Very early in the film Alice, at the age of fifty, is diagnosed with early on set Alzheimer’s which it turns out is genetic and there is a 50 percent chance of their children contacting it and, after testing, one of the children tests positive. The screenwriters/directors Richard Glatzer and Wash Westmoreland dismiss this angle in the movie instead concentrating on Alice and Moore comes through with a devastating performance. By the end of the film you will know what it means to have Alzheimer’s, what and how it takes everything from you. Wordlessly, with a look, the changes in her face, the awareness of what she will lose before she loses it, is upsetting because we know what she had and she no longer does.\r The film rightfully concentrates on Moore but the screenwriters don’t help her in not filling out the roles of her husband and children. We know her husband loves her because he tells her but Baldwin is a good enough actor to show us with little touches here and there. Her children, played by Kristen Stewart, Kate Bosworth and Hunter Parrish, are normal, well adjusted children which at times can drive a parent crazy and there is one scene where Moore uses that old line, “….I can because I am your mother,” that has the audience laughing. The conflict between a mother and daughter is briefly touched on just as the sibling rivalry between sisters is but neither are fleshed out.\r The film is not all sadness and tears, with little bits of humor here and there, but we share the few triumphs Alice has along the way just as in two scenes we are afraid to breathe.\r For those who haven’t dealt with Alzheimer’s in their family this is a learning experience of what has happened with 45 million people in the world going through this debilitating disease and what their loved ones have to deal with.\r Julianne Moore has deservedly earned 4 Oscar nominations along the way and with her 5th in “Still Alice” she is deserving of getting that statue that has eluded her."
    },
    {
      "rating": "5",
      "text": "\"Still Alice\" is a frustratingly plotless film that hangs delicately from two thin threads -- its truly remarkable lead turn from Moore and its worthwhile supporting cast."
    },
    {
      "rating": "8",
      "text": "Handicapped by an inauspicious trailer which affords it the injustice of looking like a disease of the week TV movie, this is actually a small but surprisingly well-wrought drama. Oscar winner Julianne Moore gives an affectingly subtle performance as a 50 year old woman suffering the onslaught of Alzheimer’s. Through the course of the running time she manages to convey the effects of this terrible disease without resorting to histrionics or mawkishness. Her rapid deterioration is utterly believable and the screenplay manages to avoid the obvious clichés that this kind of movie can be prone to.\rAs her daughter, Lydia, Kristen Stewart does a great job of holding her own when on screen with Moore. The film successfully paints the picture of a fractious relationship between mother and daughter which only begins to repair due to the unforeseen and tragic circumstances. Only Alec Baldwin lets the side down with a bland and colourless turn as Moore’s unemotional husband. However, Moore is too good an actress to let him sabotage her film."
    },
    {
      "rating": "6",
      "text": "Julianne Moore is the center of STILL ALICE and it is her lack of all artifice that makes STILL ALICE quite powerful. The film is directly about alzheimers but ultimately about the loss of self that disease hurdles upon its victims. It's a terrifying film that induces tears because it is so matter of fact and not shy about those facts. If Moore is wonderful, Kristen Stewart is quite a revelation. She brings a depth and truth to her role as Moore's daughter which the other actors simply cannot deliver. And hence the problem with STILL ALICE. For all it's remarkable directness, STILL ALICE cannot resist a cliche and those cliches undermine far too much of the excellent work."
    },
    {
      "rating": "8",
      "text": "We all deteriorate one way or another. What we call \"normal people\" do it through age; we get older. Others do it by injuries [emotional or physical] but one of the most painful ones is through disease. Alzheimer is one of them, and what Julianne Moore teaches us here is the recreation of an almost-real, but definitely sharp, strong and emotional representation of what it is about."
    },
    {
      "rating": "8",
      "text": "Julianne Moore brings in an excellent performance and a deserving oscar win with her role as Alice. The film is emotionally distressing to watch at times with the heartbreaking-ly realistic performance by Moore. The supporting cast is overall pretty great also and the script flows relatively smoothly throughout. The films symbolism and adumbration was pretty well done also being evidently clear to see but not too obvious it took away from the viewing. The ending was always going to be hard to do for a film like this but Glatzer wrapped it up reasonably well, but wasn't what i thought was best. There was a few little blips every now and then that kind of slowed the films story telling but this film cane across well due to the emotion it brings along in its performances. A very well done film that i believe respected the films subject matter Alzheimer's."
    },
    {
      "rating": "7",
      "text": "A good film that deals with its topic maturely and sensitively, Julianne Moore carries her character gracefully and wholly convincingly. I also don't want to pass up the opportunity to give Kristen Stewart some rare praise, as she takes on a role far better suited to her than most, though it isn't an overwhelmingly challenging one.It's unfortunate that in spite of the film's overall integrity, there are some scenes that look like they were extracted directly from a Lifetime daytime TV movie. Otherwise, the film is a fairly simple but most effective examination of Alzheimer's Disease."
    },
    {
      "rating": "8",
      "text": "A great and interesting character study. Still Alice is a pleasant surprise; Julianne Moore shines bright in this film and is constant-as-a-northern-star in this film."
    },
    {
      "rating": "7",
      "text": "A highly successful novel making its way into theaters, 'Still Alice' is an extraordinary family drama written by  Lisa Genova. Julianne Moore performance as Dr. Alice Howland is exceptionally wonderful. Her performance in the shoes of 'Alice' proves that she is a prefect match for Academy Award 'Best Actress'. A 100 minute drama is based on a linguistic professor 'Dr. Alice Howland' who develops an early onset of Alzheimer's disease and starts forgetting the words, places, incidents and also people. She has a beautiful family with a troublesome youngest daughter Lydia played by Kristen Stewart. This 100 minute journey shows the decline of Alice from a brilliant lexicon to a dreadful Alzheimer patient. For the first 80 minutes, it is a terrifying portrayal of Alice where one gets doubt on oneself that he/she is having Alzheimer's disease, but the last 20 minutes is long heinous drama in the family for which one can simply walk out of theater.The appreciative thing in the movie is Julianne's performance and also the technical team who were behind this movie. Some extraordinary locations like the beach, campus of Columbia University are well pictured and also awfully directed. It is a one time watch but if you like  Julianne's performance you can have it for more than 10 times. Its just 'Julianne', 'Julianne' and 'Julianne'."
    },
    {
      "rating": "7",
      "text": "The movie itself has nothing incredible but the story about a mother, wife and acclaimed teacher who eventually loses everything she achieved because of Alzheimer is really moving. Getting to see the family reaction on this terrible disease was a very interesting move and Moore is stunning in the leading role."
    },
    {
      "rating": "8",
      "text": "A truly strong performance by Julianne Moore - this is a beautifully told story, well written and with great performances from Alec Baldwin and Kirsten Stewart."
    },
    {
      "rating": "8",
      "text": "This is a solidly produced film about an illness's devastating effects on a human being.  Moore's performance Is very skilled and moving, and Kristen Stewart is well cast in her role.  The film manges to avoid excessive mawkishness, while still providing emotionally powerful moments.  I give the director a lot of credit for a particularly suspenseful scene that manages to twist the audience into rooting for the protagonist's death, not the kind of experience one expects from a mostly conventional disease drama."
    },
    {
      "rating": "9",
      "text": "Julianne Moore's performance is stunning. It's authentic to the degree of heartbreaking, and fits perfectly into the plots. Moreover, while giving a great performance like that, Julianne does a terrific job harmonizing with the other casts, especially Christen Stewart, who plays her maverick little daughter.This makes the role she plays even more convincing. A simple story line yet very moving and elegantly presented. A must-see.\r By the way, I'm pretty surprised that the music score of the film is so little discussed. It's very beautiful and measured."
    },
    {
      "rating": "7",
      "text": "Forgetting something has to be the most annoying and stressful thing that a person could have, but losing your memory by a disease and becoming coming pretty much brain dead is even worse and this movie plays it out very well, because the movie feels real and not fake like other movies that try to do that.\r The story is about a Linguistics professor in a loving marriage with three grown children starts to forget certain words. After meeting with a doctor, she receives a devastating diagnosis, one that will test the bonds between her family.\r I always love it when a movie that I never know existed could make me glad I saw it and happy that it exists. I'm always looking forward to the big blockbusters that everybody's talking about and wouldn't shut up about. I always look past those kind of movies that are actually pretty than the entertaining blockbuster's and like always I feel like moron for skipping them.\r Still Alice has to be the most extraordinary film that I watched this year, in a way that the movie could had scenes where it would have dragged out or slowed down extremely, but that all was over shadowed by the amazing performance from a Oscar worthy Julianne Moore and the fantastic writing.\r Julianne Moore takes this role has a mother who slowly losing her memory by Alzheimer's disease, and Moore knocked it out of the park as she makes a beautifully crafted performance that just boosted up her career as a actress.\r The cast members like Kristen Stewart, Alec Baldwin and Kate Bosworth all did fantastic performance as well. Overall the performance were good in the film.\r The writing was just spot on great and realistic as well, the directing was good and the film almost had me in tears at parts.\r My only problems with the movie has to be the other character's, and I'm not talking about Moore's character I'm actually talking about the background character's that for some reason always get in the way of the story and don't really do anything. The movie to me isn't like the best movie of the year or of all time, the movie falls into the great, not into the brilliant.\r Overall \"Still Alice\" has fantastic acting from Moore and from the other cast, great directing and writing. If you every got a chance to see it I say go ahead."
    },
    {
      "rating": "8",
      "text": "Excellent performances all around, but of course Julianne Moore is exceptional.  It's a lot to treat in two hours, and the end might seem a bit facile, but it is a powerful and touching film."
    },
    {
      "rating": "6",
      "text": "It was just fine. The movie was a bit clunky and the casting was terrible. Alec Baldwin had no business being cast in this film other than to ensure a high profile name for a big release. Julianne Moore is exquisite and truly should have won the oscar. But the emotional beats felt somewhat interrupted, almost jumpy and lost. The tone of the film could have been more cohesive.. All in all it was fine. Nothing great here."
    },
    {
      "rating": "9",
      "text": "Amazing and extremely realistic performance from Julianne Moore; I'm so happy she won the oscar. One of the most beautiful movies I have seen in a very long time. I felt like the ending could have had more power, but I was happy and satisfied at the end."
    },
    {
      "rating": "6",
      "text": "Interesting/frightening/depressing for its subject matter, but I agree that it felt a bit like a TV movie, except with better actors. It strayed into melodrama at times, for example in the scenes between mother and rebellious daughter, and the speech scene complete with the audience wiping their eyes.\r It did almost feel like it was designed to deliver Julianne Moore an Oscar. And she was very good, but I can't help feeling that a role like that is manna from heaven for any decent actor. Alec Baldwin's less sympathetic role was possibly the more challenging?"
    },
    {
      "rating": "8",
      "text": "Last night I saw this film and I liked it a lot.\rI was amazed for Julianne Moore's recitation: perfect in every part of the film. Beginning when she leads a normal life, but above all when it is diagnosed with a rare form of Alzheimer's. During the screening of the film I thought that she had really this disease, anyway, i had an opportunity of immerse my self in this film and certainly it left me a mark and a positive message."
    },
    {
      "rating": "9",
      "text": "This movie is worth watching. It's the kind of performance that doesn't just support a film, it gives the film its breath of life.\r http://www.watchfree.to/watch-2a08f1-Still-Alice-movie-online-free-putlocker.html"
    },
    {
      "rating": "9",
      "text": "Still Alice is not an easy film to watch, but it is a movie well worth seeing.\r Watch this film here  http://www.watchfree.to/watch-2a08f1-Still-Alice-movie-online-free-putlocker.html"
    },
    {
      "rating": "9",
      "text": "Beautiful, stunning and tearjerking. I love this movie because it shows raw emotions. Julianne Moore did a very impressive job portraying a woman with Alzheimer's disease. I cried in almost all scene of the movie. I recommend y'all watching this piece of art. Heartbreaking yer gives us inspiration and realizations in life."
    },
    {
      "rating": "8",
      "text": "It's not as sad as any other movie about disease, such as Black or A Walk To Remember, where I cried like a flooded river. Still it's gloomy and I began to like Julianne Moore even more here.\rThe best scenes for me was when Alice looks for a toilet but forgot where it is so she pees in her pants and got hysterical and when she got lost in her own campus. So depressing."
    },
    {
      "rating": "6",
      "text": "Still Alice is a simple and digestible film, it approaches its subject with class and dignity and it does not shamelessly tries to blackmail its audience neither morally, nor emotionally, as I said being a simple movie, its power rests in its script and the enormous performance provided by Julianne Moore.Honestly I recommend it, I know that many will find it enjoyable, others may not but that's how this works."
    },
    {
      "rating": "8",
      "text": "yeah, it was about love..Still AliceThere are some tracks that they could have easily chosen to thicken the plot or add some twists and enter the dark zone but they keep it light here for the most part of it and sums it up to 'hope' in the end. Still Alice is a feature that doesn't come often, it offers everything expected and some more in addition to a heart in the centre of it pumping all the way through in each and every frame of it keeping it alive and soothing over its short runtime of around 100 minutes. The writer-director duo Richard Glatzer and Wash Westmoreland are magnificent and dedicated to the last word of their work which is visible completely onto the screen. But in the end, it's all in Julianne Moore's side of the show and boy what a show she has to offer, she is flat out brilliant and heartwarming along with a great supporting cast like Kirsten Stewart and Alec Baldwin. Still Alice has fast pace natured script, intriguing and gripping screenplay, majestic performances and an immortal soul in it."
    },
    {
      "rating": "9",
      "text": "Julianne Moore gives us a powerful performance. One of the best actress of all time!!!"
    },
    {
      "rating": "7",
      "text": "Still Alice es una película que nos muestra cómo las personas que tienen alzheimer viven su vida de a diario, que de poco a poco van olvidando cosas, al punto de no recordar naya ya. Sin duda, Julianne Moore tuvo un papel muy bueno al saber interpretar a una persona con esta enfermedad, sus gestos y sus acciones lo decían todo."
    },
    {
      "rating": "10",
      "text": "Still Alice is complete on its own simplicity. An important reminder for caring about the ones who suffer with that sad disease and the need of attention for them. The highlight for Juliane Moore's performance is indispensable, it's magnific!"
    }
  ]
}