{"id": 3345, "title": "Stoker", "starring": ["Mia Wasikowska", "Nicole Kidman"], "runtime": 99, "genre": ["Drama", "Horror", "Thriller"], "description": "After India's father dies, her Uncle Charlie, who she never knew existed, comes to live with her and her unstable mother. She comes to suspect this mysterious, charming man has ulterior motives and becomes increasingly infatuated with him.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/o0giW5oasaef5m9sgBuq0C7IkIa.jpg", "categories": {"plot": 6.371428571428571, "acting": 7.40625, "ending": 5.5, "soundtrack": 6.0, "cinematography": 7.888888888888889, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Love or Hate Wook Park, but you will certainly love Stoker. Bloody, stylized with awesome cutscenes and a well done story of a sexually abused girl by his mom's lover. It's a slow burn, quality thriller. It's graphic brutal violent content can be overwhelming but this movie manages to control it. It's a fun movie in a way. Dark, stylish and brutally good. Stoker is a little bit of everything."}, {"rating": "10", "text": "Chan Wook Park, the acclaimed director of the Vengeance Trilogy brings to life a script by Wentworth Miller in a way no other director could making Stoker a must watch. When India (Mia Wasikowska) finds out her father (Dermot Mulroney) has died she is shocked to learn she has an uncle Charlie (Matthew Goode), a suave, sophisticated man who takes an instant interest in her and her mother Evelyn (Nicole Kidman). Completely different from his previous work and a lot more subtle than the previously mentioned trilogy, Stoker is a slick and disturbingly gripping psychological mystery film with a cast so good that everything about it is a pleasure. Chan Wook manages to marry the light and dark aspects of this story so that they meld together into a film that is set almost entirely in the grey. The camera work and the mise en scene help the film feel not of the norm, not of this Earth while also grounding the film in reality. However the film really wouldn't work without the fearless performances of Wasikowska and Goode who seem to have perfectly interpreted Miller's words. Kidman is also fantastic as usual as the sultry yet petrified Evelyn, a character Kidman cuts right to the centre of  Ultimately the reason stoker works so well and is so good is because it breaks the mold of the conventional psychological thriller thanks to an inventive and oftentimes surprising script and story that brings out the best in Chan Wook's work as he shows the corruption and fear that Charlie brings in his wake."}, {"rating": "10", "text": "Cinematic gold. Stoker is hypnotic, stunning, gorgeous, satisfying and stylish. A masterpiece delivered by the director that brought us the film: \"Oldboy\" which is another amazing piece of cinema. For those of you who don't know, Chan-wook Park is a Korean film maker and Stoker is his first English language film, and this has put him as one of the directors to look our for. The acting is outstanding, the cinematography is stunning, the plot is flawless, and it's not by Quentin Tarantino, but it seems like a Tarantino. I will not recommend this movie to all movie goers, or at least those who do not favor violent films, yet its an amazing movie, film making at it's best."}, {"rating": "10", "text": "I cannot express how into this I was. The fantastic acting, terrific cinematography and minimalist filmmaking helps exponentially. I can't really describe it, but suffice it to say that the callous and rigid character adds so much to immense freakiness of it all; lighting, quick cuts and scenes in one shot are so admirable. People need to understand that it isn't just about a mysterious and sociopathic uncle interrupting a girl and her mother's lives. The acting, atmosphere, tone, set pieces, metaphors, symbolism, writing, how the script ties together, directing, cinematography, score, editing, sound design, lighting and more explore the thematic elements of jealousy, maturity, coming of age, growing sexuality, family dynamics, and loss of innocence. Even if you based it off of its surface value and basic plot, it would still be solid due to its flourishes of difference in plot and filmmaking. This is easily the best film of 2013, and one of my favorite films of all time. It's up there with Kubrick and  (the latter, of course, since it was based off of Shadow of a Doubt). 9.7/10, masterful, two thumbs up, etc."}, {"rating": "10", "text": "+÷+÷+÷+÷========+÷+÷+÷+÷+÷+÷÷++÷÷+÷+÷÷+÷÷÷÷×××+÷÷+÷+÷+÷=■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "10", "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,"}, {"rating": "9", "text": "My husband wanted to see the movie because of the NY Times review, while I was put off by the trailer and the mixed critic reviews. We did end up seeing it, and both loved it. It is more of a psychological thriller than the horror/slasher film implied by the trailer. The cinematography was outstanding and the direction wonderful; in fact, now I want to go back and see Oldboy."}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "10", "text": "\"*\"*\"*:*:*:*:**::**;:*:**:\"*:*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "10", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "10", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡"}, {"rating": "10", "text": "□□□□□□□□□□□□□□□□□■■■■■■■■■■■■■******************************$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "9", "text": "Stylish with a capital S. Park Chan-wook's film language is fantastic. He's in complete command of the medium. While it truly is a superior achievement in the technical categories, I doubt that this is the type of film which will receive much, if any, attention from the Academy. But it ought to. I liked the performances a lot as well."}, {"rating": "10", "text": "♤♡♤♡♤♡♤♡♤♡♤♡♤♡♡♡♡♡♡♡♤♤♤♤♤♡♡♡♡♤♤♡♡♡♤¡¿¡¿》¡¿¡¿》¡¿¡¿》¡¿¡¿》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡》》"}, {"rating": "10", "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:==:=:=:=:=:=:=:=:÷:=:=:÷:=______________________________♡♡♡♡♡♡♡♡♡"}, {"rating": "10", "text": "Disturbing and beautiful\"Stoker\" is a beautiful, twisted, hypnotic trance - it's meant for an audience not overly concrete in it's thinking but who have an open imagination and are able to take the plunge into the darkly poetic vision of it's director. \"Stoker\" doesn't exist in a normal, everyday reality - it's more of an alternative dream reality, hyper-aware and sexually charged. The three principle actors are superb, but Mia Wasikowska really gives the film a beating heart, as she emerges from her innocence into her latent self - a mesmerizing performance. This movie is filled with images that are as disturbing as they are lyrical and open to endless interpretation (along with a subversive wit). I've seen the film multiple times and find that my impressions change with each viewing and that it has really haunted my imagination. \"Stoker\" is one of those unique and mysterious masterpieces that I'm sure I will be returning to frequently over the years - there's much to drink in, as the well runs deep."}, {"rating": "10", "text": "Disturbing and beautiful\"Stoker\" is a beautiful, twisted, hypnotic trance - it's meant for an audience not overly concrete in it's thinking but who have an open imagination and are able to take the plunge into the darkly poetic vision of it's director. \"Stoker\" doesn't exist in a normal, everyday reality - it's more of an alternative dream reality, hyper-aware and sexually charged. The three principle actors are superb, but Mia Wasikowska really gives the film a beating heart, as she emerges from her innocence into her latent self - a mesmerizing performance. This movie is filled with images that are as disturbing as they are lyrical and open to endless interpretation (along with a subversive wit). I've seen the film multiple times and find that my impressions change with each viewing and that it has really haunted my imagination. \"Stoker\" is one of those unique and mysterious masterpieces that I'm sure I will be returning to frequently over the years - there's much to drink in, as the well runs deep."}, {"rating": "10", "text": "Stoker is full of mystery, fun, thrills, horror & its stylish visuals is totally unique. Stoker also has first rate performances from Matthew Goode and Nicole Kidman. The main actress is decent as well but those two are far better, also they have been acting much longer than her, A+."}, {"rating": "10", "text": "It's safe to say that fans of the Director will be pleased but so wil regular audiences as well.  This is a GREAT thriller which is simultaneous vividly stunning with excellent performances.  Look for this to steal some Oscars next year."}, {"rating": "9", "text": "Dark, chilling, and unpredictable, Stoker was a real treat. The mystery surrounding Uncle Charlie was engaging and the movie did a great job at keeping us in the dark about him. The characters are memorable and well-written. All the performances are fantastically creepy, especially the one given by Matthew Goode. It's not as well constructed as Oldboy, but this is still a fine piece of work by Chan-wook Park."}, {"rating": "10", "text": "This was an incredibly beautiful movie that will give you a new appreciation for non cgi photography.  Chung Hoon Chung is the name of the photographer, he became popular after Oldboy in 2004, which I found a good movie but a little overrated.  Primary colors, natural fades, every shot could be framed like a picture.  Also this movie has a really good performance by Nicole Kidman, who is so versatile it's crazy. She can be creepy, sexy, smart, perceptive, all at once and always in different ways."}, {"rating": "9", "text": "A twisted little horror-thriller that keeps you invested in it's mystery and bizarre sexuality. The atmosphere is creepy and dark with moments of brilliant cinematography. The characters are compellingly deranged. Wasikowska plays her coming of age character brilliantly adding to the film's deranged sense of sexuality.\r It loves to play with linking sexual arousal and murder. All with some incestuous undertones. It's disgusting for sure, but it gives the film a disturbing tone and identity all it's own. The real star here is the mystery though. It sucks you in as you wonder just what the heck is wrong with these characters.\r It's a unique and as backwards as the characters can be. It stays tense and gripping throughout. It stands out among others in the thriller genre thanks to it's gothic-horror style. It's dark, violent, and creepy. It's also one I highly recommend.\r I give \"Stoker\" a 9.1/10."}, {"rating": "0", "text": "It's a good thing that one can submit a ZERO as a score, because this film fully deserves it (from my point(s) of view). One does not need a hundred and fifty characters to describe how terrible it is."}, {"rating": "4", "text": "Stoker has a first rate art direction and an exquisite editing with an astonishing soundtrack and a great cast but a ridden of cliches and a third rate, tired and unoriginal plot that is pointless and dumb. This thriller is gruesome and it is not everyone's cup of tea, although it looks spellbinding and delightful, it is a dull, disturbing and an uneven experience in so many ways."}, {"rating": "7", "text": "Is very strange and is not commercial. Is very Well acted and is fun. The images are very beautiful and psychological terror. Is very paused and sometimes is erotic"}, {"rating": "1", "text": "It's not often when i agree with the critics and disagree with the audience. But i don't think i ever watched such pointless movie. Everything except the cinematography was just awful!"}, {"rating": "1", "text": "Stoker fails to be complicated movie with a complex deep idea, that's hidden. Visually stunning, Stoker is boring, not making sense, puts some strange 'symbolic' scenes, that should insert light, but are weird and not successful instead. I do not get how India and her uncle were so similar, resembling, looking like vampires, arrogant and selfish. While India is is pain of her father's death, she find out the killer is her own uncle. And what she does? She turns into him. And then - saving her mother. No. Too many undersized parts, story that's chaotic and naively stupid, characters, that are totally unlikable. Lack of dialogues and actual 'happenings' imports confusion. A lot to be done, until the film reaches a decent level to be viewed and liked."}, {"rating": "0", "text": "Not sure what movie the other three saw.  Stoker was an atrocious, contrived and nearly plotless waste of 105 minutes.  If you want to waste time on 105 minutes of a guy staring at everything he can possibly stare at mixed with a heaping supply of useless symbolism this may be your perfect movie, for everyone else, steer clear.  I gave it a 1 because there was one interesting and quite striking scene with two of the main characters at a piano.  Everything else was crap."}, {"rating": "8", "text": "Stoker is a psychological thriller that you might not expect. It's not the usual type of the genre. The storytelling is in pure style and it features its terror in a completely twisted way. It's a weird cinematic experience that might stuck in your head for some time. It didn't offer much new to the plot but it creates a both melancholic and terrifying atmosphere to the picture which made it fascinating. What's more fascinating is the film making understands the psychosis beneath it and it clearly shows them on screen. Stoker is quite peculiar but in a remarkably stunning way."}, {"rating": "0", "text": "A pointless movie, without any psychology in it, like a good horror movie shoud have, no moral, no talcum, a pointless, useless story about a girl who kills people without any purpose. Ok, she murdered that boy from school because he was tryin' to do her thing. But...the police man??? Bad, simply bad."}, {"rating": "4", "text": "Prior to and superseding Old Boy, the penultimate film of Park Chan Wook's Vengeance Trilogy, incest is intimated(whereas incest becomes actualized in the 2003 Cannes Grand Prix winner), a forerunner to Stoker, his American major studio debut, where sexual tension between an uncle and niece is unequivocally stressed. At the outset of Sympathy for Mr. Vengeance, a mute brother and his dying sister hold each other like lovers as they look out toward the coastline, while over the soundtrack, the brother's letter is read over the radio airwaves, a letter that promises his beloved sibling, a kidney. During the convalescence, she allows Ryu to wipe down her arms and legs in the nude, save for a towel, a sponge bath that conveys the potential for transgressive intimacy. It's the ease and lack of self-consciousness about exposed skin from the pair which suggests a chummy history. In Lady Vengeance, incest is employed as metaphor, when Geum-ja, a parolee wrongly accused of child murder, has sex with a bakery co-worker who sees her as an \"elder sister\", a teenager at least fifteen years Geum-ja's junior. Incest, however, in Old Boy, rises above the subtext and begets two separate but interlocking interfamilial relationships that climaxes into the most tragic of tragi-comic endings. It's only natural that the South Korean filmmaker would choose to remake Shadow of a Doubt, the perviest of films in the Alfred Hitchc*ck ouevre. Not for nothing, in Stoker, does Evelyn, the mother, brag to Uncle Charlie, her brother-in-law, about the recently widowed woman's ability to speak perfect French, since Francois Truffaut(The Bride Wore Black) famously refashioned  tropes to his own European art-house sensibilities, as does Wook Park(working from a script he didn't pen), who ferrets out the depravity that courses through the veins of Charlie and Young Charlie(visually linked by matching introductory shots of them lying down on beds) in Shadow of a Doubt, Our Town's shadow, the 1942 film with a similar double-barreled incest storyline as Old Boy. \"Have you ever seen...yourself,\" India asks a boy, \"...from an angle you don't get to see when you're in the mirror,\" while walking in the woods, just prior to his attack on her. Stepping out from behind the trees, Charlie rescues India, giving his niece a chance to flail away at her oversexed classmate, after he bonds his wrists and ankles together. Very obliquely, India's little speech recalls Old Boy, when Soo-ah allows Woo-jim, her brother, to molest the consenting schoolgirl in an empty classroom, going so far as taking out a compact mirror so she can get a better look at this familial lover giving her exposed breasts a tongue bath. She then tilts the mirror up to her smiling face. Echoing India's words, the smile says, \"That's me. That's also me.\" Comparably, that's India in the bathroom, staring at herself, too, in the looking glass, before she enters the shower, where a different, more grisly recount of the boy's murder by Uncle Charlie's hands play out; a murder fantasy that serves as onanistic material for autoerotic sex under hot water. Both violence and taboo love turns India on. But what about Young Charlie? The filmmaker, in Stoker, makes more explicit the sexual longing and violent disposition already inherent in the uncle's namesake, whose \"miracle\" could be comparable to India's \"longing to be rescued, to be completed,\" if not for the oppressive sexual climate of her times. Whereas India is an only child, mourning the sudden death of her father, Young Charlie has a full complement of parents and siblings. It's this stable family life, perhaps, that helps stave off her incubated unwholesome side which the uncle tries desperately, but fails to activate. Like Young Charlie, India is in simpatico with this long-lost uncle, sharing her counterpart's gift of telepathy, in which she hears Charlie's words of introduction from afar at the funeral. In Shadow of a Doubt, Young Charlie hums a few bars of the \"Merry Widow Waltz\", to the dismay of her uncle, who later attempts to romance his niece with an emerald ring. Earlier, through visual metaphor, Hitchc*ck shows how he wants to deflower Young Charlie. But what about the girl? Is she willing? It must be sexual attraction that prevents Young Charlie from turning the Merry Widow Murderer in? That much is made clear when, analogously, India doesn't report the discovery of their housekeeper in the family's pantry freezer. Back at the funeral party, India observes, \"You look like my father,\" and because he's her uncle, she can safely realize her daddy fantasies without guilt. When Evelyn catches Charlie helping India slip into a pair of high heels, it confirms, perhaps, something she always suspected about her husband and daughter. Like Min-Sik(who beds his daughter), India, the \"young girl\", doesn't fully realize who the person she's attracted to really is."}, {"rating": "5", "text": "Stoker is a technically brilliant film, evident of the mastery of Chan-wook Park whose 'revenge trilogy' is truly unforgettable and 'Oldboy' in particular one of my favourite films of all time.  Unfortunately though it never becomes anything more than a technically brilliant film and even though there are scenes (like the one when Mia is brushing Nicole's hair) that are simply magnificent, the overall result is more muddled than unsettling.\rNeither Goode managed to give me the chills, nor Kidman was engaging enough and the editing added to the confusion rather than to the suspense.  But Wasikowska was magnetising in a atmospheric and poetic film that had many signs of greatness but in the end was not great enough."}, {"rating": "7", "text": "Stoker definitely fulfilled my expectations, though I had not really watched any of the previous work by Park. I did expect some visual mastery, that is exactly what I got. The film is visually mesmerising, providing us with innumerable beautiful shots. Really, each shot can be a still photograph on its own right. It is simply stunning the amount of work this must have demanded, so the director did a superb job. The casting was great, too since everyone's performance was excellent, especially young Mia Wasikowska.\rThe story is interesting, too, and while not necessarily the strong point of the film, it is sufficiently good not to be a let down.\r Overall, it is a good debute for Park who should have gotten more recognition for this. 8/10"}, {"rating": "6", "text": "The movie starts at the funeral for Mr. Stoker. That leaves his introverted teenage daughter (Mia Wasikowska), his troubled wife (Nicole Kidman) and Uncle Charlie (Matthew Goode), who shows up from obscurity. And the creepy, fatal games begin. Who's killing and why? While some things about the direction and cinematography are compelling, the slow pacing and ultimately silly story keep it from having the socko effect that was desired. Interesting coincidence: Harmony Korine (director of \"Spring Breakers,\" which opened here this weekend) has an almost invisible part in this film as the art teacher.\rGAY ANGLE: Some handsome men, but no flesh and no fun."}, {"rating": "7", "text": "STOKER is South Korean director Chan-wook Park’s Hollywood debut, a screenplay written by Wentworth Miller (not-just-a-pretty-face from PRISON BREAK), and the trinity of the stars in the poster seems alluring, but bears the height of his vengeance trilogy (2002-2005), most likely it would end up to be another mishap of exotic directors lose their mojo under the high-handed industry regulations. But STOKER suffices as a hotbed for the monomania runs in the family bloodline, a maniac returns to his long-lost family and enkindles the evil out of his only kin, sounds like a horror-slasher, but the film tends to be a rite-of-passage for our protagonist India, a girl lost his father at her 18th birthday, meanwhile, murders are all around the family, even the trailer neither cares to hush up the victims nor to reveal the culprit (poor two-times Oscar nominee Jacki Weaver).\r The ethereal atmosphere is ubiquitous in the film, sets against the contemporary society, the family basically is insulated in its villa, with succinct tête-à-têtes and reserved rejoinders among three leading characters, which does not effectively propel the storyline, it is the detailed camerawork, meticulously heaps up the triangle incestuous appeal among the three, Chan-wook adopts quite a few uncommon modi operandi to hone up the tension and flashback the hidden history of the past, the stop-motion shots in the beginning and the incessant time-and-space jump montages might engender some inconvenience for the eyes, but undoubtedly they lend the film a posh brio, so is the tableaux-alike settings, jibes with the oriental philosophy of subdued emotion under a placid surface.\r Mia Wasikowska excels herself in upholding her morose frostiness, the masturbating orgasm could be regarded as a metaphor for her career-elevation, sheds the protection of adolescence and challenges herself to darker and more dangerous orbit, Alice doesn’t live there anymore! Matthew Goode, albeit his very underused career path, finally secures a leading role excavating his double-faced charm and menace, even after his real identity has been unearthed and his doom has been pre-designed, he still launches a sympathetic glamour in his inexplicable possession towards his niece whom he has never seen before. Nicole Kidman, whom I find perplexed to take on such an unsympathetic and flat role and if as rightful as it is reported, a tailor-made request from Chan-wook.\r Finally, its has a killing soundtrack, a  of Nancy Sinatra & Lee Hazlewood’s SUMMER WINE and a quasi-vampire allegory, I’ve found my snug corner to embrace the 99 minutes of how slaughter becomes a genetic heredity and the frisson is all over the place!"}, {"rating": "5", "text": "Chan-wook Park makes a curious art direction/stylish-heavy film which does quite engage any of our senses. Sure, the cast plays off of each other well; but it all feels a bit pointless."}, {"rating": "2", "text": "Probably the worst thriller mystery movie I have ever seen. Stoker is simply a god awful, contrived, pointless waste of 100 minutes, that offers no real tension or any realism what so ever."}, {"rating": "1", "text": "An absolute failure of whatever it was trying to be. Not artful, suspenseful, or thrilling. Terribly boring. I hated the main character the moment she was on the screen. An utterly pointless movie."}, {"rating": "0", "text": "That main character is a total waste and a terrible actress. The movie was nonsense that offered no resolution except me hating it on every level. Garbage. Atrocious."}, {"rating": "8", "text": "Absolutely masterfully directed. Once again Chan-wook Park shows that he can perfectly use colors and music to set a mood. It was grim and creepy and the performances by the entire cast. The thing that is truly great about this film is, as I stated earlier, the directing. It's fresh and has an atmosphere that the directing allows it to perfectly achieve. The problem of this film lies in the writing. As interesting as the plot is it does seem in certain ways implausible That's the flaw of the film but if you look past that it is quite quite good."}, {"rating": "7", "text": "Within the first half hour, it becomes clear that Chan-wook Park had just finished watching Alfred Hitchcock's classic Shadow of a Doubt and decided, \"That is my next movie.\" From naming a character Uncle Charlie and making him a very mysterious figure, Park's film plays like a remake of Shadow of a Doubt until he hits the halfway point and turns it into a movie Hitchcock never could due to the Hays Code. That said, I would not be surprised if this were the film Hitchcock wished he could have made. Perverse, sick, and decidedly twisted, Stoker landed far better for me than the only other work I have seen by Chan-wook Park, Oldboy, but still feels like a largely hollow experience.Symbolic and emotionally withdrawn, Stoker stars Mia Wasikowska as India Stoker. A weird, dark, and emotionally disturbed teenager, India is grieving the loss of her father, Richard (Jacki Weaver). Her grieving process is interrupted by the arrival of the mysterious Uncle Charlie (Matthew Goode) who immediately starts coming onto both India and her mother Evelyn (Nicole Kidman). Given the reaction of the teenage girls to seeing Uncle Charlie, it is hard to imagine that the pair did not want the attention given to them by Charlie. However, as people keep missing that would expose the mystery that lies behind Charlie's past (which he claims was all over-the-world due to business), things become all the more unsettling and creepy. Here, Park has a lot of fun with the symbolic elements at play here and really just likes disturbing his viewer.Early on, we can tell that India is quite mentally ill. Evidently, so can Uncle Charlie who is shown to have taken a liking to India since she was very little. In his equally depraved mind, it is apparent that he knew the two of them were both disturbed, unlike India's father Richard. Now, Richard could certainly tell as well as he strove to keep them apart. Once together, however, it clear that they were meant for one another. Charlie, in many ways, is grooming India. Not sexually (okay, sexually), but deviously. Since he was a boy, Charlie killed. India did as well, but her father sought to keep it be restricted to birds. Unfortunately, with Charlie in the picture, she is introduced to the concept of killing people and, given a shower sequence, the thought really turns her on. Of all the disturbing sequences in the film, this one is certainly up there as one of the most chilling.The chilling nature of their relationship is amplified by the great acting from Wasikowska and Goode. Neither are ever appreciated by the mainstream as they should be, in spite of both being terrific actors. Wasikowska plays the very restrained and inward-focused India with zero emotion, which is perfect for the character. Watching her as India and in other films such as Tracks or Crimson Peak is honestly night-and-day, given the emotion she displays in those films and the complete lack of feeling she demonstrates here. Goode, meanwhile, plays Uncle Charlie with more emotion, but still it feels as though something were missing. From the very beginning, he emanates this mysterious vibe of the character, as you can tell something is very off about this man and he may not be what he seems. While this is certainly the Shadow of a Doubt influence and for those who have seen the film, you undeniably know that Charlie is not all that he presents. But, even if you have not seen Hitchcock's film, Goode plays the role in such a way that this lack of clarity as to who he is and where he is actually from becomes incredibly clear.On the other side, Kidman is most certainly depraved, but in a different way. She plays the role of Evelyn akin to how Wasikowska plays India, yet older. She is wiser, more mature, and as such, more restrained. She does not display emotion, other than to express her general disdain for her daughter. Evelyn is incredibly chilled and withdrawn into her own shell and Kidman brings this element to life with brute force in the film. The cinematography, of course, is also gorgeous. The main highlights being three sequences that truly stick out. The beginning with Wasikowska in the field, narrating the opening is breathtakingly shot with the sun behind her as she walks through this field. Secondly, when India is brushing Evelyn's hair. The camera seamlessly and breathtakingly flows from Kidman's bright red hair to the green of the leaves as India describes to Evelyn the feeling she gets from the hunt. Honestly, seen in conjunction with the end of the film, the scene is also quite revealing about India's character, as it demonstrates the impact hunting has on her and certainly foreshadows to her desire to change her game. The third shot that sticks out is the ending. With blood spraying on leaves and the gun trained to India's eye, Park truly captures the odd, perverse beauty of the moment with sickening skill.All of this said, Stoker is still imperfect. In many respects, it may be too withdrawn."}, {"rating": "5", "text": "Not really good. Wants to be a stylish serial-killer, coming-to-age thriller with a twist, but fails to be more than a pretentious, and ultimately boring movie. The characters, their actions and motivations are underdeveloped and unrealistic. The acting is good, but the writing is lacking any kind of tension or realism. I felt nothing for the main protagonist/antagonist. The sound effect and the shot very beautiful, but nothing outstanding. Not recommended."}, {"rating": "7", "text": "Park Chan-wook's latest is a seductive slice of suspense titled \"Stoker,\" and it is carried with some unexpected supernatural bravura. It's not understated to say moviegoers' were thrilled when director Park Chan-wook, director of the legendary \"Oldboy\" (2003) and \"Lady Vengeance\" (2005), announced he was making his first English language feature film. Park is a truly talented director, a visual stylist with a flair for mystery. He is best known on these shores for his notorious, visceral, and character-driven 'Vengeance Trilogy'. Unfortunately, some American viewers familiar with his work, accompanied with their lofty expectations, won't get what they might have expected and hoped for.\r India (Mia Wasikowska) is an emotionally distant 18-year-old living with her mother Evelyn (Nicole Kidman) in a sprawling mansion somewhere in the Deep South. She is mourning the recent death of her father in a car accident, and she was not prepared to lose her father and best friend Richard (Dermot Mulroney) in a tragic auto accident. The solitude of her woodsy family estate, the peacefulness of her tranquil town, and the unspoken somberness of her home life are suddenly upended by not only this mysterious accident. Then there is the sudden arrival of her Uncle Charlie (Matthew Goode), whom she never knew existed. When Charlie moves in with her and her emotionally unstable mother, India thinks the void left by her father's death is finally being filled by his closest bloodline. Soon after his arrival however, India comes to suspect that this mysterious, charming man has ulterior motives. Yet instead of feeling outrage or horror, this friendless young woman becomes increasingly infatuated with him.\r Technical achievements are almost nullified in large part to a pair of mitigating factors  the first of which is Wentworth Miller's compelling, yet flawed screenplay. The fact that the most sympathetic people in the film are dead before it even starts doesn't help. Elegant direction helps to elevate a wearisome story line, but the cast plays things a bit too cool for comfort in \"Stoker\"- a morbid inversion of Alfred  \"Shadow of a Doubt\" (1943). Thematically, Park's eerie domestic drama fits nicely into his criterion, though its distinctive lack of sympathetic characters keeps us at arm's length when we should have a sense of being emotionally invested. While Wasikowska is a talented actress, she's curiously flat here in her role as India. The potential for a complex, distressed protagonist is present, but the progression you're waiting for never quite comes. While it's understandable that India might seem emotionally distant following such a trauma, but she overplays the disaffected nature of her mourning, that it blunts her story's emotional impact. Likewise, her character's frustrated and secluded mother never comes across as remotely likeable. Miller's sense of pacing plays well to Park's strengths in sustaining tension  ensuring that the audience remains engaged--and the major reveals are well hidden by Miller, as he skillfully plays his cards close to his chest.\r The overall result is a nerve-racking  riff, and in its own right, is well made and certainly respectable. However, all of which contributes to the nagging idea that \"Stoker\" doesn't truly know what it wants to be. The story seems to have been pushed and pulled in a variety of directions by different parties. The film feels 'tainted' by Hollywood-a movie that is well polished and yet restrained, and nothing close to resembling a traditional South Korean thriller. A film that is worth the watch, but falls short of expectations and being truly memorable."}, {"rating": "8", "text": "After I watched the movie a second time, I had a second thoughts about this movie, it is slow but it is very interesting, the photography is amazing and the acting as always is phenomenal, the story although it is cliched but amazing and twisty, the scenes are chilling, all in all it is very good, but not the best."}, {"rating": "4", "text": "This movie just wasn't for me.  I found while well made and well acted it suffered from a predictable and clichéd script in which you see most of the movie coming a mile away."}, {"rating": "0", "text": "An empty plotted terribly acted film that sucks the life out of you. Like a vampire. Nothing happens, and when something does it feels contrived and weird. Terrible."}, {"rating": "5", "text": "Stoker is an exquisite film making, it sounds good, it looks great, but it lacks originality, which kind of disappoints in a movie that could be a one of a kind, lost opportunity, but let me deal with it, it is not an enjoyable experience, it is dark and dull, but in a good way, although it lacks originality, which means it has a lot of cliches, it stands out as one great thriller with disturbing imagery, great acting and storytelling, the editing is perfect the psychological part in this movie is perfect, but still, it is not what I was hoping for, pity."}, {"rating": "0", "text": "This movie I could barely even finish.  The first half was boring as hell, I was about to turn it off but something finally happened.  Anyway was highly disappointed.  Was hoping for a scary movie, this was a joke, save your time and watch something else!"}, {"rating": "5", "text": "Very uneven  some good scenes, but a lot of uninteresting sequences. Visually great. Length is ok.  but there are much, much better thrillers out there. In the end  all style, little substance."}, {"rating": "8", "text": "\"Stoker\" 10 Scale Rating: 8.0 (Great) ...\r The Good: Well acted, thought provoking, and highly interesting. Dark, but in a good way. Mia Wasikowska and Nicole Kidman do a good job, but it is Matthew Goode who really stands out. There are a few twists and turns along the way, a few you can see coming a mile away ... but that doesn't make them any less shocking or well done.\r The Bad: At times it becomes a little too odd for the sake of being odd. The attempts at shock value become a little too much at one point, but the film calms down and gets back to the point."}], "recommendations": ["you_were_never_really_here", "thoroughbreds", "black_swan", "the_killing_of_a_sacred_deer", "wind_river", "nocturnal_animals", "the_beguiled", "melancholia", "the_rover", "last_night_in_soho", "elle", "21_grams", "sicario", "what_lies_beneath", "thelma", "eyes_wide_shut", "alpha", "personal_shopper", "the_light_between_oceans", "swallow", "trainspotting", "the_cell", "a_simple_favor", "titane", "the_crow"]}