{
  "id": 3098,
  "title": "Stonehearst Asylum",
  "starring": [
    "Kate Beckinsale",
    "Jim Sturgess"
  ],
  "runtime": 112,
  "genre": [
    "Thriller",
    "Mystery",
    "Horror"
  ],
  "description": "A Harvard Medical School graduate takes a position at a mental institution and soon becomes obsessed with a female mental patient, but he has no idea of a recent and horrifying staffing change.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fZxGCCQ0NAtraevqULJ84wSSjo0.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 6.625,
    "ending": 5.166666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Dammit. Stonehearst Asylum is a frustrating exercise. A compelling premise with a truly telegraphed ending that doubles down on its dumb final plot twist with the belief that a shoddily crafted romance/obsession can solve madness. I hate that very idea and it leaves a truly sour taste in my mouth from this otherwise acceptable film. The initial twists and turns are truly engaging and set up a terrifying premise, even if director Brad Anderson fails to conjure up any scares. The atmosphere is solid, but anything but scary. Instead, it is more of a thriller throughout. All the same, the period elements are top-notch and asylums always make for a truly compelling premise when it comes a horror/thriller film. This is certainly the case, especially when the production and costume design are this good. Kate Beckinsale, Ben Kingsley, Jim Sturgess, and Michael Caine, all turn in solid performances and get the job done from beginning to end. However, the ending is what skewers Stonehearst Asylum and is the film equivalent of putting the gun to your head and pulling the trigger."
    },
    {
      "rating": "8",
      "text": "For starters, anyone who says this film copies the concept of Shutter Island is a moron, considering the original story for this was from Edgar Allen Poe. ANYWAY, I loved the film and the cast performed brilliantly, especially Beckinsale and Kingsley."
    },
    {
      "rating": "10",
      "text": "Great movie and there's so few of those, sadly.  Excellent plot, surprising twist, climatic conclusion and, last but not least, a happy ending.  Bravo."
    },
    {
      "rating": "7",
      "text": "It's a terrifying idea that we can't trust medical professionals, let alone professionals of mental institution, in secluded England rural of last century no less. The movie plays with this innate distress particularly well, although it does venture to more preposterous realm sometimes. Its star power and great original source make for a great mystery thriller and while it doesn't necessary produce genuine terror, it will most likely be pleasant to horror genre enthusiasts.\r The story revolves around a new doctor Edward Newgate (Jim Sturgess) as he visits the titular asylum only to find that the institution harbors illicit secrets, and most importantly a certain beauty Eliza Graves (Kate Beckinsale). With other cast such as Ben Kingsley, Michael Caine and David Thewlis, the film has an edge for acting. Kate Beckinsale is superb here, she's an enigmatic enchanting damsel-in-distress. She could just simply standing and already a good cast for wallflower character, add the mysterious touch of alluring personality, Eliza is as good as female lead as any you could hope for.\r The others deliver stellar performance as well. Ben Kinsley and Michael Caine create less than sensible figure of authority with questionable methods, although Ben Kingsley does resemble his character in Shutter Island a bit too much. David Thewlis as the more roguish caretaker has whimsical threatening poise, but this eccentricity doesn't really exemplify a fully villainous antagonist personality. The film script is elegant and the venerable cast has no problem on delivering it in the same fashion.\r Cinematography works in the confined space, the asylum feels claustrophobic and inescapable. The movie sets a tone of doubt from its depiction of insanity and the mystery of who are plagued by it, along with the near tortuous alleged cure of such illness. However, the exaggerated tone occasionally becomes too silly for its own good, it has goes beyond quirky to just plain ridiculousness. In this case, more restraint to the wicked would've been better.\r During the tour it feels as though Stonehearst Asylum could've been more polished, but its clever twists, excellent assembly and Kate Beckinsale in the green dress are more than enough reasons for a visit."
    },
    {
      "rating": "6",
      "text": "Good performances/actors and sets but very predicable. This film is so predictable that you get the feeling \"its one of those movies\" very early on..."
    },
    {
      "rating": "8",
      "text": "A new doctor arrives at an insane asylum and the methods used by the doctor and staff are totally out of line for the times.  Of course, this is a 100 years ago so the acceptable methods are barbaric.  This doctor seems to be getting results with these new methods but something is a little off.  There are more twists to this story, some anticipated, some not.  For me, there's something creepy about being in locked in with crazy people, One Flew Over the Cuckoo's Nest anyone?"
    },
    {
      "rating": "6",
      "text": "Not a bad movie, but not even close to Shutter Island. Lets compare - both movies share quite similar idea - asylum, things are not as it seems, mystery, surprise ending. Both movies begin promicing - there is some deep mystery main hero tried to decipher through the lenght of a story, but then things become much different. Seriously, why this love story is here? Really out of place. If the author wants to see the real mystery of love he should see Illusionist movie. Here it looks weak and dull. The ending, unfortunately, is quite weak aswell. He is a patient, but not a doctor, he faked them all, what a surprise. And then he became a director of an asylum, lol. 610 and mostly for Kingsley masterplay."
    },
    {
      "rating": "8",
      "text": "Una pelicula que desde el principio es entretenida , buenas actuaciones y muy buenos escenarios y con un final muy agradable, definitivo es muy palomera."
    },
    {
      "rating": "7",
      "text": "The story was interesting even though it wasn't original and it was predictable at times, the acting was good and the movie was overall pretty entertaining. Even if the ending was a little bit over the top and the story was cliché, it was still a good movie."
    },
    {
      "rating": "7",
      "text": "Very loosely based on an Edgar Allan Poe short story, this misses so many chances to add suspense, tension, terror; but chooses to be a love story.  Good acting and decent direction cannot make up for this... could have been so much better."
    },
    {
      "rating": "6",
      "text": "Good performances and enough twists to keep any viewer hooked. Nevertheless, the film is no remarkable achievement, with a very unsettled tone that keeps its PG-13 rating never nearly on edge of anything else, which is this film's main sin; it is simply not as dark as it should be."
    },
    {
      "rating": "4",
      "text": "The film is not bad, but it is not something remarkable, a shame considering that the story and its cast are very interesting, in the technical side is also good, but there is something that feels disconnected, something that is missing to give an identity to the whole plot."
    },
    {
      "rating": "8",
      "text": "Awesome story by Edgar Alan Poe, it's really bad that this movie is so short and not have better production, because actors and plot are great."
    },
    {
      "rating": "7",
      "text": "بالطبع ليس من السهولة أن تقتبس من عمل أدبي لتصنع منه فيلماً، فما يحتاجه فيلم بهذه الطبيعة، أكثر من رؤية مخرج. إنه بالضبط يحتاج إلى هضم كامل لثقافة النص وتاريخيته من قِبل الممثلين. وعندما تفكّر أن تصنع فيلماً يعتمد على قصة لإدغار بو، فهذه مجازفة بحد ذاتها، ومع ذلك أعتقد أن الفيلم كان جيداً من ناحية المعالجة العامة، وإضفاء جزء خيالي ضروري لإعطاء إثارة بصرية.الفيلم غير مُتكلّف كثيراً، هادئ وجميل، والأكثر هو الأداء المميز للسير كينغسلي، وحتى الدور الجميل لثيوليس وكين. نصوص إدغار بو تعتمد على الرعب النفسي وبتصوري كان واضحاً قليلاً ضمن الفيلم وهذه نقطة تحسب لصالحه. وما ميز العرض بكامله و الموسيقى الناحجة جداً.أعتقد أن الفيلم ليس بالمستوى المطلوب إخراجياً، لكن اللجوانب الاخرى من موسيقى وأداء رفعت سوية الفيلم وخلقت جواً جميلاً"
    },
    {
      "rating": "7",
      "text": "This is a fairly haunting and atmospheric watch at times, with it being set in a large and dour building. It is a period drama set in the late 1890s and indeed there are some fancy costumes and uniforms on show. The plot itself I thought was interesting - I wondered what truths might be discovered. I also thought that Ben Kingsley gave one of the better performances, being quite sinister in his role as Silas. I wouldn't say its scary but its reasonably spooky and so I would recommend it, yes but not as a horror film, rather more a drama, perhaps with thriller elements."
    },
    {
      "rating": "7",
      "text": "電影情節有小說感，精神病院陰陽怪氣，可能是超自然力量，可能是犯罪陰謀，也可能只是有人精神錯亂做了匪夷所思的事情，無論哪一種都吸引我繼續看下去。"
    }
  ],
  "recommendations": [
    "what_lies_beneath",
    "anna",
    "primal_fear",
    "insomnia",
    "the_others",
    "morgan",
    "the_raven",
    "conspiracy_theory",
    "before_i_go_to_sleep",
    "from_hell",
    "arbitrage",
    "run",
    "the_black_phone",
    "10_cloverfield_lane",
    "cube",
    "knives_out",
    "unbreakable",
    "the_skeleton_key",
    "beyond_the_reach",
    "the_good_liar",
    "last_night_in_soho",
    "candyman",
    "the_name_of_the_rose",
    "no_sudden_move",
    "reminiscence"
  ]
}