{"id": 2336, "title": "Storks", "starring": ["Andy Samberg", "Katie Crown"], "runtime": 87, "genre": ["Adventure", "Animation", "Comedy", "Family"], "description": "Storks deliver babies…or at least they used to. Now they deliver packages for a global internet retail giant. Junior, the company’s top delivery stork, is about to be promoted when he accidentally activates the Baby Making Machine, producing an adorable and wholly unauthorized baby girl...", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/uxjgGjX4lxfGcxUeB15nm7itrwM.jpg", "categories": {"plot": 7.0, "acting": 6.75, "ending": 7.5, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 7.5, "funny": 7.153846153846154, "action": 6.5}, "reviews": [{"rating": "8", "text": "I absolutely adored this film. Yet another hugely entertaining animation from Warner Bros., Storks is one of the most insane yet absolutely delightful films you’ll see all year. Mixing rapid-fire and random humour with a heartfelt and warm story about family, there was barely a moment where I wasn’t grinning ear-to-ear in this film, making it one of the happiest, funniest and most enjoyable animations I’ve seen in quite a while.Over the course of this film, the level of comedy changes quite significantly, but I want to start off by talking about the first two-thirds. Simply put, the humour during this part of the movie is utterly insane. Not only incredibly rapid and frantic, the sheer randomness of everything that happens on screen is at times bewildering to see, from a nerdy chicken with a jet pack to a pack of wolves turning into a submarine, there are literally no bounds to what this film will come up with, but that makes for massive laughs time and time again.What’s brilliant is that this film knows how silly it wants to be, and that gives it a real confidence in the delivery of the insane brand of humour. It might not be everyone’s cup of tea, but I guarantee that so many kids will love every second of it, and even adults can have a huge amount of fun too if they approach with the right attitude. Don’t expect this to be a Pixar classic, because that’s not what it’s trying to be. If you’re prepared to sit back and be hit with a barrage of utterly hilarious madness, then this film will be a massively entertaining watch.That brand of ridiculous comedy is by far the film’s best feature, and it keeps it consistently entertaining and funny for the best part of an hour. There is a brief moment where it feels a little exhaustive, but that’s fortunately when everything takes a different direction.Still retaining good humour, the final third of Storks is actually quite an emotional one. It’s not necessarily a tearjerker, however the final act’s heavy emphasis on family values and unity is exceptionally heartwarming to watch, and added an impressive level of depth to the characters and story as the film comes to a close, making it an even more wonderful watch beyond the hilarious comedy.Finally, I want to quickly talk about the performances. Andy Samberg and Katie Crown are simply fantastic in the central roles, with excellent chemistry throughout, and fantastic comedic prowess at every moment. Along with the leads, the likes of Kelsey Grammer and Stephen Kramer Glickman provide some hugely entertaining voice performances for supporting characters, giving the film even more vibrancy and energy wherever you look.Overall, I thought Storks was an absolutely brilliant film. Principally a hilarious and utterly insane family comedy, featuring bewildering humour, crazy animation and hilarious voice performances, it adds another level of delight in its final act with a heartfelt and happy climax."}, {"rating": "7", "text": "To realise their actual line of work.I usually anticipate the animation films, but I was not interested in this. I saw it mainly because of how much I liked 'The Lego Movie'. This is not as good as that one, but cute little adorable animation. The film is exclusively for the kids and the families, but anybody can have a good time if they are not expecting according to their age, gender and other things. So if you are yet to watch, leave behind those in order to enjoy it.It is nothing to do with the 2009 short film 'Partly Cloudy'. But those who wanted a feature film on the similar theme would enjoy it. It is a little different though. The storks who switched their business to another, 18 years later a chain of events makes them realise what they should be doing. So in an adventure, soon to be the boss, a bird named Junior struggles to fix his mistake. In the process, he unleashes some secrets which brings the final act where the narration decides which way to end.Not a bad story, which is a road adventure like many animation films. The comedies were good and the characters are well developed in the short span. Some parts seem very silly, but enjoyable. Particularly the wolf-pack and their weird approach to deal with things. The animation too was very smooth and overall film was short, so swiftly narrated tale. This is not the year's best animation, though watching it for entertainment would work. Animation fans should not miss it, and must see for little children.7/10"}, {"rating": "7", "text": "Storks is an animated film that works because of its fast paced scenes and dialogue. Nicholas Stoller has a lot to do with this film's success. He doesn't let the film become to drawen out and lagging in scenes by just keeping it moving. It's not perfect some bits don't work, but overall this is just a good time. Plus those babies are adorable. B+"}, {"rating": "4", "text": "I'll be honest(oh this is gonna go well), the reason why I saw this slightly below average movie is because of the cute \"redhead\" who is named(spoiler) Tulip. And I was not disappointed when it came to her. But almost everything else in Storks just doesn't entertain a late teenager like me.(I did \"like\" pets and zootopia. maybe not as much as hideo kojima) The kids should like it though. But don't expect them to be laughing all the time.\rNow to see DeepWater Horizon(Hopefully \"based on a true story\" can bring life to the excessive explosions)"}, {"rating": "6", "text": "I was actually kind of into this movie for a large part of it.  It’s not a very good movie by any stretch of the imagination, I daresay it’s more of a mediocre film than anything else, but I think that’s because I was expecting too much of it since it’s from the same studio that gave us the Lego movie.  That being said, however, there’s genuine times that made me really, really laugh and if you have kids, I definitely recommend you take them to this one over Trolls any day of the week, seriously, this was alright, the only thing that is really vulnerable is that they don’t really do much role building and the story has a lot of narrative issues, but you get extra points for casting Kelsey Grammer, that man is hilarious."}, {"rating": "5", "text": "Storks is... ok. I liked the mostly original concept and the fact that the story was nicely offbeat, making a lot of unexpected twists and turns which meant that the story wasn't as predictable as some other animated films. Storks is cute and the third act was nicely emotional. However, I didn't like the improv-style comedy, the pacing was punishingly fast, the characters weren't interesting, and the animation was mediocre. This is especially considering that the studio that did the animation (SPI) also did the animation for The Angry Birds Movie. Overall, it's a safe film that kids will definitely like. Adults... not so much."}, {"rating": "10", "text": "My husband and I fell unexpectedly in love with this movie. We went to see it in theaters based on the humor evident in the trailer and were shocked by how much we enjoyed it not only for its humor but also its heart. The story goes surprisingly poignant places to do with parenting, family planning, and general themes about family relationships. The character design is extremely appealing, the animation is rock solid, and the lighting and materials are surprisingly lovely. I also really enjoyed the musical soundtrack. The score is unobtrusively supportive of the action and the pop songs for several scenes were very well chosen to contribute to the mood of the story points. Pigeon toady and the other characters' reactions to him are so darn funny. We keep quoting the lines to each other. If you are in the habit of assuming that films you didn't hear much about when they came out just aren't good, think again. This is an incredibly charming and enjoyable movie, and I recommend it to everyone who loves animated family films."}, {"rating": "9", "text": "Storks soars in terms of animation and sentimental value, but it's humor feels like something that has already been laughed at countless times before."}, {"rating": "10", "text": "I can't wait to see the movie Storks. You know I like this movie about birds like Rio and The Angry Birds Movie. I watched the Warner Bros. movie in the theatre since The Lego Movie."}, {"rating": "6", "text": "The only thing driving this movie is the superb animation and graphics. The story itself is pretty bland, extremely predictable and feels like it was put together within minutes without much thought. Character personalities shifted to drastically and most of the character development was confusing. I wasn't sure what message the movie wanted to convey if there is one at all but overall this could have been a better movie."}, {"rating": "8", "text": "Ya había visto esta película en los cines, la verdad me encanto mucho la película, no creí ver tanta \"emoción\" y comedia... Como se ve, las cigüeñas ya no entregan bebes por ser \"peligroso\" y ahora entregan paquetes. Una cigüeña llamada Junior se ve obligado por su jefe a despedir una huérfana pero a la vez la única humana de la montaña cigüeña, llamada Tulip, a cambio de ser el nuevo jefe de la montaña, pero accidentalmente Tulip enciende la antigua máquina de bebes, y hacen una bebe, que Junior y Tulip de eran juntos devolver ese bebe.\rBueno, la historia es un poco simple, pero eso NO arruina la película, en cambio es entretenida.\r La película empieza de una manera medio extraña, porque los personajes ya hacen todo su papel rápido, como en la escena de Tulip queriendo volar con otros tipos de aves que no saben volar, y terminan casi incendiando la fábrica. Pero después de todo, la película se desarrolla de una manera normal, pues un niño, que pidió un bebe sin saber que las cigüeñas ya no entregan bebes. Aún así Tulip y Junior tienen que entregarlo, pase lo que pase.\r La comedia de la película es algo rara. Digo, los lobos se convierten en una escalera, un bote, un submarino, en un avión (que por cierto fracasaron en el intrnto) y luego se convirtieron en una camioneta. Cuando en realidad, son demasiados lobos para que se convierte en dichas cosas, pero al menos da risa, hasta mi papá se rió y yo también... También vi esta película doblada al español, y las voces estaban bastante bien, tenian puros modismos mexicanos, y les quedaban bastante bien a los personajes.\r La animación es una de las cosas que más me interesa de una película, y aquí si supieron aprovechar la animación, en donde se puede ver una gran calidad de animación, los paisajes o escenarios se ven algo \"realistas\" y se ven bastante hermosos, bien diseñados y bien detallados, hay lugares que no se ven feos, el diseño de los personajes también me parece muy bueno, aunque, el diseño de los humanos algunos se llegan a ver medio cabezones, y bastante delgados, pero eso no es tan malo la verdad. También los bebes tienen un diseño algo decente, pues estos si se ven un poco cabezones, y los momentos donde aparecen, me parece algo \"que me saca de onda\".\r También me gusto la personalidad de los personajes, son muy carismáticos. Exepto el puto jefe de la montaña cigüeña es bastante plano y algo aburrido. También el sentimiento de los personajes es bueno, no se ustedes, pero yo me puse muy pensativo con ver el final al ver a Tulip y su familia de nuevo. XD\rAveces me pasa con algún momento similar en esas películas animadas..\r Debo decir que, cigüeñas es una gran pelicula, no es la mejor, no es perfecta, pero para mí, es una buena película que uno debería ver este fin de semana.. En serio, a mi me gusto que NO e encontrado cosas en contra de la pelicula..."}, {"rating": "10", "text": "We watch Storks 3D with Calvyn and Wyatt at the theatre. Storks is about storks delivering babies, but storks who also delivering packages at Cornerstore.com. And we watch a short film of The Master A Lego Ninjago Short."}, {"rating": "8", "text": "Built on a solid platform of quality animation this kids animation goes from strength to strength. Appealing to adults and children the plot remembers the early years of life as a family. Cleverly it turns the inevitable vomit inducing cuteness into the butt of its own jokes, this only works due to the good casting choice of Andy Samburg as Junior the emotionally allergic stork and a hilarious couple of wolves! The story moves quickly to keep you engaged but none of the scenes feel pointless or simply filler, each is either genuinely entertaining or with a message it wants you to take from it."}, {"rating": "6", "text": "What’s it about?The storks have modernized and replaced their baby delivery service with an Amazon-like corporation. The status quo is threatened however and the company’s heir-apparent is tasked with making the final child delivery.What did I think?It’s an incredibly cute movie with genuine laugh-out-loud moments. The humor is unmistakably Andy Samberg’s so while the film lacks subtlety or real depth, it compensates with enough raw entertainment to overcome a predictable by-the-numbers plot. Good for all ages, it won’t go down as a classic but it’s fun enough."}, {"rating": "10", "text": "Was better than I expected it to be. I was expecting to absolutely hate it but I ended up being slightly amused the entire time. I would rate it a 6 or 7, but since the score is so bad right now I'm giving it a 10 to balance it out."}, {"rating": "5", "text": "The imaginative line used in this movie has not been used correctly. Despite Storks being the friendliest type of movie for this month, it's not enough to send September with a great blast. Look elsewhere for a great movie."}, {"rating": "6", "text": "Though funny and heartwarming at times, Storks ultimately caters to the children in the audience, and ignores the maturity and emotion that could have been used to draw in older viewers."}, {"rating": "9", "text": "Storks is all kinds of surprising. Initially flying under my radar, I was expecting a generic animated flick of subpar quality that would really only appeal to young kids while boring and possible even annoying their parents. Imagine my surprise to find out that it's actually one of the funnier and sweeter movies this side of Pixar and DreamWorks.Basically this is a story about family. Morals of opening yourself to others and finding your family are on full display. It's even got a message for adults about spending time with your kids before it's too late. There are plenty of sweet and heartwarming moments. Maybe a few tearjerkers for the more emotional out there(nothing wrong with that). Then there are those cute babies.Storks is also flat out hilarious. There's a manic sense of energy to things that leads to the firing a constant stream of diverse jokes. With some range and energy it's almost unbelievable how well these jokes hit their mark. There's almost never a miss. The pace and almost insane nature of the humor may be off putting for some, but those who like their comedy fast, effective, and to the point are sure to be entertained.Storks is an all around success that probably hasn't gotten the attention it deserves. It's crazy nature, original concept, and wealth of heart make it an excellent choice for families. Fully happy with this delivery.9.1/10"}, {"rating": "5", "text": "Better then i have expected.This movie raises many interesting plot points but drops it out of nowhere.Promising movie with great animation but i was disappointed with the execution.There was poor character development and the plot shifts very fast.It was funny at times but half of the jokes fall through.However,it is fun and entertaining as a movie if you ignore all the silliness."}, {"rating": "3", "text": "I tried really hard to like this movie when I saw it and I went to the theater with high hopes, hopes that soon would shatter after seeing this god aweful movie. There are a few troubles that I find with this movie that kills anything that could have made it great, firstly the plot can easiest be considered really fractured and broken since little to none of the things are explained properly for example they mention that the storks delivered used to deliver babies but decided to stop becuase one of the storks tried to kidnap tulip (the female protagonist)but it laters turns out that the stork has been looking for the pieces of the tracking device they used to deliver her but nothing explains the middle point other that whole his life he just wanted to deliver his baby (which earlier was told that he wanted her for himself). Secondly and most annoying is THERE IS ALMOST NO SILENCE, every single moment they talk and there is no silence what so ever except for the fighting scene with the penguins which should be the one part where there actually should be sound seriously this is one of the thing they should have considered. lastly is that none of the jokes in the movie was funny and they are getting totaly destroy with the character explaining every single joke to the audience and I know that the movie is aimed at kids but even kids would be able to understand most of the jokes without anyone having to explain it to them, it's just insulting to the kids watching it."}, {"rating": "2", "text": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah why did 1 watch this**** dreamworks or whoever made this ****"}, {"rating": "10", "text": "funny and amazing animation..................................................................................................................................................................................................................................."}, {"rating": "4", "text": "Good visually but full of extremely annoying characters and writing. Some okay humour."}, {"rating": "9", "text": "This is a seriously underrated animated tale. Looking at some of the negative critic reviews, it's makes me question the future of Metacritic as a user guide. At some point in the future, they will have to allow us the option of selecting the review sites that match our tastes. Surprisingly great film, the best animated tale I've seen in over a year. If I knew it was this good, I would have made the trip to the cinema to see it."}, {"rating": "10", "text": "underrated! very witty, well written dialogue. sometimes the plot can feel a bit too quirky to hold up, but i think originality is to be rewarded here. characters are memorable and each has very fun lines. reccommended!"}, {"rating": "7", "text": "I didn't really have any expectations with the movie because I wasn't really interested, but I'm happy to say you should give it a try. The movie has a fantastic cast, beautiful visuals, and was really funny at times. The story wasn't entirely generic but it was overly original."}, {"rating": "3", "text": "I'm sorry, but i don't get why people say this is a Ok movie or a great film just beacuse is funny. The film is not enjoyable. The story and writing sucks, the characters are annoying as hell and  they never stop talking and the rest is stupid that is easy to find troubles with the film. Oh, i almost forgot, the emotional moments are not effective and mostly THE FILM IS NOT FUNNY. Even if the Animation is Nice and yes, there are some jokes that i laugh, Storks is just an annoying, cliche, stupid, unfunny and dumb kids film that was trying to be The LEGO Movie."}, {"rating": "10", "text": "Might not have the best writing, the story is kind of predictable, but it still passes as an enjoyable animated family comedy. The animation is really pretty, and the characters do make the movie enjoyable to watch and funny. If you're not sure about this, I can assure you it won't hurt to give it a shot."}, {"rating": "6", "text": "The movie is loud, the plot is bland, the dialogue isn't great and the movie overall was just pretty average. The graphics and animation are fantastic though. Many things I hate about this film, but very little things I like."}, {"rating": "6", "text": "An inventive & occasionally funny foray into the animated feature universe. The pace of the film is mind-numbingly chaotic at times, although this will likely appeal to the target audience (as will the slapstick comedy)."}, {"rating": "3", "text": "Pretty terrible movie.Couldn't get myself to finish, didn't even see half of it, because it was just bad, the pace was all wrong and the dialogue unimaginative. Complete fail"}, {"rating": "10", "text": "I saw this movie on the plane and went into it not expecting good or bad.  I enjoyed it a lot more than I was expecting and enjoyed the humor.  There are a lot of simple jokes threaded into the plot that is suspect no child would ever pick up on.  The animation was decent and the facial expressions and mannerisms of all the characters are really well done.  For a movie clearly intended for children I can honestly recommend it for all if in the mood for a light hearted comedy."}, {"rating": "7", "text": "I didn't expect much, but it was good! The story is fun and funny. The movie felt short, but it filled every moment. I liked how they added emotional moments also. Well worth it to watch."}, {"rating": "5", "text": "Interesting movie with a funny subject but too slow and boring at the beginning. I almost fell asleep in the first 30 minutes but i ended up enjoying it as a normal animation movie."}, {"rating": "7", "text": "E-Value: 7Acting: 7Plot: 6Storks used to deliver human babies to families all around the world from Stork Mountain until there was one incident where one baby girl was failed to deliver due to the actions of a rogue stork and the address beacon was destroyed in the process. The CEO, Hunter (Grammer), stopped the business of delivering babies because he believes there is no future in that business and started a package delivery business under the name of Cornerstone.Eighteen years later, the baby girl who is now a young adult named Tulip (Crown) have cause Hunter many problems for his company which resulted the company’s stocks and profits fell. Hunter assigns the task of firing her to Junior (Samberg) and if he succeeds, he will be promoted to boss. He is unable to do so and assigns her to the mail room instead.Elsewhere, a lonely young boy named Nate Gardner sends a letter to Cornerstone requesting for a younger brother. Tulip receives the letter and mistakenly creates a baby girl using the baby-making machine. Junior finds out about this but fearing that he will be fired, he has no other choice but to go on an adventure trip with Tulip to deliver the baby to Nate before Hunter finds out.For the second movie of Warner Animation Group after 2014’s The Lego Movie, this is a fun and entertaining movie but not enough entertainment values to match up to The Lego Movie. Still, I am not saying it is a bad movie. For the cast performance, the voice acting is good which is not a problem and not really much of a flaw in that part. The movie’s animation is really done well just like The Lego Movie which I really like it.However, the plot of the movie is not a very strong suit and it gets a little boring and become uninteresting in the middle of the movie. There are many funny moments in the movies to enjoy laughing but unfortunately, some of them are not quite funny for me. But, that is just me and maybe you would think of it differently than I am. Overall, it is a good animation movie (but not the best) for all ages to enjoy."}, {"rating": "6", "text": "not so good or bad, the structure of it is decent and the script is, with the same problem of Madagascar 1 and 2, is loose and only focuses on jokes, while the characters and animation are decent. 6/10."}, {"rating": "10", "text": "Make a plan, stick to the plan, always deliver. That is what they always say, right?"}], "recommendations": ["peter_rabbit", "turbo", "hotel_transylvania_2", "hotel_transylvania", "the_croods", "the_lego_movie", "despicable_me_2", "hotel_transylvania_3_summer_vacation", "megamind", "minions", "shaun_the_sheep_movie", "cloudy_with_a_chance_of_meatballs", "ice_age_the_meltdown", "cloudy_with_a_chance_of_meatballs_2", "the_lego_movie_2_the_second_part", "flushed_away", "penguins_of_madagascar", "madagascar", "ice_age", "incredibles_2", "captain_underpants_the_first_epic_movie", "puss_in_boots_the_last_wish", "despicable_me", "bolt", "paddington"]}