{"id": 2327, "title": "Stowaway", "starring": ["Ruby Rose", "Patrick Schwarzenegger"], "runtime": 94, "genre": ["Thriller"], "description": "A tenacious party girl fights to survive after three thieves commandeer her luxury yacht. Unable to escape and trapped on the yacht at high seas, the prey becomes the hunter as she turns the tables on the intruders and takes matters into her own hands.", "releaseYear": "2022", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/8ZfKo5349nEssW0n2wqNf4vPtbZ.jpg", "categories": {"plot": 4.371428571428571, "acting": 4.37037037037037, "ending": 3.6923076923076925, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.5, "funny": 5.0, "action": 7.75}, "reviews": [{"rating": "0", "text": "This is an abomination of a film. Tremendously stupid, miscast, and all together bad, Prometheus level bad. No one will ever give me back the time I lost watching this. Netflix, please - stop making Sci-Fi movies, you people suck at that."}, {"rating": "1", "text": "The \"stowaway\" plot is so ridiculous and unexplained that after 40 min., I stopped the movie due to loosing too many brain cells.  I could tell it would continue to be be a brainless \"soap opera\" style movie."}, {"rating": "2", "text": "Well, if you don't mind your science fiction filled with gaping holes in the plot, like, how did the stowaway get on board? And, if you don't mind a bit of science fiction thrown into a story that you are supposed to find believable, then maybe you'll like this movie. I did not. Even my wife hated\" it for its lack of a sensical storyline. I must admit, I hated it too. It would have been so easy for them to fill in the plot holes and use some real dangerous events that could occur in space, instead of inventing a fantasy scenario. Have I spoiled the plot? I think the plot was already spoiled. I thought all of the actors were up to par and more than carried their own except for Anna Kendrick who seemed miscast."}, {"rating": "0", "text": "Plot is cringy, huge gaping plot-holes.  The perfect fit for Netflix's recent movies.  You know how hard it is for a buff male to life an oxygen tank, yet Kendrick is able to do it without issue?  Absurd movie, don't waste your time.  Also, what's up with 0 white male in the whole cast?  SJW to the max."}, {"rating": "6", "text": "Anna Kendrick's fantastic acting, good directing, good CGI, and what is clearly a large budget should've made this a masterpiece. Why waste all of that on THIS script? In the end, even with all it had going for it, mediocre at best."}, {"rating": "3", "text": "BAD WRITING - GREAT ACTORS!Toni Collette how could you do this to me?! The only good things I can say about Stowaway was that the acting was good, the CGI was good and the set was believable but the story was just bad and the pace was extremely slow and just boring. I think the actors actually did a good job with what they had to work with! Especially Anna Kendrick! She basically saved this movie from being a total embarrassment.  Kinda. I have no clue why any of these actors agreed to these roles.. it must of been a Big payday? Something. You'll spend most the movie waiting for something to happen! Anything! But it never fully gets off the ground..then towards the end you can already guess what's gonna happen next. Somethings gonna go wrong. Then it does. The end.  I also hate sad endings and this one was not just sad but also nonclimactic."}, {"rating": "0", "text": "Terrible ending and slow.  Endings like that always ruin my movie experience.  Want that time back."}, {"rating": "2", "text": "Awful. It’s the lowest-rent “Gravity” conceivable. Imagine if Gravity was dinner theater with only 4 actors. How the stowaway came to be where they were escapes even a casual inspection of logic. The purpose of the mission appears to be to take two algae cultures to Mars... that’s it. Nothing about the science adds up and the human drama component was so hollow, it was laughable."}, {"rating": "4", "text": "Where he was stuck makes no sense, there was no room to work, he was sandwiched into a tiny space. Asides from that, it makes no sense they'd not scrub the mission, it was not a \"humanities last hope\" kinda situation, they were a few hours out. It just made no sense."}, {"rating": "3", "text": "This is a movie that probably could have been good. The cast is good, the set is great, the CGI is compenent, but those are the three points i'm giving it. Unfortunately, it doesn't work at all, because the premise is completely demented, and the movie gets a lot wrong about how space programs work. The filmmakers consulted Scott Manley to get the physics/space right, but it doesn't really seem they listened. Right from the beginning of the movie tears of cringe will fill the eyes of everyone who's at least a littlebit interested in the space programs/physics. One has to wonder how much worse would it be without Scott's input. The whole premise is completely ridiculous. Without anyone realizing, some dude gets stuck behind a SCREWED IN(!!!!) panel of a rocket, and the crew finds him only after they're already on a way to Mars. They can't get back to Earth, their CO2 scrubber dies, and they don't have enough oxygen either. The rest of the movie is KINDA about the morality of one vs four, and KINDA about trying to come up with a plan to save the stowaway/rest of the crew. The main problem is, that the movie doesn't respect the genre. Either you can have a SF movie with nonsensical macguffins, or you can have hard-SF with plausible or semi-plausible technology. Stowaway tries to do the latter, it's near future, more or less existing technology. Yet the technology spectacularly fails (and there are no backup systems), only as a result of the demented plot, and the characters have to mount a nonsensical rescue mission. The whole movie i wanted to shout at the screen \"IT DOESN'T WORK LIKE THAT\" or \"APOLLO 13 CREW COULD IMPROVISE CO2 SCRUBBERS AND THAT WAS 1970\". The characters are super 2D, certain actions of theirs come out of nowhere, the whole thing is just coming apart at the seams. I really, really didn't like it. Poor cast (as in:i feel sorry for them, not that they're bad in what they do, they're not, they just had to work with what they've been given, which wasn't much). Baaad screenwriters!"}, {"rating": "0", "text": "This movie is an insult to the Sci-Fi genre. With the cast and outstanding special effects I expected so much more. Stowaway falls flat on its face. Anna kendricks is a miscast, her character takes the form of her role in pitch perfect. The horrible writing makes the moral dilemmas very platitudinal."}, {"rating": "3", "text": "When making a film with a taut dramatic premise, the picture requires an equally taut treatment to be effective. Unfortunately, writer-director Joe Penna's space-based, molasses-paced morality play is a tirelessly tedious slog padded with lots of filler and more than a few incredibly dull sequences. The chief culprit here is the script, which is rife with easily spotted plot holes and whose very title doesn't even accurately reflect the story's central scenario. The result is indeed unfortunate in light of the fine ensemble cast and the picture's stellar visual effects, attributes that are sorely undermined by the shortcomings surrounding them. Don't waste your time with this one."}, {"rating": "3", "text": "I like SF movies. And if they are set in an arena of space travel that we already know a lot about, then I kinda expect it to be factually correct. But a short way into the movie I realised this is not one of them. These are the highlights that ruined it for me: A stowaway behind a screwed down panel with no decent explanation on how he got there in the first place. 12 hours into the journey where they could travel 5 months to Mars but not abort mission. Seriously?A spacewalk , to retrieve an oxygen cylinder, where the astronauts are over exerting themselves on an ascent because of gravity effects...in space. Then in the next scene, gliding along the anchor wire, but this time completely free hand and no safety rope or wire. And then returning with a life saving oxygen tank in hand, which by the way is not secured to any part of her body or suite, only to be lost anyway because she could not brake on descent. Yes you read it correctly...could not brake on descent ...in space. I doubt real astronauts would suffer any of those mistakes. I think this was done just to heighten the drama with no real regard for credibility or viewer intelligence. I stopped watching at that point."}, {"rating": "2", "text": "It had a lot of opportunities for be a very interesting movie. Unfortunately the ambiguity around the titular stowaway ruins a lot of the tension. The general incompetence of the characters in their space endeavors (cw the martian) soaks away any credibility which is a shame as the overall premise is excellent"}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "2", "text": "Shocked that Antonia Collete accept this part. Such a great premise, amazingly boring script. None of the problems presented in the movie engage the viewer. The characters are mostly forced and uninteresting.  2 for the cgi, looks kinda cool."}, {"rating": "1", "text": "Zzz sleep, aburrida. Las peores actuaciones en cuanto al uso de la gravedad 0 por todos los actores. Los movimientos del set deben emular una cierta lentitud o torpeza al moverse, aquí pueden escalan, corren, caminan, se saludan, y se abrazan como si estuvieran en su casa y no en el espacio. Quizá nadie sabe nadar, por eso desconocen los movimientos lentos."}, {"rating": "8", "text": "Absolutely thrilling if a bit lacking in the ending. Was left nail bitingly tense throughout definitely worth a watch."}, {"rating": "8", "text": "Three astronauts (Anna Kendrick, Toni Collette, Daniel Dae Kim) are headed to Mars, when they discover a 4th person hidden away (Shamier Anderson). Their ship’s limited resources present problems that eventually will cause the crew to die before landing. Space travel has been done many times, so in addition to this unique (and somewhat unlikely) complication, the producers chose to use technology that’s different from what we’re used to seeing. Once you get past that (and some other unlikely technical choices), there’s a compelling drama. The strong performances help drive home the dilemma. When they finally venture outside the ship, the sequence is pretty harrowing. If you’re willing to overlook some of the questions about the premise and technology, the debate on how and who to sacrifice makes for an absorbing space thriller. Interesting that I had some of the same comments about director Joe Penna‘s first film ARCTIC."}, {"rating": "7", "text": "It's not at all a bad movie but it's far from being a Great move it's somewhere in the middle. There are atleast 3 times in the movie where you go \"why TF did you say that\" or \"why TF isn't that more secure\" but in all its an ok movie. Would definitely watch it again"}, {"rating": "9", "text": "I was quite profoundly moved by this. It's a movie worth reflecting upon. The dilemma experienced by the characters is deeply felt."}, {"rating": "7", "text": "My wife and I enjoyed this. I don't think the premise was that flawed. Okay, maybe it's a bit implausible that Michael would get stuck inside the bulkhead, but we viewed that along the same lines as when the wrong limb gets amputated, or a cloth is left inside a patient's skull.But, for example, the algae farm didn't look very impressive on the ship because he had very limited space and resources with which to cultivate it. On Mars this would have turned into a much more expansive (and likely much more successful) experiment. And, I believe they couldn't scrub the mission and head back because they were already traveling at many thousands of miles per hour and had exhausted all of their fuel getting up to that speed and initiating the gravity-simulating pinwheel. The fuel for their return trip was waiting for them on Mars, but there was no slowing down and then accelerating back up to speed to get back to Earth.Yes, they probably should have had a backup Carbon Dioxide Removal Assembly on board. They did have a couple of canister-style assemblies but as mentioned those would not stand up to a 2 year journey. They were on a very tight budget -- this is mentioned several times, when they decide to continue the burn even though the rocket is underperforming (due to Michael's unaccounted for weight), the fact that the capsule was really designed for two but they had pushed it to three, the bit about how they removed some of the shielding layering, etc. I think having a redundant CDRA was seen as extra weight and expense that didn't make bean-counter sense given that these things have a high reliability and usually there's not a man stuck up there who then falls out of the ceiling.Beyond that, we thought this was a perfect Netflix slow-burn. Not really appropriate for a theater, but we were fairly riveted throughout. We thought the ending was satisfying as well. Not an uplifting film, but one that explores how difficult space travel is actually going to be in real life (my opinion is we probably need to populate Mars with autonomous AI and robots for decades before we send any squishy humans out there, and that shouldn't even happen until we have a very good grasp on how to genetically engineer said squishy humans to be better suited to both the journey and the stay on an alien planet). The idea that \"nothing happens\" is kind of absurd. Plenty happens. Two more things:  1) we appreciated that for the most part all four of these people acted throughout like MATURE ADULTS. There was little to no infantile Young Adult angst and bickering, and the reactions felt authentic to what trained professional adults would exhibit in this situation. And 2) there wasn't even a trace of Wokeness. Very refreshing!"}, {"rating": "10", "text": "This was an unexpected pleasure to watch. Anna Kendrick is outstanding. The story is gripping and emotional. The ending is crushingly sad. Go watch it."}, {"rating": "8", "text": "I'm a sucker for space movies, I rewatch The Martian a couple times a year.  Stowaway is no Martian by any stretch, but it's solid scifi, with a more moral core as it's message.  What sort of problems will humanity face as it sets off towards the stars, how much will come down to personal sacrifice, how much will come down to us remembering who we are and what we should owe to each other.  I liked this little nugget of a movie.  Anna Kendrick is eminently watchable, and a cutie patootie.  It's not going to win any awards or blow anyone's hair back, but I thoroughly enjoyed it."}, {"rating": "7", "text": "Stowaway is another typical streaming flick; leanly produced and good for a lazy evening. But as many of my fellow reviewers have said, it is a cheaper version of Gravity, which are surprisingly well acted by its leads. Hey, I can't complain though."}, {"rating": "7", "text": "A decent enough film to watch on a Sunday afternoon. Though slow and not as tense as I suspected, it does a good job at asking moral questions of what to do if the unexpected can happen, and because of that, lives are then put at risk."}, {"rating": "7", "text": "I'm a sci-fi nut, and spacefaring is one of my favorite sub-genres, especially when it's done well, or as close as possible to real science. In fact, serious potholes or just bad science is usually a deal-breaker for me. Having said that, my suspension of disbelief remained intact despite a few hiccups if the story, acting, and production are good. This is a win because of the story and acting. And despite some of my hackles being raised with weak plot points, I really enjoyed the heart of this movie. It's about everything astronauts and explorers are willing to sacrifice to take on these missions. In that endeavor, this movie exceeds expectations. I see a lot of folks saying it's boring, but I enjoyed the slow burn. They could have easily added more action or some other blockbuster-level disaster to spice it up, but they didn't and I think that saved the movie from being melodramatic."}, {"rating": "0", "text": "Why do they make these ridiculous plot space movies with no concept of the science required?  When a catastrophic failure is discovered why not just turn around? So many flaws …"}, {"rating": "10", "text": "this is a survivalist movie - a question of what will you do if you are in such a predicament? A tough question to find an answer to and that hooks you into the movie --- this is not an action movie or a superhero one so be advised of that if that is what you are expecting to see.  The cast is amazing! Anna Kendrick, Toni Collette, Daniel Day Kim & Shamier Anderson ...need I say more?"}, {"rating": "9", "text": "What contrary to many movies I've seen on Amazon Prime, I thought this was very well acted and special effects did not look third class. Well directed as well. Good psychological thriller and drama and I really felt the emotions of the actors! Well done!!!"}, {"rating": "3", "text": "This was not a good movie except the visuals which made me believe I was spinning with them. Unbelievable situations suddenly \"popping up\" and while it was cool to see old LOST actor here, I was not convinced by the on board doctor..."}, {"rating": "5", "text": "This movie had great potential I thought.  Man I wanted it to be better but it just never quite got there for me."}, {"rating": "1", "text": "Starts out as to get ready for adventure sort of sci-fi, and then it gets very technical and then trying to be very scientific. Eventually it ends up being boring, and then the stowaway is found and there is a bunch of nothing happens. Then the whole scientific part is thrown away with inconsistencies and illogical stuff. The ship has several compartments, maybe 5 or 6 , but the CO2 scrubber is built into only one and there are no backups. You'd think NASA or whatever the space agency would have learned already from Apollo 13 to always have backups on board of life sustaining , which is oxygen/water/food/temperature.  The other big no is, ship is built for 2 but they \"squeezed in 3\".  It's the other way. If there are 3, then the ship is usually built for at least 4 or 5. Always extra room for error, especially air/water/food. Especially for a space mission that lasts 2 YEARS (for crying out loud).  So, I'm watching this and I am aware of these issues already - as these problems reveal themselves not until the mid-way into the movie.  The person behind a wall panel is just completely unrealistic, so while I already given up watching this a real-life scientific movie, the movie turns more illogical to a point, when I am just hoping, that this must be just some nightmare of one of the crews and soon he or she will wake up, this can't be real. Then I'm hoping the stowaway person has either ulterior motives or he isn't what he makes him out to be, just to see some sort of a twist or turn from measuring mushroom growth of the botanic guy. But no. And then the ending. If I wasn't already depressed /bored enough already , the doctor goes on a suicide mission during a solar storm to bring 1 tank of oxygen from the mid section of the ship, suspended on the other end of the whole spinning assembly. Just a reminder:  The oxygen is still not enough. They supposed to have 2 brought back for all of them to live, so the suicide mission only produces only one, so there is still someone else who needs to die. At the sad and depressing ending, I didn't even want to over-think it much since the whole movie is just a long running tediousness with illogical and unrealistic ideas."}, {"rating": "5", "text": "While I thought the movie was okay in terms of pacing and has kept my attention for the most part, I have to say that the basic premise was where I was a bit confused: how did the guy ended up as a stowaway and more importantly how did no one notice extra weight or extra oxygen being used before they found him? I would expect such big missions would monitor even the slightest deviations from predicted parameters. Other than this, I found it interesting, although nothing special or fresh. Since I did not watch any trailer or spoilers, I had no idea where this was heading. It seemed liked Michael fit it rather well too quickly, so I thought he would turn out to be some lunatic, but no... so the movie did manage to divert my expectations, which I guess is good. I did enjoy acting: all four were really good. Collette and Kendrick rarely disappoint me, Kim I only know from Lost where I just loved him and same here. I must say that I did not know Anderson from before and I really enjoyed his performance. The ending was also a bit \"eh\"... If it was just about the performances, I would give it a much higher rating, but this way, it is just an average space movie."}, {"rating": "0", "text": "If you want a movie to watch before killing yourself, this is it.................."}, {"rating": "1", "text": "While the acting and set design is relatively good, the movie overall is an absolute snore fest from start to finish. What starts as mildly boring becomes utterly tedious as you wait for something to happen, anything to happen. But no, nothing happens."}, {"rating": "5", "text": "While the acting was good and the story in the sense of how it plays out, but all the problems they encountered and how hard it was to get oxygen etc, and even the 4th passenger ending up there, all that together just seemed so unlikely and dumb. I don't believe they make space stations where you have to risk your life to get extra oxygen etc. Just too many dumb stuffs there like that which make you feel less emotional about what is happening on screen and think more about how dumb some of it is that they got there in the first place"}, {"rating": "7", "text": "The idea of a moral dilemma in a space mission to Mars had a lot to say in its favor, the problem is that it takes time to take shape and the characters do not generate enough empathy to the viewer, especially in the last act. Better luck next time?"}, {"rating": "3", "text": "Stowaway is a second-rate sci-fi thriller. The film can literally be viewed from the trailer. Weak cast, budget of the picture and straightforward boring plot. The whole film only tries to seem like Sci-Fi, but the dullness of some plot twists shows that this is more of a sitcom"}, {"rating": "6", "text": "Weak story with strong acting. The fundamental question of the movie is not really a difficult question to answer (I won't spoil it by saying what the question is), and that's part of the movie's problem. It's not much of a dilemma. Yes, the crew feels terrible because they're presumably not monsters, but I'm not sure what the writers thought was worth exploring here.Anna Kendrick as the ship's doctor is unsurprisingly the moral center, and the movie exists solely because of her character's choices. As the story progresses, there are some contrivances which don't help the already slight story feel more real, but the director and actors still manage to squeeze some believable drama out of the proceedings.The acting is quite good -- I was surprised by the casting of Kendrick, but she did great -- and it's what makes the movie worth watching. I found Collette and Anderson especially believable.Note that this is *not* a feel-good movie, so go into this with the right state of mind to handle... depressing events."}, {"rating": "4", "text": "Could have been much better. I liked the idea of having an accidental passenger but the way that happened didn't really make much sense. Another thing that bothered me a lot was that they actually got the oxygen tanks pretty easily and the only actual difficulty they had was the very convenient solar storm and still the girl only had to sacrifice herself cause they run out of time for relying on the algaes lol, wich actually sounds a lot more risky, and they were at risk anyway and could have saved themselves and the mission. But anyway, why couldn't they just have aborted the mission? The nonsense kept going towards the end: Why on earth wouldn't she have the oxygen tank tied to her suit? I mean they are scientists, trained to be on space, that should be basic."}, {"rating": "5", "text": "Stowaway is a frustrating movie. More than anything because of the way its development is focused on trying to make you identify with the loneliness of the characters, considering the situation in which they find themselves, and the problem the plot develops for their survival.However, there's a thematic element that I found interesting, and absurd at the same time, this because of the way the script exposes it, but it doesn't justify it in any way.I usually don't mention this, but Stowaway basically describes a story in which the aforementioned stowaway is a black man, and he becomes the problem, because first, he wasn't part of the mission, and therefore he's basically useless on the ship and for the mission, and worse yet, he's stealing oxygen from crew, so is it fair to keep him alive?There was something quite dark there to explore, but this film decides to go the easy way and chose a climax that ultimately feels somewhat empty.And with so many much better space film options, Stowaway will quickly lose itself in the very vastness of its genre."}, {"rating": "4", "text": "(Mauro Lanari)Nick Cave's son dies, he dedicates a trilogy to him and critics consider it a masterpiece. Angel Olsen's relationship ends, while she is depressed composes songs, the producer listens to the demo and decides to release them: \"In a historical era of massive chronic depression, this album will sell like hotcakes.\" \"Stowaway\" follows this idea. Wishes."}, {"rating": "6", "text": "Busy weekend in the re-opening world of Stream to Big Screen. As we know, more vaccines are available and we recommend taking one if you deem it safe for yourself or family. Either way, make sure you all are safe because the theaters are open and opening. We need to support this industry as they have continued to provide entertainment for us even at home. Anyway, enough altruism for this post. This week we were able to watch the new release, Stowaway, which was released on Netflix on April 22nd. This streaming film is about an important mission to Mars with a 3-person crew but as usual, of course, space giveth and space taketh away. The crew faces an unlikely and impossible decision of what to do with an unplanned stowaway *wink wink* aboard the spaceship that is putting everyone and the mission in jeopardy. Let's see how this flick turns out.First things first, the cast is really just 4 people. I mean there's not even a fake voice in the background that gets a basic name in the rolling credits. The writing in the movie works at times. I'm not sure if it was the actors or the writing that worked, but the the storyline is interesting enough to pique a viewer's interest. Between my girl, Toni Collette, and Daniel Dae Kim, I felt their performances. And let me just put this out there... no one believes that Anna Kendrick would be in space. The movie is just downhill from there. Kendrick isn't bad in the movie but how do you not look at her and think, \"is this pitch perfect in space?\" Kendrick hits some lines and scenes very well, but I just couldn't get passed her being whiny in space. The 4th cast member, Shamier Anderson, is barely even used. I think when people view this you're going to expect a lot more interaction and action between the only people in the movie and it just doesn't happen. You're left thinking in most scenes like, \"is that it? That's all you're going to do (or say)?!\" You're feeling a bit empty and that's kind of exactly how I felt about the space environment as well. Empty! We're used to these grandiose space settings like Gravity, Interstellar and others but here space is an afterthought. Yes, we're going to Mars and yes were spinning and it makes us sick but the views are forgettable. You could've almost set this movie on a deserted island or shipwreck and it would be the same movie. It was just disappointing to not really take advantage of the coolest part of the movie - space.With that said, Stowaway has the makings of an entertaining thriller but that's not what we got. A movie dependent on a 4-person cast needs a lot of help otherwise to be memorable. Space movies generally garner a lot of intrigue, impressiveness and beauty in the views but this movie finds a way to make the great beyond even look humdrum. Stowaway has its moments but you won't need more than a handful of popcorn to get through it."}, {"rating": "7", "text": "Absolutely mad as to why those scenes are thought of. It really might scare future aspirants to go out in space when they watched this film."}, {"rating": "3", "text": "Not a bad idea but My God, how are you not going to answer the question on how was it possible for a person to be behind a bolted down panel in a spaceship that’s about to take off for a 2 year trip to Mars??? That didn’t make sense at all to me. I kept waiting, thinking he placed himself there on purpose to compromise the mission or he was an alien, something!! But no, just an accident that he ended up in there. Lol. Terrible and lazy writing! A low budget movie. And Anna’s acting in this one was pretty terrible. I wasn’t able to connect with her character at all. And the ending sucked as well."}, {"rating": "6", "text": "I'm a fan of Anna Kendrick and I'm a fan of space movies, but just not the two combined. This really isn't the right role for Anna Kendrick, and she struggles to bring gravitas to the part. The director can't quite seem to decide whether she's a bubbly, funny, awkward woman (as she usually plays) or she's a strong-willed scientist who must be taken seriously. Can women be both? Sure, but AK doesn't pull it off. The director goes through great lengths to show how smart she is (she went to Yale! YALE!) but undermines that with scenes that make her more of a caretaker and subservient crewmember. Daniel Dae Kim's character isn't very well developed, and both Toni Collette and Shameir Anderson do a better job filling out their roles. The plot which hinges on a moral dilemma, ends up devolving into a fairly predicable space movie that is ultimately unoriginal and unsatisfying. Overall it's not horrible, just disappointing."}, {"rating": "2", "text": "Kendrick in space, not a great fit. If you like scenery, and spaceship shots, drawn out for no reason, to make up 70% of the film, this one's for you."}, {"rating": "6", "text": "I feel cheated out of a great movie. Honestly, 30 more minutes would be perfect. I stopped watching what turned out to be the ending, because I thought it was a middle point. Like a mini break you get in movies. No it was the ending, which really caught me off guard. Good for what it is. Here’s to hoping Netflix will add 30 minutes to this movie which will easily make this a 9."}, {"rating": "1", "text": "So many issues - the premise is just something that would never happen and the explanation for it was about 10 seconds and really weak.  The ending while sentimental was really not the right judgement call leaving us to wonder if these people were even trained.  Oof."}], "recommendations": ["the_midnight_sky", "the_titan", "prometheus", "eo", "the_tomorrow_war", "contagion", "elysium", "snowpiercer", "sunshine", "after_earth", "geostorm", "chaos_walking", "lucy", "how_it_ends", "annihilation", "greenland", "jurassic_world_fallen_kingdom", "infinite", "source_code", "captive_state", "the_cloverfield_paradox", "code_8", "limitless", "sanctum", "star_trek_v_the_final_frontier"]}