{
  "id": 1790,
  "title": "Straight Outta Compton",
  "starring": [
    "O'Shea Jackson Jr.",
    "Corey Hawkins"
  ],
  "runtime": 147,
  "genre": [
    "Drama",
    "Music",
    "History"
  ],
  "description": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9B63hMwU6iICtNDTISCaZQ5US7R.jpg",
  "categories": {
    "plot": 7.21875,
    "acting": 7.825,
    "ending": 7.5,
    "soundtrack": 7.36,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.4,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I must admit that I was pretty surprised by how well this film turned out to be, because it's without a doubt one of the best music-based biopics I've seen! The whole cast gave strong performances and the story had the perfect blend of drama, emotion, etc. I don't even really consider myself a fan of NWA or rap in general for that matter, which is why I'm all the more surprised by how much I enjoyed this film! Overall, definitely check it out if you're a fan of NWA, but even if you're not that familiar with them or their music, their compelling story portrayed in the film is all the reason to see it!"
    },
    {
      "rating": "8",
      "text": "Easily one of the best movies I've seen all year. The story was great. The actors did a fantastic job convincing the audience that they were the young members of the group. The soundtrack for this movie is fantastic. Even if you're not a fan of the music genre or don't really know anything about the group, I still highly recommend this movie."
    },
    {
      "rating": "4",
      "text": "I think a lot of people hopped on the hype train for this one. The plot at times was non-existant, and at other times was just irrelevant. Average acting, accompanied by average screen writing was saved only by classic songs that everyone who grew up in the 80's and 90's loved. I wouldn't recommend this movie. It was slow, boring, and even the most dramatic of situations in the film failed to draw you in. The character development as so poor, you couldn't give two s***s about who lives, dives, succeeds or fails. This, from someone who grew up listening to and loving NWA."
    },
    {
      "rating": "10",
      "text": "Best movie of the year so far, experienced every emotion from laughter to grief. Very well made with good story pacing, 2 hours 30 minutes but was never boring. Great music throughout, shame this group left so much good music on the table to pursue solo careers, if only Ice Cube signed that contract! Dammit! Ironic that 2 of my favorite movies this year both starred Paul Giamatti as an evil music agent, Love d Mercy and this film."
    },
    {
      "rating": "8",
      "text": "I don't like rap never have that being said this is a very good film.  The main reason I enjoyed the film is because it wasn't just about the music it is also about the industry itself and the culture it was created in.  A-"
    },
    {
      "rating": "5",
      "text": "Pretty good acting but evidently the story is wildly inaccurate. Easy E and Heller weren't to blame for the band falling apart - it was Dre and Ice Cube."
    },
    {
      "rating": "7",
      "text": "You won't be surprised by this movie if you have any knowledge about the history of NWA. It is most of the time predictable. Despite that, Straight Outta Compton is still a perfectly recommendable experience. It's well paced, visually impressive and offers great music performances as well as good acting. Dope."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies of this year and it is the best music biopic since 8Mile.The Movie is great in every way.The actors looks exactly like NWA in the 1980's and the acting was absolutely great. The movie tells a lot about their lives and its kinda insane too . The concert scenes looked realistic and entertaining. The movie is not just doing crazy stuff it even has heart in it. There were 2 great cameos which was surprising. The soundtracks were great . The only problem I had with the movie is the pacing issue.\r In the end Straight Outta Compton is a great biopic. You will have a great time with the movie."
    },
    {
      "rating": "5",
      "text": "for a film that is trying to be complex, it is utterly one-dimensional. Music is great, acting can slide but everything else is just exploiting the ''popular rage''"
    },
    {
      "rating": "8",
      "text": "When I went into the cinema to see Straight Outta Compton I was expecting a film which glamorised the gangsta rap lifestyle with lavish parties which featured excessive violence, sex and drug use. What I got was a well executed biopic which looks at the rise and fall of one of most influential rap groups in American history.\r The film is more than an standard biopic, it deals with themes that are bigger than N.W.A. Police brutality/racism is a common theme throughout the film. One scene where the group are harassed by police for simply standing outside there recording studio highlights how tough it was to be a young African American at the time. Sadly it reminds the audience how nothing has really changed in the last 25 years for this portion of the American demographic. The other theme's the film delves into are greed, gang violence and betrayal.\r The cast is headed by three very talented young actor's, O'Shea Jackson Jr, Corey Hawkins and Jason Mitchell play Ice Cube, Dr Dre & Eazy E with ease and style, Paul Giamatti as Jerry Heller is excellently cast and proves why he s one of the best actor's of his generation.\r The film isn't perfect as it struggles from pacing issue's throughout but overall director F. Gary Gray achieves a decent film which is made better by the performances of it's actors. This is a large improvement for F.Gary Gray as some of previous films such as The Italian Job remake and Be Cool will not be remembered as fondly as Straight Outta Compton."
    },
    {
      "rating": "4",
      "text": "A few dynamic characters make this movie interesting. It's definitely worth a watch, particularly if you are at all interested in the history of race relations in the United States. Unfortunately, like many historically based movies, it glosses over issues that would make the protagonists more interesting (and perhaps less likable) and resorts to formula and cliche. It lacks the grit required to make this movie more realistic, challenging and significant."
    },
    {
      "rating": "8",
      "text": "Great movie, I have always loved NWA ever since I first listened to their music. This movie has everything, from funky beats, hardcore lyrics, racism, riots to greed, violence and heartbreak. The reason I gave this movie 8/10 is because it does not show certain parts of NWA. For example, in the movie MC Ren's and DJ Yella's contributions to the group are shown to be a minimum. The homophobia, misogynist controversies created by NWA have not been shown. Good movie overall though. RIP Eazy"
    },
    {
      "rating": "7",
      "text": "This film was very good and entertaining for the first part, but it falls flat on its face when it comes to accuracy. This movie makes Eazy-E look like a whiny, angry, annoying **** who fell down after Dr. Dre and Ice Cube left Ruthless Records when that was never the case. What I've got to say is that this movie goes out of its way to glorify Ice Cube and Dr. Dre while making Eazy-E look like a failure. This is likely due to the fact that Ice Cube and Dr. Dre produced this movie. Nonetheless, it's still an entertaining movie and I would recommend it as a movie, not as an accurate depiction of what did happen with N.W.A from 1986-1995."
    },
    {
      "rating": "10",
      "text": "Straight Outta Compton is one of my top ten favorite movies. This legacy film about the NWA is everything a great biopic should be. The performances are incredible across the entire cast. Every shot is masterful. The inclusion of the music elevates the story. Every single line of dialogue drives the story forward. The best part about Straight Outta Compton is that you become so invested in the characters and the story that you forget you're watching a movie. You are really transported to this period in rap history. Eazy-E, Ice Cube, and Dr. Dre got an amazing send up by this film, and this film will keep the ultimately human story of the NWA  real for years to come."
    },
    {
      "rating": "10",
      "text": "Its the best movie r.i.p easy e rest in peace I really like there album straight outta compton"
    },
    {
      "rating": "3",
      "text": "At least the movie gives some reality to the experiences of these people. Interestingly, the rappers made songs about hating the police like \"F**k the police\" and yet all their problems have nothing to do with the police. Other than making a worthless point at the time and now, the movie just isn't very good. Way too long, music is absolutely horrible and unlikable characters. The only brutality taking place is me having to watch this trash."
    },
    {
      "rating": "3",
      "text": "Average movie with below average acting. I think the hype machine has done a better job convincing people this movie is actually better than it is. The Hollywood fluff is obvious. The movie is missing the grit and reality. This group suffered from drug abuse, sexual assault, battery towards woman, and violence. Interesting how they forgot to put those in, making these guys look like heroes. Pioneers in the music scene yes but heroes they are not.  Eazy E suffered from drug addiction to Cocaine, X, LSD, Crack, amongst many others including being a drunk 100% of the time. Dr Dre was charged several times with assault including beating up a waitress and getting charged for beating up his ex girlfriend. Ice Cube growing up with strict parents and becoming a dedicated father in the early 90's This truth never came up, was ignored and sadly the people will never experienced the real truth as to why this group fell apart. Watching it was hilarious how they keet ignoring the real truths scene after scene. Showing Eazy E and Dre treating woman so kindly and never once doing drugs. Please I wanted to see the GRIT and the REAL people these men were. Dre is a different man now and Cube grew up faster than all. This would have been a more powerful story showing how they grew up rather than ignoring the pain and trouble they were facing personally."
    },
    {
      "rating": "8",
      "text": "Straight Outta Compton is a terrific journey through the music, and culture of the 80's and 90's despite it's stereotypes. This movie is fun to watch, for multiple reasons, but the biggest is the music. While you watch and jam out to the awesome music, you also get to see the culture and society of the 80's and 90's. Besides the music, the acting is also surprisingly good, as all of the actors are given moments to shine. My biggest complaint is the portrayal of police in the film, I understand that a large majority of police in Los Angeles were corrupt, but not every cop was a racist pig, I think the racist cops would have been even more resonating if we saw a normal cop every once and a while, not just a bunch of growling, racist, asses. In essence Straight Outta Compton is a funny, well acted, engrossing, music jam fest, that chronicles one of the more important rap groups of all time, but could have layed off of the stereotypes."
    },
    {
      "rating": "10",
      "text": "I saw it at a Thursday Night Preview.  This is going to be one of those instant classics.  Five boyz from the hood, who knew they wanted to be successful, who were experimenting with music, and created something that was never heard before.  Something that took off like wildfire, and they had no control over it's success.  They went from a friends basement to the world stage in a few short years.  And how instant success can also be a downfall.  This is a MUST SEE MOVIE."
    },
    {
      "rating": "6",
      "text": "Though a jumbled, and certainly not unprecedented biopic, Straight Outta Compton is a timely, potent, and most importantly, galvanizing watch that should prove engaging for hip-hop heads and the unconverted alike. It's melodramatic, overlong, definitely inaccurate, detrimentally indulgent, and edited so swiftly it leaves a feeling of wanton (the original cut was over 200 minutes long). But man, the performances, the music, the concert recreations, the legitimately harrowing storyline and it's intrinsically essential and historic quality is what makes Straight Outta Compton one of the better biopics in recent memory. It's certainly one of the most important films of the year."
    },
    {
      "rating": "7",
      "text": "It may be hard to believe but “hardcore” Rap wasn’t always all about all the Bling-Bling or the size of your girl’s rear-end. When NWA broke into the scene unapologetically spitting rhymes about the brutality of the streets they lived on, “Gangsta Rap” was effectively born, which then gave birth to a string of early 90s gritty “ghetto” dramas like ‘Boyz n the Hood’ and ‘Menace II Society,‘ with their unglamorized depictions of young black Americans growing up in the most deprived areas in the USA.\r With ‘Straight Outta Compton’, director F. Gary Gray (Friday, Law Abiding Citizen) manages to effectively combine the harsh nature of these early 90s “Hood” dramas with the core elements of a dramatized contemporary-culture biopic, to build what is essentially a modern “American Dream” human drama, after all NWA members Ice Cube and Dr. Dre went from struggling poor teenagers in gang-dominated South Central L.A. to global music superstars and eventually multi-millionaire media-moguls.\r The story in ‘Straight Outta Compton’ is more extraordinary than fiction despite being “dramatized”, but the performances are the stars of the show, particular praise must be given to Ice Cube’s own son O’Shea Jackson Jr. who very convincingly plays his old man and Jason Mitchell for effectively capturing the essence of the late Eazy-E.\r Despite the novelty of being a Rap and urban-drama real story, ‘Straight Outta Compton’ walks a very similar and well-trodden path that most music Biopics seem to follow, complete with strategically placed moments of pathos and grief, perhaps the most disappointing element is the depiction of the group members as heroes of the piece taking little responsibility for their actions and those of the “villains” around them, not surprising since the movie is produced and effectively helmed by Ice Cube and Dr. Dre themselves.\r For its shortcomings, ‘Straight Outta Compton’ is a compelling watch and as good as any recent music biopic, albeit in a sub-genre that is often disappointing, the most striking theme of the film is that of police brutality and the systemic oppression of ethnic minorities in the USA… and although it should not be an excuse for callous and subversive behaviour, it does highlight an issue which remains as prevalent today as in the early days of NWA.\r The Bottom Line…\rWhile it’s confined by the predictable limitations of the music biopic genre, ‘Straight Outta Compton’ is an effectively crafted “ghetto” drama based on a true-story more extraordinary than fiction which manages to retain its social relevance."
    },
    {
      "rating": "9",
      "text": "░▒▓█▀▄▀▄▀▄█▓▒░ NWA was the Civil Rights Movement for the hood! This film translates into the story about how cops draw conclusions about every black young male in the hood is a thug and how they aggressively deal with this stereotype prejudice. But these young men fight back with justice through their creative street sounds to tell America of the abuse and struggles of surviving in the hood."
    },
    {
      "rating": "0",
      "text": "STRAIGHT OUTTA OF DR.DRE'S MAKE BELIEVE WORLD MORE LIKE IT.....~This movie is clearly meant to totally make Dre & IceCube look like the good guys in every possible way..The same EXACT way \"the people VS OJ\" make Kardashian look like a 'good person and not the villain he actually was...~So now Dr.Dre wasn't aware that they set up Eazy-E to force him to sign the contracts..GIMMIE A BREAK!!!~Where's all the stuff about Dre's sexuality?The BEEF Tupac had w/ Dre over his bi-sexuality?~Why do they make Suge Knight appear to not care about the music at all?~Why wasn't it mentioned that Eazy-E got 50% of every dollar Dre earned from TheChrnoic almub cause he broke contract????~Why was DJ Yella made out to look like a cupcake?~I remember the day '100 miles & running' came out and my friend started playing it and we're blown away by that..~ NWA second full album was beyond huuge and it got -0- play in the movie. THIS MOVIE IS A DR.DRE MOCKUMENTARY..Which would be fine but I'm curious how the EazyE estate feels about it?~Wonder how SUGE KNIGHT feels about it.~Wonder how Jerry Heller feels about it.That's right,,they ALL beefed it so bad that they filed suit.Suge is in jail on murder charges from trying to run over the people making this movie.And JerryHeller died trying to dispute it..And The wife & children of Eazy-E,,,well you should read what they say for yourself..wHAT GOT MY ATTENTION THE MOST WAS WHEN SUGEKNIGHT SAID TO EAZY \"Dre don't even know you're here\"\".. I knew this was a Dre attempt to make him appear more non ghetto to his new friends.."
    },
    {
      "rating": "7",
      "text": "Straight Outta Compton is a horror story. It shows a culture that is in a perpetual confrontational frame of mind. Disrespect is rampant. Respect isn't earned, it is snatched through intimidation. The bigger the man, or the bigger the gun, the more respect is garnered. The community talks of brotherhood, but in reality, it is just the opposite. It is amazing how the people of the community know that their lifestyle is self-destructive, but they adopt the lifestyle anyway. I guess many of them believe that they almost have no choice. One of these days someone will have the nerve to make a movie explaining the real reasons why things are so bad in the hood. Until then we will have movies like \"Straight Outta Compton\" doing their best to give us a peek inside America's haunted house and the people who live there."
    },
    {
      "rating": "5",
      "text": "It's really annoying and just poor to portray police constantly shouting F word profanities in movies.  They generally do not in the line of duty, and if they did it would be highly unprofessional.  Sure, certain ones must sometimes and especially in the ghettos of this movie but at a certain point when every single line from officers is F this, F that such as in the first arrest scene by the Compton police as depicted in this film, one loses the suspension of disbelief.  And this is a true story!  The gangsta rappers talk that way, but don't believe the hype when they twist it onto the police.  In the scene with the Torrance police the same thing, every single line out of the cops' mouths has F whatever.  Then ironically in the LAPD chopper arrest scene later there's no profanity from the police.  So what are the filmmakers saying, LAPD don't swear during intense arrests but the other local agencies do?  Movies are ALL editorial and everything can either be made very accurate or very carefully manipulated to make a point.  Or they can just be half ass and sloppy about both the truth and the point they are trying to make, which is what this movie is much of the time.\rA fairly large canvas that rips off scenes straight outta \"The Doors\" (which was maybe the first L.A. supergroup contrary to the film's bit from the media claiming NWA as that, and they were going 20 years later!) but without Stone's masterful power.  For that matter this movie is the same rags to riches musical story as \"Jersey Boys\" was from last year but also without nearly the emotion and finesse that film had from master director Eastwood.  This film is a fairly competent noble attempt but proves ultimately a soulless run through with an overly long running time.  If it had half the energy the end credits have it might have been above the fray."
    },
    {
      "rating": "0",
      "text": "You can tell Dr Dre and Ice Cube were behind this movie. The entire plot casts them in a favourable light while dropping advertisements in between for their labels. I also noticed that the movie cast Eazy E as a villain, which I think is unfair as he is dead and can't defend himself. This movie showed to me that Dr Dre still feels cut by the things Eazy E said about him and wants to rewrite history."
    },
    {
      "rating": "2",
      "text": "This movie is **** aids. Like, it gave me aids. There was not one minute of this movie that I did like.  The ratings for this are only positive because the movie's theme of police brutality against blacks coincides with present day news coverage, which is all about police brutality... There is absolutely no artistic value in this two and a half hour pile of aids. No one will remember this three months from now."
    },
    {
      "rating": "9",
      "text": "\"Straight Outta Compton\" 10 Scale Rating: 8.5 (Great) ...\r The Good: Despite being filled with unknowns, the film is well acted and full of great performances. You can tell that the leads were fans of the source material. O'Shea Jackson Jr, playing his real life father Ice Cube in the film, was especially good and stood out from the rest. The film itself is fascinating and at times far more humorous than I expected it to be. Some will go into the film assuming it is dark and violent and while it certainly doesn't pull any punches, it has more heart and at times has a  lighter tone than you'd think. The soundtrack is obviously top notch and well crafted. It didn't simply play N.W.A.'s greatest hits, but also timed them well and showcased a lot of solo material throughout the movie. A great love letter to the group and something that fans of N.W.A.'s music will be proud of.\r The Bad: If you're  not a fan of N.W.A., then you won't like it nearly as much. You'll still be entertained to an extent, but it won't grab you like it would someone who grew up with the music. Some moments of their career was glossed over somewhat and I would have liked to seen more of their rise than is shown. MC Ren, a founding member of the group, is completely under-represented and fades into the background even more so as the film chugs along. I understand that Dre, Ice Cube, and Eazy had titanic solo careers, but Ren was one of the driving forces behind the group and the chief rapper on a lot of their tracks. It's a shame that he didn't quite get the credit he deserves."
    },
    {
      "rating": "0",
      "text": "I was not able to count the numbers of the words **** and **** but I think they came out about even. And the treatment of women? This is a lousy example of successful blacks. Hard working honest blacks should picket this cesspool of ideas before it spills out onto the streets.\r One of my high school kids said that rap was for blacks who could not really sing. Now I see his point."
    },
    {
      "rating": "9",
      "text": "Dope movie! Definitely a classic! I would recommend watching the NWA Documentary if you have never heard about NWA. There were people in the movie who acted as if it was a fictional biopic lol. I would see it again! Ice Cube's son did great as well as Jason Mitchell (Eazy-E) and Paul Giamatti."
    },
    {
      "rating": "10",
      "text": "If you are going into \"Straight Outta Compton\" not expecting to hear so many curse words and poor treatment to women, then you clearly do not know what you are walking into.\r I was going to start with everything bad, but I can't think of anything. This is literal perfection for a biopic, Gary Gray chose an all-star cast that did an excellent portrayal of their characters, at some points, I thought Ice Cube's son was actually Ice Cube! It shows the harsh world that they grew up in and the mistreatment by the police, and in return, N.W.A. 's I-dont-care attitude. I would say it needed all the language, have you heard any N.W.A. song? If you're going to make a movie about artists, the least you could do is preserve their artistic intentions, which were to show a harsh reality through harsh language and lyrics. The women, drugs, violence, all of that just melds together with the emotionally gripping story and the end product is pure cinema gold. I must say, it is an intense movie and is not for the light- hearted. A major step up from the movie \"Notorious\", which it is commonly compared with."
    },
    {
      "rating": "10",
      "text": "Great movie and story-line. this movie was well written and acted. You will walk out of the theater satisfied trust me. I will not give any spoilers but the time line and life of each member was well written.  I love Bio Picks and this one fall in that category. 10/10"
    },
    {
      "rating": "10",
      "text": "HOW COULD I NOT RATE THIS MOVIE A 10?  ITS EVERYTHING I HOPED FOR.  BEING AN NWA FAN DURING THEIR HEYDAY AND INTO THE PRESENT.. I WAS SKEPTICAL THAT ANY HOLLYWOOD DEPICTION OF A GROUP OF REAL PIONEERS LIKE NWA WOULD BE HOLLOW AND TAILORED FOR THE GENERAL POPULATION AT LARGE.  FANS AND NON-FANS ALIKE... BUT AFTER SEEING THIS MOVIE... I STAND CORRECTED.  PROPS TO THE DIRECTOR.. UNIVERSAL.... AND THE LIVING MEMBERS OF NWA FOR GIVING US FANS A GLIMPSE INTO THE REAL LIFE AND STRUGGLES OF NWA AND HOW THEY WERE RECEIVED AND REJECTED ALIKE DURING THEIR RISE.  GOOD 2 HOURS SPENT IN AN A/C COOLED THEATER...   GO SEE IT"
    },
    {
      "rating": "10",
      "text": "this is a good movie, We now can learned the true history of the N***az With Attitude (NWA). We also learn why people are so scared of Black People, cuz they're goddamn color, **** please! They ain't a threat! They just people, 'kay?! This is my favorite movies of all time, and this is what people got something to say, in their own life, about tha police! So if a cop assaulted you, Play \"F**k tha Police\", So you know your right! The drama's work very well, & it's good!"
    },
    {
      "rating": "9",
      "text": "Straight Outta Compton is definitely the best biopic of the decade. This is because of it's great script, great acting, and great chemistry between its stars. The performance I was most impressed with was by Ice Cube's son, who played Ice Cube. Paul Giamatti was also good in the film. This movie will definitely (well, I hope) a good amount of Oscars for its great direction"
    },
    {
      "rating": "0",
      "text": "I stepped into the theatre into the theatre with my pumpkin spice moca latte. Once it started my skin was roasted and my pale, see through skin was turned into the most hood thing yo Eva seen, ninja, sorry that was the white in me is still there.. My purse with a yorkie in it turned into an ak-47. My phone turned into some koosh. 0/10"
    },
    {
      "rating": "10",
      "text": "great movie, shows the rise and fall of nwa perfect acting and emotional drama, far successful at giving the life of a gang banger in compton than boyz n da hood, (even though there is a 22 year difference). i thought it was gunna focus all on them being badass **** it showwed the emotional side that i didn't believe they were gunna actually put in the movie, i'm a huge metal head but i **** love the nwa!"
    },
    {
      "rating": "10",
      "text": "One of the best movies in 2015 ! You won't regret seeing this ! Definetely deserves an Oscar or a nomination.... If you go watch this you won't be dissapointed"
    },
    {
      "rating": "10",
      "text": "this is a really really really good movie! i had a ton of concerns mainly because i was not sure if the acting was going to work i was not sure how cover songs would work but it never was a disappointment. the acting was superb! these guys were crying yelling and were pissed off and i was sometimes forgetting that it was a movie um this movie is not for everyone ok its very sad its brutal and its going to make you fee really uncomfortable sometimes especially with the Rodney king part of the movie its not fun to watch but thats how it was intended and im glad this stuff was brought up they push it to the max here so they can explain what happened and how they became a non violent weapon against all of this crap that was going on in the city of Compton! now i have only one very small complaint being that this movie can only go on for so long meaning this huge story was crammed into 2 and a half hours one minute there broke dudes trying to make a point and half hour later there huge stars its way too fast. but this movie is so good it could be as much of a classic as the album straight outta compton and its worth every single cent."
    },
    {
      "rating": "0",
      "text": "I paid 13$ plus a soda and a drink.   42 minutes into the movie I left.  Way too much hype over this movie.  The acting was poor and the movie went no where slowly. Save your money and wait for the Redbox DVD."
    },
    {
      "rating": "0",
      "text": "Rap music is done by people who can't sing, write lyrics, or play an instrument . This movie glosses over the racism of N.W.A., particularly towards Koreans, and tries to lionize them as courageous civil rights heroes being held down by the white man. The reality of N.W.A. is that they were a group who conveyed an image of toughness and rebellion to rake in the money from their gullible fans who had no idea the group was faking it. Like modern rap today, it's all an act that's used to glorify criminal activity."
    },
    {
      "rating": "10",
      "text": "sdada\rasd\rasd\rasd\ras\rda\rsd\rasd\ras\rdas\rd\rasdsadasdasdasdmndsfbdsmnbfmsndbfmnsbdfmnsbmnfbsmbfm msnbf mn bmnb mns bmnsb fmns bmns bfnms bmns bfmnsbnmsb msbm nbsm b\rsdfsjkdfls"
    },
    {
      "rating": "7",
      "text": "This is a biopic of N.W.A., the seminal gangster rappers who rose from the violent streets of Compton, California in the mid-80s. The first hour lays out their hood's brutal culture and their rise to national success. The next 90 minutes (yes, it's 147 minutes long) watches as the 3 major members (Easy-E, Dr. Dre and Ice Cube) go their separate ways and struggle with their own success. Director F Gary Gray has succeeded in crafting an environment that effectively reflects their aggressive, intense world, while managing to create sensitive portraits of the main characters. It's noisy, brutal and decadent, yet informative, empathetic and affecting."
    },
    {
      "rating": "9",
      "text": "Probably one of the best movies about this era, right up with Boyz In The Hood (one of my favorite films of all time.)    The only negative I can think of is maybe since Dr. Dre was a producer some of his negative incidents were not included, while Suge killed someone because of his negative portrayal.  (Which were some of the best parts of the film.)  Adds to the craziness of it.  Probably an instant classic in its genre, and a very good movie."
    },
    {
      "rating": "10",
      "text": "F. Gary Gray's tribute to the rap gods, N.W.A is not only hard hitting and brutal, but extremely knowlagble and executed with almost no flaw. Straight Outta Compton hits every note, every line, every heartbeat and every rhythm. It is truly a masterpiece and a golden piece of cinema for ages to come. SOC tells the story of 3 guys out of a racist and judgemental, also incredibly violent neighbourhood, which is putting people under the influence of drugs and crime. Easily put, this is not a very pleasant place. But, they don't give up their hopes, and overcome tough situations to become rap stars with music that many found vulgar and obscene at the time. We are talking about the superstars, Ice Cube, the late Eazy E, and Dr. Dre. You might not believe it, but this is a true story, these acts of random violence, the cruel neighbourhood, the drug dealing, the every insult that they had to endure, happened. Personally, I thought Gary Gray's take on the Watts riots was deep and thoughtful. Another thing that I loved was putting younger version of hip hop artists that we know today, it really is a blast from the past. Compton was recreated so realistic at the time than ever. Suge Knight was well represented as well. Jason Mitchell and O'Shea Jackson Jr were brilliant. And Paul Gimmati as Jerry Heller didn't damn disappoint. Don't worry, there are sprinkles of black comedy here that are available for your taste. It's not fully serious, it likes to laugh a bit as well. Another thing that people should know is that this was not a easy film to make, Gary Gray and his team ran into some trouble while filming in Compton, California and presenting a film like this may get some backlash. But the risk was worth it, Straight Outta Compton is one of the best biopics of this century, it stands between a message of brutal racism and a life story of true artists. Oh! Did I forget about the music? Jaw dropping. Everyone had fun and were singing along, including myself. Well, there you have it, it may be hard finding another masterpiece in 2015. Don't you damn miss it."
    },
    {
      "rating": "8",
      "text": "A superb film really. Captures and invigorates the oppression that people in the USA had to deal with in the 80s with an original blend of parties, passion and music. I just wish that this film was a bit shorter as it has a great tendency to drag in the third act."
    },
    {
      "rating": "8",
      "text": "The N.W.A. story hit theaters in a big way. \"Straight Outta Compton\" is an engaging biopic. First off, our three main leads give stellar performances. You don't see the performance rather you see Dr. Dre, Ice Cube and Eazy-E. They all pulled off fantastic performances but Jason Mitchell (Eazy-E) is the real standout. Not only is he the first character introduced into the movie, but he's the one you care about the most. Mitchell brought a lot of emotional depth to the role, and made it a performance for the ages. But that's not the only standout. Director F. Gary Gray really showed his talents for making not just an entertaining movie, but an emotional journey through the eyes of these legendary rappers. Before then Gray really only knew how to make moderately entertaining movies. Here, you could tell that this was a passion project for him. And he pulled it off with spades. It was a great history lesson without feeling like a history lesson. You could tell that in the movie, there were things that they did not hold back; which make for a much more entertaining experience. The last act of the movie may not be as strong as the first two, but there are still terrific scenes in there. There were some cameos. Some good, one in particular (for me) was ridiculous and I personally didn't buy it. Also, there was one character introduced about halfway through the movie who was nothing more than a clear antagonist. His performance was fine but he came off as one-dimensional. But overall, this was a fun, emotional and crazy biopic. If you haven't seen it and want to learn more about N.W.A. Go see it. I give it an A-! Be sure to check out my YouTube channel \"LittleMovieBoy\" for more reviews."
    },
    {
      "rating": "7",
      "text": "Overall entertaining movie if you were/are a fan of NWA. A few inaccurate facts, like Eazy E wearing a SOX hat in 1986. Those were not released until 1990, no way that hat was available in 86. I also think they avoided the Eazy E, Dr Dre beef for some reason. At times the movie feels rushed, and other times moves a bit slow, giving it a bit of a jumbled feel.\rStill, if you are a fan, it is a good watch. Anyone who hates this type of music is going to hate it."
    },
    {
      "rating": "9",
      "text": "Based on how N.W.A was formed, the whole movie itself perfectly blends together! The cast and crew of Straight Outta Compton was great, the terminology of how N.W.A was formed worked flawlessly, the tone and message of this movie is thought-provoking, and the overall writing of this film was extremely coherent to follow along and even rap alongside with. Without a doubt, this one of the best biopic films that I have ever seen in my life. Overall, I loved this movie!"
    },
    {
      "rating": "8",
      "text": "Emerging from Compton, Los Angeles in the mid-1980s, NWA revolutionised rap culture with their music and tales about life on the streets. This biopic, directed by F. Gary Gray, is more relevant today than ever. Black artists expressing themselves in a time of police brutality, harassment, media spin, social unrest, it's scary how it all mirrors recent events. It's not all a sociopolitical commentary though, it's about the art of young men who dreamt of bigger things, the early days of laying down beats in the bedroom, the first gig, the recording sessions. And then the fame and fortune, the sex and drugs, the threats and violence.\r A lot of ground is covered in the 2 hours and 27 minutes runtime: Eazy-E meeting Dr Dre and Ice Cube, the recording of Straight Outta Compton, the touring and FBI threats, the breakup of NWA, Cube's solo success, Dre signing with Suge Knight's Death Row records and the fallout, working with Snoop Dogg and Tupac, Eazy's death from AIDs. The film picks up in speed and left me asking for a slower pace, mainly in the second half. It's annoying that melodrama is favoured instead of real incidents swept to the side: Dre's violent encounter with a woman journalist, Eazy E's diss track about Dre, Cube's and Dre's music that was influenced by the LA Riots (although the Rodney King trial and riots are played out in the background). Even if all that was included, there would still be those complaints of \"Ah but what about the misogyny! And the homophobic lyrics!?\" etc. It's a tough and complex task, but what's here is what matters the most: the relationships and the music.\r The performances of Ice Cube (played by his son O'Shea Jackson Jr), Dr Dre (Corey Hawkins), MC Ren (Aldis Hodge), Eazy-E (Jason Mitchell) and DJ Yella (Neil Brown Jr) cannot be faulted. Each one dishes out pulsating rage and energy throughout, from the desperate hard times to the excessive good times. These young men have come out of nowhere to carry this film with their chemistry and it's impressive, especially Corey Hawkins who is (only slightly) the standout. Paul Giamatti plays their shady manager Jerry Heller, who is at the core of the conflict and mistrust that engulfs the band later on.\r The soundtrack, mostly NWA material and tracks from Dr Dre's new release 'Compton', keeps the action and drama together at all times. Live performances of their classic anthems like Straight Outta Compton or the studio session for **** The Police as the band hits their groove, it's all seamless and entertaining. This is obviously coming from a fan of the music, how non rap fans will react is for someone else to review!\r Although not perfect and history being tweaked to appeal to a larger audience, barring sequels and franchise blockbusters, Straight Outta Compton is one of the best films of the year so far."
    }
  ]
}