{
  "id": 3774,
  "title": "Street Kings",
  "starring": [
    "Keanu Reeves",
    "Forest Whitaker"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Tom Ludlow is a disillusioned L.A. Police Officer, rarely playing by the rules and haunted by the death of his wife. When evidence implicates him in the execution of a fellow officer, he is forced to go up against the cop culture he's been a part of his entire career, ultimately leading him to question the loyalties of everyone around him.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/csXyZ1BsDBlH0PXkOFWxggEf9WF.jpg",
  "categories": {
    "plot": 6.344827586206897,
    "acting": 6.4,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Decently acted Keanu Reeves led Cop-thriller based in LA and involving the corruption of the LAPD, which seems to be what alot of David Ayers work seems to revolve around. Dialogue and characterization is pretty good with good acting from most of the cast with Hugh Laurie taking the lead with his typical Gregory House-like charm. While the movie overall is good if you like hard-nosed, clear cut cop thrillers, the ending is rushed and a tad bit incoherent."
    },
    {
      "rating": "9",
      "text": "I don't think the critics are right on this one. I thought it was a verry good movie and a damn good Keanu Reeves movie."
    },
    {
      "rating": "2",
      "text": "Although there are lots of fight scenes, the plot is slow-moving and tedious. Hugh Laurie is a total disappointment and his wraith-like, inconsequential character is 2-dimensional and without any apparent reason for being in the film. The only good thing about the film was the plethora of good-looking people - Keanu is still drool-alicious."
    },
    {
      "rating": "6",
      "text": "This movie is okay not the best action movie, but still has some awesome scenes,and it keep's you wondering what will happen next.Acting was okay and the plot was okay it's not worth to go see it in the theater maybe just rent it for $2."
    },
    {
      "rating": "7",
      "text": "Astounding dialogue, subtle characterization, pretty solid acting across the board, but - for a movie whose ending is clear pretty much from the get-go - it gets kind of rushed and incoherent at the end."
    },
    {
      "rating": "10",
      "text": "Finally another cop movie that delivers and is king and raises the bar in the world of police corruption, I can't believe no one else gets it, and sees how great this film is. It doesn't get any better then this, I have to put this one in my pile of all time classic great dark cop films, and this is my new number one, among the greats like Training Day, Copland, Internal Affairs, Narc, LA Confidential, The Departed, Harsh Times, The Negotiator,"
    },
    {
      "rating": "9",
      "text": "This was a surprisingly good movie considering who the lead actor and what type of \"professional\" reviews this movie received. I left the movie with a great experience and I was entertained the whole way through. Yes, at times it was very typical and some lines were weird but it didn't take much at all away from the movie. A must see for everyone because this is as serious and realistic as you get in a movie. If you don't catch this in the theaters, its one for your DVD collection."
    },
    {
      "rating": "8",
      "text": "This movie is really enjoyable. I can see why the critics panned it: Keanu is a wooden actor and the plot has been done before. The \"surprises\" aren't really surprises. But the tension in this film builds well, the action scenes are solid and the pacing is great. I don't need to get all emotional over the characters in a police action thriller, I just want to enjoy it. For me, that's what this film comes down to, it's enjoyable to watch. Nothing super memorable, but it is fun."
    },
    {
      "rating": "10",
      "text": "Very fun movie if you weigh two hundred and twenty five pounds."
    },
    {
      "rating": "8",
      "text": "Since James Ellroy takes the screenwriting duties it's to no surprise that the script's structure takes a similar setup to L.A Confindental, which means that Street Kings is a very authentic triller with plenty of plot twists to keep you watching throughout putting a satisfied smile on your face at the end. The performances are mostly excellent with sharp dialogue that makes you feel the heat radiating from the conversations and fights. The only problem is Reeves, who brings in the same monotonous voice that we've heard before and thus seems to generate a lot of contrast with the other actors. He also looks as tough as a cardboard box. Still, this film is well worth watching."
    },
    {
      "rating": "10",
      "text": "This was a badass movie if training day was badass this one just blows it away. There is action, suspense, mystery at every corner. I was really enjoyed watching this movie and the cast was awesome, come on Keanu Reeves ( Neo the chosen one) was badass in his role. Chris Evans was really good too. So far this is the best movie in theater, it's a must watch!!!"
    },
    {
      "rating": "5",
      "text": "Initially, the story suggested an interesting plot which became somewhat difficult to follow, yet fell into the \"star overcomes all\" category. I actually dozed off several times and didn't miss a thing."
    },
    {
      "rating": "7",
      "text": "At the outset of \"Street Kings\", Detective Tom Ludlow (Keanu Reeves) walks into a Korean gang den and mows down the unarmed men in cold blood. His former partner, a black man, accuses him of being racist. Since the Asian nationals were harborers of sex trade children, Tom's actions are rationalized as being just. The film itself, not just the detective's colleagues, protects the morally ambiguous cop. If the dead Koreans didn't imprison two minors in their compound, the audience would turn on Detective Ludlow. The men he shoots unlawfully needed to be more evil than himself. It's the difference between being an anti-hero like \"Dirty Harry\"(Clint Eastwood as Bill Callahan) and a dirty cop (Denzel Washington in \"Training Day\"). But here's the rub. Tom is a dirty cop. But in the context of the LAPD, he's not half-bad. Again, this a result of the film's agenda to suture the law officer's nihilism. To the film's credit, the suture isn't complete the second time around. After a case of friendly fire in a grocery store, Tom goes to the wife of the victim. \"Street Kings\" doesn't allow Ludlow to be completely redeemed, but will the audience pick up on this?"
    },
    {
      "rating": "8",
      "text": "Entertaining enough, good twists and some intense moments...decent story about police corruption and street justice."
    },
    {
      "rating": "9",
      "text": "An entertaining thrill ride."
    },
    {
      "rating": "9",
      "text": "Great Ellroy adaptation. Vastly underrated, though bears some similarity to 1997's L.A. Confidential"
    },
    {
      "rating": "6",
      "text": "Well made but not very convincing. The film's style is very routine and the movie didn't really have anything new to offer. The acting is good, as well as the editing."
    },
    {
      "rating": "8",
      "text": "It's a decent cop drama with enough twists to keep it interesting. The movie has a cold brutality to it, watching Tom Ludlow (Reeves) being used as a instrument of death for the sake of corruption is interesting to watch.....especially as he slowly finds out the truth. Acting is decent all around and despite some cheesey dialogue here and there everything works out well. The shoot-outs are particular brutal and have a gritty realistic vibe to them, making it all the more intense. This film is definately worth a look.....one of the better \" cop / crime dramas\" to come around in a while."
    },
    {
      "rating": "8",
      "text": "Easily the best cop movie out in the last few years, gritty yet slick and stylish. Keanu Reeves suits the role well and is the best thing I've seen him in in ages. Could have done with being another 10-15 minutes longer but overall very enjoyable."
    },
    {
      "rating": "7",
      "text": "Not a terrible movie, but not a terribly good movie either. Forest Whitaker was awesome, as usual. Keanu Reeves was his usual self, not that that"
    },
    {
      "rating": "8",
      "text": "Pretty legit. Lots of twists and turns. Good acting. Highly entertaining stuff."
    },
    {
      "rating": "10",
      "text": "Great movie. The action is powerful."
    },
    {
      "rating": "10",
      "text": "A dark and gritty look at a rogue LAPD detective that is far more plausible than most give it credit for."
    },
    {
      "rating": "10",
      "text": "The movie hits a serious issue of corruption within the law enforcement. Whitaker and Reeves did a wonderful performance."
    },
    {
      "rating": "9",
      "text": "In my opinion, this is one of the best cop movies to come out in years. keanu reeves was the right guy to lead this flick and it was great to see Hugh Laurie take on another role, even if he did have several \"House-ish\" moments. even Chris Evans (who i didn't like in F4) was well placed. yeah there were some 'whatever' moments but overall, it was a good cop movie and i thoroughly enjoyed it. my last comment is that they took the graphic violence seriously but not too far and that was also very appealing, considering the tone of the movie. i'm hoping for an extended, unrated cut on DVD."
    },
    {
      "rating": "8",
      "text": "Saw this at the cinema. Very good. Better then I expected especially from Keanu. He was very good!"
    },
    {
      "rating": "10",
      "text": "great cop movie great plot and acting. the fighting scenes are well done and has some well placed plot twistes. street kings is one of the best movies of 2009"
    },
    {
      "rating": "4",
      "text": "Fairly muddled film for all sorts of reasons, full of plotholes and mediocre writing."
    },
    {
      "rating": "6",
      "text": "I agree that its an underrated film but critics but its not that good. Solid acting and Reeves is a good lead for the film. However the script is really all over the place and it never really hits as it should have, In fact its actually a bit confusing at times because you dont know where they are gonna go with it. Overall, It was a solid action flick but thats about it."
    },
    {
      "rating": "5",
      "text": "A great cast wasted on a tired story and inevitable twist. The film starts out pretty well, but soon descends into cliche and formula. Still, worse ways to kill a couple of hours."
    },
    {
      "rating": "7",
      "text": "This is a sort of Keanu Reeves' comeback flick. After The Matrix trilogy ended, he was in a number of unsatisfactory, mediocre works, such as \"Constantine\", \"The Lake House\" and \"Thumbsucker\". This role is rather strange to him, playing a down-on-his-luck detective, a loose cannon who lives from day to day. And considering that, he does a good job. Only problem is that, aside from Forrest Whitaker, there aren't any other equally capable actors here and some are quite annoying as well. Chris Evans, of The Fantastic Four fame, tries hard but fails as the serious and dedicated sidekick det. Diskant. Of other notable appearances there is the rapper The Game, who is at least authentic in his part.\r I was rather surprised by this film. I must say I didn't expect much from it, but it turned out to be a rather satisfactory film-noir thriller. Reeves might not look his part but he acts it. It is also flawed because of the way everyone is either good or bad, nobody is in between. Reeves' character at first seems to be in between but later turns out to be a typical hero. What else can I say? A little, pleasant surprise and a movie that probably salvaged Keanu's career, at least for the time being, after a string of misfired efforts."
    },
    {
      "rating": "9",
      "text": "'Street Kings' is certainly a cut above most other gritty cop dramas, hardly surprising since it was written by James Elroy, the master of the genre. If you haven't read 'American Tabloid', go out and get it. I'd say it's genre defining, it's that good. Like many like all the big Hollywood stars, Keanu almost always plays himself, which serves him well playing edgy, emotionally spent Detective Tom Ludlow. Forest Whitaker is absolutely brilliant, probably the best role he's had since 'Ghost Dog'. He's fantastic to watch in the riveting, final scene, I think there's great chemistry between Whitaker and Reeves. I loved the snappy, 'street jive' type dialogue, and much of the story is quite believable, if somewhat convoluted, but never contrived or boring. Like another reviewer said, I think it sort of comes together a bit quick at the end, I would've enjoyed another 20 mins to flesh the story out a bit more. Hey, I could watch this stuff all day, it's that good. Yet again, the critics are clueless, 'Street Kings' is a really entertaining film, highly recommended."
    },
    {
      "rating": "9",
      "text": "This movie is vary gritty, it's clearly a cop,crime drama, with some mystery, and action, this is one of Keanu Reeves best movies the supporting cast is great here too, loved Hugh Laurie and Forrest Whitaker, terry crews. the plot is vary deeply woven so you have to pay attention to the dialog and the story, some friends of mine had to watch the movie twice to get it, but I honestly liked the film it is vary well put together and executed."
    },
    {
      "rating": "5",
      "text": "This is a crime based drama film with a fair amount of action in it and it covers themes including undercover policing, racism and vigilantism. It is a gritty, urban film with an impressive cast (more on that later).I felt unsure of what was happening at the very start - its quite dark, lighting wise and there's a definite air of mystery and tension via the relatively quiet, foreboding incidental music played in the background as the main character investigates the building he finds himself in. I found myself wondering what he was going to find next and where things may lead to. I felt the film was relatively suspenseful, with some particular moments taking me by surprise and I could imagine some people may find themselves feeling a bit jumpy on ocassion, due to the sudden increase in tension clearly shown between multiple characters and how plot developments escalate. It was one of those films in which the viewer feels unsure quite when things may blow up, metaphorically, but we feel sure that something big will happen, its just a case of when and how.Cast wise, Keanu Reeves plays the main character, detective Tom Ludlow. I found it interesting to see him play in a non sci-fi or fantasy based film, having seen him mostly in such films over the last while, although its hardly entirely new ground he's breaking in being a steely, aggressive and rebellious type, somewhat like Neo in the Matrix films. Regardless, he gives a decent performance as a no-nonsense, headstrong cop. Equally, Forest Whitaker was on good form as Ludlow's boss, Captain Jack Wander - both being of a steely disposition. Surprisingly, Hugh Laurie appears, as Captain James Biggs, seeming remarkably reminiscent of his US TV show character Dr. House, in being thoughtful and quick-though-dry witted. Other cast members include Chris Evans (not the ginger haired one) as detective Paul Diskant and Naomie Harris as Linda Washington.Its a sobering watch at times, seeing how various members of the LAPD 'lock horns' (for want of a better term) when trying to get to the truth about things. I imagine that the LAPD aren't, by any means, perfect and the film covers some tough themes but I thought it seemed relatively realistic and plausible, from what little I know. I found myself feeling sorry for Tom at times, although being unsure of his motives in some respect and wondering what was going to happen in regards to the internal investigation that takes place. Content wise, the film contains sex references and partial nudity, plus moderate violence including gunfire and with blood based injuries clearly shown, as well as fist fights and other forms of violence. There is a heavy use of strong language and multiple drug references, plus of course the film is quite dark, tense and looming in tone, so it could be somewhat frightening for young viewers, or in general. The film carries a 15 rating to reflect this.The plot pace is fairly slow and plodding but the tense atmosphere makes it relatively intriguing and watchable regardless. There is definitely the feel of a cat and mouse film, with the twist being that its partly those within the police who may be against him.  While it is a decent enough watch overall, I also felt it was somewhat unoriginal, being similar in tone to other related films. Its not especially memorable but its not really awful either.Overall, yes I'd recommend it as I felt it did well at being quite tense and atmospheric, although it is rather bleak and dark in tone, so may be a bit depressing for some. It features a decent cast with decent performances and its relatively gritty and suspenseful throughout, so on that basis I'd recommend it."
    }
  ],
  "recommendations": [
    "a_walk_among_the_tombstones",
    "run_all_night",
    "wrath_of_man",
    "gangster_squad",
    "the_italian_job",
    "the_equalizer",
    "contraband",
    "den_of_thieves",
    "triple_9",
    "21_bridges",
    "the_equalizer_2",
    "blood_ties",
    "broken_city",
    "the_accountant",
    "the_bank_job",
    "16_blocks",
    "copshop",
    "seeking_justice",
    "jack_ryan_shadow_recruit",
    "the_commuter",
    "rocknrolla",
    "2_guns",
    "spenser_confidential",
    "sherlock_holmes_a_game_of_shadows",
    "shooter"
  ]
}