{"id": 1273, "title": "Stuart Little", "starring": ["Michael J. Fox", "Chazz Palminteri"], "runtime": 84, "genre": ["Family", "Fantasy", "Comedy", "Adventure"], "description": "The adventures of a heroic and debonair stalwart mouse named Stuart Little with human qualities, who faces some comic misadventures while searching for his lost bird friend and living with a human family as their child.", "releaseYear": "1999", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/niZSfupE9XR7GmEUq2XdURVH66T.jpg", "categories": {"plot": 7.444444444444445, "acting": 6.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 6.9, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Stuart Little is a movie that is made for kids, will be enjoyed by kids, and are for kids' eyes only. Parents will probably find in simple and boring, but might enjoy it anyway."}, {"rating": "6", "text": "Stuart Little is a family film , as with the consent of the plot, but the visual effects, and poor distribution given some results, but a bit boring , I do not take exception to anything about it."}, {"rating": "5", "text": "Fairly enjoyable family film with some nice acting though some aspects of the screenplay are problematic."}, {"rating": "7", "text": "\"Stuart Little\" is one of those rare cases of a \"children's film\" that still has enough charm and humor to appeal to adults. It's not a new classic, but it's funny, well-designed and has some good characters. A fun little romp for kids and adults alike."}, {"rating": "8", "text": "it is a good movie about micheal j fox as a lovely mouse named stuart little............................................................................"}, {"rating": "8", "text": "A fun and small adventure for kids that can enjoy a minute or two of Stuart Little's greatest family and adventures. It's practically seen like you've always seen it before, but never get tired of it."}, {"rating": "7", "text": "Stuart Little may have a simple plot, with not unforgettable enough characters and not thrilling enough story-telling, for make this a great film. Anyway, it shows true love, great friendship and a familiar message."}, {"rating": "7", "text": "Doctor House que te hicieron? Muy divertida con grandes personajes y dentro de todo una buena historia."}, {"rating": "8", "text": "Based on the book from same autor of Charlotte's web, a nice family drama about adoption. Digital characters are charming, without resorting to annoying or vulgar humor. A choice for kids during the home arrest and, know what was doing Hugh Laurie before House M.D"}, {"rating": "7", "text": "Nice Family FilmThis film based of the book is fun, good performances (particularly Fox), and a good blend of CGI and Live Action."}, {"rating": "10", "text": "A combination of seamless animatronics, puppeteering and computer generated effects make this a completely believable movie.You will be left wondering \"How did they do that?\"But once you stop being amazed at the wizardry involved in just making this movie there is a wonderful story behind it all.Stuart, who just happens to be a very charming white mouse, is adopted by a very special family -- the incomparable Gina Davis and the ever amazing Hugh Laurie.This is a story of acceptance, unconditional love and of a great deal of caring -- even though you may be a little \"different.\"This is a \"not to be missed\" film -- and adults will enjoy it as much as children do.In fact, the day that I saw it there was only one child in a nearly full theater; and I had the feeling that many of the adults there had seen it before.Don't pass up a chance to see one of the best written movies of the year."}, {"rating": "7", "text": "As a kid I never really liked Stuart Little. The animated show used to come on TV but for some reason I wasn't really fond of it. I think it had something to do with the fact that its animation is not really kid-friendly and it does not have the same sense of humour as Tom and Jerry or Looney tunes. It was only later that I got to know that this is a movie and the animated show was just an adaptation. My sister watch this movie as a kid, so we decided to to watch attack on watch it on Amazon Prime for the sake of nostalgia. It was quite fun to watch, but not something I would want to rewatch.Stuart Little is a story about the eponymous mouse who comes to live with his adopted family and how he slowly bonds with them over regular family issues. I personally think that Stuart Little is a very good example of teaching children how animals are also sentient beings like us. In spite of being a smaller creature Stuart proves that he is not of smaller value. This is exactly what makes this character so special. He does not give up on his dignity when someone talks down to him, which would happen either if he decides to turn violent or if he accepts what they are saying.Initially George was not very happy when he learnt that his family decided to adopt an animal instead of getting him a new sibling. Not just him, but their domestic house cat Snowbell was also very tensed about what other cats will say when they find out a mouse has become his master. And so he decides to get Stuart out of the house by hook or by crook. But in spite of all this Stuart continues to help them in need, like when he made George's boat for the boat racing competition and helping Snowbell escape from the cats.The cinematography of this movie is very good, but it is not suited for a children's movie. It has a very adult feeling to it, considering it has a hole some humour and not an outrageously humorous one. This is probably the reason why I didn't like the animated show, and now I can see where this problem came from. The visual tone and colour palette are such that this movie can only appeal to the audience of Harry Potter or Narnia, which is a very different target audience from what this movie aims to focus on.Although I liked the movie, I found to be very boring. It's not something I can watch after I grow up without dozing off. This is the reason why I have said that I will not watch it again. It seems a drag to watch this even when I have to show it to someone else. Plus this movie doesn't suit adults very much because of its child-like conflicts and happy ending. I haven't watched any sequels and I don't plan to. I hope there is nothing worthwhile in the sequel which I have to watch to understand something from this movie, not like this looks like that kind of a movie."}, {"rating": "0", "text": "Bad Movie. I HATE STUART LITTLE!!!!!!!!! The movie, which stars Stuart Little, is completely unrealistic. Why would any family in their right mind choose a MOUSE over a child?? The only explanation I have is for the tax break, which actually makes the parents pretty heartless. Which made me even more sad because I loved Hugh Laurie in House. Think of the poor kids who got passed over for adoption because of this rat. And he’s supposed to be the hero? Honestly, Stuart is heartless and cold and deserves no remorse. 0/10 would NOT watch again"}, {"rating": "5", "text": "stuart took priorities over the families actual child and he took the family of some poor orphan. they walked into that orphanage for a child not a rat. it is an orphanage not a pet store. may i remind you it was an orphan HUMAN CHILD they were looking for. i dont blame george for hating stuart at the beginning of the movie, i too would want to squeeze his lungs out like toothpaste. the movie itself was good though i just hate the character of stuart. the mother was hot. the cat, snowbell, was the best character she wanted to eat stuart and shoudlve when she had the chance"}, {"rating": "7", "text": "----------------------------------7.3/10-----------------------------------"}, {"rating": "3", "text": "Please let me kick the mouse. It's a very mediocre movie. It's not good or bad. It's Stewart Little."}], "recommendations": ["the_willoughbys", "the_boss_baby_christmas_bonus", "the_secret_life_of_pets", "alvin_and_the_chipmunks_the_road_chip", "enchanted", "coraline", "brother_bear", "ice_age_continental_drift", "nanny_mcphee", "the_star", "clifford_the_big_red_dog", "dora_and_the_lost_city_of_gold", "arthur_christmas", "meet_the_robinsons", "the_land_before_time", "rise_of_the_guardians", "hotel_transylvania_2", "my_little_pony_equestria_girls_forgotten_friendship", "stuart_little_2", "the_peanuts_movie", "christopher_robin", "bolt", "mars_needs_moms", "despicable_me", "astro_boy"]}