{
  "id": 3796,
  "title": "Suburbicon",
  "starring": [
    "Matt Damon",
    "Julianne Moore"
  ],
  "runtime": 105,
  "genre": [
    "Thriller",
    "Crime",
    "Drama",
    "Mystery"
  ],
  "description": "In the quiet family town of Suburbicon during the 1950s, the best and worst of humanity is hilariously reflected through the deeds of seemingly ordinary people. When a home invasion turns deadly, a picture-perfect family turns to blackmail, revenge and murder.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a3IHgSwO5jWPLcGjKqbQ7pxVGkq.jpg",
  "categories": {
    "plot": 4.558139534883721,
    "acting": 5.172413793103448,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 4.25,
    "familyFriendly": 3.0,
    "funny": 4.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The plot is too much of a weaker facsimile of Fargo. In the end the film ends up being OK, but it's probably forgettable, for a similar plotline you should probably just watch Fargo, and there's countless examples of films that explore similar themes to this one as well. You can tell why the Coen Brothers didn't want to do this themselves."
    },
    {
      "rating": "4",
      "text": "Now here's a prime example of a movie trailer spoiling its own movie. Every scene that might contain a tiny bit of comedy has been shoved into the trailer in a desperate attempt to try find an audience for Suburbicon. So if like me your curiosity gets the better of you not only will you be able to predict absolutely everything before it happens but you'll be able to do it all while not laughing.A home invasion and a murder in the lovely, tranquil town of Suburbicon. Starring Matt Damon doing his best to give an angry and slightly psychotic performance which ends up looking like he doesn't even want to be in the movie. Also starring Julianne Moore doing her super smiley unnerving performance, again and Oscar Isaac, who by a long shot is the best thing in Suburbicon. Such a short moment and he makes every second count. For a black comedy to work it needs to find the balance between humour and a dark story. Well Suburbicon sure found the darkness alright but it's so far away from funny as it can possibly get. Every time a character says their apparent funny line they almost pause after it as if waiting for you to laugh. Waiting for a laugh that never happens. It never once found the balance, instead you're left watching scene after scene where you know exactly how it will play out because you've already seen enough of it beforehand and provided you haven't fallen asleep you can figure out the rest for yourself.If Suburbicon had lost all the attempts at comedy and just restricted itself to a dark thriller we might have gotten a better movie. As a whole it does not piece itself together, the tone is all over the place so the end result is a mess that just leaves a bad taste in your mouth. Directed by George Clooney with a Coen Brothers script, sorry guys this one just doesn't work. Not recommended unless you really have nothing else to watch."
    },
    {
      "rating": "1",
      "text": "I can't imagine what possessed the studio to release this film at this time of tension in our country, other than to politicize the writers (Clooney & Cohen brothers) agenda - this movie is not helpful in any way shape or form!  Takes place in 50's suburbia, and though the story is really about a crazy white family the writers threw in terrible race issues of that time; shouting meetings, neighbors harassing the 1 colored family on the street, all without taking any time to develop any positiveness of the characters, so much could have been done there!  The beginning (1st 20 mins or so) was so boring I heard a man down the row ask his buddy if be brought a deck of cards so they could play!  Things do pick up & the story took a twist we didn't see coming.  Definitely had it's moments, though not nearly enough.  Damon was good, Moore was part just crazy & part Stepford, Noan Jupe who played Damons son Nicky was very good (expect to see him in the more movies) & Oscar Issac, who plays a sleazy insurance investigator, was also really good. Did not enjoy this film, there was so much that could have been done, but it was just kind of stupid & sad and we were very disappointed!  Major highlight of the movie was the cars - beautiful! - really the whole 50's era settings; cars, props, clothes, hair, etc. were done extremely well."
    },
    {
      "rating": "1",
      "text": "George Clooney has proved that a society can be symmetrical in many ways, but the righteousness of the Lodge family is just as phony as the ethics of the racists antagonizing the black family next door. The movie is \"hard to follow.\" My feelings about this film : \"Suburbiwhaaaat\"?"
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie. The negative reviews pointing towards the problems with the racism and lack of sensitivity towards today’s world are weird to me. It’s not like some of that stuff didn’t really happen and denial of today’s problems will not fix them."
    },
    {
      "rating": "2",
      "text": "The Coen Brothers and Clooney need to part company. Now. All of their collaborations with the exception of O Brother {which was still massively overrated} have been poor. To be fair, Clooney alone can't be blamed for this mess. The Coens' script is probably the  laziest writing their names have been attatched to to date."
    },
    {
      "rating": "0",
      "text": "Complete wast of time and money.  George Clooney's politics blasts through this disjointed fabrication of 1950s suburbia.  This is not the 1950 suburbia I lived through.   Whites are psycho racists, blacks are the oppressed normals.   I'll not be wasting anymore time or money on George Clooney associated projects."
    },
    {
      "rating": "2",
      "text": "Matt Damon and George Clooney work on another over hyped project. Suburbicon is another waste of Nine bucks. It looks beautiful and stylish. But that is the films only merits."
    },
    {
      "rating": "3",
      "text": "I should have listened to the users. Good cinematography that is all I can say. If you like pretty pictures and the story doesn't matter, then go see this movie. Matt Damon must have given up on good stories; The Great Wall (Kaboom), Jason Bourne (Kaboom), Suburbicon (Kaboom)... his politics or his paycheck must be all he is into now days."
    },
    {
      "rating": "2",
      "text": "“Suburbicon” is one of the funniest unintended comedies in a long time but not in a laughing way, more of an ‘OMG!’ Way! I have never seen Julianne Moore give a bad performance but here as a combination Stepford wife, throw in a little of Kim Novak from “Vertigo”  and Barbara Stanwyck in “Double Indemnity” and you feel this is a new actress who won’t be heard from again.The four screenwriters: Joel Coen, Ethan Coen, George Clooney and Grant Heslov each seem to have another genre from the other plus different movie homage’s, if they could be called that. In addition Clooney directed and among fight, murder and mayhem he throws in a physical joke that at least gets a laugh as wanted.The reason I went to see the movie was because of Matt Damon and Julianne Moore and having already talked about Moore I have to say that I hope his next film, “Downsizing” is a hit because after “The Great Wall” and this film Damon needs one. Matt Damon is Matt Damon here, Fred McMurray there, a little Jason Bourne and, why not?, some of good Will hunting.With a cast of strong supporting players “Suburbicon” doesn’t make a strong film considering the best storyline about a Black family being the first to move into a 1950s ‘lily white’ area is sort of neglected, especially the friendship between the young boys of the two families played by Noah Jupe and Tony Espinosa.Not bad enough to be on a ‘worst list of 2017’ it certainly isn’t good enough to be recommended."
    },
    {
      "rating": "0",
      "text": "Epic directorial fail. Good writing yes. Good acting yes. Good production yes. Really really bad directing choices yes. Clooney has one talent - making friends with talented people. He is not charming. He is below average acting. He is a bad director. And he supports guys like Roman Polanski who happens to be a child rapist. Clooney is a good example of what America hates about Hollywood. Go see a Miles Teller movie instead of this mess."
    },
    {
      "rating": "0",
      "text": "It's unfathomable this film was written by the Coen brothers. It's unfathomable that George Clooney directed this film (Okay, not really. He's never been that great.). It's unfathomable that Matt Damon, Julianne Moore, and Oscar Isaac signed up for this film. The white guilt, race divisions of the 50s theme is so formulaic that it's insulting to anyone who bought a ticket for this film. And what's worse, is that the social commentary is only a subplot with the non-existent characters, and the rest of the cast is completely one-dimensional themselves. The murder thriller thing is like a miscarriage of 'Fargo' and 'Mississippi Burning.' It's one of the worst films I've seen in a long, long time. If anyone reads this, save your money, and your time. You'll never get either back after watching 'Suburbicon.'"
    },
    {
      "rating": "6",
      "text": "It may be that I had a different understanding of Suburbicon but all I could think of while I was watchingn it and after having finished it is one word: Hypocrisy. Suburbicon is a slap in the face to the American establishment of suburban perfection which only exemplifies a lie. It's not that it's generalizing but in a way what we see on screen is a reflection of what is currently happening. The moral and social rot comes from oneself, not by races or different cultures, after all we see a couple of color in a white suburb and those who behave like animals are the whites who boast so much of their advanced mentality.But the strength of its message does not save the film and George Clooney delivers an empty film that even with the Cohen's script fails to be fully saved.I'm not saying that Suburbicon is a failure, but it is a disappointment, partly because it's was filme in a simplistic way, of all its cast the only person who seems to be putting a little more effort is Julianne Moore. Matt Damon looks uncomfortable during the whole movie and he creates one of the most forgettable roles of his entire career.Its rhythm is very slow and although you infer very soon what is happening, Suburbicon spends almost an hour to become a more interesting and fluid story, you're gotta need patience."
    },
    {
      "rating": "4",
      "text": "George Clooney attempts to go overboard of ideas without actually focusing on its core genre. This isn't the first time he has been in such failure though and this film is so far from becoming a true failure in any sign of form. I think, for a huge benefit, you should only watch just to see where I'm attempting to head off."
    },
    {
      "rating": "0",
      "text": "Incredibly bad.  Good cast, although I can't imagine why they accepted the roles -- they must have been desperate.  Nice period gas hogs(50's) --- I miss my '50 Ford Coupe and my'57 Chevy.  The rest is pure junk.  The Cohen brothers do it again.  And Clooney?  Too much of his cheap vodka perhaps....  Save your money and watch a prison reality show on late-night TV."
    },
    {
      "rating": "8",
      "text": "Some viewers seems to need to see a perfect path of cinematographic genre to maintain an equilibrium...! This movie is good. It isn't perfect, maybe, but it opens possibilities. Actors are amazingly interesting of course sometimes caricatural...but it is a Cohen,s brothers movie! What would you expect less? It is good for the brain to be disturbed in a good way. Bad people aren't who you expect."
    },
    {
      "rating": "8",
      "text": "The Cohen Brothers have crafted a prescient and complex film which serves as a scathing response to the 'make America great again' sentiment which has plagued the current political discourse in the US, as well as bringing their esoteric style to yet another commentary on  the nature of The American Dream. Moore and Damon are excellent, and the storyline begins slowly but from the second act, becomes utterly compelling, building tension to a nail biting conclusion. An entertaining and thought provoking film. 8.53/10"
    },
    {
      "rating": "3",
      "text": "Clooney's Drama written by Coen brothers seem to be a blend of awkward humor and bizzare emotions. With racial elements serving the main crook job story line, the drama feels unbalanced and counter-intuitive at certain points, leaving the audience thinking,\"are those people just stupid?\". Coen tries to pull off a good story potentially addressing the current political climate, but fails miserably to do so."
    },
    {
      "rating": "2",
      "text": "“Suburbicon” forces two incompatible plots together, culminating in an absolute mess of a film."
    },
    {
      "rating": "6",
      "text": "Despite a rather entertaining and fun third act, great set designs and visuals and great acting performances by the main cast, this satire on suburbs lifestyle still fell short. The story was a mess, the movie was predictable and most of the movie was quite boring. If you like good crime drama movies, I'd suggest you watching something else."
    },
    {
      "rating": "5",
      "text": "This movie might have a big potential, but somehow it tries too much to be bigger than it is with all the plot lines in it and it is pulled of quite boringly and you get bored fast watching it, even though the story seems like it might have been more entertaining."
    },
    {
      "rating": "3",
      "text": "Suburbicon at first seems excellent black satire over the American way of life 50-60 years. Here and giving of a plot is not bad, and cast. But all the rest is made just disgustingly. Situations are too not realistic, all emotions and feelings are built in the absolute. Perhaps such approach will be pleasant to someone, but after viewing of the movie nothing remains at the viewer. Any work of art has to bear sense. Unfortunately it not about Suburbicon."
    },
    {
      "rating": "5",
      "text": "It's easy to see why the Coen Brothers passed directing this onto someone else, they probably decided not to make this after deciding that the plot was too much of a weaker facsimile of their own vastly superior film 'Fargo' to merit exploring past the screenplay. George Clooney does a OK job of bringing the film to screen nonetheless, though the film is somewhat muddled by his own rewrites and attempts to add a second storyline, about racial tension. Some neat scenes, jokes and thematic expression does come across through now this second storyline now and again, but for the most part it feels like more of an intrusion than organic addition to the rest of the film, and it only serves to further muddy the rest of the plot.The acting is alright, the music is alright. There's a nice animated intro and the production design is gorgeous.In the end the film ends up being OK, but it's probably forgettable, for a similar plotline you should probably just watch Fargo, and there's countless examples of films that explore similar themes to this one as well. I guess if you really want to see 'Fargo, but this time it's about racism' this film is the film you've been waiting your life to see, buut otherwise it's merely fine."
    },
    {
      "rating": "6",
      "text": "Strong performances by Julianne Moore & Matt Damon saved this film from it's otherwise weak and not so creative plot. Not the first picture we've seen with this sort of story line, and I'm sure it won't be the last either!"
    },
    {
      "rating": "4",
      "text": "I went with high expectations. I knew that the reception for the latest George Clooney movie was mixed. But I went in and indeed I can understand the criticism behind it. what we've got was a movie filled with unlikable characters with no depth or redeeming qualities whatsoever. That it's why the movie fell flat and felt like a missed opportunity in all fronts. As a satire, as a dark comedy or as a political statement. The actors seem out of place with the material and the script seems like a B-Side from Fargo, with none of its charisma nor its relatable lead. The performances are bland, unconvincing and forgettable performances. Suburbicon at its core is a dark comedy. But I think for these troubled times that we're living politically becomes a bad joke, an unnecessary one as well, because the Racial Issues that the film tries to raise leads to nowhere, it's just convenient to the story. There's no relevance It's just a plot device, poorly executed and insulting to my knowledge. Sadly a disappointment."
    },
    {
      "rating": "4",
      "text": "its birth isn't luxury but a co-operative necessity..Suburbicon Suburbicon is a character driven drama about a family that faces an unfortunate event and the trauma that it goes through it later. The perspective is the queen of Clooney's chess board in here and he plays it well enough to keep the craft and crisp parallel among the storytelling. But this is the sort of crisp that makes you nod at best twice, not the cinematic level, it's not glorifying enough to claim its own cards; no matter what does that background score suggest. Also its repetitiveness shucks away the scared element out of it and leaves it the baffled and bourgeois attempts of, literally, failure. As mentioned, the background score is exhilarating and calming equally, the cinematography is impressive and so is its editing and camera work that helps give this feature all the boost it can; its a drop in the ocean, though. Damon's performance is appreciative, if not his best and so is the case of Moore which comes off more disappointing, unfortunately. The relationships that ought to create impact goes down the drain vigorously and the one that ought to make amends, shatters the expectations; it's a misconceived act. The structure of the script is undoubtedly fresh and doesn't follow any textbook logistics and so does its narrative, but as much as gripping it is, it is also off putting on its sadistic terms. The finiteness of the moot point it thrives on never had the potential to make it in the first place after which no matter how much effort Clooney, has to offer. The uniqueness of its bubble is questionable since its birth isn't luxury but a co-operative necessity. Suburbicon is what happens when a colony is left to run on merit of the basis of the foundation agendas, if to err is to human, then so is to evolve."
    },
    {
      "rating": "5",
      "text": "It felt like this started as an amazing project to work on, because it had a vision and great plot with a decent message. But it ended up not delivering on to many of these elements. The actors did a decent job, more or less but the kid was really good, plus Clooney knows how to direct his movies, which is always good, but that wasn't enough to save the movie from and average rating. The visual and sound effect look pretty good, and the sound plays a rather big role in immersing the viewer. The humor was a big fail, and the pacing of the movie is just downright awful, and it takes too much for the plot to really take off, it just breaks the immersion. The plot was delivered that it reflects on the problems of the 'great america' and people's stupidity but went really down the drain as the plot was only a shallow story. Overall it's an average movie, which could have been so much more better if executed in the right way, and gave the right conclusion and message at the end."
    },
    {
      "rating": "5",
      "text": "On paper, Suburbicon seems pretty unoriginal, if you want to see a masterpiece in this genre then see Fargo, if you want to see a mediocre halfway entertaining film, then Suburbicon is for you. This film isn't the worst movie in the world, it isn't nearly as bad as people make it out to be. There are some bright spots in this. Matt Damon is good with what he's given. Julianne Moore and Oscaar Isaac put on some fun performances as well. The main issue with this movie is the directing and writing from George Clooney. It seems like the Cohen Brothers gave him a half finished remixed script of Fargo and said have fun with it. Suburbicon tries to bring forth a subplot dealing with racism in the 50's that doesn't fit well at all in the story. It's incredibly disingenuous  and they don't pull it off subtly at all. The subplots misplacement is unbearably glaring that it's hard to believe that professional film makers didn't notice is worthlessness. My final thought on this film is that all these actions, this plot, this story leads to absolutely nothing. It's mindless entertainment. These characters have no motivations. We hardly know anything about them or why they do the things they do, and in a film like this, that's unforgivable. Brights spots and all, it's hard to get over all the flaws in this film, a disappointing watch and a let down on potential. 45/100"
    },
    {
      "rating": "4",
      "text": "A pesar de su estética bastante bonita, se hace larga y previsible por momentos."
    },
    {
      "rating": "8",
      "text": "(Español / English)TODOUna implacable demolición del sueño americanoExtracto:Suburbicon es un nuevo barrio de casas bajas y con jardín de finales de los años 50 en EE. UU. adonde cierta clase media urbana se ha mudado en busca de su promocionada tranquilidad y seguridad. Allí viven el pequeño Nicky Lodge (Noah Jupe, el notable actor de A Quiet Place y The Undoing) con sus padres Rose y Gardner (Julianne Moore y Matt Damon). Luego de que a la casa lindante con el fondo de la suya se mude una familia afroamericana, comienza una serie inesperada de incidentes familiares.Con este notable drama que se va deslizando hacia un thriller con toques de comedia negra, Geroge Clooney (con un guión coescrito con los hermanos Coen) procede a una implacable y por momentos bizarra demolición del sueño y de la familia americanos.………………………………………………………………Reseña:Suburbicon es un nuevo barrio de casas bajas y con jardín de finales de los años 50 en EE. UU. adonde cierta clase media urbana se ha mudado en busca de su promocionada tranquilidad y seguridad. Allí viven el pequeño Nicky Lodge (Noah Jupe, el notable actor de A Quiet Place y The Undoing) con sus padres Rose y Gardner (Julianne Moore y Matt Damon). Luego de que a la casa lindante con el fondo de la suya se mude una familia afroamericana, comienza una serie inesperada de incidentes familiares.Cuando en los títulos finales uno lee que los coguionistas de esta película de George Clooney son él y los hermanos Cohen uno dice “ah, ¡claro!”).Luego del prólogo con la mudanza de los nuevos vecinos negros, la película sorprende cambiando el eje y se centra en la familia Lodge y un incidente que sufre poco después, poniendo en movimiento un thriller típico de los Cohen, con personajes tomando malas decisiones, ramalazos de humor feroz, personajes despreciables y lo siniestro y la violencia apoderándose de todo.La película inicialmente recrea la estética y el tono del melodrama de los años 50 para luego enrarecer y oscurecer el relato, apoyada en la gran banda sonora “de época” de Alexander Desplat, las actuaciones, que dan con el tono justo y toques hitchcockianos y de comedia negra. Una suerte de contracara de Lejos del paraíso de Todd Haynes (reforzada por la presencia en ambas de Julianne Moore).Con este notable drama (cuyo título Suburbicon probablemente aluda al Necronomicon de Lovecraft), que se va deslizando hacia un thriller con toques de comedia negra, George Clooney procede a una implacable y por momentos bizarra demolición del sueño y de la familia americanos, transformándolos en una pesadilla.……………………………………………………………………….A relentless demolition of the American dreamAbstract:…………………………………………………………………Review:Suburbicon is a new, low-rise, garden neighborhood from the late 1950s in the US where a certain urban middle class has moved in search of its touted tranquility and security. Little Nicky Lodge (Noah Jupe, the notable actor from A Quiet Place and The Undoing) lives there with his parents Rose and Gardner (Julianne Moore and Matt Damon). After an African-American family moves into the house next to hers, an unexpected series of family incidents begins.When in the final titles one reads that the co-writers of this George Clooney film are him and the Cohen brothers, one says “ah, of course!”).After the prologue with the new black neighbors moving, the film focuses on the Lodge family and an incident they suffer shortly after, setting in motion a typical Cohen thriller, with characters making bad decisions, outbursts of humor fierce, despicable characters and the sinister and violence taking over everything.The film initially recreates the aesthetics and tone of the melodrama of the 50s and then darkens and darkens the story, supported by Alexander Desplat's great “vintage” soundtrack, the performances, which give the right tone and Hitchcockian touches. A sort of counterpart to Far from Paradise by Todd Haynes (reinforced by the presence in both of Julianne Moore).With this remarkable drama (whose title Suburbicon probably alludes to Lovecraft's Necronomicon), sliding into thriller with hints of black comedy, George Clooney proceeds to a relentless and at times bizarre demolition of the American dream and family, transforming them into a nightmare.………………………………………………………………………."
    }
  ],
  "recommendations": [
    "knives_out",
    "broken_city",
    "lucky_number_slevin",
    "logan_lucky",
    "the_gentlemen",
    "the_godfather_part_iii",
    "burnt",
    "inside_man",
    "reminiscence",
    "widows",
    "good_time",
    "the_gambler",
    "the_accountant",
    "the_social_network",
    "match_point",
    "hell_or_high_water",
    "the_big_short",
    "inherent_vice",
    "enola_holmes_2",
    "silver_linings_playbook",
    "morgan",
    "money_monster",
    "body_of_lies",
    "gone_girl",
    "the_departed"
  ]
}