{
  "id": 401,
  "title": "Sucker Punch",
  "starring": [
    "Emily Browning",
    "Abbie Cornish"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Fantasy",
    "Thriller"
  ],
  "description": "A young girl is institutionalized by her abusive stepfather. Retreating to an alternative reality as a coping strategy, she envisions a plan which will help her escape from the mental facility.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8oBc33JEnYm3rqPIwGtQXQbP96j.jpg",
  "categories": {
    "plot": 7.680851063829787,
    "acting": 7.620689655172414,
    "ending": 6.5,
    "soundtrack": 7.3076923076923075,
    "cinematography": 6.666666666666667,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 7.636363636363637
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Do yourself a favor and ignore the critics on this one. It's a flawed, but very fun and very awesome ride. It's probably the only case I can think of when saying that a movie reminds me of a video game is actually a complement. For sure, it's a \"check your brain at the door\" kind of flick, but I don't think they could have found more ways to pack what is obviously the nerdy dreams of Zack Snyder (and, by extension, every nerd) into one movie. It's all very silly, and Snyder needs to work on writing better dialogue, but it definitely exceeded my (somewhat tailored thanks to the critics) expectations."
    },
    {
      "rating": "10",
      "text": "Sucker Punch, this movie was the best movie of 2011 hands down. The way they used reality and dreams were brilliant. And all of the characters were, well KICK ASS. 5 woman taking control of their life and trying to escape from a place they will rot and die in. They are fighting for their last chance and it was amazing! All 5 of the actress were breathtaking, so was the Madame. It was dark but still had you cheering for the girls to get free. The battle scenes were excellent, so was the script. Now if you dont like this movie maybe you should go see \"Justin Beibers\" new movie, because this movie was deep some people wont be able to grasp its dark and excellent message. In the movie it says we have the weapons we need, now we have to survive and fight. And the entire movie was them surviving and fighting for what was right...their FREEDOM. It was worth my 10 dollars, matter of fact im going to see it again tonight. LOVED IT, and i dont compare it to other movies because it's its own movie and we magnificent!"
    },
    {
      "rating": "0",
      "text": "Wow, for a film with such promise, it was awful.  How much slow motion can you put into a film.  It was poorly written, acted, directed, and a waste of some otherwise potentially attractive and talented actresses.  It was like a series of music videos, none of which were very good.  Heaven forbid if the studios let this yahoo direct the Superman reboot., as it will be even worse than the Brian Singer reboot.  What will we end up with, Superman in a g-string fighting a giant slow motion Lex Luther, neither with any character depth or decent dialogue?"
    },
    {
      "rating": "4",
      "text": "I really enjoyed the beginning of this movie, and the music is great. Unfortunately, the action is boring and the plot really takes a downward turn later in the movie."
    },
    {
      "rating": "8",
      "text": "To be honest, if you go into this movie expecting some deep plot, or anything other than an action-centric movie, you'll be sorely disappointed.  What action/thriller is deep or has such plot nowadays?  Sucker Punch, for me, reminded me of a mash up of comics, anime, video games and femme fatale style heroics which, if you're a fan of, you'll enjoy.   The other mash up involved here that is interesting is how it jumps from the 40s style burlesque era to a strange, steampunk like world in the fantasies.  This is, in no way, a perfect movie, and I'm not about to try to convince anyone that it has the best acting, CG, stunts or anything.  What I did like was that the movie got me interested in the girls' dilemmas and even though there wasn't much background except on Baby Doll, Rocket and Sweet Pea, there was enough there to make me want to see them make it to the end.  The idea that this girl, Baby Doll transforms so drastically from a school girl to a heroine in her alternate reality is just... well... cool.   It's all silliness in the end but the fact is there is some great entertainment in this movie if you let go of the critic in you and just enjoy it for what it is.  An action thriller.   And a pretty good one too."
    },
    {
      "rating": "7",
      "text": "See this if you want to treat your eyes to a visual feast. If you want to treat your brain then forget it. After 300 and Watchmen I'm a big fan of Zack Snyder as I love his visual style. The problem here is the story and how crazy it is, its all over the place. A real mixed bag of a movie but for me and my tastes worth seeing. It won't be the same for everyone."
    },
    {
      "rating": "6",
      "text": "A pretty good movie, in my opinion. Visually very interesting and musically engaging! The steam punk looks dark and was very well done. The animations and effects were great! A mix of elements that I personally love it! Japan with its feudal warriors, orcs and dragons, robots, WWII ... I loved the references.  The music choice was perfect. I can not stop listening! And Emily Browning really can sing! I loved the version of Sweet Dreams at the beginning! However, the film also has several drawbacks... First, the performances, just say it were a little disappointing, the girls could have had more charisma. I didn't found so captivating. But surely, Carla Gugino and Oscar Isaac were great! The script is weak, could have been much better handled, but it seems that the focus of the film was in fact the action. It even tries to pass a moral interesting, but it seemed that only remembered it at the beginning and end of the movie. Everything is a bit exaggerated and even! And the fights seemed like real games! But I think it will its acceptance of the film. After all, it all goes through the mind of Babydoll, so anything can happen. Ultimately, I think it's worth seeing if you like the theme. There is not an excellent script, but an action is really nice to watch."
    },
    {
      "rating": "10",
      "text": "I couldn't help but think of a quote from Invader ZIM, of all things, after seeing this movie.    Zim: That's so... stupid. Why would you do that?    Hologram: Because it's *cool.*Then it all made sense. This is the movie equivalent of bear cavalry or chainsaw arms; incredibly stupid, but strangely awesome anyway. It just can't make up its mind on what it wants to do, and therefore falls flatter than hoped for on nearly all counts."
    },
    {
      "rating": "6",
      "text": "It was.....okay. There were more good things about it. I love the visual style just like in every Zack Snyder film out there, the dream sequences were kinda fun I had to admit, I liked the metaphor on what it's trying to say, the cover version of songs were sprisingly good, and the production value is spot on.\rHowever, not everything is great though. The acting was wooden, I found the characters to be one dimensional, the story itself isn't all that captivating, and it does feel like that it goes on to more style rather than substance.\r But overall, I thought it was okay."
    },
    {
      "rating": "6",
      "text": "Zack Snyder’s Sucker Punch is visually stunning & it is an elaborate escapist dream. I think a lot of people misunderstood the movie, so they hated it. But personally, I thought the film had a great concept but it was complicated and that caused many viewers to not be able to fully grasp the idea. I understood the direction, but of course it could’ve been executed better. Overall, I enjoyed this fantasy spectacle."
    },
    {
      "rating": "8",
      "text": "I was surprisingly hooked into the movie from its opening scene! The visuals, the music, the storyline are all strong and make the movie enjoyable. I was jarred at first by the way the main character would escape reality. It was unexpected and surreal. But it served its purpose and moved the story along. I feel majority of the women in the movie were strong and emotionally available and that too was engaging. The movie isn't perfect but I'm happy I chose to see it."
    },
    {
      "rating": "8",
      "text": "Fantastic popcorn movie. Obviously the critics these days are out of touch with what's considered \"fun\" in a movie. This is film is just that, fun. Don't come looking for realistic situations with realistic fighting sequences. The best I can describe this is live action anime. Was also very pleased that it didn't get too raunchy which in my opinion would have ruined the film. Highly enjoyable, will remember it."
    },
    {
      "rating": "9",
      "text": "Finally a movie worth seeing in the cinema's. Me and my friends enjoyed every bit of it. Although must say I can understand why not everybody is gonna feel the same way. These kind of movies are targeted at a very specific kind of audience. Since me and my friends are game-fanatics in our late twenties and see all the references to this culture we appreciate this kind of movies very much. But even if you don't and your just open minded enough you will enjoy this just as we did. You could compare this movie to one of the most famous story's in history. Alice in wonderland. In that, a lot doesn't make sense but the world she falls in is just amazingly and surprisingly fantastic. As it should be in any fantasy."
    },
    {
      "rating": "10",
      "text": "Sucker punch was dark but very creatively made. It had an amazing soundtrack mixed with the greatest special effects I have seen in a while. I do not understand why other people who review the movie is being very negative...yes the story can be tricky and confusing but all you have to do is pay attention witch is why some people don't like it..some people like watching movies that are basically served to them in there lap and that a two year old can figure out but the minute they have to stop and think they don't like it. Trust me watch it and you will enjoy especially if your a movie buff"
    },
    {
      "rating": "10",
      "text": "This is what happens when Japanese culture becomes overly popularised.  to sum this film up:The more back-flips a character can do, the less i should care about \"why\" they need to do the back-flips to begin with.   Also, katanas can cut through black holes, and kung-fu masters have magical powers. to have a movie, you must first have this pro ta go nist  thing.*sigh* its not a movie....... it's art....... there is a difference.  whether or not being \"art\" makes something less entertaining or not, that's up to you."
    },
    {
      "rating": "10",
      "text": "This movie was a truly fascinating view into how we all perceive the world... The problem is that how we see it and how things actually happen could be completely different than how reality appears. While this may seem far fetched to fathom, it shows it self as you crawl down the rabbit hole that is sucker punch. Think about inception..."
    },
    {
      "rating": "10",
      "text": "Sucker Punch is a movie about entertainment. The story isn't too bad if you are good at following stories, but that's not where it's meant to shine. It's sad to see that so many people leave negative reviews because they are looking for something that isn't supposed to be there. Look for what the movie is SUPPOSED to have: great action and eye-candy. Then you'll see the gold in this movie."
    },
    {
      "rating": "9",
      "text": "It's a fantastic movie, full of action, an incredible soundtrack that fits well with the film and a direction with a steady hand and unsurpassed in the action scenes. Visually superb. Recommended 100%. Hopefully this director do so pleasantly surprising."
    },
    {
      "rating": "8",
      "text": "Sucker Punch had fast pace action, good Plot, but at times was very confusing. The film was very emotional when it didn't need to be. Emily browning was pretty good in this film. Sucker was action packed but also very sad and dramatic."
    },
    {
      "rating": "10",
      "text": "This movie is quite a beautiful spectacle. Now sure, at most parts it seems to be target young men, but however there is just so much more under everything. The music especially made this movie perfect and the visuals are breath taking. Just let yourself fall into the movie. Pay attention and understand what is really going on, or at least pay attention to Snyder's movie that is far from a regurgitated Hollywood movie. Not a remake, sequel, or a reboot. A true genuine original work."
    },
    {
      "rating": "7",
      "text": "If you know what you're going to get, then you'll be happy. If you go in expecting The Bicycle Thieves, expect to be left wanting. The film is incredibly visually engaging, and the soundtrack goes well with the scenes.The fantasy sequences do get a bit repetitive at first, but your expectations are soon subverted. The storyline seems a bit weak, even if you take the time to understand it. But I'll still give it a 7 because I really enjoyed the movie, all told."
    },
    {
      "rating": "6",
      "text": "I was amused by the first 3/4s of this movie. I'm a fan of ultra violence so chicks kicking ass got into this movie. I found myself wondering if anyone will understand this movie because I was barely following it. The main fantasy fight scenes were pretty epic and the music was amazing. I wanted one last over the top fight but in the end I felt like I was the one who got the Sucker Punch."
    },
    {
      "rating": "9",
      "text": "First off, I love all the negative reviews of this movie. Critics (the public) are so quick to judge. This movie did what it promised. A trip through a dark reality depicted with a good taste of original style. Snyder knows how to create a powerful opening scene. The man uses slow motion. So what? he does it well. As for the acting? It was appropriate. It didn't need Oscar performances. And for the soundtrack? Very fitting, and very well chosen. This movie was not hard to grasp. I pity those who were confused. And if you're asking yourself \"where were the characters?\" They were stuck in between the realms of the different realities. Funny, that's where he wanted the audience to be. If you didn't become engaged with this movie then go back home and watch the Social Network..."
    },
    {
      "rating": "10",
      "text": "Sucker Punch is the perfect geek fantasy, action packed blockbuster made so far. its visual effects puts itself on a whole other level, and the music just fits in perfectly. the only thing that brings itself down is the storyline, its confusing and the story unfold as if it were a scab being ripped off. but the thing that sets itself apart from the good movies and the bad ones is the ending. Zack Snyder gave off strong emotions at its jaw dropping end to show the good in humanity."
    },
    {
      "rating": "8",
      "text": "I liked this film. I'm not sure that I understood it, but I did _like_ it. I walked out of the cinema satisfied that I had just watched a movie that entertained and has left me pondering various elements for the last day or so. I will definitely watch it again to see if I can make more sense of it.Unlike so much of what Hollywood is producing lately this was different. The storyline, the style, the action sequences, the anachronistic elements of the plot...it was all obviously and deliberately chosen to push boundaries and buttons. Which boundaries and which buttons appears to depend on what you bring with you...those who want to see misogyny will see it, those who want to see simple video-game action will see it, those who want to see nonsensical plot will see it. Those who go in with an open mind will probably come away with something more.  I can see where the critics have traction - the plot is convoluted, the costumes are sexy, the action sequences seem to be video game inspired, there are sexist/misogynistic elements.BUTThere is more. There are so many layers and explanations for those layers and many and varied. Are the imaginings of Babydoll actually happening? Are her 'team' various parts of her psyche? Is the whole thing her lobotmised \"reality\"?  My friends and I love action movies, but of late they have become so predictable or over-the-top that we often pass comments and have little discussions during the film...not this one. We were all glued to it, straining to analyse and understand, and thoroughly entertained.I"
    },
    {
      "rating": "8",
      "text": "I loved SUCKER PUNCH!Wrote an article defending it here:http://thescorecardreview.com/articles/he-said-she-said/2011/04/12/he-said-he-said-sucker-punch/19312"
    },
    {
      "rating": "9",
      "text": "You wouldn't stop eating your favorite candy just because a critic said it wasn't as good as their preferred candy, would you!? Sucker Punch is a very fun movie, with great visuals, a stunning cast, and amazing music! It's easily the best movie I've seen all year, Paul being the second best, and Battle LA the third. The only downfall is that it can be a bit confusing or hard to follow. If you liked Kill Bill, you'll love Sucker Punch, and if the promos turned you away, you'll be surprised to find how different it is! I strongly recommend this movie to any/everyone!"
    },
    {
      "rating": "8",
      "text": "I know I should be saying this is terrible; that it's an incoherent mess with lots of terrible acting and cod philosophy... I know I should say all of these things,but... damn I really enjoyed this film.  The bizarre worlds Snyder has created are just sooo beautiful, and the story caught me out.  I guess I'm a sucker for Sucker Punch. (plus, Abbie Cornish, omg)"
    },
    {
      "rating": "8",
      "text": "Wanna see 3 movies rolled into 1? This is it! This movie is not a pineapple pastry that you can easily sink your teeth into. You must have a very abstract, hyper-thoughtful, and eccentric type of mind to understand Zack Snyder's works. Lots of people complain about not being able to relate to the characters in this movie. But they fail to see that the director is not interested in telling them a good story here. He has a certain idea, and being a champion of the visual element, presents it in a manner that is both exhilarating and satisfying to all and sundry. This movie is a graphical extravaganza, meant to depict a thought from Snyder's mental depths. If you expect to be a part of the story, prepare to be disappointed. Consider it your misfortune if you are unable to enjoy this movie. You don't have the taste for it...yet."
    },
    {
      "rating": "6",
      "text": "Surprisingly awesome! I originally had no desire to see this film, but I'm glad I did. Stunning action sequences, beautiful cinematography, perfect soundtrack....Sucker Punch is the most fun I have had at the theater in a while.\r I loved the concept. The reality vs. action scenes were unique and kept me interested the whole time. The cinematography was absolutely stunning; it's definitely one of the best things about the film. The action/fighting scenes were unbelievable! The first major action sequence is as thrilling as the average movie climax. Just when you think the action can't get any more intense, the next scene arrives and delivers again. The thing I liked about the action was that none of the scenes were alike. So many films contain battle sequences that are basically identical, but Sucker Punch contains multiple scenes, all intense for different reasons.\r Overall, the acting is only okay, as I expected, but there were a few performances that really surprised me. Jena Malone gives a great great performance as Rocket. She steals every scene she's in...too bad she had very little substance to work with. Abbie Cornish also gives a good performance. In the beginning I wasn't impressed, but towards the second half of the film she really delivers. Oscar Isaac though gives the best performance as the villain, Blue.\r I completely disagree with the critics on this one, I'm not quite sure what they were looking for when they were watching this. This film is receiving a lot of criticism that it doesn't deserve. Personally, I found the film to be intriguing, intense, and completely original. I loved it! Check this film out, I recommend it to everyone."
    },
    {
      "rating": "9",
      "text": "There's a lot of negative reviews for this film claiming that there is little emotional depth, but from where I stand and as I understand it, this film is brilliant. It speaks to me on an emotional level that no film has done before. Maybe it's because I've experienced what happens in this film. I don't know. But it's beautiful."
    },
    {
      "rating": "10",
      "text": "I love this movie. It is my favourite. There are too much haters who don't understand the plot, especially \"professional\" critics. How can this movie just having a 3.3?"
    },
    {
      "rating": "10",
      "text": "First of all, consider the main characters schizophrenia before you say the movie \"sucks because you can't follow the story\" or \"don't get why you see the fantasy world when its not actually there\". Also, if you follow the story of her trying to escape both the asylum and herself, its REALLY good. The story is very deep, once you understand that the girls are shown that way to depict that they're abused and want freedom., and, once again, the main character is schizophrenic. The movie itself is very dark, and I don't recommend it for anyone under 15. Over all, very, very good movie."
    },
    {
      "rating": "10",
      "text": "I don't know why everyone is down on this movie. I think it will be a cult favorite. There is really nothing like it! Chill out and enjoy the visuals..."
    },
    {
      "rating": "10",
      "text": "Is not a movie for everyone, this is a fantasy film that reflects the suffering of a girl who feels abused mentally and fight inside to get out of her suffering ... From the references to the fight against trauma in Psychology and how the real world connects with fantasy create one of the best movies of all time by a misunderstood genius, Zack Snyder"
    },
    {
      "rating": "6",
      "text": "This isn't the terrible movie most people think. It's just not really excellent. What I like about it are the deeper elements of the story, how some things (most of the film) aren't as obvious as everyone expects them to be. It's not so easy to understand the first time, and it makes you think about it after it ends. This is very well handled; and it's very cool how people can come out with a lot of different theories about why everything happened the way it did and how none of them are wrong.\rSadly, there are other not so pleasant things that come along with the film, like the mediocre-good acting, the unnecessarily accelerated character development, some exaggerated scenes, the fact that in the action sequences our character can't die or at least we don't worry about it, and the sometimes dumb script.\rStill, it's a cool psychological action thriller that you are going to enjoy if you really try to understand it, and can make you think about it long after it's finished, as long as you allow it to do it."
    },
    {
      "rating": "9",
      "text": "This is one of my favorite films what can I say? However it has it's flaws (like many other films) but a really enjoyable film to watch.\r The soundtrack is ACE! and just the whole mood of the film is on point!"
    },
    {
      "rating": "8",
      "text": "Very good movie, good fun escapism,  the dream/dance sequences are well put together, exceptional sound track ( worth purchasing)   Its not about real life    You will be entertained"
    },
    {
      "rating": "9",
      "text": "Great movie.  Probably before its time.  It came out in an error were comic book movies were not expected to be intellectual.  So many movie goers did not expect to have to think.  Metaphors galore in the mind of a insane young girl that will be intellectually stimulating and visually amazing."
    },
    {
      "rating": "10",
      "text": "Perfect guy movie. Hot girls, hot action, and it kept me interested throughout the whole movie. The concept of the insane asylum, created a really good environment to be immersed in. I would say the movie is directed more to the male audience, but females will still enjoy this film. If you want the action from 300, from the mind twist/confusion from Inception, and mix it in with hot girls, than you will enjoy this movie."
    },
    {
      "rating": "2",
      "text": "Question: Is Zack Snyder's \"Sucker Punch\"(a) An exploitative epic in which young, submissive women are unable to kill a man but are able to erotically dance for his pleasure?(b) A feministic call-to-arms exploring the virtues of erotic capital in a world where all men are evil except the old ones with no sex drive who drive buses?(c) A comic-book nerd-fantasy of dragons, undead soldiers and hot girls in tight skirts?(d) A video game in which the audience is played like chumps for cash?(e) A dreadful overuse of budget, showing that something can be amazingly pretty but still completely boring?That's right. The answer is (f) A complete pile of steaming dog turd.M"
    },
    {
      "rating": "6",
      "text": "As director Zack Snyder's movie career progresses, I could see the aggrandizing hole between his powerful eye candy visuals and sparse story. \"Sucker Punch\" is his prime example. I'm not saying its bad, but if he continues on like this, its gonna get worse."
    },
    {
      "rating": "9",
      "text": "Impressive and intriguing. The action sequences are over the top, tongue in cheek refuges in audacity, gleefully playing on the most fundamental sense of awesome in an over-the-top manner. But largely, the meat of this film is a very self-aware critique of the very sort of movie it portrays, forcing an aware viewer to reconsider his perspective on the sexualized action flick. This movie, if you pay attention, should force you to question the basest desires of your taste without resorting to a heavy handed dismissal. Remember, when the action sequences start, WE, the audience, are those deplorable characters looking for a cheap thrill before we consider the personal story that Sweet Pea alludes to. We need to reconsider what this story is really about, and undermine our self-centeredness. You're not going to like this movie unless your willing to accept that sucker punch. Then again, if you don't see it coming, you probably should have."
    },
    {
      "rating": "9",
      "text": "Great movie. REALLY hard to write a review for it without spoiling everything. But anyway... do NOT be fooled. This is a serious movie and a thinking movie despite its first appearances. Yes the visual are awesome, the soundtrack is awesome, the hot girls are awesome, the steam-powered zombie nazis are awesome, the samurai warrior opening fight scene is awesome. The most important part about this film is it ends with something that you will want to talk about, argue about and discuss as it's actually quite a smart film that plays off both the reality of sexual abuse in 1950's mental asylums and what the mind can do to deal with such situations. However saying ANY MORE will reduce your enjoyment of this movie. Just don't go in expecting 300 with chicks. This has more in common with an episode off the Twilight Zone than 300 (aside's from Snyder's son) and because of this I thoroughly enjoyed it. However I'm very interested in what was left out and will be picking up the Director's Cut DVD (R-rated) release as soon as it comes out to clarify the 2 distinct endings that I am left contemplating."
    },
    {
      "rating": "6",
      "text": "Pure Fantasy, dark subject matter, great parts strung together forming a huge pile if you know what I mean! This director is fantastic though and he is learning what works on us and what doesn't, Im sure his next one will be a hit, I loved his 300."
    },
    {
      "rating": "10",
      "text": "This film represents the new storytelling genre that most critics cannot seem to embrace, they just do not get it. Go see this movie it is an action packed thrill ride with a heart of gold. It is a bit uneven in a few places but the CGI and the acting are well worth the slight hiccups. This is virtually the best written, acted and tech'd out film I have seen in 2011. I believe this is the \"chick-flick\" genre of the future. The Rom-Com is dead long live Baby-Doll, Sweet-Pea, Rocket and the rest!"
    },
    {
      "rating": "7",
      "text": "Great visuals, weird but fun industrial music,  and serviceable acting. The story is strange and will not resonate with most of its viewers but its a work of art, so if you can enjoy it as visual and auditory feast you will be able to enjoy it for what it is."
    },
    {
      "rating": "10",
      "text": "I very rarely write reviews as I see films as pure entertainment and what entertains one person may not always entertain another. But I had an urge to support this film by giving it a positive score, as I think it deserves it, even if it's seen as a meaningless piece of entertainment.I think a lot of people have missed the plot in more than one way. I think there are layers of symbolism that the critics have totally missed or do not understand and therefore simply see it as a rambling sequence of one action packed, effects showcase after another. The whole concept is an escape from reality, therefore to try and pigeon hole it in to some kind of reality, so it makes sense to you as a critic is simply going against the flow of the film and just not accepting it for what it is.Loved it and always will, it goes down in my list of all time favourites."
    },
    {
      "rating": "7",
      "text": "For anyone at all familiar with Zack Snyder's \"Sucker Punch\", I'm going to say something very obvious: This is not a film in the traditional sense. It is a visual feast, an exercise in directorial self-indulgence, a self-important tale of excess violence, sexuality, and intensity. Much has been said of the obvious flaws in \"Sucker Punch.\" However, in spite of all of that, it remains imaginative, original, and deserves to be seen and discussed.I absolutely believe that this is the sort of film that requires the viewer to go in with a realistic expectation of what you will experience. Not in terms of knowing the plot or details of the story, but understanding that they are not going to see a typical film, with a typical story arc and typical characters. The story has shades of \"Pan's Labyrinth\" and the style blends Snyder's previous films \"300\", \"Dawn of the Dead\" and \"Watchmen\" with Anime and many popular adventure video games. The action is elaborate and often stunning, but exists mainly as an excuse to use every flashy directing trick in the post-Matrix book. This idea could have gotten old very fast but having a different style of combat each time we descended into Baby Doll's imagination kept things fresh enough to not lose momentum. The soundtrack is made up of remixed well-known tunes (including Queen, the Beatles, and Jefferson Airplane) and a pounding score that honestly does a lot towards keeping things interesting and pouring as much intensity and atmosphere into the scene as possible. The actual story to \"Sucker Punch\" may seem like little more than a device to get us to each action piece, but there is more substance to this film than the vast majority of critics have been willing to admit. I will not claim the acting to be anything more than it is: serviceable. Other than two of the main characters, little back story is provided and the other characters are there merely to provide other eye candy or in the mens case, be evil and give us a reason to care about the fate of \"baby doll\", the bombshell cover girl. But I have read many reviews that paint the story as an \"incoherent plot\" and a \"jumbled mess.\" This is one of those times where I wonder if I watched a different film, or if the large majority of the viewing public lacks the basic intellect or attention span to \"get\" any film that doesn't follow traditional narrative structure. I don't say this to be arrogant or rude, I really don't. But I do have to say it because once again a film with complaints such as these thrown out from all directions ended up being quite easy to follow. The plot was certainly coherent and featured an arc that concluded the story and themes presented for the main characters. The device of the main action scenes were clearly in the imagination of the main character to get through traumatic experiences. I realize that following a story from the real world, to an imagination, and then an imagination from there requires some attention be paid, but it is not too much to ask when it is laid out for the viewer. This is why I will defend Sucker Punch from those reviews that claim it is all visual impact, with no emotion or visceral stimulation. The overarching theme may be ridiculous, silly, or incredulous, but that doesn't mean it isn't there. To dismiss all of this as simply violent soft-core porn on the basis on the misogynistic school-girl outfits and dark subject matter is doing a disservice to the creator as well as it's audience.I may seem over defensive in my praise for the merits of \"Sucker Punch\", but as I previously stated this is nowhere close to a perfect film. In fact, it's almost impossible to give a rating to because you first must establish what you are rating. Is it my enjoyment of the picture? I certainly enjoyed myself from beginning to end. Should I rate it on a critical scale in terms of how well-made it is? Even to someone that absolutely loathed the story, subject matter, and characters, it would be impossible to deny the craft behind the camera of Zack Snyder. It is a well-produced film with absolutely gorgeous cinematography and many memorable visuals. But the drawbacks are as clear as day. It is over-the-top to an absurd degree. It is overly self-indulgent. It features a lot of mediocre acting. It contains cringe-worthy dialog. It's not surprising that many find the overall theme to be ridiculous. That's not even getting into the supposedly \"girl-power\" message being undermined by its clear objectifying nature. But \"Sucker Punch\" is unwilling to limit itself to audience expectations, riding the imagination of its creator and giving us something different and daring. In my opinion, this something we could use more of in today's film landscape. Love it or absolutely detest it, but don't dismiss \"Sucker Punch\" as just a mindless action flick. It at least gives a valiant attempt to do more. 7.5/10"
    },
    {
      "rating": "8",
      "text": "I am unsure what people were expecting going into this movie.  About an hour before I went to see Sucker Punch I watched the preview which was my first introduction to the movie.  Sucker Punch delivered everything it promised in the preview, lots of stylish action catered to a fan-boy's sensibilities.  I especially enjoyed the soundtrack which fit with the movie really well.  Certainly not a masterpiece of writing or acting but it was pure fun to watch.  My biggest complaint would be that we didn't get enough character development considering it was an ensemble cast."
    }
  ]
}