{
  "id": 629,
  "title": "Suicide Squad",
  "starring": [
    "Will Smith",
    "Jared Leto"
  ],
  "runtime": 123,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xFw9RXKZDvevAGocgBK0zteto4U.jpg",
  "categories": {
    "plot": 3.15625,
    "acting": 3.892857142857143,
    "ending": 2.6,
    "soundtrack": 3.0,
    "cinematography": 0.0,
    "familyFriendly": 4.3,
    "funny": 2.142857142857143,
    "action": 2.6666666666666665
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I feel like people are rating this highly just to try to get revenge on reviewers. Unfortunately for them, the reviewers are right. This is a very poor film. Thin, predictable plot, uninteresting villain, equally uninteresting characters the majority of whom barely get any kind of backstory beyond a few lines, implausible plot even for comic book movie standards.\r I don't care about the money I lost but I'd love to have the time I spent watching this garbage back."
    },
    {
      "rating": "8",
      "text": "If I had to describe 'Man of Steel' and 'Batman v Superman' with one word only, it would be \"divisive.\" SUICIDE SQUAD falls into the same category. Even though I liked both MoS and BvS, one could say that those 2 films tried too hard to please critics. The admirable thing about SUICIDE SQUAD is that it disregards the critics altogether, and makes it an entirely fan experience, for better or worse depending on who you ask.\r The audience I saw it with was electrifying; it's, without a doubt, the most fun I've had all year since 'Deadpool' back in February. In my humble opinion, SUICIDE SQUAD is exactly what this lackluster summer movie season needed to spice things up.\r Director David Ayer has his mark all over this; it's unlike any superhero movie I've ever seen. Sure, you have some of your typical superhero tropes, mostly in the 3rd act. But then you have the antithesis of what the genre entails, breaking just about every single rule and convention. This ain't good versus bad; this, my friends, is bad versus evil.\r This movie is the living personification of its own characters: absolute, bat **** insanity! It's uneven, character motivations get a little wonky, and the story is a hot, sexy, mess. Word of advice? Double down on the comicbookiness of it all; it gets pretty weird. But within all the madness, I couldn't help myself guys... I kind of loved this movie. It's by no means perfect, but I also feel like critics are over exaggerating the film's faults.\r I was never bored, not once. The film moves at a killer pace. There's quite a bit of exposition near the beginning, but after that the film kicks into high gear. Steven Prince's score, which was reminiscent of 'Pacific Rim' and the first 'Iron Man,' infused such infectious energy into the movie. The use of hit song after hit song got a bit overwhelming however, making the movie feel more like a music video at times.\r Filmed mostly in my home of Toronto, this was quite the surreal experience; I have walked through those streets before, and I have stood in those subway stations before. I was even an extra in the film. Did I make the cut? Well, that's a whole other story... but I ain't mad.\r I was genuinely shocked by how incredible Will Smith was in the role of Deadshot. Going in, I thought he'd be adequate but not too memorable. I was wrong; he is the best thing this movie has going for it. Scratch that. He comes real close to taking that title, but it's Margot Robbie as Harley Quinn that this movie will be long remembered for. She nails it. Absolutely nails it. Robbie is to Harley Quinn what RDJ is to Tony Stark: perfection.\r Joel Kinnaman was another standout for me. While the writing for his character felt the most forced out of everyone, his actual performance sells it well and makes me feel for a character I could, otherwise, care less for.\r The film is juggling a lot of characters, and that's never an easy task. Characters such as Killer Croc, Katana, and Captain Boomerang (Jai Courtney was great?!) aren't given much backstory at all, but they were all given at least one great character moment: just one scene to make you fall in love with them. But if there's one obscure character that'll emerge as a fan favorite, it's definitely El Diablo. He's given an impactful backstory, an emotional character arc, and some kickass action sequences. In fact, most of the action in the film was executed  well. But there wasn't that one moment, like the 'warehouse scene' we got in BvS, that made me go \"holy ****\".\r if you ask me, Jared Leto had the toughest job of them all; he had to follow Heath Ledger's timeless performance as The Joker, which is an impossible feat. So, the best thing Leto could've done is something completely different; he should make it his own. Which is exactly what he did. Whenever he's on screen you can't help but be captivated by him. He's not in the movie all that much, but just enough to wet our appetites for this whole new incarnation of 'The Clown Prince of Crime,' while still honoring the name of the film. This is a Suicide Squad movie after all, not a Joker movie.\r It's ironic that in a movie about bad guys the worst part turned out to be the villain itself. The 'evil' in bad versus evil, if you will. I would've preferred a different antagonist altogether as the one we got here was pretty forgettable. Without giving any spoilers, the whole 'brother' angle was by far the worst thing in this movie. That's all I will say.\r People comparing this movie to last year's catastrophe 'Fantastic Four' need to drop whatever it is they're smoking. SUICIDE SQUAD has something that film didn't: personality. It has soul. There's a great deal of heart. The characters are dynamic. The team chemistry between all the actors was fantastic; even if you don't like the movie they're in, you'll still end up liking the Suicide Squad themselves."
    },
    {
      "rating": "9",
      "text": "I'm not long ago went to the film \"Suicide Squad\". This film is really fun and interesting plot. I would gladly went at it again. In my opinion this film is for people not even be familiar with a lot of Marvel and DC universe. Company DC to try very hard on this film. Margot Robbie, Jared Leto, Will Smith and all the other actors are fully accustomed to the role of his character. All the characters are very emotional. Also very cool movie soundtrack."
    },
    {
      "rating": "8",
      "text": "To get right to it, Suicide Squad is a blast! I had an incredibly fun time watching this film. That's not to say it was perfect. Far from it. There were moments that made me cringe. But the sheer entertainment that this film delivers is well worth seeing.\r Suicide Squad is not a complicated film. The story is very straight forward - it's not going to shock or surprise you at all. And the villain's portrayal and motivations are the weakest part of the film, unfortunately. However, as with most comic book movies, the focus is really on the \"heroes\". And the Squad delivers! Watching them interact was a delight. All of them have their moments to shine, though Deadshot and Harley grab the most screen time. And their performances were excellent.\r The Joker was a great addition to the film. I thought Jared Leto and David Ayer did an amazing job coming up with a fresh way to bring this character to the screen. My only real complaint with him is that he didn't have a big enough presence to really shine. If he ever gets the chance to take center stage and play the main villain in a DC movie, I think he would be perfectly horrifying.\r The film can be a bit skittish in places. It moves quickly through some sequences, and feels a little unfocused, but I believe this is intentional. I think the film is supposed to capture the unbalanced quality of its characters.\r Overall, I can't recommend this film highly enough. It was so funny, and such a thrill to watch. But go expecting some things to be a little too ridiculous."
    },
    {
      "rating": "4",
      "text": "Pros\r+Will Smith is great as Deadshot\r+Margot Robbie is excellent as Harley\r+Viola Davis holds the movie together\r+Different take on The Joker\r Cons\r-Characters are made too likeable (aren't they supposed to be BAD?)\r-Deadshot is the only fleshed out character\r-Awkward lines, jokes, and use of music\r-Sub-par acting by the majority of the cast\r-Tone jumps around all over place (either go serious/gritty or go funny and light... don't try to do both!)\r-The plot is extremely bare bones\r-Boring villain with boring henchmen"
    },
    {
      "rating": "8",
      "text": "This movie has a great idea and a decent plot that goes with it. As a normal comic book fan i've always perceived villains to be not so bad and liked to root for them from time to time, this movie takes that idea and goes all in, I didn't like the fact that as the movie goes on they just become plain heroes and not villains they actually are.\r Now for the actual movie it's enjoyable, there's not much to say, I don't care about the tiny details that they've might've got wrong because I simply didn't notice them, I enjoyed this movie as I thought I would, I don't know is it because I came in there with high expectations but I got what I wanted from this movie.\r Margot Robbie was fantastic as I expected, Will Smith was hilarious and kept the movie funny, The Joker was obviously **** I mean he just doesn't look like the Joker or act like the Joker we know, but he wasn't as bad, simply because it's another take on the Joker. Cara Delevingne should've definitely been a more valuable character looking at that she's one of my favorite actresses and she's hot as **** In fact most of the other villains were pretty much here and there for the entirety of the movie, but it's really nothing less then I expected."
    },
    {
      "rating": "7",
      "text": "Story plot is full of holes and some part of the movie felt too long. Good enjoyable movie overall. Margot Robbie and Will Smith make this movie really worth watching."
    },
    {
      "rating": "7",
      "text": "Another lesson for Warner Bros. When you hire some of the best talents in the business, stick to their instincts and don't second guess them.  What you have here is something that could have been one of the better superhero flick in recent memory, but bludgeoned to death by WB's intervention.  The soundtrack? One of the best. The performances? Exemplary. Kudos to Robbie, Leto and Smith for giving their best A game.  However, the higher ups got a bit jittery: it's too dark...it's not like the Marvel Cinematic Universe.  They  a second cut without the director's intervention, and both parties compromise.  The end result...starts of great, then jumped all over the place, with weird pacing and tonal inconsistencies.  Nevertheless, you can see that the creative team gave it their best...and despite all the rubble, Suicide Squad squeaks through..."
    },
    {
      "rating": "4",
      "text": "Suicide Squad tries too hard to entertain the average moviegoer (in this case, me), instead ending up with a messy, sloppy plot that doesn't make sense whatsoever. It's either your choice to go there and end generally confused or be a biased fan and like it. It won't change your opinion anyways. Just remember that Suicide Squad isn't the best DC can do to step back its feet right after the misleading Batman v Superman: Dawn of Justice."
    },
    {
      "rating": "3",
      "text": "Wow, that was bad. I mean I didn't expect something extraordinary but at least on par with stupid, but charismatic and fun Guardian of the Galaxy. Yet they somehow wasted all potential and create some mess.\r1. Characters supposed to be bad, ugly and interesting. But ones that actually somehow interesting are Deadshot, Harley and El Diablo. Others just kinda there, doing stuff. Japanese girl, Slipknot (haha, at least he had a story-wise purpose), marines, Croc, Boomerang (wtf? boomerang? seriously?) and even Joker could be easily removed from the movie.\r2. Bad guys are just... there. As you could imagine they bad, they ugly (and a bit sexy), they try to destroy world (for some reason) and produce zombie-like minions. Yep, that again. They even didn't forgot to add giant portal in the sky.\r3. Plot is clunky inconsistent and plain stupid. Most interesting part is actually introduction of the characters in first part of the movie, down from there it's just mess.\r I tried to enjoy this movie, I really did. But it's just not good, it's not fun, it's not smart, not ironic - it's average at best."
    },
    {
      "rating": "0",
      "text": "Day 1 and the DC fans are out in full force creating multiple accounts to spam 10s for a movie they probably haven't seen. Click on 95% of a '10' score and notice how the account only has ONE movie reviewed. You think they would at least remember their log ins to they can reuse them for BvS, Wonder Woman and all the future DC movies but I guess when your creating temp accounts all day that's too much work. Not even a week in and this movie has twice as many positive reviews than a movie like Furious 7, that was received well A YEAR AGO.  Keep struggling to get those user scores up, boys.\rAside from the poor pacing, bad editing, so-so acting and spotty story telling, let me give you some reasons why this movie has glaring issues that fans don't want to admit to.\rThis movie is a perfect example of writing the story to fit the scenes that are needed, besides writing the scenes that are needed for the story.  Here's just a couple examples?\rWe need to have Batman in this movie and show that Deadshot is a family man:  Batman attacks Deadshot and his daughter in an ally and then says he doesn't want to \"do this\" in front of his daughter.  Deadshot pulls a gun and aims it AT HIS DAUGHTER and Batman stands there with a little girl between him and a bullet.  A failure on all levels.\rWe need to show the pyro gang-banger is a changed man:  Have him stand in the middle of a fight and do nothing to show he's a pacifist.  Luckily no creatures attack him so he doesn't have to fight back.  Then the very next fight have some one provoke him into fighting.  Mission accomplished.. I guess.\rWe need to remind everyone that Katana is a good guy:  So she talks to her sword so Rick Flag can explain that the dead soul of her husband is in that sword.  Great.\rWe need to show The Joker is ruthless and unstable.  How about a club seen with Common not really hitting on Harley, but the Joker goes berzerk in an entire scene that makes no sense what-so-ever.  And why are the Joker and his thugs all gang-bangers?\rWe need to show that Amanda Waller is a back stabber and can't be trusted:  How about we have her kill her entire team of technicians for absolutely no reason. \"They didn't have the clearance for this\"  For what? Their jobs?  Huh?\rMy favorite:  We need to have a end credit scene with Batman leading into Justice League:  Have Bruce Wayne approach the coldest most ruthless woman in the world and ask for a list of meta humans.  She figures out he's Batman, of course.  Smooth move \"Greatest Detective.\"  Why didn't he just steal the information and remain anonymous?  Better yet, didn't he get this information already from Wonder Woman in BvS?\rMany character got 2 introductions and a special flashback just to bring on the 'feels\" but it all felt jarring and took us out of the action.  I didn't know a movie could have ADD.\rDue to all the exposition and origin stories needed the movie felt crowded and rushed.  That's the downside of rushing into the team up movies in a shared universe with all new characters.  They had 7+ characters to explain. Did they all need origins? Too bad there weren't previous movies to do that ahead of time. They tried something different than Marvel's slow and steady method and it's starting to show cracks in the DCEU foundation.\rAnd the biggest one: Why is a Suicide Squad even needed.  This is a world were we see the Flash and Batman exist IN THE SAME MOVIE! The world is being destroyed and these heroes do nothing about it?  And why would a handful of untrustworthy thugs with knives, boomerangs, bats and claws be better than some highly trained and well-armed soldiers?  They even had some soldiers in the Squad to keep them in check so why bother bringing the bad guys?  Because that story need to happen.\rWhy was the Squad being formed in the first place?  What was the mission?  By the time they are being selected, Enchantress goes rogue and they are used to stop her.  So why were they formed in the first place?  To fight a possible \"bad\" superman-like meta human?  What are a bunch of non-meta humans with guns, boomerangs and bats going to do against a real meta human?  The only Squaddies worth their weight were Deadshot and Diablo.  Why don't you ask any of the good guys in that list you gave Bruce Wayne, Amanda Waller?  Because this story needed to happen.\rNow let's talk about the worst Joker we've ever seen on screen.  This is a buff Joker with tats all over, \"Damaged\" written across his forehead and a metal grill in his mouth!  Really!?!  The Joker can't even speak or laugh menacingly due to all the metal in his mouth. DC fans are content with this?  It's like they have been starving so long for a DC cinematic universe they will devour anything that's put in front of them.  The opening weekend will be record breaking... the movies will break even... and WB will learn nothing from their mistakes."
    },
    {
      "rating": "0",
      "text": "Over-hyped, Hollywood needs to stop being so lazy in badly ripping off bad comics. It probably doesn't matter how badly this movie does in the box office, they'll all make money in the end and just produce some more terrible comic books."
    },
    {
      "rating": "0",
      "text": "Terrible! Don't watch it! Waste your money on building a fence around your house to lock movies like this one out. I don't even know where to start... a Joker that cares about money... cars and expensive rings? WTF...? Seriously?? Did the director even bother to read one comic?"
    },
    {
      "rating": "10",
      "text": "Really enjoyed this movie especially all the cast like Will Smith and Margot Robbie were best performance in whole movie there were some scenes are messy u didn't mind it all"
    },
    {
      "rating": "0",
      "text": "I've seen a lot of movies. I have seen a lot of good movies. I've seen a lot of bad movies. Suicide Squad is a bad movie. However, it is bad in a unique way. This is the first movie I've ever watched that made me feel genuine embarrassment. I wasn't even out in public. I was watching this at home, and this movie made me feel embarrassed for ever liking DC Comics.Where to begin? The pacing is atrocious. The film doesn't know how to start. The final cut feels like a dozen trailers edited together. The editing itself is awful. The soundtrack is insulting. The script is predictable. The dialogue is hollow. The visual effects feel dated. The action feels dull. The lighting is bland. The cinematography is uninspired. The character's motivations are whatever is convenient to the plot. The actors performances are truly awful. The film also cannot decide on what tone it wants to have.On top of this, the movie is mind-numbingly boring. I was watching this at home with some friends, and they fell asleep! We weren't even watching it late at all! Ugh. This might be the worst DC movie. I think the only people that like this movie are people that like to pleasure themselves to Harley Quinn. I know that statement is probably going to get this review a lot of downvotes from the Metacritic trolls, but I don't care. Bring it on!"
    },
    {
      "rating": "5",
      "text": "The first hour or so, which I call the music video part, is great.  It does a successful job of introducing the characters and contains many laughs.  When the actual plot of the movie is revealed, the movie completely falls apart.  We don't even get the name of a villain, and Jared Leto has quickly set himself up as the worst Joker of all time.  Will Smith is wholly unbelievable as the world's most dangerous assassin, as he's just playing Will Smith.  The film also concentrates way too much on Harley Quinn, who is supposed to be a tragic character, but is portrayed as eye-candy with way too many forced lines of dialog."
    },
    {
      "rating": "0",
      "text": "The script wasn't finished for this film. Its just a bunch of sequences played one after the other, trying to mimic the effect of a film. But in actual fact, this is not a film. Its a waste of time"
    },
    {
      "rating": "0",
      "text": "This movie was ah incoherent mess, with poor action, unfunny one liners and an incoherent plot. Margot Robbie was the only good thing."
    },
    {
      "rating": "1",
      "text": "This movie is a collection of short clips, it not appears to have a storyline, the plot is non existant, things are just thrown at the screen, you jump from one point to another with no explanation whatsoever, and when you should not need it, it is explained at fullest making very annoying and it took 2 hours of my life..."
    },
    {
      "rating": "2",
      "text": "The Joker is a joke and a mockery of Heath Ledger's genius. Deadshot is one of the saving graces of this movie, along with Harley Quinn, and as for the rest, they are as forgettable as the dumb plot. Why did DC even bother with this one? Let's pray they don't make a sequel and waste our time and money hoping that it will be any better, only to disappoint us. Buck up, DC!"
    },
    {
      "rating": "3",
      "text": "Suicide Squad was a very poor film to say the least. Will Smith's Deadshot, Margot Robbie's Harley Quinn, and Viola Davis' Amanda Waller were the lone bright spots. The other remaining characters, including the villain, were uninteresting. Jared Leto's Joker was completely forgettable. The plot was silly at best and outright stupid at worst. This movie was a dreadful experience."
    },
    {
      "rating": "3",
      "text": "Hot garbage. There's very little enjoyment to gain from this film. The characters sucked, the story was kinda non-sense and I have no idea what Jared Leto was trying to do as the Joker, normally I really like him both in film and music, but he was just BAD. The only good in Suicide Squad is Margot Robbie as Harley (perfect casting) and maybe Will Smith, kinda playing himself. That's it."
    },
    {
      "rating": "0",
      "text": "Amazing that there was a petition from a huge fanbase that enjoyed this \"movie\" to remove rotten tomatoes as a website, when it is simply a medium for critics and people to express their opinion, showing nothing but ignorance. The movie indeed sucks, it is an attrocious piece of garbage unfortunately. Still, if you wanna watch it go ahead, but that does not change the fact that it is trash. Had never seen such bad editing, although it is no suprise, they hired a trailer company to edit this movie. The script is ridiculous and inconsistent, and despite good casting, none of the actors involved had anything to work with. Jared Leto even let me down. No doubt he has proven he is a great actor, but he tried too hard in this one, and the joker simply became a joke, consistently generating unintentional laughs due to the ridiculousness of the script and the exaggerated acting from Leto. The plot does not even make sense, and Cara Delevingne as always has proven to all of us that she cannot act, not to mention the fact that her character was laughably awful. Try to not waste your money on this."
    },
    {
      "rating": "5",
      "text": "Well, all I can say is...the producers and gang tried. But, in the end, it was pretty formulaic and not enough grunge.\rThe Joker falls in love ?!\rAnd then there are the obligatory \"evil\" guys ( and gal ) who threaten to take over the world.\rGee, haven't ever heard that one before.\rOh well, not the worst, not the best."
    },
    {
      "rating": "0",
      "text": "I really wanted to like this movie, the misleading trailer was brilliant and Margot Robbie and Jared Leto looked amazing. But let me warn you now the trailer is a lie! This movie was not enjoyable and seemed to lack any coherent scenes instead blending into one hour and half long scene. Also plot holes, how did Viola Davis get away with killing those soldiers and she seemed to randomly materialise at the end of this movie. This has been talked about a lot but where was the Joker, he was in the movie for about five minutes. I suppose the soundtrack was fun though."
    },
    {
      "rating": "0",
      "text": "Never being a fan of DC cinematic universe, I can say after watching this  movie that I will  never hurt my eyes again. It was very misleading especially as the it had a great cast but I was left thoroughly disappointed. Not to mention the flashing lights and the confusing story line made it seem like there was no effort put into this big budget film. What happened? Only one positive I can think of was that the Joker was Jared Leto who had a brief cameo like  appearance."
    },
    {
      "rating": "0",
      "text": "this movie was the biggest disappointment of the year, there, i said it. The villain was total crap, it had huge plot holes, the jared leto joker was one of the worst adaptations of the joker i've ever seen and the whole movie felt like a huge mistake, the only thing i liked about this movie was the soundtrack, and i also liked two characters: Deadshot and Amanda Waller, but other than that i think that the movie was total crap."
    },
    {
      "rating": "3",
      "text": "Mes 3 points sont surtout pour Margot Robbie alias Harley Quinn qui incarne à merveille une nana déjantée, maquillée comme une voiture volée, frappadingue et très digne compagne du Joker... le Joker de Jack Nicholson, pas le pâlot ersatz qu'on a vu dans les itérations diverses de la galaxie DC et a fortiori ici dans ce Suicide Squad de pacotille, même si j'apprécie l'acteur Jared Leto par ailleurs.Bref, pas seulement une blonde bombasse affriolante mais aussi une personnalité vilainement attachante et sournoise. En fait, la seule personnalité de tout le lot, de cette pitoyable bande de \"12 salopards\", car le reste n'est qu'une triste bande de cons, de vilains dont on ne voudrait même pas à la fête foraine du coin.Le \"chef\" naturel est bien entendu le plus con d'entre eux, à savoir Will Smith qui joue les mi-durs mi-mous, fait le grand écart entre les vannes à deux balles et la guimauve de sa petite pisseuse. Ce glandu est insupportable de beauferie et de prétention et tire inéluctablement vers le bas ce qui ne volait déjà pas bien haut.Le scénario a été boulotté par des abrutis pas bien réveillés et seul le début, bien rythmé, arrive à faire illusion... ensuite, c'est à peine digne d'un téléfilm à la mords-moi-le-noeud avec psychologie à la petite semaine incluse. Il reste quelques scènes d'action plus ou moins correctes et de jolis effets badaboum mais la réalisation ne casse pas trois pattes à un canard : il faut croire que tout le pognon n'est pas forcément bien réparti...On ne s'ennuie pas trop mais on souffle beaucoup, on lève les yeux au plafond... surtout vers la fin qui n'a rien d\"épique : on serait davantage dans le grotesque, hélas même pas drôle au 3ème degré... c'est à se suicider de dépit. Heureusement qu'Harley est là sinon j'aurais taillé la route !"
    },
    {
      "rating": "1",
      "text": "Very Disappointing I am a comic book reader so when I saw the trailer for the movie I was exited but then I saw it.Pro: Margot Robbie and Will Smith. Cinematography is alright and  Amanda Waller is an Interesting character.Con: Everything else especially the editing."
    },
    {
      "rating": "2",
      "text": "ConsNothing happens the entire movieThe movie was edited by a trailer house10-second batman and flash cameoThe Joker is only there for 10 minutesThe characters lack any substanceThe only character with a real arc is barely in the movie.The soundtrack doesn't work well with the movie.Pros:Will SmithHarley is hot igthere was a kanye song"
    },
    {
      "rating": "3",
      "text": "An irritating mess of a movie, with a plot that makes no sense, dull and pointless characters, and countless things that made me cringe more than anything else."
    },
    {
      "rating": "3",
      "text": "Though the horrific editing was immediately evident, I'll admit this initially entertained me. This isn't that type of bad film. It's worse: it's the type of film which has flaws that endlessly niggle at you and wear you down until you despise it completely, overclouding any positive qualities. It's a shame, there's no reason it couldn't have been at least OK."
    },
    {
      "rating": "0",
      "text": "Where to begin with this mess. The only decent thing about this movie is Will Smith cause he acted perfectly but everything else is an abomination! The story is rushed, the movie on focuses on Harley Quinn and Deadshot, the movie is dark, the story also made no sense, Slipknot and Katana are useless, the acting is stupid, the Harley Quinn moments have more cringe then the word cringe itself, The Joker is barely in the movie, and the action moments are bad, and most of all the movie is pointless. Why is it pointless? Why can't they just get the heroes to defeat Echantress? Are the heroes on vacation and the villains are the only ones left? Overall this movie by far is the worst movie I've ever seen...okay maybe Foodfight is the worst but Suicide Squad makes me want to commit suicide."
    },
    {
      "rating": "0",
      "text": "I loved the comic, and this movie ended up being a huge disappointment. Maybe I had too high expectations? I barely forced myself to watch it for half an hour. Harley had... No personality. Joker was a gangster which is just... So not joker. Deadshot was good as far as I had seen. The plot was more shallow than that of an average chick flick. The movie seemed like an half-assed fanfiction an edgy tween wrote loosely based on the comic. I just don't get why they had to basically ignore the comic it was based on?"
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie. The trailer looked amazing and tricked me into believing the DCEU finally brought us a good film. Here's the thing, I didn't hate all of it. Margot Robbie as Harley Quinn? Amazing. Leto as the Joker? Ridiculously underused, but other than that pretty good. Viola Davis, is, well, Viola Davis, so she is obviously a big plus. However, the 'Suicide Squad' feels less like a squad and more like a group of angry children with no personalities (except for Harley Quinn, although she had a little bit too much personality sometimes). Every attempt at an emotional scene fails miserably, because the characters are not developed in any way. You know their names and what they can do, but that's about it. The action is so bad, it's laughable and the villain almost bores you to death. It is obvious the reshoots destroyed this film and the amazing marketing is the only thing that saved this mess from also failing at the box office. I won't give it an 'Emoji Movie'-bad rating, because I didn't fall asleep, laughed at some jokes and liked the visual of the film, mostly the costumes and make-up. But oh my god, I don't know if I can sit through this again. What. a. flop."
    },
    {
      "rating": "2",
      "text": "What a total flop this Suicide Squad, and how much potential wasted, how many expectations destroyed. A totally empty film, full of plot holes and above all silly characters. Will Smith probably believed he was still playing Chris Gardner of The Pursuit of Happyness given his melancholy attachment to his daughter, Margot Robbie succeeds in his intent (that is to make horny all the teens in the room) and Jared Leto, poor man, despite the efforts give us the worst Joker of this century and probably also of the next.I will not waste time describing the other characters, or the plot because they simply do not exist, just as there is no good reason to talk excessively well about this film."
    },
    {
      "rating": "2",
      "text": "Margo Robbie is awesome as Haley Quinn and the actor who played captain boomerang did a good job too but the rest suck this movie has bad CJI and bad writing"
    },
    {
      "rating": "0",
      "text": "\"Horrible directed s**t\" is the only phrase that i described about Suicide Squad when i first saw it, eventhough DC films have been quite good lately, namely Wonder Woman which i still quite enjoyed tho the third act was kind of flat, Aquaman and Shazam which i pretty much love, i thought Man of Steel and BvS are two of the most underrated comic book films of all time and Justice League is really underwhelming but i think SS really make them drop the balls. This movie is just pure cringe, the directing was just utterly trash, the cinematography too, it is literally too dark and murky. About the acting, Will Smith is Will Smith, Jai Courtney did a pretty good job thank god, Margot Robbie did her best in a horrible script, because her dialogues are so cringy and unfunny eventhough 80% of her screen time was aimed for comedic timing. And Jared Leto, look, i know this guy is talented, he is very good actor but everything he did here, NOOO."
    },
    {
      "rating": "0",
      "text": "There is absolutely nothing I liked about this movie. Nothing. And I had such high hopes."
    },
    {
      "rating": "2",
      "text": "I don't like to give lower than 3/10, but this film was the worst DC movie I've ever seen. They really looked like that they were actually going to suicide. I liked Will Smith, I liked Harley Quinn, and I hated all others. I didn't like Joker because he seemed like some cat, and all others were just trash. Even though Will Smith and Harley Quinn was good, the plot was simply a mess. I have no idea how this movie can get so many positive ratings."
    },
    {
      "rating": "3",
      "text": "Suicide Squad has good characters but are not given a good movie to be in. With the biggest problem being the first 30 minutes being a music video."
    },
    {
      "rating": "3",
      "text": "What a mess. Basically a mash up of random scenes. I found Deadshot and Harely to be relatable but Squad didn't work as a team and every other scene is edited like a music video that serves little purpose. if I want to see a trailer for a movie I can do that at home. I don't hate Leto as the Joker. I felt like he didn't get the chance to shine."
    },
    {
      "rating": "0",
      "text": "GARBAGE.This movie had to have been written by a teenager. David Ayer sucked it up royally.  So scattered and poorly done.  Terrible.  Awful.  Not even worth a redbox."
    },
    {
      "rating": "0",
      "text": "Terrible script, the story is confusing and boring, acting was bad from most of the cast,90% of the characters were bad devoloped. One of the worst comic book movie ever made."
    },
    {
      "rating": "2",
      "text": "La peor película de DC hasta la fecha, los fallos están presentes en la columna estructural de la película: historia y edición. Puede gustarte el elenco o los cambios argumentales sobre los personajes pero para ser un largometraje, de cualquier tipo, es atroz.Tras la muerte de Superman el Gobierno decide crear un equipo élite para futuros eventos sobrehumanos, la idea juntar a un grupo de villanos con habilidades especificas ya que los héroes se mantienen reticentes de cooperar con el Estado. Parece una plan interesante pero al final resulta que el equipo debe detener a un compañero de equipo que no pudo ser contenido.El principal problema es la edición, que causa enormes fallos argumentales, un personaje que se dice fue dañado por los recortes de escenas es el Joker, quien termina siendo un incomprendido o un odiado por los fans del archienemigo de Batman. Otro gran problema es la producción, a pesar de que los enemigos son muy genéricos uno quiere ver escenas de acción, pero la cámara está sacudiéndose, siempre a oscuras por lo que apenas se pueden apreciar los combates.Lo único que yo puedo destacar del film es a Batman, apenas aparece, pero tiene mucha presencia y lo poco que hace es satisfactorio.En general si no la viste aprovecha que no has perdido tu tiempo, sencillamente el resultado es mediocre para lo que uno espera, hoy en día hay muchas alternativas de películas de super héroes, y \"Suicide Squad\" es una opción que conviene pasar de largo."
    },
    {
      "rating": "3",
      "text": "Suicide Squad is a hodgepodge of ill-fated attempts to create a unique film that breaks the mold of the modern superhero movie formula. The writing is horrendous, several characters are brought in for no apparent reason (Katana and Killer Croc come to mind as both serve very little relevance to the plot), and the general plot of this movie has me questioning why I should care about it.While Smith and Robbie shine as making the most of their characters and delivering performances that have me excited for the future of their characters, the rest of the cast falls prey to poor writing and does little to try to make the most of it. In addition the third act of this film is a sequence of CGI fights that are immediately forgettable and nothing short of sheer disappointing.Following the criticism of Batman v Superman and Man of Steel for being \"too dark\", the producers of this film attempted to mimic Marvel's style of superhero film that is full of action and quips, but ultimately falls flat on its face. If any film in the DCEU is supposed to have a dark, grim tone, this is it, but reshoots and creative differences amongst the producers of this film create an inconsistent tone that makes it hard to follow.The soundtrack is random and rarely appropriate for the scene its matched with while the film feels like it is more about setting up the future of the DCEU (a future that is now just as muddy as the plot of this film) rather than telling a coherent story.Now to address the elephant in the room: the Joker. Jared Leto's Joker is far from the best representation of the Joker that we have seen on the screen and it might quite possibly be the worst. However I do believe that his iteration of the character is not complete trash as others would have you believe. Drawing from Golden Age source material (as opposed to Ledger's bronze/modern age interpretation), Leto's performance successfully portrays the \"gangster\" archetype of the Joker from that period. Nevertheless, this is not the correct version of the Joker and Leto does fail to deliver a praiseworthy performance.Suicide Squad is a mess. The DCEU is a mess. You're better off investing time in the MCU or rewatching the Dark Knight trilogy until the mess is cleaned up."
    },
    {
      "rating": "2",
      "text": "An absolute mess of a film. Terrible script, terrible acting, inconsistent tone, a completely out of place soundtrack which is just trying to gain brownie points for throwing popular songs so the viewer goes \"Oh hey! I like that song!\" so that they may associate the god-awful scene with the good song. It only makes the scenes worse as the tone is all over the place and the song doesn't even come close to fitting the scene. And by some sort of otherworldly intervention, this is an Oscar-winning film. We are truly in a dark age of cinema."
    },
    {
      "rating": "1",
      "text": "The movie tries to accomplish too many things at once. It tries to be both lighthearted, funny and at the same time serious, and emotional. It only comes off as a ridiculous collection of horrible cliches.The writing is bad, the directing is bad, and when these two things are bad - the actors, as good as they are, can't fix it. There is some pretty good acting - but their lines are horrible.The characters are so hollow and empty - at no point in the movie was I ever convinced, even for a minute, than any character was genuine. They all behaved shifting irregularly between overdoses of eccentricity, and overdoses of seriousness.The plot was mellow, to say the least.The ending was so bad, so cliched, I found myself grimacing, cringing, and actually fast-forwarding an overly-smeared moment of undeserved slow-motion.Nothing can fix bad writing combined with bad directing.I felt genuinely sad for the actors that agreed to take part in this ridiculous creation.I find it very sad, that managers in charge of such magnificent intellectual property characters can't find it in their minds to be original.I kept remembering how brilliant, deep, and incredibly convincing The Dark Knight movie was, and I believe a good writer, with a good director, and obviously all this needs a competent producer - could come up with a movie to blow the audience's minds and last for years and years. The Batman proved it possible.Suicide Squad feels like the production didn't even aim high, honestly - they knew people would pay money to see a high-budget super-villain movie, so nobody really cared if the movie itself was a complete disaster.And this is exactly what Suicide Squad is: an unimpressive disaster of the worst kind: the boring, cliched, daddy-jokes kind.No need to even begin to watch this - just go watch clips of the Joker & Harley on youtube - because those moments are as good as the movie gets. The rest is unnecessary garbage."
    },
    {
      "rating": "2",
      "text": "An absolutely terrible movie that could've been actually good but no, it has a non-sensical, illogical plot, terrible writing, terrible pacing, horrible editing (well, it's kind of expected as this was edited by a trailer studio), terrible cinematography, zero character development, bland performances, however we have a great performance of Will Smith as Will Smith. This is kind of an attempt of DC trying to have their own Guardians of the Galaxy (you know, a group of antiheroes united to defeat a bad guy), except it's not as funny, as well-written, it doesn't have a plot that makes sense and it doesn't have any style like Guardians did. Even if I don't make comparisons to GOTG, it's still an awful movie."
    },
    {
      "rating": "10",
      "text": "Way better than the 2021 version. Jared Leto as Joker was HIGHLY underrated. Would love to see an Ayer version."
    }
  ]
}