{
  "id": 4300,
  "title": "Summer of 84",
  "starring": [
    "Graham Verchere",
    "Judah Lewis"
  ],
  "runtime": 105,
  "genre": [
    "Thriller",
    "Mystery",
    "Drama",
    "Horror"
  ],
  "description": "After suspecting that their police officer neighbor is a serial killer, a group of teenage friends spend their summer spying on him and gathering evidence, but as they get closer to discovering the truth, things get dangerous",
  "releaseYear": "2018",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qPitgXPCIFh23yCEjqnCZnfhBig.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 2.75,
    "ending": 6.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 6.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The 80's are not Stranger Things despite the fact that many young people believe that nowadays. But no doubt the series worked a lot for people to regain attention in that decade, even the new adaptation of IT happens in the 80's not in the late 50's.This film definitely tries to get more attention and be in the popularity boom but unfortunately its story is one of the weakest mysteries I've seen in a long time and its construction of suspense is also quite weak. In addition, the narrative slowness it doesn't make it any favor.There's no doubt that it tries but it's far from achieving something interesting and more worthy of your time."
    },
    {
      "rating": "9",
      "text": "SUMMER OF 84 is a delightfully nostalgic, incredibly tense, and in the end, honestly brutal horror film. The story brings to mind Rear Window and Fright Night, but this old fashioned  spook-fest no doubt stands on it's own. Just think Stranger Things but replace supernatural with brutal true-crime and you get one of the best films of 2018."
    },
    {
      "rating": "8",
      "text": "This movie doesn't deserve the hate it gets. Does it have problems? Of course it does, I can only name one that may be a detriment to the average veiwer. But even then it leads into the best finale I've seen in a horror movie. Incredibly underrated, excellent soundtrack, great protagonists, and worth at least one or two watches.8/10"
    },
    {
      "rating": "6",
      "text": "I loved Turbo kId so was exciting for this Director's next film but it was a bit of a let down. Don't get me wrong, there are some positives, the main one being the incredible synthwave soundtrack, others being the funny dialogue (although a little generic) and the realistic 80's feel. But the film is just too 'safe.' It's completely predictable, the plot is very unoriginal and there are no real climactic scenes. Even the ending feels rushed and lack-lustre. I was reading that there would be some kind of blood bath and was thinking of the gore in Turbo kid, but this just doesn't happen. But everyone's a critic eh? I couldn't direct a film this good. Worth a watch but quite forgettable"
    },
    {
      "rating": "2",
      "text": "Summer of 84 suffers from a boring script and some of the worst dialogue i've heard in a film this year. It goes for that teenage boy sex talk but none of it lands, nor is it funny. I know these actors are kids, but the performance feel as if they're reading directly off the page of a book in English class. There's no chemistry with this children. \"IT\" had child actors that knocked it out of the park. These kids, not so much. Nothing about this film was inherently interesting until the last 30 minutes. What I had expected to turn out, turned out. The film introduces you to a mystery theory but lacks the skill of suspense to make it interesting, and it turns out like you think it would. Nothing in the story is introduced to throw you off or think differently, it offers zero mystery when it's supposed to be a mysterious film. Overall a terrible watch that mildly entertains in the last act.20/100"
    },
    {
      "rating": "7",
      "text": "Empieza muy boba, muy basica, aniñada, explotando mucho la nostalgia y la cultura pop de los 80s. Pero por el giro de la peli en la ultima media hora, es muy excelente, magnifico, shokeante. El final es de los mejores en este tio de pelis de \"Ventana indiscreta\". Al final esta bien que sea en los 80s pq funciona y es creíble, y dejan abierta una posible continuación como en IT."
    },
    {
      "rating": "0",
      "text": "Es una película extremadamente predecible, desde el principio te cuentan quien es el asesino y en lugar de jugar con eso para crear algún tipo de tension, en realidad la matan y solo continuas viendo esperando que pase algo interesante pero no. Horrible."
    },
    {
      "rating": "5",
      "text": "A very average and too long movie, it should have ended at 1.30 hour but nooooooooooooooo... let's make a movie in which when it seems to end there is still half an hour until the end. Pitty I cannot vote here with a 4'9/10."
    },
    {
      "rating": "6",
      "text": "Never finds a real reason to exist, and tonally it's a bit of a mess (is it comedy or horror, loving tribute or satire?) but it has charm, and the ending is audacious."
    },
    {
      "rating": "5",
      "text": "5.5/10 A cliche 80s worship thriller that never truly amounts to anything more than a VOD knockoff of other films we've seen. We're all very familiar with the recent 80s nostalgia trend/boom of the past few years and to me this film was just another attempt at banking in on that particular trend. It builds well at the start and the interest is there mostly because of the comradery between the friends which was genuine throughout the film and really the saving grace. However it starts meandering with a dull unexciting whodunit plot and when the payoff finally comes, its extremely anticlimactic. There is absolutely no mystery or suspense in this film which was a huge letdown considering thats what it was going for. Overall a decently shot film with some solid acting from the kids, but a very boring story that everyone has seen before. I will give it some credit for its visceral imagery that was unexpected, though it couldve been spread out better in more forboding fashion."
    },
    {
      "rating": "8",
      "text": "Not too much to say. The poster more or less says it all. It's a 80s as hell thriller, essentially it's Disturbia meets Goonies. It's popcorn friendly fun with some scares. Everything is as cliched as possible and yet, done right and with respect, making it enjoyable.Overall: This movie feels like it was made in the 80s and has all the charm 80s thrills and flare. Cheese,  but good cheese."
    },
    {
      "rating": "7",
      "text": "In a 1980s town where everyone leaves their kids alone for long stretches of time even though a child murderer is on the loose. Only the cast of Stranger Things can bring him to justice but first they need to use the plot of Rear Window to stop him. Overall not a bad film, though far from original, but I was entertained."
    }
  ],
  "recommendations": [
    "dark_skies",
    "happy_death_day_2u",
    "insidious_chapter_2",
    "ready_or_not",
    "hereditary",
    "final_destination",
    "the_boy",
    "malignant",
    "marrowbone",
    "signs",
    "chernobyl_diaries",
    "countdown",
    "a_quiet_place_part_ii",
    "the_mist",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "the_conjuring_the_devil_made_me_do_it",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "insidious_chapter_3",
    "the_lodge",
    "insidious",
    "shut_in",
    "shutter_island",
    "oculus",
    "house_at_the_end_of_the_street",
    "eli"
  ]
}