{
  "id": 4336,
  "title": "Sunshine",
  "starring": [
    "Cillian Murphy",
    "Rose Byrne"
  ],
  "runtime": 107,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "Fifty years into the future, the sun is dying, and Earth is threatened by arctic temperatures. A team of astronauts is sent to revive the Sun — but the mission fails. Seven years later, a new team is sent to finish the mission as mankind’s last hope.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x8umyFj5HPTFSdxBmuBuq9bpCgc.jpg",
  "categories": {
    "plot": 6.205128205128205,
    "acting": 6.695652173913044,
    "ending": 6.933333333333334,
    "soundtrack": 7.833333333333333,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "6",
      "text": "first half made it look like it was gonna be great but it trailed off to being unrealistic and implausible. its entertaining if there's nothing else on tv, but id never watch it a second time"
    },
    {
      "rating": "8",
      "text": "Incredibly tense, human thriller with it's share of eye-opening moments. Brilliantly acted, beautifully shot and with a killer soundtrack but let down slightly by it's B-movie twist in the final act."
    },
    {
      "rating": "6",
      "text": "Interesting movie along the lines of Alien for a claustrophobic feeling aboard a spaceship although without the uniqueness (or alien) reasonably well acted but unfortunately it descends into predictability about half way through and seems to run out of ideas."
    },
    {
      "rating": "10",
      "text": "Its outstanding the work it has been done here.Boyles creative mind to set us in a ficcional but real struggle of humans extinction is incredible.I love the  scenes of the planets, the stars, the worlds... the OST is pretty cool and do what it must.IÂ´ve watched like ten times and i love it every time"
    },
    {
      "rating": "8",
      "text": "Danny Boyle is a master of visuals, Sunshine is a sci-fi movie with some of the greatest visual shots contained. Despite the film being a thriller and horror of sorts, with the main theme here being the human fear of death. The film is quiet, it doesn't scream its presence and doesn't attempt to truly make you scared, in fact it is. An enjoyable and relaxing melodrama. It takes its time and puts you at ease with the inevitable death and destruction that will occur in the film. Every moment stopping to show you that despite being on a dark metal ship, the characters are in a beautiful place. There's a limit to what you can see, the sun, a spaceship and, space. Yet Boyle manages to create hundreds of magnificent shots that are fresh, incredible and breath-taking. But we can't just judge on the visuals. The cast are truly magnificent, Chris Evans, Mark Strong and Cillian Murphy being on top form. the acting works along with the visuals and creates this atmosphere of tension and relaxation at the same time, it's bizarre but, absolutely incredible."
    },
    {
      "rating": "7",
      "text": "Very intriguing film that for some reason has gone under the radar. The visuals a strong, it has a great atmosphere, the idea is fascinating and you really get involved in the events and story. It even has horror elements (although those seem to be the ones some people have issues with). Great sci-fi experience with good performances and thrilling moments. See it!"
    },
    {
      "rating": "10",
      "text": "Sunshine has a very intense atmosphere and the most unimaginable travel I've ever seen! The combination of beautiful pictures and a damn good soundtrack makes this movie for me unforgettable.\r The characters are good constructed in the first act and then they will even change during the movie. I have to admit this movie isn't for everyone: It has a deep philosophical aspect and little action. But I'm really happy there's finally again a movie, which doesn't have stereotypical heroes like in Armageddon!\r Many people complain about the third act, but I think it matches to the movie, because think about the problems, which ALL the characters had to solve! This movie gets better every time I rewatch it and everything (also the third act) gets clearer. I rarely experience this. Yes, it's not completely realistic, but it's a science-FICTION-movie, so it doesn't really bother me."
    },
    {
      "rating": "7",
      "text": "Boyle keeps his sci-fi-epic-turned-slasher remarkably contained, offering a glimpse at the socialogy of a space team on a suicide mission and excellent performances by Cillian Murphy and Chris Evans power it sunward."
    },
    {
      "rating": "5",
      "text": "Could have been good, if halfway through the movie it would not turn from science fiction to horror/supernatural. Started really good, the scenery was beautiful, the actors were good. The problems started when the \"Sun is god\" plot was introduced. They board the derelict ship that was sent to the Sun years ago, but failed to accomplish it's mission. It turns out that captain of the other ship is still alive and became some kind of burned monster and servant to Sun. The \"creature\" start to kill of the ships crew one-by-one, because Sun does not want the crew to restart it's rotation. Yeah this is where thing get rather silly and illogical. The movie from that point is nothing more than a cat and mouse chase movie between the \"burned Sun servant\" and the crew of the second ship. I did not like that when the \"Sun servant\"  I don't know how to call it) was shown the camera became shaky and blurred. It was rather distracting, like the director did not know how to approach this part of the movie. The ending end everything else from that point is rather predictable. Overall an average horror movie."
    },
    {
      "rating": "8",
      "text": "I liked almost everything about this movie - the characters are realistic, the conflicts among the crew are believable and interesting, the action and pace of the film is intense and engrossing, and the special effects look fantastic. I really have no idea why they decided to throw a supernatural \"monster\" in at the end, it definitely broke the spell for me. Fortunately there are enough positives in this movie to compensate for the one big negative."
    },
    {
      "rating": "5",
      "text": "All in all, it's not very good. The movie really doesn't present anything new to the genre and seems very recycled. Like most of the other reviewers, I felt the last half hour almost dragged the whole movie from an okay to a horrible. Much of the movie felt like it was filled with some pretty unnecessary events, but the whole last half hour was filled with them. The whole slasher part of the plot was ridiculous, even more so because he was only in it for about twenty minutes of the films hour forty-five. And, of course, it just has to end with a \"you have to release the bomb manually\" ending. The movie does have a pretty good soundtrack and admittedly stunning visuals. The shots of the sun and spacecraft really did look real. But all in all, there's nothing you're missing here that you couldn't watching in dozens of other sci-fi movies."
    },
    {
      "rating": "5",
      "text": "Good acting, good special effects, solid dialogue, good cinematography....... no character arc and bad story.\r Through the first and second acts I started to get the feeling that rather than a story, what I was watching was a string of technical mishaps which the characters need to get out of.  I didn't get the feeling that there was any character in the movie who was changing in any way or learning anything  but that I can live with.\r I can't live with a bad story.\r The third act is ridiculous with the addition of a character that makes no sense whatsoever and there was no setup for.\r If you are a big Sci Fi fan, who can live with flaws as long as you get some decent special effects and passable story, you'll probably be fine with this movie.\r If you are someone who is more particular about story without regard for genre you are going to be iffy on this one, trust me.\r Overall not bad but it ain't Boyle's best, that's for sure."
    },
    {
      "rating": "9",
      "text": "I got what I expected from Sunshine; a profound SF masterpiece that doesn't contain all those unnecessary dialogue and stupid characters. Though Danny Boyle was foolish to put a zombie into the movie, nevertheless its one of the year's best films."
    },
    {
      "rating": "8",
      "text": "Wonderful soundtrack and great visuals. The movie would be a lot worse if it wasn't for the soundtrack. Do not watch it expecting a hard SF movie or any scientific accuracy. It's all about the characters and the atmosphere."
    },
    {
      "rating": "10",
      "text": "Spoiler alert!\rReading reviews of Sunshine is a profoundly depressing experience, and reminds me that western culture is in its last death throes. Every single archetype, symbolism and cultural alliteration swushes as completely and utterly over the heads of reviewers  as a Star Trek spaceship, before they proceed to complain about narratives they don`t understand because of illiteracy and an ending they understand even less for the same reason.\rOn a first viewing, Sunshine is a visually impressive, if claustrophobic story of a group of scientists on their way to reignite the Sun with the largest nuclear bomb in NATO history. Nothing special there, and if this is all the movie remains for you, more impressive movies can certainly be found. But even on a first viewing it should be obvious that there is another story being told that reaches down into the very foundations of western cultural traditions. You`d think reviewers born and raised in the west might notice this therefore. No such luck!\rTo mention all the symbolism, religious and cultural references contained in Sunshine is not easy; indeed I may not even have noticed them all. But from the basic allegory of the Sun as truth/God/creating force present in the Greek, Egyptian, Roman and Christian traditions, many of them are so evident I squirm with embarrassment on behalf of those who fail to notice even any of it.\rThe first is the ship in which they travel, named Icarus after the Greek mythological figure who flew too close to the Sun so his wings fell off. As with everything else this is not a literal event being retold, but an allegory regarding the force of truth/God and the futility of trying to become God. If the entire movie is viewed as an allegory of the search for truth, you could easily see that most reviewers would need very powerful sunglasses indeed. If this is correct though, the gatekeeper of truth is the movie`s nemesis, Penbacker, who seeks to destroy the Icarus and prevent the crew from reigniting the Sun, by killing them all. Like a Syrian pillar hermit he has spent seven years close to God (the Sun) and presumes to have understood the futility of denying the death of God (truth), and aggressively seeks to prevent anyone from reigniting the Sun/remaking God/finding truth.\rThe actual bomb is triggered from a cross-shaped scaffolding. The cross was traditionally a symbol of the rebirth of God, even before Christianity. Around this cross is a square, representing order. Logically then, as the bomb goes off and God (The Sun) is reborn on the Cross,  the main character (Capo) transcends, is reborn as God and a new order begins.\rThis is why the ending to the movie is the way it is. Not to be weird but to tell an allegorical story about God/truth/rebirth. To the allegorical illiterates in this weird society this is all nonsense of course, and Sunshine is a bad movie because it`s not simple enough for them.\r I could obviously talk more about all this, and it would be nice if at least one conversation about Sunshine would. Some people detest allegory and wouldn`t recognize a cultural symbol if it jumped up and gave them a haircut, which is perfectly fine. But it might be helpful if the people criticizing this splendid movie understood what an allegory is at least. Personally I firmly believe that certain things can`t be properly communicated without them, as my puny attempts to verbalize them here should illustrate, and I feel that movies with allegorical depth are the only ones that ever become classics. Much the same can be said of literature. And if it`s allegorical depth you want you can`t find a better movie than Sunshine. I defiantly vote 10!"
    },
    {
      "rating": "2",
      "text": "A confusing, boring mess that relies for its drama on smart people doing very stupid things when they aren't being killed off by the screenwriter's bloodthirsty, contrived machinations. Good cast, wonderful score, junk masquerading as profundity for a screenplay. My advice is to re-watch \"Alien\": that's where Alex Garland borrowed about forty percent of his ideas for \"Sunshine.\" The only difference is, in \"Alien\" those ideas make sense."
    },
    {
      "rating": "10",
      "text": "An absolute masterpiece in cinematography; excellent scene transitions, intense and emotion-ridden soundtrack, and the sheer magnitude of their mission is enough to put chills down your spine. For instance the scene where Capa makes his jump from the Icarus II to the payload is one of the most powerful scenes I have seen in any movie. Absolutely fantastic and the best movie I have ever seen. Period. Oh and to all of you 2 and 1 star-ers, consider this; if this movie didn't have the thriller aspect of the third act you would probably be here whining and complaining about the movie being too boring."
    },
    {
      "rating": "0",
      "text": "The Worst Film ever~~~~~~ all bout the movie is total scrap... the craft are so plasticky, the storyline are so stupid, the dialogue are so lame... maybe for those \"clever\" who like bout NASA-things will like this film, but for common people who watch this will ends up with ????? or what the hell????"
    },
    {
      "rating": "1",
      "text": "Dear Mr. Boyle, Please let me know what medical application a spinning scalpel has now or in the future? This movie was a mess and a waste of my time and money. Boyle adds little or nothing to the \"space odyssey\" genre, instead taking the Rob Zombie route in appropriating or just ripping off other and better movies. 2001 (Alien, Solaris, etc.) comparisons are purely superficial, instead think Event Horizon meets Hellraiser 2 (complete with skin falling off of arm bite). The movie starts off shaky and just gets worse and worse every near disaster they run into. I gave it a 1 for the cool gold space suits alone, nothing else in Sunshine is worth the price of admission."
    },
    {
      "rating": "1",
      "text": "I don't get the good ratings given to this movie. Beautiful images, then the movie turns into a very stupid \"there is an evil force in the spaceship\" movie. Has any reviewer seen 2001: A space odyssey? Alien? Event Horizon? Solaris? Then, why the generaly good reviews? Maybe the critics left after five minutes, not seeing the stupid ending. I feel better now."
    },
    {
      "rating": "1",
      "text": "Pretty much garbage throughout, the science especially. The 3rd act confirms its stupidity."
    },
    {
      "rating": "1",
      "text": "Dreadful. Full of gaping plotholes, and utilising every sci-fi cliche in the book. Not silly enough to be fun, or sensible enough to be clever, the whole thing is deathly dull, and why is there suddenly a space slasher plot shoehorned in? Avoid."
    },
    {
      "rating": "7",
      "text": "Okay, first off, this movie won't be for everyone. Some people will find the ending far too ridiculous. Hell, many people will find the premise far too ridiculous. A lot of people will be turned off by the silly slasher element.All that aside it is a sci-fi movie that makes the most of what sci-fi has to offer: a vista of our solar system that will take your breath away and a claustrophobic environment that makes Alien look like a relaxing trip. Spectacular and truly memorable visuals. Shame that the film had so many holes."
    },
    {
      "rating": "6",
      "text": "Sunshine is 2/3rds of a great film. But that third act is such a ruinous mistake that it taints the entire experience.I mean, for the first two acts, Sunshine's basically a master class in how to create a brilliant scifi film. There's this loneliness and tension and a methodical, measured tone that really works to pull you into the film. It's obviously very referential of 2001, but without the mindnumbing pace and lack of characterization of Kubrick's film. It just fires on all cylinders in this beautifully conceived scifi environment. Plus, John Murphy's soundtrack is absolutely mesmerizing. \"Adagio in D Minor\" is a particular standout and his career achievement to date. Some of the events in the film do feel familiar, but that wasn't a bad thing. They felt like nice little tips of the hat to the giants of the genre. For example, the dilemma about running out of oxygen and having to kill a member of the crew to cut down on consumption felt like a very obvious callback to Tom Godwin's classic scifi short story \"The Cold Equations.\" You know, the one about a girl secretly stowing aboard a small spacecraft with one pilot that's delivering life-saving drugs to a colony. Unfortunately, there's only enough fuel for the weight of the pilot and the drugs aboard, and the girl's added weight means the ship is going to run out of fuel and crash on the planet, killing both of them. So the only solution is to jettison this poor girl out the airlock. It's a very similar situation in the film, but that didn't bother me at all. If you're going to take influences, might as well take them from the best.And then the third act twist occurs, and it all just goes right to hell. I dunno what Danny Boyle and his scriptwriter were thinking, but man, that uh... that last act and what happens was just such a course change, and an unneeded one for me, that it completely stopped the movie. You're just staring at the screen wondering why, why, why. Why would they drop the ball like this? The whole tone and tenor of the piece just veered off in this rather ridiculous and unbelievable direction. I felt cheated, to be honest. It didn't make sense and didn't seem to be what the first two acts had been about.  The twist is that the captain of the first Icarus is alive and he's basically a monster out of a slasher film. He's somehow been living on the other ship getting a suntan for all these years and now he's on the Icarus 2 murdering people and possessing superhuman strength even though he's covered all over with horrible burns. Also, he appears as this blurry, vibrating, fluctuating mess on camera which makes no sense. I guess Danny Boyle wanted it to create some sort of effect or to suggest that perhaps he's just a hallucination, but it just looked irritating to my eyes. Of course, you've gotta wonder how he even became Captain of the Icarus, you'd think NASA or whoever would check for mental instability when picking the crew for THE MOST IMPORTANT MANNED SPACE MISSION OF ALL TIME.It's tough, because you really want to recommend this somewhat unknown scifi film to friends (it only made around 3 million at the box office IIRC) but that last act is a blunder that just sinks the whole thing. Can I really recommend 2/3rds of a film to someone? That's what I'd like to do."
    },
    {
      "rating": "9",
      "text": "This is one of my favourite sci-fi films, though it can be hard to re-watch it after you know the story.  It is a great example of a quiet and thoughtful science fiction film, moved by characters and some really solid acting.  And in all honesty, I did NOT want to see it due to the initial premise.  The sun going out, you say?  Rubbish, I say.  But once I sat down and actually watched it, I really really enjoyed it.  I guess it's one of those sci-fi films where you have to just agree to not worry too much about the actual science.  Just accept the initial premise and go from there.  Incredibly heart-wrenching at times, this is a great film."
    },
    {
      "rating": "8",
      "text": "You'll be hard-pressed to recall a science-fiction film with better characterizations and casting than \"Sunshine\". Story-wise, this \"Alien\"-like homage is nothing to write home about, but the presence of Cillian Murphy(who shows more passion for a male crewmate than towards...), Rose Byrne(who seems on the verge of making a sexual advance towards Capa(Murphy) before the ship's alarm creates a orientational impasse), and Michelle Yeoh(who gets to play vulnerable instead of exhibiting steely resolve for a change, she gets weepy over a plant) makes the professional interactions of this Benneton space-nation more interesting than their actual mission, which enables this film to be thought of fondly as the thinking man's \"Armageddeon\". The filmmaker could've done a better job at setting up the film's pivotal suspenseful moment. This filmmaker isn't trying to make a cerebral film like \"2001: A Space Odyessy, so it's incompetence, not transcendence that's achieved when the ship's menace is made relevant. There's no build-up. Still, the integrated cast is well-chosen and more importantly, organic. There isn't the whiff of tokenism you get from the \"Harry Potter\" films."
    },
    {
      "rating": "10",
      "text": "Amazing movie from start to finish. Most people missed this masterpiece, I'm telling everyone I know."
    },
    {
      "rating": "10",
      "text": "This movie is just an amazing, very compelling and highly underrated Triumph! It has everything what a great movie needs. It is, exciting, thrilling, moving, visually outstanding, it plays with symbolism, asks and explores philosophical and moral questions in a profound way and and and the work and effort they have put in that movie is remarkable. A Masterpiece to me! ... Can't believe how little it made in the box office ..."
    },
    {
      "rating": "10",
      "text": "wonderful!!! i absolutely loved it! acting - WOW! story -  WOW! soundtrack - double WOW! i just can't believe that so few people saw it. i recomed to everybody to see this wonderful picture..... really well done"
    },
    {
      "rating": "9",
      "text": "Feels like \"2001,\" except '2001\" bored me to tears and this movie rocked."
    },
    {
      "rating": "5",
      "text": "This movie is a sketch - an outline - of great science fiction. It should be shown in film study class as a survey of themes from other SF - Silent Running, 2001/2010, Alien/Aliens, Outland. I could barely call it an homage since it doesn't dwell on any one theme or movie very long. It almost felt like it wanted to be an entire series - like Firefly - but that would only reveal how thin the characters really are. Ultimately I found the movie interesting but not satisfying."
    },
    {
      "rating": "5",
      "text": "Typical outing for this kind of Scifi that imitates that which has gone before it so its really nothing original. I found it hard to follow and a plot with a lot of holes in it."
    },
    {
      "rating": "0",
      "text": "It is the boringest, dullest film since The Core, a similar related idea of science fiction film. I never found it appealing nor engaging once."
    },
    {
      "rating": "2",
      "text": "Event horizon, but not as good."
    },
    {
      "rating": "1",
      "text": "Very, very crappy movie. Complete nonsense."
    },
    {
      "rating": "4",
      "text": "I liked it, until the horror part came and I actually didn't feel leek bothering to watch the end. I turned it off. So I'd like to reply to Sam, who asked: \"How would you have ended it?\" My answer would be this: I'd prefer it without an end, over what they decided upon. Anything, but that. Let them succeed, fail, no matter, but keep that sense of intelligence intact, whether it lives or dies."
    },
    {
      "rating": "0",
      "text": "You have got to be kidding! I can't believe this movie got such high scores! It is one of the worst sci-fi movies I've ever seen... a total jumble... little character development, and an implausible, incomprehensible story line. The sound quality was so poor I had a hard time hearing a lot of the dialogue Maybe if I saw it in a theater instead of on DVD it would be some better, but I doubt it."
    },
    {
      "rating": "9",
      "text": "Reading other comments made me think that this would be a run of the mill the earth is screwed type of science fiction movie. I was wrong. There were of course some cliches that dragged the movie down but the stunning visual effects made me ignore that. This isn't a movie for someone who likes to sit dumbfaced in front of a screen and let's things be completely explained to them, it's more of a think-a-long movie. You do have to forgive the movie some of its tendencies to stray into the abstract but without those strays, it wouldn't be as special and meaningful. Overall this is a wonderful experience that deserves to be enjoyed."
    },
    {
      "rating": "4",
      "text": "Parts of it were watchable, but I couldn't get past the many absurdities in this movie. Anyone with the most rudimentary understanding of science will need to put that aside for the duration of this film. Alas the scientific absurdities are only the start of the problem."
    },
    {
      "rating": "0",
      "text": "The San Francisco Chronicle, namely Mick LaSalle, was correct. Pure cinematic dreck."
    },
    {
      "rating": "4",
      "text": "A confused collection of SciFi effects. I couldn't really get it."
    },
    {
      "rating": "3",
      "text": "Great production value, terrible science. I couldn't suspend disbelief."
    },
    {
      "rating": "8",
      "text": "Danny Boyle's Sunshine delivers on so many levels. Though it's about a team of astronauts and scientists trying to restart the sun, it's not really a sci-fi, not in essence. You've got the interstellar location and advanced technology of such a genre, but Sunshine has far more in common with old seafaring adventure pictures (the highly claustrophobic surroundings and steadily building conflicts between the crew could have been lifted directly out of The Bounty). There's also a decent helping of psychological horror, which fits in nicely with the cramped, eerie locations of the film and the high stakes that are involved. At its heart, Sunshine addresses the very darkest elements of human nature - our quest for knowledge and our need to survive. The fact that Boyle can discuss such deep and complex issues in an engaging and accessible way is a true testament to him as a filmmaker. Alex Garland's writing is strong, Boyle's storytelling fluid, the effects rather beautiful and the actor's performances (particularly Cillian Murphy and Rose Byrne) solid. Where Sunshine falls slightly short is in its finale - while still decent enough in filmmaking terms, it loses a little focus and seems a bit too preoccupied with tying everything up quickly and neatly, when a more open ended and ambiguous ending might have been more powerful. Even so, you're unlikely to see another such thought-provoking sci-fi any time soon."
    },
    {
      "rating": "10",
      "text": "A very dramatic sci-fi thriller that leads to a very planned out plot and an exciting setting. I think the performances in this film were a little So and So."
    },
    {
      "rating": "8",
      "text": "Good special effects. Good characters. Nice plot. But the end of the movie is bizarre. It's not a masterpiece, but anyway it is a good science-fiction movie. Possibly better than average."
    },
    {
      "rating": "10",
      "text": "Arguably the best sci movie of the last 20 years. If you cant handle that at the end of the movie the hero activates the payload inside the sun, its not for you. Partly horror, it still puts good movies like Armageddon, Deep impact and Event Horizon in another league."
    },
    {
      "rating": "10",
      "text": "Britain's best director Danny Boyle is back and this time with a interstellar epic. Dr Robert Capa is aboard the ship Icarus II along with several crew members sent to deliver a payload of universal proportions to the dying Sun, this payload will hopefully re-ignite it and save the human race from a new Ice Age and inevitable extinction. However they soon realise how the Icarus I's mission to do the same job failed and find their own lives in danger as long as the rest of humanities. Mind blowing special effects, edge of your seat action and a touching story of isolation, friendship and teamwork. Sunshine is British film making at its best."
    },
    {
      "rating": "3",
      "text": "It is atmospheric and the characters are doing a very good job with the script they were given. Visuals are also top notch, most of the time. However, it's sooooooooo damn boring. I've been to uni lectures on geology more exciting than this. This movie is a beautiful dead corpse laying on the directors table. You can see he's trying to revive it with occasional jolts of life. But they pass and the corpse remains. Lifeless and empty. Overall: Sunlight is a movie that look brilliant on page and is best left in written form. It is an utterly boring movie that can not be saved."
    },
    {
      "rating": "2",
      "text": "Bad film with very bad writing. Boyle said to got inspiration from 2001: A Space Odyssey, Solaris, and Alien. Against all odds,  not a single piece of talent is to be found here. The film relays on an over dramatic crew to create a force atmosphere; and stupid choices to make 1 hour of extra film. The script is just awful and predictable. Cillian Murphy is the cherry on the top of the turd; I don't want to see his face again, I don't want to hear him again.\r The film have few good thing. It starts is fantastic and an example. And it could have being a great movie. But you can stop watching after 30 minutes; just about the time in which a PhD in maths make a booboo and forgot to carry one. That is the smaller plot hole you will see from that point on."
    },
    {
      "rating": "6",
      "text": "As usual, Boyle makes a fantastic two-thirds of a movie. Like everyone is saying, the last bit of the movie loses some cohesion. However, the film is just so beautiful it is hard to look away. There is some obvious borrowing from Solaris and Event Horizon but meh...I mean, we haven't had a good sci-fi movie in years. I'll take it."
    }
  ]
}