{
  "id": 4827,
  "title": "Superman III",
  "starring": [
    "Christopher Reeve",
    "Richard Pryor"
  ],
  "runtime": 125,
  "genre": [
    "Comedy",
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "Aiming to defeat the Man of Steel, wealthy executive Ross Webster hires bumbling but brilliant Gus Gorman to develop synthetic kryptonite, which yields some unexpected psychological effects in the third installment of the 1980s Superman franchise. Between rekindling romance with his high school sweetheart and saving himself, Superman must contend with a powerful supercomputer.",
  "releaseYear": "1983",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c4oR6qgZW2s5foGkQi2Dd86KuAS.jpg",
  "categories": {
    "plot": 3.5,
    "acting": 2.75,
    "ending": 4.5,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 3.3333333333333335,
    "funny": 3.3,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Christopher Reeves continues to be the definitive Superman, but even he can't help save Superman III from its unfunny attempts at humor, unlikable, underdeveloped villains, terrible plot, and the awful casting of Richard Pryor.  Don't get me wrong, he's an amazing comedian, but he should have never been considered for a role this toned down and tame."
    },
    {
      "rating": "3",
      "text": "'Superman III' is the kind of movie that is a miscalculation of all things in the genre, and even the character like Superman himself. Everything you knew and loved about the character gets misused so much, it's a wonder why the studio was even making these movies anymore. Christopher Reeve is back as the title character, and he must confront his inner demons, which leads to a rather ridiculous fight that, while somewhat technically impressive for 1983, its overall execution is rather clunky and misguided. Richard Pryor is the latest comic relief here, and he does what he can in a premise that should not require any comedic effect, but for some reason, the filmmakers behind this movie felt that comedy was needed for a story like this. I could go on about why this movie was a colossal disappointment, but I think just a simple \"Don't watch it!\" should be more than enough to give you an idea as to why this movie should never be seen."
    },
    {
      "rating": "1",
      "text": "Ugh this movie is so horrible the attempts at comedy are terrible, the dialogue is like it was written by a 10 year old, the special effects look like **** even back when it came out it looked ****ty, no character development, awful performances there is only one scene that works in the entire film and that is when superman has a hallucination of him fighting his evil self."
    },
    {
      "rating": "2",
      "text": "While Christopher Reeve continues to soar as Superman here, the rest of the movie is nothing but a failed, crash landing. Awful plot, laughable characters and villains, a ridiculous sense of humor, a plot free from logic, and lackluster action make Superman III an awful sequel, especially after the acclaimed Superman II."
    },
    {
      "rating": "8",
      "text": "Synthetic kryptonite laced with tobacco tar splits Superman in two: good Clark Kent and evil Man of Steel as he battles his own morals and save the world once again."
    },
    {
      "rating": "7",
      "text": "Computer programmer Gus Gorman (Richard Pryor) is hired by financial tycoon Ross Webster (Robert Vaughn) to seize control of a weather satellite and annihilate Colombia's coffee crop. When Superman (Christopher Reeve) manages to thwart the plan, Webster commands Gorman to use the satellite to locate kryptonite, the Man of Steel's mortal weakness. But a missing unknown element in the kryptonite -- replaced by Gorman with tar -- causes an unintended side effect when presented to Superman."
    },
    {
      "rating": "6",
      "text": "This was the third of the original Superman series, and definitely a step down from the of greatness its predecessors. It's certainly not a bad film, but relies too much on camp and comic relief (even some slap stick) and gives Richard Pryor too big a role although he is entertaining. In this one Richard Pryor works as a computer engineer for a corrupt company, and is caught stealing from the company in a sneaky way. Instead of firing him, his boss, the sleazy executive uses him to achieve his goals, which are often illegal or unethical. Lois is seen briefly at the beginning of the movie but says she is going on vacation to Bermuda. Clark visits Smallville and reunites with Lana Lang. At some point Superman is exposed to some sort of synthesized, bizarro Kryptonite which affects his personality in a negative way. Superman becomes selfish and mean-spirited, committing vandalism, getting drunk, banging floozies, and does the bidding of the evil businessman by doing damage to a trade ship so that he can bang the evil executive's ditsy yet sexy mistress. Eventually Superman overcomes whatever is possessing him in a climactic battle between Clark and Bad Superman. Superman ends up battling a supercomputer android that is sort of similar to Brainiac. It turns out that Brainiac was originally supposed to be the main villain in the movie. I kinda wish they had gone there and actually introduced Brainiac. What we ended up getting in this movie in terms of adversaries were close to Bizarro and Brainiac, but they weren't officially in the movie. The special effects were good for the time, though a downgrade from the previous flicks."
    },
    {
      "rating": "3",
      "text": "While I'm not a fan of Superman 1 and 2, at least they tried to be entertaining, this a lame sequel that has ever made. Is not the worst, is just lame."
    },
    {
      "rating": "5",
      "text": "The adventure continues. I personally feel the movie is underrated it's not as good as the previous two but it fall's short by some distance in terms of the first two. It lack's that epic scale of the first two and if they decided at the time to just edit out the poor action sequence at the end between Superman and the robotic computer and just rewrote the ending we could have seen a good movie or a better one at the least."
    },
    {
      "rating": "5",
      "text": "What a bad movie, especially the humour is so simple and stupid. But also the characters are one-sided and uninteresting, only the short change of Superman into a \"normal human\" was somehow fun. The villains, story and dialogues were boring also."
    },
    {
      "rating": "3",
      "text": "Replacing its light comical material for slapstick, digressing in exciting action, and having a plot that's dry on and feasible ideas, Superman III is an unfortunate downfall for the series."
    },
    {
      "rating": "5",
      "text": "Its not that I hated it, but it didn't have that same thing that the first two movies had that made them good. I guess its originality. But this one had a bit less quality of acting, plus it had a terrible comic relief that made me laugh barely. I didn't hate it, but i never liked it."
    },
    {
      "rating": "5",
      "text": "There are some shinning moments in this hyped sequel, but unfortunately they are few and fleeting. Margot Kidders absence for most of the movie is probably the strangest but replacing the stoic tone for comedy is right up there as well. I was happy to see them take a risk with a new villain."
    },
    {
      "rating": "5",
      "text": "this movie was average, it certainly has good points and bat points. One of the things i like about this movie is that it has much more humor than the previous two films.the storyline was not bad and the action was better.however, the intro was not john Williams theme and the storyline was not very interesting."
    },
    {
      "rating": "2",
      "text": "(Glad to know I lower the user score from 4.0 to 3.9 :D)\r For a movie that relies on dull slapstick and rehashed points from previous Superman movies, the third installment knows how to provoke a complete boredom and scenes who are supposed to be funny, but they are not. Not as bad as Superman IV (or Abomination) but it's still pretty bad."
    },
    {
      "rating": "2",
      "text": "One or two good scenes... the rest.. unwatchable.. Nothing interesting going on in the plot, stupid jokes and humor, mostly bad acting. No i don't want to watch it again.. not even to laugh at its stupidity."
    },
    {
      "rating": "5",
      "text": "This seems to be a decent movie, I mean there's to much to laugh and it failed over the two first Superman films, but there's some best parts of the movie, an epic battle between Clark Kent and the evil Superman also a scene of an evil computer battle in which Superman destroyed it that doesn't mean it's a bad movie,\rso Richard Pryor had it all."
    },
    {
      "rating": "5",
      "text": "PROS: The cinematography is beautiful, and the special effects are above average. The score is still rousing, and Christopher Reeve is likable enough as Superman. The film is decently paced and there are one or neat touches such as when Superman turns nasty.CONS: The storytelling is very clunky for me, while the script is awful. Margot Kidder apparently wanted little to do with this film and if true I'm afraid it does show, while Robert Vaughan is a pretty poor replacement for Gene Hackman and the less said about Pamela Stephenson the better. Also the direction is rather heartless and using Richard Pryor as the source of the laughs just didn't work.Overall, it is disappointing and lacklustre but it is watchable unlike the fourth. Anyway that is another story. 5/10 Bethany Cox"
    },
    {
      "rating": "4",
      "text": "Superman III relies too much on its humor, leaving all the best of our alien left with nothing but unperformed acting, poor special effects, and a think-off-the-point plot."
    },
    {
      "rating": "3",
      "text": "This is one superman movie not made of steel. It has laughable characters, dumb humor, and a stupid plot. This movie was supposed to be the conclusion to a trilogy that should have been remembered."
    },
    {
      "rating": "4",
      "text": "Part of the first wave of high-concept, big-budget, special-effects-heavy films that emerged in the wake of Star Wars, 1978's Superman: The Movie, like a handful of its contemporaries, threatened to give blockbuster event movies a good name. Fresh off the success of The Omen, director Richard Donner took on the story of the Man Of Steel with the seriousness due an American myth, using newfangled effects to make the fantastic seem plausible. The film's \"You'll believe a man can fly\" tagline might have provided a brilliant marketing hook, but it also served as something of a mission statement, particularly in Superman's early segments. From Superman's Kryptonian origins to his coming of age in Smallville, Donner lends his story a sense of awe usually reserved for those filming westerns, baseball movies, or The Bible. The film becomes comic-booky only when its hero, having disappeared into his Fortress Of Solitude for much of Vietnam and Watergate, hits jaded Metropolis. By his own admission on this new DVD version's commentary track, Donner saw Superman as three films in one, with the gag-and-fight-heavy Metropolis segment evincing a different tone than what came before. Even if it feels removed from, and in some respects not on par with, the rest of the film, it succeeds on its own terms (one horrifying bit of spoken verse by Margot Kidder's Lois Lane aside). Effective both as Superman and as the bumbling Clark Kent, Christopher Reeve still seems ideal for the part, if for no other reason than his ability to summon up a convincing sense of intensity when charged with saving the world. He would need to rely on this skill more and more as the Superman sequels—now released on no-frills DVDs alongside the features-packed original—piled up. With one exception, they illustrate the diminishing returns that plagued most blockbuster franchises in the sequel-mad '80s. Originally entering production at the same time as the first Superman, 1981's Superman II was also to have been directed by Donner. When the budget mounted, temperamental producers Alexander and Ilya Salkind first ditched the two-at-once plan, then ditched Donner, bringing in their Three Musketeers director Richard Lester (A Hard Day's Night, Petulia) to finish the project after the original Superman turned a substantial profit. The seams show, but Lester's visual wit and trademark energy steer Reeve's struggle with Lex Luthor (Gene Hackman, returning from the original), Kryptonian outlaw General Zod (Terence Stamp), and his cohorts in all the right directions. One Metropolis fight scene alone would make it a worthy successor, but the film also allows Reeve and Kidder ample time to develop the humanity (or Kryptonity) of their characters. Not so 1983's Lester-directed Superman III, which displayed the series' first struggle with what could be called the Planet Of The Apes Paradox: How do you keep topping previous entries with conspicuously smaller budgets? Superman III's answer is to play for laughs, but outside of an opening-credits slapstick ballet that could have come from one of Lester's '60s comedies, they come few and far between. The ideas might sound good, particularly the synthetic Kryptonite that turns Superman into a boozing jerk, but they never get developed, while high-profile guest star Richard Pryor appears somewhat puzzled at his own presence in the film. But the bottom of the barrel remained unscraped. Appearing in 1987, when most assumed that the series had been put to rest, Superman IV: The Quest For Peace, with a story dreamed up in part by Reeve, plays like the unholy union of a PSA and the WWF. Stirred by a schoolboy's letter, Reeve decides to rid the world of nuclear weapons by tossing them in a giant net and throwing them at the sun. Meanwhile, Hackman's Luthor, aided by slang-talking surfer nephew Jon Cryer, creates a new super-rival: Nuclear Man, who locks horns with Reeve against a variety of rear-projection backdrops. By this point, the production values had dipped so low that director Sidney J. Furie might as well have imported footage from the old George Reeves series. Unsurprisingly, the series ended there, its first two entries illustrating what grand-scale entertainment could do, the remainder illustrating the perils of doing it to death."
    },
    {
      "rating": "5",
      "text": "it has an interesting story that could have soared but falls flat due to the horrible action sequences and overall crap script this movie is nothing above average."
    },
    {
      "rating": "2",
      "text": "Lester has broken so many rules by now, that he doesn't have any ground to stand on, flying doesn't help in this world.Superman 3Lester is a victim of the textbook trilogy syndrome. And when I say syndrome, we've had plenty of acclaimed makers fall down this road unwillingly and brutally in this final lap of the race. The director Richard Lester arguably should not be blamed. I mean, I would rather put the Newmans, the writers on the stand. For most of the time, the off-putting characteristic of the film is not the execution of the flim-flam hokum but the very incoherent punches that is told to emerge every now and then as an excuse of a crime world. But none of these crimes are actually sinister, probably because none of them communicates with us, the audience.Also what's at stake here is either a formal day to day white collar lawbreaking activity or a misunderstood opportunity seized by someone trying to make it big, none of it actually is a threat that can challenge who arguably is the all mighty powerful in contrast to the very super society of his. Addition to that, the unconventional and irrelevant humor is what tips over this already hanging-by-the-thread film.I mean it starts with a childish humor where a choreographed physical accidents is supposed to be funny along with anecdotes in the film like old marriage jokes, slapstick humor between irritated colleagues and cheap laughs coming from a lazy worker. Other major thing that film lacks is \"logic\". To be honest, the entire series has never seen the face of the base of the physics law, but at least the previous adventures were fun, in big bold capital letters FUN. And this always, always overpowered the limitations of the early installments, but here not only that liberty is taken for granted but is also just not juicy enough for you to eradicate a big priority as such, not for anyone, not even for Superman."
    },
    {
      "rating": "2",
      "text": "After seeing \"Superman II\", I thought the franchise couldn't get any worse... I was wrong. Despite retaining some small merits, this film is far worse and really shouldn't have been missed by those involved, especially Christopher Reeve. In fact, the actor even considered not acting in the film, and his participation was only guaranteed at the last minute, as I found out after some reading, which I did after seeing the film.For me, this movie has the worst script conception I've seen, within the Superman movies. In practice, it is a duel between the hero and a wealthy villain, called Webster. Initially, he wants to ward off competition from Colombian coffee by influencing the region's climate through a satellite, commanded by him thanks to a hacker he discovered in his own companies. When the superhero ruins his plans, he starts chasing him to kill him and get out of his way. Amidst this, the hero still has time to go to an alumni meeting of his old high school, where he meets an old flame, the former prom queen, Lana.The franchise lost its footing after the departure of Richard Donner, and there is nothing that can save the film from being considered terribly bad. The plot is surreal because it is so bad, unrealistic and false. The hero, until now seen as a well of integrity, and in theory in love with Lois Lane (who in this film virtually disappears), is almost put in the bed of two other women, in what we might consider a huge moral flaw. I could give lots of examples of other situations and moments without logic or meaning, but it would be redundant.Reeve does what he can in the role of Superman, but the actor made little effort, he wasn't really in the project with body and soul and his performance reflects that lack of will to be there. It sticks to the basics and doesn't shine. Annette O'Toole also manages to honor the basics, but she can't give us much more. Richard Pryor is moderately funny, but barely succeeds at making us laugh. Jackie Cooper and Robert Vaughan also don't bring any spark or charisma to the film. Pamela Stephenson is irritating, and Margot Kidder was almost relegated to the trailer, as she only appears for about five minutes.Technically, the film has some (few) redeeming virtues, such as the rather well-conceived cinematography, the satisfactorily conducted editing, and the light, relatively fast pace of the film, which avoids tiring the audience with an excessively long duration. Also, the soundtrack did reasonably well, even though the most famous pieces of music I've heard are pretty much the same as in every Superman movie. There are also one or two scenes worthy of anthology for their impact and notoriety, such as the fight between Superman's ego and alter-ego. Unfortunately, the movie doesn't go much further: the sets aren't very well done, there are a lot of cheap and unbelievable visuals and specials, and the movie generally looks cheaper and more fake than its predecessors."
    },
    {
      "rating": "4",
      "text": "I don't know why the makers didn't follow the comics. This movie try its best to be funny but failed. The previous movies were corny but entertaining. This is just a boring movie losing the feel."
    },
    {
      "rating": "2",
      "text": "This movie is as dumb as it gets. It makes no sense and there humor is cheap and vulgar. Christopher Reeve's performance is probably the only redeeming feature."
    },
    {
      "rating": "5",
      "text": "Superman 3 isn't as good as the previous two Superman movies but it's not as terrible as people say it is.The movie's got a pretty weird plot, some pretty good acting from Superman (Christopher Reeve) and Gus (Richard Pryor) but I feel like the rest of the cast feels too out of character and their dialogue feels a bit too forced as well.The action sequences are quite fun, the best one has to be Superman vs Clark Kent, I thought that one was pretty good.Also, the green screen effects don't hold up very well throughout this movie, they've dated pretty badly.There's some really stupid scenes throughout this movie and they don't make any sort of sense and they don't sort of link up to anything.Overall, Superman 3 isn't as good as the first two but it's not all bad. The movie's got some really good acting from Christopher Reeve and Richard Pryor and there's even some pretty fun action sequences."
    },
    {
      "rating": "2",
      "text": "Superman III' is the kind of movie that is a miscalculation of all things in the genre, and even the character like Superman himself. Everything you knew and loved about the character gets misused so much, it's a wonder why the studio was"
    }
  ]
}