{
  "id": 783,
  "title": "Superbad",
  "starring": [
    "Jonah Hill",
    "Michael Cera"
  ],
  "runtime": 113,
  "genre": [
    "Comedy"
  ],
  "description": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg",
  "categories": {
    "plot": 4.055555555555555,
    "acting": 4.5,
    "ending": 7.375,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.448979591836735,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I don't see why people think this is a bad movie. its a awesome kickass movie. although the ending sucked, the movie as a whole rocked and made me and my friends laugh and i think that's what counts."
    },
    {
      "rating": "0",
      "text": "This is bad on every level. Awful script. Awful actors. Awful continuity. Awful blocking. Awful scenes. Coming of age, trying to get laid, high school buddy films don't need to be this bad. Jonah Hill is waaaay to old to play a high school loser believably any more. Michael Cera was much better when he had good material on Arrested Development. Funny film?? Not at all. I felt ripped off by this half-assed effort, by I have been feeling ripped off a lot lately by the current level of Hollywood's mediocrity. Who allows this drivel to be produced??"
    },
    {
      "rating": "7",
      "text": "Michael Cera is hilarious in his socially ineptness, while many times Jonah Hill's salacious outbursts are unnecessary or unjustified in the movie's ethos."
    },
    {
      "rating": "8",
      "text": "Superbad is a phenomenal coming-of-age comedy, and one that is really heartfelt as well. The movie has aged incredibly well, and is endlessly quotable. There are some really slow sections of the movie that hold it back from being a higher score, but one thing I really do appreciate about this movie is that it follows the old school comedy rule of saving the funniest moments for the end of the movie. The final ending is very poignant, and one I won't soon forget."
    },
    {
      "rating": "9",
      "text": "The funniest film I've seen in years. I can't remember the last time I laughed so much."
    },
    {
      "rating": "10",
      "text": "Such a funny film. Way better than the over apprciated 'The Hangover'. It has a great cast and the story between Mclovin and the cops is so great. It's only fault is it shouldn't be watched with parents, trust me..."
    },
    {
      "rating": "10",
      "text": "The bottom line is this movie made me laugh out loud and a lot. I really enjoyed it."
    },
    {
      "rating": "10",
      "text": "The best movie ever! The movie is full of laughs, teen comedy, sex and a true coming-of-age story just like American Pie."
    },
    {
      "rating": "10",
      "text": "Wildly funny, arguably the best \"dirty\" comedy of the 2000's, which is quite impressive considering how many are made these days (\"The Hangover\", \"Pineapple Express\", \"Anchorman\", etc.). The dialogue is funny almost line by line, that's how incredibly funny this movie is. The soundtrack adds a fantastic funky 70's vibe, and the film simply never gets boring or completely ridiculous."
    },
    {
      "rating": "8",
      "text": "hahahahahahahahahahahahhaahhahahahahahahahahahahahahahaahahahahahahahahahahahahahahahahahahahahahahahhahahahahahahahahahahahahhahaahahahahahahahahahahahhahah   funny as hell.   good acting by all the characters.   funny script.  funny lines.   great lines."
    },
    {
      "rating": "0",
      "text": "Superbad is just as it says: Super Bad! Dirty words were just being thrown around as frequently as we breathe air. The plot had no tasteful point and it seems like they were just saying words such as \"d**k\" and \"v***na\" as many times as possible in a sentence without any sense. There weren't really lines or gestures that was funny, but it appears that people were just laughing in the theater because they feel obligated to get their money's worth. I was so disgusted I walked out of the theater (along with a large number of people). I should've known this movie was going to be super-bad since it shared similar distasteful lines and plot with Knocked Up. Disappointed."
    },
    {
      "rating": "0",
      "text": "This is the single worst movie I've ever seen.  Like a train wreck, it was hard to decide when it was the right time to give up and turn off, but I did at about half-way.  The idiots that wrote and directed this piece of garbage should be asked to never do anything again..."
    },
    {
      "rating": "2",
      "text": "I was very disappointed. This movie sucked. It really did. Just a bunch of cussing. It blew balls"
    },
    {
      "rating": "3",
      "text": "painful and embarrassing to watch. One reviewer wrote that the films 'charms' are in the way the characters think with their dicks. What's remotely charming about this!? A load of macho American bullshit (witness the antics of the two cops) and gross moments smothered with an obligatory layer of cheesy sentiment that oozes out at the end of the film ('I love you maaaan'). How can learned critics rate this trash?"
    },
    {
      "rating": "0",
      "text": "Superbad is. I didn't laugh once in the first 30 minutes, so this isn't really a comedy at all. Whenever everyone else laughed, I just cringed and wondered why anyone would ever make a movie like this. If Pauly Shore decided to remake Fast Times at Ridgemont High, Superbad would likely be the result. One of the worst movies I've ever seen."
    },
    {
      "rating": "7",
      "text": "This movie reminded me of when I was young and in high school (even though only 4 years ago). The boy group with contrasting personalities existed in high school (at least in mine). Many pacts they formed (getting laid, being friends from necessity) is very common in high school. Not to mention happy endings near prom! I would have enjoyed this more if I was still in high school but I'm not so it was a little less appealing than it would have been."
    },
    {
      "rating": "10",
      "text": "Great movie and a timeless comedy film. Wasn't interested in it when it first came out back in 09, my junior year in high school. I finally got to catch it a few summers ago and I instantly fell in love with it. Its funny, smart and original with a good look at those friendships in high school and how awkward and fun they can be."
    },
    {
      "rating": "3",
      "text": "It starts off funny, but it is just boring. This is an over-hyped comedy that does nothing but have stupid grotesque jokes. The acting sucked, and practically put me to sleep."
    },
    {
      "rating": "3",
      "text": "I left the theater in a disgust. It was so vulgar that it wasn't funny."
    },
    {
      "rating": "3",
      "text": "One of the most overrated comedies I've ever watched. Shame that so many audiences depend on this brand of vulgar humor to deliver laughs. It's disgusting."
    },
    {
      "rating": "5",
      "text": "I love Freaks and Geeks, I liked 40-Year Old Virgin, and I actually really liked Knocked Up, but I know enough by now to expect Apatow to be consistent. Seriously, have any of you seen \"Life As We Know It,\" or that awful college show he did? The cast is great, but the jokes just aren't funny if shock humor feels formulaic to you after the first ten or so."
    },
    {
      "rating": "10",
      "text": "This movie is amazingly well-made. It's entertaining, but it makes you think at the same time. I rarely give movies any score above a 6, but this movie is definitely worth seeing. I was lucky enough to get in to see a screener of it, and it was definitely worth it! You'll be glad you went to see it."
    },
    {
      "rating": "10",
      "text": "Seth Rogen and Evan Goldberg have shown us what real comedy should be. The gags are hilarious and the dialogue is even better...GREAT movie."
    },
    {
      "rating": "10",
      "text": "Very funny one of the best comedys i have seen in a long time from the first time seth and evan open there mouths you are laughing and it doesnt stop from there i think most males can relate to those two at some level its a great movie if you like crude humor you will love this movie."
    },
    {
      "rating": "10",
      "text": "oh my god. fantastic. that's all i can say. LOVED LOVED LOVED it. It was hilarious. Brilliant."
    },
    {
      "rating": "10",
      "text": "Funniest movie in a long time...laughing the whole 2 hrs."
    },
    {
      "rating": "10",
      "text": "Simply the funniest comedy movie ive ever seen (except for Borat 8-P). If your lookin' for *** and a good time, you will definitly love this."
    },
    {
      "rating": "10",
      "text": "Vulgar, hilarious, and, like knocked up, one of the most real, true-to-life comedies of the decade. It talks the way high school seniors talk and is hilarious every step of the way."
    },
    {
      "rating": "10",
      "text": "I watched this movie 3 times. It was the best comedy this year. I can't wait for it to come on dvd. Everything from Mclovin to the Cops were great."
    },
    {
      "rating": "10",
      "text": "FANTASTIC FILM, had me laughing from start to finish!!!!!!"
    },
    {
      "rating": "10",
      "text": "By the way people, being a cop does not elevate you to some godlike status. My neighbor was a cop (he just moved like two days ago) and from that I can certainly tell you that some of them are immature ass hats. He was cool as hell though but used his badge for fun every chance he could"
    },
    {
      "rating": "5",
      "text": "It had some funny moments but it was almost super bad. American Pie is by far better then this. I saw the unrated edition and I only liked one of the extras which was with two hot naked women making out.That part alone was better then the whole movie."
    },
    {
      "rating": "3",
      "text": "Surprisingly unfunny, too long, and borderline misogynistic. A real disappointment."
    },
    {
      "rating": "3",
      "text": "I was suckered by the hype. Loved 40 Year Old Virgin (as did my missus); Loved Knocked Up (as did my missus). Bought this full of anticipation after all the stellar reviews, set aside Sunday night (what a loser), settled down for a gutbusting laughfest and... er... couldn't believe how badly it sucked. In fact, I was so surprised at my negative reaction that I wondered if I'd been in some kind of dour mood without realising it and got a second opinion from my kid brother who loves the same nonsense (your Liebowskis, Anchormen, Taps etc) and was also massively pumped to watch the movie after the great reviews. His view: he was livid that he'd wasted two hours of his life that he'd never get back. Problems? Okay, here are a few: the main character is a c*ck. Not in a good, geeky, anti-hero kinda way. No, he's just a c*ck, in a fat, crass, thick angry whinging please-smack-me-in-the-mouth dish-it-out-but-can't-take-it-in-return kinda way. He's the thick, angry dude at a party that you just walk away from as fast as you can. And he's waaaaaaay too old for the role. His mate is as dull as a puddle so there's no comedy chemistry, just uninspired swearing met by empty puzzled/guilty looks. The whole McLovin thing was so fiercely try-hard and cynical. The cops' characters changed as the script required (one minute goofing, then psychopathic) but didn't amuse because of the drug-fuelled mood swings - it just seemed fake. The joy of the recent Apatow stuff has been that under the grotesquerie, the characters were oddly credible. This one, however, is nonsense. There's none of the Apatow goofing-around-great-fun-just-hanging-with-these-characters feel. There's none of the amiability of the benchmark for this sort of movie, American Pies 1 and 2 (and nothing to touch the brilliant set-piece gags from those movies); there's none of the inspired insanity of the better frathouse bashes like Animal House. It just doesn't deliver. And the bolt-on ending! WHY would that absolute raging hottie with a sensible head on her beautiful shoulders even look at Mr spiteful whiney aggressive oik, other than because the movie demanded that the two guys sorta \"get the gal\" at the end? Dude - weak. If I was meant to be rooting for him because he'd followed some long character arc... ah, no. 'Cos he didn't. He woke up hungover and feeling guilty because he'd been such a royal pain in the harris that even he'd spotted it. He inspired such antipathy in me, I would have much preferred it if the movie had ended with him falling in agonising slow motion down the long flight of stairs in that shopping mall. Would have been a two star review, but another star for the McLovin \"it's in!\" line, a solitary great moment that only underlined how duff the rest of this movie was. Everyone I have spoken to who has seen it agrees - rubbish film. Sorry folks, the critics all jumped a big emperor's clothes bandwagon. Save yourselves, it's too late for me."
    },
    {
      "rating": "0",
      "text": "This is a sad commentary about back-assward priorities, low class, and a tragic lack of respect for women."
    },
    {
      "rating": "3",
      "text": "Not as funny as it should have been , the story really falls when it becomes obvious that the Police as just as big a baffoons as the teens in the story. The \"cops\" should have acted like real cops do.It would have added some tension, and thus made the events funnier because they would have made the story more real. INstead , they went cheap on the story and tried to use the cops for half the laughs. It didn't work."
    },
    {
      "rating": "5",
      "text": "American Pie it's a Billy Wilder picture! How it's possible love a flat and boring movie like this?"
    },
    {
      "rating": "5",
      "text": "There is lot's of hype around this movie, I think. Its really not that funny. Lots of penis jokes. It has its moments, but its not something I'd watch over and over again."
    },
    {
      "rating": "5",
      "text": "Though the movie was enjoyable, I found it extremely over-rated mainly because of Michael Cera. Jonah Hill and Christopher Mintz- Passe do a fine job of being horny outcasts but, I only thought Cera's character was a bit of a drag because I'm sick of cera being type-casted as the shy nerd. Bill Hader and Seth Rogan are hilarious as the cops but I found some of the other jokes to be not funny, this movie is worth at least a rental"
    },
    {
      "rating": "4",
      "text": "Overrated, So overrated. It was a little funny but really it was just so stupid and unbelieveable that I couldnt look past it and I generally love comedies like this."
    },
    {
      "rating": "8",
      "text": "Superbad is very crude, very nasty, and very funny. The movie comes across as very random and i believe that is were it thrives. The funniest movie of the year."
    },
    {
      "rating": "6",
      "text": "The Mclovin story is hands down the best part of this movie and should've been the only focus of this movie. Every other character's jokes fall flat most of the time apart from a few really good chuckles. Not a bad comedy, but I would rather watch The Interview."
    },
    {
      "rating": "0",
      "text": "Que horror de película tan espantosamente mala y estúpida, para colmo, demasiado inflada."
    },
    {
      "rating": "4",
      "text": "After all the hype I really wanted to like this, but it was just okay. Amusing but not funny. While I liked the awkward interplay between the teenage characters, the constant swearing just seemed gratuitous and unrealistic, making the characters come across as false in a way that's especially damning in a movie that's supposed to feel oh-so authentic. Uh...and the ending, with the girls? Sorry fat kid. Not gonna happen. Talk about unrealistic."
    },
    {
      "rating": "1",
      "text": "God damn, yet another comedy about white boys and there yearning to get laid, When will it end. Film-making is getting worst and worst, it's been done and done way better. Same old sh!t about 2 white friends, sex obsessed,drug jokes, I'm a nerd bla,bla. I wanted to shout out in the theater so hard saying-\"don't worry when you reach college you'll be drunk and having Orgys almost everyday, and become a judge,lawyer, or film maker at the same time\". Because there is no real issues here, I'm sure everybody dealt with much bigger things than this crap(and yes it can be funny), like race, teachers, music, dreams, growing up etc. But no, again this movie is painting a real sh!t view of American schools and why everyone i meet that went to a school like this has absolutely no personality. So maybe this movie is true, if it is, then it's certainly not funny."
    },
    {
      "rating": "0",
      "text": "When's the last time there was a flawed female character in a movie? I honestly can't remember. We'll probably have to go back to like 1995 to find one."
    },
    {
      "rating": "9",
      "text": "Judd Apatow is quickly becoming one of the most reliable sources for comedy. \"40 Year-Old Virgin\" was a terrific success, and it was only continued by what is the funniest movie of 2007, and oddly one of the most touching, \"Knocked Up.\" He is able to dispense a complete sense of realism in absurd situations and each film has you laughing all the way to the credits. Superbad is no exception. Two kids, Seth and Evan (played by Jonah Hill and Michael Cera respectively), are coming to the end of their high school years, and are facing the fact that they will be separated by college next year. They both are lacking in the love department, and wish to enter college non-virgins. Their friend Fogell (played hilariously by Christopher Mintz-Plasse), gets a fake ID, which sets them up as alcohol-snatchers for a party the upcoming night, with Seths crush hosting, and Evans crush going. The events that follow are hilarious. Although these boys have never known a womans sexual touch, they are still complete perverts, and scenes like the one in the chemistry class will have you bursting your gut. Also, the friendship between Seth and Evan can parallel the best friend kinship many felt during the high school years, where you never noticed how you acted slightly homosexual with your best friend, running by their needs and wants, and having petty arguments with them. Plus, Mclovins trip with the cops is a complete breeze, giving you laughter throughout every scene. Mclovins sense of partying and his blind innocence to finally just enjoying life is endearing, in a very different sort of way. When the two boys get to the party, and hilarities ensue, they are set out to either receive sex, or possibly learn a lesson about what girls really want. Slightly not as funny as Knocked Up, it is still a perfect pick for a great time at the theaters. Go, enjoy, and party with McLovin!"
    },
    {
      "rating": "7",
      "text": "If you liked \"Knocked Up\" you'll probably like \"Super Bad\" starring some of the very same actors. The humor is super raunchy which rarely lets up. The subject matter mostly revolves around sex, drugs, and general bad boy and girl adolescent like behavior. There is not a lot of functionality about the characters at first, except maybe Evan who desires something more heartfelt. Yet even he succumbs halfway but does seem to hold true in the end. I would have thought this film to be somewhat nihilistic in overall philosophical outlook but by the end there does seem to be some deeper insights gained by the characters of their valued friendship and respect of the women in which they were tempted to objectify. This took a lot of internal fortitude as it seemingly went against the overarching cultural grain of the movie. Even many of the adults seemed to acts just as bad as the high schoolers, such as the police who seemed to be trying to relive their youth. Some of their stunts were silly and somewhat funny, especially one line with Fogell. However their excessive immaturity did not seem very realistic, though it helps just to go along it. \"Mclovin\" by the way just about stole the show with his half nerdy/half cool, and mostly lucky antics. However in the end it was he who was still trying to impress the chics with his faked IDs and staged arrests. Not much social redeeming value though I found it funny. \"Super Bad\" was neither super bad nor super good, though definitely worth a viewing. I did however think the film and many others lately push the envelope by using children to portray adult subject matter. Though I laughed at some of the private parts drawings it did seem to cross a line we rarely seem to question any more. I am concerned society is spinning in a less than wholesome direction. I am conflicted as to whether to support this film in light of this fact however it seems appropriate to deal with society in relation to how it is now and not some idealized moral standard. However it is my hope there will be a push for at least some cinematic restraints. In short \"Super Bad\" can entertain, offer some insight about friendship and treating others as human beings, but I doubt it will go down in the annals of film as a classic to forever be remembered."
    },
    {
      "rating": "7",
      "text": "\"Superbad\" wasn't written by Judd Apatow, it just seems like it was. In \"Knocked Up\", Pete(Paul Rudd) would rather engage in fantasy baseball with the guys than hang out with his wife. Seth(Jonah Hill), at eighteen(too young to be suffering a midlife crisis), is barely five seconds into his burgeoning romance with Jules(Emma Stone) before he starts missing Evan(Michael Cera). Penis life-drawings notwithstanding, I don't think Seth is supposed to be read as gay, he just enjoys homosocial (not homosexual) relationships. \"Superbad\" is not the uproarious comedy it's purported to be(I think the problem is that Christopher Mintz-Plasse is a little green), but it's a success because of the film's willingness to portray male friendships with a frank ickiness not previously seen in American mainstream cinema. It's as if the screenwriters read William S. Pollack's \"Real Boys: Rescuing Our Sons From the Myth of Boyhood\"."
    },
    {
      "rating": "0",
      "text": "No no no, everyday last year at school all i heard was how hilarious this movie was, how great it was so i finally rented it * wish i could get my 5 bucks back *. Pointless jokes that wernt even strong enough to make me laugh and i laugh at about anything. People stop applauding this movie! The only remotely entertaining part was the cops, and that didn't last long."
    }
  ]
}