{
  "id": 1866,
  "title": "Superman",
  "starring": [
    "Christopher Reeve",
    "Marlon Brando"
  ],
  "runtime": 143,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
  "releaseYear": "1978",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
  "categories": {
    "plot": 8.352941176470589,
    "acting": 7.944444444444445,
    "ending": 8.0,
    "soundtrack": 9.2,
    "cinematography": 10.0,
    "familyFriendly": 6.75,
    "funny": 5.75,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "There have been other actors before christopher reeve that played the part of superman but he made the character of clark kent and superman come to life."
    },
    {
      "rating": "10",
      "text": "This movie has a special place in my heart. Christopher Reeve set the bar for all other actors portraying superheroes. And nobody since has managed to meet it. To me, Reeve *is* the Man of Steel. I don't care if the special effects are dated these days. This film's greatness transcends that. After all, Superman Returns had state of the art special effects and yet was a complete failure of a film. Christopher Reeve was able to make me believe a man could fly.Also, Superman is one of those magical movies that really lodged itself in my mind because it's one of those films that, because of its length, I could never actually finish watching as a kid. Ya know, it's one of those films that you'll catch on tv, or see at a day care center somewhere in Reno, and yet something will always come up which prevents you from getting the ending. Either you'll just fall asleep, or you'll get picked up from the daycare center... just events unfold which prevent a full viewing. For me, it was this film and Back to the Future 2 that always seemed to last forever and I'd never finish till the end. That gave them a sort of mystique in my childhood.Now, there is one weakness of Superman, and that's the ending. Superman turns the world backwards in time to save Lois and stop California from falling into the ocean. Yes, it's not great... it doesn't really make any sense. But it's one small blemish on an otherwise grand superhero origin story. And honestly, how could you resist the very end when Christopher Reeve flies over the earth at the onset of a new dawn, looks up at us, and smiles in the way that Superman would smile? It's just movie magic, folks.What makes Superman work is Richard Donner's verisimilitude, especially during the Krypton and Smallville scenes. This movie was the first to tell the superhero origin story, and is still the best one, in my opinion. The shots of the crystalline Kryptonian landscape are awe inspiring. You really believe this is an alien world with an alien people. Smallville looked like the town that Norman Rockwell grew up in. Sure, it doesn't actually exist in real life, but it looks like how we would all want a small American town to look. Who wouldn't want to grow up in a pastural idyllic setting like that? Who could possibly doubt that America's greatest hero would emerge from such a place? When the camera rose and zoomed ahead of Clark and Martha Kent, embracing in a rich field of golden wheat, it was the film letting us know we had just witnessed the birth of a modern American myth.And of course, the soundtrack. Who the hell doesn't know the Superman soundtrack? I haven't really talked about the soundtrack of any other film in my reviews, and it's for good reason. None of them matter compared to John Williams' work here. Truly a masterpiece of scoring, and probably his greatest work to date. The notes simply cry out \"Superman\" even though there aren't any lyrics. Just as Aliens worked to pummel you with dread and suspense, the Superman music worked to uplift the spirit and allow the audience to soar like the Man of Steel himself."
    },
    {
      "rating": "10",
      "text": "Superman, possibly the first superhero movie ever, is a movie that is exactly what Superman should be. Lets hope someday Superman has a video game that is as good as this movie."
    },
    {
      "rating": "10",
      "text": "Before Batman Begins, Spider-man 2, Iron Man, and Dark Knight there was Superman and Superman II. Fantastic film making with wondrous moments. John Williams score takes flight. They got it right. Superman Returns needs to get back to this formula of film making - bright colors, fun story plots, spunky superboy, and energetic risk taker(Lois Lane). Superman is American Pop culture. I think of Coca Cola, Apple Pie, Uncle Sam, State Fairs, and Amusement Parks. I love the story of Superman. The whole thing. I think Donner and Lester both understood the super hero myth and where it fits with Americana. I would sure love more movies made like these. I don't think they ever get old."
    },
    {
      "rating": "10",
      "text": "Arguably the greatest superhero of all time in what is inarguably his greatest movie. Yes, its campy. Its campy to the extreme. But it meant to be. Superman, from the clothes to the sets to the colors, is a living comic book. The classic Man of Steel books of yesteryear brought to life on screen, and the most faithful adaptation of the superhero source material you'll find. Of course, in the light of the obsession with \"dark, gritty and real\", the film falters, but its not about that. It's about childlike wonderment, it's about the good, honest power of Superman, the sincerity of it all. He's not a tortured soul, but merely a good-hearted young man with a sense of purpose, played inimitably by the late Christopher Reeves. And say what you will about the Caped Crusader, nobody cared when Rachel blew up like we did when Lois died. We all wanted to spin the world backwards then. It is a comic book through and through, and maybe not the bleak, murder-filled darkness everyone prefers, but for what it is, it's perfection. Let go of the obsession with brooding, turn on your inner child, and watch. You will believe a man can fly."
    },
    {
      "rating": "10",
      "text": "'Superman' has been a personal favorite of mine for 10 years. Compared to the superhero films of today, 'Superman' still stands out as the best comic-to-film adaptation. A brilliant movie with everything you could want in a movie R.I.P. Christopher Reeve: 1952-2004."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie as a child, yet I learned through time that it has a lot of editing and continuity mistakes, I still like it. And Chris Reeve will be Superman to me forever!"
    },
    {
      "rating": "10",
      "text": "Truly inspirational, saw it recently at the Arclight Hollywood with Richard Donner commenting live.  Donner was a prankster and that level of fun sets the tone of the film. THe emotional depth Chris Reeve displays is amazing! This movie is a gift to all comic book lovers!"
    },
    {
      "rating": "10",
      "text": "Quite possibly the best super hero movie of all time. Special effects years ahead of its time, Puzo's script was great, Donner was spot on directing, best complete casting job of all time, and what else can you say about Chris Reeves - he will forever BE Superman."
    },
    {
      "rating": "10",
      "text": "The first superhero movie is one of the best still, see this movie."
    },
    {
      "rating": "10",
      "text": "BEST MOVIE EVER! The critics are a bunch of idiots because \"Man of Steel\" is a must see, especially on IMAX 3D! It was epic! Best movie of the year! The acting was superb, special effects and graphics were amazing! and story line was edge of your seat entertaining. I love the fact that they still incorporated some of the old school storyline into a modern day feel. I recommend everyone see this movie. I plan to see it again!"
    },
    {
      "rating": "10",
      "text": "AWESOME! AWESOME! AWESOME! Best  Superman Movie ever made hand down! I thoroughly enjoyed this movie so much so I am going to see it again at the IMAX 3D."
    },
    {
      "rating": "10",
      "text": "One of the best superhero movie ever! Christopher Reeve is a fantastic Superman, the effects are wonderful and the scenes are really great. This remains as my favorite since childhood."
    },
    {
      "rating": "7",
      "text": "Before I watch this movie, I wondered if it is as convoluted as Snyder's Man of Steel. And I can that it's by no means that convoluted, although it's still somewhat messy, specially when it comes to Superman's origins part. That could have been easily avoided using enough time at the beginning instead of spending a lot of time showing Superman's abilities and powers. Also, the movie's run time is 143 min, so it really could have been used better.The thing that Donner did better than Snyder is sticking with the lighter tone. That made the emotional impact very strong, and almost every dramatic moment works very well. Also, this made the convoluted presentation of Kal-El's origins more acceptable.The dated special effects never bother me in any movie, but to be fair, we can see that they could have been a bit better in Superman, specially when we compare the special effects here with the special effects of Star Wars, which came one year earlier than this movie. Nevertheless, they still work, actually they are okay.Christopher Reeve's performance is iconic for good reason. He has a charisma that made love him as Clark Kent as well as Superman more than Henry Cavill, although I saw Man of Steel long before this movie, well, as I just finished watching this movie! Also, the chemistry between Reeves and Margot Kidder, Lois Lane, is great!One of the weakest points in this movie is the Villain, Lex Luthor. Neither Gene Hackman's weird, and kinda over-the-top performance nor every thing about Lex Luthor from his odd behavior, to his motives, convinced me.There are tons of plot holes, and logical gaps in this movie from its beginning to its end, and I really couldn't overlook all of them. Specially when it comes to the ending. Oh god! this is may be the most nonsensical ending ever put to film.Notwithstanding all the illogical stuff, I was very surprised seeing the movie taking advantage of almost every scientific thing that could be related to Superman, and to this story in particular. I don't want to spoil any thing, but I really wish if superhero movies nowadays be more science fiction movies rather than fantasy movies.On the whole, I had a blast watching this movie that arguably started all the superhero movies we love now. (7.5/10)"
    },
    {
      "rating": "6",
      "text": "It seems everyone wants to remain forever a child these days, but this movie is not that good. It is entertaining for kids, but hardly worthy of the fawning reviews it's received from critics. I supect it is at least partially due to sentimetality over Christopher's Reeves' unfortunate fate."
    },
    {
      "rating": "9",
      "text": "There has yet to be a film in this genre that has topped it. Other critics were quick to jump the gun with Spider-Man or X-Men but time has already aged those films like so much cheese...while Superman continues to age like fine wine. Perfect casting, perfect chemistry, perfect music and nearly perfect dialog (albeit somewhat cheesy and uneven with the comic relief of Luthor and Otis) make this the all-time best superhero movie."
    },
    {
      "rating": "8",
      "text": "This is an original superhero movie. Sure its extremely cheesy, but hey, no one really cares at this point. It's a classic. It began the Superman franchise. Although most of the other ones were bad, this one was still okay."
    },
    {
      "rating": "9",
      "text": "This movie is probably still the best Superman movies compared to modern-day Superman movies. Despite having no fight scenes, this movie sticks very closely to the comics, and is iconic as a Superman movie. This movie also has the best Superman theme. I am very impressed on how these people make such a good movie even in the 1970s."
    },
    {
      "rating": "9",
      "text": "'Superman' is a revolutionary; a movie that made many movie-goers believe that men can fly. The superhero epic, released just one year after the ground-breaking 'Star Wars' (1977) continues to lead special effects artistry to the next level, resulting to one of the most extraordinary movie experiences ever. Superman's father, Jor-El (Marlon Brando) decides to leave his son, Kal-El to travel to planet earth, while his home planet, Krypton is destroyed, and the evil General Zod (Terrence Stamp) is sent to the Phantom Zone to await his punishment. While landing on earth, a young Kal-El finds himself bumping into Kents, Jonathan and Martha, who decide to take him home and raise him like he is their son. As he is raised to be \"Clark Kent\", growing up, he has managed to remain in hiding his powers, keeping them a secret just like he promised his adopted parents. When he becomes a fully grown adult - now played by Christopher Reeve - and discovers his true origins, he dons the iconic suit and decides to use his powers for the greater good, by helping out innocent people and fighting crime. He decides to live an ordinary life by getting a job at the Daily Planet newspaper company. It's there he meets a woman he likes named Lois Lane (Margot Kidder), a reporter who is very spunky and ambitious, and even gets to meet Superman himself from time to time. Little do we know that Metropolis is in terrible danger as the evil Lex Luthor (Gene Hackman) threatens to make a fortune by buying large amounts of barren desert island, this is after he learned that the U.S. Army and Navy will launch a nuclear missile test. What makes 'Superman' so remarkable is the fact that it manages to break new ground in regards to special effects and tell a meaningful and deep story at the same time. Reeve fits the role perfectly as the Man of Steel, providing not only the look, but the wit and charm of the character we all love from the comic books. This is a movie that every comic book fan should see, if you haven't already seen it yet."
    },
    {
      "rating": "7",
      "text": "Superman laid the foundation for comic book films as we know them. To this day, Christopher Reeve is the definitive Clark Kent/Superman. However, it's not perfect. The whole Superman origin story was quite boring and convoluted. Lex Luthor's motivations were questionable. Though not a masterpiece, it's a good movie nonetheless."
    },
    {
      "rating": "8",
      "text": "Do you people know how comic book adapted movies started out? Uh Huh. \"Superman\" started it all, and guess what; it was marvelous."
    },
    {
      "rating": "10",
      "text": "Looks like somebody got bored and decided to trash a classic film. Yeah it seems a bit dated now, but it's a great great movie. Supes is in need of a reboot."
    },
    {
      "rating": "10",
      "text": "I loved this movie! It was amazing! super entertaining....DO NOT LISTEN TO CRITICS! Judge for yourself and go see it. You will not be disappointed. Superman is my HERO!"
    },
    {
      "rating": "10",
      "text": "Superman is a wowing action film of the 70s and has a nice legacy that follows it."
    },
    {
      "rating": "1",
      "text": "DON'T BELIEVE THE 88 RATING. This is a pretty bad movie. The pacing is horrible, not nearly 2 and 1/2 hours of material, and the special effects aged poorly. One wonders how esteemed critics could have been bamboozled by such tripe. The sound track and opening sequence are ripped off Star Wars, which is funny but sad. The acting is ok later on: two good scenes with comic relief between Clark and Lois, but the script is otherwise cheesy, (including Lois's in-flight mental poetics: \"I'm flying so high/ Up in the sky\") and Lex Luthor's insufferable whining. The action sequences are fraught with holes and fail to arouse even the barest tendrils of excitement. The only reason to watch this movie is for historical purposes to see how the film version of Superman began. And if you're a big Christopher Reeve fan (though the red panties didn't age well either...) Otherwise, a waste of time."
    },
    {
      "rating": "0",
      "text": "The problem with this movie is that it goes too far with Superman's powers. And whenever he fights a bad guy, he always wins. Its like he's undestructable and invincible. And director Richard Donner cheesily art directs this movie, with a horrible style, unengaging fashion, and a dull, dudfull life. Superman would have been better if it weren't cheesy, frick'n overrated, and better acting. Its so corny, Richard Donner presents a getting far overaged, and has easily lost its high standards it once had. The affects are terrible, everything sucks. The kryptonyte stuff, the nudity (which in the beginning shows an 8 year-old kid butt-naked, showing absolutely everything, and some parts we don't want to see), its nudity like never before, but a bit too much. The planet Krypton stuff, the 7 crystal things, the ghost of his father, led being a weakness. There are so many stupid ideas. Just to settle the reviews, I personally think this is a simply forgettable bore. Snd a huge disappointing letdown."
    },
    {
      "rating": "9",
      "text": "I seen the movie man of steel and i give 3 and a half star's that doesn't mean it is a bad movie., i like more Superman (1978) and Superman II (1980) and the soundtrack of Superman (1978)  is better."
    },
    {
      "rating": "8",
      "text": "The effects have not aged well, and there are a few points where the film's pace goes a tad too slow. However, \"Superman: The Movie\" benefits from fun action, being delightfully cheesy, and the late Christopher Reeve playing the man of steel."
    },
    {
      "rating": "9",
      "text": "The vibe of the movie will give anyone goosebumps. The setting, the visual effects, and also John William's music. Best DC movie ever made!"
    },
    {
      "rating": "10",
      "text": "One of the best superhero movies to this day and there's a lot of good superhero movies but this might be one of the best superhero movies up with Spider-Man 2 and The Dark Knight."
    },
    {
      "rating": "8",
      "text": "You'll Really Believe A Man Can Fly!Superman 1978 was really the start for superhero movies as a whole (apart from Batman 1966) and it is truly a magnificent film, filled with heart, action, comedy and a great villain definitely a must see for superhero fans"
    },
    {
      "rating": "10",
      "text": "sure the effects do not age well but the performances of Reeves and Hackman are near-perfect"
    },
    {
      "rating": "7",
      "text": "As much as i wanted to like this film i just couldn't get over the plot holes in the end. He goes back in time to save lois, so that should mean that everything he did to save the world should have been undone, but it wasn't i just don't get it. just cuz he went back in time doesn't mean the earthquake and stuff won't happen now. that just brought the movie way down for me."
    },
    {
      "rating": "7",
      "text": "Christopher Reeve proves he's certainly a phenomenon. However, the film is a bit overrated. Superman winds back time?"
    },
    {
      "rating": "8",
      "text": "If I had seen this for the first time not some fifteen years after it came out I might have rated it higher. It's not the best superhero to movie adaptation (Spider-Man 2 and Superman 2 were better), but none the less ranks among the best Superhero films."
    },
    {
      "rating": "7",
      "text": "Planet about to explode, parents send son to Earth in capsule, old couple find capsule & adopt son, son is not all that he seems.The film that made Christopher Reeve & he really does excel in the lead as both Clark Kent & Superman. Has a hell of a cast around him too with Gene Hackman hamming it up as Lex Luthor, a bumbling Ned Beatty & a very sexy Valerie Perrine as his assistants.The first hour is very well done setting up the background & the hero growing up but I felt it got a bit silly later on when everything becomes a cheesy catalogue of disaster & the effects haven't dated too well either.John Williams's score is huge, the main theme being the highlight, but there is a lot of similarities with Star Wars in the incidental music."
    },
    {
      "rating": "7",
      "text": "Well the movie was good enough to watch. And the actor for Superman acted pretty well so yeah it was good that's worth watching."
    },
    {
      "rating": "8",
      "text": "The effects are outdated now, but when Superman first came into theaters it astounded audiences. Although the effects haven't aged particularly well, Superman is a feel-good, well-told superhero origin story that features strong performances from a terrific cast."
    },
    {
      "rating": "3",
      "text": "This is a different kind of movie, is not a classic to me nor better than Man of Steel. It looks like an expensive tv movie. The cast and acting are fine, but none of them are great, except Marlon Brando. I like John William's music. This is to me mediocre."
    },
    {
      "rating": "8",
      "text": "This a great film. The one thing I cannot stand in this movie is superman turning back time to save Lois. Superman cannot do that!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "The film is very dated and grimace, but the performance of C.Reve behind some weight to the image of the character and the film, but the trump card is its soundtrack which has a theme inspiring and phenomenal band, and a reasonable communist history the film keeps slowly but good."
    },
    {
      "rating": "9",
      "text": "Great movie, really the first good superhero movie and it's a classic despite being somewhat outdated. Gotta love Christopher Reave as Superman he does it perfect and is one of the reasons this movie is a blast."
    },
    {
      "rating": "8",
      "text": "The movie has it strong side, for example, when Superman's father shows his wisdom or Lex Luthor shows his intelligence. The story explains a lot about Superman and makes the movie interesting.But on the other side the movie is very stupid sometimes: The  thugs of Lex are childish and the Clark Kent is naive like a teenager. Of course the special effects are outdated, but I can forgive that."
    },
    {
      "rating": "9",
      "text": "Insanely entertaining, and a complete breakout movie for its time period, both as a superhero film and an epic in special effects. Superman is one exciting ride."
    },
    {
      "rating": "7",
      "text": "The original Superman is campy, superficially fun stuff, and knows it's that way. It's a bit overlong and the dialogue is cheesy at points, but all in all it passes the time. Hey, at least it's better than Man of Steel."
    },
    {
      "rating": "7",
      "text": "Originally filmed back to back with Superman 2, Richard Donner was fired half way through filming the second part (due to budget and timing miscalculations) and the end of Superman 2 was slapped onto the first.  The genius with the former is bringing to life such an iconic character, but yet it still feels like something is missing."
    },
    {
      "rating": "9",
      "text": "It's goofy yeah, I got that. But this classic super-hero film conveys a talented cast and a well-crafted storytelling that is more than enough to satisfy."
    },
    {
      "rating": "5",
      "text": "I am really sorry to say it but this movie is out of time. Maybe it was cool in the 70' but now.. nope. I mean Superman is not super because the technology couldn't show us his full scale of power. So it had to focus to much on humor and it feels to much like a kids movie. Reeve was good for that purpose i'll give you that"
    },
    {
      "rating": "8",
      "text": "Though it can be corny at times, Christopher Reeves performance as well as Richard Donner's direction and the dazzling effects make Superman a classic"
    },
    {
      "rating": "10",
      "text": "The best Superman adaptation, period. It shows that Warner Brothers has always been the problem. When they even fired Richard Donnor. Who clearly knew how to use Superman."
    }
  ]
}