{
  "id": 1869,
  "title": "Superman Returns",
  "starring": [
    "Brandon Routh",
    "Kevin Spacey"
  ],
  "runtime": 154,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "Superman returns to discover his 5-year absence has allowed Lex Luthor to walk free, and that those he was closest to felt abandoned and have moved on. Luthor plots his ultimate revenge that could see millions killed and change the face of the planet forever, as well as ridding himself of the Man of Steel.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/385XwTQZDpRX2d3kxtnpiLrjBXw.jpg",
  "categories": {
    "plot": 6.214285714285714,
    "acting": 5.7368421052631575,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 6.0,
    "familyFriendly": 5.0,
    "funny": 2.5,
    "action": 6.388888888888889
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Superman Returns is a sad case study. It was a unique reboot that recaptured the charm of the classic movies while moving forward into new territory. Routh as Clark Kent channeled Reeves brilliantly. It might have reignited the franchise if it had contained a few more epic action scenes for the audience that found it boring. As a coming of age tale, a man becoming a father, it delivered...but it lacked the bombastic action that superhero movies usually feature and there was rarely a sense of threat. I really enjoyed it for what it was but, after lots of discussions, can understand why many of the people who saw it were disappointed. It's a shame, if only Lex had recruited an actual supervillian Routh might still be Superman instead of the Atom."
    },
    {
      "rating": "7",
      "text": "It is an enjoyable, fun superhero film!  Although it is a bit too long and it does drag a bit from time to time!  It's a good, but not great movie, and it's worth watching!"
    },
    {
      "rating": "6",
      "text": "Singer was meant to finish directing the X-Men trilogy, and this proves it. The look of Superman Returns, while beautiful and streamlined, doesn't feel the way a Superman epic should. The lighting was never right and so everything looked dull and grey. The characters had little or no depth, with Superman showing no sign of anything resembling a personality and Lex Luthor's trademark cunning and meticulous scheming replaced with an over-the-top plan that carried no degree of subtlety or credibility. Overall, it was a good film, but not a great one. We could've had a great superhero film and it would've been X3. Instead we get two mediocre films marred forever by missed opportunities."
    },
    {
      "rating": "9",
      "text": "Quite entertaining-great special effects. Not quite as good as Spiderman, but still an excellent movie."
    },
    {
      "rating": "7",
      "text": "By no means does this live up to the first two Superman movies, however, this movie is seriously underrated. Although it might be a little too heavy on the story, and Luthor's plan is laughable, Superman Returns has fantastic effects, great acting, and a great score. It is overall a solid, but imperfect movie."
    },
    {
      "rating": "8",
      "text": "one of my favorite superhero movies! It had a good storyline. and showed how the extent to which superman would go to protect the people around him. i liked kevin spacey as lex luthor too! the only problem was that the climax was not put at the right time of the movie."
    },
    {
      "rating": "8",
      "text": "Although short on 'action', this soulful and heartbreaking take on the Superman franchise is utterly fantastic. It works well at stirring nostalgia on by following precisely in the footsteps of the old 70's and 80's movies... And Kevin Spacey is a riot as Lex Luthor!"
    },
    {
      "rating": "8",
      "text": "Superman Returns is a reboot that has a epic story. Lex Luthor is a better villain in this Superman and that is probably the biggest reason why I think Returns was satisfying. Hopefully the next reboot can do it even better."
    },
    {
      "rating": "8",
      "text": "Though it certainly isn't on the same scale as Christopher Nolan's Batman when it comes to superhero films, SUPERMAN RETURNS is certainly one of the best."
    },
    {
      "rating": "9",
      "text": "Focusing a great deal on the story rather than the action, Superman Returns breathes fresh air into the Superman saga, reinvigorating the man of steel for today's generation in fantastic fashion."
    },
    {
      "rating": "8",
      "text": "i must say that I really enjoy this film, I'm so glad that the critics ended well but WHY THE USERS WERE SO HARSH TO THIS FILM, THEY GOT IT ALL WRONG! I've seen this film a couple of times and it's still my favourite. Superman Returns is the greatest superhero movie ever thanks to Bryan Singer(director of the two first X-men films) and I realized that this is an alternate sequel to both Superman l and ll ignoring lll and  lV so that's peculiar, Brandon Routh is a perfect guy for the role, and Lex Luthor is back once again played by Kevin Spacey, this character is more sadistic and cruel than Gene Hackman's character."
    },
    {
      "rating": "8",
      "text": "Superman is back! But he has to find his place in a changed world again; but the one who didn't forget him is Lex Luthor. With enhanced special effects and all, it lacked the drive to have the drive of his siblings (1978, 1981). Nice try, Singer and Routh."
    },
    {
      "rating": "8",
      "text": "For me, Superman Returns is the definition of a good superhero story. It is great to look at, with great action and a great plot, and really just unforgettable. This movie has so many scenes that I just want to watch again and again, my favorite being the destruction of Lex's model of Metropolis. The scene just feels... real. Much of this movie is very simple, but real and unforgettable somehow. I can't really explain why Superman Returns is so great. Just watch it, and then you might understand what I'm trying to say."
    },
    {
      "rating": "2",
      "text": "Yes, we all love the superhero Superman. Having said that it doesn't mean that this turkey of a movie gets a free pass as most of you giving it a ten are doing. The script was awful, the acting wooden, except for Kevin Spacey as Lex Luthor, and the directing even worse. The cast was fine but now that they are back they need something to work with. To be perfectly honest I too adore Superman but this was a very slow moving innate effort by the producers. Call a spade a spade."
    },
    {
      "rating": "6",
      "text": "Bran Singer by accident ruined 2006 for me. By leaving the X Men franchise and going to this one, we have two mediocre super hero movies that 'underperformed' in the box office. Superman Returns seemed to have everything...great production values, great casting (Brandon Routh and Kevin Spacey) and a passionate film maker in the form of Mr Singer himself. But by making this a 'sequel' of some sort to Dick Donner's SUPERMAN, Singer pinned himself into a corner.  Face it, despite how brilliant Spacey is, Richard Donner's portrayal of Lex Luthor was crap. And for crying out loud, as much as I like Kate Bosworth, she is the worst Lois Lane in cinematic history. Superman Returns, beside  a really great set piece in the middle of the film, felt slow and 'too serious' for its own good. The critics may like it, but the audience didn't."
    },
    {
      "rating": "0",
      "text": "Didn't enjoy this 'Christ in a cape' shlock-fest one bit. The plot was absurd and logically inconsistent, the action scenes were snore-inducing and there wasn't one performance worth a damn -- including the overrated Kevin Spacey."
    },
    {
      "rating": "2",
      "text": "One of the worst movies of the year for me. Dull, detached, and predictable to the last detail, Superman Returns fails miserably compared to other recent superhero films. The only positive note is Kevin Spacy's acceptable performance."
    },
    {
      "rating": "10",
      "text": "Loved it... i hear it's a serious event in imax, can't wait to see it again! spacey nailed it."
    },
    {
      "rating": "10",
      "text": "A complete masterpiece. it was emotional and moving and filled with plenty of action for my taste. i was glued to the screen from beginning to end. best superhero movie since spidey 2."
    },
    {
      "rating": "3",
      "text": "Dull, plodding, boring, pedestrian, lacking drama, lacking romance, and especially lacking ACTION. who thought it was a good idea to make a Superman movie without any action/adventure save one or two scenes? Awful flick."
    },
    {
      "rating": "5",
      "text": "Bryan Singer's Rendition of \"Superman\" is organized poorly. \"Superman Returns\" is the evidence. Containing almost empty action with decent performances (I expected more from you, Spacey), Director Singer should have changed the name 'Superman Returns\" into \"Superman Fails\"."
    },
    {
      "rating": "10",
      "text": "Superman with such passion, vigor, and release of infinite power, he graciously fly's and fights his emotions through obstacles.He is a man who holds the world and knows what he should do to help the ones he loves and others then himself. Awesome film. Anyone who has not seen the power of this film should experience it.."
    },
    {
      "rating": "1",
      "text": "Oh lord why was this movie made is what I thought after seeing superman returns in the cinema. It was crap acting with a crap storyline and that's all I can say. It was definitely more joyful than man if steel but was much worse whilst man of steel was a masterpiece."
    },
    {
      "rating": "1",
      "text": "Superman Returns is the worst movie that I have seen since \"Batman & Robin\". The movie completely lacks originality and I found myself on more than one occaision laughing with such gusto at the corny dialogue and leaps in logic, that I nearly had to leave the theatre. I cannot believe that any studio would have spent 200M on a franchise movie with a script this poorly written, and overacting that would embarass a Soap Opera cast, (Kevin Spacey's Lex Luthor excluded). With Spiderman, Batman Returns, and X-men having raised the bar for super hero movies, I expected so much more. Instead I was treated to a movie that ripped of the original throughout, stole from several other action flicks for it's story line, and did nothing to develop the characters at all. This is movie making at it's worst."
    },
    {
      "rating": "0",
      "text": "It was all wrong christopher revee is superman and is the only person who can play superman and margot kidder is the only one who can play loz lane same for Lex Luther is played by gene hackman!"
    },
    {
      "rating": "6",
      "text": "Intended has a direct sequel to the 80’s Superman II the caped hero returns to Earth five years after having left to find Metropolis’ crime rate on the rise and Lex Luthor still free. Directed by Bryan Singer the movie is certainly faithful to the originals and for the most part Brendon Routh is able to recapture the charm that made Christopher Reeve so popular in the role even if there never quite seems to be the same level of chemistry with Kate Bosworth’s Lois Lane.\r The movies plot is perfectly passable, largely thanks to an excellent performance from Kevin Spacey as Lex Luthor, despite the fact that we never really learn anything more about the man of steel as the film progresses. Even if Superman has never been as interesting a superhero as Batman for example a little more insight into what had happened over the last five years would have still been nice.\r Overall, while it can perhaps be a little slow in places, thanks to some well shot action scenes and good performances Superman Returns is a worthy addition to the franchise."
    },
    {
      "rating": "8",
      "text": "Overall, Superman Returns is the sort of force that's irrational, yet is ironically able to gain value by being aware of itself. What's meant by this is that the irrationality in question is perhaps that it's acceptable to oppose self-awareness without reason, and that the source of this dynamic isn't meant to be understood.Possessing self-awareness is a type of division, ergo a type of conflict. So from this definition, what can be projected onto Superman Returns is the formula that the source of being self-aware is the irrational, but, because that source was always inevitable that means that it's okay for an outcome of purity to derive from the act of self-awareness. Of course, the next problem that leads from this is that if Superman Returns is a process of getting to purity, is that meant to suggest that the movie itself is an evil product?Even if Superman Returns isn't evil per se, on the basis that evil is true, that still leaves the worrying and disturbing idea that Superman Returns is partly evil incarnate. Which makes sense, given that the story does feel very eerie, and very poignant and about impending doom. But then again, if the story is about impending doom, that provokes the great idea in which Superman Returns can be understood as a perfect encapsulation of a trade of identities: the story is about impending doom, and therefore the external product possessing the story being the process to purity is a very neat and very impressive reality. The probability, is that Superman Returns is indeed what's just been described. It doesn't seem far-fetched or out of place to perceive Superman Returns this way, but, there is then a new issue that arises: if this identity of purity for evil is real, is it worthwhile to point out that it's possible that this nature is a justification for the movie? If the justification is real, perhaps it's just a consequence of the story that the complexity isn't able to deal with the justification. After all, the purity that's ostensibly linked to the product isn't an actual part of the experience, not even when Kal-El visits Jason at the movie's very end, and so it seems fair game to think of Superman Returns as a type of failure. Failure, in this sense, isn't negligible but it also isn't important. The fact is that Superman Returns is a tremendous emotional experience, and frankly represents a much better type of art and philosophy of film-making than most other superhero and fantasy movies do. In the world of Superman Returns, the mundane and the common are the special and the supernatural. The typical human experience is the value of the story, the clear pattern of the story being the link between complexity and uniformity.In Superman Returns, spectacle derives from uniformity, but link between spectacle and uniformity is the theme of the movie rather than just some accidental byproduct. The supernatural nature of uniformity being possible is the movie's spiritual essence, and this is the sort of story depth that far outshines many other sci-fi classics. It's a crime that Superman Returns never got a sequel, but at the same time it isn't any wonder from an artistic perspective, similar to Batman & Robin.At the end of Batman & Robin, Barbara Wilson joins Bruce Wayne and Dick Grayson to become a trio of superheroes; because of this intellectual development, it isn't a surprise that Batman & Robin never got a sequel, because the conceptual specialness of Batman, Robin and Batgirl was too precious to actually manifest. Superman Return was the exact same reality, ending on such a conceptually exciting and emotionally uplifting note that the prospect of any sequel to Superman Returns would've been daunting to say the least. Superman Returns has its flaws, but the real heart of its brilliance is that those flaws are in fact part of the very things that make Superman Returns an infinite case of magnificence"
    },
    {
      "rating": "7",
      "text": "despite its bad dialogue, this action summer flick is splendid"
    },
    {
      "rating": "8",
      "text": "Superman Returns is the best out of any of the Superman movies, including the original and, of course, Man of Steel. Singer's adaptation of the superhero takes itself way too seriously at points, and might even go into \"so-bad-its-good\" status at times. But, you must embrace these things in order to enjoy it."
    },
    {
      "rating": "6",
      "text": "A good movie for all Superman fan's including myself. Brandon Routh tries to be to much like Christopher Reeve and don't really give his own interpretation. It lack's a deep core story and not enough action it tries to much to fit in with the reeve classical movie's. It needed that new direction different take."
    },
    {
      "rating": "6",
      "text": "Just an ok superhero movie, the running time is a bit abusive, but the good cast and some great action sequences kept me engage."
    },
    {
      "rating": "6",
      "text": "A reasonably good Superman film, Spacey is good and the visuals and music are strong but it isn't as entertaining as it should be."
    },
    {
      "rating": "3",
      "text": "This movie sucks in so many ways it's hard to believe. It literally could've ended 10 times, but no, it just kept on dragging on. Way too long and extremely boring. It'd be more exciting to spend two and a half hours watching grass grow, or paint dry, either will suffice. I gave it a 3 b/c I like superman, but damn this film blew."
    },
    {
      "rating": "4",
      "text": "Booooo.... a dour snoozefest bareft of wit or soul."
    },
    {
      "rating": "9",
      "text": "A true classic. This is what movies used to be like before they were all about special fx and explosions. It's a movie that unravels gradually and pulls you in, instead of the loud \"in your face\" variety that we're plagued with nowadays. it reminds me of the old school speilberg flicks that cared as much about character and drama as they did thrills and action. We need more like this one."
    },
    {
      "rating": "3",
      "text": "This was a shallow movie with a poor script and recycled ideas. I ABSOLUTELY cannot understand how anyone can like this movie. I realize this is Superman but HAVE MERCY the limitless cliche's were suffocating."
    },
    {
      "rating": "0",
      "text": "This was full of it!!!! It was the most boring movie that i have ever seen!!! boooooooo!!!!"
    },
    {
      "rating": "5",
      "text": "Way overrated! Lousy plot and a messy portrayal of Lois Lane by Bosworth. i'd pick X3 over this one anytime."
    },
    {
      "rating": "5",
      "text": "Its heart is in the right place, but overall it's drawn out overkill."
    },
    {
      "rating": "3",
      "text": "If you read the comments of the critics its quite obvious that they are all a bunch of idiots. any one who calls this film \"superb\" is retarded. superman 1 and 2 are still etched in peoples minds. SR however is one of the most forgettable movies of all time. some scenes were okay, So? I also hate the fact that each time we saw superman fly, it was a fake superman, as in, it was a digital reproduction, not the actual actor. I therefore could not connect with superman at all. i connected with chris reeves, because it was him doing the flying and he did it beautifuly. bottom line...they messed up...big time!"
    },
    {
      "rating": "3",
      "text": "Very boring... I kept watching hoping to see a big action scene and it never comes. Its a long boring movie."
    },
    {
      "rating": "4",
      "text": "when i think of this film one word comes to mind... boring... we've had 4 superman movies done before this and they all had lex luthor as the main villian . i think its time to move on to some one new . the whole brains vs brawn thing has worn out its stay. why not give superman a real villian who has some power like doomsday. the visual effects are nice and the new guy taking the role of superman doesnt do to bad of a job . its just that the film never feels like it goes any where fun or interesting. if you want to see a good superman movie go see the original first 2 films with reeve."
    },
    {
      "rating": "9",
      "text": "Despite its flaws, this is without a doubt the best Superman movie. Sure, it could have used more action and less dialogue, but I enjoyed this movie the whole two and a half hours I was sitting there watching it. Oh, and one more thing... Brandon Routh IS Superman. I'm glad Zack Snyder is taking over, but Routh needs to return as Superman. He deserves it."
    },
    {
      "rating": "2",
      "text": "Superman returns with bad acting,a bad story,and bad charachters. The movie has only one reedeming quality and that is it its stunning visuals,that is the only reason I did not give it a zero. The story is really boring. Not even comic books fans will enjoy this story. The movie has horrible acing and horrible everything else. Now that I am done (I know this is short) but this movie sucks and you should not see it."
    },
    {
      "rating": "9",
      "text": "Why the hate for this movie? I have returned to this question having just been to see Zach Snyder's Independence Day meets Matrix Revolutions version of Superman and i just can't understand it. In a film landscape dominated by reboots, Bryan Singer attempted to produce a film that would fit seamlessly with two films made over 20 years earlier. And you know what? It bloody worked."
    },
    {
      "rating": "9",
      "text": "This is one great movie. The story and acting coexisted perfectly. One of my favorites of the Superman movies. Brandon Routh portrayed Clark Kent/Superman pretty well. Definitely worth the watch!"
    },
    {
      "rating": "4",
      "text": "Superman Returns has the right elements for a good Superman movie. It has big, epic-sized effects, a story about the more human portions of Superman, and more than enough drama to keep brainless superhero pieces of shlock on the floor (I'm looking at you Wolverine). That said, to be a drama is not enough. It must be a competent drama. I could go on about how Lex Luthor's plan makes no sense, or about the odd decision to give Superman a child, but I like to think that picking at individual aspects isn't as important as the overall tone. Plenty of superhero movies have gotten away with questionable fine details because they had the right tone and pacing hold interest and entertain (X-Men and Spider-Man immediately come to mind). The feel of Superman Returns is just all wrong. The film truly is dull, in every aspect."
    },
    {
      "rating": "9",
      "text": "Once again, another supremely underrated comic book flick. The casting wasn't as good as the originals, but I thought that Brandon Routh, Kate Bosworth and Kevin Spacey did fine in their roles. The effects are astounding and add more believable moments to the film. Plus, this was an original story line, its not like they revisited the origin story again."
    },
    {
      "rating": "0",
      "text": "boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooorrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrriiiiiiiiiiiiiiiiiiiiiiiiiiiiinnnnnnnnngggg.that is all i got to say about this movie.this is not superman.this is a guy that protend that he is superman.and cant even give one punch to a dude.horrible.dissapointment,but if you want to see a good superman movie go to see man of steel.in the begining there is just talking,but belive me you will never forget the awsomeness of man of steel.for the end this movie is terrible,go see man of steel"
    },
    {
      "rating": "5",
      "text": "Não sou contra esse filme porém não  grande coisa"
    }
  ]
}