{"id": 3554, "title": "Superman II", "starring": ["Gene Hackman", "Christopher Reeve"], "runtime": 127, "genre": ["Science Fiction", "Action", "Adventure"], "description": "Three escaped criminals from the planet Krypton test the Man of Steel's mettle. Led by General Zod, the Kryptonians take control of the White House and partner with Lex Luthor to destroy Superman and rule the world. But Superman, who attempts to make himself human in order to get closer to Lois, realizes he has a responsibility to save the planet.", "releaseYear": "1980", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/jw0tYFCbzjBN8SIhvRC2kdh7pzh.jpg", "categories": {"plot": 7.125, "acting": 5.0, "ending": 10.0, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 8.0, "action": 7.1}, "reviews": [{"rating": "9", "text": "No, I do not think that this movie is the best Superhero movie of all time.  However, I do think that this is a very good movie.  This movie was made back in a time when people thought superheroes were more romantic and silly than anything else (if you want another movie like that, all three of Sam Raimi's Spider-Man movies).  This movie is a perfect movie that shows what superheroes were like during that era.  I believe that the main reason a lot of people do not like this film as much as they used too is merely because this is the era of more grown up superhero movies (Christopher Nolan's Batman movies) which are much darker.  Superman II is definitely the perfect movie for romantic superhero fans.  It is very charismatic and heroic at the same time.  It has a simple plot with villains threatening to take over the world, but the hero always triumphs in the end, and also gets the girl.  While this plot is simple, so were the original Spider-Man movies which came out much later.  Probably my only real complaint about this movie is that even though the romantic hero plot was good for the time, it is a little outdated now, as more grown up superhero movies have been released.  I still think that this a great movie nonetheless."}, {"rating": "7", "text": "Although the original Superman will always be the strongest in my eyes, I still really quite enjoyed this film. With a montage to start the film off, just in case you have forgotten anything from the previous film, but this film is simply just fun, and the most entertaining thing for me was watch Lois lane and Superman play off each other and see how their relationship developed.\r That and General Zod of course, who is a truly great villain played by the one and only Terence Stamp. I will be interested to see Michael Shannon's take of the character in Man of steel... Had to mention it at some point. It's a Superman review.\r And it is Superman week. Lets face it.\r The main problem I had with the film is that I felt that there were some bits that felt too placed, and could have been cut out completely. The film does seem to drag in the middle a little bit which could arguably be down to the troubled production, with a switch of director in the middle of production from Richard Donner to Richard Lester. This resulted in a problem with the tone of the film, as Donner wanted a dark film while Lester tried to add in a lot of slapstick- which to be honest were the bits that dragged the film down- what I would call the silly parts, when the film suddenly becomes a cartoon for a few minutes.\r I will be interested to see Richard Donner's cut.\r I enjoyed Superman 2, although it doesn't have the same magic of the first one it is still a great superhero film."}, {"rating": "9", "text": "Although this was even more cheesy than the first Superman, it still has a great amount of cool that made this movie a decent sequel. This will always be my favorite Superman sequel, ever."}, {"rating": "9", "text": "'Superman II' is an incredible sequel, filled with everything you loved about the first movie, and takes it to a tight story with some incredibly paced work and an overall, satisfying installment to the \"Superman\" franchise. Clark Kent (Christopher Reeve) is back, and must now face his toughest enemy yet, General Zod (Terrence Stamp), while Lois Lane (Margot Kidder) thinks that she might be closer to the identity of Superman than she thinks. Overall, 'Superman II' is still a visually stunning sequel, with a great story wrapped in there, the execution may be clunky in a few places, but you will have fun with it."}, {"rating": "7", "text": "Well, to (hopefully) clear a few things up a) Metacritic \"weighs\" some reviews to count for more than others. I don't necessarily agree with it but it's the fact of things. b) There are a lot of movies that exist here that didn't make the all time highest scores despite their 99's or similar scores (The Seven Samurai, Fanny And Alexander, Modern Times) For a long time Superman II was one of them, I'm not sure what happened. But to the movie itself, it's not bad. Easily inferior to the first IMO, but I guess I could see why other people would think it's better."}, {"rating": "10", "text": "Incredible!!!!"}, {"rating": "10", "text": "This loud goofy campy fun, see it."}, {"rating": "10", "text": "Great movie. One of the best of the \"modern\" superhero movies. Released in 1980 you can see the effect of this movie on newer releases such as Spiderman II and even The Dark Knight. I enjoyed Superman Returns, but not nearly as good as Superman II or even the original."}, {"rating": "10", "text": "Superman II is every bit as good as the first, and even possibly better. When it comes to stories in superhero movies, this is about as good as it gets."}, {"rating": "9", "text": "My favorite of the Superman movies. I don't know how on Earth this film got a 5.8 User Score. This was also the most interesting, as Superman finally had someone who could really challenge him and he doesn't always emerge victorious. This film also explores Clark's and Lois' relationship much more than in the first film, which proves to me that its an improvement."}, {"rating": "10", "text": "This movie wipes the floor with the first. In every way. Given that these movies are upwards of 40 years old now, we can forgive the aging of the effects, surely. Doesn’t take a genius to realise that technology was limited in 1980. However, this film manages to be dazzling all the same, and does not deserve this user score. It’s a 10, and I hope my 10 drags the score up a little. Far better than the first. Far far far better. Pacing is perfect, no boring parts like the first one. Just so much better than the first. Better better better."}, {"rating": "8", "text": "Featuring still decent effects for its time, soul-filled humor, and a story that shows tremendous heart, this sequel is an exciting and faithful follow-up to the phenomenal original."}, {"rating": "8", "text": "Superman's back and this time he's had it. Actually in all seriousness this is the best of the Reeve Superman films as he battles his own kind and has to defend the planet he calls home."}, {"rating": "10", "text": "The best out of the QUADRILOGY LOVED IT SOO MUCH!!! Great Cast, Great Bad guy, Great Lines, Great super AND A GREAT DIRECTOR!!!!!!!!!!!!!!!!!!!!!!!!!! RICHARD DONNER DID  IT AGAIN!!!"}, {"rating": "9", "text": "Much better than the pointless, dim-witted named as \"Man of Steel\". Just when you thought the classic was already enough, studio Warner Bros. brings another well-paced, stylish and nicely acted flick."}, {"rating": "9", "text": "More villains and more action than before create a better and more exciting film, though at times like its predecessor, Reeves performance as the Man of Steel as well as Terrance Stamp's Zod cause Superman II to nearly top the original."}, {"rating": "10", "text": "A trio of Krypton villains threaten havoc on Earth, while Superman and Lois Lane are just becoming involved in a long awaited love affair -- an affair which may cost Superman his super powers."}, {"rating": "10", "text": "Just like the first film, Superman II is one of the greatest movie ever! The best fight scene between the Man of Steel and the three Kryptonian criminals including General Zod is quite a tremendous battle and he is one bad-ass villain for this movie.Same script made by Mario Puzo(who previously worked on the Godfather trilogy) and as for Lex Luthor  now a supporting role he is even more comical than the first film."}, {"rating": "10", "text": "Superman 2 is a rare sequel that improves upon the original the action for its time is very solid the characters are great and is easily one of the most fun and entertaining superhero films to watch."}, {"rating": "4", "text": "Overated, only top 100 because there's only 6 positive reviews. If there were at least 20, then it would even things out a bit."}, {"rating": "6", "text": "Overrated, the only reason metacritic gave it a swell review was because there were only 7 critics to average from."}, {"rating": "10", "text": "Loved it!"}, {"rating": "7", "text": "\"Superman 2\" is definitely overrated by critics. However, it still stands out as a comic ovation and appeals heartfully to the audience."}, {"rating": "10", "text": "Although Superman II had it's outlandish moments, the overall production of Lesters take on the DC comic series is phenomenal. Where this film excels is in it's direction--combining an amazing script with the momentum of the plot leave the viewer in anticipation for the climax without over analysis or explanation."}, {"rating": "10", "text": "It's unlikely you haven't seen this movie yet, but if you have, don't trust the naysayers who have previously posted reviews. Sure, the Donner version may be the more interesting, but \"Superman 2\" as it was originally release is terrific entertainment, among the most memorable of all the action pictures I saw as a kid, and fully deserving of its high Metacritic score."}, {"rating": "10", "text": "this film is incredibly underrated. like wow only 6.7? it's better than the first one"}, {"rating": "3", "text": "Just the thought of this film being above the Godfather part1 and 2 is unbelievably angers me.We have two masterpieces and many more(like LOTR and Patton) being rated lower than this cheesy action flick.I don't think it should even be included in the High Scores list because there are just 7 reviews."}, {"rating": "10", "text": "This is best Superman movie ever made, period."}, {"rating": "10", "text": "Yes it's camp, yes it's dated, but it is F__cking awesome."}, {"rating": "8", "text": "It can be campy but it's fun and original, exploring a fallible side of Superman through his decision to rid himself of his powers for Lois Lane.  Zod, of course, is classic. It's a shame Donner couldn't finish his version, but I feel Lester did a fine job finishing the project."}, {"rating": "8", "text": "liked this one a lot, in my opinion it was probably even better than the first one. One of the biggest reasons would probably be the villains. They are a physical match for superman so they pose more of a threat than lex luthers so called intelligence. Since supermans new villains can fly there is one really good scene of them battling it out and throwing large objects at each other and fighting while flying. The dated special effects add a cheese factor but its really fun to watch. There is also a very cool scene on the moon that felt very sci-fi like, this was a great scene i thought looked very cool. These two things were in my opinion better than anything that happened in the origonal. On the negative side though there was some pretty stupid plot elements that might be hard for some people to look passed, i personally just laughed and shrugged it off. One thing i found funny was how supermans mom tells him he can turn into a human but will never be able to regain his old powers and then he easilly gets his powers back using the green crystal, that was ridiculous, also lex luthers escape from jail in a hot air balloon was silly. Overall superman 2 is a cheesy good time i found more entertaining than the first"}, {"rating": "9", "text": "INCREDIBLE SEQUEL, Truly better than the first it ups the ante by adding General Zod and having (Once Again) Lex Luthor in the mix (played Excellently by Gene Hackman) truly a Magnificent film"}, {"rating": "5", "text": "I don't really see how this achieved a 99....and I understand what others have said about viewing the rating with respect to the 'Superhero Genre\" but I still don't buy how that should give it the 2nd highest score of all time....It is a decent movie at best..."}, {"rating": "4", "text": "This is my people dont like critics, this is a terrible movie it. it makes no logical sense, the plot is terrible and the acting is terrible. wow, there must have been a lot of blow on the table when this thing was written and twice as much when it was reviewed."}, {"rating": "1", "text": "Having just watched the Richard Donner cut, I don't get it. 99? The narrative is discombobulated, the acting is pure cheese, the bad guys are drab, the effects, script and character development were not as good as the first Superman movie. This movie's a mess and it's listed on this list of \"best ever.\" How did this mistake happen?"}, {"rating": "4", "text": "Come on! this movie not that good. I feel a sleep during it. Its got \"Ok\" moments but thats all."}, {"rating": "1", "text": "This movie is horribly overrated. Terrible."}, {"rating": "8", "text": "I seen the movie man of steel and i give 3 and a half star's that doesn't mean it is a bad movie., i like more Superman (1978) and Superman II (1980) and the soundtrack of Superman (1978)  is better."}, {"rating": "9", "text": "This film is fantastic. And even more so because it's a sequel. I think it's terrific. And I dont understand how anyone can say this is \"Unwatchable\" - have those users never seen \"Grandma's Boy\", \"Club Dread\" or \"Going Overboard\"? THEY'RE unwatchable!"}, {"rating": "4", "text": "Look, people: if you know anything about statistics, most movies should not get more then about a 7 or less than about a 3. This is NOT a great movie, and I agree that the score it receives from metacritic is skewed by too few reviews, and it also seems to be the case that some viewers here are responding with fake responses to inflate the numbers... one word responses like \"Incredible!!!!\" are useless."}, {"rating": "2", "text": "Christopher Reeve died and that's sad, but let's not pretend for a moment that he was anything more than a soap-opera calibre actor. The most important thing he ever did in his life was fall off a horse. I lined up around the block for hours to see this movie when I was a kid. It hasn't withstood the test of time and I'm not sure that it was even good when it was made."}, {"rating": "4", "text": "Ok, I don't get it. I came to Metacritic to get good subjective reviews on films I may wish to see. Major flaw here, either with reviews, American critics, or general scoring method. Someone going to fix it? Or do I have to go search specific critics who are intelligent?"}, {"rating": "0", "text": "Two words: Richard Donner. I used to think this was the best Superman movie ever and one of the best movies period.....that is until I learned of the entire back story to Richard Donner's 'dismissal' from the project. I can't wait to se 'The Richard Donner Cut' of Superman II and say that his version should be held as the official version."}, {"rating": "0", "text": "If there could be one reason why Metacritic is so unpopular than it is this- they lie. This movie, when you average the mere 7 reviews receives only a 91. And, in addition to that, it is not ever a great movie. It cannot be placed so high by such a biased website. What a terrible thing!"}, {"rating": "3", "text": "The only thing to say here is this IS NOT the 2nd best film of all time."}, {"rating": "7", "text": "The 99 score is ridiculous. If you call a 5 average, this film is a little above, so I think a 7 is fair. So, this ranks higher than LOTR, Star Wars, Raiders of the Lost Ark, etc etc......ridiculous."}, {"rating": "0", "text": "This just blows. A huge letdown. And 99/100!!! You have to be kidding me. The affects are cheesy, and tries to be a classic, but totally is not."}, {"rating": "10", "text": "Still the greatest Superman movie ever made, and still one of the greatest super hero movies ever made."}, {"rating": "3", "text": "I can't believe what a high rating this movie has. It's enjoyable, nostalgic cheese, but it's still cheese. The script is ham-handed, and the actors uniformly bludgeon them to death with overacting. Many sets appear to have been made with leftover props from high school dances. Folks, this is the sort of pompously inept movie that Mystery Science Theater thrived on."}, {"rating": "2", "text": "I'm giving this movie a 2 because I like the idea of it.  The actual implementation has much to be desired.  The special effects are awful in context with the times.  The fight scenes are laughable.  Watching equally strong (invincible) superbeings fight is much more boring than watching a regular street fight.  It always amazes me that Hollywood could never put together a great Superman movie. The original Superman movie was decent but fell apart in the second half.  This movie is dumb from start to finish."}], "recommendations": ["green_lantern", "terminator_genisys", "aquaman", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "venom_let_there_be_carnage", "hercules", "justice_league", "superman", "john_carter", "edge_of_tomorrow", "thor_ragnarok", "terminator_3_rise_of_the_machines", "batman_v_superman_dawn_of_justice", "i_am_legend", "percy_jackson_sea_of_monsters", "avengers_age_of_ultron", "black_panther_wakanda_forever", "the_three_musketeers", "captain_america_the_first_avenger", "shazam_fury_of_the_gods", "fantastic_four_rise_of_the_silver_surfer", "the_suicide_squad", "hancock", "underworld_rise_of_the_lycans", "rise_of_the_planet_of_the_apes"]}