{"id": 396, "title": "Super 8", "starring": ["Joel Courtney", "Elle Fanning"], "runtime": 112, "genre": ["Thriller", "Science Fiction", "Mystery"], "description": "In 1979 Ohio, several youngsters are making a zombie movie with a Super-8 camera. In the midst of filming, the friends witness a horrifying train derailment and are lucky to escape with their lives. They soon discover that the catastrophe was no accident, as a series of unexplained events and disappearances soon follows. Deputy Jackson Lamb, the father of one of the kids, searches for the terrifying truth behind the crash.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/sytFL6ALMAesKZoarlp7bIDKnns.jpg", "categories": {"plot": 7.295454545454546, "acting": 7.921052631578948, "ending": 6.476190476190476, "soundtrack": 8.5, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 10.0, "action": 8.466666666666667}, "reviews": [{"rating": "4", "text": "This is the last Spielberg movie I will go to see based on his name alone, last one before this was Indiana Jones 4 which was a total disaster. This movie starts out promising but then falls apart completely by the end. The main problem with the movie is that the monster has no purpose what-so-ever in the story and the film would have been great if it was just about the father son trying to find peace after the death of the mother in addition to the son coming of age with the girl and his friends by shooting a super 8 movie. That part of the movie is good, then the monster appears and not only destroys half of the town, but it goes one step further and destroys the film too. The monster is just stupid; it's not interesting and there's really nothing in the storyline of the monster that hasn't been done before. It's basically bits and pieces of other - better - movies that have already been released.  The movie falls apart because for almost 3/4 of the film the monster is just background noise between the scene of the boy and girl, and his friends, all of which are interesting.  Then at the end of the film these stories are abandoned completely and the monster's story - which sucks - is wrapped up in to a cgi blastoff which ends the film.\r Let's recap:\r Father and Son grieving after loss of the mother, the father is distant from his son. Climax: Father and Son hug at the end of the film. No talking about all of the previous stuff, just a hug.\r Son & Girl(friend) awkward relationship that blossoms in to...\rClimax: nothing...\r Monster & Military -  The monster is captured, tortured and then escapes but not after killing innocent people and then being helped to escape by the kids who are scared to death of it the entire film, but then suddenly decide to help it. Which escapes in a space ship which it builds out of regular everyday items from 1979 which some how selectively magnetize themselves to the watertower (never explained, it sounds ridiculous writing this out) and then can summons thousands of minature cubs in to a ship which just suddenly appears for no reason.  There is never an explanation as to how the monster suddently fixes his ship at the end. T\r Super 8 Movie - The kids are shooting this zombie film the entire god damn movie and it just becomes irrelevant at the end. You would think they would at least play the final cut during the credits or something, but no... nothing.\r Group of friends:  The entire movie the son is running around with his four friends but at the end each ot these friends gets cut from the ending, there is no closure on any of their stories."}, {"rating": "7", "text": "Closer to \"Goonies\" than to \"E.T.\".  I enjoyed this movie but in watching it, even though there is a sense of wonder and nostalgia that is generally missing in movies these days, you realize quickly how rare a talent Steven Spielberg is.  Here is what Spielberg did right and some of what is lacking in \"Super 8\".  First, the villain is not flushed out.  In E.T., the villain really isn't a villain except in the eyes of the protagonists.  \"Keys\" as he is known in E.T. believed what he was doing was for the greater good.  He longed for an experience like Elliot.  Unfortunately, he failed to see what the children saw all along, that E.T. was a living being with his own needs and desires.  In \"Super 8\", the villainous Nelec was completely two dimensional and malevolent.  The story would have been stronger had the motives been clear for his behavior and especially if his judgment was complex â"}, {"rating": "8", "text": "I'm really glad that I watched Super 8. It had a really interesting plot with surprisingly good acting by the young kids. The sci-fi mixed with horror worked well. The only real negative with the film, in my opinion, was the exaggerated Air Force. They were essentially the villains in this film and the actions of the Air Force just felt overdone and lazy. Overall though, it was definitely very entertaining, felt original and fresh, and had good acting and development."}, {"rating": "8", "text": "Though it wasn't much of a movie to watch with friends, it still had some pretty cool scenes. watching this with family though would be much more suitable as it accomplishes that sense of loss while maintaining a sense of adventure."}, {"rating": "8", "text": "Super 8 was visually stunning, well acted, and a lot of fun as well as well written for the first hour and 35 minutes or so. However, the ending was disappointing and cliche. The ending really brought down the score of the movie for me, but nonetheless, it is still a summer movie worth seeing."}, {"rating": "7", "text": "I thought this movie was incredible. Easily one of the best this year. J.J Abrams does a good job of keeping the mysterious thing hidden until the end of the movie. At the end you will understand what Spielberg had to do with the film"}, {"rating": "8", "text": "Proof that the very best monster movies aren't really about the monster, but about people. The film's more about relationships, growing up, and dealing with bereavement than about a creature's rampage through small-town America. The young cast are great, all delivering engaging, but natural performances. J J Abrams really couldn't have made it any clearer that he loves Spielberg, everything from the setting, to the cinematography and mise-en-scene could have come from late 70s/early 80s Spielberg films. Maybe you could criticise Abrams for being too Spielbergian and having few ideas of his own, but he does undoubtedly put his own mark on the film, once again demonstrating his skill as a character-focused storyteller. After the emotional first act and sensationally realised train crash, the plot does drag a little, and evil army officials seem a little too cliched to make particularly compelling antagonists (though using them does nod to E.T.) The creature itself is also not particularly memorable, but as already stated, Super 8 isn't about the monster, but about people. A very entertaining ride overall, just make sure you sit through the credits!"}, {"rating": "9", "text": "This movie is all character development. by the end of the film you are so attached to the characters you don't want the movie to end. Best summer blockbuster so far"}, {"rating": "9", "text": "This movie was perfect till the end. A glowing front story accompanied by a compelling back story. It was well acted, well filmed, well casted, and the script was flawless. It is 100% worth seeing, and expect a solid conclusion, even if it is lacking."}, {"rating": "8", "text": "I cannot tell if this film is a beautiful homage to the films of Spielberg or a film that stands on its on, a fully original entity which could stand up to Spielberg's films in a fight for the top spot. On the one hand, Super 8 (Directed by JJ Abrams) is so engrossing as a window into a mourning town but it also tells a thrilling coming of age tale because of its extremely talented group of actors. Elle Fanning's character is like an onion, with so many layers to her character helping the viewer to feel with her, that when you are finished peeling you are crying like a baby.  Sure there is a science fiction element that harks back to Spielberg but its execution is to embrace what made those films so imaginative and use it to improve the experience, embracing the sense of wonder that Spielberg film did. The ending is the major payoff with a beautiful finale with an awe inspiring set piece, rousing music and a great sense of forgiveness and amazement."}, {"rating": "9", "text": "There are moments of genius, spectacle and visually stunning set pieces that deserve nothing but admiration for the scope and vision of J.J. Abrams in his highly secretive 'Super 8', a film that has flashes of of the science fiction favourites we came to love, E.T. being the one that comes to mind. Its a homage of sorts that messes with the things that go bump in the night scenario, but adds in a pack of excellent performances from a child cast that push the film to be character-driven piece, where the actors make the film. Joel Courtney makes a commanding debut as the young kid Joel, who helps his friends film near a train station, where they witness a massive train crash which isn't everything it seems to be.\rAs the rest of their town suffer the repercussions of this irregular crash, Joel and his friends wonder what exactly happened and why the strange anomalies that occur afterwards are in place. From start to finish its clear the eye that Abrams has for detail and awe, his nostalgic bows to the Spielberg era of science-fiction aren't subtle, with various nods here and their to plot devices used in the past by Spielberg, such similarities that lead to an ending which feels very forced and typical to suit those who remember those films of the past, while there is emotional depth to the final moments, it just happened too quickly.\rThe redeeming feature of the extra-terrestrial adventure is the \"precious cargo\" itself, something we rarely see throughout the film, but we have the feeling it is there, through clever uses of editing and the panic on its unfortunate victims. The train mentioned earlier is one of the best highlights and most impressive feats of the film, with an added dose of miraculous explosions to pay homage to the films of yesteryear. But these feats couldn't be truly accomplished with the impressive turns of the relatively young cast, who show true quality and bring real depth and charisma to their performances, much like The Goonies, they have their own traits and personalities that contribute towards their group.\rA masterful piece of filmmaking that takes off running but ultimately begins to unravel as the closing moments are rushed and forced to be accepted, but excellent performances and some stunning visuals make Super 8 and unmissable and nostalgic trip."}, {"rating": "9", "text": "Full of wonder, excitement, feeling, tension, first love, doing the right thing, opposing our parents and everything that goes with the imagination we had as children. It's great to see that some adults still have it and can share it with us. Thanks team!"}, {"rating": "7", "text": "While nothing about the film really sticks out, It's a rather solid movie overall and I enjoyed watching it. The story was interesting and the acting was solid as well. I think lack of memorable scenes and a lackluster ending hurt the overall value of the film quite a bit. Still, It's worth checking out."}, {"rating": "10", "text": "Super 8 is brilliant, it's just so good! How could anyone not like it, it's got a spectacular, interesting and thought out well plot, good acting, good character building, cool and different aliens and really exciting and tense action sequences. Why have so many people given this movie a five or lower, I just don't get it. It's very original and it's very clever and well made. I truly recommend this film to you if you haven't seen it already. I had a choice out of getting transformers: dark of the moon on DVD or this, and I chose this, what a wise choice I made."}, {"rating": "10", "text": "The best movie Steven Spielberg has made since \"Jurassic Park\".  Super 8 was an amazing adventure with a revolutionary plot, great action, and some really good characters, even if they are children. Super 8 was a great adventure, like \"ET\" mixed with \"Alien\"."}, {"rating": "9", "text": "Fantastic movie following a group of kids making a movie that gets interrupted when a train crashes in their town carrying some rather suspicious cargo. The young talented cast are all great but its the creative idea and two brilliant minds (Abrams & Spielberg) put together that make this an amazing film. The train crash scene alone is just spectacular but the final few scenes are also just amazing. Overall a stand-out film from 2011 and one of my favourites for this genre."}, {"rating": "9", "text": "A great sci-fi film mixed with a great coming of age adventure.  With J.J. Abrams and Steven Spielberg together you should expect a film with adventure, amazement, and strong emotion and that is exactly what we get."}, {"rating": "5", "text": "Whilst appreciating this is a homage to the good ol' days of cinema, and that the lack of originality to the plot is somewhat intentional, I do feel that it stops the film from breaking the mediocre barrier. The end scene just tarnishes my opinion further and just annoyed me. Plot holes and annoying dialogue adding fuel to the fire. At the end I was just a simmering pot of disappointment. Definitely a let down."}, {"rating": "8", "text": "A monster movie that focuses more on character development than hammering the audience with visual spectacle. J.J. Abrams has taken great care into building a teen angst story that you can empathize with. Yes, it's a tribute to the Spielberg films of old, but it works on its own as an engaging and heartwarming tale of forgiveness. It's an imaginative tale that will delight your inner child."}, {"rating": "4", "text": "Super 8 is one of those movies that seem very promising at the beginning and are a total disappointment at the end. The start of the plot is very attractive and has a mysterious aura that surrounds it; and this feeling of understanding nothing gives the movie an expressionist atmosphere. So is a challenge to solve the problem and connect all the clues. Among the details are reveled, you start perceiving a huge conflict that involves the humankind, worthy of the greatest masters of cinema. This wide situation never stops caring about little human issues; in Super 8 the children are anxious to create a short film, no mattering what they have to do and when the accident occur they take it as a production value, totally delightful.All of the above suggest an epic ending, but there was no way that J.J. Abrams could have done it worst. This finale is like the queen of cheap sentimentalism, with a weak screenplay, poor performances and an awful direction; this is an ultimate piece of crap."}, {"rating": "10", "text": "Original. Superb acting (and yes, they're just kids!)  - but this adult has nothing but admiration for the casting, pacing, direction, and whatever else goes with film making - yes, \"super 8\"!  I'm not sure why some are trying to compare this with \"ET\"? This adult (ok old man), thinks this is more along the lines of \"Goonies\" - yes, that other classic, sprinkled with more thrill/suspense.  Excellent mix of action and comedy - never cheesy nor \"forced\" - something most more \"mature\" films should learn how to do - I think we've all suffered through one or two lines in some movie that just try \"too hard\".Unsure what the \"kid meter\" for this film is. It should be great for the entire family - but again, this is not \"ET\" - it has more suspense and action in it and the underlying theme isn't as \"wholesome\"."}, {"rating": "10", "text": "A simple perfect summer movie with a very interesting story. Suitable for all age groups go for it. The main thing is its theme like 70's retro classic movie. Simply superb."}, {"rating": "10", "text": "Amazing movie! A big heart classic sci-fi monster thriller!Well, think Et meets Goonies meets Close Encounter meets Stand by me meets Jaws... As references, of course!And Abrams and Spielberg uses these references as the veins from this body, but the body have tremendous and unique heart of its own!Must see of the summer and many summers!"}, {"rating": "10", "text": "I was very disappointed, Expected much more from Spielberg/Abrams. Lots of  contrived suspense with very little pay-off. There is simply no emotional investment in the \"character\" at the end. If you need one character to TELL you how another character or creature thinks/feels (\"when I touched it\") it's because the script is poor and you didn't make the viewer care!  Rent ET and save the money. At the very least, rent it later."}, {"rating": "8", "text": "There are some plot-holes, cheesy parts, and over-dramatic scenes.  But overall, Super 8 was a pretty good movie.  I recommend seeing it."}, {"rating": "10", "text": "Really, Steven Spielberg, what were you thinking?  This movie reminded me of a nightmare I had as a child.  I was running from death and I would wake up in a cold sweat every time.  To have these children running from death in the entire movie was a little much.  And the train wreck.  It wasn't just a train wreck.  It was a colossal train wreck.  That part I liked. But what I am angry about is the last scene where tthe alien is gathering all the metal to reconstruct.  To take the child's only remembrance of his mother.  I thought that was extremely selfish of the alien.  Yes all the microwaves, all the bikes, all the scrap metal, but no, not the necklace!  Really!"}, {"rating": "10", "text": "An outstanding and nostalgic piece of art.  This film surely  is the perfect merging of emotional appeal, suspense, a great history and amazing action."}, {"rating": "10", "text": "Super 8 is exactly what you would want in a summer sci-fi action film. The casting and acting is top notch and the special effects are unbelievable! Without spoiling anything I will tell you that the plot  is rich with many twists and turns while following a very believable yet fantastic story line. The early 80's were recreated so well in the towns and homes of a small Ohio town. You really start to believe in the recreation of the time period which pulls you further into the story. Great story, acting, casting and special effects. What more could we ask for? This is what this movie genre has been been missing for some time now. GO SEE IT!"}, {"rating": "8", "text": "Super 8 was a surprisingly delightful movie. Judging by the teasers I was really not interested in it at all but with names like Steven Spielberg and J.J. Abrams being branded on every trailer and poster I simply had to give it a shot. And I was really glad I did because it was very very good. It was really a tribute to the movies of the late 20th century wasn't it? It had all the elements of Spielberg's classic E.T. with a close group of friends on bicycles riding about town shooting scenes for a movie with \"production value\", adults who seem to be one step behind the kids on the whole mystery, the government intervention and of course an extraterrestrial being \"trying to go home\". The special effects were great, especially the train crash. Very breathtaking stuff. But even with all the amazing effects and all the action going around, we never really forget the emotional side of it all, Abrams never let's the action upstage the human aspect of the story. Joe who recently lost his mother to a violent tragedy lives with his grief-stricken, depressed and distant father begins to bond with Alice in an 8mm film production of zombies, she herself has father issues. Their relationship reminds me a bit of Abby and Owen in Let Me In united by their own little tragedies, finding solace in each other. Elle Fanning and Joel Courtney play their roles exceptionally well, amazing since it's their first time in a major movie. It was really refreshing to finally watch a movie which was not rushed through production (yeah I'm looking at you X-Men), very carefully thought out and which really took it's own time to tell the story that it wants to tell. I wasn't born in the 60s or 70s but watching Super 8 made me feel like I was in that period of time of filmmaking, it felt very authentic. The closing credits was awesome."}, {"rating": "8", "text": "The word that kept floating to the surface as I was driving home from the theater was authentic.  I'd probably score the basic story and plot framework a \"7\", but the movie does such an incredible job bringing me back to the late 70's, and the kids are so spot-on perfect in their roles, that it became an easy 8, almost a 9. Most kids in movies are nothing like the kids I knew when I was young, but Abrams (and the casting director) nailed them in Super 8.  Yes, it has that E.T./Goonies irreverent feel to it, but without these kids, the movie falls apart. Kyle Chandler, Ron Eldard, and the other adults are also extremely well-cast.  Chandler - the acting Sheriff - is a tough father still grappling with the loss of his wife (who is also amazing in a brief snippet), and Abrams doesn't soft-shoe his relationship with his son.  Elle Fanning is terrific - a star in the making.  It's only the basic story that is the weak part of the film - and that may sound more damning than I mean it to me.  As soon as I heard ELO's \"Don't Bring Me Down\" (embarrassingly my favorite song for like 3 years of my youth) open the film, I was transported back to that time and place, and it just worked. Don't want to spoil anything further - it's worth seeing. Considering that my midnight show was only half-full, I'm skeptical that it'll have a huge opening weekend. I'm just hoping that some of the Potter/Twilight/Hunger Games kids will turn out for it - though the pre-cellphone, net, ipod days of the late 70s might be tough to relate to."}, {"rating": "10", "text": "This film has more heart than any film could ever wish for. J.J. Abrams has proved yet again why he is the next Spielberg. You won't see another movie like this in a very long time, a film like this with a story so well structured should be praised forever."}, {"rating": "10", "text": "Awesome!Best movie of the year!!!Truly a heart pounded sci-fi coming of age adventure!Why they don't make more movies like this???Must SEE!!!!"}, {"rating": "10", "text": "150 Characters???Ok!Super 8 is a blast of a film!Imagine a combination of all the best ingredients that you love and them put them in a blender. Mix it up and you will have Super 8!It is clever, imaginative, loving, very well acted and the most important, it os an intelligent movie. It doesn't give you all the answers, you need to think a little bit.But must of all, the movie make you feel like a kid again. For 2 hours you believe that you are in a more nicer world! This movies has a heart!!!Best movie of the year!!!"}, {"rating": "10", "text": "Super 8 was probably my most anticipated movie of the summer, and it didn't dissapoint one bit. Super 8 is simply.....amazing. Like many people, I grew up with classic Spielberg movies, so having that nostalgia come back was a great feeling. JJ Abrams is one of the best directors out there right now. He does a phenomal job with the action and visuals, but knows to push those in the the background so the characters, story, and emotion are the main focus. Surprisingly, the kids were my favorite part of the movie. They were great, funny, and did a great job with the emotional scenes. My favorites would have to be Joel Courtney and Elle Fanning. The suspense JJ Abrams creates, especially in the last 1/2 hour, is so intense to the point where I could've had a heart attack. Lastly, the characters are so well developed and the whole movie is very touching. So overall, Super 8 is my favorite movie of the year, so great, if you haven't, see it right now."}, {"rating": "10", "text": "I loved this movie. It was emotional, it was funny, and over all it was just fun. I walked out of this theater with a revived sense of hope that movies can be as great as they were 25 years ago. Where Indiana Jones 4 fell short, Super 8 thrived. It combined modern special effects with the writing style of Steven Spielberg in his prime."}, {"rating": "10", "text": "Like many people, I walked into the theater not really knowing what to expect, except I knew it would have something to do with an epic train crash. Well, let's just say the train crash wasn't the only epic thing in the movie. The young actors did a splendid job, the story is exciting, and there's never a dull moment. I don't know why people say this movie reminds them of E.T; I don't recall any devouring of human flesh in that movie. It reminded me of a mix between Stand by Me and Close Encounters of the Third Kind. Here's a tip: be sure to sit through the credits."}, {"rating": "10", "text": "This is one of only 3 movies that wasn't a total disaster, the other 2 being X-Men and Green Lantern. This is the most human. The child actors here do a better job than most seasoned adults. They bring a since of wonder, amazement and humor to a monster film. This movie is Goonies meets E.T. both are great films but now this will stand the test of time to show it is another classic. The adventure story is great and is visually fantastic but it is the human story of a boy who lost his mother that makes this movie worth watching. The thrills, and laughs never end, it is just fantastic."}, {"rating": "7", "text": "\"Super 8\", a film directed by the infamous J.J Abrams, is a surprisingly well made film; its a film pure of innocence and maturity fused together, like Spielberg did in the 80's. However Mr. Abrams, you directed the wrong movie at a awkward era; a era where we fight and despise each other with curses and swearings. 80's movies are appropriate movies, and the 21st century movies are appropriate for the 21st century. Next time Mr. Abrams when you choose a movie to copy+paste into yours, make it something that is not Spielberg's. His work and recognition is better left in the 80's untouched."}, {"rating": "10", "text": "Super 8 was very awesome and one of the best summer blockbuster films of the year. Spielberg and Abrams work very perspective in th way that Steven Spielberg made other films that connect into alien invasion and the atmosphere of every terrestrial scenery at the same time. It has great acting, great scenes, great explosions, great chills, great people, great thrills, great music, and great cinematography. That's what we expected to see that some other movies take time that it gets too overrated too much, but I can honestly say that for me was fantastic that it doesn't get too boredem to watch and happy to see it again. Well done for JJ Abram's film that brings a good idea and thanks to Spielberg to bring back some memories that we've seen his films that gets too exciting."}, {"rating": "10", "text": "I went to see super 8 on it's release, and I have been waiting for this movie for months. May I say super 8 was worth the wait. It was the best movie I ever seen in years. I can't wait to see it again"}, {"rating": "10", "text": "Check out my video review here: http://youtu.be/Yrt82fDRCA0 With dazzling special effects and set design this is more then just a monster flick. It is the greatest monster flick ever! A picture perfect period piece and not too much alien this film will satisfy any audience member who watches it. It's and better, more advanced, twenty-first century telling of E.T. (With a little more fright and a little less family fun)"}, {"rating": "10", "text": "I'm not sure how a person could dislike this film...or even not fall in love with it. Not only does it allude to the sci-fi films of the 80's, it reinvents the genre! JJ Abrams is a genius. He was when he wrote the score for Michael Bay's ONLY good film. (Armageddon) He is now that he's writing and directing his own movies. The music, the writing, the acting, the atmosphere, the camera work, the special effects, the...I can't express how good this film is! It outshines every sci-fi movie I've seen in the past few years. It is so incredibly human that it's scary. Just when you think the film is wrapping up...it teaches you a lesson. I can't recommend it enough! It's something you and those around you can really sink into. Few movies are as memorable as Super 8."}, {"rating": "3", "text": "It's no wonder that I walked into the movie theater to see Super 8 with nothing but optimism. J. J. Abrams has created some fantastic films, so it only added to my disappointment when I walked out of the theater unimpressed. I felt like they chose unknown actors specifically to suspend reality in the film. Unfortunately, the actual effect was poorly acted secondary characters that I felt no compassion towards, or even really cared about. While the main characters seemed to be well thought out and acted, most of the other characters were just plain underwhelming. Certain elements of the story seemed completely unnecessary, such as the white cubes, the rivalry between the fathers, and the protagonist's mother's locket. The whole movie seemed to be a simple way to show off that trademark J. J. Abrams cinematography, and not character of plot driven at all. This movie is good for anyone who wants a shiny version of E.T."}, {"rating": "10", "text": "If you haven't seen Goonies, Close Encounters of the Third Kind, or any CG monster movie you will like this movie. If you have seen any of those you will know it is a 2nd rate retread of those movies; down it the characters, the editing, the lighting. What is so surprizing is that there is so little original in this movie. It was almost as if they needed another product to get out the door until the real movie they want to do is ready for production. There were times I seriously considered getting up and walking out because it became just too slow, draggy, and predictable."}, {"rating": "9", "text": "Sci-fi Alien flicks never really went out of style. But the grew into more of an action( End of the world) type genre. What super 8 does is steer away from that. Its an all around great film, the acting is on point, the FX are some of the best I've seen, the music etc.. Abrams took a big risk making the kids lead roles for a film like this. But the risk pulls off, the kids are super talented and make you feel like you're watching a new modern day version of E.T. Bottom line if you can only watch one movie this summer, make it this."}, {"rating": "1", "text": "Unengaging from start to finish. The human drama aspect of this film is a broad-strokes schmaltzy portrait of childhood and reconciliation in suburban 70's America. The most annoying thing about this is the plucky/bratty kids in the main roles. It's really difficult to feel anything for aspiring film-makers/actors (filming on Super-8 film, duh), especially the chubby kid who keeps harping on about \"production values\". Please, kids, go fishing, camping, paint a picture, just do stuff kids do, please. Of course the main kid is just dull enough to be the lead. The sci-fi aspect is dull too -  and the big bad that's wrecking everything is revealed in predictable fashion - \"oh look, it's in the background but out of focus so we still don't know what it is!\". In essence, ET multiplied by Lost plus Stand By Me minus any charm, suspense or thrills you might find in a half decent film. Don't waste your time."}, {"rating": "5", "text": "OK I was all hyped up to go see this only to be let down. It was slow from the beginning than the train wreck. This movie reminded me of E.T. with the ending and all. Not to original. A lot of cursing by the kids which in my opinion was unnecessary. I thought the X-Men movie was waaaay better. Not very original. Don't was your money on this one, wait for it on DVD. I have no idea what the critics were talking about."}, {"rating": "9", "text": "Two years ago, J.J. Abrams gave us the breathtaking film, Star Trek. Two years later, Abrams gives us the best original film in a long time. The acting in this film is brilliant, especially the kids! The story in this film is very simple and put together well. The visuals in this film were stunning and the direction this film went in was very well done. This is the best movie of 2011 thus far as of June 12th, 2011."}, {"rating": "10", "text": "Not quite sure why everyone on here has to be so cynical. No one on here is a professional film critic, so lets lose the film school jargon and keep it simple.This is a fun movie. It has all the magic Steven Spielberg's old movies had. I honestly felt like I was 10 again, watching E.T., or the Goonies. Definitely worth the ten dollars I spent to see it."}, {"rating": "9", "text": "I love the pretentious punks who say this movie is trying to be like E.T. Similarities? Yes, I think the themes are similar, but this movie has it's own things about it that make it unique and completely different than everything else that is being made right now. It was very well written, shot, and directed. J.J. Abrams did a great job here. The casting was great, each child actor was charming in their own way. Yeah, it can appeal to a younger audience, but it also appeals to the older ones as well. Makes them reminisce their childhood. Not from the aspect of aliens and such, but the imagination that they once had as a child, and how things felt so simple. How they coped with a loss of a family member, or anything important to them. This movie is a metaphor and should be looked at that way. Although, if you don't feel like thinking, sit back, enjoy the story and the CGI. A great movie and definitely going to be a top 10 for summer movies this year."}], "recommendations": ["bumblebee", "tomorrowland", "avengers_age_of_ultron", "incredibles_2", "9", "edge_of_tomorrow", "a_quiet_place_part_ii", "the_5th_wave", "inception", "the_13th_warrior", "how_to_train_your_dragon_2", "hanna", "the_kid_who_would_be_king", "pan", "hugo", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_bfg", "the_last_witch_hunter", "doctor_strange", "what_happened_to_monday", "transformers_dark_of_the_moon", "fantastic_beasts_the_crimes_of_grindelwald", "it", "zathura_a_space_adventure", "oblivion"]}