{
  "id": 2301,
  "title": "Superfast!",
  "starring": [
    "Alex Ashbaugh",
    "Dale Pavinski"
  ],
  "runtime": 99,
  "genre": [
    "Comedy",
    "Action"
  ],
  "description": "Undercover cop Lucas White joins Vin Serento's LA gang of illegal street racers. They are fast and they are furious and they plan to double cross LA crime kingpin Juan Carlos de la Sol who hides his cash in a downtown Taco Bell. The gang's outrageous plan is as daring as it is ridiculous and will see them towing the whole restaurant, at crazy speeds.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iuIWl90qCpoxv6g775JB6Kg0m86.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "I have not seen this movie, but I will not see it because the popcorn epic franchise \"Fast and the furious\" should not been made a spoof. The writers/director  Aaron Seltzer, Jason Friedberg making parodies of them selves also why do they hate these classic movies?"
    },
    {
      "rating": "2",
      "text": "Making a parody Fast And Furious seems a good idea, but the movie is too stupid to make you laugh even less    ."
    },
    {
      "rating": "5",
      "text": "The directing duo behind this movie (Friedberg and Seltzer) have a similar theme running through all of their work, that being its all crap. I mean seriously...these guys were actually behind the 'Scary Movie', 'Date Movie', 'Epic Movie', 'Disaster Movie' franchises, a quadrilogy/tetralogy of turds. But wait there's more! they even did 'Vampires Suck', 'The Starving Games' and 'Meet the Spartans' too! The only movie they can maybe claim was semi-decent was their first, 'Spy Hard' with Leslie Nielsen. Clearly these guys aren't gonna be quitting the spoof genre anytime soon.\r So apparently the guys will be spoofing every type of movie that ever gets released. Perfect time for the hip street racing genre to get lampooned, you know which franchise is getting it. The first thing that struck me about this was actually how close in appearance the various actors look when compared to the real main stars. The characters in this movie are a parody of the characters from 'The Fast and Furious' franchise and truth be told there are actually some amusing performances here.\r The main lead actor Dale Pavinski plays Vin Serento (Dominic Toretto/Vin Diesel) and in all honesty I was shocked that they found someone who does fit the bill. This guy not only looks relatively similar to Vin Diesel but he has a pretty good frame too, he can also act and manages the comedy aspect well. Dio Johnson plays Rock Johnson (Luke Hobbs/Dwayne 'The Rock' Johnson) and again I was actually amazed that they found someone who not only looks similar to the A-list star but he also has a pretty good frame, obviously nowhere near the real deal but not bad. I was also impressed with this guys comical impression of Dwayne Johnson's acting style and little quirks. Quite amusing how Dio manages to mimic those big round staring eyes that never blink, the way Dwayne moves his head when talking, and of course the one hit wonder visual gag that was admittedly hilarious, the obsession with baby oil to make his biceps glisten in the sun.\r The rest of the cast are made up of various pretty people who simply fill the diversity quota much like the original franchise. I quite liked the character names of Cool Asian Guy, Rapper Cameo and Model Turned Actress, not exactly original but amusing none the less (they should of had Another Token Black Guy). Most of these performances are obviously forced and over the top but there were the odd rays of light such as Omar Chaparro as the main villain and Alex Ashbaugh's attempts at mimicking Paul Walker's body language (Paul Walker's Keanu Reeves 'Point Break' impression).\r Aside from some of the cast offering some reasonable laughs everything else is as you would expect from something like this. Most of the gags are visual incorporating accident type shenanigans with people getting run over, car prangs and general slapstick. There is plenty of plain stupid tomfoolery including a dance routine and Serento shaving his head whilst racing etc...Some of the jokes work such as Rock asking his partner if his shirt is tight enough, along with the constant appliance of baby oil on himself (gotta admit that is funny). Most of it does fall flat on its face or they linger too long on the gag.\r But what street racing flick would be complete without lots of sexy girls in tight skimpy attire, well this doesn't disappoint with much gratuitous ass imagery and tight tops. Naturally the cars are also just as hot as the girls, well one or two are. Clearly the budget didn't stretch far enough for a proper string of super saloons so we get the odd highly modded Toyota. Although it is amusing that the cars are regular pimped up shabby models or seriously dated sports cars. There seemed to be some kind of super looking car in there but no idea what it was, a concept maybe.\r All the boxes are ticked with major stereotyping, hip hop slang/dialog, sleazy girls, gun porn, tight shirts, ridiculous cars and nonsensical heist plots. All in all I kinda liked this overall, its certainly not as bad as people are making out, it is funny to see a spoof of this genre. I mean lets be honest the 'Fast and Furious' franchise is so ripe for a send-up I'm amazed its taken this long to see it happen. I'm just happy to see less aimless pop culture references here."
    },
    {
      "rating": "5",
      "text": "Так себе фильм. Шутки старые и не смешные. Из 10 шуток смешные всего лишь 2-3 макс. Сам фильм не очень интересный, но на один ращ вполне сойдет.....\r."
    }
  ]
}