{"id": 3386, "title": "Surrogates", "starring": ["Bruce Willis", "Radha Mitchell"], "runtime": 89, "genre": ["Science Fiction", "Action", "Thriller"], "description": "Set in a futuristic world where humans live in isolation and interact through surrogate robots, a cop is forced to leave his home for the first time in years in order to investigate the murders of others' surrogates.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/v3Z0Hbl0oe57njrrIPh0fJPFoo.jpg", "categories": {"plot": 6.136363636363637, "acting": 5.375, "ending": 5.5, "soundtrack": 3.0, "cinematography": 4.5, "familyFriendly": 6.0, "funny": 7.0, "action": 7.235294117647059}, "reviews": [{"rating": "4", "text": "The idea wasn't fully thought through."}, {"rating": "4", "text": "Bad movie. the whole surrogate thing is an excuse for wooden acting. i like willis' movies, but this one sucks. it's not about physical perfection. it's about fear of aging. if you're forty or over (as i am), it'll strike a nerve. all the main characters are in their forties and fifties and hiding in surrogates that are younger versions of themselves. almost none of the possibilities for surrogate athletic action are exploited. this is a film about botox, basically."}, {"rating": "6", "text": "\"Surrogates\" is a disjointed SF movie that doesn't quite grasp the idea of what its talking about. However, it still provides you elegant cinematography as well as decent entertainment thanks to the \"old\" Bruce Willis."}, {"rating": "1", "text": "Laughable B Movie that is really bad."}, {"rating": "2", "text": "Yawn... It's sad that movies as dull and limp-wristed as this are still made. What's worse is that Bruce involved himself with this crap. Avoid if you have taste."}, {"rating": "10", "text": "Interesting take on the future obsession for physical perfection."}, {"rating": "3", "text": "the only thing I like about this films are the themes. Sadly, like any other thing in this movie, those themes were not well developed. Acting is bad, script is bad, picture is bad. The range of colors is like a family disney comedy.... and the music too. The plot is full of holes... and all the sci fi elements are phony. The movie feels fake from top to bottom. Ironically that's what the movie is trying to critize."}, {"rating": "0", "text": "Pointless, unbalanced and boring film. Avoid like the plague."}, {"rating": "0", "text": "I'm sorry but I really did not like this movie it was slow going and boring. I went with a friend because he wanted to see it if I wasn't with my friend I would have walked out. That is 88 min I will never get back."}, {"rating": "1", "text": "The movie is contrived and awful. Word of mouth will doom it. It appeared that Bruce Willis is getting old and made this crapola just for the moolah as he went thru the motions. There is little character development as you care for no one. Just a waste of time and money. And I love sci fi."}, {"rating": "8", "text": "Not all of the elements work, but Bruce Willis does a really good job, the setting and \"what if\" examination of a society in which robot avatars take over human interaction is reminiscent of blade runner and other pulp sci-fi movies, and the special effects are good enough to not get in the way. Is it perfect? No. Is it better than most critics say it is? Yeah. I say check it out"}, {"rating": "0", "text": "The only reson i watched this was because i was on a 4 hour ferry ride and there was nothing beter to do not a good movie."}, {"rating": "4", "text": "\"Surrogate"}, {"rating": "5", "text": "Not as bad, as I thought it would be. A decent blu ray rental."}, {"rating": "9", "text": "Slightly predictable yet highly entertaining, and the inclusion of an underlying message make Surrogates the best film of the past few months. Definitely worth watching."}, {"rating": "8", "text": "A much better movie than some reviews indicate. No, there's nothing truly original in the story; yes, it's sort of a mish-mash of 'I, Robot', 'The Matrix' and others. But Mostow gives the movie a clean and crisp direction. And he slows down enough to make the story surprisingly moving in spots."}, {"rating": "9", "text": "Clearly one of the best movies I've seen this year. Intriguing idea, very well acted, especially given the distinction between humans and surrogates, with same actor. Bruce Willis was Bruce Willis in action but with more depth. Some of the new faces---e.g., James Ginty---did excellent niche work. As technology advances, this could be a classic forerunner."}, {"rating": "7", "text": "They idea of surrogacy is the star of this film, and in what I think was a good move by those involved in the production, surrogacy was given the most screen time, even more so than was the detective story. If you can keep yourself from being too concerned with the plot of the story, you will find that you can walk out of the movie with a lot more if you are just willing to sit down and enjoy the move for what it is."}, {"rating": "8", "text": "Good movie. I enjoyed it. It has some good action."}, {"rating": "7", "text": "Decent enough movie. I think it is worth watching. Nothing great about it, the characters could have been developed a bit deeper. Saw the ending coming a mile away. But kept me interested. Am also reading the comic right now (just the first one so far). Seems to be very similar to the movie or vice versa."}, {"rating": "6", "text": "A reasonably enjoyable sci-fi romp with an interesting enough concept backing it up. Honestly, I feel the concept carries the movie through areas where it is otherwise quite weak. The philosophical musings on human-nature come across as ham-fisted, but then did anyone really expect otherwise? If it didn't have such an interesting concept driving the movie then it would have been an absolute failure, but for fans of sci-fi, they could do worse."}, {"rating": "6", "text": "Just above average...the story was excellent but execution failed. acting was top notch but sometimes we feel that when the movie will end...the climax had a bit logic.. which gives the movie a blessing...otherwise just passable...surrogates should have improved."}, {"rating": "7", "text": "'Surrogates, which borrows tone and content freely from \"I, Robot,\" is all windup and no pitch.' ---Philadelphia Inquirer David Hiltbrand No offense. But David, do you even bother do a background check before you write shits down? This film is based on a five-issue comic book series. If you have problem with \"borrowing stuff from i robot\", go flame on Robert Venditti. I for one seriously doubt the score you give to this film because you just write shits before you even do your homework. immature and irresponsible."}, {"rating": "6", "text": "I got through about half of this movie before I decided to go watch old episodes of \"The Outer Limits\" instead. Considering how weak the storyline was, I'd say that's a pretty good compliment to Bruce Willis' acting. Damn, he still has those fine, broad shoulders. Sometimes a Bruce Willis fantasy is the only thing that gets a guy through a long day at the office, ya know? The movie gets a 10 for Bruce and a 2 for plot. That averages out to a 6."}, {"rating": "3", "text": "Numerous plot holes, unconvincing CGI, and bad pacing are the biggest faults. It's a 90 minute movie that felt like 150. Great concept, poor execution."}, {"rating": "8", "text": "All say this once this movie was based off a comic that came out in the early 90's so it did not rip off I'Robot it had an original story and they stayed faithful to 90% of the comic which is more than most comic based movies *cough* I Am Legend *cough* So I won't give away the movie but really if you think about it the technology we are developing right now is stuff they talked about in the movie like machines being controlled by thought its being developed and japans working on it to use in video games and robot technology is advancing at a steady rate so we could possibly have the robot society they talked about in the movie in the next 40-50 years so it made you think would you just control a robot that looks perfect has better abilities that you can control from your house or would you stay as you are with all your imperfections"}, {"rating": "9", "text": "This movie's fun, and has more brains behind it than your average big-budget sci-fi actioner. In fact, when it comes to robot movies, and pseudo-philosophical humanity vs. technology fare, this is better than most. Is it \"Blade Runner\".. no, but frankly I liked it a helluva lot better than \"I, Robot,\" which seems to be the go-to comparison. Bruce Willis is great in it, and while the plot is fairly predictable, it's what I like to refer to as \"predictable, in a good way.\" Had it tried to throw me for a loop just for the sake of having a zany plot twist, I would've probably hated it. It went where it was logically meant to go, and I had a blast watching it get there."}, {"rating": "7", "text": "I genuinely liked this film. Being based on the graphic novel and having read it, I thought they did a pretty good job turning it into a movie. There were a few changes that I could have done without, and there were some things left unexplained that I wish went into more detail. But overall, good sci-fi. Check this one out."}, {"rating": "8", "text": "I must say that I actually enjoyed this movie. I did not go into it expecting the next great action movie. I went in wanting good action and good special effects. I was very pleased. Could it of been better? Of course it could of but overall it was pretty good."}, {"rating": "5", "text": "By the numbers sci-fi actioner. Could have been so much more, but for the poor screenplay and the ham-fisted moral message. Granted the novel needed some work to put it on screen, but the source material could have worked on so many thought-provoking levels rather than being just more summer popcorn fodder."}, {"rating": "6", "text": "Nice SCI FI. though it has some I-ROBOTish issue! but the story was good. this movie needed some more. explanations. Bruce willies! rocks!"}, {"rating": "9", "text": "Enjoyable movie. Created a hypothetical world where technology brings a complete transformation of life warning us of the potential dangers of the drastic evolution of society through adoption of technologies with unknown or complex societal consequences. More so, the setting of ubiquitous superficiality through a societal usage of a newly found technology reminds us of such classics as Huxley's Brave New World."}, {"rating": "8", "text": "Entertaining enough and although certainly reminiscent of I Robot it has some original ideas and makes you think about where we might be heading (with our \"Second Life\" and Wii \"Mii\" avatars) without getting too heavy. Solid Bruce Willis actioner with a good supporting cast."}, {"rating": "9", "text": "I liked this a lot, but it's kind of hard to describe. It reminded me of the video game, Bioshock. I thought I would give it an 8, but it was so thrilling that it's worth a 9, and it's pretty hard to dislike."}, {"rating": "9", "text": "This is a great movie about robots and what people would do if they could get away with a robot doing everything for them. Although not as good as suspenseful or artful as Blade Runner (Harrison Ford), it has it's own sense of portraying what a future with robots could be like. The chase scenes were a little over the top using some computer game physics more than real life physics, they were entertaining and fun to watch. The perfect people used to act as robots were generally well done and robotic enough to be believable as non human. I especially liked the wife. Her robot was perfectly beautiful, but hid a woman with very serious personal problems (trying not to put a spoiler here). The desire for connection by Bruce to reconnect with the woman that he loves was beautifully done. I really felt like he missed the humanity that used to be in the world. All in all a good movie with a good plot."}, {"rating": "6", "text": "The right ending has a doppleganger, the happy ending, an unaware essence of story that puts everything in blissful order against the film's narrative organicity. Savvy moviegoers with a sixth sense(the right ending usually dies after a slew of rewrites and focus group scrutinization) can ferret out the right ending beneath the filmic posterity, which is why most major studio movies are often so unsatisfying. \"Surrogates\", a dystopian sci-fi'er starring Bruce Willis and his Euro-trash robot, cheats, big time, because it forges an unfounded wrinkle in the diegetic guideline that holds dominion over the film's narrative. The expediency behind the resolvability of conflict this time goes beyond formula and commercial considerations; this time, the happy ending renders everything which preceeded its self-correcting point in time, as nonsensical. The weapon used against the surrogates, established at the outset as being capable of liquefying skulls while users sit in their sim-chairs, no longer has that same killing wherewithal when it matters most. The eye-popping visual, as seen in the trailer(reminiscent of M. Night Shyamalan's \"The Happening\") is how \"Surrogates\" should end. During the climax, Willis' positioning of imminent heroism recalls the film-within-the-film in Robert Altman's \"The Player\", where he delivers the immortal line, \"Traffic was a bitch,\" to a death row inmate(played by Julia Roberts), who he had just saved from a lethal injection in the nick of time. (***SPOILER ALERT***) This time, Willis lets the hairy situation with cataclysmic implications run its due course without interference, which at the time seemed antithetical to his action star persona. At the last second, we think, Tom Greer agreed with Canter(James Cromwell). But as it turns out, the FBI agent was basing his decision on an assumption about the weapon's effects on people that the filmmaker never bothers to set up. Thanks to the customary eradication of the right ending by its doppleganger, Willis still gets to be the hero, albeit through the film's utter contempt for the concept of continuity."}, {"rating": "7", "text": "Not a bad movie...interesting topic and the acting was pretty good. I go to the movies to be entertained and I was."}, {"rating": "2", "text": "Surrogates has to be one of the most worst produced sci-fi films ever, with an interesting story. But not even action star Bruce Willis can save this movie from disaster."}, {"rating": "5", "text": "\"Surrogates?\" A movie about mothers having babies for other people staring Bruce Willis as the doctor? Nope. I know right, the title had me fooled too. \"Surrogates\" is director Jonathan Mostow's interpretation of Robert Venditt's popular graphic novel also named \"Surrogates\" (and no, a graphic novel is not the same thing as a comic book). The live action adaptation of \"Surrogates\" is a visually stunning movie that appears to have gotten butchered along the way to be forced to fit into a 90 minute feature.Read full review at FlicksWorthWatching.com"}, {"rating": "1", "text": "A terrible movie that displays an incomplete thought, weird plot, weird acting and a lot futuristic robot    disaster.............."}, {"rating": "2", "text": "I didn't understand who the **** were we supposed to root for? The religious zealots, unwilling to accept change? Or the \"hero\" who destroys surrogates that, let's face it, will be rebuilt in a few weeks?Honestly, they even tried to lampshade the ending with the whole **** \"and the surrogate services will be shut down for who knows how long\" line. Come on, give me a break. Most people will just treat it like another \"oops I seem to have crashed my surrogate in a ditch, better get a new one!\" incident.Nothing changes, movie POINTLESS."}, {"rating": "8", "text": "One of the main flaws of this film is that a film based on androids that create an idealistic version of themselves revolves around the inventor, who becomes disillusioned at how they've changed from aiding less able people such as himself to somewhat empty and materialistic concerns. The college student was a fair target, considering who they were aiming for. However, this becomes a side issue among the division between the predictability and the actual exploration of humanity's frightening procrastination at becoming old and unable to go through life. This was in contrast with turning it into some kind of fashion statement, as if artificiality and beauty can prolong meaning of life itself. Bruce Willis is ultimately superb in this role, considerably cynical and not sarcastic, distinctive in a world of people who are plugged into androids. In turn, there are obvious cliches that you would find in an action sci-fi, albeit having action that was just as necessary as the dialogue."}, {"rating": "5", "text": "Surrogates (2009): Potentially good movie with a great premise ruined by a cheesy, shallow and awkward script.  If the script was fleshed out better, and the director wasn't verging on stylish action-movie mode it could have been substantial.  I can't help but feel Mostow was trying to channel Spielberg here, but couldn't quite cope.  Mostow is no JJ Abrams."}, {"rating": "5", "text": "Well, as usual, interesting visuals combine with a weak story to create a passable film not entirely devoid of entertainment value as long as you have nothing better to do.\r Perhaps the worst aspect of this film is that it argues against its very existence, as the conclusion declares that \"surrogates\" are bad, and therefore the only really interesting part of the film should not exist.\r I'm troubled by the fact that two of the main villains in this film are black and that one of them is quite literally the robotic puppet of a Caucasian and both of them betray the people around them.\r Also, I'm wondering if the people who wrote the end of the film are familiar with the beginning of the film.  In the beginning, the ultimate bad guy is described as having been booted out of the corporation he himself founded.  You know, the corporation where they build all the surrogates.  So you could understand the guy being vengeful.  But by the end of the film the dialog is trying to convince us that this same guy is a psycho.  Never mind that he's got motive.  He just CRAZZEEEE!!!  And when the guy himself spends an inevitable moment explaining himself, he doesn't even mention getting booted out of his own corporation, where they make all the surrogates.  Suddenly, it's like he's got some weirdo religion.  Instead of wanting vengeance against the people who booted him out, he thinks surrogates are evil and should be destroyed.\r Wow.  That's pretty weak."}, {"rating": "3", "text": "Des cloneries et des clowneries dans cette histoire assez abracadabrante sous forme de complot anti-clones et pas mal de conneries également avec la petite morale à deux balles à la fin. Sans doute un message caché (?) à la population obèse américaine rivée devant ses écrans et en train de cliquer sur Amacon. C'est à la fois peu crédible et globalement assez grotesque, pour ne pas dire sévèrement capillotracté.Au moins cela dit, on ne s'ennuie pas et on a deux belles blondes dans le lot (Pike et Mitchell) et un Bruce à peu près supportable. La réalisation est dans l'ensemble correcte et les effets spéciaux sont joliment rendus. Le film n'en demeure pas moins  trop con-con : de grâce, ne le clonez pas !"}, {"rating": "8", "text": "This is a sci-fi movie along similar lines to The Matrix, Inception and I, Robot, with, I felt, the message behind it being to do with questioning how much we let technology control and take over our lives and how far out of control this could become in the future. The idea behind it is quite 'out there' although not new. Bruce Willis has appeared in other sci-fi movies in the past including The Fifth Element, although he's more well known for his roles in purely action or action drama movies such as Die Hard. Also featured in the cast is Radha Mitchell (who appeared in Pitch Black, Man on Fire (a brilliant movie!) and Finding Neverland) and Rosamund Pike (Made in Dagenham, Johnny English Reborn etc.).This movie features plenty of action as well as the sci-fi aspects though, there is a good amount of visual effects which seem quite realistic and up to date, indeed the movie is pretty recent, from 2009. The plot is a bit quirky but it plays out quite well, the action scenes with fights, shooting, chases and the visual effects used to give these a bit more oomph, as it were. There's a decent cast and I felt it kept my attention throughout - the story itself is a bit confusing in parts but it doesn't matter too much, its easy enough to follow the general idea and its quite entertaining in general - it doesn't appear as if the cast are bored or just sleepwalking their way through the film, its quite 'animated' as it were, you could say it has a bit of a comic book feel to it, especially when I think of the few scenes showing the robotic skeletons as it were of some of the surrogates that are revealed at times.This is a lively action sci-fi movie which is perhaps a bit zany for some but I felt that it was overall quite good fun - there isn't much in the way to offend people, there's a bit of violence but nothing too graphic, the visual effects making it have more of a comic book type feel to it. This movie has a rating of 12a, so its fine to show to teenagers but might potentially upset younger viewers. There is also some bad language and one or two scenes of whats categorised as sexuality, although again its nothing particularly graphic, its more funny if you've seen it and know what I mean (sexy robots - I'm guessing men wrote the script for this? lol). There is more of a serious question posed by the movie I suppose but then thats good for movies to have two sides to them, I think and its good that its entertaining and not overly preachy, while I felt it did make me think about the questions posed behind it somewhat. The cast all come across pretty enthusiastic and it doesn't drag on too much, compared to some more modern sci-fi movies such as Artifical Intelligence which is a slower movie that lasts over two hours I believe, this movie only just lasts an hour and a half - any longer and it might well have landed in the getting a bit tedious and too strung out category, which is a killer when it comes to such sci-fi movies to me anyway (though thats a personal preference/thing, of course).This isn't a movie I'd heard of prior to seeing it listed on my TVs EPG as it was shown on TV recently, I presume it wasn't overly successful but I'm glad I recorded it - it certainly wasn't what I'd expected it to be about (expecting a movie about women carrying other couples human babies LOL) but having said that, I think its actually one of the better modern sci-fi action movies - I do tend to prefer sci-fi movies set on earth and this is, obviously, one of those. It looked like it was a rather fun movie to shoot and the cast are fairly enthusiastic, it comes across well and doesn't drag on much as I say, so this impressed me.Yes, im happy to recommend this movie. The plot gets a little bit complicated in one or two points but its fairly easy to follow the main gist of it and the action scenes are quite entertaining - it isn't entirely bogged down in complicated background information like some sci-fi movies can be, its both entertaining and it carries relevant questions which we should probably all consider about our reliance on technology these days to live our lives and how more isolated our lives may be becoming, as we sit indoors using technology to communicate and achieve things (such as me sitting at home typing up this review to post online, I suppose). It doesn't come across as too much of a preachy movie, it is a little 'out there' but its also not *as* pretentious as perhaps you might have found similar movies such as The Matrix (which I felt was a bit too much for me, if you know what I mean!), so personally I thought this was pretty good, its a shame its not more well known."}], "recommendations": ["the_tomorrow_war", "riddick", "elysium", "the_last_witch_hunter", "x_men_apocalypse", "jumper", "independence_day_resurgence", "terminator_genisys", "max_steel", "bloodshot", "pacific_rim_uprising", "infinite", "the_book_of_eli", "bright", "what_happened_to_monday", "lucy", "jupiter_ascending", "rampage", "captive_state", "the_purge_election_year", "maze_runner_the_scorch_trials", "i_am_number_four", "i_am_legend", "repo_men", "hercules"]}