{
  "id": 2888,
  "title": "Survivor",
  "starring": [
    "Pierce Brosnan",
    "Milla Jovovich"
  ],
  "runtime": 96,
  "genre": [
    "Crime",
    "Action",
    "Thriller"
  ],
  "description": "A Foreign Service Officer in London tries to prevent a terrorist attack set to hit New York, but is forced to go on the run when she is framed for crimes she did not commit.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/npyCpfYyYknFoY2iJPyfqp70FVX.jpg",
  "categories": {
    "plot": 4.352941176470588,
    "acting": 4.529411764705882,
    "ending": 3.4285714285714284,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.666666666666667,
    "funny": 6.0,
    "action": 4.846153846153846
  },
  "reviews": [
    {
      "rating": "1",
      "text": "身為懸疑驚悚片，本片真的能夠深刻的帶出出那種令人緊張、心跳加速的那種感覺\r但我想了想，本片真的很像一般在電視上演出了西洋推理劇而已\r在片頭開始時，觀眾就很措手不及被塞入我們還沒有準備好的劇情之中\r一切進展都太快，而快，又拖泥帶水\r結果這是一個一成不變的超老梗推理電影\r沒有出乎意料的劇情，有驚悚槍戰但卻不精彩，一切都太制式化\r劇情毫無焦點，沒有頭緒，主角們要愛不愛的\r能能跳脫以往的編劇方式，用點新的手法，放入更多的情感因，完整說明，是這片的真正解決之道\r槍戰雖然能讓觀眾的心跟著起伏，緊張又刺激，但這也應該不是來掩蓋那糜爛的劇情的方法\r總結:一部好的電影還是要\"面面巨觀\"不能只靠打鬥方面稱場"
    },
    {
      "rating": "1",
      "text": "It really is difficult to state just how plain awful Survivor is without making it sound like must see, so-bad-it's-good film. A sub Bond spy thriller it has Brosnan chasing Jovivich across London and New York after she is framed for a terrorist bombing. The plot makes no sense whatsoever, the acting is appalling by all concerned, the direction is non existent and the ending (if you make it that far) will have you scratching your head. Avoid at all costs."
    },
    {
      "rating": "4",
      "text": "Mila Jovovich runs the danger of becoming synonymous with under par movies, just like Uwe Boll's reputation precedes him. It would be unfair, because she really seems to improve her acting and perhaps she might even do some more serious work later down the line. It remains to be seen.\r In this movie her character is fleshed out some more, albeit still in a shallow way for this is an action movie and it doesn't linger too much on backgrounds. The movie is filled with some seasoned actors, Pierce Brosan, Dylan McDermott and Robert Forster which seems to be a setup for a somewhat better movie. Rest asure: it isn't.\r A bunch of characters are wiped of the face of the earth early on so the movie can turn into a cat and mouse game between Jovovich and Brosnan, which is the meat of the story. To make sure nobody will aid Jovovich she gets mistaken for having murdered Forster and this coupled with the usual bad-guys-control-everything ploy, the local-authorities-do-not-believe her trick and her-coworkers-do-not-either element is a definite sign that the script forgoes any originality and plunges to the depth of banalities.  It isn't even that the concept is wrong - most stories are similar - but there isn't anything special, interesting, original or even specific entertaining about this movie that makes it in any way stand out .\r Time and again the major weakness of many movies is the story. It astounds me. With so many books and writers out there, is it really impossible to create a decent script with some decent characters and acceptable dialogues? It can't be that hard, for sure? As it is Survivor is an incredible waster of actor potential that just baffles by doing so..\r Unspectacular to say the least..."
    },
    {
      "rating": "7",
      "text": "Survivor (2015) is an intense and enjoyable thriller that is, albeit not entirely original nor twisted, seemingly interesting, and that is because of the cast ensemble in this shameless propaganda."
    },
    {
      "rating": "6",
      "text": "I liked a lot of the actors, especially McDermott... but even Mila's acting was bad. The story was decent but it wasn't executed and the ending sucked pretty bad. The journey to get to the ending was decent but it failed in the end."
    },
    {
      "rating": "0",
      "text": "The only distinguishing feature of this movie is its achingly idiotic script. It's pure security theatre that resembles a clumsy piece of propaganda more than a genuine attempt to provide entertainment, an impression that's reinforced by the 'be afraid' message in the end credits."
    },
    {
      "rating": "4",
      "text": "\"Survivor\" is what you get when you take a mostly solid cast and put them in a generic pseudo-spy movie with a plot surrounding a conspiracy. Not only is it very unoriginal, but it also has the disadvantage of being uninteresting as well. There's not enough action in this action-thriller and it's also missing out on the thrills.\r With a lead actress like Milla Jovovich who is known for being one of the few female action stars out there you would think we get to see her do some actual action scenes here. It definitely would have set the movie apart from the rest of the genre. Especially had she gone toe-to-toe with Brosnan for more than just one scene in the end. Unfortunately there's only one fight scene at the end and by then it's too little too late. All Jovovich is left to do for the majority of this movie is run. It's not very exciting.\r As far as Brosnan goes he isn't much to speak of here either. He doesn't really play a character. Just a mindless assassin meant to shoot at (and totally miss) Jovovich. He's not used well here. AS far as the plot goes it falls apart the moment you start to look at it. Without any action to keep viewers distracted, looking at the plot is really all there is to do here. The whole scenario is made possible by absurdity. When watching it you'll begin to notice how ludicrous characters actions are. There are smarter and more believable ways that something like this would all go down. That wouldn't have mattered had their been more real action, but again there isn't.\r Survivor ends up being a lackluster, generic, and ultimately boring action-thriller that despite a compelling cast just isn't really worth watching. I'm sure there are some out there who are big enough fans of the genre to put up with this films problems, but even they will admit that there are plenty of better alternatives out there. Most people though are just better off skipping this in favor of more entertaining options."
    },
    {
      "rating": "5",
      "text": "The narrative isn't particularly strong as it barely survives with star-studded cast and attractive cityscape. Survivor is a straightforward spy thriller. It creates a timid suspense with typical espionage plot, which can be shaky at times. Story starts rather slow and the way it tries to cover the narrative is bit hectic, especially in midway point. Fortunately, the veteran actors bring appeal to the on-screen characters as they scurry at beautiful locations. Survivor is not flawed to the point of absurdity, though it doesn't really shine in any special way.\r Kate (Milla Jovovich) is a newly employed security staff at US embassy in London. Her job is to filter visa applicants for terrorist threat, as she tries to investigate an anomaly on the data, there's an attack on the staff. Desperately trying to uncover the conspiracy and now wrongly accused of the attack, Kate must prevent the attack while surviving being hunted by professional assassin and law officers.\r The premise is set up pretty well, although the pace needs a while to get momentum. It also speeds up in the second act hectically, so audience might find the timeline jarring. Nevertheless, as a thriller the movie is presentably gripping, moving the plot with mostly fast pace. The cast gives amicable performances with major names delivering what's expected of them.\r Milla Jovovich has lots of experience in tough leading female, she looks capable on revealing the mystery and fending off threats, though there’s not much personality other than aforementioned tough chick. Dylan McDermott as the supervisor has the air of reliable ally, and thankfully without being forced in romantic subplot. To round it up, Pierce Brosnan plays as a professional who works for mysterious party. He expectedly has on-screen presence, but his character is a one-dimensionally bloodthirsty.\r Cinematography is solid, capitalizing on prominent view of London. It displays some nice shots of the streets and residential area, even in smaller scale setting the movie has good ambiance. Action and mystery are decent, none stand out too much or has remarkable twists, they simply get the job done. For those who have seen Tom Clancy's movie, this movie should be familiar or a bit lacking, unfortunately.\r Survivor isn't demanding nor does it offer anything novel in any way, this isn't Bond or Bourne, which is all right. The premise works in the confined boundary of action thriller, the fine cast and pleasing scenery will entertain to some degree."
    },
    {
      "rating": "6",
      "text": "The previous reviewer,  \"quincytheodore,\" did a very nice job of summing up the movie.  Oddly, as I am usually kind of a tough critic, I was not terribly disappointed with \"Survivor.\" Because it does have a stellar cast, I was happy to just go along for the ride. There are many silly anomalies: as one with a passing knowledge of firearms, you don't shoot a case-hardened padlock at close range, unless you have death wish, especially when it's attached to a cheesy hasp that you could just kick in; while on the run and shopping, our heroine never bothers to purchase a little make-up kit to guise her substantial facial injuries; likewise, since she is \"on-the-run\" I could not understand why she replaced her high heels with high-heeled boots instead of running shoes; the dramatic denouement was only possible because of an encounter that put a pistol in her hands... otherwise, \"Sayonara New York City!\" Etc, etc.I, too, was annoyed by the gratuitous dire  warning at the closing credits. When our own Department of Defense sends live anthrax viruses to 11 locations in America, I think we should be doing due-diligence of another kind... not to mention the 4,000,000,000 + personnel records that were hacked this week from federal government files! Anyway, the competent filming and engaging actors made this worth the watching."
    },
    {
      "rating": "10",
      "text": "this is great action movie all of the actors are very good the places where they  film this movie are so beautiful...........i will watch it again (^_^)"
    },
    {
      "rating": "7",
      "text": "This was an excellent action thriller with a superb cast and high production value. While it wasn't wholely original, it was very entertaining."
    },
    {
      "rating": "3",
      "text": "I have to agree with quincytheadore - even a solid cast and terrific acting cant't redeem a film built around preposterous, underwhelming script. By the finale I felt more cheated than thrilled."
    },
    {
      "rating": "3",
      "text": "This is an action Sunday movie in its entirety, there is some degree of emotion and it manages to keep you entertained, but it has huge errors that do not facilitate its enjoyment. Survivor is without a doubt a forgettable action movie."
    },
    {
      "rating": "4",
      "text": "Featuring a stale Brosnan and an uninspiring cast, \"Survivor\" is a messy and quiet cat & mouse game without any hooks. There's no real drive, no soul and no point point; despite its high tempo there's really no excitement. Featuring bland villains and action scenes that are cut short as well as gaping plot holes and a rubbish ending."
    }
  ],
  "recommendations": [
    "no_sudden_move",
    "wrath_of_man",
    "triple_frontier",
    "broken_city",
    "beyond_the_reach",
    "the_equalizer_2",
    "mission_impossible",
    "the_commuter",
    "hunter_killer",
    "momentum",
    "triple_9",
    "the_gunman",
    "jack_ryan_shadow_recruit",
    "seeking_justice",
    "the_sum_of_all_fears",
    "cube",
    "the_ice_road",
    "street_kings",
    "american_assassin",
    "21_bridges",
    "den_of_thieves",
    "haywire",
    "the_equalizer",
    "kate",
    "the_bourne_supremacy"
  ]
}