{
  "id": 2869,
  "title": "Suspiria",
  "starring": [
    "Jessica Harper",
    "Stefania Casini"
  ],
  "runtime": 99,
  "genre": [
    "Horror"
  ],
  "description": "An American newcomer to a prestigious German ballet academy comes to realize that the school is a front for something sinister amid a series of grisly murders.",
  "releaseYear": "1977",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5ya8jTbNZTrCFUx9OwpNBjCivXY.jpg",
  "categories": {
    "plot": 6.285714285714286,
    "acting": 6.4,
    "ending": 5.0,
    "soundtrack": 7.625,
    "cinematography": 8.11111111111111,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Really cool visuals and music, but not much beyond that. Story was cheesy and the scares don't hold up at all nowadays.Still, the aesthetic and soundtrack kinda make it worth a watch."
    },
    {
      "rating": "9",
      "text": "Suspiria is an amazing arthouse film by Dario Argento that though is cheesy at times works because of its bold colour scheme, fantastic punk soundtrack and beautiful filmmaking."
    },
    {
      "rating": "7",
      "text": "Over the years and now with this new revision to Argento's classic, I must say that we have idealized this film too much. I still think it's a great horror film, especially because all the style and tonalities that Argento printed on it are more than enough to talk for hours, but the script... the truth is that the script is very weak and I think if Argento or another director would have gone to another way or had represanted the story in a different path, I think Suspiria would have been a quite irrelevant and forgettable film.For that same reason now more than ever I'm more than excited to see Guadagnino's vision and considering the critics are already predicting it as a film that will polarize the audience in an extreme way, I have to say it will undoubtedly be a very interesting experience."
    },
    {
      "rating": "6",
      "text": "Music is fine, but the acting is just so-and-so. Feel rather bored most of the time."
    },
    {
      "rating": "2",
      "text": "While the film is well directed, I was not a fan of the story at all. I thought that it was too fast-paced and we didn't really get a chance to explore anything. It let me very unsatisfied in that regards."
    },
    {
      "rating": "6",
      "text": "Amazing visuals the music was ear piercing good I like the music but my ears hurt so I'm probably not going to watch this movie again But the visuals are really worth  the  Blu-ray"
    },
    {
      "rating": "7",
      "text": "Decidi assistir principalmente por causa do remake desse ano. Um filme visualmente maravilhoso, com aquele vermelho claustrofóbico e muita violência. O roteiro deixa a desejar nos últimos 20 minutos. Com certeza assistiria novamente."
    },
    {
      "rating": "9",
      "text": "Right from the get-go the music sets the tone and prepares you for something sinister. It makes for one memorable opening credits sequence. When the movie actually starts however, the same track is still loudly thrumming in your ears despite the protagonist doing nothing more than arriving at an airport and catching a cab to the dancing academy during a thunderstorm. I can't help but wonder if it's opening moments might not have been a little more effective had director Dario Argento let the setting create an atmosphere by itself in silence rather than trying to force one with a full-on aural assault that doesn't relent until the film's first kill.Luckily, after the first chapter's bloody conclusion Argento makes more functional use of the soundtrack from prog-rock band \"Goblin\" and it becomes of the film's most magical qualities. Further amplifying it's hallucinatory fever dream qualities. Imagine something with the surrealness of Jacob's Ladder and the visual style of Stanley Kubrick à la The Shining or maybe even A Clockwork Orange and you have Suspiria. It's liberal use of colors and unique camera angles make it both beautiful and unsettling.Argento is a master of atmosphere. He manages to give Suspiria the qualities of both a supernatural threat and a slasher film. It's really quite hard to classify just what kind of horror film it is. It's also a bit hard to decipher what it all means. However, even at just face value it's an excellent movie. I did find myself once or twice drifting to my phone during some slow moments, but I always found my attention quickly restored as the unexplainable began to happen once again. It's an original and entrancing experience. A legendary standout in the genre for good reason. Not to be missed.9.1/10"
    },
    {
      "rating": "6",
      "text": "the stakes of ruggedness..Suspiria Suspiria is a character driven horror about a girl who joins a ballet academy and finds out the hard way that there actually might something else be going on behind the show business. The art designing and visual effects is the weakest link, why it fails to create the anticipated thrill to the audience when it is crucially required. Having said that, it doesn't suggest in any way, that it isn't scary. Its horrifying images comes from sharp sound effects and the mass amount of creatures that it uses to scare the viewers. It creates long gasping of horrors among the audience through keeping its characters helpless and cornered all the time. In fact, there is a sequence where the protagonist has to pass a narrow passage and despite of having any surprises installed in it, it is the most appalling sequence of the feature. And this is where it shines in, the build up of that sequence is weaved in by all the mysterious mythology and deaths throughout the course of it. Another wise thing to adapt in here would be the rest of the material through which the makers creates this crispy and gritty environment which is by gossiping. It is such a common thing that the makers have extracted and the way it is foliated and factors in on the storytelling is breathtaking, as the writers pass on information with it. The background isn't that impressive nor is cinematography or editing or camera work. The performance is decent if not anything extraordinary, it is safe enough to rely upon it. Being aware of its malleable script, Argento's execution surpasses its nail biting screenplay. Some new tactics to set the stakes of ruggedness, the conversations between the dancers and the mythological tale are the high points of the feature. Suspiria is a far better horror than we receive and the primary reason to that is it being aware of its limitations and the range it flaunts within those boundaries."
    },
    {
      "rating": "8",
      "text": "I love this movie. His story, although it goes very fast for modern standards and a little more character development would have been appreciated, is quite good and the lighting is phenomenal, I love how there are no dark moments, unlike the remake, there are scenes in which it is not understood what is happening in this one understands everything and the cinematography is phenomenal."
    },
    {
      "rating": "9",
      "text": "Horror film that can be called a masterpiece of the genre. The tension is always very high, the rhythms are tight and the music is wonderful. The colors of the settings are spot on and the single colors of the lights make the settings surreal. The only flaw is that like many other horror films it has obvious logic problems but the latter take a back seat in front of the merits of this film."
    },
    {
      "rating": "6",
      "text": "Suspiria is probably the most famous movie Dario Argento has made. If you are a New or Young Horror fan the odds are Suspiria would most likely show up on your radar first. Unfortunately when that is the case...sometimes a film can suffer from the fan communities over hyping of that film. Before I saw Suspiria for the first time I had heard and read all kinds of praise for it. When I did watch the film for the first time I was slightly disappointed. I had already seen Deep Red and Opera and feel those films are Argento's Best.Suspiria isn't a bad movie. It's just not as impactful as I had always heard it  to be. The Visuals and Music Score are terrific. The story however I found a bit generic and slightly boring in spots. Still worth a watch. Maybe if you see it without the great expectations I had it will work better."
    },
    {
      "rating": "7",
      "text": "A Bit of a let down, considering the fact that it has a great music score and is beautiful to look at but is still a good movie."
    }
  ]
}