{
  "id": 1089,
  "title": "Swallow",
  "starring": [
    "Haley Bennett",
    "Austin Stowell"
  ],
  "runtime": 96,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "Hunter, a newly pregnant housewife, finds herself increasingly compelled to consume dangerous objects. As her husband and his family tighten their control over her life, she must confront the dark secret behind her new obsession.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/40Zrwud1EVxNvcjQkotZo7jmr4L.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 8.375,
    "ending": 3.0,
    "soundtrack": 6.0,
    "cinematography": 7.2,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "About so much more than domestic ennui. If youve ever felt unwanted even by yourself, this film is for you."
    },
    {
      "rating": "9",
      "text": "NOT HORROR- With that in mind, this film is brilliant and likely to disturb most to some degree. It is not grotesque or violent. It is Hailey Bennett and debut director guy Mirabella-Davis. Flawless acting, pacing and cinematography. All the supporting roles are played brilliantly. Marriage Story comes to mind based off how well Driver, the Dern and Ms. Dansk Perfekt made their characters seem relatable to audiences by not overacting.  Hailey Bennet isn’t going through a divorce; her character adopts a behavior that is so incomprehensible, yet she remains highly relatable throughout. I admire many of the films by Gasper Noé & Lars Von Trier that are clearly intended to be disturbing (for lack of a better word).  Swallow‘s brilliance is unique in that the shocking behavior and unlikely circumstances are 100% believable.  Hailey Bennet is friggin amazing.  Her portrayal of a woman struggling with the mental disturbance she suddenly is unable to suppress is explored without exploitation. You follow her journey from a seemingly normal woman start to experience symptoms, her adaptive coping mechanism, her experience weighing the benefits with the severe consequences and then the film really takes off....inevitably a best actress nomination at the Independent Film Spirt Awards (Likely Best Picture foo) and no Oscar/Globe love.  Mental illness/trauma/coping made all the more devastating by resisting the urge to force excess."
    },
    {
      "rating": "6",
      "text": "I had no idea a swallowing fetish was a thing (\"verophelia\" per Google). If you can stomach watching an entire movie on the subject (no pun intended), Swallow is for you."
    },
    {
      "rating": "8",
      "text": "In this disturbing little indie, a young, pregnant newlywed (Haley Bennett) finds herself feeling pressure and anxiety mounting all around her, so much so, that she develops a deadly habit known as pica, the strong urge to ingest inedible and dangerous objects. Unresolved demons from her past threaten to get in the way of stopping her from breaking this disturbing habit. I'll be honest and admit that I was a little hesitant to give this one a go given the premise (I can get a little squeamish with stuff like this), but I'm also always looking to challenge myself and watch films or premises that'll really engage me for better or worse, and even if they might make me a little uncomfortable. Such was the case with this film, as I cringed and had to look away at times, but the way the story was developed was hard to turn away from, and Haley Bennett gives such an incredible performance! Overall, not for the faint of heart or squeamish at all, but for the few that can look past the somewhat off-putting premise, it delivers a powerful story with some powerhouse acting."
    },
    {
      "rating": "9",
      "text": "I thought this was a fantastic story, that for once actually did a decent job of trying to portray what leads up to a mental health issue. Great performance by the cast, particularly Haley Bennett. Fab soundtrack also."
    },
    {
      "rating": "10",
      "text": "This was so good, like a modern take on Rosemary's Baby, Haley Bennett gave a wonderful performance, in Hardcore Henry she was excellent, that is a hard movie to stand out in.  Here as well she became the role in a very strong way.  The photography was beautiful, reminiscent of my favorite guy Chung Hoon Chung (Stoker), lots of primary colors and contrasts, natural greens and such.  The camera never moves, giving a portrait feel, felt like Tokyo Story kind of, the camera never moved in that whole movie.  A very well done movie, claustrophobic and somehow beautiful for every frame."
    },
    {
      "rating": "6",
      "text": "This film was kind of an irregular stuff. A mixture that never settles completely.Swallows is a story about trauma. A psychological disorder, feminism, patriarchy and empowerment.Swallow is a suggestive tale and an interesting critique of the social facade in which some women can be trapped and the social interactions that puts them there.Swallows is Haley Bennett's show and she does a splendid job, however the director forgets about the others and frankly the people around her never stop looking like simple cartoons and that baffled me, especially because the film fails to establish the necessary strength to highlight the complexities of its themes.It plays safe for the most part and that was a bit disappointing.However, it's still an intriguing experience, especially since it doesn't provide clear answers and even when a film fails to be notable, it's always respectable that it doesn't try to give you everything so easily.I only would've liked the story to be more crude, because if you're already at the doors of that threshold, then dare to cross it."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)Do they intend to make a movie for every DSM psychopathology? In this case, the director chooses the picacism of an ex-saleswoman  who swallows the bitter pills of her previous trauma and her marriage with a husband of superior socio-economic background. The evergreen \"This Is the Day\" (1983) by \"The The\" in the soundtrack would have deserved a better fate."
    },
    {
      "rating": "3",
      "text": "It would be easy to call Swallow just one more story about a white woman whose problems would be solved if she just found a goddamn job. The movie admits as much at one point, when a Syrian attendant hired as Hunter Conrad’s live-in prison warden criticizes the triviality of her plot saying, “In a war zone, there is no time for head problems.” There are obvious places where the movie falls short: the tonal shift of Hunter’s disease is all over the place–we’re never quite on solid ground about whether it’s a tool of rebellion against the white, upper class in laws and their veneer of magnanimous geniality, or a Serious Issue that should be treated with ominous piano music. (This second underlying tone to the movie is the reason why I couldn’t find anyone to watch Swallow with me: the idea of watching a movie that romanticizes or makes the object of voyeurism a woman’s weird mental health crisis and subsequent self-harm compulsion was not something of interesting to anyone in my quarantine-blunted social circle.) The effect of the uneven treatment is a little manic, which maybe works as a nice metaphor for the compulsion itself, but doesn’t square especially well with the rape plot that unearths itself late in the 9th inning of this movie with little need and no one’s asking.Swallow is a movie I’ve been anticipating for a few months, ever since the list of horror films for 2020 came out in January, and someone made mention of a “body horror” film where a young woman develops an obsession with eating household objects. I thought that it would be a spiritual sequel to one of my favorite body horror films, Raw (2017), which plays with cannibalism as a metaphor for the taboos of a young woman coming of age in university. But Swallow has its sights set on different taboos, with less of a–for lack of a better word–bite and less of a target. Strawmen abound in director Carlo Mirabella-Davis’s imagining of the sterile, high-class life of a kept woman.Haley Bennett is radiant in her throwback dresses, her slack-jawed pawing at her cellphone games while waiting for her husband to come home from work, and her effortless lies small and large. The aesthetic feels like an assault (or maybe an homage, or maybe a sendoff?) on the color palette and spirit of shows like The Marvelous Mrs. Maisel and directors like Wes Anderson, who prize organization and tidiness, sometimes at the cost of deeper commentary about the patriarchal violence required to enforce that tidiness (I promise that I’m not really interested in using the phrase “patriarchal violence” more in this discussion, but it feels like Mirabella-Davis might have more to say about this).Bennett’s role is difficult, because so much of her stageplay has to do with dissembling her true emotions. Her face is a cypher for so much of the movie–and at times it seems clear that she’s putting on a show of looking purposefully dim as a defensive technique–but she does an excellent job of projecting internal strife through her eyes, the sensuality of release when she gives in to her initial compulsions, and its commonplace balming effect by the end when she’s shoveling dirt down her throat. (The moments when she’s eating dirt are actually some of my favorite, because it’s so obviously brownie dust and she eats it with such gusto. A lot of the other objects she ingests are practical effects and require quick camera cuts, which makes them a lot less satisfying to watch.) The longer we spend with Hunter and her dirtbag husband Richie (ugh, the pun is bad), the more I liked the movie and the more thoughtful I thought the indictment of liberal progressive hypocrisy about gender roles in committed relationships, which is why it felt overly long when the film tumbled out toward the end as Hunter confronts her father at his birthday party.I am convinced after watching this movie that it was probably never supposed to be much more than a character study with a lot of oddly beautiful bloody bathroom and tracheotomy shots. It was still entertaining to watch in two sittings and probably will feel like a fun film to look back on in Haley Bennett’s career once her next role in Hillbilly Elegy flings her back into the limelight."
    },
    {
      "rating": "9",
      "text": "If you look past the absurdity of its content, you'll see a story that's more about overcoming tragedy, abuse, self-loathing and finding one's independence. It's a beautiful story and the lead character, played by Haley Bennett, is such a biblical figure, and drives the film with such an unbelievably gut wrenching performance."
    },
    {
      "rating": "10",
      "text": "A serious look into a caged young woman.Haley Bennett is impeccably absorbing, capturing the giddy highs and heart breaking lows of the human spirit. It's an emotional feast where almost everything happens between the lines.Beautifully shot with outstanding sound design, Swallow guides us to a deeper empathy for the weight of forced subservience and the isolation that inherently surrounds it.On metaphorical level, Swallow also explores the things we all do to deal with past and present trauma, and the forces that make those actions so compulsory."
    }
  ]
}