{
  "id": 4357,
  "title": "Swamp Thing",
  "starring": [
    "Louis Jourdan",
    "Adrienne Barbeau"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Science Fiction"
  ],
  "description": "Dr. Alec Holland, hidden away in the depths of a murky swamp, is trying to create a new species - a combination of animal and plant capable of adapting and thriving in the harshest conditions. Unfortunately he becomes subject of his own creation and is transformed. Arcane, desperate for the formula, attempts to capture the Swamp Thing. An explosive chase ensues that ultimately ends with a confrontation between Holland and a changed Arcane...",
  "releaseYear": "1982",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7BGaE9A7UeyxH29aeFbQfzEmIi0.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.8,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "It's not bad. It is very much the B-movie that Wes Craven was known for prior to his hit with A Nightmare on Elmstreet. Decent acting, fun special effects and pretty good story, it is a fun movie that doesn't try to take itself too seriously, it just tells it's story and leaves it at that. Is it the best Superhero film around? No, not even close. But is it worth watching? I think so, yes.http://latetothegame.blog/2019/01/19/key-movies-of-my-life-swamp-thing-1982-2"
    },
    {
      "rating": "7",
      "text": "Criminally underrated DC film. Wes Craven’s most underrated movie. Swamp Thing is an underrated gem. It is a fun horror/sci-fi B-movie with okay acting, an okay soundtrack, great special (practical) effects, creepy and disturbing parts, a coherent story, a good cast, a decent and charismatic antagonist played well by Louis Jordan, fun action, and let’s not forget Adrienne Barbeau. It’s admittedly campy, but still a decent superhero film overall."
    },
    {
      "rating": "5",
      "text": "Criminally underrated DC film. Wes Craven’s most underrated movie. Swamp Thing is an underrated gem. It is a fun horror/sci-fi B-movie with okay acting, an okay soundtrack, great special (practical) effects, creepy and disturbing parts, a…"
    }
  ],
  "recommendations": [
    "the_mummy",
    "cursed",
    "ginger_snaps",
    "van_helsing",
    "the_guest",
    "the_wolfman",
    "the_shining",
    "wrong_turn",
    "the_three_musketeers",
    "the_return_of_the_living_dead",
    "the_texas_chainsaw_massacre_2",
    "ghostbusters",
    "the_terminator",
    "from_dusk_till_dawn",
    "fright_night",
    "oz_the_great_and_powerful",
    "mighty_morphin_power_rangers_the_movie",
    "anna_and_the_apocalypse",
    "aquaman",
    "the_babysitter",
    "the_last_witch_hunter",
    "the_fifth_element",
    "the_thing",
    "the_cabin_in_the_woods",
    "cult_of_chucky"
  ]
}