{
  "id": 791,
  "title": "Sweat",
  "starring": [
    "Magdalena Koleśnik",
    "Aleksandra Konieczna"
  ],
  "runtime": 107,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "Three days in the life of fitness motivator Sylwia Zając, whose presence on social media has made her a celebrity. Although she has hundreds of thousands of followers, is surrounded by loyal employees and admired by acquaintances, she is looking for true intimacy.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/vjgRx5CXEjJm3rHtLYAAeIvNJ5q.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I liked the visual approach, but the film makes Sylwia look like someone or something is forcing her to be like that. I mean, it's not that they've just discovered that not everything is as it seems. Director Magnus von Horn doesn't make any judgments, but the stance proves to be very mild and not that interesting. Sylwia even says that it all could go away with just the click of a button, so why wouldn't she do it? Why make a video about how lonely you are and not take action? 'Sweat' tries to convince us that influencers are humans too, but I just couldn't connect with the \"see, they have problems like you, but still get everything for free and promote stupid things people don't need.\"What I really liked here is the idea of capitalism vs communism; the new way vs. the old, represented in the strained relationship between Sylwia and her mother."
    },
    {
      "rating": "6",
      "text": "Sometimes irony is a **** but Sweat reminded me of a real case that happened just a few weeks ago, here in my hometown in which a \"fitness influencer\" underwent a special treatment that would prevent her from sweating.Incredible but true.She died in the table due to a reaction from the anesthesia, and it all ended there for her.She was just 23 years old.Sweat tries to make you empathize with the situation that these people live by the line of work they have chosen, and I cannot deny the extremes that some go to for their audience, but that's precisely the heart of the matter.Everything for them hangs in the balance, depending on a handful of likes.Food for thought."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)The fluid identity inextricably composed of real life (\"irl\") and virtual (\"VR\")/digital one has now become our new everyday existence, so I am amazed by the hypertrophic storytelling of Polish cinematography (see also Jan Komasa's \"The Hater\"), its excessive fictionalization of the repercussions on social media of late adolescent problems when we are already full of true stories of influencers and spin doctors to be translated into biopics. Maybe they have no phenomena like the Ferragnez or the Casalino? I doubt it."
    },
    {
      "rating": "7",
      "text": "This is ultimately a film about sexual violence in the age of social media influencers. It highlights the artificiality of such peoples public personas and what they may have to deal with but don't share with others . Its quite thought provoking and memorable. Its perhaps a little bleak but its not choc full of gory violence or similar, thankfully, though it won't appeal to many people for understandable reasons, so be aware of the main themes when/if deciding to watch this. I thought the main character was very well portrayed by Magdalena Kolesnik. I imagine there will be many films to come about such popular 'influencers' and what they may deal with as a result of their sudden/apparent rush to fame online. The plot takes some intriguing twists and it reminded me (if slightly) of Promising Young Woman about it, although I should say that the protagonist isn't expressly out for revenge as such. Its a film that ends, if anything, perhaps surprisingly quickly at the end but I'd say its a worthy watch, that didn't feel entirely (or overly) too  over the top or exploitative, so yes I'd recommend this film."
    }
  ]
}