{
  "id": 3598,
  "title": "Swiss Army Man",
  "starring": [
    "Paul Dano",
    "Daniel Radcliffe"
  ],
  "runtime": 97,
  "genre": [
    "Comedy",
    "Drama",
    "Romance",
    "Fantasy",
    "Adventure"
  ],
  "description": "Alone on a tiny deserted island, Hank has given up all hope of ever making it home again. But one day everything changes when a dead body washes ashore, and he soon realizes it may be his last opportunity to escape certain death. Armed with his new “friend” and an unusual bag of tricks, the duo go on an epic adventure to bring Hank back to the woman of his dreams.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8pxn8CQ6SD6tly75lrKw08wfZKv.jpg",
  "categories": {
    "plot": 4.2631578947368425,
    "acting": 5.2,
    "ending": 4.6,
    "soundtrack": 6.5,
    "cinematography": 8.666666666666666,
    "familyFriendly": 3.0,
    "funny": 7.166666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This story had a funny premise that I thought would go somewhere.  But it meandered about and did not come to a conclusion, at least none that I could see."
    },
    {
      "rating": "10",
      "text": "What I just saw in that goddamn auditorium in that goddamn theater was goddamn experience goddamn it! this movie was **** hilarious! it is awesome! hee"
    },
    {
      "rating": "9",
      "text": "A really beautiful journey, it's weird and really awkward at the beginning but gets charming pretty fast. Great cinematography and even better sound track.\rFor some reason people complaining about the film have a really childish view of the elements involves, the farts, boner and other \"awkward\" stuff involved in the film aren't there to make you laugh they are all symbolism.\rA really unique thing that more movies should take an example and just try to do something new."
    },
    {
      "rating": "5",
      "text": "Going into Swiss Army Man, you cannot help but be prepared for the preposterous narrative at hand. I mean, the narrative is simple, well, kind of simple…well, not really.\r The newest film to feature the actor who once played one of the most magical and profitable wizards in the film world, seems to have taken another role which would add to his very large attempt of leaping him away, and disassociating himself afar from that world altogether. What better way to do it than play a kinda/sorta dead corpse who farts his way to safety, guides his best friend Hank (Paul Dano) with the use of his erection, and vulgars his dialogue at every instance with the female reproductive system.\r Okay so, lets try to get this right, as best as possible.\r Swiss Army Man tells the story of Hank, played by Paul Dano, a man who seems to be deserted on an island, with barely any willingness to live. Moments before he is about to kill himself, he sees a body washed upon the shore. Unbuckling the belt tied around his neck, he makes his way to the deceased body. Upon the discovery that the body is in fact dead, he hears the body pop up random farts and sounds, giving the illusion of life at times. Disillusioned by the body altogether, he salvages it and begins using it as a purpose to live.\r Dressing the corpse up, talking to it and interacting with it, Hank seems to have found a new purpose, that is until, the body, Manny (Daniel Radcliffe) begins to talk back. In a panic, Hank punches the corpse and runs away. Shortly after, Manny begins inhabiting certain skills and tools needed for Hank’s survival, these skills include; farting fire, slingshotting stuff, axing things, etc. But don’t get it twisted, the body is still dead. As the relationship between Manny and Hank begins to intensify, Hank shares with Manny the truths about women, sex and the world, revolving each and every story around the love of Hank’s life, Sarah (Mary Elizabeth Winstead). As the days pass and the hope for survival begins to become more real, Hank soon realizes that, Manny may just be the soul-mate he has always hoped for and desired.\r Going into the film, I could already tell that the movie was going to play quite loosely with one of my most examined and tropes of cinema; augmented reality with reality itself. Just by looking at the trailers, the film blends quite effortlessly the seriousness of a stranded man, with the imagination of a man who creates an entity needed for his survival; Manny essentially becomes the Wilson to Tom Hank’s character in Cast Away. In only difference is, Wilson never spoke back, interacted or physically helped Chuck Nolan to survive. Now, the film is obviously saying a lot and making a huge statement about mental health. Is Hank sick? Is there even a body? What is his relationship with the people outside this island? Who is Sarah to Hank? All these question, although never really fully answered, are given weight towards the understanding of a very, either sick, or extremely passionate man.\r One my biggest pet peeves about the use of imagination in cinema is when it tries to justify itself as reality. It really isn’t that hard; any Marvel movie made from this point on, tries to provide some sort of justification how any of the stuff can happen, within the mythos of the cinematic world to the real world. In other films, say, Warcraft for example, the film establishes itself as work of fictions right away. With Swiss Army Man, the film seems to take itself more seriously than it should, mostly at all times. Directors Dan Kwan and Daniel Scheinert, who refer to themselves as DanielS, find this very disturbing and at times, tantalizing mix of making the film extremely believable and at time totally and completely and utterly unbelievable, the embodiment of reality can be found no where yet tries to justify itself as such.\r The film itself is ridiculous, outrageous and yes, like many have been calling it, unlike anything you have or will ever see on the silver screen, but for once in my life, I don’t necessarily think that that statement is really a good one. I mean, Hank, who goes from one island to a forestry area by riding his dead corpse friend as a jet-ski; Manny fights off bears, he has a erect penis compass, Manny is a swiss army tool of crazy possibilities and it never really digs deep.\r While speaking to others about the reception of the film, it does seem to have a very different response out of everyone who sees it. I mean, after all, the DanielS are the men responsible for the outlandish Turn Down for What music video featuring DJ Snake and Lil Jon, and we all know how funny and ludicrous that video is."
    },
    {
      "rating": "10",
      "text": "Swiss Army Man is undoubtedly one of the best films of 2016. Do not allow the summary of the film to throw you off. Yes, this is a comedy film that relies almost entirely on jokes about farts, erections and \"random\" humor. However, there is much, much more to this film than that. Swiss Army man is funny, genuinely touching, and thought provoking without being pretentious. It explores ideas of social acceptance and our own place in society.I'm giving this film 10/10. This isn't something I'd usually do, even for a film that I love. But while I can understand why some people just won't get it, this film has quickly become one of my favorite films, or possibly even film, of all time. For the love of God, give it a chance, and don't let the immature humor throw you off.Seriously, any film that makes fart jokes poignant deserves 10/10."
    },
    {
      "rating": "6",
      "text": "Yeah that was weird. But in a mixed bag kind of way. Ranging from good weird to cringe to just bad. Parts really worked and others just fell flat on its face."
    },
    {
      "rating": "8",
      "text": "Swiss Army Man is one of the weirdest movies I have ever seen in my life, yet it's so full of charm and adventure that I couldn't say no. The movie uses its bizarre premise to great lengths with beautiful cinematography, great performances, a crude yet clever script, and a great message of friendship, resulting in a movie that I wanted to see again as soon as it ended."
    },
    {
      "rating": "10",
      "text": "Swiss army man is my favorite movie, only a few hours after I saw it. Its truly magical, one of the most enchanting experiences of my life. I was the only person clapping at the end; this film gave me the courage to think that's okay. This movie is more than good; It changed my life. Watch it."
    },
    {
      "rating": "9",
      "text": "Absolutely loved it. Yes it's got its fair share of fart jokes and whatnot, but as a boy myself, I loved it and couldn't stop laughing. The editing and comedic timing were spot on, and when it dips away from fart jokes and into the actual question of what it means to be alive, it's actually quite thought provoking. Already one of my favorite films of the year."
    },
    {
      "rating": "7",
      "text": "Swiss Army Man is all at once a coming of age story, a roadtrip movie, and a romance, but is more importantly a story about a man coming back from the brink of despair. The cinematography is breathtaking, and feels like one is watching a child's dream. Daniel Radcliffe and Paul Dano give performances of a lifetime, and they suck you in to the tale they live through. I felt every emotion while watching this movie. I laughed, I cried, and I came out of the theatre stunned. I remember everyone around me was afraid to move after it ended, lest we shatter the beautiful illusion we just witnessed. My one complaint about Swiss Army Man is that the prologue before the title card is incredibly hamfisted and beats you over the head, and it almost feels like a completely different movie than the rest of Swiss Army Man. I almost walked out I hated the prologue so much, but the rest of the movie more than makes up for a fumbled introduction."
    },
    {
      "rating": "10",
      "text": "whoever made this movie is a **** genius! I was gut-bursting laughing through-out this movie! the script is funny, the performances are amazing! the cinematography is beautiful, the pacing is fast.\r It does what a comedy is suppose to do! make you Laugh! and it mad me laugh!\r 10/10"
    },
    {
      "rating": "8",
      "text": "the third act is what really saved the movie for me and turned it into something special. i think the trailer shows too much of the film, or the film is an extended version of the trailer."
    },
    {
      "rating": "0",
      "text": "Quite possibly the worst movie I have ever seen.  I remember high school attempts at comedy that were more mature.  Probably meant to be \"meaningful\" and \"deep\", but so sophomoric as to be insulting. Most of the \"underlying\" themes were boring versions of shallow thinking \"insights\".  How anyone could spend the money to fund this, is hard to fathom.  It must be one of those \"in\" circle productions, where actors show they are not money driven, producers show they can be \"artsy\" and professional reviewers have to  show that they can find something in this drivel to justify it being made and not insult others in the system by honest reviews."
    },
    {
      "rating": "3",
      "text": "Sorry, but I hated this one. Directed by Daniel Scheinert and Daniel Kwan, Swiss Army Man tells the story of a man, Hank (Paul Dano), who is lost on an island and set to kill himself. However, right before doing the deed, he sees the dead body of Manny (Daniel Radcliffe). Through talking to Manny, Hank explores his loneliness and depression, as well as his own self-esteem and self-image. When talking about this and how it is okay to be unique, Swiss Army Man ultimately winds up just being creepy and weird. It had a chance to be profound about a broken man being saved, but instead opts to just shock audiences with a farting corpse.\r There are a few positives in Swiss Army Man. Paul Dano and Daniel Radcliffe are both spectacular. Plus, whenever it remains focused on examining what makes Hank depressed and run away to this island (well, not really an island), the film is largely quite successful. Typical, but moving and a tremendous character study. Additionally, the music in the film is great with a truly terrific score that elevates otherwise mundane moments.\r Yet, that is about all that counts in the positive column for Swiss Army Man, a film that tries to turn farting into a cause. Relying on both fart and penis jokes to steer the film home, it is also simply an incredibly dumb movie. Hank goes to kill himself, but as it is revealed, he was merely in the woods behind a neighborhood that happens to go by an ocean. Even worse, when it is revealed that this Sarah Johnson (Mary Elizabeth Winstead) in his phone is just some random girl who he stalks and has a picture of in his phone, it spoils the film even more. Until that point, I could write it off as an irreverent and weird film. But at this point, it was a truly creepy film. It wants us to feel sorry for this guy who creeps on this girl so much that he knows exactly where she lives and turns up in her backyard? No way. No thank you.\r Plus, it even serves to spoil the rest of the film. While it was far too weird for me throughout, the scenes of Hank describing love to Manny were quite funny and filled with enthusiastic moments. Yet, since they use Sarah for much of this, it loses any of its luster. When they were joking around and just using a made up name for some swimsuit model, it was whatever. Once they started using a real person that Hank stalks, this moment lost all of its power and wound up just revealing the disturbing and truly chilling level of his obsession with this girl.\r However, had this not even happened, Swiss Army Man had lost me. A little bit of weird and quirkiness is fine by me. Yet, this film dials it up to 11 with the weird and by the fourth time Hank used Manny's gas for some purpose, I knew this was not my kind of film. In defense of this film, everyone said this was not simply a film about a farting corpse like some made it out to be. Having seen the film now, they are right. It is a film about a creepy stalker who uses some corpses gas to not kill himself. Not exactly a winning combination.\r Swiss Army Man can brush shoulders with profundity and comedy, but winds up ruining it with over-the-top weirdness and creepiness. Yes, it is okay to be weird. Yes, it is okay to be weird. However, I do not have to accept a film that begs me to like a stalker with an obsession for some girl he has never met. A truly ugly and thoroughly juvenile film, honestly."
    },
    {
      "rating": "0",
      "text": "As evidenced here, we've come to a point in the historical arc of cinema where one can put just about anything on screen - no matter how childish and stupid -  make it look pretty, and some will call it art. I hated this film, and I hate that some people didn’t."
    },
    {
      "rating": "0",
      "text": "The worst, most pointless movie made in a long time. Must be tough times in Hollywood when even their creative movies are absolutely horrible. Feel free to ignore all the marketing teams on here that are paid to post positive reviews."
    },
    {
      "rating": "1",
      "text": "A plot seemingly devised by a bored 12-year-old boy - farts, a giant boner,  a dream-girl fantasy, and an imaginary friend. Add sycophantic festival reviews to the mix, and you get bloated ratings to match the bloated corpse."
    },
    {
      "rating": "1",
      "text": "I gave this movie a 2 because some of the audience clapped when it ended. A half a dozen people walked out before an hour had passed. I thought this was an absolute nonsense of a movie. I didn't walk out because there was another film that I was going to see in the same theater after this  ended."
    },
    {
      "rating": "2",
      "text": "A terrible mess of a movie. It seems like its trying to tell a message of some kind, but never really delivers. A bunch of sophomoric and disgusting  fart and dead body jokes. Hank needs serious mental treatment."
    },
    {
      "rating": "1",
      "text": "This stunningly awful release literally brings new meaning to the term artsy-fartsy. At times utterly pretentious, at times positively juvenile, at times painfully tedious, this alleged attempt at making \"meaningful statements\" about the human condition falls far short of the mark long before it even reaches the halfway point. A one-star rating is being generous, to be sure."
    },
    {
      "rating": "5",
      "text": "Paul Dano is a man stranded on a deserted island. As he's about to kill himself, a corpse (Daniel Radcliffe) washes up. But this is no ordinary stiff: his farts can be used for locomotion, his mouth spouts clean water and his body has additional unusual applications (hence, the title). This starts out as a wacky, funny premise, but their freaky friendship slows into lots of verbal intercourse about love (what else?), belonging and other tedious existential debate. This feels like a Charlie Kaufman concept, but lacks the genius to carry it off. A highly-original and rollickingly-weird premise that gets bogged down with too much message, repetition of the same joke and a lack of follow-thru on the imagination."
    },
    {
      "rating": "0",
      "text": "Take any sketch from Monty Python's Flying Circus, remove everything that's funny, and you will have Swiss Army Man.  It's 97 minutes long and I watched every minute and I have no clue what the point is.  I turned on the director/writer/whoever's Q&A, listened to three words and then turned it off because if you need to explain the movie then probably the movie is a FAIL.Believe me, I've got nothing against \"weird.\"  I think Scout's Guide to the Zombie Apocalypse is one of the most entertaining films to come along in years. Shaun of the Dead is delightful.  Sin City is awesome.  The Abominable Dr. Phibes is one of my all-time favs.  But this Swiss Army thing . . . man, get a damn story."
    },
    {
      "rating": "1",
      "text": "Absolutely terrible.  Some may ascribe wit and the meaning of life because they wish to give the film more credit than it deserves. if you can see a blank wall and find deeper meaning, you'll like this.  The writing and thoughts being this film are sophomoric and the movie is moronic  Run away"
    },
    {
      "rating": "0",
      "text": "Probably the worst movie of the decade. Overrated fart-centric hipster crap. I mean really, this movie is bottom of the barrel and whoever funded this movie was clearly smoking crack."
    },
    {
      "rating": "0",
      "text": "Never have I seen a movie more obsessed with farting and masturbation.This is a weird, weird movie, which I think you might have guessed from the trailer. Where this movie fails is in its pacing. This is a very, very slow-paced movie, despite being quite short. The first 20 minutes or so of the movie are consumed by the main character talking to himself and an inexplicably useful corpse; it takes until a good bit into the movie for the corpse to start talking back. From there, things get increasingly weird as the corpse, lacking human memories, has to have everything explained to it, which takes a turn towards the perverse, showing just what sorts of thing the living protagonist has on their mind.Alas, the weirdness is not really enough to carry the movie through its slow pacing; very little actually happens, and while the trailer makes it look like the corpse's special abilities are going to be used a great deal, most of the things that the corpse ultimately does are actually *in* the trailer. Thus, while the movie sells itself on that strange premise, a lot of the movie is really about the shy protagonist struggling to demonstrate his personal value as, well, a person, via explaining what life is like to the talking corpse.While the movie does pick up a bit from its initial very slow pacing, it never stops being very weird and full of bathroom humor - farts play a major role in the movie, as do erections, and the characters bond a bit while talking about masturbation. This, combined with the general slow pacing, ultimately proved extremely offputting to me, and while the movie tries to go for an emotional payoff with some of the twists at the end, the movie as a whole doesn't really feel coherent. Is it a comedy? Yes, sort of. Is it a drama? Also yes, sort of. But it never really manages to pull off either - I never laughed at the movie, and often ended up cringing instead, while the drama felt kind of generic, without any particularly interesting spin on it - the protagonist is a loser who doesn't really seem to be proactive about making his life better, why should we care?In the end, I suspect that people who enjoy cringe comedies might get something out of this, but if cringey humor, farting, erections, and discussions about masturbation put you off, this is not the movie for you."
    },
    {
      "rating": "7",
      "text": "Probably the deepest movie with fart jokes out there. Swiss Army Man provides a very juvenile look at life and it's complexities. It's about love, loneliness, friendship, and really just life in general. It's remarkably sweet and touching. Something you might not expect in the face of it's childish and absurd sense of humor.It's a very weird film. It's certainly original and very unique. While perhaps a bit crass in the humor department, the all around craziness of the things I saw kept me laughing throughout. Sometimes things get outright stupid. Yet, the movie's full on embrace of this makes it hard to turn away from. That's partially because there's more to it than just over the top physical humor and masturbation jokes. Swiss Army Man can be surprisingly insightful. It's a little muddled in it's presentation of the topics it wishes to talk about. It's bizarre nature has a tendency to get in the way of the message. Swiss Army Man has a warmth and positivity to it that few other films do. You'll need to have a stomach for adolescent humor to get to the heart of things. If that kind of humor is right up your alley then you may find this to be the dramedy you've always dreamed of. It's certainly not for everyone and perhaps the execution could be better in some areas, but when it comes to outlandish comedy and surprisingly meaningful insights into humans desire for companionship, Swiss Army Man is still largely a success.7.9/10"
    },
    {
      "rating": "10",
      "text": "Невероятное кино в нестандартной оболочке.Многие пройдут мимо, заострив внимание на пердеже и шутках про мастурбацию, мол, как это может нравится адекватному человеку. Но за этим скрыто не мало смысла и замечательной драмы, да и для ценителей такого юмора, всё же, реально смешная комедия. Плюсом идёт замечательная актёрская игра и потрясающий саундтрек.Шедевр, который никогда не будет таковым для всех."
    },
    {
      "rating": "8",
      "text": "Deutsche Review - Kritik Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden? Dann sind hier meine Punkte. Mein persönlicher Score = 86/100 Mein User Score = 9/10Deutsche Review - Kritik Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden? Dann sind hier meine Punkte. Mein persönlicher Score = 82/100 Mein User Score = 8/10"
    },
    {
      "rating": "7",
      "text": "Good creative absurdist comedy that's an enjoyable watch but didn't exactly blow me away. I wouldn't recommend this movie to most movie goers who expect a run of the mill hollywood comedy though."
    },
    {
      "rating": "4",
      "text": "Starts out strong, with the promise of an interesting, quirky adventure (riding a fart-powered corpse atop the waves), then quickly runs out of gas, pun intended. There's just not enough fuel here to power this strange ride to the end."
    },
    {
      "rating": "10",
      "text": "A extraordinary masterpiece full of originality, if you can only step in anothers shoes and think from another perspective. A beautiful moving film full of love and laughter with brilliant acting and writing on all parts."
    },
    {
      "rating": "8",
      "text": "Daniel Radcliffe as a farting corpse...GENIUS. In all seriousness, the film has a strangely irresistible charm and a stupid concept that is cleverly executed, as well as strong performances from its leads."
    },
    {
      "rating": "5",
      "text": "Two strangers in an unusual circumstance take a weirdest journey.\r My initial thought was this is a new version of 'Weekend at Bernie's', but very soon I realised it is not. This film is a bit disgusting. Watching alone makes okay or with the close buddies, but not good for beyond that. I totally appreciate the effort and obviously the fresh idea for a film from the Hollywood, but the film is not a masterpiece or entertaining. Because a plot like this is not worth for a 90 minute stretch. It should have been a short film or the story should have developed to a better one.\r There are lots of questions regarding the film. The film did not detail everything it showed, so that's the first negative about it. It opened with a young man stranded on a tiny island who tries to commit suicide, but abandons the plan and takes a weirdest ride in the sea seeking land to get rescued by its people. Though he's not alone, a strange young man accompanies him. So it's like theirs journey of self-discovery, but how it all ends is the crucial final segment.\r Both the young actors were good in theirs very challenging roles, particularly Daniel Radcliffe. The directors too to be praised for managing to pull it off so well. But it was the screenplay that did not deliver as I anticipated. The film was different, but nothing impressive at all, so I think it is good for watching at once. Maybe if I understand or get the answers for my doubts, I might change might stance. For now this is an average film.\r 5/10"
    },
    {
      "rating": "7",
      "text": "Let's give a film credit for its originality while also saying there are some aspects that just don't work.  All the performances are great especially Daniel Radcliffe it really takes a unique actor to pull off his role.  Overall if you can make it through all the farting there really is an intriguing film here.  One I definitely want to check out again.  B+"
    },
    {
      "rating": "6",
      "text": "It's supposed to be an ambitious comedy, but, not only is pretensious instead of as comic isn't that funny as could be, but at least Swiss Army Man has personality and it's possible connect yourself with characters, beyond showing great symbolisms when it wants."
    },
    {
      "rating": "10",
      "text": "One of the best movies i ever watched. the movie is sending the message \"what it means to be alive\" in a bizarre way yet a gorgeous one. just let it grow on you and just go with it and you will have the greatest experience in any movie. i mostly hate body humor but had a lot of laughs. oh and get some tissues to prepare for the AWESOME ending. all set? ok go get some more tissues ."
    },
    {
      "rating": "4",
      "text": "The surrealist concept fails to keep its momentum over the 90 min runtime resulting in me falling asleep mid watch on more than one occasion. There are some fun moments especially if you're a fan of Radcliffe but for the most part the pacing drags it's heel to the end."
    },
    {
      "rating": "4",
      "text": "love the actors......the end kinda sucked...this movie has lost its mind somehow......without the farting this movie could have been cool.......too bad"
    },
    {
      "rating": "8",
      "text": "\"If my best friend hides his farts from me then what else is he hiding from me, and why does that make me feel so alone?\"\r Never would I expect a farting talking corpse would've turn out to be a good movie. Even on paper, this idea sounds awful, but it's one of those things that manages to work out. I always hear people complain that movies just ain't that original anymore, with the endless reboots and the unnecessary squeals. And then you get something like this that's so different. Something so bizarre, weird and original that it's executed in a way that it actually works as a movie.\r There's something deeply beautiful and very relatable about \"Swiss Army Man\" that I know a lot of people won't agree. It isn't for everybody. I mean, just look at the reviews for Sundance and the reports of walk outs during the movie. But then again, what do they know.\r Daniel Scheinert & Daniel Kwan bring a sweet and a very surreal study of the human condition that's done so uniquely. Making farts jokes seem so poetic.\r This is Daniel Radcliffe at his best and while he's character may be dead, there's still heart within him. Paul Dano who really has been impressing me over the past years is really great in this. Radcliffe and Dano brought a sense of friendship and a real chemistry that after awhile it kinda over shadows the wackiness of whats going on. Some people may find the scenes between them too disturbing or creepy, and I can totally understand that. But it's something that's hard to explain really. Even if you try to put together why something like this worked, but it never fully clicks in your head as the correct answer. Well, what can I say. Movies make you feel something man.\r Overall rating: I'm no gonna lie, I teared up a bit while watching this. Yes, a farting corpse movie actually made laugh, cry and think differently on things.\r WOW."
    },
    {
      "rating": "10",
      "text": "Don't let the constant absurdity or onslaught of fart and sex jokes fool you, Swiss Army Man is a hilarious and profoundly beautiful, unique and meaningful feelgood movie.\r A magical movie. Daniel Radcliffe has outgrown HP for me and will now, for me, be defined by this film (until his next amazing project of course). I sincerely hope the creators get some Oscars for this shining gem because they truly deserve it. I haven't cried or laughed like that in a long time. This movie is a great example of how films can be both extremely entertaining and unequivocal ART."
    },
    {
      "rating": "9",
      "text": "It's really beautifully shot and acted and the soundtrack is perfect.  If you know anything about the story than you know it is odd and filled with bodily humor.  But it's very touching as well and why would anyone want to watch a super straightforward rehash of a movie? There are no profound themes that haven't been explored before, but I doubt they have been explored in this manner. Those that are uncomfortable with the body humor really illustrate some of the ideas being explored. If they can't even watch \"fake\" bodily functions and not feel ashamed how can they live in their own bodies and not carry shame with them every day?"
    },
    {
      "rating": "7",
      "text": "Wow what an odd movie. It's most definitely an original film. The performances by Daniel Radcliffe and Paul Dano were spectacular. There were also some genuinely funny moments as well. This movie is so hard to categorized too. Overall a good movie that will not get much attention."
    },
    {
      "rating": "9",
      "text": "This is a must see movie.  Sit down, open your mind, and enjoy the ride.  I understand the polarization that I see in reviews.  Some people will not identify with the playful, and absurd tone. It's smart, funny, sweet, and sad."
    },
    {
      "rating": "9",
      "text": "A wonderfully unique and strange film that takes a hard, deep look at what it really means to be human...through farting. While I was not crazy about how it ended, I still adore this movie and consider it to be one of Daniel Radcliffe's best films to date."
    },
    {
      "rating": "6",
      "text": "I don't think I've ever been left this speechless after a movie...which makes writing a review rather difficult, but I'll try anyway. Paul Dano is stranded on an island, hopeless and alone but with the help of a corpse played by Daniel Radcliffe they go on an adventure. Yes it's as weird as it sounds, and the movie does take some time out to acknowledge how weird it is and just when you think it can't get any weirder it does. Honestly I don't know if I liked it but I do know I liked both Radcliffe and Dano, together they give excellent performances. It also got one genuine laugh from me along with countless other moments of awkward laughter. Recommended but if the idea of a farting corpse is off putting then maybe give this one a miss."
    },
    {
      "rating": "9",
      "text": "It put a stupid grin on my face and gave me a warm yet bittersweet feeling in my heart the whole way through. Paul Dano and Daniel Radcliffe give absolutely stunning performances and are goddamn great together. The music is perfect, so endearing and enchanting. While being quite silly at times the film delivers a heartfelt message. I loved this film to bits and would recommend it to anyone. The one and only gripe I have about Swiss Army Man is that I was not in love with the ending as much as the rest of the film."
    },
    {
      "rating": "7",
      "text": "A guy marooned on an island is getting desperate. Daniel Radcliffe's corpse washes up on the beach. A fantasy ensues in which the corpse has special powers which save the guy. There's conversation on life, love, sex and death so there's plenty to talk about for those not grossed out."
    },
    {
      "rating": "6",
      "text": "It's one of those films that you not sure if it's a sick joke or just sick, all the way through. Watch it for free \"somehow\", but only if you are in the right mood. The Korean film 'Save the Green Planet' does the whole 'dark twisting dance' of audience manipulation much better, but still, the wife and I managed to not stop watching it until the end.\r Punchline."
    },
    {
      "rating": "6",
      "text": "Quirky and Fun. This is a unique film and its definitely not for everyone. I enjoyed the film especially the performances, but I didn’t find the same love others have been finding with it. I felt the emotional impact of their friendship misses the mark and it doesn’t bring it together at the end."
    },
    {
      "rating": "10",
      "text": "One of the best movies I've seen. The opening miuntes I found myself bored, but the second Daniel Radcliff washes up, the movie takes off. I can't recommend this movie enough. I laughed and cried, and I haven't cried in a movie since \"Radio\". 12/10 would watch again."
    }
  ]
}