{
  "id": 4120,
  "title": "T2 Trainspotting",
  "starring": [
    "Ewan McGregor",
    "Jonny Lee Miller"
  ],
  "runtime": 117,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "After 20 years abroad, Mark Renton returns to Scotland and reunites with his old friends Sick Boy, Spud and Begbie.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xlbpCwa9OXXIiNgXcwuompHFIk9.jpg",
  "categories": {
    "plot": 5.767441860465116,
    "acting": 6.102564102564102,
    "ending": 6.25,
    "soundtrack": 5.875,
    "cinematography": 4.857142857142857,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "7",
      "text": "T2 unfortunately becomes less of an independant sequel and more of a 'reunion' piece. Most of the movie is intercut with scenes from the original, adding a familiar plot. Overall the acting and pacing is well done; I had just hoped for more."
    },
    {
      "rating": "6",
      "text": "\"Trainspotting 2\" is creative and absolutely bonkers coming from Danny Boyle. The whole thing is on speed, never losing heat. While not having a straight forward narrative that many will lose interest in. A sequel to a already brilliant movie seems unneeded, but I was along with the ride and enjoyed every minute of it. Good to see the old gang again.The soundtrack and ending was amazing by the way. It's the highlight of the film for me."
    },
    {
      "rating": "3",
      "text": "A bad film. As a fan of Welsh writings and the first movie i felt sad watching this. And not because it was touching, but just because it was really bad.It doesn't understand the Characters as they are portrayed in the book trilogy. The film also shoves the \"Social Media are the new drugs\" rhetoric that's bad. So \"Chose a maxi televisor\" became \"Chose facebook\". Is sad. That's not the Renton i know. And also the relationship between Renton and Sick Boy is stupid and awfully portraied. If you are a fan of the first film watch it, but don't expect a masterpiece.If you are a fan of the books don't waste money on it. It's a scam."
    },
    {
      "rating": "7",
      "text": "Danny Boyle and co. return to Edinburgh's seedy underbelly for \"T2: Trainspotting,\" a \"Trainspotting\" sequel you didn't know you deserved. Being such an instrumental step in launching the respective careers of almost everyone involved (Boyle, Hodge, McGregor, Bremner, Miller, and Carlyle included), yes, of course, the original film it going to be an integral part of the sequel. That doesn't mean that this is the \"Trainspotting\" fan service picture show, however. This is a film that employs plaintive reverence in referencing and hinting at events that happened in the previous film, without hinging itself upon them. This is because there's also a genuinely interesting and intoxicating story at the center of this sequel that helps it stand on its own. And, with the four lead performers as devoted to their beloved roles as ever, and Danny Boyle's frenetically stylistic \"Boyle-isms\" as on point as can be, it all ultimately renders down into a simply good film, \"Trainspotting\" notwithstanding."
    },
    {
      "rating": "9",
      "text": "T2 is one of the most gorgeuos looking movies of this year and a really goodsequel to its first one.Danny Boyle's Film Making is absolutely brilliant with great performances and a emotional punch into the mix. Though the Movie isnt as trippy as the first one its still a really enjoyable one with what the characters been upto for 20 years ."
    },
    {
      "rating": "6",
      "text": "Whilst this film doesn't feel as kinetic as the original it provides us with a nice viewon ageing and what is does (or doesn't) do for us. This film does seem a lot more pointless and the ending gets racked up into a silly hollywood-like chase, and with some gratuitous cinematic and editing decisions made that shows this films wants to be something new but can't let go it's predecessor. The film overall becomes sloppy and overdramatic in its narrative, but still offers enough visual and comedic wonder to the screen to make it at least a worthwhile watch. This film is funnier than the first, but in no way is it better. An enjoyable, yet needless reunion. 6.0/10"
    },
    {
      "rating": "7",
      "text": "What’s with the title? Everybody knows that T2 means only Terminator 2 and this kind of abbreviation should not be used in other cases! But the movie itself is not bad, not bad at all. Most of all a sequel and fan service to modern classic „Trainspotting“ (1996), still a damn fine junkie movie in its own right, which flung Ewan McGregor and director Danny Boyle to international movie career-dom. It also certainly helped the other stars such as Kelly Macdonald, Robert Carlyle, Jonny Lee Miller and Ewen Bremner – but they have stayed relatively less known to wider public, especially just by the name.I don’t want to reveal too much about the events but the Renton is back home and tries to make up with the old buddies that he robbed blind before leaving for good 20 years ago.So, the gang is back, ready to give choosing life another go. If you care about the first movie, you will probably like the new one too. If you don’t know the characters and faces, then it’s probably harder to hop on the „Scottish city youth working class junkie“ train and instantly care about the main characters and their quarrels.But everybody behind and in front of the camera gives their darndest best to make you like the material, and they succeed. The result has enough action, humor, suspense, and depth to be recommended for newcomers also.Both „Trainspottings“ are partially based on the novel of the same name by Irvine Welsh. The 1996’s movie was a straight-er adaptation, the second one uses a bit of both the original novel and the sequel „Porno“ to create something new-ish. It would be fair to call the result an action comedy that stands on its own, but keeping the original’s sense of black comedy intact, and the characters of course. „T2“ may not look much like the „Trainspotting“ but it feels so fresh and captivating that that’s not gonna be a problem. We will get all kinds of tongue-in-cheek nods to the original experience but the visual style is exciting and modern, as it should many years later. Boyle truly is one of the more interesting directors working today, as his countless fans would gladly agree. .I’ve read many of Welsh’s books, including „Trainspotting“ and „Porno“. I’ve also seen all of the movie versions (excluding „Ecstasy“), with the favorite being „The Acid House“. I feel that „T2“ is the most un-Welsh-like adaptation so far, and it strays from the novel, but it’s not a bad thing because the movie makers have managed to carve out something new, fresh and interesting. There’s less of doing drugs in „T2“ but somehow there’s an even sharper sense of what drugs can do to a person and relationships in the long run. The deeper message is sharp: if you don’t find a meaning to your life, there’s not gonna be much of a life for you in store.Acting is fine all around but I especially like how much Carlyle as the notorious Begbie has changed. He seems even more reckless, horrifying and dangerous than before – up there with cinema history’s greatest bad guys surely –, but there’s also a new unspoken dimension of sadness and unlived potential which the actor translates and brings to the screen. It’s a masterful performance and actually the emotional anchor to movie as a whole.So all in all, this is a good example of a sequel done right. I did not exactly need this but am surely glad that they made it anyway, and with some conviction and purpose. It will not stay in memory as long as the predecessor but it’s well made in every aspect!"
    },
    {
      "rating": "10",
      "text": "After 20 years, the new main \"addict\" is no longer the drug addiction, the aesthetic hallucinations, but it is those same routines, the comfort zone that takes us the end of the human being to final despair. Perhaps the film has always addressed this since its first film of 1996. The city of Edinburgh is a stifling environment in which director Danny Boyle knows how to do well to interact the viewer with the iconic characters. The soundtrack and catchy phrases show us the passion to produce this fickle and captivating film in the head from the British creator Irvine Welsh. Pure and honest nostalgia. \"Choose future, Choose Life\"."
    },
    {
      "rating": "1",
      "text": "This film is like reading old graffiti in a toilet then drawing a sad face next to it using a syringe as a pen.T2 Trainspotting  is an extended recap of Trainspotting without the promise of a cyborg Armageddon\"Previously in trainspotting, a bunch of losers took heroine and danced to iggy pop\".As relevant as Begbies wasted erection. Load of old pish basically.Shame on Irvine Welsh and Danny Boyle for polluting the world with this drug propoganda music video."
    },
    {
      "rating": "8",
      "text": "Twenty years have passed since Ewan McGregor's character ran off with the haul from the quartet's heist in the original. He returns to make amends and catch up with the gang. Much hasn't changed for them or for director Danny Boyle. He still crams the film full of vibrant imagery, flashy editing, a pounding soundtrack and mildly extreme moments. (The Scottish accents are still sometimes hard to crack.) Flashbacks from the original add poignant moments, but the guys are as spunky as ever. There's not a lot of plot…just interactions between them, but it still holds up as a flashy cinematic reunion."
    },
    {
      "rating": "6",
      "text": "It's not bad but way too reverential of its own origins. Which I adored. Spud hams it up and and a couple of cameos for good measure. I did like the Carlisle arc with his family. I wish he would have continued it through the end."
    },
    {
      "rating": "9",
      "text": "T2 is fast, gritty and blunt. No time is wasted. No Heavy exposition. No long drawn out scenes of philosophical pretentious garbage (not that I don't love philosophically engrossing films). Just Harsh realism. Boyle takes us back to our favorite heroin **** ups trying to deal with the present and recapture the past and find some-sort of meaning in their lives. Transpotting 2 is an experience. Boyle play's heavy on the idea of Nostalgia throughout the film which, in a way, is very much welcome and beautifully executed as to not feeling forced or unnessesarilly. These characters are old, tried and still as ****ing lost as they where in the past.Transpotting to is amazing. Not perfect. But damn near close to perfection. I recommend every fan of Trainspotting to go out and see the film. U will not regret it"
    },
    {
      "rating": "6",
      "text": "Kind of a cool sequel, but not nearly as interesting as the first. Enjoyed the performances, but hard to recommend it very strongly. The new female character was out of place I thought."
    },
    {
      "rating": "2",
      "text": "Lame. Honestly the characters are just as weak and pathetic as the last movie minus their youth which is what this movie about. Its got all the annoying Boyle flourishes and tropes. After all that's happened to them you would think they would grow wiser but alas its all about lamenting the passage of time. Its not suprising when they get cucked by a whore(Boyle seems to enjoy putting cucks in his movies) becoz its heavily telegraphed. Ewan shows his buttocks again. Just forget this movie happened."
    },
    {
      "rating": "8",
      "text": "Being only a modest fan of the 1996 original, I went into this with really not too many expectations. Just a simple 20-year follow up that might make me feel a bit nostalgic while delivering a decent story. All I can say is man this did not disappoint! My expectations were met and then some! It turned out to have a lot more original and funny ideas and moments to show throughout, all while maintaining the same tone and charm of the first film, and even paying great homage to it for fans who are all too familiar with some of its plot points! Seriously, I honestly wasn't prepared for how funny this film got at times! On the acting side, Ewan McGregor shines once again in the lead, as do the other returning cast members from the first film! And of course, Danny Boyle's direction is spot on as always! Overall, while it obviously can't live up to the first film in terms of originality, it makes up for in finding the perfect balance of nostalgia and fresh, funny, and new ideas and directions! Simply put, choose life! And for those who even moderately enjoyed the first film much like I did, choose this film!"
    },
    {
      "rating": "9",
      "text": "Trainspotting is one of my favourite movies and I rank them among the greatest movies ever. I'm not sure what these critics are seeing but I feel like this movie is a phenomenal sequel and one of the best, as far as sequels go. If you were ever a fan of the first one, make sure to go out of your way and see this one too. It packs great soundtrack, cinematography, acting, and storytelling. This movie will keep you on the edge of your seat!"
    },
    {
      "rating": "7",
      "text": "Danny Boyle brings us a sequel to the much loved Trainspotting. Rejoin Renton, Spud, Sick Boy and Begbie. Picking up the story 20 years later, forgetting the fact that they’d all probably be dead after 20 years but who cares. You’re gonna get a giant kick in the teeth with nostalgia and I strongly suggest you watch the first one before seeing the sequel to get all the references but I enjoyed this as much as Trainspotting. No it’s never going to be better than the original, nor does it have the same shock value but it’s more than I could hope for in a sequel. It’s funny, it’s disgusting and it’s highly recommended."
    },
    {
      "rating": "6",
      "text": "Le pongo un 6 mas que todo por respeto a su predecesora, la cual me gustó mucho, esta, sin embargo no logró cautivarme ni un poco, es prácticamente lo mismo pero 20 años después."
    },
    {
      "rating": "8",
      "text": "Putting aside the difference of 20 years, it´s nice seeing againg same cast. The formula still works and fine: caustic and black humor, delirious sequences; and some relevant flashbacks. The OST is smashing, shall to run for it."
    },
    {
      "rating": "8",
      "text": "After 21 years of waiting, the sequel to 'Trainspotting' has finally become a reality, and what a fantastic ride it is. Sure it lacks the flare that made the original the classic it is, but with new ideas and a worthy plot that wraps up the original's ending, 'T2 Trainspotting' finds inventive ways to allow us to love the characters we grew up with.Returning to Edinburgh after 20 years in Amsterdam, Renton tries to re-connect with his former crew (Spud, Simon and Begbie) despite leaving them robbed at the conclusion of the first film. With a mix of black comedy and emotionally resonant drama, we are launched back into each of the individual's lives as their past comes back to haunt them. With beautiful cinematography, a fantastic soundtrack that once famously featured Lou Reed's 'Perfect Day' and Iggy Pop's 'Lust for Life' and a rather intense conclusion that leaves us on the edge of our seats, a very worthy sequel."
    },
    {
      "rating": "9",
      "text": "The boys are back! But what you should remember is the boys are not boys anymore, they're not the young drug addicts who are fighting with life, they're the average people who are trying to survive life. Danny Boyle did something great with the kids from 20 years ago... Only bad side is the deleted scenes and their meaning to the whole story..."
    },
    {
      "rating": "6",
      "text": "resurrection for incarceration..T2 TrainspottingAfter a massive success and a long time return to their home, the makers wants to take their time on this one and really chew it off and enjoy thoroughly as much as they can. And in order to do so, they somewhere between there looses its original essence and doesn't account the viewers requirements. Having said that, it doesn't suggest that it is a bad one in any possible way, its just that it doesn't live up to the expectation that its predecessor set. There is a genuine purpose and a closure to a sort-of open ending left in its first installment, and this is what helps the feature from sinking completely below average. The writing is still intriguing, unpredictable and justifying in its own terms and perspective depicted in here. The newer edition in this second act would definitely be the visuals which is the highlight of it as it is mesmerizing and cringing at the same time and all the credit goes to the amazing and poetic cinematography. Danny Boyle is no short on execution but the screenplay is the real culprit in here that sucks out its soul before it even gets the chance to breathe. Again, on performance objective, Ewan McGregor has got it covered and is supported too with a decent cast. T2 Trainspotting is basically the resurrection for incarceration, of the beloved character who fails to create the anticipated magic that the audience were expecting especially returning after these many years."
    },
    {
      "rating": "8",
      "text": "Boyle at his brilliant best; smart, funny and fast paced. Crazy entertaining."
    },
    {
      "rating": "6",
      "text": "It has been a fair while since I watched Danny Boyle's Trainspotting, but T2 Trainspotting is nonetheless a welcomed return to Edinburgh, where we find our protagonists from the first film. While possessing the same characters and much of the same spirit as its predecessor, the film rarely feels like it is anything but a sequel. It is the kind of film that reminisces on the events of the previous film - a lot of which is brought on naturally with the characters having not seen one another for 20 years either - and never really takes the time to establish its own memories. It is so caught in the past, it forgets to establish the present, opting instead to spend the whole rehashing old plot points and then just winding up ending the same exact way essentially. It is the kind of sequel that, as it goes along, it just sort of winks at the audience and asks, \"You remember that part of the first movie?\" While still a largely positive experience, Boyle and his sequel never really live up to the original nor does it ever establish why this was necessary.As with the original, T2 Trainspotting continues to feel like a perfect match between material and director. Focusing on this group of junkies and where they are 20 years later, the film shows some dabbling in drugs and some general re-focusing of their addiction on something positive. Yet, the jump cuts, the \"hip-hop\" cuts, and constant musical feeling to the film is right up Boyle's alley. His jarring and uncomfortable method of shooting films always leaves his work feeling wholly original and an experience that can only come when watching a Boyle film. After seeing Steve Jobs be largely devoid of Boyle's voice in favor of Aaron Sorkin's, it is a welcome return to \"Boyle the auteur\" instead of \"Boyle the hired gun\". While Steve Jobs is a better film, it could have been directed by any number of capable talents. As it stands, T2 Trainspotting is a film that could have only come from Boyle. Jumping from scene-to-scene rapidly, infusing 1970s/1980s rock music, and constantly \"flickering\" light due to trains passing outside, T2 Trainspotting is a kinetic and frantic film at all turns due to who is sitting in the director's chair.In the course of the film, the greatest achievement by T2 Trainspotting is its portrayal of addiction over time. Obviously, when they were young, they were focused on getting high. Now, in their 40s, these men look back at themselves and wonder why. Some are still addicted to heroin, some do cocaine, another was in jail, and the other is free of drugs. Through deaths of children, impotency, missed chances at fatherhood, and divorce, these four men are still lost and trying to find themselves, having wasted their youth on drugs and still wasting their lives on drugs and crime. Yet, they are not just lost causes or losers who cannot help themselves; they are addicts. As Mark (Ewan McGregor) so astutely puts it, they are all addicts but they need to find something else to be addicted to. For all of them, they continue to be lost and stab one another in the back because they fall into the same habits, refuse to grow up, and continue to get lost in their addiction once they get back into their old way of life.However, while the film can compel in that fashion, it also cannot help but repel and make the audience wonder why they bothered. It is not a bad film as I said. Boyle and the smart commentary on addiction over time more than make it worth a watch, but it is a film that feels more obsessed with showing clips from Trainspotting than actually telling a story. Hell, Spud (Ewen Bremner) even writes a serious of stories about their time 20 years ago that the characters sit around and reminisce about. Boyle cannot help but cut to scenes from the original, highlighting for the audience just how similar everything is and how they go through the same beats. Thematically, it obviously shows how nothing has really changed and these are the same people prone to the same mistakes. In other words, one never heals from addiction, they just find news ways to cope with it. However, cinematically, it rarely works. Instead, the film feels more concerned with reminding audiences of what happened, referencing itself, and then just cutting to the chase and showing clips of the original. It is the kind of self-referential style that comedy sequels often take and are criticized for, yet T2 Trainspotting seems to have gotten off scot-free on this issue. While it does not ruin the film and the overall picture comes out alright in the end, it does make it a sequel that feels too much like a re-hash and re-envisioning of the original instead of a strong and worthy continuation of the stories of its characters."
    },
    {
      "rating": "5",
      "text": "To face a revenge threat!Okay the first film was good one. Then I thought it was unnecessary to make a sequel for it. But someone clarified that it was not made outside the novel to make money. It's indeed adapted from the sequel book of the original film's source. Though coming out 20 years later was the disadvantage. Except some praises it had received, particularly by its hardcore fans, it was average at the box office and I thought same as well.I did not like the story. It was just a random drag, not knowing what direction to head. That's until the third act, and once all the three main characters come together, so it gets interesting with something. Like surviving from from a revenge threat. It was the actors who saved the film. Otherwise, it is not even an average as I consider now. I don't think retaining the title was a good idea, but I think it was just for its fans. Or else, a new title name would have done a decent justice to what it had narrated.As I know, this is the director's first ever sequel and he's not getting better since his Oscar win, a decade ago. Especially the last two flicks, despite based on the very good subjects. Definitely no to the T3. Instead, I want another Oscar nod film from him. This would have been ever worse if somebody else would have made it. Yet, a watchable film, only if you had liked the first. So just think about it before going for it after seeing only positive words from a few people.5/10"
    },
    {
      "rating": "8",
      "text": "Good !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "6",
      "text": "The first one felt much more real and intense. This one feels more comedic - if you can call it that, as it still treats serious subjects. But while the first one was serious with some comedic elements, this welt a bit more too comical and like it was pushing to get what they had in first movie too much. Still enjoyed it though."
    },
    {
      "rating": "8",
      "text": "On reprend les mêmes et on recommence... ou plutôt on continue là où on s'était arrêté 20 ans auparavant. C'est un gros défi de sortir une suite après tant d'années et pourtant un défi largement relevé et réussi, contre toute attente !C'est que le scénario -encore un brin alambiqué ici cependant- a su profiter du temps passé et habilement l'exploiter : entre nostalgie et désenchantement, nos lascars (irrécupérables...) ont sensiblement changé tout en restant les mêmes. Car chassez le naturel, il revient au galop et nos branques restent des branques, encore tarés, magouilleurs et excessifs... Mais moins camés qu'avant tout de même. L'ajout de la petite nana est un choix discutable et assez anecotique malgré son importance vers la fin : elle constitue davantage une pièce rapportée qu'un personnage aussi intéressant que les autres...En tout cas, les comédiens malgré le poids des ans ont toujours les tics et les tocs de leurs personnages et une patate d'enfer, à l'image de cette bande originale qui envoit encore du lourd quand il faut. Avec l'expérience, ils sont devenus plus vicelards et plus sournois, chacun à leur façon (d'abord l'opportunité puis la trahison...) tandis que Carlyle, notamment, n'a rien perdu de la rage du psychopathe, bien au contraire...Le film reste assurément déjanté, bien drolatique par moments mais désormais émouvant de temps à autre (le désenchantement dont je parlais plus haut) alors que les protagonistes dressent un état des lieux de leur vie et choix passés...Globalement et de manière surprenante, la suite parvient à s'élever par rapport à l'original : moins sur la surface, elle donne plus d'épaisseur à cette bande de tarés qui ne se sont pas bonfiés avec l'âge mais nous apparaissent plus humains que jamais."
    },
    {
      "rating": "9",
      "text": "It is more a movie about ageing, lost masculinity, and memories and less about drugs. Its great to see all of the original cast together after 20 years. I was skeptical about it until I saw it."
    },
    {
      "rating": "3",
      "text": "It has been a very long time since I saw a movie as masturbatory as this one. The original is a masterpiece, a movie that will stand up as well in 20 years time as it does today, as it did upon release. It was a window into a world most of us didn't know. It was human, it was gritty. Well written, brilliantly directly, amazingly scored. This is the opposite on every single level.Firstly the movie constantly calls back to it's predecessor and not even in subtle ways. When it isn't literally showing you clips of the first movie, it is having it's characters basically re-enact aspects of it. My breaking point was in a chase scene in the final third Mark gets thrown off a car and lands roughly in front of it. I said aloud \"For Christs sake don't do the smile, please don't do the smile...\" Brief pause and Ewan McGregor does the exact same grin and laugh from the shoplifting scene in the first. At that point I became fairly certain that they either weren't even trying/cashing in on the first or were just so smug they once made a great movie they couldn't help but remind you every chance they got. This isn't nostalgia, it is masturbation.Boyle takes every conceivable chance he gets to thrown some pointless visual effect on the screen. Spud talks about forging signatures? We need some writing in the air. Two characters are babbling inanely? We need those words printed in the air. It comes off like a terrible music video that somebody was allowed to go on for 2 hours with. This movie is so offensively over-directed it spills from the screen in every single scene. Somebody obviously told Boyle early on that the whole CCTV footage camera angle was a good idea because dear god does he go back to that well so often it gets to be baffling.Whoever scored this, when he wasn't de-constructing \"Born Slippy\" into a ponderous, stripped out, car wreck of it's original form, decided that people no longer needed ears. Music blares into scenes abruptly and at full volume to the point you spend most of the movie fiddling with the volume. I don't know that I've ever seen a movie with worse musical choices. There is no club in the world where the entire place sings in perfect unison to \"Radio Gaga\". Literally as I write this more and more things come to mind of how awful it is. If you were any kind of fan of the book the part where Spud begins to write his \"memoirs\" which are instantly recognizable as the text of the novel is so cripplingly meta it will make you groan. More so with the whole \"oh who'd ever read stories written by a nobody?\" It doesn't work. On any level. Trainspotting is generally considered one of the finest novels of its genre for the last 25 years. This is akin to having the narrator in Fight Club sit there in odd scenes scribbling away and have Tyler Durden say \"Hey what are you writing there?\" and then have the narrator hurriedly hide his scattered pages away \"oh, it's nothing...nothing\". The only person who will think this is a good idea is somebody who never read the book or even knew the movie was a book in the first place.Why was Veronika even in the move except to give a narrative bridge to move the plot from A to B to C? Why is she hanging around a bunch of middle aged junkies? The character felt wedged in to make the scenes somehow fit together. This was terrible. I don't say that lightly. I love the first movie, love the book, but this was absolutely awful. When it wasn't stroking itself frantically to how good it's predecessor was, it was making terrible decisions with its current iteration or just outright re-using material from it. In 2 hours I would honestly say 30 minute of it is either footage from or derived from material from the original. Kelly MacDonald presumably showed in this as some form of show of gratitude for giving a very respectable career its start but she wisely only has a cameo in this. The rest of the time the various acting abilities of the leads (McGregor, Bremner, Carlyle, Miller) are utterly wasted here by poor writing and even worse direction. Boyle seems more interesting in what he can do with the camera or what effect he can transpose on the screen than giving direction. McGregor tries in vain to pump life back into the \"Choose Life\" speech but the writing smacks of an out of touch 40 or 50 year old trying to re-hash something from a bygone era with painful references to social media. The original works because of its ability to draw on things that society expects you to want, that leads you to believe that you want but that you don't actually need. It's timeless because it applies to basic human emotion, regardless of the era. Their updated version of the speech sounds like some woeful soapbox rant about the inanity of the modern age. It's neither done well nor in a way that will age well. This was dreadful. Absolutely dreadful."
    },
    {
      "rating": "3",
      "text": "It has been a very long time since I saw a movie as masturbatory as this one. The original is a masterpiece, a movie that will stand up as well in 20 years time as it does today, as it did upon release. It was a window into a world most of us didn't know. It was human, it was gritty. Well written, brilliantly directly, amazingly scored. This is the opposite on every single level.Firstly the movie constantly calls back to it's predecessor and not even in subtle ways. When it isn't literally showing you clips of the first movie, it is having it's characters basically re-enact aspects of it. My breaking point was in a chase scene in the final third Mark gets thrown off a car and lands roughly in front of it. I said aloud \"For Christs sake don't do the smile, please don't do the smile...\" Brief pause and Ewan McGregor does the exact same grin and laugh from the shoplifting scene in the first. At that point I became fairly certain that they either weren't even trying/cashing in on the first or were just so smug they once made a great movie they couldn't help but remind you every chance they got. This isn't nostalgia, it is masturbation.Boyle takes every conceivable chance he gets to thrown some pointless visual effect on the screen. Spud talks about forging signatures? We need some writing in the air. Two characters are babbling inanely? We need those words printed in the air. It comes off like a terrible music video that somebody was allowed to go on for 2 hours with. This movie is so offensively over-directed it spills from the screen in every single scene. Somebody obviously told Boyle early on that the whole CCTV footage camera angle was a good idea because dear god does he go back to that well so often it gets to be baffling.Whoever scored this, when he wasn't de-constructing \"Born Slippy\" into a ponderous, stripped out, car wreck of it's original form, decided that people no longer needed ears. Music blares into scenes abruptly and at full volume to the point you spend most of the movie fiddling with the volume. I don't know that I've ever seen a movie with worse musical choices. There is no club in the world where the entire place sings in perfect unison to \"Radio Gaga\". Literally as I write this more and more things come to mind of how awful it is. If you were any kind of fan of the book the part where Spud begins to write his \"memoirs\" which are instantly recognizable as the text of the novel is so cripplingly meta it will make you groan. More so with the whole \"oh who'd ever read stories written by a nobody?\" It doesn't work. On any level. Trainspotting is generally considered one of the finest novels of its genre for the last 25 years. This is akin to having the narrator in Fight Club sit there in odd scenes scribbling away and have Tyler Durden say \"Hey what are you writing there?\" and then have the narrator hurriedly hide his scattered pages away \"oh, it's nothing...nothing\". The only person who will think this is a good idea is somebody who never read the book or even knew the movie was a book in the first place.Why was Veronika even in the move except to give a narrative bridge to move the plot from A to B to C? Why is she hanging around a bunch of middle aged junkies? The character felt wedged in to make the scenes somehow fit together. This was terrible. I don't say that lightly. I love the first movie, love the book, but this was absolutely awful. When it wasn't stroking itself frantically to how good it's predecessor was, it was making terrible decisions with its current iteration or just outright re-using material from it. In 2 hours I would honestly say 30 minute of it is either footage from or derived from material from the original. Kelly MacDonald presumably showed in this as some form of show of gratitude for giving a very respectable career its start but she wisely only has a cameo in this. The rest of the time the various acting abilities of the leads (McGregor, Bremner, Carlyle, Miller) are utterly wasted here by poor writing and even worse direction. Boyle seems more interesting in what he can do with the camera or what effect he can transpose on the screen than giving direction. McGregor tries in vain to pump life back into the \"Choose Life\" speech but the writing smacks of an out of touch 40 or 50 year old trying to re-hash something from a bygone era with painful references to social media. The original works because of its ability to draw on things that society expects you to want, that leads you to believe that you want but that you don't actually need. It's timeless because it applies to basic human emotion, regardless of the era. Their updated version of the speech sounds like some woeful soapbox rant about the inanity of the modern age. It's neither done well nor in a way that will age well. This was dreadful. Absolutely dreadful."
    },
    {
      "rating": "8",
      "text": "To quote another reviewer, \"not as kinetic as the original\", but still definitely worth watching if you're a fan of Trainspotting. It isn't a new story, really, rather than an on-brand continuance, but I still thought it was pretty fantastic. It makes more references to the novel and is very funny. Liberties were taken with the editing and cinematography, but they don't interfere and pay off, occasionally. Some of the best things they did were expanding Spud's character and, of course, their soundtrack. As always.Honors the first film. Had a really great time watching (& re-watching)."
    },
    {
      "rating": "7",
      "text": "T2 Trainspotting is a good follow-up to the original film. The film still manages to disturb the viewers by showing to them yet another side of drug abuse, although the first film did it a lot better. The acting was superb, especially from McGregor, who still plays the character with vigor and charm, even though he has not played the role for 20 or so years. The cinematography was great, too. The only problem I had was the story, and I found it a little convoluted, with the focus switching from character to character, and never building on anything solid unlike the first one. But overall, it was still enjoyable and a definite must-watch for the fans of the first movie."
    },
    {
      "rating": "6",
      "text": "Could and should have been better the plot is confusing at times but good attempt at a sequel."
    },
    {
      "rating": "7",
      "text": "T2 is not a bad picture, but it is not a good movie either. While first Trainspotting - based on a book with the same title - had a very well written story progression and characters played by briliant actors, there's T2. Second film based on a novel by Irvin Welsh is not a well written script with good concepts and good actors, but good actors with concepts and script written so it can fit for their play. I sometimes come back to T2 and rewatch it, but it happens more often with the first movie since it is simply a masterpiece in my opinion."
    },
    {
      "rating": "8",
      "text": "This movie resignated with me since I saw it a while back. I really appreciate how the story unfolds even though it is not an easy watch. The filmmaking is quite compelling."
    },
    {
      "rating": "8",
      "text": "Trainspotting, a movie about drug addiction and the hedonistic British scene of the 90s, returns with its sequel T2: Trainspotting. Twenty years have passed since the first film and the band is back together, with Renton (McGregor) returning to Edinburgh to reconnect with old friends and confront his past actions. Spud (Bremner) is still struggling with addiction and Sick Boy (Miller) has switched to cocaine and runs a pub while participating in blackmail sex schemes with his girlfriend Veronika (Nedyalkova). Begbie (Carlyle), who has been in prison for 25 years, escapes and seeks revenge on Renton. The film retains the same style as the original, with freeze frames, words floating on-screen, frenetic camera angles, and classic music cues. The cast has aged and the characters have changed, with themes of growing old and the disappointments of life being at the forefront. The movie is a poignant look at the lives of these four anti-heroes and how they are linked by their past.______________________________Trainspotting, una película sobre la adicción a las drogas y la hedonista escena británica de los 90, regresa con su secuela T2: Trainspotting. Han pasado veinte años desde la primera película y la banda vuelve a estar junta, con Renton (McGregor) regresando a Edimburgo para reconectarse con viejos amigos y confrontar sus acciones pasadas. Spud (Bremner) todavía está luchando contra la adicción y Sick Boy (Miller) ha cambiado a la cocaína y dirige un pub mientras participa en esquemas sexuales de chantaje con su novia Veronika (Nedyalkova). Begbie (Carlyle), que lleva 25 años en prisión, escapa y busca vengarse de Renton. La película conserva el mismo estilo que la original, con fotogramas congelados, palabras flotando en la pantalla, ángulos de cámara frenéticos y pistas de música clásica. El elenco ha envejecido y los personajes han cambiado, con temas de envejecimiento y las decepciones de la vida al frente. La película es una mirada conmovedora a la vida de estos cuatro antihéroes y cómo están vinculados por su pasado."
    }
  ],
  "recommendations": [
    "vanilla_sky",
    "inception",
    "the_hunger_games_catching_fire",
    "fifty_shades_darker",
    "tomorrowland",
    "the_butterfly_effect",
    "the_social_network",
    "hugo",
    "the_giver",
    "all_eyez_on_me",
    "king_arthur_legend_of_the_sword",
    "cloud_atlas",
    "inherent_vice",
    "hereafter",
    "alice_through_the_looking_glass",
    "bumblebee",
    "the_bfg",
    "the_nutcracker_and_the_four_realms",
    "reminiscence",
    "tenet",
    "the_gambler",
    "chaos_walking",
    "inferno",
    "x_men_apocalypse",
    "black_panther_wakanda_forever"
  ]
}