{"id": 3529, "title": "Tag", "starring": ["Ed Helms", "Jon Hamm"], "runtime": 100, "genre": ["Comedy", "Action"], "description": "For one month every year, five highly competitive friends hit the ground running in a no-holds-barred game of tag they’ve been playing since the first grade. This year, the game coincides with the wedding of their only undefeated player, which should finally make him an easy target. But he knows they’re coming...and he’s ready.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/eXXpuW2xaq5Aen9N5prFlARVIvr.jpg", "categories": {"plot": 6.239130434782608, "acting": 6.384615384615385, "ending": 6.5, "soundtrack": 6.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 6.44, "action": 5.75}, "reviews": [{"rating": "4", "text": "cornered in its self-created pathos methodology..Tag Starring : Ed Helms, Jeremy Renner, Jon Hamm, Isla Fisher, Annabelle Wallis and Jake Johnson. Screenwriter : Mark Steilen and Rob McKittrick. Director : Jeff Tomsic.2 out of 5Tag is a passionate plot driven feature that interprets a confused message as it never stabilizes itself on a definite purpose. An idea or a concept isn't everything there actually factors in a lot of other aspects, and this could be the fine example of it, for it doesn't have any single piece of art to be explored beyond its extracted mere idea. It is short on technical aspects like sound department, background score and editing.The camera work in here seems ridiculous, stultifying, dull and unnecessarily goes into slow-motion phase; where the makers may think they can draw their laughs in, but it actually undermines the gravitas and intensity of the feature. The script is way too pretentious filled with cheesy monologues and forcibly added sketchy comic sequences that neither keeps it grounded nor goes completely fiction, ending up floating in the space meaningless. Jeff Tomsic; the director, needs a lot of work to go through its approach on executing the anticipated vision for it falls flat on face when it comes to even deliver a straight-up sensible conversation. It is poorly acted out by the star cast especially by Jeremy Renner who seems to have been enjoying a little too much to make sense at some points and on the other hand, Ed Helms and Isla Fisher are the only one's on track whilst Jon Hamm is surprisingly a disappointment (maybe it's not his forte).Tag is cornered in it's self-created pathos methodology that it never comes out of it and unfortunately neither can it."}, {"rating": "4", "text": "'Tag' was funny, at times, but then it got more and more over-the-top as the runtime carried on. The film, supposedly inspired by true events, follows the story of a group of friends - since childhood - who play an annual game of \"tag\" every May. However, their one friend, played by Jeremy Renner, remains unbeaten, as for the some thirty years, he has not been tagged, and has always outrun these guys. The film stars; Ed Helms, Jeremy Renner, John Hamm, Jake Johnson and a whole all-star lead cast. They're surprisingly funny with the material they're given, but I couldn't find myself coming up with a reason as to why I should care about these characters. It's fascinating that this is all \"inspired\" by a true story, as it would take some proper commitment to constantly keep motivated to play tag for years and years every 11 months. The movie started out fine, but then just got too ridiculous, there is also some forced subplot revolving around a former high-school lover that the two main guys fell in love with, that just gets brought up out of nowhere and doesn't really have a proper conclusion. Just added as an attempt to make the characters interesting. Just like that time in 'Jurassic World' (2015) when the two kids talk about how their parents are getting divorced, but it's never mentioned again. If you want to develop character, have it affect their entire journey rather than use it in one or two scenes and leave us to fill in the gaps. 'Tag' is a good time, but overall, kind of forgettable."}, {"rating": "5", "text": "A gag that got out of control. Personally I think it would have been a good comic short film but a full feature film? what the **** were they thinking?The faults of the film are shown very quickly and it's evident that the simplicity of the story is unable to keep things in place for such a long time yet the film ultimately works enough because of the cast. It's like what happened with Game Night, not the greatest comedy but the actors were great and funny, even though I think Game Night was better.Tag is simple comedy, a real unpretentious and brainless comedy and for that reason I admire it a bit, but at this point of the game that's no longer enough and it hasn't been enough for a long, long time.I watch 90% of all my films alone but I've gotta say this one is fine enough to watch it on a weekend with friends.It's as forgettable as you can get but at least the laughs are genuine."}, {"rating": "6", "text": "Hannibal Buriss is clearly the funniest actor in this movie, though Isla Fisher is a close second.  I would have actually preferred to see a documentary on the real group of dudes on whom the movie is based.  The movie doesn't have enough substance to it.  It's FAR from being in Wedding Crashers territory. But yes, you'll laugh and probably have a good time with it."}, {"rating": "4", "text": "It starts out funny and has a great energy, but about 30 minutes in comes to a *screeching* halt. The film is at its best during the “tag” sequences, in which Renner steals the show, but all the filler really takes its toll, which is a shame..."}, {"rating": "3", "text": "Believe me when I say I gave this flick every chance to stay out of a red rating. I could see my spouse squirming in her seat & glaring at me for suggesting to see this film.  I was all geared up to cut loose laughing at a unique story line but the moments vanished quickly. Not sure why others are being merciful in their scoring but I rate this as one disappointing stinker. A \"3\" rating was being merciful on my part."}, {"rating": "4", "text": "It was better than what I was expecting, but it still is another by-the-numbers comedy Hollywood is shoveling out. The premise is dumb but if it makes me laugh I can be alright with it. But this movie didn't make me laugh so the plot is dumb. I mean if these guys are all friends and yet Jeremy Renner didn't invite them to his wedding because he's paranoid about being tagged, that's a pretty big red flag that they aren't that close or good friends. The cast overall is pretty great as Jon Hamm, Jeremy Renner, Ed Helms, Jake Johnson, and Hannibal Buress (who is way too good for this film but he steals every scene he is in because Hannibal Buress is that funny) have solid chemistry and the supporting cast does a good job as well, with the exception of Isla Fisher who comes off too forced in the film (although I blame the material she is given). Most of the jokes are hit or miss. Largely miss, but there are a few gems here and there, largely from Hannibal Buress. The movie is filled with a ton of filler plots that go absolutely nowhere, and sometimes they have no resolutions either. There is a part at the end where the movie tries for cheap sentimentality, which is A, not earned and comes right out of nowhere, and B, makes no sense when you really think about it. I don't really have much to say as it's just another blandly shot, blandly written comedy, that's only saving grace is Hannibal Buress, who is way too good for this movie!"}, {"rating": "6", "text": "This is a nice movie, about friendship and keeping your inner child after growing up. I really enjoyed some scenes, for a moment, the movie didn't take itself seriously, and it made it for some really enjoyable moments. Until the end, where it gets too serious, there's a HUGE bomb dropped about one of the main characters that comes out of nowhere and then disappears the same way it got.The tag sequences where they are all trying to tag Jerry (Jeremy Renner) are the best scenes there, but there are parts of the dialogue with really unnecessary and just unlaughable jokes. Rebecca (Annabelle Wallis) is just a character who is used for exposition which was really poorly done.In summary, it is a nice movie, that shows how friendships can survive the test of time. How adults should always keep hold of their inner child, even if it's just a small part."}, {"rating": "6", "text": "The story of Tag follows a group of friends who have played tag one month out of the year for the past 30 years, and one of the friends has never been tagged. That's basically all you need to know going in. Tag is a fun, but inconsistent comedy. The jokes that land are damn funny, and the ones that don't are pretty bad. The story also suffers from being inconsistent. For the first half, I was all in. It was a fun story with some solid (well, most of the time) comedy. Then we get to the second half of the film and it starts to lose some steam. The story continues moving on but a lot of it starts to feel repetitive and frankly some of the second half is just kind of boring. However, it did bring back the fun at the very end which led to a satisfying ending. Overall, Tag is a fun comedy to watch on a free night or if you're looking for a few chuckles. I wouldn't mark it as a \"must watch\", though."}, {"rating": "8", "text": "Liked this one. The lengths to which to the main characters go to win a game of tag get so insanely hilarious in this. Good cast too, the highlights are Ed Helms as the lead who goes to the greatest extremes to catch Renner, Isla Fisher as Helms' wife who is even more extreme than him, and Jeremy Renner as the cocky, strategic mastermind they've never caught.One nitpick: There is a romantic triangle subplot between Jon Hamm, Jake Johnson, and Rashida Jones' character that is devoid of laughs and chemistry and stops the whole film cold. Luckily, it doesn't take up much of the film's time. This also doesn't feel like a repeated viewing to me. As I said, it's funny and worth a theater price, but the jokes aren't the types that didn't leave me wanting to revisit them."}, {"rating": "6", "text": "Since childhood, 5 long-time buddies (including Jon Hamm, Ed Helms & Hannibal Buress) play the titular game for one month every year. One of them (Jeremy Renner) is getting married, so they're out to ruin his lifetime record of never being \"it.\" This is basically an excuse for lots of running around and broad physical gags. The characters all have distinct, but not especially wacky personalities (with Isla Fisher providing the most fun). Some of their comments are humorous, but nothing is especially hilarious. It's energetic and amusing, but not a riot of laughter. NOTE: See the gang that inspired this film at the end and hear the current cast sing a song during the credits (with a minor punch line)."}, {"rating": "8", "text": "Good filmFilm have a soulMany good moments comedy and dramawhere to laugh and eat where to cryThanks for this film"}, {"rating": "5", "text": "With little to offer, \"Tag\" convinces us only in its conclusion. The film becomes a bit slow at some points, having a script without a good \"explanation\". Despite everything, their performances are not equal to the level in which the film unfolds. 5.6/10"}, {"rating": "4", "text": "Another high concept comedy gone awry. More time and effort is given to replicating the real life adult game of tag than is put into any comedy.  Overgrown adolescent men will probably appreciate the shenanigans, though."}, {"rating": "10", "text": "TAG is great movie with lots of fun and will make you watch it again,all characters are introduced in a great way,and ending is made in such a way that will leave you in happy feeling even thou its a little bit sad"}, {"rating": "9", "text": "Laugh-out-loud funny, \"Tag\" is a lot of fun to watch. Ed Helms, as always, just perfect as the Everyman husband and good buddy with a glint of mischief in those innocent blue eyes. Also wonderful as the WSJ reporter: the gorgeous Annabelle Wallis, who I just learned is the niece of one of my all-time favorite actors, Richard Harris.  Recently there was a segment on \"CBS Sunday Morning News\" which showed the real guys. Look for a brief cameo from the marvelous Brian Dennehy! I enjoyed every minute and would recommend \"Tag\" as a fun date-night movie  for both men and women."}, {"rating": "8", "text": "An absolute joy, this had the audience on stitches from start to finish, and made for a thoroughly enjoyable experience. Tight pacing, a witty script, and stylised action made what seems like an absurd concept into a surprisingly heartwarming comedy based on this true story. With performances that feel genuine, and a storyline that invites you along for the ride, this is a film well worth your time. 8.89/10"}, {"rating": "3", "text": "Tag should've been more fun than it is. The budget for this production must've just been for staff - chiefly Jon Hamm and Jeremy Renner - because nothing was spent on sets or action sequences. This effort doesn't come close to rating a theatrical release, it should've gone straight to a comedy channel. This is such a poor production that I think Jeremy Renner's status just dipped to B-level being in this. Seriously, WHY would he do this?! Anyway, my advice, if you must, watch this while you're doing something else, it doesn't rate your full-time attention."}, {"rating": "7", "text": "A remarkable true story that works primarily because of the strong chemistry among the characters. There isn't a ton of laughs but the moments are sprinkled throughout. Overall a middle 7 a B+."}, {"rating": "8", "text": "Quite funny movie with many good actors in it. Found it quite interesting and it had a different premise than the usual movies, which was good too. Plus it was not all that predictable and is actually loosely based on a true story"}, {"rating": "7", "text": "Tag was a fun movie. It's fun because the story put doubts in your mind about what is fake or not. And it's a nice story about old friendships. The actors are pretty good in it. It not amazing in terms of comedy or action. I give it 70% because it was light tone and didn't take itself seriously."}, {"rating": "7", "text": "All I can say is that I really enjoyed this movie. the only thing I didnt like was the wife was WAY over the top."}, {"rating": "7", "text": "Tag Review: You're it.Cinematography: 6.397/10 Tag has a good flow though has a few awkward-camera-dragging-still moments in the mall and forest scenes. Costume Design: 7.347/10 There's nothing too out of the ordinary about anyone's attire for each of their circumstances though attire is a reference point which progresses the story. Film Editing: 7.129/10 The forest and mall scenes are important in bringing the audience closer to the extent of the developing relationships on display. Yet, moments in the scenes feel awkward - not in a disturbing way, but - more so in a visually-stubbing way.Make-up and Hairstyling: 4.312/10 There's nothing too extravagant going on which is surprising since celebratory weddings tend to focus heavily on décor, fashion, location, organization, styling details, etc. Tag focuses heavily on the developing relationships on display between all participants of the game.Sound Editing: 8.392/10 Tag has a lot of throwback songs set at the right moments that distract from the film in a good way though heightens my enjoyment of the film. Yes, I do open and use Shazam a few times during the film. Visual Effects: - /10 Okay, I'm going with not applicable here. Story: 7.821/10 The true story as the basis of the film Tag is interesting though in connection with the film is a bit confusing since there seems to be a much larger group of participants in reality. The film's story is jagged and tricky which seems to be intentional with the flow of the story especially towards the film's conclusion. I'm glad the film put light on the actual story and the importance of playing.  Acting: 7.332/10 Is it weird that a lot of these actors in scenes of anger, cunning, frustration, and malice are most provoking and ground the film well? Perhaps any playful atmosphere being taken over by extreme seriousness may experience an extreme grounding? The acting seems flitty due to the fact that each character has their own storyline developing - to a more minor or greater extent, in comparison- though all roads lead to ideas focusing most heavily on adulthood, friendship, and play - the styles of acting vary so much along the way - for better or for worse.Personal: I really watch Tag because I remember being very lanky, skinny, and slow in elementary school. I began playing a lot of variations of tag and became one of the fastest in my class. It might not seem like a big deal to you but experiences during my youth contribute to my life in a myriad of ways.Overall: 6.961/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."}, {"rating": "8", "text": "This is a solid buddy-comedy-summer-feel-good-ish flick. Went into it expecting a few solid sequences and maybe a couple good laughs, but came out very pleasantly surprised. Most of the scenes are shot and executed hilariously, and combine physical humour and funny lines as well. The characters are on the whole pretty likeable, and each one has their stand-out moments that make the audience laugh. The plot may be thin as hell, but you can overlook that if you just let yourself be taken along for the ride. The tone occasionally swings pretty drastically, but this is always brought back to the light-heartedness that a movie like this kind of demands. Overall very enjoyable, surprisingly funny, and quite sweet."}, {"rating": "8", "text": "Funny and fun movie that makes us remember that we should never forget to keep playing even as adults. An odd main cast group and writing leads to some kind of weird and awkward moments which kind of holds this movie back a bit. I would recommend this one. Some really funny moments and a generally overall fun movie that surprised me as it had surpassed my expectations. I also really enjoyed the ending credits too where they got actual footage of the real life guys that this movie was based on playing tag themselves, very cool. I also would really like to say, Hannibal Buress really needs to start doing more movies. Love the guy."}, {"rating": "0", "text": "I would rather gouge my eyes out than watch this movie again. The entire plot is about grown ass men playing tag. That's it. It gets even more stupid from there. A documentary about the men this is based off would have been a better choice."}, {"rating": "6", "text": "Interesting premise with a solid cast. It wasn't much of a comedy but more of a film that didn't take itself too seriously and still got a good message across. It was good but not great, It could have been a lot funnier."}, {"rating": "6", "text": "Though this is a fun movie that really features Jeremy Renner's talents, Tag is a mixed bag. First its hard to believe these men are all the same age as some seem 10 years older, 2nd the premise of the Wall Street Journal article seems thrown together lazily and third the only black character seems to be an A-sexual weirdo. In 2018, Hollywood can try harder."}, {"rating": "7", "text": "A good hearted comedy where stars like John Hamm and Jeremy Renner and Jake Johnson play an absurd but I guess true? game of tag."}, {"rating": "5", "text": "Tag is a far below average comedy that should just fail outright on concept alone and yet there is a spirit to its 'dramedy' aspects which kept me far more entertained than I expected. For its 140min running time it certainly felt much longer. I don't remember laughing aloud even once :( Some surprisingly well choreographed 'action sequences', a decent cast and decent soundtrack hold things together for the most part. At its best this is a watch and forget."}, {"rating": "7", "text": "Surprisingly good. Don't take it seriously. This is an absurd comedy and full of fun. The movie achieves it's target."}, {"rating": "6", "text": "\"Label\" was a movie that was a simple idea, but it's fun to watch, the characters are good, the story is simple but the comedy level has a decent level."}, {"rating": "8", "text": "This movie was fun tot watch, had great humor, perfect writing and story development and great value of entertainment. Overall it is in my opinion an under appreciated movie. The acting was great with big fully professional cast. The directing was great, and all the scenes had a reflection of the character's feelings, with amazingly shot scenes and good cinematography. The humor was sometimes dark, and never felt awkward or dragging. Great writing with a script that always had tension conflict and fun, and didn't have any pacing issue also due to the fact that it created great immersion.At the core of the competitive spirit of the game lies a hearth warming message that was delivered in style paired with a great but sad conclusion. Overall it's a very good movie which is also based on true events."}, {"rating": "7", "text": "E-Value: 7Acting: 7Plot: 5When we were young children, all of us have played a game of tag until we grow up and stopped playing. But that may not be the case for some people. This movie is based on a true story from a newspaper article from The Wall Street Journal published in 2013 about a group of grown up men playing a game of tag from the days of their childhood.Hogan \"Hoagie\" Malloy (Helms), Bob Callahan, Randy \"Chilli\" Cilliano, Kevin Sable and Jerry Pierce (Renner) are best friends with each other and they have been playing a game of tag since they were nine years old. While Bob, who is now an insurance company CEO, is being interview for a story by The Wall Street Journal reporter, Rebecca Crosby (Wallis), Hoagie attempts to tag him but end up hilariously fail.Hoagie explains to Bob that Jerry is retiring from playing tag because he is getting married. Since Jerry has never been tag before due to his strong athleticism and intelligence, he recruits Bob and the others for one last game of tag to finally tag him before Jerry’s wedding day. Their game of tag has pick up the interest of Rebecca which makes her decided to follow them and write an article about them.Although the plot of the movie may not be that good but the movie does have some talented casts to make up for some good reasons to watch this movie. They definitely gave their best performance to make the movie worth to watch. Jeremy Renner is best part of the movie as he does know to act in a comedy movie. While watching, I actually pretend he was Hawkeye playing tag instead of getting involved in Avengers: Infinity War which also hilariously explained why he was not in that movie.While this may not be the best comedy movie of the year, it is still very entertaining and funny movie to watch. It was so hilariously that I cannot stop laughing. To make the movie more enjoyable to watch, you should watch it with low expectations so that you won’t be fully disappointed in the end. If you looking for some good laugh, try out this movie."}, {"rating": "8", "text": "This is not a plot driven movie. This is just a fun movie with a bunch of funny people doing funny ridiculous things. I cannot sing the praises of Isla and Hannibal enough. They had me in tears from laughing so much. Hawkeye does a great job as well along with Hamm and Helms.  A great movie to watch with your buddies."}, {"rating": "7", "text": "Holy s***, this was funny as all hell. Every single thing they did was so over the damn top. And Jeremy Renner had me in tears with the parkour. Would seriously recommend this, still can't believe this was based on a true story."}, {"rating": "1", "text": "I figured since the actors and actresses were good the story was going to be good.  But it turned to be a waste of time.  I recommend no to waste your valuable time."}, {"rating": "9", "text": "I thought this movie was fantastic and gave me so many awesome feelings and brought up greate memories! Thanks everyone involved!"}, {"rating": "7", "text": "Tag is a comedy film that follows a group of five friends who spend the month of May traveling across the country to play a wild game of tag. Based on a true story that was reported by the Wall Street Journal, the film tells the tale of these friends and their journey to keep the game going. The characters in the movie are likable and unlikable at different times, and the humor is hit or miss. Some moments are funny, while others fall flat. The movie also tries to add emotional depth, but it feels unearned and doesn't quite work. The soundtrack is good and features a mix of different songs. Overall, Tag is an entertaining film that is fun to watch, but it could have been better with more consistent humor and a stronger finale.__________________________Tag es una película de comedia que sigue a un grupo de cinco amigos que pasan el mes de mayo viajando por todo el país para jugar un salvaje juego de etiqueta. Basada en una historia real reportada por el Wall Street Journal, la película cuenta la historia de estos amigos y su viaje para mantener el juego en marcha. Los personajes de la película son agradables y desagradables en diferentes momentos, y el humor es impredecible. Algunos momentos son divertidos, mientras que otros fracasan. La película también intenta agregar profundidad emocional, pero se siente inmerecida y no funciona del todo. La banda sonora es buena y presenta una mezcla de diferentes canciones. En general, Tag es una película entretenida que es divertida de ver, pero podría haber sido mejor con un humor más consistente y un final más fuerte."}], "recommendations": ["palm_springs", "deadpool_2", "pitch_perfect_2", "jumanji_the_next_level", "the_nice_guys", "logan_lucky", "the_five_year_engagement", "game_night", "friends_with_benefits", "rocknrolla", "keeping_up_with_the_joneses", "jumanji_welcome_to_the_jungle", "spenser_confidential", "central_intelligence", "pitch_perfect_3", "seven_psychopaths", "american_ultra", "free_guy", "the_king_of_staten_island", "that_awkward_moment", "the_spy_who_dumped_me", "the_cobbler", "deadpool", "pineapple_express", "thor_love_and_thunder"]}