{
  "id": 508,
  "title": "Taken 2",
  "starring": [
    "Liam Neeson",
    "Maggie Grace"
  ],
  "runtime": 91,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "In Istanbul, retired CIA operative Bryan Mills and his wife are taken hostage by the father of a kidnapper Mills killed while rescuing his daughter.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yzAlcuJhpnxRPjaj7AHBRbNPQCJ.jpg",
  "categories": {
    "plot": 5.875,
    "acting": 6.230769230769231,
    "ending": 5.571428571428571,
    "soundtrack": 2.0,
    "cinematography": 5.285714285714286,
    "familyFriendly": 5.384615384615385,
    "funny": 6.0,
    "action": 5.208333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Taken 2 is worth watching, but for most who watched the original it`s going to disappoint.I like how the bad guys are related to the ones in Taken 1, but wish they just let the wife and daughter get kidnapped instead of mother, and husband. I would find it much more fun if he was tracking them down the whole movie, trying to find them, than taking care of business."
    },
    {
      "rating": "7",
      "text": "Well it's hardly a surprise, but \"Taken 2\", despite its decent entertainment value, does not match the first one's calibre. Lacking a lot of the emotional weight and packed with fun but less thrilling action scenes, it tries to involve the daughter and mother more, but mostly results in it feeling a bit too watered down and underdeveloped. I'm happy I saw it, but for me, it comes far short of beating its predecessor, and I will probably not bother with any third installment they might be hoping to make."
    },
    {
      "rating": "7",
      "text": "The start of this series was very promising when talking about the first movie (Taken.) I also think that this was kind presumed of who a would get kidnapped and what would happen after watching the first and hearing that there would be a second. Overall its a good movie that you need to see for yourself to understand how good it is."
    },
    {
      "rating": "3",
      "text": "I went into this movie expecting a brainless but fun action film. Well all i got was brainless. This movie wasn't even fun. I'm a big Liam Neeson fan, especially when hes kicking ass and honestly the action sucked in this sequel to the overrated but fun first entry into the series. I even think im being generous giving it a 3. I'm not one to look for believability in a movie like taken 2 but come on, some of the crap was unbearable. The daughters using fregen grenades and nobody in istanbul seems to give a crap like chicks chuck grenades around the city on a daily basis, and how the daughter who keep in mind has failed her road test 3 times as was mentioned earlier in the film, all of a sudden becomes the worlds best getaway driver in this seemingly indestrcutible taxi that no matter what it crashes into there will never be a scratch on it. It was just unbearable. I'll give it a 3/10 which is definitely being more than generous, don't waste your time or hard-earned money!"
    },
    {
      "rating": "2",
      "text": "Great acting and casting BUT it still managed to be the biggest disappointed so far. Taken is a kind of movie that don't need a sequel. Oh well, I guess they wanted to milk the cash cow. The biggest problem was with the story. Why would the enemies go after him and his family AGAIN? I mean didn't they already learn their lesson from the first film.  The way the action sequences were edited was terrible. You couldn't tell who was punching whom and who was getting hit. Every half a second they would cut to another shot. It was painful to watch. Stay away from Taken 2."
    },
    {
      "rating": "5",
      "text": "Loved the first movie, struggled to enjoy this one. In the first one, you experience almost everything from Neesons point of view. You have no idea of where the girl is, and who took her. You don't even know if she is still alive. This is what made the first movie very enjoyable to watch. This made the quest of finding his daughter way more dramatic and thrilling as you never knew what to expect. After watching the first 10 minutes of this movie (and the trailer) i knew i was going to be disappointed. Taken 2 detaches us from the protagonist this time, giving us the point of view of the villains, the daughter and the ex-wife. This breaks all the drama of the first one. They are no surprises, you know exactly where the bad guys are holding them, and what they are doing to them. At this point, the only way this movie could save itself is by delivering a lot of action. The actions scene are alright but they are far from amazing. They are mostly chip tricks we have all seen before. A car chase that ends with a train nearly missing the good guys and hitting the bad guys is nothing original. The action doesn't make up for the lack of drama and suspense. Taken 2 clearly doesn't live up to it's predecessor."
    },
    {
      "rating": "2",
      "text": "What I don't understand, is how people thought the first movie was good. Rooster Teeth named Taken their 'Movie of the Year'. It was too predictable. If a guard turned right down a corridor, Liam Neeson would come from the left. The editing was unbearably atrocious. The writing seemed like the movie was filmed on the first draft.  Taken 2 was no different. It is the kind of movie that is something to laugh at on the drive home. First off, the editing. During the fight scenes, it was like trying to play pin the tail on the donkey. You can't tell who is who until the scene is over. You may as well close your eyes and listen to the soundtrack. Which that in it self is nothing new. Like pretty much every single action movie today, the soundtrack is made up of the violin family. With the addition of a synthesizer. It makes the movie seem dull and cliche. Which it needs no help doing.\r Lastly, the writing. I could of gone and seen The Expendables 2 and gotten a better plot line. In fact. There is barely any plot line at all. It's all 'Hey lets shoot everyone that sounds Turkish!'. The scene where Kim and Brian are in the taxi and burst into the US Embassy. What was the point in that! They weren't being followed. The last car got blown up by the train.\r The only thing on the writing side I can give them credit for is when they are setting off grenades to tell how far away they are from each other. That was clever. Just the fact that there would be police swarming the streets.\r This is a movie that will leave you red faced after the amount of face palms you do..."
    },
    {
      "rating": "4",
      "text": "\"Taken 2\" is just basically your generic more-action less-plot summer dimwit blockbuster that is a straight forward copy of the original film, which wasn't even that great."
    },
    {
      "rating": "2",
      "text": "This movie is appalling. From the opening credits you can tell it's going to be terrible, acting seems extremely forced and at times very cringe-worthy. Too many close-ups of the daughter's cleavage and bum thrown in for no reason. Product placement is beyond un-subtle and the story is just laughable. The ending is also terrible and the music general action nonsense lacking the emotional punch of the first. Basically, a great movie has been ruined by a simply terrible sequel simply to cash in on our love for the first."
    },
    {
      "rating": "7",
      "text": "Almost as good as the first one. I was surprised at how good it was and how well it lived up to Taken 1's standards. Hopefully their's not a third one because that would probabaly ruin it all."
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie but there were a few things that let me down, first I liked the way that in the first movie, everything was from Brian's point of view, but in this movie I thought there were to many pointless cutaways from different perspectives.  I don't want to compare this to the first one but I enjoyed the way the first one was gritty, In my opinion I think it would have been better if they raised  the age rating up to include a gritty and darker aspect to it, but overall the acting and action was great, Definitely worth a watch."
    },
    {
      "rating": "0",
      "text": "This film did ok for the actors but for a movie that had a succesful rating for the first film this was dissapointing. the diretors and writers of this film did well with the location and scrips but as soon as the film started to pick up all u can expect is a relax in your chairs and not at all close to a thriller. this film for me personally was not worth the money i spent."
    },
    {
      "rating": "0",
      "text": "I really enjoyed the first Taken. It was mindless badassery. You didn't have to think, you just went along for the ride. Neeson showed himself as being capable of performing in a Bourne-esque role, which is great for a man of his age.\r Underneath it all, Taken 2 is still a pretty decent action flick with Neeson on fine, badass form. There's some good action and the fights are exciting (when they're not cut to ribbons) and our hero belts out another memorable catchphrase (albeit one that's not quite as impressive as the orignal \"I will find you\" one).\r So why the 0 score? 3 Reasons.\r 1) Olivier Megaton. This guy is atrocious as a director. Strangely, i've seen a number of his films & they've all been terrible. Don't ever let him near something high profile, ever again. Especially action films, he says he hates violence. What a joke.\r 2) The editing. Christ almighty, I lost count of the camera switches in just the first 5 minutes alone! Was it really necessary to show Neeson entering his daughters boyfriends house from 4 angles in the space of 2 seconds? I know a lot of fast cuts and shakey-cam are supposed to give you a feeling of the action unfolding, to make it feel more intense, but this was on such a ridiculous scale that at some points I felt sick.\r 3) The self-censorship. Pandering to the PG-13/12a crowd on a 'franchise' that has rated higher in the past is something I cannot support. I waited for the uncut DVD version of Die Hard 4 before I saw it as I did not want to give the studios my box office money for a kid-friendly version. The first Taken movie was brutal and unflinching, it was gritty and exciting. Taken 2, on the other hand, has had it's heart completely ripped out (off camera!) and loses a lot of the soul the first film had (I know that sounds quite pretentious given the type of movie this is). Whoever it was who went to the BBFC in the UK for advice on how to get a lower rating should be fired. 15 or 18, or don't bother.\r I have been waiting for this film with excitement since I first heard it was being made, so it's heartbreaking to be so disappointed. I'm not sure if even an uncut/unrated version can save it, as Megaton has said in an interview that the DVD will be a directors cut, rather than a 'rougher, more violent cut'. This saddens me greatly. Extra scenes won't mean a thing if they're as mild as the rest of them.\r Don't bother watching this, do not give the cinemas any money for this film, send a message that going for a broader audience will actually result in a smaller one. If you must watch this film, wait to see how they produce the DVD. If they do the same as Die Hard 4s release, then I will recommend you see it. If the DVD turns out to be as tame as the theatrical version, leave it. Pretend it never happened. Forget it exists. Cherish your fond memories of the first film and keep wishing for a sequel. A real sequel."
    },
    {
      "rating": "5",
      "text": "\"While i have the utmost respect for Liam Neeson & he truly is a badass. But Taken 2 truly is mess. Its basically a re-hash of the first outing and is nowhere near as entertaining either. I'm going to say Rent It just because i loved the first one so much\"  C"
    },
    {
      "rating": "2",
      "text": "some movies just can't have sequels. other then the amazing Liam Neeson acting and Istanbul, every thing else is just so ridiculously crap. story line and plot so predictable. especially if you have watched the first one Taken, which was a good average movie, then this would be extremely difficult to watch."
    },
    {
      "rating": "1",
      "text": "Let's talk more generally about the trend in Luc Besson's films, in particular those written with Robert Mark Kamen. They are going downhill fast -- and faster. It's one thing to have a sequel here or there, and another to mail it in as RMK is doing."
    },
    {
      "rating": "7",
      "text": "I'm a huge Liam Neeson fan, and a huge fan of the first Taken. Despite this I wasn't sure that a sequel to Taken would turn out good. First of all a sequel was unnecessary, and movies that get unnecessary sequels (The Hangover, The Mummy) usually suffer in the long run because the sequels never live up to the original movie. Well turns out I was right, Taken 2 never lives up to the first movie and just feels unnecessary. But that doesn't mean that the movie isn't enjoyable. It's a decent action flick and it will keep you watching to the end, but you'll notice that it lacks the punch and originality that the first movie had. In the end I enjoyed the movie even though it felt like a generic action flick with a spectacular cast. In closing I just want to say this to whoever is in charge of these kinds of things, do NOT make a Taken 3. You got lucky this time but don't push your luck with a 3rd movie."
    },
    {
      "rating": "3",
      "text": "Taken 2 is unbelievably disappointing. It starts out promisingly; the hero is just as likable as in first film and the new villain has a sensible, efficient motivation. Unfortunately, the film goes badly wrong when the action starts. The fights and car chases that follow are all generic and unexciting. Worse still, some of the logic in the movie is stupefying... A girl without a driver's license can suddenly drive like Jason Bourne, repeatedly setting off grenades in a metropolitan area does no damage and alerts minimal security and apparently, driving through a US embassy checkpoint at high speed, thus causing soldiers to open fire warrants no detention or subsequent investigation. What a total mess of a movie! The first one was classic. This one is utter jank."
    },
    {
      "rating": "9",
      "text": "Why is every goddamn critic hatin' on Taken 2? As long as I smash them with a bottle of whiskey, Taken 2 does not suck. It may look a little different on the first Taken, but Liam Neeson, he shouldn't need no stunt double. But he's 60-years-old, he's the Jackie Chan-meets-Bourne style of action movies. No signs on slowing down, that's all. I gotta get Taken 2 on Blu-Ray. Soon, it'll be Taken 3 or 4."
    },
    {
      "rating": "9",
      "text": "I absolutely loved the first film and was concerned that they were just throwing together a money-grab with this sequel. The trailers all made it look like it was the exact same movie all over again. That couldn't have been further from the truth. Sure, it had a similar feel in terms of cinematic elements and action style but the plot was completely different and yet it tied into the first movie really well. I can't give the film a perfect rating because it felt like it lacked the same unique experience that made the first one so special. That's probably not fair but it's the truth nonetheless. I noticed that a lot of people disliked or were disappointed by this movie for some reason. That reason escapes me because I thoroughly enjoyed it and would think that anyone who loved the first movie would enjoy this movie too."
    },
    {
      "rating": "8",
      "text": "So...a pointless sequel right? Well you are almost there, you see Taken 2 didn't need to happen nor was it as good as its predecessor however it did not deserve the hate it received due to it still being a generally great action film.\rTaken 2 starts in Albania where the families of some of the mobsters from the previous film live, tier dead bodies return home and their fathers  brothers swear revenge on Brian and his family. Brian is now living a happy life with constant contact with his daughter Kim and is even building back his relationship with his ex-wife Lenore. On a trip to Istanbul the mobsters track the family down taking Brian and Lenore hostage. It is up to Kim to rescue them and Brian to put an end to this horrible affair once and for all.\r Taken 2 ticks all the boxes for a great action film with a nicely tied together story. It has more action than Taken 1 and despite the lower age rating feels more brutal. The only real complaints I have are the overly choppy camera work and editing and that the story does still leave a few questions unanswered and a possibility (though not necessity) of a Taken 3.\rTaken 2 is a great action movie and despite the generally negative and middling reviews still something you should pick up if you are a fan of the genre."
    },
    {
      "rating": "8",
      "text": "I loved the first Taken film so i was excited for the second and i was not disappointed, Taken 2 is a very solid sequel. Liam neeson puts in another great performance as Bryan the ex CIA man, his tactics and quick thinking are just as good as they were in the first movie."
    },
    {
      "rating": "2",
      "text": "Be prepared for complete nonsense. The girl is not skillful enough a drive to get a driver's license in the US, yet towards the end she hops in a stick stick shift cab and is the world's best getaway driver. Liam Neeson is detained and cuffed but left alone for hours to find himself away out while guiding his daughter towards him with using a cellphone he had because he was not stripped searched. Albanian's conversing exclusively in English. Grenades being thrown out of hotels and no police response whatsoever. The direction and editing is similarly terrible, the overuse of shaky-cam unbearable"
    },
    {
      "rating": "8",
      "text": "Taken 2. This movie can be described in one word. Underrated. This movie was ultimately a fitting sequel to the first taken movie. Liam Neeson once again pulled of Bryan Mills with great swagger. The star of this movie though had to be Maggie Grace who portayed Mill's daughter. She took the helm of this film as if it was her own not Neesons. The action sequences I found to be longer and flowed more unlike the first taken film which contained short and choppy fight scenes and this movie stuck to one villain unlike the 1st one which never really established a villain and all the ones that it had were wimpy. I did find myself comparing him to the most interesting man in the world commercials though ha ha. Also Luc Besson did a great job penning this movie which ddi not surprise me. The only complaint I had with this movie was the camera work which was indeed atrocious. That is the only reason I gave this an 8 and not higher. Overall I enjoyed this movie. Not as much as the first but it was still a fun thrill ride that proved to be worth the wait for."
    },
    {
      "rating": "10",
      "text": "If you enjoyed Taken you will enjoy this, too.  Good casting, good action, good film.  As mush as Neeson's character wants to take charge, it is nice to see him learn to train and then defer to others."
    },
    {
      "rating": "7",
      "text": "I really enjoyed this movie. It is fairly quick pace and heavy on action with a light, but believable story thrown in. The action is superb overall. Furthermore, Liam Neeson is a great actor and he really makes the movie awesome. I would give it a 7.5 because while similar to the first it really isn't as good, mainly due to the story. The plot wasn't developed to a great depth and I found it a little lacking in the end. That being said it is still a great action flick to sit down and eat popcorn. Better than the Expendables 2; not quite as good as Total Recall (2012)."
    },
    {
      "rating": "10",
      "text": "Taken 2 my little freind, you rock. Tjis film is so well written and well paced ithat it will have you uessing who is going to get taken. The acting in this film surpasses the acting found in Looper and The Avengers or Te Dark Knight RIses. The story is so original I just didnt understand why they didnt just copy the first ones ideas, I mean there was a scene so well directed where a girl trows grenades, awesome."
    },
    {
      "rating": "4",
      "text": "Released in 2008, Taken came out of nowhere to earn $145 million at the box office on just a $25 million budget.  The movie-going public recognizes fresh material when they see it.  Taken was original, creative, driven, and hosted one of the most memorable protagonists in recent memory.  Of course they would have to make a sequel to wring some more money out of Taken's fans.\r A review of a movie sequel which starts outs praising the first installment instead of the new story is most likely not going to be very kind to the unfortunate title which ends in the number 2.  Taken 2 keeps Liam Neeson as Bryan Mills, Famke Janssen as his ex-wife Lenore, and the always relentlessly annoying Maggie Grace as his daughter Kim.  Rule of thumb - if Maggie Grace is cast in your film, it will probably stink.  This is her second feature film in 2012, after Lockout, so she is 0-2 this year.  The bad guys are also mostly the same; they are the extended family of the first group of Albanians Bryan killed after they kidnapped his daughter and sold her into sex slavery.  Now they want revenge; they must honor their dead sons and brothers.  It doesn't matter that their sons and brothers were human traffickers, rapists, and murderers.  Family honor is family honor ya know?  Bryan is growing close with his family again.  After a few days of work in Istanbul as a heavily armed bodyguard, Byran invites Lenore and Kim to Turkey to take in the sights and relax in a very posh hotel.  Fortunately for the Albanians, this is where they are going to kidnap Bryan, transport him back to Albania, and torture him to death.  The introduction of mom and daughter is a cherry on top for the head bad guy Murad (Rade Serbedzija).  He is older with grey hair; I mention this because all of the other couple dozen bad guys run together, he is the only one you will remember.  In Taken, Bryan had it comparatively easy.  He had one person to save and could methodically move through the ranks of thugs as he stabbed and shot his way to the top.  Now, not only does he have to watch his own back, he must save both mom and daughter, sometimes alternating which one he can help at any given moment.\r The original Taken was so good because of Bryan's practical and purposeful methods of extracting information, Neeson's deadpan delivery, and the ins and out of seedy Paris locales.  Now take everything which made Taken a great movie and divide it by two.  You already know the story, you know Bryan will talk slowly and concisely about how he has certain skills, and this time you get to suffer a bit more because Maggie Grace gets more screen time.  The camera work also takes a nosedive during hand to hand combat.  The camera shakes, jumps up and down, does some jumping jacks, and the average edit is probably .002 seconds.  The audience has no hope of logically following who is punching whom or where a new bad guy springs up from.  Scenes where Bryan fights with a loaded pistol are much easier to watch.\r It's not that I'm mad at writer Luc Besson or director Olivier Megaton; they probably were under a lot of pressure to re-create the Taken magic.  Unfortunately, they did not do a very good job.  The story is only a bit laundered from the first one and everything else is merely imitation.  Stay away from Taken 2, it will only remind you of its superior predecessor."
    },
    {
      "rating": "8",
      "text": "I was indeed wary that this might be not up to standards of the first film, but when I saw it, I thought it was better. It was a ridiculous storyline, but Liam Neeson was still up to par, as I enjoyed him doing what he does best. I could empathise with the characters properly, as I felt I was much more comfortable with Kim being a stronger character than in the last film, while the rest of the cast were still fully capable of committing to the plot. The ending certainly proved better worth than the previous film's ending."
    },
    {
      "rating": "3",
      "text": "Where as the first one succeeds in keeping you at the edge of your seat as you are watching a race against the time and have no idea where the movie will be going next, part 2 is predictable, over the top, run of the mill sequel that fails much more often then it succeeds. Favorite bit from the movie - daughter is struggling trying to get her licence. 2 weeks later she is racing like a maniac through narrow streets of Istanbul in a Mercedes with a manual."
    },
    {
      "rating": "6",
      "text": "Like \"The Hangover: Part II\" this is basically the same movie just in a different city. But after the first choppy and close up action scene I really enjoyed myself. It's just one of those films that you watch simply to watch, and will forget about it the moment you step out of the theater. It's not an awful movie, but it's clear this was a cash grab."
    },
    {
      "rating": "10",
      "text": "Having read the poor reviews but rarely disappointed by Neesom I forced myself to stay positive while wondering all the way until the movie started. I must say that from beginning to end I could not have been more pleasantly surprised. The writing, plot, action, but, without a doubt the acting, all around, was as good as it gets. Besides Neesom's commanding presence the supporting cast was absolutely stellar. If you gave Taken 1 a 10 as it deserved this one would rate a 12 or 13. Do yourselves a favor and do not listen to those panning the film - they very obviously have some ulterior agenda to support. This movie will give you the emotional ride we all deserve when paying these exorbitant ticket prices."
    },
    {
      "rating": "8",
      "text": "Liam Neeson stars in Taken 2, revisiting Brian Mills, the former intelligence agent with terrible luck. The first movie was a well-crafted bloodbath with elements of revenge, brutality and also cleverness. The second didn't disappoint on any counts. The family of the human trafficker that was the antagonist of the previous film opens the movie with a somber funeral scene. The Albanian trafficker's father vows vengeance against the American. When Brian, Lenny and Kim travel to Istanbul on vacation, the Albanians capture Brian and Lenny and Kim narrowly escapes. \"Your mother and I are going to be taken.\" This line spoken by Liam Neeson's character received some negative reactions, but it outlines the reason that there was a second film, so I think it was important. Throughout the rest of the film, Neeson's character demonstrates both courage and quick thinking in a convincing role with natural talent. Major elements of the plot seem to parallel with Neeson's previous film roles, and with previous action films in general, but most will find this movie acutely entertaining and exciting.\r 8/10 for Taken 2, a traditional but masterfully crafted action flick."
    },
    {
      "rating": "0",
      "text": "This may be the worst sequel ever made...everything that made the first movie good like the gritty realism in the hand to hand fighting, and the short and sweet gunfights that weren't over the top and essential turned the film into a polar opposite of itself...of course now the studio assumes anything liam neeson will do is gold, they were wrong..\rNow i can't tell if he cares more about getting his ex wife Back or his daughters driving lessons..\rsigh... its hard to accurately sum up all the misfires in this movie becuase the entire film feels forced...nothing is believeable and by the end you don't care who lives or dies Collaps"
    },
    {
      "rating": "8",
      "text": "I thought was a good movie and not as great as the first of course but I wasn't expecting it. It had a good amount of action but of course I wanted a lot more. At an hour and a half it goes by way too quick so this is one movie I could sit through longer. It also had a large cheese factor I could've did without with the extra family moments at the end and my goodness can his daughter handle herself under insane amounts of pressure. She's damn great with maps and directions, driving in strange countries without passing a driving test and she can sure throw those grenades. I really wish there was a better finish with the bad guy as well. What the heck and how the heck did he kill him? That was too quick. I wasn't a huge fan of the camera shots moving around so quickly either with those fight scenes in this one but they were still good. I would see it again and as a fan of the first you gotta enjoy this one too. I admit it had some stressful moments."
    },
    {
      "rating": "0",
      "text": "Totally needless sequel. The only difference is the wife gets kidnapped this time. It's so poorly written and acted and every action scene is pretty much copied and pasted from the first film."
    },
    {
      "rating": "10",
      "text": "This movie rocks!! BIG TIME! It's a real crowd-pleaser. Don't listen to the negative reviews. If you love the first, you will love the second. It's a solid sequel. Great Job!"
    },
    {
      "rating": "5",
      "text": "Walking into"
    },
    {
      "rating": "0",
      "text": "I dislike almost all his movies, The Grey, Taken, Clash of the Titans, Wrath of the Titans, Battleship  Unknown  The A-Team, The Dark Knight Rises, The Chronicles of Narnia 1,2,3."
    },
    {
      "rating": "6",
      "text": "It's a fairly routine story, but Neeson and Grace do a nice job as action-hero and action-hero's willing acolyte-daughter. Grace has actually come a long way since her Lost days - her likeability has increased in a significant way. And she just pops on the screen.  I thought that the crux of the story was given short shrift.   \"I don't care that my son was a horrible kidnapper - your blood must flow through the hills of my home town because you killed him!\"  It lacked a certain righteous indignation.   Tough to get behind his massive endeavor here.  And the minor twist at the end, if you can call it that?  So predictable.  Should have been omitted.  A good time, but nothing extremely special."
    },
    {
      "rating": "6",
      "text": "A well shot film making full use of its surroundings, Istanbul in this case. Well paced with the level action keeping the adrenalin pumping almost from the start. The performances were all very good although I felt nobody was particularly stretched. Liam Neeson was his usual self as Bryan Mills, Maggie Grace was good as daughter Kim, as was Famke Janssen as wife Lenore. Also worthy of note was Rade Serbedzija as major bad guy, Murad Krasniqi. It was ok as a piece of entertainment but I felt it didn’t do anything the first film didn’t. You usually expect a sequel to expand on the story of the first but this one virtually told the same story but with a couple of alterations. It seemed like the studio (Fox) were just out to cash in on the success of the first one. I’m just glad I didn’t go and watch it in a cinema but still, if you want entertainment that won’t stretch the little grey cells to much, then this is the one for you.\r SteelMonster’s verdict: RECOMMENDED (Just)\r My score: 6.3/10."
    },
    {
      "rating": "5",
      "text": "an obvious money grab of a movie. The plot meanders to a point where the flick is simply not believable. The action scenes and pace of the movie are enjoyable."
    },
    {
      "rating": "7",
      "text": "I loved the first Taken movie, this movie was really just a repeat of the first but a little less enjoyable and much more predictable. Still given the range of crap that has been at the movies lately it was an enjoyable outing."
    },
    {
      "rating": "7",
      "text": "Cliché, predictable, short and simple. If someone asked \"What is the definition of a standard American movie?\" it would be this. But make no mistake; despite being a carbon copy of just about everything, it still delivers. It achieves what it set out to do. No, it's not a Bourne film  nor is it trying to be. The thing about Taken and Taken 2 is how they take a very basic background and make it come to life. Sure, there's nothing out of the ordinary or new or surprising. But to be honest, it's not always a bad thing. Taken 2 has action, it has suspense and it genuinely delivers a very intense 89 minutes. It's one of those films where you lean forward if you know what I mean. I wouldn't say it improves on the original, but is just as good."
    },
    {
      "rating": "7",
      "text": "I was a big fan of the first TAKEN, which I consider one of the best action flicks in recent years.  However, I am as skeptical  for this sequel. It's gotta be crap and cynical money making venture to say the least.  However, I was pleasantly surprised with the end result.  Let's get the negative side of things first: a derivative storyline, this time it's the parents who got kidnapped (WOW!).  The positive side: Liam Neeson. Pure and simple, he imbues a certain charisma in his role and he has great chemistry with his co-stars.  The action sequences are pretty good and on par with the original. At the end of the day, see TAKEN 2 as 21st century facelift of an 70's/80's Action sub genre: the revenge pics, popularised by the Death Wish series and the like. It's a B-movie, with no 'fat' (AHEM..Bourne Legacy..)"
    },
    {
      "rating": "6",
      "text": "Why not make a sequel to one of the surprises of 2008? There's plenty more happening in the second outing for Bryan Mills, the retired CIA man who is obsessive, vigilant and on time precisely to the minute he said he would be.\rBut what the films premise does is bring an idea which so many other films leave out of the occasion, all the bad guys that are gunned down yet nobody seems to care about them? Incorrect in Taken 2. A mass funeral is being held for the unfortunate men who crossed Bryan in the first film, and revenge is on the agenda for the families of those he killed. But back in LA, Bryan is steadily moving closer to his ex- wife Lenore, played again by the beautiful Famke Janssen, while also continuing his overbearing but respected father routine to Kim  Maggie Grace).\rWhen he invites the two of them to Istanbul while he guards a Sheik, things take a turn when Bryan and Lenore are are out. Through careful instructions to his eventually safe daughter, he manages to work out where he and his ex-wife are being held, the process by which he does this may raise a few eyebrows..but it's quite a cleverly constructed scene that certainly gets all the characters more involved in this sequel.\rNo, it isn't as good as the first, but saying that it shouldn't entirely be viewed as a sequel, each character is given more involvement in this film to the point where it isn't entirely necessary to have seen the first, this perhaps may be a good thing because this isn't as engaging or surprising, we already know what lengths Bryan will go to, we know what he is capable of and quite frankly we don't see this sort of side to him in this film.\rIt's not so much a remake but maybe even a continuation without actually being a sequel. The same sort of edginess is gone and replaced with an array of doubling back efforts and countless chases, the emotional depth from the plot of the first film involving Kim being sold as a prostitute is gone, we no longer need to feel for these characters but just seem to be lead to enjoy the film without thinking about it.\rStill a decent action flick with plenty to smile and talk about, but the film ultimately doesn't reach the surprising heights its predecessor did, much of the flare is gone, but again, worth a look anyway."
    },
    {
      "rating": "5",
      "text": "Feeling listless in a lacklustre season for cinema-goers, I simply yearn for the smell of the multiplex and it had been almost one month since my last visit, so TAKEN 2 has been singled out in view of that I had a mildly positive viewing from its first one (TAKEN 2008, 7/10), and action-packed thriller will at least not be a bore (a sad truth is that here is so difficult to find non-dubbed animation features, otherwise the selection would be much wider).\r Being an emblematic sequel relying on the same gambit and stunts to pass through its running time, TAKEN 2 can hardly be called satisfactory, thanks to the rapid editing and effective camera rotation (another tact being overdone here), the gawky Liam Neeson still can render a patina of a sleek special agent, all his moves are pertinent and deadly fatal, nevertheless, reaching 60-year-old, perhaps his next invitation (apart from TAKEN 3, according to its groundbreaking first weekend bravura, a sequel is undoubtedly on the slate now) will be sent from Stallion's THE EXPENDABLES tawdries, and one thing is for sure, he will not be the oldest. Maggie Grace and Famke Jansen both have earned more screen-time, but hardly have any decent time to be composed enough to deliver some jolly one-liners. The plain storyline has efficaciously implemented the genre fun in the most predictable manner (also an over-simplified one), for example, the special knacks (throwing the grenades among the shacks, counting the seconds to remember the route of the vehicle while being blindfolded) required to locate the whereabouts are too far-fetched since Istanbul is not a remote village and most of the time, the whole scheme is made deliberately to facilitate the film to justify itself, screenwriters (Besson is implicated) simply don't care much to the details and the suspense has never been concocted absorbingly, no matter how many Albanian villains are mercilessly iced by our hero, himself, his ex-wife and daughter's safety has never been severely endangered, so supposedly all the pleasure should be derived from the unnecessary killing of the ferocious but mostly marginalised Albanian avengers, what's the point then?\r Director Olivier Megaton is an action genre journeyman (COLOMBIANA, 2011; TRANSPORTER 3, 2008, 4/10), but this time it"
    },
    {
      "rating": "5",
      "text": "Taken 2 takes everything we loved from the original film and... does it again. I will admit portions were fresh and still riveting. Regardless, this sequel falls in the shadows of its precursor."
    },
    {
      "rating": "4",
      "text": "Not only this sequel is unnecessary, it lacks all that which made the original outstanding. What was the original Taken about in the first place? It was about Liam Neeson kicking some serious ass in a very realistic and believable way. Here it seems like it's not Neeson himself, but his double or something. The fight scenes are awkward, poorly staged and feature an honest-to-god awful operator job, where you can''t really make out a single freaking thing. What's more, the dialogues are stupid and (in my opinion, at least) poorly acted out. The final nails in the coffin are bloody disgusting CG effects (I almost vomited at that car explosion) and the dumbass main villain. The thing is, the answer to this quality drop is quite obvious  the director changed. Now it's Olivier Megaton, the f**khead who brought us Transporter-3, it makes sense. So please, if there'll be yet another unwanted sequel, either make it straight-to-DVD so I won't even hear of it or return Pierre Morel to the director's seat."
    },
    {
      "rating": "6",
      "text": "Well. Well. Well. So many negative reviews and whatnot.  Maybe this is because people didn't get anything new to see and there was not much of a slight suspense element which the first installment had. Whatever the case was, I am going to be totally honest here. I actually enjoyed watching the movie, it wasn't as great as the first one but, without a doubt, it is a good pastime. It isn't boring at all. Action sequences seem a little too over-stylish but overall, Taken 2 is a good film. Taken is a kind of film that doesn't need a sequel and I don't know why they made it, and they're in talks to make another one as well, who would be taken in that one? All three of them? And maybe they'll get killed this time for real. I'm up for another sequel if they come up with much, much better ideas and plot than Taken and Taken 2 combined. I always watch Liam Neeson's films because he is one of my very favorite actors and his performance never disappoints me, that's a plus point for this film. Of course, there are so many plotholes, some of them seem annoying like the one in US Embassy, that's ridiculous! In addition, the thing that annoyed me the most was that in the film, Kim is going through rooftops and throwing grenades and nobody gives a **** That's plain stupid. Long story short, if you still have to watch the film, don't expect much from it. I didn't and that worked for me. Well, almost!"
    }
  ],
  "recommendations": [
    "taken_3",
    "taken",
    "infinite",
    "furious_7",
    "the_transporter_refueled",
    "london_has_fallen",
    "vantage_point",
    "skyscraper",
    "limitless",
    "kingsman_the_golden_circle",
    "repo_men",
    "man_on_a_ledge",
    "poseidon",
    "terminator_genisys",
    "maze_runner_the_scorch_trials",
    "max_steel",
    "mile_22",
    "the_mechanic",
    "mission_impossible_iii",
    "underworld_blood_wars",
    "national_treasure_book_of_secrets",
    "the_fate_of_the_furious",
    "the_hunger_games_mockingjay_part_1",
    "tomb_raider",
    "next"
  ]
}