{
  "id": 329,
  "title": "Taken 3",
  "starring": [
    "Liam Neeson",
    "Forest Whitaker"
  ],
  "runtime": 109,
  "genre": [
    "Thriller",
    "Action"
  ],
  "description": "Ex-government operative Bryan Mills finds his life is shattered when he's falsely accused of a murder that hits close to home. As he's pursued by a savvy police inspector, Mills employs his particular set of skills to track the real killer and exact his unique brand of justice.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vzvMXMypMq7ieDofKThsxjHj9hn.jpg",
  "categories": {
    "plot": 5.780487804878049,
    "acting": 4.8,
    "ending": 4.777777777777778,
    "soundtrack": 5.0,
    "cinematography": 5.25,
    "familyFriendly": 6.0,
    "funny": 3.5,
    "action": 5.036363636363636
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Sometimes reviews are a good indicator of a how good a movie is.  This is one of those times.  The first \"Taken\" was a very good action movie.  The second was not as good, but it was still decent.  Taken 3 is mediocre at best.  Liam Neeson is fine as the man \"with a specialized set of skills.\"  Forrest Whitaker is good as the Inspector.  They are not the problem, nor are the myriad supporting actors.  The script is the problem.  There are so many ridiculous events and twists going on in this movie that it boggles the mind.  And could this be any cornier?  Methinks not.  Finally, the directing is just terrible.  Where \"Taken 3\" takes its audience is on a pretty dumb ride."
    },
    {
      "rating": "6",
      "text": "Liam Neeson is back on home soil and his family is once again in peril. To make matters worse, he gets framed and has to track down the villains, while eluding he police. This is very much a by-the-numbers action flick with a hero who's impervious to bullets, falls and anything else that would hurt an ordinary person. The endless chases and fights are shot and edited with that slice-and-dice technique that makes it impossible to see what's really happening…just a blur of activity. In its favor, the pace is brisk."
    },
    {
      "rating": "6",
      "text": "I was excited to hear that the Taken films would become a trilogy, because I had loved Taken (and had watched it so many times I could remember most of its iconic lines). The first Taken was dark, gritty, and very personal for Bryan Mills--his daughter was abducted and was soon going to be prostituted, he had little time to find her, and they were growing apart as she grew older. Taken 2 was not as good as the first one, but respectable in its own right. Taken really felt like standalone story, so Taken 2 detracted from that and kind of felt unnecessary. Nevertheless, I honestly don’t know why people complained so much about Taken 2. Taken 2 expanded well on the characters and furthered themes from Taken. Sure, Taken 2 might’ve seemingly pulled a “Hangover 2” move and became a rehashed version of it’s predecessor. But it had some interesting juxtaposition, as Bryan and Murad (father of Marko, who was tortured then killed by Mills in Taken) were both fathers seeking what they viewed as rightful vengeance for actions perpetrated against their offspring. Taken and especially Taken 2 also both had exotic scenery & locations in Europe (Paris in T1and Istanbul in T2), which really helped sell the films.\r Taken 3 probably made a good choice when it decided to NOT have the film’s plot revolve around someone being “taken”. (How come they never use the word abducted or kidnapped?) However, being set in a typical American city (Los Angeles) and using a pretty generic story (innocent person framed for a crime, must find ones responsible) both didn’t set the odds in Taken 3’s favor. The whole “framed” trope is not a very effective plot device, because *SPOILERS* Stuart (Lenore’s husband) and Oleg Malankov (Stuart’s boss, of a sort) were both involved in Lenore’s murder, not as revenge against Bryan, but because of an unpaid debt between the two (and to get her life insurance money). Lenore was killed as punishment from Oleg Malankov against Stuart. Therefore, there is no real meaningful conflict between Malankov and Bryan, as Bryan was simply involved in the entire mess as a scapegoat (and Malankov is set as a villain far too late into the film). Even though Malankov is supposedly some sort of badass, he is a terrible shot and cannot get a single hit on Bryan. Bryan and Stuart's dynamic happens to be convoluted and unsatisfactory.\r Taken 3 is honestly sub-par and mediocre, especially compared to it's predecessors. I don't even know why Forest Whitaker is in T3; he is such a stereotypical by-the-book cop. I think another actor (Denzel W, Idris E, Samuel L. J) might've been better suited for his role. Unlike Taken 1&2, little time is spent on further developing characters, as the film is very fast-paced. There is action, but it is not very tense or exciting. How are we even supposed to root for Mills to fully kick ass when he's sometimes going up against American cops and possibly endangering civilians? Not to be racist, but it was easy to cheer Mills on as he defeated hordes of evil foreigners. (You could tell from looks who was a bad guy! :P) In chase scenes, shaky camera work truly ruins the fun; they're very choppily and awkwardly edited as well. CGI and big stunt sequences look low budget; Taken 1&2 looked better! The whole film is a half-assed conclusion to the Taken films, with mediocre acting, an uninspired plot, cliche and stereotypical characters (smart person has chess piece & rubberband to fiddle with), \"dues ex machina\" moments, unimpressive and overdone action sequences, etc. I blame Olivier Megatone and the other crew members (screenwriter, camera crew) for the faults of what could've been a satisfying conclusion to the Taken trilogy.\r However, despite everything I said earlier, I cannot deny that some younger (funny cause I am pretty young) and more carefree part of me enjoyed watching Bryan Mills have one last adventure (if indeed this is the last Taken film). I have some fond movie memories of Liam Neeson, and I enjoy most of his films (like Non-Stop in 2014). If you're not as cynical or critical as most movie critics eventually become, you may very well enjoy Taken 3.\r Score: 6.9\r I have reviewed 38 other movies, including the 2014 films: The Interview, Exodus: Gods and Kings, The Hunger Games: Mockingjay Part 1, Dracula Untold, The Maze Runner, Nightcrawler, The Equalizer, The Expendables 3, Teenage Mutant Ninja Turtles, Guardians of the Galaxy, The Giver, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, The Amazing Spider-Man 2, Divergent, Transcendence, Jack Ryan: Shadow Recruit, and more.\r I review TV shows, such as: The Flash, Arrow (Season 3), Gotham, The Last Ship, Sleepy Hollow, Marvel's Agents of SHIELD (Season 1 and 2), The 100, I Wanna Marry Harry, Crisis, Gang Related, and more. I also have reviewed the mobile Android games Minecraft Pocket Edition, Clash of Clans, and Five Night's at Freddy's."
    },
    {
      "rating": "6",
      "text": "This is an average movie if u compare it to the highly action packed Taken 1 but if u just sit back and take it more reflectively, then it is an OK movie.  its nothing great but tried to connect the dots from the previous movies in the series and \"end\" the saga.  the action is moderate; there's a lot more drama and sad scenes than one expects from a Taken movie but this is probably due to the \"ending\" of the series.\r if u are a fan of the previous Taken movies, then it is worth a watch just to see how it all \"ends\" but be prepared for less action than the previous ones.  if u are new to the trilogy then maybe u should catch it on dvd/rental as it is not so great on its own."
    },
    {
      "rating": "2",
      "text": "Pathetic second sequel, and hopefully the final one. Appears to have been made on the basis of a single discussion with no care for production values or plausibility. Yes, this was phoned in. And worst of all, was that this comes off as a daddy-daughter tale, so yeh, they totally flipped off their main demographic. Thank gawd this was free on an HBO preview weekend."
    },
    {
      "rating": "3",
      "text": "This movie might have been remotely enjoyable if there weren't a ridiculous amount of cuts per second. The script is implausible, the editing is amateurish, and the directing leaves no style or flair. Neeson and Whitaker maintain solid screen presences, but that can only go so far. Do not recommend."
    },
    {
      "rating": "2",
      "text": "Waste of time, broken vision of old concept. Anyway they shouldn't done the second movie too. Liam Neeson is very charismatic actor and has many good qualities but gosh, he's old for jumping, running and fighting as youngster. The vision of an old guy with belly who's doing those amazing stuff seems to be comic more than stylish. And dead bodies without holes and blood after they had been shot, is ridiculously funny."
    },
    {
      "rating": "2",
      "text": "Let us make no effort on being original, let us take snippets of overplayed and once successful cliche's, let us create a dialogue that a 5 year old would find insulting in how it contradicts reality, let us direct the actors with such little attention that the actors themselves seem to be mocking their own performance, and let us collect some money from this....hopefully.   An awful film."
    },
    {
      "rating": "3",
      "text": "Running out of kidnapped relatives for Liam Neeson’s ex-CIA killing machine to rescue, scribes Luc Besson and Robert Mark Kamen turn him into a fugitive framed for murder in “Taken 3,” a mind-numbing, crash-bang misfire that abandons chic European capitals for the character’s own backyard.\r In “Taken” (2008), helmed by Pierre Morel, Neeson’s Los Angeles-based Bryan Mills went after Albanian slave traders who kidnapped his 17-year-old daughter in Paris. Made as a low-budget B-movie that sent up U.S. politics and values even as it emulated American genre films, it grossed $227 million worldwide. The sequel, made four years later, reversed the pattern by having the Albanians’ vengeful relatives kidnap Mills and his ex-wife, Lenore (Famke Janssen). Despite the more elaborate action setpieces and heightened casualties, the premise remained just as basic and clear: The shocking way in which the hostages are taken, and the methodical manner in which the retired CIA agent tracked them, generated tremendous excitement.\r Without someone to save, the concept of a race against time is seriously weakened. While family matters were kept short and sweet in the other two installments, “Taken 3” stretches out the kitchen-sink drama endlessly: Mills’ daughter, Kim (Maggie Grace), who was 17 when she was first kidnapped, is now a college student facing serious adult problems. Her dad, however, still believes that, after having hurled a few hand grenades and driven a stolen car through a shower of bullets, she’d still be content to play with a stuffed panda on her birthday.\r Equally troubled is Lenore, who seeks consolation as her marriage to filthy-rich Stuart (Dougray Scott) is on the rocks. The possibility of Lenore and Mills rekindling their relationship is put on hold, however, when he’s forced to go on the run for a crime he didn’t commit. As he said to Lenore in the previous film: “I’ll be OK. It’s the people following me who’re gonna have a problem.”\r Given that Mills walked away Scot-free from double-figure body counts in Europe, watching him evade arrest by Inspector Frank Dotzler (Forest Whitaker) doesn’t yield much in terms of suspense or surprises. Mills describes Dotzler as “very clever,” though the latter’s theory that anyone who buys warm bagels can’t be a cold-blooded killer ranks among the more illogical police deductions in recent memory. Elsewhere, detecting and blocking each other’s tracking devices is pretty much the extent of their mental sparring.\r One of the series’ talking points has been its extremely negative portrayal of Albanians; “Taken 2” closed on a note suggesting the the blood feud would live on, and it would have made sense here for it to continue here, or for Mills to finally set foot in the hermit country. Alas, those characters have been ditched in favor of Russian mafiosos, who come across as pale imitations of the tattooed fiends in David Cronenberg’s “Eastern Promises.”\r What has made the “Taken” franchise such a guilty pleasure so far is its take-no-prisoners stance toward bad guys and its no-holds-barred brutality, especially coming from Neeson, an actor who radiates gravitas and nobility no matter what. Although less graphic in its representation of violence than its predecessors, “Taken 3” retains a gutsy realism in scenes where Mills matter-of-factly cracks bones and splatters brains, and the shoot-’em-ups, car wrecks and explosions are noisier and more bombastic than ever. They’re also unimaginatively choreographed, with zero forward momentum. Even as the scale of each production has increased, the scope of the action has diminished: Compared with scattering hand grenades all over Istanbul, it’s mere child’s play for Mills to blow up a classroom at Kim’s college.\r Without a doubt, the first “Taken” movie gave Neeson, then in his 50s, a new lease on life as an action hero. Now 62, the actor still has an imposing presence, but more often than not, he looks pretty beat and impatient to get things over with. Kim has evolved from an exasperatingly clueless brat to a feisty rescuer over two films, but there isn’t any real progression in character development or in Grace’s performance here.\r Stuart, a slimy wimp as played by Xander Berkeley in the first “Taken,” served as a neat foil for our straight-talking, straight-shooting hero. Replaced here by Scott, he behaves like a badass dude who is supposed to be Mills’ equal in gun-toting prowess; it’s a wholly unconvincing transformation. As Russian mafioso Malankov, Sam Spruell behaves like a cardboard James Bond villain, showing some vicious individuality only in the action scenes."
    },
    {
      "rating": "4",
      "text": "Taken 3 is pure escapist fare for people who want to forget the boorish relatives they had to spend the holidays with and the awful weather outside. Liam Neeson and Forrest Whitaker did not disappoint, although they had to deal with a pretty incompetent director and a maudlin script chock full of unrealistic heroics and unwarranted fidelity. When you are watching a car chase and you have no idea who is in which car, it is annoying, but if you want to escape a world much worse and more boring than your everyday one, you will enjoy your 108 minutes of Taken 3. I did."
    },
    {
      "rating": "7",
      "text": "First off I want to say I loved the first one. It was great, second one was a tad on the boring side, this one was better than 2 but overall felt a little lacking. Still had some twists but over all it didn't feel amazing. It was good, just not great.\r I guess I good example of the problem was the camera work on the highway chase scene. It was just a mess from an otherwise good concept. Too many close ups, jittery cameras and not enough pause or tracks.\r Good movie, just flawed."
    },
    {
      "rating": "4",
      "text": "Advice to studios: Avoid showing a trailer for a movie with the same lead actor, which makes you want to watch that movie MUCH more than the one you're there to watch.  Run All Night looks pretty fantastic, but Taken 3 was just slightly below average.  I'll see Neeson (as Bronson) movies till the cows come home, but this one is certainly nothing special."
    },
    {
      "rating": "1",
      "text": "Taken 3 is sucks,Liam neeson is more DIE HARD than Bruce willis in the movie . Taken 2 is far more better than Taken 3\rThe worst sequels ever.Some scenes is definitely make no sense"
    },
    {
      "rating": "8",
      "text": "I saw taken 3\r Here's my review: taken 3 was good. No I'm not on drugs or some other bs the plot was interesting and twists were very welcome. I truly believe this is what the true sequel to taken should have been after the mediocrity and campy cheesiness of taken 2. It had a longer runtime and never bored me once. Now it's not perfect but no way near bad the campiness is still there and the action over the top and cliche' \"omg he should've died! Wtf\" those complaints aside it was a well paced movie and I enjoyed it so forget about the mediocre taken 2 watch this instead it might surprise you more than you might think 8/10"
    },
    {
      "rating": "7",
      "text": "Although not close to the first movie in the series, Taken 3 was far better than the second. The story kept a high pace throughout the movie, and although I missed some good one-liners and better dialogue overall, I was entertained. That is the only objective of the movie, and in that it did a decent job"
    },
    {
      "rating": "4",
      "text": "There should have only been one of these, the first one was great, the second was **** and the third one was slightly better than the second one. The action in this movie is terrible and the movie is just boring and stupid.\r4/10"
    },
    {
      "rating": "0",
      "text": "Absolute garbage. A majority of the film being focused on Maggie and not Liam. Not much in terms of action either for a majority of the film either. They tried far too hard to make it into a some-what serious drama/action and the terrible plot/dialogue simply didn't work. What a terrible way to end a series, Should have just left it with the first one."
    },
    {
      "rating": "4",
      "text": "Story made no sense, and the entire movie hinges on the action within the first 30min. Why would he run and take down cops if he were innocent ?! No sense.\rAnyway, for the movie's sake (if you look over this part) it was full of action and even a few car chases!\rHis friends make an appearance (reminded me of the A-team at times), but in the end, it's Liam Nesson kicking it.\rIn summary, wait for rental or VOD. I should have waited. Not that great. I'd say Taken2 might have been better honestly, but the daughter is still just as clueless in this one."
    },
    {
      "rating": "0",
      "text": "The first movie was Commando, starring Arnold Schwarzenegger, but with the guy that died in Star Wars and Batman instead of Arnold Schwarzenegger. This is the third movie in that series. What do you expect? I've seen better written copy pasta."
    },
    {
      "rating": "5",
      "text": "No where near as good as the first movie, but in my opinion it is better than the 2nd one which is really not saying much. The acting from the cast is good as to be expected from the likes of now action star Liam Neeson and Forest Whitaker, but their efforts would be better used if only Luc Besson would put effort into writing a less mediocre script. The directing from Olivier Megaton who also helmed Taken 2, leaves much to be desired with the constant shaky cam during the PG-13 approved fight scenes that hamper the experience instead injecting realism into the already far-fetched story."
    },
    {
      "rating": "9",
      "text": "Taken and Taken 2 was better then taken3 ,but again liam neeson was superb ....\rnice movie but i was expecting more thriller from this movie...\rnevertheless they earned alot"
    },
    {
      "rating": "0",
      "text": "Taken 1 was at best a cliche revenge movie, but it was fast and punchy and it was simple, it was something new and when it came on at 8pm on Channel Ten ya mum watched it and made it most of the way through before she fell asleep. Taken 2 came out shortly after and sprayed diarrhea so hard even the simple people didnt enjoy it, Taken 2 was such a shameless cash grab it's astounding that retards paid money again, this time to see Tak3n. So people never learn and this movie took the top spot at the box office perpetuating the cycle of cheap **** movies, and more specifically **** rehashes which take up over 90% of recent releases (no actually, this is a real statistic) to make money off idiots.\r This movie is bad in the same way the Star Wars Christmas Special is bad, no-one wanted to see it, no-one wanted to make it, no-one gave a ****"
    },
    {
      "rating": "1",
      "text": "Taken 3 is a mess. A mess that could have been a solid sequel to the trilogy. After Taken 2, I lost all hope of the Taken sequels being any good, becuase Taken 2 was a mess as well. Taken 3 applies the same formula that made the first Taken so good, and cuts, copies and pastes the same acting and writing skills used. By this time, the formula has already been worn out, but the makers DONT care about it, they just want the money. And yes, they succeed, becuase all shows were sold out. When everyone watched the movie, 79 percent of them were sleeping and the other percent of the people were talking about Liam Neeson stopping acting altogether. And I have to agree with them because, the story was boring. Not a moment, did Taken 3 fully realize it's potential and kick ass. Even the action scenes lack a sense of joy that should have made this atleast enjoyable. Well, Forest Whitaker gives a solid performance as a by the book cop, and Famke Jessen- well, you'll have to see to find out. Or, just don't see it altogether, some taut moments aside, this franchise has gotten it's rotten apple of the bunch."
    },
    {
      "rating": "7",
      "text": "I'm a little shocked by the ridiculously bad reviews. This was a very solid action picture. The lead character had clear emotional stakes that kept getting raised. There were some twists that were not entirely predictable because the writing and performances were nuanced enough to keep you guessing a bit as to how the whole story was going to play out. The action sequences were pretty intense at times for the budget as well. The people who trashed this picture went into it wanting to hate it. Well, if you want to hate something, chances are you will. What kind of loser is looking to not enjoy themselves?"
    },
    {
      "rating": "2",
      "text": "This movie could be easily improved destroying every single copy on the market.\rThe action scenes (3/4 of the movie) are shoot in such a weird way that it is literally impossible to follow.\rTo see Liam Neeson running is a pain: let's face the truth, he is getting older like everybody else.\rThe plot is meaningless and split.\rI would like to find the director and \"use a certain set of skills\" on him.\rI won't mark it as a 0, because it is the last movie, hopefully, and they won't make more damages to the history of cinema."
    },
    {
      "rating": "0",
      "text": "worst movie i ever see it, taken 1 awesome movie, taken 2 its okay, but to much cgi und story awful, und taken 3`???????????????????????????? its looks like rambo mode, whats wrong with this movie. please no look this trash here."
    },
    {
      "rating": "6",
      "text": "Absorbing traditional action movie about an ex-agent using his special talents to take revenge from his enemies. Seen years ago in Charles Bronc Death Wish series, and lately in The Equalizer of Denzel Washington. Nonetheless it is a movie that is never obsolete specially with an actor as charismatic as Liam Neeson (Bryan Mills).  Bryan Mills is caught amidst a business settling between his ex-wife husband (Dougray Scott) and Russian arms dealers. His mission is to protect his daughter (Maggie Grace) and take revenge for his murdered wife (Famke Janssen). He did it skillfully under the admiration of police officer Forest Whitaker. No real scenario or acting, no interpretation of how done, just super human skills, even beyond police, that's it from the very beginning, no wonder Bryan Mills got them all at the cost of some scratches. The theatre was almost full for this favored theme and actor."
    },
    {
      "rating": "4",
      "text": "Lazy in every department as the studio stitches together every cliche and set piece from every other action film since the 80s. Taken 3 should be retitled The Fugitive 2, seeing as it steals the plot so often. Even Neeson looks tired of it all. An average action film for anybody who doesn't want to make any effort."
    },
    {
      "rating": "5",
      "text": "While Fast and Furious franchise is successful in expanding into a larger scope and at the same time to maintain its original theme, it seems that Taken has been trying its best to follow the same path but ended up with incoherent direction and almost diverting entirely from its basic. It's always great to see Liam Neeson back in action, but this slightly skewed towards family violence drama than the action sequences of race against time in the first episode seems to be less exciting. It has some memorable score (A Stutter feat. Arnor Dan by Ólafur Arnalds), it still presents the same kind of lifeless actions with some unintentionally hilarious moments which shall manage to attract the attention of the crowd, otherwise it just changes the previous mediocre Taken 2 into Taken which the taken target this time is actually the audiences rather than the characters themselves."
    },
    {
      "rating": "8",
      "text": "Don't let the poor critic reviews fool you! This film is no where near as bad as people say it is. While it many not be as great as the original it is a vast improvement over the second film. A great film with a great twist and a great ending."
    },
    {
      "rating": "8",
      "text": "I didn't saw the first two,so I don't know if he's better or worst.But I can say that it's a really good movie.Liam Neeson is really good and the action scenes are really well made even if sometimes it's impossible to survive but he make it."
    },
    {
      "rating": "3",
      "text": "With terrible action sequences and poor story Taken 3 is a mess that is somehow worse than Taken 2 It’s decently acted and the story has some bright ideas when it’s not ripping off the fugitive, it just never fully executes them.  I think this film could have been a lot worse than it was, but with the product that we have now, it’s not one that I would really recommend, except to huge Taken fans.  The tag line of Taken 3 is “it ends here”, well thank god it ends here because it is very clear from Taken 2 and Taken 3, that this film should never have been a franchise.  This whole thing kind of feels like a studio mandate, because the studio were insisting that this had to be a trilogy.  I wouldn’t be surprised if I found that out.  But as it stands Taken 3 is a pretty disappointing start to 2015 for me.  It may have more of an identity than it predecessor, but it’s worse than its predecessor purely on the fact its action sequences are a lot worse and it’s plot has a lot more contrivances that it is very difficult to get past.  I really wanted Taken 3 to bring the franchise back, but as it stands, it doesn’t work.  This is a film I would recommend only renting when it comes out on DVD.  If you must see it in cinemas, don’t bother with IMAX, it’s a waste of £4.00."
    },
    {
      "rating": "0",
      "text": "Script-1/10\rEditing -1/10\rActing-4/10\rCGI-1/10\rDirecting-2/10\rPlot twists-None\r Worth to watch in Cinema -NO\rWorth to buy Blueray -No\r overall ratings-1/10"
    },
    {
      "rating": "7",
      "text": "you know liam neeson is good, so the movie was good.\rit was not even close to taken 1 but it was good and it was almost as good as 2.\rthe action was good but i think because they went to the 3rd one they didnt have a good story to tell."
    },
    {
      "rating": "7",
      "text": "Pretty fun movie to watch. Neeson is awesome as usual. Story is pretty decent with a twist which is somewhat predictable but still done in a good way. Action scenes were very good and not too over the top like a lot of similar movies; some of it is believable actually."
    },
    {
      "rating": "7",
      "text": "**** the critics, the film is watchable entertainer- it not much good as taken, but taken 3 -still entertaining -highligh factor is LIAM NEESON- HE JUST GETTING VERY GOOD IN ACTION - story has offer nothing ,but it keep u still the end- climax chase is very good-  over all 7 out of 10 for me"
    },
    {
      "rating": "8",
      "text": "Man i was nearly gonna miss this movie due to the bad reviews, but i'm glad i saw it and it's really not bad at all. Those who liked the first one, and even second, will definitely love this 3rd and last one. Nice story, not so predictable, good acting. Well, it's a well rounded action movie after all. Haters will hate. Go watch it"
    },
    {
      "rating": "3",
      "text": "Redundancy is strong in \"Taken 3\", an unneeded sequel of the unneeded sequel that while contains a few moments performed by Liam Neeson and Forest Whitaker worth watching, its plot is banal and the action sequences are too frenetically edited to provoke excitement. Some people say that it's better than the second film. Well, that's no large feat. The previous movie sucked, and this one is not an exception.\r Liam Neeson returns as ex-covert operative Bryan Mills, whose long awaited reconciliation with his ex-wife is tragically cut short when she is brutally murdered. Consumed with rage, and framed for the crime, he goes on the run to evade the relentless pursuit of the CIA, FBI and the police. For one last time, Mills must use his \"particular set of skills,\" to track down the real killers, exact his unique brand of justice, and protect the only thing that matters to him now - his daughter.\r Now, the movie opens with some armed guys who work for this veteran operative named Oleg Malankov, basically a generic antagonist whose plan is absurd. After Lenore's husband kills her, Bryan Mills does what he is best at: Goes after them, while also escaping from the cops. The action, just like in the second movie, sucks. Shaky cameras, quick zoom-in and cuts... it's bad and hurt my eyes just by seeing them. Olivier Megaton clearly doesn't understand what made the original Taken a hit. As for the actors, they're fine. Can't say they did \"an extraordinary\" job, but they were okay. Liam Neeson's presence prevents myself from giving a much lower score than this and I like Forest's performance. In fact, I love him as an actor.\r One thing I don't understand is that the police thinks Bryan murdered his ex-wife Lenore, but they don't know he risked his whole life to save her in the previous film (not to mention, he f*cking killed hundreds of people and travelled far to save his daughter in the first film). And suddenly, Stuart is part of some illegal business with a dangerous veteran... whatever.\r \"Taken 3\" reminds me of \"The Next Karate Kid\" and \"A Good Day to Die Hard\", it shouldn't have been made. It shouldn't have been a franchise. It's an obvious cash grab that offers little to the movies aficionado. If you're going to make a movie that serves only to generate cash, at least do it right. Stop wasting audience's time, for God's sake.\r Final Score to Tak3n (God the title is so dumb): 3/10. It was a little enjoyable, but it's diminished by its moronic script, terrible direction and bad action scenes, even if Liam Neeson and the rest of the cast gave everything to make this movie right.\r (Hey, at least the movie wasn't Transformers: Age of Extinction)."
    },
    {
      "rating": "10",
      "text": "most spy film-fan's like myself had predicted that this year 2015.\ris the year of the spy. liam neeson's character brian mills had really shined in this film\rthe action was up-close and spot on.\rthe storyline starting with mills losing his ex-wife never went down well with me. reason being the last\rtaken installment film, actually gave the viewing audience the impression that ex-wife and brian are\rreunited as a family,\ronly now we find out in taken 3  that her present husband stewart want's her back.\rhowever she being murdered in this film. which also means actress famke jenssen is out of the\rpopular growing franchise, if theres to be another taken film, how does the next story evolves around\rthe brian mills family? anyway I liked this installment,  it's going to be very interesting to see which other\rspy related thriller is going to rule the box-office this year. my guess is 'spectre'"
    },
    {
      "rating": "7",
      "text": "Another unnecessary Taken sequel. In an effort to keep things fresh changes were made to the formula. As a result though a lot of what made the first Taken such an enjoyable hit is missing here. The action is more based on big spectacle as opposed to the more believability of the first film. The excellent hand-to-hand fights that were so enjoyable are barely here at all. Instead the majority of the action is composed of a lot of chase scenes (particularly car chases) and shootouts. Explosions are thrown in for good measure. Add in a plot that tries way too hard to be complex and you have a movie that fails to live up to it's predecessors.\r However I would be lying if I said that this third movie isn't still an enjoyable action-thriller. Most of that is due to Neeson. He's still an enjoyable action hero, even if this is the first movie where it looks like his age is getting to him. He doesn't get up quite as fast anymore and takes more hits than we are used to seeing. He's still the guy you don't want to mess with though, and he still sounds great when he's saying intimidating stuff.\r For a while the movie lacks progress in moving it's story forward. It tries to set up some sort of mystery. However it seems the writer(s) knew they didn't really have one here so they decided to keep audiences in the dark for as long as possible by having Neeson just run from cops for a significant portion of the movie rather than going after the bad guys. Neeson's character never even really pieces things together. The whole big picture just sort of falls in his lap and he goes on taking down the bad guys while trying to keep his daughter safe. Not exactly satisfying writing, but it gives us an excuse to watch Neeson go.\r It's nice to see Neeson's old allies get in on some of the action this time. This isn't the Expendables though so don't expect them to go in guns blazing with him, but they play an actual role in helping him as opposed to just being there like in the previous films. However the real ingenuity still comes from Neeson. It's a blast to watch him stay one step ahead of his pursuers the entire time. The actual action isn't anything special, but still manages to entertain.\r All in all this third sequel is a case of good, not great. Well, maybe more like decent. It can be a perfectly entertaining ride for those who come in not expecting too much and wanting to see more Neeson. This biggest issue is basically that this doesn't feel like a \"Taken\" movie at all. The characters are here, but the magic of that first film isn't. Instead what we get is a solid, but not terribly remarkable action-thriller. One that would make for a pretty nice rental, but won't standout among the other action movies you've seen. It's not one I regret watching and I did enjoy it, but I would've appreciated a whole lot more. Thankfully Neeson keeps things going."
    },
    {
      "rating": "4",
      "text": "I watched this after walking out of two other really terrible movies in a multiplex theater.  Therefore, the movie did not have to be good to be an improvement.\rIt met my low expectations for a lightweight film with some good (totally over-the-top) action sequences but an unbelievable plot."
    },
    {
      "rating": "1",
      "text": "Although still called Taken, this is really false advertising as no one actually gets 'taken' this time. Instead what we have is a remake of The Fugitive, well what we really have is a really, really, REALLY bad remake of the Fugitive. Accused of killing his wife, Leeson goes on the run, presumably to his nearest bank to cash his pay cheque, closely followed by Forrest Whittaker. Shameful, lazy filmmaking that treats the audience with the utmost contempt"
    },
    {
      "rating": "7",
      "text": "While Taken 3 was nowhere near as exciting as the first two films, it at least made a lot more sense, as far as the story goes, than the second one. This is the sequel that the first film deserved. Liam Neeson does a solid job, though he is beginning to show his age. Forest Whitaker plays the exact same role he always does but he does it well. It ended kind of weak but it was definitely a good movie overall."
    },
    {
      "rating": "0",
      "text": "The first film had used up all its puff and zang, and there was little there to begin with. This is more convoluted, more incomprehensible. The action scenes are, in all honesty, boring and lacking any suspense the first film managed to (barely) generate. I'm thankful that this will be the last of the 'Taken' films."
    },
    {
      "rating": "1",
      "text": "TAKEN 3 is not even a movie. I love the first TAKEN. Really love it. This flick is totally incomprehensible. Did no one making this film realize that it is Neeson and his interactions that make his films work? Instead he's like the terminator. Action, action, action, but nothing you ain't seen before and done much better."
    },
    {
      "rating": "6",
      "text": "Definitely an improvement over the second film, which really isn't saying much, as it falls way short of the first. Just like the second film, it's mindless, dumb entertainment. However, the reason I liked this one a little better is because the filmmakers decided to try something new rather than having someone get taken again (thank God!) Liam Neeson does what he does best in action films. Overall, I felt that it was a rather rushed but entertaining final film in this somewhat forgettable trilogy of films."
    },
    {
      "rating": "7",
      "text": "I think Taken 3 has gotten some undeserved reviews. I think that Taken 3 beats the first sequel, it doesn't beat the first of course but the movie certainly isn't that bad. The Taken name doesn't really suit this movie of course because no one is Taken but really in the end the movie was only made to make money. I didn't like the idea to get rid of Framke Janssen at first because she was one of the best characters in the whole series but they did well bringing Forrest Whitaker in, I thought he did a good job in there. I found myself cheering for Whitaker and Liam Neeson at the same time. I really enjoyed the first hour of the film more than the more action packed ending, I thought the drama at the first part of the movie was great and it set up Liam Neeson's motive to save his family yet again. I hope that this is the last Taken film and really it wasn't a bad conclusion."
    },
    {
      "rating": "8",
      "text": "Although many people say that this movie was terrible, just like the second one, personally, I really enjoyed this movie. A common theme with the Taken movies is the action-packed, thrilling scenes. I liked Taken 1 a lot more than Taken 2, but Taken 3 put me at the edge of the seat the entire time! The movie wasn't perfect though. Some things about the movie could have been changed and made better, but overall the movie kept me interested throughout the whole thing with suspense and new plot twists."
    },
    {
      "rating": "2",
      "text": "The neatest thing about Taken, the French-made chase flick that launched the action-star phase of Liam Neeson’s career, is the way it bundles together a whole lot of parental and urban fears, then sublimates them into pummeling action. It’s a movie of relentless and reckless momentum, premised on a middle-age paranoid kook’s worst case scenario.\r Taken 2 tried to one-up the original’s “kidnapped abroad” setup, but ended up producing something that only felt louder, uglier, and a lot less fun. Kudos to Taken 3, then, for at least trying something new. Instead of rescuing a family member from Albanian mobsters in yet another world capital, Bryan Mills—the throat-punching, elbow-chopping ex-CIA operative most people think of as simply “Liam Neeson”—finds himself framed for murder in L.A. It’s a conventional riff on The Fugitive, complete with Forest Whitaker in the Tommy Lee Jones role, but at least it’s tapping into a set of fears and fantasies—about divorce and being replaced by a step-parent—that are distinct from those of the original.\r What makes Mills compelling—aside from Neeson’s performance, naturally—is the fact that his cartoonish over-preparedness and ability to escape from any situation are rooted in anxiety. He’s the perfect father for a kid who’s been kidnapped by armed thugs, but over-protective and awkward otherwise—a fact that Taken 3 underscores when Mills, who can effortlessly elude the best and brightest of the LAPD, slumps over after learning that his now grown-up daughter Kim (Maggie Grace) is pregnant. He’s an invulnerable action hero for the same reasons why he’s a difficult parent and partner.\r So what, exactly, is wrong with Taken 3? A lot of things, most of which can be attributed to the fact that director Olivier Megaton—who also helmed Taken 2—couldn’t mount an action scene if his life depended on it. Pierre Morel, the cinematographer-turned-director behind the original Taken and the parkour flick District B13, at least had the good sense to move the camera with Neeson, playing off of his size and heft to create momentum. Making good on his name, Megaton takes the quantity-over-quality approach, executing a flurry of cuts across as many sloppy angles as possible, producing a gurgling brownish soup of photochemical textures and handheld jitters. This is the sort of movie where it takes a half-dozen shots for a man to jump over a fence. It’s busy, but lacks any sense of movement, and is too visually monotonous to work on an abstract level.\r Because Mills’ hyper-competence never seems exciting, it instead becomes giggle-inducing. While, at this point, co-writers Luc Besson and Robert Mark Kamen are clearly milking the character’s tendency to speak in super-serious declaratives for intentional laughs (how else can one explain lines like, “I put something in the yogurt to make you nauseous,” and, “I have low blood sugar because I haven’t eaten since yesterday”?), it’s safe to presume that the high point of a sequence where Mills breaks into an LAPD garage isn’t supposed to be the shot of our towering, sixtysomething hero casually sliding out of the trunk of a car. Running a solid reel longer than either of its predecessors and featuring the worst car chase in recent memory, the movie amounts to little more than generic action slop, enlivened only by brief glimmers of intentional and unintentional comedy."
    },
    {
      "rating": "6",
      "text": "The third installment of the successful franchise prove one thing in that Liam Neeson is an action star; other than that this sequel isn't on par with the previous as it suffers from poor editing and story In the end, fans of the franchise can get some good action scenes out of this one and nothing else."
    }
  ]
}