{"id": 1005, "title": "Taken", "starring": ["Liam Neeson", "Maggie Grace"], "runtime": 94, "genre": ["Action", "Thriller"], "description": "While vacationing with a friend in Paris, an American girl is kidnapped by a gang of human traffickers intent on selling her into forced prostitution. Working against the clock, her ex-spy father must pull out all the stops to save her. But with his best years possibly behind him, the job may be more than he can handle.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/y5Va1WXDX6nZElVirPrGxf6w99B.jpg", "categories": {"plot": 6.739130434782608, "acting": 6.0476190476190474, "ending": 5.666666666666667, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 5.0, "action": 6.580645161290323}, "reviews": [{"rating": "8", "text": "Surprisingly well done, and very intense. Liam Neesen does and excellent job playing the role of the action hero. The James Bond franchise should look at this movie and take some pointers."}, {"rating": "8", "text": "Taken is \"slow\" at the beginning FOR A REASON. It must make you CARE about the man's daughter and the relationship with the father. Otherwise you won't be invested in the outcome. How can these critics not realize this? Taken is NOT about a former CIA agent rescuing his daughter. That's the location. It's really about an estranged parent and the lost love of a child and not giving up no matter how hard it is to repair that. Saving your bond with your child is tough but worth it. C'mon movie critics should know that!"}, {"rating": "6", "text": "Could have been a lot better. The first half is really engaging but the movie loses steam going into the second half. The ending could have been more rewarding, too."}, {"rating": "10", "text": "Are these \"critics\" out of their minds? I'm not really in the mood of writing a review after metacritic turned down my last review saying the film wasn't out yet when it had already been out in the UK, so I'm not going into detail, but Taken was just as good as, if not better, than any of the Bourne films. Neeson was absolutely awesome as always, and it provided some of the best action (non-stop) of 2008. Brilliantly shot, and the story actually stayed quite unteresting, but the film stayed true to it's roots, a hard as nails action flick in which Liam Neeson tares apart anything with legs. I LOVED this film, please watch it. Unless you're a stuck up snob who tries to pride himself among watching independent films and only agreeing with metacritic's review scores, and not taking the time to sit back, relax, and enjoy a film, then watch this and you wont regret doing so."}, {"rating": "8", "text": "Liam Neeson displayed a very deep, very dangerous man in this intense thriller directed by Pierre Morel (From Paris With Love, District B13). The story takes you in from the first scene. Hence the title: Taken. Liam Neeson plays Bryan Mills, a former spy with very deadly, very stealth, and very deadly skills that make him a straight up nightmare to people involved in dirt, scum, kidnapping rings, drugs etc. When his daughter and her best friend take a trip to Paris to follow rock group U2 on their Europe tour, things go terribly wrong and the two young girls are kidnapped and taken into a seedy underworld of prostitution and drugs. Mills knew that it was a bad idea the whole time, but his ex-wife played by Famke Janssen encourages the trip to let her daughter be free and see the world. Neeson engages in a personal mission to get his daughter back, a process that he is willing to stop at nothing for.-Taken was directed really well and has some pretty good acting. The super-glue of the film was in fact the tense story. Overall 'Taken' was a very original and interesting story, and it ultimately proves that you do not want to **** around with Liam Neeson, especially if it involves his daughter! Very good movie."}, {"rating": "10", "text": "Screw the critics - I loved it. Get's into the story quick and doesn't let up. Give me this over and over rated James Bond movie any day."}, {"rating": "8", "text": "Great action - not for the bleeding hearts who mostly review movies."}, {"rating": "10", "text": "Fun flick. Just what you would expect. 1 and 1/2 hours of *ss-kicking."}, {"rating": "6", "text": "First of all, the drawbacks. I know I hate to do this, but there was a few things wrong with the film. For one thing, it was slightly predictable because I didn't think this film would end with something bad happening. Everything's good until the ending, it just sort of fizzles out. Next, it would be pretty exaggerated that someone would be able to rescue someone from a human trafficking group in only a few days. The pacing was a bit thin on the ground, and I also think the girls were portrayed as screechy, weepy, able to believe anything anyone says and blab everything to someone they've just met. Now that's over and done with, there's a few good points I'd like to say. It tackled a very important issue, and, even if it were over exaggerated, that does happen in the world, so it was quite brave to tackle this kind of issue. I think the violence was the least of my problems, and it was thrilling to see Liam Neeson do a bit of ****-kicking because he definitely looked suited for the role. I loved the relationship of his daughter and him, which made me hate the step-father and mother more (what an **** hole and a **** Generally it was a entertaining film, it just needs a bit more work to fix the predictable and confusingly paced storyline, although I think the critics have been a little harsh on what I call an OK film."}, {"rating": "7", "text": "Finally saw the root of many memes! :D What can I say.. Thrilling action movie with of course some disadvantages like poor dialogues, underdeveloped history andd not so good ending. But beyond that, Taken is great."}, {"rating": "9", "text": "Don't believe these morons (critics), Taken is an overall great movie. The pacing is perfect, with never a dull moment or long, drawn out dialogue scene. Neeson is entirely believable, especially if you are familiar with the problems of human trafficking. Can't wait to get this on Blu-ray."}, {"rating": "10", "text": "The problem is people are comparing this to other revenge movies. When simply this movie is all about an endless sacrifice and the power and emotion behind this makes you realise that family is the most important thing of all. I related to this movie so much as I have a daughter and felt the real emotion. Amazingly acted and one of the best character relationships I've seen in a movie."}, {"rating": "9", "text": "Very good movie. Worth the money. It has a very good story line and keeps you on the edge of your seat. The movie starts off great and continually moves up the ladder."}, {"rating": "10", "text": "I highly recomend this movie, especialy if you were disipointed by the last James Bond film. I find Neeson's character more comelling than Bond because he's not in it for the beautiful women, he's in it to save his family."}, {"rating": "8", "text": "Solid action all the way through. Neeson does a great job in this film."}, {"rating": "8", "text": "A good action film, worth the watch. Liam's Neeson puts in a decent performance throughout but I was let down by the weak ending."}, {"rating": "8", "text": "I read the critics' reviews for Taken before heading to the theater, and they almost dissuaded me.  However, I thoroughly enjoyed the movie.  Sure, it lacked the psychological pins and needles that every movie these days must walk upon before being branded as \"watchable\", but I liked that.  It was elegantly simple.  It didn't try to be too complicated.\rGenerally speaking, movies of that nature really are a bore, but Taken pulled it off very well.  It wasn't a plot involving Russian conspiracy, or aliens, or betrayal by the American government.  It was about a retired CIA field agent who, with all of his skills, can't seem to manage a successful life.  But he puts those skills to use to get his daughter back, simply because he's a dedicated father.  That's it.  Why do movies have to be taken so seriously these days?\rSee Taken if you like Liam Neeson, and you enjoy just having a good time watching a movie.  Avoid it if you prefer to have to unravel a large puzzle to get to your coq au vin."}, {"rating": "8", "text": "You get what you expect. Liam is an awesome action hero. I don't expect high review scores by the newspapers but people will like it."}, {"rating": "8", "text": "It is absolutely, positively absurd that critics are not giving Taken much better reviews. (48). It a really good story, well acted and directed and the viewer cares about the characters-which is rare in a film. Dark Knight an 82, Gran Torino a 72 and Taken a 48? I don't think so."}, {"rating": "10", "text": "Could only have been better if instead of Albanian bad guys it was Wall Street Bankers! Gets your mind off everything!!!"}, {"rating": "9", "text": "Great movie although a little too short, leaving one longing for more."}, {"rating": "10", "text": "Fantastic movie. I will start reading more of the users review and much less the of the critics review. I was not expecting much as the critics score 50. But the movie was quite a suspense and I shook from the beginning to the end. The actors were convincing in their role with the only exception of the daughter. Liam Neeson is superb. hopping theaked qued on my seat from the beginning to the end. comments."}, {"rating": "5", "text": "Liam Neesen makes a convincing action hero with a \"particular set of skills\" in this wisp on an action film.  Things move along at a rapid pace and the outcome is never in doubt which makes for a tidy movie going experience.  Still, a little bit of complexity and a touch of emotional depth would have helped to keep this meager revenge fantasy from fading almost instantaneously from memory."}, {"rating": "7", "text": "This movie is great. Liam Neeson did an awesome job, but there were a few cheesy parts / parts with poor dialogue that could have been done better. It was not a fault of the actors and I feel like they all played it out very well. Also this is partially due to it being a new series. They had to start somewhere, even if it meant a very simplistic concept / plot. If you're looking for some interesting action scenes you will probably enjoy the movie overall. Sort of an underdog to the 007 movies, but I am excited for Taken 2 and I feel like if they play their cards right they can make Taken a bit more distinguished."}, {"rating": "8", "text": "I really didnt know why I liked the movie as much as I did until I relized that it was Liam Neeson's performance that took this film to the next level. The action is great, the plot is interesting but somewhat generic compared to other action films, and the cast is solid. Totally worth watching."}, {"rating": "5", "text": "It's got all the attributes of a guilty pleasure - excitement, some undeniably enjoyable scenes and the absence of what it needs to be more memorable and more substantial."}, {"rating": "5", "text": "Taken doesn't bring much to the table.\rThe movie is paced well, the story if fine, and the action is lackluster. It mainly is plagued with an extremely simple plot combined with a very predictable outcome. An okay action flick."}, {"rating": "8", "text": "I definitely think Taken deserves a 65 or even 70 instead of 50 ! The film is very touching, with Liam Neeson playing a loving father who is willing to do anything to rescue his daughter no matter how wrong and cruel those things are. That is what makes this movie unique, for it is just 30% an action movie in my opinion. The remaining 70% goes to the father's complicated yet determined internal feelings as he is on the way to kill every bad guy responsible for his daughter's abduction."}, {"rating": "9", "text": "Pretty fun and thrilling movie is violent. Liam Neeson is great in the film and the movie is very fun. The plot is pretty stupid but Liam Neeson doing his bad-ass job is always entertaining."}, {"rating": "5", "text": "Liam Neeson makes a surprisingly convincing one-man mean machine in \"Taken.\"\r Onetime Langley grunt Bryan Mills (Neeson) has moved to Los Angeles to be near his spoiled 17-year-old daughter Kim (Maggie Grace), now embedded in a world of luxury since his ex-wife Lenore (Famke Janssen) married rich businessman Stuart (Xander Berkeley). When some ex-CIA pals offer him a night’s work bodyguarding a singer (Holly Valance), it’s clear Bryan has lost none of his Jason Bourne-like skills when he saves the diva from an attempted slaying.\r Under pressure from Lenore, Bryan reluctantly agrees to let Kim go on a Euro trip with schoolfriend Amanda (Katie Cassidy). But when both girls are kidnapped by evil Albanians within minutes of their arrival, Bryan hops one of Stuart’s private jets to Paris to find her. He reckons he has 96 hours before Kim ends up a drug-addicted lump of white meat.\r Besson alum Pierre Morel, who was d.p. on “The Transporter” and previously helmed 2004’s futuristic actioner “District B13,” wisely doesn’t give the viewer any time to ponder the string of unlikely coincidences in the script by Besson and regular scribe Robert Mark Kamen. From the actual kidnapping — breathlessly staged with Kim actually on the phone with dad — to Bryan arriving in Paris and immediately causing a pileup outside the airport, pic has the forward, devil-may-care momentum of a Bond movie on steroids.\r With grudging help from former French intelligence op Jean-Claude (Olivier Rabourdin) and an Albanian translator (Goran Kostic), Bryan discovers and then trashes the baddies’ ramshackle brothel prior to tracking down kidnapper Marko (Arben Bajraktaraj) and his gang. He then learns Kim has been sold in a high-class auction arranged by a certain Patrice St. Clair (Gerard Watkins) for — natch! — Arab clients.\r Interventionist politics of the movie, which plays like “Rambo in Paris,” hardly bear thinking about, but Neeson growls his way through the functional dialogue as an unstoppable killing machine in impressive, cold-eyed style. For a thesp now in his mid-50s, he handles the niftily edited, bone-crunching action way better than his scenes as a sappy, devoted father. Other thesps simply register as evil gun-fodder or script cutouts (including a wasted Janssen), with only Rabourdin suggesting anything like a real character.\r Widescreen package is technically slick at all levels, and ditto the action choreography, in a cartoonish way."}, {"rating": "5", "text": "The movie is surprisingly good if you look at decent standards. However if you think harder, you would suspect that the movie's a kinda bit... shallow?"}, {"rating": "10", "text": "Thought it was excellent! Especially 'i will find you scene'. Maybe you got to be a parent to understand it!"}, {"rating": "2", "text": "I like Liam Neeson. I like Luc Besson. I even like Pierre Morel and thought his District B13 was great fun. But this? No, not so much. \"I'll tear down the Eiffel Tower if I have to\" and such dialogue was worse than any fingernails on the chalkboard and the ignorant xenophobia that's framed as paternal love is so ridiculous it hurt. Had they played up the camp aspect of all this crap it might have been more enjoyable. As it is, it just plays to the myopic Middle American mindset that equates \"foreign\" with \"evil\", shows an older actor pathetically attempting"}, {"rating": "2", "text": "\"Taken\" is an insult to the intelligence of the viewers and the star of the movie. The action sequences are just as unbelievable as the other events in the script."}, {"rating": "9", "text": "Exceptional!! Taken is the most adrenaline pumping, action packed thriller I've seen in awhile. Taken stars Liam Neeson as Brian Mills an ex-black op's agent who while trying to reconnect with his estranged daughter allows her to go to Paris for some fun and relaxation away from home. But as soon as they get there she is kidnapped by a group of men who are involved in human trafficking. Now Brian has less than 48 hours to find her or she's gone forever. Taken is one of the most well made movies to come out this year, it's an amazing thrill ride that you cant miss. I very highly recommend this movie."}, {"rating": "1", "text": "Utterly and completely awful. Taken trips along, fueled only by Liam Neeson's passable performance. To say Neeomson's performance is anything but aweful is to say a lot though seeing as the script was like that of a D grade straight to DVD thriller. More disturbing still was the definite xenophobic vibe that oozes from this peice of tripe. If the Bourne movies (which I actually quite admire) and Hostel were to meet and produce an ungodly bastard child, he would resemble this."}, {"rating": "0", "text": "The most xenophobic movie I've ever had the misfortune to see. There is one part where he shoots a person for being French, how does this get released?"}, {"rating": "7", "text": "Taken is a surprise in the fact that  it's enjoyable on a lot of levels most notably in it's main character and it's action sequences which were both well done and Liam Neeson is really on top form for both. the film has excellent cinematography  and the plot while engaging suffered from having a lot of aspects kind of rushed and not fully explored. i also think the film could have used a more bond style villain to seem like a challenge to Bryan mills though that may have decreased the films realistic tone. that being said it was a film that is a great turn off you're brain and just enjoy feature and i would still place it as a possible recommendations over a lot of the large amounts of action films on offer nowerdays"}, {"rating": "6", "text": "This film was missing kick the crap out of everyone who gets in your way action. Many will say that it was not needed but I think that thing makes this type of movie much better. Liam Neeson's acting was nice, loved it. But there was a problem with the story, it was too simple. The story needed to be more powerful. Also, the character development was also not done nicely. They should have done the character development seeing that the sequels are gonna come. Overall, you will enjoy the film but it's not for hard-core action fans."}, {"rating": "3", "text": "It's passable. You know the movies where 10 bad guys are shooting at the hero and nobody hits him? That's this one. Repeatedly. How bout the movie where everyone tries to kill the hero, then just when they got him, they tie him up, wait till he wakes up, says some fancy words, and then say \"kill him!\". Yep. Got that too. Watch one of the Bourne movies again instead. They're much better."}, {"rating": "0", "text": "Laughable action sequences, laughable story. avoid at all costs!"}, {"rating": "9", "text": "Liam Neeson does an exceptional job in this film. Love the way he bashes bad guys faces in while only breaking slightly more of a sweat then Bond. Good movie. Well worth your time"}, {"rating": "1", "text": "Taken represents a wierd oblique encouragement for western authorities to 'take the gloves off' when dealing with middle eastern threats, represented here by Albanian slave traders with a crescent moon tattoos. The other enemies, of course are the corrupt, and decadent French, who for some sin or other are characterised as ammoral devils who would turn a blind eye on western girls being sold into sexual servitude for just a few Euros. Somewhat wierd for a movie that cites a Frenchman in its production. Sadly fact is usually more amazing than fantasy and this movie is no exception. Something based on the real plight of Eastern European women being sold into forced prostitution could have been far more compelling. This movie soon degenerates into a sadistic tirade of the hero beating up and killing dozens of run-of-the mill bad guys. The movie has no pauses, no moments of realisation, nothing interesting or scary. No good dialogue, nothing but the celebration of the killing prowess of a professional killer. Liam Neesen dials in a very unenthusiastic performance looking very much like an actor who lost his wife in a skiing accident, with no interest in the slightest in making a movie glorifying murder, going through the motions because he will get a paycheck so that he can go back and spend quality time trying to live as happily as he can in the shadow of his loss. As far as I can see the whole thing is some kind of propaganda effort trying to reinforce negative stereotypes. The action is the same crap you see in almost every American movie these days. Fight scenes where the hero is good at ramming random household objects up the noses and into the brains of certified 100% guaranteed 'bad guys' who deserved to die. The audience is thus invited to relish and glorify a whole bunch of romantically enhanced butchery, and feel great when the good duy inevitably walks into the sunset, without even bruised knuckles. Since practically everything made in America is made to exactly the same recipe, taken is your standard contemporary American garbage with a Frenchman embarrassing himself in the credits. I'm sure Albanian slave traders are very nasty indeed. A movie that dealt into the hows and whys of that would have been much better than this crap. Don't movie makers understand that incessant violence dilutes the dramatic power of violence. The fear of death is worse than death. There are a thousand creative cliches that advice film makers on what constitutes narrative power. All yellow and red reviews indicate signs of intelligence. Green constitute the mob. Fools all."}, {"rating": "5", "text": "It's a cross between Frantic and the Bourne movies, but by the Transporter Team.\rI suppose there's some appeal in seeing kidnapping scumbags get their come-uppence, but there's no real tension or intrigue. He goes to France, he follows the trail with improbable ease, he kills EVERYONE, often with just a quick flick of the wrist. He gets knocked on the head and captured once...3 minutes later he kills them all too.\rEntertaining enough guff, but it's nothing more than a very daft action movie with some nasty scenes and a reasonably respectable lead actor."}, {"rating": "5", "text": "Influenced by the Bourne films, but unlike those, fails to make sense of the way a professional would handle himself in the given situation. Neesons character dives suicidally head-first into problems which would require thinking and calculation, and instant gratification follows. You would expect more from such quality actors and writers. (The personal issue at hand can't excuse the total lack of sensible behavior. If that were the case, the movie would negate itself). If you replace Neeson with Steven Seagal, it would accentuate what this movie really is: A mediocre action-flick."}, {"rating": "3", "text": "This movie is utter garbage, now i knw why d name \"liam neeson\" rang no bells...\"Taken\" definitli topped mi list of crappiest movies of 2008.i mean seriosly,i was nt d list bit thrilled...nd d 1 liners \"this is nt a threat,wen i get u it will b very slow nd it will hurt\".(wit unbelievable sarcasm)..oh no plzz,im so scared,im literally shaken in my boots....wat a joke.HORRIBLE ACTING,Avoid dis movie"}, {"rating": "6", "text": "It's one of those. And a mediocre one at that. The genre wears thin. Maybe 2 or 3 surprises, but if that's all it has to offer beside Liam Neeson then it's not enough for me."}, {"rating": "9", "text": "This movie was amazing. Like most critics say, its a little slow at first, but once Neeson starts his hunt, it sky rockets."}, {"rating": "7", "text": "I have no idea why the (so-called) critics have panned this movie so much, it really isn't anywhere near as bad as they're making out. You've seen it all before in various other revenge movies, but it has enough new ideas to hold interest and enough of it's own style to keep things fresh. It's a slowish start but barely worth a mention as once the action starts it's non-stop, but this is possibly also the films weakest point. Everything just seems to happen with little regard for pacing, plot direction or character building. Every move Liam Neeson takes seems to work out and give him yet another lead, you never get the feeling that the film will have anything other Hollywood ending. Along with a few cheesy moments and a bit of bad acting the main body of the film feels rushed. That said though, it's a good watch, with the girlfriend or a group of friends everyone will enjoy this. Neeson gets you behind him and you find yourself egging him on to add to the growing tally of corpses left in his wake. More deep than say Transporter, not by much though but it feels less aimed at teens. Definite one to watch."}, {"rating": "5", "text": "A lot of action, but not much for excitement. Can't hold a candle to any of the \"Bourne\" movies, although it's shot in that style. Neeson is good, his character is invincible, and he tracks down the bad guys in unbelievable fashion. That is all to easy to be believed. A dismal movie, with plenty of action..."}], "recommendations": ["the_equalizer", "no_escape", "savages", "the_accountant", "3_days_to_kill", "cold_pursuit", "taken_3", "the_commuter", "peppermint", "the_mechanic", "taken_2", "limitless", "the_equalizer_2", "repo_men", "elysium", "ant_man_and_the_wasp_quantumania", "hanna", "infinite", "wild_card", "guns_akimbo", "four_brothers", "nobody", "the_ice_road", "the_marksman", "the_november_man"]}