{
  "id": 4759,
  "title": "Taking Lives",
  "starring": [
    "Angelina Jolie",
    "Ethan Hawke"
  ],
  "runtime": 103,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "Recruited to assist Montreal police in their desperate search for a serial killer who assumes the identities of his victims, FBI profiler Illeana Scott knows it's only a matter of time before the killer strikes again. Her most promising lead is a museum employee who might be the killer's only eyewitness.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zeFGOS1kj0CxuZjGhtK3WlMCYsa.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.7,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It's punctuated by a beautiful, passionate sex scene that's both wild and graceful. The thing is, it's supposed to be a thriller, and it lacks both plot and characters of any interest."
    },
    {
      "rating": "1",
      "text": "****Cinema Is Fuxked upJust **** Money Bazigaraye khoob mese ethan hawkero miaran vq kharabeshoon mikonan"
    },
    {
      "rating": "4",
      "text": "This movie started out being really intriguing. I loved the beginning as well as Angelina Jolie lying in the grave. But they never developed that character, and all of sudden the story just starts adding all these different plot elements, mushrooming out into a big patchwork with only the barest threads holding the thing together. Who the heck were all those cops anyway? Why was there a hidden room in the mother's house? Could have been great, wound up being pretty lame."
    },
    {
      "rating": "6",
      "text": "This movie was actually not bad. The out of place sex scene, the elevator, the hidden room, the cops who weren't really doing their job there were a lot of things wrong but it's worth seeing."
    },
    {
      "rating": "4",
      "text": "D.J. Caruso"
    },
    {
      "rating": "9",
      "text": "Definitely underrated. I thought the characters were amazing. The back and forth between Hawke and Jolie was very well done. I thought Jolie's character was well developed for this type of film. Her quirks and oddities are intriguing at the very least. She is not portrayed as a weak willed woman who can't defend herself. But on the other hand she isn't some unrealistic beauty who can handle everything herself in a really tight dress and finish the scene with a witty line. Bottom line: Jolie plays her character with flaws, oddities, and REALISM! It works! Sutherland's important, yet brief, role helped tie the two parts of the story very well. I thought the plot was well thought out.... It made sense, and was not corny. Not going to talk much about it because I do not want to spoil anything. And the filmwork was probably the best I've seen recently. The focus on the eyes was really interesting because it highlighted everything. It allowed the audience to get in the head of the characters, particularly Jolie. The angles were interesting and beautiful. It gave off the feal of a dark, brooding noir, yet having some extra character. The colors were brought out in interesting ways, particularly in driving sequences, like when Hawke is being escorted back to his apartment by Jolie. Overall an impressive film."
    },
    {
      "rating": "7",
      "text": "While not being particularly original, Taking Lives is still a fun thriller. Even though the twists were predictable and most of the characters were pretty clichés, it's still a fairly entertaining movie. The acting is good, the cinematography is gorgeous and some scenes were actually quite intense. It's not a great movie by any stretch, but it's not nearly as bad as what most people make it out to be."
    },
    {
      "rating": "7",
      "text": "Aside from a horrifically miscast Ethan Hawke, Taking Lives provides more than a modicum of thrills and twists held together by a convincing lead performance by Jolie."
    },
    {
      "rating": "5",
      "text": "This movie features quite a bit of violence and is a fair bit gruesome in parts, with decomposed bodies being shown and some scenes involving cameras panning through the crime scenes, showing eery dilapidated rooms that hide sinister secrets, so its quite creepy as well, think along the lines of movies such as Fallen with Denzel Washington, only without the supernatural element. The movie starts off with the killer as a teenager having ran away from home, hitching a lift with another boy his age who of course is unaware of his sinister intents at first, though he starts to open up about his personal life and its not long before the The story, to me, while intriguing was ultimately a bit disappointing, in that by the time everything is clear, I felt that it wasn't as original as I'd hoped. Having thought about it, I've seen similar movies with similar plots that didn't even get a theatrical/cinema release but as this movie stars some a and b list names (Angeline Jolie and Ethan Hawke for example) it was an exception. There are some good special effects and its pretty effective at, well, creeping you out in parts but something about it put me off - perhaps its that I'm becoming less keen on Jolie the more I see her in movies, there's just something so fake (um her face? ahem I didn't say that :)) about her, her characters tend to be very arrogant its almost as if her as an actress just breezes through her roles, which I really don't like... plus during the scenes that built up towards the last plot twist, by the time it all becomes clear, your left thinking is that it? at least I was anyway. I found it a little hard to believe that this serial killer who had been 'on the prowl' committing many prolific murders over many years, would be conned by what happened - I shant say any more to give the plot away but suffice to say that by the time the movie ended, I wasn't convinced it was a particularly good movie, from the plot point of view. There was one character which I felt was more memorable, that being Mrs. Asher, the mother who contacts the Canadian authorities adamant that she'd just made eye contact with her previously-thought-to-be-dead-son - her explanation of what happened, why she was sure it was him, was a bit chilling. It was a bit sad to see how she was treated at one point by the authorities, even if she was wrong about her hunch...One thing that was a bit of a let down I suppose was the fact that I thought Kiefer Sutherland was one of the main characters, given that his name is one of the three or four listed on the DVD cover but he only has probably under five minutes worth of time on screen, which was a shame as I've enjoyed some of the movies he's appeared in, which is why I thought this may be worth a watch.I felt that this movie is ok in terms of there being some decent car chases and action scenes and it is rather chilling in parts but personally, it didn't reall 'grab me' like I'd hoped it might. Perhaps I'm a bit biased as I've learnt im really not much keen on Mrs./Ms(?) Jolie but I think ultimately the story was perhaps a bit under par and thats what really let it down - don't get me wrong, its watchable, its just not a movie I feel I'm going to want to watch again, its not likely to stay in my mind for long.Personally, I thought this was an 'ok' movie that relied on the visuals and the cast to 'make it', with a story that started out with a fair bit of potential but ultimately, I felt that it was a bit of a let down. There must be countless movies about the authorities/specialists chasing after serial killers, this one I don't feel is one of the best, personally."
    }
  ]
}