{"id": 3584, "title": "Tall Girl", "starring": ["Ava Michelle", "Sabrina Carpenter"], "runtime": 101, "genre": ["Comedy", "Drama", "Romance"], "description": "Jodi, the tallest girl in her high school, has always felt uncomfortable in her own skin. But after years of slouching, being made fun of, and avoiding attention at all costs, Jodi finally decides to find the confidence to stand tall.", "releaseYear": "2019", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/m0clsFEXidLVJ0TueqWOvvImOMh.jpg", "categories": {"plot": 2.4, "acting": 2.4, "ending": 2.0, "soundtrack": 5.0, "cinematography": 1.0, "familyFriendly": 6.0, "funny": 1.6666666666666667, "action": 5.0}, "reviews": [{"rating": "2", "text": "This Netflix Original is like any typical, basic teen romcom, but extremely cringeworthy, unrealistic, and not relatable whatsoever. Nzingha Stewart was unsuccessful with making a decent teen romcom. It was obvious that the director wanted to make her movie, an original teen romcom. But all Stewart did was switch out the \"loner\" girl who gets made fun of because of her lower financial status or how she physically looks like or wears for an extremely tall girl from a rich community. In general, It was extra boy-centric(which was irritating) and may perceive to or encourage young audiences like me, that we should be obsessed with high school relationships, than what really matters in this world. Very disappointing."}, {"rating": "2", "text": "In spite of the good acceptance message that by the way, has also been seen in many other films of this same type and genre, the predictability, the cliches and the stereotypes kills this film from the get go.I didn't see the trailer before watching it but I decided to see it after finishing it because I wanted to know how they were promoting it. And frankly the trailer tells you the whole thing, it tells you where it will go and how it will end.So I recommend that you better watch the trailer and not watch this film, but if you dare to watch it, you will realize after the first 10 minutes of what the hell is going to happen throughout the whole story.Total failure but what else can I say? It's Netflix's standard after all."}, {"rating": "0", "text": "The Cosmonaut Variety Hour introduced me to this movie. It is an utter mess, but an entertaining mess."}, {"rating": "1", "text": "Is this \"The Room\" of Netflix? No, but it's pretty darn close. I'll start with the positives, as there are far less of them: the cinematography is halfway decent. That's about it. The negatives are numerous and enjoyable. The script is atrocious. It treats the eponymous \"Tall Girl\" as if she is some ugly, hideous creature that no one could ever love, but in reality she is just tall and rich! She's not ugly at all. It tries way too hard to build this cliche Beauty and the Beast narrative, and it fluctuates on whether or not the short love interest is a lady slayer or a creep. The Swedish character is played by a really bad actor, who definitely has some Tommy Wiseau vibes. The sister character is like an anime villain. No joke. The popular girl clearly has deep set insecurities, but the writing does not match up with the performance! There are some real gems of dialogue in here too. My favorite was \"I'm gonna put my big feet on your tiny nards.\" Also, the word \"tall\" is said probably about once every minute. Who wrote this????????It's really hilarious to watch. I can recommend this as a bad movie to watch with friends, and that's about it."}, {"rating": "0", "text": "Just not very good at all this is just my opinion but everything seemed really cliched 6 foot is not very tall even for a woman"}, {"rating": "1", "text": "Otra pelciula cliche, que da un mensaje body possitive de una mala forma, vamos netflix, no es dificil hacer algo bueno."}, {"rating": "0", "text": "Just cringy, unrealistic and horrible. I don't even know how netflix decided to put this on the plarform."}, {"rating": "10", "text": "An excellent teen romcom. Does not pull any punches and is light on the schmaltz while still being very heartfelt and sweet. As a tall girl myself, this is VERY accurate to the experience and the kind of representation I've been waiting to see in cinema my whole life."}, {"rating": "10", "text": "This criminally underrated teen romance deserves better than this criticism. With an awesome message, lighthearted aesthetic, and a sweet love story that contains characters who are not perfect or totally bad, but have both highlights and flaws that are revealed."}, {"rating": "0", "text": "another painful woke netflix film. this movie does not have a target demographic, its just bad."}, {"rating": "1", "text": "Cosmonaut & Netflix recommended me this during quarantine. Oh my gosh, I sat through 102 minutes of torture."}, {"rating": "0", "text": "Don't waste your time on this piece of sh... It's just really, really, really bad"}, {"rating": "0", "text": "is a horrible film, i mean instead of doing drama for being tall, she can tyr other things, like basketball, or model, but NOO, she wants the love of a stranger that problably in 5 years,will never remember her, and its pure ****"}, {"rating": "0", "text": "Completely ridiculous movie not true at all!!6 ft is not that tall, there's no way everyone is that short… And the story itself is just boring, don't waste your time :) -Sigal-"}, {"rating": "2", "text": "The notoriety this movie has amassed was one of comedic ignorance to actual problems. The infamous line in the trailer of “I'm a girl wearing size 13 shoes, in high school what can be worse than that” gives the impression this movie is going to be one giant circle jerk of #tallpeopleproblems. However at the end of the day Tall Girl is just a bad coming of age story, and that's all you need to know about it. The movie is much better than that infamous line makes it out to be, being tall is a vessel where themes of self worth, self doubt and self image are explored. It's not just about #tallpeopleproblems it's about a girl struggling to find self worth in high school. (Self worth being defined through a relationship however that's a different discussion for a different review.) The movie knows there are larger problems than being tall, even over correcting early on in the movie with the mother explaining her high school experience. No, the real reason why this movie falls so short, is the writing is atrociously amateurish. Judi is a textbook definition of a Mary Sue. Every single male character falls in love with her, every single female character either is friends with her, or supports her because she’s just so attractive her friend must date her! Her inner struggle of her height doesn’t prevent her from doing anything, she instantly gets the super hot guy. I would list more things she wants but that’s the only driving motivation for the main character. What's funny is that it feels like fanfiction but not written by a girl, written by a guy who was scorned by a tall high school crush. His lover is a perfect tall girl who’s only struggle is not realising how pretty she truly is. Then all of a sudden a super popular, foriegn exchange student arrives in town and all the girls love him, including her! But double twist turns out he’s a jerk and she realises that the perfect man was here all along right beside her. What truly sells this theory to me is the fact that he gets a girlfriend halfway through and then dumps her for the chance to get with Judi. If almost to say “I was still totally drowning in women obviously, but the one I wanted hadn’t realised that she loved me yet”. The only compliment I can give this movie is the character of Stig Mohlin, played by Luke Eisner. The character arc given to this loveable sweedish man is the best part of the movie bar none. His self journey of realising he can’t have his cake and eat it too, he can’t be both the most popular man in school, Ivan, and Judi’s girlfriend is well done. It never steps too far, it feels natural for a high school setting and it fits his character of a dork from sweden. The movie should have honestly been about him, he was the most interesting character.If there's one thing to take away from this review it's don’t watch Tall Girl. It's not notably terrible, and not infamously ignorant like the trailers make it seem, it's just a bad coming of age drama. If you want to watch a good coming of age drama that your girlfriend will enjoy I would recommend The Princess Diaries. Tall Girl should be forgotten and left to rot on netflix’s digital shelves."}, {"rating": "0", "text": "Tall Girl is a horrible movie. It is about a girl that is tall and her struggles with being tall, and how she gets over her problem with being tall. This movie is your basic teen rom-com, but with extremely unrealistic situations. Girls can be that tall and not be bullied. The movie is about Jodi, a 6’1 girl who is in high school. She is obsessed with finding a boy who is her height to be her boyfriend. She is very vain and shallow, thinking her life is a mess, when in reality, she could easily stand up to her bullies. She has a short friend, who is more fierce than her, and even with her standing up to her bullies, Jodi is depressed, just because she is tall. It is a very un-relatable plot. This movie takes place in New Orleans, but it is irrelevant to the plot. The plot is modern, because there is social media featured in the movie, and we all know how much social media has become a part of this century so far. The pacing is a regular speed. It’s not too fast and not too slow, which might be the only positive part about this movie.The thematic message is about self-acceptance, but the movie is so horrid that you get distracted with all the bad things about the movie that you don’t even notice the message.I have no recommendations for this movie, except for it to get better."}], "recommendations": ["mean_girls", "sex_and_the_city_2", "bad_moms", "you_again", "sky_high", "good_on_paper", "something_borrowed", "knock_at_the_cabin", "legally_blonde", "booksmart", "if_i_stay", "moxie", "monte_carlo", "magic_mikes_last_dance", "rim_of_the_world", "the_perfect_date", "the_shape_of_water", "bride_wars", "the_next_365_days", "paper_towns", "boyhood", "young_adult", "ghosts_of_girlfriends_past", "fifty_shades_of_grey", "superbad"]}