{"id": 2831, "title": "Tammy", "starring": ["Melissa McCarthy", "Susan Sarandon"], "runtime": 97, "genre": ["Comedy"], "description": "For Tammy, a burger-joint employee, a bad day keeps getting worse. She wrecks her car, loses her job and finds that her husband has been unfaithful. It's time for Tammy to hit the road, but without money or transportation, her options are limited. Her only choice is a road trip with her hard-drinking grandmother, Pearl, who has a car, cash and an itch to see Niagara Falls. It's not the escape Tammy had in mind, but it may be what she needs.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/efsVMziwE9BNTDX5fNmYVA5oAzJ.jpg", "categories": {"plot": 6.0, "acting": 5.166666666666667, "ending": 4.6, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.203703703703703, "action": 6.5}, "reviews": [{"rating": "6", "text": "While Melissa McCarthy manages to deliver some funny one-liners here and there, the film feels like it's neither trying too hard, nor trying really at all. It feels like too simple of a film, but in some ways that's actually a good thing. It doesn't take any risks, but it also manages to be light-humored at the same time. And the supporting name cast that includes Susan Surandon, Sandra Oh, Kathy Bates, etc, manages to make it worthwhile as well. So overall, while \"Tammy\" isn't hilarious, it's still a simple, lightly funny film that isn't too raunchy and zany like many of today's R-rated comedies."}, {"rating": "2", "text": "This movie is so awful ,That's three McCarthy movies in a row that were horrible. I'm now putting her in the same ate gory as Adam Sandler, Will Farrell, and Tyler Perry. Never again."}, {"rating": "7", "text": "Melissa McCarthy is both well-known and great at playing crude, loud, and yet somehow likable characters. Seeing as how this movie was co-written by McCarthy and her husband, who also directed, this is a movie that was built from the ground up to play off of that character type and I was sure it was going to be hilarious. While it is funny it is also unfortunately bogged down by some lackluster and overly-familiar dramatic elements. It's very been there done that, and often that will apply to some of the movies jokes as well. There are some times when the jokes just fall flat, but thankfully the overall movie does pack plenty of laugh-worthy moments even if it does play things safe at times by not straying too far from what is expected of R-rated comedies nowadays. It's a good comedy, and while it's emotional moments fail to deliver, Melissa McCarthy is still funny enough to make it worth a watch. So if you've enjoyed McCarthy in the past I think it's safe to say that you'll enjoy the film. Just don't expect anything to impressive and you'll find your laughs."}, {"rating": "8", "text": "This movie was funny, not as laugh out loud funny as The Heat, but still had it's moments. I liked Melissa McCarthy (as usual) and Susan Sarandon in this flick. It had a few parts where I didn't expect to feel anything, but there's actually a pretty sad moment towards the end, but of course, that ends with hilarity. I love McCarthy's acting and I hope she continues to entertain for years to come! The only issue with the movie is I didn't really remember any of the other characters besides McCarthy's, Sarandon's, and the lesbian woman's character. Sorry, idk her name. The plot is kind of sloppy as well, but I left the theater satisfied regardless."}, {"rating": "0", "text": "I'm gonna keep this really simple and to directly to the point since there really isn't much more to say: DO NOT UNDER ANY CIRCUMSTANCES WATCH THIS F***ING MOVIE. EVER. END OF REVIEW."}, {"rating": "0", "text": "It honestly so **** bad. So. ****. bad. My friend and I were the only ones in the theater. I didn't laugh once. It was stupid, boring piece of **** and I'm angry I saw it. Please do not waste your time. Please."}, {"rating": "2", "text": "It doesn't show that Tammy is really the funniest Melisa McCarthy movie I saw since Identiy Theft. It needs more funny improvement for McCarthy for herself."}, {"rating": "3", "text": "Melissa McCarthy doesn't stray from the formula that's worked for her in this film, which she co-write with her husband (he also directed). She plays a boisterous, obnoxious loser who rants at everybody and everything. This can be funny in controlled doses, but McCarthy doesn't understand that. It's non-stop, no holds barred, bull in a china shop broad strokes in every scene. As for plot, she sets out on a road trip with her alcoholic grandmother (Susan Sarandon), but the momentum starts to drag with they insert too many heartfelt moments in an attempt to conjure empathy for her insufferable character. If you're a fan of her style, you'll have your fill…at least for the first hour."}, {"rating": "1", "text": "Leaving the theater after watching this paycheck made me think I realized what dog poop tastes like. Going in a expecting \"Heat\" just made it even the more disappointing. I used to fantasize about Susan Surandon in Rocky Horror and seeing her like this just made my cry out loud. The guy on the front row said \"They are not going to go on a road trip are they?\" so it looked like even he was disappointed too. The people behind me enjoyed that last half hour of the movie more than me because after I stopped crying out loud I fell asleep."}, {"rating": "1", "text": "This is one of the worst films of the summer. Melissa McCarthy needs better scripts than this. I felt like I was watching Adam Sandler, Grown Ups and Susan Sarandon's wig was terrible here. A lot of the celebs that appear in the film probably did it as a favor or got paid a lot of money."}, {"rating": "6", "text": "Say what you will, but Melissa McCARTHY is undeniably a forced to be reckoned with. Her typical slapstick comedy and over the top raunchy humor simply resonates with audiences, and in the meantime they flock to see everything she does. First off, I loved \"Bridesmaids\" (I mean who doesn't?). I throughly found tons of enjoyment, and laughs in \"The Heat\", and I hated \"Identity Thief\". Her latest, \"Tammy\" lands smack dab right in the middle. It's not as good as \"Bridesmaids\" and \"The Heat\", however it's far lightyears ahead of \"Identity Thief\".\rThe story comes from director, writer, and husband to McCARTHY Ben Falcone who got the film made on her box office appeal alone. Tammy ... is struggling, going about day to day life. This morning she hit a deer thus totaling her car. She also lost her job at Topperjacks to her egotistical manager (played by Falcone). And to top it off she comes home to find her husband (Nat Faxon) is cheating on her with the next door neighbor (Toni Collette). In a last ditch effort to reclaim her \"independence\". Tammy decides to go on a cross country road trip (of sorts) with her alcoholic and drug induced Grandmother (played very well by Susan Sarandon).\r Where \"Tammy\" severely lacks, it makes up for in McCARTHY's performance. The script is not as tight and condensed as it needs to be. Running at a very modest, and crisp 90-minute run time (something we ALL can be thankful for). The film saves itself from running to long to drag the morale of the audience down with it. Not to mention the cast itself is top notch (another added strength). Featuring a last second addition of Dan Aykroyd, to Mark Duplass and Gary Cole, the list goes on.\r Even if the script is loose and a retread, if anyone could have pulled this film off.. it was indeed McCARTHY. Weather your a fan or not, you can find something in \"Tammy\" that will at least make you chuckle. Though it's not consistent enough to be a full fledge comedy blockbuster, and when it falls flat (which it does a-lot) McCARTHY is right there to pick the film back up again. Best Joke? McCARTHY tells a skippy young teen to go eat some bath salts and then eat his girlfriends face off.\r B-\r By: Nate Adams for I-Tunes and The Movie Buff blog.\r Directed By: Ben Falcone\r Rated: R\rRun-Time: 96 mins\rStudio: Warner Bros.\rRelease Date: July 2nd\r Thanks For Stopping By ®"}, {"rating": "0", "text": "melissa apparently sold her soul to make this sophomoric pun-riddled mess.  how in the world did susan sarandon let herself get dragged down to the bottom of the abyss?"}, {"rating": "1", "text": "Its a \"Rental\". Susan, Kathy and Melissa are such good actresses, all (few) good joke were in trailer. More drama than comedy. Tammy, the character, is similar to Diana in Identity Thief. Definitely not recommended."}, {"rating": "1", "text": "Tammy is an object lesson in the art of directing, which is all it would have taken to turn this near-miss into an instant classic. Though that may be true of most mediocre movies."}, {"rating": "4", "text": "Melissa McCarthy stars in her first lead role and is a comedy mess for starters.\r It's about a woman named Tammy (Melissa McCarthy) who ends up losing her job at a fast food joint. She discovers her husband is cheating on her with the next door neighbour so she packs her clothes and walks two houses down to her mothers house. Soon after, she decides to move away but doesn't have her car or money. Her alcoholic Grandmother, Pearl (Susan Sarandon), does and tags along for the ride to Niagara Falls with a lot of booze. After falling off track and a series of misadventures that land her in hot water, she begins to re-think her life all the while dealing with her out of control grandmother who is more trouble to handle sober then she is drunk.\r Melissa became well know for her role in Bridesmaids and she made us howl laughing with Identity Thief. Her new movie Tammy is an unpleasant comedy that has no story, no evolution to it and jumps from one thing to another and continues throughout the whole film.\r Aside from the fact that it does seriously make you laugh throughout the movie, because of Tammy, the jokes are all one liners and they mostly come from her while Susan Sarandon is unfunny as her booze guzzling grandmother. The whole character is played out on laughs because she has booze hidden everywhere and it runs dry very fast. The story drags on from one thing to another while it slows to explain events of the character's life and why they don't like each other then continues on with the same thing.\r The one thing about the film that drags is that Tammy is made out to look like a slobbish piggy loser. It also attacks her weight in seriously insulting scenes that make you feel bad for the character because she wants to be human like everyone else. While everything goes wrong for her, they make her feel even worse about herself by calling her a \"Cheeseburger\" and \"Fat slob\" and it is not funny at all to watch. Melissa McCarthy is a beautiful woman and to have scenes of this nature in the film, because she is a bigger woman, is a poor excuse for jokes and ends up making you shake your head in disbelief and disgust.\r It seems like this was her dream project because she wrote it with her husband Ben Falcone, who makes his debut as well, but the acting to it is shaky and alone Melissa pulls off the acting to the movie. Kathy Bates just hangs in the shadows in some scenes and offers advice to Tammy about her life and then she even falls short soon after along with Susan who is a drunk mess.\r It's sad to see actors/actresses who are very well known, fall short in their roles and look like it is their first time on screen from either little screen time or due to bad writing that makes them look foolish. Granted, it does have laughs and will make you howl but if you look at the overall of the film, it's a wild mess that makes you wonder what happened and Melissa is the only good thing to watch for the film. She proves she can do comedy alone and make you laugh with her crude and foul mouth.\r Tammy is a mess and not what was expected. It's good for a few laughs but other pictures are a lot better and funnier."}, {"rating": "10", "text": "I can never get tired of watching this movie. I love Melissa McCarthy and I have seen all her movies but this one keeps me laughing from start to finish"}, {"rating": "5", "text": "Melissa McCarthy is a funny woman, but her performance is so undersold and unfunny here. I don't want to flat out say that the movie was outright horrible, but for something meant to be a comedy movie, it doesn't deliver. The movie has it's funny lines sprinkled in, but the rest of the movie is just unfunny filler material. Overall, the movie comes off as cheesy."}, {"rating": "5", "text": "Melissa McCarthy continues her streak of notably hilarious roles in film and television as the titular Tammy. Tammy is your average, flat-storied comedy; which, unfortunately, doesn't always hit the jokes."}, {"rating": "1", "text": "Wow Tammy is bad. It's so bad that the laziness of the actors and script become apparent immediately and then you have to sit through another hour and half wondering why I didn't just end then movie then."}, {"rating": "6", "text": "There was nothing that wowed me in Tammy, but I still think it was entertaining enough to watch. There were definitely some funny moments and serious ones that added some depth."}, {"rating": "6", "text": "I found TAMMY was so funny, but everyone isn't like me.\r I did not get what all the whining about this movie. This film was nominated for the worst actress and supporting actress at Razzie Awards, but I found they were awesome. You can't blame performers for the bad story, in fact the screenplay was okay, but again the story did not influence to build a better screenplay. Hard to predict the scenes, though one would know where the story is heading and that's the difference in this movie. Keep in mind when you're going try it, that you're not watching a Bond movie or a Peter Jackson's, but a small budget comedy. Anticipate as much what the movie weighs, overall and you would never regret for watching it.\r As usual a perfect role for Melissa McCarthy, but Susan Sarandon was surprisingly good. It was just a fun road-movie, mostly a semi-fictional to the reality, but who knows there might be people out like these film characters. Like I said, a decent story, it had all the ingredient to be a good comedy flick except one serious scene at the end needed to turn over. Yep, I would have liked to have an unexpected twist, that could have been a game changer in the movie's success. Anyone can enjoy it, if he's/she's open minded. I am already expecting the next movie from the same cast and crew combo which is due early next years.\r P.S, there's something between Melissa McCarthy and prison. In the next film I mentioned as well she will be seen in the prison.\r 6/10"}, {"rating": "4", "text": "A movie that tries to make you like some very unlikeable characters.  Tammy has some funny moments but they are very few and far between.  McCarthy can be much funnier and I don't want to see her fall into the Sandler trap.  C-"}, {"rating": "6", "text": "Tammy ultimately succumbs to the modern trend of high attitude and low substance. While the tone is jovial, it ultimately amounts to nothing. I felt no different walking out of the theater than walking in. Melissa McCarthy is one of my favorite comedic personalities today, and she was definitely the highlight of the movie. I only wish they had expanded on her character and the characters of the other actors and given them a more substantial plot.  Worth a watch, but nothing too special"}, {"rating": "0", "text": "This is stupid, horrible, useless, gruesomely nauseous and dumb comedy film-making. Never see this. A reviewer from my hometown said: \"I rather see this, than Transformers: Age of Extinction\". Though it's still bad, I would've just seen Transformers instead. This was an uneasy experience to go through."}, {"rating": "5", "text": "By the book Melissa McCarthy vehicle, thank god it looks like she is breaking out of disgusting mode, BUT I must say TAMMY made me laugh out loud. It just hit the right chord at the right time. Susan Sarandon who seems totally miscast is actually perfect and quite hysterical. I was totally tickled."}, {"rating": "3", "text": "Tedious and completely unfunny, not only is Tammy a complete waste of time for the audience, but a waste of time and talent for the actors included in it."}, {"rating": "5", "text": "This film is not awful or it's so awful rip your eyes type of film, it's a disappointment and just not funny as it wants to be. What shocking is it is co-written by Melissa McCarthy who was in two funny comedies \"Bridesmaid\" and \"The Heat,\" clearly she has comic smarts and talented, but her and her husband Ben Falcone wrote the script telling us that even funny people sometimes can't be funny. It's not funny, but it's heartwarming at times that's only credit I'm going to give this film. Melissa McCarthy is Tammy (the film's title) she is down on her luck, she is fired from her job from a burger-joint, her husband cheated on her, so she leaves and goes on a trip with her alcoholic grandmother (Susan Sarandon). Falcone is some good films such as \"Bridesmaids\" or \"Enough Said\" but as a director is it just lazy. 2/4 stars"}, {"rating": "6", "text": "Tammy, si bien no resulta una comedia inteligente, si logra sacar risas y algunos gags bastante efectivos.\r Esta película, que no parte de una historia muy original que se diga, al fin y al cabo se clasifica como un film disfrutable que no cae en la corriente de volverse tonto y absurdo. Se puede decir que quizá no resulta con un tono atractivo, pero de alguna forma se las ingenia para resultar ser un largometraje que logra entretener y que se va en un tono un tanto alocado, tanto en el buen sentido como del malo."}, {"rating": "5", "text": "Melissa McCarthy has been type cast again, Tammy is trying to be a heart wrenching drama in disguise about a relationship between a grandma and her granddaughter, a man and his wife, the fireworks and 4th of July! But it is also a road trip comedy that is trying to be a tamed Hangover movie, also trying to create the most card board cutout love interest of the year, and at this point it succeeds. Despite all the fun you can have and all the few laughs you can giggle at, you cannot deny that Tammy is as confused as its audience, and that you have seen better."}, {"rating": "3", "text": "Tammy really was lame. The trailer looked really funny when I first watched it but it was really overplayed before the release and the bits from the trailer were the only parts I found funny. The script is so poor and unfunny and all these talented actresses are unfunny. The movie is kind of all over the place and there is no real conflict its just a big crew of women running around acting like idiots and really I'd be okay with that if the women were funny. One of the worst movies of 2014 no doubt. Melissa McCarthy is going to have to go back to the drawing board."}, {"rating": "5", "text": "McCarthy is her usual bonkers self, but this flick is uneven and slow.  Funny in spots but pretty darn predictable.  Wasted talent of a decent cast..."}, {"rating": "7", "text": "This movie had it's moment's of laughter, but i wouldn't really call it a comedy. It's more of a energetic drama about two family member's trying to bond on a road trip. Even though it's not as good as i thought the movie shouldn't be rated lower than a 5. The movie may have not been that funny but the story and drama to it really made it a good heart warming little bit funny kind of movie."}, {"rating": "4", "text": "\"Tammy\" 10 Scale Rating: 4.0 (Bad) ...\r The Good: There were a couple of chuckle-worthy moments. Susan Sarandon was entertaining as Tammy's diabetic grandmother who is trying to make the most of what's left of her life. In fact, most of the solid comedic moments came from her. There are a few cameos that were a pleasant surprise.\r The Bad: As usual, McCarthy is the same person she is in every film which typically has mixed results. Even still, the film just isn't very good or consistently funny as the overwhelming majority of the gags fall flat. Mark Duplass, who is usually pretty good, was stiff and turned in a mediocre performance."}, {"rating": "3", "text": "Ughhh.... What a bad comedy. The only saving grace of this movie is Melissa McCarthy having some funny lines, but other than that it is messy and has tons of unforgettable characters. I would try to avoid this one if I were you. 3/10 (poor)"}, {"rating": "0", "text": "What a Mess and What a Shame!!  This is the first movie I ever gave a 0, and it was mainly because I didn't see any use in making this movie and could see no value-laughter or meaning!  It's too bad as I have loved Melissa Mccarthy in everything else I have seen her in especially \"The Heat\" and \"Identity Theft\", along with her TV series Mike and Molly.  Doing movies like this will only hurt her career as most like myself will be hesitant to go see her in anything else if she strings several like this.  Such a great cast is totally wasted, why they would do a movie like this is beyond me!  I only chuckled once when she told the cops she had a bee in her hair and was running.  I had heard the reviews and all the trashing, but finally decided to watch \"Tammy\" and was sorry that I didn't listen to my premonition's!  If your smart you won't waste your time, it's simply not worth viewing and can be painful at times!"}, {"rating": "8", "text": "Something in Tammy you wouldn't expect to see in a mainstream comedy [is] the romantic pairing of McCarthy with indie heartthrob Mark Duplass, reversing the formula of the male slob who gets the conventionally beautiful girl.\r Watch it here http://www.watchfree.to/watch-29ea17-Tammy-movie-online-free-putlocker.html"}, {"rating": "9", "text": "I found the movie to be extremely entertaining and down-right hilarious! I was laughing so hard that I cried in numerous parts throughout the film. The story line was rather scattered but I thought it had to be considering the crazy dynamic of the character. I commend McCarthy for her humor and compliment her spontaneity when it comes to improvisation and unexpected punch lines. This is not the first time that we see McCarthy in this discombobulated, vulgar, and rather ruthless character. So it would be nice to see her in something different, but for this movie, I thought she nailed it!\rIf you haven’t spent time laughing the night away with Tammy yet, I would definitely recommend you do so, you wont regret you did."}, {"rating": "3", "text": "Tammy: a movie title where you cannot resist smiling while reading. Well, it turns out to be another Melissa McCarthy movie being herself. Ultimately, Tammy is all about a sloppy road-trip dramedy where McCarthy and Susan Sarandon meets a bunch of people, and along their way, they do stupid things: from fake-armed robbery, to getting drunk then burning a jet ski and meeting Anne Wilkes of Misery and Ray Stantz of Ghostbusters.But writers and couple, Ben Falcone and McCarthy never understands the significance of characterizations in scriptwriting for crafting the personality and eventual goals of our titular character. That being said, their first collaboration is still not a nice try given the involved star-studded talents. It takes amazing talents such as Kathy Bates, Dan Aykroyd, Allison Janney and Sandra Oh as underused and useless supporting actors to the story.There are few chuckle-able and giggable moments in the movie, but it never saves Tammy in its poorly written script and terrible direction.VERDICT: McCarthy and Falcone's collaboration is a wasted comedy movie, missing in comedy."}, {"rating": "3", "text": "Usually I prefer my comedies to be funny, but maybe thats just me. Rating - 33%"}, {"rating": "5", "text": "La trama no es muy buena y no hay tantos momentos divertidos, aún así, es buena para pasar un rato."}, {"rating": "10", "text": "In my opinión it's one of the best movie that I've ever seen, because i love the actress and in all the movie she make me laugh, in the trama they let we know how is the life of Tammy but in a funky form and the things that she did for example when she stole"}], "recommendations": ["dirty_grandpa", "trainwreck", "identity_thief", "wanderlust", "forgetting_sarah_marshall", "like_a_boss", "little_fockers", "the_wedding_ringer", "thunder_force", "couples_retreat", "the_proposal", "30_minutes_or_less", "hall_pass", "the_break_up", "neighbors", "dinner_for_schmucks", "good_luck_chuck", "the_dilemma", "just_go_with_it", "this_is_the_end", "the_wrong_missy", "tower_heist", "rough_night", "a_bad_moms_christmas", "paul_blart_mall_cop"]}