{"id": 650, "title": "Tangled", "starring": ["Mandy Moore", "Zachary Levi"], "runtime": 100, "genre": ["Animation", "Family"], "description": "When the kingdom's most wanted-and most charming-bandit Flynn Rider hides out in a mysterious tower, he's taken hostage by Rapunzel, a beautiful and feisty tower-bound teen with 70 feet of magical, golden hair. Flynn's curious captor, who's looking for her ticket out of the tower where she's been locked away for years, strikes a deal with the handsome thief and the unlikely duo sets off on an action-packed escapade, complete with a super-cop horse, an over-protective chameleon and a gruff gang of pub thugs.", "releaseYear": "2010", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/ym7Kst6a4uodryxqbGOxmewF235.jpg", "categories": {"plot": 9.064516129032258, "acting": 8.9375, "ending": 9.5, "soundtrack": 9.571428571428571, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 9.166666666666666, "action": 9.5}, "reviews": [{"rating": "10", "text": "I went into \"Tangled\" skeptical and unsure of what to expect; I left extremely pleased and impressed with Disney's efforts. As an animator myself, I was blown away by the quality of the animation and the detail that obviously went into each and every one of the models. The animation in this movie is top-notch, and deserves any praise that it gets in terms of technical execution. The script itself contains a fairly typical Disney love story that I must admit - I rolled my eyes at, especially upon realizing that it was a musical. However, the comedy  truly won me over - I was cracking up consistently throughout the entire film. The audio engineering behind the movie and its soundtrack was also great; The voice acting is nearly perfect, the audio is crisp and clear, and though some of the songs were forgettable, none of them were a chore to watch. Essentially, I have no complaints about this film - and I am very critical of animated films, especially coming out of Disney. This may very well be a top contender right alongside Toy Story for animated film of the year. 10/10, would love to see again."}, {"rating": "10", "text": "I loved the film; its story, animation, music, and humor were all superb. Maybe worthy of the Disney 'Renaissance era' and proves Disney still has it in them when it comes to producing an excellent all around animated film for all ages. It holds up too as it's still great after multiple viewings over the past year.\r Highly recommend it."}, {"rating": "9", "text": "Ol' school Disney is back ! :) You get the princess, funny animals, songs, bad guys and of course the happy end. On top of that, a gorgeous presentation. Some moments are genuinely magical, if you're in the mood. I'd recommend this movie for kids, families, but also for adults, if you like that Disney magic."}, {"rating": "9", "text": "Tangled is charming, hilarious, well animated and just fun. It doesn't have very memorable music but a few songs will get stuck in your head, and Mandy Moore gives a fantastic voice performance and the whole film just ends up being a whole lot more deep than most would think or even expect. I give this film 92%."}, {"rating": "10", "text": "The biggest suprise of 2010, did not expect it to feel like a classic and/but feature some of the best animation in recent years. Funny, charming and actual good songs (unlike princess and the frog). Up there with Toy Story 3 and How to Train Your Dragon. This film was a moderate hit in the U.S. (it did amazing internationally) but I expect it to do much better in the future"}, {"rating": "10", "text": "This movie is amazing. Action, comedy, romance, good characters, and who can forget, a horse eating an apple. At first, I thought this movie was going to be crap, but when I saw it, it was a beautifully made masterpiece I will never forget."}, {"rating": "10", "text": "I loved this movie, I always have a good feelling when disney release a new princess. I lo ve the way is focus the \"Rapunzel\" story, I liked this \"new perspective\" about the princess wants to go oue and took the iniciative, not wating for prince who rescue her. I love the concept. Excellent movie for me."}, {"rating": "10", "text": "Revive la emoción de los clásicos pero con un toque moderno de comedia romántica. Distrae desde el primer momento. El camaleón y el caballo son personajes muy divertidos. Tanto Rapunzel como Flynn enamoran al espectador. Buenas canciones."}, {"rating": "10", "text": "Even though I freaking love disney animated movies, I had low expectations for this because by looking at the trailer, I thought they'd fill the movie with lame pop culture references and jokes. Boy, was I wrong! This movie pays perfect tribute to all the great Disney movies from the 30s, 40s, 5s, and 60s by using great modern touches."}, {"rating": "8", "text": "The movie certainly does have some good things in it, and I really do recommend watching it, but I can't help but feel that some things are missing. First of all, for a Disney villain, Gothel isn't a very memorable villain (she felt more like an annoying old woman). Also, none of the songs were even memorable like other animated Disney movie (maybe kids who watched this movie today may argue with me years from now about this point). Despite my few complaints, the movie is indeed solid, with a good plot and character development, just don't expect something as magical as Disney's 2D animated classics."}, {"rating": "9", "text": "\"Tangled is Disney's 50th animated picture is Sweet , Clever and Charming as it is astounding and never misses a beat from its visuals to its heart and humor. I enjoyed the film from start to finish and i'm sure this is a movie everyone will love\" .. A-"}, {"rating": "10", "text": "I loved this movie. I had high hopes and they were definitely meant. This is a classic Disney fairytale and one that has been sorely missed in the annual collection of films that the big studios have been pumping out. I've loved the recent Disney Pixar films and even a few of the Dreamworks movies but there's been a big gaping hole where a family oriented, moral driven, and fun film that has quality songs used to be every year. Keep up the good work Disney! The theater I was in was packed with kids and they were all laughing up a storm.P.S. originally the first trailer I saw with the Pink's \"Trouble\" really turned me off from seeing this film. If there's someone else who feels that way, don't let that trailer deter you from seeing \"Tangled\""}, {"rating": "10", "text": "Amazing animation. The movie was very cute & funny, & left me impressed, due to my expectations that it was not going to be a mind-blowing movie. The best parts of the movie were not even in the ads. The horse was hilarious, the soundtrack was intense & well-fitting, the storyline & plot was never dull & always never unexpected nor predictable. Amazing movie that exceeds expectations. Please see this movie, & people of all ages should like it!"}, {"rating": "9", "text": "Though a touch slow at first, once this movie really begins it shines. Beautifully animated, with a very wonderful \"Into the Woods\" vibe, this film was a little bit of everything wonderful, making it easily rewatchable. It's fun and full of energy."}, {"rating": "10", "text": "Before I saw Tangled, Toy Story 3 was for me the best animated film of 2010. But after I watched it, I was blown away how much this film is fantastic. Mandy Moore has a extremely beautiful voice, as well as Zachary Levi, and that can be seen from the plane. There is not need for nothing more to be said, an amazing film."}, {"rating": "10", "text": "Amazing, amazing, amazing!  Funny, adorable, engaging.  And I'm 44. I have and would recommend this to anyone. Totally worth a full price ticket any day."}, {"rating": "10", "text": "I was bored on a weekend so i thought i'd go see tangled, at that time i had heard already how great it was so i watched it with very high expectations, i am glad to say it went above and beyond what I expected from a princess movie.  needless to say this was the BEST movie I have seen all year.  this movie has everything that you need to make an instant classic.  I would recommend this movie to anyone over 5. it is just Fabulous."}, {"rating": "9", "text": "My friends and I really wanted to see Tangled ever since the previews and we were not disappointed. I loved the art style. it displays top-notch 3d animation in 3d but still echos the charm and cuteness of classic 2d Disney animation. The story is great too. It is packed with comedy drama and some really dark themes harking back to the Grimm's fairy tale it is based off. The songs aren't bad either. They were surprisingly catchy, not 'hakuna matatata' or 'under the sea' catchy but still really great. I think this is everything Disney fans have been waiting for since Beauty and the Beast. It is as creative, gorgeous, and fun as the classics before it while showing cutting edge technological animation techniques. Rapunzel is definitely my new favorite Disney princess."}, {"rating": "9", "text": "I enjoyed Tangled very much. The animation was great, and the humor is perfect for all ages. I went with my aunt (I'm 13, my aunt's 23) and we were both laughing. I would most definitely recommend this to anyone of any age."}, {"rating": "10", "text": "What to say? It's Disney... and now is back to the basics... the classics! That old one which we grown up with...! A really brave princess, that goes beyond any boundary... a ''kinda'' prince who realices what is draming all about and two little but really important comic characters: Max and Pascal we've got what's expected, and what HAS BEEN BEING EXPECTED from a long time ago... a CLASSIC... humor, love, and over all of this... a great dream to fulfill!!!!"}, {"rating": "9", "text": "Very beautiful. That's what I can describe about the film, the characters, the environment, the story, although it is modified from the original, but it is quite good. More over, this film is very fun, I can find a lot of laugh in it. Nevertheless, the original music of the film is just a little \"over mediocre\", which is not match so much with the whole fascinating film. If Walt Disney had given the better music, this film would have been one of the greatest animation that they've ever created. Never mind, 9.0 points for their effort and let's hope they can make better film in the future!"}, {"rating": "8", "text": "Disney strays from its self-esteem centered story work while sticking to its sacrificial hero helping a brave damsel in distress, and it works very well.  Outside of a big gripe I will discuss later, Disney still seems to have some sort of magic when it doesnâ"}, {"rating": "10", "text": "So, I'd seen the previews for this movie...and thought it might be O.K.But tonight I caught it with a couple of friends, and must say, Wow, it Blew Me Away.How witty is Rapunzel! She was adorable from the get-go! I loved her. The beginning of the movie reeled me right in...until the final scene. A wonderful magical journey of a kidnapped princess.This movie was SO GOOD!I saw it in 2D, but I hear it's even better in 3D.See this movie."}, {"rating": "10", "text": "One of the best and hilarious movie made by Disney! I'm not really into princess stories with boring songs dumb innocence and typical handsome true love... but this movie got me tangled."}, {"rating": "8", "text": "It is no secret that I am a fan of Disney movies. I don't care what anyone thinks; I like good animation and a good story. It also no secret that Disney is one sided when it comes to movies geared to girls than towards boys. The boys get crap while the \"princesses\" have a whole park dedicated to them. So I was a little happy to hear that Disney was doing its version of the story Rapunzel but instead calling it \"Tangled\" because they were going to try appeal to coed audience. How on earth did they expect to do this? I mean the movie is about an 18 year-old girl with long blond hair, little boys aren't interested in that at allâ"}, {"rating": "9", "text": "When I saw previews to \"Tangled\", I honestly didn't have any interest to see it. It's just that Disney isn't the same anymore, I missed the Cartoon Animated types of Disney I wasn't getting into the CG Disney. I do like Toy Story, Finding Nemo, Wall-E, Up, and others from both Disney and Pixar. But it still doesn't give me that Disney feeling, I don't see the magic and imagination it use to have. \"Princess and the Frog\" and \"Winnie the Pooh\" were the last Disney Animated films I saw, and I really enjoyed them. But my parents got \"Tangled\" on Blu-ray, and I still disproved it so much. They were begging me so much to see it, so I finally broke down and watched it. The only thing I need to be completely honest is that I am a complete moron. This movie brought back the magic and imagination that I missed and waited for Disney to do, and I regrettably disproved it so much. I really wish I saw this in theaters, I was blown away by everything about it. I loved how it explains a lot on Rapunzel's childhood and why her hair keeps growing, it made a lot of sense. Then it gets better when the adventure begins, and finally see's her unforgettable cult to her kingdom. I felt heartbroken to see the King and Queen get emotional before they throw the lantern's for their lost daughter's birthday. Rapunzel never knew that all of that was about her, and its the main reason why she wants to go to that kingdom. I loved the characters, I really loved Flynn Rider and Maximus the horse. The animation, I honestly forgot about the CG, it was mostly 2D and it looked great. I don't know what else to say, but I really loved this movie so much. I just saw it for the 1st time just now, I'm gonna see it again many times more. But still, OH GOD I just wish I saw it in theaters. This was the Disney Animated film I've waited for, and I'm so happy to see that it still has that feeling and the heart for our dreams to come true."}, {"rating": "9", "text": "I went in thinking that this would be another kids movie that puts you to sleep. I can say I was wrong I really enjoyed it. It was well done, funny and kept me on my seat the whole time. animation is awesome the actors had me laughing the whole time. It was really nice to an \"old school\" movie with all the singing. I almost forgot that all movies used to be like that. I recommend this for a family movie night."}, {"rating": "10", "text": "Admittedly, I haven't seen a Disney movie for a while, so the magic and wonder hit me pretty hard. I watched this one last night before going to sleep, and I'm still thinking about it. I think it was an awesome movie, and it was very romantic. It's really hard to get a good romance in an animated film, and this was done excellently. Yes, I am female. The style was very casual, a la The Incredibles or Cars thanks to John Lasseter, so the magical bits just became that much more magical. I give this a two thumbs up, and I will probably have to watch it again and cry some more."}, {"rating": "10", "text": "Beautiful, fresh, this movie it's just amazing, the plot is incredible and the end is just perfect, I liked a lot the first time I saw this movie, and it's still one of my favorite animation movie"}, {"rating": "8", "text": "Another great production by Disney, detailing strong morals and creating memorable characters. Although the story is very cliché, it has been spiced up with sub-stories and humorous encounters."}, {"rating": "9", "text": "A fantastic return to form for Disney. Tangled has got to be one of the best modern Disney movies (not including any Pixar  titles.) Great visuals, funny characters, great story, and some of the best dialogue in an animated feature in a long time (well, at least from Disney.)\r Overall:\rA fantastic Disney movie that shows what Disney is all about. A true Disney Classic."}, {"rating": "10", "text": "Tangled is a good and enjoyable film. There are lots of hectic moments and lots of old fashioned action. It makes the twist with Rapunzel at the right moment. If you are a die hard animation-comedy fan you will absolutely enjoy this."}, {"rating": "10", "text": "As a 19 year old man, I'm not usually the one for disney movies but this movie was fantastic and I loved it from start to finish (I know i'm late), but definitely a must watch!"}, {"rating": "10", "text": "My favorite movie of all time. Good clean humor! Really wonderful animation and dynamic and realistic characters.  Mandy Moore was the perfect pick for Rapunzel. This movie will make you laugh and cry. Must buy."}, {"rating": "9", "text": "As the film starts, so will I start by saying that I really like the frame narrative. Everybody will be able to connect with it because of its reminiscence with bed-time stories, and it neatly ties the beginning and the ending together.\r Throughout the film, there's a great momentum of action, singing and character building. The film succeeds in portraying likable, believable and funny characters that, although they may be cliché-esque types, do convince. The dialogues too may make you suffer from a certain feeling of déjà-vu, but they are witty, and the songs are enjoyable (props to Mandy Moore), with the usual accompanying trademark funny scenes. The voice-acting is top-notch, as are the sound-effects and the soundtrack, which provides just the right tune for just the right occasion. Going on about aesthetics, the animations were colourful and enchanting with jaw-dropping detail (which makes for an awful lot of beautiful screenshots for fans).\r The story is no big mystery or surprise, even for those who are not familiar with the fairytale itself. The film however, does a great job of keeping it interesting with several sub-plots and an occasional plot-twist. It is the story about the confrontation between a naive teenager and the world, and also about the adolescent's growing awareness for the other sex. Tangled is a great example of the genius, albeit quite clichéd Disney formula of success on its best. We recognize the story of a sympathetic protagonist searching for freedom, and exploring the world. He or she encounters several evil characters on the journey, but in the end wins out over them, not only because of his or her intelligence and perseverance, but also by charming others with their innocence, likability and lack of prejudice.\r This mix of elements forms the basis of the trademark Disney formula, with which Disney here proves they utterly ace the art of pleasing a mass audience, all age categories included."}, {"rating": "10", "text": "A bit late on the review, but might as well contribute my love eventually for this movie somewhere. I absolutely love this movie, I grew up with Disney and I have to say, this movie has complete potential to be a part of the Disney classics! It came to be my favorite of them all, which is shocking to me since I was so set with sticking with the classics! While it does have that fairy tale theme, it has a huge modern touch to it. Rapunzel is no damsel in distress, and Flynn is no typical male hero of the story, no love at first site involved, and certainly has good qualities young girls of this generation can look up to. The music in this movie is just amazing to me, despite the mix reviews it's had, I still find my self humming the tunes here and there. Easily Tangled has potential to hit the Broadway's, which shocks me that it hasn't! Tangled is officially something special that will live in my life and home forever and something I hope my own children and theirs will love as well."}, {"rating": "9", "text": "This movie is really fun. It's super original and worth watching. I'm pretty sure that I've watched it about five times or so myself. It's just that good."}, {"rating": "10", "text": "Great music, Singing and acting! Other Disney Masterpiece by the creators! A Comedy and a musical that works very very very very very very very very very very very awesome!"}, {"rating": "10", "text": "Great movie. It takes classic Disney animation and storyline (look and feel), and gives it a modern sprucing up and some twists. Tangled has several layers of humor (child, teen, adult), some depth, and a lot of action. It's something for everyone, and one of my favorite movies (animated or not) in the last several years."}, {"rating": "9", "text": "A friend of mine asked me, Is thiz movie worth-watching? I said, Go and find out for yourself. It is Disney anyway.  Not every year, Disney introduces us to their new princess. It is going to be a magical time of your life, get ready to be part of the history. Do you remember how wonderful is Snow White, Cinderella, princess Aurora the Sleeping Beauty, Ariel the Little Mermaid, beautiful Belle and The Beast, Aladdin princess Jasmine, Pocahontas, Mulan, up to last year Princess Tiana and her Frog? It is the time! For long-haired Rapunzel (Mandy Moore) to get out from her hidden tower, to leave vicious mother Gothel and has some adventures with her prince, errr.. I mean runaway bandit, Flynn Rider (Zachary Levi). It is also for the first time, princess Rapunzel will face the unfriendly outside world, but do not worry, she got her frying pan to protect herself and accompanies by very cool chameleon, Pascal and the white horse with dog capability, Maximus. The song When Will My Life Begin reflects that adventure spirit. The Directors are Nathan Greno and Byron Howard. Both of them had ever worked together in dog tale BOLT (2008). But I think the person that deserves the posthumous achievement to bring thiz German fairy tale comes alive is no other than Alan Menken. Menken is the regular Disney genius composer who can always provide delightful classic elements into every piece of his magical music or score. The storyline is so smooth and dynamic. Yeah it is predictable, but at least you could enjoy the joyful comedy, it is always fun to watch how Rapunzel and silly Flynn Rider tease each other. And although without dialogue, the animal characters, the chameleon Pascal and the horse Maximus are also doing an exhilarating slick slapstick performance. For visual excitement, the picture has been beautifully rendered to another level, you will be amazed by how realistic each texture and detail it has been made, the hair, the grass bit by bit. The most powerful scene is The Floating Lanterns Night Scene, when finally Rapunzel and Flynn were in the boat right outside the castle, waiting for the glow flying lanterns to be released. In that romantic moment, you could feel the pure sincerity and so much loves between them, through their innocence face expressions and breathtaking interaction with the background song: I See the Light.  That scene simply gives you goosebumps and could easily bring tears in your eyes. It is very rarely, there is a movie that could touch my heart. Thiz one is definitely the one. Usually if someone asks me, Who is your favorite Disney Princess? Most of the time, I would answer, Cinderella! But after thiz movie, maybe I would give a different answer. By the way, I always love the girl with the long hair ^_^ It is certainly Disney knows best!\r Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com"}, {"rating": "10", "text": "Tangled is a fantastic movie!  Disney did not market this movie right.  I didn't realize it was a musical until we were watching it.  I don't know why Disney didn't market it as a musical--if I had known it was a musical, I would have seen it opening weekend.  It was so nice to finally see another Disney animated musical with music by Alan Menken again.  I really like the music, but I wish someone with a stronger voice than Mandy Moore was playing the lead.  There were a few plot holes I noticed, but it was still highly enjoyable.  I would gladly see it again, while it's still in the theatre even.  I will definitely buy the DVD."}, {"rating": "9", "text": "Disney always gets it right, they really do. Though i guess there is some minor criticism for Tangled: it runs a bit slow in the beginning, and the musical pieces are not exactly blockbusters. But who cares... it's got everything a modern American cartoon needs: simple enough to keep the kids on track, enough adult humor to keep the adults entertained, and a very charming and heartwarming story to pull it together. Some of the sideshow-character development is stupendous, including Maximus the horse, and the gang of Ruffians. You don't need kids to go see this... I can tell you that personally... I don't have kids, but my girl and I had a wonderful date night... Enjoy."}, {"rating": "9", "text": "This one really surprised me. Was expecting a stupid Disney movie by the trailers. But it was extremely well done. Just as enjoyable for the adults as for the kids, without relying on any of the usual crass humor I've come to expect. Nothing in it that I felt my kids shouldn't see. Good message. Strong roles.  A great story  good complexity in the mother/ daughter role for adults and discerning kids to appreciate. Thoroughly enjoyed this one."}, {"rating": "8", "text": "Not a bad animation for Walt Disney's  'princess' franchise, but it certainly lacks the purity the old animations (Beauty and the Beast, Little Mermaid) had."}, {"rating": "9", "text": "Tangled gloriously showcases Disney's return to top-form. It's deeply heartfelt, smart, funny and looks simply gorgeous. The voice actors' performances are great - Mandy Moore's Rapunzel and Zachary Levi's Flynn Rider have great chemistry, Donna Murphy makes Mother Gothel delightfully amoral, and the most memorable Disney villain in years, and the rest of the cast, including Ron Perlman, Brad Garrett and Jeffrey Tambor all appearing to be having an immense amount of fun in their roles. The real scene-stealers, however, are not characters with dialogue (though their animalistic expressions are expertly provided by Frank Welker), but the royal horse Maximus and Rapunzel's pet chameleon Pascal - with the possible exception of Meeko and Flit from Pocahontas and WALL-E, they make two of the most entertaining mostly-silent animated characters in film history. The story is energetic and engaging, the characters compelling, the songs are catchy (particularly \"Mother Knows Best\" and \"I've Got a Dream\") and you'd have to have a heart of stone to hold back tears at the tender and beautiful lantern extravaganza scene. It's always pleasing when Disney get the balance of entertaining both adults and children just right, something they certainly achieve in Tangled. It's a hugely fitting 50th animated feature for Disney, and here's hoping they can maintain this standard in the future, and never return to the mediocrity that has plagued many of their films in the last decade."}, {"rating": "10", "text": "I'm a HUGE fan of Pixar movies, and I must say that - with the help of the Pixar guys - Disney managed to do as good, if not better (animation is just incredible !). This movie is also a great success for my daughters (2 and 9), my wife too... The blu ray is very impressive on a HD TV (if you have to chose between BD and DVD)."}, {"rating": "9", "text": "When I first heard of Tangled, I automatically turned my nose up due to the fact that it was a disney movie that involved Rapunzel. I was happily proven wrong when I watched it the other week. I like how disney managed to make it appealing to both boys and girls with a male and female role who both have an equal importance to the film. The film also combines great action scenes with broadway style songs and typical disney princess story telling. \"Chuck\" Star Zachary Levi voices the charming yet idiotic bandit Flynn Rider while pop star turned actress Mandy Moore plays the sweet rapunzel. this film is perfect for both the young, old and everywhere in between. I must watch and Ten times the quality on Blu-Ray"}, {"rating": "10", "text": "Went to see this my one of my cousins from Albany, New York and my siblings enjoyed it. So did I. Animation was excellent, Acting was top-notch, songs are memorable, and setting was amazing. This movie is Disney's greatest creations since The Lion King and The Hunchback of Notre Dame."}, {"rating": "8", "text": "I forgot Disney movies use to have singing!!!  There are so many animated films out now that it is easy to forget that Disney movies are normally musical (especially when you assume all animated films are from Disney).  The first song started and I thought, \"dear lord there's singing I thought they stopped doing that.\"Needless to say I spent the first portion of the movie kicking myself for wasting my money but as the movie progressed it got better.  The characters were great and likable.  There were a few funny parts.  I think if you go with children they will find it hilarious."}, {"rating": "10", "text": "This movie is a childrens movie and it made me leave feelig warm. Disney has done a great job with this story that has never been done surprisingly. This movie is one I will suggest to all adults with young children to enjoy it with. Very well done to all te participated with this movie. It was great!!"}], "recommendations": ["winnie_the_pooh_blood_and_honey", "the_princess_and_the_frog", "rio", "moana", "atlantis_the_lost_empire", "enchanted", "the_peanuts_movie", "klaus", "meet_the_robinsons", "bolt", "trolls", "anastasia", "over_the_moon", "shaun_the_sheep_movie", "zootopia", "vivo", "toy_story", "strange_magic", "onward", "the_sword_in_the_stone", "rio_2", "up", "finding_nemo", "home_on_the_range", "aladdin"]}