{
  "id": 4359,
  "title": "Tarzan",
  "starring": [
    "Tony Goldwyn",
    "Minnie Driver"
  ],
  "runtime": 88,
  "genre": [
    "Family",
    "Adventure",
    "Animation",
    "Drama"
  ],
  "description": "Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...",
  "releaseYear": "1999",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ceGk1VcuI8pSXQhSlnqsqTFCPLD.jpg",
  "categories": {
    "plot": 9.11111111111111,
    "acting": 9.11111111111111,
    "ending": 8.333333333333334,
    "soundtrack": 8.941176470588236,
    "cinematography": 5.0,
    "familyFriendly": 9.0,
    "funny": 5.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "\"Tarzan\" is one of those Disney classics that molded your brain and your heart with passion and innocence. A colorful masterpiece overall."
    },
    {
      "rating": "10",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "10",
      "text": "An amazing movie I loved as a kid, and I still do to this day! The music by Phil Collins is also very excellent, in fact the best since Lion King at the time."
    },
    {
      "rating": "10",
      "text": "Heartfelt, featuring terrific action and exciting animation, and based on a lovable and emotional story, 'Tarzan' works even as a great musical, but as an animated film, it stretches to the Top."
    },
    {
      "rating": "9",
      "text": "Like most of the old Disney classics, this movie just has something special about it. It seems Disney has been losing its touch the last few years. A person could almost say that the company has forgotten what Disney is about. Tarzan is arguably as good as if not better than The Lion King. It has great asthetics, audio and a soundtrack that shouldn't be forgotten (but as time goes on, no doubt will be), has well developed characters, a story that one could not walk away from unfinished and of course that little bit of magic that Disney always used to have. I have no problem with Disney's Pixar films such as Toy Story, Finding Nemo and even maybe Up, but I am sorry to say that I think Disney has gotten lost in the new technology of today and may never go back to the fantastic old styles like Tarzan here. Then again, I have yet to watch The Princess and the Frog."
    },
    {
      "rating": "10",
      "text": "like Mulan, Tarzan is excellent"
    },
    {
      "rating": "10",
      "text": "I love this movie, and i'm still watching it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! GOOD OLD DAYS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "10",
      "text": "Favorite movie as a child, still love it now and kerchaks death still makes me cry, will always love this movie"
    },
    {
      "rating": "8",
      "text": "Cool, with an amazing message and score make Tarzan one of Disney's most entertaining films yet, and it also has an amazing voice performance from Rosie O'Donnell.  I give this movie a 81% of a good movie."
    },
    {
      "rating": "7",
      "text": "divertido e com um ótimo visual"
    },
    {
      "rating": "9",
      "text": "A greatly entertaining roller coaster of a film that combines 2D animation with 3D background to its best extent and dazzles us with thrilling scenes of Tarzan surfing through the jungle trees, while the classic story offers us a very nice message about acceptance and self-identity."
    },
    {
      "rating": "10",
      "text": "Tarzán es un clásico indispensable de Disney al igual que El Rey León, Dumbo, Aladdin, entre otros. No necesita mayores presentaciones ya que asumo que es tan popular como las películas antes nombradas, tiene dos de los personajes más queridos de la industria de la animación (Tarzán y Jane) y una de las muertes de villanos mas memorables de todos los tiempos."
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "6",
      "text": "In the late 19th century, an English couple and their infant son survive a shipwreck. They end up near an uncharted rainforest on the Congolese coast, where they build themselves a treehouse from the ship's wreckage. Meanwhile, Kerchak, the leader of a troop of gorillas, and his mate Kala mourn the death of their baby at the hands of a savage leopard named Sabor. Soon afterward, Kala hears the infant son's cries and finds the treehouse, where she discovers that Sabor has killed the couple as well. Kala encounters Sabor and escapes with the infant in her possession. Kala takes the infant back to her troop to raise as her own, an action which Kerchak objects to. Kala adopts the human child, naming him Tarzan. When aged seven, Tarzan begins to befriend other animals, including Kala and Kerchak's niece Terk and a paranoid elephant named Tantor; but he is treated hostilely by Kerchak due to physical differences, so he makes great efforts to improve himself. As an adult, Tarzan manages to slay Sabor with a spear he crafted, gaining Kerchak's respect.One day, the gorillas' peaceful life is interrupted by the arrival of a team of English explorers, consisting of Professor Archimedes Q. Porter, his daughter Jane, and their tour guide, a hunter named Clayton, who have come looking for gorillas to study. Jane drifts out of the group, and is attacked by a gang of mandrills, who chase her through the trees' branches, but a curious Tarzan manages to save her. Tarzan realizes that Jane is similar to him, and she leads him to their camp, where Porter and Clayton garner interest in him. Porter views Tarzan as an opportunity for scientific advancement, while Clayton desires to persuade Tarzan to lead him to the gorillas. Kerchak firmly warns Tarzan to stay away from them, but Tarzan disobeys his warnings and continues to return to the camp, where the Porters and Clayton teach him what the human civilization is like with the use of a slide projector and various other gadgets. A few months pass, and Jane and Tarzan begin to develop feelings for each other, but Tarzan still refuses to lead them to the gorillas out of respect for Kerchak.The explorers' ship soon returns to retrieve them. Jane asks Tarzan to return with them to England, but Tarzan asks Jane to stay with him when Jane says that it is unlikely that they will ever return. Clayton convinces Tarzan that Jane will stay with him if he leads them to the gorillas. Tarzan agrees and leads the trio to the nesting grounds, while Terk and Tantor lure Kerchak away to prevent him from attacking the humans. Jane and her father are excited to mingle with the gorillas, when suddenly, Kerchak returns and attacks the Porters and Clayton, but Tarzan stops him, allowing them to escape. Kerchak accuses Tarzan of betraying the troop, who turns against him. Kala takes Tarzan to the treehouse where she found him and reveals his past to him. He dons a suit that once belonged to his father, signifying his decision to go to England, before he and Kala share a bittersweet goodbye.When Tarzan boards the ship with Jane and Porter, they are all captured by Clayton and his band of stowaway poachers. Clayton reveals his plan to capture the gorillas and sell them for a fortune, and he was just using the Porters for a way to go to the jungle. He subsequently used Tarzan to find the nesting grounds and locks him, Jane, and Porter away in the storage area of the ship. Tarzan manages to escape with the help of Terk and Tantor and returns to the jungle to save the gorillas. During the ensuing battle, Clayton fatally shoots Kerchak and fights Tarzan across the treetops. Although Tarzan spares his life and destroys his shotgun, Clayton tries to kill him with his machete. After Tarzan traps Clayton in vines, Clayton wildly slashes the vines with his machete, causing him to fall from the tree with a vine tangled around his throat, hanging and killing him. Kerchak apologizes to Tarzan, finally accepts him as his son, and names him his successor before peacefully dying.The next day, Jane and her father prepare to leave on the ship, but Tarzan remains behind with the gorilla troop, intending to withhold Kerchak's last wish to lead and protect the family in his place. As the ship departs, Porter encourages his daughter to stay with Tarzan, and Jane jumps overboard to meet Tarzan with her father shortly following her. The Porters reunite with Tarzan and embark on their new life together."
    },
    {
      "rating": "9",
      "text": "One of my favourite Disney animated films. Has a great story, interesting characters and one of the best animation the company has ever done. Seeing Tarzan sliding through the jungle like he's skating on it is just amazing to look at. Tarzan acts as he should act; like an ape but he still has a lot of humanity in him, Jane is the best damsel in distress I have ever seen in any film and the animal characters are creatively designed and well thought out. The only problem I have with this film is Phil Collins singing in and out of the film. It is out of place and is completely random. Oh and I don't like Phil Collins' singing that much. Don't get me wrong, the songs are fantastically composed  but it should have been sung by the characters in the film instead of Collins and if it was just Phil Collins composing and the characters singing, it would've been one of Disney's best musical because the songs are really great. Overall, a great Disney movie."
    },
    {
      "rating": "7",
      "text": "Tarzan is a decent Disney movie, featuring great animation and some exciting action sequences. It has a very classical feeling to it, albeit shot through with a bit more violence than usual. Good stuff."
    },
    {
      "rating": "8",
      "text": "An epic animated film with excellent visuals and music and solid writing. Very entertaining."
    },
    {
      "rating": "9",
      "text": "Tarzan is a bright and beautiful film lifted only higher by the brilliance of Phill Collins' soundtrack."
    },
    {
      "rating": "9",
      "text": "One of my favourite Disney films and its a tale we all knew growing up about the Jungle Boy who fell in love when he met Jane. Disney does a pretty tame version of this for the kids of course but its still an enjoyable Family film with some great songs from Phil Collins and some rather touching scenes in there also. Voice talents were all spot on, no real stand-outs but as a whole a great cast. Overall definitely a highlight for the more recent Disney films released and worth checking out!"
    },
    {
      "rating": "8",
      "text": "\"Tarzan\" brings a beautiful heartwarming tale, and while it does lack the strength in the middle sections of the film, it's still great fun. With bright beautiful visuals, a catchy theme, and action-filled, \"Tarzan\" can soar."
    },
    {
      "rating": "7",
      "text": "Overly melodramatic, and the music makes the splendid film more corny. But the film has its moments, mostly due to the weird relationship of Tarzan and Jane. Provocatively humorous, and a friendly, childlike version to the gritty books of nineteenth century. A regular Disney movie."
    },
    {
      "rating": "7",
      "text": "Tarzan is  a daring, wildly entertaining Disney movie that makes the occasional misstep, but it is still a great film for all ages. In terms of retelling this classic story, \"Tarzan\" delivers."
    },
    {
      "rating": "8",
      "text": "a great adventure of our jungle man raised by apes who surely will not forget. What I loved most is the music of Phil Collins, this and all the great works of the Disney classics have a variety of historiar we like both the younger ones as the greatest ."
    },
    {
      "rating": "9",
      "text": "Tarzan is a very good film indeed, and is without doubt the last great Disney movie. It only has one flaw, that's it, and in comparison to Hercules (weakest Disney of the 90s)that's saying something. The animation is just gorgeous. I have been to Africa, and never have I seen the African Jungle look so beautiful. The songs, performed by Phil Collins mostly, are very pleasant, though I must confess, that I did get annoyed once when my sister played \"Two worlds\" at loud volume on the computer, for what felt like an eternity. The characters are great, Tarzan is a wonderfully charismatic lead. My favourite character was Jane, thanks to a brilliant characterisation from the underrated Minnie Driver. Terk and Tantor provide great comic relief, and the gorillas provide plenty of quite emotional scenes. The weakest character, was the aforementioned Clayton. Although Brian Blessed voiced him with enthusiasm, Clayton wasn't particularly likable. The main reason why I like this movie as much as I do, is the thoroughly human portrayals of the characters, and it was also the first time in a Disney since Beauty and the Beast and Hunchback of Notre Dame when I cried at the very end of the movie. Who would, it's really emotional. Tarzan is a must-see for Disney fans. It's not perfect, but it's miles better than the trash out today. 9/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Enjoyable as ever, this Disney attempt of Tarzan is an enjoyable story that'll be in your heart forever. It'll be your heart; yeah, it'll be in your heart forever!"
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "9",
      "text": "This movie is one of Disney's greatest. Heart warming, inspiring, fantastic. The visuals, plot, and soundtrack are the stand-out features, but it is the sheer excellence in all areas of the film that make this a movie for everyone, not just a child's movie."
    },
    {
      "rating": "9",
      "text": "Great AdaptationDisney’s take on Tarzan is fun, unique, creative, and clever."
    },
    {
      "rating": "8",
      "text": "The last Disney movie before reaching the Experimental Era.It contains little symbology, but enough to give it enough potential to fully exploit this great animated film.There are some visual inconsistencies, but nothing important.After all, it's Disney's last great movie before it derails the train."
    },
    {
      "rating": "10",
      "text": "Great way to close out the renaissance.Tarzan (1999) - is the final movie in the Disney Renaissance and it certainly was a great note to leave on. The story is very basic and easy to follow but they allow so much to happen when it comes to character development and showing off the incredible surroundings of the jungle. All the characters are very memorable and I especially love the way they work Tarzan and Jane's relationship. I love how each of them work of each other and how Jane helps Tarzan understand the ways of the human life. The gorillas also have their moments of tenderness and I do like how each of their views of Tarzan are well understandable. I kinda will admit that the villain is sort of weak but he still acts as a major threat to Tarzan even though it's kinda obvious how Disney is hiding the fact that he's really a villain and not a good guy. The way they work the animation is absolutely incredible. it is just mind blowing and how they manage to combine hand-drawn animation with CGI effects. It makes the look of the jungle feel so immersive and lifelike. The action scenes definitely are proof of how great the animation is and it moves at such a fast and steady pace. it's probably some of the most action pack stuff I've ever seen in a hand drawn film. The overall music score is great for setting the mood and any type of scene. Whether there's a heartfelt scene or an action-packed sequence, the music is always there to accompany whatever is happening on screen. Phil Collins wrote and performed a few songs for the movie and I think all of them are heartfelt and catchy. They are all greatly separated from one another and they play their part whenever the moment is right. I love this movie for a lot of reasons but overall, it's just an outstanding piece of magic to behold.."
    },
    {
      "rating": "10",
      "text": "The last film of the Renaissance Disney does not disappoint and delivers a beautiful and well-developed film, finishing this remarkable phase of the studio with a golden key."
    },
    {
      "rating": "8",
      "text": "Tarzan es una gran película. Animación revolucionaria, una historia bastante reconfortante y tiene también una banda sonora muy buena (y eso no me lo esperaba). Lo único que si me medio disgusto fueron algunos chistes tontos con Tarzan, incluso llega a ser mas tonto que de niño en ocasiones, cosa que sorprende. Pero quitando eso, si bien no es una de mis películas favoritas animadas, entiendo a la gente que la considere como tal, y definitivamente destaca. Totalmente recomendada."
    },
    {
      "rating": "10",
      "text": "Great story, even better soundtrack. I laughed, I cried, My faith in humanity is restored."
    },
    {
      "rating": "8",
      "text": "GGs this is a good movie.  I will watch it again in the future. soundtrack dope"
    },
    {
      "rating": "10",
      "text": "This film is one of greatest Disney films I have ever seen, it feels like an all right American adaptation of a Studio Ghibli film, I wish Disney made more movies like this."
    },
    {
      "rating": "9",
      "text": "an amazing movie for middle like timesprosamazing graphicsamazing musicamazing peopleamazing animalsconsthe fire scene the baby monkey scene"
    },
    {
      "rating": "9",
      "text": "My favorite Disney movie , Nice graphics, the story is fun, but there are many gaps in the story and somehow illogical ."
    },
    {
      "rating": "9",
      "text": "Tarazan is one of these movie that not only shaped my childhood, but a lot of other people's childhood. Disney's take on Edgar Rice Burroughs' character is just as heartwarming as it is packed with emotion and joy. The animation looks great for its time and it still holds up pretty well. The voice acting from the cast, especially Tony Goldwyn as Tarzan, is astonishing and each cast member give their character a distinct personality. The soundtrack by Phil Collins is amazing and adds to the film's adventurous vibe. The story also manages to stay true to the Tarzan character and is packed with emotional moments. Tarzan still remains one of Disney's best outings and it's film that doesn't just provide nostalgia, it still stands as one of the greatest animated films ever made."
    }
  ],
  "recommendations": [
    "the_lion_king",
    "aladdin",
    "the_little_mermaid",
    "anastasia",
    "the_princess_and_the_frog",
    "mulan",
    "finding_nemo",
    "song_of_the_sea",
    "wolfwalkers",
    "the_prince_of_egypt",
    "treasure_planet",
    "cinderella",
    "the_sword_in_the_stone",
    "moana",
    "tangled",
    "toy_story",
    "luca",
    "how_to_train_your_dragon",
    "fantasia",
    "pocahontas",
    "the_little_prince",
    "the_nightmare_before_christmas",
    "winnie_the_pooh_blood_and_honey",
    "atlantis_the_lost_empire",
    "over_the_moon"
  ]
}