{
  "id": 1883,
  "title": "Tears of the Sun",
  "starring": [
    "Bruce Willis",
    "Monica Bellucci"
  ],
  "runtime": 121,
  "genre": [
    "War",
    "Action",
    "Drama"
  ],
  "description": "Navy SEAL Lieutenant A.K. Waters and his elite squadron of tactical specialists are forced to choose between their duty and their humanity, between following orders by ignoring the conflict that surrounds them, or finding the courage to follow their conscience and protect a group of innocent refugees. When the democratic government of Nigeria collapses and the country is taken over by a ruthless military dictator, Waters, a fiercely loyal and hardened veteran is dispatched on a routine mission to retrieve a Doctors Without Borders physician.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fUnSSQukwTwBSdCbufEE36petLq.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 6.285714285714286,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Un film humanitaire à la mords-moi-le-noeud où l’on suit Bruce Willis et son escouade porter secours à des réfugiés alors qu’ils devaient simplement exfiltrer une conne bénie-oui-oui d’un pays africain victime d’un énième coup d’état…La mentalité de ces trouducs d’une ONG typique (comme il en existe beaucoup trop) est assurément bien restituée et incroyablement énervante (y compris celle des missonnaires cathos cons comme leurs pieds qui se feront massacrer par les putschistes et autres rebelles de l’armée de libération du pays sous-développé en proie au chaos etc, etc -c’est de l’archi-classique, ouais, ouais, ouais).C’est notre Belluci nationale tête à claques qui s’y colle et amadoue le soldat McClane devenu doux comme un agneau (censé être un soldat le gars mais il ne fait que des choses insensées !) et devenu aussi bien entendu tout-à-coup bisnounours de gauche (il faut sauver tout le monde, Caliméro dans les cordes !).Le film est donc insupportable de misérabilisme primaire, en plus de se traîner comme c’est pas permis… c’est niais et ça distribue des leçons comme des salmonelles dans les Kinder Surprise ! c’est à pleurer de rage tellement c’est mauvais, con et gauchiste bisounours angéliste de mon cul : de la merde !!"
    },
    {
      "rating": "10",
      "text": "It is strange to see its such - the actor whom it is difficult to present in other role, than to roles of the cool guy thrusting tens of bullets in any who will encroach on the American way of life.It is strange to look, how flow down on the person of the lieutenant rain drops, and to see his eyes. Eyes of the professional many long years killing by order of where will tell and in whom will specify. Eyes in which is brighter, than in the opinion of the person of any other trade, all pain of this silly is reflected, God of the damned world which is not able and doing not wish to learn to live in the consent with itself. Eyes in which depth, behind a wall of composure of the gone through fire and water person, the weariness hardly considerably decays. Both grief. And a question: what I for you, become hardened should make heart and soul Adam and Eve's living on this planet descendants that you at last have realized importance of each human life? How many still lives I that you has reached should take away, what it is impossible to kill or order to kill only because to you so it is pleasant or because you are obliged? Whom from you I should shoot down or kill, that the mankind has come round and has ceased is boastful to be trampled down knee-deep in own blood? This question is set to itself by each soldier. Not only at cinema, but also in life. But it is necessary to search for the answer to it very long. At times so happens that it comes only when the one who set, has already failed on the earth with the raked breast.And still each of them hopes that will find the answer not too late. That can make it still before will feel that for quite some time now to it already on all to spit, and the question that was once shone in the heart of eyes, was replaced with the cold, cynical and indifferent counter of death.And it... It has already found it. Not in words and not in books. And in eyes. In the opinion of Lena Kendricks, going mad of ignorance - it has survived or not. In the opinion of those whom conducted behind itself to the border and whom covered with fire in last furious and bloody firing. In the opinion of Slo, dying at it on hands. In the opinion of Lake, covered before death the body the Nigerian girl.The answer has appeared is simple. Easier the most simple question. Healthy fellow Mike was right, devil take it: \"all it wasn't vain\".After all if you want to rescue the whole world - begin at least with one person..."
    },
    {
      "rating": "6",
      "text": "Yes, the characters are wooden and the plot is entirely generic and predictable, but thanks to some utter cinematic dedication from Fuqua, a handful of cool action set pieces, and a criminally underrated score from Hans Zimmer, \"Tears Of The Sun\" mostly succeeds as an action thriller."
    },
    {
      "rating": "1",
      "text": "Bruce Willis - the movie. Starring Bruce Willis. One of those movies I wanted all the \"good\" people to die just for a whiff of something original. The movie was written by a machine with the words \"Action movie generator\" down the side."
    },
    {
      "rating": "2",
      "text": "Professionally made awful movie: to be avoided. The plot is only realistic for people showing afrike in south amerika on the map. Completely undeveloped characters just relying on standard clichés (saves character build time) this movie just relies on what would be the imagination of a 12 years old writer playing with his lego-soldiers. All thumbs down."
    },
    {
      "rating": "6",
      "text": "Better than your average movie of this type Tears of the sun delivers a respectable story and good acting. Worth a watch, mabye worth buying for around $3. Nothing special here though really, it is just your normal slightly above average flick."
    },
    {
      "rating": "4",
      "text": "The movie opens brilliantly offering a new look into war in contrast to the Vietnam/World II films such as Platoon, Full Metal Jacket, or Saving Private Ryan. Unfortunately this new look is not so good and I found myself soon begging for those classics. The only basis for Tears of the Sun is not in history, but in fiction. The film thus becomes tiresome soon after Bruce Willis enters the Nigerian village. By the end, we are left with lackluster acting (save for Willis), improbable and unbelievable circumstances including Willis disobeying direct orders without consequence, a cliched and poorly created love scenario between Willis and the good doctor, an ending more cliched than the love scenario and just as poorly built, and a directing style that is at times smooth and stylish, but at others cramped and hard to stomach. Tears of the Sun stands as one of the worse war movies of recent years, though with only two battle sequences in its over 2 hour length, war movie may be an improper description."
    },
    {
      "rating": "10",
      "text": ".......................................................................................................................................................a reflecting, emotional & action-packed"
    },
    {
      "rating": "7",
      "text": "It deserves minimum 7 comparing to the crap movies that are popular nowadays.Really well deserved 7 star."
    },
    {
      "rating": "10",
      "text": "Um dos melhores filmes de ação, muito emocionante. Prende a atenção do início ao fim."
    },
    {
      "rating": "10",
      "text": "One of my all time favorite movies, great action, good story and Monica Bellucci what more can a guy ask for?"
    },
    {
      "rating": "5",
      "text": "A totally unimaginative war film with dumb dialogue and bland characters. Action is decent."
    },
    {
      "rating": "10",
      "text": "Antoine Fuqua,dirige essa obra-prima com uma linda mensagem de moral,escrito brilhantemente por Alex Lasker e Patrick Cirillo.\rEsse Drama de guerra cheio de ação,é atuado brilhantemente por Bruce Willis E Monica Bellucci \"Aquela Morena Gostosa Super Peituda\"."
    },
    {
      "rating": "10",
      "text": "...............................................................................................................................................................................................Excelente drama de guerra"
    },
    {
      "rating": "10",
      "text": "Zajebisty... Totalnie nie czaję skąd tylko 48 pkt .. kogoś nieźle posrało... Ale kto co lubi."
    }
  ],
  "recommendations": [
    "lone_survivor",
    "constantine",
    "deep_impact",
    "noah",
    "greenland",
    "lord_of_war",
    "exodus_gods_and_kings",
    "captain_america_civil_war",
    "the_grey",
    "fury",
    "12_strong",
    "greyhound",
    "wonder_woman",
    "13_hours_the_secret_soldiers_of_benghazi",
    "olympus_has_fallen",
    "avengers_infinity_war",
    "armageddon",
    "machine_gun_preacher",
    "elysium",
    "deepwater_horizon",
    "the_marksman",
    "no_escape",
    "pearl_harbor",
    "hellboy_ii_the_golden_army",
    "the_road"
  ]
}