{
  "id": 411,
  "title": "Ted",
  "starring": [
    "Mark Wahlberg",
    "Mila Kunis"
  ],
  "runtime": 107,
  "genre": [
    "Comedy",
    "Fantasy"
  ],
  "description": "John Bennett, a man whose childhood wish of bringing his teddy bear to life came true, now must decide between keeping the relationship with the bear or his girlfriend, Lori.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/osJNr64CNyGhCzdlg6oHt3a6vNA.jpg",
  "categories": {
    "plot": 4.882352941176471,
    "acting": 5.411764705882353,
    "ending": 7.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.552941176470588,
    "action": 8.6
  },
  "reviews": [
    {
      "rating": "3",
      "text": "This was a very disappointing movie. After seeing all of those people saying it was one of the funniest movies in a long time, I had high expectations for this movie. Being a fan of both Family Guy and American Dad, I felt very confident that this would be a good movie. Boy how wrong I was. I don't know why I didn't expect anything except a long episode of Family Guy but that's all this movie was in the end. The same jokes, the same cut-away style of jokes, the same everything. That would be fine if the movie was entertaining and it just wasn't. The story was terrible. The actor's were not very good and they were obviously mailing it in half the time. There were some decent moments here and there but this movie was very unoriginal and just boring most of the time. I'll stick with MacFarlane's  T.V. shows from now on if this is going to be the quality of his movies."
    },
    {
      "rating": "4",
      "text": "Ted is an homage to old, tired jokes and an attempt to shock its audience into liking the movie. Just like Seth McFarlane's completely unoriginal Family Guy, Ted dares its critics to lambast the movie and when they do, they are accused of being \"unhip\" or \"too sensitive.\" I saw this movie in the summer and enjoyed the first ten minutes of the movie, when it maintained some sense of originality. Then it devolved into an hour and a half Family Guy or American Dad episode. Each joke less memorable than the one before it. Throughout the movie I couldn't help but feel sorry for Mila Kunis. (Maybe McFarlane has something on her and blackmailed her into starring?) And Mark Wahlberg played a completely unlikable loser. You don't want him to get the girl. Teenagers and 10-year-old boys will enjoy this movie because they enjoy anything that is crass. It makes them feel older and more powerful. Maybe that's what McFarlane's motivation behind his work is?"
    },
    {
      "rating": "3",
      "text": "Ted seemed to be a good movie, although the idea is very interesting and original, because nobody could possibly think in another use for a teddy bear than a toy for a little child. The director, Seth MacFarlane, obviously used his experience for creating this story in which a kid with no friends grows up with ted, entering both to a world of parties, sex and drugs. The problem is that the protagonist is now an adult with a girlfriend (asking for marriage) and a job, but he still has ted, with the exception that now it is promiscuous and a very bad influence. The film consists in funny situations about this couple and how it breaks with the adult world. The problem with this picture is that the jokes and situations are very weakly constructed and with the simplicity of a child. At no time this movie made me laugh, even more, I got bored. The story is poor and predictable, the performances are disgusting and the direction is awful, however how you cannot expect a complex humor from the guy who created Family Guy. Is shallow, is repetitive, is Ted-ious."
    },
    {
      "rating": "3",
      "text": "The only entertaining thing for me during the entire movie was Ted mimicking voices like the Boston one. Otherwise, it's trashy comedy with bad acting. The plot was also very clique and no good."
    },
    {
      "rating": "5",
      "text": "So, was it worth my while investing 106 minutes of my life on this one? I have to say, on balance; not really. Yes there are some wonderfully comic moments and smart one-liners in there but I did find it drifted far too much from the sublime to the ridiculous. Also, one minute Ted is ‘Brian’ for Family Guy and the next he turns into ‘Peter Griffin’ from the same show (despite his denials). I thought both Mark Wahlberg and Mila Kunis did a good job; both of their characters were quite believable. Ultimately though I did find it lacked the one thing it so desperately needed; heart. Still, I’m sure the many devotees of ‘Family Guy’ will love this one but for me, sadly, it’s a bit of a dud.\r SteelMonster’s verdict: NOT RECOMMENDED (…unless you’re a really big fan of Family Guy, in which case why haven’t you seen it yet!)\r My score: 5.3/10"
    },
    {
      "rating": "10",
      "text": "GREAT COMEDY!!  And i don't use that term lightly ever.  The critics on the left are morons.  This movie has it all.  Great cameos throughout, great story, hot chicks and Family Guy style humor i love."
    },
    {
      "rating": "10",
      "text": "This movie is simply awesome. I very creative, and the way he acts with the teddy bear really seems real. Its amazing, I can't even imegine someone saying something negative about this movie... Amazing!"
    },
    {
      "rating": "4",
      "text": "The only thing 'shocking' about this movie is how lazy the writing is.  Some good moments here, including a really funny bit part played by Joel McHale.  Mila Kunis and Mark Wahlberg are good but they cannot carry a poor movie with a boring plot and weak jokes.  The humour was base, unoriginal and just lame.  If you're into racist stereotypes and fart jokes, this movie is for you."
    },
    {
      "rating": "10",
      "text": "I liked Ted. It was clever and funny. And, come on. These people giving it 0/10, FLASH GORDON WAS IN IT. That has to count for atleast some points, I mean - come on guys. FLASH GORDON. That PenguinMusic is just being a **** Let's not listen to him/her/both?\r I love Seth MacFarlane's humour. It's the kind of humour that makes me laugh. That dig at Adam Sandler in Jack and Jill was hillarious. PATRICK STEWART IS A GREAT NARRATOR.\r A sequel would be very good."
    },
    {
      "rating": "6",
      "text": "If you are a fan of Family or Judd Apatow films you will be entertained by this one.  However, if you are looking for comedy gold, you should probably look elsewhere.  Best enjoyed with a group of guys at least 3-4 drinks in when you turn it on."
    },
    {
      "rating": "10",
      "text": "This movie is close to an instant classic, laughed my ass off for the majority of the movie.  Good times all around, overall solid movie Seth Macfarlane"
    },
    {
      "rating": "9",
      "text": "Ted was maybe the funniest movie I've seen all year. Mark Wahlberg played a pretty good role but Mila Kunis and Seth MacFarlane (as Ted) steal the show. Mila is absolutely stunning as usual and MacFarlane's sense of humor is so deranged that you can't help but find it hilarious. This definitely isn't a movie for everyone. It's incredibly vulgar and some people might be offended by a lot of the content. Nonetheless, if you're like me and don't really care about any of that stuff, I think you'd love this movie."
    },
    {
      "rating": "4",
      "text": "Ted is nothing more than a juvenile film with crude and mostly unfunny sex jokes. The movie is over the top punctuated by a few bright spots here and there. It seemed like Seth MacFarlane wrote down any stupid joke that came to mind and threw it all together."
    },
    {
      "rating": "4",
      "text": "I'm a fan in general of the Family Guy series so I had high hopes for this, but it just never seemed to engage me. The jokes arent funny enough and the plot about the obsessed fan isnt really needed and really drags the last third of the family. There are some high spots, including an excellent fight scene and a pretty funny cameo but I found myself bored and not really enjoying the film at the halfway point. Its not crude enough to be a great shock comedy and its too risque to be an enjoyable coming of age comedy and as such falls somewhere uncomfortable between."
    },
    {
      "rating": "4",
      "text": "This movie started out well and was funny initially. It, however , dropped off 3/4 of the way through. Had to wade through the last 20 minutes.Mark Walberg did a fine job of being a bachelor that refuses to grow up with Mila Kunis being his faithful GF trying to make him face a reality of life. Had high hopes for it from the trailers but left disappointed in the result."
    },
    {
      "rating": "1",
      "text": "Was an okay movie I guess,, but yoh... I wish they will stop with all the Je##s and Ch###t swearing, really, you could have made the movie without it, I can't see how swearing like that makes any difference to the story whatsoever, or is that just how everyone speaks nowadays ?"
    },
    {
      "rating": "1",
      "text": "This movie was HORRIBLE.  There is nothing redeeming about it, Ted sounds like Peter of the Family Guy (Macfarlane does the voice) which is irritating enough since the same tripe comes out of the bear's mouth as Peter's.  I have always thought Macfarlane's modus operandi is as much shock as imagination and talent, this movie proves it.  I wasn't offended but insulted that someone would try to pass off something so lazy, and at times mean spirited, as a movie.  I must admit I am scratching my head over critics such as Travers over at Rolling Stone claiming it's gut bustingly funny...it isn't, it's mind bendingly banal punctuated by vulgarity."
    },
    {
      "rating": "10",
      "text": "Ted is every single thing a Family Guy fan wants, and its also for people who don't like Family Guy. So, this movie is about Johnny who wishes his teddy to come to life. And when Teddy comes alive he becomes a international sensation and a best friend to his master, but eventually Teddy grows up and changes happen. Big changes. Johnny meets a girl and hangs with her for 4 years and now she wants marriage and Teddy has to move out. Teddy gets wild with his scrounged life and expects Johhny to join it. But his girlfriend is very serious about family business. And so, this crazy wild romp ride gets in sugarplum in its plot. Ted is the best comedy of 2012 and maybe the best ever made. Why should you watch it? Because its damn funny. I love Ted, it's a new creation that Seth McFarlane has created with a mix of wild condiments and, hey! Mila Kunis! The farty jokes were compelling and funny, the acting was great probably the best of 2012. Ted Is Real."
    },
    {
      "rating": "10",
      "text": "This is literally one of the funniest movies I ever watched. I pissed my pants through the whole movie and laughed so hard that Ted is awesome. Ted is not a disappointing movie nor a ''ok'' movie, its pure awesome and funny. I love the Two main actors Mark and Mila in which also make the movie happen."
    },
    {
      "rating": "10",
      "text": "Brilliant film packed full of huge laughs with a very strong plot and very good characters. The acting is excellent and the end part is the best! Highly recommend!"
    },
    {
      "rating": "10",
      "text": "from the guy who brought us family guy and american dad  . Seth MacFarlane is the adult swim king and this movie brought me laughs and joy . i love Seth's directing and  writing the script . i heard ted  2 is coming soon in 2015 which i will enjoy and willing to see"
    },
    {
      "rating": "10",
      "text": "Creative, great effects and Mark Wahlberg played the perfect 30 something who has never grown up. The humor is cheap and at times gross and plays to the little 14 year old boy in all of us men. I loved this movie and have watched it more than once. FLASH GORDON RULES!!!"
    },
    {
      "rating": "9",
      "text": "Ted is one of the funniest movies I've seen in ages with some of Seth Mcfarlen's best writing. it does what princess diaries did well in making a live action cartoon similar to his family guy and american dad shows and it works in so many ways and it's great to see Mark Wahlberg in a decent movie given his track record in recent memory"
    },
    {
      "rating": "5",
      "text": "Un film moyen avec des personnages plutôt drôles mais ce sont les enchainement de \"gags\" qui sont selon moins en dessous. Dommage. Un film sans plus."
    },
    {
      "rating": "10",
      "text": "I laughed my head off with this film. Seth Macfarlane is a comedic god. No one is funnier than him. I can't wait to watch the sequel. Now, time to go watch some family guy."
    },
    {
      "rating": "8",
      "text": "Ted is a pretty funny movie though it is not as hilarious as people say it is. It is pretty weird how a teddy bear could talk but is also really funny when he starts cussing. The movie had me laugh all the way and the ending got a lot more serious"
    },
    {
      "rating": "10",
      "text": "One of the funniest movies of all  time with an equally amazing sequel. It's humor which is black and dirty might not be appreciated by everyone though!"
    },
    {
      "rating": "8",
      "text": "If you remotely like any of Seth MacFarlane's earlier work then you will love this film. Firstly, I don't think Ted could have been cast any better. Of course they used most of the family guy characters as actors in the film and it works really well, not only is it relate-able it's hilarious. The script is rich in one-liners and hooks that keep the pace of the comedy at a perfect pace that seem to flow effortlessly through a good, solid story line. It's not genre defining, it's generic as hell. But it doesn't matter. It's slathered in enough hilarity that you simply don't care about the story. I don't really have any negative criticism for the film, the only thing I can suggest to anyone thinking about going to watch the film - don't go in expecting anything more than a comedy. It does what it says on the tin and it's hilarious."
    },
    {
      "rating": "5",
      "text": "All I heard from this movie was \"If you love Family Guy you'll love this,\" Family Guy being one of my favorite shows, I thought I would have a riot with Ted... but I was deeply disappointed.  The main problem with Ted is that it recycles a lot of its own jokes and it relies way too heavily on toilet humor.  Seeing hooker excrement just isnt that funny.  The jokes aren't all bad though, there are definitely a few instances of Seth McFarlane's comedic genius with his pop culture references and parodies, but these were too few and too far apart.  Another problem of the movie is its premise of a talking teddy bear..  I was \"on board\" with it at first, but the finale of the movie reversed the mythos and just made it seem silly and not well-thought out at all.  But to the movies strengths;  Mila Kunis and Mark Wahlberg were great together and a lot of the cameos did great.  In the End:  This feels like every other Seth McFarlane project that isn't Family Guy.  It's forgettable and stupid with barely any laughs and you wish you were just watching Family Guy instead."
    },
    {
      "rating": "4",
      "text": "This movie is just an excuse for seth mcfarlane to get an uncensored version of family guy. He brought nothing new to the comedy scene and didn't even make an attempt to change his voice acting from the mainstream family guy stuff, that said this could have been a great movie... if seth mcfarlane hadn't been the voice actor for one of the main characters and if he had tried to bring something new to the table instead of just reusing his same old worn out brand of humor"
    },
    {
      "rating": "5",
      "text": "The first half is hilarious, but the movie quickly tailspins into a cliche Bromance flick in the second half, devoid of any real humor or intrigue. The difference between the two halves magnifies the latter's shortcomings even more. It's a shame, too, as the idea of a magical toy coming to life but never going away had so much more potential this. McFarlane's racist for the sake of being racist jokes (\"look how edgy I am making jokes about Asians butchering chickens and owning gongs!\") are simply stupid and not at all funny, and the fact that you are never for a moment unsure of what's happening next ruins the film's appeal.\r Worth a rental, not worth a $10 theatre ticket."
    },
    {
      "rating": "8",
      "text": "If you enjoy Family Guy, you'll enjoy this movie.  Ted's accent isn't quite Peter Griffin, but it's close.  See how many other Family Guy voice actors you can spot.  Typical MacFarlane humor."
    },
    {
      "rating": "5",
      "text": "This movie is like a family guy movie. The jokes are mostly 80's references or about pop culture,and seth even throws in a few jokes about Jews, Muslims,and Mexicans. The best part about this movie is Mila and Mark since they are the best actors in the movie. A few parts in the movie were funny,but a lot of the jokes were pretty dry and it something that is poorly written. So if you like the way family guy has been going then you'll like this movie. If you are expecting a funny movie that has good jokes them save your money."
    },
    {
      "rating": "6",
      "text": "An average comedy with worn out jokes. If you are a fan of family guy and hoping to enjoy new jokes and an interesting plot don't waste your time. With the price of tickets and the other movies in theaters right now I honestly can't recommend seeing this. You have heard the jokes before and the fact that Ted is a Teddy bear wears off quickly. Ryan Reynolds gave a couple of laughs but that was about the only thing that sent the theater into an uproar. I was expecting better. It wasn't a terrible movie. It was entertaining but I would wait to torrent/rent/Netflix this movie."
    },
    {
      "rating": "8",
      "text": "Seth MacFarlane's big screen debut comes in the form of Ted. As a fan of his work I was definetly looking forward to this. And largely, it's hilarious! Ted is definetly the comedy of the summer, infact very possibly of the year. The film itself begins with a young John Bennett (Mark Wahlberg), a lonely child who upon receiving a teddy bear for his Christmas wishes he could talk. The next morning, John's wish comes true and Ted (Seth MacFarlane) can indeed talk and briefly becomes a celebrity. The film picks up in the modern day where John and Ted are living in Boston. Both, however are still childish, immature and spend most of the time smoking pot! John is also in a four-year relationship with the stunning Lori (Mila Kunis). During their anniversary Lori reveals that she wants more from their relationship but feels they can't move on with Ted around. This tests John's friendship to maximum as he tries to maintain his relationship with Lori and keep his bromance intact with Ted. It results in a fantastically funny comedy. It may seem juvenile but believe me Ted has a lot on offer! Wahlberg and MacFarlane nail the chemistry between their characters as they bounce of each other wonderfully well. Mila Kunis isn't just the eye candy as she fits in perfectly to MacFarlane's witty world of comedy once again. Ted is often hilarious and at times very rated-R, however not all the time, it's largely hit but does have a few misses along the way. What makes the film even more appealing is that at  the heart of it is a tale of friendship, love and loyalty. Definetly the must see comedy of the summer and one that is throughly enjoyable throughout! MacFarlane's debut is hilariously impressive , if slightly drawn out but it all pays off in the end. So much so you may find yourself singing a certain Thunder Song the next time a bit of thunder is on the horizon. Dynamite!"
    },
    {
      "rating": "3",
      "text": "At first I was psyched about \"Ted\" because wow, Seth McFarlane gets to unleash and it's just gotta be great right ?! Not so much. People, this is a RomCom, yep, romantic comedy. And it's totally derivative, you've seen it all before. And a collateral effect is that it comes across as some weird offshoot of \"Family Guy\" because Seth's Ted character sounds like \"Peter\" and he does a \"Stewie\" too, and Mila Kunis is the voice of \"Meg\" so it's just weird. But look, as much as anybody I wanted to like/love this venture, but it's juvenile, disappointing, and done so many times before."
    },
    {
      "rating": "10",
      "text": "Funny as hell    ."
    },
    {
      "rating": "10",
      "text": "Ted is hands-down one of the funniest movies ever made. This is a movie that you would like to see over and over again. The movie contains a little romance, a little action, and alot of comedy. Ted is definitely a must-see"
    },
    {
      "rating": "8",
      "text": "This Movie was hilarious, humor is little inappropriate but thats Seth Macfarlane. If you like Family Guy, you'll love this movie. Similar comedy style and jokes. The story line is a little strange, but makes sense in the end."
    },
    {
      "rating": "8",
      "text": "Ted, is vulgar, dirty, funny, smart and mostly entertaining. How is this not a masterpiece in comedy land. well, towards the end of the film, Ted becomes a little to dull with the jokes, with the extremely loud laughs become chuckles. The 3rd act is a little weak, with the first two acts being wildly entertaining. Overall, Ted has some very laugh-out loud moments that will make you want to cry, and instantly becomes one of the funnier films of 2012. My girlfriend and I had a blast seeing this film, and absolutely enjoyed the film. Ted, is one outrageous comedy."
    },
    {
      "rating": "1",
      "text": "Slams on low wage earning men, while praise's unmarried whor....Only some out of touch rich Hollywood scum could create this this monstrosity. Here's to losing more money in the near future!!!!!"
    },
    {
      "rating": "9",
      "text": "MacFarlane loves to walk the line in his TV shows, and with an R-Rating he could have crossed it in \"Ted.\" But he didn't. He danced around it beautifully, and had the audience in gut-wrenching laughter all the while."
    },
    {
      "rating": "10",
      "text": "What a funny movie it is full of laughs if you enjoy humor and dont mind if the jokes are about sex,drugs and fat kids this movie is for you not for the kids though"
    },
    {
      "rating": "10",
      "text": "I fi had to define this movie in two words, they would be hilariously awesome. Ted was just plain great, great story, great acting, hilarious jokes, and just an overally great feel to the film. Unlike many comedies nowadays this one actually gets you to care for the characters. Ted was just a great film. If you don't enjoy crude humour then you won't enjoy this at all. Every joke involved is crude, from rascist jokes, to smoking and drinking, to fat jokes, to every kind of crudeness you can think of, but what you have to realize though, is its a joke, nothing more, and frankly i found it absolutely hilarious, i was crying because i was laughing so hard. Ted gets a 10/10 for me, if you don't like crude then stay away, if you don't mind crude then you're sure to have a damn good time."
    },
    {
      "rating": "10",
      "text": "ted is by far the funniest movie of all time, you have to get the comedy that Seth McFarlane writes. Anyone that hated this movie needs to develop a dirty sense of humor. This movie was 90% of the time laugh out loud funny. This movie was worth the money and i have new well earned respect for Seth McFarlane. What also is cool about this movie is that every person in this movie has been associated with Seth McFarlane in some way, like in Family Guy, American Dad or any other show he has created, but some are new. This movie will be next to impossible to top. I look forward to another movie from him."
    },
    {
      "rating": "0",
      "text": "This has gotta be the dumbest movie that I have ever seen. The only laughter came within the first five minutes when the little kid that was mugged by the others for being jewish, joined in with them just to deny John Benett a piece of the action, then afterwards, went back to getting his ass kicked. other than that, it was 3rd grade humor, dull, and boring. I couldn't believe the amount of hearty laughter I heard coming form others around me though. Made me wonder if everyone else was given 4-D glasses that made them see something entirely different from what I was watching"
    },
    {
      "rating": "0",
      "text": "This movie made me ashamed to be American.  Our standards for comedy have completely deteriorated.  After seeing The Dictator and now TED, I'm completely convinced that Hollywood will never release another intelligent, funny comedy ever again.  The sad thing is that I was both a fan of Sacha Baron Cohen and Seth MacFarlane, but I have lost respect for both of them.  This was a movie made for complete morons.  How many times can you say d**k and have someone take a sh*t before it's not funny any more?  Has every great comedic writer completely run out of ideas?  It's absolutely pathetic.  I could not believe that everyone in the theater was laughing at the worst writing and acting I've ever seen.  The biggest problem was that the movie was BORING.  If you're gonna make a movie about a teddy bear, could you at least not bore me to tears?  When that chase scene started and they started sewing up the bear enough was enough.  I'm not prude or lacking in the humor department at all, but I just think it's really sad what comedy has turned into.  I miss comedies that had the ability to make me laugh without saying \"s**k my d**k\" 800 times.  There used to be real humor with real thought behind it, it wasn't so cheap and void of any class or wit.  Now all you need is someone to take a dump, a famous actor to say \"s**k my d**k\", and a few offensive, unoriginal jokes about homosexuals/Jews/Mexicans/Asians and you've got yourself a golden ticket.   People, come on!!!!  We deserve more!!!!  Is there anyone out there????  Please tell me I'm not the only one who felt this way!"
    },
    {
      "rating": "0",
      "text": "I have to agree with Penguin Music-standards for comedy are pathetic. I think people are saying they like it almost because they feel they are expected to laugh. The only two movies I ever walked out on were both with Sacha Baron Cohen, both tasteless, actually quite nauseating. Sadly, besides wasting their own time and money, parents thinking how bad can a movie about a teddy bear be are ignoring the r rating and teaching them that their favorite teddy bear is fine with marijuana, other drugs in the marijuana, heroin, beer, shots, driving under the influence, lude and crude behavior and language."
    },
    {
      "rating": "2",
      "text": "Ted was terrible. At a certain point in the movie (maybe 30 mins in) I realized this is as good as it gets. It's funny how MacFarlane makes fun of Adam Sandler for being terrible (which I agree btw) but this movie was probably just as bad. It featured bizarre celebrity cameos, it had crude and racist jokes, and even had a homosexual scene or two just like a lousy Sandler movie. I think what makes Family Guy/American Dad so funny is the combination of characters which this movie lacked. I'm not saying it was suppose to be Family Guy movie but  it turned out to be a rated R version of the show minus the talking baby, the picked on sister, the funny dad, etc. It's annoying too because Ted sounds like a mix between Peter and Brain (trying to do a Boston accent). Stupid gag humor that I expected more of from MacFarlane. Don't waste ur money at the movies an unfortunate mistake I made."
    },
    {
      "rating": "10",
      "text": "Mark Wahlberg, Mila Kunis and Seth Mcfarlane, great combination    ."
    }
  ],
  "recommendations": [
    "step_brothers",
    "grown_ups",
    "ted_2",
    "jackass_presents_bad_grandpa",
    "neighbors",
    "knocked_up",
    "the_hangover",
    "dinner_for_schmucks",
    "hot_tub_time_machine",
    "old_school",
    "this_is_the_end",
    "yes_man",
    "neighbors_2_sorority_rising",
    "superbad",
    "masterminds",
    "night_at_the_museum",
    "jexi",
    "the_change_up",
    "a_million_ways_to_die_in_the_west",
    "good_luck_chuck",
    "zoolander",
    "dodgeball_a_true_underdog_story",
    "the_dictator",
    "little_fockers",
    "30_minutes_or_less"
  ]
}