{"id": 260, "title": "Ted 2", "starring": ["Mark Wahlberg", "Seth MacFarlane"], "runtime": 115, "genre": ["Comedy", "Fantasy"], "description": "Newlywed couple Ted and Tami-Lynn want to have a baby, but in order to qualify to be a parent, Ted will have to prove he's a person in a court of law.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/220fvwTHqV7nNpRpZItmbVCHLjC.jpg", "categories": {"plot": 6.2592592592592595, "acting": 7.3076923076923075, "ending": 5.888888888888889, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 5.815217391304348, "action": 5.333333333333333}, "reviews": [{"rating": "5", "text": "It's moderately funny (one scene where John and Ted yelled off-color suggestions at an improv group had me in tears), but it's also horribly paced. This thing drags, and by the final 20 minutes I was getting anxious for it to be over. There's not a review in the world that will change your mind on whether or not you were going to see this, but if you do go see TED 2, just know what you're walking into: a lazily constructed film with some laughs. Nothing more, nothing less."}, {"rating": "3", "text": "It feels like I am watching \"Family Guy\", on steroids. Don't get me wrong, I like Family Guy. But watching a whole movie based on Family Guy jokes is just too much to digest. It's tiresome at times and jokes are not that funny at all."}, {"rating": "6", "text": "\"Ted 2\" definitely has the 'Family Guy'-esque humor and charm Seth McFarlane offers; however, the movie is really a solid carbon copy of the original movie \"Ted\" and to be honest, once of Seth McFarlane is enough."}, {"rating": "5", "text": "Ted 2 has the quality of current Family Guy episodes. The film lacks any heartwarming story and interesting relationships with most of the entertainment coming from the random scenes and cutaway gags that have little to do with the story. From a logical standpoint this film is nothing lacking any direction or heart as opposed to the first one and people who hate this trend on Family Guy will likely be turned off by the film. Looking at the film from that perspective would’ve earned this film a 4. Movies aren’t just looked at through some cold mechanical process and given objective scores movies reviews are also based on emotion. Everything wrong with this movie made it entertaining. The laughter not only came from the absurd cutaway gags but how nuts Seth McFarlene went with this movie creating what will probably be for me this year’s guilty pleasure. It was horribly made but unlike Hot Tub Time Machine 2 it was laughably bad and there are some people who enjoy McFarlene’s style such as the group of teenage boys sitting next to me and my Father who I saw the film with."}, {"rating": "3", "text": "There are good movies...there are bad movies...and there are dull movies that offer a few laughs here and there to keep you from walking out...but basically disappointing.\r Ted 2 is that kind of movie.\r The first one was full of surprises.  Laugh a minute.\r This is a dull rehash of the characters. Over 1/2 the movie is spent trying to be straight and serious when it should have retained it's raunchy ride.\r Maybe 5 big laughs.  They were big.  But not the dozens like the first movie.\r Weak.  Ineffectual. Dull. Stupid without relief."}, {"rating": "3", "text": "Humor wise, it worked the first film, but now the comedy is totally hit and miss. I was able to slightly chuckle at most of  Ted's jokes, but they were not enough to hold the film up overall. To be honest Seth McFarland's jokes as spoken by Ted are not the best, now they were funny to an extent, but it seems like jokes you would find from an new episode of Family Guy, understandable but not that funny or memorable."}, {"rating": "9", "text": "Watching Ted 2 shows that it way beyond the point of no return in becoming a film that makes any sense, is that a bad thing? Absolutely not, besides that's what makes it different. But Ted 2, Directed by Seth MacFarlane, Starring Mark Wahlberg, Seth MacFarlane, Amanda Seyfried, Giovanni Ribisi, and Morgan Freeman. In my opinion, what makes this film great is the performances of the cast, the unbelievably random ass humor, and the fact that it is a worthy sequel to the first film. Now, I could not stop laughing while watching Ted 2, there would always be a joke hiding somewhere, and when you least expect it, that joke comes out and it is so random that it would trigger another joke, and then another joke, and so on and so forth. The film also had a very good running joke that I didn't even expect the first time, it was when any of the characters would use their phone or a computer to search something up it would show, \"Did you mean Black Cocks?\", and every time that happened I burst into laughter. The performances of the cast was great, even the cameos were random, I mean we got Liam Neeson buying a box of Trix and asking Ted if it was weird that he was buying cereal meant for kids, David Hasselhoff crying on stage while talking about Knight Rider, Tom Brady freaking out after Johnny and Ted were in his house to jack him off for is sperm, Jay Leno being a gay guy who has sex in a bathroom in bar when everyone finds out that he had been doing just that, and so many others. The structure of the film was no different to the first film but it did improve. I am definitely looking forward to what Seth Macfarlane has in store for television, and movie goers next, cause Ted 2 will be pretty hard to beat because it is one of the best comedy films in 2015."}, {"rating": "3", "text": "I LOVED the first movie, but Ted 2 is worse than the Dumb and Dumber sequel. I didn't even think that was possible...\r It was horribly paced, reused old jokes in a bad way, wasted time with a flashy dance number intro and then a horribly lip-synced guitar sing-along. Granted, there WERE funny moments, but not enough to warrant sitting through it in the theater.\r Wait for a rental..."}, {"rating": "4", "text": "Ted,” the dirty-talking-teddy-bear hit of 2012, was packed with a sufficient number of outrageous belly laughs that it was easy to let pass the fact that there wasn’t much of a movie underneath those laughs. Or, as I put it when I reviewed the first picture for another website, with such enthusiasm that I actually gave it three-and-a-half stars (I’d adjust that to an even three if I could turn back time), “it really is not quite so different than that of a standard romantic comedy in which a stand-up but somewhat immature guy has to fight off his lesser angels, largely embodied in a slackerish best-friend character, so as to become The Man (and Husband) he was Meant To Be.” “Man” being Mark Wahlberg’s John; “slackerish best friend” being the dirty-talking teddy bear, Ted, and eventual bride of man being Mila Kunis, who as it turned out showed plenty of good sense in not coming back for the sequel.\r With John now divorced and porn-addicted, it’s up to exceptionally vulgar Ted to take up the storyline slack. “Ted 2” begins with the bear, who could use a wash beyond soaping up his mouth, marrying former-good-time hottie Tami-Lynn at a wedding officiated by Sam Jones of “Flash Gordon” fame. (There’s a lot of recycling from the first film here.) Soon their domestic bliss goes south, and the couple enact a quasi-parody of the “Raging Bull” “you bother me about a steak” scene, which is rather queasily unfunny because the De Niro part is being played by a stuffed teddy bear rather than in spite of it.\r Aside from race jokes, “Ted 2” offers a nearly staggering number of weed jokes, a couple of which are mildly funny, or at least funnier than the rape jokes. Then there are the gay panic jokes, the racial gay panic jokes, the celebrity cameo jokes, and long stretches of no jokes, oddly enough, stretches in which the creepy kidnapping subplot of the first film is recycled, and works much less well than it did in the first film, where it didn’t quite work but, you know, the jokes were funnier. And so it goes.\r While the first film offered, by my casual recollection, almost two dozen belly laughs, this one barely registers four. The mean spiritedness oozes beyond the racial stuff and reaches fuller flower at the movie’s climax, which is set at a comic geek convention, and yes, consider the possibilities. All aspiration to actual humor is set aside in favor of a hammering insistence on the sub-human qualities of fanboys, cosplayers and so on. It starts to get numbing after a while. Acridness combined with ineffective humor is a bad mix, and whatever goodwill the movie scored based on sentimental value or the few effective jokes in the front end is entirely spent by the end credits. I suspect it’s going to be quite a while before we see a “Ted 3.”"}, {"rating": "10", "text": "Excellent movie just in a sequel please use less sexual content and references.\rI don't have to write any more comments the movie was perfect I saw it in the Village Cinemas @ The Mall!"}, {"rating": "5", "text": "if you have seen the first one that should be enough, the first one was much better and this one couldn't seem to go in a new direction basically almost copied the original, i would recommend wait until it is released or wait for it on tv"}, {"rating": "10", "text": "This movie has no limits with its jokes. Its jokes are nasty, sexists, misogynistic, imposingly gay friendly but yet makes you laugh without offending these category of people. I could not stop laughing since the movie started and I kept laughing even after the movie finished."}, {"rating": "7", "text": "There is no reason for this film to get hate, it has so many funny moments and it delivers. I had such a fun time at the movies, I always have been a big Seth MacFarlane fan."}, {"rating": "6", "text": "Not nearly funny as the first. There is still lots of laugh out loud moments in this movie but not nearly enough to make it a classic comedy movie. You will laugh in this movie but there are many time throughout that there aren't any jokes happening and the storyline is just lacking. This makes some parts of the movie boring. There is also a lot of predictable scenes that you can see coming from a mile away which takes out from thee overall enjoyment of this movie."}, {"rating": "6", "text": "The only real problem with the film is that it's 20 - 30 minutes too long.  It's more endearing than the first, and it made me laugh out loud on several occasions.  Absolutely worth seeing during this rough time of year for movies."}, {"rating": "4", "text": "Thunder buddies for life.\r The story is about Ted and Tami-Lynn are married and the next step is having a baby but Ted can't be legally regarded as a parent unless he can prove his is \"human\" in a court of law.\r Now looking back on the first Ted movie I got say I changed my mind on it a bit and what I mean is that it wasn't as great as I remembered it to be, but I still think it's decent enough to give it a pass as a comedy and a film. But then I heard news about a squeal in the works and then I heard that Amanda Seyfried, Morgan Freeman and Liam Neeson was in the film and that alone give me a little interest in the movie just by that movie news. I wasn't jumping for excitement for this movie as I the movie didn't look anything special, just squeal bait.\r Now after seeing Ted 2 I'm not very impressed of what I watched, actually this movie is pretty bloated for it's own good.\r What I liked in the first Ted movie is the chemistry between Mark Wahlberg and the character Ted. They back and forward humor really worked if you would believe it, I mean a pot smoking talking teddy bear hanging around with Elliot Moore from The Happening would actually work is just beyond this world. And here they chemistry is still good just like in the first movie.\r The movie did make me laugh a couple of times as that's mainly Wahlberg and Seth chemistry in the movie and some other stuff that's only a small little nod to a film or TV and it was funny at first until late on where they stretched out the joke to the point were it got really old and really stale very fast. But I do think this movie is way better then Seth MacFarlane last movie A Million Way to Die in the West as that movie didn't even try and was pretty forgettable, I mean it's been a year since that movie came out and I forgotten pretty much all of it.\r What really surprise me is how messy the movie is and the movie doesn't know what it wants to be, because these three different things going on in this movie like Ted is trying to prove that he's a human because him and he's wife want a baby but Ted needs to prove he's human so he can be legally parent (Yeah I know it doesn't make any sense, just go for it for now) oh and these a road trip in the movie and remember that stalker in the first Ted movie that kidnapped Ted well he's back in this movie. That's the whole movie of Ted 2 for you. Oh one last thing, Ted 2 is kind of the same as the first, I wish I can go into details of that but that would be spoiling it for some people who may have interest of seeing this movie and I'm being nice here and won't be spoiling anything.\r Before seeing this movie I thought that Amanda Seyfried wasn't going to do anything great, I thought that she was just filling it in for the money, but I got to say that she was pretty good in the movie. She actually did something with the story and didn't feel like a background character. She was Wahlberg worked really well with each other and Ted as well. Same thing with Morgan Freeman.\r Overall Ted 2 isn't all that great to me. As I said before about a billion of times by now you may disagree and like the movie and completely overall on what I said, again that's fine that's cool, enjoy what you enjoy, but I'm sticking what I put down and it won't change anytime soon."}, {"rating": "4", "text": "The story is no where near as good as the original, It definitely drags on a lot and doesn't have much in terms of content. The trailer spoiled a lot of the film's funny moments. I had no real burst out laughing moment, aside from a small chuckle or two, until the scene with the improve group, That was really the only real funny scene of the film. Even a 1/3 of the way into I couldn't wait for it to end. It simply doesn't live up even slightly to the first film. I really hope they let it die and don't make a third."}, {"rating": "6", "text": "Unoriginal story telling and mediocre comedy, ted 2 is nothing but a rehash of the previous title that uses the same formula that generally everyone is tired of. Ted 2 struggles to entertain even the basic audience for the lengthy screening."}, {"rating": "1", "text": "In this second coming of Ted, he can’t, cause he’s built like a Ken-doll- but - hey\rthat doesn’t stop him from a little beastility. Seth Macfarland plays to the teenage boy under the covers\rwith a flashlight skipping to the dirty parts of Tropic of Cancer- but that only lasts twenty minutes- not two hours. And John is back as his pot clouded bff - the jerk. No really now he’s either\rthe jerk off-er or the jerk-ee in an attempt to save Ted’s marriage with a child.\rIn a desperate effort to drum up box office Walhberg was cruder than the movie on his publicity tour.\rHe told daytime audiences of the View he kept his infamous penis in a safe. Then dropped f-bombs on the Tonight Show that mortified Fallon. But we understand. I mean Entourage was only a few weeks ago."}, {"rating": "1", "text": "Seven letters - P.A.I.N.F.U.L. Are we sure that a homonal teenage boy didn't write this movie?  There were a (very) few truly funny moments but to turn this into a touchy feely civil rights movie - give me a break.  This one actualy hurt."}, {"rating": "6", "text": "Ted 2 follows the same structure as the first movie, it basically starts of all nice and happy to later become more tense, most of it is very predictable which ends up diminishing the joy of watching it, though it has it´s glimpses of really funny comedy Ted 2 bores us with childish and easy humor, it´s over-focus on drug jokes and sort doesn´t feel very comfortable.\rOverall Ted 2 actually surprised me, being a little bit better of what I was expecting. It´s a watchable movie, the acting is good and you can certainly have fun watching it though it fails to deliver a worthy sequel."}, {"rating": "0", "text": "even if the first ted was a 5/10 (which would be giving it more credit that it deserved) then this monstrosity of a movie is a negative 10. I couldn't take more than 12 minutes before I left the theater and got my money back. Seth Macfarland is satan reincarnated."}, {"rating": "9", "text": "I just returned from the theater and I have not been in a theater and laughed so much with other people since the first Ted. This movie is great! as a comedy sequel and on its own! I had such a fun time watching this! seriously it's great! Seth is a comedic genius, I am a huge fan of his. One of the funniest and talented person out there. If you want a fun experience I urge you to watch Ted 2."}, {"rating": "6", "text": "If you enjoy seth macfarlanes films by all means go and watch it. do not expect a lot though. Ted 2 is basically the reason why people hate sequels. I was really excited for it but in the end I left with one thought \"meh\" . And well yeah hopefully they will stop making sequels to comedies. Ted 2 has its Seth humor but just like hangover 2 it actually really started to feel like the exact same movie as the first as it neared to the end. It felt like they really were running out of ideas. But anyway it's better that terminator by far."}, {"rating": "1", "text": "Seth MacFarlane should be embarrassed by this train wreck. It's a cross between a live-action Family Guy episode and any movie starring Jennifer Garner. Terrible. Give it six months before it's on TBS every weekend to see this Garbage."}, {"rating": "10", "text": "Anyone who says this movie is terrible is a real stupid beach. Let me tell you, people hate this movie for one reason and one reason only; it has somehow become considered socially cool to hate on seth macfarlane.\r I mean, it's not like most people go walking into Ted 2, unaware of the first film, or expecting something different. I pray to Satan, please let lighting come and strike down the haters."}, {"rating": "10", "text": "This film was very fun to watch. It built upon the question I had about the first film, \"How can a teddy bear get married?\"\rUsually, I don't like films like these. Movies with sex, drugs and swearing don't appeal to me a great deal. Borat, for example, absolutely disgusted me. I did, however, like the first film. I found it original and hilarious.\rThis film has improved it in every way.\r Aside from a few... odd scenes every now and then, Ted 2 was a very, very good film. As a fairly innocent minded person, occasionally I struggled to figure out what was going on, but towards the end of the film - the humour softened a little from lots of sex things to actual genuine hilarity. The second part of the film is easily better than the first. Ted 2 is a must-watch for fans of the first film."}, {"rating": "2", "text": "It seems as though the writers are completely out of touch. The gags were old and played out. It felt like watching 100 straight hours of family guy. That is, the longer you watch the more you see through the movie's randomness and realize there is no real humor, no irony, no scope, no originality. The whole thing feels lazy. Its self-righteousness also detracts from the attempted humor and makes you wonder if they were trying to be serious or funny, because they failed to be either."}, {"rating": "8", "text": "Ted 2 was much funnier than i expected it to be and had several moments that made me laugh it's not as funny as the original but it's certainly not as bad as many of the critics have made it out to be. Mark Walhberg and Seth McFalren have excellent on screen chemistry still and many of the other cast members really have a good material to work with. not all the gags hit and some have the tendency to repeat once too often as well as seeming like rejected family guy cutaways. but if you want a film that will make you laugh and you liked the original this will work for you"}, {"rating": "6", "text": "Seth MacFarlene continues to tell a formulaic story maintaining the offensive, disgusting and ridiculous style of fun from the first Ted but choosing to legalise Ted as the main plot has drastically reduced the opportunity to present more jokes in a creative way, causing the film turns out to be slightly long and less funny. However, the story progresses in an organised structure, allowing plenty characters development with some surprise cameos appearance - Liam Neeson, Jimmy Kimmel and Morgan Freeman. The expression and movement of CGI-created Ted is still perfectly crafted just like he is truly exist as in first film, the chemistry between Wahlberg and Ted is still strong but the romance in between other characters is rather weak, the performance of all the main casts are good even the new comer Amanda Seyfried just fits well as part of the film. Without much difference from its predecessor, the sequel might not offer any fresh theme but its lightheartedly fun and surprisingly emotional ending is still worth to enjoy at the big screens."}, {"rating": "5", "text": "Ted 2 is funny at times, but there's not enough humor to compensate for the numerous flaws of the movie. If you liked the first Ted, you'll definitely laugh at this film a few times, but the movie has far too many jokes that fail, for long stretches. Many of the jokes that fail are reiterated multiple times, and some of the other jokes are just plain not funny. Another aspect is that so much of Ted 2 is spent either talking about or copying other movies that very little of it is actually original. It goes without saying, the film's not very intelligent, despite it's moments, and that illustrates the most obvious flaw of this film. The film is tonally and narratively erratic, one moment the film's silly, the next it's really dark, and the plot runs like an extended episode of family guy. So in essence the film is funny, but only for spurts and during the spurts when the film's not funny, the film is all over the place."}, {"rating": "10", "text": "I personally believe that the critics (of whom gave Ted 2 a negative score) are very wrong. I thoroughly enjoyed the movie and would even go as far to say that it was better than the first. Firstly, the casting was absolutely excellent. The instrinsic brother-like chemistry between John and Ted still exists strongly, while Amanda Seyfried was a wonderful addition to the cast, with her character really adding to the charm, hilarity, and, once again, chemistry of the characters. There was not a moment where I found myself bored, or uninterested. There was constantly something going on that kept me eagerly watching! I laughed a lot, I felt upset, and I felt excited. I felt an array of emotions. Any movie that does this simply could not sieze to be good! The plot was very meaningful, involving the pursuit of Ted's human rights - something we can relate to our world. This movie makes you feel good and does not stop at any length to entertain you. Nothing was dragged out too long, no part of the movie felt unnecessary or stupid and none of it was overly predictable.\r Go and watch this movie if you enjoyed the last one. You'll be impressed. Haven't watched Ted before? That doesn't matter - you can jump right into it without any problems. This is a movie that has got the balance right with every element; it is one of the best movies I've seen in a while!"}, {"rating": "0", "text": "Why do you people keep watching Macfarlane's junk. He used up all his jokes 10 years ago. He only had a handful to begin with, and now he fills in the gaps with vague threats and gets away with anything by saying \"I did it on purpose b-cuz I'm a genius.\" He only gets fans by over-powering / traumatizing the weak-willed. Fearful, self-denigrating people who need a parent-figure to tell them what to do and what to think, and to chastise them when they're naughty"}, {"rating": "8", "text": "Ted 2 is hilarious with a cast that has extremely great chemistry and gags that are crude but are gut bustlingly funny my only issues are the ending is very convoluted and 3 jokes in the film were from family guy."}, {"rating": "10", "text": "Its ted 2.0 same as the first movie (not like thats a bad thing) has a few down parts for story building other than that super funny. If your a fam guy/ mcfarlene fan its a must see"}, {"rating": "6", "text": "This sequel starts with the talking teddy getting married and his best friend (Mark Wahlberg) down in the dumps. When they're riffing thru their irreverent gags (bodily functions, racial and sexual jibes, liberal four-letters), it's plenty funny. Unfortunately, the plot revolves around Ted's fight to be legally recognized as a human, which pulls things in a more serious and less amusing direction. There's still a cheeky energy throughout, but fewer of the jokes are original and land a laff. NOTE: Stay thru the credits to see the outcome of an earlier cameo."}, {"rating": "6", "text": "Ted 2 is better than Ted 1. This movie uses more situational approaches to comedy and far less 1 liners than the prior. However it still relies far too heavily on sex and drug jokes which makes it low brow at best. I still laughed, don't get me wrong, but you feel kinda bad laughing because it's just \"wrong\" I guess. Comedies in the past just didn't have to rely on those types of jokes for humor. The saving grace was, believe it or not, the story which had some funny aspects and was much better than the first. The movie though was too long at 2 hrs run time."}, {"rating": "6", "text": "Ted 2 doesn't match the quality or story of the original, some older jokes are overused, and the cameos are overused, but Ted 2 still had enough jokes to make me laugh. John and Ted's chemistry is fantastic and Amanda Seyfried's Sam is okay, but not as good as Mila Kunis' Lori. Ted 2 is a fine comedy, much better than A Million Ways to Die in the West, but worse than the original Ted."}, {"rating": "4", "text": "Seth MacFarlane movies. Love them or hate them. Ted 2 sort of comes in the middle. Yes, it was packed with laughs and it was certainly a good time, but when you look at it from a MOVIE standpoint, MacFarlane's nuts comedy turns sour. Say what you want about A Million Ways To Die In The West, but I thought that it was innovative and funny, but not a good movie. Same happens with Ted 2, the highly awaited sequel to the monstrous 2012 blockbuster comedy. Also, Seth MacFarlane's sweet tooth for misplaced musical numbers makes its way to the final finished movie. I really think that MacFarlane's team could have spent more time with Ted 2, to make it even better than its predecessor. Well, too bad. Copied spoofs for Family Guy, tiring cameos and horrible pacing are just some of the problems with this movie. Ted 2 is more of the same, which is good for some movies, but I think that we wanted something fresh and new rather than a flimsy cast with a few adjustments and a wafer thin script. But, the chemistry between Johnny and Ted is electrifying. And, Amanda Seyfried is decent too. But, Marky Mark is TOTTALY lifeless. Overall, Ted 2 is popcorn entertainment for the people who just want a good laugh, other than that it is a painfully mediocre sequel to a movie that mesmerized me."}, {"rating": "8", "text": "It's not structured like most movies; it seems to have several climaxes and tapering off periods.  But still a very enjoyable movie.  Not sure why critics were so hard on it.  It's definitely the funniest movie I've seen this year.  Better than the first one.\r Not once did I find the pace too slow as others have said.  Having a good pace doesn't mean that the whole movie should be a headlong rush.  You need to sprinkle in some down time.  And that's what they do.\r Also, for once, the cameos in this movie were spot on!"}, {"rating": "6", "text": "Let’s preface this review by saying that if you’re not a fan of Seth MacFarlane’s irreverent and sometimes puerile comedy then please stay away from this film, it’s unapologetic nature may be repetitive and offensive for those with a sensitive disposition and it’s just not for you.\r In this somewhat rare instance we’re happy to defy the critical consensus and declare that ‘Ted 2′ is equal if not superior to the original and a couple of hours of outrageous fun, particularly if like us you’re prone to thinking in Film and pop-culture references.\r Sure the novelty of a potty-mouthed, working-class talking Boston teddy bear is lost in a sequel… and yes the plot is a bit fanciful, plus the tone of the film fluctuates constantly with slower scenes that are brief attempts at emotional content.\r But the bubble of pomposity and sentimentality is quickly burst by a combination of physical comedy, Movie references and outrageous sociocultural humour, plus a lot of swearing of course and if you’re uncomfortable with Ted’s plight being likened to America’s history of slavery and civil rights struggles, that’s the point!\r MacFarlane’s voice and comic sensibilities are of course the star of the show but Mark Wahlberg holds his own and Amanda Seyfried slots into the dynamic seamlessly while seeming to revel in it.\r The Bottom Line…\rWhile no comedy classic and lacking in real depth, ‘Ted 2′ is an undeniably funny film and does a good job of capturing Seth MacFarlane’s brand of hilariously inappropriate and culturally perceptive comedy, prepare to be offended but don’t worry, it’s an offence that shouldn’t cut deep."}, {"rating": "8", "text": "This movie is pretty funny. Not awesome or better than the original, just okay. There are some really funny parts, but most of them were in the red band trailer. It was very slow paced, and at the end, I just wanted to leave the theater."}, {"rating": "10", "text": "Critics, open your eyes. This movie is more hilarious than the first one. It had more funny moments and well, there were some emotional moments. If you guys haven't seen it yet, you totally should see it. =)"}, {"rating": "8", "text": "If you a a generation X, nerd with a comic book / sci fi streak, your gonna appreciate some of the jokes more than others.  It's not the best movie for pace and cinematic excellence, and the many of the critics have panned it for its lack of class.\r But a big F.U. to the critics! If MacFarlane can make a sequel that is just as humorous as the original, make a load of cash and annoy the crap out of some snot nosed, holier-than-thou hollywood pen pushers then good on him.\r If your girlfriend appreciates a good dick joke, take her along too."}, {"rating": "10", "text": "An equally joyous romp to the original, the directors/animators took the humor to a whole new level by delivering Ted's wordless responses in perfect facial expression form. Laughed until I couldn't breathe several times."}, {"rating": "8", "text": "Personally, I enjoyed Ted 2 more than the first film. The plot is better and so are the jokes. Amanda Seyfried's character is also more conclusive to the plot in comparison to Mila Kunis in the first film.\r To make things short, if you are into 'Family guy'/ Seth MacFarlane humour you will love this since Ted 2 has all the comic elements of MacFarlane's works in it. If not, it might still be an enjoyable experience, though a black sense of humour is recommended."}, {"rating": "10", "text": "This was the funniest movie I have seen in a very long time. I laughed so hard in the theater I thought I was gonna fall out of the seat. Best comedy of the year by far and I have seen all the big one's. Funnier than Spy or anything else. If you want to have a great time go see this movie"}, {"rating": "8", "text": "Ted 2 isn't as bad as everyone says it is. I thought it was hilarious and much funnier than the first one. It kept me entertained and although some parts were boring, overall I really liked it."}, {"rating": "8", "text": "Maybe not quite as funny as the first one, but still pretty funny.  I love Seth's sense of humor.  If you love Family Guy or saw Ted and laugh at his sense of humor, you'll love Ted 2."}, {"rating": "2", "text": "Wow, well that was truly disappointing. First of all I want to mention that I have watched the extended cut which adds around 10 minutes more of tediousness (no pun intended), and I honestly would have picked the shorter version had I known how bad and boring this movie is.\rTo be honest, one could tell that the ride is not going to be a fun one after having to endure the opening credits dance sequence which is strikingly reminiscent of that of the Family Guy, only it is almost 3 minutes long. Clocking at around two hours, the extended Ted 2 is full of exhausting moralizing cliché talks about how the legal system is supposed to treat everyone equally, \"protagonists going somewhere\" montages (and some other montages, like \"protagonists prepare for a court hearing\"), unmemorable dialogues, unfunny pot jokes, more unfunny jokes unrelated to pot (an added bonus is Mark Wahlberg covered in fake semen. At least I think that it's fake. Maybe.) and occasionally, about once in 40 minutes, gags that actually provoke some laughter. And those gags are not nearly hilarious enough to justify sitting through all the monotony in between.\rI truly liked the first Ted. I found \"A million ways to die in the west\" to be inferior, but still enjoyable. This one, however, dropped the bar so low you can see the rock bottom from here, gotta hope that the trend with Seth MacFarlane's movies' quality turns around. The last line of Ted 2 is \"hashtag Sh*t Happens\". That is quite ironic, as it is a fairly accurate description of this movie's creation."}], "recommendations": ["this_is_the_end", "jackass_presents_bad_grandpa", "anchorman_2_the_legend_continues", "a_million_ways_to_die_in_the_west", "the_hangover_part_ii", "dinner_for_schmucks", "jexi", "the_hangover", "30_minutes_or_less", "ted", "identity_thief", "neighbors_2_sorority_rising", "neighbors", "the_dictator", "the_happytime_murders", "hot_tub_time_machine", "step_brothers", "knocked_up", "little_fockers", "rough_night", "22_jump_street", "the_hangover_part_iii", "deadpool_2", "the_watch", "the_wedding_ringer"]}