{
  "id": 287,
  "title": "Teenage Mutant Ninja Turtles",
  "starring": [
    "Megan Fox",
    "Will Arnett"
  ],
  "runtime": 101,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "When a kingpin threatens New York City, a group of mutated turtle warriors must emerge from the shadows to protect their home.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/azL2ThbJMIkts3ZMt3j1YgBUeDB.jpg",
  "categories": {
    "plot": 3.6792452830188678,
    "acting": 3.625,
    "ending": 3.0833333333333335,
    "soundtrack": 4.0,
    "cinematography": 0.6666666666666666,
    "familyFriendly": 2.3,
    "funny": 5.538461538461538,
    "action": 4.083333333333333
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Ultimately it’s just kind of… there. It’s bland. Most of the things that make the TMNT franchise feel special have been sanded off to make a very generic modern superhero movie, but one that does almost everything worse than the rest do. There’s a brief action scene that’s sort of like a key early sequence in Batman Begins, just… worse. The origin backstory for the Turtles and Splinter and the entire climax scene are photocopies of The Amazing Spider-Man, just… worse. They add nothing to what came before. None of it’s memorable. It’s just there.\rIf I can give some praise, I’ll give it to Noel Fisher. He’s a good Michelangelo. The few times I found myself smiling, it was because of his performance. Easily the high point.\rThe script is awful. Nothing makes a bit of sense. Eric Sacks’ evil master plan is to pump the city full of deadly gas and use the curative properties of the mutagen (a shoehorned-in aspect of the IDW comic series that’s just kinda… there, overcomplicating things for no specific reason) to play the “saviour” and cure everyone, and also receive a big government payday. He’s doing it to get rich, even though he’s clearly already crazy rich, with a palatial mountain estate and his own corporate tower in Manhattan. He has no additional motivation. And his actual plan is laughably stupid - he has the Shredder pump the bright red poison gas out from the top of his tower in the city… which would be immediately noticed by absolutely everyone and reveal that he was behind it all along. How does this plan end with anything but him in a prison cell?\rThe Shredder himself? He doesn’t need to be in this movie. He serves no purpose. He’s just there to fight Splinter and the Turtles, nothing more. He has no motivation and no character. And even then, he’s almost comically bad at being the big bad villain - he just leaves characters “for dead” twice, who of course turn out to be alive, for no good reason at all. Just, welp, I’m leaving now because whatever. Just to give the movie some cheap drama.\rThis movie doesn’t really have much of a plot to speak of. I think it might have more plot holes than actual plot. Plot holes you could drive a Turtle Van through. (Hey, how’s that for a DVD pull quote?)\rIt also doesn’t have any real characters; they’re all pretty broad, basic archetypes at best. There’s no real character development or “arc” for anyone. They try to shoehorn one in for Raphael at the end, but the only setup is a very brief scene early on where he threatens to abandon his family. Not much more comes of it, and his big “emotional breakthrough” falls totally flat. They’re trying to have a big character moment without doing the work to set it up.\rIn fact, there are a number of attempts at “serious”/emotional scenes that were completely laughable. There was nothing to sell them. They weren’t earned and fell flat. The movie does almost nothing to make you care about these characters - it’s assuming you already do, and that makes it fail on the most basic story level.\rThe mo-cap technology used is impressive on a technical level, but the directing make it impossible to believe they’re “real”. Part of that is because all of the shots with no humans in them (and there are a bunch) are in full CGI, and there’s no “real camera” to speak of. The way the digital camera zooms in and flies around looks incredibly fake and downright physically impossible, which makes all of those scenes feel like a cartoon or a video game. It doesn’t match up with the “real” footage at all, so it’s a really jarring, distracting fit that highlights how unreal the Turtles are. In a movie like this, it was the worst possible choice they could have made.\rThe action sequences are obnoxious. In fact, the entire movie seems to be directed by a 12-year-old with ADHD. The camera is constantly swooping in and out and tilting into dutch angles and spinning around and shaking with no rhyme or reason. There’s a scene where some random schlub answering a phone gets a dramatic camera swoop. It’s insane. There are no real storytelling skills on display here; it’s just trying to be as busy as possible so you won’t notice. At times it’s downright incomprehensible.\rThere’s really not that much more to say about it. It’s a bad movie. It’s pretty forgettable. You can barely even call it a movie, or a story, at all. It’s a bunch of mediocre video-game cut scenes  sloppily cut together as a movie. But worst of all, it doesn’t do anything to stand out from the most generic superhero-style action movies out there. And for a TMNT movie, that’s probably the worst thing that can be said about it.\rAnd that’s the thing… none of my main criticisms have anything to do with the changes to the Turtles’ designs, or the changes to the backstory, or Megan Fox, or any of the  other reasons that have set the fanbase on edge. It’s all to do with this being a poorly-written, poorly-made movie on its own merits. There’s nothing worthwhile about it."
    },
    {
      "rating": "0",
      "text": "This is a complete bastardization of a beloved childhood franchise, in fact it's Transformers 5, but instead of robots you have turtles.  If you must go to a movie, see Guardians of the Galaxy instead.\r If you want to see new TMNT, tune into Nickelodeon for the new cartoon.  Where this movie is bland and an obvious cash grab, the new cartoon is charming with awesome nods to the series from the 80's and 90's.  The only way we can stop the destruction of the things we loved from childhood is to stop funneling money into projects like this by seeing them."
    },
    {
      "rating": "0",
      "text": "Megan Fox is the protagonist of the TMNT movie while the turtles are mere supporting characters just like in Transformers. This was horrible. I expected the movie to be bad but not this bad. 0/10, I want my money back.\r If you haven't seen Guardians of the Galaxy yet then go and watch it now, it's a great film and not a waste of precious time and money like this TMNT abomination."
    },
    {
      "rating": "0",
      "text": "F@#% You Bay!  Why do people still flock by the masses to the cinematic crapfest that Michael Bay is part of?  Transformers 4 has just pulled in over $1 billion world wide and it's yet to open in some countries in Europe.  Read a book, challenge yourself cognitively by even watching good film makers like Kubrick, Nolan and Aronofsky.  The \"whatever makes money\" approach continues to work because people keep seeing Razzie movies, as Bay only knows how to make."
    },
    {
      "rating": "10",
      "text": "This movie completely satisfied me and set itself up for a great sequel. It had great CGI and facial animation which made the turtles seem like actual characters. It had amazing fight scenes and actually made me say, DAMN! great new story and it made me laugh out loud several times. I can't wait for the second."
    },
    {
      "rating": "1",
      "text": "me and my girlfriends and we were hoping a movie that would be a good representation for tmnt but but ended to be just a bad movie like the back story was all held in flash back or that every thing was so quickly glossed over"
    },
    {
      "rating": "0",
      "text": "Have you ever been dragged to a movie thinking you'll hate it, and then it turns out to be okay... or even great? I have a few times, though usually films are pretty much what you expect.\r Then there's Teenage Mutant Ninja Turtles.\r I went in thinking I'd hate it, and what I got was about ten times worse than  that.\r Unspeakably bad script. Amazingly bad acting. Horrible direction. Creepy CGI that starts out in the uncanny valley and never moves. And that's before you even touch on the sheer defilement of the TMNT franchise. Seriously, this is possibly the worst A-list movie I've ever seen.\r The only reason I'm giving this movie 0 out of 10 is because I can't go any lower."
    },
    {
      "rating": "9",
      "text": "I watched the movie last night with my girlfriend and we both enjoyed it. It was really a great movie. Here's one hoping for a sequel(s).\r The turtles and Splinter were cool and easily the best parts of the movie."
    },
    {
      "rating": "4",
      "text": "Today was the first showing of this movie for Bulgaria, and ofcourse, most of my friends went along with me to see it. I was even dressed up as Casey Jones, and my beautiful girlfriend was my lovely April O'Neil, so it became a \"thing\" - something to expect. The first TMNT movie in a long time. In other words - we were excited, even knowing that it won't be good. We just wanted it to be OK.\rWell, it wasn't.\rI really don't want to say this, but this movie is terrible. If you have even a little bit of logical and critical thinking, you will see that.\rDirector Jonathan Liebesman, known for nothing even remotely good, did a semi-terrible job. A few scenes pop up and will be remembered for a while as exciting or cool, but nothing more. Josh Appelbaum did a particularly terrible job writing the script, it simply gave nothing for the actors to work with, it was very simple, and most jokes weren't worth more than a chuckle. A lot of people are saying the turtles ARE the turtles when they \"get it on\" - I strongly disagree, having read most of the original and IDW comics, and watched most of the TV series, I know how the turtles act, and this were not the turtles. The Turtles are a lot more charming than simply a nerd, a nobody, a loverboy and a grumpy guy with an attitude. Mr. Wolf said it best: the fact that you are a character does not mean you have character, and this is just the case with this rendition of our favorite heroes.\rFurther more, the story is very badly paced, it was one of those movies that feels very fast and very slow all at once - there were no moments of gradual suspense, nothing of value at all. You only need to see how weak the intro is to get what I mean, and the ending is even worse (it doesn't have a finale, it just ends in a typical Michael Bay fashion). And - spoilers - about the supposed climax, though cool at times, I agree with some critics that it was too similar to the one in Amazing Spider-Man 1. Other than that, the geek in me wants to say that this movie has the same problems as the original TMNT 2, though I will not point-out which, so not to spoil.\rWhen it comes to acting, I can only say two things. First - William Fichtner was the only one of all the cast who was doing actual acting. Even though he was given 0 good text to work with, he had every scene he was in in complete control, as you'd expect. Everyone else was simply there, trying to do acting, rather than acting. The other thing I want to note, although it's not really acting related - the Shredder is much more cooler looking on screen. Sure, the Victorynox effects are obvious, but he is a lot less bulky and a bit more bad ass than he seems to be, so at least I'm glad about that. Oh, and Megan Fox did try though, for like 2 minutes.\rThe movie sounds ok, it's the typical Michael Bay style sound work - a lot of slow-mo dubstepish sounds and a lot of metal scraping noises, and a soundtrack worth 2 hours and a synth - nothing of value. The theme song by Wiz Khalifa and his entourage of various rappers is catchy, but notably weak and stupid. Even more so than Ninja Rap, and that's a whole new level of stupid only 2014's rappers can offer.\rThe post-production work was terrible - it was obvious how the movie went through a lot of stages, it was obvious how Sacks was going to be Shredder before the fan outrage, a lot of scenes have no sense what so ever, but nothing can be done about that.\rThe movie is pretty damn weak. And if you can't stand stand being not-critical or logical, you are not going to like it at all. (Yeah, it is scary how this movie surpassed Guardians of the Galaxy and Planet of the Apes.)\rHowever, if you have kids - take 'em to see it. Kids love this movie. And ultimately... this movie, in particular, is obviously made for them. It wants to take you on a joy ride, and if you are a little kid, not knowing most of the history of TMNT (like, per say, me), you will have a blast and go want a toy afterwards. Hell, even I wanted a toy afterwards. But that's what comic book movies do to you I guess.\rThe movie is not as terrible as some people point it out to be, but it is pretty weak, Kids will love it, real fans will probably hate it, but be excited by it. Either way, a sequel is already due and with Bibop and Rocksteady confirmed for it, maybe we will see something a tad more faithful, and let's hope - better."
    },
    {
      "rating": "0",
      "text": "This movie seems way to much like Transformers than TMNT. There is way to much explosions and not that much ninja fighting. This is very disappointing. -"
    },
    {
      "rating": "0",
      "text": "Michael Bay Movie 101:\rMegan Fox butt in the camera - check (see also transformers)\rdownhill action scene - check (see Bad Boys II)\ractions scenes so fast and shaking camera that you can't grasp a single thing - check\r40 minutes of action instead of a proper ending - check"
    },
    {
      "rating": "2",
      "text": "Megan Fox is certainly a beautiful woman but she needs to either stop using too much botox or invest more time learning to act. She was the only non CGI main character in the movie but somehow the least expressive. Its not like Fox needs to give a Oscar winning interpretation but her surprise, scare and amazed face where exactly the same and not very convincing. I know that the plot needs to be water down because of intended audience but it does not mean that there should be none at all."
    },
    {
      "rating": "3",
      "text": "Very crappy. The original one and the secret of ooze are both WAY better. This remake has bad storylines, action, etc. The characters are okay. This has to be the worst TMNT movie. Go watch something good like the two other TMNT, and Dumb&Dumber instead of this poop. Still not as terrible as the 2 of Justin Bieber's crappy films though..."
    },
    {
      "rating": "4",
      "text": "*sigh* Michael Bay a bad filmmaker. He already ruined my childhood with the Transformers movies, so when I heard he was producing a Ninja Turtles reboot, I was ENRAGED!!! Then I went to see the film I knew was gonna be terrible and honestly, it was ok. I still hate the Turtles designs, but that's just a minor problem. What I disliked the most about the film was that it was basically the April O'Neil show!!! I really am getting tired of Megan Fox staring in Bays movies. Heck, we don't see the Turtles until like 10-20 minutes into the movie!!! Also, the Shredder is really underdeveloped. All we focus on is Erick Sacks. But from all my hate, I don't completely hate this movie. The voice acting is decent and the fight sequences are awesome. Although that doesn't mean the movie is great in any way. Not as terrible as I thought it would be, but not a masterpiece. 4/10."
    },
    {
      "rating": "6",
      "text": "A reboot of the classic franchise on the big screen with twists to the fiction and the turtles being brought to life by CGI. The plot feels stupid thanks to a glaring hole in the villains plan and the turtles new look takes a lot of getting used to. They look disgusting and monstrous most of the time, but after a while you get used to it and don't mind anymore. However the biggest flaw it has is that the turtles themselves feel like side-characters in their own movie.\r There's way too much of a focus on April O'neil. This movie is pretty much her origin story. The heroes in a half-shell are pushed to the side in favor of tying her into their past. Even worse is that Megan Fox gives an absolutely crappy performance as O'neil. If she somehow manages to avoid getting a razzie for this I will be amazed. There is no emotion in her performance what so ever and you can clearly tell she isn't trying in the slightest.\r So why isn't my score lower? The answer is the turtles themselves. They're brotherly back and forth is entertaining and often funny. Despite how ugly they now look it's hard to not get excited when they appear on-screen. The action isn't anything spectacular, but still provides some decent entertainment.\r You can tell it's trying hard to be one of the big blockbuster superhero movies in order to compete. Because of that it takes a lot of the same paths recent superhero flicks have and lacks some necessary originality. However it does still make for a pretty entertaining flick. Especially for the younger TMNT fans out there.\r Changes to the fiction are sure to anger hardcore purists and it's not really a great new start for the series on the big-screen. That being said it can still be an entertaining watch. I wasn't really impressed with it and a lot of elements make it seem more geared to a new, younger crowd, but I wasn't bored by it.\r If they had focused more on the title characters it could have been a lot better. As it stands it's an at least watchable movie that shouldn't completely burn your inner TMNT fan. There's enough humor and decent action to make it a decent popcorn flick, but it's not hard to see how it could have been better. With more emphasis on the turtles as well as injecting it with more of the series personality the sequel could actually be pretty good.\r This isn't a bad TMNT movie, but it's changes clearly make it more geared towards attracting a new audience by giving them what so many other box-office hits have been offering as of late. Because of that it lacks some intelligence and well as enough of the turtles themselves. It makes for a TMNT movie that's watchable, but not entirely satisfying. Especially not for old-school fans. I personally view it as still worth a watch though. Just don't expect to be blown away. My total score for the movie is a 6.5/10."
    },
    {
      "rating": "6",
      "text": "Way better then what the critics rated it as! The CGI was amazing! The best special effects I have seen to date! Story was ok as well. The movie was alright!"
    },
    {
      "rating": "5",
      "text": "A movie only good by Michael Bay standards and pleasant only as trashy fun. Despite the enjoyable visuals and effects, likability of the characters, and fun and touching moments the film is plagued by a scattered brained plot, plot holes, underdeveloped characters and lack of loyalty to the source material.\r The movie also suffers from an excessive jokieness that makes the film evoke annoyance more than laughs and also very uneven screen writing and sloppy plot development that doesn't tie up the story nicely in the end. Overall the movie has plenty of redeeming qualities which save it from its script and poor plot and can simply be enjoyed as a stuffed action flick with enjoyable moments with a sub-par plot   and screenwriting."
    },
    {
      "rating": "3",
      "text": "This is not your average stupid, this is Michael Bay stupid. There's a certain level of absurdity in movies that I'm willing to overlook. Some may have convenience timing or occurrence, but TMNT has gone beyond any hope of logical salvation, it discarded any plausibility or decent common sense in that matter, and opted for samurai robot and explosion. I knew it was going to do that, but apparently my expectation was still too high. One of the characters embodies Michael Bay's philosophy, saying that knowing what people like is good, like froth in coffee. Well, this movie doesn't even resemble that, it's that white stuff that accumulates at corners of your mouth when you're really thirsty.\r Acting isn't much, there's Megan Fox who looks nice and everything, but she just looks completely in distress, it differs little whether the cause is ninja, samurai robot, or transforming robot. There may be a misconception that Fox’ up close agape look is a selling point, or may be not. Will Arnett tries to bring some comedy, his character often wanders how he caught up in this mess, same could probably be said about the actor. The main problem is how the turtles look exceptionally superficial. Using CG is expected, although the end result appears too mutated for viewing pleasure. At times, they resemble bulked up Jar-Jar Binks, definitely not pretty. While the movie tries to personify them differently, they are just too unconvincing to build any kind of emotional attachment and end up rather shallow.\r Plot is a mess, it literally requires one to not question anything and merely marvel at the explosion. Even if the original story is a children cartoon, there has to be some coherency. TMNT doesn't want anything to do with any of that, with each passing minute the movie struts into the realm of impossibility even by dumb standard. Screenplay is poorly written, content is thin, near non-existent even. About half way most audience will stop their attempt to follow the plot, because it's exercise in futility and if one cares about story after about forty minutes, that's more work than the production put in the movie.\r I suppose in term of effects it fares slightly better. These scenes are the highlights, and at this point, one won't be surprised if the turtles developed wings and fly. Fights and some action scenes are decent, but it may have borrowed too much from Transformers, just change the robot in flying debris with mutated turtles in flying debris. Cinematography is very Michael Bay, tilted scene, rotating close up, damsel in distress, empty dramatization all around. I guess it works for mindless fun, but it's now more mindless than fun.\r The movie belongs in the sewer where it should just stay there, but considering turtle's life span, how it sells like hot pizza and Michael Bay's persistence, I fear for a sequel."
    },
    {
      "rating": "8",
      "text": "Seeing all the negative reviews out there I did not have high hopes. But surprisingly this movie was great! I'm a turtles fan going to back to pre-school days and this movie did a great job of revitalizing some of those old memories. It's more similar to the cartoons than the old movies. Compared to the first movie it's not as good but better than others. On its own today almost as good as Guardians of the Galaxy. It has as decent story, great action sequences... oh an Megan Fox. In any case I really enjoyed it. I do think some of the jokes were a little mature for the major audience who will see the movie (e.g. mike comments that his shell feels small when he is around megan fox). It wasn't a big deal for me but definitely inappropriate for the character. In any case I highly suggest it."
    },
    {
      "rating": "3",
      "text": "This movie is unforgettable...-y bad. Its been over 10 year since the original remake was made, so a prequel seemed fine. To sum up, it was just a huge flop and ruined TMNT completely. The only positive was the tune and theme, good, not the best. A waste of 10 years of production."
    },
    {
      "rating": "6",
      "text": "Nostalgia will face-off against a once obscure set of oddball rebels this week in theaters when the Michael Bay produced Teenage Mutant Ninja Turtles takes on the current box-office champ Guardians of the Galaxy. Star-Lord may have conquered ticket sales and theatre seats with his unknown team of misfits, but now he is head-to-head with a very recognizable and profitable brand of heroes that have found success with merchandising, previous cinematic endeavors, television shows and brand placement for years. However, don’t be quick to count Marvel out, especially when it’s film is a much more concentrated picture dedicated to story, visual effects, character development and star-making performances–all the things lacking in this newest adaptation of the Turtles.\r For many people born into Generation-X, the Ninja Turtles have a special place in our hearts and memories growing up as kids. Dressing up like the turtles in our youth (or even in adulthood), always arguing which turtle was the best and declaring our favourites, the Ninja Turtles are considered a prominent part of many of our childhood’s cartoon memories. Like anything else, however, quantity may not always precede quality, even if the memories may well be better than the present. While the newest film adaptation of Kevin Eastman and Peter Laird’s beloved comic book characters get a contemporary vision, the Turtles get a good taste of twenty-first century overkill; between the unnecessary 3D format, a heavy-handed visual effects cluster that at times shreds the screen rather than gracefully transcends images, and its fair share of negative controversy over the last few years, the Ninja Turtles sure need some tough skin to come out on top in order for them to be declared a clear success story.\r Between ramblings that the title of the film was going to be named only “Ninja Turtles”, to an origin story that finds itself lost in the depths of space (as do the main characters), to a returning Megan Fox, whose tarnished relationship with producer Michael Bay brought an onslaught of questions after ejecting her from his career-changing Transformers series, the newest Turtles may have been, at times, pressured to hide in their shells. Yet, with the direction of go-to Hollywood pushover Jonathan Liebesman and powerhouse producer Bay, even after criticism of the first trailer showed that the Turtles may have needed a nose job, the film entertains despite its poor constructive history. And even though our favourite four Turtles are named after artists of the Renaissance, the story could easily be one from that era as well.\r I won’t lie, I was the first one in line to buy tickets to the new TMNT, but didn’t have high expectations, especially since the film was more of a punch-line than it was ever considered a serious summer contender. Despite all this, the film still brought its fair share of “woahs”, “ahhs”, and most importantly, laughs.\r Light on any real narrative, the film provides a nicely put together origin story that ties the creation of our favourite band of green-superheroes with original characters in the comics, as well as new characters made directly for the screen. Taking cues from many superhero films before it, the band of brothers must join together to take down Master Shredder (Tohoru Masamune) before he consumes New York City.\r Other than Bay, one of the biggest problems with the film is that it never really establishes the identity of any of the actors playing the good guys, nor does it give them any spotlight. The body actors and voice actors of many of the main characters, including the Turtles, are never given their due justice. Leonardo (played by Pete Ploszek but voiced by Jackass alum Johnny Knoxville), Michelangelo (played and voiced by Noel Fisher), Raphael (Alan Ritchson), and Donatello (Jeremy Howard), along with their noble Sensei Splinter (played by Danny Woodburn but voiced by Tony Shalhoub) seem to be mixed in a blended spectacle of martial arts effects faced only by not so funny man Will Arnett and the once iconic Megan Fox. Like any job, tasks need to be done, goals accomplished and work done properly, and Fox can rest assured that she never progresses the characters of April O’Neil, but at least she defied and got in the good books of one of the most explosive producers working. Plus, she isn’t bad to look at on screen, which will make fan-boys really happy as throughout the film, she is explicitly the butt end of all the gorgeous women jokes of the film.\r At times foamy and most of the time frothy, the Turtles are given a personality change for a new generation. If you know anything about the personalities of the Turtles from the past, you can always count on Bay to offer the most stereotypical versions of cherished childhood characters."
    },
    {
      "rating": "0",
      "text": "A huge TMNT franchise fan going back to the 80's. The worst possible version of the franchise. Instead of small, tactical, and funny. They are large, ugly, tanking idiots. Worst Movie I have seen in a very long time."
    },
    {
      "rating": "7",
      "text": "To be honest, I actually thought the movie was fun! There are a lot of cringe worthy Michael Bay moments and they went WAY over board with Donny and I godda admit, its really weird having Johnny Knoxville playing \"the responsible one\" (so weird hearing that voice coming out of that mouth) and the \"foot clan\" is a friggin joke, but in the end I still had fun! The turtles personalities really feel like the turtles and its awesome to see them again! Most importantly this movie isn't a 3 hour long explosion like Age of Extinction was (which honestly I was expecting this to be). Check it out."
    },
    {
      "rating": "7",
      "text": "You ever like a movie, while realizing it's really, really, bad? That's how I feel about this movie. It becomes pretty apparent that this film went through a major overhaul of the main plot at some point late in development. This created massive plot holes, and errors in logic far beyond the average action flick. For instance, despite Splinter having no contact with the world outside of the sewer, he has intricate knowledge of Shredder and the foot clan. These type of errors appear frequently. However....it's the Teenage Mutant Ninja Turtles, and as far as that goes, they nailed it. The four brothers are  amazing in every frame, and even Megan Fox pulls off a decent April O'Neil. So what you have to ask yourself is, does the Ninja Turtles have to be well written to be enjoyable? I found that, though these plot holes can be annoying, it's nothing new to the franchise. I grew up on TMNT, and this is honestly a very faithful reboot to the source material. For example, in the cartoon series Shredder often referred to the Turtles as amphibians. Did we care? No, because it's TMNT. So, though it is without a doubt a terrible movie, it is at the same time very fun and entertaining for kids and older turtle fans alike."
    },
    {
      "rating": "9",
      "text": "TMNT was a movie that gave you what you want, if you wanted superpowers, action, unbelievable special effects and entertainment.\r I recommend this movie to the ages of 7 and up.  The acting was not all that great but the laughs made up for it.   Although I thoroughly enjoyed the movie I thought it was not worth watching it in 3D as there was only a few well done 3D scenes.\r I highly rate this movie due to the fact that the special effects were amazing and it was a great thrill ride!"
    },
    {
      "rating": "7",
      "text": "The movie was good, so don't listen to the others and watch it yourself. The CGI looked really good, and the actors were great. The movie was funny and action packed."
    },
    {
      "rating": "7",
      "text": "Serial Teenage Mutant Ninja Turtles I adored so I didn't have the slightest problem trying out the film and I must say that I was satisfied. Maybe I'm just a fan of the series, but personally I think it's a good movie. The story attracted mainly the effects, but also the music, which was quite epic. The main negative ripper is also a hit, and overall all this with a proper action creates a combo that I think works. For me, a good film that I can recommend."
    },
    {
      "rating": "7",
      "text": "I understand why it may not be enjoyable for some of you, but I really enjoyed the movie when I saw it. I think it's funny, has good action, and great visual effects. It's not for everyone but then again nothing is."
    },
    {
      "rating": "9",
      "text": "The Shredder, my favorite villain. Ninja cool beans! I hope for more movies like this one."
    },
    {
      "rating": "3",
      "text": "This wasn't as bad of a movie as I was expecting. The new look of the Turtles didn't bother me as much as it did for other people. The biggest problem I had was two-fold. With the inconsistency of the tone and with Megan Fox.\rThe tone of the movie stands out at first. It can't figure out if it wants to be a kids movie or something more adult-oriented. That's not to take away from the job that the guys who played the Turtles did. I think they did really well conveying each of their individual personalities and they each got around the same amount of screen time. The tone is so inconsistent though that one moment you're making a fart joke for the kids and the next you have someone get brutally killed. It happens so much throughout the entire movie you have to wonder why they thought this was a good idea.\rThe other problem, actually main problem, is Megan Fox. She is SO TERRIBLE in this movie it made me cringe to watch her in some scenes. She's just a horrible actress in general and she needs to stop ruining otherwise decent movies with her horrible acting skills she displays. What makes it even worse is the fact that she's pretty much the main character for 80% of the movie. It should have been called \"Megan Fox! with 4 large turtle guys or something\" because they focus WAY too much on her throughout the entire movie. If it had been someone playing April here, I think my score would be about 5 points higher. Instead you're forced to watch her stumble over lines all the time with a look between constipation and just general confusion on her face all the time.\rThis movie could have been so much more than it was but it just comes off as a cash grab in the end. It's clear they didn't respect the source material and the fact that they could never figure out what they quite wanted to do with the movie hampers the fact that the Turtles themselves were pretty neat and with a pretty good final boss fight at the end of the movie. But even Megan Fox has to ruin something cool like that too. Don't go see this movie in theaters. Wait a couple years till they bring it to Nick and watch it then cause even diehard turtles fans like myself will see this movie for what it really is: a terrible joke."
    },
    {
      "rating": "3",
      "text": "This is a frenzied, confused mess that starts with the emergence of the titular turtles (couldn't resist) as they rise out of the gutters to save NYC from Shredder and his Foot Clan. Their human allies are Megan Fox and Will Arnett. It goes without saying that the plotting is plodding. The story gets off to a slow start, but once it gets rolling, there's plenty of action…most of its jumbled and unimaginative. Arnett has a few funny moments, but the Turtles' wise cracks fall flat. Kids might enjoy it (although they'll be frustrated by the subtitles), but grownups looking to re-live their childhood fascination will find themselves yearning for their younger days (and their money back)."
    },
    {
      "rating": "1",
      "text": "TMNT is the thing that was on every kid's mind around the 90's. The loving turtles were icons and role models for kids back then, even for me! This reboot manages to wipe out the charm and fun out of TMNT itself. It's another CGI animated action movie with a washed out plot and cheesy dialogues. To come to this all time low, the franchise had to suffer through a bad series of kid movies by Nick and this film is also made by Nick. God. The turtles are back! Yay! Or not. Maybe. The film starts out with boring scenes between April O Neil played by Megan Fox and Vernon Ferwick played by Will Arnett. And Bernadette played by Whoppi Goldberg. Gosh, why did you do that Jonathan Libesman!? This movie was all about special affects and I have to say the avalanche seen was crazy awesome and it was the only thing that was good. By the time turtles show up it's been 30 or 20 minutes. This could have been just called April and Vernon forever in 3D. The turtles are funny, the jokes are washed out but still- TURTLES!!!! After that we meet William Fitchner who plays Eric Sachs, who nobody cares about. Seriously. Shredder shows up after 50 minutes and then everything goes boom blam and boom. For the rest of the movie. When it ended, I was glad that people don't have to watch bad jokes and mind numbing CGI for another hour. These turtles are nothing like the originals. The story is new. Everything is new. Sometimes that's not a bad thing, but now it is. I was hoping this would stay faithful to the TMNT movie. But no, it's YET ANOTHER Micheal Bay bang bang boom movie. It's bad, sloppy TMNT. I give it 1/10 because the did a good job with that avalanche scene. Everything else- 0/10. Another box office bomb. This time it landed on the turtles."
    },
    {
      "rating": "4",
      "text": "Incredibly boring, poorly acted, profusely tedious and graciously idiotic, Teenage Mutant Ninja Turtles is just as bad, if not worse, than its title let's on."
    },
    {
      "rating": "1",
      "text": "I was so F@kin dizzy and i vomit watching, Teenage Mutant Ninja Turtles 2014 , the acton scene is fast and slow all the f@kin time, it looks like it was Michael Bay the director. the movie is so boring and the Ninja Turtles are not funny."
    },
    {
      "rating": "3",
      "text": "I grew up watching TMNT and loved them. This movie did not do them any justice. First off, beginning scene's made me dizzy - the quality in which the movie was shot and audio was poorly done. Overall storyline was blah as well as the action scenes - over kill on the hill-slide scene. Turtles were just okay but my favorite was Michael. Megan Fox was just a pretty face, didn't bring any substance to her role. The anchorman side-kick was not that funny. Whoopie sure has gained weight. Overall, movie lacked that special something to capture the hearts of us fans. In my household it got 1 thumbs up from my 13 year old. Guardians of the Galaxy was WAYYYYY Better!"
    },
    {
      "rating": "5",
      "text": "This film could be good for one watching. But stupid characters, the freaking transformer named Shredder and leadership of effects make this film a stupid parody on Ninja Turtles."
    },
    {
      "rating": "1",
      "text": "The cgi of Splinter, in Teenage Mutant Ninja Turtles 2014 just horrible and the movie if they had another actress not Megan Fox, i think the movie good be a little better, and this movie is better than the Teenage Mutant Ninja Turtles 3"
    },
    {
      "rating": "0",
      "text": "I really wanted this movie to be good but it stinks it went from a fart to a shart the kind that leaves you feeling dirty and filled with self loathing for days to come. The terrible acting by Megan Fox combined with the almost rapey Michelangelo, awful character design and writing made me barely able to sit through the 1st 30 min. of this turd I have never walked out of a movie but this left me wishing I had."
    },
    {
      "rating": "2",
      "text": "I had very low expectations going into the film and didnt expect much. I was very reluctant to see this film, but I did anyways. By the end, my low expectations were met. Several things the film did well was give the turtles some character & humor: something that I wasnt expecting from a Michael Bay produced film. The Turtle's acting was pretty good as well, but the human actors were bad, especially Megan Fox. Also, the film's plot was awful and action sequences were a huge letdown. Overall, wasnt expecting much from the film, and I didnt get much from a bad film like this."
    },
    {
      "rating": "0",
      "text": "Positives:  The wife laughed everytime megan fox was loudly breathing on camera(pretty much every scene she's in).  Seriously, does she have strong acute asthma or something?\r Negatives:  Pretty much everything else about the movie."
    },
    {
      "rating": "1",
      "text": "it look's like the director of The Teenage Mutant Ninja Turtles (2014) , is Michael Bay and not Jonathan Liebsman,  because the way the camera moves in this movie."
    },
    {
      "rating": "4",
      "text": "If you think this movie is good, you're one of two things: a TMNT fanboy or an idiot. This film is so boring and lazily written, and takes probably 45 minutes until we formally meet the Turtles. Want an example of how lazy it is? The film says it takes place on the first day of Spring, yet Megan Fox takes a 20 minute drive from NYC and suddenly is in a snow blanketed resort. Its just another Michael Bay film, which is all the review I should need to say."
    },
    {
      "rating": "2",
      "text": "Everything gets updated for 2014. No bloody escape. I actually thought the movie was OK. But these are not your turtles growing up. You know why people here saying on how the turtles acted? Cause they acted if the sewer they lived in was under Harlem.  PC my ass if you get offended.  Thing is how they acted is not how the turtles everyone knows have acted. Tho they do throw in at the end \"Cowabanga\" which lacked any reason to have been said at that point and would have served more earlier. and yeah everyone is right. The turtles look like ****\r nick updated TMNT. But at least they got the turtles right."
    },
    {
      "rating": "2",
      "text": "Lol that 2007 movie ain't looking too bad now is it, haters!\rI mean...WOW! Talk about taking my childhood and screwing it up for a paycheck. The only good-ish thing about this was the snow mountain scene."
    },
    {
      "rating": "2",
      "text": "Dawn Of The Planet Of The Apes (2014) and,  Guardians of the Galaxy (2014) the best movies of this summer, and the Teenage Mutant Ninja Turtles (2014) worst movie of the year with Tammy and, A Million Ways to Die in the West."
    },
    {
      "rating": "5",
      "text": "I went into Teenage Mutant Ninja Turtles with some trepidation and I have to say the movie is better then I thought it would be.  That's not to say I loved the film, but I didn't outright hate it either.  I actually like the way the turtles acted and there were some good scenes. The thing that needs to be understood about this movie is that it is clearly written for a younger audience. This means the story is oversimplified at some points and that leads to some very obvious plot holes. In the end, I just felt that the movie was ok. It's not the worst TMNT project out there, but it's not really high on the list. If you have young kids, they will probably like this movie. If you're an adult, you may just want to rent this instead."
    },
    {
      "rating": "1",
      "text": "Adding insult to injury, what Michael Bay did just ruined not only my childhood memories watching 3 fantastic 90's TMNT movies, but a complete mess. 100% dull and 100% more action = less use of a movie ticket. I really don't watch the newer version of the rebooted cartoon on Nickelodeon (now that I stopped watching this horrid rip-off of the always enjoyable 80's cartoon that theme song get stuck to my head) and I haven't bought Turtles in Time for the SNES way back. Those were the good ol days when the Turtles were awesome these days. But in 2014, things have changed and I know this is the 2nd reboot in the \"Teenage Mutant Ninja Turtles\" film saga, but why in the hell would you rather give this reboot a PG-13 rated movie? In fact, how come you make an iconic franchise after 21 years of live-action fun and now dragging it through the ground? Easy, you take your trusty ex-girlfriend Megan Fox as April O'Neil, a terrible script, an unnecessary rap song about \"Shell Shocked\" that is deemed inappropriate for children and making fun out of Vanilla Ice's \"Ninja Rap\" classic, Johnny Knoxville's awful voice acting as Leonardo, so does the actor from Monk, and Pizza Hut. Can this thing ever get worse? Oh, and their new CGI look is f***ing terrible. If there's one thing is the absolute worst reboot movie of the year and no I don't wanna mention Transformers: Age of Extinction is this heroes in a crapshell mess. Take your $5 Pizza Hut box and shove it."
    },
    {
      "rating": "8",
      "text": "Annnnd cue the negative feedback from everyone.\r Except yours truly. I want to get past the big elephant in the room of, dun dun dun... the Turtles look a little ridiculous and Megan Fox should jump off a high building. Head first.\r Other than that, I thought the film was rather well done. I WANT to see the TMNT franchise grow and become it's own. I DON\"T want to see TMNT continue to be done as a cartoon. Adding this CGI, explosions, fight scenes, and dramatics was great.\rI honestly enjoyed almost every single moment of the movie.\rThere was some wit, action, adventure, and humor. Perfect mix for me.\rI was satisfied leaving the theater."
    },
    {
      "rating": "1",
      "text": "I was near to vomit when i seen this movie, wow how many cgi has this movie and the costumes looked just like the Dinosaurs from the TV show The Dinosaurs, This movie is garbage."
    },
    {
      "rating": "0",
      "text": "Teenage Mutant Ninja Turtles reminds me of my latest crap. Just because something is nostalgic does NOT make it good. It is the what you see that counts. And when it comes to that, this movie fails...hard."
    }
  ]
}