{"id": 1549, "title": "Teen Titans Go! To the Movies", "starring": ["Scott Menville", "Khary Payton"], "runtime": 84, "genre": ["Animation", "Action", "Comedy", "Science Fiction"], "description": "All the major DC superheroes are starring in their own films, all but the Teen Titans, so Robin is determined to remedy this situation by getting over his role as a sidekick and becoming a movie star. Thus, with a few madcap ideas and an inspirational song in their hearts, the Teen Titans head to Hollywood to fulfill their dreams.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/mFHihhE9hlvJEk2f1AqdLRaYHd6.jpg", "categories": {"plot": 7.583333333333333, "acting": 7.722222222222222, "ending": 6.75, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 7.333333333333333, "funny": 7.0181818181818185, "action": 6.0}, "reviews": [{"rating": "10", "text": "Love it! Don't listen to FANBOYS who can't handle their fave characters being made fun of. The first iteration of TT just wasn't cutting it, TT Go is super hilarious once you've let go of the idea that TT should be more serious and must have character development, etc. Fanboys were just too loud in their protest on the interwebs that all the kids thought hating on TT Go was the norm. In fact, TT Go was heaps more successful than TT. I love how this movie just don't give a shoot and just goes all out. A must see!"}, {"rating": "10", "text": "if aquaman can get a movie anyone can. Like the Cartoon Network show that inspired it, the film depicts the adventures of its titular teen heroes. The more obvious message, that being true to yourself and your friends is way more important than being “super,” should strike a chord. And if it doesn’t, the sight gags about giant robot farts definitely will. I love it!"}, {"rating": "9", "text": "E-Value: 9Acting: 9Plot: 9Based on the animated series of the same name, this is the very first Teen Titans movie to have a theatrical release. Technically, this is actually the third movie in general for the Teen Titans because the first two movies, Teen Titans: Trouble in Tokyo and Teen Titans: The Judas Contract, were released as a TV movie for the former and a direct-to-video movie for the latter.Set in the same universe as the animated series, the Teen Titans are regarded as jokes and not being real superheroes by many characters including the Justice League and Deathstroke (Arnett). Since most of the Justice League members such as Superman, Batman and Wonder Woman have their own movies, Robin (Menville) suggest to the team that they should have their own movie as well to prove to everyone that they are not a joke.The team travel to Warner Bros. Studios to find a director who can make them a movie. They find a woman named, Jade Wilson (Bell), who has made many superhero movies. Unfortunately, Jade refuses to make a movie about Teen Titans because they are not real superheroes and no archenemy. To prove Jade wrong about the team not being a superhero, they decide to get Deathstroke to be their archenemy.As much as fans of the original 2003 Teen Titans animated series hated Teen Titans Go!, I can tell you that this movie is totally not bad at all. Although the movie retained the humours and comedy gags from the animated series, it is totally funny than any of the episodes from the series itself. The movie is not afraid to poke fun at themselves including past DC movies.The plot of the movie is good and it even breaks the fourth wall sometimes which can make you laugh so many times. There are also many Easter eggs and references you can notice throughout the movie including a very surprising cameo which I did not expect at all. Once the credits start rolling, stay for a mid-credit scene. Lastly, this movie is a definitely must watch DC movie not just for having a good laugh but to also wait for the release of another DC movie, Aquaman, in December."}, {"rating": "7", "text": "My daughter and I are BIG fans of the show and she LOVED the movie. I thought it was okay. The show is at its best when it's exploring the various personalities of the titans but the movie seems really shallow on that front. I still found it enjoyable, but think the show is far better than the movie. Still, worth a watch."}, {"rating": "1", "text": "Bad animation, childish jokes and a very simple plot. Where is level of Young Justice and Justice League animated movies?"}, {"rating": "10", "text": "This movie was actually really good, the jokes are great and the story is engagingIt's far better than the tv show TTG. I highly recommend this movie."}, {"rating": "6", "text": "Surprisingly, \"Teen Titans\" mature on an unbelievable scale, but still have childish predominance. Despite a small message from behind, it still concludes well, but has a disappointing introduction, with an exaggerated delay to start a conflict as a base. In a short time in theaters, they already prove they can do better than on television. 6.2/10"}, {"rating": "2", "text": "\"Teen Titans\" was a great animated series, but \"Teen Titans Go\" is a hyper-frenetic annoyance of a show, colorful as it may be, with a few bright spots including its \"The Night Begins to Shine\" mini-series. So it was with some hope that I watched their first theatrical release, though my hope-watch took only minutes to morph into hate-watch. Why? Because it's just the horrible series extended into a feature length film, ugh. The animation is no different, no new villains, in fact, Slade has a stupid, safe voice in this compared to the original TT series. Also, this is sort of a musical but not in the good NBTS way, more like annoying hyper singing they do sometimes in the series. It was just horrible, just horrible, when will this series just die and return to something darker, more mature?"}, {"rating": "6", "text": "I hate ‘Teen Titans Go!’ not because they ruined amazing characters and it tried to replace something that is just so much better than it, but because even if you took the characters out of the show and replaced them with original ones, you’d still have a so-so show. And it’s even worse that for most episodes you can just swap out the characters and nothing would change. Anyway, this movie was pretty okay. The animation was good, the voice acting was good but got annoying at times, the writing was surprisingly great, and the story was fairly unique. And I use the word ‘unique’ loosely since we have seen this kind of story, but not used in this way. Since superhero movie have fairly recently become a hugely popular thing, I’m pretty sure this is the first, if not, one of the first, movies to really mock it, so if anything, it’ll be remembered for that. The real strong suit here is the writing. I found that the writing was very strong in a lot of places, but it also felt like the show at some points. Overall, it was entertaining yet devoid of substance, but that actually works in it’s favor because you wouldn’t except a really funny and clever joke from a movie devoid of substance."}, {"rating": "10", "text": "An excellent finale, maybe still there will be a continuation of the TV series Teen Titans 2003."}, {"rating": "2", "text": "Just as bad as the TV Show, and i am not trying to be mean but get me out of this hellhole."}, {"rating": "10", "text": "Exceeds with expectations, and better than the animation series, and is also a film that becomes the critique of superheroes from the comic point of view of characters derived from the creation of DC Comics, that is, it is as if your comic characters are versionalized in TV and movies and criticize the genre with a Slapstick style.Supera con expectativas, y cumple mejor que la serie de animación, y es además, una película que se convierte en la crítica hacia los superhéroes desde el punto de vista cómico de personajes derivados con propiedad de la creación de DC Comics, es decir, es como si tus personajes de las historietas se versionalizaran en la TV y el cine y criticaran al género con un estilo de Slapstick"}, {"rating": "7", "text": "Enjoyed it.  My son is a fan and I am a convert - even though my favourite stuff is the more classic style animated series from DC.  But the humour and music are handled very well - and unlike so many of the animated characters nowadays - all of the Titans are willing to be themselves, quite a bit dorky and obsessed - and are not jsut constantly obsessed with looking cool and winning.  DC could use a little more laughter as it refocuses its approach to its film roster.  My fear is that Aquaman the film will be a zillion times more lame than the Aquaman in TTGO.  Lots of laughs - you will enjoy - much funnier than Lego Batman."}, {"rating": "9", "text": "Took my kids and was surprised by how much I enjoyed it. It's surprisingly crass and dark at times, not really shying away from killing and death. In one scene Robin actually pushes Batman's parents into the alleyway to be shot and killed, like wow. Also makes multiple references to the Marvel universe and how popular it is. It was very self aware about the fact that the Teen Titans are arguably not popular enough to deserve a movie."}, {"rating": "0", "text": "A Terrible Movie, I Was Appauled With The Humor The Voice Acting And The Terrible Jokes The Cheap Animation (10 Million Dollars!) 0/10"}, {"rating": "1", "text": "Movie theatre full of 7 year olds did NOT laugh at this movie after the first scene. That should speak volumes. The animation was bad almost like it was old and the plot was boring. We love the show, the movie was a HUGE disappointment.   Where was the wit, the silliness the tv show has??  We could not wait for it to end. We were bummed that we planned our kids birthday party around seeing this waste of money."}, {"rating": "8", "text": "Not sure how, but this is easily one of the best movies all summer. Multiple levels of funny, never takes itself seriously, super colorful, and creative. Hysterical and never wears out it's welcome."}, {"rating": "0", "text": "This **** movie feels like it was made purely to piss off people who want good shows"}, {"rating": "7", "text": "Liked it, but didn’t love it.This film version of the popular kids show is really, really funny. Some of the jokes are ingenious; a lot of stuff adults will like as well as kids. Expect a lot of references and rib-poking at the DC universe and movies.The character designs are simplistic, but colorful. The backgrounds in particular can be quite lively at points.As the funny as the movie is, the plot isn’t as strong. It’s hard to relate with the characters and be invested in their emotional journey. The thing is that the Teen Titans in this are super selfish, destructive dummies. Some of the humor is very black, very funny, but very black. As the film still manages to be funny and fun, I’m sure this won’t be a deal-breaker for many. However, if you’re a parent who is cautious about what content a child is exposed to or whether the characters are negative role models, this movie may not be for you."}, {"rating": "7", "text": "I preferred the art style of the teen titans from the early 2000s, but I do appreciate the comic flair of the new teen Titans Go.  The movie feels like one long episode, so if you are a fan of the TV series you will find the same enjoyment here. Nothing  deep in regards to story, just a typical “paint by numbers “, cartoon film.    There were a few scenes that had me laughing out loud with my friends, and overall I left the theater feeling entertained.  It’s a nice family movie to take the kids to see, with enough adult jokes for parents to enjoy.  The humor is on the immature side, and personally worked for me.   Overall if you like Teen Titans Go, then see it.  If not a fan, then there is nothing new here and I would wait for home video."}, {"rating": "0", "text": "Just About As Bad As The Teen Titans Go Tv Show. This Thing is Lame Stupid And Is Probably The Worst Animated Movie of The Year."}, {"rating": "0", "text": "What an absolute joke and complete insult to the original 2000s Teen Titan series. The fact that this series continues to thrive and even get it's own movie is absolute proof that we have failed as a human race. Horrible animation, terrible jokes even children cannot laugh at, and an almost non-existent plot. How is this even a movie? 0/10 #NotMyTitans"}, {"rating": "7", "text": "Aaaaaah, where do I even begin with Teen Titans GO… One of the most hated pieces in Multimedia that led to an angry Fanbase trashing the series here and there (With hate pages that I keep seeing on Instagram without a break).The decision of making a movie by WB sure led to an Emoji Movie-like status,where everyone would just hate it already without seeing it,with everyone saying “It looks awful” from the trailers (it's not *looks at Universal*).So now I've seen the movie by paying 7 bucks for the ticket and sitting on the (almost) biggest screen,with me and my brother being the only ones in there.So now the question is...how was Teen Titans GO! To The Movies? It was a surprise for sure,because knowing nothing about the source material and everything,I can say that it was…Good...For the most part.I was having a fun time at the movie,and besides the animation (which we'll talk about it later) and a few jokes, nothing really bombed or made me snooze at all.And even if it has the basic structure of a kids flick (guy wants to achieve something SO HARD,but in the end realizes that friendship is what's most important),it's a good letter to how is Hollywood being saturated by endless Superhero Movies and also making fun of them (quoting Deadpool 2 “A Family Movie”,only it's true this time). Surprisingly enough even the music. Not the score,but THE music. The movie tries to take the Disney road by making it a musical several times,and it works really well (and I implore you,listen to Upbeat Inspirational Song About Life (Reprise). It gave me some serious hope about whoever voices Cyborg in this),and don't worry,of course Lil Yachty’s Titans Remix is the king of Corniness.As I said in the IG Story, there's something for everyone. So much so that even the Hardcore DC Fans can go see it and say “Ooh,The Atom!” or “Wow! Plastic Man!”,all accompanied by the sake of a Stan Lee cameo that feels like it's forced at first and then it's just okay (given another moment of his played for a laugh). That's where we go into the flaws of the movie. The animation was disappointing for 80% of the movie, especially for an Animated Kids Movie,and if you'll say that it's just made for kids,go see that new My Little Pony,because at least in there,they understood that they were making a big-budgeted movie,and so the upped the animation to 11. And yes,there are the normal kids movie poop jokes and they not really bad,but I could've easily done without them (at least there's no dabbing!).Overall,to finish off,Teen Titans GO! To The Movies was a surprise. A cute and fun movie where you can take your kiddos and the adults,with something in it for everyone."}, {"rating": "6", "text": "The Teen Titans has never been a group of my complete interest. Not in the comic books, nor in their television series, therefore I wasn't really interested in this release and more because I never liked this approach for the group.But I admit that it's entertaining, it's funny and colorful but it's just that, a bit of entertainment. Entertainment with quality but there's nothing beyond that threshold.I know it sounds strange to say that considering that I'm giving it a good grade but that's my point., it's a good animated film but definitely in the long run, insubstantial."}, {"rating": "9", "text": "Look, the original show is better, but honestly, Teen Titans Go! To the Movies is relentlessly funny and the cast is just as awesome as always."}, {"rating": "8", "text": "Doesn't reach the heights of the TV shows best episodes but it does keep the general standard. 1 or 2 jokes I think were repeated from the show. The voice acting cast for Teen Titans go are the best in the business in my opinion."}, {"rating": "6", "text": "When think about it and not the show of course, you realize that this movie works both in a good way and bad way. Good way being that they found good enough writers to come up with these guilty pleasure jokes that some may find funny (younger kid whom are fans definitely will). Bad Way is the poor person who has to go through this for an hour and a half, especially if your a fan of the original Cartoon Network series back in 2003 (no seriously, stay til the end). Well, after all that you can all still give them credit for getting Nic Cage to be Superman!!"}, {"rating": "10", "text": "great movie. good animation. clever jokes. however fans of what this movie is based on (Teen Titans GO!) are truly the only ones capable of truely reviewing this and not the autistic cartoon reviewing spergs on youtube."}, {"rating": "6", "text": "The history of Teen Titans Go! begins back in 2013 when it first premiered on Cartoon Network as acquired from the Warner Bros. Animation television library and no, Cartoon Network is not involved in the production of Teen Titans Go!. As the only channel of its time to air strictly cartoons (or at least primarily since 2007), their job is to air the show on a basis. The show is infamous for numerous things such as its childish humor and repetitive airing times on Cartoon Network. All of this was literally planned so that it can get a movie of its own. Sadly, it perfectly worked and dominated the movie industry forever. The audience ratings of the show since 2013 was viewed as diverse and biased though I don't care about the show because it served every filler space Cartoon Network had to air its other shows. I would hate to keep on talking about the show because I am supposed to review Teen Titans Go! To the Movies. This film was literally doomed from the start to become The Emoji Movie 2.0 from the people that find this movie completely unnecessary. Thankfully and surprisely, the movie did not become The Emoji Movie 2.0. Sure this movie might still have the cringe level very high compared to The Emoji Movie but at least this movie has humor to make it literally a children's version of Deadpool. Something that the show in its entirety has not achieved. It's not perfect though and it's literally filled of flaws that was carried over from the cartoon that this movie is based on. I find this movie completely unnecessary for the film industry but as far as I am aware that there are Teen Titans Go! fans existing out there, I still think the cartoon did fine enough to make the children constantly watch it on Cartoon Network. At least SpongeBob SquarePants needed a reason for a movie in 2004 since it was served to be the series finale for the show until Nickelodeon kept the show going for its merchandise. There's absolutely no reason why Teen Titans Go! needed a movie but you know what, at least it sorta worked. The show is not actually that awful once you view it as its own. Sure it had awful episodes to go with it, but under the hood, it has good episodes too. This movie is near the superior level of awful episodes and inferior level of good episodes. Children will find this film colorful and amazing to watch but adults, otherwise, will have to find something else to watch. Is this movie worth watching? Let's be real and honest. It isn't, but it's a mess-free film guaranteed if you're up to a few chuckles here and there."}, {"rating": "9", "text": "A surprisingly hilarious and smart parody of superhero films.  It's not Deadpool by any means, but my god I still enjoyed myself!"}, {"rating": "10", "text": "This was HILARIOUS! I'm gonna see it again! What's more hilarious is how TRIGGERED OG Teen Titans fans are of how successful TTG is despite their unnecessary and obsessive bashing of TTG. GET. OVER. IT. TTG is here to stay and Cartoon Network will continue to make more because of it's viewership. Many CN titles have come and gone but TTG have been going on strong all these years because kids love it. I'm pushing 40s but I loOove how subtle the adult jokes are disguised as random nonesense the kids love. These OG TT fans just don't get it and sees it as some weak dumb nonesense and are so insulted that TT was replaced by a parody LOL!GET. OVER. IT. You have Young Justice. Aaaand, TT is getting a new season so... Yaay for everyone!"}, {"rating": "5", "text": "Another modern film that suffers from being far too stupid for its own good."}, {"rating": "8", "text": "Although the series is bad, the movie \"Teen Titans Go!\" Note a sense of redeeming, among many important DC characters, unexpected cameos like Stan Lee's, and a good story and characters make this movie something we wanted and we want to see from Teen Titans, moving away all criticism and failures it has so far the series, which killed the childhoods of several people, this movie was for my liking."}, {"rating": "7", "text": "This movie proves many things, such as:1. Kids can have their own version of Deadpool.2. We can have a musical Superhero movie.3. 2D animation still looks fantastic.4. Nicholas Cage can make a good Superman..... or at least his voice!5. A no-one-asked-for animated movie based on an extremely stupid animated TV show can be one of, if not the biggest surprise of the year!As silly as its inspirational, extremely hilarious, and surprisingly has a witty sense of humor, Teen Titans Go! To the Movies is actually pretty good tongue-in-cheek play on the superhero genre that somehow managed to make me see the dumb TV show in a different light.As for issues, there are some recycled meta jokes that didn't land well, and some dull moments halfway through. But my biggest issue is pretty much everything about the third act, excluding the last 5 minutes; a misplaced exposition that actually seems that it was just there to fill a plot gap, and infuriatingly clichéd denouement that has nothing to do with the creativity of the rest of the movie, case in point the clever plot twist that really surprised me.I didn't think I would say that about a movie that I only saw because its decent critical reception, but to be honest I actually want them to make a sequel!(7.5/10)"}, {"rating": "7", "text": "This movie is funny and entertaining, but a little weaker at some scenes. The movie started out ok, not bad, but also not great. The middle was actually very funny, the movie had a lot of surprising characters in it that was not expected, but was fun to see. The end of the movie was a little too rushed feeling, but was still good overall. The movie is actually pretty fun to watch."}, {"rating": "8", "text": "I have loved the tv show since it has started and I loved this movie. The animation was beautifully done and extremely colorfully pleasing. The voice over performances were great to. The movie was also very funny and cute."}, {"rating": "0", "text": "Awful movie one of the only movies i have ever walked out of and feel even dumber for watching. Not a single thing was funny about it. There were children in my theater that were so bored that they started playing games. Who is this made for when clearly children dont care"}, {"rating": "5", "text": "No da risa, esta super chafa todo ese universo de caricatura, el villano es una mamada, y todos las justice league esta bien pendejos."}, {"rating": "6", "text": "The irony of a superhero movie about too many superhero movies shouldn't be lost on anyone.  If you're actually sick of superheroes the meta jokes won't let up here, it's more of the same thing they're satirizing.  If you're ready for more, the absurdist laughs are here."}, {"rating": "8", "text": "The movie was quite hilarious and touching at the same time about Robin trying his best to be in a movie"}, {"rating": "9", "text": "This is one of the best TV show to movie adaptations I have ever experienced, and I have seen basically all of them. I'm not what I would call a fan of teen Titans go but as a parent who can absolutely fall in love with a movie that makes me laugh and puts a smile on my face. That is rare. Also the soundtrack is amazing."}, {"rating": "8", "text": "I start watching expecting nothing from it, came out that this movie deliver its genuine purpose, it entertained me, it made me laugh, have a good time and that's why I'm grateful to it."}, {"rating": "8", "text": "This was my favourite DC movie since The LEGO Batman Movie! This movie is absolutely hilarious! As for my thoughts on the show, I used to be on the hate bandwagon, but I’ve come to accept it for what it is. It is pretty loud and stupid and obnoxious, but it has gotten a lot more self-aware in the later episodes and I think the quality of the writing and the comedy has definitely improved. It’s almost like South Park or It’s Always Sunny In Philadelphia, in a way. As for my thoughts on the movie, it was hilarious with tons of great jokes about superhero movies and the Teen Titans GO! series itself. The animation does look pretty cheap, but it is very colourful and it does introduce different styles for certain scenes which were great to see. Could it get annoying at times? Sure, but it always came back with a genuinely really funny joke so it all evened out. The pace of the comedy is so fast that it doesn’t give the bad jokes any time to land before the next hilarious joke is told. It’s just always on and always moving! It did kind of feel like several episodes of the show put together at times and I don’t think this will appeal to people who are not fans of superheroes, but if you are, give this a watch! It’s like a kid-friendly Deadpool! Really hilarious stuff."}, {"rating": "4", "text": "The worst part about the movie was they put the GO versions in it. RIP og Teen titans, the only thing we got with them in it was ruined by the new ones."}, {"rating": "0", "text": "this movie is the worst movies ever along with the happytime murders! this movie is worse than the powerpuff girls movie!"}, {"rating": "6", "text": "I don't think this movie is horrible, but I don't think it's good either. At least it felt like they were putting a bit more effort into it than the show. The jokes were not that funny but I give it an \"eh.\""}, {"rating": "6", "text": "Its exciting and entertaining to watch. Decent plot. Had a lot of jokes that made me laugh."}, {"rating": "7", "text": "It was okay. It's not really something I would recommend, but it's also not bad. I actually thought it would be better to be honest, but it's fine for a movie of a pretty mediocre show."}, {"rating": "6", "text": "La serie me sigue pareciendo demasiado infantil e innecesaria, pero esto está bastante bien, mejor incluso que algunas películas live action de Marvel."}, {"rating": "10", "text": "another of the best film that i ever seen there are a lot of funny scenes, the story it's really good!you must see this film if you are a fan of cartoon network and comedy films.age +7"}], "recommendations": ["the_spongebob_movie_sponge_out_of_water", "tmnt", "scooby_doo", "ice_age_dawn_of_the_dinosaurs", "captain_underpants_the_first_epic_movie", "the_lego_movie", "alvin_and_the_chipmunks_chipwrecked", "chicken_little", "free_birds", "the_simpsons_movie", "hotel_transylvania", "the_spongebob_squarepants_movie", "minions", "alvin_and_the_chipmunks", "bedtime_stories", "yogi_bear", "hotel_transylvania_2", "the_smurfs", "the_angry_birds_movie", "peter_rabbit", "ice_age_continental_drift", "ice_age_the_meltdown", "monsters_vs_aliens", "scoob", "uglydolls"]}