{"id": 318, "title": "Tenet", "starring": ["John David Washington", "Robert Pattinson"], "runtime": 150, "genre": ["Action", "Thriller", "Science Fiction"], "description": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg", "categories": {"plot": 6.041666666666667, "acting": 6.157894736842105, "ending": 8.125, "soundtrack": 7.777777777777778, "cinematography": 6.0, "familyFriendly": 4.571428571428571, "funny": 7.5, "action": 7.863636363636363}, "reviews": [{"rating": "10", "text": "If you don't understand it doesn't mean the movie is bad!  Nolan's Masterpiece!"}, {"rating": "8", "text": "Christopher Nolan is one of my all-time favorite directors, so anytime he announces a new film, I'm already stoked for whatever it is! The man's a genius and constantly finds new and innovative ways to bend my mind and keep me guessing! Naturally, having greatly anticipated this latest film of his, I had high expectations, and I can happily say that they were met! Without going into too much detail (cause trust me, the less you know, the better), the film follows a nameless protagonist (John David Washington), who is recruited by a secret organization and tasked with stopping a potential global threat. He also finds himself navigating and bending the laws of physics and time through his journey. First off, the most impressive aspect of this film was easily the action/stunts and effects. Nolan is a director who prides himself in using as little CGI as possible and relying more on realism and practical effects, and it certainly shows here, as everything is so well choreographed! Even more amazing is the fact that he was able to pull it off and incorporate it into the tricky time-inversion aspect of the film! The performances from all involved are stellar, with a great lead performance from John David Washington (fun fact: he's Denzel Washington's son), as well as some committed supporting turns from Robert Pattinson and a very villainous and sinister Kenneth Branagh. In terms of plot and story, I can't even begin to go into too much detail about it, not because of spoilers, but because in all honesty, trying to explain it further would prove quite difficult for me, as it's quite an intricate web of a film. All you should know is that laws are heavily defied and bent throughout, time and physics are unpredictable, and you'll have to follow carefully in order to catch a lot of details, but it's well worth your time. There are some spots where the film seems to lose its footing a little and takes some unexpected detours, but it also happens to jump right into the action from the very opening scene, and hardly lets up until the very end of the film. Overall, even at two and a half hours, it all feels very tense, tightly paced, and left me pretty floored by the end, even if I mostly felt that it doesn't quite live up to some of Nolan's previous films. But the biggest word of caution I can offer is that like with many of Nolan's previous films (Memento, Inception, Interstellar, Dunkirk), the narrative and science can be a little hard to follow, but just stick with it as best you can, and it'll more than likely be worth it in the end."}, {"rating": "1", "text": "Well this was a lot of boring and ridiculous pretensions nonsense. It's been a long time since Christopher Nolan made something good."}, {"rating": "10", "text": "Tenet is Christopher Nolan's Magnum Opus. On the technical side, few films in history have anything like the action of this film. Every Scene is Magic, and you will think, \"How making this is even possible?\". And that \"No Green Screen\" rule is paying off. Because of that, you can believe the most unbelievable things are happening on the screen. Tenet never looks like animation or something full of CGI effects. And when you watch it, You will probably accept that fact is so important.Suppose someone mutes this film and watches it. It's perfection. If someone shot the picture off and only listen to the sound of this film, It's Perfection. So When they get combined, Tenet has become an experience like no other.Ludwig Göransson's Awesome Score has been synced with every scene and is adding to all of them. I love Hans Zimmer, but right now, I don't think even that great man was capable of doing this. The reason is this music feels different from anything I've ever heard in any Christopher Nolan Film.I've watched Tenet twice (So far); the First time, I loved it, and the second time, I loved it. The script does a great job of presenting everything to you in the best possible way. And at the same time, Tenet has fewer exhibition scenes than Interstellar or Inception. So every time you watch it, you will be focused on more things. But It's understandable and self-explaining. The reason that a lot of people will more like The Story for the second time is the fact that THE FILM IS UNBELIEVABLY BEAUTIFUL. It has some shots, which made me speechless and gave me pure joy. As much as I couldn't focus my mind on the story and wanted to be just thinking about the Perfect Picture, I'm watching.This film will stand the test of time. I don't want to spoil anything, So I can't talk about how much I love some of the characters and how the actors have got chosen with no miss fire. But even if you read the full screenplay of Tenet, Watching it is ten times better than just knowing the whole story. Tenet is THE Cinema, at it's very very best."}, {"rating": "9", "text": "To fully understand the time concept and to grasp the very complicated timeline second viewing is required. Thankfully it effaced many of my uncertainties or problems in my first screening and impoved the movie by a lot."}, {"rating": "9", "text": "Powerful. Tenet is one of Nolan's best movies. Incredible action and the music is incredible, thanks Nolan."}, {"rating": "10", "text": "Nolan did a great movie, but not a masterpiece. This is a complex, amazing and very interesting film. Debicki's and Branagh's performance is just something... The sound is sometimes loud, but overall it's ok. Music is just incredible, mystical and intense, thanks to Ludwig Göransson who did a great job. The cinematography is a high level! One of the main disadvantages of this film is a very very complex and complicated plot, so it's hard to understand the movie from the first viewing. But I recommend everyone to see it (especially in IMAX cinemas)."}, {"rating": "9", "text": "First things first, never ever trust the dumb review from the critics. They don't understand the plot and they say the movie story-line is bad and stuff. For me TENET is the best Christopher Nolan film second to INCEPTION. It may have much more action and much more complex idea, but it doesn't seems to have the heart of INCEPTION. But still, I'll give it a 9/10."}, {"rating": "10", "text": "Tenet is a masterpiece. Watch it in theaters for the best experience. You won't regret it."}, {"rating": "3", "text": "The movie is a pretentious, exposition heavy mess, it throws around terms like plutonium and algorithm just to seem complicated, but it's quite simple and unoriginal, John David Washington is a great actor and exudes charisma, but his character and the entire cast are undercooked in typical Nolan fashion, the female lead is a tired, boring caricature, and even the actress's performance cannot salvage the role, another underwhelming Nolan flick, though not as bad as the inception"}, {"rating": "10", "text": "This is the most ''Nolan'' movie since Inception. Who loves his movies will love this movie too. Who doesn't love his movies, will find something too, because the action is mind blowing. The first 90 minutes the movie is a hard core spy thriller, but the lats hour the movie turns into an epic, mind blowing Nolan movie where you ask your self ''how did he film that?''. For me personally, this is the best movie of the year so far."}, {"rating": "1", "text": "Loud mumbling incoherent nonsense. Second time I ever walked out of a film."}, {"rating": "2", "text": "I went to this movie with my friends a few days after the premiere, and was shocked to find nobody else in the theater. If only I knew why, I probably would've saved a couple bucks and my time. About halfway into the movie I realize that I literally have no idea what is going on. I turn to my friends, and it seems that they are completely lost as well. We ended up walking out about halfway through the movie. This feels like one of those pretentious artsy movie people make when they realize they could sell people anything. With enough big names, people will watch anything and pretend it's a masterpiece. I feel like most of the high ratings come from people being told that this is a good movie, and that they are complete idiots if they don't understand it. I give it one point for being very easy to make fun of with my friends, as well as one point for reverse car, the only enjoyable thing in the actual movie."}, {"rating": "2", "text": "Now a serious question. What's great about that? I saw him for 10 minutes and was already bored. Yes the stunts and effects are well done. But what kind of lame production is that? The dialogues don't add anything just suspense or story.As an audio book it would be a recommendation but as a film it would be a total failure."}, {"rating": "0", "text": "This is so inept, emotionless and devoid of nuance it's actually annoying. And I'm someone who likes Inception and Interstellar. Those movies at least have an emotional core, which I'm starting to believe was an accident because this film was so soulless. Not only does Tenet have bland characters and bad pacing but terrible sound design coupled with too much expository dialogue. A mess"}, {"rating": "3", "text": "I see that a lot of Nolan fanboys are trying to knock any criticism saying that \"Oh that's 'cos you didn't understand it\". Oh what rubbish. I'm a fan of most of Nolan's work (Dunkirk is a masterpiece) but this I found to be an unsatisfying and cold movie. Firstly the pacing was all wrong with no establishment work done on the different locations, just a frenetic rush from one set-piece to another after the laboured exposition hour is out of the way! The set pieces themselves, aside from the opening one were the opposite of immersive, the biggest fault I found with the movie. They should deepen the magic of the cinema transfix-ion experience, not break the spell. The inversion gimmick felt derivative and just not as good as Nolan thinks it is - certainly not enough to hang the whole movie off of. It's a high-concept fail in this case unfortunately. Three out of Ten-et. I fear that Nolan may have peaked and is in decline. It's really about time that he called time on the theme of time, at this time."}, {"rating": "2", "text": "(((This is probably the dumbest movie I seen in a long time!))) I actually like some of Nolan's movies, but this one is terrible. This movies premise is fine, and under the right direction would have been as good as Inception. However,  Nolan directed this movie like he was on Speed! That's a fact.  A lot of fast pass incoherent scenes I will definitely have to see again just to understand that the movie really is incoherent not me. Whew!!! And I thought I was on a bad trip, nope its just Nolan. What I liked: 1. Hard concepts being thrown at the audience like they know what's going on. Call me a snob but I am up for a challenge. I don't appreciate easy dumbed down material. Besides we are in an internet age, people should be willing to look these things up. Its not like it wouldn't take more than ten seconds. Just saying!    2. It is a well acted movie despite the dumb dialog, and objectional  ways characters plod on with minute character development.    What I don't like:    1. Over the top convoluted plot with many working parts, but no payoff.  I think if the action, events and storyline was simplified   we would have had a better understanding of what was going on. To go here and there for a McGuffin was rather stupid, or to chase McGuffin to meet a character did not work for me. Seems like busy work. 2. Characters appear cold because we don't know them or care for them. The only character that seemed fleshed out was the billionaires wife (I don't remember her name proven my point). If Nolan did the same for others it would have been more tolerable a movie. Nolan does not give his main character a name, but a title. Not a good idea, its smug! 3. Motivations and plot holes that make no sense. There is a lot of them and makes this movie seem messy and chaotic. There is a scene where I don't understand why character are at this place that they are suppose to be. It's just writing into story so characters can have temporal encounters and have a cool looking scene. Its like the editor needed to cut the scene but kept it in movie. 4. Fowards/ backwards running, walking, or battling was cringe!  In other words it like rewinding a movie while having other characters fight the tide. Stupid! The the whole movie is this. Here is my solution one group stays in current universe, one goes into another past universe only during temporal disturbances do they see each other, interact, or objects get moved or disappear. Yeah, it would have been a lot of ghosting going on, but it would have been fun. I think Interstellar had scenes like that, and did the storyline collapse, no! 6. Exposition men! Nolan does this alot! Characters that are there to explain stories are lame. But characters that are there to explain concepts and story at warp speed, are....still lame. Imagine someone came off the street and explained Einstein's Theory of relativity in two minutes then expected you to write a paper on it. That is the way this movie feels. And no, I do understand this movie, that's the problem 6. The dialog is unrealistic, no one talks like they do, there is a lot of cliché dialog, might I add some of it was very cringe for an cerebral movie like this. It takes you out of the movie. 7. This movie is very task oriented so much so it brings to mind Olympic relay racing one runner passes off the torch to the next and so on. There is Mcguffin finding, finding people to do the next task, and convincing people to let the main characters tag along. So minor character get introduced to only to run the race. And most of the dialog is around that. Again not really a movie more like Iron Man or a trilithon.    I am sure that Cristopher Nolan had a masterpiece in his head but he got caught up in the complex churning monster that is this plot. I would probably recommend renting this movie."}, {"rating": "2", "text": "An embarrassing exercise in self-indulgence. 90% of the dialogue is exposition. The characters don't talk like people at all. Script felt rough and hastily put together. The ideas are forced to the point of cringe. Action sequences are awkward as is the norm in noylan's other movies. It's too self-impressed and tiltilated by its own cleverness. It's just not enjoyable to watch. Nolan is a hack. The Emperor has no clothes.  I couldn't care less abt the characters. The premise is frankly incredibly stupid. Good luck understanding the dialog. Sound mix is all over the place coupled with the most annoying soundtrack since inception. Nolan is a sick mentally disturbed individual."}, {"rating": "1", "text": "One of the worst and most confusing plots, if there was one, ever. Ridiculous camera work with many shot reversals that will give you a headache. Don’t encourage production of such shoddy work by seeing. Watch on prime for a $1.00 when it burns out in theater. Lead actress strangely floats in lifeless passivity. Utter loss."}, {"rating": "8", "text": "The music and sound mixing are way too loud, when the characters are explaining stuff or when there's a dialogue scene, I can't hear them because of the music. Although, many people make it seem like it's bad, but it really isn't. There are some qualities that you'll expect from a Christopher Nolan movie. Nolan basically had a great idea for a film, and basically didn't know how to execute it to the big screen."}, {"rating": "10", "text": "amazing pacing amazing acting amazing script AMAZING EVERYTHING god i love this movie. it's been a month since i saw it and im still thinking about it and taking it in. calling this nolan's worst work....r u kidding me? it's one of his best and a lot of people failed at making an emotional connection and seeing the purpose of it all really which i get and all i have to say is WATCH IT AGAIN. our brains are consumed by the Booms and the Pows, that's why all you should try to do is experience it. Feel it. That's what i did."}, {"rating": "10", "text": "I honestly understand why people would be mad that the character doesn't really have any motivations, but for me, that's something I can overlook with a concept THIS cool and well executed"}, {"rating": "10", "text": "Nice film. did not expect the movie.  Accidentally saw it at the box office.  I love Nolan's work.  I watched the film in one breath, intrigued the plot, pleased with the shooting, the music.  but what can we say, we yearned for films in the cinema"}, {"rating": "8", "text": "Christopher Nolan é um diretor extremamente necessário para o cinema. Filmes como \"Inception\" e \"Interstellar\" foram grandes suspiros para uma indústria que vez ou outra cai na monotomia. \"Tenet\" pode não ser o seu melhor trabalho, mas merece reconhecimento por continuar fora da curva, principalmente depois do mediano \"Dunkirk\"."}, {"rating": "8", "text": "This is not Nolan's best work but it ca get close to being one of his best at times. The movie itself and its premise can be quite confusing which leaves open a lot of opportunity for rewatches and although it definitely has issues I got really involved with the characters and their story and overall really enjoyed the movie. The Special/Practical effects are incredible as expected from a Nolan Film. The normal vs inverted fight sequences are something so creative and well done which I don't believe I would have ever seen if it wasn't for Nolan's creative mind. The acting is also really strong here with John David Washington doing a hell of a job and Robert Pattinson being the real MVP for me surprisingly. In conclusion, aside from it having a lot of exposition dumps a pretty confusing premise and plot (at points) and a not really interesting villain who's main motivations are the good ol' \"if I can't have it either can you\" it's a pretty good movie that is bound to get you entertained for a couple of hours and even after watching it as you try to properly understand the laws of this world and etc."}, {"rating": "8", "text": "Good but not that perfect like Inception nor Interstellar. Didn’t meet my (too high) expectation."}, {"rating": "7", "text": "Confunso e com cenas de ação muito bem feitas, essa é a melhor frase pra resumir tenet. E eu espero estende-lo futuramente"}, {"rating": "8", "text": "Ich mochte den Film. Er hatte eine Gute Story und der aufbau war mal was neues als immer der selbe explosions **** wie in jedem anderen film. Nur was mich an diesem film störte sind die kampfszenen. Diese vielen schnitte zerstören das erlebnis ein wenig. Man kommt nicht mit und verliert sich schnell jedoch alles andere top."}, {"rating": "7", "text": "A visual awe inspiring film which you need to watch with brain switched on and taking mental note of everything as it goes along. One big down side is you simply cannot understand what some characters are saying at times. It's one thing struggling to keep up with a film but when a character can't be heard due to the way the director wanted it then in my book that is a poor decision. A film to watch again and to pull apart but the sound is as baffling as some of the visuals."}, {"rating": "7", "text": "These last few days since the reviews of this film began to circulate, there was something that stood out in many of the reviews from professional critics.And that is that apparently because of the situation we're currently living in, Tenet became overnight the film that was going to save cinema.That in my opinion added an unfair burden on the film and unfortunately became a dark cloud that now hangs over it.Now if in addition to that, we add the weight that the name of Christopher Nolan involves, it goes without saying that Tenet raised expectations that it was going to be unable to satisfy, unless it was an epic masterpiece and Tenet is far from that.It's funny that after such a huge film as Interstellar, Nolan decided to go to smaller scale with Dunkirk, which was clearly his most sober film since The Prestige, but now going back to present a huge show, I feel that Nolan, perhaps, for the first time in his career, exceeded his ambitions.Tenet by its very nature is a complicated film. It's not a film that will break your head as a lot of the press has led the public to believe, but it is a complicated film.But more than anything it feels like a film that gets complicated gratuitously.I must explain clearly that this is due to its own concept, and the concept is great but what in Inception felt organic, even though it was complex, here it feels like an introduction that never succeeds.And it's that when you need to explain so much, the emotion that gets paused, it also gets diluted.And on the action side, I can't deny that Nolan knows his business. You only need to see the scene with which the film opens, because is simply spectacular.In that aspect I cannot complain and that action it's one of the reasons why this film grows.Tenet is perhaps the best mainstream film to come out this year, yes I know, we don't have many film in that regard but I mention this because that doesn't make it special in any way.The problems, from the excessive duration, to the cartoon villain, undermine many of its aptitudes and is that ultimately, the key problem with Tenet is not that it's not going to meet the expectations of the audience, but is that cannot live up to its own concept.I mean, even Hans Zimmer's absence is notable.Christopher Nolan delivers an entertaining huge and ambitious film that is also, distant, cold, pretentious and self-indulgent.His fans will defend him tooth and nail and his detractors will hate it without hesitation, but the last word will be entirely yours.I enjoyed it but I wasn't impressed. But understand that at no point, not even with the insistence of Nolan and the studio to release it in theaters, that Tenet wasn't going, nor did it have to save the movie theater experience.That's up to us, the moviegoers."}, {"rating": "7", "text": "Nolan continues to challenge our established notions of cinema, especially of linear storytelling and cause effect. Watching Tenet is like peeling an onion from the outside inwards, and from the inside outwards. Towards the end of the film you have some notion of meeting in the middle, but you know many viewings are needed to connect the roots and branches of this complex tree. As a visual storyteller Nolan continues to deliver, his set pieces and action sequences are adequate, though some moments seemed repeated from previous outings especially Dark Knight. Some vistas seemed like fillers lifted from random Bond films. The underlying technology of inversion was not adequately explained to a science buff like me, and seemed somewhat glossed over for convenience. The communication between present protagonists and future masters could also benefit from additional expansion. The abusive marriage in the center of the plot seemed a distraction and not conducive to the conclusion. The movie is a challenge to watch in trying to keep diametrically opposite timelines unified in the mind. There are several aha moments when you get the satisfaction of realizing or predicting what just happened, but long stretches of head scratching in between. Definitely cerebral cinema for formidable minds."}, {"rating": "8", "text": "E-Value: 8Acting: 9Plot: 7After being delayed multiple times due to the COVID-19 pandemic and theatres are slowly started reopening for business especially in the overseas, Tenet finally made it to the big screen.After being captured by Russian mercenaries during an undercover operation in Kiev, the unnamed CIA operative only known as “Protagonist” (Washington) is rescue and recruit by a mysterious organisation called Tenet. The organisation’s mission is to ensure the survival of human race where the protagonist learn that there is an existence of a weapon that can wipe out the past.The protagonist works with his handler and another member of Tenet, Neil (Pattinson), to track down an Indian arms dealer, Priya. She has made dealings with a Russian oligarch, Andrei Sator (played by Kenneth Branagh), who can apparently communicate with the future. To track him down, the protagonist approach Sator’s estranged wife, Kat (Debicki), for her help to stop him.Just like any other Christopher Nolan’s movies, Tenet is simply amazing and masterpiece. This movie is so unique in a whole new different level especially this movie deals the flow of time, which is the main plot device. The concept of using the flow of time is very utilised something which have never done in any other movies.The visual effects are very well done especially whenever the characters moving backward through time. The aeroplane crash into the hangar is very realistic and to make it even better, it’s actually real and not using any visual effects. Nolan managed to make it into a spectacular scene which I considered it to be a signature and most memorable scene in this movie. The action scenes are very awesome as well.The performance of the casts is great especially John David Washington and Robert Pattinson. Both of them have a great chemistry working together in the movie. While Washington is great but Pattinson is awesome in the movie but thankfully, he never overshadows Washington’s main role. I think Pattinson’s acting in this movie proves that he has moved on from his iconic role from Twilight series and he is capable of playing any roles. It’s no wonder that Matt Reeves chose to cast Pattinson as Batman and I’m confident that he will be great as Batman after watching The Batman’s DC FanDome Teaser.Be advised, though. The movie’s plot is going to be confusing since this movie deals with the flow of time. You will find out yourself hard to keep up with the story including myself. If you have watch 2010’s Inception which is directed by Nolan, then you will know I mean. Having said that, you are going to need to watch Tenet at least two to three times to understand the story just like Inception.Despite the confusing plot, Tenet is very much enjoyable movie to watch in the year of 2020. Definitely a movie that I recommend to watch."}, {"rating": "10", "text": "If you like Nolan's movies, this one is definitely one of his best.The plot was peculiar but great. If you really want to understand it, you are probably best to watch it again.After watching the movie, I felt confused but happy. I'm probably better off watching it again, to fully understand it.If you are thinking about watching the movie, go for it!Only problems I had was the audio. It was too loud for my taste, might be because I was sitting quite close to the speakers, but I would advise picking seats at the cinema carefully."}, {"rating": "10", "text": "I hadn't seen this greatness in a movie since Inception.This is truly a must watch, in my top 3 for Christopher Nolan's movies. The writing is on another level, character development, mystery and drama are top tier. Niel's (Robert Pattinson) character development is the best, clearly the underdog in the movies and true hero.This movie deserves an Oscar for best Picture, Best Support Actor and Best Score. That said I doubt the Academy has any eyes for good taste or creativity, as they've shown in the past with Nolan's movies."}, {"rating": "7", "text": "Watchable, but not perfect.Just like a junior high school student composition with piled up rhetoric."}, {"rating": "10", "text": "It is very difficult, but it will be very fun.Don't try to understand...Just feel it."}, {"rating": "10", "text": "I found an incredible film. The plot is very interesting and complex. The action of this film is very good. The soundtrack was very well done, it's great. Another great film by Christopher Nolan."}, {"rating": "10", "text": "It's a Nolan, it's good on start because it's Nolan. THX FOR THIS FOR MY EYES"}, {"rating": "10", "text": "Christopher Nolan's TENET tells an interesting story and offers a screenplay that I find very intriguing, but the hype and emptiness of particular scenes, characters doesn't give this film a spice it should've had for a spy movie"}, {"rating": "8", "text": "Pros:Visual spectacle and music/audio combine for an aesthetically pleasing and captivating experienceTechnical achievement in the reverse scenes and fitting them all together in the timeline especially with the same actorsKenneth Brannagh is convincing as a Russian mafia boss but his small stature somewhat diminishes his presence.The music is very catchy and when it begins you can't help but get excited for what comes nextJohn David Washington plays his role well.Cons:The writing - dialogue comes off somewhat as if reading off the scriptCharacters are flat and one dimensionalStory is fairly bog-standard nothing Some misgivings with the reversal concept such as why cars are reversed if they exist in the non-reversed world but there is nothing to break suspension of disbelief if you don't think about it too much (like is said in the movie). Overall the effect is visually interesting and exciting when you revisit earlier scenes but reversed but as a plot device it is in the end unsatisfying.The twists are fairly obvious especially for someone used to seeing Christopher Nolans films and others with cues like Shutter IslandElizabeth Debecki is unconvincing as a lover, and hard to sympathize with.The guy out of the Beatles movie was comically miscastRobert Pattinson's character is inconsistent. He starts off as a character who is slightly loose and eccentric with a strange past, which was exciting to see him playing a brand new character but he loses this by the next scene and by the end becomes a heroic Cedric Diggory or Edward Cullen. I would have liked to see more development for him and or more homogeneity in the role on his part.The final battle lets the movie down. Something involving the water such as submarines or the nuclear vessels would have been more in-line with the rest of the movie. All of the scenes with the hardened officer and military vehicles looked like they ended up in Afghanistan.In the end it is a visual and audio sensation but not very appealing in the story or character department.As is standard with Christopher Nolan films writing and acting falls down but visual and audio make it a spectacle worth seeingI think with better casting and some more character development perhaps with more twists and a plot to be more emotionally invested in it could be improved. Overall perhaps it needed another writer on board or more time in the cooking pot to come up with a more in depth plot. Christpoher Nolan shows his strengths in visual and technical direction but it requires the human element to really make a film that hits home.I feel it deserves a high score because it is just simply leaps and bounds better than most of the movies that have come out in recent memory but it also by no means a perfect movie or even close to it for that matter. That said the visual and audio appeal as well as the mysterious nature of the reversal concept along with Kenneth Branaghs character, his background and the whole tie in to that ominous atmosphere around all things nuclear make it definitely worth watching."}, {"rating": "8", "text": "Tenet was an intense rollercoaster ride that left me guessing at logic more than once. Perhaps this was Christopher Nolan's most ambitious film to date with a fantastic soundtrack (which, by the way, was way too loud for us to really enjoy it) and different timelines that eventually came together. The biggest downside to this film is simply that it is (almost) impossible to understand when you see the film for the first time or ‘just once’. Still, this film really left me thinking about the plot for days. In comparison; Inception was fun and difficult in a good way.  Tenet takes it it a step further and rubs against the edge where the difficulty of the plot almost gets in the way of the fun and enjoyment."}, {"rating": "8", "text": "Firstly, I got to praise the originality of this movie. Yes, it is a spy espionage movie and borrows a lot of element from the previous movies of the like. However, the use of \"Inversion\" really adds a layer on top of this movie and makes it feel like no other movie has. This \"inversion\" is best seen in the action sequences which result in some visually stunning spectacles. On that note, the action sequences are phenomenal from the car chase to the plane crash and my favourite being the fight scene between the protagonist and an inversion soldier. It's even more impressive when you realise that most of these action scenes are practical and not CGI which benefits the movie by not taking the audience out of it and keeping as glued to what's going on.Unfortunately, legendary composer Hans Zimmer does not return for Tenet and is instead replaced by Ludwig Göransson of Black Panther and Mandalorian fame. Despite that, Ludwig gives an impressive electronic score that elevates every scene and is deafening in a good way. If you didn't know Hans Zimmer was not scoring this movie and watched it, you still probably would think Hans Zimmer was still scoring it. The story is also intriguing enough to keep the audience engaged. It is simple with the agents having to prevent the \"Russian\" bad guy from dooming the world! However, the inclusion of inversion does add an extra element to the plot and makes the audience think about the movie. Even after it was finished, I was still thinking about the movie. The inversion adds an element of unpredictability to the movie and starts to change the way the movie operates. However, this inversion doesn't take focus until halfway through the movie. For the first hour, it is just a spy espionage movie with a lot of exposition and setup but the second half goes into high gear and is when it gets really good.The actors are for the most part give really good performances. Special mention to Elizabeth Debicki as \"Kat\" who gives an emotive performance of a woman who is practically in a domestically abusive relationship. John David Washington as \"The Protagonist\" (yes seriously...) has the suave and coolness from an agent spy, Robert Pattinson as \"Neil\" gives a lot of charm and wit to his performance and Kenneth Branagh as \"Andrei Sator\" is frightening in his performance as the villain.  One major flaw about the movie, in my opinion, is the characterisation. You can already see this when the main character's name is never mentioned whatsoever in the movie. Apart from Kat (Elizabeth Debicki ) and Neill (Robert Pattinson), to a certain extent, are very bland and one dimensional. The protagonist (John David Washington) is the \"good guy\" and doesn't have anything else from that. We don't know his backstory, his feelings or even his real name for that matter. The character doesn't even have that big of a reaction to the inversion thing either and can feel rather robotic. Andrei Sator (Kenneth Branagh) suffers from a similar aspect to the protagonist is an over the top Russian bad guy and wants to end the world and wants to control his wife. There are some other supporting characters introduced in the movie and sadly they also are lacking in depth. The only emotive aspect in this movie is the abusive relationship between Kat and Andrei Sator. However, apart from that the movie very lacking in a lot of humanity and emotional moments.The second major flaw is the sound mixing in this movie. The voices of the actors are just so muffled or rather low sometimes which makes it hard to hear what they are saying. This gets even more difficult when the characters are wearing a mask or have incredibly strong accents like Kenneth's Russian accent. Occasionally, the loud music score is really loud during conversations between characters. This is quite detrimental to the movie as every dialogue is really important to understanding the movie and not being able to hear it because of weird sound mixing is not great.A minor flaw is the \"inversion\" explanation. It is still quite confusing to understand and while it is explained in the movie to a certain extent, it can still leave you rather confused and dumbfounded. It isn't a major problem as it gives a rough idea of the concept and in the end, this rough understanding is all that's needed to enjoy the movie. Just like a character says in the movie \"Don't try to understand it, Feel it\". Although, that is kind of a blatant reason for the director to not explain everything...Overall, the movie was a blast to watch. It is a bit weaker compared to Nolan's previous movies but is still stunning to watch. It is a grandly entertaining movie that is an absolute spectacle. I highly recommend considering watching it in a theatre as this movie is best experienced there in all its glory."}, {"rating": "7", "text": "So Tenet is not a bad movie. But it is quite complex. I didn't enjoy it, as much as i would have liked, however my score could be higher if I watch it a second time. But what I did like was the beautifully visual effects. That I must say, is something amazing work. The best thing about Tenet, is Ludwig Göransson's amazing score. That is just some goosebump music at its best.Of things I dislike, of course I dislike that I think the story is too complex at first, but that doesn't mean it is bad. But one thing I found annoying was the quick cuts. In about 5 minutes The Protagonist went from Norway to India to the UK just without any real development in the story, but just for the sake of the locations been present multiple times. It is like the cuts were randomized.Also there wasn't much development about the characters. The antagonist Sator is everything a \"normal\" villain is, with a agenda like every other villain. That is fine, but it is nothing that haven't been seen before.So a good \"visual effects\" movie with a complex story, that deserves a second watch to figure out the story, and then my score might be higher."}, {"rating": "7", "text": "Nolan Nolan's too hard. A visceral masterclass that rattles the brain and chest,  but misses the heart."}, {"rating": "10", "text": "As a form of pure entertainment Tenet is a masterpiece.Its a smart thriller that forces you to pay attention and think.Incredibly well written and magnificently shot.The entire cast is on point.I'm not saying I understood all of it, but I know I really, really enjoyed it."}, {"rating": "10", "text": "thats was cool    well worth a watch and an itching head of ambition.    .."}, {"rating": "10", "text": "Masterpiece.Days later I’m still thinking about it.Helluva an experience."}, {"rating": "10", "text": "I won't lie you will probably be lost at the beginning.Knowing how sadistic Nolan is I knew what I was getting myself into. it is only toward the end that everything makes sense even after the credit rolls.I got an even more profound comprehension of the story in its whole and the impact of every action taken by the protagonist.. Watch it while it is in theaters to get the most of the experience. Definite orgasm for the brain."}, {"rating": "10", "text": "Nolan's brain-teaser takes action sequences and time-travel and makes the movie of the year."}, {"rating": "2", "text": "The idea of the movie seemed nice enough but the movie itself turned out to be terrible. I do not understand all the good reviews. In my opinion it is just another boring action movie. The story is unnecessary confusing and hectic. The dialogues and the characters are flat. After watching the movie you do not even remember the names of the characters because you simply do not care. Some of the visuals and effects are nice but the amount of explosions can not hide the bad storytelling. Overall, in my opinion the movie was not worth the money. Best about the cinema visit was the popcorn."}], "recommendations": ["the_prestige", "what_happened_to_monday", "fantastic_beasts_the_crimes_of_grindelwald", "inception", "bad_times_at_the_el_royale", "sicario_day_of_the_soldado", "project_power", "now_you_see_me", "tinker_tailor_soldier_spy", "the_counselor", "the_gambler", "the_equalizer_2", "avengers_age_of_ultron", "blackhat", "interstellar", "shutter_island", "drive", "inherent_vice", "hugo", "the_accountant", "good_time", "nerve", "chaos_walking", "predestination", "gone_girl"]}