{"id": 376, "title": "Terminator Genisys", "starring": ["Arnold Schwarzenegger", "Jason Clarke"], "runtime": 126, "genre": ["Science Fiction", "Action", "Thriller", "Adventure"], "description": "The year is 2029. John Connor, leader of the resistance continues the war against the machines. At the Los Angeles offensive, John's fears of the unknown future begin to emerge when TECOM spies reveal a new plot by SkyNet that will attack him from both fronts; past and future, and will ultimately change warfare forever.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/oZRVDpNtmHk8M1VYy1aeOWUXgbC.jpg", "categories": {"plot": 6.431372549019608, "acting": 6.419354838709677, "ending": 5.1, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 7.4, "action": 7.032258064516129}, "reviews": [{"rating": "8", "text": "it is certainly not a classic but it is a welcome return to form, from both Arnold and the script. It's twists and turns are enough, to hold you at the edge of your seat."}, {"rating": "9", "text": "I thought that Terminator Genisys was great. I liked how nutty the plot was. Arnold was awesome and Emilia Clarke is fantastic. Very cool movie. The critics have been too hard on this one."}, {"rating": "10", "text": "I really enjoyed this film!! It brought me back to my childhood when i found the first terminator movie on vhs in my dads collection of movies. Its not perfect but dang its good!!! Things have changed, its not a repeat of the first two films. It builds upon the time travel concept and what can really happen with the ability to time travel."}, {"rating": "1", "text": "NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!!!!!!!!!!!!! I dont ask for this!!!!!!"}, {"rating": "4", "text": "Convoluted story, lack of focus, teenage humour. A dumber version of Back to the Future with sexier characters.\r It's not enough to cast Arnie to call a flick \"Terminator\"."}, {"rating": "5", "text": "Were these guys stoned wen the made this move. Turning this into an alternate reality is not the good way to make a film. It was like a poor remake of Terminator 3. Please kids don't do drugs. And if you do drugs please do not make action films."}, {"rating": "4", "text": "It's already obvious that it's going to be better than Terminator Salvation but it won't be better than Rise of the Machines and basically the first two movies. Sure it was a lazy rehash from the first two movies, but you got to admit though..... it did better than Salvation."}, {"rating": "5", "text": "What to say about this one... Well, I'll say it's the blandest movie of 2015. This was far from an awful movie, but it's easy to see why so many fans hated it. The T-1000 went down way too easily. Honestly, I liked the T-3000. It was meant to be a hugely dangerous new terminator model, but it went down in a way that didn't really make sense. Not really recommended, but not exactly a waste of time."}, {"rating": "3", "text": "Terminator Genisys from the very beginning betrays the original canon of the series, simply crosses out the ending of the cult 2 part. And everything for what? For the sake of the new Genisys where there is not one new idea. Where they try to tell the same thing, just give it a new name. The plot is generally so stupid that you wonder if this movie had a script. There are not bad action scenes, but they go in the sum of 10-15 minutes, and the rest of the timing goes to dumb dialogues. It's even scary to imagine what will happen in Terminator: Dark Fate."}, {"rating": "0", "text": "the worst movie in this saga, it's so bad that it can make you sleepy, if you suffer from insomnia it's the ideal cure."}, {"rating": "7", "text": "I liked most of the movie i think this the best Arnold has acted since T-2."}, {"rating": "6", "text": "This is the first Terminator movie I've seen. I found it to be a bit confusing at times. The acting was very average and the dialogue was bad in some scenes. I could tell they were acting and that's not a good thing. The action was good but nothing blew me away. This is a average action sci-fi with nothing special about it. The 3D was pretty good but not great either. So overall just a average movie. I wouldn't watch it again. But I didn't hate it either."}, {"rating": "0", "text": "Absolutely terrible. Only good actor here was Arnold Schwarzenegger. This was an absolute cluster f*** that was riddled with plot holes, over the top ridiculous action scenes, mostly unlikable characters, a bad plot and it made the absolutely idiotic decision to make John Connor imto an evil machine. Genesys is basically Ios that has a hologram thst starts as a kid then becomes an adult when it’s activated. That’s how moronic the plot here is. Dark Fate was bad but not this bad."}, {"rating": "9", "text": "To me, what this movies suffers from is jaded audiences.  What's the standard now for summer blockbusters?  If the script is good, usually meaning a team of collaborative writers as with Pixar's best movies, and the production values above average, the movie is pretty enjoyable or perhaps near-great.  This certainly describes the Marvel movies of the last five years and Jurrassic World as well.\r How can people LOVE Jurrassic World but hate T-Genisys?  Jaded audiences?\r T-5 is not quite as good as the under-rated T-4, the fable of a Terminator who wished to become a human being.  Wonderful storytelling.  T-5 is almost this good.  Its virtues for me are the tender care and consideration given to Terminator lore and to Arnold in his role.  If you liked T-2, you probably liked how the two Terminators crash up a shopping mall.  That same wonderful energy of casual destruction of cultural places is duplicated--not imitated--in T-5 when they casually crash up a hospital and police station.  Duplicating the look, feel and energy of one of the strongest images of Cameron's T-2 is no small feat.\r You'd think the excitement of Cameron's original liquid metal Terminator in T-2 would be hard to duplicate.  Allen Taylor's oriental cool and deadly liquid T-2 equals or surpasses the original, again, no mean feat.\r So what's not to like?  If you liked T1 and T-2, I suspect you'll really like T-5; unless of course, being jaded is a value to you."}, {"rating": "9", "text": "I'm a really big fan of the first 2 Terminator movies, and I think that Rise of the Machines is a bit underrated. Salvation was horrifying, and I feared that Genisys will be the same. And how incredibly wrong I was.\r Genysis is WAY better than Rise of the Machines, for me it was on par with the first movie, and only a bit worse than Judgment Day. Certainly the best Schwarzenegger movie since he came back to filming. The story was twisted enough to be fresh, the action was top-notch and the only thing I was disappointed in is that the T-1000 was destroyed too fast. I really wanted a duel between the T-1000 and John Connor (it could explore the fact that the T-1000 can become self aware and give the middle finger to Skynet).\r So the movie was great I think, and I would like to ask the critics: what the hell have you watched guys? Seriously, 2.5/10 and 1/10? You have got to be kidding me. Why do I have the feeling, that because of Rise of the Machines and Salvation you gave the movie 2.5 and 1 BEFORE even seeing it? To be honest, I got to the point, when I'm thinking that I don't care about the international critic reviews anymore.\r So my message to everyone who saw the previous Terminator movies: forget Salvation, and see this. You won't be disappointed!"}, {"rating": "10", "text": "There is always going to be naysayers about everything but as a Terminator fan in short with Genisys they have finally broken the Judgment Day \"infinite loop\" timeline all the other films have been stuck on bastardising and provided a launchpad to actually, at long last, move FORWARD with the Terminator story. Yes, there are some things that are only briefly touched upon but to fix all of the **** of previous films would of required Genisys to be **** 5 hours long so once again do not let all the negative prattling put you off, Genisys has neatly and tidily ended the Judgement Day loop. Also be sure to stick around until after the credits roll ;)"}, {"rating": "3", "text": "Terminator Genysis is basically a dumber and more convoluted film than Terminator 3. The film either retreads old ground or gets entangled in a convoluted story for the sake of resetting the timeline. There are elements of characters in the form of a hardened Sarah Connor but it’s never explored enough as the film gets way too bogged down in explaining the plot. Just when it seems like the film is dipping its toe into original territory it boils down to the exact same climax we’ve seen a million times. The film ends with our characters driving off down the road knowing for the first time in their life that they are free to choose their own path. Hopefully that’s what the next Terminator will do."}, {"rating": "9", "text": "The special effects are truly awesome but what makes ‘Terminator Genisys’ go from being an okay film to a good one is its respect and understanding of everything that made the franchise so remarkable and significant in the first place.\r No Terminator movie would be complete without the concept of time travel.\r Arnie was in his mid thirties the first time he took on the role of a Terminator but but 31 years later he still has the magic. There’s something truly unique and heart warming about watching an Arnie movie on the big screen. It’s as natural a thing as breathing.\r Jason Clarke, Courtney and Emilia Clarke all work well together but the plot becomes a little hard to follow with all its talk about time travel and alternate realities.\r A true reboot"}, {"rating": "3", "text": "Terminator should have ended with T2. That was an epic final. Each time a new film appears, I wish the end of humanity by robots. Arnold is too old to be terminator once again (with or without CGI)."}, {"rating": "9", "text": "I hated Terminator 3, but this one is really good. I have no clue why it has such terrible reviews, the movie was great. Even my girlfriend enjoyed it.\r The were no logical errors, the story was great (and that says something as it was no easy to continue the story that was already there). The movie was tense, unpredictable, had great action scenes and there were even a few scenes which made a good laugh without making the movie ridiculous."}, {"rating": "3", "text": "Terminator Genisys is not in the same league as the first two films in its franchise. I think that this film shows that the franchise just needs to be put to bed or the rights need to be returned to James Cameron. The film is no where near as action packed or as fun as the first two films and even Rise of the Machines. Arnold Schwarzenegger is almost the sole actor that feels like his is in his element here and the other actors in the main cast seem to be misplaced. Terminator 5 is flat, uninspired and I just couldn't care less about most of the characters. The writing is really spotty and the film seems to be relying more on a lame romance than the action that wins over the audience. Terminator Genisys is a complete disappointment."}, {"rating": "5", "text": "Terminator: Genisys has it's entertaining moments, but the story is far too confusing and weak for it to matter. The premise was intriguing, but the trailers revealed too much, and watching the film had few surprises. The script was a major weakness of Terminator, because it left things unexplained, revisited way too much old material from previous films, and was way too overly complex. Along with the story, the dialogue was at times forced, and tried to remind us of older, better days, for the franchise. While the script wasn't very good, the action sequences were very good, and the actors were serviceable. Unfortunately the very confusing, sometimes unexplained story weighs the entire film down, and the end result is a mediocre film."}, {"rating": "5", "text": "\"Terminator: Genisys\" 10 Scale Rating: 5.0 (Mediocre) ...\r The Good: The idea and initial concept is a great one. It really felt like an old school Terminator film (finally) for the first 45 minutes or so. Re-visiting 1984 and showing us more of what the future is like were definite highlights. I was dubious about Arnold Schwarzenegger reprising the role of the T-800, but he actually does an amazing job and was at the top of his game. I'm not usually a fan of Jai Courtney, but he was solid in his portrayal of Kyle Reese. The true standout though was Jason Clarke, who played John Connor. The previews and trailers give it away, but he is ultimately the main antagonist of the film and is among the better ones that the franchise has had. Byung-hun Lee's part was small and without many lines, but he was excellent as a re-imagined T-1000, the shape-shifting Terminator from the second film. For about 1/3 of the film, my reservations dissipated and I found it to be an enjoyable and wildly entertaining film.\r The Bad: Sadly, they could not keep up that pace as the movie degenerated into \"Rise of the Machines\" territory. The story slips and never regains it's early glory, becoming somewhat nonsensical and bland. While the first third of the film entertained, the second act was average at best and the last third was awful. The ending was also unsatisfying and doesn't fill me with hope about the future sequels that are already in the works. Emilia Clarke is also definitely no Linda Hamilton and while she tries REALLY hard, she just doesn't pull off Sarah Connor at all. Lastly, some humorous elements were crammed into the film and they felt ill-timed and out of place. The first films have a bit of dry wit to them and it works. Here though Clarke, Courtney, and even Schwarzenegger are chock full of one liners and groan inducing jokes."}, {"rating": "8", "text": "I completely disagree with the negative reviews. Frankly, I don't understand them at all. Emilia Clarke was perfectly cast as Sarah Connor. She brings a certain innocent vulnerability to the role that makes perfect sense in the context of the plot. Jai Courtney, while not ground breaking, delivers a solid performance as Kyle Reese. Jason Clarke was outstanding as John Connor and delivers a thoroughly enjoyable performance and often steals the scene. Arnold is Arnold, take that as you well. The references and jokes regarding the previous films were enjoyable and appropriately delivered without being done. The action was good, but more importantly the plot was better. I've seen people say the plot is convoluted, but I completely disagree. It's no more complicated than Inception and is a perfectly legitimate story given the context of time travel. J.K. Simmons' character Detective O'Brien wasn't really necessary and could have been removed, BUT his presence in the story makes total sense. Overall this was actually quite well written and thoroughly enjoyable. It is completely faithful to the original two Terminator films and SIGNIFICANTLY better than the crappy Terminator: Rise of the Machines and Terminator: Salvation. If you enjoy the Terminator franchise and wanted to see it done justice, this film should certainly please you. 8/10."}, {"rating": "6", "text": "“Terminator Genisys” directed by Alan Taylor is the fifth film in the Terminator franchise and sixth in the mythology if you include the cancelled TV show “Terminator: The Sarah Connor Chronicles” that ran from 2008-2009 on Fox.   While the film is not bad per se it is not great either feeling like another rehash of the same old material.  If you count the TV show this is now the fourth time the main purpose is to stop Judgement Day and destroy Skynet.  This is the inherent problem with the franchise and the reason it should have stopped after “Terminator 2: Judgement Day”.  How many times can we watch the same story told over and over again?  To make matters worse the plot of the movie borrows heavily from “The Sarah Connor Chronicles”.  I feel the series staple of time travel is used to excess in the film.  The cast is full of some of my current favorites doing their best to go through the motions on this retread.  Emilia Clarke brings her usual strength in a small package that serves her well on “Game of Thrones” to the role of Sarah Connor.  She strikes an excellent balance between the young T1 Sarah and the harsh chiseled Sarah of T2.  I do appreciate a quick joke in the film about her small stature since she stands just over 5’1” in real life and the rest of the cast towers over her.  Jason Clarke really does well with John Connor in the opening act of the film in 2029 but his character somewhat comes off the rails in the latter half of the film.  Jai Courtney, as Kyle Reese, keeps getting roles despite having no chemistry with anyone he is ever in a movie with.  He brings none of the soul that Michael Biehn brought to the role 31 years ago.  For you “Doctor Who” fans blink twice and you’ll miss Matt Smith, billed here as Mathew Smith, in a smaller than I hoped for role that carried a lot of importance but didn’t get a lot of screen time.  Also fresh off his Oscar is J.K. Simmons who maybe hadn’t won his Oscar yet when he filmed this because I didn’t even know he was in it until the opening credits rolled.  As for Arnold Schwarzenegger reprising his role as the titular terminator there isn’t much for him to screw up here.  The motion capture they used for his younger self is much better than it was in “Terminator Salvation” and the reason for him appearing as old as the actor is in real life fits perfectly in the narrative of the film.  While the film tries to recapture some of the emotional beats of T2 it comes up a little short and instead focuses on rehashing the same two jokes with his character the whole movie.  In the end if you are asking to see it, rent it, or skip it, it really depends on you the viewer.  If you are a big Terminator fan that would enjoy a nostalgia trip through the first film or are just looking for a decent popcorn flick then see it in the theater.  For everyone else I say rent it.  You won’t be missing much even if the Mother of Dragons is in the movie.  There is a mid-credit scene so don’t get up and leave once the credits start.  It is very brief but once you see it you can go.  There is nothing at the end of the credits."}, {"rating": "8", "text": "After looking at very negitavie reviews I was going in with low expectations but to my suprise this one of my favorite films of 2015. If you haven't watched Terminator 1 and 2 watch them before this because some parts especially the first 30 mins tie-in with them. There were some really confusing things in the movie (don't worry not a spoiler) During the beginning of the movie Kyle Resse is saved by John Connor (this may tie into Salvation timeline I don't know I haven't seen it yet) and Resse is a kid and Connor is grown its just odd. The best thing in this movie is Arnold Schwaranagger, he plays the T800 really well. Few of characters could of been used better, JK Simions (Whiplash, Spider Man) wasn't wasted but he could of played into the story more. When James Cameron gets the rights back in 3 years I hope it turns out better. I'm not going to this movie had some solid action scenes like the highway section and the Arnold vs T3000 (not going to tell you who that is if you didn't watch the 2nd trailer.) Jason Clarke (Child 44, Dawn of the Planet of the Apes) did a good as John Connor and Jai Courtney (Jack Reacher)  was functional as Kyle Reese. One thing I liked and had a problem with is that they brought back the T1000 (I think it's the same one) from T2 I liked that but they kinda wasted him they show most of his scenes in the 1st trailer. If you live and die by the first 2 movies, you might not like this. If you like all the terminator movies you will definitely love this movie, I personally really liked this movie."}, {"rating": "8", "text": "Don't let yourself be fooled by reviews - Terminator Genesys is a good action movie. It has a good tempo and mix of jokes, dialogues and action. It can stand for itself in a competition, however quite frankly it is not that hard lately (except for Mad Max). However for me as a Terminator fan this movie contained many throwbacks to old movies and could be seen as a final tribute for the series.. I think this is solid 7 action movie. Add one or two points if you are Terminator fan."}, {"rating": "5", "text": "Was I entertained? Yes. There were some enjoyable echoes of the original Terminator film throughout this one, which worked well. But as its own film, it really struggles. First, I didn't care about the characters: too many chases and actions scenes; not enough effort to put complex characters in the story. Second, I think the franchise is just out of ideas. The first two films are classics; but this, like the previous two mediocre sequels, feels like recycled plot and action from the earlier movies. Instead of standing on its own as a new story, it tries too hard to prod nostalgia while trying to keep the door open for more Terminator movies down the road. A tough balancing act. Add to that a lot of plot holes and time-travel logic knots, it's hard to walk out of this with more than a smirk and shrug."}, {"rating": "9", "text": "Frankly I do not understand the reviewers. I read a couple of days ago an article about this movie that said \"it will ruin your childhood\". I have to say that if you ignore the actual plot of the movie that really was confusing and the some of the plot holes in it you will have a blast watching it. In the bottom line it's a great action movie that is much better than most action movies today."}, {"rating": "5", "text": "Very stupid script and completely confusing time travel explanations that ruined the movie. Unnecessary forced sentimental moments that were jarringly out of place. If they would have kept the story more simple, then the special effects would have been more appreciated, but the convoluted story about alternate timelines and indecipherable time travel laws made the movie annoying.\r It had its moments tho, with R-nold camping it up with his trollish face and exagerrated mugging, as if he's now some kind of freak show attraction, which I guess he's always been. He's so old and wrinkled now that it almost makes your eyes hurt and bleed just looking at his craggy old  German face.\r Makes you wonder about how clueless the people are who would approve of this completely asinine script. Who to blame? The producers, the director? Someone definitely is out of touch with what makes a satisfying and entertaining story."}, {"rating": "10", "text": "Dont let the negative reviews or even the negative critic reviews keep you from seeing this movie. Its A really good movie, has awesome action, and personally i think its right on par with terminator 1 and 2. This will probably become my favorite Terminator film since it has more action than any of the previous, but still manages to keep everything relevant and not overdue the action. I will say its going to be a bit hard to understand if you havent seen Terminator 1 and 2 because its draws on there story lines. Its a must to watch the originals if youve never seen them. Which brings me to the reason its possibly getting back reviews ,because people dont know WTF is going on. And you wont know whats going on unless you remember the originals!! Anyway very good movie and 1 of the best if not the best Terminator movie."}, {"rating": "9", "text": "Really enjoyed this show. If you are a Terminator fan you will like this one. Dont know why there are so many neagtive reviews from the critics........"}, {"rating": "8", "text": "The real Terminator 3 for me. I waited 22 years for this. Everything here is well done, with some minor flaws. Great show, nice story and AHNOLD! You will need to watch it at least two times though.\rAfter T3 I was afraid that T5 might be even worse but I went to watch it anyway. And boy am I happy I did! Definitely worth watching, even for T1/T2 fanatics.\rTo any and all critics giving it below 70 I say GTFO.\r STORY\rToo complicated for a Terminator flick. Too many changes of scenery and objectives. The numerous versions of the past and the future messed it up a bit too much. There are a few holes here and there and too many questions arise during the viewing. Most of it is explained in as simple manner as possible by the actors yet it is hard to think about it. The reason for that is the action scenes are too close to each other. Basicly in every Terminator flick what you got was this : setup---action---explaining dialogues---action---more dialogues---etc.---ending. Every --- means 10-15 minutes so the viewer can rest a bit and get the hang of what is going on. Not in T5, here every --- durates for 5-7 minutes and then you get action. Not enough time to comprehend.\rAt some moment I felt like watching Inception and for an action movie it is not good.\rOther than that the story makes sense and is deep enough. The holes are not so gaping to call BS. You watch it and hear the dialogues….ok, I can work with that. It is also interesting to see what T5 did to T1 and T2 and it is faithful to the original material, with one exception.\rMoreover I was surprised two times by how it goes and that happens very rarely nowadays. Big props for that.\rI absolutely loved the ending.\rSo T5 is a full action movie with deep enough story as in T1/T2. Classic stuff in the best sense.\rOneliners are great. Dialogues are ok. Some old questions from T1/T2 get answered here aswell.\r CAST\rHere I feel the movie could have done better. In T1/T2 all characters are deep and you sympathise with them. In T5 they feel more like story drones. Ahnold who plays a machine stands out among the human characters that are a bit hollow.\rArnold Schwarzenegger is everything I hoped for. He is nothing short of the T2 guy, a bit worse than T1 electronic murderer. It feels like the whole flick is AHNOLD-APPROVED for great entertainment.\rSarah Connor at first I didn`t like but the got through with good performance. Has everything the original Sarah had. With Arnie she keeps up the comical part through the whole movie.\rKyle Reese…no, just no. Kyle was not a hulk of a man he is in T5. He was not as stupid and iritating as the one in T5. Good performance but a mishap of the character.\rJohn Connor - ok I guess, nothing outstanding but he did his part. I`d like him to be more into his character but it came out remote. I guess if he was bad then he`d ruin the movie but it didn`t happen so overall good job.\rT1000 for the time he got in the flick I`d say he was meh.\r SHOW\rFANSERVICE!!! Lots of it in this movie and in just the right proportions as to not ruin the story. The whole movie pays homage to the first two films and it brought some cool new stuff on its own.\rToo much CGI, a bit. It was good but they overdid it just a notch. The T1 Ahnold looked ok but nowhere near natural (although much better than in Salvation).\rOverall all the fights look cool, creative and deal some serious environment damage. The only one I didn’t like was the helicopter scene.\r MUSIC\rA big NO. What the hell? Am I watching a Terminator flick or a Man of Steel flick?! Completely missed the mood of the movie. Came out artificial and needlessly pathetic. Adds nothing to the movie but feels like an itch with minor minutes of in between breaks. Not every movie needs an epic orchestra tune to make it look and feel good. Didn`t ruin the movie but I can`t believe they screwed this up that much.\r I rate Genisys at 83/100."}, {"rating": "3", "text": "About as bland as can be. A few cool scenes and some good ideas, however it is so full of plot holes and pointless action it kinda makes the movie feel needless.\r Overall:\rTG was a nice idea, just terribly executed. Arnold, it's time to hand the mantle to someone else."}, {"rating": "6", "text": "A solid action film in general, better than 3 and Salvation but not on par with 2. Some unnecessary soppy scenes but altogether character progression was ok.\r Main plus in this film is the return of Arnie! His portrayal is top notch and to me surprisingly very funny!\r All in all a solid film and definitely worth a watch, ignore what the critics are saying it really isn't that bad!"}, {"rating": "9", "text": "I don't usually \"go online\" and write a review of movies and things, I am a HUGE fan of the Terminator franchise and my opinion is a little biased.\rTook my kids to watch this when it came out in local theaters, I was \"giddy\"  about this since seeing it in the newspaper. When my son asked me \"what movie we were going to see\" I was happy to say Terminator, thinking he loves these kinds of movies(he does). A few minutes later I was confronted by a angry mob of children telling me the movie is bad. There was a lot of drama/tears/shouting, but it turns out these online reviews that kids access from their smart phones are rubbish and only serves to irritate parents.\rThis movie was AWESOME (as they say) from start to finish, and having a few more Terminator fans around the house makes for good dad jokes."}, {"rating": "9", "text": "An enjoyable action film which at times is seemingly a parody of the Terminator franchise (a good thing!). Arnold is back and delivers an extremely entertaining performance full of cheesy one liners and some very active fight scenes! Some greatly humorous throwbacks to the original film during the scenes in the 80s which at times almost felt like you were watching an 80s flick. CGI Arnold returns albeit briefly in an apparent stab at Salvation which I enjoyed and the plot was quite interesting. More modern scenes were quite accurate in their portrayal of our current obsession with being constantly connecting and the Windows 10 esque operating system was interesting. John Connor delivered a fantastic performance and really made you fear the character at times, while Matt Smith's performance similarly shone out towards the end of the film. Overall, a slightly cheesy and action-orientated film but not one that deserves the bashing given by critics. Certainly will be enjoyable for fans of the series and an interesting take on the Terminator franchise!"}, {"rating": "5", "text": "Not the best in the series. but still offers thrills, humor. and welcomes Arnold back as the terminator and excels as always. He was center of attention for me and I could not but just keep watching when he came on screen."}, {"rating": "3", "text": "Pretty bad, and boring... I don't even remember what the story was about, that's how I uninterested i got, after about 10 minutes. Maybe I am just obsessed with judgement day, and dislike everything that came after it.  After I saw what they did with every other terminator after terminator 2, I didn't even had a high expectation for this one, but beside this in my mind, it was disappointing. If you liked t1 and t2, and don't want the memory of them completely ruined, don't watch it."}, {"rating": "3", "text": "Badly cast and badly acted sequel. With the exception of Arnold Schwarzenegger, nobody involved looks to be having the slightest bit of fun. There's one cool scene which works great as a set piece, but the rest of the film is buried in a confusing (and boring) plot."}, {"rating": "0", "text": "Oh dear,this film has brought the franchise to new levels of awfulness and it's a pity as the original is such a classic."}, {"rating": "7", "text": "this site has a lot of trolls who lie about movie reviews. All I can say is that terminator was a good movie with lots of action and few funny scenes but over all the acting was great and it was a great Terminator flix. Go out and see it and enjoy this movie."}, {"rating": "10", "text": "“I’ll be back!!” and Arnold is in a big way.\r Terminator has been getting harsh critic reviews which are not warranted and are way off. It is clear that these critics are not aware of the Terminator franchise as a whole. You would have to be a fan of the TV series to understand the direction of the new film.\r Terminator Genisys borrows from The Sarah Conner Chronicles TV series, creating skewed timeline possibilities with Kyle Reese still being alive, fighting along with Sarah Conner and a guardian Terminator (Summer Glau).\r The action in Terminator Genisys is riveting and induces old excitement that I experienced with Terminator 1, 2 and The Sarah Conner Chronicles. I found the story fascinating and appreciated the retro humor.\rIt would awesome to see Summer Glau come back, as she was the best out of the TV series and is superb at action sequences.\r I highly recommend seeing this film and look forward to the next films!!"}, {"rating": "8", "text": "Without spoiling the film I think Dr. Ian Malcolm from the first Jurassic Park film can best sum up Terminator Genisys, \"John, the kind of control you're attempting simply is... it's not possible. If there is one thing the history of evolution has taught us it's that life will not be contained. Life breaks free, it expands to new territories and crashes through barriers, painfully, maybe even dangerously, but, uh... well, there it is. Life, finds a way.\" The Life in this film is not what you expect.\r Go see it! :)"}, {"rating": "10", "text": "I love all Terminator film and i love Arnold. i really enjoyed this film. The movie was a great one. I loved it and Im glad to see Arnold play the terminator once again."}, {"rating": "10", "text": "Terminator Genisys is way better then previous Terminator Salvation & Terminator 3 Rise Of The Machines. Being a fan sense a young age, I really  enjoyed watching \"Genisys\" and i would recommend to anyone who like Terminator Movies."}, {"rating": "10", "text": "The film in the style of the original stories. Yes, you can find fault with the details, but they do not spoil the whole. After all, it's all the same story about attempts to prevent future."}, {"rating": "0", "text": "Ranting levels critical, you’ve been warned: So today I went to see the 5th installment in what was once an amazing franchise, who’d have thought that they could sink any lower than Terminator 4, but they can in this spectacular fail of a movie. At no point did anyone expect this to be any good, the trailer saw to that but I don’t think anyone could predict how bad it truly is. There are no adequate words but I’m gonna go for it anyway. So Arnie is back (in his many forms) to do what he does best, except this time he’s called Pops, now if this wasn’t a warning bell it pretty much explains why the rest of the movie was so terrible. Not only is this film horrifying on its own but it has to take Terminator 2 and in particular Terminator 1 and drag it through the dirt. It can’t even establish itself as anything new, taking great scenes from the classics and rehashing them hoping the fans will be too caught up in the moment to notice. It singlehandedly destroys the first two Terminator movies and leaves us with this horrendously traumatizing and soul crushing sorry excuse for a movie.\rWhat’s that Arnie? You’ll be back, somehow I don’t think so. You know what I hope the machines do rise up and kill all humans cause if this is the standard for films in the future then I don’t want to be a part of it. Not recommended, I repeat, this film is not recommended for viewing as to do so is not only dangerously infuriating but can also put viewers at risk of potentially giving into the urge to gouge one’s own eyes out. Rant over."}, {"rating": "10", "text": "A great \"reboot\" to the Terminator franchise. Respectful to the originals while being something new.\r Great music and sound design too, which seems to nod at the T1 and T2 soundtracks in several places... I thought that was pretty sweet (unlike what we got in T3 and Salvation).\r Without spoiling specific details... *something* happens in the original timeline (What that *something* is, is a question acknowledged by the film and to be explored in the future), that allows a deviation from the outcome of the future war that we're all familiar with from T1 and T2, which causes a new timeline/reality to branch off, and cause the events in this Genisys film. This new timeline seems like it's supposed to be continuous with our own reality, with regards to it now being 2015 and still no Judgement Day, and also in regards to our current state of technology and where it's headed...\r Please don't let the 'professional' critic reviews steer you away from this film (or any for that matter). Make up your own mind -- you've seen the trailers and advertisements... if it made you curious, then just go! It's good. \"Trust me\"."}, {"rating": "8", "text": "This movie is clearly meant as an amalgamation of the first two movies. You could even go as far as calling it a tribute. It's not as clever or as groundbreaking, but there's a lot to enjoy. Arnold is at his best and the explanation for his dated looks as a terminator is easily believable. This was probably my biggest question when learning that the movie was in the works and wondering about Arnolds age since he is supposed to be a robot. But it makes sense! And the \"young\" t-800 looks great! Almost can't tell it's cgi and I absolutely loved the scenes where they interact.\rThere's a lot of enjoyable dialog in this movie. Some comedic stuff going on aswell, which I always appreciate as long as it's not overdone. They walk the line, but don't cross it. The Arnold smile was just brilliant!\rAction sequences are reminiscent of a lot of the action from the first two movies. Clearly meant as such, which is perfect in my opinion. They did go a bit overboard a couple of times, especially the helicopter scene, but nothing that really ruined anything.\rOne-liners are also a highlight. I'm sure the pro reviewers will bash that, as they are supposed to I guess. But I loved it. Arnold should always be back, that's just how I want it.\rThe story is a bit muddled - and quite hard to follow. But once I decided on just giving in to the paradoxes, I just had a brilliant time watching it. It basically tries to rewrite the first two movies, which is ok by me. The first two movies are still as brilliant as ever, so I don't mind seeing how else it could have played out. Even though it is a bit more confusing this time around.\rSarah Connor is a bit miscast in the movie. Emilia Clarke is a great actor, but she does seem a bit too decent for this role. Her look is just too sweet in my opinion, even though she does a great job at it. I certainly don't dislike her as Sarah Connor, but with Linda Hamilton's boots to fill, it's an uphill battle.\r All in all this is certainly the best Terminator since T2. I'm actually wanting to just forget about 3 and 4 and call this one 3."}], "recommendations": ["hancock", "pirates_of_the_caribbean_on_stranger_tides", "edge_of_tomorrow", "next", "i_am_number_four", "poseidon", "the_many_saints_of_newark", "jumper", "seventh_son", "glass", "avengers_age_of_ultron", "the_a_team", "the_twilight_saga_eclipse", "the_twilight_saga_breaking_dawn_part_2", "percy_jackson_sea_of_monsters", "terminator_3_rise_of_the_machines", "shazam_fury_of_the_gods", "kingsman_the_golden_circle", "the_twilight_saga_new_moon", "bumblebee", "venom_let_there_be_carnage", "incredibles_2", "batman_v_superman_dawn_of_justice", "x_men_apocalypse", "riddick"]}