{"id": 1316, "title": "Terminator 2: Judgment Day", "starring": ["Arnold Schwarzenegger", "Linda Hamilton"], "runtime": 137, "genre": ["Action", "Thriller", "Science Fiction"], "description": "Nearly 10 years have passed since Sarah Connor was targeted for termination by a cyborg from the future. Now her son, John, the future leader of the resistance, is the target for a newer, more deadly terminator. Once again, the resistance has managed to send a protector back to attempt to save John and his mother Sarah.", "releaseYear": "1991", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5M0j0B18abtBI5gi2RhfjjurTqb.jpg", "categories": {"plot": 9.4, "acting": 9.409090909090908, "ending": 7.0, "soundtrack": 9.333333333333334, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.0, "action": 9.257142857142858}, "reviews": [{"rating": "10", "text": "This is a prime example of a grade-A action film, it's got drama, family values, action moments with meaning which aren't just random \"spur of the moment\" scenes added for filler, each scene has a reason and direction with where they're going with the film as a whole.  The soundtrack, my god the soundtrack, the instrumentals are completely memorable, and i bet the intense intro song will be pounding in your head days after you've finished watching it.  It's one of the most memorable and highly underrated, from the looks of the critic scores on here, action movies of all time."}, {"rating": "9", "text": "The first Terminator was a very good film but this sequel took the franchise to a level it hadn't reached before or since.\r With Sarah Connor from the original movie now institutionalised her son, and future leader of the resistance against the machines, John Connor is living with Foster parents. The machines that rule the future send back a cyborg, played by the terrifying Robert Patrick, whilst the humans send back their own cyborg to protect him. Schwarzenegger again excels in a role he was born to play, his voice and physique suiting his cyborg character perfectly.\r This all leads to a series of truly memorable action sequences that still largely stand up today in terms of special effects. Add to this a surprisingly good script for what is largely an action fare and you have the ultimate action blockbuster."}, {"rating": "10", "text": "First off, I would give this a 9.5 out of 10. This is a great sic-fi. The best terminator movie. Acting is good. Everyone does a good job. Score is good, and has a really good story. Really well made. The visual effects and action sequences are great. Well made and are just amazing. Overall, this is a great 90s action blockbuster. You really should see it."}, {"rating": "9", "text": "Yeah well, I am usually very critic about science-fiction movies, but this time the whole thing comes with a lot of action (exceptionally well done), and some light humor, which is not interfering with the mood of the movie. The time traveling aspects (yeah I know I am picky) are somewhat \"flawed\", but nothing I could not overlook (like in the case of Looper). One of Arnie's best, and the villain is also remarkable. Will remain a classic. The special effect were all very advanced back in the day. Some looks cheesy nowadays, but not bad. Recommended."}, {"rating": "10", "text": "Maybe the critics don't like this one, but for viewers it is first class entertainment.Great action and special effects keep you on the edge of your seat for the entire movie. Classic - the best in the series. Watch it - it's hard not to have a great time."}, {"rating": "10", "text": "Epic"}, {"rating": "10", "text": "T2 will never be equaled. If they sent Bach's music into space, they should have sent this film along with it. The Director's cut is a bit less concise but the original cinema release is devoid of any slip-ups. Each scene is there for a reason and shows us something new. The strength and weaknesses of the characters are clearly seen, but they are not brought to attention in a ham-handed way. The use of CGI is avoided for much of the film which is a godsend especially in the context of modern films. There are too many reasons to list as to why this film should be forever lauded... Aside from being the pinnacle of action films it teaches us some real lessons about the cost of human life."}, {"rating": "9", "text": "If you thought the first Terminator Movie was good then this is double the action and double the story. Great character development, More action, more explosion's and more heart. It is just one huge spectacle."}, {"rating": "10", "text": "Terminator 2 is an amazing and enjoying thrill ride that is one of the best action movies ever. The plot is very well constructed, the acting (especially Arnold Schwarzennegger's Terminator) is top-notch and very memorable. The amount of depth each character has is just amazing and you identify with each character, there is such an emotional charge to each moment that you are sucked into the movie. The action scenes are top-notch and will keep you enthralled in it, there are many in the movie and suspense is well-maintained when needed as well. The movie is sure to be remembered and quoted every time for a long time (\"Hasta La Vista, Baby\"). Flaws, there are hardly any except for maybe it can be a bit lengthy and the action takes some time to get interesting but once it does it's awesome and it is a small flaw though. Overall, Terminater 2 is a smash-hit movie that is an example of a super-action flick deftly crafted with emotion that will be remembered forever and is almost as good as the first one. Breakdown for \"Terminator 2: Judgement Day\": Presentation: 9.7, Plot: 9.8, Acting: 9.9, Script: 9.7, Lasting Appeal: 10, Verdict: 9.8 out of 10 \"Amazing\"."}, {"rating": "9", "text": "A continuação que conseguiu ser melhor que a original."}, {"rating": "10", "text": "My all time favourite movie! Great plot, awesome special effects and dialogues that are still alive.\rTerminator looks like a real killing machine and you are afraid of him. Love it!"}, {"rating": "10", "text": "Though Titanic may not be my optional favorite I have to say James Cameron knows how to make great sequels, just like Aliens Cameron now those his own Terminator franchise\r Arnie (Schwarzenegger) is Back! as the Terminator who previously under the command of the renegade robotic computer system Skynet was sent back in time to execute Sarah Connor and her then unborn son John Connor, who is destined to be the future leader of the human rebellion. now reprogrammed to save them both the terminator must now square off against his replacement the intelligent T-1000 who has the power to cyberform into liquid metal making it almost completely unstoppable as the three must now form an unlikely alliance and prevent Skynet's predecessor Cyber-Dyne systems from gaining full fruition.\r A well done A+ oscar winning sci-fi action flickl and probably as grand as its prequel and easily standing among Aliens and Star Wars Episode 5 is a explosive achievement in Cameron's charismatic career"}, {"rating": "10", "text": "Despite what has happened both in Arnold Schwarzenegger's personal and political life, there can be no changing of the fact that Arnold helped make some of the most thrilling, action-packed adventure movies to ever grace the big screen back in his prime. If the first movie was good with Arnold being the evil Terminator hunting down the seemingly innocent Sarah Connor (while utilizing some very top notch special effects by 1984 standards,) this 1991 sequel is even better with Arnold being the good Terminator trying to prevent John Connor from being hunted down. This movie is well-placed, and focuses mainly on the three main characters, John, Sarah, and the now good Terminator as it should. This movie also gets high marks from me as it featured special effects that were WAY ahead of its time, courtesy of the new, evil Terminator that can regenerate its body, even when it's broken into dozens of pieces! This movie demonstrates that while we don't know for certain what is going to happen in the future, we are always in control of what happens in the present, and therefore, we all play a hand in shaping what the future will eventually have in store for us. I thoroughly enjoyed this movie, and I highly recommend it to people looking for some great thrills!"}, {"rating": "10", "text": "Terminator 2 is a perfect movie. That's why all the sequels have been mediocre. Its hard to improve on perfection. My number 1 movie of all time......"}, {"rating": "10", "text": "T2 is the best out of all the Terminator movies. What we have here is a masterfully made movie that tell the story of a future war fought in the past with not one but two terminators. Model 101 (Arnold) is the good guy and the cool T-1000 (Robert Patrick) is the seemingly invincible bad guy. The movie has suspense, action, and even some humor. T2 defines what classic movies are."}, {"rating": "10", "text": "alsome explosians, killer robots from the future, and some big guns= the best movie in the famous series so far."}, {"rating": "9", "text": "Terminator 2 is one of the defining roller-coaster rides of modern cinema. It takes the original film and builds something much deeper upon it, much like director Cameron did with the Alien franchise a few years earlier. Ultra memorable scene follows ultra memorable scene in this all-time SF classic. Seriously... You cannot afford to miss this movie!"}, {"rating": "10", "text": "This is easily one of the best movies ever made. The script is top notch and acting is convincing and true. The soundtrack and graphical effects are great even for today. Amazing!"}, {"rating": "10", "text": "This is James Cameron at this best. Terminator 2 doesn't just surpass the original but it gives us one of the greatest sequels of all time."}, {"rating": "10", "text": "With fantastic visuals and excellent pacing, this movie boasts exactly what a sequel should look like. It has more in-depth emotion between characters, and overall, it's a much better presented film than the first. This is probably one of the best sci-fi movies made."}, {"rating": "10", "text": "Brilliant, action-filled sequel, superbly directed by James Cameron.  The acting is top knotch, the suspense relentless, and the special effects are mind blowing.  A rare film that lives up to, and even outdoes, the original."}, {"rating": "9", "text": "This is a perfect example of an amazing sequel. It's truly better than the original in everyway. It was more intense, more action-packed and definitely had more quotable lines than the first one. As far as the story goes, it's an interesting and engaging story. It's a pulse pounding sci-fi story. That's what helps make for an awesome sci-fi thriller. As far as characters go some have there moments, but none of them were as bad-a** as the Terminator (Arnold Schwarzenegger) and T-1000 (Robert Patrick). Watching those two fight was movie magic. But what really makes this movie awesome is it's super cool action and visual effects. Most action movies now of days tend to have great action, but a weak story. This movie held on to both contexts and gave it all it got in this riveting sequel. Overall, It's a rare, tremendous blockbuster done right."}, {"rating": "8", "text": "He’s back! This second Terminator film truly is greater in every way.\r In comparison with the first Terminator film is this second installment much better when it comes to action sequences, practical effects and storytelling. The major improvement is of course the villain: the T-1000. He’s so scary and awesome at the same time. Arnold Schwarzenegger, Linda Hamilton and Edward Furlong are all spectacular actors, and their characters are so incredible and you really feel close to them. The actors are much more professional now than in the first film. There’s a massive amount of action in this movie, and there’s a huge amount of cool and unique things at the same time. The action is much faster and there are spectacular practical effects that just look incredible. The first Terminator film got some doll models, but this does not. Terminator 2: Judgment Day is a highly entertaining and well-made film that got a touching story and even some humor! The opening scene and the ending are both great, even though the ending felt a bit to rash. The soundtrack is also great, but it could have been even groovier, which could have made the film even cooler and dramatic.\r This movie got it all: great science fiction, awesome action sequences and fantastic storytelling. Not to mention the incredible script.\r Terminator 2: Judgment Day gets an 8.8/10."}, {"rating": "9", "text": "This movie takes everything that i loved about the original terminator but fixes the complaints i had. You get to hear more of the terminator backstory. The movie is filled with rememberable quotes, it also had a few surprises in it."}, {"rating": "9", "text": "Terminator 2's concept may be a copy of its predecessor, but here with its obviously larger budget, it's done so much better. In fact, it's a freaking masterpiece. It's the definition of a sequel done right. So brilliantly, excellently, perfectly right."}, {"rating": "8", "text": "One of the few sequels that beats the original. More action, a down-to-earth feeling and the return of the perfectly acting Schwarzenegger make Judgment Day a classic."}, {"rating": "10", "text": "Terminator is one best action films ever. Its realistic ,  it takes to a wild journey robots face to face doing an action war between  Schwarzenegger and  Robert Patrick. This is one of movies that  change the world in the 90's  you didn't have any description of what the future's gonna be like if it was bad or good ( you never know.) from writer , director James Cameron's view of the future you know his message in  the film whether you understand it or not you have time to save  before an impact  between your life or the consequences between death or a unexpected thing that you do in the future that leds to war. thats what terminators about. Grade A+"}, {"rating": "9", "text": "A masterpiece of scifi cinema so good that even genre haters love this film."}, {"rating": "10", "text": "68.... En conclusión de todas las criticas de los \"profesionales\" saco 68.... !!!DEBIÓ SACAR 98!!!\rEsta película básicamente es la misma trama que en la primera, un exterminador enviado a acabar con el líder humano del futuro. Aun así esto es mucho mas. Aquí muestran mas emociones, hay mas personajes los cuales son interesantes, aquí puedes ver como los acontecimientos de la primera película cambiaron el futuro haciendo posible al T-1000, esto expande mucho la anterior. James Cameron supero a la anterior, que también dirigió, y le dio un final épico a esta serie. Esta película es una obra maestra, tiene dialogo inteligente, momentos de exposición y hasta algunos cuantos de comedia y todo termina encajando de una manera increíble. Esta película es increíble, mirala tan pronto termines de ver Terminator 1. Los efectos especiales también son muy buenos para la época y hasta casi todas las heridas del T-1000 son animatronicos, no miércoles de CGI sino animatronicos individuales. Esta película es increíble y lo único malo de esta es que Cameron dejo esta serie por que la termino y las nuevas siempre van a sufrir de la sombra de Cameron. También tiene detalles que los personajes aprenden, búscalos son interesantes. Le doy un 10/10, es como Aliens el regreso, una película que mezcla sus elementos paradarnos un manjar exquisito."}, {"rating": "10", "text": "Terminator 2: Judgment Day is the best film in the series. One of the best films from James Cameron. A standard in the thriller genre, breakthrough computer graphics for the early 1990s. And of course T1000 one of the most memorable characters in the franchise. All that happened after this film in the series is not the Terminator, but his likeness."}, {"rating": "7", "text": "Better than the first movie but it still doesn´t reach that memory that i has a kid"}, {"rating": "10", "text": "It is tough for a sequel to be better than the first film, but T2 pulls off the close to impossible.  Absolutely the BEST Terminator film to date and a sequel all sequels should be put up against in terms of quality, story etc."}, {"rating": "10", "text": "Do I really have to say anything for this one? If you haven't watched this yet you are probably young.You really have to watch this movie. This might be one of the best movie of all time.Arnold was such a beast back in time and this movie is such a gem for him to be in it. Nobody could have done better than him for that role.Sarah Connor played by Linda Hamilton is also what any true real feminist should thrive for. This is an amazing character played by an amazing women. This have nothing to do with the nonsense SJW modern feminazi toxic stuff that we are currently experiencing."}, {"rating": "8", "text": "Terminator 2 is one of the best action-movies and sequels ever made. Almost every scene is iconic and the story of a guardian who is sent back in time is somewhat timeless. It's not the most intelligent movie, but it doesn't have to be, although it has some interesting things to say about the future of artificial intelligence, it's just buried somewhere inbetween all the explosions.A must-watch for everyone who even remotely likes action movies."}, {"rating": "9", "text": "\"Terminator 2: Judgement Day\" is a rare blockbuster that overly exceeds its prequel with mind blowing action, unforgettable scenes, and deep character relationship / development. It is a simple masterpiece."}, {"rating": "10", "text": "For me this is one of my favourite films of all time, if anyone doesn't like this then they clearly have mental problems. How can some of critics who gave this film a score in the red live with themselves"}, {"rating": "10", "text": "Striking a perfect balance between well acted drama and intelligent, edge of your seat action, James Cameron's follow up to The Terminator is bigger and better in every sense of the word."}, {"rating": "10", "text": "This is even better than the original, it is just Nostalgia, excellent graphics which were great back in 1991, and are still great, the T-1000 is even scarier than Arnie in the first one, and guess what he's back.\rHasta La Vista Baby!"}, {"rating": "9", "text": "One of the best movie sequels ever made and lives up a franchise that should've ended here, Judgment Day is nothing personal to talk about other than this review right here."}, {"rating": "10", "text": "How can someone say this is overrated? There's no room for improvement. It was short and sweet, well thought out, epic, logical, engrossing. It had soft spots, action, tons of character development, just too many great scenes to mention. Terminator 2 is satisfying, like a good meal that you never get tired of eating."}, {"rating": "9", "text": "A sequel with even more action, another sharp plot, and fantastic performances. James Cameron shows a lot of unique ideas and cool (although dated by today's standards) special effects. It loses the dark, almost noir-esque tone from the previous film. It's definitely is focused on being more of a big spectacle action film.\r However the film doesn't lose it's brain as a result. It's still a thoughtful sci-fi film. The time traveling aspect is handled well. Some light touches of humor and emotional drama make it a movie that can be more accessible to a wider audience. Thankfully, without losing too much of what made it's predecessor so great.\r Cameron shows he isn't afraid to change things up for his sequel. Grander ambition all around make it a sequel that's better than it's predecessor in just about every way. With a standout performance from Schwarzenegger, meticulously crafted action, and cool sci-fi elements, and you have a film that can please just about everyone. It's an action film with more brains behind it than the average affair."}, {"rating": "10", "text": "Terminator 2: Judgement Day is so outstanding and fascinating! I love it more than the first one because the story in this one is more enjoyable to me."}, {"rating": "10", "text": "This is, in my honest opinion, one of, if not the greatest film ever made.  Effects that still hold up today, exhilarating action, very well performances, especially by Schwarzenegger and Hamilton, and a one of the best plots I've ever seen in a movie.  If you haven't seen this, you are doing yourself a disservice."}, {"rating": "9", "text": "My score 99Metascore / User score 75 / 91Tomatometer / Audience score 92 / 94IMDB 85(89.3)"}, {"rating": "10", "text": "this sequel beats the original in just one shot for its neat special effects, great acting, and awesome action scenes."}, {"rating": "10", "text": "T2: Judgment Day is a violent, brutal, entertaining film which delivers on all levels. With heart racing set-pieces and some of the best action sequences in film T2: is not only a great action movie but one of the best movies ever."}, {"rating": "5", "text": "I see many people in this film very much liked century, but for my part, did not seem as good as the first    ."}, {"rating": "4", "text": "Terminator 2 is a nice action movie, but movies don't come more overrated."}, {"rating": "2", "text": "From watching this movie I thought the graphics were **** and that they could of done better with the ending it's just them distorting the chips in liquid that completely does NOT look like actual melted metal. So PipeBomb!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "The only James Cameron movie I believe truly deserves a perfect score of 10. A classic that will be remembered by ages, but unfortunately, is in the shadows of Cameron's big and overrated movies like Titanic and Avatar."}], "recommendations": ["the_terminator", "top_gun_maverick", "hulk", "the_scorpion_king", "rise_of_the_planet_of_the_apes", "edge_of_tomorrow", "terminator_3_rise_of_the_machines", "avengers_age_of_ultron", "the_fifth_element", "thor_the_dark_world", "indiana_jones_and_the_temple_of_doom", "predator", "war_for_the_planet_of_the_apes", "looper", "alita_battle_angel", "thor", "x_men_days_of_future_past", "transformers_dark_of_the_moon", "dredd", "robocop", "black_widow", "last_action_hero", "captain_america_the_first_avenger", "the_matrix", "upgrade"]}