{
  "id": 866,
  "title": "Terminator: Dark Fate",
  "starring": [
    "Linda Hamilton",
    "Arnold Schwarzenegger"
  ],
  "runtime": 128,
  "genre": [
    "Science Fiction",
    "Action"
  ],
  "description": "Decades after Sarah Connor prevented Judgment Day, a lethal new Terminator is sent to eliminate the future leader of the resistance. In a fight to save mankind, battle-hardened Sarah Connor teams up with an unexpected ally and an enhanced super soldier to stop the deadliest Terminator yet.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vqzNJRH4YyquRiWxCCOH0aXggHI.jpg",
  "categories": {
    "plot": 1.8727272727272728,
    "acting": 1.8529411764705883,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.5,
    "funny": 5.0,
    "action": 3.727272727272727
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Loved Linda Hamilton loved Arnold even though his character was not presented in a decent way. I hated the killing off of John Connor that was an ultimate slap in the face to all Terminator fans of the franchise so that’s unforgivable also Grace was a mediocre character but Dany Ramos was the singular worst of the characters in the whole movie. Rev 9 was not a convincing scary Terminator although he has great action moments. Overall the movie grade fro this is a D-"
    },
    {
      "rating": "2",
      "text": "I have an idea, let's make a movie, keep the plot the same as 4 out of 5 of the past previous movies, and gender swap the main characters. What could go wrong?! No spoilers here as we all know the plot (its in the trailers), robot comes from future to kill hero before they can save the world, send good guy back to stop the bad robot... THINK OF SOMETHING ORIGINAL FFS!!! T1 was the best because it was original, T2 was great because it flipped the script, T3, T5 and T6 are cash grabs that can't think of anything new! T4 tried to do something a little new but still relied too much on star power and not enough on good characters. Character development is what's wrong with Hollywood today, they don't know how to write good characters and fall into tired old tropes."
    },
    {
      "rating": "3",
      "text": "Tragic.Completely disrespectful to everything the franchise was built upon. It's John Connor's story, instead he's used here as an insignificant add on to pass his story onto a new female version who was terribly cast. Similarly Arnold, he's only here to help sell tickets and the Terminator character is a mockery of the first two films.There is nothing original here or anything you have to see: it's a blend of the first movies remade, but much worse."
    },
    {
      "rating": "1",
      "text": "Basically throws the narrative of every other Terminator movie out of the window and replaces it by dull, forgettable characters and a future world we get two glimpes of and no-one cares about. By both my friend and I had literally forgotten the name of the protagonist, she's that boring and unworthy.Plot makes no sense and gets repetitive very fast. Basically the entire movie is one long chase that repeats itself. Terminator and protagonists get in a fight, a spectacular explosion knocks everyone out and allow the protagonists to get some distance, Terminator reforms, protagonists go from unconscious to fully operational in 5 seconds, Terminator starts chasing again.The new Terminator model has some new capability and can operate in two different modes, but it is not really shown what the difference/advantages of the two different modes are and the whole thing just seems completely invulnerable anyway. In the end, the way it is defeated makes the whole movie seem utterly pointless."
    },
    {
      "rating": "3",
      "text": "Terminator: Dark Fate is a disappointing Terminator movie, especially since this is the real T3, the sequel to T2: Judgment Day.This film is what The Force Awakens is for the Star Wars franchise: a lazy derivative movie based on the first beloved films. Dark Fate is almost copying T2 to the letter. Highway chase with a truck, liquid metal Terminator, etc. Nothing new in this movie that we haven't seen already in previous Terminator films. This movie is creatively worse than any other Terminator movie. Even Salvation and Genisys had something new to show.But what's even worse, this movie is a SJW parody. Full of political correctness, pseudo-diversity, and feminist propaganda. It's like taking Tomb Raider or Charlie's Angels, writing the women out and replacing them with men. Ridiculous.First they write John Connor's character out and replace him with a female leader that can't inspire nothing. Then Arnie's T-800 is sidelined for the vast majority of the movie (can't believe the stupid backstory they gave to this T-800) in favor of a 6 feet high lady trying to convince the audience she's a badass, and her enhanced abilities are explained by cybernetic augmentations. Yeah, a Resistance hiding underground have the infrastructure to perform cyberpunk surgeries while being rampaged by robots sent by a Skynet that's not named Skynet but acts as Skynet. Yeah, Skynet's also out, but only in name. Now it's called Legion LMAOThe only really good thing in this movie is Linda Hamilton, who really came back as T2's Sarah Connor. Yeah, she's back. Unfortunately Arnie's T-800 doesn't speak this line for the first time ever and it made me cringe."
    },
    {
      "rating": "2",
      "text": "Another remake of T1/T2 that nobody wants or asked for. It lacks creativity and imagination. Its plot is dull and full of nonsense. This franchise should have ended with T2 followed perhaps by a kind of prequel/sequel leading to T1. But the worst thing in this is Cameron's hypocrisy. Do you remember him bragging around about how Fincher killed his beloved characters in Alien 3. Well be ready for the same in the Dark Fate and now it's done and approved by king of the world himself."
    },
    {
      "rating": "0",
      "text": "Another great franchise destroyed (ie: Star Wars) by pandering and catering to one specific group of people."
    },
    {
      "rating": "3",
      "text": "Next soft reboot, the first part of the trilogy without logic and lots of plotholes (again), unrealistic action sequences, without Skynet (Genysis or Legion, same crap) and Connor existence is changed (again)... dialogs are really bad.If you don't want to think about plot, don't mind that the T800 is just a super man, not a terminator and you dont expecting chilling atmosphere, go and watch it.Same mistakes all over again like with Genysis. They should stop it and sell it to someone other than Paramount and Skydance. Never again."
    },
    {
      "rating": "1",
      "text": "The first 20 seconds of this movie is a big slap to the face of all terminator fans. Know your target audience Tim Miller. Highly highly suggest if you’re a terminator fan to not watch this movie, ever."
    },
    {
      "rating": "3",
      "text": "Steaming pile of **** It gets a three from me solely for some pretty awesome action sequences. Writing is a dumpster fire; characters are shallow; plot holes galore. Essentially, this movie didn't need to be made. It feels like a pretentious, virtue signaling vanity project for Cameron. Creepy agre-regressed Edward Furlong's John Connor is murdered 2 minutes into the film, by a Terminator we never knew about, years after melting all of the cyberdyne evidence. So Judgment Day didn't happen and Skynet never came to be, but a T-800 shows up and Murders John. Ok. All of this makes no difference, however, as humanity has a new hope; a young Mexican girl named Dani. Why is she the hope? Who knows? She is because James Cameron has told you she is. Why does humanity need a savior if Skynet is never created? Because Skynet is created, but it's called Legion and creates terminators that look exactly like the old terminators, in a future that looks exactly like the other future. So essentially, everything that normally happens in a Terminator movie happens here, but the people and names have changed for reasons that are not entirely explained or explanable, for what appears to be political correctness. We're in exactly the same position as before, for unexplainable reasons, solely so Girl-John Connor can be introduced for no reason whatsoever; because it's the same movie regardless.So you see, this movie didn't need to happen. It is a bad version of T2, with a random female lead that exists solely so the movie can reset with a female lead."
    },
    {
      "rating": "2",
      "text": "Awful... destroys the legacy of some of my favourite movies and replaces it was shallow copy of the story of T2 but with an androgynous protector, an implausible saviour of humanity and the worst, lamest, least threatening Terminator (with some trash effects) in any of the movies. RIP Skynet...."
    },
    {
      "rating": "1",
      "text": "Wow, what amazing garbage this movie is. James Cameron has lost my respect with this horrible re-make/ ripoff of T2 but done 1000000x worse.  don't watch this, EVER!! T1 and T2 are the only real Terminator movies that exist.  Glad this is failing in the Box Office."
    },
    {
      "rating": "1",
      "text": "Don't see this movie. This movie is insulting to fans of the first 2 Terminator movies from the first 5 minutes.This whole movie is just a feminist propaganda, replacing John Connor (THE KEY CHARACTER OF THE SAGA) with a Mexican girl.And also insults and makes the T-800 look like a jester, no longer intimidates and is now a joke in bad taste."
    },
    {
      "rating": "0",
      "text": "Lazy script + SJW Politics + Jump the shark scenes = terrible film.  Dark fate is a terrible story....really, there is no story.   It is poorly written and I am shocked James Cameron, who is known for his intricate interwoven story lines and realistic believable characters and action really bombed this movie when he allowed amateur writers to wreck his franchise.  This movie is episodic.  By that I mean it is just the same characters going from one scene to the next in miniature episodes without any over-arcing or interwoven story whatsoever beyond \"lets run to the next location\".    When each episode is done (lasting about 15 minutes), everything that happened in that episode is 100% forgotten and nothing is ever referenced again later on.   Many things in this movie are absurd and grounded in stupidity and poor script writing:.... US Air force major is just going to hand over top secret gear without so much as explaining it to us?  A truck falls 200 feet from a dam into ravenous waters with human passengers and no one is injured?   A plane at 20,000 feet bursts and no one blacks out over decompression?  SJW politics are amock, running foul in this film.  The first 30 minutes are in Spanish, I do not exaggerate, I thought I was watching a foreign film.   One 15 minute episode has our characters at a border detention facility where...surprise surprise...US customs are negatively portrayed complete with a reference to separating families.   Good grief.  Lack of originality:  In this terminator the BIG REVEAL (why she is so important) is so obvious- it was pretty much shouted at us multiple times long before it happened.  NO one with an IQ over 20 would have assumed she was going to give birth to someone after the repeated insults to our intelligence by announcing it loud and clear early on.  John Connor was someone who led the resistance....Guess what this girl does?  Oh yea....how original.  The girl in this movie literally goes from \"i've never touched a gun before\" shy and typical to expert marksman and full on military leader in 5 minutes.   So stupid.A scene where non cyborg humans are underwater and then pop up to the surface like they are made out of Styrofoam is ridiculously unrealistic.too many plot holes and lack of an interwoven story in between all the little \"episodes\" the characters take every 10 minutes...  make iDark Fate a bad movie patronizing to intelligenceBad writing."
    },
    {
      "rating": "2",
      "text": "Terrible writing, ancient CGI... and we’re talking about a guy who spawned BLUR Studio in late 90s and their cinematics for game trailers knowadays looks better then Rev9. What’s in the box? Forced appearances of Arnie and Sarah (but she’s so underdeveloped as a character that it hurts), a finger to the fans of John Connor, dialogues hurting my ears... it’s bad writing. And the ending... gosh, It’s Genisys all over again. I must say this, since first scene on the beach I’ve felt disconnected, nothing made me interested In next act and these two points of this review are only for deaged sequence. Sorry, Terminator franchise is now dead. People change, that’s why Cameron can’t guarantee us a good movie anymore. He praised Genisys (which at this point I like more) before, he rightly bought the rights to this franchise after last one flopped and nothing has changed."
    },
    {
      "rating": "3",
      "text": "It's an  ok action Movie, but an AWFUL Terminator.Plot holes and the many inconsistencys of the story got me out of the movie. Too many dumb things. If you have to watch it, be sure to put your brain in a bag before, if you want to enjoy it.If in the future i have to rewatch it, i'll put my second degree hat on, and watch it like i watched The Room."
    },
    {
      "rating": "2",
      "text": "This movie it's a waste of potential. A waste of characters and it's sole reason to exist is to sell tickets whilst relying too heavily on nostalgia."
    },
    {
      "rating": "1",
      "text": "My goodness what a poor movie. Can't believe I spent money on this. Poor story, unbelievable acting, poor directing and things that happen in the movie that is simply unbelievable even within the context of the Terminator Universe. Avoid!"
    },
    {
      "rating": "0",
      "text": "truly awful. t1+t2+scc = all i need. to kill of john conner like that and ruin everything like this movie was just stupid."
    },
    {
      "rating": "0",
      "text": "Disaster. Linda Hamilton is ELDERLY and overacts badly the whole tough guy role. Is she wearing a diaper?..The LGBT-1000 blonde girl is whiny and terrible ...cant act....plotholes EVERYWHERE...bad directing....P-U-N-T already."
    },
    {
      "rating": "0",
      "text": "It's no better and no worse Terminator Genisys. They destroyed the franchise. Please do not make any more films."
    },
    {
      "rating": "0",
      "text": "The storyline completely broken. Genesis is no longer the worst movie in the franchise."
    },
    {
      "rating": "3",
      "text": "I liked a the Terminator movies so far, of course T2 beeing my favourite. But this one ? Starts strong, but goes downhill in act 2 and 3 when it becomes  convoluted and more of the same. Arnolds character just doesnt work."
    },
    {
      "rating": "3",
      "text": "An utter disgrace to the \"franchise\". The casting is atrocious and the political correctness agenda being pushed was so blatant it made me want to vomit in my mouth a little bit. The new her-minator was the only good part of this movie. The new \"Joan\" Conner had the charisma of a wet rag and was so badly cast and un-believable in that role it was laughable. Arnold had his balls snipped and was a side show in his own movie. He was playing second fiddle to a 5ft hobbit and a boozed-up, bitter Sarah Conner - who was a shell of the iconic character from T1 and T2. The \"bad\" peewee1000 terminator was bland and about as threatening as an earth worm. The story is just a pathetic and far weaker version of T2 even with many of the same seen-it-all-before action scenes. And what they did to John Connor was disgraceful. They took a huge dump on T2 and ruined it's legacy in the name of nothing more than making way for \"new\" characters.  I need to watch T2 again just to get this crap stain of a movie out my mind! Please, for the love of humanity give it a miss."
    },
    {
      "rating": "1",
      "text": "Really bad movie, unbelievable acting, bad casting, weak plot, obvious mistakes. Good effects though"
    },
    {
      "rating": "2",
      "text": "the main characters all act very stupid and antagonistic. after 20 minutes i just wanted them to be killed by the terminator. they act like really bad people all the time"
    },
    {
      "rating": "2",
      "text": "Very disappointing, If you liked the last steaming pile they released with the name Terminator attached this movies farts are right up your ally but for T1 and T2 fans don't watch this with high expectations, I'd even say use an eye patch to protect yourself from this movies herpes wink wink, is it a wink if its your only eye? arrrr ."
    },
    {
      "rating": "0",
      "text": "Worst terminator movie ever along with the worst acting. 10 minutes into the movie, I wanted to kill Sarah Connor"
    },
    {
      "rating": "1",
      "text": "Uninteresting characters and terrible action. I pray to forget this movie. Would’ve gladly taken a sequel to Terminator Salvation over this mess"
    },
    {
      "rating": "1",
      "text": "Do you want to know how to kill the franchise? Just go watch this movie.At least Sarah Connor stills being Sarah Connor."
    },
    {
      "rating": "1",
      "text": "Happy to see Linda Hamilthon again, but i've really don't like the story.I don't understand how it can be in Terminator timeline."
    },
    {
      "rating": "10",
      "text": "Fun action film. Best Terminator movie since T2.  Please go see it. Great action scenes."
    },
    {
      "rating": "2",
      "text": "Nothing new.. same old same old great special effects but story line is hurting"
    },
    {
      "rating": "2",
      "text": "Лучше я бы пробухал те деньги которые потратил на билет этого Дерминатора!"
    },
    {
      "rating": "2",
      "text": "I had high hopes for this movie. It looked like a return to form. But then, they hit you with that opening scene. It isn't even used to push the characters or the story forward and is just in there for shock value. The rest of the movie is bland and dull. It all felt so generic and manufactured, just like the terminators themselves. Don't watch this sorry excuse for a movie."
    },
    {
      "rating": "1",
      "text": "GWGB. Total disappointment. This movie belongs to dirt bin. Sacrifiyng beloved characters for political propaganda is just crazy."
    },
    {
      "rating": "5",
      "text": "I love the John Connor saga and this movie destroyed it. Why must SJW agenda be injected in entertainment that consumers paid to watch? The only reason this film got 5 from me because of the action sequences and Linda Hamilton performance. The story plot is not so good."
    },
    {
      "rating": "0",
      "text": "Leftist propaganda everywhere I look. Don’t become indoctrinated by it, that’s what they want. Be smart be best."
    },
    {
      "rating": "0",
      "text": "The WORST Terminator ever 1. They kill off John Conner. Why? It completely destroys the whole plot of the original movies 2. They make Arnold Schwarzenegger into a maid and babysitter. Um why? They totally emasculated him and it made me confused and sad at the same time. 3. They make a woman who looks like she can't fight her way out of a wet paper bag be the true savior Absolute garbage. Sarah Conner was a strong female character in (1 and 2) and they even ruined her character as well in this movie. If they were looking to kill this franchise, then they certainly have done their job."
    },
    {
      "rating": "3",
      "text": "Feminator is the worst movie of franchise. Have no idea how original director could make such sh1t. All universe fans please skip this trash."
    },
    {
      "rating": "3",
      "text": "First of all...so much feminism and gender mainstreaming here. Ridiculous. Destroyed all the movie. Only Arnie was convincing."
    },
    {
      "rating": "2",
      "text": "How this got beyond the concept stage and into production is beyond me. It’s terrible. The unbelievable action, cliched story and terrible tropes.Awful beyond words. It’s a PS4 hoping to live off the legacy of the first two films. Avoid."
    },
    {
      "rating": "1",
      "text": "This is the kind of trash that gets produced when identity politics takes over.  But ironically, the same people that hated this, probably gave Mad Max Fury Road a pass back in 2015."
    },
    {
      "rating": "0",
      "text": "This movie is an SJW wet dreamAlso it seems they've done nothing original since Terminator 2, maybe salvation..."
    },
    {
      "rating": "1",
      "text": "I wanted so much to love this movie having been a fan of the franchise from the beginning. Forcing a change of gender for the main character is the only purpose of this film and completely unnecessary since Sara Connor was and still is a badass female character. Stop killing my childhood franchises."
    },
    {
      "rating": "1",
      "text": "Dark Fate managed to do something I thought was impossible, to be even worse than Genisys. Deadpool was clearly a fluke."
    },
    {
      "rating": "2",
      "text": "I’m late to the game because I just knew it was gonna be a bad, and it was every bit as bad as I was afraid it would be. Just another soulless sequel that nobody needed or wanted. Even Linda and Arnold couldn’t make this worth the price of admission, it’s a boring, thoughtless entry in a series that died in the 90’s. If it didn’t have the Terminator name attached to it, nobody would have ever watched it. Pretty sad end to a franchise."
    },
    {
      "rating": "3",
      "text": "For itself a good movie despite some flaws. What destroys the movie is that it is a hard reboot of the franchise. Yes you read it correctly. All previous movies are meaningless in less than 5 minutes even the good first 2 (Rest is spoiler free). Many people have quit watching the movie here and will give a 0/10 and I will not deny that they have a valid point. It was a mayor complaint by some critiques and most fans. Often it is credited as “The Last Jedi” of the Terminator franchise. I would give a 8/10 without it. In hindsight we could have predicted it as there was a certain character missing in the trailers and no one in the shown cast could fill the role. Increasingly there were rumors that it will ignore the divisive former movies and continue the story from Terminator 2 which is technically accurate. It was an insane decision to pull this off and the box office and fan reactions prove it. I must again say that it is a good movie with characters that I enjoy but it is hard to get as much invested as to the other characters we cared for decades. As remark: People always like long established characters more than new once especially when the new characters could not shine before such drastic events. After the reboot inducing events the story starts after a time gap in Mexico City 2020. A new Terminator is send back in time to kill Dani Ramos and a female soldier is send back to stop him. It is the standard formula for the franchise and the story develops as before with a few twists. Again I say I like the story but it has a few logical flaws that I cant go into details because of spoilers. Lets say the first 2 movies of the franchise made clear what would happen as follow up of a certain event that happened here at the beginning (And it did not happen). It lacks the consequences and with that weakens the menace. For the actors I have only praise and I blame the flaws on the script. Arnold Schwarzenegger returns in his signature role and gets some new facets. I really like the development but be warned it confused some fans and became a WTF moment for them. Linda Hamilton returns as Sarah Connor and delivers the best performance in the movie. Mackenzie Davis as Grace comes close to the best performance. Sadly the script weakens her performance but like I said I wont hold it against her. Natalia Reyes as Dani is good and delivers her role. Gabriel Luna as Gabriel / Rev 9 is excellent. Menacing and ruthless as he / his role has to be. A great cast and it is sad that they wont get the credit they deserve as the reboot overshadows everything by far. The visuals and special effects are as always remarkable. It is a thing each movie in the franchise does right. The action sequences are great too and I like how they use Graces special condition to get more out of it;-). Overall this enters the realm of good movies were a single (really stupid) plot choice ruined the experience. After the reboot inducing element you cant enjoy it as fan as you just feel the loss and potentially anger. It is a shame but cant be changed. I don't know how this could be accepted as the backlash would be unavoidable and clearly foreseeable. I think they need an idea checker that stops such wasteful mistakes."
    },
    {
      "rating": "1",
      "text": "Worst Terminator movie to date , thé toxic woke **** killed this franchise."
    },
    {
      "rating": "2",
      "text": "Probably the dumbest movie I've seen in the last couple of years. Genesis is not a bad movie yet. I could not even imagine how to spoil the film if I put feminist ideas at the head and make the main antagonist a helpless dumb. And the main protagonist who replaced John Connor is so puzzling at all, her character is not spelled out by the screenwriter at all. As a result, the film has 2 normal scenes and all the rest is either self-copying the series again or the complete stupidity of the screenwriter. The Terminator series is dead, and the saddest thing is that Cameron himself buried it, betraying his ideas.1 point for name, second point for Arnold)"
    }
  ]
}