{
  "id": 2325,
  "title": "Terminator 3: Rise of the Machines",
  "starring": [
    "Arnold Schwarzenegger",
    "Nick Stahl"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "It's been 10 years since John Connor saved Earth from Judgment Day, and he's now living under the radar, steering clear of using anything Skynet can trace. That is, until he encounters T-X, a robotic assassin ordered to finish what T-1000 started. Good thing Connor's former nemesis, the Terminator, is back to aid the now-adult Connor … just like he promised.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qAnafzrd9Y5pVTWAP0tSDDMPzTR.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 5.846153846153846,
    "ending": 5.4,
    "soundtrack": 3.6666666666666665,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 6.838709677419355
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The most unimaginative movie in years. Boring action in spite of an enormous budget. Special effects are dull and tiresome. It is simply unbelievable how they managed to clone the previous movie, in the worst manner possible. I didn't expect a masterpiece, but still this exceeded my worst pessimistic anticipation."
    },
    {
      "rating": "4",
      "text": "There were some obvious goofs in the filming of T3. [***SPOILERS***] First of all, Arnie says that each T101 has two fuel cells powering it. He dumps one cell at the beginning of the film and the other cell at the end - leaving him with no cells and no power. Yet somehow, unbelievably, he keeps operating as though he has power and the light in his eye only goes out *after* the .. um... \"grand finale\". Where is this mysterious battery power coming from? The repeating scenes from the other T-films was absurd. Quotes were being repeated.. whole action sequences seemed to have been copy-pasted over.. I can't see this film having much rewatchability."
    },
    {
      "rating": "0",
      "text": "I can't believe this film is actually getting good reviews at all, it's extremly awful. Remember in T2 where they destroy all the evidence in the cyberdyne building and the arm and chip from the old terminator from the 1st movie, well in this film it's showing you that it was all pointless and a waste of time. T2 ended perfectly with the emotion of the terminator having to destroy itself to destroy all evidence of skynet but now he comes back and he says that it has been delayed for no reason at all. There wasn't any music to the film until the end, john conner acts like a complete wimp compared to what he was like when he was 10, how the TX can just zap a car and make the pedals and steering rack move i do not know (seeing that there are no electronic parts in the pedals or steering wheel. This really is a bad film to the terminator franchise, if anyone out there thinks this is a good film to add to your terminator collection then they obviously don't know and care about the terminator story!"
    },
    {
      "rating": "8",
      "text": "This third Terminator movie belongs to a completely new generation and there’s much criticism against it. But I disagree, it really is epic and it totally succeeds with action.\r The movie starts with a damn exciting, and action-packed opening scene that got the classic and hilarious Terminator touch. The first and second act got extremely great action sequences, it’s so massive and it keep going and going. I really love it. The third act got less action-quantity but instead greater quality. Therefor is it much more epic. The plot of the movie is very entertaining, but not as original. There are many similarities between this and the previous movie; Terminator 2: Judgment Day, which makes this film less unique. The actors though, are wonderful. There’s also great chemistry between the characters, but it feels a bit too forced and dry. The movie lack character development and there’s not much magical, funny and awesome interactions between them as we saw in the previous movie.\r When it comes to the villain is the T-X awesome, she’s a real competitor to the T-1000. She’s also much cooler but unfortunately not as scary. Terminator 3: Rise of the Machines is overall very well made, but there are vague CGI at many places. But the action sequences are of course fantastic and highly entertaining. I could not be more satisfied. The soundtrack gives the movie a scary and challenging feeling, but it could have been even more excessive to trigger an emotional response. The ending of the movie is great, but it made the whole film a bit meaningless. It’s still a great ending though.\r It does have some serious flaws, but it’s still an awesome action movie that worth watching!\r Terminator 3: Rise of the Machines gets an 8.2/10."
    },
    {
      "rating": "10",
      "text": "The last great Terminator film, this film still has the charm the 2nd film had."
    },
    {
      "rating": "0",
      "text": "Sorry, but this is the worst movie of the trilogy. Casting is awful and actors don't look too well directed in this movie. 0/10 (BAD)"
    },
    {
      "rating": "8",
      "text": "Não alcançar nem longe a obra-prima T1 e T2,e na minha opinião é ainda inferior ao Terminator 4:Salvation,mas continua um bom entretenimento Claire Danes e Nick Stahl fazem um bom trabalho como xxxx e John Connor e Kristanna Loken é uma boa T-X,Schwarzenegger continua bem."
    },
    {
      "rating": "8",
      "text": "Holy crap. How times change.Been re-watching all the Terminator films in chronological order. The original is still a masterpiece despite some very dated effects, the second has dated in quite different ways but is still remarkably charming...but the real surprise? The third film is nowhere near as weak as I remember!Given much of what has passed for \"blockbuster\" entertainment since, Terminator 3 holds up remarkably well. Yes, it's largely a retread of the second film - far more than the second is a retread of the first - but it's admirable entertainment, all told. Virtually none of the emotional punch of the first two, but...hey...it's a heck of an improvement over the fourth film in the series, Salvation. (Which I'll evidently be subjecting myself to next. Wish me luck!)"
    },
    {
      "rating": "8",
      "text": "While its the weakest of the first three terminators it is way better than the ones that came after it. It still feels like a terminator movie. John Conners character could have been written better but the acting wasn't at fault. Claire Danes is great in her role too. I really like the setting of this movie in the period when skynet became aware and armageddon happened. The last half of the movie is so thrilling."
    },
    {
      "rating": "8",
      "text": "Terminator 3 really did not need to happen, especially since the movie is just a retread of T2(which was also a retread of the T1). I would be offended, but only if the movie wasn't entertaining. I find it to be very enjoyable, even though its existence was just to milk more money. It's not great, but it comes very close to being great. It's more of a pointless, yet entertainingly good sequel."
    },
    {
      "rating": "8",
      "text": "James Cameron is gone for Terminator 3 and the film lacks a bit missing his writing and direction but the film manages to stay fun and is still a strong action film despite being weaker than the first two movies. Arnold Schwarzenegger is great once again as the Terminator and its interesting to see a woman villain as this franchise has always been good at producing strong female characters. If you are a fan of Terminator films you will find this film weaker than the first two but the action is great and the cast is great which still makes it a fun action film."
    },
    {
      "rating": "9",
      "text": "Much better, in my opinion, than JUDGMENT DAY, but RISE OF THE MACHINES is the third entry in the series and has still yet to reach or top THE TERMINATOR."
    },
    {
      "rating": "8",
      "text": "The movie isn't as awesome as the second one, but ignoring the flaws, it's a pretty good movie overall. Arnold Schwarzennegar does a perfect job just like the previous two. Hoping they get him back for T5..."
    },
    {
      "rating": "3",
      "text": "A mediocre to bad follow-up to a very promising film that imbued this one with a lot of potential. Boring, toothless and cheaply conceived. This is the first in a long series of post-Cameron Terminator franchise missteps."
    },
    {
      "rating": "6",
      "text": "\"T3\" lacks what made \"T2\" and \"T1\" a masterpiece, but it still has the blockbuster spirit within the movie."
    },
    {
      "rating": "8",
      "text": "Terminator 3 directed by Jonathan Mostow and made in 2003 was sadly the last half decent Terminator film made. Everything since  Terminator 3 is pure dinosaur droppings from Jurassic Park. For me Terminator 3 was the only real sequel to Terminator 2 as it doesn't insult James Cameron's classic sci fi action flick. Once again like in T2, Arnold Schwarzenegger is sent to protect John Connor and this time also some girl named Kate Brewster (Claire Danes) but also a newer deadly machine is sent to Kill them in the form of the beautiful T-X (Kristanna Loken). What the film lacks in terms of action Kristanna Loken makes up for by her gorgeous figure, beauty and sex appeal however this film has some of the greatest action scenes I've ever seen and some good stunts and it has loads of good humour. The only annoying thing is Nick Stahl as John Connor because he's annoying in Terminator 3 but besides that this is a worthy sequel to Terminator 2 and a great entry into the Terminator film series. I think Terminator 3 was great and Kristanna Loken was beautiful as the villain terminator TX who was similar to the T-1000 and the TX had a flame thrower and other variety of weapons and could immitate other human beings. Terminator 3 was good"
    },
    {
      "rating": "3",
      "text": "A unneeded sequel that does nothing but butcher a once great series. Terrible acting and poor action/special effects makes this a disapointing end to the original trilogy."
    },
    {
      "rating": "3",
      "text": "Even though i think the first two Terminator films are outstanding,i wasnt expecting much from this one when i went into the cinema,& i got what i expected.This is not a good Terminator movie,or movie in general.It took a while to put my finger on it,but i realised that it didnt have the gritty feel & look of the first two movies,being way to bright & colourful.It just didnt feel right.. The music just seemed a little random & not stiring at all,The actor that played John Connor was ok,but he reminded me constantly of Dr Bashir in Deep Space 9(for tht longest time,i thought it was the same actor)!,& Claire wasnt particulally likeable or interesting.Another BIG critisism to this film,is casting a woman as the other Terminator.I'm sorry if this sounds sexist,but no matter how much she kept a straight face,i just couldnt take her seriously as a threatening Terminator.. Making her Boobs grow,to get positive treatment from a police officer didnt exactly help this either.. Even though the story explains how the war with the machines started,most of the film seemed pointless & unessasary.There was also too much humour,& silly bits,for example when the TX gets hit in her head,her head spins round,the afforementioned growing boobs,& the stripper he gets his clothes & 'Star shaped Sunglasses'? from. this movie seemed kind of a joke to me,& that the joke was on me.. Thank goodness Salvation was much better & more serious,though i'm not sure if Arnold Coming back for No 5 is a good thing or not,after No 3.Time will tell.."
    },
    {
      "rating": "6",
      "text": "Ten years after the events of Terminator 2: Judgment Day, John Connor, still fearing that the war against the machines may still come to pass, has been living in hiding following the death of his mother. Unable to locate John in the past, Skynet sends a new Terminator model back in time to John's present time period to instead kill other top members of the future Human Resistance, thereby ensuring Skynet's rise.Terminator 3 is a decent enough action movie with some excellent special effects and exciting scenes, but it’s a movie that just never seems necessary and the ending essentially completely undoes the finale of the previous movie. As a stand alone action flick it’s entertaining enough for the most part, but as a Terminator movie and follow up to one of the best films ever made it’s a disappointment."
    },
    {
      "rating": "5",
      "text": "Doesn't live up to the standards set by the first two, and isn't as interesting or thought-provoking, but has some more catchphrases and special effects to keep it going."
    },
    {
      "rating": "6",
      "text": "While the characters aren't as fleshed out as it's two masterful predecessors, the action and the charisma of Arnold Schwarzenegger in Terminator 3 does just enough to compensate."
    },
    {
      "rating": "1",
      "text": "They decided to hire some dumbass to create a third Terminator movie that sucks. It took actual trying to finish this movie and not decide to sleep lol."
    },
    {
      "rating": "5",
      "text": "Rise of the Machines suffers from weak performances from Nick Stahl and Claire Danes, a repetitive plot, and dumbass gags and laughs throughout. Very disappointing, especially compared to the greatness of the first two films."
    },
    {
      "rating": "9",
      "text": "T3 has excellent special effects and a decent story but T2 is the best of the series. Furlong isn't in this\rmovie, they cast Nick Stahl. Arnold is back and the femal TX is vicio the movie has thrills, action and comedy from Arnold. The movie delivers exactly what any terminator fan expects"
    },
    {
      "rating": "3",
      "text": "Terrible follow-up to the first two movies, which were masterpieces, this is just stupid, there is nothing worth about this crappy movie, so you can easily just stop at T2, well at least it is not Terminator Salvation."
    },
    {
      "rating": "6",
      "text": "It's not nearly as good as the second film - it lacks emotional characters and a strong heart. However, it does not fail to entertain us with its intense and explosive action sequences."
    },
    {
      "rating": "8",
      "text": "I don't understand the hate and ridicule that this movie receives in comparison to Geneysis and Salvation. Even without James Cameron, \"Rise of the Machines\" still manages to stay fun and is still a strong action film despite obviously being weaker than Judgement Day. It's not as great, but it comes close. Its a strong, entertaining sequelOverall score: B+"
    },
    {
      "rating": "1",
      "text": "This bu-ll-sh-it have more valoration than other movies I liked, (Spiderman 3 for example) what a shame. Metacritic, you lost my credibility in the movies, no longer serve me.. you can kiss my ass."
    },
    {
      "rating": "0",
      "text": "The weakest of the 5 movies.terminator 3 does not have sarah connor,but it has bad acting,awful villain.and its not loyal to the cameron classics,its 2020 the judgement day,not 2003.it sucked all of the dicks of who watched that movie.and,its clearly the 3rd worst movie of all time."
    },
    {
      "rating": "0",
      "text": "Fantastic beginning of a series ruined by feminist lunacy. Nothing fits in this movie, not even her ugly dress. Disastrous casting, except Arnold, and utterly bad script and directing."
    },
    {
      "rating": "10",
      "text": "So a very outdated model is going to win against a brand spanking new one that can control machines and has plasma casters in her arms. Ya, that will happen. All credit to Arnold, who is a kick ass actor,  but I don't think that a (apparently) nuclear powered robot is going to beat the new girl in town."
    },
    {
      "rating": "7",
      "text": "The third movie of the Terminator Saga was not directed by James Cameron anymore but Jonathan Mostow. The movie also changed its studio from Metro Goldwyn Mayer into Warner Bros. Pictures.  It is a lot like the second movie: Judgment Day. A terminator was sent to kill John Connor again. The last movie we had T- 1000 and then it’s T-X, a completely new terminator. After dying in Judgment Day, T-800 had returned and took some punk clothes and sunglasses, just like the first two. It should change I think.  Everybody loved to see a terminator movie with Arnold Schwarzenegger and he made his third debut in the third movie. However, I wasn’t impressed with the plot that T-800 wasn’t a series 101 but a different one, a protagonist with a dark and strict character. He forgot everything John taught him in Judgment Day: the smile, Hasta La Vista Baby and more. I was really disappointed with that fact. John Connor wasn’t played by Edward Furlong anymore, the role changed to Nick Stahl, who had been known for being in Sin City (2005). The performances weren’t as good as the previous two but they weren’t terrible. Schwarzenegger wasn’t trying his best for the third movie so I think the best performance here was Nick Stahl’s John Connor. He was excellent making the character Katherine Brewster played by Claire Danes agreed to be on their side. It’s great to see the two together. The really big problem here was T-800. He knew too much and he kept predicting futures. It’s not necessary to or maybe he shouldn’t say it. It’s like spoiling a movie with great contents. T-800 said the two got married, John would be terminated in 2032 and more things that we wouldn’t want to be spoiled. When T-800 revealed when John Connor dies, it was the stupidest thing to say. And it got worse when T-800 revealed the killer,…him. I called this the biggest issue in this movie. It’s really terrible and I hate it! See, that’s why this one’s the least popular of the Terminator Saga based on IMDb (6.3/10).  However, I don’t hate the other parts of the movie, they were good. The CGI was okay and so was the cinematography. The action sequence were epic and instead of saying his words (Hasta La Vista, Baby) to kill T-X, T-800 said: “You are Terminated!”. That would explain that T-800 completely forgot about what John had taught him in Judgment Day. It’s not one of the bests in the Saga, but it wasn’t too bad. I’m looking forward to see more: Terminator Salvation, Terminator Genisys and Dark Fate. I’m starting to like this franchise.Ratings: 6.8/10"
    },
    {
      "rating": "2",
      "text": "Terminator 3 is just one of those sequels that just don't need 2 b made. At the end of T2 they had stopped Judgement Day from occurring, but in this, it's said that Judgement Day is inevitable. The Terminatrix was a horrible successor to Arnold from T1 and Robert Patrick as the T1000 in T2. John Connor was very annoying in this film. It really annoyed me that Sara Connor wasn't in this film. The pacing is abysmal, the acting is bad at best. The plot was beyond retarded. By far, the worst Terminator film 2 date."
    },
    {
      "rating": "8",
      "text": "Even without James Cameron's presence what we have is a 3rd entry that stays true to the concepts, themes, and most importantly feel of the previous two films. It's not quite as intelligent given that there are a few questionable moments and missteps in logic that are noticeable. However the plot is still complex enough to make it worth following. It's got more brains than the average action film.\r Speaking of the action it's a blast to watch. Quite literally in fact. Explosions and gunfights are everywhere. It manages to keep a large level of destruction and mayhem with out coming off as excessive or just plain noisy. I love how the director incorporated the weight of the Terminators into the action. The previous two films didn't have too much of that.\r As far as the acting goes it's just as great as the other two films. The human characters are believable, and the actors playing the Terminators show just the right amount of non-expression. Schwarzenegger is just as great as ever.\r While it doesn't quite reach the heights of it's predecessors and has some questionable moments, fans of the series can still find this to be a worthy entry. It's worth watching the continuation of this sci-fi tale. With action this exciting and a plot this cool, it's easy to forgive a few mistakes."
    },
    {
      "rating": "4",
      "text": "At least we have Arnold. His acting saves this movie from being a total disaster. But looking past Arnold, Terminator 3 is the theatrical equivalent of cleaning a 93 year old man’s colostomy bag. I was expecting **** but was somehow surprised by the amount of **** I was presented with."
    },
    {
      "rating": "4",
      "text": "The best thing about Terminator 3: Rise of the Machines is that Linda Hamilton dropped out of it because it is soulless. This is the same story we’ve heard before except with even more action and is mostly an uninspired retread of the first film. The film does take some time out to have a occasionally heartfelt moments but not enough to warrant the film’s existence. Arnold is entreating but that’s about it. At the end of the day this is not only an unnecessary sequel but an unpleasant one that is a slap in the face to Terminator 2: Judgement Day. Mixed feelings on the ending, which while surprising feels like a punch in the gut like being told that the Tooth Fairy isn’t real."
    },
    {
      "rating": "6",
      "text": "its my least favorite in the series, but it has the charm of Arnold Schwarzenegger as the Terminator."
    },
    {
      "rating": "6",
      "text": "A few intensely entertaining set pieces serve to only just elevate this movie above its cheesy story and hammy dialogue."
    },
    {
      "rating": "6",
      "text": "It's a good pop-corn movie but lack's that serious wow factor. The story doesn't live up to the first two movie's. The opening sequence when we first see the Terminator. Set's the tone of the movie. Enjoyable nonetheless."
    },
    {
      "rating": "7",
      "text": "Movie was good but no the best. It has just become far too unrealistic, what the heck is the use for a robot to make their own boobs bigger? The talk to the hand and the sunglasses was funny but still doesn't fit into the movie. [***SPOILERS***] When does a robot care if he has good looking sunglasses or not? When the TX finds blood which belongs to John Connor she seems breathes out heavily and Robots don't have feelings! Else it was good."
    },
    {
      "rating": "9",
      "text": "I just finished watching all 3 movies (T1, T2, and this T3) back to back in a marathon. And I must say that it is very good. I would say on par with T2. The plot twists keep you on the edge and action never lets go. Very enjoyable film, and I wish it would keep going."
    },
    {
      "rating": "5",
      "text": "While its certainly an entertaining film, the action sequences are fun to watch, and some of the one-liners are pretty funny, its essentially a dumb action film. The Terminator, who's most fascinating quality in T2 was his quest to understand Humanity, is instead reduced to a dumb joke machine. The character development is thin on the whole, and the T-X is far too over the top for my liking. The T-1000 was a much more threatening villain. If you want a damn good film, watch Terminator 2. If you want a decent summer action flick for passive enjoyment, watch this."
    },
    {
      "rating": "7",
      "text": "Offers great action, but is overrated and lacks enough character development between John Connor and Kate Brewster. But it's fun watching the Terminator (Schwarzenegger) battling the Terminatrix until Judgment Day starts so John Connor becomes ready to enter his prophecy as the leader of the Resistance in the future war."
    },
    {
      "rating": "6",
      "text": "Unfortunately this was the worst of the series. The selection for the John Connor character was terrible, the invincibility of the Terminators has gotten more and more extreme each time, and while the effects have become markedly improved over the years, the CGI looked overdone. I mean, it was still an entertaining movie but it just wasn't as good as the first two. Hopefully Christian Bale makes Salvation BA because this definitely was not."
    },
    {
      "rating": "6",
      "text": "A decent yet terribly acted picture. It doesn't have the storyline or characters as the second installment but has much better single piece action sequences than many other films."
    },
    {
      "rating": "7",
      "text": "Compared to the other ones, this one is by far the best. still not a fan of it, but some scenes pretty funny to watch and some action sequences were pretty impressive."
    },
    {
      "rating": "6",
      "text": "\"Terminator 3: Rise of the Machines\" is a step back over its predecessor, with a storyline trying to achieve the same results of the previous outputs, but it's still action-packed and Arnold Schwarzenegger continues delivering successfully quotable lines of dialogue. If it wasn't for him, we would be looking at a 4/10 film.\r 6/10."
    },
    {
      "rating": "6",
      "text": "T3 no llega a ser una obra maestra como T1 y T2, sin embargo, yo no pienso que sea una perdida de tiempo o un fracaso. En T2 James Cameron acabo con la franquicia dándole un final, pues aquí vienen a continuar la historia al desirnos que el dia del juicio es inevitable por que algunas cosas simplemente no se pueden parar. Como la muerte, la creación de una I.A real, etc. Lo que molestara a los fans de las películas es que el inicio no esta bien enfocado. Iniciamos con John Connor, de hay pasamos con la T-X, de hay vamos con un personaje que no conocemos pero sera importante por que la muestran muy temprano, de hay vamos con el T-101 y volvemos con John Connor. La película debió iniciar como las anteriores: Salen los Terminator, se establece la amenaza, de hay vamos con los personajes y los desarrollan y seguimos con la trama junto a escenas de acción. Aquí no esta ese orden y esta algo fuera de lugar. Pero si hablamos de las escenas de acción son increíbles, el CGI se ve bien, un poco raro aveces pero es 2003, me sorprende lo bien que se ve para su época, los efectos prácticos/reales también abundan, eso siempre ayuda. Yo fui a esta película intentando disfrutarla, el inicio puede molestar por un par de tonterías como que John Connor toma pastillas que les dan a los animales sin saber que son. Aun con sus problemas creo que se pueden sacar buenas películas en el futuro ya que podemos ver mas de la resistencia o un reinicio por un viaje en el tiempo con la película \"Terminator Genesis\" que saldrá en 1 año. Le doy un 06/10, no es una abominación, solo no esperes una obra maestra como las anteriores. Al final la película no esta mal."
    },
    {
      "rating": "7",
      "text": "Terminator 3 is a good movie, but... it dosent offer anything new. A female terminator? Im okay with that, but what the heck is that scene where her breasts infate about? That is so weird. Arnold can talk while he has a virus in him? What? But I will give it this: That ending is really great. It isnt a happy ending, its a dramatic ending. I like it. But as I said, it dosent offer anything new."
    },
    {
      "rating": "9",
      "text": "L’un de mes Terminator préférés ! c’est en effet le moins sérieux et le plus rocambolesque de la série et le plus drôle également… Que ce soit dans les dialogues ou les scènes d’action (très) improbables, c’est plein de jokes et Schwarzy en fait des tonnes ! il n’est pas le seul cela dit, car tous les personnages sont désormais d’authentiques caricatures (à l’insu de l’ignorance des scénaristes et du metteur en scène ou pas, là n’est pas la question).Bref, on rigole beaucoup, on ne s’ennuie jamais et le scénario a un petit côté pré-Fallout très séduisant tout en évitant les discours parfois grandiloquents de Terminator 2. Quelques excellentes idées sont aussi fort judicieusement exploitées avec par exemple la terminatrice dont le développement et l’inventivité laissent bouche bée.Finalement, pas mal de recul pour ce film d’action qui sait rester spectaculaire et perpétuer la mythologie de cette saga qui rebondit au rythme des retours vers le futur simple du passé antérieur.Ce Terminator 3 est évidemment à prendre au second et même au troisième degré : il s’agit en vérité d’un film entier dédié au fan service et à ce titre il excelle d’une façon inattendue. On a par ailleurs une réalisation solide (Jonathan Mostow n’est pas un branque) dans l’ensemble malgré une grosse poursuite certes spectaculaire mais trop désordonnée et mal filmée. Le rythme reste soutenu de bout en bout et les effets spéciaux sont toujours au sommet !"
    }
  ]
}