{
  "id": 3874,
  "title": "Terminal",
  "starring": [
    "Margot Robbie",
    "Simon Pegg"
  ],
  "runtime": 95,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "In the dark heart of a sprawling, anonymous city, two assassins carry out a sinister mission, a teacher battles a fatal illness, and an enigmatic janitor and a curious waitress lead dangerous double lives.  Murderous consequences unravel in the dead of night, as their lives intertwine at the hands of a mysterious criminal mastermind who is hell-bent on revenge.",
  "releaseYear": "2018",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xi7pA3lL6Wb78p6Y6PgWoHDMjrM.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 4.0,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 4.666666666666667,
    "familyFriendly": 4.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Crappy amateur copy of Ritchie and Tarantino style (tho if you didn't know, \"Snatched\" easily could be called neonoir). Like \"Catch .44\" or \"Sushi Girl\", but even worse and much more incompetent.It was pathetic. Very painful experience. I've had a lot of spanish shame while watching."
    },
    {
      "rating": "2",
      "text": "have i met you before..TerminalThe feature seeks attention through its visual aspects and the dark tone that is mysterious and intriguing, luring you into its besieged bubble which stinks \"street war\" from the first frame, but in a good way. The writing isn't as convoluted and smart as the writers think, which creates the vortex of loop that never outcomes in their favour. Also, the writers are so focused on the trajectory of the plot and its structure that it leaves the characters a bit undercooked that later raises questions rather justifying their actions. It fails on technical aspects too, like background score and production design which isn't convincing for a single frame. Vaughn Stein's attempt may be admirable on executing it, but it surely isn't effective as the drama and the emotions projected comes out shallow and redundant. Surprisingly, the performance; contrary to expectations, is lower as Margot Robbie seems arduous on her work where even though Simon Pegg and Mike Myers supports her; the bullet seems to have left the gun. Terminal is a passionate feature; that is unfortunately surpassed by talent, content and timing, which addition to that was on a mediocre level that never had enough crisp in the first place to ever make it past distinction, let along enter the major league."
    },
    {
      "rating": "4",
      "text": "A new movie from Margot Robbie, unfortunately, did not live up to my unrealistic expectations. The climate of the neo noir and the dark atmosphere accompanying the whole intrigue, not only that it does not draw in its finale yet, is so strange and senseless that the secret and the growing tension are somewhere to escape. It's mainly Robbie, although there are a few very characteristic actors in the film. Sad."
    },
    {
      "rating": "0",
      "text": "La reine Margot m'a fait de l'oeil sur l'affiche du film et puis que ne donnerait-on pas pour Margot dans son rôle préféré de blonde fatale !... certes ce n'est pas Harley Quinn ici, il ne faut rien exagérer mais le film entier lui est dédié ; elle parade comme à la parade, elle ronronne et elle fanfaronne...Et l'esthétique du film à l'esthétique clairement très étudiée, joliment photographiée n'est clairement pas désagréable. Si seulement on avait un film au bout... mais au bout d'1h30, on a toujours rien et on en voit pas le bout sauf quand le générique arrive... enfin ! un étron très bien emballé donc...Nous voilà donc bien marri et dépité. Et floué. Je dis \"nous\" mais c'est le \"nous\" royal et il n'engage que nous pour tout dire. Mais \"nous\" vous déconseillons fortement ce tas de merde d'1h30, bavard et prétentieux, sans queue ni tête, consternant et chiant. On en oublie du coup cette andouille de Simon Pegg (presque supportable ici) ainsi que le trou de balle Mike Myers (toujours insupportable de grimaces et de stupidités).1h30 dans une putain de gare, une chambre d'hôtel et... un bistrot, il fallait le faire. Mais même avec Margot, ce n'est ni fait ni à faire et définitivement à éviter."
    },
    {
      "rating": "3",
      "text": "I'm not sure what to say about this 'movie'. The noir style was nice but under all of the neon lights was.. nothing really. I found myself not really understanding the plot, finding it boring. A snooze fest. It was a nice surprise seeing Mike Myers!"
    },
    {
      "rating": "0",
      "text": "Dear god, was this movie awful!! I don't even know where to begin. Pretentious, artsy scenery. Full Margot Robbie worshipping. Stupid plot and plot twists we see coming a mile away. The messy timeline and narration tries to make the movie more complicated than it actually is. What a boring, messy, useless movie. I don't understand what went through the director's mind. I think he wanted something edgy, with its own tone and identity, but the boring plot makes it fail miserably."
    },
    {
      "rating": "0",
      "text": "This movie is very bad because Margot robbie doesn't know act role.She is very bad.Of course movie"
    },
    {
      "rating": "8",
      "text": "I'm surprised at the heavily negative critical reviews for this. I admit this slightly campy, neo-noir isn't Shakespeare, but I was entertained.This is an interesting film involving an unseen criminal mastermind, a dying English teacher (Simon Pegg), two hitmen, a train station attendant (Michael Myers), and the quirky femme fatale (Margot Robbie) who has them all involved in her web of intrigue.Though the movie can be a little self-indulgent at times, I found it interesting. The dialogue is snappy and often darkly humorous, and everything comes together for the third act which has some effective twists and conclusion.I really liked the neon-lit, noiresque sets. They are the aspect that stands out the most. It's impressive what the director did with a smaller budget.Great cast. It's always interesting when Pegg tries a different type of role, this time as a well-spoken sad sack. Like usual, he really pulls it off. It's also great to see Michael Myers back in the movies after a several year absence. He provides a lot of levity as an oddball. Still, this is Margot Robbie's film. Though her English accent isn't perfect, she commands each scene with a playfully, wicked tone and smile. This is the kind of movie I recommend you see if you want to try something different."
    },
    {
      "rating": "10",
      "text": "Город грехов через задний проход. (Конченая - название, которое мы заслужили. \"TERMINAL\")Картина способна ввести в ступор тех, кто не знаком с таким стилем кинематографа. Но даже знатоки нуара в принципе, и нео-нуара в частности могут плеваться от увиденного на экране по нескольким причинам. Не логичность, за счёт слепых зон повествования, которые обыгрываются сами собой за кадром. Персонажи, что не хотят делиться на первый и второй планы, как того бы хотели зрители. Ощущение, что создатели делали фильм в первую очередь для себя любимых, а потом уже для всех остальных. Однако это не делает ленту плохой! За вот такой казалось бы непреодолимой стеной для восприятия, таится всё великолепие \"Кон(че)(еч)ной\". Тут есть на что посмотреть и я не про полуголую Марго Робби. Операторская работа, смелые и экспериментальные планы, картинка играющая со светом неоновых огней и грамотно работающая в паре со звуком, как фоновым, так и с музыкальными композициями. Персонажи и химия между ними в купе с постановкой делают данный кино-комикс блестяще едкой альтернативой \"Города грехов\"."
    },
    {
      "rating": "10",
      "text": "A fun ride straight through to the credits. The characters, plot, and dialogue in this noir are spun together with darkness, wit, and humor that make this film a unique gem."
    },
    {
      "rating": "7",
      "text": "A very stylish movie full of confusion and more plots than you could shake a stick at, If you're looking for an easy going simple story this movie is not for you. It does feel like a bit of an amateur's take on a Tarantino movie, but each director is different and it surely doesn't make this worse. All the twists and turns kept me more interested than most of the movies i've seen recently and no way you could have guessed the ending.1 problem with this was it could have done with an extra 30 minutes just to extend a few scenes, just adding a bit more detail to some of the stories.Overall - I'd watch this again 7/10"
    },
    {
      "rating": "4",
      "text": "Terminal's strength is in its familiar elements: its dark, neon environment recalls \"Blade Runner\" and it plays like \"Pulp Fiction\". So if you like derivative films then you'll like, otherwise you'll criticize like most others here. The movie is unrated but I didn't see anything more than PG-13, and that's a further disappointment since Margot Robbie played a pole dancer at night and showed nothing, plus she's in short-order waitress wear most of the time, so further disappointment. The story itself is a double-cross revenger so no new ground broken there. Don't waste your \"movie night\" on this one, it's more one to play in the background while you're tablet-surfing or cleaning the living room."
    },
    {
      "rating": "5",
      "text": "The acting is great in this one, but the actual story, while it kinda contains twists and interesting plotlines is actually portrayed really boringly. I mean most of the movie is just some conversations and they kinda make the setting and the visualizations a bit interesting and at some parts I thought they will make it more as a horror movie,but turns out those parts are just randomly there. Also the ending is somehow quite predictable even though it shouldn't be. Basically the ending is the only interesting part, the rest is quite random and, while maybe it does not get completely boring, it just isn't that interesting."
    },
    {
      "rating": "4",
      "text": "Perhaps the cardinal sin being done here is that Terminal tries too hard to be like Tarantino. The film doesn't do much to make itself stand out amongst its peers, almost like its only reason to exist is to demonstrate some out-of-left-field plot twists that turn the movie on its head. Simon Pegg and Dexter Fletcher are the only real standouts, with Margot Robbie and Mike Myers phoning in uninspired performances. The only thing the film has going for it is a unique lighting setup that looks outright gorgeous at times. The oranges, blues, reds, and greens do well to complement the film's noir look, but that's the best that can be said."
    },
    {
      "rating": "5",
      "text": "Terminal is a pretty peculiar movie, much because of his old school visuals and different atmosphere, some aspects that you don't normally see in movies these days. With a clear Noir environment this movies does put you into that investigation climate, that doesn't give you everything at the beginning and kind let you lost during a considerable part of the movie, and they give you piece to piece to try find out what is going on.The movie is about a revenge story. Two hit men, get into a mission commissioned by a mysterious person, and they meet Annie, wich have some to do with what is going on.I loved the movie cinematography, it remembered me a lot of Blade Runner, but without the futuristic aspect, the whole neon colors that jumped into your face is much well done. Sometimes the movie talks to us with their color, putting in the face of the characters some light that represents something, or putting they dressing as a color that also is having some meaning in what is happening.The acting was good for me, Margot Robbie is just amazing, she is interpreting with some over acting, some psycho lines and talking about death with a such natural and tormented way, the way she express and speaks worked a lot. Simon Pegg also did a good job, one of the best moments of the film is when his character and Margot character is taking a time to talk, talking madness. Mike Myers did an ok job, he didn't had much to do, but as an actor was very functional.The story did had some flops, somethings that i couldn't get along, they just have some ideas that doesn't feel right, some coincidenses that i don't buy, it does have multiple plot twists, some of them are really predictables, some aren't, but none get you like \"wooow\" wich i consider a problem, considering that it happens some many times. The movie doesn't make us feel that there is a world happening around, it doesn't have people living, it really doesn't feel like that is real, that got me off the movie sometimes. The sotry does have 2 nucleos, that are a little connected but actually aren't, that felt a little awkward, but was ok. And doesn't happen much things during the movie, it feels like you could watch the begninning and jump to the end.That is an ok movie to watch, you won't get any surprised while watching, but it is a ok story with nice interpretations."
    },
    {
      "rating": "4",
      "text": "I think the vast majority knows that when Jim Carrey wants to play dramatic roles, he knows how to do it well but what is the point when he gets scripts so **** up like this one?I was hopeful because what I saw in the trailers caught my attention but really this film is a very bitter disappointment."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Collateral damage of Tarantinism.Collateral damage of Tarantinism."
    }
  ],
  "recommendations": [
    "bad_times_at_the_el_royale",
    "reminiscence",
    "the_number_23",
    "broken_city",
    "cube",
    "tenet",
    "gone_girl",
    "red_sparrow",
    "the_raven",
    "the_snowman",
    "a_simple_favor",
    "a_perfect_getaway",
    "lucky_number_slevin",
    "hanna",
    "now_you_see_me",
    "rocknrolla",
    "color_out_of_space",
    "colossal",
    "the_machinist",
    "nerve",
    "the_invisible_man",
    "us",
    "the_prestige",
    "project_power",
    "good_time"
  ]
}