{"id": 2631, "title": "Terrifier", "starring": ["David Howard Thornton", "Jenna Kanell"], "runtime": 84, "genre": ["Horror", "Thriller"], "description": "On Halloween night, a young woman finds herself as the obsession of a sadistic murderer known as Art the Clown.", "releaseYear": "2016", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/4lwh4MX2yCogHflyAYMRbfdnpnm.jpg", "categories": {"plot": 6.666666666666667, "acting": 7.333333333333333, "ending": 4.5, "soundtrack": 7.0, "cinematography": 6.5, "familyFriendly": 4.0, "funny": 2.0, "action": 8.0}, "reviews": [{"rating": "10", "text": "Easily becoming a Horror Icon! this character has so much potential to be the next freddy or Jason and the film is great!"}, {"rating": "5", "text": "A generic horror/slasher film with an absolutely creepy villain. Some parts made me chuckle just from the cliches. However, this film isn't necessarily a weak feature. The villain is more than passable, the characters aren't as cardboard as I expected, and the gore is grotesque enough to make anyone squirm in their seat. If you want a cheesy gory film to bring back the nostalgia of the 80's this is it."}, {"rating": "4", "text": "The guy is creepy no doubt about that, but to be completely honest the film as a whole was very generic."}, {"rating": "6", "text": "The characters in this movie aren't dumb. The first act builds itself up nicely with some brilliant set pieces and interesting character development. But when the second act comes, you begin to know this movie is purely out to please its gorefest slasher fan boys and the mediocrity starts to show.It's unfortunate because I wanted to like this movie a lot. Almost every time the clown reveals itself, its posture, face, and overall demeanor you don't expect. It entertained me each time until the second act. The first act = 8/10The last act = 2/10Total score = 6/10. Somewhat recommend."}, {"rating": "10", "text": "Amazing, gorgeous and perfect movie! A true masterpiece in horror movies for todays days"}, {"rating": "8", "text": "Director Damien Leone turns his excellent short film into a feature-length presentation with this gruesome throwback to '80s slasher flicks. Art the Clown is just as creepy and sadistic as ever. I was a little disappointed to find that his supernatural qualities were toned down outside of the startling morgue scene. So in the end he comes off less as an unstoppable demonic entity and more like a weirdly resilient dude in a costume. Didn't hinder my enjoyment of the character or overall movie much at all though as Art is still very unsettling in appearance and takes the same gleeful amusement in his cruelty. His pantomime routine is quite amusing in a demented sort of way, giving the film a pitch black sense of humor.Stripping Art of his otherworldly abilities is something that was most likely done to avoid Pennywise comparisons. A futile effort as, despite being entirely different kinds of horror films, the simple fact that they both have clown antagonists and came out around the same time means that Terrifier will always be juxtaposed with that equally great Stephen King adaptation by the majority of people. A shame as they are very much their own beasts.I love the low-budget, grindhouse aesthetics. It really sells the exploitation style horror Leone was going for. It gives the deaths a nastier, sleazier appeal and even makes some of the more lackluster practical gore effects easier to forgive. The scenes where Jenna Kanell is stalked through a warehouse garage are coated in purple neon light and are just gorgeous.One of the movie's greatest strengths is it's ability to usher in and kill off new victims in a believable manner and at a regular pace. Not only do we get to see more of Art's twisted torture sequences, but it also means that we don't get stuck watching the same person narrowly avoid death again and again before the credits roll. It makes the night that never seems to end go by a little bit smoother. Not that you'll actually want it to conclude. Terrifier has sick surprises for you around every corner that only get more disturbing as it progresses. It isn't for the faint of heart because this movie crosses some lines most modern horror films wouldn't even dream of anymore. This one is for the horror buffs.Admittedly, the whole thing is a little formulaic. You're just watching people get hunted and executed by an enigmatic psychopath. Not exactly an original premise or anything. What makes Terrifier work though is that it really does manage to feel like a dirty grindhouse horror film from 30 years ago. It's a non-stop barrage of mean-spirited thrills and creepy antics from a silent menace who will make your skin crawl. Art the Clown is such an unsettling creation that Damien Leone and David Howard Thornton deserve to become household names in the genre. Check this one out if you love brutality, have an iron constitution, and miss old-school horror.8.6/10"}, {"rating": "7", "text": "This movie just feels right in many ways. First, it corrects the previous travesty that was Art the Clown not having a feature film. Second, the visual quality has an awesome 80's grindhouse feel to it, so it actually feels like this was shot when it should have been instead of 30 years late. The soundtrack is a nice throwback mix of uneasy drones and infrasounds with some nice low-fi stingers. There's a nostalgic immersiveness here that makes you feel like you just walked home from some old video store with the worn out cassette boxes and velcro rental tags.The story is nothing special, but it's bathed in so much bleakness and blackness that it just fits perfectly with the villain (including his color scheme.) Not necessarily a stand-out horror for the ages— aside from one possibly hallmark-level kill scene— but tells an okay story while treating the viewer to a hearty helping of a rather spectacular movie monster.Signed, a hard-to-please horror fan."}, {"rating": "2", "text": "**A Brief, Complex, and Honest Review**--Words cannot describe how terrible this movie is. It pays homage to classic 70s and 80s horror movies like Jason, Nightmare on Elm Street, Texas Chainsaw Massacre, and even Silence of the Lambs. But it is exactly this mash up of genre villains that is probably the biggest downfall of the movie.At the beginning of the movie you're led to believe the villain (Art the Clown) is just a crazy serial killer, but then he turns into a sadistic torture killer like from Saw or Hostel, then he starts wearing his victims skins (for no reason) and a wig making you think of Buffalo Bill, and then he starts eating his last victim like a cannibal (again, for no reason). At the end of the film Art is believed to be dead and is then taken to the morgue where (surprise) he comes back to life (making you think of classic Jason and Freddy), and then the movie ends.I mean, what?! It's fine to end the movie that way, but make up your mind what Art is. A serial killer? A cannibal? An immortal death machine? It's disappointing that they couldn't just pick one of the above and stick with it for the whole film. Instead they chose to try to make Art a combination of everything, and the result is that it feels like a different villain every 15 min.Next let's talk about how bad the plot/writing is. It's barely there. This is something I would expect from a high school kid writing their first screen play.  The movie starts with the \"survivor\" of the events of the film being interviewed on a 60 Minutes like tv show. Her face is horribly disfigured. Then it cuts to the lady doing the interview talking to her boyfriend over the phone and she's telling him how hideous the survivor girl she just interviewed is. Then she hangs up, thinking she heard something, only to be attacked and killed by the disfigured girl she just interviewed. The survivor girl then starts laughing and the film fades to the past when the actual events of the movie start. Weird, but ok. Maybe they'll tie it all together.Nope. As the movie goes on, 2 friends (Tara and Dawn) are trying to go home from a Halloween party when they start to be stalked by Art the Clown (villain). Events ensue and Tara ends up calling her sister (Victoria) to come and pick her and Dawn up. While waiting for Victoria, Tara and Dawn eventually get separated.So you think you can predict where this is going and that the maimed lady from the beginning of the film will turn out to be Tara, because the film is from Tara's point of view (and because the maimed lady is a brunette and Tara is also a brunette while Dawn is a blonde).Nope. Dawn is killed first and then Tara is killed at the halfway mark of the movie. So you think, ok? Then the film switches to the pov of Victoria who has now arrived to pick Tara and Dawn up, but can't find them anywhere. Events ensue and Victoria is now the victim being chased.The film ends with Victoria having managed to elude Art and lock herself in an empty warehouse/building where he can't get in. Then you hear sirens and see the lights of police cars and Art disappears. Victoria then runs to the door to look out and see how close the police are until she's rescued. Suddenly a truck's headlights in the parking lot turn on to reveal Art behind the wheel. He drives the truck through the door, hitting Victoria in the process. Art then gets out, goes to her \"dead\" body, and starts smelling her face. A few minutes later the police run in to find Art eating Victoria's face. They tell him to put his hands up and turn around or they will shoot. Art pulls out a gun, turns around to face the police, but then shoves the gun in his mouth and pulls the trigger.Fast forward a year and you see a lady in a wheel chair being released from a hospital. The Dr. releasing her is telling her family how amazing and positive and upbeat she has been while there and that she was a great patient, etc. They then say goodbye and the wheelchair is turned to reveal the now horribly disfigured Victoria, and the lady being interviewed on the talk show at the beginning of the film.It's just so dumb. What was the point of making her go crazy and kill the talk show host? It has no purpose to the plot. And again, the attempt at trying to make Art multiple different types of homage villains was very poorly executedFinally, the one positive that I found was that the character of Art was a great concept. He looked creepy as hell. He didn't scare me, but I definitely felt creeped out by him. His design was so simplistic, just black on white, but oh so well done by the makeup department and definitely chill worthy. If they just would have settled on a specific villain type for Art and had a decent writer who knew how to compose a compelling script then this could have been an average movie, or maybe even a hidden gem. Sadly, this was another good concept that could have been great but was ruined by horrible execution."}, {"rating": "4", "text": "The villain was great and honestly, He's the only thing about this movie worth watching. There's no real story and as a whole, It's pretty generic. And the production value is pretty awful at times."}, {"rating": "7", "text": "I give a 7 only because Art the clown makes this movie.  If you're a fan of killer clowns, you have to check this one out for sure.  However the story lacks depth but there is plenty of horror action.  For a more detailed review, come check out https://www.killerclown.org"}, {"rating": "2", "text": "The funniest comedy I’ve seen in a long time. Watch with drunk friends and you’ll have a great time"}, {"rating": "10", "text": "Damn near perfect. I saw terrifier and it's sequel within a week of each other. As I stated in that review I thought terrifier 1 should be the sequel and terrifier 2 should be the original. This was a good scarefest that really hyped me up for the sequel which disappointed. I really liked terrifier and thought it was very good. Hopefully they make a third one and keep everything about the original which was scary, fun, and excited me and toss aside it's trash of a sequel. Art the clown is just a fool. Bravo!"}, {"rating": "10", "text": "Without a single line in the movie, David Howard Thornton managed to steal every scene and make an iconic character."}, {"rating": "8", "text": "Wonderfully terrifying, this movie is exactly what it set out to be: nightmare-inducing. While the special effects can be cheesy at times, the movie is refreshingly self-aware and has a thick undertone of dark comedy. It is everything you could want from a simple slasher clown flick. However, if you’re looking for anything more, this isn’t the movie for you. It is straightforward, with very little sidetracking."}, {"rating": "10", "text": "Loved every damn minute of this movie. Absolutely brilliant. Very reminiscent of 80s slashers.  We need more horror like this."}, {"rating": "10", "text": "The character of Art is amazing. The stillness of his character like mike meyers and then that pantomime humour... love it."}, {"rating": "6", "text": "What I expected from the film, I got. The story was pretty much nothing, but the scenes with the clown were TOP. He showed up quickly though, which I wasn't expecting. On the one hand, there's not much to be surprised about when the film is just over an hour and a quarter long. So it doesn't keep you waiting and the pace is fast. That said, there's always something going on, which is good because I wasn't bored for a moment. On the plus side, there is a downside, but I'll get to that. As I mentioned, the clown himself was really excellent. I really liked his mask. Without a doubt one of the best horror clowns. What added to his charm was that he didn't talk at all, so it worked very well at some points, meant for the horror genre. What I have to praise at least for myself are the brutal scenes. I like such grittier moments, but for some it might be more of a nuisance, because this was perhaps the most brutal horror film I've ever seen. I'm not saying there aren't grittier ones. Not at all. I've seen quite a few horror movies, so I believe there are some that are several times grittier. I'm just saying that I haven't experienced a rougher one yet, because a lot of the scenes here are, shall we say, watchable and the camera doesn't switch positions. For this I give a thumbs up that the film wasn't afraid to show such scenes. To sum up. The clown and the brutality pulled the whole movie for me. They were the main aspects that made it not bad in the final. These 2 factors worked very well here in my opinion, but still not enough to make this movie deserve any better rating. As I mentioned before, the film is fast paced. Something is constantly happening and it ends soon. I think that's a shame in the end though, because what this horror film lacks the most in my opinion is some deeper plot that would have made it a bit more interesting. Then again, this could have been a really good horror film and although I don't think Terrifier is bad at all, the lack of story brings it down and so for me this is an above average film that I would only recommend to horror fans."}, {"rating": "9", "text": "Overall a solid gore slasher. Had amazing visual effects and a nice story. Highly recommended. Way better than the sequel."}, {"rating": "4", "text": "I honestly didn't like this movie, it was a simple and bad slasher movie. But, the only things that safe the movie from being awful, are the clown's acting, because itself it's creepy yet entertaining, and finally the gore, if you love to see blood and organs spreading all over, you would like this movie. But in general, the movie is kinda bad."}, {"rating": "9", "text": "This gory homage to the 80's takes you for a ride for sure, in a clown car that is. The main actor's performed well, especially Art. Decent acting from most of the rest of the cast but the real magic of this film was the amazing effects. This is a good slasher!"}, {"rating": "0", "text": "Horrible script, bad scenery, horrible everything.A really bad movieThey think violence is the greatest virtue of the horror movie"}], "recommendations": ["malignant", "the_possession", "house_of_1000_corpses", "the_collector", "the_strangers_prey_at_night", "the_green_inferno", "clown", "vacancy", "p2", "the_ring", "the_hills_have_eyes", "insidious", "dead_silence", "texas_chainsaw_3d", "hostel_part_ii", "wrong_turn", "hell_fest", "the_descent", "cabin_fever", "annabelle", "the_texas_chain_saw_massacre", "scream", "the_grudge", "it_follows", "dark_skies"]}