{"id": 1566, "title": "Texas Chainsaw 3D", "starring": ["Alexandra Daddario", "Dan Yeager"], "runtime": 92, "genre": ["Horror", "Thriller"], "description": "A young woman learns that she has inherited a Texas estate from her deceased grandmother. After embarking on a road trip with friends to uncover her roots, she finds she is the sole owner of a lavish, isolated Victorian mansion. But her newfound wealth comes at a price as she stumbles upon a horror that awaits her in the mansion’s dank cellars.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dwIQ7WDCSiIcNdbferTcU7uI0KV.jpg", "categories": {"plot": 4.433333333333334, "acting": 4.473684210526316, "ending": 5.444444444444445, "soundtrack": 0.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 3.5, "action": 6.0}, "reviews": [{"rating": "0", "text": "What a stinker!! I seriously don't understand how an army of writers came up with this dreck! I feel bad for the new generation along with no jobs they have to watch pale horrible remakes of far superior originals! Do yourself a favor and watch the original Texas Chainsaw Massacre and forget the rest!"}, {"rating": "5", "text": "The film tries to terror, which is not achieved. It gore and some entertaining and leaves you with a bad taste in vocation."}, {"rating": "0", "text": "What a way to kick off 2013 an awful film mixed with one of the greatest lines in movie history.  Do your thing Cuz comes after they try and make leather face a compassionate character.  Yes the same man who slaughters people with his chainsaw and wears their skin, that is how stupid this movie is."}, {"rating": "3", "text": "Texas Chainsaw 3D is a waste of time and opportunity to make a good sequel/follow-up to one of the classics The Texas Chainsaw Massacre, meanwhile, the new Chainsaw delivers chills and thrills, albeit you don't care about the characters nor the story, it gets so bad to be fun, and with the 3D! Its scary as hell. But without any denying, it is definitely one of the worst movies 2013."}, {"rating": "0", "text": "Texas Chainsaw 3D......what to say, It's a piece of **** for one. The story is predictable, characters are dumb, it's just an ugly movie, even the picture has a cheap, over saturated look to it. A film that tries to (well i think it does) honour the original just ends up being a disrespectful parody film with all the cliques you can think of. I was going to give the film a two for Alexandra Daddario's pair of assets, but the line \"Do your thing cuz\" just hit the nail on the coffin."}, {"rating": "1", "text": "Somebody tell those  executives to stop bringing back a franchise that's deader than the characters in the film. Despite ignoring the sequels after the original, it completely forgets what year it's supposed to be set. Making Leatherface into an antihero completely jumped the shark, throwing everything that made the character terrifying shredded to pieces. No horror fan will enjoy this, especially fans."}, {"rating": "3", "text": "Woah. Well, this movie was pretty sad. It's was very generic and predictable. We've seen it before, the same lines, the same actions, the same plot. It was very disappointing."}, {"rating": "7", "text": "A slick addition to the horror franchise with good production values and enough tension to keep you on the edge of your seat when you're not jumping out of it. This new film is not half bad picking up from where the original 1974 film left off. For horror fans this more than delivers. The first hour is well modulated to build the expected tension as the usual array of attractive young teens go through their paces of being terrified, hunted and finally butchered by the fearsome leatherface. The final half hour brings to the fore more everyday recognisable villains, in this case in the guise of the local police force. At this point the film effectively switches our sympathies towards leatherface against the authorities, and whilst this last section doesn't quite pack the punch of the first hour it still keeps you engaged. The film has some great photography, including low slung camera angles and overhead crane shots, which add much to the uneasy atmosphere that pervades the film. The editing also skilfully ensures that we are not let of the hook (so to speak). Let's face it this is the sort of film that gives you exactly what it says on the tin and it certainly touches a primal nerve in me. Anyone going in and then being either disappointed or disgusted obviously have not been discerning enough about their choice of movie."}, {"rating": "8", "text": "A decent addition to the TCM films, but it unforntuatley had its flaws. Good setting with a good range of characters and storyline, but some of the deaths were a little disappointing and predictable, as were some of the twists also. It had it's ups and downs as far as the excitement and entertainment went, but I certainly wasn't bored at anytime while watching it. I think the two more recent TCM films from the 2000's that came out were better than this one, but Horror fans should still enjoy it."}, {"rating": "0", "text": "Texas Chainsaw 3D is just a mess of a film and shows how Hollywood just loves to keep horror franchises alive as long as they can.  I enjoyed the original"}, {"rating": "6", "text": "Story line is interesting. Very predictable. Trey Songz was very good looking. Had some very scary, unbelievable moments- for the thrill seekers. Over all, the best part of the movie was Trey Songz taking his shirt off;... Take that as you will."}, {"rating": "7", "text": "Texas Chainsaw 3D was awesome. Despite the fact that its 31 Metascore has let itself down, this film was great! The horror was the great element in this film. Horror lovers will crave this one..."}, {"rating": "4", "text": "This film could've been good. But overall terrible story telling, no scary scenes what so ever, the horror scenes turned into comedy scenes. Like the Carnival that was high-larious. If your a horror film lover then you will literally want to turn away. If your looking for something to fill in some extra time TURN AWAY. This is only for people who love to watch parodies because this is basically that"}, {"rating": "6", "text": "The movie had some really good ideas, but fell short on everything.  The writing in between the key ideas of the movie was horrendous.  This movie also holds the biggest movie mistake I've ever seen/heard of.  It's supposed to be a sequel to the 1974 movie, the setting is supposed to be late 80's early 90's and yet at one point a cop pulls out an iphone."}, {"rating": "3", "text": "This is probably one of the dumbest, most unbelievable films in the series. There is a scene where leatherface chases one of the main characters and she falls not once, not twice, but three times. Leatherface then chases her over a fence into the middle of a carnival, where he runs past about 50 potential victims, apparently set on killing the unbelievably sexy white girl (leatherface must not have approved of her interracial relationship). The girl then decides to grab onto the bottom of a ferris-wheel carriage, because ferris wheels don't go in a circle in her mind. Low and behold, as she is almost to the bottom a cop shows up with a gun. Leatherface throws his chainsaw like a boomerang at the cop.\r That was all in the scope of a 2 min scene. This movie is pure silliness. In fact, it is still running in the background as I type this; that's how uninteresting it is. Oh wait, more silliness. Now, after leatherface has killed her boyfriend and 2 friends, this chick all of a sudden decides to save him from a rather fitting and ironic death, and then help him kill the evil hillbilly police that killled his family but somehow let him escape. Like most 3d films, this relies on a name and the fact that people will pay to see the same rehashed crap again."}, {"rating": "6", "text": "This is a typical horror flick with a lot of gore and insane situations. As usual with a movie like this, it is going to be polarizing. I am somewhat in the middle with this. I would have liked a bit more originality, but I don't want to jump in the bandwagon and bash it for what it is: \"just\" a horror movie."}, {"rating": "9", "text": "I like it, i will admit it could have been better but it was a good movie and it was fun the 3D was a bonus and  i liked how it had a twist at the end. Overall 9/10"}, {"rating": "7", "text": "This reboot picks up where the original left off: The only survivor is a baby, who returns as an adult to claim her heritage. After too much dialogue the killings finally begin: bloody, blunt-force-trauma butcherings. Of course, they're more explicit than the 1974 versions, but they still have the same grungy, low-budget brutality. If you liked the original (which is one of my faves) you won't be disappointed. That being said, in striving to maintain the style of the original, they've abandoned any hope of freshness. NOTES: Saw it in 2D and didn't miss anything. STAY THRU THE CREDITS for a final surprise."}, {"rating": "0", "text": "I have been a fan of horror since 1984 so it is by no means something that just happened. I have to say that this movie is unbearably the worst movie when it comes to one of the main characters of horror I have ever seen. The 3d is there to 3 dollars more, was not even good. The scare quotient was laughable. (SPOILERS) The fact that Leatherface is made out to be a anti-hero or when he is thrown his chainsaw and the line \"Do your thing cuz!!\" Was uttered, let me know that horror is truly dead. I have seen more gore out of the Walking Dead series than this movie conjured. I would have to say it is even worse than Next Generation with Renee Zellweger. It was not even campy fun or it's so bad I enjoy it type of movie like some of the Friday the 13ths. Also to have a movie be in the heart of texas and have rap music in it, I know they are trying to sell soundtracks but it takes you out of the experience. Characters are so cliche and come right out of the cardboard cutout of horror. Also if you see a big ass dude with a chainsaw cutting into a coffin, why the hell would you yell out to him not once, but TWICE!?! I hope the Leatherface series is dead and gone after this because this is a character and story that should be left alone. What is sad is that opening credits of the first movie re-done in 3D were absolutely cool to see and if they would have kept up with that through this movie then maybe it would have been better. Actually they should have just re-done the original into 3D and I would have been happier."}, {"rating": "5", "text": "el director convierte una simple película de terror en un lió familiar que solo ciertas personas lo entenderán  ademas el personaje de cara de cuero no se define si es un villano o un héroe. esta nueva entrega no ofrece nada bueno la serie de películas de la masacre de texas y como una recomendación para la próxima entrega que las películas sean coherentes una con la otra por  que si uno ve las otras entregas no tienen nada que ver con esta."}, {"rating": "6", "text": "A lot of this film proved to be unsuccessful due to its jumbled timeline, its constant stupidly, it's over use of cliché and it's \"twist\" ending. However, there's no denying that it's an enjoyable slasher flick that should satisfy the needs of gore-hounds and is a good way to pass 90 minutes for everyone else."}, {"rating": "6", "text": "I am really surprised! I didn't expect that this movie will do its job, and freak me out! A very good movie surprisingly! The 3D is amazing, the acting is good not great, but I had a really good time, eventually the first Texas Chainsaw left me amazed, the squeal left surprised, amazed and freaked out, really well-Done!!"}, {"rating": "2", "text": "Seriously, do I need a Texas Chainsaw Massacre reboot again and again? Truth is, I think the franchise needs to take a break or just retire already. Is New Line the owner of the Texas Chainsaw Massacre franchise? Of course, but not Lionsgate. The same company that bought the Saw franchise into a horror powerhouse is trying to make a mockery of Leatherface. I don't really need to paid $10 bucks to see a baffling but corny reboot that is gonna be in 3-D. Hello, there's nothing new in 3-D. I would rather kill myself if they are gonna make a Leprechaun reboot. Not happening."}, {"rating": "10", "text": "I hate that i am gonna say this but it was stupidly-comedic and hilarious. It's a fun movie actually, and as a fan, i find it very interesting to see if a 2012 type Texas Chainsaw will work and it did. No scare at all but i don't care, do you? 2 THUMBS UP!"}, {"rating": "7", "text": "I don't understand all the bad reviews and i can't understand why all the new horror movies have bad reviews. This film was great. Had great plot and it was really interesting. I can't stand why everyone says don't watch it watch again the original. The original sucks. Get over it. This one is much better and it also has some 3D stuff. Watch it and ignore bad reviews"}, {"rating": "4", "text": "Even for a horror movie, Texas Chainsaw 3D takes implausibility to new heights. That's not to say it's unwatchable, but for a franchise that is most appreciated for the unflinching grittiness of its source material and a continuum of creepiness, TC3D features neither of those traits.    The film tries to do right by the original film, picking up moments after Sally Hardesty escapes from Leatherface in the back of a pick up truck, and shows the cops arriving at The Family's farmhouse as a result of the events from The Texas Chainsaw Massacre (1). But the reference to and inclusion of the original's gnarly, almost documentary-style footage only manages to highlight even greater the overall plainness of TC3D; which is to say it looks like The Apparition or One Missed Call. Standard. Plain. More wonkiness ensues as the history it claims to be bound to is suddenly rewritten with the addition of several new family members, including women and children (!) and a handful of un-scary men in overalls, none of whom appeared or were even referred to in the first entry. evidently TC3D's writers confused the original and the remake, the latter having also added birthin' folk to the mix. Well, guess what? It all doesn't matter, since all of Sawyer family are quickly killed when a vigilante group of locals burn down the house, killing everyone inside. That is, all but a single baby girl. Aha!    Fast forward to modern day, where that baby girl, Edith, is now an adult - but also conspicuously not her late thirties, which she would be if the original film truly took place in 1974, which it very openly did. She inherits her grandmother's house in Texas, a place that secretly houses Leatherface in the basement, who summarily kills all her friends shortly after they arrive at the house. This is especially unfortunate as interpersonal tension is built between her best friend and boyfriend, who are together cheating on Edith, but none of that matters because nobody lives long enough for anything to come of it. Indeed, Edith never even finds out about the affair. This ain't The Mist. How Leatherface survived the vigilante townsfolk, or even managed to travel, is also skimmed over. There is a line where someone mumbles \"Maybe he ran out the back...?\" Maybe!    This leads to what is probably the scene that best exemplifies the overall squandered potential of the Texas Chainsaw 3D, as Edith escapes the secluded grounds of her grandmother's home, only to happen upon a well-populated and surprisingly nearby county fair, ferris wheel and all. Fans of the series have long lamented that while The Texas Chainsaw Massacre franchise is super, there has never truly been a \"massacre\" in any of the films. Surely Leatherface entering the fairgrounds, swinging his live chainsaw, will remedy this blight? Nope. Not even a single passerby meets their end at Leatherface's saw. Pity.    Edith survives the attack and is eventually sheltered by the police... But they get distracted amongst each other and she runs away after having discovered their role in the burning down of her family's original farmhouse. It should ne noted that she learns this only after the police leave her alone in a room with the \"Evidence Box\" detailing the original murders, and is so angry at the vigilante townspeople that she writes \"muderers\" over their photos with a red Sharpie. Umm... What? Apparently the only thing she hates more than murderers are people who murder murderers! Yeah!    The movie slows down quite steadily at this point, as Edith now must deftly elude the terminally uninteresting locals, who also want to kill her because they know she is related to Leatherface. Lucky for her, Leatherface becomes hip to their scheme and comes to Edith's rescue just as they are about to kill her at the old abandoned slaughterhouse. As a result, the townsfolk instead turn their aggression towards Leatherface, but then Edith rescues him too. Yes, indeed... she apparently has already gotten over the face that he murdered all her friends only 40 minutes before, and feels tender hearted towards him, due to his \"simple nature\" and, I guess, that sad look in his eye behind the skin-mask he wears over his face. Although the police eventually intervene, they nonetheless allow Edith and Leatherface to simply go back home, despite the carnage, telling them only to \"clean this **** up\" - the most egregious line of the film... in a film full of egregious lines. The last of their clan, Edith and Leatherface do actually return home to start a new, seemingly platonic life together - adding another wasted opportunity of TC3D to seize on the delightful creepiness of the franchise. **** you not, that's how the movie ends."}, {"rating": "10", "text": "Critics, what can I say about them other then misleading and they probably didnt even see the movie or dont like horror movies and should not even be aloud to rate movies. some of the worst movies I have ever seen got high ratings from critics and low ratings from real people like you and me.\rNow for the truth. If you watched the last one you will flip over this one. What a story line. I not need to say anything else, it would ruin it for you. I wish I could rate this movie higher but it only goes up to 10. Edge of your seat movie, you will love it. Now go see it. As I am a horror freak. I turned 13 on the 13th on a Friday and went to see Friday The 13th, on my 13th Birthday. I'm in my upper 40s now. You can trust my ratings."}, {"rating": "5", "text": "\"While it goes against my better judgement, Texas Chainsaw 3D is one giant cliche, it falls into every horror category imaginable and brings nothing new to the table. That being said if you actually sit back and relax you might actually enjoy this romp.\"  C"}, {"rating": "9", "text": "It's not scary, but it is still one of the better horror movies I've seen. It manages to get away with not being scary by being a slasher movie that doesn't suffer from being irritatingly campy. As a matter of fact the film isn't campy at all. It's a serious and self-respecting slasher film that is actually trying to scare you. Unlike most slasher films, it doesn't rely on over excessive gore or unnecessary nudity. It's serious and is trying to provide genuine scares, and while it doesn't succeed at providing scares, I respected and enjoyed it anyway for not treating me like an idiot.\r That being said the lack of fear is disappointing and there are a few awkward moments here and there, particularly one involving a carnival chase, but overall I really enjoyed the plot and characters. I did find it a little odd that they try to portray \"Leatherface\" in a sort of positive light, but overall this served as a good introduction into a series that I am now extremely curious about. So if you're tired of things like camp or idiotic characters plaguing your horror slasher films, then you may be like me and find this to be a refreshing change of pace. It's not scary, but I still really enjoyed it."}, {"rating": "3", "text": "Needless 3-D really hurts it. Plenty of gore though and it's certainly watchable. Poor plot though and the movie is hurt even more by the terrible ending. Yet another horror remake that fails to live up."}, {"rating": "6", "text": "Okay, look. Did I go into this thing with high expectations? Absolutely not, which in the end is why I ended up sort of digging it. Was the acting bad? Yes. The characters cookie-cutter and shallow? For the most part, yes. The kill scenes tacked on? Oh quite. But I expected all that; if I hit play in the first place, at this point I'm still on board.On a somewhat positive note, the overall gore level in the movie—while still in the high-splatter range—seems a bit toned down in this installment. Or maybe it's just that they finally stopped pushing the envelope... I can't put my finger on it, but it's almost like they were trying to be tasteful, an almost maverick endeavor for a Texas Chainsaw flick.*******SPOILERS AHEAD*********The thing that scores this movie some points with me is the sympathetic angle on Leatherface. Not that it's executed any less ham-fistedly than the rest of the script, mind you, but the fact they even went there was an unexpected breath of fresh air. I feel as though viewers were teased with the misunderstood manchild idea so many times in the past, it was a truly smart move to finally explore it. So what if it couldn't carry an otherwise mediocre movie? The moral subplot comes through like a pie to the face, but it still does its job of villifying the mayor enough to make his gruesomely novel death scene more satisfying than cringe-worthy. ****END OF SPOILERS*****So for all its totally unsurprising shortcomings, TC3D isn't necessarily the waste of time you would figure it to be. I should say, though, that I watched this movie 2D, and I still feel like I got the full experience. The 3D thing was clearly not a directorial move."}, {"rating": "10", "text": "GreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreatGreat"}, {"rating": "6", "text": "Call me a sucker, but watching this film (rental, minus the 3D trapping that aimed to draw people into theaters) actually made me think that the franchise still has something to offer. This film has something to offer for fans of the franchise, in other words.\r The twist, which I won't give away, appeals to me in a way that I can certainly understand many individuals not being able to relate to. That twist is what gives this entry into the series its identity, and the way it all plays out is something I wasn't entirely expecting. A very pleasant surprise, in terms of storytelling, which has never truly been the franchise's strong suit.\r The obligatory gore and guts are splattered everywhere across the film, with obvious 3D moments popping up appropriately, but somewhere around the last 45 minutes, you realize you're not just watching a splatter flick. There's more substance here than meets the eye, even if it isn't exactly revolutionary in horror film plot history.\r The casting was surprisingly well done, and unlike certain iterations of the franchise, avoids being a detriment to the overall goal.\r You're supposed to be scared, but at some point, the film attempts to coax a different feeling from the viewer. Whether or not it works is 100% subjective, of course, but in my case it worked. In the overall scheme of things, Texas Chainsaw 3D isn't the best film in the series (not by a long shot), but when you consider some of the absolutely ridiculous sequels of the past...well...you have to appreciate the gritty reality of this fresh take on a classic."}, {"rating": "3", "text": "Its funny, I usually like these kind of movies. But usually the one's that I like have some sort of charm about it such as..(Camera angles, character development, gore effects, and good music) This film hardly had any of that. Actually I wouldn't even call this a true film at all. There's nothing cinematic about it. Honestly I felt like I needed an hour long shower after I watched this. Although the carnival scene is neat. THAT is pretty much it."}, {"rating": "4", "text": "Interstesting movie just wished they hadn't called it Texas chainsaw massacre. Its comical because it classic big boobed lots of sex cliche movie not Texas chainsaw"}, {"rating": "5", "text": "No creo que sea tan mala como dice la mayoría, obvio se queda muy lejos de ser remotamente buena como la original, pero si es inmensamente mejor que las dos horrendas secuelas de la trilogía original."}, {"rating": "6", "text": "The tone and style were probably the closest to the original film out of all the sequels, prequels and remakes so far. The film started very much like the original but changed into a strange morality tale where you felt compassion for Leatherface. I would have preferred to see him solely as the villain. It’s still a fun ride with plenty of violence and slightly tacky 3D elements. The first true sequel with the same spirit is as you would hope. Shame it took nearly 40 years."}, {"rating": "3", "text": "Texas Chainsaw 3D brings a few tricks to reinvigorate an already tired series but sadly fails to polish the fundamentals. When another title comes of from well-known franchise such as Texas Chainsaw which has inspired many movies of its genre, people already has an expectation, while this is an allure, it's also a strain to create fresh ideas. A bunch of 3D antics and choppy script are definitely not the way to pique audience's interest.\r The story follows Heather Miller (Alexandra Daddario) as she's about to be surprised with extravagant inheritance by her unknown grandmother. This involves a visit to countryside where the famous massacre occurred, she also takes the liberty on taking her carbon copy stereotypical friends as any other nice horror leads may do. The first act goes as predictable as it comes, right down to the clumsy coincidence, common slashing and comical chase.\r I appreciate the movie's attempt to portray Leatherface as more than his usual villainous slasher persona. He's given more back story to make audience sympathize with him, however this doesn't result in an engaging character, either for protagonist or antagonist. The direction, coupled with jumbled script, makes it hard to take any of it seriously. At some points, the movie almost exclusively steers into comedy realm, this is not the path it wants to follow. The movie is as lost as a young woman running scared in the wood, and we know she's gonna trip herself and ridiculously falls.\r At the very least, the lead Alexandra Daddario tries to raise the character as her role gets more investment. It's almost good to see a stronger protagonist instead of the usual victim personality, but the way the development takes place is unnatural. Addition of 3D effect doesn't help, it gives away the gore much too obvious, and random object thrown into one's face has become the fastest tired invention on late.\r If it's only a brief visitation of old memory lane, or a few ironic chuckles, Texas Chainsaw 3D might be bearable. However, fans of the old might even be more disappointed of how the original has fallen."}, {"rating": "6", "text": "Whilst it’s story is inconsistent and pumped full of plot holes - there’s deviant enjoyment to be had here as it proves to be one of the most shamefully enjoyable entries in the franchise since the 1986 sequel."}, {"rating": "4", "text": "It's another gore filled chase-romp with little to no memorable moments. But that shouldn't be a surprise, considering the film had really no reason to exist anyway."}, {"rating": "5", "text": "I liked this movie and the 3d effect was pretty amazing. The reason i gave it a five was because it wasnt even close to texas chainsaw massacre in awesomeness and I got more sick than scared when i watched it"}, {"rating": "1", "text": "This was Horrorbile! Nothing scary about it, just a mess of blood, and disgusting scenes. This is one of those movies where they just try to hard. Tania Raymonde is Hot, but when shes flaunting her body around it makes it even harder to take this movie seriously. The ending gets twisted in a Horrorbile way."}, {"rating": "0", "text": "The worst horror movie I have ever seen. A terrible waste and an insult to the original. The trailer looked as bad as the movie but the movie was so much worse."}, {"rating": "6", "text": "This movie was a cheesy, i mean ya, i get it, its a great movie in all, but don't you think crazy massacre people chasing young hot girls? i mean we see that in almost every horror. take halloween for example, its all about hot girls getting killed. i for one give it a 6 out of 10. good movie, but too typical for me."}, {"rating": "8", "text": "Its always good to see another \"Chainsaw\" film, so I was excited to see it.  It was pretty good, but not great.  Not sure of the justification of making the townsfolk out to be bad while \"Leatherface\" (the killer) is painted somewhat sympathetically."}, {"rating": "9", "text": "Alot of critics are saying that this movie basically sucks. I thought the movie was overall really well done. The idea of making this a direct sequel to the original 1974 version was a creative idea. There was one big mistake in this movie such as the time gap. In the beginning it recaps the 1974 movie showing all the kills and the main protagonist in that movie barely escaping. Then, the real movie starts when the towns people show up and burn down the house where Leather face lives. Everyone thinks he dies and then the movie skips ahead to twenty years later. Twenty years later would mean that this was taking place in the 1990's. The time frame is shattered though when someone uses an iphone towards the end of the movie though. Basically everyone you expect to die does but not in the ways you expect. Alot of people didn't like one scene where a specific person falls down stairs and gets up and can't exactly run. This person fell down concrete stairs and everyone in the audience of the movie was like \"Oh my gosh. Why isn't she running?\" well let's see she just ate  falling down some concrete stairs. The acting for all the characters was surprisingly good/above average and is probably one of the best horror movies I've seen in about 2 years. I don't recommend this movie to anyone who ever says the original is always better and all that bs."}, {"rating": "5", "text": "I think the directors recorem this kind of movie because they think it is something simple to do, but even something simple to play has to be done in a dignified manner, which in most cases here, does not happen."}, {"rating": "5", "text": "This is the I think the third remake of the Texas Chainsaw Masscre,I can't tell because they've remade the movie so many times.It's okay,but only rent it."}, {"rating": "6", "text": "I enjoyed it though I have to say it wasn't as scary as I thought it would be, the characters make stupid decisions like Heather hiding in a coffin, really? It's still enjoyable to watch if you like those best worst movies."}, {"rating": "8", "text": "In a post-Saw cinematic universe - that's just \"saw\", no chains attached! - it's refreshing to see a recent horror film that starts with a premise which tries in no way, shape or form to be needlessly \"clever\". Honestly, it takes boldness in this day and age to do a \"for God's sake, don't let the monster out of the basement!\" movie, and even more balls to make that monster the mighty Leatherface.Sure, it all goes completely batpoop-crazy by the end, but still retains an internal logic - however \"nutzoid\" - which endings like the first Saw's simply fail to have. (Guy dying of cancer, decides he's going to imitate a CORPSE in a room with two desperate, trapped guys who have access to nasty bladed implements...just so he can give the audience a big, nasty \"couldn't see that comin', could ya?\" spook at the end?  Spare me!)Look, this movie is mad, but it's hardly \"bad\" in an incompetent sort of a way, and certainly doesn't fail to deliver the gruesome goods.  Is it as good as the Tobe Hooper original?  Of course not.  NONE of these reboots or sequels ever had ANY chance of achieving such a thing.  Guzzle some more soda, swallow some more popcorn, and enjoy."}], "recommendations": ["house_of_1000_corpses", "the_texas_chainsaw_massacre_the_beginning", "the_strangers_prey_at_night", "paranormal_activity_the_marked_ones", "the_curse_of_la_llorona", "malignant", "chernobyl_diaries", "the_ring_two", "final_destination_2", "scream_4", "the_grudge_2", "hostel_part_ii", "the_collection", "countdown", "terrifier", "brahms_the_boy_ii", "jigsaw", "the_green_inferno", "wish_upon", "cabin_fever", "dark_skies", "the_crazies", "unfriended", "dead_silence", "insidious_chapter_2"]}