{"id": 2822, "title": "That Awkward Moment", "starring": ["Zac Efron", "Miles Teller"], "runtime": 94, "genre": ["Comedy", "Romance"], "description": "Best pals Jason and Daniel indulge in casual flings and revel in their carefree, unattached lives. After learning that the marriage of their friend Mikey is over, they gladly welcome him back into their circle. The three young men make a pact to have fun and avoid commitment. However, when all three find themselves involved in serious relationships, they must keep their romances secret from one another.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6uOm6ryZg4GhYRPQZ2ID2TkTdpY.jpg", "categories": {"plot": 4.913043478260869, "acting": 5.8076923076923075, "ending": 7.166666666666667, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.67741935483871, "action": 5.0}, "reviews": [{"rating": "5", "text": "Three friends decide to stay single. They spend the rest of this movie in attempts at witty repartee (sometimes successful, but more often not). This is really a romantic vehicle for Zac Efron (he even gets teary), but the story is too trite to be believed. Meanwhile, Miles Teller is the star (he's an up-and-coming talent). His has charisma and offhand comic style is winning. Michael B. Jordan (also a promising newcomer) has some light moments, but has to handle the dramatic duties. It's all about relationships, so this is def a chick flick, but it revolves around guys, so there's lots of cussing and lowbrow humor. Even though it's well-paced, the dumb plot and unoriginal writing make it mediocre."}, {"rating": "5", "text": "Whilst That Awkward moment does manage to conjure a few guilty laughs, it amounts to nothing more than a very forgettable 'movie that Zac Efron was in'."}, {"rating": "5", "text": "That awkward moment may deliver the laughs on a three some bromance and a few dating advice that's delivered in the movie but it lacks its true identity in its characters and it tries to hard on being a good comedy romance movie and this is a type movie that had some potential of being better but it was just ok."}, {"rating": "6", "text": "If you're looking for a laugh out loud romantic comedy, then I wouldn't recommend this one because even though it has some very funny bits in it, which I could relate to. It also is a bit too romantic at times and it also drags on fir a bit too long.\rThe film is about 3 friends and 1 of which, Mikey (Michael B. Jordan) has just divorced from his wife Vera (Jessica Lucas.) And shortly after this event the 3 friends make a pact to stay single for as long as possible. But as you can probably guess this goes wrong when Jason (Zac Effron) meets Ellie (Imogen Poots) and when Daniel also starts getting attracted to his female wingman, Chelsea (Mackenzie Davies.) But even though this part of the film is a bit predictable,  what's not predictable is the hilarious situations that these 3 friends get themselves involved in. The film also offers a good perspective on relationships from a guy's poibt of view.\rUnfortunately there are also a few scenes which I found boring because they were a bit too romantic.\rOne of the funniest scenes in the film is when Jason gets invited to meet Ellie's parents at a dress up party which he mis-interprets as meaning a fancy dress party. And I don't wanna give too much away but the costume that Jason wears is very funny and inappropriate.\rBut overall the film was too soppy and romantic for me and I think it would have been better if it was a bit shorter. So overall I would give this film a 6 out of 10."}, {"rating": "6", "text": "\"That Awkward Moment\" 10 Scale Rating: 6.0 (Decent) ...\r The Good: At times, much funnier than expected with witty dialogue. The lead characters (played by Zac Efron, Miles Teller, and Michael B. Jordan) are likeable, despite moments of jerkiness ... mostly from Efron's character. For the most part, an entertaining and solid buddy film.\r The Bad: The ending is WAY too neat and tidy with everything resolved in a matter of minutes. It felt rushed and ruins what was a pretty decent buildup. A little predictable and formulaic."}, {"rating": "3", "text": "With a few tweaks, and by jettisoning Zac Efron, this would be a fun guys movie wtih some interesting heartwarming moments.  Instead, it's largely a drag. Michael B. Jordan shouldn't sell himself short acting in this type of crap.  He's like Russell Westbrook playing at UCLA - averaging 10 points and a couple of assists against average competition, yet against the NBA's best, he shines.   Jordan needs a real part and he acts the hell out of it - see Fruitvale Station. And Miles Teller is a rising star with limitless upside.  He was great in The Spectacular Now and the best part of 21 and Over.   But neither Jordan nor Teller could save this movie from its bad writing, it's tone-deaf directing, and Efron's crappy acting.  Even the two leading actresses are pretty amazing. I'd never seen Imogen Poots in anything, but she's a comer. And Mackenzie Davis is destined for great things.  Seriously, take Efron out of the equation and hand the script over to a better writer, and you have the makings of a St.Elmo's Fire Junior.   But that's a lot to ask for.  Juding the movie on what it is, not what it should have been, I give it a solid 3.5, rounding down.  I even laughed a bit.  The other THREE people in my opening night audience didn't make a peep. They clearly were not in the target audience for this film.  Which is really another challenge for the makers of this film - finding that audience."}, {"rating": "8", "text": "A romantic comedy from the guys point of view that surprisingly ends up feeling more believable than so many others in the genre. The real star here is the bro-dialog. It often leads to plenty of laughs and is so enjoyable because it is honestly how guy friends around that age talk to each other.\r Until the end there aren't any grand romantic gestures like you'll find in every other romantic comedy out there. Something that may disappoint the ladies. However what we get instead is more believable. The relationships form and play out much like they do in real life. Basically two people hook up and something forms out of that. It might not have you saying \"aw,\" but instead it will likely feel like a relationship you probably experienced around that age.\r Another great thing about the movie is how well it's three leads are at playing these characters. Honestly they seem 100% committed and the dialog just flows so well from them I wouldn't be shocked if I found out they were basically just playing themselves. The female actors also give great performances, even if only one of their characters gets any real time in the spotlight.\r It's a very funny and surprisingly real feeling rom-com. It's not the most romantic movie out there, but instead it feels like a real look at life and relationships among three 20-somethings. In a lot of ways that is what makes it better than the average rom-com. The believability takes it a long way. My total score for the movie is an 8.9/10."}, {"rating": "5", "text": "This movie is receiving a lot of hate despite the fact that is it enjoyable... OK the movie is predictable and has some cliches but it is to be expected by these kind of movies. What I really enjoyed was the fact that we got to see a romantic comedy from a male prospective.  Overall an enjoyable movie..."}, {"rating": "5", "text": "This film has its moments, but in the end you've seen this movie before.  The funny moments in the film mainly come from Miles Teller plays off of Efron and Jordan well.  Overall a worth while watch that is just to predictable for a recommendation.  C+"}, {"rating": "7", "text": "I went into this movie (not my choice) expecting it to be a train wreck, i am very happy to say it exceeded my expectations by a country mile. The jokes were hilarious, there were likable characters and the actors had chemistry which tied it all together nicely. I recommend this to people looking for a comedy as this one of the better ones out at the moment.\r Also, two of the actors in this film: Miles Teller and Michael B Jordan will be playing Mr Fantastic and The Human Torch in the new Fantastic Four film (ugh)."}, {"rating": "3", "text": "Not horrible, but not good either. I think the three main actors are probably the only really positive thing I can say about it. The stories not bad but it's predictable which I guess shouldn't come as a shock. I also think I was expecting more of a buddy comedy as opposed to a romantic comedy."}, {"rating": "7", "text": "That awkward moment when I'm making a review\r Pros:There are a lot of Likeable characters in this movie,  jokes and chemistry are great, The Premise isn't\rbad for a movie like this\r Cons: Some acting is out of hand, Where's the character development?\r Recommendation: anyone who's interested into chick flicks for guys"}, {"rating": "9", "text": "this movie is a funny guy movie it has the hilarity - the love and the charm of course. But Zac Efron which is not my favorite actor but it is  shocking  his performance well charming but his character represents himself as a selfish ladies man who makes girls do what he wants. Writer/director Tom Gormican thinks he knows love but really? he does know guys .....really he does he maybe does not know something about love . Grade B+"}, {"rating": "5", "text": "This is a movie you should not go see with your parents, unless you are completely open with them. With a penis joke every five minutes, \"The Awkward Moment\" will have you laughing out of your seat. This movie is an hour-and-thirty-five-minute awkward moment that you should at least see once in your life.\rZac Efron, Michael B. Jordan and Miles Teller highlight what it is like for three single guys living in New York City. While they make a pact to stay single together after Jordan's character wife wants a divorce. Their friendship is put the test when Ellie (Imogen Poots) threatens to ruin the pact and the guy's friendship. This movie shows the realization of when it's time to grow up.\rBig-screen newcomers Jordan and Teller hit their stride with \"The Awkward Moment.\" Both actors did a phenomenal acting job with the seasoned actor Efron. The three actors has chemistry few comedy movies have, as if they were friends for years.\r\"The Awkward Moment\" is hilariously inappropriate with added bonuses like seeing Zac Efron shirtless; and has you craving Ben and Jerry's ice cream. Make sure to stay during the credits for more penis jokes. Overall you should see \"The Awkward Moment\" at least one time, but you're spending too much money if you see it twice."}, {"rating": "8", "text": "What the f**k is up with all the hate for this movie? I really enjoyed it. I had to sit in the front row for the thing and I still really liked it. The third act was a little cliche which was disappointing, but most of the jokes were great and the chemistry was fantastic. The female characters were really fleshed out too which I liked and it's the best movie I've seen this year, which isn't saying much, but I think it might end up on the lower end of my top 10 of the year, if not honorable mention. Go see this, much better than anything else out. 8.3/10"}, {"rating": "3", "text": "That Awkward Moment is a terribly formulaic and rather lacklustre comedy that subjects the audience to an overused plot, one-dimensional characters and witless, unintelligent jokes. The storyline seems forced for the sake of plot progression filled with boring cliche after cliche. Although the cast is charming, there is little chemistry between Zac Efron and Imogen Poots making their story a bit dull. Overall it is a mediocre film to watch with your buds or alone late at night for the raunchy, risque humour."}, {"rating": "4", "text": "We’re long overdue a great romantic comedy told from the male perspective – unfortunately That Awkward Moment isn’t that movie, the characters lacking in likeability, too many of the jokes falling flat, and the film missing the spark that should make hearts flutter."}, {"rating": "5", "text": "It's decent. Better than I thought it was going to be but not that funny. The story is kind of generic and overall isn't special by any means. Though it's not that funny, there are some moments where it's hilarious. Those moments are far between but  when they come...it's hilarious. The cast is the best part of this and turn this somewhat unfunny, boring, and generic movie into something that barely passes. Overall I'm satisfied but wanting more. 6.1"}, {"rating": "7", "text": "Great movie with known story. Still very interesting with great moments and good subtle comedy. Zac Efron and Miles Teller are good duo and Imogen Poots is good addition."}, {"rating": "4", "text": "2/5★ An awkward title for an awkward film about the lives of Millennials in the big city. Played by inoffensively hot and up-and-coming actors, the film does nothing but drive home the difference between current and past young adults as portrayed by cinema that reflects some truth in the arrested development of the 20-somethings of today. Bro code and all that entails-its tiresome and condescending. What passes as witty banter does nothing to disguise the fact that it has nothing original to say.\rVerdict: Skip"}, {"rating": "5", "text": "The cast is fine (VERY fine) and the story is funny but there's nothing special in this romantic comedy besides a few laughs and great performances. Script is extremely superficial and doesn't say any interesing or new about relationships and characters development are quite poor, specially Efron's and Teller's. You can watch it to have fun a little bit but you'll be eventually tired after so many clichés of the genre and past films about the same subject."}, {"rating": "0", "text": "تو عمرم فیلم به این بدی و بی محتوایی ندیدم فیلمنامه اصلا\rنداشت کارگردانی افتضاح فیلم درجه4"}, {"rating": "1", "text": "Absolutely crappy movie. The only reason why I watched it was because I was an hour into the movie and realized how freaking awful it is, and I now had to commit to watching the rest. To no one's surprise, the rest of the movie was terrible. There are some positives; the humor is funny, the music is appropriate, and the acting is pretty solid.\rBut the plot, the points where it really counts, falls incredibly hard. The entire plot is about 3 guys, 2 of whom made a ridiculous promise to be single forever (keep in mind they are at least in their mid 30's), and then realize they met the women of their dreams and do a compete 180. What a compelling story! The only redeeming part of the story is the doctor (third friend) who's going through a divorce because his whore-of-a-wife doesn't know how to communicate, and instead spreads her legs open for a dull, POS lawyer she met; even then it still falls hard as a single entity.\rNONE of these guys have any redeeming quality that makes this movie worth watching. You go through it not giving two-cents about them.\r AVOID THIS MOVIE! You won't get your time back"}, {"rating": "10", "text": "um dos melhores filmes que eu já assisti na minha vida toda, de verdadeeeeee"}], "recommendations": ["the_five_year_engagement", "friends_with_benefits", "no_strings_attached", "the_dilemma", "trainwreck", "the_break_up", "this_means_war", "central_intelligence", "legally_blonde", "sleeping_with_other_people", "a_bad_moms_christmas", "the_spy_who_dumped_me", "blockers", "27_dresses", "forgetting_sarah_marshall", "identity_thief", "the_cobbler", "the_proposal", "tammy", "rough_night", "the_wedding_ringer", "pitch_perfect_2", "palm_springs", "tag", "50_first_dates"]}