{
  "id": 2257,
  "title": "The Cobbler",
  "starring": [
    "Adam Sandler",
    "Dan Stevens"
  ],
  "runtime": 99,
  "genre": [
    "Fantasy",
    "Comedy",
    "Drama"
  ],
  "description": "Max Simkin repairs shoes in the same New York shop that has been in his family for generations. Disenchanted with the grind of daily life, Max stumbles upon a magical heirloom that allows him to step into the lives of his customers and see the world in a new way. Sometimes walking in another man's shoes is the only way one can discover who they really are.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iQaJB6upTmR4gL8xmytE5atKWFP.jpg",
  "categories": {
    "plot": 5.392857142857143,
    "acting": 5.15,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.3,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It's quite an odd film. Those tired of seeing Sandler doing the same old stuff over and over again should give this one a shot. With all it's weird charm and interesting concept there's something new for Sandler to do here. This semi dramatic comedy might not hit all of the right notes, but what's here is plenty entertaining.\r I have to give credit for the attention to detail. When Sandler's character \"Max\" gains the ability to take on the appearance of another person by literally walking in their shoes, the characters personality and mannerisms are still evident. You can literally tell it's still Max just with a different face. I especially enjoyed the music, which helped carry the Jewish vibe the film was going for.\r The plot jumps around between ideas. It starts off giving us a character who just wants to be someone else. Instead of giving us a movie about staying true to oneself writer and director Thomas McCarthy ditches this possibility quickly by tossing our lead into situations here he can help other people. The results are often quite funny. Max gets himself involved in some potentially dangerous scenarios that he has to get out of by switching identities. It gets pretty crazy and leads to some funny moments as well as some sweet ones. The finale tries to go a little too with the fiction and the results come off as a little cheesy.\r The Cobbler has some flaws. Overall though there's enough humor and uniqueness here to make it worth a watch. Sandler steps out of his comfort zone to work with some different people. The results are something that feels wildly different from any of his previous works. For those in the mood for something unique that has both humor and heart I recommend this movie."
    },
    {
      "rating": "7",
      "text": "In my opinion it was an okay movie - maybe because I don't slack off Sandler as much as others do, but don't worry, it wasn't like all of the acting was done by him here - if you know movie's premise, then you know that he basically gets to be other people while wearing their shoes etc. So actually some other actors were involved heavily too. What I disliked was that the plot was a bit loose and did not come together completely - I mean there were so many flaws and the ending, maybe not predictable early in the movie, became more and more obvious and it actually kinda didn't make that much sense (not that most of it did). While it has some funny parts, don't expect much comedy here (not that it is drama either). Movie itself was interesting to watch in the sense that you wanted to know what will happen, even though some parts were a bit disappointing and actually repetitive. Plus I did not get how walking in other people shoes and being them will give you that much really - I mean you still have to do bad things to gain money or women or whatever, but they kinda made it that it is meant for doing good things - I just did not get what things actually.Anyway, if you want something more serious and without over the top acting etc, then this is for you and it is a watchable movie, even though you might forget what happened there after a while."
    },
    {
      "rating": "10",
      "text": "It's a deep movie if you can understand it's meaning, it shows that family means something beyond just flesh and blood, thank you for this movie, I enjoyed it alot."
    },
    {
      "rating": "0",
      "text": "Há filmes com roteiros falhos, atuações ruins, piadas fracas, cenas sem nexo e horas de tentativas desesperadas de prolongação de um filme que tem tudo para dar errado...e The Cobbler não passa de uma junção de tudo isso."
    },
    {
      "rating": "9",
      "text": "Honestly, not sure why so many people dislike it. People talk about terrible characters, etc. when describing comedies, especially this film. Although, in all honesty, comedies are supposed to make you laugh, and nothing else."
    },
    {
      "rating": "7",
      "text": "Adam Sandler has made an array of dubious movies for several years now, filled with cheap jokes and crude slapstick moments. The Cobbler has significantly different direction than all of those, it brings an odd near magical concept that unexpectedly works. While it also has a couple of flaws like some corny jokes and predictable plot devices, it remains entertaining without forced juvenile moments and delivers genuine laughs.\r Story follows Max Simkin (Adam Sandler), a cobbler who finds out that his old apparatus has another magical function other than fixing soles. It allows him to change into the person who owns the particular shoes. The premise is good, Max steps into other persons' lives and also the wrong crowd, whose lives are far more diverse than his. Adam Sandler take a different role than his usual silly middle age men role. He brings more of casual awkwardness from a polite man, the addition of background and cultural aspects are also very welcomed to set a more identifiable setting.\r Cinematography is slightly somber, certainly a change of pace from Sandler's usual overly colorful tone. To its credit, there are amount of details of the environment and the movie portrays the setting as a fundamental part of it. Humor mostly hits the spot, the jokes will create a few chuckles here and there. Though it's not all gold, it is definitely better than maniac laughs in Grown Up which isn't infectious at all. The film has more focus as it tells the comedy with both subtlety and exaggerated motions.\r Actors deliver fair performance. Max's transformation takes him into different skins, all of which are portrayed with shared clumsiness. The body switching subgenre has a few predictable twists, the film also faces this problem, but it creates scenes with enough refinement that makes them refreshing and presentable. Screenplay and script have substantial material, they don't overreach the premise even though there are a few subplots in play.\r There are some narrative hiccups towards the latter half, although these are not intrusive and shouldn't deter one from giving the movie a chance. The Cobbler reminds me of Click, it has strange concept yet surprisingly effective. This is an improvement in Sandler's movie line-up and it's certainly worth a view."
    },
    {
      "rating": "5",
      "text": "The Cobbler is not one of Adam Sandler's over the top, poorly acted and incredibly bad comedies, it's more of a fantasy drama with a comedic tone. I am a big fan of Reign Over Me, I only have great things to say about that film, and every time that I see a drama with Adam Sandler's name stamped on it, I still rush to see it.\r The Cobbler has a good premise, and they've paired the interesting\rpremise with nice trailer but what a f***ing let down.\r The film has a big, no, huge, pace problem, it's slooowww and as\rdepressing and dull as Max Simkin (Adam Sandler) is the movie. I\runderstand that Max Simkin is not enjoying is life at the beginning of the movie and that is fine. But he stays that way the whole way\rthrough, which in this case kills any comedic attempt, in fact the\rtrailer was funnier than the movie was.\r Adam Sandler, despite the fact that he is the front man, is not the\rproblem of this film. His performance is decent although it could have been better, it is OK. The guy can be good, he recently showed it in Men, Women, and Children. The same could be said for cast in general, even the worst of them could not have made this movie worse.\r The story and the execution seems to be the real problems. Storywise\rThe Cobbler is all over the place and does not have consistence or an homogeneous identity. The Cobbler sounds like a fairy-tale, a fable kind of movie, because it looks light and fun. And it actually starts off that way but then the tone, the pace, and the story turns it into something completely different.\r I am so disappointed that I'm going to stop now, I'm too annoyed.\r @wornoutspines"
    },
    {
      "rating": "10",
      "text": "Thoroughly enjoyable fantasy that intermingles humor with pathos and charm. Don't miss it. Reminiscent of a Twilight Zone episode, but far better. Al star cast with Sandler, Hoffman, Buscemi. The reviewers who pan it should find another line of work."
    },
    {
      "rating": "9",
      "text": "Yes! Sandler's back! I caught The Cobbler on VOD, and was surprised that it was a Adam Sandler movie. To my surprise, I had fun with it. The movie is a fresh turn from Sandler's poorly acted, gross comedies, I mean this guy made classics! The Longest Yard, The Waterboy and now, The Cobbler. The movie is funny, I know Sandler has lost his charm over the years, with That's My Boy or Jack and Jill, but the whole thing clicks, well. The Cobbler is a fantasy mixed with comedy, and boy was it intriguing, this may be the most interesting work that Sandler has done! Max Simkin, a shoe repairer, gets a special power, that he can be whoever wore those shoes, it sounds silly, but it works well with what Director Thomas McCarthy wants to introduce. The critics can pan anything, but their biggest target is Adam Sandler movies, this one, doesn't need panning, it's a GOOD movie. Overall, The Cobbler is a fun, wild ride that may be Sandler's best work yet. The man IS back."
    },
    {
      "rating": "9",
      "text": "Ignore the pompous \"big\" critics. They exist only to tear things down. The Cobbler was a pleasant surprise for me. This movie is neither a comedy, nor a drama. It's more of an urban fantasy or fairy tale...so you don't have to be too shocked by the idea that a man who can cobble shoes can also transform into the owner of the shoes. Yes, it's outrageous...it is meant to be! Enjoy the story. The Cobbler is fun, surprisingly sentimental, and a wild little ride. It's not perfect, but it's not bad either. If you enjoy a fun and outrageous story similar to that of The Brass Teapot, you should love this, too!"
    },
    {
      "rating": "0",
      "text": "I could only watch 50 minutes of this film.  During that time the main character transforms himself into three different African-American characters.  The first time Sandler's character becomes an African American he \"skips out\" on a check at a restaurant.  The second time Sandler's character becomes an African-American he forces a man to take off his shoes, then steals them.  The forth time he becomes an African-American, the person he doppelgangs is an actual criminal, with African-American friends who are also criminals.  The only African-American who is not represented as a criminal is an obese teenage boy.  I was thoroughly disgusted with this movie.  How small minded and uncreative to seek humor at the expense of African-Americans.  These kinds of stereotypical representations of African-Americans fuel racist ideologies, and birth new ignorance daily."
    },
    {
      "rating": "2",
      "text": "The Cobbler is very close to being unwatchable and it hurts me to say this because I generally like Adam Sandler movies. First off the plot of the movie is just not something that people would find interesting in 2015. No one gets their shoes repaired anymore. Then there were several parts of the story that I found underdeveloped and then the film become a crime movie unnecessarily while continuing to be so unfunny throughout the movie. I hate to say it be Sandler's performance is lazy and could be the worst I have seen from him. Weirdly enough though I don't think the film could be made any better. It just really did not need to be made. Its that simple."
    },
    {
      "rating": "2",
      "text": "The Cobbler is a stupid film. Its an underdeveloped with characters that are forgettable as a nightmare. Lazy, boring and by the end, incomprehensible.  Another garbage film that stars Adam Sandler."
    },
    {
      "rating": "7",
      "text": "I don't know what's really going on with Adam Sandler in the recent years, he was actually out of the league for a while from entertaining his fans. All he did was overdose comedies which were below par compared to his earlier movies. I said in 'Blended' review that I'm tired of his movie, but watched it only because of the director. All his films were very impressive and I believed him on this one, more than the Sandler. Otherwise, it would have been undoubtedly a skippable flick.\r As expected the movie was good, but not without the flaws, I mean the major ones because there are many unanswered stuffs that leaves viewers go either way from thinking all the possibility to create their own imagination. Hope that's not the case, the writers do not want to be that smart otherwise it will be a messed up movie with having a wonderful theme idea.\r Yeah, I liked the concept, but it should have been a bit detail while exploring the story and exhibiting the characters. I still feel it can be covered in the follow-up, so from that perspective, the movie was decent. Especially highlighting one of the social issue was a nice addition, but the portrayal of family affair was a disappointment. It's that kind of story demanded in a like manner, but that does not convince me at all.\r From the Adam Sandler's perspective the movie was much better, because of his series of recent fails. At the same time it was a bit letdown from the perspective of the director known for his cool works. Overall, it lays on 50-50, and mostly favours on the positive side because of the narration of the dark comedy in a style. And again, I felt the end was terrible with cliche. I definitely give thumbs up to go for it, even though the loopholes the creative concept draws our attention.\r 6.5/10"
    },
    {
      "rating": "5",
      "text": "Let's be glad that us audiences and critics did not get another mean spirited Adam Sandler comedy. The humor is mildly impressive, especially for an \"Adam Sandler movie,\" when the movie started it was boring. And I never saw a boring Adam Sandler comedy, in addition we should be glad that the people that were not involved in Grown Ups. Grade B-"
    },
    {
      "rating": "6",
      "text": "A cobbler in New York finds out that when he uses his dads old machine to mend shoes and then puts them on he becomes that person. After utiising it for fun, things become slightly more serious when he gets involved with a girl trying to save the local neighbourhood, local criminals and helping his mother come to terms with his fathers death. For an Adam Sandler film this is certainly a step up from his usual fare, and for the most part this is a charming Capra-esque comedy, which only falls apart towards the end as it tries to hard to please."
    },
    {
      "rating": "5",
      "text": "The movie is not nearly as bad as many have claimed. Yes, it is stupid and nonsensical, but it has redeeming qualities. It does try to make a story out of an interesting premise."
    },
    {
      "rating": "6",
      "text": "The premise was interesting even though it was silly and the acting performances were pretty good, but the movie was cliché, unoriginal and predictable. Don't get me wrong, it's not a bad movie, it's even thoroughly enjoyable, it just gets boring after a while."
    },
    {
      "rating": "2",
      "text": "Trying to write a review for an Adam Sandler movie is like trying to write an epitaph for a person you really don't like very much. This movie is also a great way to help your insomnia."
    },
    {
      "rating": "4",
      "text": "I have no idea how Thomas McCarthy did it, but it's quite unbelievable. One minute he's an Oscar front runner, and then all of a sudden, a favorite at the Golden Raspberry Awards in one year. I'm not sure if I should be giving McCarthy round of applause for doing the impossible or ask McCarthy what he was thinking.\r Maybe both."
    },
    {
      "rating": "6",
      "text": "I think that because Adam Sandler is in this movie its in to bash it.  I dont think that he is at all bad in this film.  He portrays a kind of simple soul is all.    I mean the guy fixes shoes and lives with his mother.   Not Mr Excitement.   I do believe as others have commented that its slow but overall its a good film thats original.  Theres no zombie teenage vampire robot from space in this movie and thank god for that."
    },
    {
      "rating": "4",
      "text": "The Cobbler to start off was funny i say that because there are parts that are funny, but was it the funniest Adam sandler movie ever no not even close but is it an Adam sandler movie i could watch a least one more time Yes and i gave it a four because to me it was a rushed movie and the cast was off . to make this movie better they should have casted some famliar faces, like the ones in his upcoming movie Pixels."
    },
    {
      "rating": "2",
      "text": "Adam Sandler proves that he's no longer trying anymore when it comes to the Cobbler, a piece of a pie that should've been thrown in front of his face when this movie was released to theaters."
    },
    {
      "rating": "4",
      "text": "Tom McCarthy, director of Best Picture winning film Spotlight directs this stupid Adam Sandler flick.\rThis movie is horrible with only a few good laughs.  It goes to show that Adam Sandler is giving up.\rThis movie is horrible do not see it."
    },
    {
      "rating": "5",
      "text": "At least it saved his movies with a movie that was not a total drag. But, equal it was a bad movie.Destroyed by the critique and ticket office, a sorrow is not worth seeing her"
    },
    {
      "rating": "3",
      "text": "This movie was a quite alright movie until the last 5 minutes. Before the last 5 minutes, it was interesting, occasionally funny, and mostly well-acted. I didn't dislike the plot and was actually invested in the movie. The ending, however, was as shocking as it was hilarious and ridiculous. I couldn't possibly give a movie with THAT ending a good review."
    },
    {
      "rating": "6",
      "text": "This is a fairly typical Adam Sandler comedy film, without any gross-out humour. Its a light and easy watch and its certainly pretty cheesy. The plot concept is interesting enough and there are some amusing moments, though its not a film likely to make you have big belly laughs. The cast is alright, with Steve Buscemi as the retail neighbour and Dustin Hoffman as his dad. If you just want a basic easy to watch bit of average entertainment then this will likely fit the bill - nothing too taxing or greatly memorable. I don't think I can say anything more than that. Its ok-ish, the plot is a little lacking at times and its not great but its not really awful either. I wouldn't specifically recommend this film as such, no. I could say its a load of cobblers (the obvious pun relating to this film name) but thats maybe a little too obvious... oh wait, I just said it. Oh dear...(!)."
    }
  ]
}