{"id": 787, "title": "The Polar Express", "starring": ["Tom Hanks", "Leslie Zemeckis"], "runtime": 100, "genre": ["Animation", "Family", "Adventure", "Fantasy", "Comedy"], "description": "When a doubting young boy takes an extraordinary train ride to the North Pole, he embarks on a journey of self-discovery that shows him that the wonder of life never fades for those who believe.", "releaseYear": "2004", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/eOoCzH0MqeGr2taUZO4SwG416PF.jpg", "categories": {"plot": 6.869565217391305, "acting": 6.230769230769231, "ending": 6.333333333333333, "soundtrack": 6.666666666666667, "cinematography": 5.0, "familyFriendly": 6.533333333333333, "funny": 10.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "Wonderful. Magical. A Holidays classic."}, {"rating": "10", "text": "Gorgeous visuals, interesting characters and good songs all come together for a nice journey I love revisiting every December."}, {"rating": "10", "text": "This movie is simply incredible. I loved everything about it, the characters, the storyline, the music. The thing I loved most of all was the incredible visuals. I would definently recommend this movie to anyone who has not seen it."}, {"rating": "8", "text": "The Polar Express at times is visually dazzling. It has a nice and sweet message and moments of awe but the film lacks an extreme amount of fun. I give this movie 78%."}, {"rating": "6", "text": "The Polar Express rides to victory.\rA magical, beautifully animated holiday tale of Christmas spirit. The Polar Express mystifies with its realism, enjoy."}, {"rating": "3", "text": "It was with some expectation that I decided to see this Christmas movie. I already had the perception that the film, despite being fresh and recent, quickly fell into a certain way of oblivion, with the television channels preferring other films during the Christmas season. Inspired by a book, which I have never read but heard about, the film addresses as a great theme people's disbelief, from a certain point on, in Santa Claus.In the film, a child whose name we do not know is invited to take a night trip to the North Pole, aboard a magical steam train, to meet Santa Claus and watch the old man depart on his annual trip to distribute gifts to the children of the World. He, however, does not believe in Santa Claus. Based on these premises, the film tried to build a kind of fable about the beauty of the Santa Claus myth. This never really worked: in addition to having no logic, the film has a terribly abrupt start: in the opening five minutes, we get a glimpse of the boy's life as he pretends to sleep, and we board the train without further explanation. The journey is lukewarm and uninteresting, the other children are bland or irritating and there is a character, somewhat ghostly, whose reason for existing is never really explained, but who helps the protagonist when he needs it. The ending is a kind of Santa Claus Superstar, with a show of aerial acrobatics of the gnomes.Although the film has a pitiful script and was notoriously the victim of radical cuts at the editing table, it's necessary to bow to Tom Hanks for an extraordinary vocal tour de force: the actor took full advantage of his vocal skills and gave voice to a handful of distinct characters throughout the film, with evident highlights for the train collector and Santa Claus. But in addition to all these voices, the actor also sang in several of the main songs of the soundtrack, which has its moments of quality, despite not being memorable, having a series of moments where it seems to copy the soundtrack of \"Edward Scissorhands\" and having a certain song, \"Hot Chocolate\", which I didn't like because of the extreme simplicity of the lyrics. Another aspect that deserves our positive appreciation is the extraordinary visual accuracy of the film, which makes the most of visual effects and CGI, providing us with elegant, colorful, vibrant and engaging animation.That said, I fully understand why this film came and went as quickly as a comet, both in theaters and on television, and ended up in the wastebasket of cinema history: despite director Robert Zemeckis having made a strong bet on visual effects and in a good animation, no film can't be sustained without a good story to tell."}, {"rating": "10", "text": "I adore this movie. The journey is stunningly beautiful and unforgettable, the action is lots of fun, and the emotion is pretty strong at times."}, {"rating": "10", "text": "This is the most magical Christmas movie ever. I'm not usually a fan of the phrase 'instant classic;, but this truly is one. People who don't like this clearly can no longer hear the ringing of the silver bell."}, {"rating": "10", "text": "It is a Christmas classic that you will remember forever. The Polar Express stretches the true meaning of the season with an amazing story that you will never forget."}, {"rating": "10", "text": "How hard skin you should have to rate this movie low. Did you ever have good Christmas, poor people? This is a tale, magical and wonderful. Light Christmas tale about the spirit of celebration. Do you want to be a child for couple of hours again, want to feel this spirit of Christmas? Then try this movie, gather your family, your parents if you are young, your kids if you are old and enjoy."}, {"rating": "10", "text": "it never gets old well sometimes it does watching  polar express . Its like a family tradition  watching one of  a classic christmas movies on Christmas eve or any day on december"}, {"rating": "10", "text": "I love this movie. This is a movie that you can sit down with your family and get a bag of popcorn and have a good time. Thus movie is one of a kind its so original. With a great cast and funny cast. With a Christmas theme train going to the North Pole to see Santa. The adventure is just amazing and it looks beautiful. This is a movie you have to see."}, {"rating": "8", "text": "Perhaps one of the best Christmas movies you could pick for your kids to watch. It's visually stunning and the animation is spot on. Though the singing may be a bit cringeworthy for older viewers, its classic tunes are perfect for youngsters."}, {"rating": "10", "text": "One of the best or if not, THE best christmas/ holiday movie in my opinion, Polar Express is a very great movie. Outside, it is snowing and the kids watching the film drinking hot chocolate, this movie is PERFECT for that IMO. The storyline is good. The characters are very good. The voice Acting was awesome and great especially Tom Hanks. The animation is perfect. The sounds and music were good. The Polar Express is a very great film and if you hate it, you're BEYOND silly as JB."}, {"rating": "10", "text": "This may be nostalgia talking, but I have yet to find a film since The Polar Express that so perfectly encapsulates the sheer magic and spirit that accompanies Christmas time."}, {"rating": "10", "text": "This is easily the best Christmas movie ever made. I watch it every year around December and it never gets old. I don't know why people call the animation \"unsettling\" because I've saw this when I was like four and I wasn't even a LITTLE bit freaked out. There are some great songs (my favourite being \"Hot Chocolate\") and great characters. Recommended for ALL ages. A Christmas Classic."}, {"rating": "8", "text": "Let me start with a tip: Wait until Christmastime to watch this movie! The whole film is based on Christmas and the North Ple. The visuals are amazing and the characters act realistic. The story almost feels \"random\" at times, but has its great points. Great around Christmas, pointless before or after December!"}, {"rating": "8", "text": "A unique way of animating the story from the 1985 children's story, putting their own spin on some scenes."}, {"rating": "7", "text": "The story of a boy who boards a train to meet the big guy, Santa, himself. He's caught between believing and not. It's such an adventure of excitement and merriment. It's sure to be a holiday classic.\rI love Tom Hanks."}, {"rating": "7", "text": "The Polar Express is not Zemeckis' best film, but not his worst. The animation is quite good, and the movie is generally entertaining, but there is something about the story that doesn't quite connect with you."}, {"rating": "9", "text": "The best christmas movie of the year. way to go, Robert Zemeckis. you were fantastic making this huge hit."}, {"rating": "8", "text": "Exquisite animation brings the world of the beloved children's book to life, while a suitable script and excellent voice acting take care of the rest.  Polar Express is great from beginning to end."}, {"rating": "7", "text": "\"The Polar Express\" - Robert Zemeckis's first foray into motion-capture animated features - is a lovely and delightful holiday film, beautifully animated and packed to the seams with creativity, imagination, zaniness, and a truly wonderful music score (although the main theme is played perhaps a tad too frequently). Some of the effects come off a bit dated now, since animation has advanced so quickly since then, but it is nonethless a great movie, and an easy must-watch around every Christmas time."}, {"rating": "7", "text": "The Polar Express has the magic to become a holiday classic but is marred by technical bugs and plot failures. While there are countless memorable moments on the train, its passengers fail to leave any impact on an emotional level. All of the children are bland and ghostlike, and only Hanks' conductor provides a spark of life into the movie. However, the spirit of Christmas in this film is nearly unrivaled in Hollywood, possessing an instantly likable sense of innocence and charm that is extremely refreshing. The atmosphere, sense of wonder, and overall theme are what powers the movie forward, propelling it above its flaws into a memorable experience for all ages. While it is not at the top of the holiday wish list, it is able to scale the mountain through its undeniable charm. In short, this is one train you should get on board.\r 7.5/10\r Follow me on twitter. @cbeers2513"}, {"rating": "7", "text": "The Polar Express can't beat numerous other animated films like \"The Incredibles\" and \"The SpongeBob SquarePants Movie\", but for whatever heart this film has and takes, it manages to be a heartwarming welcome and heartbreaking goodbye."}, {"rating": "10", "text": "Loved it!!!!!!!!!!!!!!!!"}, {"rating": "2", "text": "Horrible movie that looks great. It was soleless and boring. Why so dark? Why so random?What was the point. To literally believe in something that is not true? UUUggghhh!!!!"}, {"rating": "3", "text": "I don't know what the point of the movie was. Where is the story line, plot. I think story telling is a lost art."}, {"rating": "2", "text": "This movie has wonderful graphics, but that's about the only enjoyable part. When I went to see this, I was extremely dissapointed and it was torture sitting through the later half. The producers spent way to much time and money on the graphics and didn't focus on any other parts, The story-line--for me--was scattered and hard to follow, though you may find it otherwise. The characters were hard to relate to and emotionless. Some parts were even scary and not appropriate for small children. Pretty much the only happenings in this movie was that the little boy got on a train, went to the North Pole and came back. And that's the whole movie."}, {"rating": "1", "text": "Bad, Bad, Bad! I agree with those that say, don't take kids. It was mean, ugly and hearltless, with a sicko message that hope is found in believing that a made up person will give you the material objects that your family can't. I agree with Nancy. The cruel joke that the movie plays on the poor boy who is finally learning that his life is not a fairy tale and that he is poor and that that is OK as long as he accepts it. But no! the movie says he is wrong to be realistic and sensible. He should \"believe\" more in a lie that will stunt his emotional growth for a few more years and make him resent his poor family for not giving him big presents. So santa is \"god\" and material objects are the reason christmas exists. This movie insults all religions and spiritual orientations equally. But it is not just the message of greed and delusion that makes it bad, it is that it is randon and mean-spirited. Like so many readers noted, there was no story. The boy gets on, the train goes north, random unrelated things happen that make no sense and do not make you care at all about the people and then the train gets there, the boy gets a present, and then he comes home. So what happens next christmas? Does he go again? Does santa have to give him a bigger gift or he will think he got dissed? What if the boy went to meet Marilyn Manson and got a gift, would we all want him to \"believe\" in MM for the rest of his life. So when a kid loses his \"believe\" in the idea that he gets free things from a fictional character, we should all be sad for that person? Good christmas movies are about human values and choices and recognizing what is important. This movie was a creapy effort to sell a sick and harmful message."}, {"rating": "6", "text": "The Polar Express is mostly enjoyable to watch and look at except for the creepy human animation. It also feels like one long unnecessary scene after another that could have been easily condensed."}, {"rating": "10", "text": "the greatest job was done on the animation, being very realistic, and the sounds of the train being the most spectacular i ever witnessed in an animation. i enjoyed watching this film, and it is the best animation i have ever seen. it's a 10/10 well deserved."}, {"rating": "8", "text": "It is my favorite Christmas film next to National Lampoon's Christmas Vacation. This is an amazing film. Yes it does have some overreacting when it comes to the girl's love for Christmas. Yes their eyes make them look like zombies. But it was great and it is for you"}, {"rating": "7", "text": "This is a magical adventure that is the most beautiful film of its kind I've ever seen."}, {"rating": "1", "text": "Boring and strangely lifeless. What a bunch of poor techno-geeks imagine will blow people TOTALLY away ....kind of like a bunch of NASA scientists going into a collective swoon and near cardiac arrest because their Mars Land Rover has just fondled a chunk of Mars debris...sad! They could at least had a few drowning polar bears that Hanks scoops up at the last minute. Basically this film is little more than a \"sampler\" of special effects for Dreamworks (or whoever) to send around to potential clients as a catalogue of their Neat Special Effects. It's a Marketing tool about Marketing for the Market market. What could be more timely !!"}, {"rating": "10", "text": "Exhilirating in its imagination & point-of-view through a child's eyes. Mesmerizing."}, {"rating": "8", "text": "THE POLAR EXPRESS tells the story of a boy who's lost all faith in Santa, but, is thrusted into a magical world where \"seeing is believing.\" Though it may take a few viewings, this film is some very good material. It took me a grand total of 3 times to truly absorb it all. It's not confusing... it's all just so... curious. A ghost bum on a train, show stopping musical numbers and possibly creepy animation ; how does all of this fit into the picture book narrative of Chris Van Allsburg's picture book? Don't ask me but in the hands of Zemeckis and Hanks it all seems to gel into an enthralling holiday experience. Overall: B+"}, {"rating": "9", "text": "Perfect in every way, except for the \"cameo\" appearance by Steve Tyler of Aerosmith. What was Zemeckis thinking?? That horrible misjudgment aside, this film is pure movie magic."}, {"rating": "8", "text": "Good holiday film for all ages. The visuals were good and the acting very well done. The storyline seemed tied down to sliding, skiing, sleding, movement type actions which seemed a little old by the time we get to the North Pole however, and the Steven Tyler elf at the end could've been eliminated all together IMO. Now to address the whole \"creepiness\" feel of the characters...the eyes are then window to the soul gang. Artists, work on it! Again, nice movie with some good stuff for everyone. And, BTW, all of you out there who looked at this movie and Santa as nothing but commercialism need to learn how to \"believe\" yourself. You miss the whole point of Santa Claus to begin with."}, {"rating": "10", "text": "That was cool."}, {"rating": "10", "text": "In our house, the movie completely captivated it's intended audience."}, {"rating": "0", "text": "It made me cry cuz it didn't make any sense."}, {"rating": "8", "text": "The Polar Express is interesting in it's conception, creative in it's execution and charming in many small but meaningful ways. Others reviewers have zeroed in on the technical flaws and limitations of attempting to adequately capture human emotions in animation, especially in eyes. Technology can always be improved upon and, in time, those limitations that exist in this films will likely be overcome. Where Polar Express shines is in the ability to convey the simple yet oft-forsaken idea that wonder, belief, trust and friendship are compatable with adulthood and maturity. The idea that belief, not just in Sanata Claus or the North Pole or elves but in one another, in family and in friends is as vital an element in life as breathing, eating and sleeping. To dismiss this film as a technological wonder or a paean to childish dreams is to close one's mind to the deeper meaning found within the story. It isn't mindless feel-good entertainment nor is it ideologically-laden cinema art. It is a reminder that anyone with the desire can find hope and honesty if only they allow themselves to believe. In the grans scheme of things, perhaps that's not such a bad discovery to make, especially if one has grown jaded and cynical as they have aged."}, {"rating": "9", "text": "Great family movie. Best Christmas movie I have seen possibly ever. My young children loved it, as did I."}, {"rating": "9", "text": "One of the best animated features of the past year, charming and visually stunning, one of the best Christmas movies ever made, it has majesty and overall grandness that reassures a grand aventure with the dazzling polar express."}, {"rating": "8", "text": "This movie is great for the whole family to watch with all aspects covered like laughter, heart-warming moments and even some action here and there."}, {"rating": "1", "text": "I couldn't even watch the first 20 minutes. It was so bad. I quit watching after the part with the train over the frozen lake sliding part/finding the ticket. When were those parts ever in the book? The book was awesome. This movie is nothing like the book. Not even close. I had a great childhood and I remember growing up as a kid I used to read the book with my parents. After watching this garbage movie it made me want to throw up. If you want to see a good film with excellent animation go and see the Incredibles or Monsters inc."}, {"rating": "10", "text": "I find reviewers' reaction to this film and their comments say a lot about the kind of person they probably are inside. After watching this amazing movie, I was glad to discover that I am an emotionally healthy and alive human being. I am both the adult i am now and the 8 year old kid I was 46 years ago. I had tears running down my cheeks. Absolutely wonderful movie."}, {"rating": "6", "text": "It could have been better for a child movie even more that it's a pretty short movie. I think that the wors where the animation that somtimes was not realistic."}, {"rating": "8", "text": "This Movie successfully captures the wonder and magic of Christmas. I don't care if it promotes false truths. Most who hate this movie have forgotten what it was like to spend Christmas as a child and can therefore not connect with this movie. While it is simplistic in its plot and has excessively busy visuals, it doesn't take anything away from its spirit. My only complaint would have to be the elves that are introduced at the end of the film... Creepy."}], "recommendations": ["klaus", "finding_nemo", "up", "soul", "onward", "luca", "the_good_dinosaur", "moana", "the_land_before_time", "where_the_wild_things_are", "brave", "over_the_moon", "coraline", "finding_dory", "ratatouille", "the_star", "the_book_of_life", "spirit_stallion_of_the_cimarron", "the_peanuts_movie", "your_name", "trolls", "zootopia", "the_croods", "toy_story_3", "christopher_robin"]}