{
  "id": 2557,
  "title": "The Secret Life of Walter Mitty",
  "starring": [
    "Ben Stiller",
    "Kristen Wiig"
  ],
  "runtime": 114,
  "genre": [
    "Adventure",
    "Comedy",
    "Drama",
    "Fantasy"
  ],
  "description": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg",
  "categories": {
    "plot": 8.166666666666666,
    "acting": 8.32,
    "ending": 7.571428571428571,
    "soundtrack": 7.5,
    "cinematography": 7.5,
    "familyFriendly": 7.5,
    "funny": 8.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I can't believe this movie has a metascore of 54. This is one of the best movies of the year. I know this site bases the score on a wide range of reviews, but when they get it this wrong I question the value of coming here."
    },
    {
      "rating": "10",
      "text": "I understand the problems with this film but for some reason I cant find myself giving it anything less than 10 out of 10. This might be because thematically it might have struck a personal chord. I will admit that it was a bit much at times and a bit overambitious at others, however I really enjoyed it and would recommend it, it is the perfect escape of everyday life, uplifting and sweet at the same time."
    },
    {
      "rating": "9",
      "text": "Beautifully crafted film. What Ben Stiller has created for our viewing pleasure is nothing short of brilliance. I would definitely recommend that if you did not get an opportunity to check Walter Mitty out on Christmas Day, you get out to see it as soon as possible. You will not be disappointed."
    },
    {
      "rating": "10",
      "text": "This movie is a simple piece of art. You just cannot imagine what will be the ending. And you are entertained since the very beginning.\rThe actors are amazing, the places beautiful, the story overwhelming."
    },
    {
      "rating": "9",
      "text": "I saw an advanced screening of The Secret Life of Walter Mitty not knowing what to expect. It is Ben Stiller.  I loved Tropic Thunder but that was really it. I go and watch the movie and i feel like watching it again. Ben Stiller does such an AMAZING job with this. His performance was very believable and he uses his camera in smart angles and views.  I absolutely hope this is nominated for a couple of Academy Awards because he did a great job with it. I highly recommend it."
    },
    {
      "rating": "8",
      "text": "\"The Secret Life of Walter Mitty\" is a celebration of life. It’s a feel good movie that not only inspires, but motivates its viewers to go out and live life to the fullest. Don’t let anyone, especially yourself, stop you from seeking adventure and making the best of this precious gift of being alive. It is a fun and heartwarming tale that is worth watching.\r The story and screenplay don’t necessarily excel or surprise in the narrative department, but they provide a emotionally satisfying experience nonetheless. However, this film really shines from a directorial stand point. Ben Stiller does an excellent job of balancing the fantasy and real world moments in the film. I really felt like I was watching a person’s daydreams when Walter would zone out. It’s exciting and beautifully executed and when the character snaps back into reality, it is very much like me when I daydream.\r The cast does a solid job, but nothing really stands out performance wise. Having said that, I find Walter to be an incredibly likeable character. He’s odd and a bit awkward, but he never feels hopeless so we can always root for him when things don’t go as planned. And Ben Stiller’s natural charisma adds to the character’s likability.\r Overall “The Secret Life of Walter Mitty” is an enjoyable feel good movie that will warm your heart and make you appreciate life. The film doesn’t excel in any one particular area of film making, but it does hit you were it counts. Accompanied by a great soundtrack/score, this is a movie that is worth watching and you’ll come out of it with a new found appreciation for life. I give it 4/5"
    },
    {
      "rating": "9",
      "text": "Nice looks:  both Life Magazine and the adventures to Greenland, Iceland and Afghanistan.  Ben Stiller is likeable as ever, and a good match for the character of Walter Mitty.  Sweet performance by Kristen Wiig.  Perfect cameo by Sean Penn.  Solid comedic performance by Patton Oswald.  Nice plot development:  he gives up his fantasies for reality.  Pleasant romantic comedy thread."
    },
    {
      "rating": "8",
      "text": "This movie was Ben Stiller's Playback Time you know in Mr. Bean's Holiday. But this is based on '30s short story. Sean Penn was hot even though only a scene.\rIf you're looking for motivation then watch The Secret Life of Walter Mitty. But if your definition of motivation is money, drugs & sex, then watch Wolf of Wall Street."
    },
    {
      "rating": "10",
      "text": "Heartfelt and inspiring movie, it is truly a reflection of what is happening in society today. Makes me wanna go out and do the things his done instead sitting and day dreaming in the office.\r The critics has got this one all wrong!!!"
    },
    {
      "rating": "10",
      "text": "Such an amazing and powerful movie.\r How disappointing can be the critics sometimes, they almost made me lose one of my favourite movies ever.\r Don't watch Life.\rLive it!"
    },
    {
      "rating": "9",
      "text": "The Secret Life of Walter Mitty is sweet, ambitious, and beautifully shot film.  It also has a gorgeous score and is wonderfully acted. I LOVED this film and it is absolutely endearing, just what I needed during this holiday season. I wanted more of Wiig....but that is just because she is so good. Stiller is the best he has been in years."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing. I didn't know the serious Ben Stiller. The Secret Life of Walter Mitty is the best adventure movie of 2013. The scenery is gorgeous, and the visual effects Amazing. Thank you Ben Stiller"
    },
    {
      "rating": "10",
      "text": "Watched walter mitty today and enjoyed it massively! Definitely a feel good film with incredibly imagery and stunning landscapes. Quite possibly my favourite film to date!"
    },
    {
      "rating": "10",
      "text": "ok, yeah i am with everyone who liked this movie, the scenery was amazing and its a true hearten adventure story. Good acting and a really good story behind it. Ben stiller really put him self out there with this one. Very different and impressive. As to the ending i have found that a lot films lately have not spent a lot of time working on it but this movie really left me with a nice sensation, which means i loved it."
    },
    {
      "rating": "9",
      "text": "A fantastic uplifting romp through the power of inspiration and imagination.    The Secret Life of Walter Mitty is much more than one would expect with a strong dose of sensibility from Stiller and a tactic refusal to use comedy as a recovery tool as so many movies do today.\r Stiller shows a wide range of acting chops in Life which, at the end of the day, raise this romantic comedy drama adventure to heights it would otherwise have missed.   One of the better movies of the year and deserving of a much greater Metacritic score than the analytical critics have seen fit to deliver.\r This is a movie you won't regret seeing.  Just be sure to open your eyes and see your way to the end."
    },
    {
      "rating": "7",
      "text": "It's a decent movie about finding the adventure in your life, but it isn't really as inspiring as it should be. It's a little bit too corny and too straightforward, when subtlety should have been the best way to go."
    },
    {
      "rating": "8",
      "text": "The Secret Life of Walter Mitty is a very nice film from Ben Stiller. And \"nice\" is the best word for it, indeed. Everything from the plot to the comedy to the emotional impact is all very nice. It's just... Nice. But like all \"nice\" things, it's also rarely exceptional. But if you want a nice mild experience to wash over you, The Secret Life of Walter Mitty does the business."
    },
    {
      "rating": "8",
      "text": "I was rather sceptical about this movie, however I was more than pleasantly surprised! Sure sometimes it's a bit over the top, but I rather enjoy that. The movie has the basic ingredients to get pulled in: it has some wit, characters to hate, characters to love, a silly story but with a good message. Some nice jokes that everyone may appreciate.\rFor me, this was a very nice feel good movie, and I would definitely recommend it."
    },
    {
      "rating": "8",
      "text": "Walter Mitty (Stiller) works for Life magazine who, following a corporate takeover, are about to publish their final print issue. Having never done much of note in his life Mitty spends most of his life daydreaming, often about ways to impress co-worker Cheryl (Wiig). When a photograph, needed for Life's final cover, goes missing Mitty sets out on an adventure that takes in Greenland, Iceland and Afghanistan.\r Ben Stiller is unusually restrained in the lead role but puts in a superb performance as the socially awkward Mitty and the supporting cast are equally as well cast. The cinematography is stunning and, whilst the pacing is perhaps a little uneven at times, it rarely detracts from Mitty's feel good journey.\r You'd have to have a heart of stone not to be touched by this movie."
    },
    {
      "rating": "9",
      "text": "I had been looking forward to finally watching the secret life of Walter Mitty and I was not disappointed.  Rather than dissect the movie and compare it to a 1947 film (which I doubt anyone younger than 50 has seen) like a previous reviewer mentioned, I'd like to simply say that this movie was a good time.  It has adventure, light romance, comedy, and emotion. It is a story anyone can relate to about being stuck in a 9-5 and spending that time dreaming about what we could be doing."
    },
    {
      "rating": "7",
      "text": "This is a really great movie if you like interesting visuals, and really good cinematography. However, the characters are actually not very interesting. That being said, I really enjoyed this movie. Despite the characters being boring, they were actually very relatable to your \"average joe\". It's worth the watch in my opinion."
    },
    {
      "rating": "8",
      "text": "A decent and up-lifting story with Ben Stiller in the Director's chair AND in the lead, how the hell did I stumble into an alternate universe where he's a good actor?\rThis movie is a brilliantly shot-if plot light-take on the old adage 'don't let life pass you by', it's far better than the quote from Ferris Beuler. This film does that in a far more subtle way, it shows you what you're doing every day and then what you could do and the only thing that holds you back is the 'responsibility' we all have.\rA good and warm movie for anyone who wants to enjoy their life, instead of simply living."
    },
    {
      "rating": "8",
      "text": "As a person who spends a lot of time looking out a window “day dreaming” I was able to relate to Walter a lot. The secret Life of Walter Mitty was clearly a movie that Ben stiller really wanted to make. It is the story of a middle age man who has done nothing with his life, who suddenly has an adventure thrust upon him.  This movie is far from perfect but if you are able to overlook some of the more silly parts of the movie, e.g. a scenes where Walter has an all-out fight with one of the bearded pricks in the movie over a Stretch Armstrong doll then you should be fine."
    },
    {
      "rating": "7",
      "text": "While not every single granule of logic lines up in Ben Stiller's fifth directorial effort, \"The Secret Life Of Walter Mitty\" still remains a visual treat that acts as more than a testament to Stiller's fine directorial powers."
    },
    {
      "rating": "8",
      "text": "I really liked this movie! I thought it was sweet and charming and it was shot incredibly well. The cast was all fantastic and I really enjoyed Ben Stiller's aesthetics."
    },
    {
      "rating": "7",
      "text": "I am very happy for Ben Stiller at the moment. He has finally been daring enough to venture out of the brainless teen comedy zone which he has been stuck in for the past few decades and made a very entertaining movie. The Secret Life of Walter Mitty in my opinion should not be described as a family movie. Not because it isn't fun, because I expect adults will actually prefer it to children. This is probably down to the much more sophisticated type of humor used to get the laughs than in Stillers previous movies (basically the Focker movies). I have to admit the style to the whole film varies in places. For example it goes from being a quite funny and sweet to being downright creepy and forced. If you have seen it already you will understand that I am of course talking about the Benjamin Button scene. However this is not what you would call a major flaw and I found most of it to be harmlessly enjoyable. The funniest moment was undoubtedly how Walter deals with the aggressively unlikable character firing half of the people in Walter's company. Kristen Wiig (who I usually find irritating) singing Space Oddity to inspire Walter to get off his ass, is also a brilliant scene. Not perfect, but satisfying by way of laughs and worth watching. Stiller has finally made an intelligent comedy."
    },
    {
      "rating": "8",
      "text": "This is just a lovely feel good movie. It has great charm, wit and is a thoroughly enjoyable experience. Highly recommended  stiller's more serious roles are really lovely and his maturing as an actor is lovely to watch late in his life. Go and see this"
    },
    {
      "rating": "8",
      "text": "While it doesn't follow the plot of the short story, it still has the charm. The characters are interesting and fun, the cinematography is Oscar worthy, and it is well written."
    },
    {
      "rating": "10",
      "text": "Этот фильм стоит у меня на первом месте в избранном. В этом фильме я узнал себя, свою скучную жизнь. Этот фильм заставляет задуматься и сделать что то безумное и веселое, сделать себя счастливым. Об этом фильме можно разговаривать часами и пересматривать снова и снова!\rПросто останьтесь один дома и посмотрите этот фильм, вы не пожалеете!"
    },
    {
      "rating": "10",
      "text": "The Secret Life Of Walter Mitty is a film that has to be seeing.\rVery beautiful.\rIn the beginning we are in his fantasy and after we are not pretty sure that it is his reality that he live.\rIt is good to see a good movie."
    },
    {
      "rating": "8",
      "text": "More than other films, \"The Secret Life of Walter Mitty\" fractures the audience. Split along the dividing line between cynicism and idealism, one camp finds a sweet treat celebrating the underdog while the other chokes on treacle.\r Armed with a terrific script penned by Steven Conrad, star and Director Ben Stiller proves his mettle in front of and behind the camera. His Mitty is an everyman sacrificing all for family; the flights of fancy an escape from a life lived in quiet desperation. Set upon a quest to find an important film negative, Mitty surpasses fantasy, finds the negative and wins the girl. It's pure hokum, yet surprisingly uplifting. Risking oxymoron, though steeped in fantasy \"The Secret Life of Walter Mitty\" is unerringly real.\r The film also peddles the notion our increasingly wired world, where it's not real unless posted on Facebook, is fallacious and dangerous in that human connection to the world and each other is becoming the fantasy. Think of sightseers sequestered behind iPads and smart phones snapping away in lieu of directly experiencing the marvels before them. Or the story of a man beaten by several others on a subway platform where none of the bystanders stepped up or called 911 but did record the scene on their mobile devices.\r Best expressed by the object of Mitty's search, photographer Sean O'Connell (a fine Sean Penn) is poised to take a spectacular snap of the elusive Snow Leopard, balks and states (paraphrasing), \"Sometimes I don't take it. I just like to be in the moment.\" A concept drowning in contemporary life built on instantaneous gratification. (The difference between the immediacy of digital photography and traditional which requires time, patience and a swim in smelly, carefully prepared chemicals.)\r \"To see the world, things dangerous to come to, to see behind walls, draw closer, to find each other and to feel. That is the purpose of life.\" This cinematic \"Life\" magazine motto - the film's theme - infers the adventurous spirit, curiosity and purposefulness require resuscitation. Absent the phony, wise guy RomCom dialogue used in most of the ilk, \"The Secret Life of Walter Mitty,\" quietly celebrates the human spirit like no other film in recent memory. And there is nary a cynical frame in it.\r Kristen Wiig is understated and quite appealing. In an unforgettable scene, Walter fantasizes she takes the stage in Nuuk, Greenland to dedicate a rendition of Bowie's \"Space Oddity\" to him. The ballad rouses Walter to board a helicopter and, hanging on for dear life, continue the quest. Later, while pedaling in hot pursuit of Sean O'Connell, a large flock of birds creates Wiig's likeness. It's an amazing image (as is the cinematography of Iceland and British Columbia).\r Adam Scott's corporate raider is a bit broad and one dimensional. Shirley MacLaine is fine as Edna Mitty; a sweet, pie-baking Mom direct from the cover of \"The Saturday Evening Post.\"\r If fault is to be found it is in overt product placement that is counter to the film's tone. In defense, the Papa Johns tie-in is motivated unlike Fedex trucks prowling streets in many films. But the inclusion of Patton Oswalt as an E-Harmony rep is an unnecessary distraction.\r Not unlike any other romantic comedy, this is a film of standard movie plot points and complications. \"The Secret Life of Walter Mitty\" soars in its heartfelt, assured and gentle execution. Given its definitive slant, your mileage may vary."
    },
    {
      "rating": "8",
      "text": "Skipped this film at the theatres due to poor reviews. I am just glad that I got a second chance on DVD.\r The movie isn't flawless by any means, a little uneven at times and perhaps a bit more for material for Sean Penn (I mean it's Sean Penn, use him right?), but the exceptional cinematography, that wonderful touch of fantasy, a fantastic soundtrack are just some of the standouts of this charming comedy/drama.\r This film and Ben Stiller in particular deserve a lot more credit than the meagre 54 metascore suggest. Definitely worth watching."
    },
    {
      "rating": "9",
      "text": "A beautiful movie, I love it visually.\rBen Stiller it's amazing on it, Kristen Wiig, Adam Scott, Patton Oswalt and Sean Penn did a lot with little screen time."
    },
    {
      "rating": "10",
      "text": "The Secret Life of Walter Mitty is one of those rare movies that just has to be experienced. It speaks to the inner escapist in all of us and works on the most profound of levels. An absolute must-see."
    },
    {
      "rating": "10",
      "text": "There REALLY needs to be an inspirational/life category for films, such as these. This is the perfect example of inspiration and really makes you think about life and the world you're in."
    },
    {
      "rating": "7",
      "text": "An uplifting, feel good film that stays true to the themes of James Thurber's iconic short story. Some really great camera work, audio mixing, and Ben Stiller's performance really sell this one. You'll walk out of the theater with a smile on your face, and inspiration for your own life."
    },
    {
      "rating": "10",
      "text": "I honestly CANNOT understand this movie's criminally low metascore. This movie is visually and musically stunning and utterly amazing. The plot is interesting and the main character's day-dreams keep the movie fresh. Of course, it is at times a little crazy and weird, but this is on purpose and it never hurts the movie for me. The movie is moving and funny, with some unforgettable lines and moments. Ben Stiller gives an amazing performance as the main character. I have seen this movie 4 times, and it is an amazing experience every time."
    },
    {
      "rating": "10",
      "text": "i dont understand, 54! and this isnt me just being a butt hurt fan of the film. its a great film ive watched it many thimes with many different people, no one didnt like it, and im still not bored of it! this film does so much well, the inital charecter of walter is brilliant. as the the film goes on we see walter change and become more brave and adverturous. its a amazing film and i love it."
    },
    {
      "rating": "10",
      "text": "This is gold. I can't explain what is this movie for me. The colors, the dreams, the sunset, the music.. Masterpiece."
    },
    {
      "rating": "7",
      "text": "The Secret Life of Walter Mitty is a sweet and well-meaning movie whose intent is to inspire and uplift its audience, but it approaches its message with all the subtlety of a sugar rush. It has many entertaining and endearing moments even if it never quite comes together as a fully satisfying whole. Most of its problems are on paper where no gloriously shot vista or Arcade Fire music cue can help. Still, The Secret Life of Walter Mitty's a decent escape from your daily routine. It's just not a great escape. Ben Stiller directs and stars in the heartfelt, but superficial fantasy-dramedy The Secret Life of Walter Mitty, which wants to say big things about life but never fully delivers on all its promise."
    },
    {
      "rating": "9",
      "text": "I usually respect critics' opinions, but I just don't know what they were thinking when they gave bad reviews to this amazing movie.\r GORGEOUS cinematography, superb directing.  Possibly Stiller's best performance ever.  My favorite movie of the year so far.  Don't see how anybody couldn't fall in love with it."
    },
    {
      "rating": "8",
      "text": "One really has to wonder what the reviewers are really thinking.  We looked over the family movie list and barely decided to go to this one based on lackluster reviews.  Six out of six of us REALLY liked it and found it deep, entertaining, and easy to watch.  By all means, if you are looking to enjoy a movie, go see this one.\r If you are looking for a connection to the original story, the connection happens during the first 45 minutes and then seems to go in its own direction.  Big deal.  The movie moves through characters development, plot lines, and geographies smoothly, and does not reveal its final hand until the end."
    },
    {
      "rating": "4",
      "text": "I had high hopes for this movie, but, ultimately, it was very disappointing. I kept waiting for something to affect me emotionally, but it never happened. Some beautiful scenery was filmed."
    },
    {
      "rating": "10",
      "text": "The best movie I've seen in a long time. It does a fantastic job of having a deep, meaningful message, while not coming off as overly pretentious. Walter Mitty is the most relatable character I've seen in recent films. Through the first act where he imagines what life could be, to the last act, you're rooting for walter the entire way. Besides Catching Fire, this is the best movie in theaters at the moment, and, in my opinion, one of Stiller's best works."
    },
    {
      "rating": "10",
      "text": "Amazing movie. Best I've seen all year. (Sorry Gravity...)\rDeep but light-hearted. It shows us a lot of what this world is becoming and makes you rethink your life."
    },
    {
      "rating": "5",
      "text": "The Secret Life of Walter Mitty is not a bad movie; however, its faults are quite jarring. Ben Stiller leads the film and he doesn't do a very nice job of it. He does not shine and he doesn't behind the camera as well. Kristen Wiig, Shirley Maclaine, and Patton Oswalt are the bright spots of the film as well as its beautiful cinematography. The ending is quite nice but most event sin the film are nothing spectacular or even good. Walter Mitty doesn't show the effort that apparently was involved. The Secret Life of Walter Mitty is 46% of a good movie."
    },
    {
      "rating": "8",
      "text": "The Secret Life of Walter Mitty es una épica aventura que juega con los sueños de las personas imaginativas que realmente funciona; Ben Stiller ha dirigido una de las mejores películas de aventuras del año, seguramente la inocencia de la película cautivará a una audiencia más joven y espero que así sea para que no se pierdan la oportunidad de ver esta asombrosa y divertida película. El reparto esta bien desarrollado, una historia original y divertida, y muchas risas sanas para disfrutar en familia. Buena película."
    },
    {
      "rating": "5",
      "text": "Forget the original short story: This has been hijacked by Ben Stiller's ego (he also directed) into a confused commercial mess. He plays a mild-mannered worker at LIFE magazine, who lapses into heroic daydreams. After a threatening job event and the urging of a woman (Kristen Wiig in her blandest role yet) he's inspired to go on a real adventure that takes him to Greenland and Afghanistan. The plot abounds with illogical moments, heavy-handed characters, loose ends and embarrassing product placement. There's nothing particularly imaginative here, although some of the scenery is pretty. Stiller lacks the acting chops or directing skills to give this silly fantasy any true heart or vision."
    },
    {
      "rating": "10",
      "text": "I don't get all this criticism ,\r I was entertainment, the whole movie through, it was well-written and great acting. The landscapes and the effect was fantastic.\r and I could not stop laughing some times.. So I gave the movie full house, and it's rare that I give a movie full house (10 ratings) It was just a beautiful movie, the songs that were playing gave me goosebumps. And I fell so warm in my heart when watching this movie, there were no people that hated each other. Only positive people, who helped the people who got lost in their journey.\r It is a worth a watch.!"
    },
    {
      "rating": "2",
      "text": "I wanted so much to like this movie as Ben Stiller is one of my favorite actors.  Having said that this is one boring film that is going nowhere from ten minutes into the film.  Danny Kaye makes this Mitty look very bad.  I can't believe that no one stood up to Ben as he was directing to tell him how awful this flick is.  Avoid at all costs."
    }
  ],
  "recommendations": [
    "eddie_the_eagle",
    "eternal_sunshine_of_the_spotless_mind",
    "joy",
    "groundhog_day",
    "good_will_hunting",
    "the_upside",
    "me_before_you",
    "cinderella_man",
    "scent_of_a_woman",
    "manchester_by_the_sea",
    "blue_valentine",
    "chef",
    "the_king_of_staten_island",
    "the_intern",
    "the_royal_tenenbaums",
    "paddington_2",
    "a_beautiful_day_in_the_neighborhood",
    "the_blind_side",
    "rush",
    "about_time",
    "her",
    "collateral_beauty",
    "eternals",
    "the_longest_ride",
    "marriage_story"
  ]
}