{
  "id": 2525,
  "title": "The Strangers",
  "starring": [
    "Liv Tyler",
    "Scott Speedman"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "After returning from a wedding reception, a couple staying in an isolated vacation house receive a knock on the door in the mid-hours of the night. What ensues is a violent invasion by three strangers, their faces hidden behind masks. The couple find themselves in a violent struggle, in which they go beyond what either of them thought capable in order to survive.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9zsA2xafNMA8BQmpQLdppLIGYAE.jpg",
  "categories": {
    "plot": 2.75,
    "acting": 3.0,
    "ending": 2.2666666666666666,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 1.2,
    "funny": 1.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Despite what the critics say. I found this film to be a great textbook example of what horror movies should be like. Many people have a problem with the plot. But I think that this was a much more accurate example of what evil is. When they ask why are you doing this and the girl replies (\"because you were home\") That's one of the best and most accurate portrayal of what evil is."
    },
    {
      "rating": "8",
      "text": "\"The Strangers\" é um thriller bem feito que não depende de sangue e de outras coisas nojentas. Em geral, o filme confia numa atmosfera assustadora e no suspense de tirar o fôlego. Película muito boa! 8/10"
    },
    {
      "rating": "3",
      "text": "The concept was poorly executed. Had the protagonists displayed logic, rather than floundering around, their plight might have been much more convincing. As it is, with all the crawling around on the ground, leaving the woman alone, etc., the protagonists just seem stupid, one irrational move after another. No wonder she didn't want to marry him."
    },
    {
      "rating": "8",
      "text": "Well photographed and acted, there was a very organic feel that brought it close to you, I was more frightened and emotionally invested than usual, by a ways.  Not too long, that was nice."
    },
    {
      "rating": "2",
      "text": "Horrible movie. Laughed throughout it."
    },
    {
      "rating": "1",
      "text": "This must be the worst movie I've seen this year. You can't really say anything about the acting because there wasnt much acting at all. The only person I give props to for this movie was whoever came up with the music, that was the only thing that made it the least bit scary. I can safely say I will not recommend this movie to anyone ever! I waited for a while to see this movie and went right after school the day it came out to see it and I was truly disappointed. Lets be a little more creative people!"
    },
    {
      "rating": "1",
      "text": "This movie was one of the worst horror films I've seen in a while. I was expecting there to be a twist at the end or at least for there to be a good motive for the \"invaders\". Liv Tyler and Scott Speedman make some very stupid choices while trying to survive."
    },
    {
      "rating": "1",
      "text": "Crushing bore of a movie. An ultimately boring, by-the-numbers screaming cliche. What a waste of my money and time."
    },
    {
      "rating": "1",
      "text": "This film is not worth the hype I was really looking forward to it went to watch it on day of release only to be very disappointed. I really would not waste my time it is just a loud noise."
    },
    {
      "rating": "0",
      "text": "I had a free pass to see this movie and I still walked out of the theater. Don't go see it. Bad acting. Bad writing. Bad direction. Just an awful movie and I love horror movies!"
    },
    {
      "rating": "1",
      "text": "This movie looked so good, what happened? The plot went ABSOLUTELY no-where at all. Same thing is happening the whole movie and all you can think is \"Run\". Simple doing, or is it not? Acting was really good though. The director didn't really finish the movie. Made it seem like he didn't have an ending when he finished this load of crap. Don't waste your time."
    },
    {
      "rating": "1",
      "text": "The characters were so lame that I started rooting for the killers. How stupid does someone have to be not to bother to put shoes on before running out of the house?"
    },
    {
      "rating": "0",
      "text": "Nothing happens, a complete waste of time. If you are scared by this you are a wimp and shouldn't vote on horror reviews."
    },
    {
      "rating": "2",
      "text": "It is spooky at times, and is often well shot, but the plot is completely unbelievable -- it makes no sense. It strains credibility from the get-go. It angered me. The characters -- including the killers -- are cardboard, careless, not personable, not smart. Ultimately the movie ends up being about nothing. Just sadism for sadism's sake. Which is made worse by the fact that I never even felt anything for the doomed couple at the mercy of the masked knife-wielders. Liv Tyler's character is insulting to women. She was fey, fearful, senseless, useless, and probably deserved what she got in the end. The first-time director should certainly NOT be given another chance anytime soon. He needs a writing class, and he needs to learn how to work with actors. Waste of time, waste of money."
    },
    {
      "rating": "3",
      "text": "Good actining, a bit scary and jumpy but as a movie I didn't do it for me and forget about the ending which was atrocious. If it had a good ending or one that made sense at least then this would've been a decent film but other than it not being realistic to me and having such a disappointing ending I will have to advise others to skip this until it hits dvd."
    },
    {
      "rating": "1",
      "text": "Horrible, Horrible Horrible, Liv Tyler played a horrible role, the strangers identities were never revealed and the plot was horrendous... yawn."
    },
    {
      "rating": "1",
      "text": "Stupid! Stupid! Stupid! I tried to suspend my disbelief about twenty times! But the absurdities that were displayed in this waste of time movie would not allow it. I like a good horror flick but this movie failed at the genre. The girl was so helpless and pathetic for not trying to fight back. She acted like a 7 year old, hiding under the bed -- after watching her do that, I quit caring for her. A waste of time!!! 99.999999% of Americans would have fought the intruders with much more vigor. Most people would have tried to find weapons and gone on the offensive. But not these idiots! A horrible movie!"
    },
    {
      "rating": "0",
      "text": "I have seen a lot of films in my time but this was the worst film i have ever seen in my life i feel like ringing up the people who made this film and asking them for 85 minutes of my life back i feel truely ripped off."
    },
    {
      "rating": "1",
      "text": "I'll give this a 1 for technique, but I don't watch movies for techniques so it really gets a 0. All they had to do was connect some dots. This movie was made for a non-thinker and that offended my intellect. It really sucked ass."
    },
    {
      "rating": "2",
      "text": "The storyline is contrived. Events don't happen out of any inner logic in the story or characters, but just because the director wants them to happen. Many of the scenes are telegraphed so there is very little real fright. The main characters talk with a sliding inflection as if they were bored most of the time. Even the murderers who supposedly are doing it for the fun of it don't seem to be having any fun. At the end of the movie there is a scene with two boys walking their bikes down a hill. What kind of boys walk bikes down a hill? That's the kind of contriving that's just stupid."
    },
    {
      "rating": "0",
      "text": "Anyone out there with a higher rating than -0- is full of shit! The absolute worst movies I have seen in quite some time. I'm actually pissed about how horrible this film was.....utter waste of my time and money. I swear, if I were to ever have the chance of meeting the director, I'd pop him right in the face for putting such a piece of shit on the market. Shame on the production company for ever letting this garbage hit the market....PURE GARBAGE!"
    },
    {
      "rating": "1",
      "text": "There is no need to express it with intelectual words or in a complicated way, feeding society with such horrible sadism is just plain wrong. Also im not sure who is sicker, the killers or the moviemakers that care more abot the money they make than the effect they do with such pointless negativity. Unfortunately I have to say the director really knows how to keep suspense and scare but it wont last long, yolull eventually get bored of repetitive slow attemps of scaring you and eventually youll find stupid how these \"ninjas\" or killers trained by James bond are simply always a step ahead in an unrealistic way."
    },
    {
      "rating": "1",
      "text": "Wow, was this terrible. If you'd like to see the premise carried out well, with characters less irritating, try Ils. Or the original Funny Games. Anything but this."
    },
    {
      "rating": "2",
      "text": "HORRIBLE. Unrealistic, Killers had about 27 chances to kill the people but let them just crawl around before killing them. Even let them live for the night. Worst movie I've seen in years."
    },
    {
      "rating": "0",
      "text": "This movie was horrible and at the scenes that were supposed to be thrilling everyone was laughing. Terrible!"
    },
    {
      "rating": "0",
      "text": "I never felt so lousy after leaving a movie. The production isn't bad, the acting and the suspense are above average for this kind of movie. However, it is unrelenting and ultimately pointless. Uses the same horror techniques to build up suspense over and over, so even though the movie is relatively short it feels drawn out and tedious. Plus you know whats going to happen at every turn. I can't recommend this movie to anyone unless you feel like being mentally abused."
    },
    {
      "rating": "2",
      "text": "Every 'thrill' is telegraphed. The tormentors come and go without tormenting. There are a couple of good stills and one decent tracking shot. In fact, this clearly wasn't conceived as a 'movie' at all, but a series of set-pieces that don't build from one to the next. If you enjoy identifying the films that this one steals from, then at least you'll have something to do. A techinical exercise."
    },
    {
      "rating": "0",
      "text": "Don't bother ever watching this snooze-fest bore of a film. Halfway through the film in the theater I was dozing off. The acting is boorish, and the killers have absolutely no personality or motivation. I held an interest in where the plot would go near the end of the film, but was sorely disappointed to find out that the whole puke piece of garbage really has no resolution or redeeming moments. Don't even watch this turd if someone is offering you money to do so."
    },
    {
      "rating": "0",
      "text": "The most pointless film i have ever seen."
    },
    {
      "rating": "2",
      "text": "Why does every cameraman these days seem to have parkinson's disease? The camera is just jittery enough to be distracting and pull you out of the experience. Every \"shock\" moment in the film calls and let's you know it is coming before leaping out with a cliched \"boo.\" The pacing is abysmally slow, there is no insight into the murderer's motivations, and the suposed realism of the film is betrayed by the complete lack of character of the killers. I would be outraged by the purile senslessness of this film if it didn't leave me so bored."
    },
    {
      "rating": "1",
      "text": "Lame wanna-be pseudo-horror."
    },
    {
      "rating": "1",
      "text": "The movie was jumpy at times according to some friends (nothing gets to me) but lacked plot and wasn't scary as a whole. Characterization was awful, even for a genre known for very little dialogue. The whole concept, without giving away the extremely weak twist, was gimmicky at best and just terrible at worst. Finally, most bad horror movies make me laugh hysterically. This one somehow didn't, probably due to the production values (the reason it got a 1 instead of a zero and should qualify as a 'B' or 'C' movie rather than a 'Z' movie like Plan 9.)"
    },
    {
      "rating": "0",
      "text": "I am a TRUE Horor movie fan and I wonder where have the GOOD HOROR movies gone? This movie takes all this time to kill 2 people?! Then it never explains why they killed, who they are, or other happenings from the begining! It made no sense! Horrible Plot! I wish I can get at least one GOOD HOROR movie! ONE"
    },
    {
      "rating": "0",
      "text": "This movie is such a waste of time! It was dragged out and pointless! Everytime \"the strangers\" had an oppurtunity to kill, they let it go in an effort to boost adreneline and suspense.. in which it did neither. It is so frustrating, and the ending is complete BS. Don' waste your time watching this movie, you will be very disappointed."
    },
    {
      "rating": "0",
      "text": "Craft? so what......? mpvies are art, like it or not, and will be judged accordingly.... If you listen to a great singer singing about infanticide and incest with glee, are they judged on their singing ability? OR their content - lyrically and in content of character? the latter. End of story. Plenty of ppl can sing, and anyone can point a camera and say 'action'..... point is, can you produce something worthwhile, relevant, original? answer here = Nope. Thus the strangers takes a 'true story / real events\" premise and surmises, at great insult to all living relatives and the victims themselves, that the three masks found belonged to heartless, or black-hearted rather, sadistic murderers that like to psychologically torture their victims before they kill them hours later etc etc..... when there is no proof or reason for this WHATSOEVER.... Oh and could the two of you poosibly split up unnecessarily any more than you did in this clechefest? Um, sorry, but that is BS and represents the kind of heartless, insulting, sadistic behaviour literally, that they were ironically supposed to be commenting on within the movie figuratively.... How appalling and irresponsible. The likely scenario is that the 3 masks simply belonged to the three victims, that they were a love triangle or similar and something passionate and regrettable and tragic happened. So Bryan Bertino comes along and instead of making what he thought he had - some sort of sensational, original, ground-breaker like the Last House on the Left (also fairly unnecessary - and I say that as a horror afficionado who disagrees that torture porn and horror are interchangeable), Bryan has just insulted the dead, the living and anyone dumb enough to hand over cash for this pointless, self-obsessed, patronising, superfluous, waste of space, time and money. The absolutely epitome of style over substance, sprinkled in pointless sadism.... If I was a serial killer, I would masturbate in front of this film.... why not? Seems perfect...... A little bit of snuff for the masses eh Bryan? Shame on you f***ing idiots. You have damned a generation with your propoganda and BS. Have a frikkin' heart FGS - this movie achieves precisely NOTHING. Also many of the reviewers above are clearly not well-versed in horror, as the movie was predictable, crammed with cliche and an empty, vacuous exercise in the monotony of unceasing disrespect and cynicism..... NOT - \"invested brilliantly in silence\"... lol... that's the philosophical semantics of a frikkin' amateur. Change your profession or narrow your movie genres for review - you're not up to it sonny.... Time to move on chump."
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,°°°°°°°°°°°°°°°°°°°°°°°•••••"
    },
    {
      "rating": "8",
      "text": "Devo admitir que fiquei bastante impressionado com este filme. \"The Strangers\" é um thriller bem feito que não depende de sangue (\"gore\") e de coisas que te assustam. O filme simplesmente confia numa atmosfera assustadora e no suspense. Eu sugiro este filme intensamente."
    },
    {
      "rating": "8",
      "text": "Having heard countless recommendations from other people, I finally decided to watch this movie, and I'm now glad I did. It's a very simple home invasion movie with nothing really fancy or revolutionary about it, other than it being scary as hell. Throughout it's relatively short running time, this movie relies on ratcheting up the tension as we see shadows of faces and blurry masks in the darkness of the house until hitting well-executed jump scares, and the jump scares aren't cheap at all. Each one is well deserved because of the mounting suspense built up in the past few minutes. There's very little dialogue throughout the film, which allows minimal distractions when we're waiting to pee our pants in fear. I can't talk about this without mentioning some obvious flaws. The characters make some stupid decisions, and there are many points throughout the film where the invaders lead me to believe that they can teleport. Nevertheless, The Strangers is a very scary and thrilling little movie."
    },
    {
      "rating": "9",
      "text": "I must admit I was rather surprised with this movie. I went into it expecting some B-grade slasher, but I couldn't of been further from the truth. The strangers is a well made thriller/horror that dosen't rely on gore and things jumpong out at you for scares. It simpily relies on a creepy atmoshphere and and suspence. I suggest this movie very strongly."
    },
    {
      "rating": "9",
      "text": "It's a first-rate suspense show, that scares us not because it shocks us, but because it lurks in the shadows slyly knowing we're expecting it to jump out. But it doesn't. It just leaves us hanging- and it's all the more satisfying because of it."
    },
    {
      "rating": "8",
      "text": "Believe it or not, The Strangers is exceptional. Sure you can say, The Exorcist, Nightmare on Elm Street, and Scream are amazing horror films. They are, but do they ever manage to tap into the realistic fears of the human mind. No. The Strangers does by taking the most simplistic (and realistic) fears of the human mind and combines them into a film that will most likely cause nightmares. A remote getaway, night hours, and three masked killers that our protagonists can never really get a grip on. The film has very brief moments of cliche's (For Example: The use of the film tactic \"One second there, the next second gone\") but can we fault them on that? Of course you can but should you? No film can be perfect, and The Strangers knows that, working with what it has handed to them. Some will hate the film, particularly It's choice of finale, which I was never to fond of myself, but accepted nonetheless. The Strangers is horrifying with the most simplistic elements, and that's what scares us most."
    },
    {
      "rating": "7",
      "text": "The strangers is a creepy story, based on actual events. This isn't your typical horror movie. It moves a lot slower and lacks the cursing and gore, but what it is, is methodical and truly scary. I have so many questions I'd like to ask, but can't do it without spoilers. This movie will make you jump, make you scream, and make you think, and that's what makes it special and worth seeing."
    },
    {
      "rating": "4",
      "text": "I really wish I could back every minute of this 90 minute movie, it was probably one of the worst horror movies I have seen! And I have seen some bad ones. It starts off with yawns, and jump scares afterwards. The movie states at the beginning that it is based on true events... Any serial killer could have done this, really. With all the stuff we see on the news nowadays. Horror movies are usually the movies that get the worst entries which is sad since some of them could have been so much better with their potential. This one seems so uninspired and slacked. Even the biggest of horror fans won't find anything in this movie, and I'd know because I am a horror fan. So do yourself a favor. Don't watch it."
    },
    {
      "rating": "9",
      "text": "Terrifying! It's about time a genuine good horror movie is released and this is it. The stillness and terror of this movie scares the hell out of most people including me. The motivation of the killers is what probabaly what scared me the most \"because you are home\"."
    },
    {
      "rating": "5",
      "text": "Even though i didnt like this movie the strangers really made this movie have hope. I really dont like horror movies (except the saw movies which are the best) but the strangers was a ok movie i recommend it"
    },
    {
      "rating": "5",
      "text": "Despite a seemingly strong lead from Liv Tyler, there is little else than filler. The Strangers goes for tired and predictable scares amidst a promising premise."
    },
    {
      "rating": "6",
      "text": "'The Strangers' is quick to deliver the scares and intensity that is vital in a good horror film but it lacks logic and innovation. Yet in saying this the film still keeps it interesting with its raw edge and psychological build; so basically its not like the other run-of-the-mill home invasion horror's, but its not the best of them either"
    },
    {
      "rating": "0",
      "text": "7.9? What!? This movie was one of the worst, i have ever seen! It wasn't scary even a bit! The best definition for it is - pathetic and horrible! I just wanna see the people who made it and punch them in the f123in face! Boring, empty, full of cliches, stupid and overall A WASTE OF TIME!"
    },
    {
      "rating": "6",
      "text": "This film plays with one of the biggest real life scares of being alone in your house terrorized by strangers, especially with the whole \"this film is being taken from real life events\" line included at the beginning.\rWhat i felt the strangers does well making us care about the main characters. This isnt a simple horror movie with multiple characters and huge body counts of people we don't care about.\rThere's some bone chilling moments early on but the films looses most of its magic once \"the strangers\" start their full scale attack.\rThe two lead characters must be some of the most dumb people i've ever watched in a horror movie. I was taken aback many times by some of their idiotic behavior, so much so that i wasn't sure if i was watching a parody. Every sane thing you would do, they decide to do the opposite.\rThe ending may not be to everyone's taste, but i personally liked it and id be lying if i said i didn't want to watch the squeal."
    },
    {
      "rating": "4",
      "text": "The Strangers was a movie I was eager to see. It looked like a film that could possibly be  a flag carrier for modern horror movies. Sadly it was just more of the same old same old. You have to wait and wait in order to see who the villain is, there was really no peak or climax to the story. Although I did get scared 2 or 3 times earlier in the movie the plot sort of dried out after the first 45 minutes. Also in the end all the questions you are expecting to have answered slip through the cracks and no more is said about them. Liv Tyler and Scott Speedman are veterans who I would expect more from in a horror film but in the end they are just trying to play the stupid teenagers who all get killed in slasher movies. The Strangers is simply nothing special."
    }
  ]
}