{"id": 2899, "title": "The Theory of Everything", "starring": ["Eddie Redmayne", "Felicity Jones"], "runtime": 123, "genre": ["Drama", "Romance"], "description": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wucOQrqihOtHToP7UAPKMFRJ9LL.jpg", "categories": {"plot": 7.382978723404255, "acting": 6.931506849315069, "ending": 5.2727272727272725, "soundtrack": 9.0, "cinematography": 8.666666666666666, "familyFriendly": 5.8, "funny": 7.833333333333333, "action": 7.0}, "reviews": [{"rating": "4", "text": "It's curious how a film about a man who wrote his graduate thesis on time manages to treat time with such disregard--Marsh flutters through this man's extraordinary life with utter disregard for cause & effect, showing us the end results of a number of events in Hawking's life without showing us how he got there or what it means to him when he does. Surely the central romance is important to his work, but it's a shame Marsh isn't able make the connection in a more intriguing way.\r And enough with the glow effect on the lens. ENOUGH."}, {"rating": "6", "text": "\"The Theory of Everything\" tells the story of acclaimed professor Steven Hawking and his relationship between his wife Jane as she helps him fight through his illness till the very end. Although well crafted with some memorable scenes here and there, I did find the movie to lack the love chemistry between the main characters; I mean, isn't this the kind of romance movie you'd watch with your girlfriend? If so, get ready to get bored out of your mind."}, {"rating": "5", "text": "A terrific performance by Redmayne in a decent movie. But this movie just feels too neatly tied and a bit too angelic. Everyone in this movie is so perfect. There are no character flaws whatsoever. Even when Stephen and Jane separated, Jane just fell on her knees and said \"I'm sorry I wasn't of better service to you. I did my best\". That's just manipulative and mawkish beyond belief. It was an insult to the audiences' intelligence. But that being said, the movie does balance Stephen Hawking's marriage, his illness and his work very well.﻿ But it's disappointing to see this film following the quintessential trite, mundane and conventional biopic formula, given that it's about a truly unconventional and exceptional man."}, {"rating": "5", "text": "Apart from excellent acting performances (and I daresay Felicity Jones's one is better than Eddie Redmayne's), The Theory of Everything does nothing to pull the audience into a subtler, less clichéd story. Those of you who expected science can stop watching immediately - unfortunately, the love story that is the substitute central plot element is not interesting enough to draw the attention of romantic-movie fans.\r The Theory of Everything makes Hawking's disabilities basically the only thing worth mentioning, flying over his achievements and even his general way of picturing the world - and rather focusing on his wife and his love story, despite the lack of the amount of drama this would require to be effective.\r In general, a clumsily edited picture with no pretenses and presented as an unfortunate series of clichés about scientists, handicap and extramarital relationships, in this order."}, {"rating": "9", "text": "The Theory of Everything es una película encantadora que logra encontrar exitosamente la ecuación correcta.\r Esta película sobre la historia del matemático Stephen Hawking es un film que resulta bastante agradable, y logra abarcar en buena forma la parte romántica y la parte instructiva. Además, su banda sonora es totalmente increíble, dando un toque más sentimental y encajando bien con la trama de este largometraje inteligente, entrañable y con una ecuación que resulta correcta."}, {"rating": "8", "text": "the film is excellent and well deserving of all it's oscar nominations particularly Eddie Redmayne's win for best actor. his performance as Stephen Hawking is one unbelievably good and felicity jones is his perfect counterpart and their on screen chemistry is very well done.the witting and direction are also exceptional delivering stephen Hawking's life in a way that's very accessible to a wide ranging audience. my only complaint if i had to nitpick is that I personally feel it goes on slightly too long and that 10-20 minutes of the film could have been cut despite it's excellent early pacing."}, {"rating": "10", "text": "A beautiful and emotional drama about one of the most brillant people. Eddie Redmayne deserved the Oscar for this portrayal of Stephen Hawking. Music is also beautiful and the whole movie is a pure 10 in my opinion. And yes, buy The Brief History of Time if you haven't already. ;)"}, {"rating": "5", "text": "First things first: if you watch this movie expecting the focus to be on Stephen Hawking and his work - like I did - then you will likely be greatly disappointed (like I was).\rSo much screen time is spent upon his then-wife, Jane, and their relationship that, on the few occasions that we actually see him presenting his theories, you feel completely disconnected from those accomplishments because absolutely none of the work behind them is portrayed on-screen. So we end up with a few odd scenes (amongst all the love-stuff) where Stephen speaks to a room full of people about his theories and then everyone stands up and starts applauding him and how brilliant he is. But, for the unintelligent people in the cinema like me who don't have a clue what he's on about because the movie doesn't provide a single iota of the background work or thoughts then went into these theories, you're left feeling like he may as well have said 'Blah, blah, blah, blah, blah'. And everyone still would have stood up and cheered, because the Movie Director needed a few uplifting moments.\rAnd, boy, does it need those uplifting scenes in amongst the grey, depressing story of a man diagnosed with Motor Neurone Disease. Yes, Stephen Hawking has accomplished a great deal in his lifetime so far but so much of this movie focuses on the struggles of his wife, Jane, to cope with looking after him as his condition worsens that the film ends up feeling more informative than entertaining (and what do we go to the cinema/movie theatre for if not to be entertained?)\rMy other issue with the movie is that, especially when you find out that it's based on a book by Jane, it feels distinctly like it glosses over the foibles of his then-wife and yet highlights the flaws of others. Her being unfaithful garners five seconds of screen time but when Elaine (Maxine Peake) shows up later in the movie to help Stephen, she's portrayed as something like a naughty nurse from a 'Carry On' movie who tries (in several scenes) to undermine Jane. It's these things that - especially when considering whose book this movie is based upon - make it feel like it may be a slightly biased version of events.\rHowever, there are positives about the movie that need to be highlighted. There are some greatly funny moments and these are often provided by Stephen's university room-mate Brian (played wonderfully by Harry Lloyd). He brings some much-needed laughter to a sometimes otherwise dreary movie.\rOf course, the main highlight of the film is the performance of Eddie Redmayne as Stephen Hawking. As I write this review, he is Oscar-nominated for it and I would be shocked if he does not win the award. Without such an outstanding job by the leading actor, I feel that 'The Theory of Everything' would have fallen completely flat but his outstanding performance is absolutely spot on.\rOverall, if you're interested in Stephen Hawking then - by all means - you may find 'The Theory of Everything' worth watching. Otherwise, there's not much to be gained here other than seeing a tired, generic love story in a different setting."}, {"rating": "4", "text": "What orbits around Redmayne’s stellar performance sucks the air out of this Hawking’s biopic. Hairdos change, couples swap, time passes- but nothing happens. Until a touching two minute reverse recap at the very end.  Even if love is the answer- the question remains- why is this movie relatively mediocre."}, {"rating": "7", "text": "The Theory of Everything is basically a very conventional love story at its core. Based on the memoir by Jane Hawking it is at first surprising to find how much the screenplay concentrates on her. It is to the credit of Felicity Jones that she becomes the film’s ace card. She truly shines here as Jane and it is almost totally due to her subtly understated performance that the story’s emotions feel honest and not overly manipulated. Eddie Redmayne is also very good, especially with the physicality the role demands, but surprisingly his role seems somewhat underwritten. The screenplay pays scant attention to his professional achievements concentrating instead on his disability and the challenges this posed to the couple’s marriage. Anyone not knowing anything about Stephen Hawking going in to this film would be hard pressed to understand the reverence in which he is held, the tragedy of his physical battles notwithstanding. Ironically, criticism levelled at 'The Imitation Game' and the lack of personal details about Alan Turing's personal life would be more pertinently aimed here at Hawking's professional one.  Montages are adopted to delineate time lines to mixed success, but probably the biggest indication of the film’s failure is due to the fact that one is more interested in the love story between Jane and Jonathan than in the one between Jane and Stephen."}, {"rating": "10", "text": "Being a fan of Hawking myself, I was impressed by James Marsh's Hawking flick, with great acting and brilliant screenplay, although some information was a little inaccurate, it is still the only Stephen Hawking film that I have ever seen, so I didn't know what to expect."}, {"rating": "7", "text": "Great acting in a good movie: Eddie Redmayne and Felicity Jones are terrific.  The Theory of Everything is at its best when Stephen Hawking comes down with ALS.  Redmayne's portrayal of Hawking's mighty physical struggle is remarkable.  The chemistry between the two stars is believable and the movie does a very nice job of recreating Cambridge in the early 1960's.  Much of the script is first-rate, but the quick and almost breezy treatment or their marital breakup is unfortunate."}, {"rating": "10", "text": "The Theory of Everything is an intelligent biographical dramady about the life of Stephen and Jane Hawking depicting the struggles and accomplishments they faced together. Everything from the production design and costumes to the cinematography and editing helped accent the emotional struggle of the characters. With Oscar-worthy performances by Redmayne and Jones and brilliant direction by James Marsh the audience is taken on a charmingly humorous and emotional ride through the life of the Hawkings.\r I was a bit disappointed with the story in two aspects. Firstly, I believe that the film was subjected to some restricted narrative construction to appease the still living subjects of the film. In biographies of deceased people the filmmakers tend to push the boundaries and add a bit of controversy or increased tension. If Marsh was going for a more biographical, documentary film than a biographical drama, then he certainly succeeded. However, I feel even with the restrictions that this film delivered. Secondly, I was not pleased with the lack of science in the film. This film is about Stephen Hawking, one of the greatest minds to ever walk this Earth, and yet we are more interested in his personal life? Yes the film is a recount of Stephen's life through the eyes of his ex-wife Jane, but being the only film about Stephen Hawking they could have at least explained some of the interesting theories and research he worked on throughout his life.\r Regardless this film delivers a brilliantly charming biopic about a man whose dynamism was hidden by his overachieving mind. Although Stephen is the star of the film, the true star of the story is Jane whose strength and dedication to Stephen helped bring us The Theory of Everything. His mind changed our world, her love changed his."}, {"rating": "10", "text": "A beautiful movie that revolves around Eddie Redmayne's astonishing performance as Stephen Hawking. When he's younger and healthier, you can see hints of the severely handicapped man he will become ... yet when he's older and frailer, you can still see the wry humor of the college-age wunderkind he was. Some reviewers seem to feel cheated that they didn't get a good enough physics lesson from the film. But I came away convinced that it was that wry, full-of-life humor, portrayed with subtle brilliance, that must have enabled Hawking to survive and achieve so many decades longer than anyone had thought possible."}, {"rating": "4", "text": "I'd never recommend this movie. I'd read that the emphasis would be on Hawking's school life and his romance with his first wife. Unfortunately, that only comprises the first half of the film. The second half is entirely too slow. The sequences of Hawking struggling to pull himself up his staircase - looking at his son at the top of the stairs - mirrored many of the people in our theater struggling to get to the end of this film. Sure, Redmayne is awesome, but when he gets into his \"My Left Foot\" mode, that's no longer acting, in my opinion. I'd much rather award an actor for subtle, true moments - not pretending like he or she is physically disabled. Seems far too easy. Pandering. The movie simply needs editing. And I would have loved to hear more about the Quantum Physics vs. Astro Physics relationship that they merely touch upon."}, {"rating": "7", "text": "\"Theory of Everything\" is, as most people know, the story of Stephen Hawking and his adult life-long battle with a motor deficiency disease (ALS). It is also the story of self-sacrifice and dedication as told through the eyes of his wife of 25 years, Jane, who, together with Anthony McClaren, co authored the screenplay based on her book \"My Life With Stephen\". The film was directed by James Marsh and stars Eddie Redmayne and Felicity Jones. One must approach this film as both a factual summary of the trials and efforts of a genius confined to the prison of his voiceless and motionless body and, also, as an entertainment vehicle. For the former the film serves its purpose well and is made even more believable by Mr. Redmayne’s remarkable likeness to Mr. Hawkng  and the performances given by both he and Ms. Jones.  As to the latter, the film is certainly not \"entertaining\" in the true sense of the word but represents one of those \"should see\" see films because of its biographical data and the efforts of its two stars. This is indeed a difficult film to rate for much depends on the needs and desires of the viewer and whether he or she considers watching Mr. Redmayne’s character struggle with a catastrophic disability for over 2 hours worth the effort. My experience of the film may well have been affected by the fact that I saw a PBS documentary with the real life Hawkings a few days earlier. That being said, I give the film  a 7 rating because it basically is locked to the actual story of the subjects with little or no poetic license or interest creating insertions.. Remember, though, as with  \"My Left Foot\",also a fairly difficult film to watch, it did earn Danel Day Lewis an Oscar and I wouldn’t be surprised if the same fate awaited Mr. Redmayne."}, {"rating": "1", "text": "what a piece of crap....i hated this formulaic stupid movie....it was the 'oh my love conquers all' garbage we've seen a million times and then love doesn't conquer all...maybe if they actually made a movie about the dillemma of that real circumstance rather than this inspirational bull hogwash....it ends up not even being inspirational....they don't end up together people....so why this 'ain't love grand....can't it move mountains'....real life set in and love left town...this is a sappy afterschool special only admired because of it's veddy english connection and all that royal academy theatuh tripe and shakespeare babies.....they still have a queen, people...no power ...but they still have one......and the acting does nothing new...nothing fresh....it is nothing more than a boring film with english accents, so of course the academy rewards it because they are pretentious morons who buy into the myth that only the english are true actors....that is not to say there aren't amazing brittish film....28 days later....the long good friday....gregory's girl....educating rita.....billy elliot....billy liar....this sporting life....anything by mike leigh....any monty python.....time bandits.....brazil....trainspotting....anything kubrick....saturday night and sunday morning....don't look now....sammy and rosie.....my beautiful laundrette......hunger.....and so very many more....if redmayne wins it's the academy rewarding the disease and why is jones even in here....so so acting at best....a terrible move....birdman deserves everything....."}, {"rating": "1", "text": "Not been this bored by a movie since watching the Expendables and vowing never to watch one of the sequels. Eddie Redmayne is the most wooden actor I have ever seen, from the Pillars of the Earth to Les Miserables his habit of staring off into the near distance, blatantly reading autocue and lack of emotion means that his playing of Stephen Hawking must not receive the Oscar. Why, because he isn't acting!!!! Also, the blatant use of Americanisms to sell it to the US. In the UK it is Leg or Breast, not light meat or dark meat. Also it is Motor Neurone Disease in the UK and ALS in the US, until Ice Bucket no-one here would have referred to Lou Gehrigs Disease and certainly not in 1963."}, {"rating": "6", "text": "As a made for TV biopic it would be passable but as a movie it's insistence on pursuing a pastel course makes it tame stuff indeed. Redmayne does yeoman work with the physicality, but has little else to do. Is there a personality under that shell? Or just a brain. Far too much is left for the imagining, almost as if getting deeper into the reality of Hawking's life would detract from the hagiography."}, {"rating": "8", "text": "The Theory of Everything tells for the first time the story of Stephen Hawking and its surprising that nobody came up with this idea before. What makes the movie more interesting is the way of approaching his life, not focused in one aspect, it shows the scientific part, the family part and the illness part. The first one is very impressive, starting by the epiphanies that he experiences, how he developed his theories and how he breaks with current knowledge. The family part gives us a more human image of this genius and his relationship with his wife Jane. And finally, the illness and how the couple deals with it is very well achieved. These last two are unknown for the viewer and James Marsh is not afraid to show the most dramatic episodes making it a heartbreaking story but always realistic. This whole thing goes hand by hand with a breathtaking performances of Eddie Redmayne, it is unbelievable what he has created and Felicity Jones is perfect in her role. Then we have the script, the score (so captivating that distracted me from the movie several times) and the work with the cameras; all very coherent with the protagonist obsession: time, and its sublimation in that magnificent sequence at the end."}, {"rating": "10", "text": "Some people are resisting this film because they fear it is more about a disease than a man.  Somehow this extraordinary film avoids this; instead of Hawking's suffering, you see his brilliance, his courage, his humor, his honesty, and oddly his normalcy.  At the end  of the film, I felt not that I'd seen the story of a hero or a victim but of a man--lucky to have a superior mind, unlucky to have a stricken body.  Eddie Redmayne's performance is beyond praise.  He doesn't rely on a contorted body or slurred speech; his eyes tell the story of his ambition, wit, and brilliance.  Bravo to all--especially to him."}, {"rating": "7", "text": "Good movie, did not expect this emotional rollercoaster.\rI'm a fan on science (whether fiction or non-fiction) and there's not much theory in here, just barely whetting an appetite for knowledge.\rInitial reaction is to feel empathy or sympathy for Hawking, but later you realize he's persevering, well past anyone's expectations (even his own, with the help of his wife).\rGreat biopic of a genius among us, portraying the real struggles we all can relate to.\rIn summary, good date movie, see it in theaters if nothing else is available, otherwise wait for it on Redbox or rental."}, {"rating": "8", "text": "This is how Eddie Redmayne won the academy award for best actor. It helps to have such a specific character to portray but he is superb.\r Y así fue como Eddie Redmayne ganó el Oscar al mejor actor. Ayuda tener un personaje tan específico que interpretar, pero su actuación realmente es soberbia."}, {"rating": "10", "text": "A magnificent film, with astonishing performances from  Eddie Redmayne and Felicity Jones. The story of a complex man overcoming enormous difficulty to excel in his field. No guns, no military murderers, no American navel-gazing, no blood on the drum kit, so it probably won't win an Oscar; nonetheless this is easily the best film of the year."}, {"rating": "8", "text": "The Theory of Everything is a very emotional movie. It'll make you be sometimes happy and sometimes sad, as it's revealed in front of your eyes the incredible life of Stephen Hawking, and the especial relationship that he had with his partner Jane Wilde. All the performances in the film are incredibly astonishing, especially by Eddie Redmayne, being by far the best performance in his career, and one of the best performances of the year. The script captures perfectly the emotional essence of Stephen Hawking's life, making you never feel bored (if you like drama, romance movies). It's also really nice how it's filmed in this classical British kind of format. It really helps to capture the essence.\rOn the bad side, the movie doesn't has that much science as I would expect it to have for being Stephen Hawking's life. It obviously has some, but there's not much protagonism from physics in it, and that's sad.\rReal score: 8.5"}, {"rating": "10", "text": "Critics should be aware that this is not a biopic of Hawking's work, it's an ADAPTATION of the book Jane Wilde wrote about her marriage to Stephen. Stop saying that this movie should be about science."}, {"rating": "9", "text": "great movie\rthe most beautiful part of this movie is the ease with which hawking answers his life ,in my opinion that is the most original way of living ones life ,director has been successful in showing with hawking's life the true beauty of life itself.a unique piece of work , i won't say it to be inspirational as the idea it suggest me is that try to answer the problems of your life in your own unique way, originality.mesmerized by the simplicity of answers for the, so thought massively complicated questions.the only extra thing that i would have wished for would be a little more inclination towards hawking's scientific work."}, {"rating": "9", "text": "This very subtle telling of an unimaginable real-life tale is superbly executed. Eddie Redmayne's portrayal of Stephen Hawking is about as spot on as any real life biopic performance I've ever sen and Felicity Jones shines (as she has always promised to) in her role as Jane Hawking. Worthy of the Oscar buzz, you can not be disappointing with this production..."}, {"rating": "0", "text": "Contrived, poorly written, and executed by someone who clearly struggles to convey melodrama over documentaries. Redmayne's performance is greatly overrated--lower your expectations lest you be as disappointed as I. Far from the next My Left Foot, he shows greatest success in mimicry but fails to convey any consistent character beyond.  Felicity Jones is nice and works well with all the cliches, but it is pointless in this ultimately purposeless BBC-grade drama."}, {"rating": "8", "text": "Better than I expected, The Theory of Everything is not some skin-deep, superficial biopic with a good-looking actor in the central role (ahem ahem \"Jobs\", ahem ahem), but rather a fascinating account of Stephen Hawking's personal life and career, which even today in 2014 is still continuing. The film focuses on Hawking's relationship through the years with his first wife, and on his theory of black holes and how time works; this may be leaving some parts of his life out, but the man has done so much that the scope of the film suited itself. Redmayne is amazingly accurate in his portrayal of the physicist, and the rest of the cast, including Felicity Jones and David Thewlis, gave brilliant performances as well. I would not be surprised if it didn't show up at the Oscars in some form."}, {"rating": "9", "text": "I have always been one to put movies such as this on a high pedestal, and I think that Eddie Redmayne really gave a remarkable performance of Stephen Hawking. The authenticity and places that one must reach to pull off a person such as Stephen is really seen here in this movie. We get to see the journey and heartbreak that Stephen and Jane had to go through from the diagnosis of his disease to the crumbling of their marriage in a very smooth transition. I recommend this movie to anyone that has followed Stephen's work, and shares his ideas, and anyone who needs a refreshing take on a love story."}, {"rating": "10", "text": "What makes \"The Theory of Everything\" a sure Best Picture contender is it's brilliant storytelling and captivating performances by each actors/actresses. The film is played like a love letter by the way the movie danced around its tone and dialogues. The screenplay is very concise and direct; there is a clear beginning and an end. The film utilizes music effectively by allowing it to be the narrative. Sometimes just a moving picture and sound can tell a story like in Pixar's \"Up\" and Michel Hazanavicius' \"The Artist,\" simplicity is at most always better. The movie is inspiring and beautiful."}, {"rating": "0", "text": "This fairy tale like bio pic is is poorly written and emotionally manipulative with its overused cheesy score, Felicity Jones completed the film with only two facial impressions and got an oscar nomination for this , wow! Eddie Redmayne was slightly better but I don't find his performance powerful . There was absolutely no screen chemistry between redmayne and jones."}, {"rating": "9", "text": "Eddie Redmayne always has a captivating screen presence, characterized by that sparkle in his eye and his expressive mouth. Those traits still reveal themselves in his remarkable portrayal of Stephen Hawking. The film starts when he was a promising Cambridge student, where he meets the woman who became his wife (Felicity Jones, who's also wonderful). Even though he was diagnosed with ALS at age 21, they continued their relationship, as he went on to become the famous physicist. Throughout the dramatic challenges of their life, the screenplay manages to inject humor and hope. Redmayne transforms himself into an Oscar-worthy performance and the film tells Hawking's story with warmth and honor."}, {"rating": "10", "text": "I completely agree that a film focused on his science instead of his love life would have been more interesting to me, but that being said, this is still a great movie. Great acting and great script. I don't need anything more."}, {"rating": "7", "text": "This Oscar nominated biography of the life of Stephen Hawkins and his wife is perfectly serviceable, and made above average by powerhouse performances by Redmayne and Jones, but it all feels just a little safe. Told in a standard film bio structure it has no surprises and hits all the genre beats perfectly, but what it needed was to be just a little more cinematic. It feels like something you would watch on BBC1 on a Sunday afternoon, which is no bad thing, but for the big screen you feel it needed a little something extra."}, {"rating": "7", "text": "The movie itself is OK, the acting is what prompts a higher rating. The film did seem a bit top heavy (first half was more intriguing/character development focused) while the second half (although well acted) definitely dragged on."}, {"rating": "9", "text": "Incredible it is the word that best describe this movie, because it was perfectly made, the actors, the screenplay and etc. But for me the most good thing in this film is Eddie Redmayne, he was perfect playing Stephen Hawking, if he won the Academy Award it wouldn't be a surprise"}, {"rating": "10", "text": "Eddie Redmaye will probably be oscar nominated. As for the movie, if only there were more people as loyal, noble and good-hearted as Jane and Jonathan who helped take care of Stephen. It's truly amazing how Stephen didn't lose his will to live and instead thrived. But I think that's due to Jane. It's a wonderful story about human will and human good will."}, {"rating": "8", "text": "Personally I have been suffering from a certain degree of biopic fatigue, those annual staples blatantly pandering to academy recognition are often dazzling with Oscar-hankering performances, but its narrative structure and skill usually are all laboriously conventional and monotonous. James Marsh’s THE THEORY OF EVERYTHING is the quintessential archetype of this sort and it is going to give Eddie Redmayne the coveted Oscar for such a taxing mission to imitate Stephen Hawking, the still alive-and-kicking bigwig cosmologist. However, Marsh conducts the film with a fluid pace and it wondrously invigorated by its technical crew, particularly Jóhann Jóhannsson’s engrossing soundtrack and the ever-pervasive subdued light from lighting department.\r keep reading my review on my blog, google: cinema omnivore, thanks"}, {"rating": "8", "text": "Eddie Redmayne and Felicity Jones give two of the finest performances of the year. The Theory of Everything is a heartfelt and honest look at life, love and everything in between."}, {"rating": "8", "text": "The two leads, Eddie Redmayne and Felicity Jones give performances that are simply remarkable with a score that is surprisingly good and important to the story."}, {"rating": "7", "text": "If this movie has anything going for it, it is definitely the fantastic acting. There is something also to be said of the well crafted direction and score. As far as biopics go, this is a better one."}, {"rating": "8", "text": "There may be some problems about its script and the way they told the story of Hawking, but The Theory of Everything is an exceptional film because of its acting.Eddie Redmayne gives an astonishing performance that makes you forget you are watching a film. Such an extraordinary work."}, {"rating": "7", "text": "Ok so let me start of by saying that Eddie Redmayne, Felicity Jones and Harry lloyd did a wonderful performance in this movie.\r The Theory of Everything for the first hour of the film captures an amazing part of Steven's life, but after the first hour you are left feeling disappointed, I know this is what happens but Jane dancing around with this christian man and building a tent together does not qualify as character development, the same goes with Steven's nurse, they fail to gave that charm which an audience needs to connect with, I know this movie it trying to stick with the facts but changing the plot a little would not have hurt at all.\r Harry lloyd's character that in the moments we saw him really gave that best friend vibe, and it's really upsetting his character was not given a bigger role because it would've really helped saved this film in the last hour.\r Eddie Redmayne was fantastic as Steven but after an hour there was no longer a connection with him, I found myself having to listen really carefully to what he was saying, and I was very upset because his performance was great and then cut short, it's like the final hour of the film was rushed and not thought about at all, and as for the nurse he falls in love with, I did not see how Eddie pretending to be a dalek is enough to announce a break up 5 minutes later. These parts were Steven and Jane had their moments with their future partners felt so cliché it was like watching a Disney movie because it was like they just gave up on trying to make a great final hour as opposed to the first hour which was great.\r Finally,  Felicity Jones who had such a great start and gave such a great performance, at first her character was shy and coming out and wanting to help Steven even though his condition was worsening, but then she meets a man who can play the piano  (Who comes off as very dis-likable, as does Steven's nurse) and 3 minutes of montage time and all that connection that we built up with that character was just ended, making the audience feel for her but dislike the character at the same time.\r This film was great seriously, it's just the final hour that becomes unbearable, there is not enough character development, and I don't see why these characters were given more screen time than Harry lloyd's character because I think if they used him instead of the two most annoying characters in this movie then the final hour would've been saved. I don't see why they didn't change the story a little.\r The last part I have a problem with is the ending, it's trying to do something phenomenal and great, and that would've worked and became truly emotional if they had not ruined the story after the first hour.\r I do recommend people to watch this though, it is a good movie for the first half"}, {"rating": "8", "text": "Though it may tread on some traditional biopic tropes here and there, a traditional biopic it is not. \"The Theory Of Everything\" excels, thanks in no small part to its captivating lead turns and some oneirically beautiful images and camerawork throughout."}, {"rating": "8", "text": "This a well-told, sweet story. The two leads have excellent chemistry and Eddy Redmayne knocks it out of the park Stephen Hawking. He's really fantastic. The plot gets a bit slow here and there, but overall I really liked this movie."}, {"rating": "8", "text": "Yet another marvelous British biopic (after The Imitation Game.) Overall, I was quite satisfied with how this film turned out. Eddie Redmayne and Felicity Jones both deliver touching lead performances. The story was also heartfelt and captivating to watch. Overall, it certainly does great justice to Mr. Hawking and all of his brilliant contributions over the years."}, {"rating": "6", "text": "If the acting tandem of Redmayne and Jones is the film’s irresistible force, then the fading presentation of the story of The Theory of Everything is the immovable object that that force has the unfortunate circumstance to meet.  I don’t know the outcome of a meeting like that in the realm of physics, but in the realm of film, it isn’t pretty."}, {"rating": "7", "text": "A generally well-crafted and engaging biopic about the personal and professional life of world-famous physicist Stephen Hawking. Despite an occasional tendency to be overly earnest in its delivery and some slow pacing in the last half-hour, the picture is an informative and enjoyable time at the show, with a positively stellar performance by Eddie Redmayne in the lead role."}], "recommendations": ["joy", "a_beautiful_mind", "manchester_by_the_sea", "lincoln", "marriage_story", "breakthrough", "catch_me_if_you_can", "scent_of_a_woman", "the_father", "the_danish_girl", "jackie", "the_hurricane", "magnolia", "belfast", "the_devil_all_the_time", "spotlight", "the_secret_life_of_walter_mitty", "a_beautiful_day_in_the_neighborhood", "the_professor_and_the_madman", "nocturnal_animals", "blue_valentine", "bicentennial_man", "steve_jobs", "lovelace", "gifted"]}