{
  "id": 3805,
  "title": "The Tuxedo",
  "starring": [
    "Jackie Chan",
    "Jennifer Love Hewitt"
  ],
  "runtime": 98,
  "genre": [
    "Thriller",
    "Action",
    "Comedy",
    "Science Fiction"
  ],
  "description": "Cabbie-turned-chauffeur Jimmy Tong learns there is really only one rule when you work for playboy millionaire Clark Devlin : Never touch Devlin's prized tuxedo. But when Devlin is temporarily put out of commission in an explosive accident, Jimmy puts on the tux and soon discovers that this extraordinary suit may be more black belt than black tie. Paired with a partner as inexperienced as he is, Jimmy becomes an unwitting secret agent.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2agrcNQRtgTsN5SbffC4H2BwYW2.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 2.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "I've seen over 20 Jackie Chan films. And while the writing and dialogue is never anything special, at least the focus is on what Jackie does best: the fight choreography and the stunt work. The Tuxedo contorts Jackie into everything he's not. His charisma is negated by cringey dialogue intended to be witty. His martial arts prowess is tainted by very noticeable, unnatural special effects. There is very little of the charm or organic kung fu action you look for in a Jackie movie. I'm going to give Jennifer Love Hewitt a pass because the writing for her is so bad I don't think any actress could have done better."
    },
    {
      "rating": "5",
      "text": "Different kind of movie but it's still an ok movie. A lot of parts of the movie are very cheesy though. A like mechanical suit a lab created to make you be like a superhero."
    },
    {
      "rating": "9",
      "text": "What do you look for in movies? A deep twisting plot? A story that stays with you long after and still stirs up emotions? Well you won't find it here! But... why does that have to be a bad thing? If you want a film like I mentioned, there are many out there. But, if you want to sit back and enjoy some light entertainment that will still make you laugh, no-one does it better than Jackie Chan. Sure, the plot is light, but what did you expect? I have seen this film twice now and would watch it again anytime. I have seen reviews saying this film was terrible purely because of JLH's role... I say make up your own mind, I'm not promising you will like this movie but at least give it a chance... When you have made as many movies as JLH and Jackie Chan, not every film you have starred in will appeal to every critic, but this may be just the right kind of film for you. One other point- Many of the reviews I have read say something like \"This film is terrible, I'd rather watch Sin City, or We Were Soldiers,\" and while I like these movies myself, you need to remember that there are parents with young children who may struggle to find a film they are happy to show their children, and this movie may be more suitable for younger viewers, while still amusing parents. If you have read this, I want you to know that this is only my opinion, so I'll say again \"Try it for yourself.\""
    }
  ]
}