{
  "id": 4119,
  "title": "The Informer",
  "starring": [
    "Joel Kinnaman",
    "Rosamund Pike"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Crime",
    "Thriller"
  ],
  "description": "In New York, former convict Pete Koslow, related to the Polish mafia, must deal with both Klimek the General, his ruthless boss, and the twisted ambitions of two federal agents, as he tries to survive and protect the lives of his loved ones.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pbGveUC8mk0QRkdXpERPLbMFnrg.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 5.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Joel Kinnaman plays the titular character, who’s undercover to help the FBI bring down a Polish drug operation. As expected, things go wrong almost immediately and he spends the rest of the movie fighting for his life and innocence.  Rosamund Pike and Clive Owen are also in the cast, but it’s really Kennaman’s show. He makes a solid tough guy with an edge of brains. The film itself unfolds with predictable developments, so it’s more about the character extricating himself out of this predicament, than any strong action beats. Solid drama, but not special, although it does bode well for Kennaman’s future action hero status."
    },
    {
      "rating": "5",
      "text": "A disappointment, despite a promising beginning and an intense, spot-on performance by Kinnamon. The rest of an excellent cast is wasted, especially Pike and Owen (whose one nite nastiness veers to the ridiculous.) But the film’s main problem is its increasing implausibility as it moves along, and its incoherence. Characters and plot lines are introduced, and then abandoned never to be seen again. An interesting character of a female NY defective is introduced early, goes off to a date, and disappears. That’s just one example. A mess, which is too bad given the promising start and Kinnamon’s performance."
    },
    {
      "rating": "8",
      "text": "Maybe not perfect but when I just read someone’s opinion with bad score, that the plot was predictable I laughed hard and had to write a short review.  Many surprising plot twists in this movie. Keeps you entertained from beginning to the end."
    },
    {
      "rating": "5",
      "text": "A pretty forgettable and predictable thriller.Kinnaman shines, not bad, but nothing ground breaking either."
    }
  ]
}