{"id": 4613, "title": "The Last Stand", "starring": ["Arnold Schwarzenegger", "Johnny Knoxville"], "runtime": 107, "genre": ["Action", "Crime", "Thriller"], "description": "Ray Owens is sheriff of the quiet US border town of Sommerton Junction after leaving the LAPD following a bungled operation. Following his escape from the FBI, a notorious drug baron, his gang, and a hostage are heading toward Sommerton Junction where the police are preparing to make a last stand to intercept them before they cross the border. Owens is reluctant to become involved but ultimately joins in with the law enforcement efforts", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/4PGpdWDQOjlsMcMIyTwI5Q9jPRJ.jpg", "categories": {"plot": 5.636363636363637, "acting": 5.516129032258065, "ending": 5.5, "soundtrack": 3.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 5.777777777777778, "action": 5.878787878787879}, "reviews": [{"rating": "7", "text": "\"Well to say The Last Stand is a comeback vehicle? i hope not, but the odds have it. Arnold is back in full swing as a gun toting sheriff ready to kill. With a few exceptions. \"The Last Stand\" proved to be quite, the exciting and intense action film.\"  B"}, {"rating": "7", "text": "A romping good time.  This is the Arnold we've missed. Unlike Stallone, who's films tend to play around with the morose side of cartoon violence, Arnie's new film embraces its ridiculous over the top conflict with glee. The action set pieces are fantastic, over the top and gleefully violent. Everything an Arnie movie needs. The villian is gleefully cheesy, racecar driving pablo escobar. The most interesting thing about this film though is the score and editing. The score is outstanding, it adds to the tension and ramps up every scene to that sweet spot, just to get you pumped to see Arnold tackle a dude off a roof and blow his brains out at the same time, or when you need to ramp up the tension for when the villain decides to use a super car to take out two SUVs. The editing though is a bit iffy. It's not bad outright, but it definetley stands out, because from a technical aspect everything else works like clockwork. The movie was great, Arnie looks leathery but was still great. This is the way to bring back your career!"}, {"rating": "7", "text": "Apparently the cast of The Expendables are moonlighting for different roles, respectively. Arnold Schwarzenegger took the role of an old, as he said so himself, sheriff of a small town near the border of Mexico and USA. As far as action flick goes, The Last Stand will not disappoint, despite the cheesy lines and some acting flaws. Fist-to-fist brawls, gun fights in the middle of a street, and wild chase scenes contribute in overshadowing what shortcomings it may have.\r A fugitive has eluded FBI when he was about to be transferred to another prison. Using trickery, his mercenary team and a sweet ride that could easily be featured in Fast and Furious, he dashed for the border. As we all know from previous dozens action movies, fleeing to Mexico is equivalent of a jail free ticket. Unfortunately this little town, which has Arnold as its sheriff, stands between him and complete freedom.\r Honestly, whenever Arnold appears and tries to act, there's a lingering feel of awkwardness as if it'd be unintentionally comedic, although some scenes provide comedic relief at his own expense. However, his name still carries some weight, and I'm sure everyone has certain expectation when watching his movies. He puts decent performance, instead of putting air, he's showed as a weary battle-sicken man, but still a man who will hold his ground, with several questionable characters as his deputies.\r The movie doesn't owe the fun thrill to Arnold alone, the pace is well structured, time frame is nicely done, and the others compliment the humor as well. Johnny Knoxville as Lewis Dinkum is admittedly downright ridiculous, he owns a museum of highly destructive weapons for plot convenient purpose. He also has perhaps the most notable shabby acting, the clown, if you will, thought he might induce some chuckles.\r Forrest Whittaker as John Bannister, the FBI agent in lead of the operation is adequate, considering he has acting mettle more than the rest. Peter Stomare as the slightly psychopathic accomplice does just that, a slightly psychopathic second villain. The rest are bundles of misfits, mandatory hot chicks, and agents who will eventually come just in time to miss the action. Direction and choreography are well thought-out, divided in a focused pace while clever camera angles capture the action quite amazingly. The Last Stand has hackneyed acting and lines, has plenty of quirkiness, but serves its bullet-whistling and car-chasing fun like it's supposed to and quite entertainingly in that regard."}, {"rating": "7", "text": "Critics, man.  What a bunch of bummers...same with some of the users, too.  What do you expect from an Arnold flick?  Do you think he's going to be remaking The Magnificent Ambersons or The Man Who Would Be King?  Much like both Expendables films I went for the nostalgia of the days when I couldn't wait for the next Arnie flick or Stallone, etc.  Sure, this is the last gasp, but I'm there for it.  Just for fun.  If you are going to see The Last Stand may I recommend low expectations and look forward for a fun, if cliche' d, ride.  You've been on the Matterhorn at Disneyland a hundred times as a kid, but something about that rickety old thing makes you want to go one more time."}, {"rating": "6", "text": "Aside from the criminal misuse of Forrest Whitaker, this is a decent, light, fun film.  The direction could have been MUCH tighter - there are far too many blank stares and dull silences, but the action sequences are creative, and it's the classic tale of small town heroes  vs. the big bad crime syndicate - tough to go wrong there.  If only there weren't a couple of 7 or 8 year old boys in my theater giggling their asses off every time someone had his head blown off..."}, {"rating": "6", "text": "Kind of like the Expendables, \"Last Stand\" plays off of Arny's old age. It's stupid and Arnold still can't act but it's great fun and a bloody good time with guns and cars. Just don't go in expecting anything with a brain."}, {"rating": "8", "text": "Fast cars, wild action, enough guns to make Joe Biden change his diaper. Like a grandma with a shotgun pointed at your face what is not to love about this movie. This is all 80's throwback from a time when rated R movies were fun and cheesy. Almost all the actors get a LOL moment with the best reserved to old Arnie who does what he has done best for the past 30 years, delivering one liner after one liner."}, {"rating": "5", "text": "Cliche after cliche, one-liner after one-liner, but the action set pieces are solid.  Popcorn fun, nothing more.  Arnold deserves better scripts, and we deserve a few good films he has left in him."}, {"rating": "8", "text": "This was a good action movie. Only slightly more than the trailer, but still entertaining. If you are in the mood for a good drama, go see Zero Dark Thirty. If you want a good action, see this."}, {"rating": "6", "text": "The first two acts are a little janky, as Arnold's role only gets into one brief action scene throughout the time frame. The plot are also feels extremely divided as the villain's and Arnold's relevance isn't explained until late in the second act. Thankfully, however, the climax kicks the movie into a much needed state of overdrive, delivering immensely satisfying firefights, standoffs, and chases while retaining Arnold's and Knoxville's trademark humor. Overall, it's nothing special at first, but the final third justifies the watch."}, {"rating": "9", "text": "Arnie has still got it.....Nothing special, but just some good time...Good comedy and Action...must watch for an Arnold fan....It is good to see Arnold back, and looks like he can still produce some of his old touches.Th e movie does not have a great story line , but just the Fact it is Arnold movie, should see it through....."}, {"rating": "5", "text": "Ever hear a Swedish guy trying to do an American southern accent? The bad guys right hand man in this movie has the absolutely worst American accent you will ever, EVER, hear. How this got onto the screen says a lot about the quality of this movie."}, {"rating": "10", "text": "My official review of \"The Last Stand\" can be summed up into a single word: America!  Now I know you're asking \"Stamp, what does America have to do with The Last Stand?\", and I'm glad you asked, Jeeves.  My thesis is as follows.  \"The Last Stand\", Arnold Schwarzenegger's newest theatrical release, and The Great United States of America go hand in hand because of the ridiculously good-looking and super fast Corvette( America's sports car); Arnold, himself, is an American dream come true; and because of U.S. citizens taking up arms to make a last stand against evil. Pun intended, although I'm not sure if it counts because that's what the title is talking about.  Moving on, I left the theater entertained, motivated, and grateful to live in a great country.  Last but importantly, they mention Jesus.  Let's take a moment for a standing ovation for Jesus.  Our lives are better for it.  In conclusion, I officially award \"The Last Stand\" with my first ever Stamp Of Approval."}, {"rating": "7", "text": "Arnie is back, older, a little paunchier, but no matter what, he is still Arnie.  And using his Austrian broken English he delivers what you would expect.  No this is not a perfect movie but if you're looking to pass a few hours and be entertained in which you know the ending he delivers a fun flick.   Blood, guts, violence with some humor sprinkled in, in which non of it is remotely believable.  Just a fun way to enjoy Arnie one more time."}, {"rating": "3", "text": "Movie was eh.  Don't like seeing Arnold old, just doesn't pump me up like he use to.  Movies like this makes me long for the days of Total Recall, Terminator, and Predator."}, {"rating": "3", "text": "\"The Last Stand\" 10 Scale Rating: 3.5 (Bad) ...\r The Good: Some of the action sequences are at least decent. While he was out of place and saddled with a horrible script, Arnold still has a lot of charisma.\r The Bad: Cheesy and full of awful one-liners, \"The Last Stand\" is a cringe-worthy effort. Under-developed and cliche characters (even for an action flick!) litter the screen. Not the best premise with over-acting reaching epic levels, especially from Arnold, Peter Stormare, and Forest Whitaker. Lastly, Johnny Knoxville's character (who seems like a lot of Knoxville's characters) was irritating at best."}, {"rating": "5", "text": "A Mexican crime lord escapes from the FBI and it's up to a small town sheriff (Arnold Schwarzenegger) and to stop him. There are some cool driving stunts, but most of the action is nothing special. The pacing keeps it moving, but the screenplay is simply painful: predictable, for sure, but lacking in so many ways. There were lots of opportunities for character comedy and smart retorts, but none of it was realized. This might have been a fun vehicle (featuring several fast Chevys), but the writing condemned it to an awful accident: avert your eyes!"}, {"rating": "8", "text": "More or less what I was expecting and wanting. It starts off a little slow, focusing on bland backstory's and lame jokes, but once the bullets start flying the movie takes off. It's meant to play off of Arnold's age and does it well. That being said the movie also has poor acting despite it's above average plot. Still I came into this movie to watch Arnold (not even going to try to spell his last name XD), my all-time favorite action star, kill some dudes, and the movie delivers on that front. So if you come into this movie expecting a straight up popcorn worthy action flick, rather than a deep movie with excellent acting, you wont be disappointed."}, {"rating": "4", "text": "It's literally just eye roll after eye roll of terrible cliches and bland shoot em up scenes. Not even Arnold can save this one. The plot is essentially a bare bones, utterly predictable excuse for the action; of which the scenes were predictable and unoriginal. There was some good acting, mainly from the big name stars like Arnold, but it falls through with the secondary characters; especially with the romance plot tumor. This movie was VERY clearly riding on the hype for Arnold to be back in acting."}, {"rating": "4", "text": "Its been over a decade since Arnie's last starring role and The Last Stand signifies his return to the action persona he fostered over the years and from the looks of it he still has something to show but the film doesn't prove to be the return showcase he envisioned, not by a long shot. This time around Arnie is called upon when a dangerous cartel leader escapes federal custody and he heads to the small town of Sommerton where Sheriff Ray 'Arnie' Owens must stop him from crossing the border into mexico with the help of his deputies and a few well intentioned civilians. While not completely inept, The Last Stand does feel like a low budget actioner for actors past their prime which is why I thought it odd Forrest Whitakers character wasn't played by Cuba Godding Jr. The film prides itself on its humour and the many in jokes that go with working with Arnie but there are only so many you can take. After a while it grows tiresome and it feels like you are being fed a block of cheese with no substance, no bread. The film does try and take it seriously occasionally but does so in such a generic way that it never feels sincere and the emotion displayed is always fake. The film is viciously violent but not for any good reason and Luis Guzman and Johnny Knoxville show up for cheap laughs (you laugh at them, not with them) even though you just want the film to end. There are only so many references of Ray being past his prime you can take and catchphrases like \"I'm the Sheriff\" don't help matters. The director does have some flair for the action elements of the film but overall it feels like a first shot, it will be interesting to see if the directors next will improve upon The Last Stand, a disappointing action comedy."}, {"rating": "6", "text": "Someone bad is speeding towards your town in a souped up sports car that only a higher power could slow down, so what do you do? Put Arnold Schwarzenegger in said town of course, and let him run riot simply because he hasn't been able to do so on his own for almost ten years.\rHe stars as Sheriff Ray Owens, maintaining the law in a quiet town in Nevada, but the lack of crime leaves himself and his inexperienced crew with very little maintenance to keep. So on his day off, he suspects a few shady truckers in a diner but lets them on their way, but when the local milkman is found dead, Ray suspects everything is intertwined, especially when he gets a call from John Bannister (Forest Whitaker) of the FBI to inform him of an escaped death row convict possibly heading for Ray's small town. This escape itself is something right out of the A-Team, overblown and ridiculous but easily enjoyable.\rWhat Ray doesn't hold back on is getting back into old tricks to protect his friends after everything starts falling into place.\rThere is plenty of set-pieces and other B movie antics to enjoy, but the film does take quite a while to get into the swing of things, trying too hard at certain points to make a story or plot development that isn't there or doesn't need to be explored, after all, some films just don't need that much thought or willpower to watch, but at various points throughout the film, tension is built only to unfold with little flare, at many times it just needed more of its main guy, and even more Johnny Knoxville would have sufficed.\rThere is also the wasted opportunity of Whitaker, he has very little to do and an actor of his undeniable talent deserves better. But a more than excellent and explosive finale with some good old-fashioned fist fighting certainly finishes off a decent flick and return for Schwarzenegger, with plenty of action blended in with comedy to satisfy plenty, he's not at his best by a long shot, but he certainly leaves a presence that is hard to ignore.\rTheres nothing spectacular about Arnie's long awaited return to the screen, the acting all round is wodden and the story is filled with questionable motives, but for that reason its easy to get lost in this fun, silly and action-packed firefight that rarely puts down its weapons."}, {"rating": "7", "text": "The Last Stand was exactly what I thought it would be. Arnold Schwarzenegger proves he's still about the same actor he's always been. You're going to get some decent fight scenes, a bunch of over-done gun battles, some solid one-liners, and a severe lack of acting. If you're an Arnie fan like myself, you don't mind the flaws and enjoy it for what it is. The rest of the cast was about what you'd expect also. Luis Guzman played his usual comedic relief stereotype Hispanic role and Johnny Knoxville was hilarious as usual. I wish he would've been featured more but his role wasn't critical. I'm a huge Jaimie Alexander fan so I loved that she was in this film. She is stunningly beautiful and a very underrated actress who has the ability to do a lot of physical stunts without the need of a double because she's also impressively athletic. Hopefully she shines enough in these smaller roles to get a chance to become more of a leading actress. As for the plot, it dragged a bit early and there were some silly parts, especially involving Burrell's initial escape, but it developed well and once the meat of the movie got going it was enjoyable. Some of the action sequences were overdone but like I said, it is an Arnie movie. Overall, enjoyable and entertaining with some flaws but not enough to ruin the experience."}, {"rating": "5", "text": "Good to see arnie back but action with him is very brief, the film is more about car chases, there's only really a 5 minute action scene with guns and a 3 minute fight scene. Plus the film is terribly written, both plot-wise and dialog-wise.  Tries to be funny in the most awkward ways, major plot points make little sense. (Metal handcuffs not affected by magnet?  Police helicopter doesn't have infra red? Why build a bridge, why not arrange a helicopter to transport them over the canyon, then to another car. why did the swat team not attack the corvette instead of trying to drive into it, presumably they have weaponry?)"}, {"rating": "3", "text": "There is nothing special about this movie  NOTHING  beyond the fact that Arnold is in this movie and his action scenes are no where what they used to be. Everything corny that you hate from C- 80s/90s action flicks are in The Last Stand from the feeble guy whom you really don't care for anyways that dies, to the ridiculous guy that won't die, the Mr. Bad Guy don't mess with me is present, some cheap attempts at humour which fall flat on their face, suspense where the outcome is painfully obvious, a storyline which is there only as an excuse to give the action some meaning and to the paltry car explosion scene that you've seen a million times in past movies. The acting is all around terrible too (Arnold) except for Johnny Knoxville who talks with his mouth as well as his facial expressions. He was a pleasure to watch in a non-homosexual way. Action was terrible outside of the chaingun scene (which lasts 10 seconds) and the whole time I was waiting for Arnold to do something amazing but no...nothing happened. Just a corny ending and me feeling bad I had to pay for this on a Tuesday night. Watch this movie if you want your crying family to read on your coroner's report: \"central nervous system necrosis and subsequent apnea due to boredom\" as the cause of death."}, {"rating": "7", "text": "Its a good pop corn movie and Arnold is always best. Supporting actors bit lame but anyway its a quite watchable movie.Last wrestling fight was quite amazing and so real."}, {"rating": "3", "text": "Schwarzeneger's back! And if you think that's a good thing, you're one of the many people I don't understand. I'm sorry, but I didn't find this film entertaining at all. Not to mention it has about as much depth as a Jessica Simpson music video."}, {"rating": "9", "text": "an ok story mixed with Tarantino style gun work makes this a great action movie. Arnold does a great job and delivers. i was very impressed on the amount of gore, and the detail in using it. not a lot, if any that i could tell of cg. a great action movie."}, {"rating": "8", "text": "This was pretty good, at first I was losing interest cause of a few sill characters, but it picks up! The bad guy on this movie is annoying, hes one of those you want Arnold to get a hold of witch makes the movie fun to watch.Also a few good one liners from Arnold that I liked."}, {"rating": "5", "text": "“The Last Stand” presents a decent supporting cast (yes, Johnny Knoxville is part of that group), the film’s pace moves along quickly, and features the new Corvette ZR1. Its major drawback however, is its star protagonist that simply isn’t up to playing the part, which surprisingly, demands some emotional range. Although Director Kim Jee-Woon has carved a distinguished career out of hyper-violent silliness, his first American film is a throwback to the low CGI, focusing on stunt action with the revered themes of justice and honor, prevalent in classic Hollywood westerns. A mix of established actors with a handful of unknowns, a hearty dose of violence mixed with questionable humor, lots of guns accompanied by bland dialogue and cheesy one-liners. All in All, “The Last Stand” fully embraces exactly what it is, never taking itself seriously, and it works for the most part because of it.\r Sheriff Owens (Schwarzenegger) is a man who has resigned himself to a life of fighting what little crime takes place in sleepy border town of Sommerton, Arizona after leaving the LAPD because of a botched operation. The story begins with a ridiculous, elaborate escape scenario that is planned and successfully executed to free a notorious, ruthless drug kingpin named Gabriel Cortez (Eduardo Noriega). Sheriff Owens receives a call from the inept Agent John Bannister (Forest Whitaker, who simply recites the lines in his role) of the FBI, which states a dangerous inmate has escaped from their custody, and is currently heading towards Sommerton to cross into Mexico. Arnold and his hapless deputies are their last opportunity to make a stand. Cortez is darting for the border at 200 mph in a specially outfitted car with a hostage and, a fierce army of gang members. At first reluctant to become involved, and then counted out because of the perceived ineptitude of his small town force, Owens ultimately accepts responsibility for the face off.\r Once the crew of villain’s roll into Arnold’s town, the guns start firing and continue to fire, and copious amounts of blood is shed, all while ‘humor’ is injected between the bullet shells hitting the ground. We are exactly where we want to be  engaged in an affectionately knowing B-grade showdown of stupidity versus even greater stupidity. Jee-Woon eventually narrows the field down to two, with Owens and Cortez facing off in a car chase through overgrown cornfields, before a final fisticuffs set against a super-stylized backdrop. The result may not seem meritorious at first glance, but for those with minimal expectations and a bloodlust for a certain strain of nostalgia, “The Last Stand” qualifies as pleasure that you just might feel guilty about."}, {"rating": "6", "text": "\"The Last Stand\" is just what it sounds like. If you were thinking of a western, you're absolutely correct. This is a completely mindless action movie with very mediocre acting. Arnold is being Arnold and Knoxville being Knoxville. Being a fan of the \"Jackass\" series and movies, it was fun to see him do a couple stunts but, overall, his character was simply there for comic relief (in a movie which is already an action comedy). I love the director, Kim Jee-woon, for his past Korean work on \"The Good, The Bad, The Weird\" and \"I Saw The Devil\" but I think he should stick to Korean casts. It's just no actors really shine in this one. I went with my friend and I found it comical that, for one, very few people were in the theater (on opening night) and, secondly, they were all middle-aged. You could see in the way they laughed at Arnie's one-liners that they wanted this to be Schwarzenegger's comeback. However, I'm sorry to say that it's not (plus, nothing will ever top Terminator). It's a good Netflix or On Demand rental but that's all."}, {"rating": "7", "text": "The Last Stand delivers exactly what it promised, a heart pounding action film that proves to be an exciting return for Arnold Schwarzenegger to the big screen.  I realize he has made a few cameo appearances like in \"The Expendables 2,\" but it"}, {"rating": "5", "text": "Some parts of the movie were really painful to watch, but if you're looking for an action flick devoid of any plausible storytelling, go see this movie."}, {"rating": "7", "text": "Good action picture.  Sure Arnold is old and isn't great looking.  This is an Arnold movie.  It has a good plot, moves along briskly and was fun to watch.  If you saw Bullet to the Head with Stallone and liked it, you will like this one too."}, {"rating": "9", "text": "Ahhnie is back with a vengeance! In the Last Stand! This Cheesy Mexican popcorn flick is really awesome. The film starts off slow but then it gets interesting. I'm pretty glad Arnie made this film. It's just bloody f**king fun with guns and hot cars. Just don't take brainy nerd to this movie."}, {"rating": "7", "text": "Arnold is still giving good performances and this film is no exception it's a fun film to watch and the action is really fun to watch and while the story was not the greatest the cast did their best to make you watch a really enjoyable film"}, {"rating": "4", "text": "A formulaic action movie with a pointless plot.  Arnold is pretty good here with a case full of one liners and he's the best part of this film. Still this has decent action, but a mediocre story."}, {"rating": "6", "text": "Anyone remember The Hunter? It turned out to be Steve McQueen's final screen appearance, playing a bounty hunter, in a rather generic action thriller, with some pretty good action sequences inserted. I thought of that film while watching this  I think they share a cornfield car chase, I may be wrong), because, it too, is a generic thriller, with a few good action sequences. Arnold does his Arnold thing, squinting and creaking out his dialogue, with nods to his age. Knoxville plays the village idiot (typecasting?), with a thing for heavy artiliary. The major dissappointment is that I was expecting something a bit wilder from Kim Ji-woon, along the lines of John Woo's American debut, Hard Target. But hey, cranked up, with a few beers on a warm spring evening...? It'll do just fine."}, {"rating": "3", "text": "It could have been a great action flick but  Ji-woon Kim botched it. There was enough crazinessin the trailers to suggest a success but the movie is far from what you could have expected\rThe casting is okay regarding the supporting roles, I love Shwarzy even when his acting is as vivid as a piece of meat full of steroid (he actually have some nice scenes) so I can't complain, Knoxville is (or should have been) the star of the show but Eduardo Noriega is one of the worst villain I've seen lately, Luis Guzmán first half of the movie completely kill the other half and Forest Whitaker is THE least believable FBI coordinator I've ever seen\rI was enthusiast about the scenario but it appear dull after only 20mn into the movie.\rTo continue about the craziness, it's all I was excpecting from this movie (I was seriously envisioning some kind of Machete/Tarantino-like freakshow) but even the few scenes that aim for that touch fall flat from poor acting or terrible editing\rI can't say that I did not enjoyed some of the scenes (seeing terminator bring his last  german souplex was heartwarming) but overall, this is not what I expected and even trying to watch it frome the 2nd, 3rd and 4th degry didn't work for me\rI'll finish with some of the effect or choices that really buried the movie in my opinion (no spoilers hopefully)\r° The overuse of the basic timetable (white letters on blurry screen) is annoying, there were so many creative way to use it in the movie\r° The ''revenge for the good guy'' cliché, there were so many reasons to send Shwarzy after bad guys, why settle for a bad one?\r° The obvious lack of originality (maybe the director had his hand tied, maybe he wasn't in the mood) but if all the good scenes of the movie can be sumed up in a 2mn trailer, why bother?\r° The stupid-a*s backstory or the lack of them (''At age 3 he had his first mercedes, at age 5, his father built him a closed circuit in his backyard, at age 12 he was a competitive sport driver, at age 23 he is a drug lord and I drive him aroud Las Vegas with no intention whatsoever to make sure he doesn't escape, herp derp durp heurp'' (and the cuty can aim a sniper rifle without being trained by her step-father who'se a long lost Shwarzy friend, just saying)\r° The horrible casting choices... Chris Tucker would have made a better mexican sidekick, Cheech Marin a way scarier bad guy and Giancarlo Esposito a trustworthy, calm, professionnal FBI agent with a sad backstory (''goddamn I won't loose another agent'' (see usefull backstory up there)) Ps  guess which one I would have choose for the actual role"}, {"rating": "6", "text": "Yep, he's back, with a pop corn action movie! My expectations were really low, but as it turned out it 'Last Stand\" has it's charm. Overall  it's a decent action movie with some good parts, and some problems as well!"}, {"rating": "2", "text": "A small time sheriff is called up to the plate when an escaped fugitive tries to drive through his town......and of course he steps up to the plate with his rag-tag bunch of deputies and puts on a great \"Last Stand\". The story line is as painfully dull as the characters and the dialogs and the acting. There are a few good action scenes and car chases, but other than that, Arnold's great comeback is nothing more than big giant muscular cliche."}, {"rating": "4", "text": "If you're a fan of Arnold's second-tier action movies, you will enjoy The Last Stand. If you didn't like movies like Commando, Kindergarten Cop, and so on, I expect you won't like this movie. In a weird way, it seems like the supporting actors didn't really put much effort into their acting. Perhaps it was the direction, but the villains and the townspeople seem rather disinterested in the proceedings  as if someone filmed a rehearsal that had gone on too long and just decided that was good enough.\r And, I guess, it is just good enough if ...\r1) You really want to see a shoot-em-up.\r2) Can watch it for free (or nearly free), and\r3) No other action movie is available that really piques your interest.\r I would have been bummed out  not disappointed, really, but underwhelmed  if I had I paid to see this in the theater. After all, I couldn't be too disappointed, since the movie is pretty much as advertised."}, {"rating": "6", "text": "The plot is not bad, because there are 2 strings coming together. Some of the action scenes were great, some very unrealistic. The humour was ok. Acting: Arnie you are too old for this action scenes, you can do better with your age now in my view."}, {"rating": "6", "text": "Heading into it, I fully expected \"The Last Stand\" to be boilerplate Schwarzenegger: Guns, one-liners, poor attempts at dramatic turns, car chases, and more guns. \"The Last Stand\" is all these things, but manages to make it all worthwhile, working a fun supporting cast around the obviously aged Schwarzenegger while pumping every ounce of adrenaline from the predictable action sequences.\r Trailers attempted to heavily sell Johnny Knoxville's role as some sort of zany sidekick, but his role is more limited than that, and its probably for the best. He adds to the fun of course, but it is the perturbed Peter Stormare who injects the highest amount of amusement. For a secondary villain, there is enough in his part to have made him the focal point of the entire film. Forrest Whittaker turns in a generic but satisfactory role as a head FBI Agent trying to recapture an escaped drug cartel kingpin, which is the entire plot in a nutshell. Again, nothing surprising here.\r As for Arnold, he is a casual master at this sort of film, and despite the wear and tear, he is still more than believable as a small-town sheriff who doesn't know the meaning of the word 'quit'. Early attempts at fleshing out a bit of backstory on the character are appreciated, but ultimately unnecessary; it's Arnold Schwarzenegger, he's a cop, and there are bad guys between him and the film's eventual ending.\r You can easily fill in the blanks without even watching it, but I recommend it anyway, because it does exactly what its supposed to do and wastes only a small amount of time trying to be something it isn't."}, {"rating": "6", "text": "I felt a little lost in this movie.  Don't get me wrong I thought it was actually pretty good but it bounced back from humor and seriousness that made it hard to know when to take it seriously.  Other than that is just a good old fashion action movie with Arnold, how could that go wrong?"}, {"rating": "8", "text": "This film did not disappoint.  So Arnie is a bit slower and bit wrinklier but that didn't stop me believing he could woop the baddies.  It felt like a Taratino movie with the graphic blood and violence but I loved it.\rAction, humour (johnny knoxville!) fast cars and a nasty badguy - what's not to like?"}, {"rating": "5", "text": "Obviously the parallels that TheStampMan has drawn between this film and the greatness of the USA haven't gone down too well but I would also argue that The Last Stand is a a social commentary of America and its history. And please note that I say this with a completely unashamed love of Arnie...\r I'll start with the man himself. If action films represented the world economy, Arnie would be America. This man was once the most bankable movie star in the world. His bankablity wasn't based on talent\ror finesse, though. Indeed, Arnie made it to the top through brute force and confidence (bordering on arrogance). And even though he still retains a large degree of power, he's widely considered a relic of a simpler time.\r Action stars these days generally triumph by using their intelligence and guile  traits which stars like Arnie, Stallone, etc.  just didn't/don't have in their lockers.\r The fact that Arnie and the majority of actors with speaking parts in this film have an accent is obviously a tribute to America's immigrant heritage, and its acceptance of foreigners and their cultures.\r Then there are the cars. These represent American consumerism. Much like Arnie, Corvettes and Camaros are big, loud, and look good. Americans aren't interested in what's underneath the hood. And they want no part in anything that displays even the slightest semblance of ingenuity and technical prowess, as demonstrated by George W. Bush's consecutive elections to the position of Commander in Chief despite his hilarious military track record. I probably should also say at this point that I just couldn't suspend my disbelief for long enough to buy into the fact that a criminal mastermind (no, not Bush!) with a racing pedigree would choose a Corvette for the most important road trip of his life.\r Next, there is the dithery old bat with the shotgun. She is the personification of the Native American genocide. She's white, she's from money, and she has a pervading sense of entitlement. Her shop clearly displays an 'Open' sign (as seen at 01:18:10) yet almost as soon as the Native American looking fellow strolls in to browse her wears she blows him away with extreme predge. Arnie then legitimises her sense of entitlement by thanking her: clearly a homage to America's Thanksgiving tradition.\r Which brings me nicely to the final act of the film. This is a spirited celebration of American gun laws. To the outside world, the fact that the citizens of the most dysfunctional nation on earth are armed to the teeth is confusing and horrifying in equal measure. However, had the townsfolk not been hoarding a cache of military-grade weaponry the bad guys would have been allowed to escape and continue their rampage of terror on the people of Central America and the Caribbean (Nicaragua, Panama, Cuba, etc.), which the Government and people of America would surely not have tolerated.\r I'll give this film 5/10. It would have been a 4/10 had Arnie not been in it. I grew up in the 80s so, despite me now having a near-total understanding of his lack of talent, the man is firmly entrenched into my psyche because of the fantastic memories he has given me over the years."}, {"rating": "5", "text": "It is hard to return from retirement and instantly make a good movie. Nothing special here, just another old average shoot-out action movie with predictable plot, still enjoyable at few points thanks to Schwarzenegger's presence."}, {"rating": "8", "text": "\"You make us immigrants look bad.\"\r Kim Jee-Woon's \"The Last Stand\" is a fantastic throwback to the 80's era of action movies that made Arnold Schwarzenegger a mega star and a box office goldmine. When the leader of a drug cartel busts out of a courthouse and speeds to the Mexican border, where the only thing in his path is a sheriff and his inexperienced staff. Arnold is great as Sheriff Ray Owens, most of the other characters are just comic relief like Luis Guzmán as a deputy and Johnny Knoxville as a crazy troublemaker and museum owner. Eduardo Noriega does alright as the main villain who spends most of the movie in a car, the villain for the first acts of the movie is a mercenary played by Peter Stormare who is about as intimidating as all the other villains played by Peter Stormare. The second best character is the female deputy played by Jamie Alexander, she holds her own in a gunfight and does help get the bad guys. The movie is tons of fun and i highly recommend it to anyone who likes action."}, {"rating": "6", "text": "The Last stand is what i would like to call a modern day Rambo movie. Its fast, its intense ,its ridiculous at times. The story is pretty simple and goes like this: A Crime lord in Las Vegas has escaped jail and is trying to get to mexico .The only standing between him and freedom is a small town called Summerton which he has instructed his gang members to lay siege to in order to get him a straight shot out of the country. But it just so happened that Summerton has one the most badass sheriff in movie history who fights back with Gatling guns, flares and all kinds of gun. Its a violent but entertaining movie and there is even a car chase towards the end. But one thing that confuses me is the name: why is it called the last stand there was only one stand."}, {"rating": "8", "text": "Kim Jee woon is a very talented South Korean director (best movie is I Saw the Devil) and this benefits from very sharp direction and cinematography.  Arnold does a fine job as always, Forest Whitaker also is always good to see.  I could take or leave Johnny Knoxville.  The action scenes are pretty snappy overall but i get the impression is giving us what he thinks we want, but i prefer his Korean films."}], "recommendations": ["white_house_down", "2_guns", "angel_has_fallen", "the_mechanic", "xxx_return_of_xander_cage", "broken_arrow", "mechanic_resurrection", "the_ice_road", "safe", "salt", "bullet_to_the_head", "shooter", "the_expendables", "the_expendables_2", "machete", "the_expendables_3", "lockout", "sabotage", "the_transporter_refueled", "con_air", "jack_reacher_never_go_back", "demolition_man", "skyscraper", "death_race", "from_paris_with_love"]}