{"id": 2372, "title": "The Spiderwick Chronicles", "starring": ["Sarah Bolger", "Jordy Benattar"], "runtime": 95, "genre": ["Family", "Adventure", "Fantasy"], "description": "Upon moving into the run-down Spiderwick Estate with their mother, twin brothers Jared and Simon Grace, along with their sister Mallory, find themselves pulled into an alternate world full of faeries and other creatures.", "releaseYear": "2008", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/uN7MUMaCXfa8DbMMp61A8iXEcEG.jpg", "categories": {"plot": 5.0, "acting": 5.0625, "ending": 4.857142857142857, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 6.888888888888889, "funny": 9.0, "action": 5.75}, "reviews": [{"rating": "0", "text": "Do not see this it is terrible. Freddie Highore is a terrible actor!"}, {"rating": "4", "text": "Didn't get my full attention. It's kind of dull and it's not the best fantasy movie I've ever seen."}, {"rating": "5", "text": "The Spiderwick Chronicles excels.\rThe integrity of the movie isn't very high considering the immense changes from the book. With that being said the movie is a very solid adventure flick with good young actors and a solid screenplay adaption."}, {"rating": "0", "text": "Completely unfocused, and it tried to copy Harry Potter. The ending battle was pathetic, and everything went by without a single touch of heart. I was very annoyed with the character Arthur Spiderwick, his story is a bore. And everything else is dull, more likely disappointing. they could've made more money by making two or three different films. But they just didn't try hard enough. The characters are annoying, and the setting is a flimsy terrain."}, {"rating": "8", "text": "The only thing I would caution against is taking children under the age of 8 to this movie. It has a very dark feeling to it, and my young girls were quite terrified at times. Overall, a great movie that the whole family enjoyed. Would have liked a bit more lighter feel in some parts, but still well done."}, {"rating": "5", "text": "A lot of money must have been spent on the CGI and FX. Too bad more didn't go to the script. The movie never lets us acclimate into it's world, so we remain detached-- not really caring about it, or its inhabitants. Vacillates between scary without thematic purpose, and precious with perfunctory sentimentality. Too bad the great cast is wasted."}, {"rating": "0", "text": "A poorly constructed film, a terrible and weak adaption from the books. It barely has character buildup, and the effects, which are probably the only worthy feature this film has are clearly cheesy. I don't recommend it, its only for those who are under aged 11, if your not then this isn't your cup of tea. They could've at the least tried a bit harder making this less fast-paced and quick. From a book readers review, this is heavily disappointing, and a missed opportunity."}, {"rating": "6", "text": "It was a great movie with awesome special effects. But it didn't follow any of the books at all!"}, {"rating": "10", "text": "Love! Love! Love! Amazing movie."}, {"rating": "9", "text": "Great story, well performed and cast. Great Great Great - best fantasy movie since Lord of the Rings."}, {"rating": "8", "text": "When the daft old woman who converses with flowers was a child, she told authorities the truth about her missing father and the jagged gashes on her arm. Since the girl's pa was vaporized in midair levitation by a vortex of whorling white moths, and her nasty cuts came about from a confrontation with malevolent woodland creatures from another realm, she should've lied. The old woman is named Lucinda Spiderwick(Joan Plowright). Her father Arthur(David Strathairn) wrote a field guide that collated in totality all the otherworldly creatures that roamed in the woods of his backyard. As any writer will tell you, the act of edifying fabrications onto paper alchemizes lies into half-truths, as the flight of fancy transports the reader into a world of its own making. In \"The Spiderwick Chronicles\", Arthur's scholarly pursuits literally isolates him from the people he loves, and Lucinda, like many children of self-absorbed intellectuals, grew up without a father. When the Grace children coaxes Lucinda into talking about her father's book \"Arthur Spiderwick's Field Guide to the Fantastical\", the viewer realizes that Lucinda would sound like a madwoman in any other context, except for the context of the sci-fi/fantasy genre. The authorities who institutionalized Lucinda mistook her lucid report of the fourth dimension as the rantings of a severely disturbed child. But Jared Grace(Freddy Highmore) knows that the old woman isn't off her rocker, and so does his twin brother Simon and sister Mallory(Sarah Bolger). The Grace children are like home-schooled Harry Potters. They don't have to board a magic train that's headed towards some haute-toite school of hocus-pocus for enchantment. That's why \"The Spiderwick Chronicles\" has more in common with the aesthetics of eighties-era Spielberg than the J.K. Rowling books. Bits of \"E.T.\", \"Gremlins\", \"Indiana Jones and the Temple of Doom\", and \"The Goonies\" can be gleaned from this sometimes astute children's film about how a father's compartmentalization of his interior life sprung a leak and spilled over into his personal one. All the nifty CGI effects in the world can't hide the fact that \"The Spiderwick Chronicles\" is actually a movie about a derelict dad."}, {"rating": "10", "text": "This is a great family fun film. Viewers will be engaged in the fast moving plot that offers a slightly different view of the fantastical world from Lord of the Rings and Harry Potter. Any one who enjoys fantasy films will enjoy this movie."}, {"rating": "0", "text": "I saw it in the IMAX at the 4:40 PM show, and believe me, its nothing good. It goes nowhere, it walks into a dull world where there is no effect of why the creatures are even there. And they could have had over another half hour to develop more of the characters. It just felt really lame to me, the action and effects are okay, but letdown by a boring story. It grossed me out instantly. And the acting from Freddie Highmore was terrible, him playing as two characters was just a mess. It was noisy, and a collosal dud. It presents 10 books in 1 hour and 31 minutes. That is ridiculous. Well, i am very disappointed, it really is meant for kids, it is sappy, and really stupid."}, {"rating": "8", "text": "It was good. I don't understand all these \"0's\". As it progressed I felt a little more detached to the story, as they could have worked on the scenes with tender ease, instead of pacing perfunctorily BUT, it didn't wimp out. The monsters where scary and insidious. Hell, I might get whiplash from this BUT, recently I was thinking about those adolescent adventures with no harness nets (nobodies safe) and two movies jumped into my head: Goonies and The Lost Boys. I thought \"why don't they make more movies like that\", and low and behold, this movie was released that Friday of that week. So I watched it, and felt it was MOSTLY gratifying as those formerly mentioned, but not completely. Comedy/Horror. Kiefer to Lost Boys, Sloth to Goonies, Ogre to Spiderwick."}, {"rating": "7", "text": "An entertaining take on a different kind of fantasy, with dark overtones that work to heighten rather than detract from the fantasy. Tho far from a great film, it's generally well-acted (and this from someone who thought Freddie Highmore's voice work in GOLDEN COMPASS was among that film's weaker elements), has a hilariously ironic final twist that I shoulda seen coming but didn't--and is that rare film that could have and should have been a 1/2 hour LONGER, for character development and a chance to fully look at some of the fascinating design work."}, {"rating": "9", "text": "A terrific family film. I've tried reading my younger brothers copies of the Spiderwick books, and they were some of the most boring children's books I've ever read. The film, I'm happy to say, is a vast improvement. It takes a little bit of time to get into the action, but once the film gets \"into\" it, it goes by at a fast pace. Freddie Highmore does a great job as Jared and an okay job at his brother Simon, and Mary-Louise Parker plays essentially the same character she does on Weeds (minus the drug-dealing). Seth Rogen's voice work is awesome, he's definitely a highlight of the film for me. I secretly wonder if he wrote some of his own dialogue...? Nick Nolte does a good job as the villain and Martin Short's character isn't on-screen long enough to get annoying. The action sequences, while a bit on the scary side, were'nt too much for my little brothers (ages 5 & 9). If your kid is scared easily, I wouldn't take them to this, but my brothers were fine. They enjoyed the movie thoroughly, and so did I."}, {"rating": "5", "text": "Another kid audience based fantasy flick with all the fantastical creatures that was actually too scary for the kid audience for which it was intended . This one gets way too violent for 8 year olds. Too many scary images. The typical story of a broken family that tries to make it in a new place and things get magically undelicious. It's just been already done so many ways so many times . The possible monetary payoff is too enticing for filmmakers to resist. Don't bother seeing it. You already have about a half dozen times."}, {"rating": "5", "text": ""}, {"rating": "3", "text": "A lot of violence and blood for a kids movie, Also, the father figure is seen as a monster. Not a very friendly movie for kids under 10."}, {"rating": "7", "text": "2 parents and 2 teenagers all enjoyed it. None of us had read the books and we were able to follow the story. Engaging story. Visually interesting. Interesting kid characters. Nothing offensive. Lots of action and danger. Creepy and weird creatures. Pockets of humor. Worth seeing. (By the way, Ben C, Anthony C, and Celia C are the same person who just wanted to vote 0 three times. Check out the identical sentence structure with the flaw of sticking two sentences together with a comma)."}, {"rating": "6", "text": "Take the kids i enjoyed this darker blend of fantasy high on thematic elements so beware.... visually stunning... another spring treat."}, {"rating": "8", "text": "Enthralling fantasy, wonderfully imaginative with excellent special effects. Beautifully done, excellent pace and exciting. Fun and very entertaining."}, {"rating": "1", "text": "Family friendly fantasy movies ...........not the sun kills his father at the end ... my 10yr daughter freeked out... i was like what the f just happen in a pg movie ... movie was just not the same after that."}, {"rating": "10", "text": "This movie is way more than i expected. The performance by Highmore is proof that he is here to stay. I cant wait for his next picture."}, {"rating": "10", "text": "I absolutely love this movie. To really understand it, you have to read the books! Yeah, that's right, their books!"}, {"rating": "8", "text": "Not my favorite, but it is my kind of movie: a fantasy with great fx and very few boring scenes that still make the story work out. And for those of you who think this movie exposes \"corruption\" in the rating system...lighten up! This movie was not underrated, although if somebody in it stabbed somebody else just one more time, it probably would have been pg-13."}, {"rating": "8", "text": "despite its dark tone, this movie impresses me as a fan of reading those books."}, {"rating": "7", "text": "This is a great movie with an intriguing plot, \"good to weird\" acting, great special effects and a whole lot of    fantasy galore.........."}, {"rating": "6", "text": "Better than most films of its ilk with better acting and a more inspired aesthetic."}, {"rating": "7", "text": "It has great atmosphere and setting, cinematography, set design, CGI and music and the actor playing Arthur Spiderwick is great. However there is a big focus on the dysfunctional family. Mallory is constantly whining and fighting with her brothers and arguing with their mother making it extremely unconformable for quite a big chunk of the movie.I didn't think the books were that involved with the emotional aspects and was more about the fantasy which is where the movie shines. Even though the movie is based on 5 books each are quite short, in total on the shorter end of young adult books, but still the film is over quite quickly. The ending comes too easily and some of the other aspects a overly heavy for a children's movie. Points gained for the fantasy, points lost for the drama and overly serious undertones and tonal inconsistency. Freddy Highmore plays two people in this film which might surprise you, thinking they were identical twins. Personally I think they should have gone with two separate actors because if you know the trick then the two characters start to blur together."}, {"rating": "6", "text": "gotta admit i thoroughly enjoyed this vivid, colorful mess. the cited references to some 80s classics like the Neverending Story, Labyrinth, The Goonies are all right but again the CGI graphics are too expected to reveal the complete fantasy aspect and in someplaces are downright disgusting.60%"}, {"rating": "7", "text": "This is a reasonably entertaining, mostly family friendly film (apart from the ocassional glance/hint at claw mark type injuries and one or two monster depictions which may scare younger kids) with some pretty decent CGI. I liked some of the plot details, like the fact that the mother eventually sees the creatures, so its not entirely a case of dismissing the kids concerns over an assumed made up entity/entities. This isn't exactly a brilliant film but its a pretty good one which will likely entertain slightly older kids and so I'd recommend it on that basis."}, {"rating": "10", "text": "It's amazingEnded melanie and TWICE and BLACKPINKI love this so muchDeserve moreee"}, {"rating": "7", "text": "It’s a fun and entertaining kids movie. One of the better ones you can watch."}], "recommendations": ["the_tale_of_despereaux", "the_house_with_a_clock_in_its_walls", "coraline", "the_kid_who_would_be_king", "nightbooks", "monster_house", "it", "rise_of_the_guardians", "incredibles_2", "it_chapter_two", "goosebumps", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "super_8", "paranorman", "astro_boy", "nanny_mcphee", "9", "alice_through_the_looking_glass", "where_the_wild_things_are", "zathura_a_space_adventure", "the_hunger_games", "maleficent", "the_croods", "meet_the_robinsons", "inkheart"]}