{
  "id": 864,
  "title": "The Mortal Instruments: City of Bones",
  "starring": [
    "Lily Collins",
    "Jamie Campbell Bower"
  ],
  "runtime": 130,
  "genre": [
    "Fantasy",
    "Action",
    "Mystery"
  ],
  "description": "In New York City, Clary Fray, a seemingly ordinary teenager, learns that she is descended from a line of Shadowhunters — half-angel warriors who protect humanity from evil forces. After her mother disappears, Clary joins forces with a group of Shadowhunters and enters Downworld, an alternate realm filled with demons, vampires, and a host of other creatures. Clary and her companions must find and protect an ancient cup that holds the key to her mother's future.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fspW2P3ggzBjdIw5HpJOw8HKtQK.jpg",
  "categories": {
    "plot": 5.131578947368421,
    "acting": 4.809523809523809,
    "ending": 1.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 2.5714285714285716,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "wow, take Constantine, mix it with twilight and add some Buffy the vampire slayer, what you get is a poor excuse for a movie, with action scenes that are all over the place and 2 main characters that you just don't give a damn."
    },
    {
      "rating": "3",
      "text": "This film doesn't catch you. I read the book and it's so good, I love it, but the film doesn't translate the great history of the book to it. I don't recommend this movie, it's so bad, it changes ALL of the book. Almost all actors don't catch the feelings and personality of the real characters. The end is the worst part, the beginning is normal. I hope they cannot do the sequel of it"
    },
    {
      "rating": "1",
      "text": "I read the first book and unfortunately that is as far as I will go with the series. This movie was a big disappointment for me. The story line was jumbled and sections of the book were moved around and important parts were completely omitted. The end was nothing like it was supposed to be and I was overall let down by the movie"
    },
    {
      "rating": "2",
      "text": "Really disappointed. The books were much better. They took a lot of small important details that made the books great out of the movie and crammed it all together. A person who hadnt read the books couldnt even get into this garbage.. I waited forever for this (horrible) movie. If i were the author id be ashamed, they  ruined her books."
    },
    {
      "rating": "9",
      "text": "The books are always way better than the movies hands down, but I have to say that I really enjoyed the movie. It has been a while since I read the book, so I am not sure if they left out any important details. I was a bit worried when I saw the preview, but I have to say this is way better than Twilight and if I didn't have a child I would be seeing this a lot more then one time in the theatre. I am very annoyed by the critic's reviews because they have clearly never read the book. This is one of those movies that if you haven't read the book you will not understand the story."
    },
    {
      "rating": "9",
      "text": "The critics are nuts. This is nothing like Twilight! Though if you want to compare it t others it is a cross between Harry Potter, Star Wars, Buffy the Vampire Slayer with a little bit if Dungeons and Dragons. And yet it is NOT those  and is an enjoyable movie all around. It is an excellent action-fantasy and is very funny without being a comedy. I highly recommended it!"
    },
    {
      "rating": "3",
      "text": "This below par book adaptation is not only poorly acted, miss-cast and badly adapted it barely resembles the story. The humour is gone, the chemistry is lacking and the best aspect of the book (ie the reveal of this unseen world) is glossed over. Only truly delusional fans of the series will praise this mess.\r There was some good action and visual effects and I also acknowledge that the director had a limited time to introduce so much. But with a history like his we could have predicted this shallow interpretation when the source deserves more."
    },
    {
      "rating": "10",
      "text": "it's amazing, I love the books and the movie was perfect, everybody should watch more soon possible and please ignore the most critical and comparisons, really worth watch"
    },
    {
      "rating": "8",
      "text": "If you have read the book, you will love this movie. Harald Zwart has managed to create basically the book on the screen. With including all the important scenes (they switched the order but still included it all), it made it a very enjoyable movie to watch as a fan of the book! However, if you are not a fan of the book, it may be a bit confusing. Some of the exposition given by Magnus was boring and it dragged the movie a bit but overall, I believe they did a good job! So if you can ignore some script awkwardness and a bit of story dragging, I think you should go out and watch the movie because I am personally looking forward to the next one!"
    },
    {
      "rating": "7",
      "text": "I'm rating  this based purely on how much I liked the movie.  If I focused on plot gaps or script awkwardness, my rating would be much lower.  However, I watched this (yes, I actually watched it it, unlike, I suspect, the writers of earlier user reviews) purely for kicks.  The kick of a hot young cast, with hot older supporting actors, battling it up fantasy-style in New York.  The CGI was impeccable, the action fun, and the script mostly not cringe-inducing.  That is more than can be said for your typical YA movie.  All in all I got what I came for-- fun."
    },
    {
      "rating": "10",
      "text": "You critics don't know what you are talking about. Lets get one thing straight, Twilight does not rule any other supernatural movie franchise. So stop comparing it to The Mortal Instruments etc. Twilight was a love story. TMI is much more than that. As far as I can see if you don't love sci-fi, action, romance, comedy, fantasy in one novel and movie. It's not for you. But don't bash it because it didn't meet your needs. TMI will always have it's book fans and they will grow from fans of the movie and be supported. Shadow Hunters are not going anywhere. Oh and to the person who said that Cassie stole ideas from other novels/movies. Why are you not bashing every vampire, werewolf, witch etc. film/tv show or book made? Those ideas were ledgends already here before you were born. So no one stole any 'idea'. I love the books and the movie. x"
    },
    {
      "rating": "10",
      "text": "Surprinsingly a great movie. I went to watch it expecting another twilight wannabe, but in the middle of the way I was completely sold for this. I can't wait for the next movie."
    },
    {
      "rating": "4",
      "text": "I know people don't want to hear this, but lets the facts, it's a combination of \"Twilight\", \"Harry Potter\" and possibly other books series that you might have loved. There's nothing new here, it's just the next big teen movie. If your a girl and love \"Twilight\" then you'll absolutely adore this movie. If you're like me and were disappointed with its lack of originality, then you'll probably hate this movie. Overall, it's from book series that you've read before. Be sure to check out my YouTube channel \"TheMovieManLife\"."
    },
    {
      "rating": "9",
      "text": "I'm glad I don't listen to the movie critics and give this movie a chance. I haven't read the book yet, but I enjoy the movie, love the story, even though it's not perfect. There is a part that I don't enjoy so much, i think they should change the script writer. And a song by Demi levato, kinda ruined the mood of the movie, which is more goth and moody. But overall I like city of bones, and I'll loved to watch city of ashes if they make the sequel. There's a lot of potential, they only need to work it better."
    },
    {
      "rating": "0",
      "text": "I loved the book I was so happy there was movie coming out. So I went to see it when it first came out and I was devastated the movie was awful and nothing like the book everything was changed I hated it. Way to ruin a book and it's characters."
    },
    {
      "rating": "0",
      "text": "This movie was the worst book to screen adaptation I have ever seen like, it was worse than Eragon they could have could have continued with the inheritance series movies but they chose not to, it is aso like the Percy Jackson movie they pull things from other books I mean sure its little things but still its enough to ruin the movie for you if you have actually read the books. So I don't think that Cassandra had any say in the writings for the movie what so ever and I'm pretty sure that they are supposed to consult the author of the book for her ideas on how she wants it. The only part about it that I liked was the midnight flower scene, I think that that is the only thing that they got right. Also I would have went with a different actor for Jace and Alec. So in conclusion I don't think that they should make the second book into a movie, and I'm sure that after seeing the first one Cassandra won't sell the rights to the second book. That was the only reason that they didn't continue with the Eragon movies."
    },
    {
      "rating": "7",
      "text": "The movie it's entertaining, it got holes in the storyline, and its a little bit different to the book. However, its not something that we haven't seen before, but its enjoyable and you will have a good time watching it. And besides, it's a movie for the youngest people, for the fans of the books, not for an Academy Award."
    },
    {
      "rating": "9",
      "text": "The book will be a massive hit with book fan base, although it has a fast past plot and  skips out some details and relieves  some details too early. It is not just a film for teen girls. It has many leading male characters and has plenty of action."
    },
    {
      "rating": "0",
      "text": "I went in to City of Bones thinking it was going to be a terrible movie, but it turns out I was wrong, it was worse. Before we get too far into the review, I will say that I have not read any of the books so there will be no comparison at all in this review. The film straight out rips off Twilight, Harry Potter, and Buffy the Vampire Slayer, all at the same time. You would think that with all these good ideas already existing they could put together a pretty good movie, but I found myself already tired ten minutes, in with another 90 minutes to go.\r City of Bones is the story of Clarissa Fray (Lily Collins) who learns that she has special powers and is a shadowhunter. She meets Jace (Jamie Bower) who has a British accent, and together they fight monsters in New York, that only they can see. It's impossible not to see Twilight in this film because there are just so many similarities. A couple hours ago I checked the Rotten Tomatoes score of the film and it reminded me of MySpace. A couple years ago it would've been hot, but today no one likes it or should see it.\rMortal Instruments: City of Bones was just cheap. Cheap special effects that weren't impressive, cheap acting, and a lot of extra false drama incorporated into the film. For example, there was a scene within a few minutes of the start, where Clary's mom picked up a creepy note on the table and the whole family freaked out, like three times slower than a regular persons reaction. From that time, through the rest of the movie, I felt like I was watching a bad soap opera.\r The romance felt fake and was at the most random times. Since Twilight had romance, this film had to have a poor copy of romance too. I mean seriously, at least Twilight’s romance was more convincing and made sense. Oh and by the way, Jace was also in all three Twilights and Harry Potter. REALLY?! When I found this out, it reminded me one of those shows where the employee works at their competitors company so they will get all the secrets. Except it didn't help, City of Bones was still crap.\r With the colon in the title, it hints the production of another film in the series, which kills me. Hopefully viewers will know the quality of this film, and won’t waste money with the next installment. I felt like this movie belonged more on Nickelodeon, then on the big screen. With no originality, false drama, bad acting, even worse special effects, and soap opera qualities, it’s a no brainer that City of Bones is one of the worst movies I have ever seen, and will obviously not be recommended."
    },
    {
      "rating": "10",
      "text": "A great book-to-movie adaptation of an already much-loved book series. The cast is amazing and so is the plot which has no more than a few changes to it compared to the book."
    },
    {
      "rating": "1",
      "text": "The movie is a complete mess. And this is coming from a major teen fan of the book series. I never got into the twilight series or hunger games series much but once I started reading these books, I couldn't stop. The books were fascinating and followed a clear story line. But the movies, they just flipped from one book to the next and added things that NEVER happened in the books! The rune? That was made up. She made a binding rune and destroying rune, not a freezing time rune. Summoning the demons? That happened in the plains of Idris. Not the Institute. The fake cup? Um no. He got the real thing and summoned the angel. One minute, they were kissing (First book, chapter 11 or 12)and the next, Valentine had the cup. (Book 2 or 3). If they make a sequel, I sure hope it's a clearer story line.  I do give this movie a one for it's humorous parts. Just remember, this is coming from a teenage girl."
    },
    {
      "rating": "1",
      "text": "The book is the good, but the movie is... awful. Bad performances, regular cast, terrible script, the only good are the effect, but the rest is terrible. The Mortal Instruments: City of Bones is bad, bad, bad..."
    },
    {
      "rating": "10",
      "text": "As a fan of the book, I found it really great. The scenes and the cast was perfectly catch from essence of the books (of course the book is way better than the movie, but as a fan, I can say that they tried so hard to be loyal to the source). Somethings are really missing, but I hope the director put it on the second. I had a good time watching it. And as a have read here, it's a movie to the fans and the young people, or everyone who likes this kind of story."
    },
    {
      "rating": "3",
      "text": "I liked the book a lot, after having just seen the movie, i have a red hand print on my face from the constant face palms i gave myself. I knew going in that not everything would be like the book, but this was bad, like \"Eragon\" bad. (Eragon was such a bad movie adaption they couldn't make the sequels)\r For the most part, I thought they did a good job on the casting. The acting might not have been so great, but at least looks wise, everyone looked the part. The one glaring exception was having Jonathan Rhys Meyers as Valentine. In the book, he was described as being tall, muscular and broad shouldered, with short greyish hair. He was always calm and collected and often dressed in a suit. In the movie, Valentine was portrayed as small, and skinny like Jace, with a little chin and mustache scruff, not to mention dark, almost black hair, with weird little rat tail braids hanging all over. He was also dressed in a black leather biker jacket with no shirt underneath. He was also highly emotional and out of control. On a side note, i thought the guy that played Magnus was horrible as well,  from a cosmetic stand point he might have been ok, but his acting in the few brief minutes he had, was worse then Hayden Christensen as Anakin Skywalker.\r How anyone that read the books could enjoy this movie was beyond me. They didn't even introduce us to Raphael, the lead vampire that cautioned them from the Hotel Dumort.\r Maybe the budget was tight, and they couldn't afford to film at a new location, but the final battle between the werewolves and Valentines Forsaken warriors, would have been a nice reprieve. Instead, the final battle takes place at the institute( holy ground) which kinda negates the entire point of the place, and its the werewolves vs crow/fire demons (which can be killed by a flame thrower apparently), which sounds cool....except the werewolves can't transform, they just kinda stand there like \"ok, what now?\" as they get picked off one by one. Even if i never read the book, i still would have hated the movie.\r At least Jace and Simon's banter was funny at times."
    },
    {
      "rating": "4",
      "text": "In the end, The Mortal Instruments: City of Bones is yet another would-be franchise trying (and quite likely failing) to fill the post-Twilight void. Even with a richer, darker, more action-packed premise; a more intriguing world; and a cast featuring some quality UK thespians with actual acting chops in the leads, there is just no denying that the story and the movie are both sub-par, forgettable  and worst of all, crushingly boring by the end. Bury this one under a city of bones, and tell the cast to seek more lively pastures."
    },
    {
      "rating": "10",
      "text": "This is where I start stressing the importance of opening week/end. It’s very important that you see The Mortal Instruments: City of Bones opening week/end  Wednesday through Sunday. We need this film to do well in the box office the first week to ensure future movies. You want to see more Mortal Instruments movies, as well as Infernal Devices movies, right? Then go see The Mortal Instruments: City of Bones multiple times this week and bring your friends and family with you and keep spreading the word. It’s time to show the mundane world that the Shadowhunters are indeed a force to be reckoned with. As Jace says, “Have a little faith!”\r Lily also encourages fans to see it multiple times opening weekend!The movie is amazing! Don't compare Mortal Instruments: City Of Bones to Harry because the don't have the same story. Give them a chance to have a sequel so they can correct their mistakes."
    },
    {
      "rating": "9",
      "text": "Very good book adaptation, all the actors protrayed the characters very well. The special effects linked to what was described in the book.  Overall a very good movie and would gladly see it again"
    },
    {
      "rating": "8",
      "text": "Great book to movie adaptation. My husband never read the books, found the movie \"better than expected\" and \"will definitely see the squeal.\" It could be hard to catch up with the new terminology and a little jumpy- always room for improvement. The cast was picked perfectly and caught their personalities very well. Altered a piece of story so i'm not sure what to expect next. Won't be as big as Hunger Games, but better than Twilight. Try to see it at least once!"
    },
    {
      "rating": "9",
      "text": "I was satisfied with the adaptation, as a fan of the books I had my hopes a little up. I liked it very much and I am looking forward for a sequel, though I am hoping they improve one thing or more. I was a little disappointed by some of the cast performances, specially Magnus Bane.\rSo, again, I really liked this movie, and I really hope they continue the series, and if they do, I hope they make the next movies better.\r P.S. Please forgive my english."
    },
    {
      "rating": "7",
      "text": "One of those fun and underrated  movies that never got much hype. This was actually a good movie. Takes you into an underground would adventure full of odd characters nobody else can see. I never read the book, but that did not stop me from enjoying it. This is much more interesting than the first Hunger Games."
    },
    {
      "rating": "9",
      "text": "I was expecting this movie to be a lot worse then it was. I enjoyed watching it the same if not more then reading the book. Yeh they changed a few things but nothing dramatic enough to change the plot. There was only one part that I felt could have been done better, but even then it was entertaining to watch. Other then that I loved this movie! I really hope they make a sequel."
    },
    {
      "rating": "1",
      "text": "Probably one of the worst movies I've seen in a long time, how there are some people who have given it a 10 is beyond my comprehension.\r I'll start by saying that I never read the book and am not really interested in doing so now, I saw the trailer and immediately thought this was a the next franchise to try and follow Twilight's footsteps, but seemed to be a little less \"teen supernatural romance\" than twilight and would be at least a movie a guy could sit through if your girl who wanted to watch it. I thought I knew what I was getting myself into but boy was I wrong.\r The movie has an \"ok\" premise in the beginning, and it doesn't start that bad but somewhere along the lines everything goes to hell, ridiculous plots emerge, the story then just goes everywhere and nowhere at the same time, it gets so bad it starts to get funny just watching how lame and predictable the story is.\r You can tell they took parts and pieces from other successful book-movie franchises and just splattered them in this; you can even see Hogwart's infirmary inside the institute that resembles Hogwarts a lot, there's a love triangle just like \"twilight\", the group of good guys are pretty much out of twilight (just take off the fangs and give them weapons), the whole shadow-hunter thing is pretty much Constantine for teens, hell they even have wand like thingies that glow that look a lot like Dr. Who's Sonic Screwdriver\r Some scenes are so unnecessary that if you think about it for just one second you can tell they make no sense being there (they almost seem that they literally took what was written in the book and did the scene as is, instead of doing some screenwriting to make it fit in a movie), the two worst parts of the movie have to do with the big \"Twist\" near the end:\r1) When Valentine reveals that Jace and Clary are brothers; after you had to go through a cliched scene where they sucked face (by the way the kiss scene was one of the worst scenes and so poorly done), which I just thought was wrong in so many levels, and in the end Jace and Clary seem not to even care about their incestuous kiss and feelings and simply dismiss them as \"I don't really think we are\" (would have been ok with it if during the movie they had only seemed to have feelings for each other and didn't kiss so in the end you didn't know whether those feelings were attraction or family love and or if Valentine was lying or not)\r 2) Again when Valentine tells Jace he is his son, Jace doesn't believe him and shows him his father's ring with a W (Wayland his family's name), and then Valentine grabs the ring and turns it around so its an M (Morgenstern, Valentine's last name) I swear everyone in the theatre laughed at that moment, it's like:\r-Valentine: see?, if you turn it around its and M not a W\r-Jase: Oh my god! You're right! I've had this ring for ages and never did I ever see that if you turned it\raround it would have an M instead of a W. That is all the proof I need, I totally believe you!\r The plot twist was just so poorly executed it was laughable.\r In the end what could have been an OK franchise; grabbing what made Twilight successful (a supernatural love plot oriented for teen girls) and adding some action with other supernatural beings that weren't all all hopeless romantic on the effeminate side, it turns out to be even worse than Twilight (never thought I'd say that) with obvious plots and twists, poor writing, and characters that just come out bland\r I'm not sure if the book is written as poorly or if its just a very bad adaptation, but I really don't recommend this movie to anyone who is not a teenage girl, believe me when I say \"You will loose 2hr & 10min of your life\" you would rather spend on \"anything\" and y mean \"ANYTHING\" else"
    },
    {
      "rating": "10",
      "text": "I loved it, and I read the book.  I thought everything was great, the set, the props, the acting, and the cast.  The plot might of be iffy with Valentine, but I think if everyone tries hard in the next movie to make it as close to the book as they can, it will turn out great.  This is not another Twilight romance!  Twilight was a romance story, this is a full on story, and like any other good book, has some romance in it.  A lot of the big critics are just sick of seeing fantasy movies, well get over it because fantasy and sci-fi will never stop with teens and tweens."
    },
    {
      "rating": "5",
      "text": "The writer of this series of novels (and this subsequent movie) is cashing in on all the fantasy tropes: demons, witches, vampires, werewolves. A young woman (Lily Collins) becomes intertwined with Shadowhunters, who are out to save the world…but wait, she's also torn between two handsome men…starting to sound familiar? The maze of characters just gets ridiculous. There are some cool fantasy concepts and special efx, but the plot is cluttered and the action is unfocused. There must be an audience with the book fans, but for everyone else, it's just a flashy mess crammed with complications."
    },
    {
      "rating": "2",
      "text": "So I'm going to try and write a review that doesn't contain a plethora of grammar mistakes that make me look like I'm from a third world country and actually discuss why this movie garnered a whopping 2 out of 10.\r Having never read the books nor having a desire to watch this film, I have never witnessed such a piece of cinematic debauchery within this current decade.  Knowing that this film is geared towards younger audiences and knowing that the film contains more drama than there would be action I prepared myself for something that would put me to sleep, and boy was I wrong.  This film did its absolute best in filling me with nothing but plot devices and special snowflake syndrome to make me hurl my bunches of crunch at the screen.  The only moment in this film that I thought any character on screen had any sense of rationalism was when Simon declared the relationship between Clary and Jace ludicrous on the immediate attachment by Rico Suave not 72 hours after meeting one another.\r I didn't care that there were vampires or werewolves or anything of the like, what disappointed me was for the underline title of City of Bones, I saw next to nothing relevant to this title other than the brotherhood of eyeless mutes who had a screen time of 3 minutes.  If screen time for the celibate skeletons weren't enough than the short-bus of werewolves coming to save the day was even worse as they serve as nothing more than cannon fodder to be quickly picked off and leave only a main side character as the only survivor.  Lets not forget the Heroic Sacrifice? of Hodge going toe to toe with thing #1 and then needlessly sacrificing himself to the birds as a way to make up for having aligned himself with evil and causing all this  to happen in the first place.\r Now the fighting aside from the endless vampire horde was actually pretty interesting all things considering,  I even found myself cheering on Simon as he hit Ms Cleo upside the head with a shovel, but it wasn't enough to save this film from the obvious heartache of having to condense a novel of this size into a bite size 2 hour film."
    },
    {
      "rating": "10",
      "text": "I am a huge fan of the books so the movie is a no brainer. Its the bestbook to movie adaptation I have ever seen. So much better than twlight and  Jamie as Jace is perfect cannot wait for the second one."
    },
    {
      "rating": "4",
      "text": "Awful scenario  stupid dialog  disaster in a fiction! Yeah, action is good, but it's nowhere near enough!  City of Bones  is too long (too boring), mediocre movie at best."
    },
    {
      "rating": "10",
      "text": "The movie is audacious, comparing to other teen adaptations. The acting is really something that highlights this franchise. All audiences will like it."
    },
    {
      "rating": "10",
      "text": "this movie is more than amazing and its a really goooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood adaptation better that Harry Potter and Hunger Games, i will not mention twilight because f*ck twilight, The Mortal Instruments:City of Bones is really gooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood, very recomended"
    },
    {
      "rating": "1",
      "text": "The book is not so good... The movie is even worse!\rHarald Zwart proves again: He don't know how to make movies!\r Don't spend your money on this!\rPass away, far far away..."
    },
    {
      "rating": "10",
      "text": "Don't pay attention to the critics. The Mortal Instruments: City of Bones was a really good adaptation of a fun and well-written YA Fantasy book.\r Critics complain about how it's like a combination of Harry Potter meets Buffy The Vampire Slayer meets Percy Jackson meets Twilight. Everywhere they look, a plot point is \"borrowed\" from these other works.\r So what? The books were actually well-written (unlike some OTHER popular books in this genre. Yes, I'm looking at YOU, Hunger Games and Twilight.) And the movie adaptation was well done, in large part thanks to the excellent casting. It is rare to find young actors who have this much chemistry on screen. (This is a large part of why the Twilight movies were so awful, and why the Harry Potter and Hunger Games movies were so successful.)\r So, if you harbor an affection for YA sci-fi or fantasy, don't let the haters keep you away. This was not a B-movie, not a hodge-podge of incongruous plot points, and not a rip-off of other genre films. (In fact, many \"dangling\" plot points are there precisely because this is the first in a six book series. They eventually resolve! And I'm glad they got left in the movie, even if they would make non-book readers leave feeling like there was still a good bit of unresolved mystery.)"
    },
    {
      "rating": "10",
      "text": "I loved the book and I loved the movie! I don't know what all of these critics were watching but I would see this movie 10 times over!! It was AMAZING!!! So worth it!"
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie. The books have a great story line and I think the director did a wonderful job at displaying that in the film. I don't think that there were too many twists in the movie. I found that the entire time I was watching it I wanted to know what happened next. Where as usually I don't get that interested. I don't know exactly what about the movie,critics didn't like but the only things that I have heard bad about it is that it had too much crammed into it. I feel just the opposite. I have read the books and if anything they could have added more to the movie. I like to watch movies that keep me entertained not bore me to sleep. The whole point of having a young adult book or film is to have a really great story line so you keep your readers into it. And I don't care what anybody else thinks this movie had a great story line!"
    },
    {
      "rating": "1",
      "text": "Completely derivative movie where nothing pays off or even makes much sense. A series of things happen in this movie though it is all flat, shoehorned, and copy/pasted from other, better, films. Attempting to hide poor writing and utter nonsense behind the \"this is a book for kids\" defense is insulting to actual good movies and children everywhere. One point for offering some of the most unintentionally hilarious bad movie moments in recent memory."
    },
    {
      "rating": "1",
      "text": "Well... once again a piece of derivative garbage is vomited across screens around the world. It's sad that this will be occupy theatres instead of films far more worthy. Please don't waste your time."
    },
    {
      "rating": "10",
      "text": "It's fun, full of action and the effects look awesome. The young actors are as amazing as the older one, and we have the always amazing Jonathan Rhys Meyers, Jared Harris, Lena Headey and CCH Pounder in it!"
    },
    {
      "rating": "10",
      "text": "I don't know about the critics but this is a franchise based movie, with the majority of it's audience already being avid fans of the books. While it doesn't make much sense to the mundanes, let me assure you it makes total and perfect sense if you cared enough to know the back stories.\r They did the best they could in the brief amount of screen time they were allowed and from a fans point of view they not only succeeded in quoting from the book and creating the perfect atmosphere for our Shadowhunters. They were able to include every little nook and cranny that caused so many of us to fall in love with the books in the first place."
    },
    {
      "rating": "3",
      "text": "So I do not often agree with the critics... I usually agree with the users, but I must say this movie is not one that I would recommend unless you are a teenaged girl in need of some dark Gothic type of  romance, then I might possibly  see some merit to this movie. The acting so so, story line so so, and special effects just o k. If you are a young man I would recommend that you do NOT attend this with your teen girlfriend you may wish you had not spent the money or the time...."
    },
    {
      "rating": "7",
      "text": "Surprisingly interesting, in a world where 'Percy Jackson's' are released every year, and say by the way are nothing exciting, 'The City Bones' is at least worthy of respect and attention.\rClary seems to have a lot to present, as well as your friends."
    },
    {
      "rating": "10",
      "text": "I haven't read the series, but I just finished watching 'The Mortal Instruments': 'City of Bones' and Loved it.  I wish there were more supernatural movies.  Its unfortunate that book lovers slam some movies that are based on the Novels they have read.  When it comes to novels being produce into movies it's hard to make readers happy.  Maybe that's why I'm not so much into reading as much as I am into watching a great movie or two, or three, (Trilogies Rock) I like to believe I have a pretty great taste in movies and this one should definitely be on everyone's  watch list.  Looking forward to watching this trilogy and will pray and hope it does not get cancelled! GO TEAM GO! I have faith you will get more followers!"
    }
  ],
  "recommendations": [
    "vampire_academy",
    "eragon",
    "percy_jackson_sea_of_monsters",
    "the_chronicles_of_narnia_prince_caspian",
    "the_golden_compass",
    "the_twilight_saga_eclipse",
    "the_hobbit_the_desolation_of_smaug",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "dreamcatcher",
    "artemis_fowl",
    "the_twilight_saga_new_moon",
    "the_twilight_saga_breaking_dawn_part_2",
    "ready_player_one",
    "the_maze_runner",
    "the_hunger_games",
    "city_of_ember",
    "it_chapter_two",
    "inferno",
    "the_da_vinci_code",
    "i_am_number_four",
    "the_dark_tower",
    "the_hobbit_an_unexpected_journey",
    "maze_runner_the_scorch_trials",
    "batman_v_superman_dawn_of_justice",
    "divergent"
  ]
}