{
  "id": 3361,
  "title": "The Rhythm Section",
  "starring": [
    "Blake Lively",
    "Jude Law"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "When she discovers the plane crash that claimed the lives of her family was no accident, Stephanie Patrick enters the dark, complex world of international espionage seeking vengeance. With nothing left to lose, Stephanie transforms from victim to assassin and discovers that neither revenge nor the truth are what they appear.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/spTr0VYyRtl36Lkk6nCnnbFXhus.jpg",
  "categories": {
    "plot": 4.65,
    "acting": 4.923076923076923,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 4.1875
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Blake Lively had enough “presence” to keep me interested in her performance, but the director lets her down by not making the pace furious enough and the screenwriter by not making the plot interesting enough. Her character’s desire for revenge seems real for about 15 minutes, but most of the time she is as much the hapless victim of dumb situations as fearsome avenger. Sadly, Jude Law’s character is merely a plot device to keep things mindlessly limping along, and you feel more sympathy for the graphic physical beating Lively takes than for her sadness and psychological pain."
    },
    {
      "rating": "10",
      "text": "What a great character development film. This is not about action, explosions or crazy murders. Is about someone that is at the bottom and developes an amzing \"armor\" in the inside and tries to revenge her family. The direction is genius, the pace is slow so that we can try to catch the story. good job"
    },
    {
      "rating": "3",
      "text": "The writing is lazy - major plot points are reached without any real buildup and stiff characters are difficult to root for. Save for a few stylish action sequences, there is very little here to garner a viewing."
    },
    {
      "rating": "6",
      "text": "In his first screenwriting effort, Mark Burnell seeks to expand the action movie genre.  He and Director Reed Morano (“The Handmaid’s Tale” TV series) succeed, but only partially.  “The Rhythm Section” is based on the book by the same name, one of four in Burnell’s series of Stephanie Patrick novels.As the film opens, Stephanie (Blake Lively) is a drug-addled prostitute grieving the loss of all her immediate family in a plane crash.  An investigative journalist informs Stephanie that there was a bomb on the plane.  Stephanie decides to pull herself together and go after those responsible.  Along the way, she’s mentored and trained by the enigmatic “B,” (Jude Law).  Mayhem ensues.“The Rhythm Section” uses two structural elements to push the boundaries of the genre.  First, it’s an action movie where there’s no real action in the first 50% of the film.  This creates the risk that the typical adrenaline-obsessed audience member will become bored.  But it also creates the opportunity for actual character development.  There’s time for Stephanie to discover her resolve, realize that she’s not very good at being a killer and, over time, improve.  This is actually a refreshing shift from the boxer who does four push-ups, runs up the steps of the Philly Art Museum and is fully prepared to fight for the world championship.  (Yeah, I went there.)The second structural difference is that Stephanie, instinctively, is not a very good killer.  This allows Morano and Burnell to frame her initial assignment in a very non-traditional way, focusing on her sheer terror, not giving her the cold, emotionally distant competence we’ve come to expect from these characters.  In that sense, Stephanie becomes less superhero and more Everyman.  It’s an interesting premise – what would happen if the average person decided to train to kill people.Lively and the supporting cast are first-rate.  Lively’s performance makes a strength of her character’s inner contradictions.  Jude Law goes against type, taking a break from playing the Pope (“The Young Pope,” “The New Pope,” “Pope Springs Eternal”) and Sherlock Holmes’ sidekick.  Sterling K. Brown (“This Is Us” TV series) takes a break from hunky vulnerability to embrace a role which suggests that males, shockingly, are not always emotionally accessible. The problem with “The Rhythm Section” is that it ultimately will frustrate almost everybody.  People wanting and expecting an action movie won’t have the patience to wade through all this character development.  People coming for an atmospheric character study will find the last half of the film much too predictable.  Hence its box office bust.Having said all that, this is the type of film that deserves interest, not condescension for its obvious flaws.  We say we want Hollywood to offer rethinking of a genre and not reboots, character development and not just cartoons.  “The Rhythm Section” actually makes that effort"
    },
    {
      "rating": "6",
      "text": "Blake is good but the story and execution is really incredible and far fetched! I suspend reality at movies but let’s be serious hooker to killer in no time!! PLEASE!"
    },
    {
      "rating": "4",
      "text": "When the movie starts, Blake Lively's character is a junkie prostitute. She's sunken to these depths because her family was in a plane crash. Turns out it was actually a bombing, so thru a series of unlikely events, including intense training by ex-MI6 agent (Jude Law), she sets out to wreak revenge. Unlike Jennifer Lawrence in Red Sparrow and Scarlett Johansson in several recent movies, Lively doesn't become a superhuman-ish hero. She remains vulnerable, physically and mentally, but still manages to thrash thru some physical feats and acts with continual intensity. Sadly, nothing about this film is especially exciting or surprising."
    },
    {
      "rating": "4",
      "text": "I thought this movies plot on paper was ok but movie itself had too little action and quite long scenes between and at times it just got boring. Even if we consider it not action movie I still didn't feel it that interesting about the main character and how the story was portrayed in movie. Doubt will even remember I watched such movie in few months. Basically meh - not bad, can watch it, but nothing special at all"
    },
    {
      "rating": "0",
      "text": "J'aime beaucoup Blake Lively, cette grande et athlétique blonde qui aurait pu faire une 'Atomic Blonde' stupéfiante... mais la place était déjà prise par une autre blonde très étonnante et disons-le, nettement plus convaincante !Car si Blake est très lovely et surtout désireuse de faire l'actrice haut de gamme et psychologique dans quelque rôle recherché (de composition ?!) elle n'est pas encore à la hauteur... Il faut dire que son rôle a été écrit par un ou des stagiaires et que le film entier sombre dans le ridicule et fait vraiment trop penser à une certaine Nikita bien de chez nous : souvent imitée mais jamais égalée... Jude Law qui profite du poids de ses années pour apparaître plus mûr (et moins beau gosse superficiel) endosse le rôle du formateur et... et après j'ai pas mal usé de l'avance rapide pour tout dire... puis j'ai arrêté, car il ne se passe quasiment rien là-dedans... déjà qu'il s'agit d'un mauvais, très mauvais psychodrame mais en plus, ça se traîne. Lamentablement. De graves problèmes de rythme dans cette vengeance sans rythme ! et sans intérêt."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)Spy and killer by chance, then the phases of training and hunting men through apprenticeship steps, skills superior to those of professionals and so on according to an action script seen too many times. \"The Rhythm Section\" noteworthy is the dated one of Maureen Tucker and John Cale in \"I'm Waiting for the Man\" (Velvet Underground 1967) and that of \"Where Did You Sleep Last Night\" in the Sleigh Bells' cover."
    },
    {
      "rating": "3",
      "text": "It's probably easier to talk about the things Friends and I liked about this movie since the list is so short. I first want to draw your attention, dear reader, to the fact that the trailer for this movie was very pretty. You too may have noticed the copious wigs that Blake Lively wears and think, hey, I haven't seen a good wig movie since Colossal--or wait, was it The Hustle? Did they both have Anne Hathaway in them? Am I confusing The Hustle with Hustlers? Is she also in American Hustle or is that Amy Adams? She's going to be the Head Witch in that Roald Dahl movie this fall. What's it called? The Witches, right--and if you were thinking that you too are probably the demo for this movie.  The greatest strength of this movie, whose screenplay is written by the same person who authored the novel, is the central gimmick of the story: fish out of water/fish learns in extended first act how to do the broad strokes of assassin work/still occasionally makes mistakes/falls out of fishbowl. Lively's character is almost purposefully amateurish at action heroing, which leads to some important blunders early in the movie, like when she lets the probably maybe bomber who killed her family get away from his lunch and then go into hiding. Her inexperience creates the gritty aesthetic to all the fight scenes: an objective lens to violence, slow, and painful hits, brawls, and slugs to the stomach of disabled terrorists, the slapdash tumble in the bus. For Friends this was off-putting and I think for them it made her seem really dumb and clumsy, but I'm a fan of a good brawl in favor of the glossy, photoshopped, over-choreographed fight scenes of my youth typified by movies like The Matrix and Crouching Tiger, Hidden Dragon. Give me a Drunken Angel any day. (On this point, I will say that there are some movies that do a really great job of choreographing fight scenes in fresh ways like Sisters Brothers, where the drama isn't in the fight so much as the ability of those wielding such power to deal with the emotional consequences of their destruction, or even something like Birds of Prey, where the power of luck and accident is powerful and creates humor and tension in the fight. 1917, for all its faults and emptiness, wasn't shy about stripping bare the unromantic elements of warmaking. It would honestly be kind of fun to plot out on a graph all the movies of the past two years on a scale from completely choreographed, romantic to ultra-realistic.)The car chase scene is also pretty lovely and a nice walk down memory lane for anyone who's been thirsty for Northern Africa since Only Lovers Left Alive. Thus ends the list of things we liked. I'm going to include a section for light criticism and questions at the bottom if you're in the mood to inform:I lost track of the bombmaker toward the end of this movie in the scene where Blake breaks into his house but then is interrupted by the entrance of an unknown extra terrorist guy. When she shoots a bunch of people in that apartment, I honestly thought that she'd at that point completed her mission, and didn't even realize we were still looking for him on the bus. So when she gets to the bus and the wife with the suicide vest is there it feels really jarring, like someone's made an impossible phase shift or time has passed supernaturally quickly. Blake's major thing was being a linguist but she hardly speaks any other language than English. Most of her skills from \"being top of her class at Oxford\" don't seem to come in handy, which leads me to believe that we're all just a dead family away from showing up in the cheapest brothel imaginable. (Spoiler:) Sterling K Brown's disillusioned ex-CIA monologue was an intriguing look into the psyche of a broken agent, but once we get that he’s the villain it feels vapid and obvious. I liked him better when he was a sexy go-between. It also makes Jude Law's identity and the source of all of his information feel really unresolved at the end of this movie. Blake herself shouts at him through the phone during their winter sequence, \"How could you know that? Who's giving you this information?\" and I for one am also still not entirely sure how he has received all of these case-busting tips about currently active terrorist cells. Besides still wondering how Jude Law knows what he knows about U-17, is the spy he killed his wife or...? I kept waiting to be spoonfed the past relationship between him and the agent whose identity Blake is taking over, and then it never came, so I now feel pretty stupid about all of that backstory. Anyway, it will not live up to your expectations unless your expectations were that the first forty minutes are mostly really forgettable and that you could probably walk into the movie cold about three quarters of an hour in during the training sequence and still have a really fun time."
    },
    {
      "rating": "7",
      "text": "This movie is more of a 6.5 for me but I’ll be generous and give it a 7. There are parts of this movie I liked but the plot got a little weak half way thru the movie. I don’t understand the negative reviews."
    },
    {
      "rating": "5",
      "text": "Took too long to get going. a revenge movie that has an overlong beginning of protagonist in despair then long sequence of stumbling into getting ready and \"anti terrorist training\". somewhat realistic I suppose in that it shows what kind of happens when \"ordinary\" people aren't really ready for dangerous situations.  a little difficult to follow at times."
    }
  ],
  "recommendations": [
    "colombiana",
    "the_marksman",
    "no_escape",
    "breaking_in",
    "goodbye_world",
    "hotel_artemis",
    "taken",
    "cold_pursuit",
    "the_purge_anarchy",
    "greenland",
    "alone",
    "law_abiding_citizen",
    "sas_red_notice",
    "the_voyeurs",
    "3_days_to_kill",
    "allied",
    "those_who_wish_me_dead",
    "contagion",
    "tracers",
    "flightplan",
    "unhinged",
    "black_and_blue",
    "shot_caller",
    "carriers",
    "falling_down"
  ]
}