{"id": 2532, "title": "The Ant Bully", "starring": ["Julia Roberts", "Meryl Streep"], "runtime": 88, "genre": ["Fantasy", "Adventure", "Animation", "Comedy", "Family"], "description": "Fed up with being targeted by the neighborhood bully, 10-year-old Lucas Nickle vents his frustrations on the anthill in his front yard ... until the insects shrink him to the size of a bug with a magic elixir. Convicted of \"crimes against the colony,\" Lucas can only regain his freedom by living with the ants and learning their ways.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/oFuqX0inTvbA1XAFv2x3CQnI65m.jpg", "categories": {"plot": 6.0, "acting": 6.4, "ending": 5.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.4, "funny": 6.25, "action": 7.0}, "reviews": [{"rating": "6", "text": "Good for the younger end of its audience, 'The Ant Bully' is just another film by PIXAR, not having a very interesting story line."}, {"rating": "6", "text": "Fun fact: the production company that made this film, DNA Productions, was also the creator of the \"Jimmy Neutron\" film and TV series. And somehow, they were able to cast Julia Roberts, Meryl Streep, Nicolas Cage and Paul Giamatti for their film. Figure that one out. But, in all seriousness, \"The Ant Bully\" is just a decent animated film. It's competently animated, solidly written, pretty well acted, and occasionally witty. It's nothing spectacular, but kids will probably get a good kick out of it. Just don't walk into it with your expectations sky high."}, {"rating": "4", "text": "\"The Ant Bully\" is evidence that Warner Bros. suck at creating animations, as well as scripts for it too."}, {"rating": "6", "text": "Not as good as Bee Movie or A Bug's Life, but it entertains. The animation could be a little better but its fun. Advice though: People need to stop making computer-animated movies about bugs! There are too many of them."}, {"rating": "7", "text": "It doesn't build up hype just as I was expecting, but this movie makes me want to enter the fray just like how they did in, \"Honey, I Shrunk the Kids!\" and enter the bug life just like how they did it in either, \"A Bug's Life\" or, \"Antz\"."}, {"rating": "6", "text": "The ants want a green \"sweet rock\". Unmistakably, that has to be a reference to Kerri Green. What the hell happened to her? Rent \"Lucas\". You'll fall in love with her. The Lucas in \"The Ant Bully\" wears glasses like Corey Haim did in the 1986 coming-of-age classic, which could've been dismissed as a coincidence without the jelly bean hue of choice line. As for the film, I'm impressed by its Buddhist regard for all living creatures; perhaps, creating a new legion of vegetarians. The ants also have their own religion(they worship a giant queen ant). Now that they made contact with a human, now there's the chance these insects could be colonized by Christianity. Maybe the filmmaker is smuggling in some allegory when Lucas tries to destroy the ant mound. Incidentally, this is a fantastic film for little kids. As for me, as you can tell, I had to work hard to find any entertainment value in these anthromorphic ants. Julia Roberts is one pretty ant."}, {"rating": "0", "text": "Annoying. Another 3D movie pandering to an audience of retarded dumb kids aged between 2 and 7? Argh. This would make an excellent propaganda film for the Communist Party of the Soviet Union."}, {"rating": "7", "text": "Enjoyable if not great animated feature."}, {"rating": "3", "text": "Not exactly impressive, entertaining or outstanding but its annoying plot and watchability allow your to sit through it not having to think so hard that you get frusturated at how pathetic it really is."}, {"rating": "7", "text": "Far better than Barnyard and up there with Ice Age 2...but still not what we need in cartoon entertainment."}, {"rating": "5", "text": "Starts off descent and falls through the cracks. Watchable and somewhat enjoyable with laughs here and there but still not the movie i was expecting to enjoy."}, {"rating": "10", "text": "I liked the movie because it was cool and funny. I liked when the boy turned tiny. The ants gave the boy a good lesson to not be mean to them. I liked the animation very much. My family liked it too! I recommend this movie to all children and parents."}, {"rating": "8", "text": "I found this to be a very enjoyable movie to watch. The animation was attractive and inventive, the story was fast paced, and the voice acting was top-notch. I thought the film could have done without some of the crude humor, but it didn't detract too badly from the piece. I recommend it."}, {"rating": "8", "text": "I went in just for the airconditioning, not expecting much. But, wow, really fun. Nice script for a kid's animation flick. I laughed out loud several times. Some very nice surprises, too. The firecracker POV is hilarious. Bruce Campbell & Lily Tomlin's voice work is excellent."}, {"rating": "7", "text": "It's not nearly as original as Monster House, or as consistently delightful as Over The Hedge, nor does it possess the huge cast of (literally) colorful characters that the Pixar movie featuring Larry the Cable Guy as a bucktoothed tow truck has--and its badly timed release is just the latest of many factors that have made the summer of 2006 a worse one for Warner Bros. than for just about anybody else except Mel Gibson. But this backyard adventure about a boy who learns empathy for and develops a friendship with a colony of ants by magically shrinking down to their size, and thus more or less BECOMING one of them, has enough humor, excitement and just the right amount of genuine sweetness to please kids and parents alike. It's been unjustly criticized as being a distant third-place also-ran to the 1998 CGI creepy-crawlies Antz and A Bug's Life, but The Ant Bully really has much more in common with such classics of miniaturization as Honey, I Shrunk The Kids, The Incredible Shrinking Man and (briefly but unforgettably) Fantastic Voyage. There's a subtle moral--that those who are bullied are strong candidates for becoming bullies themselves--but some terrific action sequences (especially the climactic Death Star-like attack on the exterminator), appropriately juvenile gross-out jokes (including a memorable scene thatcombines boogers AND head lice in just a few pungent secondas of screen time) and semi-gratuitous juvenile near-nudity keep things moving briskly enough to keep the message appropriately subtextual rather than heavy-handed, even if this movie is ultimately as likely to prevent kids from stepping on ants as Bambi kept generations of them from eating venison. Three brief incidental observations: 1.) Is the fact that this is a Play-Tone production part of the reason why Nicolas Cage, playing a human-hating ant who eventually softens his stance, frequently sounds so Tom Hanks-ish? 2.) Which group of parents is more deserving of a trip to child-custody court for going on a kid-free vacation and leaving their way-underage offspring under minimal care and maximum danger, the ones here or those in Monster House? And 3.) Between the villainous way they're depicted here and in Over the Hedge, are exterminators now offically the 2006 movie equivalent of lawyers, used car salespeople and telemarketers?"}, {"rating": "6", "text": "First half is really kind of charming and fun, but second half grows increasingly corny and dopey. It's a film children should like, but it squandered its chance of being something adults would like as much."}, {"rating": "7", "text": "A good movie, not great. It was better than Monster House. I liked the way it showed how ants look at the world from a different perspective and their opinions. Some parts can be funny and cute, but it's not the best film. The human characters weren't very good except for the granny with her teeth falling all the time and her crazed obsession over aliens. Jelly beans."}, {"rating": "7", "text": "This is cute and has very important messages about bullying and working together. It isn't Pixar, Shrek or very original for that matter. It is entertaining, especially for those too young for Monster House. Think \"Bugs Life\" meets \"Over the Hedge\" without amazing animation or an amazing script. You will swear you've seen these ants before but they were very blue and lavender the first go-round."}, {"rating": "10", "text": "I loved it! It was a fun filled ride and very imaginative. It looked great!"}, {"rating": "0", "text": "Another annoying movie about a dumbass kid who takes his anger out on smaller creatures but they \"fight back\". Frankly, i think they should make a animated movie WITHOUT TALKING ANIMALS!"}, {"rating": "5", "text": "of all the bad CGI movies, this is probably the least bad. the animation was cheap and the character development wasn't good, but the visuals were good and the acting wasn't that bad. Warner Bros deserves a credit for at least trying."}, {"rating": "8", "text": "A fun movie worth seeing, bad endings to good ones, and a bully to ants. What else might you expect? Saw this movie a long time ago, don't know what it's out on, but it might be worth getting."}, {"rating": "2", "text": "Im sorry, but I have to give a 2\rThis movie makes no sense, soo is this is what you watch to educate your kids? no\rBlamming exterminators, plus The ants actually attacked the boy by shrinking him\rBad humor,Bad jokes, Bad entertainment, Annoying, Waste of my time"}, {"rating": "5", "text": "A mediocre, easily forgettable kids movie with nothing special. Just a middling flick with mildly diverting eye candy to entertain the little ones for a day."}, {"rating": "5", "text": "There's nothing incredibly bad here. But there's also nothing good. \"The Ant Bully\" is just a inoffensive efforts to make another animated movie, dull and forgettable."}, {"rating": "6", "text": "An animated film so full of adventure, comedy almost lost , but another more than just divide the plot options but has been good. the first animated of Legendary Pictures softly serves."}, {"rating": "4", "text": "La vi un par de veces cuando era chico y la verdad que me parece super rara y bastante mala."}, {"rating": "5", "text": "The Ant Bully no es mala, tiene sus partes interesantes con mucha adrenalina y partes mas calmadas y serias. Pero hay muchas cosas que no me gustaron. Para empezar, la historia esta muy mal aprovechada, siendo que podrían haber explotado mas el origen de las hormigas que se hace énfasis en algunas partes, así como que la relación entre Lucas y las hormigas para intentar ser \"su amigo\" es forzadisima y super corta. Todos al final de la película terminan considerando a Lucas un héroe pero si lo pensamos bien, el no hizo mucho para salvar o ayudar a las hormigas (como habían acordado con la reina hormiga). Primero que nada, hacen una competencia absurda que no aporta nada al objetivo y encima lo hace mal. Segundo después salva a las hormigas casualmente con un petardo que había ahí nomas y por alguna razón todos se marchan como si nada, sin embargo había huido cuando había que salvar a Hova. Luego cuando buscan comida para las hormigas en la casa de Lucas los pone en peligro, y por ultimo, si bien logran derrotar al Exterminador, parece que todos se olvidaron que Lucas los contrato en primer lugar. Hay que dejar algo en claro, poner en peligro la vida de los demás y luego salvarla no te convierte en un héroe. También los gráficos son muy malos, especialmente cuando no muestran el hormiguero, sino las afueras de la ciudad, se ve horrible, y mas si la comparamos con Bugs, y eso que salio 10 años antes aproximadamente.Aun asi The Ant Bully la disfrute, pero tiene muchos fallos."}, {"rating": "8", "text": "This movie is so awesome, I am inside someone's stomach, this is an adventure of awesomeness"}], "recommendations": ["hotel_transylvania", "the_angry_birds_movie", "ice_age_the_meltdown", "marmaduke", "despicable_me", "spies_in_disguise", "astro_boy", "penguins_of_madagascar", "the_angry_birds_movie_2", "monster_house", "the_secret_life_of_pets", "the_smurfs", "cloudy_with_a_chance_of_meatballs_2", "clifford_the_big_red_dog", "the_croods", "bolt", "hotel_transylvania_2", "ice_age_dawn_of_the_dinosaurs", "antz", "igor", "shark_tale", "flushed_away", "cloudy_with_a_chance_of_meatballs", "yogi_bear", "rio_2"]}