{
  "id": 2069,
  "title": "The Prince of Egypt",
  "starring": [
    "Val Kilmer",
    "Ralph Fiennes"
  ],
  "runtime": 99,
  "genre": [
    "Adventure",
    "Animation",
    "Drama",
    "Family"
  ],
  "description": "This is the extraordinary tale of two brothers named Moses and Ramses, one born of royal blood, and one an orphan with a secret past. Growing up the best of friends, they share a strong bond of free-spirited youth and good-natured rivalry. But the truth will ultimately set them at odds, as one becomes the ruler of the most powerful empire on earth, and the other the chosen leader of his people! Their final confrontation will forever change their lives and the world.",
  "releaseYear": "1998",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2xUjYwL6Ol7TLJPPKs7sYW5PWLX.jpg",
  "categories": {
    "plot": 8.044444444444444,
    "acting": 9.15,
    "ending": 9.0,
    "soundtrack": 7.944444444444445,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 9.333333333333334,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "\"The Prince of Egypt\" is by far one of the most underrated animated films. Maybe it's their Christian theme, maybe it's the difficulty of other studios in filming hit films at the time (DreamWorks was still going to grow a lot), but this is certainly a charming and touching movie.With an extremely qualified cast and competent animation, we have a magnificent approach to the history of Moses, without it being necessary to appeal to the appealing Manichaeism of transforming the Hebrews into pure beings (this is evident in a scene in which Hebrews throw stones at Moses) or transform the Egyptians into inhuman villains (it is possible to perceive this through Seti, Ramses and the Egyptian people who suffer during the time of the plagues).Hans Zimmer's soundtrack and Stephen Sodenheim's songs are spectacular, especially \"When You Believe\", which deserved to win the Academy Award for Best Original Song."
    },
    {
      "rating": "10",
      "text": "By telling a character driven story of the book of Exodus, the prince of Egypt manages to make itself a masterpiece. With beautiful animation, complex characters, inspiring songs and a complex story, it makes the movie an absolute must watch. As an adaption however, I think I would give it a lower score, since it does change some thing in the story. But the execution truly made it work. And that's why this is the greatest religious movie ever created."
    },
    {
      "rating": "10",
      "text": "This is one of best animated films of all time. This is definitely the greatest Dreamworks movie ever. The animation in this movie has not been matched by any 2D animated movie since. The story is one you know from the Charlton Heston movie but told in a very distinct way. The music in this movie is absolutely powerful. The open sequence in this movie is one of the most powerful and emotional openings of any animated feature ever. Even if you are not religious or spiritual you will defiantly enjoy this film at least for beauty and emotion."
    },
    {
      "rating": "10",
      "text": "The Prince of Egypt is probably my favourite animated film growing up. It's very hard to put an existing story into film and making it appealing to most people, but this movie nails it in every way. The songs, the image, the plot, all work together extremely well, and you can see the emotion of the characters and their ambitions. It may be a bit too serious and you can't see if it's for adults, teens or kids, but, hey, it's a timeless movie."
    },
    {
      "rating": "10",
      "text": "it is very hard to describe how good this movie was. from the way the songs were made to how well and accurately it puts events together while it entertains is amazing 4.8 stars"
    },
    {
      "rating": "10",
      "text": "This movie is totally epic. it retells the book of Exodus and its well-written. the animation kicked a**, the characters' peformances were the best, the visuals were excellent, the music rocked, and the cinematography is awesome. The Prince of Egypt is just the right Dreamworks animated movie and kids will love it."
    },
    {
      "rating": "8",
      "text": "Dreamworks' \"The Prince of Egypt\" retells the Book of Moses in a colourful animation that is easy to understand and fun to watch. Moses, a Hebrew raised as an arrogant, pompous Egyptian prince, discovers his true identity as a young adult and leaves the place he once called home. He starts a family before God comes to him and tells him that it is up to him to save his people from their status as slaves to the Egyptians. He eventually succeeds, after using God's power to unleash plagues on to the Egyptians after their Pharaoh, Moses' adoptive brother Ramses, initially refuses.\r A good thing about this movie is the way that it tells the story of Moses with accuracy, with only a few minor changes, like Moses finding out about his true identity through an encounter with his true sister Miriam and brother Aaron, who are working as slaves, while in the Bible it states that \"But when he was forty years old, it came into his heart to visit his brethren\". With the little minor changes, it still tells the story of Moses but also adapted so that younger children may watch it without getting bored.\r The character development, especially those of Moses and Rameses, is evident throughout the film. Before realizing his true identity, Moses was a selfish, arrogant prince who frequently caused chaos and distress to his own people for fun. Rameses was a good boy who wanted nothing but to please his father, and that somehow stayed true to the end of the movie, even though his intentions became so twisted that he attempted to commit genocide of an entire race, including a man who he grew up with as a brother.\r I think that the directors of the movie, Brenda Chapman, Simon Wells, and Steve Hickner did a wonderful job with this movie, especially with the beautiful animations and the added soundtrack. It is perfect for all audiences, including young children, whether for entertainment or for learning about the Bible. I would recommend this movie to anyone interested."
    },
    {
      "rating": "8",
      "text": "The Prince of Egypt is an enjoyable film. While it may lack the numerous characters and complex story that Ten Commandments has or the talent of Charles Heston as Moses, the film does offer some awesome music and epic moments that Ten Commandments does not have. This is a film that I think people will enjoy just as long as they do not compare it to the Ten Commandents. It is an enjoyable film that I will probably see again in the near future."
    },
    {
      "rating": "8",
      "text": "A very good re-telling of the amazing story of Exodus and Moses' trials to free the hebrew slaves from Egypt and the overpowering Tyranny from the Pharoah, Ramasses. The animation, voice acting, and humor will please the whole family."
    },
    {
      "rating": "7",
      "text": "'Prince of Egypt': Tale of a Hero.\r Is \"The Prince of Egypt\" a good movie or the most expensive Sunday school filmstrip ever made? My enthusiasm for Western man is so primal that I lean toward the former. Really, so much of it begins with Moses: the concept of freedom, the sense of the worth of the individual, the idea of God as an abstract ideal of morality instead of a batch of dog-faced bullies, commandments one through ten, even that inconvenient one about the neighbor's wife, and the coolness of beards. Oh, and also: Judaism and Christianity, democracy and baseball, to say nothing of Shakespeare, Bogart and Faulkner.\r The new animated feature from Dreamworks SKG gets that. If nothing else it's a wonderful essay on the meaning of freedom and the courage it takes to wrestle it from despots. In that sense, it feels more political and cultural than religious. You don't see faith systems in opposition so much as idea systems.\r Primarily concerned with the first part of the Book of Exodus – you know, the part with all the special effects – it leaves out that dreary 40 years in the wilderness and, being aimed at families, equally omits the shimmy-shim-sham danced about the feet of the Golden Calf. We begin by watching Baby Moses basket-surf the Nile, to be rescued by an Egyptian princess. He is raised to privilege in the court as brother to the Pharaoh to be. Upon discovering his true Hebrew identity, he suffers a crisis, flees and returns with the best slogan ever written: Let My People Go. When Pharaoh won't listen, God sends bugs and frogs. The people are ultimately let go, but then Pharaoh goes after them. There's no revisionist carping about Red/Reed Sea translation confusion: This is the big wet one, baby, and Moses parts it neatly as Elvis parted his first hairdo for Ed Sullivan. When Pharaoh and his boys clamber in their chariots across the same passageway, only Charlie Tuna is around to listen to their complaints.\r The movie's proudest accomplishment is that it revises our version of Moses toward something more immediate and believable, more humanly knowable. This is not the time and the place to bedevil Charlton Heston who, after all, can't really help being Charlton Heston. But his famous 1956 movie Moses was a reflection of a time that invested most of its authority in the severe white male, an unbending paragon of morality, strength and wisdom. Watch the news for 7 or possibly as long as 11 seconds and see how far that one has fallen!\r But this Moses, voiced by the less than imperial Val Kilmer, is less iconographic and more human. This Moses doesn't seem to be posing for Mount Rushmore and you could never ski down his cheekbones. Wiry and Semitic, he's a man beset with doubts, who feels himself completely unworthy. When he discovers his secret heritage, he reacts more like Woody Allen than an NRA president: He gets mopey, depressed and self-loathing. He wants to be hugged.\r Without going too far into this matter, it seems clear that this Moses reflects the personality of his creator, Dreamworks co-founder Jeffrey Katzenberg. Possibly he represents a little of Katzenberg's more famous partner, Steven Spielberg, as well. Heston's Big Mo was a vision of the annoyingly Caesarean Cecil B. De Mille, a bald tyrant who stomped around movie sets in jodhpurs and cavalry boots like some sort of Crimean War general about to order the light brigade to charge. He believed in the principle of absolute authority – his own – and he directed with the subtlety of a man carving an angel out of a lump of coal with a chisel.\r The second virtue to \"Prince of Egypt\" is a superb performance. It's amazing how a great actor can dominate a project without even showing his face. I refer not to Kilmer, who is appropriately unassertive in the role, nor to the absurd Valley Girl stylings of Michelle Pfeiffer as Tzipporah, Moses' wife. Hard to believe Moses' wife went to Redondo Beach High School!\r No, the reigning vocal genius of \"Prince of Egypt\" is Ralph Fiennes as Rameses, the non-blood brother of Moses' upbringing, inheritor of the throne. It is to the production's credit that he's given a motive – his fear of being the \"weak link\" in pharaonic succession, of failing the empire of his fathers and his sons. But this Pharaoh, like the Moses of his opposition, is a man, not a symbol, and in Fiennes's reading we hear the tragedy of a king born out of time, shackled to a set of beliefs that are crumbling daily, still in tragic love with a brother who has outgrown him. In the fight of his life, he's overmatched and he doesn't even know it: He's not going against Moses, he's up against the Big Guy Himself.\r That's what \"The Prince of Egypt\" finally is: a hero's biography."
    },
    {
      "rating": "9",
      "text": "\"The Prince of Egypt\" is a well made animation re-telling the story of Moses from the Bible. You would definitely want to show it to your kids if your christian."
    },
    {
      "rating": "8",
      "text": "This movie is a great way of telling the story about Moses."
    },
    {
      "rating": "6",
      "text": "The Prince of Egypt's story can feel just powerful at times and  it had dazzling animation and great music. But with some lackluster voice performances the whole thing is almost ruined. I give this movie 60%."
    },
    {
      "rating": "2",
      "text": "I expected a lot better, to say the least. Prince of Egypt is decently animated, but serves as a sparknotes version of the Biblical story that not only is far too quick, but it is a shallow adaptation at best that misses many key elements of the story. Even worse, it changes many of them and the story itself resembles very little of the actual Biblical tale. Now, this is not truly a sin on its own because of course it is changed, but the changed story is far too kid-oriented and feels far too often like a bad kids cartoon that adults hate in numbers. There are a few good sequences, such as the burning bush sequence, but you would be far better off just watching The Ten Commandments if you want to watch a film version of the Book of Exodus. Everything is borderline comical and the fast pace and the way it just skims through the story are incredibly annoying and, if you do not know the story, hard to follow. Overall, The Prince of Egypt misses the mark by about 40 years."
    },
    {
      "rating": "4",
      "text": "Is this some sort of joke? The animation, even for its time, looked on par than many Japanese anime of the same era with 1/1000 of the budget of this film. And for a stellar voice and music cast, I have never heard a more boring score of songs. All the music was very commercial and cookie cutter lacking in any sort of character and clearly designed as fan service rather than as a work of art. What are you people listening to when you say its memorable? It almost sounded like it was made over a single weed filled week of recording and I should know because I owned a music studio. You could have literally pulled 10 random bands or artists from a downtown music venue and had gotten a better music score than this cliched trash.\r The only good thing about this movie is the story is told fairly well. It was filled with plot holes (the story of Moses generally is a giant nuclear crater sized plot hole), but it was still told in a ok manner given it is meant for a younger audience. I dont imagine many adults can enjoying the story telling but I have seen more ridiculous things."
    },
    {
      "rating": "10",
      "text": "This is a wonderful telling of the book of Exodus and anyone that says otherwise can go die. The music makes this movie 10 times more memorable. Critics are wrong about this movie. It seems as though they went in the theater expecting to see a comedy. I'm pretty sure the Bible wasn't meant to be funny... so go screw yourselves"
    },
    {
      "rating": "10",
      "text": "Honestly, I thought this movie was really great. I don't know how it managed to get a 64 average from the critics that were considered on this site. It's an inspiring story that isn't supposed to be funny and manages to reach some pretty intense levels in some scenes. The songs are pretty nice too, especially \"When You Believe\" which literally gave me goosebumps. This is a movie that's about freedom and inspiration while using a story from the Bible and it does its job excellently as that."
    },
    {
      "rating": "8",
      "text": "Epic animation with excellent visuals and music and solid screenplay and voice acting."
    },
    {
      "rating": "10",
      "text": "The Prince of Egypt lives up to it's reputation and will forever be Dreamworks underrated gems of all time. This film had me in chills when I was a kid and I found it scary. So if an animated film would be for kids and adults then the children would be scared and frightened by watching it but hey, it's Dreamworks. You expect them to be thrilled and entertained. I think this is much similar to The Lion King, I mean look at it. The animation is similar and the music is engaging. How similar can it be? So anyways, there are alot of celebrities who really voiced all the characters. There's Val Kilmer as Moses and Ralph Fiennes as Rameses and they are brothers. We also have Michelle Pfeiffer, Sandra Bullock, Jeff Goldblum, Danny Glover who has a really small role just like Patrick Stewart and Helen Mirren and now we have Steve Martin and Martin Short. Damn, there are loads of celebrities that you'll recognise! The songs are by Stephen Schwartz the guy who did The Hunchback of Notre Dame and I feel the same way the Hans Zimmer because the music in this is much similar as I said before, composed this. Okay, the songs are that I love to listen to more often. There's ''Deliver Us'' (which I think my sister heard me sing it recently), ''All I've Ever Wanted'', ''Through Heaven's Eyes'' the song which Steve Martin and Martin Short is ''You're Playing With The Big Boys Now'', my personal favorite ''Let My People Go'' (aka ''The Plagues''), and now the final song that every women is dying to sing is ''When You Believe''. There's actually a theme song who's sung it. It is Whitney Houston and Mariah Carey. This movie is fantastic and brilliant on every level. The voice acting is brilliant even from Val Kilmer and Ralph Fiennes, the animation is fantastic and well drawn and well sketched and the visuals are absolutely stunning. This is an enjoyment for every audience in the world especially the girls. At times it gets enjoyable and at times it gets scary. Moses and Rameses have really good chemistry together. if you really wanna a great drama and great fun you better off watching the ones from Disney and Dreamworks, like The Lion King to be exact. With this review, you will do my wonders."
    },
    {
      "rating": "10",
      "text": "By far one of the best movies ever made. Not just animation but just a movie. It holds up even after 22 years. It is probably the best biblical movie I have seen."
    },
    {
      "rating": "7",
      "text": "The early efforts of Dreamworks. It´s an shaved version of The 10 commanments in a musical opera tone. Respectul to Exodus book. The sequence of Red Sea excels the version of Cecil B. de Mille. Watch if want to know what was doing Dreamworks before the ogre of the hour."
    },
    {
      "rating": "9",
      "text": "it is very hard to describe how good this movie was. from the way the songs were made to how well and accurately it puts events together while it entertains is amazing 3.5/5"
    },
    {
      "rating": "9",
      "text": "Easily on of my all time favorite animated movies. The music is incredible, the story is moving and powerful, and the animation is almost flawless. One of the most profound, chill-inducing animated movies ever created."
    },
    {
      "rating": "10",
      "text": "The critics are stupid here! It deserves higher than a score of 64. The story is astoundingly amazing and gripping, the animation's beautiful, the characters are all well developed, and the tone is perfect. Watch this movie no matter what! Okay, don't go ahead killing people just to get the movie, but get it whenever you can, okay? Cool."
    },
    {
      "rating": "10",
      "text": "I am serious when I say there are no flaws with this movie. It feels like a gift from heaven, which is pretty funny considering the movie. It's not only my favorite movie of all time, but my favorite piece of media ever made!"
    },
    {
      "rating": "10",
      "text": "As a former Christian who no longer believes in these stories, I still find this to be an excellent movie. It does take certain artistic liberties, but the spirit, message, and key incidents in Moses' story shine through. Watching it as a Christian, I was blown away and finally able to empathize with the suffering of the Israelites in a way that Biblical writing is too dispassionate to portray. Even though I'm not Christian anymore, I still recognize and appreciate the messages in the story. From both secular and religious standpoints, viewers are exposed to important lessons about anti-slavery, acceptance, forgiveness, steadfastness, perseverance, and unconditional love. For other non-religious people, it isn't hard to view the story in the same vein as Star Wars or Hercules - movies and stories technically centered around a religion but easily enjoyable as they are.My issues with the film: All the voices seem to have been cast solely because they're celebrities, as evidenced by Sandra Bullock and Jeff Goldblum sounding like they've never voiced an animated character before;  all but two or three of the character voices are white (I mostly love the voices, but they don't really work for Egyptian characters); I have personal issues giving Val Kilmer money; Steve Martin's and Martin Short's characters are so unnecessary and, at times, make me feel embarrassed for them.Music is beautiful, voice acting is generally performed well, animation is gorgeous, and story is timeless. As an adult, I still watch this movie several times a year with my religious and non-religious friends."
    },
    {
      "rating": "7",
      "text": "No me pareció una película espectacular como muchos dicen, pero definitivamente entiendo porque algunos la consideran un clásico. A nivel de animación cumple muy bien, no es la mejor, pero definitivamente llega a ser muy atractivo incluso a día de hoy. A nivel de historia, esta película se beneficiaria mas si sabes sobre la historia real de la biblia, aunque la película hace todo lo posible para que entiendas en caso de que seas como yo que no leyó nada de nada, y sigue funcionando muy bien como historia en si, sin embargo si es cierto que varios elementos de la historia original según tengo entendido no están presentes, pero no lo tomare en cuenta como un punto negativo ya que igual la película esta bien contada dentro de su sencillez. Hay algunos pequeños huecos argumentales, pero nada grave, en resumen, esta bastante bien. No es la mejor de Dreamworks, pero los personajes e historia son realmente memorables y ha envejecido bastante bien, y eso es lo único que importa."
    },
    {
      "rating": "10",
      "text": "May not be quite as good as Joseph: King of Dreams. Even so, The Prince of Egypt brings a powerful story to life with its visual splendor and majestic musical numbers."
    },
    {
      "rating": "8",
      "text": "I love DreamWorks and for some reason The Prince of Egypt passed me by. So I had to fix it and I can't complain. Right from the first moment the animation appealed to me, which in my opinion had its own charm and I found it just beautiful. Add to that the sometimes epic music by Hans Zimmer and a great story. For me, a great film that I recommend, especially to Egypt lovers, because I personally really like Egypt and for me this film was a wonderful spectacle."
    },
    {
      "rating": "10",
      "text": "Honestly one of the best **** movies I’ve seen in a long time,it portrays the story of Moses in a way that makes it  compelling, it is not like those **** Christian movies in which they are like “If you want to have a better life, just pray for god” this movie goes like “You don’t have to believe in god, but just know that he is real and he is there” it’s just **** great honestly. And the music Holy **** It was **** amazing and I am just in awe"
    },
    {
      "rating": "10",
      "text": "This is by far the greatest animated movie of all time in my opinion. The animation is amazing, the voice actors are brilliant, the music is excellent, the characters are likeable, I just love everything about this movie. I just wished dreamworks did more movies like this. I know we have The Road to El Dorado but that was pretty mediocre. Also there is Joseph King of Dreams but I haven't watched that yet but it actually looks good. Anyways this is the greatest animated movie ever. I definitely recommend this movie to anyone."
    },
    {
      "rating": "10",
      "text": "It is a great masterpiece from Dreamworks and an animated gem, the animation is amazing, the cinematography and story are great and the music is very memorable and what makes the movie itself stand out the most, it is absolutely excellent and an animated masterpiece that combines the story and religion and this is a great example of non-Disney animated movies. However, it almost became a milestone in cinema (although it was not), but it did become another milestone in the history of the animation genre, although the previous animated films without being from Disney in the early 80s and 90s tried to be animated films from different non-Disney studios and receiving in some animated films in box office failures and critics in some occasions (with the passage of time, they would be able to be appreciated to some non-Disney animated films), but The Prince of Egypt changed everything by giving us the most memorable songs, the emotional soundtrack, the most exciting story, the superior animation and cinematography and as a result the critics love it so much and the box office managed to be an absolute success with 218 million. dollars worldwide becoming one of the highest grossing films of the year 1998 and thanks to that The Prince of Egypt managed to be the great success in the history of animated cinema in general l both critically and at the box office and is currently considered an animated classic and one of the best non-Disney animated movies. This movie is a great animated gem that is always a magnificent experience for animated movies, an animated gem that will never be forgotten.The Prince of Egypt is the film that managed to be the first great milestone in the cinema of non-Disney animated films, and it is the Dreamworks animated film that manages to highlight the story and is Dreamworks' \"The Lion King\"."
    },
    {
      "rating": "10",
      "text": "An amazing movie!! Great music, I mean Whitney Houston and Mariah Carey, amazing. I love the original story so the movie is even better. I adore this movie."
    },
    {
      "rating": "10",
      "text": "Is the bible outdated? The truth is that yes, that is why it is surprising that Dreamworks made one of its best productions based on one of the best-known passages from this book, a movie that you should see at least once in your life, even more so if you are a fan of animation."
    }
  ],
  "recommendations": [
    "the_lion_king",
    "anastasia",
    "wolfwalkers",
    "the_little_prince",
    "moana",
    "spirit_stallion_of_the_cimarron",
    "pocahontas",
    "over_the_moon",
    "treasure_planet",
    "aladdin",
    "klaus",
    "the_princess_and_the_frog",
    "the_book_of_life",
    "luca",
    "finding_nemo",
    "song_of_the_sea",
    "vivo",
    "the_iron_giant",
    "ratatouille",
    "atlantis_the_lost_empire",
    "mulan",
    "cinderella",
    "your_name",
    "brave",
    "the_road_to_el_dorado"
  ]
}