{"id": 2610, "title": "The Scorpion King", "starring": ["Dwayne Johnson", "Steven Brand"], "runtime": 92, "genre": ["Action", "Adventure", "Fantasy"], "description": "In ancient Egypt, peasant Mathayus is hired to exact revenge on the powerful Memnon and the sorceress Cassandra, who are ready to overtake Balthazar's village. Amid betrayals, thieves, abductions and more, Mathayus strives to bring justice to his complicated world.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aITIsX20tACn6jgtyDcCYpRT216.jpg", "categories": {"plot": 4.363636363636363, "acting": 3.75, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.75, "action": 6.0}, "reviews": [{"rating": "7", "text": "It sizzles with dirty delights. Scorpion King is action packed, sexy, and even, to my surprise, decently filmed."}, {"rating": "6", "text": "I was fairly young when this came out and since I was a very huge fan of The Rock I thought this movie was the greatest thing ever. Getting older I still consider this a favorite, it is a great action flick for the ancient sword swinging era. The big burly muscular presence I think was greatly revitalized by Dwayne Johnson. That being said, I don't think there is a character that had fit him so well as being the scorpion king ever since. Packs the punch you'd expect. well choreographed fight scenes that stay consistent, nothing too impractical, the plot is relatively sound. Only issue being his correlation with a scorpion and why that is significant enough to be his title, and his perceived \"destiny\" by the sorceress seemed to not be all that dramatic when he was confronted by it could have been more in depth a suspenseful, not too annoying though. They did good with his support, his enemy isn't so much a match of strength but skill, his side-kicks are a funny pansy type guy, an inventor, and a beautiful woman, no one to upstage him...Considering the WWE had a lot to do with this film, they did it well, played to the strengths of a charismatic actor.  Worth a watch."}, {"rating": "10", "text": "I liked this movie"}, {"rating": "9", "text": "Fan-freaking-tastic the kind of movie you'll remember and have in your collection for years, it's got action and humor, and it's just so enjoyable that you have to have something wrong with you not to like this movie, a must see."}, {"rating": "4", "text": "If we restrict ratings to movies starring former 'rasslers, this might rate 6-7 from me (top honors going to \"They Live\" with 'Rowdy' Roddy Piper).  But, overall, I find this to be below average.  It's mildly entertaining, but just doesn't have that 'special hook'.  If you want sword-and-sorcery action, you'd do much better sticking with the \"Conan\" movies.  About the only draw I can see, is 'The Rock', which will no doubt bring in the 'rasslin' fans.  Otherwise, the story is tripe.  The comedy is forced (sticking with the cowardly side-kick and the smart-ass kid format).  I should state that I haven't watched this in a theatre, or the DVD version - merely the televised version(s).  However, I really don't sense I'm missing much"}, {"rating": "6", "text": "The real problem with this prequel is in the mummy returns. If it had set a far more interesting and detailed background for the Scorpion King, it would've been really good. Since it didn't you just don't care."}, {"rating": "0", "text": "For me, this is a huge letdown. It didn't give the point nor reason why they call it The Scorpian King. It just is, because it mentions it in The Mummy movies and as a joke one time in this. But really, the writing is fine but things aren't as expected in this movie, the acting by the Rock is horrible, his acting here will give him roles in the future that are almost so bad, that its corny. But the movie is nothing more than a wrestler in a story with cheeze."}, {"rating": "7", "text": "This might be the most underrated movie I have ever seen.  The thing about this movie is that it doesn't take itself seriously, and nobody watching it should either.  The Rock is perfect in this, slightly corny and with a subtle feeling throughout that he's just about to break the fourth wall.  Overall, we end up with a movie that has plenty of action for action fans and a great sense of humor."}, {"rating": "6", "text": "Hilariously corny but also fairly enjoyable and better than The Mummy films."}, {"rating": "6", "text": "Just like the first Mummy film, The film has that \"It\" factor and it truely is an enjoyable film. A solid prequel (at least for the Mummy series) and good action through out (I would say the best in the first 3 films). It is a little corny at times though and that takes away from the film quite a bit. Overall though, It wasnt bad and its worth the watch."}, {"rating": "7", "text": "The Scorpion King is short, sweet and to the point. It captures the feel of the first Mummy film without being a total knock-off and The Rock showed the world with this film how good of a leading actor he can be. It's entertaining, comedic at times and action-packed. You can't ask for anything more."}, {"rating": "2", "text": "My god what the fu** have you people done,there is no real story,the main character is bloody invincible and there is no logic behind anything that happens in the whole movie"}, {"rating": "6", "text": "+Great cast+Excellent production value-Weak screenplay-Uninspired cinematography/choreographyScorpion King feels like a Xena Warrior princess episode on big budget steroids... The production budget is there on the screen. While not particularly artful in its execution, I had a lot more fun watching this than I expected. In spite of the weak simple characters and plot,if you are in the mood, Scorpion King  will entertain you!"}, {"rating": "6", "text": "A solid and entertaining popcorn movie. It is not art and does not need to be. After appearing in “The Mummy Returns” we get a spin off with the Rock giving the backstory of the (later so called) Scorpion King. The Mummy trilogy was back then a huge success. It was a mixture of adventure and horror garnered with action a humor. This spin off takes place far before the events of the Mummy movies. It is set approx 5000 years ago where the ruler Memnon is conquering his neighbor countries (or city states) one by one and never losing a battle. Mathayus is one of the last surviving warriors of his people and tasked to kill the seeress which granted Memnon his victories. This is the set up for the story. What should I say. The story is entertaining but foreseeable. If you know classic movie stories and tropes you can see the twists and outcomes from miles away. I think you should not think too much or it will ruin the movies. If you like this or not the actors are the saving grace. With Dwayne Johnson, Kelly Hu and Steven Brand in the lead roles we get a good performance. The hidden gem is Grant Heslov. The action scenes are nice an enjoyable. There is a bit of good humor but not overwintering. In total I think this is an entertaining movie but sadly forgettable except for some moments. I give a 6/10 here but will say it can be everywhere from a 3-8/10 compared how much smart writing you want."}, {"rating": "3", "text": "This film depicts essentially a civil war in which a group of warriors led by Mathayus will try to confront Memnon, an evil and ruthless king. The story seems to go up in Egypt before the time of the pharaohs, and seems to be slightly based on so-called \"Scorpion Pharaoh\", an obscure historical figure about which we know almost nothing. Directed by Chuck Russell, it has script by Stephen Sommers, the director who made \"The Mummy\" films, and which introduced in these films a hook for this one. The cast is led by Dwayne Johnson, the protagonist, and also has Steven Brand and Kelly Hu.This film resembles visually films like \"Mad Max\" or \"Conan the Barbarian\" and television series like \"Xena: Warrior Princess\". They are films that seem based on Antiquity, to some extent, and who seek to be war epics or, at least, adventure movies. Thus, this film brings very little new things. The hook made in \"The Mummy Returns\" for these movie resulted in a major continuity paradox because the hero of this movie, the Scorpion King, is depicted there as a powerful villain. The cast is regular and doesn't bring anything interesting. Kely Hu was apparently chosen only based on their appearance under clothing as Dwayne Johnson was selected for his ability to action roles. In fact, Johnson is far from the sensitivity and depth required for a more versatile actor. The scenarios are abundant in imagination just as the costumes, which seems to freely mix elements of ancient civilizations with other right out of comics or of any indie fashion studio.This movie could have been much better if it had been located properly in space and time. The problem with this film is the exaggerated imagination of the director and screenwriter. Everything has limits. The cast could also have been chosen better and the characters could have been built in a much more interesting way. Positive are the action scenes, using martial arts from Philippines about we never heard before, but that look good on the screen."}, {"rating": "10", "text": "this dope movie we get the rock again this movie please thes others **** are wack we need the rock this movie it be great again"}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."}], "recommendations": ["hercules", "indiana_jones_and_the_temple_of_doom", "the_three_musketeers", "thor_the_dark_world", "the_last_witch_hunter", "the_terminator", "dredd", "last_action_hero", "avengers_age_of_ultron", "terminator_2_judgment_day", "thor", "thor_ragnarok", "jungle_cruise", "the_fifth_element", "king_arthur_legend_of_the_sword", "captain_america_the_first_avenger", "the_mummy", "highlander", "the_league_of_extraordinary_gentlemen", "edge_of_tomorrow", "guardians_of_the_galaxy", "underworld_awakening", "the_forbidden_kingdom", "bloodshot", "riddick"]}