{
  "id": 11,
  "title": "The Lord of the Rings: The Two Towers",
  "starring": [
    "Viggo Mortensen",
    "Elijah Wood"
  ],
  "runtime": 179,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action"
  ],
  "description": "Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5VTN0pR8gcqV3EPUHHfMGnJYN9L.jpg",
  "categories": {
    "plot": 7.96875,
    "acting": 9.192307692307692,
    "ending": 7.818181818181818,
    "soundtrack": 9.75,
    "cinematography": 8.2,
    "familyFriendly": 10.0,
    "funny": 8.333333333333334,
    "action": 9.444444444444445
  },
  "reviews": [
    {
      "rating": "10",
      "text": "When the \"worst\" movie of a trilogy is an absolute 10, then you sir, have a damn fine trilogy. This is an incredible movie from start to finish, but the one drawback is that it feels like it was continued and needs continuing. The thing is, it's actually worth the ride."
    },
    {
      "rating": "10",
      "text": "The Two Towers is equally as good as the first but with bigger and better battle sequences. It has even more adeventure and even mixes in some comedy in that makes the movie flow perfectly. The best picture of the year."
    },
    {
      "rating": "10",
      "text": "When people ask me which film in the Lord of the Rings trilogy is the my least favorite, I usually say The Two Towers. However, seeing as how all three films are all cinematic masterpieces, this doesn't mean jack-squat. The Two Towers, like its other two siblings, is quite simply one of the greatest films of all time. Director Peter Jackson does an outstanding job with staying true to Tolkien's story, while adding some of his own flare to the film. Its visual effects, cinematography, and score are some of the best seen in film, which can be said about the other two films as well. The ending of The Two Towers is one of the most emotionally powerful endings of any film I've seen (which is saying something since I consider myself quite the film expert). The montage with Sam's moving speech to Frodo does the movie justice, and is the perfect ending to the second installation of the trilogy where hope for the defeat of evil in Middle Earth is all but faded. Frodo, stricken with grief and weariness of being the Ring Bearer, asks Sam what they are holding onto, which Sam responds with, and still to this day brings goosebumps and tears to me, \"That there's some good in this world Mr. Frodo, and its worth fighting for!\" Words we all could live by nowadays."
    },
    {
      "rating": "9",
      "text": "Considered the weakest of the Lord of the Rings trilogy. I suppose it suffers like that of the middle child. That aside this is still an awesome movie in the proper sense of the word. A visual spectacular, a epic tale of the battle of good versus evil. Wonderful. Praiseworthy in every aspect. I'm sure if J.R.R Tolkien was alive today he would approve."
    },
    {
      "rating": "9",
      "text": "Having recently read the book I did find that this departed from J.R.R.Tolkien"
    },
    {
      "rating": "8",
      "text": "It was ok. While the CGI parts are pretty terrible and painfully obvious, The action more then makes up for it and the epic battle at the end delivers an amazing climax to the film. I agree with another reviewer that said you know its a good trilogy when the worst film in it still gets a high score."
    },
    {
      "rating": "10",
      "text": "I am 48 years old and have read the book at least 10 times. I have NO PROBLEM with the changes! Granted, I was worried when the ring headed to Gondor, but the resolution made Faramir even more noble. Fanghorn/Treeberad was exceptional. Battle scenes exceptional! Theoden ... Moving Shelob to film three.....brilliant decision. Eowyn and Eomer were inspired and Edoras a masterpiece and superb location. Bravo New Zealand! But the masterpeice and centerpiece of the film was Gollum. Jackson and Co. and Andy Serkis imbued him with a humanity that defies description. We are so accustomed to computer characters like Jar Jar Binks that we stand truly amazed when someone takes the technology and uses it in a true performance reality. For all those who say this is just action and battle....you didn't WATCH the film. An all encompassing human and moral epic and an achievement os staggering proportions. When the three films are seen together it will represent one of the masterpieces of film......not JUST fantasy or action films or whatever label you want to attach.....but any genre of film. Thank you Peter Jackson for a thrill and continued surprise and awe! Many thanks to the critics for praising a \"fantasy\" film. You show true bravery as well! I noticed the film made none of the New York Times critics 10 best lists, proving the public can sometimes be better judges of good and bad."
    },
    {
      "rating": "8",
      "text": "A great movie! Full of adventure and fun, more epic than the first."
    },
    {
      "rating": "9",
      "text": "An action packed ride that is every bit as good as the first movie. It may be the least enjoyable of the films, but the fact that it is still a phenomenal film stands as proof the Peter Jackson has created the most consistent and brilliant book adapted film franchise of all time. My only complaint would be that it does not focus enough on the characters like the first two films did, but every other aspect of it is near perfect."
    },
    {
      "rating": "10",
      "text": "Like all the other films of the LOTR trilogy I watched this movie in one go without taking a break or falling interest. The actors did very well in the film but I personally think Christopher Lee (Saruman) stood out from the rest because of his cold yet powerful voice on several occasions during the film. Bernad Hill (Theoden) also did an excellent job as the king of Rohan. The fight sequence were well choregraphed and the scene Wolves of Isengard was intense, fast paced and humorous (lol gimli). The Ent were also well brought into the screen and I think the best battle scene in all of the trilogy was the battle at Helms Deep. WELL DONE PETER JACKSON"
    },
    {
      "rating": "10",
      "text": "The battle for Middle Earth continues in this epic and vastly rich in detail sequel to the Fellowship of the Ring, the Two Towers is often regarded as the best of the three, its name deriving from the tower in Mordor where the flaming eye of Sauron sits, and the tower of Isengard, where the corrupted Saruman build his army. It introduces new characters while still maintaining heavy focus on the ones we grew to admire from the first part, the stories intertwine yet happen worlds apart, Frodo (Elijah Wood) and Sam (Sean Astin) have gone it alone to the fires of Mount Doom in the hope of destroying the ring of power, but they are my no means alone, as the shady creature known as Gollum (Andy Serkis) is on their every move, but he may soon prove his worth as the two hobbits seem to be going round in circles. Frodo is beginning to show signs of the ring overpowering him by now, he's grouchy, angry and taking it out on Sam. But another battle continues to rage as the evil Saruman (Christopher Lee) continues to raise an unbeatable army in the name of Sauron and the ring, an army that seeks domination of the lands, Rohan being the centre of it, Aragorn (Viggo Mortensen) Legolas (Orlando Bloom) and Gimli (John Rys-Davies) are in search of Merry (Dominic Monaghan) and Pippin (Billy Boyd) who have been taken by the dangerous breed of Uruk-hai believing them to be Frodo.\rBut there is more to it all that just needs to be watched, we have a reborn Gandalf (Ian McKellan) who helps steer the masses in the right direction, as each city must stand up and rise against the armies. We make way for one of the most memorable battle sequences in cinema history, the battle of Helms Deep, thousands of soldiers and even more orcs line the land to fight, it's raining, it's wonderful to watch and it's action packed, to the fullest. Wonderful to watch couldn't be used enough in this review, because the Two Towers is exciting from start to finish, whether its the epic battles, talking trees, continuing character-driven stories or vast landscapes of beauty, it takes everything from the first and doubles it, Aragorn seems to take centre stage in the film, as the Hobbits take a back seat for a while, the two hobbits on the way to Mordor are really just walking for most of the film, but Wood and Astin excellently play beaten travellers as we begin to realise the sway such a small object can hold, but Aragorn is the heir to the white city of Gondor, he therefore must salvage all the remaining hope in men, and deal with the many obstacles that stand in his path, but not without a few secrets to be revealed first, although he longs after Arwen (Liv Tyler), another woman, Eowyn (Miranda Otto) takes an interest in his peculiar being. Like before, it's the phenomenal acting and intriguing characters these actors portray that really bring the film to life, it's  visually impressive as ever, yet these larger than life heroes are likeable, easy to root for and give a sense of happiness and despair rolled into one, we have love, loss, hatred and frightening elements of the supernatural to enjoy. McKellan's Gandalf speaks heavily in riddle, and the more I watch this trilogy the more I think he knew along what was going to happen, the reason for his participation was a bored pensioner with not long left until retirement.  The element that drives Lord of the Rings head and shoulders above others is its own time and its own original world, everything about it breathes magic and fantasy, the Two Towers capitalises on success but doesn't settle to be just as good, it aims higher and opens up to a host of new characters and story lines that set up a massive and historic final chapter."
    },
    {
      "rating": "10",
      "text": "I can't tell if LOTR 2 is the best of franchise, but is the most delightful to watch, just because battles, very well directed and that shines the eyes."
    },
    {
      "rating": "10",
      "text": "Very good movie. Well done peter Jackson and Crew. They are made a nice job. The Lord Of the Rings: The Two Towers made me love fantasy movie. Because before i saw it i think fantasy movie suck, childish, and cheesy but this is not. This movie has epic battle sequence, beautiful landscape, stunning CGI, real setting and good cinematography. This film should've won best picture oscar 2002."
    },
    {
      "rating": "8",
      "text": "Certainly there can be few films so replete with images of death and portents of doom as is “The Two Towers.” At virtually every step, the mostly separated main characters are threatened with extinction, and looming over all is the specter of the gathering army of the dark wizard Saruman, whose victory would eliminate the last remaining bastion of significant resistance to his quest for total dominance over Middle-earth.\r “It’s getting heavier,” laments Frodo (Elijah Wood) about the Ring to his genial companion Sam (Sean Astin) as they make their way across some imposing mountains en route to the dreaded Mordor, the only place the Ring can be destroyed so as to prevent the Dark Lord Sauron from establishing an empire of evil. The two Hobbits aren’t alone for long, however, as they apprehend the strange, vaguely threatening but ultimately pathetic creature named Gollum that’s been following them and now offers to guide them to Mordor.\r But Gollum is an unsettling critter to have around. Naked save for a diaper-like loincloth, fidgety, skinny but large of hands, feet and skull, with strings of black hair and bulging, haunted blue eyes, Gollum looks like a preternatural Peter Lorre, a permanently scared and worried soul who’s compellingly revealed later on to be a hopeless schizophrenic, one twisted by his previous experience as a Ring bearer. “Acted” initially by Andy Serkis and subsequently reworked into exaggerated humanoid form via a dexterous CGI makeover, Gollum is a startling creation that constitutes one of the film’s major talking points.\r All the same, this odd group doesn’t actually get very far in “The Two Towers,” as matters focus more on the heroic efforts of the warriors Aragorn (Viggo Mortensen), Legolas (Orlando Bloom) and Gimli the Dwarf (John Rhys-Davies) to help King Theoden of Rohan (Bernard Hill) in his seemingly hopeless defense of Rohan against Saruman’s army of 10,000 specially bred fighting beasts. All things considered, the handsome Aragorn would rather be back with his lady love, Arwen (Liv Tyler), but when duty calls, a man such as he has no choice.\r Throughout, the film intercuts among a trio of story strands, the third recounting the strange detour of Frodo’s errant pals Merry (Dominic Monaghan) and Pippin (Billy Boyd) into Fangorn Forest, where they are snatched up by an ancient walking-and-talking tree called Treebeard (wonderfully voiced by the busy Rhys-Davies), who takes his own sweet time deciding what to do with the anxious Hobbits.\r Without pausing to recap past action, Jackson and his co-screenwriters Fran Walsh, Philippa Boyens and Stephen Sinclair (the latter a new addition to the “Fellowship” trio) pick things up where they left off a year ago, and audiences will at once settle in for the yarn’s continuation in full confidence that there will be no let-down in storytelling sweep and spectacle.\r Because of the pressure of momentous events and the lessened need for expository character delineation, the dialogue this time around tends toward the utilitarian and declamatory; with hardly an alteration, the very same words, given a different spin by the likes of John Cleese or Michael Palin, could be quite funny. But the grim mood established by the clouds of war and the muted blues, greens, grays and earth tones of Andrew Lesnie’s grand but mobile cinematography keep the proceedings sober as King Theoden and his people abandon their homes for the presumed safety of a mighty fortress, Helm’s Deep.\r After a haunting march across the Dead Marshes, beautifully realized by production designer Grant Major and his team, Frodo, Sam and Gollum are captured by Gondor leader Faramir (David Wenham), which effectively sidelines them for most of the remainder of the picture. Over in the forest, the dawdling Treebeard eventually calls a conference of his branchy brethren; when the ambulatory ancient trees at the last minute decide to take action, it’s quite a sight to see.\r But the final half-hour is largely and rightly given over to the battle at Helm’s Deep, an event that never could have been presented as vividly or on such a scale in the pre-CGI era. Jackson stages the logistics with admirable clarity; Saruman’s Uruk-hai soldiers, ferocious hulks that are half-men, half-monsters, gather in such numbers on the plains that death seems certain for everyone inside the heavy stone fort. Heroics abound on the parts of Aragorn, Legolas and Gimli, with the latter’s bemused reactions in the face of repeated endangerment a continued source of humor. A promised deus ex machina arrives in the form of Gandalf, but while the battle may be won, the war against the occupants of the titular towers, Saruman and Sauron, remains to be pursued a year hence.\r Once again, Howard Shore’s vigorous score, seemingly somewhat altered and darkened, and sans the Enya contributions, provides valuable support.\r All the same, it’s hard to imagine a much better version of this material onscreen."
    },
    {
      "rating": "9",
      "text": "Mother of God what I just saw.This is real cinema, gentlemen, this is pure magic.I think it's down a bit compared to the first one, but it's still great."
    },
    {
      "rating": "9",
      "text": "Not as good as the first one but still a Damn good movie, the characters are being developed even more, the action is fantastic, especialy the fight at helms deep, its one of the best action set pieces i have ever seen and the story is fantastic, My only problem is that at times i did not care too much about the tree plotline, But that is my only problem with it and it is a small problemMy score 9,5/10"
    },
    {
      "rating": "8",
      "text": "\"The Two Towers\" isn't much epic as its powerful prequel, but its still amazes me that Peter Jackson can release such a wonderful movie within a year."
    },
    {
      "rating": "10",
      "text": "It's quite similar to the Fellowship of the Rings in terms of visual effects and overall style. But the story has now become much more interesting and multidimensional as we watch the Fellowship, now divided, struggle to complete their journey to save Middle Earth. 4/4 stars."
    },
    {
      "rating": "10",
      "text": "The best sound effects, also known for its impeccable sound, the script developed, very faithful to the book, good performances, a show well done, as I can say about the soundtrack, direction, costumes, makeup, art direction and visual effects. In short, an excellent movie."
    },
    {
      "rating": "9",
      "text": "magnificent is the word i will say for this film, i havent read the book . And im sure i wont..cinematography is top notch expecially in the battle scenes its really awesome."
    },
    {
      "rating": "10",
      "text": "The Two Towers might not be the best of the three Lord of the Rings movies, but it sure is one of the best movies I've ever seen! Great acting, story and scenes - movies cant get much better than this."
    },
    {
      "rating": "10",
      "text": "Entretenida, con efectos especiales del mejor nivel, con un actuaciones sorprendentes y mas accion que la anterior. The Two Towers es simplemente perfecta, visualmente rica y muy bien dirigida por Peter Jackson. Es casi imporsible poder mejorar a The Fellowship of the Ring, pero Two Towers logra no solo ser tan buena, sino hasta mejor que la original."
    },
    {
      "rating": "10",
      "text": "My favorite of the trilogy. Peter Jackson is a cinema god, there is a reason RotK tied for most oscar wins for one movie. Best fantasy novel and the movie does it complete justice. This is what modern cinema is all about: great acting, tasteful and thrilling special effects, excellent story of course, amazing screen play and the most spectacular soundtrack which is epic in battle sequences and harmonious in times of peace. A true masterpiece. To be watched again and again. 5/5 stars."
    },
    {
      "rating": "8",
      "text": "While the plot tends to meander, Two Towers is still alive and breathtaking in the moment. Jackson has proved himself to be a master craftsman of the so called 'epic movie.'"
    },
    {
      "rating": "10",
      "text": "With mind-blowing performances from the whole entire cast, along with skilled dialogue. Featuring its amazing visual effects, breathtaking action, and being even more emotionally resonant than the first. I give this movie 98%."
    },
    {
      "rating": "10",
      "text": "This isnt filming this is art.."
    },
    {
      "rating": "10",
      "text": "This movie is pure gold. Besides a few weak points like some unrealistic lines and the shield-boarding down the stairs, it's perfect. There is no lack of emotion, all performances are good and the battle at Helm's Deep is perhaps the best ever in a movie. The highlight for me was the introduction to Gollum, though. He is one  of the best characters ever."
    },
    {
      "rating": "8",
      "text": "When compared to the previous movie, it was same old, same old for some stuff. Enjoyable, but too long. Plot became a bit more complicated, but battle scenes became much more awsome."
    },
    {
      "rating": "10",
      "text": "the best in the trilogy and the awesomeness in the franchise."
    },
    {
      "rating": "10",
      "text": "I do love all three films of The Lord of the Rings trilogy, all are visually stunning with wonderful music and strong narratives. The Two Towers is my personal favourite of the three for several reasons. For one thing it is less talky than Fellowship of the Ring, and the pace is a little more secure here. Also the final battle is just breathtaking in the action, direction and in its scope, and very compelling and epic. And some of the characters are developed more here than they were in Fellowship of the Ring primarily Frodo and Aragorn, who were played very well there but a little bland in comparison to here.When it comes to the scope The Two Towers is possibly the biggest in the trilogy. The cinematography is one of the strongest assets, while the scenery, costumes, lighting and make up(the orcs look amazing) are all gorgeous. You can tell a lot of effort went into this and it showed. The music is also darker and perhaps more complex, the story is richer and compelling and the dialogue is thought provoking. People may disagree, but I think The Two Towers is the best directed of the trilogy too.The acting is very good. Elijah Wood is likable enough with a stronger-written character, while Sean Astin's bumbling persona suits Sam really well. Viggo Mortensson is as strong and charismatic as ever. Ian McKellen, Christopher Lee and Bernard Hill are also perfectly cast, but the real revelation in my view with this movie is Gollum. Here Gollum is designed superbly, and Andy Serkis's performance is absolutely phenomenal and Oscar-nod worthy.In conclusion, a fine film and for me my personal favourite of the trilogy. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "(97/100)(I watched the extended cut). Amazing, just amazing! Best one out of the trilogy."
    },
    {
      "rating": "3",
      "text": "[***Potential Spoilers***]  I loved the stunning cinematography and mountain vistas, I'd bet Jackson could do some wonderful tourism films for New Zealand, something a little less ambitious... Another thing that I liked was Gimli's line about dwarf wives and Aragorn's comment about the beards. It's true to the story, but it is information that's in the book, and inserted in such a way as to develop the history that otherwise would be hard to translate to a film. I wish they'd done some of that during all the travel sequences. And the cgi Gollum was pretty well done technically, but watered down scriptwise, and the (gollum,gollum) was overdone. (Fisssssh!) ...... Other than those points, it was horrible. Horrible. A lot of it boils down to some bad decision making, I think - hiring Liv Tyler for what is not just a bit part, but a minor bit part. I love her in the role, but it's extravagant unless you do as was done and rewrite major portions of the story to justify the expense. Another bad decision was building the set for Edoras. Why? For 3 or 4 scenes? What a waste. But the unforgiveable sin is the complete altering of the story line. Someone earlier mentioned pandering to your typical movie-goer's sensibilities, like not sending the women, children and old men to Dunharrow. Or Leg - O - Lamb skateboarding down the stairs shooting orcs on the way. Please. Then there's the whole loony Aragorn/Arwen sequence. Did someone really think this was an improvement over the book's storyline? Send me some of whatever it was you were taking when you made that decision, ok? Instead, we could have had the wonderful scene in Isengard where Gandalf masters Saruman with mere words and not the ludicrous pyrotechnics we were bothered with in the FotR movie. Or to quote from the TT itself 'Wizards are subtle and quick to anger'. Subtle. I'll bet that's even defined in dictionaries in New Zealand. The part I'm referring to is where Gandalf is talking to Saruman in the tower, and Saruman refuses the offer to mend his evil ways and still help, in some small way, those he was sent to help. Then Gandalf says 'Saruman, your staff is broken.', and it breaks, and his power is broken by the same force that reincarnated Gandalf. Subtle, but very dramatic if done right. And why precious, oh why, did they decide to change Halbarad and Aragorn's other Ranger kin into elfses, and then kill Halbarad in Helm's deep instead of later? Why? I'd have thought it much cooler to see riders that even the horsemen of Rohan knew were the better. One of the most dramatic moments in the second book, I think. Lastly, the final ton of hay that breaks this camel's back is the Osgiliath sequence. Faramir deciding to take Frodo to Minas Tirith, instead of showing his better intuition about the ring and allowing them to continue. Frodo offering the Ring to the Nazdrool, right there where there's no real defense to prevent it being taken. I've often wondered if the writers didn't have bad dreams after reading the Cliff Notes of the Reader's Digest Condensed Version for Dummies of the Two Towers and felt the need to rewrite it. I mean, do you really believe a commitee of people I've never heard of before could possibly re-write something that's sold millions of copies over almost 50 years and improve it? Didn't they understand that the whole game was won or lost on keeping the Ring's location and more important, final destination secret? The way the book plays it, Sauron thinks the Ring is in Aragorn's hand after he shows himself as Isildur's heir with the reforged sword that took the Ring. Now obviously I'm one of those that have read the trilogy more than once, which is saying something. I've read tons of books, but not many rate one re-reading, but I've read these more than I can count. Despite that, I can't quite imagine it real enough. I want to see it just like I've read it, or as close as humanly possible. I know it's difficult translating a book into a movie, and we're talking one book, not 3. I have to give the guys credit for being crazy enough to try and pull this off. They certainly did better than the Ralph Bakshi animated movie that only did about the first half of the story. But I was very disappointed by the sudden complete departure from the story in this movie. I had problems with the first one, but they didn't ruin the movie for me. But I'm still glad I went to a matinee and only paid 2.50 to see this dog."
    },
    {
      "rating": "5",
      "text": "This somehow did not work for me. If this was supposed to be serious, it was verging on the ridiculous. I could excuse the first one for a little low-brow humour considering it didn"
    },
    {
      "rating": "10",
      "text": "With just as much thrill and wonder as the Fellowship of the Ring, we find ourselves a bit farther on this remarkable journey. The relentlessly beautiful visuals are perhaps some of the finest cinematography of all-time. Another modern classic."
    },
    {
      "rating": "10",
      "text": "If you don't love this movie you should go to the doctor because you clearly have something inside of you that prevents you from recognizing the epitome of what is a perfect film."
    },
    {
      "rating": "10",
      "text": "In my opinion, the best of the Lord of the Rings films, and that's saying a lot. Not only does it duplicate everything that the franchise's first installment did right, it adds more of its own, such as the brilliantly made Battle of Helms Deep."
    },
    {
      "rating": "10",
      "text": "The best movie from one of the best trilogies ever. Great battle and awesome story. LOVE IT !!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "Not as good as the first film, this film may feel long in some parts but it still boasts of what the first film contained: great action, adventure, fantasy, good acting, great music and stunning cinematography.  I think this is the worst of the trilogy, but it still is a great film nonetheless."
    },
    {
      "rating": "10",
      "text": "The Lord of the Rings: The Two Towers is yet another near flawless film in this already magnificent trilogy. Oddly enough, this is my least favorite in the trilogy, but it still delivers so much perfection in every single area. It's one of my favorite movies of all time."
    },
    {
      "rating": "10",
      "text": "the best sequel ever made in my opinion, even the two towers can beat the godfather part 2 i think this movie should have won oscar for best picture in 2002. PERFECT!"
    },
    {
      "rating": "10",
      "text": "Вторая часть трилогии немного уступает первому и третьему фильмам. Но она также заслуживает наивысшей оценки. Фильм \"Две Крепости\" в основном сосредоточен на войне с Саруманом, и, конечно же, на таком известном персонаже, как Голлум (Смеагол), которого отлично сыграл Энди Сёркис - (очень жаль, что ему не дали оскара). Спойлер - в этом фильме мы впервые видим Гэндальфа в белом обличьи (и, к слову, он мне больше нравится серым.) - Он словно стал ещё мудрей, а также будто стал сиять. Пролог - весьма зрелищно. Орки - ну просто \"красавцы\". Энты - круто, - и очень классно они говорят. Страна Рохан - отличный перенос с книги на экран. Хорош и его конунг - Теоден Роханский, а его перевоплощение - просто верх компьютерной графики. Все актёры играют хорошо, скажу сразу, так что придираться не к чему. Мой любимый эпизод из фильма - битва за Хельмову Падь, - её я считаю лучшим воплощением осады крепости на экране. Снято это очень атмосферно, и создаётся ощющение присутствия. Когда падает лестница, и камера наклоняется, захватывает дух... - Особенно, если смотреть в темноте и на большом экране. Арагорн же в этой битве очень воодушевляет. Любимая его фраза: \"Надежда всегда есть\". А кинотеатральное превью к этому фильму я считаю одним из лучших трейлеров в истории. Культовый и шикарный фильм. - Мне больше нечего сказать. 100/100 или 10/10 (или 5/5 или 4/4)."
    },
    {
      "rating": "9",
      "text": "When the \"worst\" movie of a trilogy is an absolute 9, then you sir, have a damn fine trilogy. This is an incredible movie from start to finish, but the one drawback is that it feels like it was continued and needs continuing. The thing is, it's actually worth the ride."
    },
    {
      "rating": "8",
      "text": "Imma be honest: I wasn't sure to choose between 8 or 9 score for this film. It's a really good movie and the whole story was building up for the third movie. The battle at the castle and taking over Isegard (sorry if I spell that wrong) is arguably the best scene in this movie."
    },
    {
      "rating": "10",
      "text": "A beautiful continuation of the middle earth story. The acting is impeccable, the practical effects are intricate. One of the rare cases where the movie is better than the book."
    },
    {
      "rating": "3",
      "text": "The Two Towers stifles its potentially memorable moments for low-brow humor, and overstays its welcome by over an hour, despite not boasting a single developed character."
    },
    {
      "rating": "0",
      "text": "The battles are just boring and unrealistic, didn’t find the sense to the movie, not good acting and didn’t follow the dialogue and the story as it is BORING"
    },
    {
      "rating": "9",
      "text": "Great external and internal conflict! This is the best of the trilogy. Gollum is the best computer-generated character in cinema up to this point. I think the extended version it too long, though."
    },
    {
      "rating": "10",
      "text": "What a Visual feast! Admittedly Fellowship was a little better at emotional connection with the characters but in this epic adaptation of the 2nd book of the trilogy, it is so easy to have the size and scope of it all overwhelm the individual players. But this is exactly the point. This is war. This is life or death, undertones and inner motivations are no longer relevant not when there are 10,000 effin orcs beating down your door! Yes, know the elves should NOT have been at Helm?s deep and the Hurons should have been (and why did Haldir say greetings from Elrond and not Galadriel, he was a Lorien elf after all.) Quickbeam and Grishnak had the same agent as Bombadil and Glorfindal etc. etc. blah, blah blah. I am as huge a fan of the novels as any, however I find it difficult to understand those who cry foul with such veracity in regards to any alteration as if PJ is destroying Tolkien?s vision of ME when, in fact he is bringing so many more to this world than ever before. They will come, they will see the film, some will then read the source materiel and hopefully the differences between the two will be small enough to keep the virgin reader yet large enough to allow him/her to construct there OWN minds eye view of Tolkien?s world. The CGI Gollum in TTT was exactly what Ian Mckellen was in FotR, the actual character plucked straight from middle earth. God, they NAILED him Great job WETA! .... PJ, you barefooted little Kiwi, you did it again! Thanks!!!!"
    },
    {
      "rating": "9",
      "text": "Not as good as the first, but nothing short of magical nonetheless."
    },
    {
      "rating": "6",
      "text": "The Lord of The Rings: The Two Towers is, as a movie, enjoyable. The special effects are spectacular, to the extent that fully CG characters, such as Gollum, seemed entirely real and natural. As an interpretation of Tolkien's novel, however, this picture is very poor. In particularity, certain characters have been altered beyond recognition, and certain events have been changed without valid reason. Although I understand that certain sequences couldn't be filmed due to time constraints, there was absolutely NO reason for Peter Jackson to exclude crucial scenes from the book, only to replace them with senseless scenes of his own conception. The ending sequence at Osgiliath is a particularly egregious example."
    }
  ]
}