{
  "id": 91,
  "title": "The Toll",
  "starring": [
    "Shaina Silver-Baird",
    "Katelyn McCulloch"
  ],
  "runtime": 80,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "A socially awkward driver and a weary passenger try to make it to their destination while being haunted by a supernatural threat.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/q6vV6sSWz9cytmc8L9IEBjjyFmV.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Hey Streamers, Redbox strikes again. Just off the high Holy holiday, we venture back into the horror realm. After scrolling through Redbox, we came upon The Toll. The trailer for the movie seemed interesting. Check it out below. The Toll is about an exhausted traveler, Cami, who gets a ride-share ride from the airport to her dad's house a long distance away. The driver, Spencer, is a little awkward, Cami is anxious; and then, they get stuck on a toll road on the ride home. Of course, this isn't the typical EZ-Pass toll. Let's see if Spencer and Cami can make it to their destination or will the toll be too high.I mean for a thriller that is super short, The Toll takes forever to get going. I mean Cami and Spencer are annoying and paranoid as I don't know what but the first 35-45 minutes of this movie were a snooze fest. Now, after the movie finally jumps off, it gets a little creepy and even has slight VHS and Insidious vibes. Make no mistake this is not either of those two movies by any stretch of means. The stars of this flick try their best to drive this movie forward, but the lack of a visible big bad hurts the feel of the movie. The Toll is definitely a mind game but it doesn't play too much with the viewer but mainly with the actual characters. A scene here or there will give a viewer the creeps but overall the movie doesn't leave a lasting impression.Long story short, The Toll is a horror movie that tries too hard to be intellectually scary than actually scary. There are parts that succeed but on the whole this movie is forgettable. This is one of those movies you stream if you're bored during Halloween season. Handful of popcorn if this comes to a streaming service you already have but don't put out any extra money for a rental."
    },
    {
      "rating": "6",
      "text": "crazy movie, nothing makes sense and it's all messed up. the person who wrote this movie had a vivid imagination"
    }
  ],
  "recommendations": [
    "paranormal_activity_3",
    "escape_room_tournament_of_champions",
    "paranormal_activity_the_marked_ones",
    "frozen",
    "paranormal_activity_4",
    "paranormal_activity_2",
    "47_meters_down",
    "unfriended",
    "cloverfield",
    "crawl",
    "doomsday",
    "the_strangers_prey_at_night",
    "stay_alive",
    "texas_chainsaw_3d",
    "countdown",
    "bird_box",
    "host",
    "the_devil_inside",
    "would_you_rather",
    "the_messengers",
    "final_destination_3",
    "paranormal_activity_the_ghost_dimension",
    "chernobyl_diaries",
    "escape_room",
    "28_weeks_later"
  ]
}