{"id": 3767, "title": "The Disaster Artist", "starring": ["James Franco", "Dave Franco"], "runtime": 104, "genre": ["Comedy", "Drama"], "description": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/jj84nF5vYRD0HUTowBKcrKk8hZP.jpg", "categories": {"plot": 8.130434782608695, "acting": 7.2745098039215685, "ending": 8.285714285714286, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.028571428571428, "action": 5.0}, "reviews": [{"rating": "9", "text": "Made by James Franco and involving all of his usual Seth Rogen related cohorts, I was expecting The Disaster Artist to be a straight up mockery of The Room and it's creator. As it turns out, apparently Franco stumbled upon the real heart of the story while digging through all the behind-the-scenes information on the best worst movie ever made and instead chose to make his film about the unlikely friendship that made it all happen in the first place.On top of directing and producing, Franco even stars as ol' Tommy Wiseau himself. His accent is actually really good and he expertly manages to capture so many of Wiseau's distinctive quirks. The laugh in particular is spot-on. He never plays it like he's making fun of the guy. Instead choosing to let Wiseau's humanity be the main focus of his embodiment.The Disaster Artist never derides The Room for laughs. It's comedy comes from knowing winks like Franco's intentional overplaying of the \"NAAHT\" in one of the source material's most memorable lines, as well as the natural reactions one would have when being presented with Wiseau's unorthodox behavior and approach to filmmaking. It's all much more heartfelt than one might expect.The casting of Dave Franco as Greg Sestero was a good choice. On top of just looking more like a brother to Greg than he ever did to James, Dave's role as the second leading man lends more credibility to the friendship at the movie's core by allowing the Franco's to play off of their natural connection as brothers. It's the first time I've ever come close to liking little Not James.The Disaster Artist is the best way to experience The Room. You get to witness a lot of it's most memorably, wonderfully terrible moments without the shame of having actually watched it. All of the joy, none of the regret. Certain gags might not have the same effect, but they'll still prove to be plenty hilarious. Plus it stands on it's own as a surprisingly sweet and sincere film with a magnetic central performance from James Franco. So you don't need to have seen it's inspiration to enjoy what this movie has to offer.9.7/10"}, {"rating": "9", "text": "An outsider watching this movie will probably see a normal dude hanging out with a disabled person and somehow making a movie. However, The Disaster Artist is aimed for the fans of The Room and Tommy Wiseau. The film shows how Tommy works and does things, although nobody really knows that, and most importantly, the film shows \"what could have been\"-scenes which make every Tommy Wiseau fan feel sympathy for him. This is a great tribute to Tommy. I think James Franco grasped what kind of a person Tommy Wiseau is and he found a great medium to portrait that. Every fan of The Room, Tommy and the book by Greg is going to love this movie."}, {"rating": "9", "text": "A brilliant film with side splitting moments of Joy for fans of 'The Room' and moments of real despair as James Franco really becomes Tommy Wiseau and you can see this was really a film he cared about making."}, {"rating": "8", "text": "I saw The Disaster Artist in an early screening on 25th of November. The screening was packed with people who had all seen The Room, and everyone applauded during the end credits. The Disaster Artist is an excellent adaptation of the book. It's filled with great performances, especially James Franco as Tommy Wiseau who was just hysterical at points, and Dave Franco who was also really good as Greg Sestero and unsurprisingly he and James Franco had great chemistry together. Also the directing - while not mind-blowing - was pretty good too, there was a lot of going on in every scene which made it interesting to watch and especially one scene at the movie set which was a long one shot of just yelling and arguing that was just hilarious. The movie also never actually laughed at Tommy Wiseau, it was actually really sad to see him sad in a couple of scenes, it was handled brilliantly. Although the film never really developed any other characters than Wiseau and Sestero, it was still pretty fantastic. I strongly recommend it to everyone and especially fans of The Room."}, {"rating": "9", "text": "Oh, Hi everyone. I am so glad James Franco didn't make a mean-spirited condescending movie with a two-dimensional portrayal of Tommy Wiseau. I was expecting that when I first heard about this movie, knowing some of Franco's other projects. But the movie is not that. It's empathic. It celebrates people who are brave enough to do what they love even if they are bad at it. That's so tragic to be bad at something you love doing.  I love that the movie criticized the audience too for laughing at him. After a bad performance an acting teacher tells Tommy he has the look of a villain, trying to help him get work. Tommy responds that he doesn't feel like a villain. The audience is the villain for laughing at him. Why do we laugh at him? There are plenty of bad actors that aren't entertaining. I think the comedy mostly comes from Tommy's inability to reconcile what he wants to be with what he actually is. In other words he is delusional. Is it mean-spirited to laugh at that?It would be so ironic if James Franco won the oscar for best actor portraying one of the worst! He did an incredible job and sadly for Tommy, he may deserve it.  We'll see how it stacks up against some other good performances coming out soon."}, {"rating": "9", "text": "Easily one of the best, funniest movies of the year (which isn't saying a ton - this year has been rough). Franco is incredible as Tommy - yes, he slightly exaggerates the accent for comic effect, but it's not a caricature. The supporting cast is really an all-star cast of comic talent. And Jackie Weaver?  How the hell did they get her for this?  Judd Apatow's scene is pretty amazing on a number of levels. It's an American Dream story mixed with the mysteries of Tommy (where's he from?  Where'd he get the $$? How old is he?) Saw The Room at the Sunset 5 Midnight Shows years ago, and this is the perfect companion piece."}, {"rating": "9", "text": "I was fortunate enough to see this in an early screening on November 20, and I loved every second of it! Even those who haven't seen 'The Room' will still likely be able to enjoy and appreciate this film's quirky style and humor, but I'd say that it's definitely a little better and one will likely appreciate it a bit more if they watch 'The Room' first. The whole ensemble cast does a wonderful job, but director/star James Franco is darn near perfect as the eccentric Tommy Wiseau, alongside a committed and worthwhile performance from his brother Dave as Greg Sestero (Oh hi Mark!) Furthermore, the film touches upon and playfully recreates all of the best and most iconic scenes and fan-favorite moments from 'The Room' and even teaches us a few new things or so about what went on behind the scenes while making the film. Overall, it's informative and undeniably funny both as a film in and of itself and as a tribute to one of the best worst films ever made!"}, {"rating": "9", "text": "If you didn't know anything about filmmaker Tommy Wiseau and saw James Franco play him in this movie, you'd think he's gone insanely over the top. In fact, he nails the character's unusual accent, impulsive actions and overall weirdness. Wiseau wrote, directed and starred in what some people consider the worst movie ever made, THE ROOM. This biopic details his friendship with an aspiring young actor (played by Dave Franco, James' real-life brother) and his bizarre and bungled attempts to make the movie. James Franco (who also directed) captures the character's offbeat comments and random timing to delightful comical effect. The whole experience is incredible in an absurdly amazing way. NOTE: At the end, see side-by-side comparisons of the original scenes with this production's recreations AND AFTER THE CREDITS, see the 2 Tommys interact in person for one final peculiar moment."}, {"rating": "0", "text": "IDK, Maybe I am missing the appeal of this film because I thought it sucked. Half the movie is spent on this painfully awkward introduction to Mark and Tommy's \"friendship\". This friendship really comes off as Mark realizing that Tommy was rich and so he uses Tommy and his money to further his potential acting career. Progressively through the movie, We kind of see that confirmation as Mark becomes frustrated with not just making the film but also with lack of work as an actor and in turn he takes the frustrations out on Tommy,  who genuinely seems to be lost in his own little world.And performance wise, I get that they have to act terribly when re-creating scenes from the actual film but even when they are acting outside of that, The cast still does a bad job at acting in general. It just doesn't sit right. And I didn't find the movie funny at all, I found it more pathetic than anything. And the trailers spoiled a good many of the \"funny\" moments throughout so that kind of ruined the fun as well."}, {"rating": "8", "text": "A film that tells the tale of one of the best worst films ever made. Inherently The Disaster Artist is a film about dreams and friendship. It speaks to the idea that a dream can be achieved even when expecting something very different. It is also remarkable how they were so spot on with The Room. A-"}, {"rating": "10", "text": "I saw \"The Room\" about a year ago and since I found out that this movie was in production I was waiting for it. Moreover, I was waiting for this movie more than \"Star Wars\".The performances are 10, there is chemistry among all the actors and James Franco disappears completely, what we see on the screen is Tommy Wiseau an we get, at times, to hate and also to love.The film is excellently made, the scenes of \"The Room\" are the same and the film has excellent comedy scenes as well as excellent dramatic scenes.The Disaster Artist is, in my opinion, the best movie of the year."}, {"rating": "10", "text": "An amazing story, one that is hilariously and beautifully told with a real heart to it. James Franco absolutely owns the show with a spot on impression. Also, stay for the credits."}, {"rating": "9", "text": "I did not expect to like this movie. I was pleasantly surprised. I laughed to tears. It has heart, comedy, inspiration and fun. Bravo!"}, {"rating": "10", "text": "“I did not hit her, it’s not true, it’s bullsh!+, I did not hit her, I did not! Oh hi Metacritic! I am proud to say that The Disaster Artist is a autobiographical masterpiece and  this movie will make you appreciate, laugh, and cry about how Tommy Wiseau and Greg Sestero became infamous on creating the best worst movie ever made. If you’re a fan of The Room, I encourage you to see The Disaster Artist so you can definitely learn what went down before and after the production of The Room. And trust me, it’s really that damn good!"}, {"rating": "8", "text": "I don't think that people who have not seen The Room will love this film as much as I did.  I am cognizant of the fact that seeing the source film and understanding how insanely bad it is makes The Disaster Artist a different experience.  But, on its own, this is a film about a person trying to create his dream (albeit an insanely lame one).  James Franco took a few liberties with the story, but he clearly has a deep-rooted affection for Wiseau, his artistic goals, and his atrociously bad film."}, {"rating": "7", "text": "Despite a half-baked trailer that makes this project look like an ill-conceived project drummed up by frat boys between bong hits, this quirky fact-based comedy is surprisingly entertaining, if a bit dragged out in spots. A more fully fleshed out back story probably would have helped make the point of this offering something that viewers could more readily relate to as well. Nonetheless, the film delivers surprisingly well in the performance department, with fine turns by the Franco brothers and an array of colorful supporting cast members. A delightfully pleasant surprise from a release that, upon first glance, would seem to have little to offer."}, {"rating": "8", "text": "For anyone who has seen The Room then this needs no introduction, for everyone else all you need to know is The Room is quite possibly the worst film ever made. And as someone who has recently watched The Room before seeing The Disaster Artist you do not have to see it unless you really want to, because it really is as terrible as you've heard. In fact it's probably worse. The mystery that is Tommy Wiseau, whether he's just a little eccentric or downright bonkers one thing's for sure he is going to be a star and he is going to make the greatest movie ever. Where he came from, how old he is and where the seemingly endless pit of money is coming from no one knows but sit back and enjoy James Franco completely transform himself into Wiseau and get a taste of what went on behind the scenes of the making of The Room.The Room is so horrendously terrible you either love it or hate it but no matter how you feel about it everyone can appreciate The Disaster Artist for its charm, humour and the spectacular recreation of the original scenes from The Room. The attention to detail in every way was perfect, not a movie to leave during the end credits. It begins with the friendship between Tommy Wiseau and Greg Sestero and continues with their decision to move to LA in an attempt to make it as big movie stars. When this doesn't happen the way they expect Wiseau decides to write, produce, star and direct his own masterpiece and thus The Room was born. You don't always see an actor completely lose themselves in a role but James Franco does just that effortlessly. At no point do you see James, he pays homage to Tommy brilliantly and only the way a true fan could. One minute you're laughing at his performance and the next you're filled with sympathy for his character. Everything that seemed to go on behind the scenes of The Room was a disaster I only wished they had shown a little more in that area and a little less of the build up. A movie about the making of a movie so bad over time it developed a cult following. It's easy to make a bad movie, there's so many you can take your pick but to make a bad movie that so many people love is rare. The Disaster Artist is up there with Ed Wood and it's highly recommended."}, {"rating": "8", "text": "Though certainly not a masterpiece, The Disaster Artist tells the story it wanted to tell and does it wonderfully. Whether it's James Franco's fantastic rendition of Tommy Wiseau or the uncanniness of the overall accuracy of the reshot Room scenes, it's hard not to find something to love about this movie. And in a theatre bursting with laughter, how couldn't you?"}, {"rating": "9", "text": "The Disaster Artist is easily the feel good movie of the year. James and Dave Franco put on a powerhouse performance that will not only leave you in stitches, but will also touch your heart and really connect you with the characters. Surprisingly, you will be rooting for Tommy every step of the way, you will be cheering his successes and weeping for his failures. At points, I forgot I was watching James Franco and thought I WAS watching Tommy Wiseau! I think James Franco will easily get a nomination for best leading actor this year in the Academy Awards, and I would wager money that he will definitely be taking home the Golden Globe for Best Actor in a Comedy. The Disaster Artist is also an incredibly strong contender for Best Adapted Screenplay. This movie is a MUST-SEE for fans of the so-bad-its-good cult classic The Room. I will give one caveat about my 9 rating: if you love The Room, this is easily a9 or 10. If you have never heard of The Room, then The Disaster Artist probably only rates a 7 or 8."}, {"rating": "9", "text": "The Disaster Artist is based off of the book by Greg Sestero about, in a nutshell, the making of The Room. James Franco and his brother Dave Franco play Tommy Wiseau and Greg Sestero respectively, and James directs and acts in this film amazingly. He balances humour and sadness perfectly, including so many homages to some of the 'best' lines in The Room (as is expected). His performance really makes you connect with his and Greg's and everyone else who worked on the set of The Room. Definetely worth watching, and reminds you how much of a classic 'The Room' is."}, {"rating": "0", "text": "this is the most cringy thing I have ever watched, bull***t based on a true horse***t, this is wasting 2 hours of your lifethe first movie was a disaster itself I can't understand why and how the idea of making a movie based on that come to their minddamn, It was awkward and painful to watch I'm sickened with this!"}, {"rating": "8", "text": "Funny, Endearing and Moving. A laundry list of solid actors in comedians in the holly wood ensemble help this movie take flight and support the great work done by the Franco Brothers."}, {"rating": "8", "text": "Oh, hi Mark! This is a film with a premise that relies on you having have seen The Room - a cult ‘classic’ widely considered one of the worst films ever made - and explores the making of this disasterpeice by writer, producer, actor, and director, Tommy Wiseau. Franco gives a fantastic performance as the eccentric Wiseau, and he is supported by an all star cast who provide entertaining cameos and a sense that they're all in on an hilarious joke. The laughs are frequent, the pacing is tight, and the absurd scenario plays out with added drama knowing that The Room was actually made. An esoteric but well realised comedy, this is was a fun experience that almost (but not totally) made up for having sat through the film on which it is based. 7.89/10"}, {"rating": "7", "text": "the Disaster Artist is fantastic!It's a very fascinating look at people who just generally wanna make movies. It's quite heart-felt, quite funny, and just overall fascinating FINALLY being able to watch a flick that basically explains the story behind, personally, my favorite Satire of all time. Issues with the film are really just the fact that it does become quite cheesy hollywood near the end. Also the humor doesn't always hit with me. Idk, not all of it was personally my cup of tea. Overwise, I do recommend watching the flick."}, {"rating": "2", "text": "After “God’s Own Country”, “Wonder” and “Coco” I thought I was on a roll but then I was hit smack in the face with the awful “Just Getting Started” and now “The Disaster Artist”!I really don’t know how I feel about James Franco as an actor as he can be excellent as he is in the double role in the HBO series “The Duece” but unforgettable in most movies he makes.In “The Disaster Artist” he plays a weird and basically dislikable human being who, supposedly, made the worst movie ever made though I have heard that about other directors and their movies—Ed Woods, anybody? This may be the worst film made about a person who wrote, starred in, produced and directed a movie, in other words, Tommy Wiseau.Dave Franco, yes James’ brother, plays Greg Sestero who becomes lifelong friends with Wiseau without any real reason given in the film except, maybe, to hang onto the wealthy Wiseau’s for his money. I was going to say fame but before this film I never heard of the man, well either, or the movie he made “The Room” or the book this film is based on written by Sestero.The only ‘interesting’ thing about this movie is the end—no, not a pun—where they show the actors in this film alongside the original actors in “The Room”.Please don't even accidentally confuse “The Room” with last year’s excellent “Room” and don’t waste your time seeing “The Disaster Artist”. You would be better off seeing the film about James Dean, who is referenced in this film, which made James Franco a star."}, {"rating": "5", "text": "A movie about a rich guy who fancies himself an actor but who has no talent and no one will hire him. So he produces, directs, and stars in his own movie. Why was this movie made? Is it that important or compelling a story to be made on film? No on all counts."}, {"rating": "7", "text": "While I enjoyed it, The Disaster Artist is very loose on the source material (the novel) and outright changes events to things that NEVER happened. Still, it does live up to the purpose it was supposed to convey:Tommy was a giant Man Baby and The Room is one of the worst movies ever committed to film. While I love the Room (for all the Ironic reasons) I found myself sitting thru the movie catching things that were clearly conclusions viewers of the actual movie came away with (Why is he having sex with her belly button, why is Johnny laughing at a women getting beat up) and wondering why James/David Franco decided to put those in here. Not really fan service....but kinda?There are these notions of Best Picture nod for this movie currently and I don't see it myself. Still If you've seen The Room, You have to see The Disaster Artist. Also,read the book."}, {"rating": "8", "text": "If you are thinking about seeing this movie, and you have not seen \"The Room\" I would strongly recommend watching the \"Best\" (worst) moments of the film on Youtube, which is about a 8 or 10 minute condensed version of all of the worst...moments of the movie.  I have not seen the entire film myself and have only seen this condensed version of about 10 minutes..and was able to completely understand everything in the film as it recreates pretty much every one of those key scenes.  So with that said, if you have at least seen...scenes of the film you will be able to understand \"The Disaster Artist\" much better and enjoy it more fully.  I really really liked \"The Disaster Artist\" and it would easily be one of the best comedies of 2017 and one of my favorite movies of the year.  Ultimately it treats Tommy slightly sympathetically which helps with the humor and is mostly a buddy-movie about friendship and following your dreams.  The only failing of the film would maybe be how it did not shine a critical light on his character or delve too deeply into what makes him tick, but as a comedy that was not its objective, so it didn't dwell too long on the negatives, besides a few moments in 1 or 2 scenes, 1 of which being the most telling of the character in the film..which is only about 30 seconds.  But...again, as a comedy and just showing what went down behind the scenes and the backstory of how these two guys met and the humor that comes out of them making one of the worst movies ever..and exceptional acting by Franco and Franco both...extremely good movie (for a comedy), with a lot of heart."}, {"rating": "8", "text": "Led by a very powerful performance from James Franco, \"The Disaster Artist\" is compelling, dramatic, funny, and light-heartedly heavy. Faithful to a very unusual true story, and telling the events of how one of the worst movies of all time came together, with some well-placed analogies between the scenes from \"The Room\" and the re-enactments of those same scenes in the 2017 hit at the end, this film makes for a very enjoyable watch."}, {"rating": "9", "text": "An achievement in that it not only delivers all the expected laughs, quotes, and moments that a film about the making of \"The Room\" should deliver, but in that it also delivers a little bit more than just that. Indeed, James Franco's \"The Disaster Artist\" is also an affecting study on art, the effects of its consumption, and the very human need to express oneself an be heard in a very cruel world. The resulting experience is that of one of the year's finest. A simultaneously heart-breaking, hilarious, relatable, and maddening story that's almost too good to be true. But what a story it is (Mark)."}, {"rating": "7", "text": "I refuse to give this film less than a low green grade because it is a masterpiece in its crazy way. I may have been bewildered, but certainly I wasn’t bored. James Franco gives a terrific performance, and he has a wonderful supporting cast of “losers.” Don’t go to this film if you are straight-laced and rigid, but if you can “go with a film,” you should enjoy it."}, {"rating": "7", "text": "Funny and sensiti with the right amount of pathos. This movie plot could easily have crossed the boundaries into humiliation of its subject. It never does, it does not ridicule or demean in any way and the result is great fun."}, {"rating": "8", "text": "James Franco's biopic is a good homage to the behind the scenes of the worst film ever made. It is truly enjoyable and somewhat informative to what happened behind the scenes, however was a fairly predictable plot and expected film about Hollywood's most eccentric director."}, {"rating": "9", "text": "It's a nice tribute to \"The Room\" and Tommy Wiseau. While the Room was a very very bad movie, the movie is about 2 people who want to accomplish a dream and go out and do it. It's basically a movie about reaching for the stars because even if you fail, you land on a cloud."}, {"rating": "8", "text": "One of the boldest book adaptations and at the same time the most interesting \"making of\" in 2017. In this production, almost every aspect is at the highest level, great acting, story and perfectly designed set. I have nothing to worry about."}, {"rating": "8", "text": "A real, funny and incredibly original story, followed by the great performance given by Franco, give to \"The Disaster Artist\" a great spirit of irony and hope."}, {"rating": "8", "text": "Maybe it was the provocative ads around town that led to actually seeing the beyond awful amateur film, or the book on the making of it which this movie is based that caught my eye in the bookstore a few years ago... whatever the case, this held my interest all the way which is the most important thing any movie can do.  James Franco is particularly good in a wickedly funny send up of Hollywood wannabes with even fat talentless slob buddy Seth Rogen not getting in the way for once and himself proof that indeed anybody can get really lucky and make it in Tinseltown."}, {"rating": "7", "text": "While depictions of characters look realistic comparatively and bring occasional laughter, the film does not have much of a central message."}, {"rating": "10", "text": "My new favorite movie of 2017, 'The Disaster Artist' is a movie about friendship, and ambition, the ambition of a passionate actor/filmmaker failing miserably... but also succeeding in the long run. We see a young Greg Sestero (Dave Franco) struggling in acting class back in 1998, he gets nervous to recite his lines in front of large groups of people, and feels as if this may not be the right path for him. It is there that he meets a strange, long-haired, weird accent, and odd fashion sense of a man named Tommy Wiseau (James Franco), who doesn't mind over-acting and trying to give his best in front of these people. Greg is fascinated by Tommy's confidence and ambition, so he wants to hang out with him, and maybe get some advice. Tommy agrees, and they both form an unstoppable friendship together, always watching James Dean, and making the abrupt decision to travel to Los Angeles to fully realize their acting dreams. Tommy and Greg try everything they can to audition for roles, but the casting agents don't see any potential in any of their charisma, or lack there-of. Greg ends up meeting a girl at a club named Amber (Alison Brie), and Tommy sees that this will cause a bit of friction in their friendship, as he needs Greg to focus 100% on their dreams. After nothing but rejections from all over, Tommy is feeling emotionally drenched about it, and is ready to give up. However, Greg comes up with the idea that they should just make their own movie to show up everyone. That is where 'The Room' (2003) was made. The movie, directed by James Franco, and based off Greg Sestero's book \"The Disaster Artist: My Life Inside The Room\", does a great job at making Tommy Wiseau seem sympathetic, since there have been many parodies of portraying Wiseau and making him seem like an idiot, this is not a satirical take on the character. The comedy is very minimal, and the drama is genuine. 'The Room' (2003) is one of the worst movies ever made, and I rated it 0/10, but as a comedy, it is a 10. To discover the amount of crazy ambition and stress that went into making that movie is fascinating. 'The Disaster Artist' is my favorite movie of 2017 about the making of one of the worst films ever, it's well acted, well told, and very interesting. If you've seen 'The Room' (2003), you have to see this."}, {"rating": "8", "text": "This film was showing for such a long time I just had to go see it for my own satisfaction. What a bizarre colorful story. Franco was excellent in portraying the true character. Such an off-the-wall story it truly escalated the theatrical atmosphere."}, {"rating": "9", "text": "The Disaster Artist is about the enigma known as Tommy Wiseau, and his cult creation, The Room. The movie offers a tongue-in-cheek glimpse into the making of The Room, and what led to it's conception. James Franco was brilliant. He captures the essence, and mannerisms of Tommy Wiseau incredibly well. I was convinced that I was seeing Tommy, instead of Franco. Everyone here acted brilliantly when they were asked to act horrendously. The movie will satisfy all your expectations coming into the theater. It will make you laugh out loud, while making you cringe. It's an awkward \"Did that really happen?\" kind of laugh, and I love that. Overall, I really did enjoy this film, and it was a feel-good kind of movie for me. I felt good coming in, and I felt even better coming out of that theater. I don't think you need to watch The Room before watching this film, but it helps to know a bit about The Room beforehand. It's better, but it's not needed. I do recommend this movie to anyone who wants to have a good time. Read about, or better yet, watch The Room to enhance your appreciation for The Disaster Artist."}, {"rating": "8", "text": "\"The Disaster Artist\" was a very good movie, the story was very good, although it had some flaws. And the interpretations were good. The story behind the \"best\" worst movie in history is very well told and totally spectacular. I also loved the comparisons of the scenes of this film with the original. Amazing."}, {"rating": "8", "text": "I did nat, Oh Hi Mark. Did you ever wonder how they made one of the worst films ever made? Luckly, The Disaster Artist will respond your anweser in a hilarious way. This movie is both funny and emotional whit amazing performances (James Franco to the Oscar), good script and also a lot of great jokes. This is one of the best movies ever made of 2017."}, {"rating": "5", "text": "First of all I didn't watched the movie Room so it was probably my mistake for picking this movie. At first I didn't even knew what this movie was about, but it had some similar scenes and I remembered that these scenes is so similar with scenes of movie Room which I watched before. So then I knew what it was about it kinda disappointing me but I still managed to watch it till the end. But at the end I felt nothing, nothing special."}, {"rating": "9", "text": "The Disaster Artist is a funny movie and a personal triumph for Tommy Wiseau.The Disaster Artist is an adaptation of the eponymous book written by Tommy Wiseau's friend and The Room co-star Greg Sestero, where he describes his friendship with Wiseau and the background circumstances while making the cult hit The Room.James Franco takes up the seemingly impossible task of impersonating Tommy Wiseau and somehow he pulls it off. Franco successfully copied Wiseau's speech, expressions and mannerisms to the most minute detail, and I thought no-one would ever be able to do that. His younger brother Dave Franco portrays Greg Sestero. This movie also focuses on the human side of Wiseau and Sestero, not just their public personas. The scene in the end, where Wiseau is devastated by his film's apparent failure at its premiere and Sestero consoles him, is really great.There is plenty to enjoy for fans of The Room. The behind the scenes developments are shown during the filming of The Room, and there are also perfect remakes of some classic The Room scenes. But if you haven't already seen The Room, you won't appreciate The Disaster Artist at all. It's a fan-service movie above all else, and also a movie for James Franco to make a name for himself with an unbelievable performance. Franco deserved to get an Academy Award for his successful portrayal of a unique person like Tommy Wiseau, but he wasn't even nominated for some reason.All in all, The Disaster Artist is made for The Room fans. If you haven't seen The Room go watch it first, and then proceed to The Disaster Artist."}, {"rating": "5", "text": "James Franco is absolutely fantastic as Wiseau and the film has an endearing sense of sincerety, other than these two positive aspect I did not find the film to be that exceptional. Most of the scenes that were funny were the recreations and I found the \"moving\" emotional scenes to be sorta cute, but overly schmaltzy. I found The Disaster Artist to be kinda bland and more or less boring. It's extremely overhyped. I'd say that you'll probably enjoy it more if you haven't seen the original, but as far as a recommendation goes, go watch The Room instead."}, {"rating": "8", "text": "I mean, this movie hit it right, i haven't watched The Room, but i definitely want to watch it... imagine that, i want to watch the so called \"best worst movie ever\". James Franco did wonders in this part, and Seth Rogen was fantastic, and leaving the mistery behind Tommy Wiseau is also a great way to end. Of course there are menor issues like the fact that they should have dove more into the start of the Tommy and Greg friendship, because it seems they just become friends out of the blue and in a day he's moving to LA with someone. But i enjoyed myself watching this and made me appreciate James Franco even more"}, {"rating": "5", "text": "It's kind of sad when the whole point of a movie is to show how well James Franco can impersonate someone and shove it in everybody's face...."}, {"rating": "7", "text": "The disaster artist is about the making of the cult movie \"The Room\", so you should see that first instead to appreciate \"The Disaster Artist\" better. What's good about this film? James Franco's acting is superb in imitating Tommy Wiseau, it's quite funny if you liked the first movie and has nice insights on our favorite trash movie.It's not groundbreaking though and will not make you laugh as hard as the real film. Still worth watching if you are a fan of \"The Room\"."}, {"rating": "9", "text": "This movie definitely maked me appreciate The Room way more than i already did, it showed how tough it was and how courageous they were. I like how the movie teach you that if you want something, you gotta go for it, just like that, don't make questions, but work hard investing your time and whatever else you could to make it happen, not mattering where you from, how old you are or who you know. Tommy Wiseau story on motivating and doing this movie is fantastic, how no one believed in him and how he was affraid to say that he wasn't even from U.S., probably because of the fear of repression, then he just said \"you know what? i'm gonna do this anyway\", or better.. We gonna do this, because Greg also have a nice story. The way that Tommy convinces Greg to get on that trip is just simply and well done by James Franco, which brings us to the actors performance, James and Dave Franco do a great job, because they are brothers the chemistry works very well, so together as individually. James Fraco transmits the character, almost perfectly, facets, extravagance, passion and personality, the accent is great and very close to the real one. \"HAHAHA\"Technically the movie is operant, it works but isn't special, but it is very funny and dramatic, the end of the movie really puts you in some emotional moment that you can feel it, much because of Francos acting.I believe that the post-production of The Room could have been more exploited, the dubbing and the montage could have provided some comic moments. The recreation of scenes are phenomenal that in general gonna put you in laugh mode.I like to say that the room is a terrible voluntary drama and a great involuntary comedy. The disaster artist literally makes you feel how hard and worthy was that movie, trying to score a goal and ending up making a basket brilliantly."}], "recommendations": ["the_upside", "inherent_vice", "eddie_the_eagle", "the_king_of_staten_island", "greenberg", "changeling", "logan_lucky", "the_irishman", "magnolia", "joker", "eternal_sunshine_of_the_spotless_mind", "the_royal_tenenbaums", "the_bucket_list", "rush", "tusk", "mystic_river", "the_green_mile", "chef", "million_dollar_baby", "american_hustle", "the_shawshank_redemption", "the_lucky_one", "ghostbusters", "hustlers", "true_grit"]}