{
  "id": 4134,
  "title": "The Sum of All Fears",
  "starring": [
    "Ben Affleck",
    "Morgan Freeman"
  ],
  "runtime": 124,
  "genre": [
    "Thriller",
    "Action",
    "Drama"
  ],
  "description": "When the president of Russia suddenly dies, a man whose politics are virtually unknown succeeds him. The change in political leaders sparks paranoia among American CIA officials, so CIA director Bill Cabot recruits a young analyst to supply insight and advice on the situation. Then the unthinkable happens: a nuclear bomb explodes in a U.S. city, and America is quick to blame the Russians.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3E4LW4bjRhEMDeeXeIsmkJ94v8K.jpg",
  "categories": {
    "plot": 5.2631578947368425,
    "acting": 5.2,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.333333333333333,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great movie heavily underrated. Very thrilling setup until the very last minute. I loved the movie and think critics are very wrong. The nuclear explosion was very frightening. I can highly recommend this movie!"
    },
    {
      "rating": "7",
      "text": "The Sum of All Fears is a pretty good, but not great, Jack Ryan flick. Ben Affleck plays a solid Ryan, and Morgan Freeman is amazing as always. It's worth a watch."
    },
    {
      "rating": "9",
      "text": "When I heard that a movie was being made based on another of Tom Clancy's Jack Ryan novels, I was thrilled. This one concerns a plot by a group of terrorists to plant a nuclear bomb in Baltimore the day of the Super Bowl. While the terrorists come from all different nations, the main threat is from Russia. Jack, well played by Ben Affleck knows this, he just has a hard time convincing anyone else, including the President, played to perfection by James Cromwell. Also of note here are performances by Morgan Freeman, Bridget Moynahan, and Ciaran Hinds as the Russian President. The direction, by Phil Alden Robinson, was simply incredible. There are two reasons that, as much as I would like to, I can't give this film a 10. First of all, there are times where the story becomes needlessly complicated. Second, Liev Schreiber, one of my favorite actors, was seriously underused. Other than these two complaints, I loved this film."
    },
    {
      "rating": "5",
      "text": "A mediocre movie. The acting is optimal. The dialogue is optimal. The plot is just good enough. The tension is about seeing other people figuring things out that the movie shows you from the start... You know more than the characters, and that's not super compelling.Mediocre."
    },
    {
      "rating": "4",
      "text": "accurately titled but unfortunately describes the experience of the audience..The Sum Of All Fears2 Out Of 5The Sum Of All Fears is a plot driven political thriller that explores the same old cold war topic between Russia and America with mundane procedure. Not only is the politics shallow but is deliberately simple in order to breed the sensibility amongst all the hoax which latter fails on levels in here. Addition to that, the stakes never communicates which is its primary con since the feature is fueled and relies upon it entirely. The writing is weak and benign with cheesy sequences that are installed to make it glorifying and instead comes off goofy and questionable. It is also disappointing considering the expectations it brought along with such an amazing cast and a success that the franchise had until now, it can be argued to be considered as the weakest link of it. The characters too aren't three dimensional like its predecessors and also lacks the little tactics that were used in physical sequences. The d.o.p. and cinematography is stunning with amazing visuals and beautiful camera work that makes it appetizing somewhat. The background score, sound effects and editing is on short that itches throughout the course of it. Speaking of which, the runtime too, is exhaustingly long with sloppy writing that is not at all gripping. Robinson; the director, needs better polishing on his execution skills since barely a sequence is shot with conviction in here. Affleck has decently handled such an iconic character with an amazing supporting cast like Freeman, Schreiber and Hall. An eerie perspective and stunning visuals are the only high point of this feature. The Sum Of All Fears is accurately titled but unfortunately describes the experience of the audience and the makers since none of the acts in here breathes craft for someone to explore in it."
    },
    {
      "rating": "5",
      "text": "The film begins with the death of a moderate Russian president and his replacement by a radical named Nemerov. To know who they are dealing with, the American Government recruits an academic who has just written an article about it. However, there seems to be a drop in the loyalty of Russian officials and there are personnel willing to provoke a nuclear war between both countries.The film is a regular thriller based on yet another imminent threat of war between the major world powers. The first part of the film prepares the events, while the rest is the unfolding and worsening of the military crisis, already in a climate of war. For me, the plot worked reasonably, taking some questions of logic and plausibility that seem to me very relevant (such as the fact that the military did not go in search of the nuclear bomb that the plane was carrying when it crashed, or the quiet walks that certain characters give the scenario where, hours before, a devastating nuclear bomb exploded).The cast is satisfactory to the level of this film: Morgan Freeman is competent, to see Richard Marner again was a pleasant surprise and James Cromwell did his part well. Ben Affleck, in turn, sounds a lot to himself and to dozens of other characters. There are few differences between this character and the one he offered us in \"Armageddon\".From the technical point of view, I emphasize the excellent cinematography and the good use of colors, but also the effects of contrast and dark light. There may have been, in part of the film, a change of lens for more diffused luminance when necessary. The special effects and sound effects are also very good, except for the scene where the bomb explodes, because it never seemed realistic enough to be believable.Overall, it's a medium movie, which is not terribly good or truly inedible. Nice to see, it's not the kind of movie that makes us think."
    },
    {
      "rating": "5",
      "text": "This movie reminded me of a season of the drama show 24 in some ways, with the bomb reaching US soil and due to other reasons which I can't really say or I'd give some of the story away. The main difference would be that this is not as action packed as 24, although there is some action in the movie its more of a thriller than an action movie per se. Its more of a dialogue based movie I think, you have to pay attention to keep up with story in terms of what the main character Jack finds out about the people behind the bombing, the history of the nuclear device and so on. It is also true to say that the pace of the movie increases as the story continues, so it is quite suspenseful and indeed the story 'hots up' as it becomes more clear whats going on and Jack sets out on his crusade to stop the cold war from starting.On a side note, I did chuckle a bit when I recognised Ken Jenkins who appears in this movie as Admiral Pollack, who is much better known as Dr. Bob Kelso,the cranky old doctor in the sitcom Scrubs - this is definitely a different character to portray.I have to say that I thought there was something a bit kind of unbelievable about this movie, about the story, what happens and the state of affairs afterwards (I'm trying not to give too much away) that I found a little hard to accept. However, it wasn't a really bad movie, certainly Ben Affleck and Morgan Freeman gave pretty good performances, I didn't notice anything particularly bad about the character portrayals, though it was perhaps a bit too predictable and slow to grab my attention, so overall I can only really personally rate this with a 3 star rating. I think that those who are interested in political thrillers will get more out of it and will enjoy it more than people looking for a movie full of action and special effects, though I can't help but feel that the story is flawed somehow but it is none the less an entertaining movie I feel and I think it would be a bit cruel to rate it any lower, so 5 out of 10 it is."
    },
    {
      "rating": "4",
      "text": "A cheesy action movie that falls pretty flat and isn't helped by the horribly miscast Affleck as Jack Ryan."
    }
  ]
}