{
  "id": 3117,
  "title": "The Nice Guys",
  "starring": [
    "Ryan Gosling",
    "Russell Crowe"
  ],
  "runtime": 116,
  "genre": [
    "Comedy",
    "Crime",
    "Action"
  ],
  "description": "A private eye investigates the apparent suicide of a fading porn star in 1970s Los Angeles and uncovers a conspiracy.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/clq4So9spa9cXk3MZy2iMdqkxP2.jpg",
  "categories": {
    "plot": 7.170731707317073,
    "acting": 7.852941176470588,
    "ending": 7.888888888888889,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 7.573529411764706,
    "action": 7.461538461538462
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Shane Black brought back the buddy cop comedy that is so far bygone years from now.The Nice Guys is a fun and a smart comedy film with irresistible leads that have a great chemistry and a setting perfectly recaptures good old 70's."
    },
    {
      "rating": "8",
      "text": "I quite enjoy the movie. It is funny. The story did not reveal itself in the early stage of the movie. It could be a good or bad thing that I feel like watching deadpool kind of humour from Ryan. Let's hope he can be a different type of actor next time."
    },
    {
      "rating": "8",
      "text": "This movie is an absolutely hilarious, thrilling action/detective comedy movie. Ryan Gosling and Russel Crowe are both amazing and hilarious in this comedy and mystery movie."
    },
    {
      "rating": "8",
      "text": "I was looking for a movie to fall asleep to after a long day. I ended up laughing out loud many times during the movie. Now I am wide awake and unable to fall asleep. 10/10 will watch this movie again!\r On a more serious note, I really like how they have used physical comedy and used the framing of shots to create funny scenes. It somewhat reminded me of the tropes Wes Anderson uses in his comedies although The Nice Guys is far less refined and subtle. Still, this movie has surprised me in a very positive manner!"
    },
    {
      "rating": "8",
      "text": "An unexpected and thoroughly entertained retro comedy!\r It all began from this year's Oscars, I saw this pair for the first time and I knew its their film promotion strategy. So I went to look for the full details and I thought I'll end up as another silly comedy like 'Daddy's Home'. That's why I did not bother to check it out its teaser and trailer, but now I feel terrible for my crappy judgement. Because this was an awesome movie, definitely not just in the comedy category, but overall one of the best films of the year and it should be in everybody's top ten or twenty and nothing less.\r It is a retro type film that takes place in the late 70s, LA. Where two private investigators unlikely come together to probe a mysteriously reappeared porn star from the dead as what her aunt says. But later that connects with another high profile missing girl case and so with all the leads, these two goes the length risking their lives to solve it. The remaining story reveals whether they succeed or end up as the losers.\r It was from the director of 'Iron Man 3' who wrote it keeping in mind as a television series, but later turned into this beautiful comedy. The first thing is I loved the Ryan and Russell's performances. They totally nailed it, especially Ryan Gosling in many comedy scenes. I think I laughed a lot and better after a long time. That's a surprise, you know, I did not think they can do comedies, but they're beyond all the praising words.\r It's not just two of them, there is a mini 'Nancy Drew Reporter' kind of character. A teen girl joins them in the investigation and her part as well had a great impact on the narration. You would think you can predict the story, but it is a well written screenplay with many twists. Everybody did their job so well, even the two hours did not look too long, but went very quick. The cast, crew, production, all must return for a sequel and I hope it will happen very soon. A must see film, but for the grown ups only.\r 8/10"
    },
    {
      "rating": "7",
      "text": "Enjoyable film that maybe you don´t expect. It reminded me of Kiss Kiss Ban Bang. Definitely that type of movie. I don´t care much about Russel Crow these days but Ryan Goslin carries the film pretty well. Overall, there´s story to follow and several very funny moments. Not many films like this these days. Recommendable."
    },
    {
      "rating": "9",
      "text": "The cinematography was beautiful, the soundtrack was good, the acting was great, the movie was funny and the story was interesting. The Nice Guys is without a doubt, one of 2016's best movie."
    },
    {
      "rating": "9",
      "text": "It's a shame this film didn't do better at the box office, I'm sure we would have gotten a sequel. If you love buddy cop style movies then this film should be right up your alley.Great chemistry between the two leads, good comedy and fun action. Ryan Gosling in particular excels in his comedic heavy role as the drunk PI, Holland March."
    },
    {
      "rating": "9",
      "text": "Pretty great movie by Shane Black, very stylish and visually compelling, the actors deliver some incredible performances and the plot is very original and refreshing. A cool and unexpectedly funny buddy cop movie that is worth watching."
    },
    {
      "rating": "10",
      "text": "My favorite buddy cop movie, The Nice Guys is incredible! Russell Crowe and Ryan Gosling have great chemistry and the dialogue is so great! This movie is hilarious and charming as hell, the action scenes are great and the story is interesting. There wasn't a single moment where I was bored, which is very rare. Shane Black is a hell of a director and I'd love to see him do a sequel to this."
    },
    {
      "rating": "9",
      "text": "Fantastic movie. Great chemistry between Gosling and Crowe. Hilarious dialogue and an interesting plot. And of course the fantastic villain John Boy. The way this movie finishes i can definitely see this movie turning into a franchise."
    },
    {
      "rating": "8",
      "text": "If you're a fan of the buddy cop genre, 70's nostalgia, or general hijinks, this is a film you will enjoy. The performances from Gosling, Rice and Crowe are exceptional, the storyline is throroughly entertaining (albeit ridiculous), and the script is expertly crafted, witty and hilarious. The costuming and design aesthetic evoke the heady opulence and garishness of the era perfectly, though if you've seen the trailer, some of the best moments are somewhat dulled by the expectation of the next comedic scene. I was somewhat disappointed by the lack of commentary on the objectification of the era, but in general this is a polished, enjoyable film, that doesn't take itself at all seriously. 8.02/10"
    },
    {
      "rating": "9",
      "text": "\"The Nice Guys\", An Inmediate Classic Comedy\r Irrefutably, \"The Nice Guys\" reigns compared to R-rated comedy films of this year (with the exception of \"Deadpool\"); with the personal obsessions of its director/scriptwriter, narrative intelligence and heart of those buddy comedies of the 80s, Black resumes the power in a suspense/action comedy movie rich in good performances and argumentative ability, in addition to a fascinating travel across time. Despite not having a vast repertoire of works, Shane Black established the odd couples of rough guys in the films, those which possessed a terrible relationship in daily life, but that in the violent and full of action sequences show their good hearts. After his latest project in 2005, \"Kiss Kiss Bang Bang\", Black writes - together with Anthony Bagarozzi - and directs what could become in the best of his career.\r The film would survive of independent way, without the need to its extreme action and violent scenes thanks to the incredible chemical of its leads, certainly, they are erected as an of the funniest duos in the film world. Black and Bagarozzi transport us back to the glorious 1980s, epoch where lechery, endless party and the psychedelic pornography were booming. Ryan Gosling plays Holland March, a dishonest and unprofessional private eye who immerses himself into an alcoholic whirlwind to forget the death of his wife while trying to educate and raise in a peculiar way his teenage daughter. On the other hand, Russell Crowe plays Jackson Healy, an unorthodox hired enforcer , he does not matter to work for the most indelible person in the world, provided that you collect a acceptable amount of money, he will work for you, complacently. Angourie Rice gets the same prominence than the main duo, she is Holly March, daughter of March and assistant of the couple of private detectives, unconsciously, a girl as charismatic as intelligent, who gains one place almost immediately in the frantic and demanding Hollywood by herself. The funny and hilarious trio will be challenged to solve four cases that ravage the City of Los Angeles: the death of a porn star, the disappearance of a young woman, a criminal conspiracy of high standards and the disappearance of a man from his funeral.\r The plot is a genuine and vile MacGuffin, a trick designed by the selfsame Alfred Hitchcock, who permeated each suspense work of his authorship with this clever strategy. The film borrows several references to the \"The Big Lebowski\" classic, considering that it employs each alleged main plot to take us to the true final storyline, some indecorous and dangerous car manufacturers utilize of camouflage the disappearance of a young girl and the death of the porn star to give one message of singular form; nonetheless, Gosling and Crowe involves us in the complex scheme as themselves.\r \"The Nice Guys\" is a perfect coordinate mechanism, it not is based only in the sequences of shootings, explosions and fights (which have recreated of lucid and entertaining way, perhaps, Marvel instilled in Black this ability after the success in \"Iron Man 3\"), the movie combines with dialogs full of jokes, powerful dialogs, clap-worthy dialogs, besides certain nostalgia by the films of the 80s. Although the film did not expect such reception at the box office, was not created for this objective, it is a movie with fundaments and totally faithful to the old buddy movies, is not a commercial product, although it seems like, it is a project that deserves the name of \"film\", in capital letters.\r Shane Black earns good marks in a genre that is quickly becoming in monotonous and without surprises. An intricate plot, an extravagant atmosphere, a explosive soundtrack and an ingenious chemical of its leading actors are complemented by a absorbent pace and a nostalgic tone eighties. If you like to enjoy of one action movie, watch \"The Nice Guys\", if you like to enjoy of one comedy movie, watch \"The Nice Guys\", if you like to rekindle the 80s, watch \"The Nice Guys\", if you want to experience the best film of comedy of the year, watch \"The Nice Guys\"."
    },
    {
      "rating": "7",
      "text": "Shane Black directs what is, in effect, a rephrasing of his earlier film 'Kiss, Kiss, Bang, Bang'Russell Crowe and Ryan Gosling star as two mis-matched guys with a de rigeur 'dark past' who become embroiled in a search for the daughter of the head of the Department of Justice, and her involvement in a porn film which has caused everyone else involved in it to wind up dead.Set in the hedonistic days of 1977, in an eternally Sunny Los Angeles, the film moves along at a reasonable pace, and the set pieces all work well in giving the audience enough information to understand, but not feeling the need to force huge amounts of exposition so as to spell it all out.Crowe and Gosling have undeniable chemistry, the script is tight, and the young Angourie Rice steals every scene she's in as Gosling's 13 year old daughter.Throw in a fantastic pseudo 70's musical score, and enough disco/funk hits to create a very listenable to on its own soundtrack, and you've got an excellent adult-themed, buddy comedy movie.So, what's not so good? Well, the movie does dispense with a lot of the 'nastier' elements of the world of Los Angeles at that time. With scenes at what are effectively sex parties, there's some nudity, but no actual sex going on, nor are there any piles of cocaine being snorted! Add to that a very sterile environment (something that bugs me in pretty much any film set in the past), where every car is pristine and beautifully clean and waxed, everyone is coiffured and immaculately turned out.So, worth watching? Definitely! Just take it as what it is, a fun, profane movie with a twist here and there and a hint that there might be a sequel just before the end credits roll."
    },
    {
      "rating": "8",
      "text": "We never thought we needed Russell Crowe and Ryan Gosling in a movie together and what a beautiful pair they make, they’re practically oozing chemistry. It’s fast paced, off beat, funny and passed the six laugh test with flying colours. What more can I say to get you to see this? Pure entertainment and definitely recommended."
    },
    {
      "rating": "7",
      "text": "A mystery/comedy, we see two \"not so great\" detectives bumble around trying to find a missing niece, someone's daughter, and finding a lot of dead people.  It was actually better than it sounds.  Or maybe it's because I was in my 20's in the 70's and this was pretty close to real life back in the Stoned Age."
    },
    {
      "rating": "10",
      "text": "Awesome movie!! This is the kind of movie that you can watch at any moment and with almost anyone (leave those extreme politically correct friends out of this party, just because of one or two jokes that are in there). I loved every single aspect of this movie! It is extremely funny, involving, well-crafted, and has good replay value! Oh, and forget La la land, this is Gosling's best performance!"
    },
    {
      "rating": "7",
      "text": "-The Nice Guys is an American mystery comedy film directed by Shane Black and written by Black and Anthony Bagarozzi. It stars Russell Crowe, Ryan Gosling, Angourie Rice, Matt Bomer, Margaret Qualley, Keith David and Kim Basinger. The film will premiere on May 15, 2016 at the 2016 Cannes Film Festival before being released in the United States on May 20, 2016 by Warner Bros. Pictures.\r --Critical response:\r -On Rotten Tomatoes the film has a rating of 90%, based on 10 reviews, with an average rating of 8.3/10. On Metacritic the film has a score of 73 out of 100, based on 9 critics, indicating \"generally favorable reviews\".\rMike Ryan of Uproxx gave the film a positive review, praising Black's writing, saying: \"If you like Shane Black, you will like The Nice Guys. It’s probably the Shane Black-est of all the Shane Black movies. Black has a knack for turning action movie expectations on their head mixed with knowing and rich dialogue.\" IGN gave the film a 9/10, writing, \"Working from a tight and sharp script that perfectly balances the characters like a yin and yang of screw-ups ensures The Nice Guys is an absolute joy every step of the way.\"\r -Pleasant film with comic situations of two private detectives who should work together on a case, set in Los Angeles in the 1970s."
    },
    {
      "rating": "7",
      "text": "\"The Nice Guys had a similar tone to what I was looking for in \"Keanu\". It has a premise that appears serious but the protagonists are more invested in their personal stories than in the grand conspiracy. Russel Crowe is back and his performance marks a nice return from the esteemed Australian star.  His interactions with Ryan Gosling. They are similar in the fact they have a troubled past and try to live up to their job as police officers but they are troubled. The main difference between the two is that Crowe is an activist and Gosling is more of a fatalist. The main difference in how they approach the situation makes an entertaining watch. The interaction between the two give rise to some comedic antiques with Russel Crowe acting as a comic foil with his high brow masculinity being countered by Ryan Gosling's outlandish personality.  Gosling's daughter in the film could have been a burden but she was written in a way that makes her a huge contribute to the story. In fact she helps out Ryan Gosling more than Russel Crowe does in certain cases. It is clear that she loves her father but she doesn't want him to waste his life being a alcoholic as well. She also has a touching relationship with Russel Crowe. The only problem with said relationship is that there was a subplot of Gosling's daughter not wanting Corwe t kill which felt a little out of place considering that her father had shot a few gangsters in the film prior to that. Some might take issue with the representation of grown women in this film. It does match the setting of the 1970s but there are a few instances when it could feel uncomfortable like how the intro kills off a porn star right after sexualising her. The story line also has a lack of focus but to the films credit it knows that the highlight is the interactions with the characters so it doesn't try to develop it as much. I also give the film some credit for killing off the woman that they were trying to protect which is something that most buddy-cop movies usually wouldn't do. Even when they expose her mother for plotting the assassination she still gets away Scott free. That is something that is usually not done in these kind of comedies and I respect the director's decision to include this in the film. The film does fall under cop comedy cliches from time to time and the story is not as well structured as it could have been but it is a fun ride for anyone who wishes to see this film. You will be entertained in this wild ride."
    },
    {
      "rating": "7",
      "text": "The Nice Guys brought back nostalgia to the buddy cop genre that has been eradicated from our existence. Films such as \"Lethal Weapon\", \"The Last Boy Scout\" and \"Kiss Kiss Bang Bang\" all have that same vibe of being humurous but inteligent at the same time. The Nice Guys has that vibe too. The plot was very tortuos to the film where there was whole bunch of twists and turns during it's three acts of fine glory. Shane Black managed to use them in a way where the audience is invested in the situation and wanting to know what will unfold in the next gripping scene as they unexpectedly appear. In addition, the chemistry between Ryan Gosling and Russell Crowe was phenomenal. They provided us with a combination of sarcasm and witticisms that had me uncontrollably laughing. This is probably Shane Black's best film that he's ever made and that's a definite fact.\r Rating: 7/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "7",
      "text": "Nice and funny. Nothing more to write about it. Worth to see it.\rIt's that king of movie that in about 4 yeas will be aired on TV on and on, but it's entertaining in a way that it supposed to be."
    },
    {
      "rating": "7",
      "text": "What makes this film work is the chemistry between Crowe and Gosling. Even considering the less-than-original concept and rather anti-climactic finale, the humor and fresh spin on and old idea make up for lost ground."
    },
    {
      "rating": "9",
      "text": "One of the best comedy, the best buddy movie, more Shane, please more, I want see the next"
    },
    {
      "rating": "9",
      "text": "This film is easily one of the my favourites of the year. The chemistry between Crowe and Gossling is some of the strongest I've seen on film, however who really steals the show is newcomer Angourie Rice."
    },
    {
      "rating": "9",
      "text": "The Nice Guys is a brilliant film brought forth by director Shane Black that features a charismatic, well-matched duo in Ryan Gosling and Russell Crowe. Hysterical from beginning to end, The Nice Guys is not simply hollow laughs, but matches it comedic instincts with a well-constructed plot that keeps you consistently engaged and not just hanging on waiting for the next joke. Well paced and well-crafted, The Nice Guys has incredibly multi-dimensional characters and the film as a whole really pays homage to a bygone era, especially in Los Angeles. I am an absolute sucker for these neo-noir films set in Los Angeles, especially ones with fantastic cinematography and The Nice Guys most certainly fits the bill. Undoubtedly set to go down as one of the funniest films of 2016, The Nice Guys is not just some brain dead comedy. Rather, it makes you think and has a true emotional core that really threatens to start up the waterworks. Overall, The Nice Guys is an absolute winner."
    },
    {
      "rating": "7",
      "text": "Shane Black walked on water with his 2005 comedy caper \"Kiss Kiss Bang Bang\" and died for our sins with some unfortunate fanboy backlash caused by his 2013 MCU installment \"Iron Man 3.\" Now, does this third film allow him to rise from the grave and into the heavens of filmic redemption? Just about. Thanks in no small part to some rocking chemistry between Crowe and Gosling, \"The Nice Guys\" prevails in its efforts to spin a satisfying mystery, whilst delivering some incredibly memorable laughs along the way."
    },
    {
      "rating": "8",
      "text": "\"Look on the bright side, nobody got hurt.\"\r Breaking through the door of the already crowded room that is that of police dramas, The Nice Guys brings an innovative mix of comedy,  tension and sheer absurdity.\r Director Shane Black's last work stands out for it's brilliant dialogues, surreal recourse to slapstick humor and general depiction of death, and a new way of representing the development of relationships between characters, breaking the bilateral paradigm that we have seen maybe one too many times in recent cinematic history: on one side we have the corny mix of an effective character that always gets the job done and an inept, unpractical character that seems more like a hassle than an actual aid, but who in the end discovers his potential and fundamentally helps in solving the main problem; on the other side, we have a team of equally able individuals who all use their traits in an overly serious way, only to end up meeting their match in the antagonist and having to step up their game. The Nice Guys, on the other hand, depicts a situation in which all of the characters, in the solving of the dilemma, end up living with their ups and downs, never ending in a pathetic internal debate that would stop the movie dead in it's tracks. They always move on and never try and change their way of action, and they make the best, or the least worst, out of it. This makes the characters keep themselves, and keep focus on the actual task at hand, even in the moments in which the film gives some more details on the lives of our to unconventional heroes.\r This, along with the constant undertone of ridiculousness, expressed by the over-the-top references to sex (and more specifically to pornography, which plays a fundamental role in the plot), the constant, seemingly random deaths and acts of violence, scattered throughout the movie at any possible chance, makes \"The Nice Guys\" a brilliant addition to the list of \"best films of 2016\"."
    },
    {
      "rating": "8",
      "text": "Who knew the chemistry between Russell Crowe and Ryan Gosling would be so good? The movie takes place in the late 70's' and they did a brilliant with music, clothes, cars, and Los Angeles of that era.  I liked the movie so much, walking out of the theatre I hoped the sequel would not be too many years away."
    },
    {
      "rating": "10",
      "text": "Shane Black's \"The Nice Guys\" is certainly one of the best movies of this year. It is hilarious, unpredictable, well-acted, perfectly directed, well-shot, and endlessly human."
    },
    {
      "rating": "8",
      "text": "A worthy followup to Kiss Kiss Bang Bang, if not as tightly put together. The writing and editing can falter here and there, but the actors make up for it. Crowe and Gosling make a great pair in their own buddy flick, with their banter feeling more natural than most. The highlight of the film is definitely Gosling's charged physical performance, showing comedic depths you may have never known he had. All in all a good time at the movies."
    },
    {
      "rating": "9",
      "text": "Shane Black, the director of the underrated movie called kiss kiss bang bang and also the disappointing but a fun movie called Iron man 3 comes his new film The nice guys.\r And really This a fun movie to sum up my over-all experience.The cast is fantastic especially the two main characters played by amazing actors,Russel Crowe and Ran Gossling who are top of their game.Both of them have great chemistry in the film and this is where the movie exceeds,they're natural to team up cause they work together perfectly.It's fresh to see a great buddy cop comedy flick with refreshing and clever script.I won't say it's original,I might say this movie is refreshing to see another buddy cop film which makes you laugh hard.The story is compelling,the editing is good not great.The action is spot-on and the setting is perfectly realize.The other characters are good especially the daughter,she isn't annoying but she is amazing. Out of all movies that uses CGI in the past months,this film brings you a time where everything is practical and  the world of the 70s.The Nice Guys is a great film to watch this weekends."
    },
    {
      "rating": "9",
      "text": "Offbeat, hilarious and original, The Nice Guys is a refreshing take on the buddy cop genre with pitch perfect writing from Shane Black and unexpectedly great comedic performances from Russell Crowe and Ryan Gosling."
    },
    {
      "rating": "7",
      "text": "Just t the point the film really lacks an emotional punch. Its a great film, the comedy is hilarious, the acting is sensational and the characters have so much character and chemistry. But the third act really needed more of a punch, more stakes or something."
    },
    {
      "rating": "8",
      "text": "An hillarious movie filled with adult and childish humor a like, featuring the noob and the pro, just couldn´t stop laughting............................"
    },
    {
      "rating": "10",
      "text": "Hilarious!!! Ryan & Russel make a great comic duo!  Brilliant film from Shane Black...well-constructed plot  ...consistently keeps you engaged and great comedy timing! :-)"
    },
    {
      "rating": "10",
      "text": "God man Golsing did it again! This guy is such a calculated actor, you can tell in the tiniest nuances he does in so many scenes, he's so detailed and his brilliant choices are definitely intential. Crowe performance is strong and his comedic timing is great! In fact the entire cast is so strong, hats off to Angourie Rice for stealing the show and boxing with these big name actors in scenes. I saw the movie tonight in Hollywood California, and I drive a car from the 70's. Needless to say I definitely peeled out in the parking lot on the way out! Go see this film!"
    },
    {
      "rating": "7",
      "text": "The Nice Guys is a solidly entertaining film that is hilarious, engaging, and just entertaining. Ryan Gosling is great in this film, while I do feel like Russell Crowe's performance could have been totally interchangeable with many other actors, like John Goodman. Their chemistry was okay too, but could've been better. Finally, one of the messages in the film is 100% forced and hammered in near the end. However, the plot was rock solid, the comedy was pretty damn funny, and the side characters were great too. Overall, not a bad bet for a summer comedy/action flick."
    },
    {
      "rating": "9",
      "text": "This movie has a great comedic story and the characters fit in perfectly. The visuals and the soundtrack have the atmosphere of the late 70s and the beginning of the 80s. However the soundtrack could have been more."
    },
    {
      "rating": "8",
      "text": "The Nice Guys, well this is a film I really can recommend.  It may lose itself in the 3rd act, but this was a really fun, funny movie and it’s made even better by Ryan Gosling, who I am convinced at to this point can do no wrong, and Russel Crowe who also gives a fantastic performance and their chemistry is fantastic.  The film oozes in the 70s and Shane Black who writes and directs the film does an excellent job.  It’s everything you would expect of a comedy written by the writer of Lethal Weapon and the director or Iron Man 3."
    },
    {
      "rating": "8",
      "text": "As someone who hasn't seen 70' s action films, I gotta say that I really enjoyed this one. Not only does the 2 main characters make a great bromance relationship, but also the rest is very likable and enjoyable. Cool action, funny humor, and a good and engaging old-fashioned buddy cop story."
    },
    {
      "rating": "2",
      "text": "Meandering, ridiculous, and lame humor...  The characters played by Russel Crow and Ryan Gosling were entertaining and had potential, however, the dialogue and plot were poorly written.  The plot had so many turns, added characters, and superfluous details that it was incoherent and dull.\r The humor was sophomoric at best, but included children being exposed to porn and talk of sex and genitalia -- a pathetic and feeble attempt at comedy (it's scary and sad that people think this is funny -- CRIMINAL BEHAVIOR THAT PEOPLE GO TO JAIL FOR).  We sat through this movie as the plot wandered around, going nowhere, with senseless killing and violence, hoping time and time again that it would end.  However, it went on and on.  Finally, we got bored and walked out, after wasting 80 or so minutes and about $30.00...  Skip it...  It's an unfunny, violent, lousy version of a Three Stooges movie -- but nowhere near as entertaining and funny.  I'll sum it up with one word: CRAP.\r Go see KEANAU -- MUCH better and funnier."
    },
    {
      "rating": "8",
      "text": "The period piece \"The Nice Guys\" is a smart and entertaining buddy cop comedy that is bolstered by brilliant performances from Ryan Gosling and Russell Crowe as well as assured direction by Shane Black."
    },
    {
      "rating": "2",
      "text": "So disappointing.  I'm a big Ryan Gosling fan, and thought I could watch him in anything; but this movie was poorly written and it failed to engage me on both plot and characters.  I can't understand the glowing reviews.  Almost walked out ..."
    },
    {
      "rating": "2",
      "text": "Why the **** this movie has 90% on Rotten tomatoes? Its stupid, the action has no substance, the comedy is really lame and bland and it's another of those comedies action that you see the poster but nobody sees anyway.\rAnd they called Angry Birds violent..."
    },
    {
      "rating": "2",
      "text": "The comic teaming of these stars was promising, and they do make a good team.  Too bad it's utterly wasted in this overly convoluted, highly formulaic, bloated, not very funny but crass movie!  All you need of this junk is to watch the free trailer which has the funniest bits.  The couple funny scenes are also out there for publicity.  Sitting through the actual feature is an excruciating bore.\rIt doesn't help that it's full of annoying period flaws.  Set in 1977, and at least 2 big songs featured weren't even released until 1-2 years later, \"Jaws 2\" came out in June 1978 (highly doubtful that billboard poster was even created at least 7 months earlier much less already advertising on the Sunset Strip), the Camaro is from 1979 or later, Tim Allen hadn't even started his stand-up career yet, platter projection systems were doubtfully in use at the time much less even invented yet?, and certain vulgar phraseology spoken was not part of the lexicon yet.\rThe point is for an expensive major film (any film for that matter, because omission works wonders), it's a disgrace the director is so sloppily incompetent not to get this kind of stuff right no matter how unimportant the people who made this think such detail is, certainly when all those very specific choices have hundreds of other options which would cost no more to have gone with!  Maybe if the script didn't suck so bad such anachronistic slop would be more forgivable?  No, not even then it isn't."
    },
    {
      "rating": "8",
      "text": "Shane Black delivers with this uproarious action comedy in the same vein as one of his previous films Kiss Kiss Bang Bang! Russell Crowe and Ryan Gosling made for one great on-screen pair and kept the film lively, fun, and just plain energetic from start to finish! Despite being a little all over the place at times, the film was also quick-witted and never had a dull moment! Overall, this is definitely a fun and also very funny film worth checking out!"
    },
    {
      "rating": "4",
      "text": "I understand there are some guidelines for specific genres.If you are going to see a thriller-slash-comedy, do not expect too much logic, common sense, etc.\rEnjoy the bang, vulgar language and some humor. I would expect just that in a movie with (or from) people like Jonah Hill and would stay home, because it does not cut it for me.\rLow humor quality, lousy acting, silly script, all that. But when a movie stars Ryan Gosling and Russell Crowe, one should expect (at list I did) a better quality.\rAnd indeed, in the beginning the movie was quite entertaining. But not for long. Decent acting from both leads and a few funny episodes did not save this almost 2-hour silly movie.\rSuch a waste of talents."
    },
    {
      "rating": "0",
      "text": "Nice Guys is without a doubt one of the worst movies I have ever seen. Horribly written and badly acted by every person who had a line in the film.   Russel Crowe and Ryan Gosling should be ashamed of themselves. I can only hope that the reason they accepted parts in this hideous film is that both of them have balloon mortgages coming due soon."
    },
    {
      "rating": "1",
      "text": "I like a good cop buddy movie as much as the next guy, but this was one of the worst movies I've seen in years, and the most that Metacritic has let me down since \"Gravity\".  There were occasional funny lines, but those didn't compensate for the terrible choppy adolescent-level script, Russell Crowe's wooden acting, Ryan Gosling's awful Lou Costello impersonation, the third or fourth Ryan Gosling girl scream, Kim Basinger's TV-movie character, ridiculous misses by point blank machine gun fire, lame attempts at plot twists, creepy scenes in which kids were repeatedly inserted into situations that were way too adult for comfort (didn't think a 12 year old boy boasting about his penis was hilarious, and what's with the other kid who wasn't even mildly surprised to find a dead body in his back yard?), and an anticlimactic unsatisfying ending.   I was looking at my watch through the last 2/3 of the movie, and would have left if I wasn't with a big family group.  At one point I turned to my wife and said \"make it stop!.\""
    },
    {
      "rating": "10",
      "text": "A ridiculously hilarious comedy film. The Nice Guys step up their game into entertainment and bring laughter to their audience. I was enjoying this film from start to finish and to me, this is the best comedy duo that I have seen in years. It's so nice to see a movie like this. Shane Black, you sir deserve my respect for bringing a great film. And I will admit, this is one of my favorites by far."
    }
  ]
}