{
  "id": 1324,
  "title": "The Chronicles of Narnia: The Voyage of the Dawn Treader",
  "starring": [
    "Ben Barnes",
    "Skandar Keynes"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "This time around Edmund and Lucy Pevensie, along with their pesky cousin Eustace Scrubb find themselves swallowed into a painting and on to a fantastic Narnian ship headed for the very edges of the world.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z6LVJXEmY8E6s57uf8cV3RlWvws.jpg",
  "categories": {
    "plot": 5.775,
    "acting": 5.666666666666667,
    "ending": 6.375,
    "soundtrack": 5.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 7.363636363636363,
    "funny": 7.666666666666667,
    "action": 5.909090909090909
  },
  "reviews": [
    {
      "rating": "9",
      "text": "its not the best in the series but its still very good. all 3 have there strong points The Dawn Treader is rich with magic, it has more magic in it then the 1st two combined, the 3D is nice but it dulls the color but it is still worth the money but the movie will be the same if you watch it in 2D."
    },
    {
      "rating": "8",
      "text": "This was a good movie, perhaps not my favorite of the series but still worth seeing. there is a good story and plenty of action. i also like that in each movie they lose a few characters but add a couple more."
    },
    {
      "rating": "0",
      "text": "The **** of the year, the Narnia's series it's only getting worse, this movie don't have dynamic, it's only talk, talk, talk... In other words, boring. If you don't watch yet, don't go watch, it's a waste of time and money...."
    },
    {
      "rating": "6",
      "text": "It had a great storyline, which was adapted by the captivating novel of C.S Lewis. However after watching both the first 2 movies of this series, I felt that this one lacked in the thrill that you should get from Narnia. I guess my expectations were demanding to the movie. However, what I also liked about the first 2 movies were that there were battles and both Peter and Susan were involved. Their characteristics made the first 2 movies a great success. Their lack of appearance in this film let down the aura of friendship of sibling rivalry. The effects were good yet  felt that the trailer was even better than the movie. All in all it was a good movie. 6/10"
    },
    {
      "rating": "5",
      "text": "I'm quite the fan of the fantasy genre but unfortunately that didn't much help the fact that this was a boring film and I was really disappointed in this third part of the trilogy. As others have remarked upon, I agree, that the Narnia films tends to cater to a younger public than for example the Harry Potter series - and with my thirty one years I guess I'm not even supposed to be a great fan.. Anyways I'd say that it's an OK film for the younger audience and it won't kill parents to see it. The first film was good (largely thanks to Tilda Swinton's performance) and the second one really bad so by comparison the third is quite watchable - the style of acting is very theatrical, the sets often looks cheap and I never could get past how sleep inducing Liam Neeson is in his portrayal of Aslan but I guess that's all of the negative I have to say.. Watchable if you absolutely must but boring..."
    },
    {
      "rating": "3",
      "text": "Dazzling visuals and some solid performances don't help this campy, not-so-fantastical,boring, fantasy. It has bloated action and dialogue, along with choppy editing and pace. The worst installment yet. I give this movie 28%."
    },
    {
      "rating": "10",
      "text": "one of the best movies ive read don't waste your money on 3D not much of 3d just commercials but it was a very good movie go wach it. it is very intresting.love it"
    },
    {
      "rating": "2",
      "text": "I really wanted this to be good. Perhaps my expectations were too high but, my first reaction when the end credits began to roll was... \"Wouldn't it be great if someone would make a high budget film loosely based on the Dawn Treader?\"   We've read the books many times over. Therein lies the problem. I realize the need to adapt a story for the big screen but they should be ashamed of themselves. Whatever happened to the art of story telling? It struck me as a dumbed down action flick for kids."
    },
    {
      "rating": "10",
      "text": "Well, we saw it, and 10 out of 10! Acting, action, digital effects, the score were all amazing. We think it is also great that this movie decided to put in some morality since most kids movies now are pretty much just for a good laugh with nothing that actually sticks to you. This movie brings you into a reality of letting go and how to deal with things. It also states it's not always best to go with what you want and feel you need to have, because it might actually not be the best for you. There's nothing wrong with encouragement towards kids and we feel this movie had nothing but the best intentions."
    },
    {
      "rating": "10",
      "text": "There's a lot of things that make this film my favorite in the Narnia series:1. Peter and Susan are gone (I didn't really like them) which makes Lucy and Edmund more important and more developed.2. There quest isn't to battle people, but it is to find 7 lost lords and their magicals swords.3. The characters are amazing. Lucy and Edmund are now older, Caspian is back, Eustace and more are introduced, and Reepicheep is more developed.4. Eustace turning into a dragon that then helped the others on their quest was amazing and his personality was positively changed. He became a better person and was a kid again.5. I love this story because it's unique and more fun in my opinion."
    },
    {
      "rating": "3",
      "text": "David Byrne, back in his \"More Songs about Buildings and Food\" days with the Talking Heads, once remarked that \"heaven [was] a place where nothing ever happen[ed],\" hardly the sort of place for a swashbuckling rat like Reepicheep(voiced by Eddie Izzard), who seeks action and is absolutely fearless in any given situation. Assuming that he gets there. Prince Caspian(Ben Barnes) won't go; he politely declines Aslan's invitation to his kingdom, choosing instead to continue his reign over Narnia for the time being, while the wall of tidal water, fluid but frozen in time and space, beckons anybody who wishes to cross over. The rat, on the other hand, presumed to be much older than his human compatriot in arms, accepts the lion's officer, with the understanding that he just punched himself a one-way ticket. After Reepicheep bids everybody a fond farewell, the loyal Narnian subject lays down his earthly possessions on the sand, and scampers toward the shoreline, where the rat disappears into the blue, similar to the way the sixties activist/writer(played by James Earl Jones) in Phil Alden Robinson's \"Field of Dreams\" vanishes amid the green Iowa corn, with the difference being that Terrence Mann's trip was a round one. Prior to the reclusive author's departure, the 1989 film starring Kevin Costner(based on the novel \"Shoeless Joe\" by W.P. Kinsella) suggests the un-Christian notion of heaven being a place on earth, when the farmer and his father discuss dreams and geography(suggestive of baseball as being a religion to itself), just before they toss around the baseball(practicing their religion), whereas \"The Chronicles of Narnia\" books by C.S. Lewis were loaded with Christian teachings that survived the film adaptations, leading the moviegoer to interpret the rat's destination as being heaven, since the mighty lion(voiced by Liam Neeson) is a blatant Christ figure. Aslan alone can rise up from the dead, the only one who can leave Narnia and return as he pleases, because the lion is all-powerful; he's God, after all, while Caspian can't claim to be nothing more than a mere mortal, but the omnipotent one tempts the prince into willfully abdicating his throne and the remainder of his natural life. For his own sake, the royal stands his ground, explaining to Aslan that his father would have wanted him to remain among the Narnians, the denizens he was entrusted with by decree to protect. The moviegoer, however, suspects that the prince also wants to live long enough to \"catch\"(wink wink nudge nudge) the falling star from the \"Island of the Star\" on their way back home. Reepicheep, conversely, by his own admission, has seen it all and is all out of fight(and perhaps, all out of love, too, save for one last hug with Lucy), so \"dying\"(for what else could it be?) becomes easy for the rat, whose derring-do, upon closer examination, was a symptom of his death wish. As the wind and waves thrashes the Dawn Treader this way and that way during a fierce storm, en route to Dark Island, the rat can be glimpsed flitting around up high on the main yard near the top mast, where one false move could have sent the tiny soldier plummeting to the deck, or worse, the turbulent, churning waters they're navigating. Even the horseplay, a practice sword fight, that he participates in with his sparring partner Eustace(Will Poulter), after further review, seems less innocent as it first appeared. This boy, Lucy and Edmund Pevensie's cousin, was swinging his blade at the rat pretty hard. The rat could have easily been the victim of beginner's luck. When Reepicheep jumps into the ocean after the lad, by then, transformed into a dragon, it's with that same dauntless recklessness. Finally, at the beach, the rat reveals his secret desire, as he steps into liquid and, presumably, into the realm of heaven, but doesn't self-murder occasion a trip to the other place? \"The Chronicles of Narnia: The Voyage of the Dawn Treader\" is more bunk about realms and food for ecclesiastical thought. The film sorely misses Susan."
    },
    {
      "rating": "5",
      "text": "Some people call the Narnia films the \"poor man's Harry Potter\", but I think they are missing the point.  The Narnia films seem geared more towards young children while Potter is more sophisticated and appealing to adults as well.  I'm not a fan of the Narnia films but I have seen all three.  This one is my favorite of the three because of the fantastic special effects.  The acting is still wooden, the dialogue unnatural, the characters bland, but I wouldn't be surprised if this film wins for special effects come Oscar time.  Although I'm not a huge fan of 3D, they did a good job with the technology.  The one bright spot with the acting was the kid that played Eustace - he was a hoot and actually had PERSONALITY.  Something sorely missing from the other characters."
    },
    {
      "rating": "5",
      "text": "Just as C.S. Lewis' books dropped in popularity after \"The Lion, the Witch and the Wardrobe\", I believe the film adaptations might be doing the same. Granted I enjoyed \"Prince Caspian\" way more than I enjoyed \"The Lion and the Witch\" (probably because there was a huge battle at the end), but I think Fox made a mistake when it changed directors from \"Prince Caspian\" to \"Dawn Treader\". I don't know why Fox switched directors, but I do know that I would have much rather seen Andrew Adamson's (Shrek 1 & 2) version of \"Dawn Treader\" than seeing the one I saw directed by Michael Apted (\"The World is not Enough\"). Read full review at FlicksWorthWatching.com"
    },
    {
      "rating": "0",
      "text": "This was by far the worst movie out of all 3 of them!!! I cant even begin to express how disgusted I am in this one!! I understand the movies cant be exactly the same the story, but come on.... the 3rd one was sooooo way off!!!! I have read and reread the ENTIRE book at least 5 times. Every story was awesome, just brilliantly amazing!!! They could have at least kept to the storyline. I feel bad for people who liked the movie, that just means they didnt read the book and if they did, well then SHAME on them for thinking the movie was good!!! If you have read the book and have not seen the movie I BEG you to please DO NOT watch it!! If you are a true Narnian fan as much as I am, you will regret WASTING your money on such a horrible, awful, useless movie that will leave you saying OMG thats not how it happened and/or OMG why did they change the story line was perfect they should have left it the way it was!!! Even in the second one if you are true Narnian you know half the stuff was not even remotely close to how it happened in the book. so you know I am NOT LYING when I say the 3rd was awful just awful, but hey watch it for yourself and then come back and tell me I am wrong, but I know you true fans wont!!!"
    },
    {
      "rating": "6",
      "text": "The movie is good, but, the biggest problem is that the Narnia that all meet, die, an in a terrible mode. The magic creatures don't appear, be much humans, and this magic stories, don't appear."
    },
    {
      "rating": "8",
      "text": "Growing up in the Canada in the 70's and 80's, I fondly recall vastly enjoying an animated version of Lewis' 'The Lion, the Witch and the Wardrobe' that was presented by Kraft on CTV. Now as a father of a son, I want to see with him the contemporary versions of the books I adored in my youth, though at present I greatly prefer the craftsmanship of cinema pre-1970.\r It never bothers me in the slightest, to the ire of my more obsessive-compulsive cinephilic friends, seeing films of series with complete disregard to their order (one of my friends nearly had a heart attack, when he discovered I had watched 'Spider-Man 3' without having previously watched films 1 and 2--don't even get me started about the 'Harry Potter' series...), so, especially curious about how one of my favourite contemporary directors, Michael Apted, would do in the realm of big-budget, CGI-intensive fantasy filmmaking (I expected a fish-out-of-water, like Lord Richard Attenborough helming 'A Chorus Line'), I gave this a shot.\r I enjoyed this more than 'Harry Potter' films I have seen, though it does stretch things from the literary works, but unfortunately, that seems to be the way things are, since film became less about artistry and more about business (just see at Toys R Us how many possible toys you can purchase, and similar commercial off-shoots, and I don't even consider this series a major player in this sort of area, because of its Christian undertones, which really doesn't mesh perfectly with selling tons of toys, though of course the realms aren't mutually exclusive, not by any stretch of the imagination). I think that Apted did a decent job, especially considering that yes, he is a fine director, but this isn't really his cup of tea. I distinctly feel that if these films are your comfort food, you won't be disappointed. I look forward to checking out the series' two preceding entries, and, though they left an opportunity for more films, which I believe wouldn't be from Lewis' works at all, it was a nice summation at its conclusion.\r Finally, it was great to see (or at the very least, hear) Tilda Swinton, Liam Neeson and Simon Pegg, they seem to be thrown in everything these days. I heartily salute their agents--they must have the very best in the business."
    },
    {
      "rating": "5",
      "text": "Ultimately the weakest Chronicles you'll ever see. Are you sure there's some sort of good part in this movie? I'm sure there isn't one at all. Narnia's Chronicles are all over for now."
    },
    {
      "rating": "5",
      "text": "Very By The NumbersDawn Treader feels very bland and boring at times, Something I shouldn’t be saying about a Narnia movie."
    },
    {
      "rating": "8",
      "text": "Though Voyage of the Dawn Treader is possibly my favorite book in the series, it is not so with the movies. It adds story-lines that don't belong- as if the book weren't good enough. However I am willing to forgive that, because as a whole it had a lot that should be celebrated. LWW still remains as the best, but this one is better than PC. A terrific movie for the family."
    },
    {
      "rating": "6",
      "text": "good screenplay. eye popping visual effects. captivating cinematography mars the weak narrative and bad editing of the movie. it is a typical narnia movie made without soul and life. a story that seems complex enough is not really complex. a complex tale ends as a simple snake battle. the story of seven swords is good to hear and audience expect a real thrill ride in second half. but it becomes cheaper and looks B grade kind of movie in the end. lack of strong narrative and weakness in editing makes this edition as a fragile one. it is though appreciable for visual effects and cinematography. in the end narnia : voyage of dawn treader is a movie of high expectations but ends up as a regular one."
    },
    {
      "rating": "10",
      "text": "While I personally like the Prince Caspian movie, it didn't really feel as memorable as watching The Lion, The Witch, and The Wardrobe back in 2005. With this new Narnia movie however, I really felt as satisfied as I was when I watched the first one."
    },
    {
      "rating": "4",
      "text": "Fans most likely would enjoy this and going to this would kind of only be worth it to them, but with a story that is flat and does a complete circle with a sense of urgency, \"Dawn Voyager\" is either really boring or is overall alright for people that either havenâ"
    },
    {
      "rating": "10",
      "text": "the previous two installments were amazing, and I think that this third installment is also amazing. There's a Place for Us in this beautiful and yet action packed Narnia movie."
    },
    {
      "rating": "4",
      "text": "This movie was very mediocre. Most of the characters are very one-dimensional and bland. Eustace was the only character that was drawn-out well and turned out to be multi-faceted as we see his transformation in the end. The visual FX were very cheesy for the most part but I've heard this movie had a smaller budget than the previous two which were produced by Disney. Still, this movie looked and felt like a loosely-filmed and low-budget British TV drama more than anything. This is a family-friendly alternative to the edgy first part of Harry Potter and the Deathly Hallows, but it pales in comparison quality-wise. If you like bland and preachy films that feel perfect for Sunday school, you will love this latest Narnia installment more so than its two Disney precedents."
    },
    {
      "rating": "6",
      "text": "Aside from the great animations created and used the storyline moved like it seemed it would. Adding more sponk into the movie would give it more to the viewers. More mystery or something to spring on the viewers maybe."
    },
    {
      "rating": "6",
      "text": "Definitely was not the best in the series. I loved the first one so much, and the second one I didn't like too much, and this one is in the middle. I did enjoy the two Pevensie children and especially loved their cousin. Though a little annoying, he did crack a laugh out of me. I found that I really had to pay attention to know what was going on and sometimes got rather confused. I did overall enjoy it though."
    },
    {
      "rating": "8",
      "text": "Michael Apted pulls this stuttering franchise up to speed as the adventure expands to distant shores with wonderful character expansion as the little boy who turns into a dragon and with his mouse companion steal the show, great heart felt adaption of this CS Lewis masterpiece allows his deeper message to rise and give the whole stories a soul the previous two lacked."
    },
    {
      "rating": "9",
      "text": "Dawn Treader is a great improvement over Prince Caspian while it builds on the events of that film very well.  Even with the smaller budget, the special effects and the look of the ship itself are fantastic.  This is very much a film about characters and about character: why do we make the decisions that we do?  I believe there are temptations associated with each of the traditional \"deadly sins.\"  The narrative meanders somewhat at the beginning, but you'll be glad you sat through the various island adventures by the end.  Highly recommended, especially for families."
    },
    {
      "rating": "8",
      "text": "Said to be an admirable childrenâ"
    },
    {
      "rating": "7",
      "text": "After the catastrophe of the last two movies Disney dropped the Narnia series. This film was then picked up by fox who recruited director Micheal Apted to pick up and breathe new life into the series. Has it worked? Well sorta. He has certainly done his job. It is a nice light fantasy movie which doesn't deliver the scale of the previous two movies but still manages to engage. Sure there are better films you can go and see at the moment but this is an ok film. The CG is decent and the final battle is spectacular. The acting however of Georgie Henlet and Skander keyes an Edward and Lucy is not very good as they deliever very wooden perfomances. Ben Barnes drops the Mediterranean accent and returns as Prince Caspian with  and does a god job but the real star of this movie is the brilliant Will Poulter who plays the annoying cousin eustace who is by far the best thing about this movie. He had his start in 'Son of Rambow' and I hope to see him again  in the future. So in short a decent film apart from 'shoving religion down our throat' aspect. This isnt a spoiler but its obvious ASLAN=JESUS. Nothing special but a good family film for christmas."
    },
    {
      "rating": "9",
      "text": "Like the previous films, the production value was high. I was a bit leery when I heard that Fox was taking over (Disney had the first two), but those thoughts quickly disappeared. From the beginning to the end, I was drawn right into Narnia with the rest of the cast. The movie kept up the pace, and I never once felt bored. Just like the first two movies, when the end finally came, I did not want to go. I really felt like I was in Narnia for the past two hours.I think the cast was spot on. Eustace was as annoying as I had pictured him. When reading the book, I remember wanting to smack him, and that is exactly how I felt watching the movie. I think dropping Caspianâ"
    },
    {
      "rating": "10",
      "text": "Never judge a movie by its book or a book by its movie. These are different mediums of entertainment. Though I have read that people who have read the book are displeased with what is missing or that two of the islands were combined into one island, I must say that this movie has captured the spirit of the book quite well. The first thirty minutes or so of the movie is fairly mechanical and campy, but from the point that the characters encounter the magician Coriakin onward the story truly takes flight. Reepicheep the mouse befriends Eustance and shows him true friendship in Eustace's darkest hour. Edmund faces his fears. Lucy learns that she does not need to just like Susan to have value, and Caspian grows in wisdom as a king. The ending to the story is triumphant and nostalgic. Though no one would mistake this movie as an academy award winning contender it certainly does not disappoint. Sit back, buy yourself some popcorn, and enjoy the high seas!"
    },
    {
      "rating": "7",
      "text": "This is going to be a tough one for fans to enjoy, I personally enjoyed it, it appealed to my sense of adventure (that I didn't know I had), and packs some really cool and memorable moments about half way through, and some truly emotional and spectacular ones also, the problem is that it doesn't get interesting until about half way through, it starts off very boring, and honestly I didn't want to finish it, but boy am I glad I did, once the action starts it wont stop, and has a fantastic ending, and truly likable characters, also a few humorous moments, if your a fan of the series you should like this, just know you have to wait a while before it gets good."
    },
    {
      "rating": "10",
      "text": "It is really  awesome movie. I like book and were glad to watch good screen version  of it. It didn't disappoint me. Honestly, I was excited  to  watch this fight between Good  and Evil inside personages. This fim made me think again about my life and what is more important. I can't be indifferent looking wise t and magnificent Aslan. Of course, my  atheistic sister wasn't involved so deep  in this story. But how says Author or Aslan - all miracles of Narnia are available for kids or for person who can feel like a children. Once Jesus commanded us to be like a child. 10"
    },
    {
      "rating": "8",
      "text": "The best of Narnia movies so far. I like the way the story goes. About how they get into Narnia world again by the picture of seas with Dawn Treader. I like the dragon. This film is full of magic. Narnia Magic, i say."
    },
    {
      "rating": "7",
      "text": "After the amazing first two movies in the series, The Voyage of the Dawn Treader is a bit of a let down. This is not to say that it is terrible movie rather that it just didn't live up to my expectations. Nothing was really bad about the movie but nothing great stands out in my mind either. I am hoping that if The Silver Chair is made it will restore the series as The Dawn Treader just didn't live up to the first two."
    },
    {
      "rating": "3",
      "text": "Trough the film the spectator loses the interest in the story because all the situations are solved easily and the Christian message is evident. The 3-D effects aren't good and maybe it is better to see it in 2-D."
    },
    {
      "rating": "6",
      "text": "It's a good movie, nothing at all though. The story is cool but doesn't develops that much, and in my opinion if it weren't for the cool most nagging character I've ever seen in movies, Eustace, which at the principle he's a dumb and you wish him to die on the first seconds that he appeared but then he's the responsible for the big moments of the film, fairly for that said that if wasn't for him, the movie would been even more boring to watch. The special effects are good, in 2D, the 3D really left much to desire, the performances are average such as in the previous movies, they're good. Anyway, it's a good movie, but it is very warm, better than the second movie and much lower than the first."
    },
    {
      "rating": "3",
      "text": "Well, itÂ´s a very good saga on BOOKS!! In the first movie is good; in the second it was boring and without the things that tell the book (like Harry Potter or Twilight) but the third movie has all previous things in one movie\rFor me, donÂ´t like =I\rRastamarlinÆ"
    },
    {
      "rating": "8",
      "text": "I like this movie it had some action a big boat and a whinny kid who was actually quite funny. So why then did I give it a 8, because of one thing, stupidity. Yes stupidity not of the storyline (although they could have killed the whinny kid)but of the characters. here's a sample \"lets go sleep on an island we didn't know existed but do know is full of potential danger and not post a watch. I know we have a perfectly safe boat that has some comfy beds but getting killed is much more fun\" that is the sort of thing that ruined the movie and the fact that no whinny kids died."
    },
    {
      "rating": "5",
      "text": "This movie was okay! I clearly can pinpoint several diferences from the previous films in this series! The acting was a bit tense and dry. Also, when it comes to 3D I recommend to stay away from such unless it is really good and this wasn't really good in 3D."
    },
    {
      "rating": "4",
      "text": "Starts out more promising than it finishes. I was hoping that with a new studio picking up the franchise that there would be a move to make the films less melodramatic and more focused on the fantasy, but they failed. And thus, we will not see another sequel in this rendition of the book series. The CGI throughout the film has very cheaply and poorly composited; shadows and lighting don't quite match up, and the rendered textures don't properly match the grain of the film. The result is: everything looks too smooth. On top of this, the scenes are acted out to be more and more melodramatic. Very small aspects from the books are blown out of proportion, because! DRAMA!!! It doesn't work. And it's such a shame because I genuinely believe that the actors that play Eustace and Lucy are pretty solid actors. It's only the material that they are given to work with that stinks. I really wanted the main creative liberty the writer/director/studio took with the plot to work. I thought it was a great idea to give more of a driving force for the central plot beyond just, \"We need to find the 7 lords because I want to.\" However, it falls flat due to too many creative liberties being taken. The book is about exploration for the sake of an exciting adventure, and it noticeably conflicts with our interest in watching through the film and caring. Furthermore, the book plot reinforces a state of wonder--CS Lewis asks us the question, \"What is beyond? What is at the edge of Narnia?\" which gives us a sense of freedom and pure adventure. Whereas, this heavy plot introduced by a Wizard who is not doing anything to fix the antagonist makes no sense (why hasn't he already resolved this issue, being that he is a powerful sorcerer?). There is far too much weight put on Lucy's character to want to be \"the beautiful one,\" considered both that she is already better looking than the actress that plays her sister, and this shouldn't be such a big deal as it is depicted. In the book, it is written like a typical growing pains/adolescence conflict. In this movie it becomes the core flaw of her character. I genuinely believe the BBC mini series version is so much better. Better actors, better direction, better practical effects, and much more integral focus on the true essence of what make the Chronicles of Narnia great: fantasy and story. NOT melodrama and cheap thrills."
    },
    {
      "rating": "7",
      "text": "it was a nice movie, except for the fact that i watched it in 3D and it wasn't actually 3D. it's one of those \"i thought it would be better\" movies. it doesn't hurt watching it, but... i recommend that watch some other stuff and then watch this IF there is nothing else to watch. it is nice though."
    },
    {
      "rating": "5",
      "text": "This is a very average movie in terms of interest...while the CGI and effects are convincing,  storyline is a convoluted mess of stories and episodes that don't end up adding to a good movie experience.."
    },
    {
      "rating": "5",
      "text": "After two wonderful films I was hoping for \"The Voyage of the Dawn Treader\" to follow the steps of its predecessors. Unfortunately, my expectations were not fully met."
    },
    {
      "rating": "3",
      "text": "J'ai trouvÃ© que ce troisiÃ¨me opus Ã©tait un vÃ©ritable gÃ¢chis! Surtout du fait que la saga venait d'avoir un gain de qualitÃ© avec Le Prince Caspian. Mais cette OdysÃ©e du Passeur d'Aurore fait retomber le tout bien bas, et ce Ã  cause de nombreux dÃ©fauts : mal jouÃ©, effets numÃ©riques inÃ©gaux, un manque flagrant de spectaculaire et de magie, mauvaises photographie et mise en scÃ¨ne... Bref, j'ai vraiment eu l'impression de regarder un banal tÃ©lÃ©film plutÃ´t qu'autre chose, qui atteint Ã©galement un niveau de niaiserie jamais vu dans un tel produit grand public (cela est dÃ» aux dialogues et Ã  la musique). Je ne retiendrai que la lÃ©gÃ¨re dose de comique apportÃ©e par le personnage d'Eustache ainsi que la sÃ©quence divertissante du serpent de mer. A part cela, je mis suis royalement ennuyÃ©, n'ayant pas vu un opus Ã  la hauteur du prÃ©cÃ©dent... pour ne pas dire de la saga..."
    },
    {
      "rating": "5",
      "text": "Fans of the novels will get some enjoyment but this is a very mediocre adaption of a very good book."
    },
    {
      "rating": "8",
      "text": "This movie was good, went back to the fantasy of the first  movie and again stayed true to the book. The only reason why I did not give it a 10 because of that annoying cousin. But overall a great movie!"
    },
    {
      "rating": "6",
      "text": "Well, um....I really expected this one to be the best, but I lament myself by saying it is the least best of the entire saga: Yes, this one is the one with more magic, more jolly creatures and talking animals, less and more slow fighting plus it's more kid-friendly, unlike Prince Caspian. Well, it is a little boring, but it yet does not deserve a 5, because it is still kinda good. If you wanna see it, see it. If you don't, it's gonna be the same."
    },
    {
      "rating": "5",
      "text": "Well...the third installment of the Narnia Saga is a decent addition, at best. It lacked in almost every area that first two films succeeded at. Do not get me wrong, I really enjoyed the film as a whole, but do not be expecting a film similar to the first two.\rThe visual effects were absolutely stunning, even better in 3D, definitely the best aspect of the film. The story was good, too. The thing that really set me off was the acting. In the first two, with there being 4 characters, each role was smaller and more dependant of the others. In this film, the eldest characters aren't in the film, leaving the 2 youngests actors to carry the entire film. It was not executed as brilliantly as the first films. The young actors simply weren't up to par; it has nothing to do with their ability. It seemed like they could not keep up with the large scale of the story. Ben Barnes gave a good performance though. He was very convincing as King Caspian. Eustace is one of the most annoying characters ever. I secretly wished he would have died.\rWith all this being said, overall, I enjoyed the film. No, it doesn't do any justice to the saga, but it certainly does not do it disservice either. If you are a big fan of the first two films, I recommend that you see this film. You will enjoy it still, as I did."
    }
  ],
  "recommendations": [
    "percy_jackson_sea_of_monsters",
    "the_chronicles_of_narnia_prince_caspian",
    "the_hobbit_an_unexpected_journey",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "tomorrowland",
    "the_golden_compass",
    "inferno",
    "bumblebee",
    "john_carter",
    "terminator_genisys",
    "the_twilight_saga_breaking_dawn_part_2",
    "seventh_son",
    "the_hunger_games",
    "maze_runner_the_scorch_trials",
    "batman_v_superman_dawn_of_justice",
    "the_hobbit_the_desolation_of_smaug",
    "i_am_legend",
    "city_of_ember",
    "the_twilight_saga_new_moon",
    "ready_player_one",
    "the_hunger_games_catching_fire",
    "i_am_number_four",
    "green_lantern",
    "the_twilight_saga_eclipse",
    "super_8"
  ]
}