{
  "id": 41,
  "title": "The Conjuring: The Devil Made Me Do It",
  "starring": [
    "Patrick Wilson",
    "Vera Farmiga"
  ],
  "runtime": 111,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xbSuFiJbbBWCkyCCKIMfuDCA4yV.jpg",
  "categories": {
    "plot": 6.378378378378378,
    "acting": 5.928571428571429,
    "ending": 2.6,
    "soundtrack": 8.0,
    "cinematography": 2.5,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Average at best definitely worst one out of the franchise comparing to conjuring 1,2 and this one 3, it has its scary moments but very few and far in between. It's a slow burner leading to a quite mediocre ending. You dont feel that attached to the characters the Warren's In this story. because the story is all over the place. The story revolves around arne a young man who under demonic possession kill his friend and is on trial for murder that could lead to the death penalty. The Warren's have to figure out how to save arne by proving he was possessed when committing the murder. The demon is really a background character. And really serves nothing more then a plot point to the real evil person in this movie. The story simply follows a evil satanic worshiper named Isla who studies the black witch craft and a follower of the cult of the ram.that gives her powers through a curse that binds herself to a demon. The witch needs 3 special sacrifices to the demon, and its not really explained why she needs to perform these sacrifices, just that she does it for her diety. If she doesn't perform the proper sacrifices the demon takes her soul back to hell.The movie is 1hr 52min long when the movie should have been at most 90 min."
    },
    {
      "rating": "4",
      "text": "Really boring, really. It's slow and weird mini \"boss-battle\" just to slow Ed and Lourraine Warren down, the only thing that carries the franchise is Annabelle."
    },
    {
      "rating": "4",
      "text": "It’s an absolute dud when stacked against the previous two entries in the conjuring series. The plot is meandering and doesn’t know how to share screen time with its disparate characters, the scares are intensely generic and mediocre, and the overall tone leans to heavily into wholesomeness. It feels incongruent with the subject matter. There’s this strange feeling that the entire world only involves the Warren’s and that priest that seems to tag along in every scene. The film is almost too self-aware, and appears to be imitating a diluted gist of the previous movies. Stakes never feel very high, and the convoluted plot approaches nonsense far too often to be taken seriously. And the main villain? Who the hell is this woman? Why do I care at all about her curses?Everything about Conjuring 3 is weak and dull, and the acting is either melodramatic or silly more often than not. The best I can say is that it is competently made, and some moments were interesting conceptually. With that being said, this movie is generic horror fare, and will impress absolutely no one."
    },
    {
      "rating": "3",
      "text": "I reviewed the first film in the Conjuring universe, but skipped the 6 subsequent entries. Thought I’d revisit the series with this new one. It still revolves around real-life husband/wife paranormal investigators (Patrick Wilson and Vera Farmiga), who encounter yet another demonic possession that they must investigate and overcome. Even though there are a few jump scares, this is pretty much a by-the-numbers haunting with creepy dark rooms and ominous sound design to telegraph every fright. The actors manage to convey tension, but it’s still just a lot of bumps in the nite. This linefrom my review of the original still holds true: “Maybe I’m jaded or too experienced with the genre, but I was never scared or surprised.”"
    },
    {
      "rating": "5",
      "text": "Changes in a horror franchise are often complicated. For both the filmmakers and the viewers.Many times there's talk of wanting a change, but deep down, they really don't want it.They want the same scares, they just hope to be caught off guard.The Conjuring: The Devil Made Me Do shows a strong change by losing James Wan as a director, since the atmosphere of the films he made is still there, but not the tone, and the most positive points of the film lie more in the work of the main duo, that in what the story and the new director end up doing.Some things I liked, I admit, but there are many others that just seemed quite predictable to me.This is more than anything because, although this film changes the style a bit, the narrative continues to be supported by the same tropes, and that's tiresome and boring, because believe me, waiting for something to come out of the dark is no longer effective.Problematically the film explores a different type of villain, but it never decides to go for it all, and is resolved in a sentimental ending.And that was a shame, because if this franchise is looking for a fourth film beyond its financial success, it really needs a formula change, from start to finish, especially since the spin-offs have also weakened the franchise in terms of ideas.It's mentioned that this installment is less terrifying than the previous two, but the other two did not seem terrifying either, so the scares depend on you."
    },
    {
      "rating": "4",
      "text": "Giant step down for the series. Boring and too long is not a recipe for a good movie. You feel disconnected from anything happening and the Warren's feel like strangers, it's very weird. I wish I had one of the things from men in black and I could erase this from my mind."
    },
    {
      "rating": "1",
      "text": "(Mauro Lanari)Could such an idiot film be used as a demonstration of the existence of the devil?"
    },
    {
      "rating": "2",
      "text": "Minus some good camera choices and cinematography this film simply put stinksNo shocker considering it wasn’t helmed by James Wann , I’m surprised he wasn’t more involved with this project given how passionate he was about the first two. I get he’s booked with Aqua-Man sequels but man he needed to come in and give some advice on how to make a film legitimately scary or at least unsettling to your viewers. This needed major rewrites bad, Vera Farmiga and Patrick Wilson are above this material, but I don’t blame them because they got their paychecks at the end of the day no matter how this does.Also, its biggest crime is going in. a whole new direction than what we’re used to. When your villain can suddenly pop out of thin air and teleport everywhere you’ve lost me, there’s a problem when the only thing that sticks to me is hearing and seeing the Annabelle doll chilling in the background. Even her recent sequel knew how to have some fun.Overall, it had interesting ideas, but it needed better direction and it makes sense since it was helmed by the same dude who make the curse of La Llorona a movie while had its moments was mediocre at best. I hope moving forward they learn from their mistakes and attempt to get back to what made this series work to begin with."
    },
    {
      "rating": "10",
      "text": "The movie was AMAZING!!! like the sound and the music will make you feel so good and happy and the scares will get that adrenaline pumping !! And Lorraine looks hot af so you must watch it I’ve watched it twice in the cinema WATCH IT!!!!"
    },
    {
      "rating": "5",
      "text": "I'm a huge fan of the Conjuring Universe. I was looking forward to this movie for so long. I'm here to say, I've been disappointed. The best part of the film is the first 10 minutes. Everything after that is trash. I wanna feel scared...scared to get up and go to the bathroom by myself or scared to go to bed alone. The first portion of the movie made me think...maybe I shouldn't watch this at night, alone. However, I was teased and now I need to find another movie to give me that feeling before bed."
    },
    {
      "rating": "3",
      "text": "Boring all over the place. What devil?!?! Switching from demons to witches is silly. Acting was cheesy along with the writing."
    },
    {
      "rating": "2",
      "text": "Very disappointing. Patrick Wilson and Vera Farmiga deserve a better script than they got here. The direction is strangely inconsistent, the storytelling often incoherent, with some bad casting and acting in the supporting roles, with the exception of the terrific John Noble. The opening was embarrassing, kitchen-sinked to squeeze-in every possible horror trope and cliche. The script was in parts badly researched and never quite made sense. Bad."
    },
    {
      "rating": "1",
      "text": "The movie was really bad and is very **** but there was a funny scene i liked so i will give it a 1"
    },
    {
      "rating": "3",
      "text": "The first two are definitely better imo. But it's still a good movie worth watching. A few applauded in the theater today...lol. It wasn't that good to warrant that...maybe give it a 70. Was a little slow."
    },
    {
      "rating": "7",
      "text": "My personal favorite of this series.  Probably second favorite for my wife, after Annabelle. I felt the storyline was a little more complex than previous entries, which I liked.  And some nice \"heart\" moments between the two leads."
    },
    {
      "rating": "4",
      "text": "I really like The Conjuring 1 and 2. Both are some of my favorite horror films and that is mostly because of Vera Farmiga, Patrick Wilson, and Director James Wan. While the film still has the two actors, James Wan isn’t Directing this one and it’s noticeable. It feels like a rip off of James Wan style which sucks because he made the first 2 movies so interesting while this one falls into the worst trap a horror movie can fall into; being boring. While the opening feels like something James Wan would do and it’s the best part of the movie, the rest of the film fails miserably to match that energy. While 1 and 2 had some issues, the uniqueness of it and the scares always kept you engaged but in this one, Ed and Lorraine are the ONLY interesting things about this movie. The story falls into a stereotypical horror film with every story beat being predictable and while yes the first 2 films were predictable, it was getting to that end that made you invested but this time you know everything that is going to happen. The first two films benefited from having supernatural elements while this one is just a witch lady who isn’t dead. I really don’t understand why they did this. She isn’t possessed by anything. She just kinda walks around and manipulates people. There were some things I liked about the film though. Patrick Wilson and Vera Farmiga still do a good job with the material and John Noble was pretty great as well. Some of the cinematography looks nice and there is a great shot at the beginning that takes inspiration from The Exorcist. That’s about it. There really wasn’t a whole lot I liked. It was just a very bland, very forgettable, and unscary addition to this flailing universe. If you have seen the first two then you might like this but skip this and just watch the first 2 Conjuring movies."
    },
    {
      "rating": "7",
      "text": "Wasn’t as good as the first two films, but it was better then the spinoffs. The first two films were terrifying, this installment didn’t really hit on the same level, but overall it had a good story and was different then the first two films, which I give them credit for. It’s more of a crime mystery then a horror film if you ask me. Im happy to say it was a breath of fresh air at least. I went in to this movie with low expectations knowing James wan wasn’t directing, and they were using the guy from the “curse of whatever”, which was probably the worst horror filM I’ve ever seen."
    },
    {
      "rating": "2",
      "text": "Straight up trash. Like used baby diapers laying out in the sun for at least three days trash."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "6",
      "text": "meh. not scary but story is okey. not good but not bad neither. soundtrack is really weak. this is the weakest movie of this trilogy for sure."
    },
    {
      "rating": "2",
      "text": "The worst movie of the year, the worst scary movie, the worst conjuring movie, the most boring movie."
    },
    {
      "rating": "7",
      "text": "There's something strange in your movie theater. Who ya gonna call? Ed and Lorraine! That's right, Streamers, your favorite paranormal couple is back. The Conjuring: The Devil Made Me Do It was finally released in theaters and HBO Max this weekend. This time the Warrens battle the forces of evil that made a man kill. His defense.... I bet you guessed it... the devil made him do it. But, let's see if the devil is in the details of this flick.Now, if you're familiar with The Conjuring series (including the Annabelle series), then you won't need much introduction for this flick. For those who are just traveling to the theater for a horror flick or out of pure boredom of this pandemic, you really don't need to know anything about them. That's a bonus for this third sequel. Yes, they make reference to Annabelle and their previous work but it's completely insignificant. Overall, this is a self-contained story and a classy one. Part of this film and the others is that The Conjuring have found a genuine way to be creepy without being gross, gory or even over the top. This movie gives you the chilling feeling like the others without even a curse word. While it's great to be classy and all, in a third movie you'd think the scares would go to the next level, but here, they actually took a step back. That's no bueno especially after the second movie had one of the most disturbing faces with the Nun. This flick didn't have that or anything memorably scary. It has scares but unfortunately they are ones we've seen before. The only positive is that the scares are unpredictable, which to some could be a good thing or a bad thing. In a way, I like that I couldn't cover my eyes at the moment I knew it was coming - some may not be so satisfied. The filmmakers of The Devil Made Me Do It were able to make this film in a way that isn't like a typical exorcist flick, which frankly was enjoyable but they could have done more. I appreciate that they made an off shoot of The Conjuring flicks which feel like not just another run-of-the-mill possession film just for the money.Also, the cast is fine as usual. Vera Farmiga and Patrick Wilson give us their typical Lorraine and Ed. Nothing wrong there. The issue becomes their storyline is a bit distracting to the overall movie. In other movies, their love story was used to lighten the mood between the intensity of the rest of the film, but here it felt a bit more like filler and puffing. We still get our reprieves, but again something just feels off. All of this leads to the feeling that this movie isn't that scary, which is unfortunate because the movie is held to a high standard based on the first two movies.Nevertheless and neverthemore, The Conjuring: The Devil Made Me Do It is certainly a welcome addition to The Conjuring series. Unfortunately, I find this to be the least scary of the three, but that may just be a bonus for those of you who don't like horror movies. The Devil Made Me Do It is a solid horror movie that provides the creeps without the over the top gore or in your face grotesque nature. Enjoy a matinee movie time or check this out on HBO Max with a bowl of popcorn."
    },
    {
      "rating": "7",
      "text": "It was not a bad story, but as much as the producers said it was the best horror movie, but they said that the content was very interesting and the fear was not as stressful as it was, with 15% scary inside and two of my pages.  It was interesting that the gene of control of that boyfriend of that girl girl was in his possession with demonic things, and one of them was the scene that showed how much the two couples Ed and Lorin loved each other and how much they feel in love with each other.  It was one of the best scenes in this movie in my opinion, but the rest of the story was also interesting. Mysterious with a bit of fear, and I liked that whatever the movie was, it was more beautiful than Anabel, more beautiful, it was much scarier, it was much better in my opinion."
    },
    {
      "rating": "7",
      "text": "The Conjuring: Devil made me do it is horror genre movie but it had least horror elements as compared to previous parts. It looked more like a drama movie.The direction is a nice change of pace. The Warrens are still great in this film with both Patrick Wilson and Vera Farmiga having a real chemistry on screen and still being one of the most lovable protagonists in horror media. The only thing this movie failed was that is wasn't able to scare.Overall, it is a decent sequel, just not the terrifying one."
    },
    {
      "rating": "2",
      "text": "As an avid fan of the horror genre and someone who'd rate The Conjuring as an 8.5 and The Conjuring 2 as an 8 out of 10, I was incredibly disappointed in this film.  Everything seemed off.  The acting/casting, the cinematography, the writing, score/music, lighting, visual effects, editing, you name it.  It had neither jump scares nor creepy \"hair on the back of your neck stands up\" scares.  Patrick Wilson and Vera Farmiga did the best they could and I can only hope they get a proper final outing in the future.  The film was an absolute chore to sit through.  My movie making experience is incredibly limited.  However, after The Curse of La Llorona and this, I think I'll pass on anything else Michael Chaves puts out.  Not only do I believe he has little understanding as to how to use the camera, sound, and lighting to build tension, but he also included two shots where extras glanced right into the lens of the camera.  The first time, I let it slide thinking my eyes played a trick on me.  The second time was near the end.  The prosecuting attorney was looking at Arne, then clearly glanced at the camera, then back at Arne.  I rewound it, paused and sure enough... she glanced right into the camera, lens, realized \"oh crap, I'm looking at the camera\" then looked back at Arne.  The fact that Michael Chavez didn't catch during editing this means he's either lazy, hoping no one would catch it or he's incompetent."
    },
    {
      "rating": "7",
      "text": "Pretty good movie. Not as good as the original or the second film, but it’s still good. Definitely give it a watch in theaters or on HBOmax."
    },
    {
      "rating": "7",
      "text": "Conjuring 3 offers a strong performance of Vera Farmiga as Lorraine Warren while showing something else then just another \"haunted house\" movie. While it was less scary, it had some good twists and is another nice addition to the Conjuring universe."
    },
    {
      "rating": "4",
      "text": "The Conjuring has established itself as the most successful franchise in the horror genre. It was subtitled “The devil made me do it”. The first two films were highly praised by specialized critics, with an incredible 86 percent approval and the second with 80 percent.The film features the story of Arne Cheyenne Johnson, the first defendant in the history of the United States who claimed to be possessed by a demon in 1981.In the first 11 minutes of the film, the exorcism of a boy of just 11 years old, David, Debbie's brother, is shown, and it is at this point that Arne invites the devil to possess him. In the first scenes we have many references to classic movies like the exorcist.Directed by Michael Chaves, the same director of The curse of La Llorona, The Conjuring 3 has many different aspects from the previous ones, mainly in terms of direction. James Wan was really missed in the film because it brought aspects that no other director can bring to horror movies in general. The film does not present what was promised, it lacked great memorable moments and hardly anyone will be afraid watching it, in the previous ones we have Nun Valak, Annabelle and even the crooked man different from these, the main villain of the story is not remarkable and will hardly win a movie for not be as interesting as the other characters.The plot features Ruairi O’ connor as Arne, Sarah Catherine Hook as Debbie and Julian Hilliard with David who fulfill their roles well as the main supporting characters. Patrick Wilson and Vera Farmiga return as Ed and Lorraine doing a great job again.Warren's flashbacks are well explored here, bringing out how they met, which becomes an important memory in the development of the film.the conjuring 3 is far from being the scariest of the franchise, it only shows part of the criminal investigation and even Arne's story at times is left only in the background, the ''scare'' attempts didn't work. It ends up becoming good for those who are already a fan but nothing interesting for those who are not a fan of the franchise. The first movie remains the best of the entire The conjuring universe, becoming a horror classic today.maybe the ending is a little exciting"
    },
    {
      "rating": "10",
      "text": "I really did enjoy this movie, it’s definitely one of my favorite horror movies. Everything from the plot and storyline to the acting really takes the cake for me. I also liked how it wasn’t so confined to just one haunted house so that was a nice change as well. The idea of the antagonist really does send a sinister chill down my spine as well."
    },
    {
      "rating": "6",
      "text": "Not as good as Conjuring 1 or Conjuring 2, but still good enough than others."
    },
    {
      "rating": "8",
      "text": "Quelques scènes incroyablement flippantes avec de supers idées de mise en scène. L'horreur et l'épouvante marchent bien, d'autant plus que c'est devenu dur d'être original aujourd'hui avec le nombre colossal de films d'horreurs qui sortent toutes les semaines. D'autant plus passionnant que beaucoup de films de cette même production sont reliés par un même lore."
    },
    {
      "rating": "10",
      "text": "The conjuring is one of the few films that makes you feel scared, nowadays many movies only use effects to attract, but the conjuring is the exception, a great job."
    },
    {
      "rating": "0",
      "text": "No,no,no,no,no. 2021 KILLED this movie.1. Weak man has to listen to a woman to be tough.2. Weak man must be forced to rescue a disobedient child by said woman.2. Kids don't listen to adults so they can save the day.3. \"weak\" man saves the world but apologizes for it.4. 10 minutes of John Krasinski.5. Woman easily opens a bear trap like its a Snickers bar.6. Deaf kid only understands what she wants so she is \"powerful\"7. Movie ends with 2 children that don't listen to parents saving the world with the final kills. (credits roll)8. Predictable that someone was going to be oxygen less soon.9. God awful movie. Watch part 1, cry and appreciate the realism that men save and help women and children.10. Carefully placed black people at the end but of course dad dies fast."
    },
    {
      "rating": "8",
      "text": "A surprising return to form to this franchise. The Warren always needed to convince the public with regard to their cases, but with regard to the law? This made this series into a procedural, mixed in with their brand of supernatural thrills that the audience seemed to love. As usual, both Wilson and Farmiga are highlights."
    },
    {
      "rating": "7",
      "text": "I used to call the more Ed-and-Lorraine-Warren-focused \"Conjuring\" movies the \"numeric Conjuring movies,\" but now that we've abandoned the numerals and inexplicably moved on to subtitles, looks like I'm gonna have to refer to these as \"the more Ed-and-Lorraine-Warren-focused 'Conjuring' movies\" going forward. Thank you Warner Bros. and Co. for this added complication. Honestly, the deeper we get into this franchise, the less scary these movies get for me. What \"The Conjuring: The Devil Made Me Do It\" lacks in genuine terror, however, it makes up for in experimenting with how far a movie can stretch the \"based on a true story\" label. That may sound like a slight, but it is genuinely the most entertaining part of watching this film unfold. That, the core mystery at hand and the two lead performances from Patrick Wilson and Vera Farmiga are enough to get the job done. For me, most horror movies fail with subpar acting and a boring narrative in hand. \"The Conjuring: The Devil Made Me Do It\" might not be the strongest of the franchise in any regard, but it is -- at the very least -- well-acted and entertaining. So, for my money, it succeeds, albeit marginally."
    },
    {
      "rating": "8",
      "text": "Refiriéndome únicamente a las dos primeras películas de El Conjuro, en esta tercera parte el cambio de dirección es muy notorio y si no fuera por la impecable presencia de Vera Farmiga y Patrick Wilson se sentiría como algo ajeno a la saga. No es mala, de hecho es bastante buena, débil al lado de sus predecesoras pero es un enorme salto de calidad después del fiasco que fueron La Monja y La Llorona respectivamente, la historia es normal como de costumbre, la atmósfera muy buena, los sustos fueron enormemente reducidos tanto en cantidad como en intensidad, lo cual lejos de ser un defecto es algo positivo ya que así es más fácil enfocarse con mejor precisión hacia lo que sucede en pantalla.Entretenida, pudo ser mejor pero lejos de ser peor que las últimas entregas 7.5/10."
    },
    {
      "rating": "9",
      "text": "Have no idea what the critics are on about. I thoroughly enjoyed this movie. Despite a rather rushed first act that made me feel like there was part of the film missing (assuming this was done to advance the story quickly to the investigation of the reasons why. But poor editing made the jump in timeline very jarring)That aside, i found the story compelling the characters interesting as they needed to be for a horror movie and the scares sufficiently creepy. I think many critics need to go into films like this in the same way i do. Don't expect high art of ground breaking cinema. Just enjoy it for what it is."
    },
    {
      "rating": "10",
      "text": "We read the reviews, but went anyway. And I loved it! It's a fine continuation of this campy, creepy, supposed-to-be-real story of the Warrens and their campaign against evil. Someone who reviewed was annoyed by the religious theme, which is hilarious because that's the world these movies are set in. If you don't like Christianity and Western Civilization, please avoid movies about demons and vampires. You're bound to see some crosses and hear some prayers! There's no beating the original Conjuring. But this story is compelling and scary and holds together well. There are some great new characters: a possessed kid and a deeply in-love teenaged couple. And the love story of the Warrens themselves is told. Just go. It's fun."
    },
    {
      "rating": "10",
      "text": "the best conjuring movie out of the entire conjuring universe! a must watch."
    },
    {
      "rating": "10",
      "text": "Amazing movie lots of drama but not as mysterious as conjuring 2 but this movie explains more about black magicp"
    },
    {
      "rating": "10",
      "text": "O terceiro filme da tricologia Invoca Verso, não deixa nada a desejar e se tornar o terceiro melhor filme!"
    },
    {
      "rating": "8",
      "text": "This is a very different movie from previous. If you want different approach and fan of the Warren’s you will love this movie. We all wanted something different and that’s what we have got in this movie."
    },
    {
      "rating": "9",
      "text": "The Conjuring: The Devil Made Me Do It (Invocação do Mal 3: A Ordem do Demônio) Lembrando, não sou Crítico de cinema, a minha opinião pode ser diferente da Sua, bom vamos lá. O filme começa com uma cena icônica, Sem dúvidas a melhor abertura da franquia, Julian Hiliard manda muito bem, a atuação desse moleque é incrível. Bom depois disso, o filme muda de atmosfera, ele abre não do terror que conhecemos nos dois anteriores. Ele simplesmente mergulha na história, o filme tem jumpscare? Tem, lógico até pq estamos falando de um filme da franquia Invocação do Mal, não é mesmo? KkkkkkMas os jumpscare São muito poucos comparado com os filmes anteriores. Invocação do Mal 3 a partir da cena de Abertura vira praticamente um Suspense investigativo e ao contrário dos filmes anteriores o alvo não é focado totalmente na família, os Warren São um dos alvos principais eles correm muito perigo aqui, embora eu ache o menos assustador entre os 3, o filme me deixou com o coração acelerado (e não me pergunte pq) eu simplesmente estava aflito, isso foi muito bom pois como o filme não tem muitos jumpscare, foi a história que me fez ficar assim. O filme tem alguns alívios cômicos envolvendo uma citação a Annabelle, Citação ao Elvis Presley etc... KkkkkkkkDiferente de A Freira e Annabelle 3 esses alívios cômicos ficaram muito bons e se encaixaram muito bem na história.Vamos falar dos cenários? Eu Simplesmente fiquei apaixonado pela fotografia do filme (principalmente a cena envolvendo o necrotério) foi dms. Sobre o vilão? É o menos icônico da franquia, mas isso pode ser explicado pelo fato de não ser uma entidade sobrenatural e sim algo físico. Esse terceiro capítulo é bem diferente dos dois anteriores como eu disse, ele trás outra essência a franquia, o que é bom, nos leva a lugares jamais explorados pelos Warren antes. O lance envolvendo bruxaria combinou com a história. Vamos falar da direção? Michel chaves evoluiu muito desde a Maldição da Chorona, aqui ele prova se o filme tiver uma história boa ele consegue sim mostrar potência. Se por um acaso você não gostar desse filme, tenho certeza que não vai ser por conta da direção. Vamos falar das atuações? Julian Hiliard como já havia citado é muito boa cara, virei fã do trabalho dele (embora ele apareça pouco no filme)  Ruairi Entrega uma atuação perfeita como Arne.  O resto do elenco está muito bom, todos cumpre bem com seus papéis dentro do filme. Mas é claro os maiores destaque São Vera farmiga e Patrick Wilson como Lorraine e Ed Warren, sério eles são sensacionais naquilo que fazem, principalmente a Vera, que mulher maravilhosa a expressão no rosto dela te passa toda a verdade do filme. Conclusão: Se você gosta de um terror com história, que mergulhe realmente naquilo que está contando, se você gosta de filmes que se preocupam em te contar a história nos míseros detalhe, Invocação do Mal 3 é o filme feito pra você, você irá amar. Agora, se por outro lado, você é aquele tipo de pessoa que gosta de levar sustos, pular da cadeira toda hora, talvez você não goste tanto desse terceiro capítulo, pois como eu disse ele é mais um suspense investigativo. Minha opinião: ele não supera os dois anteriores, pra mim o 1 e o 2 me fisgaram Melhor (principalmente o 2) mas esse terceiro não fica muito atrás, ele realmente da outro visual aos filmes de Invocação do Mal. Então assista ele com mente aberta, de que ele não vai ser o filmão aterrorizante e sim um filme que vai te contar uma história de terror com um pouco de sustos ao longo. Minha nota para Invocação do Mal 3 é: 9.0"
    },
    {
      "rating": "10",
      "text": "Patrick Wilson and Vera Farmiga have great chemistry. The story was good. Exactly what I would expect from this franchise."
    },
    {
      "rating": "10",
      "text": "conjuring movies never dissapoints!! It started strongly with that exorcism sequence, it had some good scares and creepiness which keeps us engaged.. Must see!!"
    },
    {
      "rating": "10",
      "text": "U will not get bored as no slow phase is there. Story is kind of different from other movies and the recent movies. It sucks in the scary parts not enough ."
    },
    {
      "rating": "5",
      "text": "The long-awaited third Conjuring movie moves away from the haunted house style horror of its predecessors in favor of a murder-mystery angle that naturally sports a strong supernatural element. The results are nothing short of a letdown. Not because of the new approach or anything, but rather the noticeable lack of James Wan at the helm. Director Michael Chavez proves to be a poor substitute for the longtime genre veteran, as despite having a compelling narrative to work with he is unable to bring any real terror to the table making the whole experience far more boring than it should have been.The actual story itself certainly covers some frightening material. Regardless of whether or not you believe in the demonic entities they worship, the existence of satanic cultists isn't something that can't be denied and their inclusion here does add an extra spine-chilling quality to the proceedings. The problem is that this tension never manifests itself onscreen. The attempts at scares are all of the generic exorcism variety and it gets so caught up in its own plotting that it almost forgets to include any for the entire middle portion of the film.While it lacks the thrills and chills we've come to expect from the series, it does at least still have the Warrens and in one of their more interesting cases to boot. Which counts for more than you might think. It's nice to see that more sentimental nature of The Conjuring 2 was not lost in this follow-up. Once again the bond between the paranormal investigating husband-and-wife duo is a core focus and wonderfully brought to life by the incredibly charming Patrick Wilson and Vera Farmiga who make these protagonists the most endearing opponents of unholy evil this side of the Insidious franchise. There's a emotional component added to the mix because of this that, along with the sight of child's body contorting under the influence of possession, actually got me a little teary-eyed in a few parts. Although ultimately ending up kind of dull to watch unfold, the concept alone is also fascinating enough to likely keep you engaged until the credits roll. It definitely inspired a desire in me to learn about the real event this is based on. If only to decide for myself whether or not I buy Arne Cheyenne's claims.If you're a fan of the previous two entries and the larger universe that's been built around them this may still be worth checking out for you. However, it's an unfulfilling continuation to some of the greatest works of modern horror that most devastatingly does little to raise the pulse or cause any feelings of unease in the absence of their original director. Chavez did do a respectable job and shows potential, but Wan's shoes were simply too big for him to step into. Leading to a very promising premise feeling like it went to waste in what is so far the biggest disappointment of 2021.5.5/10"
    },
    {
      "rating": "6",
      "text": "Wouldn't have been worth seeing in theaters, but since it's on HBO, it was worth two hours of my life."
    },
    {
      "rating": "7",
      "text": "Probably the weakest of The Conjuring trilogy, but has some interesting ideas. Overall though a bit more fromage, and less scary than the other films."
    },
    {
      "rating": "10",
      "text": "Excelente película! g66gjihuhuyvygguhuhuubhihiuhhuuhhuhuhuhuuuh5fh7hi7y7hihhihiu"
    }
  ]
}