{"id": 1838, "title": "The Hustle", "starring": ["Anne Hathaway", "Rebel Wilson"], "runtime": 94, "genre": ["Comedy", "Crime"], "description": "Two female scam artists, one low rent and the other high class, compete to swindle a naïve tech prodigy out of his fortune. A remake of the 1988 comedy \"Dirty Rotten Scoundrels.\"", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qZniBGQRESLIfxw6GeZLZ2G1osa.jpg", "categories": {"plot": 5.333333333333333, "acting": 4.545454545454546, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.3333333333333335, "funny": 3.5714285714285716, "action": 6.5}, "reviews": [{"rating": "0", "text": "Such an awful film on every level. I couldn't endure more than 20 minutes of it. Anne Hathaway's British accent is atrocious, the script seems like its written by a toddler (even though part of it is robbed from the original), the jokes are unfunny and the whole thing is just unbelievable and farcical. The money they spent on this could have saved a village from starvation, instead it's just been flushed down the toilet"}, {"rating": "0", "text": "Just rubbish pumped out for the gullible to waste their money and time on(I was given ticket from daughters friends mother who,luckily,couldnt go),how this rebel is even considered an actor not remotely funny or talented.This steaming pile of putridness is just a bunch of hopeless incredibly dumb,lame,cringey unfunny gags wacked together by a seemingly lobotomised s toned director,it should've gone straight to beta or an abandoned remote porn theatre,terrible"}, {"rating": "2", "text": "The twist induces a massive eye roll.  There are some laughs throughout the movie, but twice as many cringes.  This film likely marks the official decline of the Rebel Wilson era. She had a moment and we're glad she got her checks, but her schtick has run its course."}, {"rating": "3", "text": "A new low for Anne Hathaway while for Rebel Wilson is business as usual, which is not surprising at all."}, {"rating": "5", "text": "The beginning is quite flashy and interesting, but later the movie became absurd and bland."}, {"rating": "7", "text": "The con artist comedy The Hustle is a remake of Dirty Rotten Scoundrels with Michael Caine and Steve Martin, which was itself a remake of Bedtime Stories with Marlon Brando and David Niven. The lack of advertisement for this didn't leave me with high hopes. However, the movie was better than expected. Still, it was also a pale imitation of DRS.The movie's biggest issue is that the plot from it's predecessor is basically replicated point-by-point. Everything is too expected. The reason Dirty Rotten Scoundrels became more entrenched in public memory than bedtime stories was because it was willing to take the story on a different trajectory. I mean the general idea of two con artists competing over a mark is a general idea that could've been reinvented in multiple ways. They could have at least changed geographic locations. If you haven't seen DRS, you'll probably get a lot more entertainment value out of this.Rebel Wilson plays the Steve Martin/uncouth, \"small-time\" con artist role. The problem is that the film relies too much on her. It's clear, that a good portion of filming involved director Chris Addison just having Wilson ad-lib. When Wilson is funny, she is very funny. She can have such a delightfully sharp tongue. But she produces a lot of groaners, too. In fairness to Wilson, it was up to the director and editor to which material showed up on film. Doesn't help that the actress' character and a lot of her material feels recycled from previous films. They try to make her character sympathetic in the end, but the character is so acidic the audience's empathy isn't earned.Anne Hathaway fairs a lot better as the Michael Caine/classy and haughty con artist. Her posh British accent is clearly fake, but she's so committed to the role that I couldn't help enjoying it. (The same can't be said for another accent she uses later on.) She also has a great control of non-verbal mannerisms. The best difference between this and DRS is that unlike with Michael Caine's total straight man The Hustle isn't afraid to knock Hathaway's haughty character down a peg and make her the butt of the joke at times. It's fun to see the character's rare moments where she loses her temper and drops all sense of control and class.Alex Sharp plays the mark, and I'm afraid the character isn't very interesting or really leaves much of an impression.I know I have a lot of complaints about this film, but the reason I didn't give this a lower rating is because when it was all said and done I didn't have a bad time. When it's funny, the movie is funny. (Also doesn't hurt that since this is set in the French Riviera, the whole thing looks nice.) This is by no means a great movie, but I didn't walk away feeling cheated either. Thing is that I can see some people really liking or disliking this. I say take a chance, but there's no need to make this something to see immediately."}, {"rating": "5", "text": "The Hustle was a good movie but it was not great. It was not as funny as I thought it was going to from seeing the previews. Some of the things that were suppose to be funny were not all that funny. With all of that Rebel Wilson and Anne Hathaway still gave fantastic performances and it was not a horrible movie and it did make me laugh once in a while. The Hustle is my least favorite movie of 2019."}, {"rating": "10", "text": "This movie had me laughing from beginning to end,  Anne Hathaway & Rebel Wilson were a dynamic duo in this movie. I love that they did a remake with a female cast because  it worked so well. I also loved the ending (No I won’t give it away) BUT there could easily be a sequel to this movie & I am truly hoping they do. A sequel would be amazing because there’s so much more they could do & so many different storylines. I love both Anne Hathaway & Rebel Wilson & they really did such a fantastic job in this movie. Fingers crossed that it does well enough for them to make a sequel."}, {"rating": "10", "text": "I absolutely loved this movie, the pairing with Anne and Wilson were fantastic. I laughed so hard I couldnt breathe!"}, {"rating": "6", "text": "Was tough to sit through.  Though it was funnier than a lot of modern comedies I've seen in the last couple of years. Can't recommend it."}, {"rating": "3", "text": "In an ode to \"Dirty Rotten Scoundrels,\" Anne Hathaway (the classy one) and Rebel Wilson (the no-class one) play con artists on the French Riviera. While Hathaway (with some fabulous looks) tries valiantly to grab some comic moments, her efforts are foiled by the sadly unfunny script. Wilson does her usual shtick, which is starting to get tiresome. Overall, the writing is seldom clever and never amusing, while the direction is uninspired. There's undeniable energy to the whole affair, but it's about as genuinely amusing as a con artist's heart."}, {"rating": "1", "text": "A nice-looking movie that wasn’t very funny. I would hesitate to judge this one harshly because I was in a theater with a “challenged” young man who screamed every three minutes for the entire length of the movie. One way I kept my sanity was by concentrating on the dialogue and asking myself over and over “is this funny?” The answer was invariably “no.” My rating is based solely on the setting and Anne Hathaway’s clothes."}, {"rating": "1", "text": "Friends and I enjoyed this movie.  Anne Hathaway and Rebel Wilson are fun to watch as two very different ladies who hustle rich men by various means, often involving outlandish stories or machinations.  The two actresses play nicely off one another.  A remake of “Dirty Rotten Scoundrels,” it changes things up just enough to make it fresh.  At some point the women meet and realize they are rivals in the local con game.  After things go awry, they team up for a con, although they are both trying to con the other out of getting anything out of this particular guy.  Not a fabulous movie to gush over, for sure.  But, for a fun time at the movies, it is a good choice."}, {"rating": "7", "text": "I liked it as a silly comedy, didn't expect anything more from it. I guess rating maybe a bit too high but its some time since I watched it and still remember much of what happened in it so it wasnt like it was all boring."}, {"rating": "4", "text": "I did not want to see this movie but it was a little better then I thought, I still think it was just ok, I wouldnt recommend or watch it again but I dont feel as though I wasted my money"}, {"rating": "2", "text": "Remaking the comedy gold with undercooked ingredients, the property that has been unfiltered up till now, gets spoiled by bling-y loud attitude.The HustleAddison is not even a decent cheater. All he had to do was just copy the Frank Oz version and they could have been gold. But then Chris Addison, the director, is not the only one to be blamed, the writers who treats its audience like their dumb characters ought to be put on trial too. The jokes just have to be translated into girl's perspective, is not their way in, they should have stretched their muscles a bit. Do they really think we are as gullible as the characters their lead ones revolve around? Has it been so easy to make someone laugh or con, everybody would be Hathaway.With her looks so sharp and dunked herself into makeup and fake accent, there is a reason she is considered the best of our generation. For only Anne Hathaway without holding back, sticks to the silliest scenes of all. No matter how corny her line goes or how obviously monotonous the comebacks, she owns that fakeness like no one in the film. Rebel Wilson on the other hand who has also produced the film is as good as it gets when she body shames herself.This is a strong asset, she criticizing her ownself even as an improv but then some little piece of hilarious note like such that goes well among the crowd, is rubbed down until you get tired of it. Over punching those same jokes, in fact an exact replica of a scene is recreated, just to get some cheap laughs. The warmth that Oz's version captured through Michael Caine's eyes is left untouched in here while the other hokums and twists and turns happily reiterated. The Hustle couldn't hustle its way out of its own loopholes and pretentious political correctness, leave the laughs, it couldn't even snatch a nod out of me."}, {"rating": "1", "text": "I can't recommend this movie, but it might be of interest to two different groups of people:1. If you know and love \"Dirty Rotten Scoundrels\", \"The Hustle\" might remind you of what a masterpiece that was.2. If you follow the movie business, you might want to catch \"The Hustle\" to see what gets the green light these days.On a positive note, the score was fine, and it's always great to see those luxurious towns along the Mediterranean. I'm sure everyone worked hard on this project, and I would so like to say that it was fun fun fun, but it just wasn't. Not for me, anyway. Would I have enjoyed it more if I weren't so familiar with DRS? Maybe... but I don't think so."}, {"rating": "1", "text": "What the hell is going on with Anne Hathaway's fake British accent? How did this script get screen lit? Can Rebel Wilson expand past the same shtick she's been using her whole career? HOW did a film come out this year that is worse than \"The Beach Bum\"???? I have so many questions. Seriously, though, I went in with the expectation that this would be a by-the-book comedy about two women ripping off rich guys. And it does attempt to do that....except it failed to make me laugh at all and there are so many cringey bits throughout it that I came out in a WORSE mood than I was in when I started it. How does a comedy do that? Just...\"The Hustle\" is bad. Don't watch it."}, {"rating": "5", "text": "Tiene unos buenos chistes, pero si no la ves no pasa nada, creo es mejor la original de Martin"}, {"rating": "5", "text": "Would have loved to see these two funny actresses in a different movie it was a bit of a let down, I adore Anne Hathaway's work but this certainly wasn't her best work. the humour was a hit or miss and although I had the occasional laugh the humour was more of a miss."}, {"rating": "7", "text": "Light hearted comedy, don't expect too much. It provided a few good laughs and Anne Hathaway will always have my heart from Princess Diaries. Better stoned."}, {"rating": "3", "text": "The Hustle is a twist on the standard grifter storyline that shows off Hathaway and Wilson’s talents with impressions and physical comedy, but it makes mistakes of its own by adhering too closely to tropes about beauty and the female form. It’s dedication to absurdist scenes works in situations where the joke blooms like a rare tropical flower (as with the Lord of the Rings gambit), but rankles with the Blind Person bit that goes on for a shockingly long time without anyone asking if it’s irreverent or just plain dickish. There are no red flags in this review (The Spy Who Dumped Me, I will never forget what you did to me)–you can enjoy the film without reservation.I’ve written in the past about my fascination with the fascination with Anne Hathaway’s hair and her terrific villainy in Ocean’s 8, as well as Rebel Wilson’s moment, so seeing The Hustle was kind of a no brainer. Hathaway’s impressions and accents steal the show for me. Timothy Simons’s (Jonah from Veep) lines in the first five minutes of the movie might be the funniest dialogue that I have heard all year.The Hustle was the first in a long series we’re doing with Friend who likes women-driven comedies and action films starring Jason Statham. We were lucky to have her along because she pointed out that the out-of-nowhere British ladies at the club who come back again later are actually a cameo from a reality television show. It doesn’t make the movie any less random, but you have to give credit where credit is due for a get.Wife had a suggestion for the film that I really liked. She was sort of done with the fact that Rebel Wilson is always cast as the fat, undesirable friend who discovers that the hot guy doesn’t want her. She thinks that struggle, even if it’s showing new representation in film, is still reinforcing toxic ideas about body image. She says a more interesting configuration would have been if Rebel Wilson had been the master hustler teaching a bumbling Anne Hathaway the tricks of the trade. Just a thought."}, {"rating": "5", "text": "Penny is a small-time con artist who traps men into giving her money, whereas Josephine is a sophisticated con artist who cons the world's richest men out of their money, whose idol is the legendary unknown con artist \"Medusa.\" The two con artists meet on their way to the French Riviera for the first time. Not willing to take any chance with any competition, Josephine has Penny arrested, after which Josephine pays her bail and advises Penny to leave the country. Penny discovers that she was conned by Josephine but begs her to teach Penny her ways. Josephine and Penny execute a complicated con act against multiple rich men called the Lord of the Rings, stealing engagement rings. The plan works at the beginning, but after a while, Josephine refuses to pay Penny because she's an apprentice. Penny and Josephine wager Penny's entire net worth of $500,000 using billionaire Thomas Westerburg, the creator of a tech app called YaBurnt, as their victim.Penny initially gains the upper hand by pretending to be blind, something that Thomas could relate to because his grandmother was also blind. Josephine, however, pretends to be a prominent eye doctor to \"treat\" Penny using unorthodox methods as a ruse to get close to Thomas. Penny uses sympathy gained by a few women at the club to ambush Josephine in the bathroom while she spends alone time with Thomas, but she learns that Thomas is not a billionaire and that he intends to use the last amount of money he has for her instead. She tells Josephine that the wager is off, obviously having developed some feelings for him. Josephine changes the wager of stealing Thomas' money to stealing his feelings instead. To hold her up, Josephine tells the women Penny lied about being blind, and they glue her hand to the wall.Josephine later shows up at Thomas' hotel room, attempting to seduce him. Penny breaks free from the wall and learns from a hotel server that Josephine never left his room, which makes her assume that they have had sex. The next morning, Thomas admits to Penny that he paid for her eye care, but he must leave France. Penny gives him $500,000 back via Venmo, and he leaves in a plane. Josephine catches up to her, having admitted that she and Thomas never had sex and that he conned her into investing $500,000 into his company. Penny realizes that she had also been conned by him; Thomas reveals via text that his grandmother was the original Medusa, having inherited her title, though his feelings for Penny were genuine.A fortnight later, Penny is leaving Josephine's residence. Out of sympathy, Josephine gives her the money from their \"Lord of the Rings\" con acts. Their farewell is cut short when Thomas returns while in the middle of a con act against wealthy tourists in which he includes the two women. They reluctantly go along with his act but holds $2,000,000 against him before they trust him. Thomas suggests they work together to make even more money, which Josephine and Penny agree to. They are then shown committing a successful con during Christmas holidays, getting along, with Penny and Thomas resuming their relationship."}, {"rating": "10", "text": "Simplemente es increíble, la mejor película que pude haber visto, no entiendo porque tiene mala calificación cuando es una gran película, tenía mucho tiempo que no me reía así con una película."}, {"rating": "0", "text": "Yeah putrid feminist garbage. Absolute rot. Don't know why anyone thought this was a good idea."}, {"rating": "7", "text": "Esta buena, me hizo reír mucho, tenia mucho que una película no me hacia reír tanto, esta buena, pero no es una película que vería más  de una vez"}], "recommendations": ["arthur", "wanderlust", "the_boss", "dirty_grandpa", "the_dilemma", "tammy", "paul_blart_mall_cop", "trainwreck", "a_million_ways_to_die_in_the_west", "due_date", "hall_pass", "confessions_of_a_shopaholic", "chef", "no_strings_attached", "burn_after_reading", "going_in_style", "good_on_paper", "book_club", "the_change_up", "sisters", "logan_lucky", "thunder_force", "something_borrowed", "last_vegas", "bridesmaids"]}