{"id": 1830, "title": "The Shape of Water", "starring": ["Sally Hawkins", "Doug Jones"], "runtime": 123, "genre": ["Drama", "Fantasy", "Romance"], "description": "An other-worldly story, set against the backdrop of Cold War era America circa 1962, where a mute janitor working at a lab falls in love with an amphibious man being held captive there and devises a plan to help him escape.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/9zfwPffUXpBrEP26yp0q1ckXDcj.jpg", "categories": {"plot": 2.608695652173913, "acting": 2.925925925925926, "ending": 3.1666666666666665, "soundtrack": 4.5, "cinematography": 2.3333333333333335, "familyFriendly": 3.0, "funny": 1.5, "action": 5.0}, "reviews": [{"rating": "2", "text": "Pretentious twaddle. A ridiculously overblown and ultimately empty muddle. Great actors wasted: Michael Shannon reprising Boardwalk Empire and Octavia Spencer in danger of being stuck doing The Help and Hidden Figures for life. Two stars for the design - putting glitter on a tu*d."}, {"rating": "2", "text": "Amélie meets The Beast. It's the La-La Land of 2017: tedious, overrated, bloated, fatuous and cliché-ridden. We've seen this film - done better - before. A waste of good acting talent. Run away."}, {"rating": "0", "text": "I adore fantasy, monster movies, unusual and different stories. I HATED this movie. I created this account to review this movie. In 'Splash' Tom Hanks - your everyman guy gets the stunning mermaid. It's cute, fun and doesn't take itself too seriously. In this film, the ordinary girl gets a slimy cat-eating creature from the Black Lagoon (or rather, he gets her) and it takes itself very seriously in some artsy intensely annoying self-indulgent way which absolutely misses the mark. Guillermo del Toro pounds us over the head with his water theme (we get it already) and creates a female lead without understanding anything about women. She's childlike and annoying as hell, skipping down the corridor like a giddy child, implausibly falling for a monster not long after mopping up blood after he bites off and spits out human fingers (their 'falling in love' montage *could* possibly have been made believable, but absolutely was not), masturbating in the bath every morning (sorry guys - sure women masturbate, but not in the bath to an egg timer - del Toro put this in to heavy-handedly enforce his water theme and that's absolutely how it came across. She can do NOTHING without the help of every male character around her and is quite pathetic when she *could* have had an arc (the shy cleaner falls in love and rises in confidence, orchestrating and pulling off a rescue mission. But oh no, childlike and helpless she achieves nothing and the men around her have to save her mission at every turn). The film plods on forever with a second and third act that left me squirming in my seat and desperate to leave and finally ends anti-climatically and predictably. It didn't surprise me when Guillermo del Toro came out afterwards (this was an industry screening) and talked for 2 hours about his masterpiece and how profound it was, and how he dreamt it up as a child, because every boy without a girlfriend wants to imagine that even if he as an ugly amphibious monster, he could still score sex with a willing female with a size zero figure. Whatever!! It felt like sexist tripe from a self-indulgent man with no clue about women.One of the worst films I have ever seen, made so much worse by how much it takes itself seriously. Classic Emperor's New Clothes situation here."}, {"rating": "1", "text": "DO NOT BE FOOLED. This is a dreadful movie, that you will regret wasting your time on (as I am regretting it right now). I loved \"Pan's Labyrinth\" and I can not believe that the same person directed this delusional self-congratulatory unwatchable mess. In addition to being somehow both irritatingly stupid and seriously boring at same time, other problems with this movie are..., never mind, stupid and boring is enough to describe it, so I will leave it at that."}, {"rating": "1", "text": "This movie was awful. How much did the studios pay the critics on this one. It's an absolute ridiculous BORE. 3 people walked out and i soon followed."}, {"rating": "10", "text": "گیلرمو دل تورو کارگردان توتنمند و عالی این روز های سینما است.او از وقتی که پسر جهنمی رو ساخت مشهور شد و این فیلم رومنس و هیجان انگیز عالی که با بازی عالی مایکل شنون است فیلم شهکاری رو ارائه میدهد."}, {"rating": "2", "text": "This is pretty much every creature movie ever. Misunderstood creature with magical healing powers befriended by a powerless woman who tries to help him escape - has been done much better in Frankenstein, King Kong, ET, etc. In case you didn't get the point, let's make the powerless woman mute and throw in some other powerless outcasts: a gay man (this is the 1960's) and an African-American woman. A cartoonishly bad bad guy - haven't we gotten tired of the evil scientist cliche? - some cartoonish Russians, complete with bungled silly passwords (\"The eagle takes the pigeon for its prey\"), and a creature that looks like a guy in a rubber mask. Lord of the Rings had plenty of guys in rubber masks, but they had actors that could turn them into believably alien creatures. Here it just looks like a guy in a rubber mask. And don't get me started on all the plot absurdities (cleaning women allowed free run of a room with a secret and dangerous creature, for example). With all the hype and awards, I expected much, much more."}, {"rating": "0", "text": "Aside from looking good, this movie feels incomplete, the narratives feel forced and the characters are underdeveloped. So here we are again, yet ANOTHER high profile movie that wants to beat us over the head with self-righteous platitudes about how white men are responsible for all evils. I mean, was there ANY other morale to be taken away from this story? It's a sad, sad day when a great, original filmmaker like GUILLERMO DEL TORO succumbs the current day groupthink that has contaminated and ruined so many movies that have had such great potential. Instead, we get this regurgitation of pop culture, progressive rhetoric designed to brainwash the masses against actually forming opinions based on empirical evidence and independent thought."}, {"rating": "0", "text": "okay first of all i give the point for the visual effect but how the f... you made fast paced movie and boring at same time, the nude scenes was cringey the main character not just mute she is also stupid  this is not just \"fantasy\" its also beyond unrealistic"}, {"rating": "6", "text": "What the hell have I just watched? This movie won 4 Oscars (the best Oscars actually), are you kidding me? Can't say the acting was bad and all, but everything else was **** and not developed enough, even the plot was so predictable from the very beginning. Oscars really have become a one big ****"}, {"rating": "5", "text": "How did this film win the Academy award for best picture? Was it an inside joke by Del Toro; to include every genre he could think of and rip off Jeunet's unmistakable style - just to see if he could get away with it? How old and blind are these voting members? This is the most overrated film since Get Out."}, {"rating": "1", "text": "This movie is seriously overrated.There is no denying the striking visuals. From dingy apartments to dream-like underwater scenes, the cinematography is beautiful.  That gets the movie a 1.Unfortunately, the plot is thin as water and the pace is leaden. The length of the film is twice as long as this short story full of caricatures requires.The movie's biggest flaw is that we are supposed to feel something for the fishman because he is 'intelligent'. Instead he is portrayed as feral with a smaller vocabulary than Koko the gorilla or your family dog... neither one of which should you want to see anyone have sex with.The romance is imaginary and one sided. Towards the end we see Elisa pour her heart out to fishman who doesn't stop eating to even pay attention.This movie is for really lonely women who may find it moving. I found it as romantic as a woman with box of frozen fishsticks and want my two hours back."}, {"rating": "2", "text": "Damaged heroes, cartoon villains: derivative and cliched at every level. Dead last on my Oscar list."}, {"rating": "5", "text": "I really tried to like this movie, but in the end it was in vain. Of course, I'm no expert, but I trust in my good taste in story telling. As some people commented, finding things just for the sake to be original isn't really necessary to effectively tell a good story. This romantic version of \"Free Willy\" is just an example. Just to start, both the protagonist and the sidekick are an utter pain. They barely had any dimension, how are we as spectators supposed to feel invested in their goals like that? How can we root for them? The pacing is awkward and unnecessarily long. A lot of things are just there for plot convenience. Subplots are thrown into the mix only to be forgotten immediately without any consequence. Even with Alexandre Desplat, the music is forgetable. The ending is abrupt and we are left with a lot of stuff still hanging.Of course, there's good stuff in the movie too. The acting was good (although a little unrealistic at times), Octavia's and Michael characters were enjoyable and the main plot (when we got that on screen) was on point and that's why this movie is just average to me. It does really good in one side, but what it does wrong, it does it really wrong (sometimes cringe worthy).If you have an open mind and you just want to watch something without thinking about it too much and just drift with it, go ahead and give it a go. With any luck, you'll enjoy it or even like it. I tried and it was definitely an experience.Not watching it again though."}, {"rating": "5", "text": "A human falls in love with a monster. I guess that can be a good movie if you really need to escape reality, but I just couldn't buy the premise. The sets are really well done, though. It's a professional movie, but the story is just not my thing."}, {"rating": "4", "text": "It's a rare movie, that's why I find it difficult to analyze it. From the technical point of view it is excellent: cinematography, production design, makeup, soundtrack and the atmosphere of the 50's. But as for the script and the performances, I thought it was bad. The script, at first is too slow and takes time to establish the main plot, but at the end (in the last 15 minutes) everything is solved fast and forced. The only act that I came to like was that of Sally Hawkins; Octavia Spencer makes the same character that she always does, nothing special and Richard Jenkins too.Personally I did not like it. I hope he does not take the Oscar for Best Movie."}, {"rating": "3", "text": "Poor script, rubbish plot bad actors and poor acting. Boring, lacklustre, insipid and on and on. I am surprised Mark Kermode liked it. In the same category as Get Out - absolute modern day rubbish.For true cinema lovers, I strongly recommend the following hidden gem: http://www.imdb.com/title/tt0055844/?ref_=nv_sr_1Watch and compare. Taste the difference: https://www.youtube.com/watch?v=Cf5HA6GIJQI"}, {"rating": "6", "text": "It’s beautiful shot and atmospheric fairy tale intended for adults. The problem is that other than explicit scenes of violence and sex everything in this movie from characters to theme development stays on a level of a children’s story."}, {"rating": "4", "text": "Technically competent movie with god tier music and good performances but to me it almost fell apart for one simple reason, I couldn't buy this love story at all. It sounds good on paper, two \"freaks of nature\" falling in love with each other, but its execution is so ridiculously contrived it sucks out all the potential enjoyment. Why such an advanced facility doesn't have cameras in the place it needs them the most? Why simple janitor can on her own easily access classified compartments of said facility and for what reason? Main heroine's motivation is really hard to swallow throughout the whole movie. It seems like it misses a good 20 minute chunk where the bonding between 2 lovers would be properly established.Also on a side note, I understand that it's supposed to be like a fairy tale for adults, or whatever you wanna call it, but the main villain is such a one-note, so cartoonishly evil. Even for this format you gotta have more nuance than that"}, {"rating": "0", "text": "It was horrible.A total waste of money and time.I hated it. It was a struggle to finish watching that awful movie. Seriously, I am not a troll. I never write reviews. But this one was so awful that I had to do it.."}, {"rating": "5", "text": "Great visually and great acting, which is great if you're interested in movie making. The story is a different story. It starts out good, but then gets more and more ridiculous until it gets to the point where I'm saying, \"Seriously?\""}, {"rating": "5", "text": "Nobody who lives in a second floor apartment building would intentionally flood their building with a room full of water.  You cannot fill a bathroom entirely with water by sticking a towel under the door.  When the creature eats her cat alive she is not even emotional when told.  She doesn't seem to care.  Nobody would have the kind of access she had to a top secret room where they kept the creature like she did.  There were so many unbelievable moments to this film I was just rolling my eyes most of the time.  I just couldn't let my common sense go and get into the love story.  Disappointing."}, {"rating": "6", "text": "I found the movie to be interesting - with some memorable scenes and visuals.However it didn't really work for me - didn't hit me emotionally at all.My expectations were probably set too high - knowing that it was highly rated and won an Oscar."}, {"rating": "3", "text": "Elisa have sex with a fish.She has sex with a fish. That's disgusting. That overshadows everything else. Disgusting and gross."}, {"rating": "6", "text": "It is a nice movie technically, the intensity of the scenes and the performances of the cast are what kept me in the movie until the end. Octavia Spencer and Richard Jenkins were great and Michael Shannon was fantastic. But there one major flaw for me personally that made me enjoy the movie way less... I did not believe in their love, The main character and the humanoid amphibians loved is basically just based in their difficulty in communication, because that what they showed us, so it seems really shallow, so i think that took the magic of what could have been a fantastic movie."}, {"rating": "0", "text": "Biggest disappointment of the oscar season, by far!  Del Toro is truly becoming lamestream/mainstream like other directors have o'er the years, take the money and run.Doug Jones just playing the same typecasted character and one of the worst Michael Shannon films to date.  Too bad, since Hellboy and Pan's Labyrinth had plots and storylines that were original, and used WWII historical references that were involving and meaningful.  These cold war references weren't even utilized well, although it is a style vs. substance film that critics often fawn over, or are obviously being bribed for.  And, for icing on this crap cake (have to call a spade a spade here and just like I see it and have seen the film), Richard Jenkins---another incredible actor--delivers one of the worst lines I've ever heard.  \"I wish I would've f###ked more in my earlier life.\"  Oh please, in America, the land of sexual harassment and Tronald Dump we don't need that also.  Another flippant sexual reference in a film about love and depth that really wasn't that at all, enough!! \"I Tonya\" and \"3 billboards...\" made their grades and thensome, but this film overhyped as hell...."}, {"rating": "6", "text": "I read this movie will be up for the 2nd highest number of awards at the oscars. What this tells me is there were few films to compete last year. Although this film had some above average attributes I have a very hard time placing it in such high esteem. Yes it was well done but a far cry from previous oscar winners. Sorry critics ... the user composite score is much more in line than your ratings"}, {"rating": "1", "text": "This movie was awful. How much did the studios pay the critics on this one. It's an absolute ridiculous BORE. 3 people walked out and i soon followed."}, {"rating": "4", "text": "I'm sorry but this movie is just not as good as people would make it out to be. There were some good parts but overall I'd say it's too stupid, unrealistic, and just overall bad. I could already tell what was going to happen at the end before the movie hit the halfway mark. The actors, while skilled, were held back the the horrendous script that was completely irrational. Maybe I just don't get it or something, but it seems like it's trying too hard. I think it deserves a four. I would definitely not see it again."}, {"rating": "4", "text": "Probably one of the most boring movies I've ever seen. It's impossible to make a bathroom into a pool with sticking a towel under the door."}, {"rating": "1", "text": "I was bored out of my mind, unimpressed by lackluster visuals and incredibly repetitive scenes. But most of all I felt no \"magic\" at all, which was supposed to be the whole point of the movie. The gigantic plot holes (how can a cleaning lady access the most prized asset of a top secret facility at will, by just opening the door?), the cliché characters (the bad general, the helping friend, ...), and the overall uninteresting story made sure that any ounce of poetry was nipped in the bud as soon as it peeked.How this movie gathered more awards than the master piece that was Dunkirk is beyond me. Surely the professional critics know something I don't. Or do they? Maybe they just have a tendency to get overly excited as soon as anything original pops up, because they're so tired (aren't we all) of seeing the same things over and over again."}, {"rating": "0", "text": "What an awful movie! Predictable, boring, with unrealistic under developed characters."}, {"rating": "5", "text": "Lovely at times, and breathtakingly beautiful throughout, but very uneven in pacing and direction. I wanted it to be so much scarier in the scary parts, so much more romantic in the tender moments. Sally Hawkins is very, very good, and Michael Shannon is fabulously menacing. I wanted more from the score too, as Alexandre Desplat usually creates more memorable music than this. Just one opinion, and I am definitely a del Toro fan, but I enjoyed Devils Backbone and Pans Labyrinth much more than this film."}, {"rating": "3", "text": "I don't usually write movie reviews, but I was 'inspired' to do so because of how disappointed I was by this movie. It's not that it's bad -- it's OK, in my opinion -- but for the life of me, I cannot understand why it was nominated for a best picture Oscar (which was the whole reason I saw it in the first place -- damn you, Oscars!).I'm not really familiar with the director's other films, but based on what I read about them, I was expecting something dark, quirky and mysterious. For me, this movie was none of those things. It was bland and predictable (overall). I mean, there were some nice moments (yeah, I laughed at a few of those jokes and felt sorry for the water-man) and some solid 'mise-en-scène' elements (as we used to say in film class). But I found the story to be somewhat simplistic and childlike, which -- in my opinion -- lead directly to the entirely predictable and 'perfect' ending. (Or perhaps the director was going for a childlike fairy-tale type story? Possible, but there's a lot of 'reality' in there too [i.e., graphic sex & violence], so difficult to make that case). Also -- as some other viewers may have noticed -- the tone of the movie seems off in some parts. Like the people in the audience cracked up sometimes when it seemed to be a serious moment, which was confusing. (I should also add that I laughed out loud on three separate occasions during the movie, while some in the audience did so about 10 more times than that, further adding to my confusion.) To be honest, the story seemed to drag through much of the film. Like, it was interesting and I didn't mind watching it (although I did check my watch a couple times), but I wasn't exactly on the edge of my seat or running as fast as I could back from the bathroom, if you know what I mean.  Which brings me back to the beginning of this. Why is this movie being touted as the front runner for the best picture Oscar?! Mysterious indeed. I mean I could see this coming on TV in a few years and someone thinking, 'Wow, weird flick about a woman falling in love with a fish-man, but I've got some other things to do' -- CLICK. I've seen Lady Bird, Phantom Thread, The Florida Project and Darkest Hour recently, and I can understand why they've been nominated for various awards, but I'm having some trouble wrapping my head around this one ... oh well, I guess differences of opinion make the world go round."}, {"rating": "3", "text": "To be honest, the whole premise of a love story between a woman and some weird merman seemed unattractive to me to begin with, but the Oscars did their advertising job in the end. And my intuition did not fail, Shape of Water is boring, weird, and overly-sweet all at the same time.To start with the good things - visually it's well-filmed and the 60's are stylishly presented. It's nothing ground-breaking, but overall solid. The second good aspect are the actors, everyone plays their roles convincingly. I would point out Michael Shannon in particular, he proved that he can be a great antagonist before, and he's done it again, I was actually rooting for his character throughout.However, the story is a dull bizarre mess. To begin with, it is overwhelmingly unoriginal - the sheepish sugar-sweet lonely protagonist, the captive creature that is tortured instead of being communicated with, the army man antagonist. The movie is just a drag, and everything is as predictable as it can be.Now I can buy the ancient overused trope about the protagonist empathizing to some captive intelligent creature, but explicitly having sex with it? And yeah, there's actually plenty of unnecessary nudity (Shannon shags his wife. Ok.) and allusions to the creature's penis. Well, whatever gets you that Oscar, I guess. I mean I'm no prune, but in my opinion nudity is justified when it helps to convey some point and flesh out the story. But this, this just looks like Del Toro's sick creepy sexual fantasies brought to life. Sorry, but my suspension of disbelief just doesn't cover the \"woman gets turned on by slippery scaly aquatic monster\" thing. What's your next move, Del Toro, a movie about furries?To add to that, there's an absolutely redundant meaningless side plot about a gay old man failing to hook up with another guy, and couple of scenes dedicated to showing that Shannon's character has a sexual fetish for silence. That's when you thought this movie couldn' get any more creepy.And since we're at it, I would really question how realistic it is that some random cleaners are allowed access to classified assets in a top-secret research facility. There's also an uncomfortably stereotypical black woman who overcompensates for the muteness of the main character, never managing to finally shut the hell up. Also at one point the movie has a musical number in it, like in some Disney flick. That was also the moment when my facepalm intensity peaked. Yeah, and isn't this merman's design very reminiscent of some sidekick of Hellboy in Del Toro's own movie? Pathetic.So, as they say, best movie my ass. I've recently also watched \"Three Billboards...\", and it's miles ahead than this trash."}, {"rating": "1", "text": "So creepy and weird. Very contrived and unrealistic in so many ways, even if you try your best to suspend your disbelief. Gratuitous unnecessary nudity that is off-putting. Hard to believe that this movie won an Oscar."}, {"rating": "3", "text": "This movie has a magical opening that made me want to believe in it so much but then it constantly assaults us with ridiculous plot twists and characterizations that I just couldn't relate to or believe, mo matter how much I wanted to. This is not a Best Picture, not even close. No wonder more and more people are panning the Academy Awards each year."}, {"rating": "10", "text": "Atemporal, não encontro palavras para descrever essa obra prima, estou emocionando, lindo, poético, verdadeiro, único, 13 indicações ao Oscar é o bastante para descrever? não é, vejo filmes como Lady Bird, ou ate mesmo Call Me by your Name com notas acima de 90 que não da a metade da qualidade de shape of water. apenas por ser dirigido por um Mexicano."}, {"rating": "4", "text": "Liking this film depends on your ability to 'hear' the love story at its center.  I didn't.  If the artistry of the visuals was complemented by a better story and supporting cast it would have been better."}, {"rating": "3", "text": "As a massive fan of Guillermo Del Toro, I was eagerly looking forward to seeing another of his magical yet unusual creations with great characters and compelling story but that was not what I found.From the unnecessary opening to the bizarre and out of place scenes, this movie felt like Del Toro just went with every first idea that came to his head and didn't think of where it would lead. Each scene was disjointed and the characters were not compelling in the slightest, I have never left the cinema so speechless in trying to describe what I had just witnessed."}, {"rating": "1", "text": "What a mess--slow moving, poor dialogue, dreadful editing. The story has been told before and trying to cobble together 60's America, dancing with the Beast, racism, love, hackneyed politics (Russians so stereotypical it's laughable), etc.,etc. into one movie just doesnt work.  Jenkins, a marvelous actor, says his lines without being there.  The villian is at least a villian.  The mute, well, gee, she doesnt talk.  That leaves little else and the 60's aura and cool special effects don't save this rambling mess."}, {"rating": "0", "text": "I am not mute like the main character, but after watching this film a few minutes, I wished I would be blind and deaf. The main protagonist works as a cleaner and her daily schedule is to eat something, then masturbate in the bathtube. After that she is going to work. There is a non specified fishman, both fall in \"love\" with each other. In her own words: \"because he is like me\". Yeah, handicapped and mentally retarded. That is the true definition of love in this movie. I give him eggs and later I spread my legs. So instead of masturbating, she uses her fishman as a lover. They don't have any topics to talk about, since they can't talk. lol. So there is not a big deal of a consitent story here. The fishman eats the head of the cat of the gay \"friend\" of the mute retard,but he quotes: \"Well, he is like he is. It's not his fault.\" Cool comment, bra!  This film is just rubbish, don't waste your time and money on this pervert, mad film. You'll find a lot of good movies about love......elsewhere"}, {"rating": "0", "text": "liberal garbage. The cast is a Democratic party coalition-of-the-fringes against a generic evil white man. Generic evil white man prevents alien \"other\" from screwing a white woman. Democratic party coalition-of-the-fringes gangs up on evil white man to save the day for miscegenation. That is literally what this movie is about, pure political propaganda."}, {"rating": "6", "text": "Sometimes they just try too hard to be original. This is one of those times. The story makes no sense. Even fairy-tales must have plausibility. I wanted to like \"The Shape of Water\". But in the end, it was just another example of Hollywood types letting their imagination get out of hand."}, {"rating": "0", "text": "It would have been a pretty good movie if it didn't have any of the following.- Showing the naked body in a bath scene is always unnecessary. We all have an imagination and I would rather use mine. -I don't think it's at all interesting or necessary to show someone masturbating. If they had left that out, the whole love scene with the creature would have been less gross and disgusting. And more innocent and beautiful. This backfired of them. - The animal cruelty. I cannot believe that they got away with having the creature eat the cat. And that they showed the cat's half eaten body. This was just wrong. Why couldn't they have stopped the creature before the cat got attacked?? Once again cruelty and images that were simply UNNECESSARY. - The way the sex scene with the security guy and his wife was filmed was also just really pointless. They couldn't have been under the blanket? Come on!It's always sad to see how all of the things that made the movie rated R, also ruined the whole experience. Because of the things I mentioned above, the movie lost its beauty. Nothing was even as funny as it could have been. I was just waiting for the movie to be over so I could find out how it ends. But it was NOT worth it."}, {"rating": "1", "text": "I experienced this film as a tedious, plodding, infuriating endurance course of \"lush visuals\" and precious whimsy. The critics suckered me into seeing \"Pan's Labyrinth,\" and as with that movie, \"The Shape of Water\" is blunt in its insistence that tinkly fantasy interspersed with jarring scenes of gore is refreshing and significant.No spoilers here, but it wouldn't matter; there are no surprises. I won't fault a film for lack of originality if it's otherwise rewarding to watch. This was not. By the predictable end, contrivances and pacing had worn away whatever sympathy I'd felt obliged as an audience member to try to feel for the characters.I made the mistake of reading reviews, hoping to find some insight into why movies like these are so celebrated critically. But professional critics, in real publications, seem unable to write positively of these sorts of movies in anything other than a prose matching the grandeur of the \"lush visuals\" therein. It's as though a sea creature's spiny appendage pierced through their skulls and deposited a sense not only of the film's significance, but of their own.I'd give it a zero, but some acknowledgement will go to the effort put into the stagnant, boring visual compositions that critics love (and which I don't care about, but take skill to achieve, I would assume), and to the actors for keeping a straight face."}, {"rating": "0", "text": "The worst movie I have seen in years. Incredibly predictable, boring and filled with plotholes. Shallow characters and rushed pacing with cringy dialogue. Did not care about the fish-dude at all. I felt like they didn't even try to make it relatable in any way. There was nothing even shown from his perspective. The movie is also extremely saturated with political and liberal propaganda in the most blatant way possible. Its not even trying to be subtle or clever about it. Its like they had a checklist while writing the script. \"First of all, lets bash Christian values every chance we get. Lets make the \"villains\" quote the Bible cus that's edgy right? Also lets clearly show that bible-movies suck with empty theaters showing them.. (whut why?) Moving on: Lets have the girl masturbate a couple of time on screen cus its also super edgy. Make sure the nipples are on screen: Check. We need some unnecessary sex scenes ofc here and there: Check. Oh, we can not forget the obligatory gay-character with a tragic story: check. While at it, lets have some racial themes mixed in too. Make sure we have the stereotypical sassy black-woman act going on. And finally to top it off, we need to have FISHSEX. Oh yeah baby, they are gonna love it. Bestiality, hell yeah right? They are gonna eat it up and win us the Oscar.\" I want my 2 hours back please. I don't even care that much about the propaganda, but this movie just sucked so hard I cant believe I watched it all the way till the end. And nudity? Sure whatever, if it fits with the context no problem. Might even make the movie better. Here it's totally unnecessary and just feels weird. I have lost all respect for Del Toro with this crap. He is the most overrated director of our time. This movie should have bombed so hard. Can't believe how brainwashed critics are these days."}, {"rating": "6", "text": "Oppressively dark with lots of sex-stuff, Guillermo really put the \"adult\" in adult fairy tale on this one."}, {"rating": "3", "text": "This movie is a beautiful paradox --- a wolf in sheep's clothing.I adore Guillermo del Toro's work, but it appears in this case as he is writer/story creator/director, that his angers have melted his own fabric.Parts of this movie are really mind-blowingly beautiful ---The intro (wow what imagery!!!) whether-or-not you think it works, the lady's complexity, her buddy, and the monster's skin and movements ( and breathing in that suit... which doesn't look like a suit to me ), the art throughout the movie in drawings // cinematography // set dressing  ...  leaves me breathless, the acting and care to echo the look of the original monster...  Or to be more exact:  Doug Jones acting as the monster, Sally Hawkins soulful mute, Octavia Spencer's perfectly timed humor, Michael Stuhlbarg's subtle inner conflictions ... Richard Jenkins, well, I just love watching his acting ......  the love.  Two people - beings - getting together because they get each other.BUT :  and it's a big but  :[ spoiler alert ]Del Toro writes-in such a livid attack on America ( the US ) and the American Military, along with questionable points of view -- RE: the sex scenes on mental desire for rape (and actual minutes of burning film with its play-reenactment), and through-out the film specifically outlining the American military and all white Americans as cruel, unjust, and selfish, to the tenth power/squared/cubed... !!!!!!Yes - there was sexism, racism, and a whole bunch of bad stuff  ( mafia... ) -  there still is in this world.Google \"racism in Mexico\".  Try \"white Irish treated as apes in America 1800s\".Even Malcolm X noted racism is the black-white issue in the US - but religion was the culprit of overseas (reference Alex Haley's \"Malcolm X\").But it was highlighted as the *only* way of life for these 2-3 people - it was the gay man, the mute girl, and the black community, against the selfish white American Military and ignorant white American store keeper.This is a fable, \"the creature from the black lagoon\" -- not : the creature vs selfish white United States.It just slowly twists and twists that point --- and leaves me with a what-the-heck-is-this-film-about bad taste after viewing.So gorgeous -- and so ....  eeeech  ....Ummmm.... what does that have to do with the creature from the lagoon?And okay -- you want to deal with the racism at the time -- show it in all its colors (pun intended) : the Irish being treated as apes and not given jobs, the \"whites\" who did stand up for equality and weren't gay or mute, the Military people that fought for our country to be what it is:  free, so we can then duke out the further freedoms of the present day for women's rights, men's rights, animal/land/building rights and you name it....HE is allowed to do films here -- because it's America !!!Del Toro has a lot of anger spatting out in this film, in one sided ways.I wish there were ways to click and say \"here here!!\" to Rex Reed's review...  I saw the movie and a dear friend and I can totally understand what he is talking about.  Unfortunately he might be so overwhelmed with its problems (been there myself if that is the case) that some points which make this movie a miss are not noted as well as some points which make it a win, perhaps under Reed's shock and questioning of how so many adore.I can see why people love this -- what a gorgeous film...  What a beautiful joining and complexity of mutual love.But a political hatred spews forth..  the wolf in sheep's clothing, melting a gem."}, {"rating": "3", "text": "This film is the standard bearer for inaccurate movie reviews. The artsy crafty Harvard Square crowd rate it 80-85 or 90 approval rating. Its the type of film making they dissected in college. As for the real world, it sucks ! Let me make a profitable movie. I'll start with a plain looking mute who supports herself scrubbing floors. Although she frequently masterbates, she has a heart of gold. She feels badly for a Black Lagoon look a like who is being held captive by the U.S. military. She arranges for the creature to escape. I could go on but its rubbish. If you want to drop $8-12 dollars and pretend you are an intellectual, go for it . Another choice is take that $$$ , but yourself a sub sandwich and watch the Breaking Bad marathon on AMC"}], "recommendations": ["sanctum", "swiss_army_man", "children_of_men", "the_counselor", "shadow_in_the_cloud", "the_lobster", "fifty_shades_darker", "fifty_shades_of_grey", "fifty_shades_freed", "the_wolf_of_wall_street", "the_power_of_the_dog", "colossal", "noah", "bird_box", "vivarium", "slumdog_millionaire", "district_9", "the_twilight_saga_breaking_dawn_part_1", "knock_at_the_cabin", "the_grey", "splice", "code_8", "wonder_woman_1984", "the_old_guard", "midsommar"]}