{
  "id": 3324,
  "title": "The Gods Must Be Crazy",
  "starring": [
    "Marius Weyers",
    "Sandra Prinsloo"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "A Coca-Cola bottle dropped from an airplane raises havoc among a normally peaceful tribe of African bushmen who believe it to be a utensil of the gods.",
  "releaseYear": "1980",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/IgBfj5LfT7nwpodCZ34QCHp17x.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Is it a documentary? Is it a parody? No it is Coco cola.The Gods Must Be CrazyJamie Uys is not particularly a good filmmaker. And he is directing, editing (we'll get back to this later), producing and writing. But somewhere in between these lines, he makes an amusing storyteller. His film isn't pitch perfect. It has the capacity to. It is the Airplane of the spoof movies. If you're going to make a parody you have to go all in. And considering the fact that it can arguably said that it is derived from a documentary style. It would have easily gone far beyond Airplane. It could ground the audience, if necessary. And also it has an incredibly loving, generous, hardworking and more importantly innocent character on lead.And his nemesis is an empty glass bottle of \"coke\". This unawareness. The innocence that it digs up while exploring that track of the storyline. I think it was misjudged a lot. If the makers had used this innocence, even if with manipulative nature, it would tear up any hard hearted being. But the film wishes to explore a silly love story. Which too works. Its goofiness is the real treat and not the elaborate setting of the jokes that breathes misunderstood chaos.And I would draw back to that alienated character- from the world the story is in contrast to- whose equation with every single character is flattering to you. Even his learning ability, he drives good both ways. Good enough to have a successful chase scene. Speaking of chase scene or cars or any wider shot for that matter, the editing is really unearthly. To shorten the runtime of The Gods Must Be Crazy the makers fast forwards the mundane activity instead of editing it out. And what's baffling is that, I think it is a joke played on us, for by the end of the film we play along to all such debaucheries."
    }
  ]
}