{
  "id": 1524,
  "title": "The Last Boy Scout",
  "starring": [
    "Bruce Willis",
    "Damon Wayans"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "When the girl that detective Joe Hallenback is protecting gets murdered, the boyfriend of the murdered girl attempts to investigate and solve the case. What they discover is that there is deep seated corruption going on between a crooked politician and the owner of a pro football team.",
  "releaseYear": "1991",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nKTqyWwLxkvoEKkSAGWo1GdiTpb.jpg",
  "categories": {
    "plot": 8.2,
    "acting": 10.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "10",
      "text": "Tony Scott's The Last Boyscout which was made in 1991 is an action movie that kind of rips off the Lethal Weapon ideas to a degree and Tango & Cash because there's nothing new here... The Last Boyscout however works because of the humour and stupidity, I like when Damon Wayans' character in the movie says to Bruce Willis ya fkn car sucks! Full of bad language, shootings, chases, possibly explosions and basic violence and action I'd say it delivers."
    },
    {
      "rating": "8",
      "text": "As much as I love Die Hard, I'm going to just tell you the details about The Last Boy Scout. This movie is very similar to Lethal Weapon and I can't believe that I haven't been reviewing all Lethal Weapon films. Including the scene where Darian, Joe's daughter watching it. While I was thinking about this recently I watched the opening credits from this and the guy who wrote the story and screenplay is Shane Black. He just wrote the screenplay for the Lethal Weapon films and now The Last Boy Scout. That is why the story is done twice. Why didn't I think of this before? What really surprised me is that it bombed at the box office which was crazy and aside from that I'm surprised that it had a cult following. So it's directed by Tony Scott and all I can see is the same location as Beverly Hill Cop and Beverly Hills Cop 2. The action scenes are awesome as usually like the ending where Joe and Jimmy heading to the football stadium to take down Marcone and Milo before they take down the president. This movie is awesome, well, not as good as the Lethal Weapon films and the Die Hard films which stars Bruce Willis but it's still awesome. So this buddy cop action flick will make you dance a jig and have Friday night's a great night for football."
    },
    {
      "rating": "7",
      "text": "Die hard with a sports theme but that's not a bad thing.  Bruce Willis is the quintessential 90s action anti-hero."
    },
    {
      "rating": "8",
      "text": "Bruce Willis at his best.  The plot had a few holes in it but so what?  It's an action movie so you get your money's worth."
    }
  ]
}