{"id": 878, "title": "The Angry Birds Movie 2", "starring": ["Jason Sudeikis", "Josh Gad"], "runtime": 97, "genre": ["Animation", "Comedy", "Adventure", "Family"], "description": "Red, Chuck, Bomb and the rest of their feathered friends are surprised when a green pig suggests that they put aside their differences and unite to fight a common threat. Aggressive birds from an island covered in ice are planning to use an elaborate weapon to destroy the fowl and swine.", "releaseYear": "2019", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/ebe8hJRCwdflNQbUjRrfmqtUiNi.jpg", "categories": {"plot": 4.642857142857143, "acting": 5.6, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.75, "funny": 5.9411764705882355, "action": 5.0}, "reviews": [{"rating": "4", "text": "Well, well, well, The Angry Birds Movie 2 is surprisingly a tolerable follow-up from the insufferable Angry Birds, even if it still follows old plot formulas.Like the first movie, greater time goes into developing the pop culture references than the conflict, which includes lines about a duck-face selfie, Snapchat filters, “steps” getting in, a pig drinking from a Starbucks cup, and even a sound effect from Who Wants to Be a Millionaire to make it sound more dated—not to mention a bunch of guards at a government facility break dance like they were Happy Feet extras rejected at casting call. Just a reminder that these pop culture jokes are all done by islanders who otherwise wouldn’t be familiar with any of these things. Alongside forced fads are apparently mandatory scenes that copy what other kids’ movie do, particularly the “This whole thing is my fault” line. Listen: copying others never works out! It’s important to stand out from the crowd to leave an impression, and not jump on a bandwagon to be just more white noise.The lack of originality doesn’t exploit the new love interest for Red, that being Chuck’s sister, Silver. Yes, apparently all blockbusters require a love interest to be better. Silver does love mathematics, except this low amount of personality isn’t enough to make something of the romance, especially since most of their interactions have them lying on top of each other, to give the wrong idea for onlookers. It’s much like when Fiona tries to pull an arrow out from Shrek’s butt, until Donkey sees her on his back, then says slyly, “Look, if you wanted to be alone, all you had to do was ask, okay?”On the light side, Red is a better developed character now with a transparent fear of being left out; the feelings get stronger once he is seen respected as hero of Bird Island, only to be a nobody again once a truce between the pigs and birds is established. Now, Red falls into depression, left eating popcorn while on the floor, then his chance of purpose finally comes when he unites with the pig king Leonard to form a team set on stopping their lands from destruction by Eagle Island.This Eagle Island of course is inhabited by eagles, but their home suffers from sub-zero conditions that freezes their entire livelihood. A montage shows the mundane activities on Eagle Island that are impossible to happen due to ice, including showering, swimming, or eating fish, but it doesn’t work because the cartoon vs. photorealism animation style isn’t consistent enough, attempting to merge the exact shapes of little kid doodles with what can be felt by touch. The animation is so inconsistent in fact, that in one scene, Red wears a snow cap that gets blown away by the wind, then it’s back again minutes later. The poor use of computer technology is not the only complaint to address about Eagle Island, in fact, there are countless more about its backstory… how did their home reach sub-zero conditions? Morgan Freeman, please offer your narration to help provide answers! A voiceover would really be nice here, because the characters all talk too fast to understand their explanations of the plot.Instead of making sense, this sequel focuses on one new addition to the world that helps the most in improving the series: three baby hatchlings. These little fluff-balls seem to be inspired by Looney Toons in the adventures they go on to return some eggs that they lost at sea. The main plot switches back-and-forth between these little guys, leaving on appropriate cliff hangers, and picks up again from where left off before. These scenes take up a significant amount of screen time, representing both the biggest strength and greatest flaw of the feature. It’s great because these scenes are actually funny in their gags with relatively little dialogue, but poor because these fun antics prove little focus on the story; besides one tiny contribution the hatchling trio make in the climax, they could be written out super easily without hurting anything. While they can get a good chuckle, for each good comedic line, there’s three more that don’t work (that bothersome mime from the first movie is still here unfortunately).There’s something worse at stake with the prioritization of jokes over story, it proves that The Angry Birds Movie 2 encourages individualism through the selfish, foolish actions of Red’s team. Instead of encouraging friendship, it popularizes the term “frenemies,” and since this movie and the last can’t remain consistent in forming common sense in their worlds, it numbs a child’s brains more as they take in whatever messages the TV tells them. Really—they notice pig rumps more than story. Heck, a line in here shouts, “None of us wear pants!” Imagine kids repeating that around the house!"}, {"rating": "7", "text": "Better Than 1The Angry Birds Movie 2 isn’t flawless, But it is definitely a step up from it's mediocre predecessor."}, {"rating": "10", "text": "I love this movie, this is just like a compilation of my favorite song in a single movie"}, {"rating": "5", "text": "Angry Birds 2 feels more or less the cinematic equivalent of a Creeper hanging onto a rope or something.He's at the end of an Action Scene. No arms,no legs,just his head,hanging (and \"chewing\") on a rope as the tension-y end that feels like it'll end on a pretty good note,but that,through little flaws that outweigh the good stuff,feels like an uncertain possibility. Yeah,there are surprises here and there,but,overall,is just a weird product that doesn't end well.But hey,at least there was a story in the middle of it.First off,I love that this is,first and foremost,a character movie (unlike the first one,where it didn't know where to go with the lead),as it tackles a certain element that I don't see often in Superhero Movies post-Origin: Will the Hero be loved by many for ages? Is he always going to be the standout for many and not be taken instantly as a menace?Also please,keep doing these movies. If anything,they'll be the only good musical work by Heitor Pereira. Only this time,he tackles the John Powell,where he repeats certain themes in different ways,and it's always enjoyable to listen to.The humor is either great humor or a masterclass in horrible writing. Sometimes you have the kind of poop joke I'd love to see more (or an Invisible Spray lasting forever),while other times it's a painfully unfunny Baby Shark joke that pissed me off more than the dab joke they did at the beginning. That was where the movie lost me. Or it was the Snapchat joke,I don't know…Now hear me out on this one,but am I the Only one who noticed a kinda big downgrade in the Animation Department? Not that everything looked bad,but now Sony Pictures Animation takes the helm instead of Rovio,and apparently everything felt so...rocky. Especially compared to the laser-focused animation of the first movie,where it was random movements,or whatever they showed us with Spider-Man Into The Spider-Verse,where they can still animate characters in perfect ways. And the pacing was just as fast as something like The LEGO Batman Movie,where you had to make heads or tails about what was going on in case you didn't follow. Although it definitely made for a quick seat. A good example of that would be the beginning,where they hammer in hardcore several plot points because...idk,the director was afraid you'd not instantly care for Red?Overall it was the sunrise movie of 2019 alright,but at the same time I still think IT was a better surprise,especially considering that this had the familiar tropes of a kids flick. One that I have to ask. You a good Animated Movie? Or a miserable Kids Movie? Make or break,Sony,c'mon."}, {"rating": "5", "text": "I was hoping for this to suck but I'm so shocked it actually didn't.I mean, there's nothing memorable in it but it could've been much worse.It's better than the first one without a doubt. Not by much but considering what they were based on that says a lot."}, {"rating": "7", "text": "Bem legal e divertido, mais poderiam ter feitos piadas melhores mas vale a pena sim"}, {"rating": "7", "text": "Fun film, certainly an improvement over the original film. Animation is nice and some good jokes in it for adults."}, {"rating": "3", "text": "\"If you've seen the trailer you've seen all the best parts.\" More of the same from the first and full of predictable movie cliches. Your kids will like/love it and you'll wish your kids had better taste in movies. D+"}, {"rating": "7", "text": "Angry birds 2 la sorpresa del año no esperaba nada y me dieron una entretenida película"}, {"rating": "7", "text": "Nice addition to the first movie - good humour and animation"}, {"rating": "10", "text": "Actually better than the first one! It's funny Great animation and fun to watch The beginning is a little crazy but 20 minutes into the movie it gets better!"}, {"rating": "10", "text": "I really liked the first one but I loved this one so much. This is my 2nd favorite video game adaptation, one of my top 5 favorite animated movies of 2019, one of my favorite movies of 2019, one of my animated movies, and one of my favorite movies of all time. The writing was phenomenal and hilarious. The story was excellent. The animation was stupendous. The voice over performances were outstanding especially from Danny McBride, Leslie Jones, Josh Gad, Bill Hader, Jason Sudeikis, Rachel Bloom, Sterling K. Brown, Peter Dinklage, Brooklyn Prince, Awkwafina, Nicki Minaj, Tiffany Haddish, Alma Varsano, Faith Urban, Sunday Urban, and Eugenio Derbez. The Angry Birds Movie 2 was a A+ movie."}, {"rating": "7", "text": "it looks like video game-based movies are finally starting to get interesting."}, {"rating": "10", "text": "This is a very good film telling teenage as well as adult problems, quality and thoughtful jokes, with a double meaning, so to speak.  the film is very good I recommend it to everyone.Это очень хороший фильм рассказывающий подростковые, а также взрослые проблеммы, шутки качественные и продуманные, с двойным смыслом так сказать. фильм очень хороший всем рекомендую."}, {"rating": "6", "text": "There are seemingly two major kinds of animated movies; those that are concerned with telling a good story, and those that just want to make people laugh at ridiculous humor. Angry Birds 2 is most definitely the latter. In fact, it's so light on plot that they had to splice in cutaways to what is essentially an animated short in order to reach feature length.The majority of the returning side-characters are given so little to do that the only reason I can think of as to why they were brought back is because they had significant roles in the first one, and the new additions, villainous or otherwise, fail to make much of an impression. As a result, Red and his love interest Silver are the only ones who feel important in any way, shape, or form. They're at least given something of an arc to grow and learn from while the rest just act goofy or stupid the entire time.None of this matters too much though as children's films like this tend to live or die by how funny they are, rather than things like the actual quality of the writing. I doubt there's a kid alive that wouldn't find this absolutely hilarious. So it has its target audience in the bag. Adults on the other hand will likely struggle with just how irreverent it all is. For example, during a speed dating event one of the main trio boldly declares to a potential partner that he \"eats dirt.\" He then proceeds to open his mouth and sure enough it's full of dirt. That's a little too dumb for my blood. Plus, for the life of me I'll never understand how men in thongs and just butts in general have become the height of prepubescent comedy. That kind of stuff didn't make me laugh back in the day and it doesn't get to me now.As hit or miss as it may be the older you get, it's still guaranteed to tickle your funny bone at some point or another. That's because Angry Birds 2 covers a wide array of humor in an effort to fill every single second with a joke of some kind. The entire stretch with the eagle disguise is nothing short of pure gold and had me guffawing to the point where I could barely breathe. I also caught myself cracking up every now and then at the occasional clever one-liner or bit of slapstick.A truly great animated film would leave you gawking at the beauty of its animation, rolling on the floor at it's comedy, and pondering over the complexities of its narrative. However, Angry Birds 2 shows that two out of three ain't bad. Particularly as far as the youngsters are concerned. This isn't Pixar so I can't recommend that anyone with a driver's license watch it on their own, but if you get pulled into it for a family movie night or something it is sporadically amusing. There's just not enough here to truly engage you."}, {"rating": "2", "text": "I just hope the movie industry will realize that movies surrounding video games are not a good idea."}, {"rating": "0", "text": "You would expect to watch The Angry Birds Movie 2? I Don't think so. More importantly The Angry Birds Movie 2 was nothing but cringy, lack of Original Angry Birds 2 design and Story, and memes like Baby Shark. It all started by war between Birds and pig, that was original Angry Birds. Until pig giving a Birds a peace. That's why Angry Birds is dead. which matters a fact, Silver is... what the heck is Sony did this to her? It Support to be original, not changing design it like original 2019 version trailer of Sonic The Hedgehog Movie. Another opinion is about Matilda and Terence. My idea for The Angry Birds Movie 2 was Red and Stella want to keep Luca as adopted parents, but Sony stoled my idea and replaced with Terence, Matilda, and Zoe?!? What a lack, you made Bombtilda fans breaking heart into pieces, you know what grind my gears, you Sony, your support to make Offical Redella scene, not Redilver scene, and more immortal you gonna tearing Redella fans' heart into pieces just like Bombtilda fans. And who else think that's worst nightmare? You guess it, Dub, fortnite dance, selfies, and Baby Shark, also the dirty joke was pig wearing underwears. One more thing. Hatching story doing same this as Scrat story from Ice Age Films, and replaced The Blues and Stella as Background Characters? I'm sorry you guys, but you all just being enjoy of Crappy Angry Birds Movie 2. I just want to make a better reboot of Angry Birds Movie for Disney, but they never listen to me or Disney, they didn't want to make it happened, I'm not moving forward for some 2016 trashy-era of Angry Birds. You'll be sorry for this Modern-Trashy AB Fans. And that's my review of The Angry Birds Movie 2. My star: 0"}, {"rating": "7", "text": "Not as good as first one not that much engaging for adults a great thing for childrens for sure some lines in hindi dubbing is cheezy screenplay was awful makes me feel why should i watch but at same time animation is what makes us feel worth watching at last it was an okay movie one time watch!"}, {"rating": "6", "text": "This movie is just fine. There isn’t anything good, but that does not mean that it isn’t entertaining. However, this movie is packed with cringe-worthy moments and it does not know its target audience, because the movie is packed with indirect sex and quite inappropriate jokes with it, yet it is targeted towards kids/preteens. It is trying to say “I have something for everyone!” while just leaving you confused while trying to make a critical look. The animation is spot on tho. Overall, if you plan to see this movie, don’t expect anything mind-blowing."}, {"rating": "7", "text": "To me liked the 2 part, unlike the first. Zeta seemed pretty to me, even though she is an antagonist and very overplay the role of the villain. But still, the cartoon left me a pleasant aftertaste and was pleased with the sequel, unlike the prequel."}, {"rating": "8", "text": "I loved it! Definitely one of the top movies of 2019. Some of the jokes are more geared toward adults and that’s what pulled me into it. The animations are great and the story is solid. I definitely plan on watching this movie again!"}, {"rating": "7", "text": "Es una ligera mejora con respecto a su predecesora; la trama es entretenida y los personajes son divertidos; la recomiendo."}, {"rating": "6", "text": "Фильм не понравился. Не знаю почему, но он скучный по сравнении с первым фильмом."}, {"rating": "7", "text": "It wasn't that necessary of a sequel but I personally enjoyed this movie. It was an improvement to the first movie, and it's way better than the first. The first Angry Birds Movie wasn't bad, it's just fine, but this is about the sequel. I enjoyed it. The humor is less annoying, colorful animation and some moments you can enjoy as a kid. There's some scenes I hate like the Baby Shark scene and The  Opera scene but I personally enjoyed it."}, {"rating": "6", "text": "I didn't like this one as much as the first one. Hear me out. I know the target audience isn't alone above maybe 10 years old. But the first movie was definitely easier to swallow for anyone above 15. I liked some moments, but the entire sidequest of the little birds was not necessary to the main plot. Plus if they got the skin from that snake, they straight killed that snake."}, {"rating": "10", "text": "Wow. This is honestly the best movie I've watched in 2021 so far. Waiting for the sequel."}], "recommendations": ["the_angry_birds_movie", "cloudy_with_a_chance_of_meatballs", "cloudy_with_a_chance_of_meatballs_2", "penguins_of_madagascar", "the_smurfs", "ice_age_the_meltdown", "free_birds", "astro_boy", "my_little_pony_equestria_girls_forgotten_friendship", "turbo", "the_lego_movie", "despicable_me_3", "minions", "the_lego_movie_2_the_second_part", "happy_feet", "chicken_little", "shark_tale", "ice_age_dawn_of_the_dinosaurs", "incredibles_2", "the_spongebob_movie_sponge_out_of_water", "g_force", "hotel_transylvania_2", "antz", "hotel_transylvania", "the_croods_a_new_age"]}