{"id": 519, "title": "The Lord of the Rings: The Return of the King", "starring": ["Elijah Wood", "Ian McKellen"], "runtime": 201, "genre": ["Adventure", "Fantasy", "Action"], "description": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the ring closer to the heart of Mordor, the dark lord's realm.", "releaseYear": "2003", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg", "categories": {"plot": 9.947368421052632, "acting": 9.952380952380953, "ending": 9.916666666666666, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 10.0, "action": 9.4}, "reviews": [{"rating": "10", "text": "This is simply a masterpiece.\rYou will never see a trilogy like this one, essential for your cinematographic culture. The Return of the King is the prove that third parts can be much better than the first or second one."}, {"rating": "10", "text": "It's a perfect epic. There's not one false step. The battles are incredible, the characters just as fun as ever. This movie is basically flawless. One of the best ever"}, {"rating": "10", "text": "This movie is supreme in every aspect: visualy, story-wise, directing and with an extraordinary soundtrack. My personal favorite ever since I saw it!"}, {"rating": "10", "text": "There's nothing that I can say in praise of this film that hasn't already been said. One of the best movies, of the best movie trilogy ever made. Stunning, stunning, and stunning."}, {"rating": "10", "text": "the best trilogy ever created. Peter Jackson has done what most people thought was impossible, made 3 amazing movies. Lotr deserved all 17 of its Oscars and probably more. this will remain my top 3 movies ever!!"}, {"rating": "10", "text": "Quite possibly the most satisfying and epic conclusion to an already perfect trilogy, the Return of the King is a testament to both the genius of the filmmakers and the original author J.R.R. Tolkien. It blends seamlessly with the Fellowship of the Ring and the Two Towers to create the journey and story that , and yet stands on its own as a masterpiece, a masterful piece of cinema that will endure till the end of days. Its visual grandeur, cinematographic excellence, musical dexterity, haunting narrative, and ultimate perfection coalesce to create a tale, unlimited in emotional richness, that will resonate through the ages. Every viewing of the film for me is a journey in and of itself, one that ultimately ends in tears (I hear Gandalf lamenting right now \"I will not say do not weep, for not all tears are an evil\"). I fondly recall the midnight premiere of film and how, when I looked around at the audience during the Grey Havens scene, there was not a dry eye in the house, including my father who has (forgive me for the clicheness ) the emotional range of a teaspoon. If that isn't evidence for the profound emotionality of the film, then I don't know what is. Little scenes throughout the film as well elicited such powerful reactions from the audience I couldn't help but feel even more emotion because of that. The Ride of the Rohirrim, Aragorn's speech, Gandalf and Pippin's moment during the Siege of Minas Tirith, and many other scenes throughout the film, whether they induced goosebumps or tears, created an energy in the theatre that was both palpable and moving. Once the text \"The End\" appeared on screen, there was a moment of silence, and then an uproar of applause and cheering. Once again, brought to tears. In any case, the Return of the King is and will ever be a Goliath among films, and I cannot imagine that a film will ever be made that will come to dwarf a film such as this."}, {"rating": "10", "text": "Yes the epicness itself, the best movie i have ever seen, an amazing plot, battles, messages, effects, and a well rewarded 11 Oscars, 10/10 without any doubt. A masterpiece. The best of the trilogy also in my opinion, another amazing thing about it is of course the Wonderfull Awesome Soundtrack that perfectly fits with the storyline, Good work Peter Jackson, I hope the hobbit will be as good."}, {"rating": "10", "text": "The Lord of the Rings trilogy is the greatest trilogy of films ever made, and this is one of the finest examples of brilliant filmmaking of all time.  Peter Jackson is an incredible visionary, the cast is great, it adapts the book very well, and it all adds up to one of the best films ever made."}, {"rating": "10", "text": "I really enjoyed the epic and emotional complexity of the entire film.  While the ending may seem overly long (at over 3 hours, that is a bit excessive), but the film is brought to a conclusion that is magical and satisfying.  I enjoyed the action, the visuals, the script, the music and the acting.  This is a great fantasy film that will live on forever."}, {"rating": "9", "text": "The trilogy has been building to this finale! and it does deliver! at over 3 hours ROTK never seems to make the audience loose interest. the action is better then ever, the characters are put in parell and when you watch this film you have to go all the way through because it holds you down and wont let you  leave"}, {"rating": "10", "text": "This film clearly is the best triology made of our time and we are so lucky to have live this experience thoughout 2001-2002 and 2003 phenomenon, The Hobbit is coming soon!!!!! i have a feeling that this will be as good as this three brilliant masterpieces"}, {"rating": "10", "text": "Its the awesome final to a awesome trilogy and tops even its two predecessor. I lost myself in the film, when I was watching it. The best in the trilogy and one of the best films to be ever made."}, {"rating": "10", "text": "The beginning is may seem a little fast, playing various information to the public, but the rest is perfect, and ends in a phenomenal trilogy Peter Jacson, besides revolutionize the industry of special effects, it proves that it has special effects like mixing first and an epic story in a single film."}, {"rating": "10", "text": "Cormac P., heres what i want u to do, BURN IN HELL!!!!!!!!!!!! SO DON'T YOU ANDREW K!!!!!!!!! How can you how can you say that its nothing when everything about this movie is spectaculer. Even you, yes you Frieda L, you can suck my cup of tea. And everyone that disis it like Robert H, Leigh C, David R, Arleen, Dwayne R, Jawad S, Joe B, J R, Goliath, Harriet, Bob B, Sally L, Rebecca R, Fantasy, Jude T, Simon L, C B, Antonio A, John D, Joyce T, Rick S, Sweet angle, Brian K, Mike G, Jeffery G, Matt B, Eric M, Matt R, Maria T, Marcus B, Matt P, John S, Sam K, Joe C, i want you all to die and rott in hell!!!!!!!!!!!!!!!!!! You have no joy in this series so all of you all are full of s&^%t!!!!!!!!!!!!!! you all are the weakest link. goodbye."}, {"rating": "10", "text": "It's a movie with a lot of war i love it."}, {"rating": "10", "text": "These films show film journalists and fans everywhere that fantasy films can be absolutely superb. And this film has been the perfect end to what has been an epic masterpiece and adventure."}, {"rating": "10", "text": "The best movie ever made."}, {"rating": "10", "text": "The greatest book in the world has rightfully become the greatest movie in the world. 10 out of 10 any day! Tolkien is by far my favorite author, and out of all the books turned into movies, this was the best. Howard Shore conducts a legendary score second only to John Williams. Every aspect of this movie was as impeccable os the novel itself. If Tolkien were alive today... (sniff, sniff)"}, {"rating": "10", "text": "A masterpiece of the film the battle of Pellenor Fields when they introduced the Mumakils were absolutely breath-taking. I did felt however that Faramir should've given just a tad bit more screen time even a minute. But thats the most minor of the minor problems so I thought this film was EPIC! the ending was a drag though"}, {"rating": "10", "text": "An epic conclusion to one of the best movie trilogies of all time. Great characters, action scenes and a story that we cared for. The Lord of the Rings delivered to the hype and although its cheesy at times it makes up with it with its charm. Masterpiece."}, {"rating": "8", "text": "With surprisingly better pace than its predecessor, The Return Of The King provides a graceful and majestic yet thrilling end to the trilogy that is Lord Of The Rings. I almost cried."}, {"rating": "10", "text": "I had to rate this movie because is my all time favorite, I mean, with 12 oscars you can't go wrong, the feeling I get everytime I watch it is epicness, the music, the effects, the acting, everything is perfect and is a must see for any medieval/fantasy fan. 100/100 Best movie ever"}, {"rating": "10", "text": "I am happy to see the awarness of the community. Reviews of those people who do not understand epicness and quality of this movie from some reason , are found unhelpfull. On the other hand almost everyone agrees with those who give compliments to this movie , peter jackson , and of course great tolkien. I watched whole trilogy many times and i can only say , that it is the greates trilogy ever. By my opinion all three of these movies are best there is in the movie world. If someone hasnt still watched it , chances are slim but , he should watch it right away , not just this one but whole tirlogy. Thank you community."}, {"rating": "10", "text": "A fitting end to the greatest film trilogy ever created. Everything, from the acting, to the cinematography, to the special effects, to the score, is flawless. Return of the King retains Tolkien's ascending level of excitement and suspense. Yes, Jackson removed some scenes, but in the interest of time, it was worth it. Lord of the Rings is spectacular in every regard; LOTR is to our time what Star Wars was to the late 70s-80s....purely amazing filmmaking."}, {"rating": "10", "text": "Flawless CGI really brings Tolkien's creatures to life in this film. Peter Jackson has done it again, he was made for adapting long books to long films. With King Kong the plot had to be stretched because Jackson obviously wanted another long film, like one of these LotR movies. But with Jackson working with Tolkien's books he couldn't have gone wrong. He filled the cinematic Middle Earth with almost everything Tolkien described, and followed Tolkien's sequence of events quite closely. At some points the film sores to give a feeling that you're watching a true legend unfold before your eyes, like the scene where the Witch King gets killed by Eowyn. Sir Ian McKellen is a terrific actor and some of the lines which actors say carry real wisdom in them. The musical score was absolutely beautiful, the best of any movie I've ever seen and probably ever will see. The plot was the most engaging and interesting ever, with fight-scenes all over the place to keep the less taken-in among us in our seats. Even the fight scenes have their own emotional beauty to them. And although the ending of the film was heavily criticized for being too long, I feel it was necessary as it was not a case of ending the film, but ending the film for each character in turn. The film deserves all the 10/10s it recieves, and is truly a masterpiece."}, {"rating": "10", "text": "Perfect."}, {"rating": "10", "text": "Awesome."}, {"rating": "10", "text": "Best movie ever."}, {"rating": "10", "text": "One of the greatest films of all time."}, {"rating": "10", "text": "Peter Jackson is an absoloute marvel at filmaking, even the spectacular action scenes have their share of emotional beauty. The Return of the King is one of the greatest movies I have ever seen, surpassed by Jackson's King Kong."}, {"rating": "10", "text": "Greatest movie of all time, and for those of you that give it 0's you are ignorant people that haven't read the books and decide that watching the movie should do it all for you. You people can go watch dawn of the dead or some shit and give it 10's and have no idea what a truly great movie entails."}, {"rating": "10", "text": "It kept me focused the entire 3+ hours, and excited. That is a testament to a truly great epic. It had everything I could ask for in a fantasy movie."}, {"rating": "10", "text": "Everything but the acting was perfect. Not, the acting wasn't bad it was a bit more than ok even. Yes, i agree with that, and everyone who didn`t liked the series, but that isn`t the point! it`s a fabulos story told perfect it` doesn`t need even more exagerations from the actors to ruin it. it was acted as it should have been. Few movies ever made me cry this made me more than cry at the end."}, {"rating": "10", "text": "First you complain about the first two movies not wrapping up the story.....now you complain about the complete opposite. I watched the extended version of this film and was actually surprised that it was 250 minutes long. Seemed like a lot less. Anyone who's read this book should agree that if Peter Jackson had ended it the same way tolkein did it the climax would have come at the hour-and-a-half mark, with 3 more hours to go, which is fine for a book which is read in multiple sittings but tourture for a movie. I'm glad Jackson ended it like he did and wrapped everything up. Well done sir!"}, {"rating": "10", "text": "By far this is my all time favorite movie. It surpasses virtually every other movie in every way. The lord of the Rings Return of the king is a must see before you kick the bucket."}, {"rating": "10", "text": "I love this movie so very much. Every time i see it, it still tears me up after watching it at least 9 times. Even though it is really hard to tell what there saying( another marvelous feet by the director). An incredible movie that i think has the best freaking ending ever."}, {"rating": "10", "text": "The best film I've ever watched. It combines everything I love about films. Superb directing, passionate acting (with the exception of Bloom), amazing music, and the ability to grab and not let go. This film (and trilogy) completely fulfill the definition of epic."}, {"rating": "10", "text": "the best film ever, it really is, it is even better than the two towers, the storyline is better than ever, when gollum betrays frodo and sam, oh i love that bit..."}, {"rating": "10", "text": "A perfect movie, it has anything you could possibly want: action, romance, adventure, comedy, war, fantasy... ItÈ"}, {"rating": "10", "text": "Superb in every way. Watch the films first, then read the books. An adventure so epic that it will be your measuring point for future fantasy films of the sort."}, {"rating": "10", "text": "Contiene las mejores escenas de accion que he visto. Es aun mejor que las dos anteriores y resulta ser una de las peliculas mas entretenidas que he visto. Peter Jackson logra adaptar las tre historias perfectamente y al final nos da como resultado la mejor trilogia de todos los tiempos. The Return of the King es una joya del cine moderno y un clasico instantaneo."}, {"rating": "10", "text": "The final and best entry in the Lord of the Rings trilogy. Sauron begins his final assault on Middle Earth, Gondor is losing and thr rightful king, Aragorn must return to the throne. Frodo and Sam arrive in Mordor but Golum will do anything to stop the ring being destroyed however Frodo himself is feeling the effects of the ring and also does not want it destroyed. Its up to Sam to help Frodo through this final struggle to destroy the ring and save Middle Earth. A stunning conclusion to a fantastic trilogy of films, some of the best in cinema history."}, {"rating": "10", "text": "This is one of the greatest films of all time! It brings an end to the epic tale of the fellowship and it is just perfect. Great book-to-film conversion. The extended version is better though, it includes The Mouth of Sauron as well as other juicy little tidbits."}, {"rating": "10", "text": "Return of the King is probably my least favorite in the trilogy, but that doesn't make it in any way a bad movie. The battle scenes are awesome, but they get a bit repetitive after a while. Also, this one was a bit harder to follow than the other two. Other than that though, this is a great conclusion to one the best movie franchises of all time!"}, {"rating": "10", "text": "this movie is perfect, it deserves much better critic than the user score is. the film does great job in all aspect: story-wise, graphics, an perfect soundtrack, and great acting by the characters. it's a perfect ending of the trilogy. in my opinion the film deserves a (99) of 100 in metacritic."}, {"rating": "10", "text": "This movie and the last two movies are fantastic,but,this movie close the trilogy with a lot of success.The producers of the movie are geniuses.But not only them.Also the director and the writers."}, {"rating": "10", "text": "This is by far one of my most favorite movies of all time. Great actors, special effects, a great script and a lot of great characters that are easy to remember, and you will never forget them."}, {"rating": "10", "text": "For Jackson to shoot The Lord of the Rings with a local crew in New Zealand, a country at the edge of the world with little stake in its doings, is a marvel which may only be repeated by Jackson himself. Apart from the international cast, the people who were actually working to bring us the trilogy, like special effects, were Kiwis. The majority of this credit must go to Jackson for his leadership and vision, and for succeeding in hiring an able team.\r The Return of the King is the concluding chapter in the trilogy. The story is picked up where it was left off at the end of The Two Towers. We are shown a glimpse into Gollum's past. The rest of the fellowship reunite at Isengard. Saruman's fate is omitted from the theatrical edition, which I always found odd given his importance in the previous instalment.\r It is a time for festivities in Rohan in the wake of the victory at Helm's Deep. An accident shows us Sauron's plans for Minas Tirith, the legendary capital of Gondor. The fellowship breaks again in a  different way. Gandalf rides to the city to find the steward reluctant to lift even a finger for its defence. Needless to say, things work out and Rohirrim ride for Gondor's aid. Faramir, dejected by his father, rides out in a last ditched effort to reclaim Osgiliath.\r A family heirloom is returned to Aragorn which he uses to find help in the most unexpected places. Another plot device if you ask me. If you keep an eye out for them, they become very obvious. Jackson could have lessened its impact or omitted it entirely, making sure the battle was won through the prowess of battle commanders, which he failed to do so. As Fellowship never purported to show us a huge battle at all, and did not have to resolve it, I will forever hold it in higher regard than Return. The Two Towers resolved its battle much more satisfactorily, but Return has got much more on the former in other areas, so the second place goes to the latter.\r Orcs begin the attack on the city. Gandalf leads the defence. The battle looks grander than the one at Helm's Deep, the besieging armies and weapons more awe-inspiring. The special effects used to bring this conflict to life were stunning_ showing the destruction of architecture by the catapults and the loss of men and Orcs; as well as bringing to life Shelob, the giant spider. The scene of the Rohirrim cutting through the Orcs on their horses is possibly the most spectacular. Oliphaunts and Nazguls join the fight.\r My previous apathy for Eowyn is cured after watching the extended version, in which she develops significantly. In fact, she is the only female character in Middle Earth who is of some worth, and I like where her story took us, climaxing in a very satisfactory way in the middle of a battle, pitted against only the most important antagonists.\r The main trio_ Aragorn, Legolas and Gimli, are absent from much of the fighting, as the other two accompany the former on his journey of self-discovery. I was earnestly hoping for them to join the fight, which they did (Legolas displaying some very impressive killer moves), but it was so ridiculously short. Four minutes. Believe me, I counted. In this regard The Two Towers was much better, as well as having more memorable scenes with the Gollum.\r Frodo's inevitable clash with Gollum goes full circle. Sam displays unprecedented strength of character and resolve, and the Hobbits thrive without much help from men. Men ride once more to aid Frodo in his quest to rid them of the ring, and a final battle sequence follows, after which it is destroyed. In epilogue, we learn about the fates of the Hobbits, Aragorn and Gandalf.\r The extended edition had some interesting scenes which enriched the characters and the story, but also some which betrayed some ineptitude at editing. One scene had a character utter the exact same dialogue to persuade someone in the span of a single conversation. Surely a rewording would have been more effective. I scoffed at a particular attempt to blossom an affair between two secondary characters. Such things should have been hinted at in the epilogue. No one is interested in that stuff when the stakes involve the end of the world.\r Finally, a discussion about the extraordinary tally at the Oscars. Eleven well-deserved wins out of as many nominations, in fields as diverse as art direction, costume design, make-up, sound, original score, original song, editing, visual effects, adapted screenplay, directing, and Best Picture.\r In the end I would observe that the extended editions of the first and second instalments, three hours twenty and three hours thirty-three minutes respectively, enhanced the tales while the third one, a crushing four hours, did not achieve anything of worth."}, {"rating": "10", "text": "An epic movie with an epic end. Love this movie."}, {"rating": "10", "text": "A Flawless job by Peter Jackson. this movie has everything! Action, Adventure, Romance..etc. and the digital effects are amazing!! i had no idea they had the kind of equipment to make such amazing effects! and i see a lot of people complaining about the length of the movie. And i must agree the length of the movie is kinda long..running over 3 hours long. but its better than making 5-6 lotr..right? i think 3 lotr movies is the perfect sequel and this movie will be known for awhile.."}], "recommendations": ["the_lord_of_the_rings_the_two_towers", "the_lord_of_the_rings_the_fellowship_of_the_ring", "harry_potter_and_the_deathly_hallows_part_2", "war_for_the_planet_of_the_apes", "gladiator", "the_hobbit_an_unexpected_journey", "braveheart", "top_gun_maverick", "doctor_sleep", "alita_battle_angel", "avengers_endgame", "the_green_mile", "star_wars_episode_iii_revenge_of_the_sith", "creed", "the_bfg", "master_and_commander_the_far_side_of_the_world", "titanic", "the_hunger_games_catching_fire", "harry_potter_and_the_order_of_the_phoenix", "the_lovely_bones", "the_shawshank_redemption", "close_encounters_of_the_third_kind", "the_hobbit_the_battle_of_the_five_armies", "unbroken", "harry_potter_and_the_half_blood_prince"]}