{"id": 2037, "title": "The Angry Birds Movie", "starring": ["Jason Sudeikis", "Josh Gad"], "runtime": 97, "genre": ["Animation", "Adventure", "Comedy"], "description": "An island populated entirely by happy, flightless birds or almost entirely. In this paradise, Red, a bird with a temper problem, speedy Chuck, and the volatile Bomb have always been outsiders. But when the island is visited by mysterious green piggies, it’s up to these unlikely outcasts to figure out what the pigs are up to.", "releaseYear": "2016", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/nsaaZryqabtrdKwXcNud2Bm39mu.jpg", "categories": {"plot": 7.471698113207547, "acting": 7.3076923076923075, "ending": 8.0, "soundtrack": 8.0, "cinematography": 7.0, "familyFriendly": 8.0, "funny": 7.530612244897959, "action": 8.833333333333334}, "reviews": [{"rating": "10", "text": "2016 keeps bringing us fantastic animation that is flawless\rThe Angry Birds movie keeps the tradition going with a fun Insightful animation\rThat children and intellectuals like me alike can enjoy\rKeep up the good work 2016"}, {"rating": "7", "text": "The Angry Birds movie is surprisingly good given the source material. It's a pale shadow of a Pixar film, but the kids in the theater all seemed to enjoy it. On the plus side, the animation is great, the voice acting is solid, and the inevitable battle between pigs and birds was well orchestrated. The movie also does a great job of capturing the personalities of Red, Chuck, Terence and Bomb. That being said, the writing is clunky  and the plot is just slightly more complex than the original game story. Most of the gags involve potty humor, but I'll admit to laughing a few times. If you're taking your children I give this a solid 7, though I'd drop that to a 6 if you're going simply because you're a big Angry Bird fan."}, {"rating": "7", "text": "Colorful,cute and forgettable.The Angry Birds has a cute and well animated film but falls flat on it's predictable and cliche jokes.The film has great voice cast,they are great in their respective characters.The main characters Chuck,Bomb and Red are fun to watch so thus the pigs.The angry birds is a fun film overall,surprising for me,I thought the movie would be like Ratchet and Clank or even Norm Of The North but it was good after all.It's definitely not a bad video game movie but not great."}, {"rating": "8", "text": "Its a good movie. It had problems like the story, some characters and some jokes, but is a fun time to watch this movie. The animation is fantastic, the characters are really great, the voice cast is also awesome and the comedy is not bad."}, {"rating": "7", "text": "This movie is much better than the critics are getting it credit for.  First of all, it is a kids movie.  I would never have thought to go to this movie if I didn't have 9 and 10 year old kids.  So I look at it from that perspective - is it s good kids movie.  Now, it is no 'Inside Out' movie - but still a funny movie with an decent flow.  Yes, the script is predictable - in Angry Birds the pigs are always after the eggs, right?  So you know where the movie is headed - but that alright.  That is the same with many movies.  What is more important is the movie has good humor along the way and develops the characters well  ...  well, about as well as you can develop a cartoon character.  My kids loved it and there was a lot of laughter throughout the theater from all the other kids as the movie played out.  So the kids in attendance enjoyed the movie and that makes it a success.  This movie was not made for us adults.  Even so, I also enjoyed the movie."}, {"rating": "10", "text": "I expected big things from this movie when I first heard about it, and my expectations were right! It had a very clever plot that was actually a lot more than just pigs steal eggs, and birds slingshot on lots of wood, stone and glass towers to get them back. It actually did show about why the birds are angry, the pig's arrival, and the pig's plot to steal the eggs, and the massive battle to get them back. It had a lot of really funny puns and jokes in it, the animation was top notch, and it had a cast of big stars, who all suited their characters really well, and voiced them really well. Go and see this movie, it's pretty much anything you want from a movie based upon an app, that you will expect to be really big."}, {"rating": "7", "text": "Pretty good.\rBetter than I thought.\rEven saw it a second time.\rJust not awesome.Many kids ages 6-16 will like it.\rWhen I first saw the trailer, I thought it looked really bad.\rBut now that I've seen it 2 times,it's actually pretty good."}, {"rating": "7", "text": "this movie had great animation, characters, and it was pretty cute.  But, I didn't enjoy it that much.  I didn't like the plot very much.  I enjoyed the 2nd part and I think kids would like it too."}, {"rating": "10", "text": "Angry Birds is an animated film which is also a comedy. The story follows  the war between the birds and the pigs. First, the birds have a lot of eggs. Then, a lot of pigs come and they really like the eggs so they steal the eggs. Although it's a war film, it's a really enjoyable comedy. The special effects are great. I think this is an ideal film for people who like comedies."}, {"rating": "10", "text": "Honestly i never thought this film will be this good!The story are fun, bring me a lot of laughing.Already be one of my 10 scores film of all times."}, {"rating": "7", "text": "This movie was alright. It wasn't perfect but it wasn't bad. The character development was cool and it was glad to see a ton of different birds instead of just recolors. The animation is great, and the audio, visuals, and voice acting are good. Children will love this movie. It has a few adult jokes here and there just like every other PG movie, but it was still a good animated movie."}, {"rating": "7", "text": "I think that everyone will enjoy the movie. Those who played the game and those who haven't! Funny characters, predictable but still good plot, and an enjoyable overall animation!"}, {"rating": "10", "text": "this is my new favorite movie , there's a lot of drama and the animation is great , the voices are good , and there's a lot of funny characters , thanks for the good time."}, {"rating": "6", "text": "The Angry Birds Movie is a coolest movie of the year. The release of the \"The Angry Birds Movie\" greatly increases Rovio's revenue for this year. This was not always the case. Rovio's revenue has been declining steadily for the past three years. It even reported a loss of $14.5 million last year."}, {"rating": "8", "text": "I watched this movie a while ago. I'm 21 years old, a Law student yet really enjoy the movie. I loved the game anyway but haven't played it couple of years already. The Angry Birds movie is crazy and fun. This movie tells the history, the story of each characters of the game. I feel like a kid while watching this. If you want to learn philosophy like what the Mighty eagle said \"Wisdom is not something that is given but something that is attained\" yeah! whatever! haha. It's nice to feel like a kid again and to believe that birds do not fly! Watch it and you'll enjoy! =)"}, {"rating": "7", "text": "Before I saw this, I heard some pretty mixed things about the movie. I have to say after watching it, It's really funny. It's not excellent, but it's still pretty enjoyable to watch. All the references to the games was a nice touch."}, {"rating": "8", "text": "I loved it, one of the best animated movies in a while. The voice actors, animation, and story, are all great. It isn't perfect, some plot holes prove that, but it was really good."}, {"rating": "7", "text": "A decent film about an app where you shoot birds at pigs. Animation is very good, story is somewhat hackneyed and predictable. Plenty of laughs for the children (the pigs are very minion-like) but the main characters aren't very likeable. Best part was the eagle."}, {"rating": "7", "text": "What makes the birds to get so angry?\r Video games to films is an old topic to discuss it now, but the fans from the original source are always in the high hope when they hear news like this. Because 'Angry Birds' game is one of the mainstream games which is originally from Finland. Despite the mixed reviews, it is a box office success and definitely a sequel on the card. After lots of animal themed films, now in the line of underrated animation 'Free Birds', another the bird's quest begins with this.\r I'm not much into this game, but I was looking forward to the film since it was first announced. Now I'm here after the watch and I think is a good film, but better suitable for children than the adults. That did not stop me from enjoying it. The target audience might be the kids with those cute film characters, as well as the story, but there are some dialogues that are written keeping in mind the grownups. Anyway, most of the adults won't feel they are in a wrong cinema hall if they regularly watch animation films, especially in the present world animations are accepted as for all ages.\r So this is the story about the Red, an orphan bird lives in a small house on the sea shore. The kids from the island loves him, but the adults stay away from him for his bad anger attitude. One day a ship of pigs arrives on the bird's island offering friendship, but their intention was later known once the valuables things were stolen from them. So the revenge and rescue operation begins which stretched with full of action-adventure in the remaining parts.\r Filled with lots of fun moments, it was much better than I expected. Sometimes it looked cute, but you know our angry bird, Red with his companions makes it not to stay that way. Peter Dinklage as Might Eagle was one of the highlights of the film and the rest of the cast did well too. It is definitely a great directional debute for the two experienced animators. Makes a bit sad how the film was received, but after seeing it myself I think its fine. Different people have different opinion. In my perspective, it was a good watch so I surely suggest it, especially for animation fans and obviously children.\r 7/10"}, {"rating": "10", "text": "The movie is really entertaining , fun all the time, i was totally enjoy watching the show , it deliver more than expected , it deserved a score of 10 out of 10 !"}, {"rating": "8", "text": "One of the best videogame movie adaptation!The main problem is PG rating which is clearly should be PG-13)))"}, {"rating": "7", "text": "I remember when i played Angry Birds on my ipod, it was a fun game. You throw birds at the pigs and try to get the eggs back. When it was announced that they would make an Angry Birds movie, i wasn't that excited but i was looking forward to seeing it. I seen the movie and in my opinion, it was the best video game movie ever made. It stayed true to the source material like the personalities of the birds and the birds going on the slingshot to defeat the pigs. I liked the idea of giving the birds and pigs feet and arms instead of having birds and pigs without those body parts, that was a smart idea. The plot is kinda predictable, the humor is a hit and miss and what the **** is with pigs slapping their asses? Isn't this a kids movie you guys? I think The Angry Birds Movie is a great video game movie but can be a little tiresome at times. If your a fan of Angry Birds, i guess you'll like it."}, {"rating": "5", "text": "The idea of bringing a classic cell phone game to the cinema was not bad until they decided on a shallow and weak script. However, it becomes good for children. There is no reason to create expectations for a continuation. 5.6/10"}, {"rating": "8", "text": "The angry birds was suprisingly good i thought this would be terrible and it would suck. but this was one of the funniest and most entertaining movies for the whole family to enjoy. the movir follows the source material very closely where the pigs steal the eggs and the birds must fight to get them back."}, {"rating": "7", "text": "Honestly, I like this movie. I laughed quite a bit, the animation is good, and an all-star cast keep the movie going. While only Red gets any development, I was entertained all the way through this film."}, {"rating": "9", "text": "Film of the year. The real issue here is that critics disagree with the underlying themes of the movie. See it if you want a wild ride that might break a few preconceived notions."}, {"rating": "8", "text": "Why does everyone wants a Pixar or a Dreamworks movie? It obviously this isn't original, but is good.\rThe animation is fantastic, a lot of jokes are good (not necessary all of them), the voice cast is well done, the backgrounds and the ideas are fascinating, the development of characters is standard and even if the script isn't the best, the people who worked on it tried the best to be entertaining, and it is entertaining.\rIts not the best animated feature, but it is the best videogame adaptation. If you are forced to make a movie based on an app, is obviously that the ideas are limited, you can't be that original and the movie isn't that original or brilliant at all, but again, is harmless and entertaining. Its not the worst movie ever, it's good enough to be an OK movie. And it deserves to be an OK movie, don't be so harsh with it. I though i was going to see a mess like Smurfs, but thank god i had a decent product."}, {"rating": "9", "text": "The Angry Birds Movie is not only a great movie for children but also for the parents.\rThe animation is good, sadly the voice cast could be better but it's not that awful. The story and the jokes will surely amuse your kid.\rAnd for the parents this movie will offer a nice metaphor about the risks of illegal immigration."}, {"rating": "7", "text": "Not bad really,The film is harmless and aimed towards kids and I have no problems with it.It's colorfully,and well animated.I have a great time watching the film."}, {"rating": "7", "text": "\"Why So Angry?\"\r Rovio Entertainment and Sony Pictures Entertainment built a great final product, within the limits of cinematographic quality adaptations about video games.\r Despite of that the fame of the digital game already isn't in vehemence, it did in 2009, when Finnish Rovio games company decided to sell a video game based on angry birds and green pigs. So huge was its success that seven years later, a film adaptation has been established in the theatres around the world, while retaining the same color palette of the game, its main characters and even a song from the original. However, its characters aren't the only ones angry, spectators are really angry to see the silly and unbalanced screenplay of the story. In certain way, the extravagant colors, cheap jokes, and even references manage to hide that lack, even so, lack is evident. Nevertheless, \"Angry Birds Movie\" is the greater favorite video game adaptation in the summer season, with the support of adolescents, adults and most children. At least at the box office amass more fortune than its competitors due to the level of recognition, although \"Warcraft\" and \"Assassin's Creed\" may give the fight.\r Fortunately, Sony film is not worthy of the ratings and opinions negative by the audience, well, at least not of all. The expectations for this film were too low, due to the complicated and arduous work to create a story with so few elements, adding to this, the little experience evidenced in previous adaptations of electronic games. Sony gets to engage in a true animated movie, failing in its terrible script, creating lack of chemistry and consistency, not very present in neighbouring companies (Diney - Pixar and even Dreamworks). Bird design is beautiful, majestic and excellently projected, its colors, textures, personalities and sizes make this adventure, a real game of \"Angry Birds\".\r We meddle in its main scarcity, \"The Lego Movie\" is a clear reference of a flawless screenplay. Perhaps, screenplay by Jon Vitti (Alvin and the Chipmunks) is simple and limited by the almost nil tools on which they are based, hampering the creation of characters more deep. They thought that by being a film directed mainly to the public children, the plot should be simple and clear, without much depth or complexity in order to solve the basic questions of the game.\r Why are angry the \"Angry Birds\"?\r In an anthropomorphic world, all kinds of birds coexist in a peaceful, fun, colorful and friendly place (an island), all but Red (voiced by Jason Sudeikis) a embittered and resentful bird with life since child due to his physical appearance, his temperament was not the best and he is forced to attend classes to control his anger with the beautiful and delicate Matilda (voiced by Maya Rudolph). There, he finds to his three companions of adventures, Chuck (voiced by Josh Gad) an animated yellow canary with  speed powers (with a clear scene referenced to 'Quicksilver' (\"X-MEN\")),  Bomb (voiced by Danny McBride) a black, bomb-shaped bird, which cannot control his temper and simply explodes and finally and less present Terrence (voiced by Senn Pean) a biggish red bird with noble feelings. The group of misfits will have to save their city from the dangerous and malicious green pigs, an unprecedented adventure began.\r \"Angry Birds\" pleases to infants with a predictable, colorful and entertaining story, but also meets with ironic humor to the public adult with perfect and clear references to \"The Shining\", \"X-MEN\" and classic Tex Avery gags. If the screenplay had not been so redundant in the themes and repetitive objectives in animated films (the family, the hero, save your city, happy ending), would be the perfect blend with high quality graphic effects. We consider, this film like a game of \"Angry Birds\", where all pigs have been defeated, but the final score doesn't reaches three stars of score."}, {"rating": "10", "text": "This is the best video game i have ever seen. I don't see how anyone would find this bad. I thank the critics who actually thought it was good. It's funny how red is through a dangerous situation at the beginning while giving a hatchday cake to a kid. My favorite part was when the birds went into the castle to get the eggs back. And the mid-credits scene. So cute. I'm probably assuming there will be a second angry bird movie. I just hope it gets a better rating. It has a 43% on both rotten tomatoes and metacritic. Why are video game movies so bad these days."}, {"rating": "10", "text": "I have to admit. When I saw this movie I was really split. But now that I have to admit, this movie is awesome. I think this is a better video game movie out there (at least until Warcraft and Assassin's Cree come out). Jason Sudeikis is a good choice as Red, Josh Gad is really funny as Chuck, Danny McBride is also funny as Bomb and the other voice actors are perfect choices in these roles (Maya Rudolph as Matilda, Bill Hader as Leonard, Keegan Michael-Key as the Judge, Peter Dinklage as the Mighty Eagle, Kate McKinnon, Smosh as Hal and Bubbles, and of course Sean Penn as Terence). It's just like Hotel Transylvania to me; the story's great, the characters are memorable, the jokes are funny, the puns are decent and the high speed, energy and quick pace matches the comedic delivery perfectly. Sure it doesn't reach the lengths of Pixar, but what do you expect from Sony. It's just a good movie. I just hope they make a sequel; and if they make it I want it to be more like Hotel Transylvania 2 and less like The Smurfs 2 (P.S. The Smurfs Movies totally suck!). I give this movie Thumbs Up."}, {"rating": "10", "text": "dont let the pretentious movie critic pros fool you, this movie is great fun!\ranimation quality is top notch and the jokes bold and actually relavent to the story.\rhell it even has a couple of quite memorable songs.\r go see it for youself!"}, {"rating": "10", "text": "It was a great movie! Fantastic story considering the simplicity of the game app. And have an interesting message, like it's OK to be angry sometimes you shouldn't just let someone wrong you... you find courage and fight back! I really like it."}, {"rating": "10", "text": "This is really funny movie, very related to the original game, which is very important for those who have played the game before, the graphics are awesome."}, {"rating": "7", "text": "I just saw the movie Angry Birds. I like the animation and the characters. My favorite characters are Red,Chuck,Bomb,Matilda and Terrance. I think they could make the moral of the story more noticeable. My rating is a seven ( three and a half if you count it out of five)."}, {"rating": "6", "text": "This kind of movies are for kids of course so please stop it with \" this is a dumb kids movies\". I saw half of it and was bored . For me a 24 year male this movie is really crappy, dialogue and jokes are not fun. But many kids will probably enjoy it although it's kinda late for an Angry Birds movie. When you watch Zootopia and then you watch this you feel there is a major difference in quality"}, {"rating": "10", "text": "So nice to see a POSITIVE movie with a GOOD MESSAGE and MORAL VALUES we can be happy about sharing with our kids\rI suggest everyone go out and watch it twenty times! Keep the pigs out, valiant birds!"}, {"rating": "9", "text": "People call this movie as a garbage waste of time to be screened, and I reply \"So it is Spongebob Squarepants!\"\rI really enjoyed this movie. It has a balanced humor of childish, sarcastic and adult; the characters are each of them amazing, and the animation it's so well done! It might have a plot a little rushed, but it explains the reason of the birds get angy at the pigs.\rI could see all the birds that I knew from the all the games and cartoons aired; it made me smile a lot that my jaw was sour later. And the best of all, it's full of questions that it would be answered in a \"possible\" sequel or shorts in a prolly future: How can each bird have an ability to explode, get bigger or fire fire-ball through their butts? What's Red's origins? What's the stories behind the pigs? Where are the female pigs?!\rFor me, this movie is worth it! 100%"}, {"rating": "8", "text": "The movie was enjoyable, for a Angry Birds fan like me The only problem with the movie is that the movie was labeled to be about a island full of happy birds, but Red has a really bad temper, which he is labeled as an outcast. His stories are shown, like his early days, it shows that Red hatched without his parents by his side, he is alone, with no parents. Then during his school days, he gets bullied for his big ass eyebrows, and the fact that he was born without parents, labeling him as a failure to his parents. The main problem is that you need to give more detail to the story, here is an example. Show how the parents abandoned Red, or show more of his bullying, like maybe him getting harassed so much that he losses it and beats one of them up, since the rating is PG, this can be acceptable. Same goes for Chuck and Bomb, show their stories. They are labeled as outcast also, so show how they were born, were they abandoned, mistreated, abused, or given a special power. Show their school life/early childhood, were they bullied, picked on, or did they get in a lot of trouble, we don't know, there is a lot missing here! Make the birds relate to the kids, so they can relate them self to the birds, maybe they are going though that situation or something, we don't know, but it would add spice to the plot. Just add more flashbacks, since it adds a lot more to the plot, like add Mighty Eagles story for god sakes! Tell us how he became mighty eagle, or what he is notable for. Another problem i have with the movie is the fact that the adult jokes go WAY to far if you think about it. Like when red says \"Drop your nuts and move your butts!\" If you think about it, it is literally a masturbation joke, and some kids might even realize that, i don't know, there are a lot of screwed up kids these days. One more problem I have with the movie is that none of the fan fiction lovers are in here. Like Chuck and Stella, or Bomb and Matilda. The fact that Matilda and Terrence sorta loved each other at the end pissed me off! This could have added alot more action to the film. Maybe Chuck saves Stella from danger and risk himself, or a love story between Bomb and Matilda, it would have made the film more action packed, which I KNOW it is rated PG, but still, kids deserve better. That's why I give this film a 7/10, i enjoyed it, but it had a lot of details missing.\r It took me 2 days for more to script this review, so that's why its late."}, {"rating": "6", "text": "While a lot of its humour is over the top and falls flat, The Angry Birds Movie is nevertheless a well animated, sporadically funny and entertaining film that is bolstered by good voice acting. 6.5/10"}, {"rating": "8", "text": "--------------------------------------------------------\rEuropean refugee crysis - The movie\r---------------------------------------------------------"}, {"rating": "10", "text": "A great movie for the whole family!\rWe all loved it. It was fast pace , funny and very cute. I don't agree with the critics at all.\rAlso there are no hidden message on immigration( the game has the birds vs pigs 6 years ago).\rThe movie has nothing scary for little kids, and kept mine in their seats. Added bonus amazing music.\rGo have a very fun time and laugh for an 1 hour and half:)"}, {"rating": "7", "text": "If you just saw the comments down below and HAVE NOT seen the movie then ignore them (users and critics), why, because thats their opinion, who knows you might love of hate the movie but don't just take the worlds way of seeing it, and i admit i have not seen the movie but SO WHAT i'm going to see today then come back and write my likes or dislikes of this movie, see ya the X Drone out. (P.S. This rating is not valid cause I haven't seen the movie)"}, {"rating": "4", "text": "The Angry Birds movie may have a great animation and that's it,nothing else to say.This better for children than for adults,of course cause it's a kid's film but out of all the animated films I saw in the past years,Animated films can be smart and can be enjoyed by two demographics.This film on the other hand felt just for kids to enjoy. They tried so hard to to make their jokes work but it felt forced and overall not good at all Some jokes are for adults but again it felt forced and not funny. Story on the other hand is bland  and seems predictable.The voice acting are okay .Again the movie has some good animation,it's cute and colorful.\r The Angry Birds is just another cliche kid's film with a bland story and predictable jokes.Just watch The Nice Guys and leave your kids to watch this film."}, {"rating": "10", "text": "Possibly the best video game movie of all time! It's a funny and charming movie that's for the entire family! Forget about what the critics say. This movie really is this years LEGO Movie."}, {"rating": "5", "text": "'The Angry Birds Movie' is, in short, harmless. We all know as adults, we tend to dread these kinds of animated films because they seem so obnoxious, and rather pointless. I say pointless simply because the game, which you can download on your iPhone, which was released in 2009, peaked in popularity through the early 2010s. Had this movie been released at least 3 or 4 years ago, it would seem more relevant.\r \"Angry Birds\" focuses on a bird named Red (voiced by Jason Sudeikis), who has pretty much been ridiculed his entire life due to his short temper and thick eye brows. When an incident occurs at a little child's birthday party, Red has been told he needs to attend an anger management session. This is where he meets the fast-paced Chuck (Josh Gad), and Bomb (Danny McBride) who share their stories of how they can;t control either their speed, or how Bomb can't control not being able to explode.\r The plot kick-starts as soon as we meet Leonard (Bill Hader), a leader pig who comes to the birds' hometown, and starts holding parties and begins to win the community's respect. However, Red isn't so sure about this, and himself, Chuck and Bomb discover that they are hiding something in the ship that they travelled in.\r The rest of the birds' think that they are lying, and Red tries his best to convince them that the group of menacing pigs are trying to steal the birds' eggs.\r Red, Chuck and Bomb travel far to meet the Mighty Eagle (Peter Dinklage) and ask for his help. This scene, strangely enough and without spoiling it, leads to nowhere. The plot speeds up as soon as Red, Chuck and Bomb convince the bird population to go to war with the pigs, and develop a massive slingshot to hit their castle. Anybody who has played an \"Angry Birds\" game on their iPhone will know that's the aim of the game, assemble your bird onto a slingshot and sling them against the pigs and their obstacles. It's admittedly addictive, but to put this into a film, it can be hard to make it interesting and convincing.\r The main problem with this film is that it seems to have trouble balancing the jokes and the plot. There are times where the plot will move for about 10 minutes, and then the film grinds to a sudden halt to make a joke that has nothing to do with the premise of the film for about 5 minutes, then the film wakes up and the plot continues. The fact that it keeps stopping to make jokes in order to get laughs seems forced. Plus, the nature of the jokes are predictable. Let's just say that there is a scene in which a main character lands in a small room full of dynamite and he gets up and says \"Well, that's dynamite\". Or take another scene, where we see the main characters bathing and drinking in some holy lake, only to discover that every morning a certain character urinates in that lake every morning, the urinating joke goes on for about 3 or 4 minutes. If you wanted those jokes to be a surprise, then I'm sorry I spoiled it for you.\r The only character that made me laugh the most would be Bomb, voiced by Danny McBride, but even then, his joking time seems to be limited. The rest of the talented cast do seem wasted in their roles, Sudeikis, who is very funny, doesn't have much inventive material to work with. The same can be said for Josh Gad and BIll Hader, two actors who can be funny with the right material, but they are weighed down by cliched, animated kids movie, predictable jokes.\r Like I said before...this film is harmless...children will definitely have fun with its fast-paced and colorful tone, and adults will tolerate this enough, but you will forget this film existed. It's funny at times, but the predictable jokes are noticeable, plus the fact that the plot has to stop in order to make these jokes can be a distraction."}, {"rating": "10", "text": "why so much hate for this movie?? see.. this movie is for kids.. big donkeys like the critics go and watch this film and give a bad rating.. i took my little sister to this movie and she enjoyed a lot.. probably that kid had the best day in her life.. so i definitely want to give this movie a perfect ten!! and talking about the movie, the graphics are flawless and awesome.. the movie is a decent watch for me too.. it never gets boring.. despite very little run time, it entertains the most.. and i have to mention about the final half an hour of the movie.. the action scenes were just great and highly entertaining.. thumbs up!! haters go get a life..!!"}, {"rating": "8", "text": "Rovio's mobile game series manages makes the turn to movie form better than the average video game flick. The direction of family-oriented animated movie was a great move. Granted, that was really the only area they could go, but still.\r The sense of humor is on point for the majority of it's running time. Given the lack of really any sort of narrative in the games, we do get stuck with a chintzy plot and some awkward characters, particularly in the villain department. These pigs are kind of a bland threat. However the movie more than makes up for it due to it's fun, imaginative, and energetic nature.\r The jokes come a mile a minute. Just about any type of humor you can think of is here. Even some surprisingly mature jokes here and there for the parents. Every now and then some of the more questionable gags will drag on for a bit too long and there's a weird fascination the directors seem to have with their character's butts, but for the most part all of the humor nails the landing.\r As far as the presentation goes it couldn't be much better. The animation is so stunning that it rivals the best of Pixar and the entire voice cast is almost perfect. The flaw comes from Bill Hader who hams it up (I'm so funny) too much as the main villain. The soundtrack is both surprising in it's choice of songs as it is fantastic.\r It's a great movie for the kid fans of the game as well as their parents. With plenty of references to the series it's based off of, particularly in the finale, there's enough to bring a smile to the face of the clued in. For those not familiar with the games the hilarity and charm are enough to pull you in. It's got some shortcomings, but in the end these birds really soar."}, {"rating": "9", "text": "It deceives more credit because it is very fun and a surprisingly good video game adaptation to angry birds even I was not the most keen on the movie at first now I love it."}], "recommendations": ["the_lego_movie", "ice_age_the_meltdown", "cloudy_with_a_chance_of_meatballs", "the_angry_birds_movie_2", "free_birds", "hotel_transylvania", "cloudy_with_a_chance_of_meatballs_2", "ice_age_dawn_of_the_dinosaurs", "penguins_of_madagascar", "hotel_transylvania_2", "chicken_little", "minions", "the_smurfs", "turbo", "captain_underpants_the_first_epic_movie", "tmnt", "monster_house", "ice_age_continental_drift", "incredibles_2", "the_lego_movie_2_the_second_part", "the_spongebob_movie_sponge_out_of_water", "despicable_me_2", "the_croods", "spies_in_disguise", "alvin_and_the_chipmunks"]}