{
  "id": 1770,
  "title": "The Peanuts Movie",
  "starring": [
    "Noah Schnapp",
    "Bill Melendez"
  ],
  "runtime": 88,
  "genre": [
    "Comedy",
    "Animation",
    "Family"
  ],
  "description": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their arch-nemesis, while his best pal Charlie Brown begins his own epic quest.",
  "releaseYear": "2015",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dZOcwqxurYhDyjmdnhYcGnn1agL.jpg",
  "categories": {
    "plot": 8.24390243902439,
    "acting": 8.5,
    "ending": 7.5,
    "soundtrack": 10.0,
    "cinematography": 9.0,
    "familyFriendly": 8.642857142857142,
    "funny": 7.913043478260869,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I just finished watching the peanuts movie and was very pleased they did a great job!!! The story and animation was great and they touched on almost everything that makes charlie brown so great!! Im 51 years old and a huge charlie brown fan, and I took my nephew who is 9 years old and he loved it as well. He laughed all the ways through it and when i asked him to grade it he gave it a 10 out of 10< as and adult i would give it a 9 out of ten. The only thing i didn't like was that they used the wrong voice actor for peppermint patties voice, every other characters voice was perfect."
    },
    {
      "rating": "10",
      "text": "I went to see the peanuts movie on 117/15 and thought that the movie was very well written and produced. The books are also very good and the Actors. I think this movie is a learning experience for people with little kids and even for adults. This movie was all about believing in yourself and not lying to people. I am honored to give  the Peanuts movie a 100% rating because of the way the movie was produced and written. another heart warmer for the whole family!!!!!"
    },
    {
      "rating": "9",
      "text": "Great!  They took the classic lines and made it new.   I am 42 huge peanuts fan. Went with nieces and nephews age 5-24 and everyone thought it was great"
    },
    {
      "rating": "8",
      "text": "I have adored \"Peanuts\" since I was able to read, at least as far back as I can remember.    At age 54 I still love the strip for its groundbreaking work, with kids facing adult problems, antics, and artwork that would influence every strip that contained kids.    \"Calvin\" from \"Calvin and Hobbes\" would be impossible without Shulz' being there with his own imagination first, like Snoopy's never ending battle with the Red Baron or other imagined characters like the great \"Joe Cool\", various star athletes or a great novelist.\rSo the movie was one that would be a tough call - make it wilder and decidedly different from the \"Peanuts\" we grew up with, or pay slavishly close attention to the original strip, with some of the classic jokes and keeping that original feel and magic.    Wisely this movie is true Peanuts all the way, the most startling evolution, if you can call it that is the more dimensional characters, a big change from the flat cartoon style previous Peanuts TV and movie productions were.\rWhile this movie won't replace \"A Charlie Brown Christmas\" as the classic and best Christmas special ever, in my opinion, it is a delight for us lifelong blockheads, and we get to see the little red haired girl for the first time!\rSnoopy and Woodstock provide the yucks as this pair work on that \"famous\" novel \"It Was A Dark and Stormy Night\", and Snoopy finds himself rescuing his love Fifi from that despicable Red Baron.\rBut it's Charlie Brown who steals the show, and the movie does focus on what makes Charlie Brown so likable in the first place - a heart of gold, and despite his never ending failures, a spirit that refuses to give up.    It's a good life lesson for all of us, to be the best, most honest people we can be, and never let the world beat us down.    I for one appreciate the conclusion which I won't spoil here, and recommend this movie for all \"Peanuts\" fans, young and old.    The director didn't mess with a winning formula, and Charlie Brown fans worldwide rejoice."
    },
    {
      "rating": "8",
      "text": "The Peanuts Movie!!! I finally got to see the film this Thanksgiving and I would like to start by saying I was totally satisfied and left with a big smile off my face as I left the theater. I know it's really hard to say this,but in the whole theater, there were only two children in a rated G movie!!! It was a great film and has a great moral with it to. It teaches children a lesson of how to be good and get a girl to like you. I would say the first 15-30 minutes are pretty slow, while introducing the characters; but then it got more fun and fun, until I started laughing. The animation is flawless, and pretty much the only flaw I have with the film is when they kept on cutting back to Snoopy's typewriter dream thing. (84.5/100)"
    },
    {
      "rating": "10",
      "text": "The Peanuts Movie Is Great Film Everything This Movie Is Great Animation Is Good , Story Is Good , Music Is Good. This Movie Is Great Job of This Film"
    },
    {
      "rating": "10",
      "text": "It's funny, the characters are well done, and the 3d animation is superb. Personally, although  Charlie Brown's story is good, Snoopy's book is great, and this is a comic strip turned movie done right."
    },
    {
      "rating": "10",
      "text": "What I love most about the animated flick is how well it pays homage to the strip. Schulz created a world that revolved around eccentric. memorable characters that are likable and relatable.  I enjoy how the film forgoes cheesy dick/fart jokes routinely found in other animated movies, and instead implements sophisticated humor that strikes well with audiences of all ages."
    },
    {
      "rating": "10",
      "text": "The classic comic strip is brought to life in the best way possible. The 'Peanuts' movie is a wonderfully inspired telling of the story of Charlie Brown and company. The 3D animation is absolutely on par with any Pixar film, while still maintaining the 'Peanuts' classic visual look. It's amazing to see how well the humor has been adapted for modern children and adults. The older crowd gets their nostalgia, the children get introduced to a classic cartoon in a fresh way, and all the while just being able to sit and enjoy a pleasant story that will leave everyone grinning. It's a warm, heart-felt, simple and humorous movie and gives us a refreshing breath of air from all the remakes, sequels, and superhero films we've been drowning in for the past few years. It's a great family movie, as a 'Peanuts' film should be, and it could give 'Inside Out' a run for the Oscar."
    },
    {
      "rating": "8",
      "text": "It was only a matter of time before Charlie Brown finally get his own movie in 35 years. Then when he and his friends made it to the theaters, it's the best time to go out and see them after all these years. It captures the heart of what they were a long time ago."
    },
    {
      "rating": "9",
      "text": "I've never thought I'd ever call something \"the feel-good movie of the year\" but The Peanuts Movie is exactly that. Everything about it was spot-on from the animation and the voices to the humor and tone. If you're like me and grew up watching Charlie Brown specials, then the feel of this movie will be immediately familiar, yet still seems modern. And the writers (Charles Schulz own children) somehow found a way to include every single Peanuts reference you could ask for without making it feel shoehorned in or patronizing.\r No matter how old you are, you'll enjoy this movie. I guess if you just hate life in general, then you may not like this movie. Or if you require large explosions and shakey-cams to enjoy your theater experience then I suppose this movie could seem dull. But if you're up for a funny, charming, warm, positive film, you can't go wrong with this one. And I know that children enjoy it too because the little girl leaving the theater next to me wouldn't stop talking about it. I challenge you to see this movie and not leave smiling."
    },
    {
      "rating": "9",
      "text": "About as good as a Peanuts movie could be.  I went with my boys - ages 8 and 10.  Great movie to watch with kids - lots of laughs and some good life lessons delivered at the end.  The movie had it all - the red headed girl, the Red Baron, and of course Charlie trying to kick the football at the end of the movie."
    },
    {
      "rating": "9",
      "text": "Wow! What a great blast of nostalgia this was for me! I know that Peanuts has been around for decades and I'm still relatively young (I'm only 19), but I'm still one of millions who grew up reading the Peanuts comic strips in the paper as well as watching the many cartoons they made for them. So needless to say, I was really looking forward to to seeing this so I could sit back and not just enjoy this film, but also reflect back on how much I loved growing up with Charlie Brown and the many other characters, and that's exactly what this film did for me! I loved every second of it and it was everything I wanted it to be! Charming, adorable, and most importantly, very nostalgic! It was also surprisingly funny in almost every moment, much more so than I originally thought it would be! The animation was lively and vivid as well! So overall, it's easily one of the best animated films I've seen all year and one of the funnest films I've seen all year in general! Even if you didn't grow up with Peanuts, it's still an absolutely charming and fun film, but for any and all Peanuts fans and those who grew up with it, this is an absolute must-see! You won't be disappointed!"
    },
    {
      "rating": "9",
      "text": "its a great film from start to finish.  if you love old school Peanuts, you will really enjoy this movie. lots of nods to the old movies, but at the same time the story is told for a new generation."
    },
    {
      "rating": "8",
      "text": "The Peanuts Movie is a funny, beautiful, charming, and an enjoyable watch that gives the classic cartoons justice. Schulz would be proud with what Blue Sky has conjured up."
    },
    {
      "rating": "8",
      "text": "If you are on the fence about seeing \"The Peanuts Movie\", I say just go check it out.  As a 40 year old man, I really enjoyed it.  It is full of throwbacks to the old cartoons, and somehow they found a way to use Meghan Trainor songs without it killing the vibe.  This movie is not just for fuddy duddy oldsters, either.  My kids laughed throughout the whole show.  I did not see the movie in 3D, and thought it was great that way, but I suspect that it would have actually been good with 3D, if you don't mind the glasses and all.  I am tempted to give this the highest rating, but I'm just not sure it would hold up with repeated viewings, so, while I reserve the right to change this grade later, I will give it a \"B\", today.\r The Peanuts Movie\rGrade: B"
    },
    {
      "rating": "9",
      "text": "It's a very nice film! I really enjoyed watching it although there was nothing ground breaking in the movie (Story. animation, setting, etc.) it was something that just made you happy."
    },
    {
      "rating": "10",
      "text": "This is a great family movie and a new instant classic. I was pleasantly surprised of how much I liked this movie. It stayed true to the comics and old cartoons, and didn't try to be something it wasn't. It is now my favorite movie within the franchise."
    },
    {
      "rating": "10",
      "text": "Never has a movie made me put on a ridiculously goofy smile the whole entire length. The characters are well voiced and the soundtrack has many songs from my childhood that i instantly remembered. This movie will go down as an instant classic and is one of the best movies I have seen in a long time. It's sweet nostalgic funny and the work created by shultz himself is well cared for in this movie. Loved loved loved it. Go see it"
    },
    {
      "rating": "8",
      "text": "The Peanuts Movie does exactly what it is supposed to do. It introduces the beloved characters to a younger generation of fans but it does so staying completely loyal to the long time fans. The animation is outstanding and despite the modern update the characters look exactly like they have always looked. The story is simple but effective with Charlie Brown once again being the leader of the pack and Snoopy bringing the laughs with his own little side story. When the movie finishes it is hard to believe that this film was not done sooner and it is certainly one of the best animated film we will see in 2015."
    },
    {
      "rating": "7",
      "text": "Grade:   B+\r In a Nutshell:    How wonderful that a whole new generation is being introduced to the lovable Peanuts.    Hollywood did this one right: they kept the message clean and pure, just as Charles Schultz would have liked it.\r I suspect parents who grew up with the Peanuts will enjoy this more than their kids. This is a classic, simple love story and underdog tale.   While it doesn’t really offer anything new or fresh, it feels like a nostalgic visit with an old friend and plays like a “Best of Peanuts” film.\r Uplifting Theme:\r·    You’re as young as your imagination will allow you to be.\r·    Be kind to others.  We are all fighting our own battles.\r·    Never give up.\r Things I liked:\r·    Meagan Trainer’s cute song Better When I'm Dancin' is adorable and catchy.  You’ll leave the theater dancing.\r·    Snoopy’s timeline is adorable.\r·    Cute Charlie Brown balloons at the school assembly.  I’ll bet you can buy them on Amazon soon.\r·    When I was in high school, I played the little red-haired girl.  Nope, no lines. I just sat there on the stage while Charlie Brown did all the work.  I pretended to pick my nose and eat  my boogers …and stole the scene.  Ha ha\r·    Linus plays Beethoven's Moonlight Sonata , which my mother used to play on the piano while I was growing up.\r·    Fans of Minions will get a kick out of the overly dramatic Snoopy and the sounds he makes.\r·    Keep watching during the closing credits.\r Things I didn’t like:\r·    It’s so true to its source material that it feels unimaginative.  We’ve seen it before.\r·    Paying extra for 3D is not necessary.\r·    Some children who are used to sophisticated animation nowadays may think the simple animation design of the peanuts is too…simple.\r·    It’s weird that so many of the Peanuts characters are balding as young children, right?\r·    There aren’t very many really funny lines.\r Funny lines:\r·    “Is there an emoji for good grief?” – Charlie Brown\r·    “Can a brother and sister get a divorce?” – Sally (Charlie Brown’s sister).   She kind of reminds me of Lisa from the The Simpsons Movie .\r Tips for Parents:\r·    The language gets as bad as “Rats!” and “Good Grief!”   How refreshing.\rIt's sweet and innocent."
    },
    {
      "rating": "8",
      "text": "Written by the younger generation of Schulz, the classic animation sticks nearly to its original source materials and remains traditional style of telling a simple yet unambitious story that is friendly for kids. Diverting from the main genre usually seen in Disney's style, Blue Sky Studio approaches by representing the entire story in a group of kiddos without any significant adults characters and relationship between the parents and children. The story is mainly separated into two parts - the first part on the main protagonist, Charlie Brown is very educable and absolutely suitable for the maturer young audiences while the fantasy part of Snoopy that is full of actions and adventure would definitely serve as great enjoyment for the kids. The combination of colorful CGIs and the unique visual effects are spectacular, charming, adorable and it looks as an upgrade from the comic version. Overall, this remake is definitely a delightful, sweet, warmhearted and nostalgic family fare that stresses on the importance of looking and cherishing at the positive values that each person owns."
    },
    {
      "rating": "10",
      "text": "If you love the original peanuts comic strips and specials you will most definitely love the peanuts movie. It will make the old fans happy well introducing new fans to the franchise"
    },
    {
      "rating": "9",
      "text": "Ok I really don't know what Pixar cocaine reviewers are smoking. Don't get me wrong Pixar makes great movies there is no doubt about that but there is a definite pattern of movies that aren't made by Pixar getting reamed in reviews around awards seasons. Almost to the extent where you can't help but wonder if some strings are being pulled behind the scenes. Is this movie better then Inside Out? No it isn't. However it is one of the better animated films I have seen in awhile.\r Most of the critic complaints I see talk about the movie being too tame. This is just sad. This is more then film this is art. This movie was so well put together and so many critics are not so much crapping on it as they are saying \"it was nice for a few minutes and then it got old.\r I want to make something very clear here. I am not usually a fan of tame movies. There are critics giving this a positive review BECAUSE it plays it safe and is family friendly to the tamest extent. Then there are critics who crap on it because it plays it safe and doesn't have too many risque jokes for adults like so many kids films usually sneak in. I have never been a politically correct person. I have never cared what a movie does or does not contain all I care is that the film is good. This movie is great. Yes it is family friendly and quite tame compared to most G and PG films nowadays. Why is that suddenly a bad thing?\r I love to play Grand Theft Auto and Assassin's Creed just like any other hardcore gamer. Does that really mean absolutely everything we watch and interact with in life has to be depressing? This movie had me leaving the theater genuinely feeling good. It had some nice positive messages. Why is that a bad thing? I don't consider myself a religious person by any means hell if anything I am anti religion, This movie taught good values though. Why crap on a movie simply because it was too safe?\r As a critic when you review a film you are supposed to review it off of the merit of the film not your own closeminded views.I will say it over and over again. This film was so well put together and executed. I genuinely don't understand where my fellow critic's are coming from.\r Now I don't know about you but when I see someone write a review this long I generally check their profile to see if they are just diehard fans of a series or hate something for no reason. You all know the accounts I mean the throwaways giving zeros to hated films and 10s to films we know aren't as good as they are saying they are but they can't help but give the series perfect scores. So I checked my own profile and unfortunately found that for some reason only 2 of my previous reviews show. I don't know if it was a Facebook linking issue or what but 50 something reviews I have written for this site since the site was first online are just gone. I remember writing those two reviews on my cellphone so maybe it synced to a new account or something. So I have no proof of my credibility to offer because apparently it has disappeared into the void.\r From the first 10 seconds of the film all the way through to the end this film is true to Peanuts. Everyone who complains about how safe it is? This is an accurate recreation of a comic strip that has been in the public consciousness since the 1950's. A time when frankly far less was considered corrrect or allowed in entertainment. They could have updated and revamped Peanuts changing it entirely throwing in Spongebob type jokes everywhere. If they had done so though would we really be watching Peanuts? Personally I applaud the film creators for staying true to source material OVER SIXTY years old. That takes some serious cajones. I find it a very sad state of affairs that unless a movie has content A,B,C, or doesn't contain content E.\r As mentioned in the beginning I am not religious at all quite the opposite. There is a 2 second moment in the film where Charlie Brown makes a somewhat religious yet ambiguous comment. I guess hardcore atheist reviewers who feel like a 2 second inspirational message in a 90 minute long film is \"pushing the christianity agenda\" so therefore the film should get points docked. I used to be a professional reviewer I stopped I don't even remember why. I am so pissed off that these \"critics\" get paid to be so biased towards films over the tiniest things. It is very rare you read a film review that doesn't get a good third of its overall score docked because one instant in a film doesn't agree wtih them. There is no realistic scoring method they use. They just throw their comments in and make up a plausible number at the end. Oh wait that is why I left I remember now. Was sick of people dictating to me what I could or could not rate scores because of studio influence.\r This is a great movie. Yes it \"plays it safe\" The source material is SIXTY years old. If it didn't stay true to the original it wouldn't be Peanuts it would be something else. Watch it then judge for yourself."
    },
    {
      "rating": "7",
      "text": "\"The Peanuts Movie\" is very, very charming and enjoyable, but overuses its weak plot with Snoopy and the Red Baron and doesn't bring anything fresh to the screen. You'll still have a great time watching the beloved characters."
    },
    {
      "rating": "7",
      "text": "It's not the perfect animated movie, that goes without saying but something about the peanuts movie placed a large grin on my face. I enjoyed that this is probably one of the furthest movie's away from being meta and technologically annoying as one can get. For this film, it works absolutely giving Charles Schulz's legacy a humble but not too ambitious applause. The pacing is a little uneven with the snoopy/red-baron segments and seems to unceasingly draw away from a great focus on Charlie Brown's character (somewhat lurching simple morals into his story as well that don't mesh together healthily). Don't get me wrong, Snoopy and Woodstock were absolutely fantastic in this movie and crisp, classic and styled animation wraps the animal team in a warming bow."
    },
    {
      "rating": "10",
      "text": "A family fun film for the whole family. Brings back the good old stuff we enjoyed from the older Peanuts movies. Filled with fun humor, a little adventure, and heart tugging and warming moments. This movie even made a Meghan Trainor song sound pretty good in an animated film. A must watch for anyone who grew up enjoying Peanuts!"
    },
    {
      "rating": "9",
      "text": "Once in a while you are treated to a movie that is simple and unassuming. The Peanuts movie successfully captures the spirit of the comic strips and peanuts specials. The animation and CGI are well done by the folks at Blue Sky Studios. They managed to balance the vintage charm of the Peanuts characters with the tools of modern animation. It was also nice to see little bits of penciled animation juxtaposed against the more modern CG look. The story is simple and enjoyable. It did something a lot of films don't do often. It put a smile on my face. When I walked out of the theater I couldn't help but feel like I had a bit of extra spring in my step. I think everyone has a bit of Charlie Brown in them."
    },
    {
      "rating": "8",
      "text": "The Peanuts Movie was a wonderful movie made ​​me laugh a lot , with stories of Charlie Brown and Snoopy , there were mixed feelings and a very good score for Blue Sky Studios."
    },
    {
      "rating": "7",
      "text": "The Peanuts Movie manages to stay true to the classic comics by Shultz, while also giving us exciting and action packed scenes with Snoopy chasing down the Red Baron. It doesn't try to impress today's generation with explosions and giant killer robots, but instead intrigues the viewer with nostalgia, comedy and gentle storytelling. A masterpiece Shultz would be proud of."
    },
    {
      "rating": "8",
      "text": "The rarity... A contemporary big-screen adaptation of a classic cartoon that isn't dumbed-down for today's kids in any way. It captured the spirit of the comics wonderfully and it's a great way to introduce your kids to the world of Peanuts. The animation was really well done and I loved how it was made to look like a mixture of CGI and Shultz's drawings. The scenes with Snoopy and the Red Baron were some of my favourite scenes- because after all, who doesn't love Snoopy? Woodstock was great too. The movie stayed admirably true to the source material with the same basic storyline of Charlie Brown trying to reinvent himself and the result was both nostalgic and sweet. If you like Peanuts, this is the movie for you! Sparky would be proud."
    },
    {
      "rating": "10",
      "text": "The movie was incredibly well written and filled with tons of throwbacks to what I grew up with. I for one watched the specials first and read the comics every Sunday, then later in life read the original comics. I love Snoopy and the rest of the Peanut's gang. Very simple life with some big questions thrown in. I strongly disagree with the negative reviews left on this film and had to say something. The reviews that say don't support this movie because it teaches kids to be okay being \"a loser\" is entirely wrong and borderline stupid. It's about TRYING and sometimes things don't go your way. Obviously Charlie Brown knew how to fly a kite, and it just doesn't work out for him. He never gave up though and he was even able to teach someone else through his experience. I thought the movie was absolutely perfect and Schulz would have been proud. I mean sure, he wanted \"flat\", but this movie did it justice. And the dance moves of every character.. that was icing on the cake to me. No trying to reach a generation that prefers more pervasive styles of dancing. The movie was perfectly classy and totally worthy of being called The Peanuts Movie."
    },
    {
      "rating": "8",
      "text": "While bringing backrefrences from the original charlie Brown, the both of the storys hear have heart, and creativity. With amazing animation, story, fans of old and new will have something to love."
    },
    {
      "rating": "8",
      "text": "Some of the best \"camera\" work I've ever seen from an animation. What I mean is that the way some scenes are layed out are incredible. It surprises me that such scenes have not been accomplished before since you can do just about anything with the direction and angles of an animated film. What Martino does is direct some incredible shots through animation seen most prominently in the various flights and battles of Snoopy's imagination and encounters with the Red Baron. The film is basically an equal balance between an adorable throwback story that brings Charlie Brown and all his insecurities pouring into the screen and an entertaining gag following the imagination of Snoopy. This scheme proves to work perfectly, balancing both heartwarming charm and entertaining humor. It's definitely one for the children and will sure to please the likes of them all, but it's an entertaining film for the parents in the room as well. In a year absent of Inside Out this film could easily have been Oscar-winning. It's a must-see for all movie-goers."
    },
    {
      "rating": "8",
      "text": "You made me cry Charlie Brown. Peanuts is a heartfelt film that will serve as a good introduction to Peanuts for children and remind adults why they fell in love with it to begin with and maybe appreciate it more. The characters are the way you remember them brought to life by some amazing child acting. Charlie Brown is the loveble loser and his episodic stories to charm the Red Headed Girl are touching and relatable. The ending may be a little out of character for the franchise but it is well earned and made me tear up. The fact that Blue Sky made a film of this quality is incredible because it is excellent. They bring they great animation to the forefront again providing a style that captures the spirit of the comic strips, take notes Sony Pictures, but are able to compliment it with a wonderful story. Some Snoopy scenes are filler, there is one pop song too many, and I wish characters like Schroder had more to do but the elements that work overshadow everything else."
    },
    {
      "rating": "9",
      "text": "\"...who does that?\" \"-Only Charlie Brown.\"\r In the last few years I have not got tired to praise in my review for those my childhood tv favourite cartoons successfully transformed into 3D animations. After 'Tintin', 'Doraemon', 'Asterix', 'Mr Peabody' 'Winnie' and a few others, now this movie joined the club. I'm waiting for many more like 'Garfield', 'Kim Possible', 'Calvin & Hobbes' et cetera to make its way.\r 'Peanuts' characters considered one of the beautiful cartoon characters, just like 'Calvin & Hobbes'. They're simple drawings, yet very cute and delightful. These are mostly best suited to render in 2D animation, so till I watch them in 3D I always had a curiosity and doubts. This film is still a mix of both styles  - like eyes, mouth, dusts and in the side view, it was 2D drawing, but overall characters and backgrounds are 3D.\r It was so good movie, for the 90 minutes I became a child again. As usual, there were two tales, one was Snoopy's fictional account and the others' Charlie Brown's crush on a little red-haired girl. Both of them were great, but I liked Charlie's a lot.\r Once the animation was considered only for the kids, but now the world sees it differently. This film had an excellent box office. So definitely there will be a sequel. My only upset is it failed to do good at Annie awards, but anyway, like Disney studio says, that award ceremony is a joke and a disgrace to animation and animation (movie) fans.\r 8½/10"
    },
    {
      "rating": "7",
      "text": "The Peanuts Movie is full of nostalgia but also full of charm. The animation is beautiful, the characters true to their source and the plot decent. Overall, short and sweet."
    },
    {
      "rating": "8",
      "text": "Probably one of the most satisfying animated films I've seen in the last 5 years, and mainly because of the sharp attention to detail from the original material. People who grew up with classic Peanuts will adore this film."
    },
    {
      "rating": "7",
      "text": "I actually think this film is pretty decent. It manages to capture the spirit of the original. I do hate some if the humor in it but there are still some decent scenes. I think this is a good ending to the franchise though....."
    },
    {
      "rating": "9",
      "text": "The Peanuts Movie = nostalgia. People who read the comic strips of Charles Schulz felt exactly this feeling. The Steve Martin film is very faithful to the essence of personagense showed a fluffy and cute film and brought a different version of the original plot, but still pleasing longtime fans."
    },
    {
      "rating": "9",
      "text": "Once in a while you are treated to a movie that is simple and unassuming. The Peanuts movie successfully captures the spirit of the comic strips and peanuts specials. The animation and CGI are well done by the folks at Blue Sky Studios. They managed to balance the vintage charm of the Peanuts characters with the tools of modern animation. It was also nice to see little bits of penciled animation juxtaposed against the more modern CG look. The story is simple and enjoyable. It did something a lot of films don't do often. It put a smile on my face. When I walked out of the theater I couldn't help but feel like I had a bit of extra spring in my step. I think everyone has a bit of Charlie Brown in them."
    },
    {
      "rating": "9",
      "text": "That Movies was Amazing!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!11!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!11"
    },
    {
      "rating": "9",
      "text": "If you grew up on Peanuts like I did, you'll definitely like this. They even attempted to match the voices of the original 1960s peanuts characters all though the hair color is a bit suspect.  But if your're one of the many millennials or gen Xer critics that gave this a bad review because you never read a Peanuts comic or seen a Peanuts cartoon and can't understand the nostalgia older people have for it, you would be better off spending your money on some Anime cartoon or Xbox game."
    },
    {
      "rating": "8",
      "text": "Peanuts brings back every thing that made the Charlie Brown and company enjoyable to watch.Capturing the magic that the Holiday special offers The Peanuts movie succeeds in every aspect from a charming and creative story to an funny one as well, Overall, Charlie Brown and his pals made a great transition to the big screen."
    },
    {
      "rating": "10",
      "text": "I was at DIFF (Dubai International Film Festival) to see this and the movie was spectacular.The animation was very well done and the movie was very inspiring and creative!Plus,the director Steve Martino,the producer and son of Charles Schulz,Craig Schulz and a Snoopy and Charlie Brown mascot was there for an extra treat!My favourite part (spoiler alert) was at the end why the Little Red Haired Girl actually liked Charlie Brown and she said some very inspiring words!For these reasons,I give The Peanuts Movie 10/10!"
    },
    {
      "rating": "8",
      "text": "It brings the comic strip to life with stunning animation and voice acting. Honestly I've never seen an animated movie with such a unique look. An absolutely gorgeous treat for the eyes. Of course, while appreciated, a high-quality level of animation isn't enough to carry a film. A pretty exterior would have meant nothing were the insides of the film just as pleasant.\r Thankfully \"The Peanuts Movie\" is filled with heart, humor, and charm. There's a nice lesson about how failure doesn't define you. That even in the face of mistakes you can still be a winner by staying true to who you are and being a good person. That's a message that's just good for adults to hear as it is for the children that will be watching this movie with them.\r It's a great flick for the entire family. The jokes do perhaps lean a little too much on physical humor. People fall, slam into things, and get hit by objects for the majority of the film. However there are smarter bits of verbal humor that will appeal to a larger audience. That being said, it's physical bits are still regularly funny, if a bit exhausting.\r The Peanuts Movie is a genuinely great movie. One with heartwarming moments to go along with it's barrel of laughs. For older audiences it's going to feel welcomingly familiar. For those who have never experienced the world of Snoopy and Charlie Brown, well it's one heck of a great way to get introduced."
    },
    {
      "rating": "1",
      "text": "I took my 11 year old twin daughters to see Peanuts, at their request.  I will say the animation was well done and creative.\r I grew up reading Peanuts in the newspaper and in book form.  I watched all the specials growing up.  At first the movie seemed cute, as I remembered all the old comic strips.  After about 15 minutes the novelty wore off, and I was getting a little bored with the movie.  I got to the point of checking off all the things I remembered of Peanuts when I was a kid, then that got boring.  By the end of the movie I felt like I spent a hour and a half reading old Peanuts comic strips I had read over and over again, when I was 10. I have no interest in rereading old Peanuts comic strips.  I could not wait for the movie to end.\r My daughters reaction was tepid at best.  I don't think I heard them laugh once, and they struggled to find something positive to say about the movie after we left.\r For parents of children under 9 years old, seems like a safe movie the kids will enjoy.  If I had to spend much more time in the theatre watching this, I might have started banging my head against a wall."
    },
    {
      "rating": "4",
      "text": "Deceptively named \"The Peanuts Movie\" when it'd be more accurately titled \"Charlie Brown Falls in Love.\" So, this animated film is more for young girls than anyone else. And like most Peanuts shows you've seen, you'll quickly bore with the '60s characters, various family members fell asleep throughout. And some of that falls on the animation, too, which was fine but certainly not made for renown. IOW, it's not a Pixar presentation."
    },
    {
      "rating": "4",
      "text": "It will get good reviews from those who take the nostalgia bait that this movie is clearly going for, but for others - including me - this is a cynical cash grab on a well known licence that lacks any of the heart and soul the original material had.\r The problem is that it isn't funny or charming. It has little narrative structure and instead comes across as a splash of ideas, old and new, that haven't been formed properly. It has no right being a movie - maybe if this was a series of shorts on a kids TV channel, it would have worked better, but it certainly doesn't fit the movie format.\r It gets points for masterfully bringing the animation up to modern day levels, but visuals and a slapdash attempt to hook nostalgia alone does not a good movie make."
    },
    {
      "rating": "3",
      "text": "Peanuts nostalgia yes. After 20 minutes bordom  set in quick. Snoopy and the bird are hilarious but the charlie brown sucks became a chore to watch.The animation work is solid. I had a few laughs. This is not one of the better movies out there ala"
    }
  ]
}