{
  "id": 2794,
  "title": "The Possession of Hannah Grace",
  "starring": [
    "Shay Mitchell",
    "Grey Damon"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Drama"
  ],
  "description": "When a cop who is just out of rehab takes the graveyard shift in a city hospital morgue, she faces a series of bizarre, violent events caused by an evil entity in one of the corpses.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hDDb0H0uJp2wjoJBbBHbKlYRbug.jpg",
  "categories": {
    "plot": 5.454545454545454,
    "acting": 5.6,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 2.6666666666666665,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Bad throughout.Waste my money.This 'horror'movie?is it horror?Why I think it's a comedy and sex film?"
    },
    {
      "rating": "4",
      "text": "Like, it’s not bad, it’s just one of those movies where as you watch you instantly think of simple things that could have been changed to make it better..."
    },
    {
      "rating": "7",
      "text": "Super creepy but rather predictable.  A decent plot with some great effects.  Not a bad \"horror night\" flick, just not anything terribly noteworthy."
    },
    {
      "rating": "4",
      "text": "This movie for me is just \"meh\", I expected more sincerally, umpf who cares, now the horror movies are so before you stand in front of a beautiful trailer with a hype high up like a mountain and after having some doubts about how it could be in the truth the most sincere film, even if you started with average expectations, you're dissapointed like a brick..."
    },
    {
      "rating": "6",
      "text": "If you see a lot of horror films, you may find this one interesting. It’s not a great film, but the cast is more than competent and the director shows promise. The script has a few interesting twists (no, I am not making a joke about Hannah’s double-jointedness, which is probably one of the least interesting things about the film) and I wasn’t bored. This is probably because Shay Mitchell was interesting to watch, and the rest of the cast was pretty good also. And there wasn’t a lot of exorcism silliness except at the very beginning. This film is more like “The Autopsy of Jane Doe” and less like “The Exorcist.”"
    },
    {
      "rating": "10",
      "text": "Teniendo en cuenta lo mediocres y malas que son las películas de este tipo, debo decir que esta me tomó por sorpresa y me gustó bastante pese a que no le tenía fe, la mala crítica puede que tenga razón y la respeto pero a mi pues si me gustó, resulta ser divertida."
    },
    {
      "rating": "4",
      "text": "Sin mucho mas muy lenta un poco absurdo el argumentoLo mejor de la pelicula fue: el final que porfin me pude ir del cine."
    },
    {
      "rating": "6",
      "text": "The Possession of Hannah Grace is by no means a must-see, but I found it to be a decent time-waster.The movie has a nice sense of direction. The beginning, where main character Megan gets a job working the night shift in the morgue in the basement of a city hospital, is especially well-done. Major exposition and the workings of the hospital is introduced in a quick and natural manner.The hospital in this is appropriately creepy, a blend of grey concrete blended with cold, sterile white floors.The possessed body of Hannah Grace is an affective monster. She avoids being being a generic zombie/possesed person by having a distinctive look being partially slashed and burned. Heck she's scary when she's just lying still before she's even doing anything. (I'm actually disappointed they didn't stick with the film's original title of The Cadaver). Contortionist Kirby Johnson really kills it as Hannah, not only in her freaky movements but also in her malevolent facial expressions.Despite the praise I've just given, there is one big issue wit the film: the second act is just too slow and could've been cut down, which is disappointing given how fluidly it started. The problem is that they have one too many victims and spend a little too much time introducing them and building up to the kills."
    },
    {
      "rating": "5",
      "text": "The Possession Of Hannah Grace definitely has its moments of horror and shock value while delivering a setting that will have you disconcerted throughout. However, there are a few moments where it does start to get repetitive, as it delivers weak CGI, poor editing during certain scenes, and dull characterization. As a horror fan, it's a ten out of ten in my heart, but a five out of ten in my brain."
    },
    {
      "rating": "6",
      "text": "The Possession of Hannah Grace is an interesting horror movie. The director, Diederik Van Rooijen, was able to create an atmosphere that was terrifying and had me on edge for the first half of the film. At first, the different scary scenes would be a lot to take in with the cracking noises of bones moving with the unusual body movements. After a while, it became predictable and was something that stopped startling me. The main character has a form of PTSD that is used more as a plot device than an actual part of her character. It is something that keeps her inside the morgue even though she definitely could have left a dozen times when things appeared bad. The second half of the film lost momentum. The story seemed like it was not finished and they were just winging it. Overall, The Possession of Hannah Grace could have been a lot more, but instead gave up the interesting story it once had for a more typical approach."
    },
    {
      "rating": "0",
      "text": "This is a movie about very incompetent lady who fails as a cop, gets PTSD and after chooses to work alone in a morgue from all places. And she is terrible at her new job as well. Also there is some evil entity and poor attempt at acting.Seriously - big budget does not equal good horror. Avoid."
    },
    {
      "rating": "3",
      "text": "I give it credit because it tried to give a spin on the devastatingly wornout formula of exorcisms and possessions but frankly it wasn't even able to be a little close to the level of its own ambitions and ends up as a huge failure."
    },
    {
      "rating": "4",
      "text": "Well, the beginning got off to a rocky and rather poor start! As this train wreck unfolded, so did the cliches and the dramatic Hollywood sets, all equipped with \"overly done\" use of red lights and \"dark shadows\" effects. Poor acting, very unimaginative story. Not good... not good at all."
    },
    {
      "rating": "3",
      "text": "The worst horror movie I have watched in the past 4 years. Its just terrible. Love all the Insidious, Anna Bell, and Conjuring movies hell even the last Saw did a better Job at being a horror movie than this. The Movie \"The Nun\" is amazing! Loved it. But this? the possession of Hannah Grace is just an utter pile of trash. Its a Solid 3 for me and a thumbs down."
    },
    {
      "rating": "5",
      "text": "No asusta, la historia es mala, la protagonista quieres q la maten ya, y termina X"
    },
    {
      "rating": "8",
      "text": "I rented this on a lark, and it was scary as all get out right out of the gate.  The story has a unique twist in this genre, and the actress who plays the creature is truly horrifying, even lying motionless.  This film borrows a bit from the old Wolfman classic in that there’s an undercurrent of mental illness in the lead character.  It’s also nice to have a horror film that takes a pass on the obligatory sequel, and has a real ending."
    },
    {
      "rating": "5",
      "text": "First thing i Wanna say that shay Mitchell acting is amazing love her"
    },
    {
      "rating": "4",
      "text": "This movie is beyond a waste of my precious time!!!!! Mad too many movies like this one are the same. this genre needs a face lift."
    },
    {
      "rating": "3",
      "text": "Missing the platform of the characters, bad character building, nice idea though! But not really good writing. Tell dont show was their strategy."
    },
    {
      "rating": "2",
      "text": "The Possession of Hannah Grace is a complete waste of time. The movie doesn't bring anything new to the table, it is very predictable and boring at times. The Characters were boring and sometimes felt like a robot, and the \"Demon\" that possessed Hannah felt like a Marvel villain. All of the humour doesn't land at all, the so called \"jumpscares\" or \"scary\" scenes didn't land either and the dialogue mediocre to ok. I'll give it one thing, the plot is ok but delivered very poorly."
    },
    {
      "rating": "0",
      "text": "Dont watch! Too much talking.. the movie isn't scary. Jxjdhdhdhfhfhdjdjdjdj"
    }
  ]
}