{"id": 4597, "title": "The Gambler", "starring": ["Mark Wahlberg", "John Goodman"], "runtime": 111, "genre": ["Thriller", "Crime", "Drama"], "description": "Literature professor Jim Bennett leads a secret life as a high-stakes gambler. Always a risk-taker, Bennett bets it all when he borrows from a gangster and offers his own life as collateral. Staying one step ahead, he pits his creditor against the operator of an illicit gambling ring while garnering the attention of Frank, a paternalistic loan shark. As his relationship with a student deepens, Bennett must risk everything for a second chance.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kL7DfJIje1srf8yliRiMjFEqLtM.jpg", "categories": {"plot": 4.96, "acting": 4.631578947368421, "ending": 5.142857142857143, "soundtrack": 4.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0, "action": 6.6}, "reviews": [{"rating": "3", "text": "Mark Wahlberg plays a college lit professor (yes, you read that right) and he simply isn't up to the dramatic demands. The script is pretentious and full of philosophical contemplation, which makes an already tedious film even more painful coming out of Wahlberg's mouth (John Goodman and Jessica Lange show him how it's done). He plays a compulsive gambler who gets deeper and deeper into debt, but seems more concerned about the meaning of his existence than his massive liability. It's all people posturing and contemplating, there's virtually no action and the pacing is glacial. Wahlberg should stick to comedy and action."}, {"rating": "4", "text": "An English teacher leads a double life as a gambler. When he owes big, he borrows from a gangster and offers his own life as collateral, immersing himself in an illicit underground world that could cost him his life. Wahlberg never convinces as an English teacher and the film never seems to gain enough momentum to warrant the viewers interest. Dialogue heavy, and with an inflated sense of its own self importance, its a hard slog to get to an unsatisfying conclusion"}, {"rating": "5", "text": "Even a worthy performance from Mark Wahlberg doesn't help us care about Jim Bennett and his poor decisions. Sure, gambling is an addiction. We as humans often sympathize with addiction - but that is lost somewhere along the way here. Still, there is no doubt that Jessica Lange and Brie Larson are at the top of their game."}, {"rating": "4", "text": "This one should have stayed as an original, no need for a remake. In reality though this is the formula for Hollywood these days, recycle and reuse with new actors, same story.\rNot much depth here, Mark Wahlberg plays a professor who has a gambling problem and gets in deep. He begs a few different characters to bail him out and end the end, sets himself free (as well as his student girlfriend - played by Brie Larson).\rIn summary, wait for rental or VOD. Not worth it at all. The only saving grace here was Wahlberg pretending to be a professor (mildly funny) and a bad gambler (believable)."}, {"rating": "4", "text": "The Gambler is one depressing, worthless movie. It takes the original 70's James Caan version and spits it out like wood from a wood chipper. mark Wahlberg talked about how this was the \"role of his life\" and he actually lost 61 pounds for it. Now I don't' know what Marky Mark saw in this movie, but I can tell you that there are no redeeming qualities whatsoever. Any message trying to poke through in this movie is squandered by bad screenplay, a clumsy script, and a depressing atmosphere. Some people hate these types of movies, but here's the thing: I usually don't. When they're this bad though, I don't see how anyone could find anything wholesome about them.\r Here's how the movie goes (no spoilers, but no one should see it anyway): lit professor Jim Bennett (played by Wahlberg) takes out gambling loans from people you don't want to screw with, blows it all in one night, can't pay it back, and gets beat up for it. The thing is, he is suicidal and doesn't even care if he lives or dies. This happens over and over again, without variation. The only reason at all that I'm giving this movie a 4/10 instead of a 0 is because of the performances, with were the reason I sat through it until the end in the first place. Marky Mark plays his usual \"guy angry at something all the time\" role, and John Goodman stoically sits on a pool bench with fat hanging off of him like President Taft in a bathtub, threatening to kill Mark if he doesn't pay back his money. What an original character he is, ain't he?"}, {"rating": "5", "text": "Understated and kinda nice.\r The Gambler isn't so much about a guy addicted to gambling as it is about a guy who's allergic to his life. See this one for the performances (they're great especially John Goodman) not the story - it just left me feeling hollow."}, {"rating": "3", "text": "This movie was disappointing.  1) I love gambling, 2) I love a good action/suspense/crime story, and 3) mark Wahlberg is often quite tolerable.  This move however, has a few terrible flaws: 1) Mark Wahlberg as \"literary genius\".... nuff said, 2)  there is no discernible ending or \"point\" to the movie. 3) When someone gambles, he either loses or wins.  What does either outcome have to do with character development, message, theme.  so much of the movie is just based on a coin flip.  I had high hopes, but it just fell flat."}, {"rating": "3", "text": "I just had a very hard time believing that everything that happens in this movie would actually happen in real life, even to the most hardcore addictive gamblers in the world. That and the fact that Wahlberg just seems out of place throughout the entire thing. He spends the first 3/4ths of the movie spouting philosophical nonsense bout victory and death, all the while losing over half a million dollars gambling just because. Then the ending takes an extremely different turn and just doesn't go well with the rest of the movie. The rest of the cast here just feels stiff, except for John Goodman as he is easily the best part of the movie. But the rest of it is just a hodgepodge of terrible ideas and acting, to go along with the lack of emotion that's given by each of the characters. I wouldn't waste my time seeing this if I knew what I knew now. This is just not a very good movie."}, {"rating": "2", "text": "The Gambler is a horrible wannabe gangster film that features Mark Wahlberg mumbling throughout the entire film. Movie is poorly constructed and features some of the worst song placement I've seen."}, {"rating": "5", "text": "Mark Wahlberg was good, even though his character was rambling most of the time. In fact, the entire movie seemed to be rambling about nonsense most of the time. However, there was tension and it did have some entertaining scenes."}, {"rating": "4", "text": "Put together well and solid. Contrary to the view of many others, I actually thought Wahlberg acted well. Not the biggest worst crap I've ever seen. However, one does not simply copy 'Rounders'."}, {"rating": "3", "text": "This is one of those scripts that was probably better on paper for on the screen. The movie is a slow slog through a convoluted plot involving a college English professor who is a compulsive gambler with a $260,000 debt to mobsters he has to pay off in seven days or suffer fatal consequences to himself and his mother. The lengthy dialog scenes  take place in various underworld hangouts that only a  movie art director could imagine. The cinematography, editing and music contribute little of value to the screen action. The result is an instantly forgettable movie not worth watching for free."}, {"rating": "5", "text": "I think I liked the James Caan version from way back.  While this one had some different plot lines, the answer to why he is the way he is, is not addressed.  While I like Mark Wahlberg in action movies (Planet of the Apes, Italian Job, etc) in a dramatic role (more talking) he seems out of his element.  The worst part is the Hollywood ending."}, {"rating": "1", "text": "This was the first movie where I left the theater before it was done. Awful movie, I thought Mark Whalburg was a better actor than this piece of crap, but I guess not. It's not interesting, not gripping, stupid and had me hating myself for wasting admission. I wish I went to see big hero instead."}, {"rating": "1", "text": "The Gambler had something going for it. It had a talented director- Rupert Wyatt who brought us 2011's Apes and a talented actor- Mark Wahlberg. But, it was an unexpected mess of a movie. The story dragged on and on and on! Mark Walhberg, oh my gosh man! What went wrong there! He is a mess, he can't deliver the snappy lines and the acting smirks that others can. The highlight of the movie is John Goodman as a casino boss. Ignore this movie, but if you like Marky Mark and long movies, give it a rent."}, {"rating": "3", "text": "Honestly was not a fan of the movie at all. The best way I've been able to describe it was that Mark played the male version of the manic pixie dream girl and made it worse than usual. I don't think it had anything to do with his acting though, more that it was what they wanted to do with the character. Members of my group enjoyed it though so it's subjective."}, {"rating": "7", "text": "Overly talky movie that improves as it goes along. You can feel the writer sitting as his desk hammering out these long monologues which never, never ever, would occur in life. And Marky Mark as an English professor is pushing it. What is next, Sasha Grey playing a  nun?"}, {"rating": "10", "text": "I  give the Gambler 10 stars out of 10 I thought Mark Wahlberg was excellent as the gambler I thought his mom was superb I recommend this movie to everyone.The sound score was off the chain !we went to see into the woods earlier I am so glad that we went to see that first cause if we wouldntwewould've had a very unsatisfactory evening."}, {"rating": "8", "text": "Very good movie! 7.5 out of 10. The story was new, engaging, and relatable I think to a lot of people (we all have our demons). The acting was top notch from Wahlberg and the rest of the cast. There really wasn't a lot wrong with the movie. I do think the end was a little predictable but it doesn't take away much."}, {"rating": "10", "text": "This film reminds me of Drive with Ryan Gosling that was misunderstood by most but was an superb film. It is tense and beautifully acted by virtually every player. I think most of the narrow minded sub intelligent viewers who disliked the film were hoping for more explosions, having not had their fill with the pathetic Expendables franchise. What you'll find here is passionate acting, a gripping story line and an amazing score. Bravo."}, {"rating": "6", "text": "\"The Gambler\" is passable, but it's forgettable and there's a huge waste of potential that detracts from the film. Director Rupert Wyatt (\"Rise of the Planet of the Apes\") and writer William Monahan (\"The Departed\") ought to have delivered something with a lot more substance than this. It's relatively entertaining don't get me wrong (John Goodman's comic timing is impeccable) but unless you're a Mark Wahlberg fan I'd give this one a miss."}, {"rating": "8", "text": "I saw \"The Gambler\" tonight, and I thought it wasn't a bad film at all.  I really don't understand the bad reviews some have given it.  I totally concur with the more positive reviews, and I would agree somewhere around the 82% mark review from the leading Metacritic reviewer, though I do realize it won't make everyone's Top 10 List of 2014.  The parts with Lange were absolutely electric.  If she had one, ESPECIALLY two more scenes, she would definitely be in the conversation.  I am frustrated she didn't have a scene towards the end of the film, but not too frustrated to be grateful to have been a part of seeing the film.  The theater was surprisingly a packed house, and there was SEVERAL ''oohs'' and ''aaahs,'' mixed in with laughter, but the ending, which should have been a momentous awakening style shot, was left very lukewarm (shot of the vacant lot for 35 seconds), so the anticlimactic aspect kind of left the audience w/the tiniest of a puzzled murmur, considering it was intended to be the sentimental/feel good way of ending.\r -  I am going to go out on a limb (and if I'm wrong, who really gives a $hit), and predict Lange in my 5th slot ... not b/c I'm a super fan, but I really feel she did the best she could have w/the screen time allotted, and I'm not one to bet against her, in any acting race/scenario, because I have seen her magic happen before, come awards time).  Who knows, maybe Lange could be more 'in the conversation' had \"The Gambler\" been released a month ago.  Also, when you watch the film, let me know if you feel that her deep/whiskey voice is as alluring as Kathleen Turner's voice, back in the 80s."}, {"rating": "7", "text": "Showing that gambling is a weakness, an illness, an addiction.  How a person can lose it all by gambling.\rHow gambling is related to criminal circles."}, {"rating": "8", "text": "This film remained interesting and cinematically pleasing throughout. I found myself on the edge of my seat, cheering for the main character, largely due to a spectacular performance by Mark Wahlberg. Wahlberg was also surrounded by great supporting actors, most notably John Goodman. The film also had one of the best time-lapse sequences in recent memory. This is a great, fun ride that should be seen by all film enthusiasts and others alike."}, {"rating": "6", "text": "The Gambler is about a college professor who is addicted to gambling and just doesn't give a [expletive]. It's amazing how many times he is provided a way out of his debt but he decides to make things worse for himself instead. It's well acted but the story just wasn't the most interesting. It's far from a must-see but I enjoyed it overall (a 5.7 user score sounds precisely accurate to the movie's quality)."}, {"rating": "6", "text": "A better movie would have been about Stuey Ungar.  This movie was boring, and left me feeling like ok.  Stuey Ungar had a much more interesting story that was similar to this, but much more exciting."}, {"rating": "8", "text": "I think movie is good , some parts little bit slow .. but its really good also exciting.\r Watch it online for free: https://www.primewire.ag/watch-2756448-The-Gambler-online-free"}, {"rating": "6", "text": "I enjoyed the Gambler for what it was, a competent film with a few flaws. The lead played by Mark Wahlberg is hard to sympathise with as he goes far beyond the pale with regards to his gambling problem, but worse than that spends a good portion of the film spouting pseudo-philosophical drivel.\r I'm giving the film a six because there were genuine moments of tension and the final ten minutes were fantastic"}, {"rating": "5", "text": "This is a crime drama film with themes including hope, desperation, greed and risk. Its one of those films whereby the main character isn't very likeable from the start but there is more than meets the eye. I found this film to be a slow watch - the plot is quite slow in terms of pace and build up generally. I felt that, while the film is called what it is and features gambling quite heavily, its not, ultimately, about gambling but moreso about hope - more specifically losing hope. The main character, Jim, comes across as clearly quite apathetic, feeling like he'll be permanently stuck in a rut. He does seem someone who at first isn't greatly bothered about what might come to him but I don't think thats necessarily entirely true. There is a definite numbness about his character, so I felt anyway. He seems a bit of a mysterious enigma type character, with very little in terms of character development or, more specifically, his background, shared with the viewer in the first hour or so. I didn't feel that this was a greatly immersive, stylish film which really intrigued or fascinated me but it was ok. I gather its received a lot of negative reviews and I can certainly understand that but I think that its a film which isn't entirely about what it seems to be about, as I say its more a tale of apathy and also of consequences, it just so happens that its in relation to gambling debts. I imagine that many people nowadays can relate to the situation that Jim finds himself in, having had to turn to any and everyone for financial help to pay loans and feeling like he has no control over what will happen. I think if you can relate to his circumstances, rather than all the details involved, then you may find this a poignant watch. There is a certain element of morality in it, its perhaps an adult urban warning story of sorts, not for young kids due to the strong language (more on that later).It is regarded as a thriller film but I'm not sure I'd classify it as a thriller as such, in as much as there is little in the way of fast paced action type scenes - no big explosions or the like. Its much more dialogue based, although I didn't think the dialogue was particularly sharp witted. There is a lot of swearing present, I guess to add to the gritty urban feel, although it did make it seem a bit lazy to me.Cast wise, Mark Wahlberg plays the main character, Jim Bennett. As I've said, he isn't particularly likeable, certainly at first, although I don't think the film was unwatchable because of it. Its a bit difficult to explain how, or why, the film works but in one sense I think it does. Anyway, Wahlberg does alright at playing a jaded, often low key adult, who comes in to his own in certain circumstances but who is shown to be clearly out of his depth, regardless of numerous things. Aspects of his character probably appeals to some people but I wouldn't say thats a good thing(!) - think smugness and the like. I wouldn't say this Wahlbergs best performance by any means but there are probably worse people out there for such roles, I suppose - he portrays the down and out desperate guy not too bad, although you could argue if its a good thing or not. Meanwhile, Brie Larson plays Jims love interest, a student called Amy Phillips. Again, she does ok but isn't especially great as such. Other cast members include Jessica Lange as Roberta and Michael Kenneth Williams as Neville, plus John Goodman as a gangster called Frank. The music wasn't particularly distracting, although it was perhaps mildly cheesy on ocassion. It didn't strike me as overbearing though - mind you, if you don't like music with a strong bassline then some scenes may be off putting. It features some good use of incidental music in key tense moments, to obviously add to the atmosphere at that time.Content wise, there is a lot of quite strong language present throughout, as previously mentioned. It also contains some moderate violence, including bloody violence, with injuries shown on the relevant character. There are a few scenes whereby there's a sense of tension, with arguments and the like taking place. The film carries a 15 rating to reflect this.I wouldn't say this is a stylish film in the way that the Oceans films are but the camerawork used, with shots shown from inventive angles (far corners or from the floor up and the like) plus the low lighting and so on did help add to the tension and made it, I felt, a bit more interesting and watchable somehow.This isn't really a greatly memorable film as such but it is alright. The story is hardly original I suppose but I did feel like it had a wider message than the obvious one hinted by the title and I thought that for those who can relate to the main themes, they may quite appreciate it. Enjoy it wouldn't seem like the right kind of wording but appreciate does."}, {"rating": "7", "text": "I did like this movie but full disclosure, I love gambling movies. This movie tries a little too hard but it’s entertaining."}, {"rating": "10", "text": "This is a thrilling action pack movie surely must watched.. Plus jessica is firstly seen in such film. She could also have played like a big boss of bad gang or something"}], "recommendations": ["gone_girl", "tenet", "inherent_vice", "the_departed", "fifty_shades_darker", "the_accountant", "next", "the_counselor", "broken_city", "uncut_gems", "there_will_be_blood", "the_power_of_the_dog", "beckett", "21", "what_happened_to_monday", "lucky_number_slevin", "tinker_tailor_soldier_spy", "hereafter", "the_many_saints_of_newark", "kingsman_the_golden_circle", "the_equalizer_2", "captain_marvel", "now_you_see_me", "contagion", "the_guardian"]}