{
  "id": 2095,
  "title": "The Shallows",
  "starring": [
    "Blake Lively",
    "Óscar Jaenada"
  ],
  "runtime": 86,
  "genre": [
    "Horror",
    "Drama",
    "Thriller"
  ],
  "description": "When Nancy is surfing on a secluded beach, she finds herself on the feeding ground of a great white shark. Though she is stranded only 200 yards from shore, survival proves to be the ultimate test of wills, requiring all of Nancy's ingenuity, resourcefulness, and fortitude.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/42HlPJmiE6rQdtT2lYzPPMQYvqG.jpg",
  "categories": {
    "plot": 6.111111111111111,
    "acting": 5.411764705882353,
    "ending": 6.066666666666666,
    "soundtrack": 7.0,
    "cinematography": 6.6,
    "familyFriendly": 6.0,
    "funny": 4.0,
    "action": 6.142857142857143
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I wouldn't really classify this as a horror movie, it's more of a thriller survival movie. This movie is basically a remake of 127 hours but instead of the desert you have an ocean. The plot of the film is very weak but it does the job of making you understand the full picture. For the most part it's a good movie, but some things in this movie are just way to unrealistic, and somethings are just flat out dumb."
    },
    {
      "rating": "9",
      "text": "This is a beautifully shot movie in a gorgeous location juxtaposed with a not-so-beautiful shark with a hankering for human flesh. There's jut enough character development to keep you engaged in the protagonists fight for survival and the action is well paced and builds nicely up until the all-out close quarters  battle between woman and fish. Some of he lower scores really confuse me as to me it's pretty much a perfect piece of cinema, hugely suspenseful and entertaining if not a little far - fetched at times and somewhat unoriginal. A fantastic film really"
    },
    {
      "rating": "7",
      "text": "If you ever wondered what would happen if Asylum gave someone talented the $8.60 to make a SyFy movie. And that person actually hired other people who were talented, and sticking with the stringent parameters of the Syfy channel (must have a girl in a bikini and a shark preferably a giant flying one) made a movie. Well, wonder no more. The Shallows is an Asylum movie with good CGI, effective direction, gorgeous cinematography, talented acting and a serviceable script. The lack of campiness in the movie is actually a smidge of a drawback as one takes very seriously what is essentially a shark attack movie. And since we take the movie seriously its third act flaws are only more apparent. If the movie was staying true to its tone it certainly should have opted for a darker more realistic ending. Instead, it goes off the rails with a shark that turns into Jason Voorhees and a heroine that might as well be holding a chainsaw.I liked the seagull and I have never found Blake Lively more appealing and I find her ability to wear a bikini bottom the entire movie somewhat brave. The wife was convinced it was Chris Cooper as the father but it turns out it is Brett Cullen who is a by appearances a discount Chris Cooper. He needs to ask for more money. I am pretty sure abandoned surf beaches in Mexico lack both Uber service let alone such good cell phone service. I am also positive that most sharks would ignore you with such a big easy meal floating 50 yards away. All that said the film is very well done and acted and while the story doesn't include a flying giant octopus or comic relief I think it would make a good Syfy movie. A very good one indeed."
    },
    {
      "rating": "6",
      "text": "The Shallows is a tense & energetic B-movie throwback to shark hysteria, in which Blake Lively surprises us all through her decent performance as a semi-naked sea prisoner. It's a very simple plot though, and one that has been done a thousand times before."
    },
    {
      "rating": "7",
      "text": "A thrilling and entertaining piece of modern film, The Shallows features all of the trapping of a cash grab teen scream flick - attractive lead, use of texting, and a bad trailer - but it transcends them all by being a smartly crafted, tight, and taut thriller. While I admit that Blake Lively knows how to wear a bikini, this is certainly not the focal point as she proves doubters wrong by kicking ass from beginning to end. Director Jaume Collet-Serra does a good job creating well crafted thrills, instead of relying on cheap jump scares and like. Instead, a chilly atmosphere and sense of permeating dread is a constant presence in the film. However, Lively takes center stage here as pretty much the only actor we encounter (aside from a few brief side characters). Though she had not done much to inspire hope as an actress with this much screen time, she knocks it out of the park. While not award winning by any means, her performance is quite good and hints at some untapped potential. Additionally, the cinematography is breath taking, resulting in one of the prettiest end credits I have ever seen. Though, from beginning to end, the film has a fantastic look and feel that maximizes on the fantastic setting, even when things turn dire. Overall, The Shallows is not the best film of the year by any means, but is is perfect summertime counter programming. Entertaining, thrilling, and well made, The Shallows delivers."
    },
    {
      "rating": "8",
      "text": "I had low expectations, but it was surprisingly good. Lively really commits to the role, and sure, she's easy on the eyes too. It either really makes me want to go surfing, or really not want to go..."
    },
    {
      "rating": "6",
      "text": "Blake Lively goes surfing on a secluded Mexican beach, where she's terrorized by a great white shark. She gets stranded on a rock, but that's only one of the deluge of obstacles in her movie-length ordeal. If you're willing to toss credibility overboard, you can relax and enjoy some mildly suspenseful moments. The dramatic cinematography and visual treatment add an extra element of beauty to this already lovely location. Lively manages with lots of grimacing and grit, but the tension never gets too deep and the ending pushes plausibility."
    },
    {
      "rating": "10",
      "text": "This movie was just overall great. Out of all the great white shark movies that have been released since jaws, this is the first to actually be good, and SCARY. The acting was great, Blake Livley is an amazing actress, and I see very good things for her in the future. And FINALLY, A SHARK THAT LOOKS COMPLETELY REAL!! It's about time. This is a must see for the summer, and I look forward to owning The Shallows on DVD."
    },
    {
      "rating": "8",
      "text": "Decided to see this movie after reading some good reviews and a few recommendations. If you haven't seen this and you are looking for something different I thought this was a smart and interesting movie. It isn't perfect but very entertaining and really isn't that why we like movies?"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie! Blake Lively gave an awesome performance and was very convincing throughout the movie. The shark for the most part actually looked pretty real. It was tense and the finale was very exciting to watch. Yes there is some unbelievable actions by the shark, such as continually going after Blake's character, but it was still a very enjoyable film."
    },
    {
      "rating": "7",
      "text": "Benefiting from an outstanding performance from Blake Lively, The Shallows is a stellar shark flick filled with emotion and tense action, even if the film can't quite compete with that of Jaws."
    },
    {
      "rating": "8",
      "text": "This movie is essentially if Jaws and Cast Away had a baby. Part survival story with a solid performance by Lively and part great shark thriller! At a breezy 87 minutes it's a great way to spend your night at the movies. They don't bog you down with huge and pointless narrative they give you a likable character for you to root for! Well worth the price of addmission!"
    },
    {
      "rating": "7",
      "text": "The Shallows is a very enjoyable summer movie, more like Open Water than like Jaws where Spielberg takes a broader, more complex and colorful view of the dynamics and politics of a summer community while the human vs shark confrontation comes only very late in the film. The Shallows is almost all one-on-one in isolation, except for a bit of sentimental background early on. But let’s give the director credit for not exploiting Blake Lively’s body more than necessary and for Lively not getting too sentimental on us and keeping her emotional dignity. Most of the film is an interesting “chess game” played between the shark and the gutsy main character, and the director makes the film and suspense work without stretching our belief in what happens too far. Lively is determined (as is the shark) and the contest is fun and engaging to watch."
    },
    {
      "rating": "7",
      "text": "Probably the best Shark movie I've seen since Jaws. While its obviously not as good as Jaws, its still probably the best Shark/survival movie I've seen in a very long time. Led by a surprising performance by Blake Lively as she carries this entire movie and is able to act without speaking, which is insanely hard to do. In the midst of all this chaos, you care about her and you want her character to survive. The movie is only 85 minutes in length and it makes the most of it with a pretty good handful of thrills and jumps that keep you entertained despite a so/so script. The ending on the other hand I felt was somewhat anti-climatic and lacked emotion and satisfaction."
    },
    {
      "rating": "3",
      "text": "Nothing to see here. No plot, no room for enjoyable acting/character development, and absolutely no tension. Even the setup is ridiculous, there is a fresh whale carcass floating nearby, but the shark rather **** about trying to eat the pretty girl...Ptah!"
    },
    {
      "rating": "9",
      "text": "No, The Shallows is not perfect, but Blake Lively is. She gave an amazing performance and this shark movie really had my eyes focused on the screen intensely. Blake Lively was very hot in this film and they made her wear a swimsuit for nearly the whole movie. The film itself and its plot wasn't perfect, but it was entertaining given the short 87 minutes runtime. I honestly hoped this movie was longer, but the film wasn't rushed and it took the time to make the audience feel suspense, which was by far the second best thing about this film. The suspense really had me watching and I really loved how the director would have the camera go underwater and above water. The trailer did spoil some things so I kinda guessed where this movie would go. Overall, The Shallows was a really fun film, but for some reason I felt like the film wasn't a huge hit and it seemed like a forgettable movie. But go see The Shallows as Blake Lively is great and the shark scenes are definitely worth it. (89/100)"
    },
    {
      "rating": "7",
      "text": "When it seems as if shark movies are dead, The Shallows rises up from... the shallows.  I tried, i'm sorry.\r We're in a period in time when shark movies are treated like action-adventure films with movies like Sharknado and... 2-Headed Shark Attack.  But from the depths of Hollywood's creativity, we have a refreshing breath of fresh air simply known as The Shallows.  Directed by the same guy behind Run All Night and the underrated Orphan, The Shallows follows Blake Lively as she tries to survive a great white shark as it circles it's feeding ground.  I found the movie to be a very well directed, acted, and executed thriller.  Blake Lively gave a good performance, in one way or another, and the tension was real.  I was on the edge of my seat for a few scenes, considering how real the CGI shark looked.  However, sometimes the film has a bit of an identity crisis, sometimes going from a teen-beach flick to a suspenseful shark thriller.  Movies like Jaws built up the tension straight out of the gate so that you knew what you were in for, but with The Shallows, some people may be turned off by the upbeat tone of a supposed spooky shark film.  Also, sometimes the film decides to go into slo-mo a lot, and I mean a LOT, for some reason.  You can make a lot of action happen in one scene, but you don't need to drag out the movie by making it seem like something big is going to happen that will change the character's dilemma.\rOverall, The Shallows is a fun thriller that, much like Money Monster last month, really isn't anything special.  It isn't the Jaws of this generation, it's just one of those movies that you can go out and see on a date night, a rainy day when it comes out on Blu-Ray, nothing else is going on that day, etc.  I liked the tension, the craft, and the strong performance by Blake Lively, and i'm not talking about how good she looks in a swimsuit, but ultimately, if you've got nothing else better to do that day and you've already seen Finding Dory and The Conjuring 2, this film will hold your attention, but it's nothing special, really.\r The Shallows gets a 7/10."
    },
    {
      "rating": "7",
      "text": "This movie was a surprise. For a suspenful type survival movie it delivers . If a person likes over the top crazy action in a shark movie , this movie is not for you ."
    },
    {
      "rating": "7",
      "text": "I was actually exited to see this film since the story itself sounds really thrilling, plus I just love shark films like Jaws. Also, it seems like people don't care about shark films any more when stuff such as Sharknado is a thing. And one final thing, the director actually made three really enjoyable Liam Neesom movies in the past, and also made House Of Wax, which kinda sucked.\r So, after seeing the movie, is it as good as Jaws? Nope. Honestly, it was just fun. It never reached the dramatic heights that I wanted it to or that it was even aiming for. It's actually a pretty serious movie at times, there's some kind of backstory with the main character with something that happened with her family in the past, I won't go into spoilers for your sake. I really feel that this movie really didn't reach the dramatic heights that it was aiming for, although the actress, Blake Lively, gave an amazing perfomance in this movie and the shark is actually a really well done CGI shark. The one thing that really bugged me about this movie was the tone. It had a very conflicting tone. It starts out with very upbeat music and then feels much more serious with the shark and then you get more intense music, so the movie was unable to sustain that feeling of suspense. Jaws started building up the tension right from the get-go but this movie doesn't do that, it feels very modern with some of the music choices. Even some of the directing choices were weird, they really overused slow-mo in this film which annoyed me. So, one last thing and the major complaint for me about this film, was some of the story choices. So, there is a question being constantly repeated throughout the movie, again, no spoilers, and this question is just suddenly dropped without ever giving you an answer.\r So, overall, The Shallows was a well-made, competently directed for the most part and exiting to watch...for the most part. Yeah, some bad choices were made but really, it's not so bad. This movie deserves a 7, good but definitely not great."
    },
    {
      "rating": "1",
      "text": "Huge Letdown.\r The trailers and even the first 40 minutes of the movie were excellent. It set a good tone, the filming and angles were tremendous, the shark itself was extremely well done as well as being intimidating/believable.\r However, things began to turn to the ridiculous after the 40 minute mark. A large gash to the leg, losing blood heavily, dehydrated, hungry and generally weak, yet after 48 hours she finds her strength and turns into the incredible Hulk and takes on the shark.\r The final 10 minutes were like something out of Sharknado; the Great White jumping out of the water to crash into objects, the CGI went from very well done to absolutely awful and the whole thing was utterly ridiculous.\r Such a good first half ruined by a terrible second half."
    },
    {
      "rating": "0",
      "text": "The only credit I am giving this film is good ass shots of the actress and good shots of the ocean.\rThis is probably the worst movie I have ever seen in a movie theater. If I had not been with my girlfriend (who really wanted to see this) I would have walked out about 30 minutes in and asked for a refund or a free movie pass or something. The trailer makes you think its going to be a suspenseful thriller but really its just a snoozefest. The only thing that kept me awake was the hamfisted jump-scares.\r I was grating my teeth and yanking on my eyelids at all the drawn out boring scenes that act as filler to pad this terrible film. There is barely any dialogue except for the actress screaming and crying. Any dialogue between characters serves as a red herring to make you think there is more to this movie or something interesting might happen. There appears to be a sub-plot about the mysteriousness of the beach they are at. Never expanded upon or explained. We learn about her friend whom we never see and is entirely pointless and only serves as filler. The trailer makes it seem like the long haired guy who brings her to the beach somehow knows about her fate, but that would give the film too much credit in its writing (there are also two guys that are at the beach that you would also suspect knows something that she doesnt know but they are also pointless).\r You know those youtube videos that are titled \"_____ movie in 10 seconds\"? well this is truly a movie that could have been 10 seconds long. do not watch this movie it is godawful and everyone involved in the writing and directing of this needs to be shot."
    },
    {
      "rating": "3",
      "text": "I feel I would like to start with the positives for this movie, the underwater filming was excellent, action and surfing shots too, the aerial views of the sea where also excellent, gorgeous filming locations. Blake 's athletic performance deserves thumbs up. The screenplay on the other hand, was intelligence insulting like another critic posed it, from the moment we see two completely different film locations, a place that is not Mexico. A single woman, texting and face timing where in the middle of nowhere, and the list goes on and on and on. Granted is it fiction, but come on, could have been more enlighten. My 15 year old liked it,  it is interesting the range of scores, maybe half of them are written by teenagers."
    },
    {
      "rating": "2",
      "text": "I was expecting a lot more. I figured there would be more to the movie, but it literally is the preview. Nothing more nothing less... Blake lively is a great actress and all of the acting was just fabulous, but the movie itself was not something that I would recommend seeing."
    },
    {
      "rating": "5",
      "text": "It's a decent movie that is largely ruined by one simple piece of tech in the first 10 minutes.  Lively is obviously not a surfer, so they - in a very ham-fisted way - attempted to graft her face onto another surfer's body, and it looks TERRIBLE.  They should have simply showed the back of her head.  In fact, the false face looks so bizarre, it makes you cringe for her and the filmmakers.  Otherwise, it's the typical \"stranded\" disaster flick.  For a better one, try Open Water."
    },
    {
      "rating": "0",
      "text": "There are no words to describe how bad this movie is. From the first frame I knew I was in for a bad ride. The story is totally ridiculous in it's attempt to create tension. Anyone as stupid as this main character, deserves to get eaten by a shark. Whatever happened to genuine thrillers?"
    },
    {
      "rating": "0",
      "text": "Something suggestively smells fishy about the 2016 movie \"The Shallows\", and it is not just the featured Whale or Sharks?. This movie is a Jaws wannabee thriller, with little intensity. The only high point in the film is actress Blake Lively's physical beauty. This is the only depth in the story. Ms. Lively spends the entire project wearing little more than a bra and panties spread eagle at the legs, in ocean water, I guess intended to be a bikini?. She seeks out alone time, to surf a secluded cove on a coral reef in a foreign nation. She gets attacked by sharks and soon finds refuge first, atop a dead whale, then an above tide reef. She is bleeding badly from the leg. She soon makes friends with an injured Seagull as she begs unsuccessfully  for rescue. What struck me as implausible during her ordeal was how the director changed her facial make up with each new scene to maintain that beautiful sexy look distressed or not.?. There are all sorts of dumb scenes, like resetting a bird's dislocated wing, a drunk man on the beach just 200 yards from her. One of the worst , was her finding a flare gun on a buoy with more ammunition then I have ever seen?. Adding insult to suckers paying for this crap, was a scene where a shadow moves across the screen , like someone going for popcorn in a theater. Ms. Lively and Ryan Reynolds must have needed the money badly to shove this light weight film on innocent fans. Shame on them. A fast way to keep them on the B list of so called actors. Sexy Blake - horrible movie."
    },
    {
      "rating": "3",
      "text": "Most of this movie seems to be an ocean photoshoot for Blake Lively.  Although some aspects of the film are fun and scary, some action scenes are too ridiculous and left me frustrated with the luck and crazy coincidences our heroin is offered.  Also, the Shark catches on fire."
    },
    {
      "rating": "1",
      "text": "A movie where the 2 main actors are a Bird and a Shark !! Cant really expect much!! I can say its one of the worst movies I've ever watched!! Very disappointed!"
    },
    {
      "rating": "0",
      "text": "A boring wanna Jaws film. Just a half naked woman running around cursing throughout the film. It just gets boring after a while. Comparable to Jaws 2 if you ask me."
    },
    {
      "rating": "0",
      "text": "Trash this movie is trash I checked the spoiler box because there u go I spoiled the whole movie for ya. Trash. Don't waste your 87 minutes on this when you could do something productive like going to Starbucks or going to carvel. If I could give it a 0 I would but I have no clue how. I'm sure scientists that study sharks must be pissed because sharks don't like the taste of humans they go after humans on surfboards because they look like sea turtles. I love Blake lively but why would she chose to be in this movie of all movies. Also what I didn't understand is the fact that oh there were people on the beach before she got stranded yet they all seem to disappear when she was stranded. Sure they may have been running from a shark but they could spare a second to call for help? Really? To wrap up this movie was trash and I don't recommend going to see it. I'm no critic but I know this movie was awful"
    },
    {
      "rating": "2",
      "text": "A stupid, tired movie that tries to give sharks back their names of what they were when Jaws was released back in 1975 but eventually sinks itself straight to the ocean where it eventually gets forgotten by day two."
    },
    {
      "rating": "7",
      "text": "Director Jaume Collet-Serra brings us the best shark flick in years. He also delivers more of that exciting visual flair that helped elevate his Liam Neeson action flicks, Run All Night and Non-Stop, to more than just Taken cash-ins. Yes, it's a very beautiful movie, and not just because of Blake Lively. What really helps The Shallows though is that it's just a genuinely good shark movie. Probably the best this side of Jaws.\r It's pretty slow paced though. A lot of the early tension simply comes from the believability of the events. Watching a young woman, wounded and on her own, in a perilous situation. There's a lot of just watching try to figure out how to keep herself alive while she's losing blood. It's pretty entertaining and makes for a great survival movie.\r But don't worry, The Shallows doesn't shy away from tense, more action-packed shark attack moments. Those are just reserved for the final act. These moments are exciting and a heck of a lot of fun. These moments are where the movie kind of takes a turn for what is perhaps more unrealistic, but it's just as enjoyable to watch as the final conflict with Jaws was (and still is) all those years ago.\r So how about those visuals I was talking about? Simply put, it can be a stunning film. The location is unbelievably gorgeous. Jaume Collet-Serra really focuses on emphasizing that early on with what are perhaps some of the most gratuitous and beautiful shots of water and scenery ever put on film. The director also indulges in displaying the beauty of Lively's body. I thank him for both.\r That's not to say everything is flawless with the visuals though. It does have several moments of truly subpar CGI. You can tell there was a budget. When the shark is CGI for the more exciting bits of action, it takes away some of the terror that could have otherwise been there. I can't complain too much though. These moments are still fun to watch.\r While not without it's flaws, The Shallows is a heck of a lot of fun. A welcome return to the more serious, yet still fun shark movies of yesteryear. Sharknado this is not. We get something a little more respectable and that can be enjoyed in more than just a \"so bad, it's good\" kind of way. It's the best shark movie in years (admittedly, that's not saying much) and is worth taking a breaking a break from re-watching Jaws to check out.\r 7.9/10"
    },
    {
      "rating": "7",
      "text": "The first two-thirds of the movie are deadly serious, while the last third turns a bit campy. However this works in the film's favor, as a stress reliever. The underwater camera work is excellent, and the wounded seagull is the best non-human companion since Wilson. If you want some dread, some jump scares and a brave Blake Lively (with a lively rear end), check it out."
    },
    {
      "rating": "0",
      "text": "Starts very slow and takes about 20 minutes of the hour and a half run time to get into her life threatening situation. She then spends a majority of the film either sleeping on the rock she is stuck on or tending to her wounds. It's not until the last 20-30 minutes of so anything really happens and she actually tries to escape.\r I give props to Lively for giving a solid performance but honestly, There is nothing original or good about this movie. It's not suspenseful enough, Not enough thrills to make you want to keep watching or be entertained. Instead we pumped with needless backstory and a majority of stuff being shown off screen to save on the budget."
    },
    {
      "rating": "7",
      "text": "A very enjoyable shark survival film. Solidly entertaining. Their reallllyyy isn't much else to this film. No deep philosophical underling about the human condition. Just basically shark survival. I mean. Its an absolute blast of a time and definitely worth the ticket price."
    },
    {
      "rating": "6",
      "text": "As far as being a proper one-man/one-woman-show-film goes, \"The Shallows\" fits into the subgenre like a glove. The premise got me to the theater and the actual film follows the expected beats and subgenre conventions in a timely and tight manner. However, \"The Shallows\" simply fails to possess the spirit and soul that the other, more successful one-man/one-woman-show-films (\"127 Hours,\" \"Gravity,\" \"The Martian,\" etc.) soared with. If only the film's first and second acts contained as many thrills and as much awe as its rousing conclusion. What you're ultimately left with is a moderately enjoyable film with a believable lead performance and some well-executed visual effects. It's a perfectly inoffensive film that unfortunately plays it a little too close to the vest in terms of having a distinct personality."
    },
    {
      "rating": "4",
      "text": "First be warned this is - for me personally - one of the worst CGI based shark in recent time. The aggressive nature of the \"animal\" has to be on par with the likes of Deep Blue Sea, you know genetically enhanced killer-sharks. The action is so over the top it's like looking at a showdown between a strong predator and the poor but witty human and the encounter ends in such a cringeworthy way I regretted sticking till the end. If you're willing to toss aside all that you know about sharks or animal behavior and just want to have fun maybe this is a movie for you. For me personally this movie can't be recommended. It started in the usual Hollywood way (pretty girl, bad backstory/family-story, beautiful location) until everything goes wrong and it becomes a nightmare...perhaps it was a zombie-shark...hmmmm..."
    },
    {
      "rating": "5",
      "text": "a big dead whale to eat or spend energy/time chasing after mexicans and one blonde babe with family issues to kill.... guess the shark was in the mood for mexican and side of blonde. besides that the movie reminded me of a similar movie THE Reef which is basically the same story but instead of surfers and mexicans you have a boat and Australians."
    },
    {
      "rating": "6",
      "text": "The acting wasn't all too good, most of the CGI effects were pretty ugly, the movie wasn't very realistic and the ending was atrocious, but the last 20 minutes were entertaining and the shark was well made most of the time.It's not one of the best shark movies, but it's not one of the worst either."
    },
    {
      "rating": "4",
      "text": "The trailer for this lean minimalist thriller is perfect.  Expertly crafted in two and a half minutes it's everything your imagination needs, while the actual feature at ninety minutes though well made overall is sufficiently enough to blow the spell the preview conjures so well.  The fact this is a spare minimal thriller isn't the problem (generally they're the best kind).  Nor are some of the character/plot machinations which are text book.  No, the problem besides some clunky dialogue is the shark really has no personality.  The shark for the amazing level of CGI verisimilitude that technology reaps these days, is still lifeless.  You don't really buy it.\rTake the one inevitably to be compared to, \"Jaws\", that shark we believe… still, wholeheartedly and without the benefit of today's incredible visual effects.  That was a psychological thriller in addition to grand adventure.  Granted \"Jaws\" was a much greater story on a far bigger canvas, but basically was man against nature.\rThis is of course is the same idea on a much smaller scale, however it's a highly predictable exercise in slick movie making scares without the psychological character depths that made \"Jaws\" a classic besides its state of the art cinematic thrills at the time.  Take another very well made if albeit cheaply little shark thriller, \"Open Water\", from 2004.  Not as slick or costly but it was smarter and much more realistic.\r Yeah the hot girl for this one is great marketing and she's fine, but it barely sustains in the streamlined action.  Actually they didn't make enough of it.  The iconic poster alone for the seminal \"Jaws\" had far greater impact (sorry to keep mentioning that other shark thriller, but hey).\rThere is one plot line flaw in this which is unacceptable unless I missed something, but with so little to follow I doubt I did.  In the end it turns over-the-top ridiculous and makes the venerable \"Jaws\" seem almost a documentary in comparison.\r A note on the contemporary device of the protagonist giving journal entries on video:\rIt was done well and apparently true for \"127 Hours\", became almost annoying by \"The Martian\", and now with this it's clearly a gimmick to pad the running time when the story chiefly has only one character.\rGoPro should sue Sony because their camera is portrayed as constantly glitching!  Thought these action water cams now held up to anything?"
    },
    {
      "rating": "4",
      "text": "The problem with The Shallows is that it is really slow most of the time. The best part of the movie is the last twenty minutes, and the rest of the movie is just boring."
    },
    {
      "rating": "6",
      "text": "Meet Blake Lively, her surf board and the star of the movie, the shark in all its CGI glory. It's tense, cringy, jumpy and entertaining. Let me put it this way, if you don't count Jaws it's a really great shark movie but in a world where Jaws is the standard then this is lacking something. Good not great, recommended and unless you want spoilers do not watch the trailers."
    },
    {
      "rating": "5",
      "text": "44/100, or C\rThe Shallows is a horror-survival film that will not commit to the most important elements of that type of movie, as follows:\r1) Stick to Procedural\rOur protagonist (Blake Lively) has herself a cancer-mom backstory, of course (shades of Sandra Bullock's dead kid in Gravity), which has caused her to put on hold pursuing a medical degree. She also gets stuck on a rock with a hurt seagull, and they become besties. I don't care. The reason a survival thriller like All is Lost is successful is because it has a protagonist who has no backstory and doesn't speak, much less narrate every event of the movie.\r2) Stick to the Nitty-Gritty\rOur director for the film is Jaume Collet-Serra, who also worked on Liam Neeson thrillers Non-Stop and Run All Night. He is much better at Liam Neeson thrillers, where he has an excuse to do weird texting on the screen bubbles and to prettify everything. Here, he is out of his depth (yes, that is a pun!) when his prettified sea meets up with orca whale carcasses and gangrene. Even one of his most interesting choices, to stick to Lively's face as she watches the shark chew up a person, doesn't work because he didn't...\r3) Cast a Capable Performer\rDarn it, don't hire Blake Lively just for T&A shots for the trailer; if you have to have the T&A, there's a bunch of good-looking actresses who can act as well. Stick to comedy, Blake, you are somewhat charming when you're not battling sharks in this film."
    },
    {
      "rating": "9",
      "text": "Smart, thrilling and brilliantly interpreted, The Shallows brings another typical \"shark-thriller\", but it has enough originality and entertainment to be enjoyable. Viewers will not be disappointed."
    },
    {
      "rating": "6",
      "text": "This is not your Jaws, or 127 Hours, or Gravity, but it's  trying to make you feel that it belongs to that category of survival films. The Shallows tried to copy some of the visual styles and directory techniques, which ends up with a detectable hint of pretentiousness."
    },
    {
      "rating": "10",
      "text": "Really enjoyed this movie! I've been waiting for a shark movie that is actually scary. Most movies shark related are B movies like Sharknado but this one is actually scary. I'd put this on the list with the Jaws series and Deep Blue Sea as actually good shark movies. Worthwhile to watch if you like shark movies!"
    },
    {
      "rating": "7",
      "text": "Jaws had such a profound impact on me as a kid, both positive and negative.  So, naturally I was really drawn to another great Shark Tale. (no, not the Will Smith kind... God no!) Spielberg's Jaws terrified me in a way that kept me away from most large bodies of water for years.  I was always drawn to another \"big animal\" film that could give me the same \"feels\".  The Shallows trailer painted a picture that leaned in that general direction. Unfortunately, after seeing the actual film... it scratched the itch, but didn't leave me with that \"Ahhh... that's-what-I-was-looking-for-\"- feeling.   The film was definitely frightening at times, leaving me squirming in my seat for the duration of the slow-burn. It was a film made in 2016 so I expected a lot of CGI... The shark looked good, not great.  Blake Lively's face overtop of an actual surfer's face, not great and I expected a lot of unrealistic motives of the shark species. This shark was tenacious! The great white could be seen biting through metal, fire, and surf boards as if that was it's morning ritual.   I feel the movie could have been much more terrifying if the kept the \"realistic\" tone to it.  Several unnecessary elements plagued this movie to keep me from truly being engaged.  I was able to look past the quick-character-development tropes and see the film for what it was, happily, until the last 15 minutes.  The last 15 minutes promptly took me out of their world and back into mine. That is not where I wanted to be."
    },
    {
      "rating": "6",
      "text": "Tense and well played but somewhat disfigured by the totally impossible ending. Great performance by the lead actress. Great looking shark, somewhat too intelligent probably, but hey it's a movie."
    },
    {
      "rating": "5",
      "text": "It's nothing special. It's a great rental, but I am so glad I did not pay money to see it in theaters. It has plenty of good suspenseful scenes, along with awesome CGI, but besides that, not much. Oh yeah, and obviously, Blake Lively is so hot in a bikini."
    },
    {
      "rating": "7",
      "text": "Very close to the shore, yet too far and dangerous to attempt.\r I'm sure you have seen shark attack films like 'Jaws', 'Deep Blue Sea' et cetera, and yep this another one to add to that collection. But this was something very neatly done, I mean for the most of the parts. Looked so real, so I thought it might end up top among its similar theme. In the end, I was little disappointed, because of the shark. The portrayal of shark was very natural, until the last half an hour. Then it becomes the common film gimmick when the animal was obsessed to kill its target at any cost.\r I am a huge animal fan, but I have never seen a live shark in my life and that does not mean I don't know anything about them. Thanks to the nature television networks and what I saw in this film was very disappointing if you love wild animals. I am not supporting the shark here, I'm just talking about its behaviour. It was not right, other than that, I definitely enjoyed the film. In fact, except the final few minutes, since the shark got pumped up, I had no issue and the best shark attack film. But the final battle ruined overall favour I'm going to give to it, what I thought this film deserved.\r Great location, and Blake Lively was unbelievably awesome. In the initial part, she was very sexy, but once the narration shifted its focus on surfing and later shark attack, everything changed. The entire film was edgy, I think very nicely written screenplay. It was a limited cast film and nearly the whole film takes place very close to the shore. A good start, neatly maintained mid part, but a below par conclusion, that's what I think about the film. Slightly missed to be a great film in the line of '127 Hours'. In fact, this looks like a sea version of that film. But I still recommend it, because it's worth.\r 6.5/10"
    }
  ],
  "recommendations": [
    "crawl",
    "47_meters_down",
    "the_meg",
    "frozen",
    "into_the_storm",
    "monsters",
    "chernobyl_diaries",
    "the_grey",
    "sanctum",
    "bird_box",
    "jurassic_world_fallen_kingdom",
    "underworld_blood_wars",
    "devil",
    "the_descent",
    "riddick",
    "army_of_the_dead",
    "infinite",
    "a_quiet_place_part_ii",
    "poseidon",
    "underworld",
    "immortals",
    "the_ritual",
    "mad_max_fury_road",
    "doomsday",
    "ghost_rider_spirit_of_vengeance"
  ]
}