{
  "id": 1327,
  "title": "The Final Destination",
  "starring": [
    "Shantel VanSanten",
    "Bobby Campo"
  ],
  "runtime": 82,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "After a young man's premonition of a deadly race-car crash helps saves the lives of his peers, Death sets out to collect those who evaded their end.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5vxXrr1MqGsT4NNeRITpfDnl4Rq.jpg",
  "categories": {
    "plot": 3.391304347826087,
    "acting": 2.6842105263157894,
    "ending": 4.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This is a film where you have to leave your IQ at the door. You can't think too deeply about it. But the kills weren't as inventive as previous films and there are only so many times you can light a trail of gasoline. The final death was really really uninventive but there were so great moments, especially the escalator and the car wash. This gets a 7 with 3D, but it gets a 5 without it."
    },
    {
      "rating": "7",
      "text": "It's not the best of the franchise, but it is good. Yet again, it goes overboard with blood, guts and gore but hey, what do you expect? It's Final Destination we're talking about here! The deaths are gruesome and the freak accident is okay. The storyline is a bit shaky but it's quite a good movie."
    },
    {
      "rating": "9",
      "text": "Well is a short film with violent deaths that surprises even more. not a serious movie like the previous but still contains the suspense in the deaths of the characters."
    },
    {
      "rating": "3",
      "text": "This is it. \"The Final Destination\". Its MUST BE the last of its franchise. With its inane plot and overly exaggerated (\"Saw\" was better at it) deaths of teens, the film is a good example for considering to end the franchise."
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "2",
      "text": "this movie is just bad just like the ones before it. Hollywood has pretty much made the same movie 4 different time and there going to do it again in 2011 with final destination . the acting was horrible and the special affects were just as horrible. If you are not watching it for free you are wasting your money"
    },
    {
      "rating": "9",
      "text": "Poor 3D effects (in the DVD) but hey, it comes with 3d glasses which can be used elsewhere. The deaths are good, the story is good, but what brings it down is the poor 3D."
    },
    {
      "rating": "2",
      "text": "Uninspired acting and script lead to a very disappointing effort on all levels. This should be the end to a series that started fresh and ended stale."
    },
    {
      "rating": "3",
      "text": "Where as the first and second films imbued the audience with a palpable sense of dread, this fourth entry in the ever burgeoning franchise has a cast of charisma bypass victims twiddling their collective thumbs in bewteen some of the most unconvincing CGI gore effects layden \"creative\" deaths ever committed to film."
    },
    {
      "rating": "0",
      "text": "A truly terrible film. The kills have little imagination and the 3D adds nothing to the movie."
    },
    {
      "rating": "3",
      "text": "By far the worst movie of the final destination saga. It began well but after i didn't even figured out why it was on 3d...stupid and illogical deaths, bad acting, bad ending."
    },
    {
      "rating": "2",
      "text": "Was looking forward to this being released and was disapointed as i came out the cinema.I gave it a 2 just for the 3D aspect of the film. No story line what so ever. Not Scary. Not Funny and awful acting."
    },
    {
      "rating": "0",
      "text": "This movie totally sucked I was expecting more creative ways of death. Was not worth my ten bucks!"
    },
    {
      "rating": "1",
      "text": "Bad movie from the series. Same old storyline as it had bad acting and short too. Death scenes looked idiotic..should have straight to DVD."
    },
    {
      "rating": "1",
      "text": "So abysmal I felt compelled to create an account to just warn any poor fool who wanders into this garbage by accident. Don't bother with the 3D as it was seemingly added as an afterthought and was almost entirely unnoticeable. Though my forehead was raw from slapping it every time a ceiling fan (or entire structure for that matter) was just one loose screw from starting an impossibly ridiculous Rube Goldberg device of death, the over the top gory deaths were mildly humorous in execution (pun intended). It goes from bad to worse in the closing scene when the writers apparently ran out of time or had to make another beer run, and decided to wrap this up in the most uninspired way possible. If you ever do see this movie, I'd recommend putting it on in the background while shooting the breeze with a few buddies and muting the bored sounding frat boys and girls to a indistinguishable buzz. Oh and definitely don't pay eight bucks for it."
    },
    {
      "rating": "1",
      "text": "Effects are really bad, way way far from reality."
    },
    {
      "rating": "10",
      "text": "I decided to take James B's advice and Went with a pile of my friends... THis movie was absolutely terrible but my friends were hilarious... To me it was the closest you could get to a real life Looney Tunes... Anyways, We got kicked out halfway through because when one of the main characters died (can't remember the name) died on of my friends went up to the screen and went on his knees and yealled, \"NOOOOOOOO.\" Anyways, the movie sucks but James B was right, bring friends if you're going to watch it."
    },
    {
      "rating": "1",
      "text": "Calling it an absolute nightmare would be giving this movie more credit than it's due. Aside from a somewhat entertaining opening bloodbath, this movie falls flat quick regardless of it being in 3D. The acting is a wreck from everyone involved. Some instances were so ludicrous it would leave you baffled. The main characters are shown absolutely unphased that one of their close friends had just died in the previous scene and hardly ever refer to the incident afterward. Really? Any heart or sentiment that was attempted to be injected into the movie on behalf of the security guard's character seemed forced and fake. What is enjoyable about this movie however is how much you'll be laughing if you just accept the movie's absurdity. I honestly haven't laughed as hard this year during any other movie, but seeing as \"comedy\" isn't an applicable genre, the unintentional sdiesplitting situations will leave a sour taste in your mouth when the whole dreadful ride is over. Skip it."
    },
    {
      "rating": "0",
      "text": "It was too predictable...skip it."
    },
    {
      "rating": "0",
      "text": "Here's the twist at the end: every main character dies."
    },
    {
      "rating": "1",
      "text": "This movie is yet another struggle to achieve its first movie glory with very little success. The interesting plot of the story is destroyed by the violence that predominates the movie. This movie is easy to predict and annoying."
    },
    {
      "rating": "2",
      "text": "I do not understand how they can shoot the same movie over and over again. It's more of the same. The movie is predictable from start to that end, and if you've seen the 3 above will know exactly what will happen at any time. Absurd and ridiculous plot, which is always the same factor, a misplaced object that can trigger a domino effect where the stupid end someone dies."
    },
    {
      "rating": "2",
      "text": "Worst in the series. Horrible ending and some of the worst acting of them all. Intro credits were the best part. It went downhill from there."
    },
    {
      "rating": "3",
      "text": "Artistry redeems any subject matter, some say(in particular, Roger Ebert), so even a junky horror movie like this franchise's immediate predecessor can achieve a moderate level of greatness, which is no small feat, since the filmmaker has to abide by a constrictive narrative that's both rote and pedestrian. People died in \"Final Destination 3\", but they died with undeniable pizazz, especially during the opening sequence at the amusement park involving a derailed rollercoaster. The build-up was terrific, truly suspenseful; a nifty piece of filmmaking that set the tone for more infectious, degenerate fun. To die under the helm of a skillful filmmaker, arguably, is not to die in vain, as Ebert says, artistry redeems any subject matter, so by definition, not all hyper-violent movies, horror, in particular(his quote was attributed to John Carpenter's \"Halloween\"), are categorically not without redemption. But \"Final Destination 3\" was a rare exception. Conversely, the opening sequence of this franchise's follow-up is nothing but cheap thrills, en route to more cheap thrills without artistry. In \"The Final Destination\", there's nothing to finesse the formulaic story, in which each new plot point will be, more or less, the same as the last one: some crueler and bloodier than others, and all with the same tedious chain reaction set-up. Despite all the stupid teenagers and stupider montages, the film does contain one transcendent moment. Whereas Quentin Tarantino(\"Inglourious Basterds\") is charged with not being serious about the Holocaust in some quarters, the same could be said about the movie's evocation of civil rights movement narratives, in which an avenging redneck(the film stereotypes NASCAR's fanbase), whose racist act towards the black security guard is thwarted by fate, plays like a goof on Alan Parker's \"Mississippi Burning\", and other movies of its ilk."
    },
    {
      "rating": "0",
      "text": "One of the worst movies I've seen in years. Not only are all the deaths of the characters highly illogical, they're not even made believably. And don't even get me started about the ending."
    },
    {
      "rating": "1",
      "text": "Hilarious. but in a terrible terrible way. this couldn't be more of a blatant attempt to squeeze the last bit of the possible money out of the final destination series. if you watched this alone you'd be disgusted. watch it with friends and you'll simply chuckle for an hour and a half at the sheer tradegy that is the deaths, acting and very fake looking affects. this is not state of the art stuff. even if you loved the other FDs, wait till it's on channel at 1am in a few months time. trust me."
    },
    {
      "rating": "3",
      "text": "The 3D was one of the better uses I have seen but the actual plot was so boring and so predictable. I hadn't seen any of the other Final Destination films before this and I will not be delving into Blockbuster to find the others. Pure tripe."
    },
    {
      "rating": "7",
      "text": "It's just sense of humor! Effects are bad but the story unfolds for that special horror spice for all people! But it is still cheap, no acting no i mean none! Just kill yourself and say OMG! Can I be now an actor/actress in this movie"
    },
    {
      "rating": "1",
      "text": "Too much acceleration makes this movie worst. Too much visually violent without considering a harmonized story telling make this movie even worst and worst."
    },
    {
      "rating": "1",
      "text": "this movie is a f***in a**!"
    },
    {
      "rating": "10",
      "text": "This movie is amazing, the effects are great, the deaths are grisly, by far, the best final destination of them all. All my friends love it and i cant blame them. I LOVE IT!!!!! the blood and gore adds to the thrill- TWO THUMBS UP"
    },
    {
      "rating": "9",
      "text": "I've never watched a movie in the series before this one, but I found it easy to get into eve though I haven't, and honestly I really liked, I enjoyed the concept, interesting deaths, and the movie unique sense of humor, and honestly it reminded me a lot of the Saw series, so if you like those movies I believe you'll like this, and it's not really scary just gory, and not even that gory compared to the Saw series, and I personally didn't find it scary (and I'm probably the worlds biggest chicken) so I doubt you will either if that's what your worried about, so if your not into watching 20 somethings die in gory ways then this is not for you, but if your like me and for some unexplainable reason like stuff like this, then this may be a entry point to for a new series to get into, and after this movie a pretty awesome looking one at that."
    },
    {
      "rating": "6",
      "text": "The good of this film is the incredible effects and the violence by characteristic of the genus.Some creative element, but a very badass movie..."
    },
    {
      "rating": "3",
      "text": "Despite being a huge fan of Final Destination and other splatter films, I'm quite disappointed with this Final Destination 4. The death scenes aren't as inventive as the previous ones. But I like that swimming pool scene although it doesn't look very realistic. I never like this director's style in Final Destination 2, and I still don't in this one."
    },
    {
      "rating": "6",
      "text": "Muchos dicen que es la peor de la saga, pienso firmemente que ese lugar le pertenece a la dos, esta parece no tener razón de ser y las muertes son bastante aburridas, pero en el fondo es una película aceptable, floja, pero aceptable, valga la redundancia."
    },
    {
      "rating": "3",
      "text": "NOT MY THING... Horror movies with story that's neither engaging nor story telling are just bad to me. It felt forced even cause you have people who have to die horribly for the sake of movies with no reason to in the first place..."
    },
    {
      "rating": "4",
      "text": "I think this was, by far, the worst of the \"Final Destination\" franchise movies. I hope it does live up it's title. There was hardly any redeaming characteristics to any of the characters who were in death's way to care what happened to them except for George (poor Williams) and perhaps Nick's girlfriend, Lori (who does get the most inventive death, and to me, personally most scariest of the deaths, but even that is revealed as being in a premonition). Agreed with other 'expert' reviews that the 3-D added nothing. The direction was poor, at best, and the writing was horrendous and very tepid (a 3rd grader could have written it). The acting was equally horrendous, with the lead Bobby Campo the worst (his character of Nick had the worst to non-existent reaction to the original premonition I've seen of the four movies in this franchise). What a waste of my money, too bad I didn't have a premonition about that."
    },
    {
      "rating": "10",
      "text": "If your a fan of the series this will fulfil your final destination fix. It's definitely better then David R Ellis first crack at the FD franchise with FD2 but lacks some of the flair that David Wong has in FD1+3. In saying that this film is more lively and gorey but less on the horror/thriller side of things. 3D works well in some places and in other places it falls flat on its face and is used a cop out for a decent scene. I really enjoyed this movie but as a real major fan of FD I did feel some of the deaths were dissapointing and that mini visions instead of subtle hints in shadows etc were abit of a cop out. Hopefully we get another FD soon with David Wong back on board directing and the original writers."
    },
    {
      "rating": "10",
      "text": "This is the worst movie I've seen this year. Yes, I gave it a 10. Why is that? Because it's also the most fun I've had watching a movie this year. This is not art. It is a spectacle. The reviewer who said that it seemed less like a movie and more like Rube Goldberg death scenarios was right. And I couldn't ask for more. Go with a group of friends and laugh from beginning to end. You will not regret it."
    },
    {
      "rating": "8",
      "text": "Overall, this movie was FUN. I agree that the characters, plot and ending were rubbish but sometimes it just does not matter."
    },
    {
      "rating": "10",
      "text": "This one was more alive than the other final destinations. The deaths were more humane and more realistic than the others. The only bad one was the first where the woman got hit with the tire."
    },
    {
      "rating": "8",
      "text": "Oh come on, this is not a bad film. It's my least favorite of the four films, but it was still pretty entertaining for what it was. Plenty of bloody mayhem and over-the-top scenes made this film really fun to watch, made even better with 3D. Give this film a chance because it really is not a bad film. See it in 3D, you'll appreciate to gruesome deaths even more this way."
    },
    {
      "rating": "5",
      "text": "I think that this movie wasn't that bad. It may not be Final Destination 2 it's not that bad either. but this movie does have a poor script and Direct to DVD quality actors."
    },
    {
      "rating": "5",
      "text": "Terrible actors, and a poor script, but the deaths always make these movies worth it. Also, it was kind of hard to watch in 3D but I got used to it."
    },
    {
      "rating": "4",
      "text": "3D could not save this movie, despite the sometimes neat effects, this movie was poor. The film franchise was slowly turning in to \"death porn\" and every film seemed to dumb itself down. The death scenes were strained, if not a slight boring, with the car-wash scene providing the only false sense of dread in this film, if you want to watch this just to see people die in weird ways, then this is for you, if otherwise, then avoid this movie."
    },
    {
      "rating": "0",
      "text": "This movie sucks, I mean, I wasn't expecting it to be great in fact I kinda expected it to be pretty damn awful, and it was, but worse. The acting is horrific and it has weak script. At least some of the deaths are kinda original but were clearly made for 3-D. I understand it isn't trying to be anything great, but it should at least be fun, The first one was a creative concept, but now it's just the same damn movie with different people in different places."
    },
    {
      "rating": "4",
      "text": "Just about bordering on a bad film, but again, if you're into wonderfully thought-through death scenes, watch it by all means. Yes, disappointing acting makes this the worst film in the 'Final Destination' series, but it still achieves a unique status."
    },
    {
      "rating": "3",
      "text": "The director thinks he is orchestrating images and sequences of impact, but the film is a formulaic tedium atrocious! The characters are unconvincing and unbearable, mostly, and the script is absurd and increasingly bad! You can watch us fools when it comes to fun, but it is terribly absurd."
    },
    {
      "rating": "2",
      "text": "horrible just like the franchise, i still dont know how a franchise can make over 3 movies when all the movies have the same plot, same bad acting, and lame scares. The SAW franchise at least had some twist in the end. Final Destination is the same over and over one person sees the future and stops fate from happening and the rest of movie is just a lot of people die. and at the end there is always one person who thinks they survived it and then as they say it  they die. these sequals are just pointless. The only bright side to this franchise is some of the deaths are pretty cool. but its not enough to save this franchise. and what makes me really sad it that 5th came out a couple of weeks ago and there are plans to do another one, hollywood please spare me, kill me now!"
    },
    {
      "rating": "4",
      "text": "The worst of the franchise. The film itself is a nightmare, the acting is bad, and some of the deaths are greatly exaggerated, if you feel for something in this film is that it ends as soon as possible. Save yourself some parts that make the film reasonable."
    }
  ],
  "recommendations": [
    "final_destination_2",
    "saw_iii",
    "paranormal_activity_4",
    "final_destination_3",
    "the_devil_inside",
    "final_destination",
    "malignant",
    "the_twilight_saga_breaking_dawn_part_2",
    "hereditary",
    "countdown",
    "the_strangers",
    "2012",
    "the_new_mutants",
    "jigsaw",
    "ghost_rider_spirit_of_vengeance",
    "knowing",
    "the_grudge_2",
    "the_eye",
    "war_of_the_worlds",
    "shut_in",
    "the_matrix_resurrections",
    "slender_man",
    "the_mist",
    "transformers_the_last_knight",
    "ouija"
  ]
}