{"id": 3002, "title": "The Edge of Seventeen", "starring": ["Hailee Steinfeld", "Haley Lu Richardson"], "runtime": 105, "genre": ["Comedy", "Drama"], "description": "Two high school girls are best friends until one dates the other's older brother, who is totally his sister's nemesis.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/iY5UEYuGxHfaYJ3vAUAWwFGMV7V.jpg", "categories": {"plot": 8.258064516129032, "acting": 8.615384615384615, "ending": 7.25, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.071428571428571, "action": 5.0}, "reviews": [{"rating": "8", "text": "Charming, yet harshly realistic, Edge of Seventeen is a fantastic coming of age story. It is quirky, smart and at times downright depressing. Hailee Steinfeld's brilliant portrayal of a struggling teenage girl represents many relatable life aspects. The film goes deeper however, reflecting the struggles of family and sexual relationships during school. Given this, Edge of Seventeen is a film that a wide audience can connect with and is thoroughly engaging in this way."}, {"rating": "8", "text": "Hailee Steinfeld shines in this heartfelt slice of life-sucks. It's a charming and occasionally edgy coming-of-age that embodies the anxious spirit of teen-dom - when all the little things mattered too much, and a radical, unholy idea dawns for the first time: that the world doesn't revolve around you."}, {"rating": "8", "text": "While the movie falls into a few narrative traps, the writing, acting and characters are so compelling that it has the earnestness and staying power of one of the John Hughes classics."}, {"rating": "7", "text": "The Edge of Seventeen's maneuver may try its best to kill its people to enjoy this film, but none of that could say it in front of the cast's performance. It builds up, but goes down, but builds up again afterwards."}, {"rating": "9", "text": "The Edge of Seventeen is amazing. Great acting and Great writing    ."}, {"rating": "8", "text": "There were moments in this film that were just too painfully relatable. It had a timeless quality to it that almost made it feel like it could have been set at any time in the last few decades. I loved how much of a disaster Hailee Steinfeld's Nadine was. This wasn't the case of her just being quirky. She was genuinely flawed and the movie often allowed her to be the character that was in the wrong, despite being the protagonist. Kelly Fremon Craig trusted the audience to be able to still empathize with a character that isn't always the most sympathetic one in the scene and I loved that about the movie.The movie is filled with great performances. The relationship between Hailee Steinfeld's Nadine and her teacher (Woody Harrelson) is especially entertaining and a highlight of the film.\"The Edge of Seventeen\" felt like a more honest and genuine teen movie than I've seen in a while and I really enjoyed it."}, {"rating": "9", "text": "The Edge of Seventeen is nothing short of a brilliant work. Somehow the directorial debut of Kelly Fremon Craig, the film is polished, smart, witty, and a poignant look at the depressed/ostracized teenager of today. While now a trendy topic, The Edge of Seventeen still remains an important film due to its approach to growing up in the digital age. While an incredibly funny film, it still manages to pull back the curtain on depression and shows what low self-esteem can do to a person who is already on the outskirts of the social world. In a powerhouse performance, Hailee Steinfeld grabs the film by the reins and steers it home, furthering cementing her status as a rising star in the acting world. At her side, Woody Harrelson turns in his best performance in years.The Edge of Seventeen focuses on 17-year old Nadine (Steinfeld). Different from the other kids, she has always had trouble making friends. However, her best friend - Krista (Haley Lu Richardson) - has been with her since second grade. Since that time, Nadine's father - her at-home best friend - died. Now, she is stuck with depression, a brother who is popular, and a mother who has never gotten on well with her. All of this is the formula for Nadine's breakdown when Krista begins to date Nadine's brother, Darian (Blake Jenner). Everything Nadine is not, she feels deeply hurt that her best friend has betrayed her and, in Nadine's eyes, grown past her.A poignant film, The Edge of Seventeen has many cliches from the wise teacher to the meet-cute with a guy in Nadine's class, as well as her fumbling through a potential sexual encounter with her dream guy. That said, it still brings enough originality through Nadine. Incredibly well-written and fleshed out, Nadine's struggles are universal with some tremendous dialogue along the way that really highlights her inner-feelings. Particularly, at the end when she describes how she likes to imagine she is the only one with problems to, potentially, feel unique. A moving scene, this moment really underscores what is Nadine's problem and why she struggles to fit in. Her own worst enemy, she projects negative intentions on others due to her own low self-esteem. She assumes people cannot like her or love her because of her own insecurities. A throwaway line, yet one of the best, comes from Krista. When Nadine is nearing getting over Krista dating Darian, Krista says, \"I missed her.\" Though Nadine may not love herself, others do. Krista does. Darian does. Mona (Kyra Sedgwick), her mother, does. Hell, Mr. Bruner (Harrelson), her history teacher, does. If only she can stop hating herself, her eyes would be opened to how much she is loved. That said, it is easier said than done.Insightful into the struggle of a teenage girl to find the ability to love herself, The Edge of Seventeen is often moving, largely due to its authenticity. Each character acts like a real human being and speaks as though they were one as well. The situations are universal, especially for those who were unpopular in high school. In  this way, it manages to be incredibly impactful with Craig able to create a film that is truly poignant without being sentimental or schmaltzy. It hits home because it is real, not because it is manipulative.While the drama element is tremendously written, so is the comedy. Largely coming from Woody Harrelson or Hayden Szeto (who plays Erwin Kim - a boy who likes Nadine). The dry humor and deadpan delivery of Harrelson's Mr. Bruner is a lot of this films charm. Every scene Harrelson is in, he steals it completely. Similarly, the love-struck and awkward Erwin is brought to life through tremendously awkward and nerdy delivery by Szeto. Every encounter between him and Nadine is imbued with the curiosity, awkwardness, and uncertainty of all potential teenage romances, which - again - makes it incredibly impactful. While witty and incredibly funny, The Edge of Seventeen strikes an excellent balance between the comedy and the drama that few films can ever dream of accomplishing. Jokes do not obstruct here. They add and come at terrific times with great delivery by all.Poignant and funny, The Edge of Seventeen is a tremendous debut from Kelly Fremon Craig. Many have compared her to a modern day John Hughes and maybe this is true, but I need to see more before making the comparison. As it stands, this is a terrific debut with great direction, phenomenal acting, and writing that is smart, witty, and respectful of its characters, even when their struggles are somewhat self-created. A film that hits home for many, The Edge of Seventeen is a film that lives up to the significant amount of hype."}, {"rating": "8", "text": "When people say this film is like a John Hughes film boy were they right.  You can clearly detect a lot of the same beats.  With that said that's a great thing as this film is a real pleasant surprise. A-"}, {"rating": "9", "text": "I'm happy to say that this film more than exceeded my expectations! It had everything going for it and man did it deliver for me! It was funny, touching, and balanced both of these things near-perfectly! Hailee Steinfeld gives an irresistible, charming, and for me a relatable lead performance that is only surpassed by some scene-stealing moments from a very straightforward but nonetheless very funny and always reliable Woody Harrelson! Overall, I absolutely loved this film not only due to the charming and funny story that puts it in the same vein as some of the teen comedies from John Hughes, but also because I honestly felt as though I could relate to so much in this film as it really hit close to home with me and some of my personal experiences at that age. It made me quite nostalgic to return to that age to say the least. In addition, despite its occasional cliches that somewhat keep it from standing out too much from past coming-of-age and teen dramedy films, this is still quite honestly the best of the bunch as it's the best one I've seen in quite some time!"}, {"rating": "10", "text": "The Edge of Seventeen is by far the best movie of 2017. Hailee Steinfeld, Woody Harrelson, Haley Lu Richardson, Hayden Szeto, Blake Jenner, and everyone else in the movie had near-perfect acting. In fact, everyone acted so well that I felt like I was in every scene of the movie, myself. The relationship between Nadine and Krista from little to grown up was so touching; in fact, it is my favorite friend group in a movie. The movie was so relatable to my daily life and all the relationships were beyond incredible. The movie was funny, dramatic, and touching all at the same time, without being over length. Erwin and Nadine's relationship was cute and all the main characters were likable. Hailee Steinfeld's acting was incredible and she gave the best performance of her acting career. I think this movie should've gotten at least a nomination for best acting and best picture. Woody Harrelson played the role of a likable teacher, which I thought was amazing. The movie, itself, without all the likable characters probably wouldn't deserve such a high rating. The Edge of Seventeen did seem a bit unrealistic at times, but it was entertaining and it touched my heart. I have been thinking about this movie for days as it was so touching. Other than that, I thought the Edge of Seventeen was a beautiful film that should start a new genre of filmmaking - one that touches the daily lives of teens. The Edge of Seventeen is a perfect film to watch on date night, as well as at a party. (A+)"}, {"rating": "9", "text": "Great movie! Hailee Steinfeld was absolutely terrific in this movie. First True Grit now this. The movie was a great coming of age story and it was surprisingly hilarious. Bravo!"}, {"rating": "10", "text": "Really liked this one. Captures some universal aspects of this time of life and especially what it's like for kids today. Lead actress is outstanding and Woody Harelson is terrific.  Great movie for me."}, {"rating": "10", "text": "The Edge of Seventeen is a really great coming of age movie about teenager Nadine who struggles with accepting who she is and how people perceive her. It has some really great comedy but also has emotional weight as well, with important character moments and life lessons that can be learned. I would recommend this movie to any young adult."}, {"rating": "7", "text": "Delightful.  Woody Harrelson is a living legend. I can watch him looking at paint drying."}, {"rating": "7", "text": "The main character is modeled after Juno, but the film does speak for itself. It's derivative in nature but is still heartfelt in it's own way. Enjoyable picture."}, {"rating": "9", "text": "Nothing is frustrating than losing a best friend!There are lots of stupid teen films in the recent time. But don't confuse it with them. It is a fine, sensible drama with some fun. It's a dream debut for the director. Being a woman and making a film on the same subject, especially teenager issue, really well investigated and turned into the beautiful film. Yeah, it is now one of the cult films and by the years pass on, it will gain more popularity with a certain group of people.A teen girl who lost her close friend to her brother after they both falling in love which she did not approve. It's only the beginning of her worst life in her mid teenage. So now she has to find a way to turn her life around, or she can live her life as it is, but with complaints. The second half of the film is to cover her attempt to recovery, if she achieves one.The surprise was, I anticipated normal teen comedy that targeted teens only. But it is almost for all ages, excluding the little ones for its strong thematic contents. Kind of inspiring and entertaining film. The casting was awesome. Hailee nailed it just like Ellen Page did for 'Juno'. Yeah, the people were comparing it with that film already. Very satisfying film on this particular theme and definitely a must see.8.5/10"}, {"rating": "7", "text": "Una película entretenida, con un entretenido relato que muestra situaciones típicas de la adolescencia, y una gran actuación de Hailee Steinfeld. Eso sí, muchas partes cliché."}, {"rating": "8", "text": "The script and acting was so awesome and I guess the themes accurate, that I can forgive a bunch of unrealistic resolutions to some realistic problems. Some for comedic effects, some for confortably resolve them.This girl is great and Woody Harrelson just uses his charm by now. He's on that level"}, {"rating": "9", "text": "I went to see this movie on a lark and was very pleasantly surprised. It is very funny and reminded me of the old John Hughes movies.  Yes the movie is about high school but you don't have to be in high school to like the movie...it is enjoyable for adults as well."}, {"rating": "9", "text": "This movie offers everything a good YA-movie needs: a few over-the-top-scenes (but not too many of them), a likeable and relatable main character and beautiful cinematography. There's no trying to be too relatable for teenagers here at all -- this movie tells a story that easily could've been true."}, {"rating": "8", "text": "It's simple, realistic, and much funnier than I expected. I enjoyed every second of this one and it's definitely one of the best coming of age stories released in recent years."}, {"rating": "10", "text": "This movie is more than just a great lead acting role. With an extremely solid story line, it is hard hitting. You can see yourself in place of any character portrayed. A story that anyone would see themselves reliving. There are many layers to this movie, with each and every one packing a punch, giving the viewer exactly what they want."}, {"rating": "9", "text": "The Edge of Seventeen cast, script, and atmosphere, leaves myself in a mixed state of laughter and confused. Nevertheless, leaving me wanting to see another iteration of this film in the future."}, {"rating": "10", "text": "This movie attracts a lot of hipsters at the theater that I work at. Also while I was working one of my co-workers was kind of crapping on it because he thought it looked like a chick flick. So I was considering just putting off seeing it. But I did end up seeing it and thought it was freaking amazing. The first half hour felt almost like a sucker punch with the unabashedly inconsiderate main characters who seem more and more like people I know throughout the movie. Yet the movie was consistently hilarious when it wanted to be and was all so beautifully shot. It was refreshing to me how much I could relate to Hailee Steinfeld's character especially as a guy. By the way she is insanely gorgeous and I haven't seen her in anything before but she gave a real tour de force. I just fell in love with the cast by the end of the movie and I'm probably going to re watch it again. It seemed to have a very triumphant tone to it and I highly recommend anyone watching it."}, {"rating": "9", "text": "I've long been a fan of Hailee Steinfeld and her work ever since I saw True Grit, I wish she would focus more on acting than singing because this movie really showcased her strengths as an actor. I walked into this movie thinking it would be something similar to \"Mean Girls\" or \"The Breakfast Club\" and its not like that in almost anyway. Steinfeld, whose a drop-dead gorgeous actress almost completely sells her roll as this lovable, **** named Nadine. I simply can't say enough about just how good this movie is and how real and relatable it felt as I was watching it. \"The Edge of Seventeen\" at the end of the day is a simply spectacular movie that can leave you laughing and crying with each passing scene."}, {"rating": "5", "text": "For all the hype about writer/director Kelly Fremon Craig being the new, edgier John Hughes, I'm not seeing it. Her dialogue isn't especially smart and the plot is downright derivative: A misfit, awkward high school girl from a dysfunctional family with best friend issues, who ignores the sweet nerdy boy who has a crush on her for the unattainable cutie. The only interesting performance comes from the geeky suitor, played by Asian charmer Hayden Szeto. To make matters worse, the lead character (played by Hailee Steinfeld) isn't particularly clever, interesting or sympathetic…just neurotic and borderline obnoxious. Her relationship with a teacher (Woody Harrelson) is somewhat inappropriate and not especially meaningful. While it moves with energy and the performances are decent, there's nothing new or special to make this film memorable."}, {"rating": "7", "text": "“Edge of Seventeen” stars Hailee Steinfeld, Blake Jenner, Haley Lu Richardson, Kyra Sedgwick and Woody Harrelson in this coming of age film about a teenage girl and the problems she and so many of her generation face in being accepted and in coping with the reality of social competition. The film was written and directed by Kelly Fremon Craig and represents her first directorial endeavor. I might also mention that one of the producers of the film, Julie Ansell, is the daughter of one of our readers,  Although Ms. Steinfeld’s performance, as with the other actors, is genuine and quite skilled, the film itself is more like a television movie than a full length theatrical motion picture, certainly as to the depth of the writing and the production values it seeks to achieve. Nevertheless, the film is an honest portrayal of one girl’s obstacles and how she tries to cope with them and for that reason, together with fine performances by the cast, I give the film a 7.0."}, {"rating": "6", "text": "Oh no, not another coming of age movie! I don't think I can stand watching another one as they are all pretty much the same with the boy or girl coming to grips with sex and the accompanying emotions and situations. This movie has chick flick written all over it. You've been warned, guys."}, {"rating": "4", "text": "Not the revolutionary film you were hoping it would be but also not exactly boring. Woodey Harrelson the high point of the film. You could tell the ending the ending before it even happened. Soundtrack isn't terrible. I give it a 4. It's watchable but it's not going to be the good time your looking for."}, {"rating": "3", "text": "Deja vu all over again.  The movie is worth more than a 30, but the current score 77 needs seriously watering down. And now Im just writing something to get to 150 chars..."}, {"rating": "4", "text": "This coming of age story was a huge disappointment. The cast is awesome, all very respected and/or talented actors, but the plot and story line was definitely lacking."}, {"rating": "6", "text": "best beginnig and not suprisingly worst ending that I could imagine. hailee was awsome as a teenager and she was totally realistic and believable but if you're looking for some good form and directing skills... well it's probably not a good choice"}, {"rating": "9", "text": "Very good !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "6", "text": "The scenes with Woody  Harrelson are the best thing about this    film. The edge of seventeen has its charm but    it gets pretty cheesy at the end"}, {"rating": "9", "text": "I AM Nadine and she’s my comfort character"}, {"rating": "7", "text": "The Edge of Seventeen comes and goes like a breezy autumn wind. It passes by quickly and likely won’t be named as the best of its genre, but it gets the job done."}, {"rating": "8", "text": "Hailee Steinfeld's best performance since her Oscar-nominated role in True Grit headlines a first-class coming of age story. Funny, real, and heartfelt, this dramady is like Freaks and Geeks set in the 2010s."}], "recommendations": ["me_and_earl_and_the_dying_girl", "the_spectacular_now", "lady_bird", "instant_family", "eddie_the_eagle", "10_things_i_hate_about_you", "moonrise_kingdom", "the_big_sick", "the_intern", "the_perks_of_being_a_wallflower", "midnight_sun", "the_king_of_staten_island", "silver_linings_playbook", "sleeping_with_other_people", "the_fault_in_our_stars", "the_upside", "gifted", "me_before_you", "blue_valentine", "the_royal_tenenbaums", "love_actually", "fatherhood", "christopher_robin", "booksmart", "scent_of_a_woman"]}