{"id": 267, "title": "The Craft: Legacy", "starring": ["Cailee Spaeny", "Lovie Simone"], "runtime": 94, "genre": ["Horror", "Drama", "Fantasy"], "description": "An eclectic foursome of aspiring teenage witches get more than they bargained for as they lean into their newfound powers.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/lhMIra0pqWNuD6CIXoTmGwZ0EBS.jpg", "categories": {"plot": 3.0357142857142856, "acting": 2.8125, "ending": 6.166666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 0.8, "funny": 0.0, "action": 5.333333333333333}, "reviews": [{"rating": "0", "text": "The movie was lame. Idk what else to say the storyline was trash. You could almost anticipate the dram"}, {"rating": "4", "text": "Although the 96 film is nothing out of the ordinary, I understand the affection that many people have for it and the cult it has grown over the years.I never would have thought it needed a sequel and it never did, but here we are 24 years later.To tell you the truth, I don't know what this film is trying to say or show.The Craft: Legacy, it's not about exploring anything new, if at all commercially exploiting feminism and criticizing the patriarchy.This is a film that obviously plays it safe, way too safe, and it never intends to risk anything, and I find it ridiculous - regardless of the movie rating rules - that it has such a tame attitude, because for our time, this film should've been decidedly more cheeky and direct.And that ending. What can I say?If they're seriously considering a third one, they should cancel that idea immediately."}, {"rating": "1", "text": "So I watched The Craft Legacy on an airplane. And if I was going to advise someone else to watch this movie (which I won't. See rating) I'd say that is the only way to see it. Trapped. With nowhere to go. And having hit the bottom of the viewing que. I had the chance to re-watch the original a few years back. The original was very much a product of its time. Nothing monumental. An amusing flick. And parts of it hold up well. It has character growth and a compelling narrative. This film does not. I'm pretty sure this is the most woke film I've ever seen. Girls fawning because they guy they brainwashed into being nice said he was \"cis-gendered\" at one point. While the rest of her \"coven\" are all supposed to be unique and different, really they can all be treated as one character. Its ironic 3 characters who could not be trying harder to be different all being functionally identical so far as the plot is concerned. OK. Positive things. The coven \"clique\" was believable as friendship. David Duchovny didn't have much to do, but he did it well. And the Melissa Monaghan/lead mother daughter dynamic was nice to see. It was quirky and wholesome. Not dysfunctional. So of course it promptly vanished when plot had to happen.  There is the potential for interesting ideas that went unrealized in this film. Largely for the sake of a LGBTQ+ woke fever dream about how people act and behave. My only issue with that is, when everyone is on the same page from the get go (except the villain who is over the top cartoon patriarchy) it saps any tension and sense of plot progression. Can't grow or learn when you're already what the author considers the ideal. Well now we know. I hope all involved move on to better projects."}, {"rating": "2", "text": "Imagine The Craft, but it's a Disney Channel PG movie.No scares, magic now sparkles, everyone is friends with no conflict and everyone is very socially aware.There is no fun in this movie for anyone over 13. If you are thinking of watching this because you love the original, there is nothing here for you."}, {"rating": "0", "text": "This movie was just terrible. It has more montages than Rocky IV with no character development. Total waste of time and money. If you want to see a fun movie with character arch's and some plot development watch the original."}, {"rating": "1", "text": "The movie we've all waited for and now we wish we could get our time back after watching. The movie movie follows the daughter of one of the original witches in what could've been an amazing sequel, but fell short on everything. The movie was rushed, boring, and anticlimactic to say the least. If you're a fan of the original Craft please don't waste your time with this movie."}, {"rating": "0", "text": "Garbage...too wokeThey tried way to hard and fell short idk what the original one was like but my wife was stoked until we started watching it."}, {"rating": "0", "text": "There's not an ounce of magic in this dire sequel. Rushed, incoherent story, David Duchovny was more zombie than warlock and next to no character development. The original had a bit of an (oc)cult following. The sequel is more daft than Craft. Avoid."}, {"rating": "3", "text": "Richard Roeper gives this an 88 LOL.  SO much for those two actually having standards!  This movie was actually tolerable until approximately half way through when the LGBQT and feminist crap and all the politics started showing up.  They literally made the main guy character into a complete tool.  It became pretty much unwatchable at this point.  The politics in this film completely destroys it."}, {"rating": "0", "text": "This film is plain awful. It's a rehash of the decent original but offers a weaker, poorly written mess of a movie. It attempts to tie into the original but only left me thinking how ridiculous it was that the main character initially experiences the exact same storyline as the characters in the first film. There also a fair amount of wokeness, a tiny pinch of BLM and a generous amount guys hiding their sexuality (because every guy is secretly gay according to Hollywood).The ending is laughable. David Duchovny must have fallen on hard times. Avoid at all costs. Watch the original instead."}, {"rating": "0", "text": "This is not Blumhouse worthy. This is a Disney production undercover.Not at all relatable to the original. Should have an entirely different name.PG13? A 10 years old kid would laugh at the screen.If you make a movie with basically 7 payed actors, pick priorities. A trans-Asian-plus size-blond-deaf-Jew-vegan-with an Irish accent does not make ONE SINGLE character interesting or deep. It’s a mess. As a gay, black and Asian I don’t feel connected to any character at all, but that is what they tried here: check every box so the movie will connect with you somehow.Fail. Big time."}, {"rating": "2", "text": "Daughter of the badly-behaved girl from the original, strangely, has a lot of the same things happen to her but with a lot more gender/sexuality politics forced in."}, {"rating": "9", "text": "So.... Just watched The Craft Legacy. Where do I begin? Firstly, I feel there is a hell of a lot of unjustified hatred being aimed at this film. Yes, it is woke. Woke AF! It's definitely a product of life in 2020 which I think is great. It had a lot going on so the film could have done with being longer to give us some more in depth knowledge about certain characters and their storyline but it didn't try to be the original movie. It really made itself its own entity which I'm so pleased about. There was a shedload of Easter eggs which I loved spotting. The chemistry between the Coven is amazing!!! All the girls are great. Their bond was lovely to see. It was very respectful to Witchcraft practice. It thankfully didn't fall into the final act of the first film which I always felt upset by. And.... That final scene has me terribly excited for another film Blumhouse!Very well done."}, {"rating": "7", "text": "If you can get past the first 30 minutes of this popcorn flick you are in for a pretty good movie. The story here is a continuation of “The Craft,” but it uses more contemporary themes and plot devices. There’s some cringe worthy acting and some woke social justice moments, but in many ways that all plays to the story’s strengths. The huge shock, and pleasant surprise, is how well cast 90’s super star David Duchovny is for his role. My biggest complaint would be that like a lot of Blumhouse films it gets to an interesting point in the development of the story and then it ends. That means that it doesn’t stay past it’s welcome, but also feels like it’s missing something. Still, I’d recommend it."}, {"rating": "7", "text": "A good update on the original movie and the new cast of  young actors are superb in their roles as witches. Great to see a casting of a young transgender actress as one of the leads.Story follows along the same route with a few twists and turns to get you wondering what will happen next. Though I felt that it lacked the originality of the first movie, it still kept me enthralled until the end with a twist that was a great connection to the original movie. So to summarize I as a fan of the original movie found this one not as good but still an enjoyable movie that I know everyone will love."}, {"rating": "8", "text": "okay so lets start y saying that i watched this one over the weekend and i was very impressed with what i saw there was mystery good action plot and adventure it really isnt as good as the first but i dont know if i would have liked it had it been too similar to the original its smart and i highly recommend it"}, {"rating": "10", "text": "I LOVE IT. It's not a remake it's a reawakening to the 1996 hit and the build into what's going to become a POWERFUL trilogy or hopefully even more. I LOVE IT. I LOVE THAT THE CRAFT IS BACK. Critics don't see that it's trying to build and keep comparing it to the first movie,  it's not it's it own movie sequel diving back into the world of the craft reawakening the series.  Bringing in warlocks is a great move to bringing the witches together and shows great opening to a 3rd movie."}, {"rating": "10", "text": "IT WAS AMAZING! To those of you that hated it and proceeded to leave a hateful review, I just want to say, movies are not meant to please everyone and they’re not meant to be perfect. WE WANT A THIRD MOVIE! So don’t ruin it for the rest of us just keep moving along, you don’t have to watch the third but those of us who love everything about The Craft would like to! Don’t be a party pooper!! I don’t want to spoil anything but it was GREAT! Lots of twists and surprises and lots of suspicion left for a THIRD MOVIE!! I want more of The Craft! PLEASE MAKE A THIRD FOR THE TRUE FANS!!"}, {"rating": "10", "text": "Amazing film, even better then the first one!! The writer and director actually made it about sisterhood and empowerment for so many people throughout the movie!! Loved it"}, {"rating": "7", "text": "okay so lets start by saying that i loved this movie its action packed and faced paced the lovely ladies and good plot is a real halloween treat i know its getting bad reviews i say ignore it see it very smart movie"}, {"rating": "10", "text": "I personally think everyone should watch this movie. I enjoyed everything about it!!!"}, {"rating": "5", "text": "Just watched it. Talented actors, very interesting characters that I wanted to delve deeper into, and a very interesting story. However, the pacing was way off, some things happened too fast, and the characters were not well developed. It feels like a chunk of the film is missing. The final battle needed less bad CGI as well. This could have been a great movie, but it feels like they made a portion of it and stopped. I don't like social justice warrior stuff and anti-male agenda, but the storyline worked."}, {"rating": "0", "text": "WOKE, boring junk! Why is this in the Horror genre? Just STOP! This Craft Legacy, following after the original is laughable and junk! It had so much potential but it had to go down the WOKE drain instead"}], "recommendations": ["the_maze_runner", "fantastic_beasts_the_secrets_of_dumbledore", "what_happened_to_monday", "terminator_genisys", "tomorrowland", "the_new_mutants", "pirates_of_the_caribbean_on_stranger_tides", "the_darkest_minds", "now_you_see_me", "the_many_saints_of_newark", "unfriended_dark_web", "incredibles_2", "colossal", "percy_jackson_sea_of_monsters", "maze_runner_the_scorch_trials", "i_am_number_four", "the_adjustment_bureau", "the_butterfly_effect", "vampire_academy", "the_x_files_i_want_to_believe", "code_8", "brightburn", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "frozen_ii", "chaos_walking"]}