{"id": 4081, "title": "The Abyss", "starring": ["Ed Harris", "Mary Elizabeth Mastrantonio"], "runtime": 140, "genre": ["Adventure", "Action", "Thriller", "Science Fiction"], "description": "A civilian oil rig crew is recruited to conduct a search and rescue effort when a nuclear submarine mysteriously sinks. One diver soon finds himself on a spectacular odyssey 25,000 feet below the ocean's surface where he confronts a mysterious force that has the power to change the world or destroy it.", "releaseYear": "1989", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jel2BuDv7Bq4fuv2pUrTfiBm69o.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.5, "ending": 7.444444444444445, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.5, "action": 7.0}, "reviews": [{"rating": "9", "text": "I absolutely loved this movie. Great effects, great story and some really memorable characters. Ed Harris in particular. Actually to go back, the effects in this were amazing back when it first came out. But even so, they only play a small part of the movie. Appearing at just the right moments.\r Overall:\rThis was one of my favorite movies as a kid, still is today."}, {"rating": "8", "text": "The plot of James Cameron's fourth film shares many similarities with his third film, Aliens. Teams of armed forces with ultimately ulterior motives sent in to claustrophobic and isolated environments to investigate missing groups. Oh and those environments are occupied by aliens.\r Three-quarters of The Abyss are great as the ever-present dangers of deep sea isolation coupled with Michael Biehn's stir crazy SEAL ratchet up the tension to a decompression sickness-causing level . As the mission begins to fall apart, the greater fear factor is provided by the underwater drama, cut off from the surface in a damaged platform with decreasing oxygen levels rather than the alien presence. This is a little disappointing considering the film followed Aliens, in which there was no doubt what was responsible for the suspense. Cameron obviously felt like giving the Abyss aliens a more mysterious rather than menacing persona. This leads to a slightly disappointing finale as the alien presence is gradually revealed and all threat along with it. It all becomes a little unnecessarily enchanting.\r Ed Harris leads the cast and gives an another excellent performance. Has this guy ever turned in a dud one? Mary Elisabeth Mastrantonio gives an equally assured performance as Harris' estranged wife and platform designer. The rekindling affection between the two is key to the film's success and the scene following Harris' return to the platform with Mastrantonio's body is genuinely emotional and fantastically performed by Harris.\r For it's age, The Abyss still looks great and remains a good to great sci-fi thriller."}, {"rating": "9", "text": "Riding tall on its still-majestic production design and visuals, James Cameron's \"The Abyss\" also scores high for its cleverly high-brow story and impressively varied display of performances."}, {"rating": "7", "text": "James's Cameron's The Abyss is an oft-overlooked sci-fi epic. It's incredibly inventive, and the brutal way in which this movie was filmed definitely adds to the constant atmosphere of tension the film portrays. This is a very stressful watch, made even more stressful with the knowledge of what Ed Harris, Mary Elizabeth Mastrionomo, and the rest of the cast and crew had to endure to bring this story to life. This movie is DENSE. There are a lot of moving pieces, but everything gets tied up nicely at the end. It's a little long, a little dated, but it has its place in sci-fi movie history."}, {"rating": "7", "text": "So this is where Michael Bay got the belief that oil rig workers could be tasked with government jobs that concern the safety of the planet and species. In fairness to Bay, not only is Armageddon a better film (shoot me), but if James Cameron did it, it has to be right. If Cameron said that the world was flat, considering how much time he spends in submarines, it would be hard to deny him that fact. Thus, in cinema, if he says something works in a film, who am I to argue? Taking Close Encounters of the Third Kind, sprinkling in Sidney Lumet's Fail-Safe, blending it with Bay's later film Armageddon, tossing in Robert Zemeckis’ Contact, and dumping it underwater like the end of A.I. Artificial Intelligence, James Cameron's The Abyss is both heavily influenced by other films and, naturally, its style is similarly influential. Though it may be a bit too cliche, sentimental, and wholly predictable, but in its sickly sweetness is Cameron's typical directorial brilliance. With pitch perfect action sequences and rock solid production design, The Abyss is able to overcome its sentimentality and cliches.This mess of sentiment and narrative cliches is largely found in the relationship between Bud (Ed Harris) and Lindsey (Mary Elizabeth Mastroantonio). With Lindsey the brain child behind the oil rig that is tasked with finding the lost USS Montana and Bud the man who operates the rig, the stage is set for this married couple to rekindle their love for one another. At the brink of divorce, always fighting, and butting heads, Bud and Lindsey's relationship is tested when the oil rig must face off with their Navy pals who are intent on blowing up the nuclear warheads on the USS Montana and with the alien aquatic species they encounter underwater. Cameron sprinkles obvious symbols and sentiment throughout this film with to their relationship, but it mostly all comes together to mean: love conquers all wounds. When Bud was about to drown, he sticks his hand in a rapidly closing doorway, and the door only does not shut because it got stuck on his wedding ring. When Lindsey is about to drown, Bud's love for her and unwillingness to give up on her breathing again is what saves her. When Bud is about to drown after doing a deep dive, it is his love for her that keeps him going and keeps him sane. It is cliche and similar to any number of films with the \"they really do love each other\" trope. Sprinkled with the awe of meeting aliens and the reuniting of a once fractured couple and this is a sickly sweet concoction that one would expect from Steven Spielberg, but stands as Cameron's first foray into lazy emotional heartstring pulling (see: Titanic).This couple strife is at the center of many films and, yet, it is just one of Cameron's indulgences in cliches. Though Cameron is a master of action direction, his weak point has always been the story of his films, having to rely upon cliches and simple characterizations as a jumping off point for brilliant special effects and thrilling moment after thrilling moment. The Abyss is no exception, but does begin to run a bit clunky due to these indulgences in cliches. These cliches include the God-like aliens who are there merely to save humanity unless it demands destruction and the military characters that are overly enthused to blow stuff up even when it is readily apparent that their conclusion is way off the reservation. Cameron doubles down with that aforementioned relationship, however, in turning it into a \"love conquers all\" type of film where love is given dominion over plausibility. Though a film about alien encounters, it can still be plausible until the end when love saves both Bud and Lindsey even when both would have died long before they met one another again. This implausibility and the cliches in their background relationship really undermines the potential emotion of the film with Cameron taking a shortcut to try and conjure up pathos. Unfortunately, with the implausible introduction of love conquering all and the sickly sweet setup, it winds up being nothing more than eye-roll inducing, predictable, and quite hollow.That said, while the film has some serious narrative flaws, it is impossible to come away from a James Cameron film unimpressed. The man is a master of action and visuals. For the former, the film opens with the USS Montana going down under mysterious circumstances. Slowing building up the tension with radars going down and the lights going out, Cameron sets the scene for the film's science fiction conclusion, but nonetheless laces it with tension from the very beginning. Is it the Russians? Could they do this? Expertly pacing the moment with strong militaristic writing in the scene, Cameron manages to make the film's first few moments some of the most tense in the whole film while perfectly setting up the rest of the feature and, most importantly, not revealing too many of the film's underlying secrets."}, {"rating": "6", "text": "The true wonder of the movie seems to take a direct nosedive toward the abyss after temporarily becoming a long war crime drama. Special effects will grab anyone's attention, especially in 1989's case. The characters: developed. Romance: average. Action is \"average\" as well. The plotline is the center of attention, and it wouldn't be much of a movie without it. James Cameron's vision of aliens under the sea are not what you would expect. They appear like giant electric sea creatures that are distorted in a way, making the line hazy between a giant sea creature never before discovered and something that actually came from space. By the end, everyone could be thinking \"entertainment under the surface, who knew?\""}, {"rating": "7", "text": "Cameron understands each individual emotion so perfectly, almost humanly, that you have to give in.The AbyssJames Cameron's another sci-fi adventure surprisingly doesn't resemble with Ridley Scott's Alien but Steven Spielberg's Close Encounters Of The Third Kind; I know that's a lot of name drops, but I am going to try and write about the film with as many references as possible. Like how the film also resembles with Danny Boyle's 28 Days Later in the sense that nature doesn't behave as an evil entity (just as Anne Hathaway whispers it beautifully in Interstellar) but by the humans at the point of crisis.And it is simply moving to see a visual galore like such, fit in both socially and politically. Usually you'd have to enter a different screening for that amount of drama. Speaking of drama, Cameron is monetizing the film by doing something impossible even for now, I am not even going over the fact at what year was this released. Perhaps this has always been his style or motto or identity, he has always been ahead of both the technology and expectations of a movie goer.If he has kept his arms tied on pushing the boundaries as a narrator, he certainly directs then, all his guns towards the embroidery of that iconic fabric. While making such green screen CGI mashup, Spielberg has always said that he prioritizes his animation on having emotional bond with the audience. And Cameron with his wit is weaving a nail-biting drama from such technical aspects that you wouldn't expect it to be anything beyond a distraction or a matter of panache. There is celebration with that technology, but surfing for almost three hours, he terrorizes the textual communication that we are told, comes from The Abyss. Now walking in the dark alone is really scary, but someone or something strange present in that darkness is on a whole new level."}, {"rating": "8", "text": "The Abyss was made in 1989 by James Cameron who made classics such as Aliens and The Terminator... Mary Elizabeth Mastrantonio, Ed Harris and Michael Biehn star in this sci-fi adventure... It's hard to sum the Abyss up in words, some other life in the ocean and it's alien but friendly. The film was great and Michael Biehn was excellent and so was Ed Harris and the special effects were good and it felt really beautiful...My only negative opinion about the film was it's too long but besides that it's perfect and the perfect happy ending too."}, {"rating": "7", "text": "Very good, but it's a bit too long. That female character was too irritating to like, even though she revealed her issues close to the end. The pacing of her development was developed too late, making her annoying and too hard to forgive in the end. Giving us a hook or two suggesting something more to her in the beginning would've solved this problem, and brought more life to the enchanting moments. Underwater scenes are excellent."}, {"rating": "6", "text": "For a movie of the year 1989 the movie is good, especially the special effects are incredibly great. The setting is perfect, because there are not so many AAA movies from the deep sea. The plot was also good and interesting.But the movie is too long and the worst part is Lindsey, she destroyed almost the whole movie with her overconfident and masculin behaviour. especially in the first part of the movie she was unbearable. Without her the movie could be easily 9/10"}, {"rating": "8", "text": "Even if the film included some of his eye-rolling quirks, it was a “James Cameron” event, a big deal, a spit-polished special effects epic with a big, passionate heart."}, {"rating": "9", "text": "From same mastermind of Terminator and Titanic, about how the mission for retrieve a sunken nuclear submarine becomes an encounter with the uncanny, in the bottom of the sea. Astonishing special effects that not hampers the plot. For watch with a big bag of potato chips."}, {"rating": "9", "text": "Abyss is an excellent Sci-Fi movie from James Cameron. Good production, realism of what is happening and great acting by Ed Harriss. Despite the great timing, suspense in the film holds the viewer. I advise everyone to watch, for some reason I do not understand about Abyss, many forget when they talk about James Cameron's filmography. The only disappointing thing is the children's finale with aliens."}, {"rating": "7", "text": "What ultimately saves the first hour of the film are the phenomenal and impressive Oscar-winning VFX (they are truly way ahead of there time) and a couple of creative ideas we see every now and then, for I found it lacking the emotional impact, suspense and the interesting characters other Cameron's films are known for. Actually, the first hour is basically a show of Cameron's trademarks and nothing but. Even the plot is incoherent and barely make sense. For all that, I was 100% percent sure there's no way I could like this film.After the first four, The Abyss took a turn for the better. the suspense gradually increased till it reached its peak at the third act. Likewise, with the help of a desirable and palpable chemistry between Ed Harris and Mary Elizabeth Mastrantonio, the characters became more and more interesting. When the film went for the full sentimentality and cheesiness by the end, everything worked for me, and I was thoroughly engrossed. And I think there's no better proof that I cared about the two lead characters by the end than that.P.S. the CPR Scene is one of the most emotionally intense scenes I've seen in a Cameron film, nay, in any film!(7/10)"}, {"rating": "8", "text": "The Abyss (1989): One of the most underrated films ever made with a production history unlike anything ever undertaken till then, or since James Cameron's The Abyss is a hard, thinking man's science fiction epic with enough resonance and adventure to fully whet your sci-fi appetite. The film centers on a bunch of divers who must locate a submarine which has vanished, and the crew begins a search for it. There are aliens but not the likes you'd expect. There are heroes and villains but none that you could point and say is something I have seen previously. The special effects are subdued but enhance the story and bring a certain dimension that makes the agony of our characters much believable. The making of the Abyss is the stuff od nightmares and once having seen or read about the production experience that Cameron, the crew and cast put themselves through makes you want to appreciate this gem even more. The Abyss is James Cameron's forgotten film and it must be given its dues. (Forgotten sci-fi gem)."}, {"rating": "10", "text": "This is probably the most underrated of Cameron's movies. It laid the foundation for much of what we see after, and has some absolutely stellar performances by the cast."}, {"rating": "7", "text": "This movie is probabily one of the most original that has never been made about the aliens. All Cameron poetry is evident here and it fully lives in his directing. I have to say that I don't go mad for theatrical version of the movie while I liked a lot the uncut version because the ending has a fantastic scene that taken singularly is a true masterpiece. The movie is slow paced, visually beautiful and pretty monotone in its theatrical version while as I said before the uncut version is way better."}, {"rating": "7", "text": "This was a really good underwater thriller. The special edition version is definitely too long though. The ending is brilliant and the middle good but a few bits really did drag on too long. This is definitely worth watching but probably only the theatrical version. That is assuming that the ending remains intact. Ignoring occasional slow pacing the bottom of the sea was never so exciting."}], "recommendations": ["the_perfect_storm", "in_the_heart_of_the_sea", "midnight_special", "everest", "first_man", "ex_machina", "the_martian", "upgrade", "interstellar", "the_finest_hours", "dawn_of_the_planet_of_the_apes", "deepwater_horizon", "apollo_13", "the_rover", "unbreakable", "minority_report", "close_encounters_of_the_third_kind", "deep_impact", "total_recall", "annihilation", "reminiscence", "fantastic_beasts_the_crimes_of_grindelwald", "the_beguiled", "dark_city", "hellboy_ii_the_golden_army"]}