{"id": 3545, "title": "The Glass Castle", "starring": ["Brie Larson", "Woody Harrelson"], "runtime": 127, "genre": ["Drama"], "description": "A young girl is raised in a dysfunctional family constantly on the run from the FBI. Living in poverty, she comes of age guided by her drunkard, ingenious father who distracts her with magical stories to keep her mind off the family's dire state, and her selfish, nonconformist mother who has no intention of raising a family, along with her younger brother and sister, and her other older sister. Together, they fend for each other as they mature in an unorthodox journey that is their family life.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/d5fLQ9ZMa1jZ2mODCv5lOWJDugX.jpg", "categories": {"plot": 7.46875, "acting": 7.290322580645161, "ending": 8.428571428571429, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "My main issue with The Glass Castle is that it asks you to feel sorry for two unfit parents as they drag their family  through the dirt with no regard for anyone for themselves and are just generally horrible people. With that being said, the cast shines in this and its a touching story of how  children can survive rough parenting."}, {"rating": "8", "text": "The story of a Mountain Goat!This was like a combination of 'Captain Fantastic' and 'Infinitely Polar Bear'. But only a messed up tale than them. It was based on the book of the same name which originally a true story. A fascinating one. Inspiring, as well as heartbreaking story. But a wonderful film for families to watch. Because it focused on the family's unity in the difficult times. Told from a kid's perspective as she was growing up having suffered from basic facilities, along with her siblings.A family with a below poverty level, frequently moving from town to town, making a home in the remote places has one dream that they want to build their own glass castle, particularly for the kids. One of sibling who is close to her father, realises what's going on in the family and tries to find a solution to it. So it takes years to accomplish, and those years were narrated for us with so much fun and emotions.I love this kind of tales, When I came to know it that it was a memoir based, I loved it even more. True stories always reach my heart. This was just like I wanted. Enjoyed every bit of it, especially performances were top notch. One of the highlights was Ella Anderson. Find of the film, despite she has done other decent roles prior to it. Brie's not a great actress, but her choice of films always was the best, hence her part too was good in this.Second feature film for the director, as well as with Brie. He was good though. Not to say anything about Harrelson, one of the under-rated actors of our generation. He should get the Oscar nominee for this role, but that's very unlikely I think. Naomi too has given a memorable performance with the rest of the cast. Forget the runtime, it was so fast and the always to points. Definitely one of the best of the year that must not be missed.8/10"}, {"rating": "7", "text": "The story is decent. Some of the jumps in time are a little too much for me, and Janette's boyfriend was a little too boring for my liking, but otherwise, this was well done."}, {"rating": "8", "text": "I loved it and was touched by the characters strength and courage.  what more do you need?  the acting was very good.  woody and Naomi are exceptional.  the directing and story-telling might have been tighter, but I loved the movie"}, {"rating": "10", "text": "This was a very touching film about extremely flawed parents. What's incredible to me is how the 4 children not only survived, but three of the four became successful and productive despite the neglect. Makes you wonder about rich parents whose children die young of a drug overdose. This story tells you that some people can overcome adversity under the most trying conditions. What helped a lot was that the parents did love their children, and that the children knew they were loved. Woody Harrelson did an excellent job of making his awful character sympathetic. The middle-aged Jeanette, Ella Anderson, was excellent with her expressions so you could feel her pain. Because of Ella, you know why the adult Jeanette, Brie Larsen, has become hardened towards her parents. I'm sure it's easier to understand this story when one identifies with the story as we did growing up in the same era."}, {"rating": "5", "text": "The original story captivates the spectator from itself, but that doesn't mean it is beautifully pulled off as it should be. The director's effort just doesn't live up to the story and that is one of the worst mistakes a filmmaker can commit."}, {"rating": "4", "text": "You'll be disappointed if you're expecting another free spirit family like CAPTAIN FANTASTIC. This film is about an oddball nomadic family that's lauded over by an abusive, alcoholic father (Woody Harrelson). Unfortunately, since his character (and performance) aren't especially sympathetic, it's hard to feel much empathy. An excellent Brie Larson plays one of the children who has become a successful writer in NYC. The narrative moves between her adult character and the formative events from her difficult youth. Her continued strife with the patriarch keeps dragging this movie into repetitive and unpleasant territory. While everyone is earnest, the drama moves too slowly, revels in dysfunction and never creates much emotional impact."}, {"rating": "7", "text": "I was torn by this movie.  There are certain scenes that are handled to light for the subject matter. Also I had a hard time with sympathy when certain characters just acted so poorly. Overall though the film overcame some flaws to at least get my admiration. B"}, {"rating": "5", "text": "This is one of those rare films that I found so depressing and melodramatic that I can honestly say that I never want to watch it again, and likely never will. With that being said, the performances are a strong point to the film, with Brie Larson as compelling as ever, along with some emotionally devastating supporting turns from Woody Harrelson and Naomi Watts. Overall, if you absolutely must see this, I'd strongly suggest only seeing it once for the acting only, if anything, because this one packs an emotional and depressing wallop that I found was too much for even me to handle, which is quite disappointing, considering how much of a better grip Destin Daniel Cretton had on the heavy subject matter he tackled in his previous film 'Short Term 12.'"}, {"rating": "8", "text": "This is Lionsgates's best movie. I'm a big fan of Brie Larson and the movie was still awsome without her. Her past two, Kong and Free Fire were awful(both took place in the 70's with even the same \"run through the jungle song) but I can't fault her for them being a reminder at how unpleasant it can be to watch a bad movie. It was great seeing her in them so maybe it was good she signed on anyway. I thought Glass Castle would be great, it had Brie in a non-action role,(that always coincides with a really good movie)it's been established that the book was good and it seemed to show engaging moments of what a certain type of movies are really good at showing:exceptional lives that still stay within the bounds of \"I can believe it\" territory. Fortunately, this is the latest great movie in my recent streak. After seeing a lot of decent and slightly disappointing ones, this makes me feel good about the rest of the year. Now for Detroit. And of course, last jedi and justice league hype!"}, {"rating": "8", "text": "I never got around to reading The Glass Castle prior to seeing the movie version of Jennette Walls' memoir.  This memoir tells the tale of a childhood, the laughs, tears, inspired moments, and the low points of a life filled with neglect and poverty in rural West Virginia.  Throughout the film, the viewer is convinced  of parental love, and yet, confused by its lack of application towards care or health.The young actress, Ella Anderson, stole the movie with her soulful expressions. Her pain, laughs, and joy played unbelievably real. Woody Harrelson did what Woody does so well, play the drunk. In my opinion, there were two unfortunate acting choices, not because they aren't skilled actors, but rather that they appeared woefully miscast. Jeannette's fiance's appeared out of place and not believable. I found it difficult to put my finger on the problem.  Naomi Watt is an excellent actress, but stuck out as the proverbial sore thumb here.  Her attractiveness shone through in spite of her character's dowdy facade.  Her part kept me from finding the entire movie believable. (Sorry Naomi.  I do enjoy you in other things. The Outsider...hot, hot, hot with Tim Daly.)I loved the ending credits with real pictures of the family.  Totally worth seeing."}, {"rating": "7", "text": "'El Castillo de Cristal' tiene un gran despliegue fotográfico, una banda sonora más que respetable y una base argumental magnífica, la vida de Jeannete Walls, de su familia y de sus historias. Por momentos se siente que abusa demasiado de los sucesos de Nueva York, en vez de explorar lo verdaderamente importante de esta historia: La incapacidad de un padre amoroso de cumplir con sus responsabilidades. No es que la película no deje en claro este punto en particular, pero simplemente omite muchísimos escenarios del libro que son muy importantes para comprender el presente de Jeannete, su hermano y hermanas y al mismo tiempo le da demasiado protagonismo a un personaje, sin dejar explotar el potencial del resto del reparto (verbigracia Saddie Sink y Josh Caras podrían haber sido mejor implementados). Por otro lado, los momentos sentimentales son eficientes y memorables, la trama está bien organizada (tampoco de forma magistral) y no es para nada una película aburrida."}, {"rating": "9", "text": "The Glass Castle is a novel based on true story written by Jeannette Walls. The book starts off when she's about three years old and follows her growing up. With her drunk but very loving father and her big dreams mother, Jeannette didn't get a perfect life style.  She had three other siblings, Lori, Brian, and Maureen. Jeannette was in the middle of the mix of the siblings. The novel starts off with Jeannette getting badly burned while she was cooking hot dogs for herself all at the age of three, now you can see that her parents were not much around to care for their children. She writes more about her life and growing up and all the adventures she had. Rex Walls was always losing his jobs and then not getting one that worked for the city. Rose Mary Walls went to college and has a teaching degree but doesn't teach unless they make her because her dreams are to become a famous artist painter.They moved states a lot, probably every couple years. She talks about everything that went on in their lives and how it impacted all of them in many ways. Towards the ending of the novel she talks about how Lori and her move to New York City away from their parents for a better lifestyle. All is well and Jeannette even meets a man and gets married. It ended and she gets a divorce and gets remarried, Jeanette’s fathers passes away from a heart attack. At the very end she invites her whole family over for Thanksgiving and raises a toast for her father."}, {"rating": "8", "text": "Based on a true story about a family on the run from the government, often hiding in small towns and living in poverty.The central character is Jeannette (Brie Larson), oldest of four siblings, but the story’s really about their brilliant but tormented father (Woody Harrelson) who’s the main reason the family can’t settle down and, even worse, the children often have to take care of themselves. Also starring, Naomi Watts as the artistic but equally careless mother.I am a bit surprised by the low scores the movie has received – 5.8 by Metacritic users and 56 by critics, 49% by Rotten Tomatoes critics.I felt that „The Glass Castle“ is a superb family drama, ensemble movie, and character study, not to mention one of the more enjoyable cinema experiences I’ve had recently, despite grim topics explored.The 127 minutes fly by, because you can’t help but be mesmerized by the tour de force performance Woody Harrelson has to offer.You could say he’s offering his usual but this can’t be a bad thing if the result is acting so powerful as Harrelson has been known for at least 10 years – mixing brutality with tenderness, good spirits and humor with sharpness and undeniably strong presence, thus being able to steal or own most scenes he appears in.The man’s been nominated for Oscar twice already (1996’s „The People vs. Larry Flint“ and 2009’s „The Messenger“) but this is the time he can’t be ignored anymore by the American Film Academy… can he?This sure feels like a greatest hits of what Harrelson has to give as a thespian, and he’s dedicated to bring out every nuance his intriguing character has to offer. If he’s not nominated the next year, there’s no justice in the world anymore!The cast is actually really good all around, bringing the wide-ranging family dynamics to screen in subtle but very moving and real way.Even Watts as a loyal wife is mentionworthy, in a role which often turns out too thin and decorative. Especially for her after having had enough such petty roles already.„The Good Castle“ is a great movie for memorable female roles altogether. Brie Larson reminds us once again why she’s one of the most interesting and able actresses of her generation. She always plays the second fiddle to Harrelson but she has an intriguing character as well, able to display both fragility and strength – an Oscar nom for her, too, perhaps?Also, Ella Anderson as the younger version of the oldest sister is very compelling, offering one of the most memorable child performances of recent times.Beside all the quality acting, „The Glass Castle“ comes across as interesting social commentary about how much and how exactly the parents should support their offspring to help them become resourceful and resilient members of future society.Sure, the Walls family can be a sobering reminder of how bad some kids have it, which also influences their future potential chances and successes. But in a way, their methods are also a refreshing antidote to excessive and needless pampering widespread today, which is dangerous in the long run, because the minions grow up to become useless burden with a lots of false sense of entitlement.All’s not great, though. The ending gets unnecessarily mushy and kills some of the charm the movie had before. It has garnered its fair share of criticisms. But it’s not a death blow to nullify all the effort that has gone into otherwise a very fine experience. I almost wish it was a longer story, I enjoyed it so much.Following 2013’s acclaimed indie drama „Short Term 12“, this is Larson’s second collaboration with the director Destin Daniel Cretton. She and Woody Harrelson also both starred in 2011’s mediocre thriller/drama „Rampart“.\"The Glass Castle\" may have turned out a very different movie with the original cast choices staying intact. Larson came to replace Jennifer Lawrence, Harrelson and Watts to replace Mark Ruffalo and Clare Danes.But in any case, it’s a grim and noteworthy drama, and a real actors’ movie, ready to showcase their talents whoever’s filling the roles. Resulting in one of my favorite movies of 2017 thus far."}, {"rating": "2", "text": "After the movie I was chatting with a women who, like me, had read the book. Her description was perfect, \"A Hallmark version of the book.\". The sugarcoating of the true story was obviously designed to set up the ridiculous \"deathbed redemption\" scene. Best example when Naomi Watts is telling Brie Larson her father is dying but her lipstick is perfect. We can't have our Hollywood beauties look too scruffy even when they are playing a homeless squatter."}, {"rating": "5", "text": "The Glass Castle had its few moments of shines and tears to wipe away, but under the hood is where the film relies a huge problem on. Can be forgettable during time beings if not claimed to love it nor hate it. but somewhere in the middle that gives that mixed opinion feeling. If you want to find a better way to watch this film, wait for it on rental."}, {"rating": "6", "text": "It's affecting, moving and well acted but for some reason it never feels connected, I think the melodrama clouds the truenorth of the film and while it wasn't a disappointment, it wasn't a success either."}, {"rating": "8", "text": "The book was hypnotizing and everybody I know who read it, couldn't put it down -- page by page it's like: incredulous laughter -- \"oh my GOD\" -- stunned silence -- \"wow!\"...Now, it's a very tall order to match this book but they've made a good effort in this film.  Woody Harrelson gives an Oscar-worthy performance as the toxic dad.  Details from the book are faithfully presented.  But this is a personal narrative story that just doesn't transpose strongly to the screen; it's the author's unique voice, and pacing, and style that gives the power to the book, and there's no way to duplicate that in film without actual voice-over.  Well worth watching though."}, {"rating": "7", "text": "The movie would have been perfect,  if it ended 15 minutes before. Why do they think a drama like this has to end happily?"}, {"rating": "7", "text": "This is a sad watch - upsetting in parts due to the fathers actions, his aggression brought on by drinking. There were, I felt, some unanswered questions but the performances are quite solid, particularly those of Brie Larson and Woody Harrelson and it certainly didn't feel like a badly made film. Its definitely a sobering watch, about the tough realities of a family struggling to get by both financially and as a family unit. Its a decent film, ultimately about the fragility of family life."}, {"rating": "7", "text": "La película tiene una trama muy sentimental y los actores son decentes; la recomiendo si te gustan los dramas basados en hechos reales."}, {"rating": "10", "text": "I really enjoyed this movie. Beautiful story (true) and excellent interpretation of all the cast! I highly recommend it"}, {"rating": "9", "text": "Many movies have a \"black-white\"/\"either white or black\" narrative thread, being very clear what is good, what is bad, what you should feel, etc...Unlike these movies, The Glass Castle manages to capture the true complexity of life, a continuous oscillation among its shades of gray, and in the end I didn't really know how to feel about the events that took place in the film.The movie tends to seem \"flat\", like a song whose chorus never comes, although it is not boring at all, and the ending is worth the wait.Woody Harrelson is the perfect actor for this role. He tends to play a similar character in several movies, a controversial character, hard to fit into current social norms, but a character that is neither bad nor good and therefore makes you like and dislike the character in the same time. It is a role that he plays and it suits him perfectly. (ex: The Drunk from The Hunger Games, The Controversial Husband from True Detective, etc.)I am not a big fan of Brie Larson, but she did a good job in this movie."}], "recommendations": ["me_before_you", "gifted", "blue_valentine", "lady_bird", "the_perks_of_being_a_wallflower", "the_florida_project", "the_descendants", "captain_fantastic", "collateral_beauty", "stand_by_me_doraemon_2", "belfast", "joy", "wonder", "the_intern", "the_age_of_adaline", "manchester_by_the_sea", "marriage_story", "lion", "legends_of_the_fall", "the_fault_in_our_stars", "the_big_sick", "call_me_by_your_name", "minari", "20th_century_women", "christopher_robin"]}