{
  "id": 353,
  "title": "The Hangover Part II",
  "starring": [
    "Bradley Cooper",
    "Ed Helms"
  ],
  "runtime": 102,
  "genre": [
    "Comedy"
  ],
  "description": "The Hangover crew heads to Thailand for Stu's wedding. After the disaster of a bachelor party in Las Vegas last year, Stu is playing it safe with a mellow pre-wedding brunch. However, nothing goes as planned and Bangkok is the perfect setting for another adventure with the rowdy group.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jrP9zmdSUpOzzUXpEqPqg3dryUr.jpg",
  "categories": {
    "plot": 2.0357142857142856,
    "acting": 2.6666666666666665,
    "ending": 3.8,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 5.523809523809524,
    "action": 3.3333333333333335
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The critics are right, this is the raunchiest movie ever created. It's also funny in every language and manages to mimic the original without being a clone. I love it, you will to."
    },
    {
      "rating": "0",
      "text": "This movie is deplorable. Do not believe anyone who says \"The problem with this movie is that it is the same as the first one.\" If that were the only thing wrong with it, I could forgive them for that. While the plots are very similar, the first movie was actually funny and displayed some elements of effective storytelling and character development. Part II has a handful of chuckles but nothing that will make you laugh. Also, this movie is Swiss cheese when it comes to plot holes. Any given movie can have a few logical transgressions and depict some unlikely events (like a chance encounter) but this film leaves too many events unexplained. One or two improbable events in a movie is okay because unlikely events do happen, but a movie quickly becomes unconvincing when you go beyond this. The Hangover Part II is a prime example of this. While the plot is terrible and it is not funny, the main reason this movie suffers is because the characters are so poorly developed. I can only describe them as \"flat\" even though the plot provided plenty of support for this. Despite its comedic nature, this movie does contain some very dark subject matters. The internal turmoil this should have elicited from these characters was glossed over with mere facial expressions and contortions of discomfort. Worse yet, the seriousness of these dark elements hindered the comedic slant they were aiming for. Although the first movie was not exceptional, I did derive much enjoyment from it. This movie is not funny enough to be considered a comedy, it is not outlandish enough to qualify as a farce, and the lackluster plot and characters prevent if from developing any dramatic or thematic elements. It is easily one of the worst movies I have seen. I am not normally compelled to write reviews for movies I hate or enjoy but this one is so bad I just had to vent my distaste. I am especially shocked to see that it scored a 44 from the professional critics making me think they need to go back to film school!"
    },
    {
      "rating": "4",
      "text": "It's clear this film was made simply to make a large heap of cash. If you enjoyed the first film, you shouldn't enjoy this one. Even the always great Zach Galifianakis can't save this mess."
    },
    {
      "rating": "3",
      "text": "If you want to see this movie, rewatch the first movie and then load up the trailer.  The movie only has a few extra laughs from Zach Galifianakis and Ed Helms, save your money."
    },
    {
      "rating": "3",
      "text": "I loved the first one.  This one was awful.  Bradley Cooper was smokin' hot but it didn't save this one.  The entire audience walked out with a puzzled look on their face.\r Wait for DVD"
    },
    {
      "rating": "6",
      "text": "Much has been said about the fact that they reused almost the exact same formula for the plot on this second go-around. The truth is, for this second installment of the Wolf Pack franchise, the formula works-it's the jokes that don't hold the film together. The film begins like a comfortable pair of shoes. The film looks great, the characters are still interesting, but soon you find that this pair of shoes has some holes in it. One would imagine that finding jokes in such a foreign land for the Wolf Pack  would have been easier, but the filmmakers went for shock value rather than actual belly laughs this time. The memory sequence with Allen was actually one of the more clever moments in the film because the comedy came from what we already know about the character, not by showing us human body parts in different combination.  I did not have a terrible time with Hangover 2, I just expected more from a trip half way around the world."
    },
    {
      "rating": "4",
      "text": "I really looked forward to seeing this film, reason being that I loved the first film, but this film was darker and it was not up to standard. I guess I was forced to laugh at some parts of the film, it could of been a lot better. First of all the introduction was so boring, that I questioned myself if I didn't see the first film, I would be out of there within the first twenty minutes.Some of these Jokes, you have to wonder where they even funny or where they that shocking you wonder whether to laugh or not. The humor was nowhere near as good. I guess this is one of those failed sequels and to be honest I am not expecting a lot from the third one."
    },
    {
      "rating": "7",
      "text": "I don't care if it followed the same structure as the first one, I still think it was great.  Really funny and over the top.  Sure, the first one was better, but I got a lot of laughs from it."
    },
    {
      "rating": "4",
      "text": "So a sequel to a great movie. This can't be good. Yes indeed. This movie was horrible. I couldn't enjoy watching it at all. I paid 10 bucks to watch the same movie, with a new setting. Don't get me wrong the movie had some funny parts, but it wasn't nearly as amazing as the first one. The biggest problem with the sequel, is it's structured the same as the first. Which is very annoying to watch. You feel just scammed. it's so not worth paying 10 bucks to see the same movie with a different setting, a new person getting married, with less funny jokes. Todd Phillips messed up."
    },
    {
      "rating": "3",
      "text": "The first one was verrrryyyyyyy good and absolutely hilarious, but when I watched this one I felt like I was watching the first again. The same jokes, the same plot, the same story. It was almost annoying. I laughed maybe once or twice in this movie. This is the perfect example of a movie that should've been left alone at the first. The only reason why they made another was because of the money they made off of the first and are now making a fortune off of the second, and I've heard rumors that their beginning a third. They shouldve never ruined the first with a sequel. This sequel was exactly the same as the first, just a different area and a different person gets lost. 3/10 for me."
    },
    {
      "rating": "1",
      "text": "Same same but different......the action relocates to Thailand while following much the same premise as the first installment.  Unfortunately the move strains the plausibility of the story line, the Vegas episode was believable this is rather insincere.  I liked the characters in the first movie as they unfolded, here due to familiarity they now are simply boorish and not nearly as likeable.  The only saving grace is that this only points up how good the first film was."
    },
    {
      "rating": "6",
      "text": "Maybe its because I'm biased about The Hangover franchise, in a positive way, because the original is one of my favorite movies of all time, but the new addition to the series shouldn't be getting a grade in the 40's. Yes, it is a much crueler and darker film than the original and everything feels the same, but \"The Hangover: Part II\" is better than the dumb, crap comedies that Hollywood produces on a daily basis. Newcomer, Mason Lee who plays Teddy, Stew's new fiance's younger brother, gives a flat, half-assed performance. And at points, I didn't even want \"the Wolf pack\" to find him when he went missing. I was sort of happy he was gone from the whole crowd. Also in this new addition, Alan seems more or less mentally handicapped in this film and after the first few of his jokes, you just start to feel bad for him, the humor is very dark and vulgar and there is no sign of heart or just any sign of human compassion in Part II. I'm not saying Part II is a bad movie, but none the less, I'm not saying its a great one. There aren't many quotable lines while the original was probably the most quotable movie of this generation, and the movie isn't very memorable. But, on the other hand, for the time being, it is consistently funny and while it is a little disappointing, it's a fine prequel to the last of the series, Part III, which hopefully starts Pre-Production in the next few months. By any means though, Part II doesn't deserve all of this critical bash it's receiving but it will please the fans for the time being.All in all, Part II is a meaner, cruder and much more vulgar remake of the original that is fairly funny and we'll entertain anyone in the theater, it'll just be that and will hold fans' attention spans long enough until the final part of the franchised is being released."
    },
    {
      "rating": "5",
      "text": "The movie is 90% \"Hangover\" and 10% Ken Jeong. \"The Hangover Part 2\" is a decent comedy that will rattle you up for several minutes, but **** plz! The movie is what you already saw in 2009."
    },
    {
      "rating": "3",
      "text": "While the Hangover Part II is essentially a carbon copy of the original, it has it's moments but unfortunately those moments are quite short lived. This version lacked the outrageous humour of its predecessor and sadly most of the best moments are seen in the film's trailer."
    },
    {
      "rating": "2",
      "text": "This movie is simply terrible.  Worst of all, it's not even very funny.  I laughed more during the 30-second preview for Bad Teacher than during the entire 1 hour and 42 minutes of the film itself.  By the end I was actually embarrassed for the lead actors, many of whom I like quite a bit."
    },
    {
      "rating": "2",
      "text": "This movie is EXACTLY the same as the first one, but not as good. It tried too hard to be EXACTLY the same. It felt like they looked at the script from the first one, hit CTRL F, and thought, \"in the first movie someone looses a tooth, what body part should someone loose this movie?\" and just changed tooth to finger, and repeated that throughout the script. It also felt to me like Lee's character could have better been explained. Even though I don't really like Lee, they could have focused the movie more on him and his business and made the movie not be EXACTLY like the first one. Some of the jokes were hilarious but that is the only plus to this movie, a couple of good jokes, definitely not worth 11 bucks in theaters. Also, the way they found Teddy could have been better. I liked in the first one when they woke up with the hangover they saw the tiger, found the baby, the ring was missing,  Doug was missing, and the mattress was missing, and they spent the movie figuring that out all of those things and they saved the mattress for last and that is how they found Doug. This movie finding Teddy in the elevator was pretty dumb."
    },
    {
      "rating": "3",
      "text": "A lesson lived is a lesson learned, but not when it comes to The Hangover: Part II. The film is both written and directed by Todd Phillips and stars Bradley Cooper, Zach Galifianakis, and Ed Helms. Both cast and crew attempt to recreate the momentum of 2009â"
    },
    {
      "rating": "9",
      "text": "The original was AMAZING!!!! But the problem with this one is that it just feels like it's the same. The movie itself is very funny & I do like it, but it lacks originality which is why you have to deduct a few points. Otherwise this would have been a ten."
    },
    {
      "rating": "5",
      "text": "Sadly, this movie just seems as if it's trying to hard to cash in on the success of the first, rather than try to top it. This is one of those films that \"had those couple of good, funny scenes.\" Unfortunately, close to all of those scenes involved a penis.I managed to watch it's predecessor 4 times in theatres, as opposed to the one time I'm ever going to see this. Maybe I'll watch it again, but not anytime soon.If you were a fan of the first one, I would recommend seeing it, just for the sake of seeing it, but I wouldn't go in with very high expectations."
    },
    {
      "rating": "2",
      "text": "Did Alan do a very bad thing? Something even worse than burying a dead prostitute in the desert? In the 1997 Peter Berg film, it's \"Heaven or Las Vegas\" indeed, when a bachelor party goes horribly awry with one irrevocable maneuver by a coked-up reveler that leads to a sexually-engaged woman being impaled against the lavatory wall. Zonked out on blow, Michael unknowingly practices necrophilia for a couple of seconds before realizing that they're finished, but it's the wrong fluid coming out of the wrong body, an unhappy ending to a hotel room bacchanal which leaves him flaccid and panic-stricken. Not surprisingly, things go from bad to worse, once it's agreed upon by this assemblage of damned men to cover up the crime, because soon enough, their foolhardy conspiracy snowballs with lightning speed when a hotel security guard discovers the lifeless stripper on the bathroom floor, forcing Robert to commit premeditated murder. The tragi-comedy of errors lead the Kafkaesque suburbanites to a plot of arid land just outside the \"Sin City\" limits, where like mafiosos, they hollow out a trench for the bodies, their respective anatomies all intermixed, much to the disgruntlement of Adam, who believes that the commingled dead is an affront to his faith. The film itself, however, doesn't share the Judaic worshipper's earnestness. The corrected sacrilege is replaced with a sacrilege of its own, since the whole scene plays out with a tone of disaffected irreverence toward the dead that recalls both \"Pulp Fiction\" and \"Kill Bill: Vol. 1\". The black security guard corresponds to the black captive whom Vincent accidentally shoots(prompting the infamous \"dead n***** storage\" line), and the Asian hooker corresponds to Gogo Yubari, whose eyes leak blood after \"The Bride\" hits her on the side of the head with some exposed nails from a wood board. \"Very Bad Things\" shares with Tarantino his predilection for brutal comedic situations. The desert scene is supposed to be \"funny\" because the two victims' disparate skin colors makes the sorting of body parts easier for the conspirators. But unlike Tarantino, the filmmaker can't get away with murder, so what becomes foregrounded is the queasy fact that white people are dispassionately killing minorities. In \"The Hangover\", the moviegoer first meets Mr. Chow literally springing into action from the opening of a car trunk. Because the gangster is on the offensive, thoroughly beating his kidnappers into submission, while nude, mind you, what goes unnoticed by the moviegoer is the possibility that Alan(who in \"The Hangover Part II\", purposely drugs Teddy) tried to suffocate Chow after fleecing him of his eighty grand. And then there's \"black Doug\", the wrong Doug at the ransom drop-off, an innocent man whom Phil would willingly return into Chow's custody for the money. Black Doug could die. These seemingly nice guys, on closer inspection, are no better than Robert and his minions. The perception that \"The Hangover\" resembles \"Very Bad Things\" only on a superficial level is inaccurate. The broad humor obscures their diabolical natures. \"I don't care if we kill somebody,\" goes one of Alan's patented non-sequiturs from a rooftop where this \"f****** psycho(called so after Phil learns about the marshmallows, meant solely for Teddy, in \"Part II\") spikes the Jagermeister with rohypnol. If Phil only knew the whole story. Bold for a popular comedy, Alan seems to be a registered sex offender. Back home, Alan tells his future brother-in-law that he shouldn't \"be within two-hundred feet of a school, or a Chuck E. Cheese.\" Since no follow-up question is forthcoming from Doug, he must be privy to his future brother-in-law's checkered past, and keeps it a secret from Phil and Stu, and more importantly, the audience, who would be repulsed by a well-delineated account. With Doug missing, Alan simulates masturbation on a baby. To Phil, it's just a harmless sight gag. Phil doesn't know that he's witnessing a relapse. Unfortunately, nobody thinks twice about \"Carlos\" being strapped to Alan's chest. At the police station, following their arrest for stealing a cop car, exactly what are the cops staring at which would prompt them to stage a stun gun presentation for children? Alan's rap sheet, perhaps? Quite pointedly, a child tasers Alan in the face. Thailand, of all places, a pedophile's wet dream, is the setting for \"The Hangover Part II\". Interestingly, there's a fantasy sequence where Alan and his friends are boys again, riding around Bangkok in a car. Could this be a veiled reference to \"Little Children\"? Whereas Ronnie is put through the ringer by his neighbors before he earns redemption, Alan's crimes are implicitly pardoned from the get-go, on account of his pronounced naivety. At Caesar's Palace, Alan asks the female concierge if the famed Roman general once lived here. Does he admire Julius Caesar? A child sex proponent?"
    },
    {
      "rating": "3",
      "text": "Easily one of the worst sequels ever made.  The Hangover Part II merely rehashes the entire plot of the first film but with far fewer laughs and surprises.  Shame on Paul Giamatti for having anything to do with this stinker."
    },
    {
      "rating": "0",
      "text": "Just a complete waste of time....my bad for thinking it may be decent....I left 20 minutes in.. I should never have bought a ticket to this unfuuny, predictable, boring, movie that had no surprises at all."
    },
    {
      "rating": "0",
      "text": "first film was good but there is nothing new and different when you compare with first film. The same jokes, the same plot, the same story. It was almost annoying. Lazy, unpleasant, witless but most of all just boring"
    },
    {
      "rating": "3",
      "text": "I'm sure everyone can agree that The Hangover was amazing, it's too bad that they remade it just a few years later.  If you have seen the first one, you have seen the second one.  While I was watching the movie, I tried to keep an open mind, and tried not to judge it based on the first one... but it's hard to do that when it is the same movie in a different town.  I can't stress this enough, this movie goes beyond having just the same structure, it is literally, THE SAME MOVIE just in a different town.  The movie is darker, less funny, and more ridiculous that the first, and I mean ridiculous in a bad way.  Remember the lovable odd ball Alen?  Well now... he's criminally insane and should be put in a straight jacket.  There were times in the movie where I just could not buy into his stupidity because there was no way this man is not in a straight jacket... and don't get me wrong, I loved his character in the first one, but a character like that rides on the line of lovable and ridiculous, and in this remake, his character goes way beyond that line.  In this title, Bradley Cooper is yet again the \"voice of reason\" in an insane wolfpack, but his character is so neutral, he becomes irrelevant.  And Ed Helms character is exactly the same except his dialogue is given a touch of corny and cheesy.  It would have been nice for the writers to incorporate Doug into the story, but in a remake, that would break the rules right??  Not comparing this title at all to its predecessor, it still is flat, I only laughed out loud once and chuckled maybe twice.  The raunchy no-holds-bar feeling of the first is absent and in its place is gritty crime which seems \"out of place.\"  The Good:  the cast (although overblown), have good chemistry. The Bad:  No originality, barely laughable, and simply unbelievable.  The main problem of the movie is that it is too unbelievable that the same scenario could happen to the same people twice."
    },
    {
      "rating": "3",
      "text": "Missing the originality and fun of the first film, with many jokes seemingly rehashed without any success. Few, if any genuinely funny moments, many unrealistic moments that stretch too far away from the charming unrealistic nature of Part 1, and just a dull, poorly replicated experience overall. Do yourself a favor, and just watch the first one again..."
    },
    {
      "rating": "10",
      "text": "Don't even read what those idiotic critics have to say. I hate movie critics. How come they ever criticize a Hangover sequel? I know the jokes a re a little bit just the same as the first, but I think they changed it to a brand new look and if you haven't seen The Hangover Part II, Go rent it or buy it or save it in your wishlist! This is the best Hangover movie since the first and can't wait for the sequel in 2013."
    },
    {
      "rating": "3",
      "text": "People are pretty gullible when they say they love this movie. Throw in a few funny jokes and extreme scenarios into the first movie's script and that's it. It's pretty much all just for they money, other than that I see point for this movie being made. Not to mention I predicted the plot twist about 20 minutes into the movie."
    },
    {
      "rating": "0",
      "text": "Just like the first one. Only thing they changed was it's in Thailand, it's a monkey instead of a baby, and it has 2 in the title. It has the same lame jokes and just about everything in this movie is predictable."
    },
    {
      "rating": "6",
      "text": "The best part of the first movie is also the best part of the second film:  the photo reveal during the credits.  Absolutely hilarious. I jumped out of my seat a couple of times to the chagrin of my crime partners. The rest of the movie is good, just not nearly as new and fresh as the original - which is to be expected. It's not the Empire Strikes Back of comedies.  It also doesn't have as many plumb supporting roles as the first.  The lack of Mel Gibson in the tattoo artist scene leaves a gaping hole where some laughs should have been. And the cameo toward the end (no spoilers) was almost painfully unfunny.  What salvages the movie is seeing more of the Wolfpack and Chow. On another note, how does this girl from the Real World San Diego keep getting roles?  First Sucker Punch and now this?  She doesn't seem to bring much to the table. But hey, to her credit, she's one of two actresses to emerge from that show with any semblance of a film career."
    },
    {
      "rating": "9",
      "text": "THE MOVIE WAS GREAT i really like it, one of my friends asked me yesterday if they have to watch the first one before seeing tis one. i dont think its neccc , i mean the idea is the same , but i guess it has to be well its a sequal. i liked it and i laughed a lot   which is what i paid for."
    },
    {
      "rating": "4",
      "text": "This movie had it's funny moments, but all in all, this movie's main flaw was it's unoriginality. It was basically exactly like the first movie, just in a different city."
    },
    {
      "rating": "5",
      "text": "It seems like Horrible Bosses has taken over to look something forward to as a sequel. This movie lost its luster on this part II. Hangover 1 was just amazing. There was a lot of stupid sexuality that just wasn't funny. Using the monkey for jokes just does not work unless your audience is younger (which it clearly can't be with all the other sexual stuff in this movie)."
    },
    {
      "rating": "7",
      "text": "I laughed a lot at this movie.  Yes, the premise is the same as the first one, but the gags were different and I was entertained the whole way.  If I were seeing this film without seeing the first one I would rate it a little higher, but because the characters aren't new and fresh anymore it isn't as good as the first one.  There were a couple of hilarious scenes, a lot of mildly amusing scenes, and it has a monkey.  Who smokes.  I never expect sequels to be as good as the originals so maybe I went into it with lower expectations than other people, but I thought it was a success.  Did I mention it has a monkey?  :)"
    },
    {
      "rating": "10",
      "text": "Don't listen to critics, they're just always depressed. Even though this movies followed the same path as the first one, THAT WAS THE POINT of this movies!!!!!! This movies is far funnier than the first one. Easily."
    },
    {
      "rating": "5",
      "text": "As you might've guessed, this movie is essentially the same as the original. Different city, different wedding, same scenario...but what else could you do with a sequel like this? Much of the humor is unoriginal and borrowed from part I. It just felt stale throughout. Sure there are some funny moments, but part II fails to differentiate itself enough from its predecessor to warrant the price of admission. Part III is already on the way... whose wedding could it be this time?"
    },
    {
      "rating": "8",
      "text": "Seems like they took 90 percent of the script from the first movie, added a car chase and replaced the baby with a monkey and a hotel roof for a hotel elevator. That being sai,d I went to see this movie to smile and laugh, as most people do when they go to see a comedy and I did both.Yes it was virtually the same film in a different location but it was STILL very funny."
    },
    {
      "rating": "9",
      "text": "Hangover Part II. what a great film, yet another fantastic storyline. People doubted whether or not it could top the previous film, and if the sequel would ruin the originality of the previous film... they thought  wrong. Part II is still the same idea, they all go out loose there memory etc etc, but Part II offers so much more comedy and thrill, there is more at stake this time, more too loose. It was great to see the \"wolf pack\" back together but unfortunately Doug was not in the whole drama again, he went home early, it would have been nice to see him get more involved in the film. This time they do not live the high life glamor like they did in Vegas, they were in Bangkok, there seemed to be a much darker and depressing tone in the movie, they wake up in the grotty, dirty hotel were all the power goes off, they find themselves in the slums of bangkok. the film gets much more graphic, near the beginning and throughout there are strong drug uses and strong sexual actions and nudity. I would say that this film is really a teenage humor, for 15 to 28 maybe but adults will enjoy just as muchTo sum up this film i would say it is a fantastic must see, its got to be comedy film of the year, its going to win loads of Oscars and just a general fun and fantastic film to watch. A must see film.  i give it **** stars(please comment and rate my review :) )"
    },
    {
      "rating": "8",
      "text": "It's a good film, but sometimes the jokes seem a bit overdone. Even if the film follows the same concept, I really had to laugh often in this movie. Why should you change something which worked perfectly in the past? Also they at least tried to make the film a bit more unexpected.It's a good movie, but don't watch it if you hate the fact that the concept was taken from the first Hangover."
    },
    {
      "rating": "8",
      "text": "So what if it follows the same formula as the first? So what if the humor is super crude? What did you honestly expect? Once again, this wonderful cast comes together for another crazy night out, and the result is another film that made me laugh, and made me laugh hard. While it just isn't as quite as good as the first, I still thoroughly enjoyed this film, with \"Alan\" stealing the show again with his every line."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this, even more then the first. I would say both movies have about the same amount of good laughs, but unlike 1, part 2 is has so much more adventure going for it. Good laughs in a more interesting city is good to me."
    },
    {
      "rating": "9",
      "text": "Not quite on par with the first one, but still very funny and well worth seeing.  Great to see the \"wolf pack\" back together again for another adventure."
    },
    {
      "rating": "10",
      "text": "A classic example of a good comedy sequel. Truly fantastic. I saw this to make me laugh and make me laugh it did. Just take the film as it is - a comedy sequel. You'll love it."
    },
    {
      "rating": "10",
      "text": "I don't get all the negativity. It's a buddy comedy, what did you expect? This isn't some pretentious arthouse film, guys. It made me and my friends laugh loudly the entire way through, and that's all that matters. One of the main complaints I'm hearing is that it was basically the same as the first movie except in a different location. OK, let's analyze this: it's called THE HANGOVER PART II. Meaning, an extension of the first movie. They weren't going to make any radical changes, and they didn't have to. They met my expectations, and it was 10 dollars well spent."
    },
    {
      "rating": "9",
      "text": "Overall I thought the movie was funny. I know that I laughed just as much or even more during this movie as I did the first Hangover. The concept was the same which brought the movie down a little bit, however, this was a comedy and it brought the laughs I was looking for."
    },
    {
      "rating": "8",
      "text": "I know I'm in the minority here.  But I enjoyed it.  I didn't think it was a good as the original but that's no surprise.  But I did not think it was awful.  It's way more unbelievable than the original.  Let's face it, if any of that stuff happened in real life while in Bangkok you would be freaked beyond functioning.  And understandably so.  And a few reactions to events were truly unbelievable. But when it was funny, it was very funny.  I laughed a lot.  I really enjoyed Bradley Cooper.  Especially his freaking out about the bachelor party.  Great moment.  And some really great one-liners throughout.  Some very funny sight gags with touching things.  Some gross stuff.  And Coopers reaction to the tattoo was priceless.What I could have done without...It being Zach's fault again.  The espionage angle.  And as much as I like Chang or whatever his name is, I felt bringing him back was contrived.  And I don't think I know anybody who would shrug off losing a finger.  At least not without some morphine.  I truly believe this movie will be enjoyed with repeat viewings."
    },
    {
      "rating": "7",
      "text": "A second part of a movie is expected to be more spectacular than the first. In this case, \"The Hangover Part 2\" is more or less the same as the first. This movie alone is very funny, adventurous and has an interesting plot. Compared to the original, it is very predictable, so there aren't as many surprises, but it definitely wins over many other films out. In my opinion it is a great film and a laughable experience."
    },
    {
      "rating": "7",
      "text": "This has to be a two-pronged critique to work.  If you have seen the first one, then this one will feel like a fun rehash of it.  The problem is that some of those excellent quips and one-liners that made the first one magical just don't seem to be there.  If you haven't seen the first one, this is a riotous and ridiculous journey about a group of ragtag friends who are (yet again) trying to survive another pre-wedding night out, only to find out that it has spun (hilariously) out of control.  Great jokes, funny action sequences, and more awkward moments than the last time you had to hang out with an ex you didn't want to be around."
    },
    {
      "rating": "0",
      "text": "I know I'm late to the party here, but redbox threw me a couple free rentals and everybody makes mistakes, okay? Good god, what was this? I know the first flick is propped up because it was the only thing in a barren wasteland of comedy movies, but was it good enough to be done TWICE? With less jokes? Folks, I promise you, Zach Galifanakis is actually pretty funny. Please don't blame the man; blame the material. And what is up with this Bradley Cooper guy? He's absolutely WORTHLESS. Running around acting like a complete jerk does not a compelling (let alone likeable) character make. All people want from these movies is fatty and glasses; why do they even bother with the other two milquetoasts?"
    },
    {
      "rating": "5",
      "text": "hangover part 1 was really funny, this one made me fall asleep. it was exactly the same as the first, but with less funny jokes. apparently they are making a hangover 3, thats gonna fail."
    },
    {
      "rating": "2",
      "text": "Absolutely horrendous. The only reason I didn't leave halfway through is because I was with two girls and didn't want to look like a dick, and didn't want to do the characters a disservice - because I truly loved the original. I came in with no expectations - the critics said it was bad but people I know seemed to love it. In fact, everyone in the cinema was roaring with laughter. I wasn't."
    }
  ]
}