{
  "id": 2333,
  "title": "The Rover",
  "starring": [
    "Guy Pearce",
    "Robert Pattinson"
  ],
  "runtime": 103,
  "genre": [
    "Crime",
    "Drama"
  ],
  "description": "10 years after a global economic collapse, a hardened loner pursues the men who stole his car through the lawless wasteland of the Australian outback, aided by the brother of one of the thieves.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/734OOkr69mt8lyPk8iw3TwgQ90R.jpg",
  "categories": {
    "plot": 7.066666666666666,
    "acting": 7.760869565217392,
    "ending": 5.5,
    "soundtrack": 7.0,
    "cinematography": 7.714285714285714,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "If you were to take all the scenes of delayed importance and poor attempts of tension out this movie it would go for about 20 minutes. I can quite honestly say this is the most boring movie I have ever watched, it suffers from a severe lack of content and is instead replaced by the most frustrating style of dialogue I have ever had to sit through. A one line sentence from the main character literally becomes a 5-10 minute scene where nothing of any importance or significance to the story eventuates, in between these mundane set pieces of characters staring at each other aimlessly over the top of ear crunching music which is a mix between the action scenes from full metal jacket and a rusty tin shed being trampled my a heard of pissed off cows there are moments of violence, random people get shot etc....Rinse and repeat this method a few times and you come to the end of the movie where once again you are left shaking your head and saying to yourself...........Is that it?\rGo watch mad max, nothing to see here."
    },
    {
      "rating": "3",
      "text": "suffers from too low a budget.  The movie tries to remain interesting with Guy Pierce's good acting, parading a cast of circus characters, bizarro back drop, and depressing tone.  The writing, characters, and dialog is just not where it needs to be.  Too many inconsistencies in them to be convincing, or worth a watch.  Comparing this to similar \"the road\", a similarly depressing but unlike Rover, Road's plot more carefully ironed out, it's world better crafted with a larger budget.  Worth a fast forward if you liked the Road."
    },
    {
      "rating": "10",
      "text": "Without the performance of the actors breathing incredible genius into the main characters, this movie could have easily not delivered.  This as I found myself pondering long after, how could so much be conveyed and witnessed in the expressions and stillness of these characters with such sparing use of dialogue?  Genius, that's how!  Casting was critical!  It was mastery in the artists that came together to breath life into a story that unfolds a potential for humanity if we continue on this path of separation. The reality of it grips you.  You see what humanity becomes under desolate conditions.  It needs to be seen and felt by humanity.\r Having watched David Michod's first masterpiece, Animal Kingdom, he absolutely succeeded in delivering yet another 'masterpiece' of incredible artistry; from a story that was intense, and kept you riveted, to the incredible and stark, blunt, cinematography, and outstanding creative and captivating performances from lead actors Guy Pearce and Robert Pattinson.  Michod's unique artistic style and brilliance is definitely evident in both of his movies.\r These two actors, with very little dialogue and much silence, so masterfully performed, conveyed depth of character that secured an emotional connection for each.  Guy Pearce showcased the rawness of his character, Eric, who he portrays as hardened and desensitized by his past journey, while Robert Pattinson showcased Rey as the child-like innocence, hope and purity that survived the collapse of society and civilized order -- after some sort of man made apocalypse, which many believe is humanity's biggest future enemy.  Pattinson delivered a thoroughly convincing performance for a character with Rey's challenges, a role that could have easily gone so wrong if overplayed as so many have done in similar roles.  He was brilliant, as was Pearce.  Their creative interpretation of these characters is artistry in itself.  A brilliant piece of work that needs to be seen!\r The audience was 60% Male and 40% female.  After the movie was over, I remained in my seat, as did others, as I felt torn and pondered it's totality.  It was worth the 1-1/2 hour drive to get there.  I'll be seeing it many more times.  It needs to be soaked in."
    },
    {
      "rating": "10",
      "text": "I was mesmerized from the first shot to the last. Stunning performances by Pearce and Pattinson. Intense, shocking, heartbreaking, rewarding. See it while you can."
    },
    {
      "rating": "8",
      "text": "This is a deliberate, stark, and bleak movie, but wow did I find it fascinating.  It has the simplest of plots -- a man wants to get his car back from the thieves that stole it, and uses the injured brother of one of the thieves to take him to their destination -- but the characters hooked me and took me along for the ride.\r Strongly acted by both Guy Pearce, who is always strong, and a surprisingly touching and vulnerable Robert Pattinson as the dim-witted southern hick Rey, this film is one of those that stayed with me for days after I saw it.\r Michod proves he's an excellent talent.  This film may appear like an action-filled violent road journey, but instead Michod has crafted a beautiful character piece."
    },
    {
      "rating": "10",
      "text": "This movie impressed and shocked me equally in a positive way. Humanity and empathy seem to have been evaporated from the near future Australia that's been shown to us (scarily in not so unrealistic way) but the story of  both lead roles Eric and Rey into which the viewer is just thrown in without knowing anything about them develops into something hopeful throughout the movie. All is not lost! Shocking, violent and intense and even though Eric is all of this, the simple-minded Rey finds a connection to him.The movie stayed very much with me and leaves the viewer behind having to think for himself about what the world and the people in it turned into. Superb performances from both Guy Pearce and Robert Pattinson!! I can only recommend it very much, scenery and music play a part of their own into this beautifully shot precious piece of filmmaking! Thank you David Michod!"
    },
    {
      "rating": "10",
      "text": "I was a little scared about seeing this movie since I am not a fan of gore and gratuitous violence, but I was convinced to see it. So glad I went. If you want a feel good movie, this is probably not it. But if you appreciate the art of movies you have to see it. Slow paced but never boring it showcases performances by Guy Pearce and Robert Pattinson that are award worthy. More than that though I makes you think and feel. Days later I can't get it out of my head. More people should take a chance on something different. They might like it."
    },
    {
      "rating": "10",
      "text": "This is a well-made, thought-filled, and interesting movie.  It made me think, really ponder the ideas presented.   Very good cinematography, score, and presentation.  The actors dd an excellent job.  I was able to relate to the characters, my eyes were moist as the film ended.  Cinematography did a fine job presenting the desert landscape giving a very real atmosphere to this story--I could almost feel the scorching heat, the flies and bugs buzzing about, the dry arid sand...Violent, yes, but that is part of the story.  I highly recommend."
    },
    {
      "rating": "9",
      "text": "Wow! I loved it!  The story of two men with nothing else to loose , who form a tenuous relationship that I believe leaves a lasting impression on Eric. A story with a lot of nuances! Sparce on dialogue, but it is truly not needed the scenery and the facial expressions do the talking. You have to use your brain while watching it and it will stay with you and keep you thinking about it, even in your sleep. More than viewing will be needed. There are lighter moments, especially in Rey's story telling. Rey is not as half witted as everyone thinks he his. The dinner scene proves that and the break out scene solidifies it. He just processes things a little slower than those around him. He also has way of working himself into your heart and I think Eric would attest to.\rRobert Pattinson was excellent and shows the industry and critics what his fans have known all this time, He has a true talent for his chosen profession. If you do not follow Mr. Pattinson's career you would not recognize him! He absolutely disappears into the role. His accent never wavered. Guy truly looks like a crazy bad ass son of **** He scared me! Definitely worth the watch! I give it a 9 not only for the story but for the performance of both Robert Pattinson and Guy Pierce."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have seen in a long time. Guy Pearce and Robert Pattinson were excellent. They are both able to say so much without saying a word. They let their facial expressions and body language say it for them. If you're looking for a rom-com this is not for you. David Michod has made a very grim and realistic film about what could be coming in the future. This is film making at it's best. I am really looking forward to seeing what comes next for writer-director Michod and actors Pearce and Pattinson."
    },
    {
      "rating": "0",
      "text": "Interesting parts but the main character is just flat and boring. Patchy logic, broken motivations and inconsistent tone make what could have been great kind feel boring and pointless."
    },
    {
      "rating": "10",
      "text": "The Rover is the perfect, but not necessarily expected, follow-up to David Michôd's Animal Kingdom. Those going into this film expecting a copy of Mad Max may be disappointed, but those viewers that want an engrossing character study including wonderful performances, amazing cinematography and a fantastic score are in for a treat. No spoon-feeding here, just plenty to draw from and to think about for yourself. It stays with you long after."
    },
    {
      "rating": "9",
      "text": "I really, really enjoyed this movie. It was very slow burn, but very intense and emotional. Guy Pearce and Robert Pattinson were absolutely spectacular. This might be my favorite of the year so far."
    },
    {
      "rating": "10",
      "text": "This film is such an important one.. and I feel that Michod has modernized and reinvented the Western. Set after a feasible economic/global collapse it essentially shows us that humanity is not lost, even when the world seems to be. The two leads are incredible and leave you on the edge of your seat, and in the end, you realize that Rey truly effected Eric, and vice versa. This movie and its plot are not spoon fed to you like many others, hence the negative reviews... but if you can think for yourself and let go of the preconceived notion that you need a film to be dumbed down in order to enjoy it, you will appreciate the ride it takes you on. This is just a beautiful story about two men who were on the edge, the bond they formed, and the humanity found through that bond."
    },
    {
      "rating": "10",
      "text": "Intense but mesmerizing, bleak yet beautiful. In a future with little hope, some still finds a way to shine through in the most unlikely pair of Eric and Rey. Guy Pearce and Robert Pattinson both give outstanding performances in the film. They express so much with very little dialogue, and they are completely captivating in doing so. If that's not enough, the cinematography is amazing, the scenery of the Outback breathtaking and the soundtrack is just perfect. This is definitely a film that will stick with you for days."
    },
    {
      "rating": "10",
      "text": "David Michod is a gifted auteur whose second film, The Rover, is a sublime masterpiece. Pearce and Pattinson deliver beautifully nuanced performances."
    },
    {
      "rating": "10",
      "text": "The cinematography in The Rover is almost the third character in this film.  It captivates you with the bleak vastness of the landscape, and sets the tone for the movie.  But the movie itself is not bleak.  You become invested in Rey & Eric and can't help but be drawn into the dynamic of their relationship. The performances are remarkable, superb, award winning in my opinion.  The score is so interesting and unusual, perfect!  I believe I've become a Michod devotee & look forward to seeing his future projects."
    },
    {
      "rating": "6",
      "text": "Exciting movie.Well performance by Pattinson and Pearce. Story could be deeper, its like the small brother of the movie \"the road\". Music is sometimes out of place."
    },
    {
      "rating": "7",
      "text": "I only have one complaint about this movie.  I wish the filmmaker had gone into some detail about the economic and societal collapse. I could very easily see this scenario playing out in today's world."
    },
    {
      "rating": "10",
      "text": "Outstanding performances. Against the rushed storylines, over bloated budgeted blockbuster... The Rover is a standout. Stands on it's own. Sit back or sit up on the edge of your seat and enjoy the ride."
    },
    {
      "rating": "10",
      "text": "O filme foi muito bem produzido,o elenco está perfeito! Algo que se admira é como o filme toma um rumo do começo ao fim! Sinceramente um dos melhores filmes do ano"
    },
    {
      "rating": "0",
      "text": "A really sad missed opportunity. Brings nothing new to the genre. Buckles under its own sense of self importance. Basically dares the viewer to like it. Really disappointing movie going experience."
    },
    {
      "rating": "7",
      "text": "I can guess the director must have played a lot of Grand Theft Auto games. The Rover is mercilessly violence almost to the point of desensitization, and it's downright amazing. This is far from usual action flick, presented in exclusively barren setting, it bides its time and delivers every blows unapologetically. The two leads perform splendidly, conveying rugged emotions with either less than subtle words or crude gestures.\r Eric (Guy Pearce) has the displeasure of having his car stolen. Fueled by willpower he chases the group of robbers who stole the beloved car. On his lone crusade he serendipitously meets with one of the members who got shot, Rey (Robert Pattinson), a slightly mentally challenged young man. These two have the most awkward yet surprisingly fascinating chemistry.\r Guy Pearce is stone cold, barely communicating his intents and when he does, he utters it in such unpleasant way. Meanwhile Robert Pattinson is a timid yet volatile man, who by his nature is pretty impressionable. If there's any criticism for his acting after certain vampire series, he more than makes up for it. Their relationship is very bizarre, united only by a common goal. It's more appropriate that they tolerate each other, but after a while this symbiosis gradually affects both of them.\r Visual is a heavy reminder of Mad Max, done in outback where only sun shines and not much else. Brutal gore litters the movie, I've seen many use of violence in a movie, but this one certainly should be watched with tact. Soundtracks are also impressive, the songs are highly unexpected yet they work marvelously for the theme.\r Somehow the uncompromising nature does hamper the film, the logic and also logistic are a bit implausible. It'd be better if it had more narrative or back story of the place or characters since people are so unsympathetic towards each other, it's a miracle that the outback is still populated. Everything is so strange, and while this eccentric nature has merit, but it may alienate some audience.\r The Rover is a muddy arduous chase, yet it's brilliantly captivating beneath all the dust and blood."
    },
    {
      "rating": "10",
      "text": "A post-apocalyptic story that rates amongst the best of the genre. Pearce delivers another solid performance, but it is Pattinson that will surprise the most in a career best performance."
    },
    {
      "rating": "4",
      "text": "Despite fairly solid lead performances, great atmospherics and an edgy soundtrack, there's not much else here that hasn't already been done before (and better) in movies like \"The Road Warrior,\" \"The Road,\" \"Thelma & Louise\" and (dare I say it) \"Dude, Where's My Car?\" Hyping style doesn't make a movie any better; it's still just style with a good publicist."
    },
    {
      "rating": "8",
      "text": "A really touching movie of two men who've apparently lost it all.  The barren, Australian landscape only adds to this sense of despair but not in an overdone, butchered sort of way.  The film leaves you yearning to know why Pearce's car was so special.  It almost runs contradictory to the whole \"nothing to lose theme\" -- the car's obviously something he does not want lost in spite of it all.  Therefore when people say this is a film about two men with nothing to lose, I don't quite buy that.\r I also don't buy Pattinson's horrible attempt at a southern American accent.  It's almost like he's just drunk or deranged instead.  And I also failed to see some noteworthy bond between the two men which I think was the intention of the director.  Pearce clearly cared about what what in that car a lot more.  And why should he have not?"
    },
    {
      "rating": "5",
      "text": "The rover storyline wasn't horrible but wasn't wonderful. However, I would watch it over and over just to see Pattinson's and Pearce's performance. Wonderful Actors!!!"
    },
    {
      "rating": "9",
      "text": "The Rover is the classic Cannes film festival film.This film about nothing and everything in the same time,film about realistic future.Main acting of Pearce and Pattinson is the reason to watch.Guy Pearce is off course good,but Pattison is just fantastic and i'm really enjoy his acting.So if you like Pearce,Pattison and films about human nature,you should to watch.\rP.S. ''The more I know people, the more I like dogs''- Mark Twain."
    },
    {
      "rating": "8",
      "text": "If you have not seen The Rover then stop reading this review and go watch The Rover. I walked into this movie with the background that it was post-apocalyptic and had good performances. Both of those things are true to the fullest extent one could hope for, but there is much more to it than that. There is a total desolation and perfect balance to its sparse moving parts. It stands like a confounding inverse mobile found in the blasted Outback. It is a litmus, it rewards patience, you will probably not agree with all of my praise. When the big “reveal” happens some people will groan and others will relive every moment of the film and appreciate them anew, not in the way of a Twilight Zone or Shyamalan twist, but in the way of dismantling a bit of analogue technology and seeing the beauty and simplicity of elegant design—even the name is balanced within the microcosm of the film’s (non)mystery—but the greatest part of it is that the characters show you everything about themselves from their earliest moments and with that comes a kind of perfection within the reality they portray that is rarely represented in film and heretofore missing from the post-apocalyptic subgenre. Most movies make you feel for their antiheroes by making them cool, world-changing, or having them change at the end. The Rover does not make these concessions, but if you’re really watching, then, in spite of the seeming senselessness, you will feel what Eric feels, and it will feel like what it would feel like to live after the end of the world: having had something beautiful that you did not understand destroyed in front of your eyes and knowing that nothing will ever bring it back."
    },
    {
      "rating": "7",
      "text": "Outblack thriller. Unrecognizable Pierce and Pattinson as two men in a road to nowhere. The post apocalyptic atmosphere is far from Mad Max or The road but the creepy score does the needly for save the 103 minutes."
    },
    {
      "rating": "6",
      "text": "It's not Mad Max, but this film does take place in Austrailia a decade after a global collapse. Guy Pearce plays a dour, dirty traveler of few words and violent action. When three men steal his car, he chases after them with a \"halfwit,\" interestingly played by Robert Pattison.  Everything about this film is gritty and grim: the people, the look, even the attitude. Director David Michôd has crafted it with an assured hand that makes it compelling, even with the tedious pacing and minimal explanations. He loves to hold long closeups of Pattinson as he ruminates."
    },
    {
      "rating": "7",
      "text": "In the very near future, the government of Australia has completely collapsed. The cities are run by the military and the outback has turned into the wild west. A daring crime has just taking place, four men took out an army barracks, and only three returned, but while fleeing, they crashed their car, luckily, there is one by the side of the road. That car belongs to a man named Eric, and he really loves his car. Eric (Guy Pearce) jumps into the damaged car and chases after the men, only to lose them. He attempts to track them, when he's approached by a man claiming to be the fourth man left for dead, and Eric promises him, if he doesn't help him get his car back, the man will be dead for sure this time. The Rover certainly is a bizarre story and I honestly couldn't believe some of the place it went to, but in the end the story was really ingenious. Guy Pearce stars in his best role since Momento. I mean he really was the perfect choice for Eric and fit this role like a glove. Pearce is paired with Rob Pattinson who I couldn't stand until I saw this movie. My only experiences with Pattinson to this point had been a brief appearance in Harry Potter, and a couple of god awful Twilight movies. I honest thought he was just another one of these good looking guys, who couldn't act, but I was wrong. His character had so many dimensions to it, having to deal with a mental illness, while trying to understand conflicting emotions that he never had to deal with before. It was a tremendous performance. The film does have it's slow points and some of scenes are just sick and twisted, much better suited for a different genre, but all in all I really enjoyed this film. It was something different for a change in a unique setting. While it lacked any kind of background and the dialogue was almost nonexistent, one almost felt like you didn't really need it to understand or enjoy this film."
    },
    {
      "rating": "7",
      "text": "The Rover comes with its share of positives and negatives, but ultimately, its positives are too good to ignore. However, starting with the negative side of things, the story is lackluster. I am not always somebody who demands clarity from a story, but here, it would have been nice to at least have heard the main character's name once. That is how little information this one gives you as to what is going on, which really goes to the larger problem of a largely pretty poor story. The writing is alright, but the story is lackluster and really did very little for me. In saying that, this one's positives are really positive. Guy Pearce and Robert Pattinson are outstanding in this one and really do everything humanly possible to make this one into a good movie and dammit, they certainly did. Director David Michod is great as always, he really created a very cool dark, gritty, and dystopian, world here that I wish was fleshed out a bit more, but ultimately, his direction was great as always. The cinematography was also pitch perfect and really helped add a super clean and interesting look to this world created by Michod. Overall, The Rover is a good, entertaining film that is undoubtedly a bit of a slow burner, but if you appreciate great acting and direction over anything, this is the one for you."
    },
    {
      "rating": "1",
      "text": "Words like boring and plotting come to mind. Long shot of cars driving down highway's. The slowest post apocalyptic movie I've ever Watched.  The characters are incredibly unsympathetic so you don't care what happens to them. The mission  that throws them together feels a little too much like Captain Ahab in the white whale. All in all absolutely skip this film it isn't worth two minutes of your time"
    },
    {
      "rating": "5",
      "text": "i think with most movies today, so much happens in the first half that the second half loses focus. this film is no exception, not to mention i didnt like pattinsons character at all, he does questionable things that arent really explained. the score and cinematography are nice."
    },
    {
      "rating": "4",
      "text": "This movie is really well-made, but it seems like a really long stretch when you get to the end and find out the driving purpose behind the main character's (Guy Pierce) drive to get his car back..... At the end of it, I felt a bit cheated by the story - but I did think that the production had very good strengths. The performances were also very, very good."
    },
    {
      "rating": "0",
      "text": "Du post-apo australien sans queue ni tête et rempli d'air... une baudruche qui n'en finit plus de se déballonner pendant plus d'une heure quarante... Il faut le voir pour le croire, en images et en sons parce que rien que d'en parler, on arrive pas à y croire.Le scénario fait \"pschiiit\" à peine commencé, alors que Guy Pearce la gueule pleine d'embruns poursuit des crevards qui viennent de faucher sa Holden. A partir de là, le temps devient très long, très lent, peuplé de quelques dialogues ineptes pour tenter de remplir le vide intersidéral de ce qui se veut... un \"film\".L'apo en question, on ne sait pas, personne ne sait, même pas les andouilles à la réalisation ou l'écriture (?) de ce machin avec ses quelques clampins dans le désert. Navrant, sans objet et en plus, j'ai pas vu la moindre Rover."
    },
    {
      "rating": "6",
      "text": "This is a crime and drama film, with themes covered including threats, sibling relationships, confessions and theft. It is quite a bleak film, with a desolate setting. It features chilly, unsettling, menacing sounding even music in the form of what sounded like almost slow, painful scrape-y, trudging noises in the background, which sounded quite haunting. Some of the dialogue I found to be quite unsettling too.  There are a variety of characters, which may not be what you might expect, although I won't say anymore so as not to provide any spoilers but suffice to say that some of the people he comes across aren't what you may expect to find in such a setting. At times I felt it had the look of an old fashioned western film - there are various gun shootouts, for one thing.I found the start of the film a bit confusing, as it doesn't really try to explain whats going on and so it seems like your already perhaps mid way through a film, rather than at the start. Its only as the plot slowly develops that we get a glimpse in to whats happened before and why the main character, Eric, is doing what he's doing, why he is in the position he is.I noticed there were some quite impressive landscape camera shots, i.e. good cinematography present at times. This reinforces the bleak environment at times but also shows some of the beauty of nature in such a desolate place at other times as well.Cast wise, Guy Pearce plays the main character Eric. He comes across as quite cold blooded/cold hearted, quite a quick witted person, very determined and steely - someone to be nervous of, thats for sure. He plays the role quite deadpan and so his portrayal does seem eerily realistic. Meanwhile, Robert Pattinson plays the unlikely 'friend' Rey, who is less self assured and less witty but does seem genuinely quite uncomfortable and nervous, as anyone would in his situation. I thought it was interesting to see Pattinson take on what seems like a different type of role to his previous films. Rey is more of a sort of naive country bumpkin sibling type and I thought he was played well by Pattinson in this film and I did find myself feeling quite sorry for him, as he presumably didn't realise from the outset what he was getting in to. His southern accent sounded relatively genuine to me but then I've not been to the area, so it might be bad for all I'd know, I suppose! im perhaps not the best person to judge that(?). Other characters include Scoot McNairy as Henry and David Field as Archie.Content wise, the film contains very strong language, some sex references and violence (mainly gunfire related) including bloody violence with bloody injuries shown on screen. The film as a whole is quite dark in tone and the violent scenes can be quite sudden, so they may be more distressing or frightening to some people - suffice to say its not for the very feignt hearted. The film has been given a 15 rating in the UK due to said content.Yes, I'd recommend this film as I felt it was very atmospheric, spooky and mysterious and it features good performances from the main cast. It is quite dark and bleak and so won't suit everyone but for what it is, its a good film, certainly not a predictable one."
    },
    {
      "rating": "8",
      "text": "Good movie good movie good movie good movie good movie good movie battionson goods"
    },
    {
      "rating": "6",
      "text": "The archetype of an average film. The narrative's slight and the music is occasionally misplaced. However the visuals are solid and Pattinson & Pearce turn in good performances -- of course they're reliable.6/10 [C]"
    },
    {
      "rating": "7",
      "text": "Film that takes place in a kind of post apocalyptic without particular pretensions or settings that still manages to make the sense of emptiness well with the least possible effort. The plot i se is very banal and is summed up in a journey by car where the two protagonists learn to make friends and become attached to each other until they establish a true semi-brotherhood relationship that manages well to convey the idea of link. Throughout the film, the viewer is induced to '' cheer '' for the man who lost his car and his passenger without however understanding the reason for all this for a car. The film is very entertaining and also manages to build a good ending on such a banal plot and this is not to be taken for granted."
    }
  ],
  "recommendations": [
    "you_were_never_really_here",
    "ex_machina",
    "no_country_for_old_men",
    "the_good_shepherd",
    "the_killing_of_a_sacred_deer",
    "127_hours",
    "the_place_beyond_the_pines",
    "sicario",
    "good_time",
    "21_grams",
    "the_beguiled",
    "drive",
    "thoroughbreds",
    "a_most_wanted_man",
    "the_walk",
    "beirut",
    "first_man",
    "hanna",
    "the_machinist",
    "the_grey",
    "the_devil_all_the_time",
    "bad_times_at_the_el_royale",
    "the_master",
    "nocturnal_animals",
    "tenet"
  ]
}