{
  "id": 3815,
  "title": "The Tree of Life",
  "starring": [
    "Brad Pitt",
    "Sean Penn"
  ],
  "runtime": 139,
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "description": "The impressionistic story of a Texas family in the 1950s. The film follows the life journey of the eldest son, Jack, through the innocence of childhood to his disillusioned adult years as he tries to reconcile a complicated relationship with his father. Jack finds himself a lost soul in the modern world, seeking answers to the origins and meaning of life while questioning the existence of faith.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l8cwuB5WJSoj4uMAsnzuHBOMaSJ.jpg",
  "categories": {
    "plot": 8.481481481481481,
    "acting": 8.375,
    "ending": 6.923076923076923,
    "soundtrack": 9.0,
    "cinematography": 9.6,
    "familyFriendly": 6.0,
    "funny": 8.5,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I rarely hand out a perfect 10 for such movies due to my harsh criticism on movies. However, master director Terrence Malick just earned one for his new movie \"The Tree of Life\". Simply, this film isn't just a masterpiece. The pure graphics (not with the aid of foolish CGI) and the luxurious use of cinematography as well as the slow, linear story may look equivalent to Kubrick's \"2001: A Space Odyssey\", but the film transcends Kubrick's masterpiece and redefines it with the a more personal topic; human. It presents us life, despair, and hope. Remember when we had troubled times, where we fought with our parents and rebelled against them, when we despised our brothers and sisters for their prominent talents, and when we felt God has abandoned us and left you in the abyss of sin, not lending you the escape rope? Such questions are asked in the film and despair floods within the tone. Director Malick determines to find the solution, starting from the primeval ages of life. Through the entire time, hate and collisions are only to be seen. The characters become blind of their surroundings and cannot see each other's feelings. Everything is lost; a dead son with a failed father is only to be found. It was then that the child, who has now reached to a point of experienced maturity, learns forgiveness of his father, joyful love of his family, and the true motive of God, smiles. \"The Tree of Life\" at this point ends as, with slow but vibrant colors, ascending into 'the universal solution', softly whispering to us that true honesty, forgiveness, and love brings back us, and...Life."
    },
    {
      "rating": "1",
      "text": "Perhaps since this movie made me think \"please god let it end\" for an hour, it was a religious experience. Otherwise not so much. This was the Hubble space telescope meets pseudo profundity. There is nothing quite so trite as overwrought emotion, and this movie is really trite. With access to the technology necessary it could have been made by a high school student - there wasn't an insight in it that most overwrought 17 yr olds haven't had. I wanted to see what the fuss was about so blew two hours;  trust me and don't make that same mistake yourself."
    },
    {
      "rating": "1",
      "text": "I do not know quite where to begin.  My wife and I are college graduates, she is an attorney and I have done some graduate work.  We read about this movie in the Austin paper on Friday because Terry Malick lives here.  A lengthy article which only touched on the utter incomprehensibility of this movie.  Malick may be a genius in the same way Jackson Pollack was: perhaps once someone tediously explains what you are looking at, you smile, walk away, but still dont get it.  If you thought 2001: A Space Odessey was challenging, you are not going to like this.  It starts with an overly drawn out Big Bang sequence, contains a dinosaur sequence fresh from Jurrasic Park, and closes with the end of time.  I say \"closes\" because the movie is SO long, you think (and hope) it ends well before it does (several false closes) and then thankfully ends, seemingly five hours later.  I wish I were more artistic and etherial and could somehow recommend this movie, which clearly was made for artistic and etherial critics, and those endless Cannes/Sundance/Toronto film festivals for an award.  We ordinarily trust Metacritic's critic scores faithfully to attend or not attend movies.  This time, ignore them and trust the User Reviews."
    },
    {
      "rating": "9",
      "text": "The Tree of life is more of an experience than a movie, and a very spiritual one at that.  If that sentence alone scares you away from this film, then it is probably not for you.  But if you are an open-minded movie-goer, that doesn't mind movies that ask you to think and analyze your own life, chances are you will admire this movie as much as I did. Some people who watch this film will get something completely different from it than what some else does.  Whether or not your reaction to this movie is positive or negative depends solely on you, the viewer.  It seems like most people who disliked it did not have the patience for it. Patience is one thing you need in order to enjoy this movie. The Tree of Life does not contain your run-of-the-mill movie plot, with typical characters, and typical situations.  After the initial \"birth of the universe\" segment, the movie moves from one reality to another, from one thought to the other, effectively depicting the protagonist's thoughts and memories as they come to his mind as the movie progresses.  The gorgeous imagery truly is something to behold, and the beautiful musical score accompanies these images well. I thought about this film for a few days after watching it.  It had me analyzing my own life in general, especially my relationships with my mother, my father, my siblings etc.  As a whole, The Tree of Life is a movie that truly is greater than the sum of it's parts, and is unlike anything I've seen before."
    },
    {
      "rating": "8",
      "text": "It's weird but I saw this and Melancholia within a couple of weeks each other. Both films seem to either engage audiences or send them racing for the exits.Tree Of Life, I thought, was a beautiful movie and kept me interested. Melancholia, was a tedious bore.At least I liked most of the characters in Tree Of Life but I felt the ending felt a bit short.Sad to see so many people down on this film when there is so much crap that people pay to go and see these days and they stay for the whole thing.People actually walked out of this movie?"
    },
    {
      "rating": "8",
      "text": "If possible try to get connected with the infinity, with the wonder of living, with everything that is felt and touched with grace and childlike playfulness. If not, try to get a good sleep which might turn meditative without your Knowledge. The film is genuinely fragmented and somewhat scattered (can memory be cohesive?), for it achieves the form of a collective dream that is universal and personal at the same time. it is a honest and wise film, very much Christian (Catholic) in its spiritual faith, if I am right. Whether I agree or disagree with its ideas is a different thing altogether. The film's organic and instinctive approach is bold and demands a challenging Film experience.To my knowledge, The only two films to have achieved such status and forms a reference to this, is 2001 space odyssey and Tarkovsky's Mirror. Terrence Malick seems to be a filmmaker who trusts his instincts wholeheartedly and has tried to deliver it to us unpolluted, straight from his soul."
    },
    {
      "rating": "9",
      "text": "This is the perfect example of how movies can be works of art. What separates this movie from other pretentious, artsy films, is that everything that is incorporated in this movie is instrumental is provoking emotion, developing the storyline, and making the audience think about life. It proposes deep, philosophical questions, and seeks to answer those questions. It does so beautifully, to the point where the viewer is completely satisfied by the ending, and ends up actually feeling more optimistic about the world in general. The script is absolutely perfect. It's a great psychological movie, as well as a great philosophical movie. There are many different themes in this movie, whether they are just barely touched on, or if they are focused on throughout the entire movie, and each one is executed with absolute precision and subtlety, resulting in an unbelievably powerful impact on the viewer. This is the kind of movie you don't easily forget, and the kind of movie that will still be remembered in 50 years."
    },
    {
      "rating": "8",
      "text": "I have been sitting in front of my computer for almost an hour, and I still havenâ"
    },
    {
      "rating": "9",
      "text": "Way back in 1990, David Foster Wallace talked about how the post-post modern novelist might actually have to embrace sincerity, serious concern with ideas that he/she actually believed in, rather than embracing the universal, self-superior snark that he already saw invading TV (cf., for this reviewer, \"Family Guy\"). Haters of this movie confirm his view of the cultural drift toward scorn (Colbert's scent... nyuk, nyuk!) as the predominant value on the InterWeb. Look, either Malick reaches you on the wavelength you live on, or he doesn't. I found the film to be an experience unlike any film in recent memory (though a grad-school viewing of \"The Seventh Seal\" c. 1990 comes to mind), and if it seems rote or (Chrissakes!) \"boring\" or (oooh, how uncool!) \"pretentious,\" why aren't you mentioning some other film that you think even begins to address existential questions about life released in the last ten years? (You people probably hate the band Low, too.) Stunning, emotionally gripping, like nothing else out there."
    },
    {
      "rating": "9",
      "text": "If you seek a traditional motion picture experience, this film will leave you screaming for mercy.\rThis film exists somewhere between a Bob Dylan hymn and portions of 'John From Cincinatti' without the humor.\rIn fact, it is bereft of laughter but can engage a mystical smile from time to time.\rWhatever narrative exists delivers a message  that erupts into mortal fears for those still paying attention after 90 minutes.\rIf you have the curiosity and patience to explore evolved, spiritual ideals as formatted through the art of cinema, then you may have located Nirvana.\rThis Tree is a flawed Oak that dares to incite, unite and disorient it's viewers.\rThe Life that dreams inside this celluloid brilliance and darkness is a victorious disaster.\rAnd who doesn't enjoy a good disaster every now and then?\rMy problem with the creation is that it takes many emotional hostages in the name of a spiritual quest. This style offers few answers to the most important questions it poses..\rStill, there is little doubt that Mallick has been blessed by a brand of genius that often eludes our zones of viewing security.\rBut I'll be damned if he doesn't swing for the fences during the effort. If Terrance connects is totally your call. It's worth is beyond any critic's perceptions.\rThat is how personal this journey is.\rFrom an acting vantage point, Brad Pitt does some remarkable things with the material given him.\rSean Penn utters only a handfull of on screen words and given his public response to the film is lost as to why as the viewer might be.\rThe only true star here is Mr. Mallick whose unseen face is written within every frame.\r'Tree Of Life' is 'Badlands without the active, murderous hearts. It takes us to a place we may or may not desire to be but are all a part of and subject to by virtue of birth."
    },
    {
      "rating": "9",
      "text": "Ok, first things first.  All of the \"college graduates\" and people the that use words like \"daub\" and hated the film are Republicans.   You can graduate from college with a degree in Turf management.  Need I say more?  Glenn Beck has stated on numerous occasions that conservatives do not like movies with messages.  Now to the film.  One reviewer called it poetry in film or words to that effect and that description is perfect.  I am not a person who watches Warhol films and calls them 'genius.'  I will try anything.  Hell, I liked Avatar AND Mulholland Drive.  I couldn't stop watching this film.  I had no idea what was going to be on the screen next.  Very cool and the visuals and the soundtrack were hypnotic.  It is certainly not for the average person or college graduate Republican but give it a go.  It ain't Spiderman 53 but no one said it was.   WOW!  I'll give it a 9."
    },
    {
      "rating": "8",
      "text": "Although it is a bit too long and it lacks a dramatic story like promised, The Tree of Life does bring emotion, and offers Brad Pitt at his best  along with Jessica Chastain bringing a wonderful performance. And the film is just beautifully shot and it has the best visual effects I have seen in a long time. I give this film 82%.â"
    },
    {
      "rating": "9",
      "text": "I don't know what to say. When I first saw this, I said \"I can't really think of an opinion of this.\" Overall, I am giving it a 9 because it was a movie that definitely grabbed me, and i had fun afterwards trying to unravel it's mysterious. Overall, I think I have decided that overall it is an enjoyable movie. Definitely very complex."
    },
    {
      "rating": "8",
      "text": "I can see why this movie is dividing a lot of audiences. It's the kind of film that takes its sweet time, and whenever it feels like it, it goes off on surreal tangents. But for me, there was so much to appreciate here. The biggest thing that I loved about this film was the detailed attention to its characters. Mallick takes sequentially scattered moments of a family, and uses them to flesh out the characters in a way that gets us to understand their entire world. I was also impressed with Brad Pitt as he gives the most truthful performance of his career. Those two elements kept me hooked in even when Mallick was off showing us clips of space and the motion of fluids. I know he had a purpose for those scenes as he spent three years editing this film, but I couldn't exactly figure it all out. Honestly, I don't think \"Tree of Life\" is a movie you can figure out. It's like a surreal painting. The beauty and nuance come from what you get out of it. It's like the movie offers you a \"Choose Your Own Meaning\" option. \"The Tree of Life\" was a refreshing experience. The characters are fascinating and the cinematography is breathtakingly gorgeous. If you're a fan of Mallick's work, or you enjoy head trips similar to a David Lynch movie or 2001: A Space Odyssey, do not miss seeing \"The Tree of Life.\" It's a unique movie-going experience."
    },
    {
      "rating": "8",
      "text": "I have no trouble recalling my maiden voyage in Mr. Malick's cinematic set-ups, 6 years ago THE NEW WORLD (2005, and a medium 6/10 in my rating system), which I almost forsook due to an extreme frazzle (a grudge rising from anger more than tiresomeness), then after a couple of years, the second time is with DAYS OF HEAVEN (1978), which unexpectedly procures my staunch affection, a 9/10. So the third one comes now, notched up the Golden Palm in Cannes last year, itâ"
    },
    {
      "rating": "8",
      "text": "The Tree of Life isn't a film, it's an experience. Malick's bold vision is a tad overwhelming at times and has the potential to alienate viewers due to its sheer size (the movie stands at about 2 hours and 20 minutes, but it feels far longer), sheer depth (you could go on for days trying to analyze everything you are presented with), and a lack of attachment to the characters. But that last one is intentional. The editing of the film only makes it possible to get glimpses of each character's life before it switches to something else. Just because it is hard to get attached to the characters doesn't mean that they don't show emotion. All of the actors, including the kids, did a very nuanced portrayal of people living their lives. The film is not about the narrative, though. It's about how you personally feel after you are presented with everything the film throws at you. And that will be what determines whether you enjoy the experience or not. You might love it, you might hate it. I for one, thought I would hate it, but ended up being thoroughly enthralled. The Tree of Life is a testament to how transitory and fleeting life really is.That being said, if you can't handle movies without a clear narrative or plot, don't see this. If you can't handle movies that are too long and complex don't see this. It's not for everyone."
    },
    {
      "rating": "8",
      "text": "The illustrations Malick uses to emphasize the vulnerabilities of his characters against the backdrops of an infinite universe is part of the reason his film is surreal in beauty and haunting in its poetry."
    },
    {
      "rating": "10",
      "text": "This movie made me cry like a stupid baby. A word of advice before watching: don't approach it as a film but as a work of moving art. If you give the movie the investment it requires and have the emotional and spiritual clarity to receive it, you will be rewarded well beyond the gamble of a couple hours' time."
    },
    {
      "rating": "8",
      "text": "Oneiric and profound. Absolutely the greatest movie of the year."
    },
    {
      "rating": "10",
      "text": "First of all, for those who have not yet read reviews, let me start by saying that this is not your \"Brad Pitt/Sean Penn\" labeled blockbuster.\r Also, I would like to add that, if you really want to take in as much as possible (trust me there is a lot to take in), then you should go see this movie, relaxed, not tired, and in a receiving state of consciousness (I watched it last night at 2200hrs, after a very very long difficult day) and I am seriously considering re-watching it on a Saturday night...\r It is practically impossible to summarize this film, in a few words, but what this film does to you, mostly I think, is take you back to your childhood days, and bring back, re-ignite all these long lost first moments/feelings/discoveries/guilts. Do you remember the first time you had a fight with your parents? What crossed your mind? what did you feel?.....apply this to all the first times and you might get something that feels like this film.\r This film blends all the above with imaginary scenes from the creation of the cosmos, how all is connected, how did we get here? why? what did God really have to do with this? or is God in other words Love?\r You have to see for yourself, and I believe each and every one of us will have his own different experience which is exactly what real Art is.\r Bravo, to the Director, Producers and Cast"
    },
    {
      "rating": "6",
      "text": "While this film is beautifully crafted and shot, it misses the mark in telling a coherent story. If you are looking for a very artistic and visually strong film, this film may appeal to your tastes. As someone who likes being able to follow the plot of a story, I cannot say Tree of Life accomplishes that"
    },
    {
      "rating": "10",
      "text": "Oh god, what am I doing here? This movie opened slowly at select theaters and we were eventually able to see it. Much of what you will see on the screen is like itunes screensavers with classical music and whispering instead of your tunes.  There are two sad dinosaurs, one who crawled out on land too late to avoid being ripped open by hammerhead sharks and another that lays in a river and gets their head stepped on a couple of times by a Barneysaur with a big head and little arms.. Most of the men in this movie are either yelling, violent or deformed and the women are all like angels. The young Sean Penn character sneaks into the neighbor girl's house and apparently gets something nasty on her nightie because he tries to hide it and then throws it in the river. His mom looks mad when he comes home but they don't talk. His father (Brad Pitt) wants him to pick weeds and punch Dad in the face. Brad works in a factory but also travels around the world to sell his inventions and all he brings the kids are some towels he stole from a Chinese hotel. People whisper stuff like \"oh god, what am I doing here?\" and walk around on a beach in their clothes meeting the characters that played them as kids. If you think this makes no sense, try watching over two hours of it. This movie totally sucked and will be a  flop commercially. Don't waste your time or money."
    },
    {
      "rating": "10",
      "text": "\"The Tree of Life\" is one of my favorite movies. There are one two movies by now which have reached a score of ten by me. It really changed and inspired me. The movie shows a kind of movie making which I've never seen before. It's a very philosophical movie and you need to have some certain attitudes about life, nature, science and philosophical thoughts. Honestly, if you don't think during this movie you won't understand it. And you need to think and give the film a chance to reveal it's individual meaning. If you ask ten people who liked this film what the film is about you will get eleven answers. That's usual for those kinds of topics. The movie builds a bridge between science, philosophy, theology and life at it's purest. Indeed, it's very pantheistic and that's just great. A film about life. Nothing more nothing less."
    },
    {
      "rating": "10",
      "text": "This movie is life. There is nothing else I can say: this movie is amazing."
    },
    {
      "rating": "10",
      "text": "Absolutely magnificent! One of the most visually pleasing aesthetic films to be made in decades! The film is clearly spiritual and open for interpretation. You will either love or hate this film with passion. At least ... watch the entirety of the film, rather than giving up 25 minutes into the creation of the world."
    },
    {
      "rating": "8",
      "text": "Not a movie for most, The Tree of Life is an over-dramatic representation of what seems like a personal, spiritual struggle waged by the writer/director, Terry Malick,  himself. If you can get through the first 30 minutes, you may be able to appreciate the entirely-too-dramatic message being delivered. Brad Pitt is as good as I've ever seen him as the father of Jack and his two siblings. Jack, played as an adult by Sean Penn (in a very tiny role for him), is the protagonist (and I believe a representation of the writer/director) and is enduring the lessons and loss every boy, not to mention person, goes through over the course of their lives and trying to make sense of the meaning of life.The film, like Jack himself, starts off very pessimistic in his beliefs, highlighting the inconsequential meaning and apathetic brutality of nature. It's a very Agnostic, if not Atheist, view. However, it ends with a strong shot of the adult Jack slowly dropping to his knees and succumbing to the complexity and reality of life, praying to some \"God\" to watch out for us all...until the end of time.The meat of the story is young Jack learning boyhood lessons, which were almost painful in their accuracy to watch. I found myself squirming from very vivid memories of my own childhood thoughts that mirrored Jack's own a little too similarly. It was this immensely detailed and deep understanding of a growing boy, as well as the deeply emotional and over-dramatic display throughout the movie, that makes me believe this is a personal film for the writer. For people who generally hate these types of films, I would highly dissuade you from watching it. In fact, several people screening the film before me came out demanding refunds and urging people to change films. When I saw it, people clapped and laughed at the end, and not for good reasons. They were glad to see it done and happy to be leaving.It is definitely a niche film and would only be appreciated by that niche.  The style is typical of Terry Malick's, from what I understand, but for Father's Day and already being in a deep funk and contemplative due to the recent cancer struggle of my friend, Wes, it was a very hard film to watch.  I came out appreciating it much more than I did while I was watching it.  As much as the beginning had me thinking it was a strong liberal, almost anti-religion, agenda, which was coming across as irritating, even though I can appreciate the guts that would have taken,  I left thinking anything but and was impressed by its roundabout message of love and spirituality.  It's worth seeing once if you have an open mind and 2:18 of patience to let a movie make its point, but as much as I can appreciate it, it took a lot out of me to watch it.  I believe I can only do it once."
    },
    {
      "rating": "8",
      "text": "'' The Tree of Life '' offers a beautiful, heart warming cinematography. Sadly, it is misunderstood by many. This movie is not for everyone. You really have to be interested and mentally prepared before seeing this. The thing is, the director (Terrence Malick) used to study philosophy at  Harvard University. I like that he decided to use that knowledge to make something different : a way of seeing life in a artistic way. All that in a movie, which makes it so unique. So don't expect this to have an intense story with action. It's a relaxing movie with metaphors (one of the main reason that people can get confused) and you have to be open minded and to have that capacity to go deeper in your toughs (like I said before, being mentally prepared). When was the last time you had a strong feeling inside of you after seeing a movie ? This film is about feeling. That's why this movie can be considered an art. It's like if the director took a poem about life, and made a movie about it. I understand why some people hated it, because they didn't get the picture or simply because they don't like this type of film. If you only like shallow movies with none sense and naked girls, then shut up and go watch a useless, mindless, crappy movie like '' Piranha '' (2010). The music was wonderful and captivating. Also, there were parts when there wasn't dialogue (a few minutes long), just music. It's like if you were at a Opera theater or laying down and listening to the ocean. I enjoyed the way they showed the evolution of the universe. But it wasn't necessary that they showed the dinosaurs. Everybody did a good job acting, even if they didn't had a lot to say. For some reason, I really liked the kids, they were great. I agree that at some point it was boring, but it didn't really bothered me. I was hoping to get an explanation at the end of the movie, so I can understand 100 %. I had to go to wikipedia to read the plot to make sure I got it. So yes, this movie is not for everyone. It's slow and contains a lot of metaphors and was made artistically. It will surely win an Oscar for best cinematography."
    },
    {
      "rating": "8",
      "text": "I do not actually believe the character developement or the emotion of the movie deserves an 8. I actually would think those ingrediants deserve a 3. But the visuals were stunning and it was amazing how it showed the way life was formed millions of years ago. I have also made some inferences about the movie. Firstly, the reason they showed all of outer space and the other galaxies was to demonstrate how small the world was in the scheme of things and how bad things that happen on earth are not as big a deal as they appear. Also, for those who keep saying that they do not like the way religion was involved in the movie, it is actually an anti-religious  movie. This is because it showed how lifeforms started and the young Sean Penn character kept on saying \"God- where were you?\" There were also a ton of negatives in this movie. Such as there being hardly any dialouge and how there was so much suspense to what was going to happen and it ended up just being boring. It was a good movie but I wouldn't reccomend watching it."
    },
    {
      "rating": "8",
      "text": "â"
    },
    {
      "rating": "8",
      "text": "The Tree of Life joins an exclusive film genre, formed only by 2001 A Space Odyssey. It is difficult to put a name for this category, but a good approach would be philosophical movies. This picture debates about God existence and questions if He has been involved with life and its development in our planet around all ages.The plot is wrapped around a dysfunctional family, formed by an extremely strict father that wants to show to his fearful sons how to survive in the real world. All this is traduced in constant fights and conflicts. These problems produce in the mom a sort of need of asking to God why this is happening and why He will not help them (us).These questions surround the theme of the movie, the life in planet Earth in all its forms. The firsts cells appear, they transform into bacteria, plants and animals. The dinosaurs raise and extinction. The landscape and nature change. The mammals develop and appear human beings. And, Can we be sure that God takes part on it?At the end of the film all the people appear in a desert, as if they were looking for something. They think that they are looking for heaven, but there is nothing more than an empty land, because it has never existed something like a God or a Garden of Eden.The failures of this movie are that its excessively artistic, a shadow of Kubricks film and it leaves too much to interpretation. But the reflection that produces is remarkable."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie. Yes, I'll admit, it feels like you're watching a home video, but it would have to be THE BEST cinematography for nearly any given video. Nearly every scene was absolutely breathtaking. It's about life (as suggested by the title) and provides a beautiful metaphor for life."
    },
    {
      "rating": "10",
      "text": "SMart PERSON: I trust in Malick. Thus, I knew this wouldn't be a MOVIE, rather it would be an experience. It is essentially a breathing series of paintings: walking, talking...thinking, that are meant to induce questions to which only the viewer himself can answer. Artistically speaking, Malick has created a stunning piece of cinema, unlike any filmmaker in history. For all mankind's sake, I hope it's not his last.MASSES: If you're wanting a car crash or going because Brad Pitt is in it...Good luck. With the rest of your life too."
    },
    {
      "rating": "10",
      "text": "I watched the film. I waited a week.  I decided it was the best use of film I have seen in a while. Poetic thematically and visually.  What I find interesting is the controversy over whether this movie is good or bad. People have asked for  money back, taken lengthy amounts of time to tear down the film or praise the film.  The TOL echos the premier of  Stravinsky's The Rite of Spring but now people are shouting in cyberspace slinging accusations of intellectualism...elitism.  During the film and just shortly after, i was on the fence about the quality of the work.  It was after mediation of the words and the frames that I came to be moved over and over again.  My response was emotional, visceral, not intellectual.  I don't think most people go to the movies to be thoughtful or changed.  Art is demanding; it requires the viewer to be uncomfortable, to be unsafe and to consider unknown possibilities. I am pleased to see people attempting dialogue about what makes a film good or bad. This reinforces my feeling that this film is in fact a artistic and spiritual masterpiece of the 21st century.  Just as Jackson Pollock  stretched the definition of painting and broke away from previous conventions, Malick is challenging the mainstream notion which defines film and more importantly, he offers a comfort to our suffering."
    },
    {
      "rating": "10",
      "text": "This film gives you  a breath of fresh air from what you're used to seeing dominate the movie theaters these days.  It was very eye-captivating, moving, and something we could all relate too.  There was one scene that made a couple sitting next to me reminisce on their own lives, provoking them to caress one another for that split moment.  And that's what this movie shows:  the importance of every moment in our lives."
    },
    {
      "rating": "9",
      "text": "Abstract. Visually stunning. Impressionistic. Made up of memories and dreams. The little things (that too often we take for granted) are what really matters. Definitely not for everyone."
    },
    {
      "rating": "10",
      "text": "This film is high art. I'm not going to pretend I fully grasped all of the complex symbolism and abstraction, but I left the screening in awe and my wife and I were clearly moved emotionally. Malick pushed the envelope and took a huge risk in making this film. He created a work of art and engaged the viewers in a discussion of grand ideas. One of the few movies I've seen in my lifetime that I can't wait to see again."
    },
    {
      "rating": "10",
      "text": "What a powerhouse of visual effects to open up the mind to creation. The story and acting are just a vehicle to show that family life has progressed to the point where we, as humans, are shown as hard, competitive and brutal. But love and caring can still bring some attachments worth having....Malick's message is that no matter what happens on earth, God or nature has created this life on Earth without any scientific proof. So, he takes this further by saying there's another world that was also created. He calls it heaven. It's all love there."
    },
    {
      "rating": "10",
      "text": "This is a hard movie to recommend to anyone. It's a beautiful movie that transcends the category of being a movie. It's flat out a piece of art."
    },
    {
      "rating": "10",
      "text": "Terrence  Malick builds life in this film. It is definitely a hard movie to watch and not easy to understand let alone comprehend. When I saw this movie I wasn't enchanted by the beauty of the special effects but by their meaning. It doesn't take a genius to understand it but it takes a graceful person to agree. To sum up, if the word grace has any meaning in your life then you will understand and love this movie, but if you are a closed person not willing to give yourself a new spark in life than this movie will be dull to you. God bless this movie and every one of you."
    },
    {
      "rating": "10",
      "text": "Tree of Life is not for your entertainment. Tree of Life is for non mainstream - patient audiences. Filled with religious and deep-meaning life message , visual treat, touching performance and powerful score make The Tree of Life undeniably Terrence Malick's masterpiece."
    },
    {
      "rating": "5",
      "text": "I can't criticise The Tree of Life on an aesthetic level - it's a breathtakingly beautiful piece of filmmaking. I can't criticise the performances either - Brad Pitt delivers his best performance in years playing a father of three who favours tough love, and newcomer Hunter McCracken is simply spellbinding as Jack, the eldest son (played by Sean Penn when grown up). I most certainly can't fault the script - Terrence Malick has succeeded in forging a completely believable, utterly compelling family dynamic. What I can criticise is an over-reliance on religious symbolism, pretentious themes, a jarring, overly melodramatic score and a nigh-on incomprehensible final act. When viewed on their own, the stunning sequences documenting the beginnings of life on earth might have worked, and the same goes for the gritty, dysfunctional family drama segments that form the core of the film. When blended together however, these vastly different filmmaking ideas are a little disorientating, and you may find yourself emotionally detached from the film as a consequence.  I can't help but admire Malick's courage, and his ambition, and soome elements of The Tree of Life certainly hit the mark, but as a one consistent idea, I can't quite get behind it."
    },
    {
      "rating": "10",
      "text": "My favorite movie of the year. It was totally different than I expected it would be but I left it being very spiritually and emotionally touched. The cinematography and amazing visuals (not using CGI) are amazing! Beware though it is not for everyone it doesn't have much of a story per se but rather attempts to encapsulate existence in its entirety. If that sounds appealing to you please see it!"
    },
    {
      "rating": "9",
      "text": "I think Terrence Mallick fulfils his career ambition through this movie. A man struggling between the origin of earth and meaning of its existence, these types of tough scripts are analyzed only by a few directors. These movies are called as MASTERPIECE."
    },
    {
      "rating": "10",
      "text": "Terrence Malick does it again!  This film is a visually gorgeous meditation on the meaning of life, love, grace, pain and suffering.  It touched upon themes that many of us have been grappling with in our own lives in a manner that was sensitive, sweet and gut-wrenching, all at once.  The visual special effects were outstanding, and the more narrative scenes with actors included numerous beautifully and acutely observed moments.  I loved the Thin Red Line and The New World, and this film is every bit their equal.  Kudos to the wise folk at Cannes who awarded this film the Palme d'Or."
    },
    {
      "rating": "10",
      "text": "While the movie is truly a magnificent sight to behold it is definetly not a film for everyone. If you're a Terrance Mallick fan you know what to expect, long ponderous existential dialogue placed over majestically shot vistas. The movies oozes with real angst (non-off that Twilight nonsense). The acting is top notch. Pit Chastain and the kid who plays young Sean Penn do wonderful jobs emoting their characters. The score is incredible, one of the best of the year so far. The effects like the rest of the cinematography are incredible. CGI is kept to a minimum,  and yet like the view is like neon candy for the eyes. This is the kind of film PT Anderson wishes he had the talent to make. Bottom line; if you like Mallick you will love this film. If you hate Mallick or like any of the Twillight films skip it."
    },
    {
      "rating": "7",
      "text": "The Tree of Life is not for everyone, close or narrow mind may not enjoy the movie. It redefines the roots of film-making. The storytelling is almost entirely made of beautiful pictures and metaphysical narration, only a few dialogues are included. I feel that this is great because it allows the viewer to think while watching. Why would you want to think while watching a movie I bet you're asking yourself ? Well, the Tree of Life is more than a movie, it's a journey, a door on the existential questions of life. The viewer won't be able to stop himself on reflecting about these different questions. The movie is about love, and what are good and evil. Therefor, the \"lack\" of dialogues is a blessing for it allows the mind of the viewer to grow. The Tree of Life is an enriching experience by Terrence Malick."
    },
    {
      "rating": "8",
      "text": "I would not recommend this film to most people - but if you're up for a VERY non-narrative film (think two and a half hour poem) about life's most serious questions, then you might find Tree of Life (especially the 2nd act) one of the most beautiful and moving films you'll see this year.  Sure, Malick gives us a gorgeous looking (and sounding!) film, but it's the wonderfully human interactions that he captures that will affect you the most.  I wish that Malick had focused just a bit more on the structure at the beginning and end to frame the moving second act in a more accessible way to most audiences."
    },
    {
      "rating": "9",
      "text": "You dont have to be 'educated' to enjoy this film - a term I use lightly as it felt more like an art fixture - you need to be in touch with the philosophical approach to thought. And that is not meant to sound pretentious, though those that dont think on that level might believe it to be so. You're either an etheral person or you're not - no judgement. The Tree of Life itself is cinematic  thought - Malick's attempt to explore the visual interpretation of your brain trying to make sense of life; yours specifically, in general, in relation to nature and to grace. He used the cinema (his communication mechanism) to explore the meaning of life. I left the theater in thought about humanity - not because of an agenda set by Malick but because the underlying current of the film is to evaluate what happened in life and why or why not we do what we do."
    },
    {
      "rating": "8",
      "text": "I left the theatre with so many thoughts and feelngs that I still am digesting it all. I stayed open and consciously refrained from judgement throughout the film. I loved this film; If you were ever a boy especially with brothers and raised with a military father like I did, this cut deep.   Not only did I feel the pain, I also felt the LOVE, the promise, the awe, the hope, we are here to live and to be apart of this mystery we call LIFE."
    },
    {
      "rating": "8",
      "text": "I had read a lot about this movie, so I approached it with some hesitation. Having seen Malik's New World and been disappointed I wondered if this would be a big letdown. It turned out to be very different to what I expected. The special effects, while providing a universal backdrop, moved me less than the human moments captured so lovingly. Indeed, I left the cinema deeply stirred emotionally without exactly knowing why. Some parts of the ending I felt were laboured (though not the final few shots, esp. the flowers), but at the core this film is about love and connection . It left me feeling more connected and touched by a gentle grace."
    }
  ],
  "recommendations": [
    "the_fountain",
    "a_ghost_story",
    "babel",
    "nine_days",
    "donnie_darko",
    "her",
    "nomadland",
    "flashback",
    "crash",
    "silence",
    "i_still_believe",
    "cloud_atlas",
    "the_lobster",
    "life_of_pi",
    "melancholia",
    "the_road",
    "mother",
    "where_the_wild_things_are",
    "antichrist",
    "soul",
    "united_93",
    "under_the_skin",
    "lost_in_translation",
    "vivarium",
    "dogville"
  ]
}