{
  "id": 503,
  "title": "The Hobbit: The Desolation of Smaug",
  "starring": [
    "Ian McKellen",
    "Martin Freeman"
  ],
  "runtime": 161,
  "genre": [
    "Fantasy",
    "Adventure",
    "Action"
  ],
  "description": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xQYiXsheRCDBA39DOrmaw1aSpbk.jpg",
  "categories": {
    "plot": 3.7222222222222223,
    "acting": 5.722222222222222,
    "ending": 5.6923076923076925,
    "soundtrack": 6.0,
    "cinematography": 2.5,
    "familyFriendly": 6.0,
    "funny": 5.888888888888889,
    "action": 6.714285714285714
  },
  "reviews": [
    {
      "rating": "5",
      "text": "\"Decent fantasy-action slightly inspired by The Hobbit\"\rMost reviews will tell you what's so great about this movie and why it's worth watching, but I figured you should hear the other side of the story.\r First of all a small note for Tolkien fans. If you thought An Unexpected Journey strayed a bit too far from the book: The Desolation of Smaug looks like the script writers didn't even know there was a book. The movie tries hard to change the story wherever it can, reducing fan-favorite chapters to 5 minute scenes and writing new content that feels out of place.\r But it's not only bad if you've read the book. I really wonder what the target audience is, because it feels like it's written for 15 year old boys. There are random action scenes every 10 minutes and 'funny' decapitations every 30. The worst thing here is that the action comes at the cost of character development. You have a band of 13 Dwarfs and a Hobbit, yet you rarely see them interact.\r Now I like Elves more than Dwarfs, so I didn't mind seeing so much of them in this movie. But having them show up in every place to save the day feels wrong. Perhaps Peter Jackson thought his cast of Dwarfs wasn't good enough to create an enjoyable movie? Gandalf's scenes in Dol Guldur were an interesting addition in concept, but they are just too slow. I feel his scenes mostly serve as an attempt to raise The Hobbit to The Lord of the Rings' level of epicness. And that just doesn't work.\r The story is full of illogicalities. How does entering the mountain to steal the Arkenstone to unite the Dwarfs to kill the Dragon to enter the mountain work exactly?? And remember that heartwarming last scene of An Unexpected Journey, where Thorin finally accepts Bilbo? Well, that's all gone again. Even though he keeps outsmarting all the Dwarfs, Bilbo is back to being an unappreciated 5th wheel of the party. And did the writers really think viewers would be so desperate for a love story that they'd enjoy an Elf and a Dwarf flirting it up? Their scenes feel forced and are painful to watch.\r Martin Freeman's acting is top notch again, but sadly he hardly gets any screen time. He only shines in his scene with Smaug. Now Smaug as a character is awesome, no complaints there. Yet most of his scenes are way too dragged out. There's a 20 minute scene with the Dwarfs running around thinking they can defeat him. Only at that point the movie already hinted at the only possible way of defeating him. Perhaps the worst aspect is that these scenes make Smaug look like an unintelligent creature. Dwarfs luring a Dragon around by going \"Nana-nanana you can't catch me!\" is not only silly and cliché, it's an insult to Smaug's character.\r Final complaint: the whole movie builds up to a scene.... that's apparently going to be the opening scene of movie 3. Nobody in the cinema was sure if the movie had ended, or there was just an awkwardly long pause when the screen went black.\r A movie like this you'll want to see, no matter how good or bad it is. You can't miss out on such a huge release, especially when it looks gorgeous in HFR 3D. But where I watched each Lord of the Rings movie 3 times in cinema, watching The Desolation of Smaug just once was enough for me.\r In the end, most problems of the movie seem to stem from the decision to turn the cute Hobbit tale into three epic movies that have to live up to the Lord of the Rings hype. It doesn't work."
    },
    {
      "rating": "10",
      "text": "Enjoyed it thoroughly. Much better than the first one, it's not as action based as the LOTR series but that's not a bad thing. It sets its own pace and is more \"adventurey\". Makes me laugh where needed and was just a ton of fun to go for at launch night."
    },
    {
      "rating": "0",
      "text": "I LOVED the first film in this series. The Hobbit was a wonderful recreation of the first part of the book, with a few embellishments here and there that I endured. This, however, was a complete embarrassment to the Lord of the Rings series, J.R.R. Tolkien and Peter Jackson. I wanted to love it, I even forced myself to sit through the entire thing in theaters, but I just hate it. I would not take a copy of this home if you offered it to me for free, because I know watching it would only make me angry and disappointed all over again. As someone who has read all of the books and previous movies, this just felt like a pathetic excuse for a move today. This just felt like a \"filler\" film between two movies. Perhaps it was the producers being greedy, wanting 3 movies out of a book that is smaller than the smallest volume of the Lord of the Rings. However it happened, it was just disgraceful. More than half of the scenes were pulled straight out of thin air. Only a few were actually from the book this trilogy is supposed to be based on, like the barrels scene and Bilbo's talk with Smaug (although the sequence the followed was NOTHING like the book's version). What little plot that was included was embellished and out of order, and honestly were ruined for me by the imagined plots thrown into the film. On top of all that, this film had terrible pacing, and was outright cheesy at times. This was just a really, really sad excuse for a sequel. I wish they had just followed the book and stuck to two movies, the original plan. Not even sure if I am going to see the third one at this point, given the way this one turned out. Such a big fan of Tolkien's work and what Peter Jackson has done with his other novels, but this was just painful. Friends don't let friends who have read the book watch this move. Gets a 0/10 for me. I felt like not only did I waste my money, but I should have been paid to watch this poor excuse for a film."
    },
    {
      "rating": "10",
      "text": "I feel this movie receives unfair criticism from critics who compare it to the LOTR trilogy. The Hobbit was a children's book written by Tolkien for his kids and which was written before LOTR was even conceived. It was only after the popularity of this book and demand for a follow up that Tolkien set  forth  to write LOTR. It is supposed to be a fun and adventurous book and that is what the movie tries to present.\rI watched the movie in IMAX 3D HFR 48fps and i loved the whole experience. I understand that this rendering of the cinema has many critics. It is important to note every cinematic experience relies on the suspension of disbelief. It is unfair to criticise the realistic quality of the backdrop of a fantasy flick. The HFR really adds to the quality of action sequences.\rThe performances in the movie were adequate and the movie was well set-up for the final instalment of the series."
    },
    {
      "rating": "9",
      "text": "Improvement in drama & action over the prior film. Cool new characters.\rGreat fight sequences, particularly the barrels set-piece.\rMy only complaint would be there's some odd pacing at times.\rOverall much better than an unexpected journey.\r9/10"
    },
    {
      "rating": "2",
      "text": "I feel like this franchise has become a sacred cow that no one is allowed to speak ill of.\rI don't see how any fan of the original story could be happy with either of the Hobbit films, but this one was simply terrible. Every great thing about this part of the book was removed and replaced with orc fights. EVERY great thing. The humor, the perseverance, everything.\rThe CGI was really hit or miss until they entered the mountain, which is when the movie really came into it's own, just in time to end 20 minutes later. At one point, they mixed in helmet-cam footage from a crappy camera going through some rapids with high def footage from other angles. It looked ridiculous.\rThe love story fell so flat, you're left wondering why they bothered.\rThere was ZERO pay off in this film. If Jackson wanted to drag it out, he should have stuck to two films and stayed closer to the source material, because his embellishments have been absolute rubbish."
    },
    {
      "rating": "0",
      "text": "If you are an actual fan of Tolkien you will be sorely disappointed with this movie. I thought Jackson took a little too much creative license in Part 1, however compared to Part 2 it would seem like Part 1 was letter for letter from the book. It's as if Jackson simply read the chapter titles and shot a movie with what he would think was in a chapter that could have such a title.\r Jackson spends far too much time truncating interesting portions of the story simply so he can fit more \"nowhere-in-the-book\" action scenes in spots that should have been done in one cut. Barrels out of Bond is a perfect example of this. Jackson lacks the concept of building a story up to a climax and simply turns the dial to 11 the entire time."
    },
    {
      "rating": "3",
      "text": "I went into The Desolation of Smaug with low expectations and managed to be disappointed. Like many, I love The Lord of the Rings Trilogy, but the prequel trilogy has yet to impress.\r That’s not entirely true. Peter Jackson’s cameo made me laugh out loud. I also loved the visuals. My only complaint with An Unexpected Journey’s visuals was that the orcs looked totally different than they did in the LotR movies. Thankfully, the orcs (with the exception of that pale fellow and his chum) are back to their old menacing look and feel.\r But TDoS does not impress in writing, acting, music, action sequences, or anything else.\r Writing: If I had taken a drink every time there was a dramatic pause followed by some God-awful, stupid line, I might have given this review a higher score on account of being too inebriated to catch all the uninspired writing and nonsensical plot filler that littered the last half of the movie.\r Acting: With how long this movie is, and with how much filler they squeezed in, it’s amazing to me that it never seemed like anyone had time to properly deliver a line of dialogue. Everything felt rushed. Questions bled into answers as if the characters knew what would be said before it was said. The emotions of the characters seemed either non-existent or so over the top that the viewer could not possibly relate.\r Music: I didn’t notice it until the very end when I thought, “There’s music playing, isn’t there?” Any LotR fan knows this is a bad thing.\r Action Sequences: These were my least favorite parts of the movie, and they took up about half of the time. I love a good action sequence when it’s done right. However, these are not. Half of the action was silly and cheesy, and the other half was boring (not quite half, actually, because I properly liked one bit of action: when that dwarf did a barrel roll, if you know what I mean). It was always predictable. “Predictable? That’s the nature of a prequel!” I hear you scream. Well then tell the writers to get the action over with fast so we can focus on, say, caring about the characters.\r Anything Else: Smaug was stupid; he looked cliche-dragon, sounded cliche-deep-voice, and acted like an enemy in a bad action movie (coincidence???). The movie strayed far from the book. I mean, I’m not the sort to bad-mouth a movie because it’s different from the book, but I am one to bad-mouth a movie that ruins everything it touches in the book. Which in this case is everything."
    },
    {
      "rating": "0",
      "text": "SPOILER ALERT! It stinks. END OF SPOILER.\r Given that it's the same crap, part 2, this shouldn't come as any great shock.\r Jackson seems absolutely single-minded in his determination to prove just how much of a hare-brained mess he and his nincompoop, amateur writing staff can make of a movie in the last years of his career. Apparently following his lead, the worshipful geeks in the special effects shop have set the bar as low as it will go so as not to outshine the awful script. Music is again on a repeat loop from the first trilogy. This is canned movie hacking taken to the least of the least common denominators, and it's hard to imagine how it can get any worse in part 3.\r But surely Jackson will find a way."
    },
    {
      "rating": "7",
      "text": "The extended edition really did this one justice. Added so much more content, Built on a lot more to the story. It made a lot more of a satisfying movie than the original version of it. It's such a major step up from the first one. Still relies a bit too heavy on CGI but I can deal with it thanks to the improvement in the dialogue."
    },
    {
      "rating": "5",
      "text": "This movie is a personalization of Hollywood's greed. Wonderful book was taken and transformed into trilogy with bizarre moments that were created in sick mind of script editors and references to Lord of the Rings that never were in original.\r 60% of movie is just made up to make it longer, but non is done in a good way. And it's just makes it boring as hell.\r Please someone tell Peter Jackson that he is not Mr. Lucas. He is not filming pre-story to his wonderful trilogy. He is filing different  book. let him read it.\r The movie is not bad in general. It's good only 40% of time when it follows book. I hope they will make special edition based book authentic script and cutting three movies to look like they were made actually based on Hobbit. Not a greedy - mind created hobbit."
    },
    {
      "rating": "3",
      "text": "I must admit I am a massive lord of the rings fan but the hobbit is a no no. Coming into this movie not expecting much I was blown away by the first half  it was fun, exciting and had some decent sets. But after the chase down the river the movie to a turn for the worse and man if man it was dragged out. Myself and a friend fell asleep first time this has ever happened! some much was happening at once the story went a wire and is one of if not the most boring movie I have ever seen. Waste of 3 hours and money."
    },
    {
      "rating": "0",
      "text": "This movie was absolutely horrible!!! I love the first 2 films (they are my favorite), but this. My god, I couldn't wait for this movie to get over with. I just hated it!"
    },
    {
      "rating": "3",
      "text": "I got fed up of Hobbits staring open mouthed, feeling faint & ogling over rings in the first trilogy  I was looking forward Jackson pulling back on the clumsy and overstated references for the Hobbit series and refining his story telling somewhat. No such luck.\r The book is actually quite funny and the characters and there interactions hold the story. They seem like a second thought in this movie. Why are they all so suspicious of each other all the time? It gets so boring and repetitive and doesn't follow true to the book. And instead of trying to tackle the more difficult parts of the story that a book can do easily he just inserts loads of action scenes or even voice overs. [spoilers ahead] The first trilogy really gave the impressions of them having to get somewhere far away whereas here there's no pace and they basically walk into a wood, got caught then floated down a river to the mountain. Its more like a 3 hour domino rally.\r I was looking forward to Bilbo and Smaug having a chatter but was interrupted by the dwarves which was followed by another dodgy rollercoaster of an action scene to an abrupt ending.\r The Hobbit series is also starting to undermine the LOTR trilogy with endless & pointless references to the great evil, Sauron & the ring which was barely mentioned in the hobbit book. No one knew anything about it at the start of LOTR. After this movie you'd think Gandalf and the rest would of put 2  2 together as about 60 years later they fight the same villain  with the same name!\r I'm honestly starting to thing that it was padded out and split into 3 films so he could make 33% more profits for next to nothing and also save a massive amount of time actually editing out all the nonsense."
    },
    {
      "rating": "5",
      "text": "You might enjoy this if you know absolutely nothing about the source material and are also a brain dead moron. Seriously this movie is way way too long and has so much needless stuff shoehorned in I can't believe it's made by the same guy that made The Lord of the Rings trilogy. Truly Peter Jackson is the new George Lucas. I'm glad he's not the one making these stories up though. The books will always be there for those who really want to know about the world Tolkien crafted with his words."
    },
    {
      "rating": "0",
      "text": "First of all, I'd like to apologise to my eyes for making them watch this garbage.\rThe book was fantastic, the 2 movies (so far) are crap.\rThe story has been changed so much that it's barely recognizable.\rDid the script writers even READ the book?\rWhere did Legolas come from?\rOrcs chasing the barrels down the river?\rOrcs in Laketown?\rThe entire fight sequence between the dwarves and Smaug just didn't happen. Smaug was already dead by the time the dwarves went into Eribor.\rI didn't know bard had kids? There were none in the book.\rI could go on and on, but you get the point.\rI'm sure that if J.R.R. was alive today, he'd be suing someone for the butcher job they did on his story.\rIf you insist on seeing it, may I suggest you go to your local video store and RENT it for $5.00"
    },
    {
      "rating": "0",
      "text": "First off, I guess I should give two scores.  If you have not read the book, it's probably worth a 6 or 7 (and shame on you).  If you have read the book, you might feel that I am being too generous.  I believe that the screen writers MAY have heard of J. R. R. Tolkien from a friend or something.  The relationship ends there.  I can only hope that this series of movies will be remade by someone who actually cares about the story instead of the almighty dollar.  I spent the entire second half of the movie shaking my head, muttering,\"No, no, no!  That didn't happen like that!\"  The only movies I have seen that butchered their source material this badly were Eragon and Kubrick's version of The Shining."
    },
    {
      "rating": "0",
      "text": "The Hobbit: The Desolation of....whatever.\rThe final result of a trilogy dying on it's knees,\rWho really ever never cared about a hobbit enough to devote 3 films\rto there kind,"
    },
    {
      "rating": "1",
      "text": "The movie deviates so far from the book as to make it not really an adaptation. Peter Jackson has taken The Hobbit and turned it into a spectacle, adding violence and action where it didn't exist in the book. Legolas wasn't in The Hobbit, and he didn't slay 30 orcs inside Dale. And his female companion is also a new character and between herself and Legolas, they probably killed an entire army of orcs.\r No dwarves were left behind in Dale  they all went. No dwarves went looking for Bilbo as he went exploring into the halls of the Lonely Mountain the first time.\r What was done well? The dragon, and that's about it. The rest of the movie was as subtle as an dwarven axe to the head. The gentleness of hobbits, the warm nuances of the book, were lost in this ridiculous pile of over exaggerated crap.\r Avoid it  it's ruined JRR Tolkien's legacy. Go and read the book to your kids instead."
    },
    {
      "rating": "3",
      "text": "this movie disappointed me so catastrophically that have no desire to see the last part of this series, I can not believe that even the special effects did not fill me, the story was poor, regular performances.\rThe truth I'm giving you three because still rules the ghost of Lord of the Rings."
    },
    {
      "rating": "3",
      "text": "What George Lucas did to Star Wars pales into insignificance compared to what Peter Jackson has done to Middle Earth. There is so much ethereal mulch and noticeable CGI crammed into the visuals that it is almost impossible to be carried along on the journey because you can't believe they are on a journey, and it's certainly very difficult to make out uniquely discernible locations. Crammed full of not only tired movie cliches, but badly and needlessly re-used ideas from the LOTR films.\rThe script is awful and plodding and without any joy or bite, and the constant use of panoramic, sweeping camera shots was in the end both annoying and alienating.\rIt is a poor imitation of the LOTR films and a poor film in it's own right - ridiculously strung out for no apparent or rewarding reason.\r Lastly - what these films have done to the story from the book is, for my money, nothing less than hateful. The Hobbit is a magical tale which has been decapitated and gutted until a thin, barely recognisable husk has remained.  This second installment is worse than the first, which in itself should be a punishable crime."
    },
    {
      "rating": "5",
      "text": "Blatantly visual-oriented, tries to be funny but isn't, tries to be spectacular but only seldom is, not consistent with the book, acting is horrid, the epic i-am-the-hero discourses are just over the top and what's wrong with Orlando Bloom's eyes?\r On the other hand, special fx are stunning, especially the scenes with Smaug (which by the way last very little) and the voice of Smaug himself is transcendental. I'm personally biased towards films like this, for I don't usually like fantasy, but this one is not so bad after all."
    },
    {
      "rating": "8",
      "text": "惊险刺激的中土之旅，抛去前作的种种铺垫，哈比人2的节奏更加流畅，唯一的不足，长湖镇的戏略显沉闷，当然抵达孤山之后， 和史矛革的对峙相当精彩。视觉效果出类拔萃，蜘蛛/龙的造型设计堪称完美，精灵族的造型超级美，同时场景设计美轮美奂，配乐不如首部曲但也高水准。不过彼得夹克逊对于原著的篡改实在是令人吃惊和不满。"
    },
    {
      "rating": "8",
      "text": "Still not at the level of LOTR, but an improvement over the first movie (which I did still like, just not as much). Just one thing, if you haven't read the book or seen the first movie, you absolutely have to do one or the other before you see this or you won't know what the hell is going on, because it jumps right in. Otherwise, this is one good movie."
    },
    {
      "rating": "3",
      "text": "If your not a fan of the Hobbit series, don't waste your time watching this movie. It is by far the worse in the series.\r If your a Hardcore Hobbit fan, this movie would have to be rated hypocrisy. This movie takes the way Disney changes stories to something unrecognizable, to whole new levels. Except Disney creates entertaining movies. At least half of the movie, has nothing to do with the actual Hobbit story.\r My family and I had to laugh at how absurdly off this movie was. Half of the fun was making up more absurdly inaccurate Hobbit tales. Laughing at Jackson's \"Desolation of the Hobbit\" tale was the only reason I give this a 3.\r The only reason to watch this movie, is because it uses more frame rates than most. This \"Historical\" factor, has to be the only reason \"Movie fans\" are rating it highly. However, most won't notice it, unless watching it on an absolutely top of the line system."
    },
    {
      "rating": "3",
      "text": "I am so bitter after writing my first review of this film that I feel I have to add to it by assuming the great Ian Mckellen was asked to play down his acting ability so as not to undermine the other mediocre performances in both these films ...I look forward  greatly when I hear of a monumental fantasy film in the pipe line as they are far and few between....I hope a director with vision and the backing of a major studio have the balls between them to bring us another fantasy tour de force such as Terry Brooks shannara series or the fantastic works of Raymond E Feist.....IF YOU ARE LISTENING JACKO,GET YOUR HEAD OUT YOUR ARSE AND BRAIN BACK IN GEAR AND BEAT EM TO THE PUNCH"
    },
    {
      "rating": "8",
      "text": "The second film in this trilogy dispenses with the relative reverence of the first, and that turns out to be a good thing. Its predecessor suffered a bit because it couldn't decide whether it wanted to be a scene-for-scene retelling of the novel or a looser, action-oriented adaptation. This film resides firmly in the second camp, and everything works better for it. For example, the escape from the Woodland Realm is every bit as over the top as the last film's escape from Goblin-town, but it doesn't feel so out of place, so it's easier just to kick back and enjoy the ride. The changes from the book once again mostly work, and in this case actually make more sense. Bard the Bargeman might not be as awesome as Bard the Bowman, at least not yet, but he is much more fleshed out, and the film finally gives the Company a decent reason for needing a burglar. I could have done without the dwarf-dragon battle at the end, I really liked the addition of Tauriel.\r My biggest objection continues to be the over-reliance on CGI. Make no mistake, the Smaug of the title is every bit as incredible as I ever imagined he could be, but decision to animate Azog's son doesn't work out so well. I understand that it was a late decision to give what was originally a live performance a computer makeover, and it shows in how unrealistic he looks next to Daddy.\r Overall, this is another fine addition to Jackson's Middle-earth saga, expanding on the previous film while avoiding its pacing pitfalls."
    },
    {
      "rating": "10",
      "text": "The Hobbit The Desolation Of Smaug was a great movie i enjoyed every second on it. It has the story of the book with some more added features. The addition of Evangeline Lilly made the movie a top for me. If you have not seen this movie I strongly suggest you go rent it buy it see it in theatres. 10/10 great movie!!"
    },
    {
      "rating": "10",
      "text": "Such a damn good movie; unbelievable   I definitely recommend it.  Nonstop in action, brilliant storytelling, etc... It's one of those movies that shouts in your mind afterward \"It was definitely worth my price of admission.\"  Will see it again before it leaves theaters xD"
    },
    {
      "rating": "9",
      "text": "I'm a big LOTR fan and thought the first Hobbit was OK  typical visual candy and decent story  but TDOS really took the story to another extraordinary level.  The last 30 minutes of this movie blew my friggin mind.  I've never seen a movie that so seamlessly integrated mind-bending effects so effectively.  Talking dragons?  Really?  It works.  Seriously"
    },
    {
      "rating": "9",
      "text": "Another breathtaking part of an Epic adventure. Three hours of pure epicness.  I have no idea what else to say about the movie, just go see it yourself."
    },
    {
      "rating": "9",
      "text": "An honest opinion from an average Joe who is no LoTR fan-boy.  I honestly thought this movie was one of the best I've seen this year. Aside from some ridiculous elven gymnastics it was very entertaining, didn't seem overly long, and set up everything well for the finale. I look forward to the holiday season next year to finish this thing off. My three young children enjoyed this movie greatly as well. They all actually sat quietly and watched it without whining for snacks or bathroom escorts. Solid 9."
    },
    {
      "rating": "10",
      "text": "Coming a year after the underrated and underappreciated “The Hobbit: An Unexpected Journey,” Peter Jackson strikes again with the year’s best movie- “The Hobbit: The Desolation Of Smaug.”  After a brief prologue featuring an excellent flashback conversation between Thorin Oakenshield and the wizard Gandalf, the movie hits the ground running and pretty much never looks back.  This is a much more action packed movie than its predecessor, featuring an intense giant spider attack sequence in Mirkwood Forest, a thrilling river barrel chase sequence as the dwarves attempt to escape from Elvish captors, an intense battle between Gandalf and Sauron, and a non-stop battle with the Dragon Smaug at the end.  As is to be expected, all technical credits are first rate, from the often brilliant special effects, to the stirring Howard Shore musical score, to the excellent use of High Frame Rate 3D.  In addition, the film delivers some outstanding acting, with particularly good performances from Richard Armitage as Thorin Oakenshield, Martin Freeman as Bilbo Baggins and Luke Evans as a well-developed and sympathetic Bard the Bowman.  It is also great to see Orlando Bloom’s Legolas back in action, and despite the initial controversy, the addition of Evangilne Lilly as the female elf warrior Tauriel is a welcome addition, even if she does not appear in the book.  The crowning achievement of the movie, however, is the Dragon Smaug (the best dragon ever portrayed on the silver screen) and his initial reveal in the ancient kingdom of Erebor is absolutely perfect.  This is followed by an Indiana Jones style climax that ends in a real cliffhanger that might irritate some.  For me it just means that the final movie, “The Hobbit: There And Back Again” will launch with an absolutely incredible action sequence.  Like “The Lord Of The Rings: The Two Towers”, “Desolation” does not really have a beginning or an end, but like that brilliant movie, it is definitely one hell of a middle."
    },
    {
      "rating": "10",
      "text": "I loved the first Hobbit and saw nothing wrong with it. The Desolation of Smaug is a masterpiece and makes the previous installment look like crap. Peter Jackson's interpretation of Middle earth seems to be more and more breathtaking every film. This could very well be one of the best movies in the saga."
    },
    {
      "rating": "9",
      "text": "The first one was one of those movies that you hated or only though was alright. Certain things about the first one was crappy as hell (CGI orcs). This one was completely on another level. Loved it from start to finish and the ending was perfect. The music at the end should win an Oscar, because it was awesome. There were a few flaws in it like the fact that Legolas had a bigger role and the length of the movie was just way too long...other than that I loved it. The fight scenes were top notch, it was funny, the dragon scene was amazing, etc."
    },
    {
      "rating": "10",
      "text": "This is 10 for  OMG this movie was so good. If you're looking for an adventure with wizards and dragons, it doesn't get better than this. Epic and well told in every way with an astute attention to detail. The script and casting are excellent with amusingly clever and thoughtful dialogue. There's romance abrewing as well. There were also scenes that had the whole audience rolling with laughter. I enjoyed this movie immensely."
    },
    {
      "rating": "10",
      "text": "This is a great movie that offers a good moment in cinema. It does not follow the book, but only the outline. Otherwise, the film is likely to be less attractive. 3D is very well done, this is not a film made for the 3d but it is very well done, it gives good effect to some time."
    },
    {
      "rating": "9",
      "text": "Although it does bother me how much they strayed from the source material (especially in regards to Legolas), I thoroughly enjoyed The Desolation of Smaug as a movie-going experience. As a film, it's action-packed, funny at times, and visually stunning.\rThe fight scenes were nothing short of incredible. Jackson was finally able to portray Legolas' agility in its full glory.\rAll around a very fun and gripping film."
    },
    {
      "rating": "9",
      "text": "Many people judge this movie for being to long and for adding in some extra scenes but to me that is a positive, cause now people who have read the book wont know everything that's coming up next. The action scenes are a lot better this time around especially the barrel scene."
    },
    {
      "rating": "0",
      "text": "I just cannot believe the downplaying of major characters, their complete omission in some cases and the addition of some of Peter Jackson's own invention. HE DID NOT WRITE THESE BOOKS! Therefore he has NO RIGHT to change them in this manner. Pivotal storyline changed and the timeline all screwed up! There's some 40 years between The Hobbit and LotR, this is establishing a much shorter timeline. I don't want to put spoilers in but seriously, he has destroyed Tolkeins legacy with this. Bilbo is as all Hobbits a innocent, that's why he DOES NOT keep the ring hidden. Gandalf suspects but until he investigates, he does not know for sure and Bilbo DOES NOT LIE!!!!!  Beorn had such a great role in the book, but thanks to PJ, he's just an illtempered giant, Im surprised he left him in at all. And the Barrel scene!?!?! OMG, can you be setting up the next water park ride for that stupid village in NZ?  The leap of faith is the fantasy world itself, but the aim of those barrels....SHEESH, I haven't seen aim like that since Liam shot every exploding barrel in France in \"Taken\", And this Michael Bay non stop CGI action?!?!?!?! WTF!!!!!! The last movie was Harry Potter, this one is Transformers. The Hobbit DID NOT get the Peter Jackson who did LotR, it got the King Kong crap artist! I apologize for the spoilers and the anger, but seriously, I am a huge fan of the books and a man spent his entire life sweating every detail of his world. This is not homage, this is pissing on his grave!"
    },
    {
      "rating": "9",
      "text": "Again Peter Jackson has managed to impress me. Firstly, a few niggles that I want to get off my chest. I keep seeing reviewers comparing the Hobbit trilogy with the Lord of the Rings. While this is logically understandable, it should by no means factor into the Hobbit trilogy reviews. Why? Because firstly the Hobbit and the Lord of the Rings have two distinctly different feels to them, both in terms of the movies and the books. The Hobbit is supposed to be more colorful, fantasy orientated and vivid than the later more darker Lord of the Rings.  And so it is saddening to see that people use the Lord of the Rings, despite the stark contrast in the concepts, as a benchmark/basis to justify low ratings.\r Which is why when I entered the cinema, and just as I sat down now to review this movie I try to dispel all the bias and judgments that may affect me beforehand. The Hobbit: The Desolation of Smaug was more exciting, action packed and energetic when compared to the first film, The Hobbit: An Unexpected Journey. While the first film served to introduce the characters, set the pace of the film and slowly familarise the audience; it was expected that  TDoS (The Desolation of Smaug) would quicken the tempo and pace, and by God it did just that! Fans of the first film will enjoy and welcome the countless fight scenes that are magical, well choreographed and don't feel over the top. If I had to pick one aspect of the film that I would of liked more, I probably would have liked to have seen more comical moments. Again, it is understandable why there were fewer comical laughs than the first film; mainly because of the quicker pace of the film, and the darker subplot; which meant that an excess of comedy would have made the sense of urgency prevalent throughout the film seem unrealistic.\r Benedict Cumberbatch as the voice of Smaug was brilliant. Sinister, yet somehow I found myself sympathising with the dragon when he retold his version of events that led to him occupying the Lonely Mountain.\r While the first film lacks action and pace, it ultimately reinforces the need for character introduction. While the second film lacks the slower pace of the first film, it is squashed by the sheer speed of which this film moves at. Even the introduction to the movie, felt as though a sense of urgency was needed. Again, this is not a negative considering the fact the film is based through the middle/second half of the book.\r Overall, brilliant film, didn't lose its way.... Slower in some scenes, but not necessary a bad aspect!\r 9/10."
    },
    {
      "rating": "9",
      "text": "This is like playing Skyrim but you are watching a movie. Mostly setup for the 3rd installment but has many clever twists and special effects. It reminded me of the newer Star Wars movies in a way. It was a very entertaining I have to admit. That is rather surprising since  I did not like the first Hobbit movie at all. This one brought me back and I will certainly be catching the last movie in the series."
    },
    {
      "rating": "9",
      "text": "Much better than the first and I didn't mind the first. I saw it in high-speed and 3d. Super well done but 2 things, the glasses are smaller than they used to be so you can see the rims which is distracting (but the crowd seems way cooler when the lights come up) and secondly the high-speed makes the production seem amateurish during the expositive scenes for some reason. So at the bar when they are talking it reminds me of a 80's British soap opera or a Canadian video production like Littlest Hobo. I think it exposes bad acting more. So a raised eyebrow by Gandalf looks kind of silly and deliberate or when Thorin notices bad guys it is super obvious like you can almost hear the director saying \"look that way, then that way...\". For the most part the action scenes are pretty spectacular, although at times somewhat video-gamey."
    },
    {
      "rating": "10",
      "text": "I think its a good movie, different than the lord of the ring but as good if you like middle-earth and a story that dont rush at all for action. I really like the action more than the first especially smaug and the barrel-ride. Legolas and Tauriel are nice add-on from book in my opinion. Not perfect but definitively a good movie\rCant wait to see it again and again....the third movie cant come soon enough. 9/10"
    },
    {
      "rating": "8",
      "text": "I'd say that this was equally as good as part 1 and that it definitely managed to keep me entertained. I really liked the cast and their performances. Martin Freeman once again fulfilled his role as Bilbo rather nicely. Ian Mckellen is getting old, but he still makes a great Gandalf. Orlando Bloom returns as Legolas and he's fun to watch. Needless to say, the best part is when Smaug finally arrives. Benedict Cumberbatch sounds better than ever as the voice behind Smaug. The action was also great and will likely please adults and children alike. Despite the film's lengthy run time and a cliffhanger ending that left me wanting more, it still delivers and not only met my expectations overall, but got me even more excited for part 3 next year!"
    },
    {
      "rating": "0",
      "text": "Except for the following;Bilbo,Gandalf,Beorn,Dwarf-names,Spiders,Elf-King,Barrels,Laketown,Bard,Master,Key,Smaug,Arkenstone and a few other words,this disgrace has little to do with the great mans work.For the only time in my entire life,as well as millions of others,I'm glad he is dead.This would have surely killed him to see.Pray Hollywood don't get their filthy hands on the Silmarillion..."
    },
    {
      "rating": "1",
      "text": "There's so many things wrong with this movie. It's incredibly bad. I hated the first movie. I hate this one more. Thankfully, I didn't spend a penny to see this garbage."
    },
    {
      "rating": "0",
      "text": "the hobbit is a  cliff hanger i hate these kinds of movies to be continued . it takes forever also dont buy it on dvd  . so i hope no this is the last one"
    },
    {
      "rating": "0",
      "text": "First off, as a movie relating to the books, it's terrible; beyond awful.  I mean seriously, Legolas and Tauriel (who should not even be there) literally stole the spotlight from Bilbo (keep in mind that the movie is called the HOBBIT), and further pushed a ultra-cheesy love story with Killi?  I mean seriously?!\r Second, as a movie itself, it is also awful.  The pacing is off once more, and the special effects just make the movie look fake.\r Congratulations Peter Jakcosn, aka the new George Lucas, for screwing up the prequels after making a brilliant LOTR Trilogy."
    },
    {
      "rating": "10",
      "text": "i loved this movie in many ways 1 the design of smaug 2 in the theaters the fire looked really cool. its much better then the first one. smaug is a big heat for the Movie"
    }
  ],
  "recommendations": [
    "the_chronicles_of_narnia_prince_caspian",
    "the_hobbit_an_unexpected_journey",
    "percy_jackson_sea_of_monsters",
    "the_hobbit_the_battle_of_the_five_armies",
    "maze_runner_the_scorch_trials",
    "the_golden_compass",
    "king_arthur_legend_of_the_sword",
    "the_twilight_saga_breaking_dawn_part_2",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "inferno",
    "the_maze_runner",
    "king_kong",
    "the_mortal_instruments_city_of_bones",
    "maze_runner_the_death_cure",
    "the_twilight_saga_new_moon",
    "the_twilight_saga_eclipse",
    "batman_v_superman_dawn_of_justice",
    "seventh_son",
    "poseidon",
    "avengers_age_of_ultron",
    "the_hunger_games",
    "i_am_legend",
    "ready_player_one",
    "eragon",
    "the_hunger_games_mockingjay_part_1"
  ]
}