{
  "id": 1810,
  "title": "The Lego Batman Movie",
  "starring": [
    "Will Arnett",
    "Zach Galifianakis"
  ],
  "runtime": 104,
  "genre": [
    "Animation",
    "Action",
    "Comedy",
    "Family"
  ],
  "description": "A cooler-than-ever Bruce Wayne must deal with the usual suspects as they plan to rule Gotham City, while discovering that he has accidentally adopted a teenage orphan who wishes to become his sidekick.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/snGwr2gag4Fcgx2OGmH9otl6ofW.jpg",
  "categories": {
    "plot": 7.362068965517241,
    "acting": 7.43859649122807,
    "ending": 8.125,
    "soundtrack": 5.0,
    "cinematography": 7.5,
    "familyFriendly": 7.576923076923077,
    "funny": 7.236363636363636,
    "action": 6.85
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Lego Batman creates even better animation than the original LEGO movie boasting with big star voice talents.  What it lacks is an interesting and grounded story. The script isn't funny or silly enough to be better than the original however it is still worth a watch."
    },
    {
      "rating": "8",
      "text": "The LEGO Batman Movie is not better that The LEGO Movie but is surprising very good. The humor is funny, the animation is fantastic and the characters are really interesting. The message is too obvious, but its really entreating for the Batman Fans and the LEGO fans."
    },
    {
      "rating": "9",
      "text": "The Lego Batman movie was great just like The Lego movie. Its got great action, humour, characters, and surprisingly even some emotional weight to it. Overall it is a fun and entertaining movie for kids and adults alike."
    },
    {
      "rating": "9",
      "text": "I have to admit that walking into the theater to see this movie i really felt like I was not sure what to expect from it cause I didn't really like the LEGO movie that much but however all my worries about the movie were put to rest I laughed out loud at least twice during the movie yes BATMAN is a little cocky at first but he learned a good lesson in having friends and family and the importance of team work and the matter that you don't have to be related to the people to consider them family"
    },
    {
      "rating": "9",
      "text": "The Lego Batman Movie: Seeing how \"The Lego Movie\" is one of my favorite films of all time, I went into \"Lego Batman\" with my expectations soaring, those expectations were met. Granted, I liked it less than \"The Lego Movie\" but I knew that would happen so I didn't hold that against the film. The animation was stunning, It was so fluent and colorful. The film was also very funny, It poked fun at not just Batman, but Superhero tropes and pop culture in general, I felt like this would be considered \"Deadpool\" for kids. The voice acting and cast were awesome, they worked so well off each other. My only flaw I could find with it was it wasn't as emotionally powerful as \"The Lego Movie\" not to say that the emotional moments were bad, just not as well done as \"The Lego Movie\". In the end \"The Lego Batman Movie\" gets A childhood memory that aged well/10. It was meant for kids and it's colorful but It can also be enjoyed by Adults and even inspire a few laughs."
    },
    {
      "rating": "7",
      "text": "You know DC f**ked up big time when a movie staring Lego figures started off a better cinematic universe than your live action movie.After the surprise that was \"The Lego Movie\", which was my favorite animated movie of 2014. So of course I was looking forward to this. When the team behind \"Morel Orel\" is directing your movie, it's going to be special. Now while I liked \"The Lego Movie\" a little more due to the writing and it's clever hidden message, but still.\"The Lego Batman Movie\" is the best Batman movie since \"The Dark Knight\" and that's saying a lot. With it's bright warm colors, fast peace, and some many pop culture references for its humor. There was even a Pulp Fiction reference that I'm not sure many picked up on. It's a movie for both kids and adults. All of the Lego movies have two things in common which is heart and team work. It's really smart and goes as far from being just a kids movie.Heck, I almost teared up at point. That's right folks, I nearly cried during a movie staring Lego's. Wow.Will Arnett as Batman might be my third favorite portrayal of the Caped Crusader. Just the voice, emotion swings, and his cocky attitude is basically Batman in a nutshell. While a funnier version, but also an interesting and compelling one. By focusing on family and the loneliness of Batman. The movie itself makes fun of Batman's history with Adam West and Schumacher movies, but also being somewhat respectful as well.And who would've thought Zach Galifianakis was going to be a solid Joker. Galifianakis was having a blast with this, but also putting his own take on the character as well. The Jokers evil plans in the movie are so absurd and silly that somehow fits. It's perfect for the relationship between him and Batman. Making it a anti-romantic spoof.All of the other cast all did a fantastic job. Michael Cera was great as Robin and had excellent chemistry with Will Arnett. Rosario Dawson was pretty good as Batgirl / Barbara Gordon. And Ralph Fiennes as Alfred was spot on, but kind of a wasted opportunity that he didn't reprise his role of Voldemort by voicing him, because Voldemort is in the movie. Oh well.The animation is both really stunning and gorgeous. It's impressive that they once again made it look like it's stop motion animation with the power of CG. You can see the little details that you won't catch on your first watch. The finger prints that are clearly seen on the characters and the movement you would see in stop motion. I'm just be glad it's not the cheap looking direct-to-video animation that every movie starring Lego has been doing.My only issue with \"Lego Batman Movie\" is the pacing. As I said before, there are some many pop culture references and all of them are funny, but the film goes by so quick it's easy to miss them. It doesn't give you much time to breath. So while your laughing at the joke, it will then make two or three more jokes. I literally wanted to say to the movie \"Please, slow down a bit\". But I can see this easily been fixed by re-watching it, which may help.Overall rating: Everything Is Batman!"
    },
    {
      "rating": "7",
      "text": "This is by far one of the more enjoyable super hero movies out today. While its no where near as good as The LEGO MOVIE. It still is a great blast for the family. If your a batman fan or a dc fan you will get a lot of enjoyable in jokes (while these don't take away from the movie it does add more enjoyableness). Kids will love it. That's really all you need to know."
    },
    {
      "rating": "7",
      "text": "Good film, but I have to say the lego movie is much better. The storyline of batman discovering his feelings is a bit overdone, which is ironic as it's batman who is denying his own feelings from the beginning. The action sequences are overly frenetic; there's simply too much going on too quickly for the viewer to follow. I had trouble figuring out what was going on half the time. As with the lego movie this film will bear repeated viewing, there are so many jokes going on it's difficult to take them all in."
    },
    {
      "rating": "7",
      "text": "Overall, pretty enjoyable. If you liked the first Lego movie, you'll like this one. The beginning is awesome, the end is great, the middle is a little slow, but overall a fun movie. I probably wouldn't say that you need to see this in theaters, but it would definitely be worth catching on Netflix."
    },
    {
      "rating": "8",
      "text": "Fast paced, frenetic, and kinetic, The Lego Batman Movie is another piece of product placement for Lego, Bed, Bath & Beyond, and Pennysaver, that works incredibly well. Though fast paced, it never annoys, while providing bright colors and fun sequences for the target child audience. But, in this spate of incredible energy, The Lego Batman Movie touches on important themes of teamwork, togetherness, and family, that should have a profound impact on children. For adults, the dirtier jokes and the constant fan service with Batman, and the critique of DC films (\"brooding\" as a Batman trait, mocking the premise of Suicide Squad) will more than provide enough entertainment. Above all, however, the film truly strikes a sweet spot from being self-referential and corny without slipping into becoming annoying a la last year's Deadpool. This is a self-aware superhero satire done right with funny jokes, good action, and tremendous animation.With Will Arnett anchoring the film with a hysterically selfish and narcissistic take on Batman, Arnett finds some great pieces to the character when he is not just spitting punch lines. Though the punch lines work, the film would tire quickly if it were just a barrage of jokes. Rather, via Batman, the film finds a heart akin to a Pixar film. Lonely and caught in a constant spiral of self-loathing that culminates with a new Batman film being released, the character lives a life of solitude. At times vulnerable, but always lashing out as a result of his inner anger, Arnett does well to play a man who is self-aware. He knows he is alone, but his vanity and pride do not allow him to admit it out loud. His obsession over his abs is vain, yes, but also heavily compensating for how inadequate of a person he feels like without a family to call his own. Though Alfred (Ralph Fiennes) is there for him, he is so blind for self-hatred, this point is lost on him. As a side bar, Fiennes is a brilliant selection for Alfred and does tremendously in the role.Though the film explains its themes of loneliness, family, and teamwork with no subtlety, it never feels preachy because it is a kids movie. Though the parents get it, the kids do need Ellie Kemper's Phyllis, guardian of the Phantom Zone, the explain to us what makes people good or bad and how people can change. On-the-nose, the film never suffers or feels hokey, rather it is a good time for the adults to calm down and relax from the frenetic pace of the film.The frenetic pace of the film is not a constant though. Some of the best scenes in the film are ones highlighting Batman's loneliness. An extended shot that has to be somewhere near a minute long or more (a lifetime in this film) of Batman just sitting in his indoor pool eating lobster is absolutely hysterical. Him warming up the lobster and getting his mail also hits comedy highs for its critique of the mundanity of life. It highlights just how plain his life is, but makes him so relatable to the audience and shows that, no matter who you are, the Pennysaver winds up in the mailbox and you always hit the wrong numbers on the microwave the first time. The simple comedy of this film is a pleasure to watch unfold and, though not revolutionary, it is incredible fun and really works in the film with great comedic delivery and director Chris McKay willing to take his time with jokes.That said, the film's most fervent energy comes into the form of constant references. A who's who of properties that Warner Bros or Lego have their hands in with villains coming left, right, and center, from the 80s, 90s, and 00s, the film is a nerd's dream. Much of the hilarity comes the sheer number of villains introduced - both from Batman's world and others - as well as those that are not real, but included anyways as a punchline. Again, very simple humor, but it is great service to the adults in the crowd who will get the references and enjoy seeing them portrayed in this format.Plot-wise, the film is in service of its themes. Naturally, one must fail on their own to realize they need help. Yet, the film's interesting action in Arkham Asylum and the city of Gotham, as well as an interesting take on the \"end the world\" desire of villains of all kinds, the film finds great entertainment from its storyline. It may not be revolutionary, but director Chris McKay does a great job capturing the action and finding innovative ways to utilize the use of legos in the battle and in the aftermath of action sequences (fire). Interestingly, the film also shows the need for evil as the presence of evil ensures the rise of good to overcome evil. In this way, the character of the Joker (Zach Galifianakis) is used incredibly well and his actions in regards to the plot work incredibly well with this recurring theme.Featuring a stellar voice cast, The Lego Batman Movie is a terrifically animated affair that is pure energy."
    },
    {
      "rating": "8",
      "text": "\"The LEGO Batman Movie\" is yet another win for Warner Animation's 'LEGO' franchise, with the film's talented voice cast and general sense of self-awareness ultimately filling out the top reasons as to why any self-respecting Batman movie fan, comic-book movie fan, or simple movie fan should at least enjoy it. Like it's 2014 predecessor, \"LEGO Batman's\" rapid-fire-style humor and emotional underpinnings ultimately make this an enjoyable watch as it is. But the stellar animation and effects most certainly don't hurt it either. And, though, it could have used a joke pass or two to smooth out some of the flatter moments of humor, boy does this movie still leave its mark and then some."
    },
    {
      "rating": "9",
      "text": "I loved this movie. So much fun. Very humorous. Strong voice acting. Features from Voldemort, Daleks, and many other evil characters. Honestly, if you want to enjoy this movie you will love it."
    },
    {
      "rating": "8",
      "text": "The Lego Batman Movie was a fun-filled family adventure chock full of laughs from start to finish.  They even managed to center the story line upon a great life lesson, that friends are family."
    },
    {
      "rating": "8",
      "text": "I really enjoyed \"The Lego Movie\" when I saw it when it first came out three years ago,  but personally, I found this film to be a bit funnier even. Will Arnett once again perfectly lends his voice to the titular character. Other supporting voice talents include the likes of Zach Galifianakis as the Joker, Michael Cera as Robin, Ralph Fiennes as Alfred, etc., all of whom perfectly add further charm and fun to the film! In addition, the film brilliantly pokes fun at itself and the overall character of Batman almost non-stop... and it's surprisingly hilarious often times as a result! Overall, much like its titular character, it might not be quite as original or ambitious as \"The Lego Movie\", but it does do a near-perfect job of taking a character almost everyone knows and loves and giving him his most colorful, fun, and downright wildest movie yet, which was certainly enough to satisfy me, as I'm sure it will satisfy many other fans as well."
    },
    {
      "rating": "10",
      "text": "Related media: The film uses the styles and is a follow up to The Lego Movie. It also refers back to past Batman films, TV shows and comics.>What's it like?: Batman is imperious in his defeat of his enemies, including The Joker, but he does have one big weakness - his individualism - and The Joker exploit this in his plan to destroy Gotham.>Pros:>1. The film tackles one aspect of the Batman story that has not been looked into in all of the past Batman films in a significant way. It is his individualism and his arrogance. Doing so makes this film very fresh and original. Even the trailers are very interesting!>2. Taking a page from Deadpool, the jokes start at the very beginning. No! Even earlier than that! Even before the Warner Bros. logo is revealed! Now that shows great effort! The jokes continue until the very end, with the final song that is similar in tone to the Everything is Awesome song from The Lego Movie. There is no mid- or post-credit scene though.>3. There are numerous jokes on Batman, Batman's incarnations in all the previous films and TV series, Bruce Wayne, Robin, Alfred, The Joker, Superman, The Justice League, The Phanthom Zone, The Wayne Mansion, The Batcave, etc., that harks back to what we knew of them already, yet opens up new possibilities into the characters and props. >4. I prefer this film over The Lego Movie. I think that the animation here has fewer distracting flashing lights, there are more jokes, and there isn't the live action part at the end of The Lego Movie that slows that film down.>Cons: No significant cons.>How would the different age groups rate it?Children: ExcellentTeenagers: ExcellentYoung adults: ExcellentMedium age adults: ExcellentOld adults: Good.>My rating: 5/5 (no half scores). Watch it in the cinemas and buy the DVD."
    },
    {
      "rating": "9",
      "text": "This time it's actually a good thing to say that a movie is a lot like its predecessor. I thought that The Lego Movie was excellent, and I thought that this movie was excellent too! The animation is gorgeous and colorful, the movie is filled with jokes that really hit most of the time and the action is amazing, and Batman works pretty much perfectly as a Lego character."
    },
    {
      "rating": "7",
      "text": "Whilst not on the level of the original Lego Movie, the Lego Batman is still brings the universe to life in wonderful new ways. The dynamic between the Joker and Batman, whilst somewhat predictable, is charming from start to finish. The introduction of new characters and universes is done with perfection."
    },
    {
      "rating": "8",
      "text": "DC Extended Universe & Batman's Highly-Polished Ascension.The Bat-Man/Bruce Wayne—created by Bob Kane and Bill Finger, DC Comics member, and regular sentinel of Gotham City—, the esoteric nocturnal hero and philanthropist multimillionaire, has appropriated immeasurable designs, natures, dimensions and idiosyncrasies, from his roots in «The Case of the Chemical Syndicate» of Detective Comics #27 (1939) to his neo-appearance in Batman V Superman.Despite his initial salutations to the small or big screen were not entirely effective, his eruptive pinnacle ran from the pencil and the paper, comics which years later serve as required look for any tiny brilliant mind that longs to represent in a celluloid to the bleak superman without superpowers.Finite have been those who have portrayed his being truthfully, some with more artistic fate than others, with the general objective that the dark knight is globally singled out by his impenetrably complex and individualist moral, a man darkly martyred as a result of a fateful infancy.Nevertheless, LEGO, Danish line of plastic construction toys, which ventured into the cinematic market a few years ago, elaborated a subversive and radically antithetical transformation of that guy from Gotham contused of pompous manner; its version is critically fun, erratic and empathic, causing a partially unused aspect in the world of superhero movies.  First, we are going to contextualize. It all started in 2014, the period in which Warner Bros.commended in the hands of, at that time, newcomers Phil Lord and Christopher Miller, an avid and daring ambition focused on LEGO playful construction toys. Luckily, it proved to be an unsuspected and festive strangeness, encountering us in front of an animation vehemently divergent from Pixar's or Dreamworks' works and a jaunty exclusive nature, which allowed our star character, his pertinent and unprecedented spin-off. So once again, they have hit the nail on the head, considering that the filmmakers do not enclose their aspirations within the vast editorial catalog of characters which they treasure, but that they redouble the desires doing to parade characters from other franchises such as \"Harry Potter\" (Voldemort) or even apocalyptic primate \"King Kong\".The Dark Knight, The Caped Crusader, The World's Greatest Detective, Bats, The Bat or simply Batman is an individual who works and lives alone on the basis of his preconceived general statutes. He coexists behind the shadows of his alter ego: Bruce Wayne, who, rationally, also saves the world on an individual basis and without any vestige of changing his ways of thinking or acting. However, when he circumstantially adopts Dick Grayson, will be faced to forsake his existential ideologies and aphorisms in order to take it upon himself to bring him up, instruct him and convert him into his personal co-worker Robin. On the way, only a few are designated for adorning and supplying personality to the storyline; Barbara Gordon and his conservative butler Alfred Pennyworth will have to overcome the dodge manufactured by the fateful Clown Prince and all his clan of subordinates, which commonly threaten to the full extinction of the human race, nevertheless, this time goes much beyond.It's difficult to believe that the singular film comes out minutely unscathed, having in its writing the bizarre amount of ten screenwriters, and though four of them set up Batman's (Will Arnett) and Superman's (Channing Tatum) brand new identities, that mishmash of ideas could have developed a creative incontinence which would finish with the absolute collapse of the product, but nonetheless, here, ten heads think better than one, and in a fabulous way.Although visual gags (slapstick), jokes and self-references are quite and even excessive, exactly that is what it is all about, presenting a fable with atypical and self-parodic touches exhorting contemporary society from macabre politicians, self-centered celebrities and barbarian conflagrations, a world where good and evil are so laughable to provoke a reaction and an understanding of our existential one-sided basis: love.Hence the script of these men is utterly about human affections; accepting that each human must open its heart understanding that each of them reason singly, assimilating their reasonings, respect and go forward, and support each other. It's more than a concomitant pop-culture product, is an evident social criticism requiring of compression within every child and adult who attend a movie theater. Pushing into the background a prudent analysis about soundtracks, dubbing or ideal characters, ethics and human morality are what take precedence; and although this specific vision will be merely appreciably for those who generate an abstract reading of the film, Hollywood, the fabulous cinematic monster, did not provide a work of such high-minded dimensions in a long time. This is the film we need, it's a must-see animated motion picture."
    },
    {
      "rating": "8",
      "text": "\"The Lego Batman Movie\" was a funny movie, and very good, Lego returned to the attack now with Batman, the performances are good, the animation was good, and the message it conveys was incredible."
    },
    {
      "rating": "8",
      "text": "Who: Michael Cera, BoJack Horseman, Voldemort, Voldemort's Voice Actor, and NOT all of the other people who played Batman before (which I could have sworn the Lego people promised us)What: The most loving Batman parody of all timeWhere: Lego Gotham CityWhen (Can I watch again): Whenever you need to be reminded Batman is a GREAT versatile character no matter what Ben Affleck will have you believe.Why: This movie is genuine fun for all ages. Batman fans will especially get a kick of all the stellar references."
    },
    {
      "rating": "8",
      "text": "The LEGO Batman Movie was almost going to be the next 'Deadpool',but with all the gags and jokes,it's still a good flick. The animation looks stunning as always, there are plenty of morals (like teamwork, friendship, family etc.) as well as easter eggs and cameos. The only flaw i had for the movie were the jokes. The movie is so fast that there are plenty of jokes, some of them are funny and some were 'meh'. And, like 'Storks', it has an emotional ending that will probably drop a tear or two. In the end, The LEGO Batman Movie doesn't have the laughs or the emotion of The LEGO Movie, but it's still an enjoyable movie that has some potential to be the best Batman movie since 'The Dark Knight'."
    },
    {
      "rating": "7",
      "text": "Normally one would think that the idea of making an entire movie about Batman a comedy would not be effective in this day and age where apparantely DC comics wants all the properties to be dark and gritty, but this holds surprinsingly well. It pays homage to every Batman TV or movie apperance, and has some funny lines and creative ideas throughout its runtime, and adresses some deep themes here and there too. While nothing super or incredible, it's a solid effort with talented voice actors and good humor in its majority. So in conclusion, nothing really remarcable, but enough good moments to justify see it once. Recommended for people who like the Lego movies and games, and for anyone to have a fun short time with friends, just don't go with too high a bar, or unreallistic ideas."
    },
    {
      "rating": "8",
      "text": "The Lego batman movie is one of the most entertaining movies of 2017 so far. The animation is very impressive as everything looks nice and colorful, and the movement works well. The characters all have something to like about them, with very funny humor added to make them more charming. The acting is pretty solid, the dialogue is funny, and lots of funny pop-culture references are thrown around in this movie. Some scenes feel very fastly paced, and some moments made me wish the movie was a little bit longer. The Lego Batman Movie is a very entertaining movie for kids and fans of Batman, and I would recommend giving this a watch."
    },
    {
      "rating": "7",
      "text": "The LEGO Batman Movie was released in 2017 and was directed by Chris McKay. It is a spin-off of the 2014 film The Lego Movie and explores the character of Batman introduced in that film, showcasing his sense of humour but also his loneliness.Evident from the trailers, this movie has fantastic humour and is one of the first films in a while that has got me laughing, but this time not laughing AT the movie (I've done that more times than I care to count recently). What I love about the film is that it knows exactly what it wants to be and also isn't afraid to make fun of Batman's pop culture history, no matter how recent which proves that this film definitely had some clever minds behind it.Will Arnett's portrayal of Batman is (and I'm not joking) probably the best I have seen since Michael Keaton in Tim Burton's Batman films (I'm excluding Kevin Conroy as he hasn't appeared in big-budget Batman films made for cinema). His constant use of sarcasm was easily the best part of his character and was constantly funny and it also never got old either. The character had already previously appeared in The Lego Movie but this movie really explored him in an entertaining but also involving way too.The side-characters were plain fantastic to see; Robin always puts a smile on the audience's face, Barbara Gordon's character was well-done and also the route they went with The Joker was interesting albeit amusing too and made him a proper character as I feared from the trailers that he may have turned out to be a bland villain which thankfully he didn't.As with the original Lego Movie, the animation is great and is very visually appealing; it's made to look like stop-motion animation and it genuinely does feel like it is all of the time even though it is CGI. All of the action sequences were very fun to watch with the wide range of colours and effects too.An issue one could have with the film is that it does follow a very similar plot to the original Lego Movie but with all of the great characters and humour it honestly didn't bother me at all and I was constantly invested in the film. I also found this plot to be more consistant too, with the original Lego Movie plot feeling a bit all-over-the-place for me (although most of it was tied up at the end) with lots of locations which I kind of felt were a bit unnecessary. However, this film thankfully kept within the boundaries I wanted it to.While this film does have its comedic and satirical tone, it also did have a heartfelt side which I was expecting because the original Lego Movie did too and it was done very well. It was great to see how well it delivered all of the messages that it wanted to and also explored some themes which could seem complex but in a simple, friendly way. You may think that I loved this portrayal of Batman purely because of the satirical nature of the character but there was much more to the character which was handled surprisingly much more effectively than in plenty of the recent Batman films.Overall, this was a great film to start 2017 and one that thankfully didn't disappoint. The humour is on-point and constantly hilarious and the character of Batman is possibly one of my favourite portrayals of the character in any media to-date, no joke. I was pleased to see that there was more to the film than just the humour and how well balanced the two aspects were and ultimately made a very entertaining experience. I would definitely recommend this film and is easily one of the best animated films of recent years.7.9/10I can't stop watching the trailers. Help"
    },
    {
      "rating": "8",
      "text": "Funny, but not hilarious.  I enjoyed \"The Lego Movie\" more because of the clever jokes and satire.  Not enough of that in this film, which disappointed me because I'm a huge Batman fan.  This is definitely a kids movie."
    },
    {
      "rating": "7",
      "text": "This film was almost as good as the lego movie and had good humour throughout. It wasn't attempting to be spectacular but just a fun film, and i think it completely hit its mark"
    },
    {
      "rating": "8",
      "text": "The Lego Batman Movie does what no animation movie has ever done in the past six months. They actually made Batman actually funny and entertaining in his Lego form. While it is true that this Batman installment won't win against \"The Dark Knight\" in terms of moviegoing, it is as a pack of different opinions one of the best movies focusing on a DC character since the theatrical release of \"The Dark Knight Rises\"."
    },
    {
      "rating": "7",
      "text": "IF you are youtuber and  hear about channel name \" how it should have end (HISHE)\" then this movie is exactly what HISHE look like when it turn into 1 hour movie. Really funny film with ton of references And bat pun will make you laugh your ass off. Although Lego  Batman might hard to watch for fresh new audience who have no clues about those referernces if they not a hard core fan of batman series"
    },
    {
      "rating": "9",
      "text": "Preferred the original Lego Movie, but this one doesn't miss by much. Maintains the excellent use of rapid-fire jokes, while maintaining heart. Also, liked all the meta-references. There's a reason the commercials don't reveal the Joker's master plan and you'll be pleasantly surprised."
    },
    {
      "rating": "9",
      "text": "When I walked out of the theater with my friend I said out loud \"Dude what the **** did we just watch.\" This movie was amazing and being a fan of Batman it kinda dissapointed me with some parts which is why it doesn't get a 10 I also liked the idea of the dark knight facing a near impossible challenge like Dalleks and Godzilla, King Kong, and ****ING Sauron (I don't know how to spell his name) just please watch this movie"
    },
    {
      "rating": "8",
      "text": "The Lego Batman Movie continues the Lego Movie franchise's success with yet another fast-paced blast! The action is exciting, the animation is spectacular and, perhaps most of all, the film is hilarious! The in-jokes of Batman lore, DC and even other movies are clever and very rarely don't hit their mark. What a way to kick off the 2017 blockbusters! Everything is still awesome with Lego."
    },
    {
      "rating": "4",
      "text": "Batman proved so popular in the previous Lego movie, that he returns with his own…on his own…all alone. Can he learn to work with others to save Gotham from the Joker? Other than a different plot, this is pretty much like the original. The visual style is cluttered, none of the characters are particularly memorable, the jokes are often bad and the many chases are lively but unfocused.  The energetic approach should please young viewers, but I didn't care much for the original and found this one even less amusing or inventive."
    },
    {
      "rating": "9",
      "text": "Magnificent. This is a joyful celebration of the caped crusader, with Arnett giving us the best incarnation of Batman since The Dark Knight. Absolutely saturated with in-jokes and homages, and with a script that revels in self deprecating humour, this is a thoroughly delightful experience that masterfully delivers an exceptional addition to the DC universe. The characters are charming, the visuals are captivating, and the storyline remains wonderfully true to the Lego ethos whilst delivering an epic Batman v. Joker showdown that is sure to keep you enthralled. A brilliantly fun family film. 9.33/10"
    },
    {
      "rating": "4",
      "text": "Seriously overrated this one. The first half of the movie is a bore-fest and the second half continues in the same way. If it wasn't for my kids I wouldn't have waited to see the second half which would have been a shave because the last 15 minutes are actually pretty good. Still overall I wouldn't recommend this movie to anyone with kids over 8, save your bucks for the upcoming smurfs movie which will be hard pressed to do worse than this one."
    },
    {
      "rating": "9",
      "text": "This fun and silly movie gets Batman more than any representation of Batman has since at least The Dark Knight. It has a deep understanding of the character's history, how he has been portrayed over the last 80 or so years, and how current Bat-fans tend to view the character. However, this isn't some reverent awe-struck superhero flick. The Lego Batman Movie takes all of this and creates a spot-on meta commentary that mercilessly deconstructs The Bat, his fans, and his recent films. This isn't really shocking given the MO of The Lego Movie and of Robot Chicken where director Chris McKay worked for years. What is surprising though is how the film uses all of this commentary and deconstruction as the basis for a plot with an actual emotional through-line that creates a convincing argument for how future Batfilms should move forward. The film poses the bold idea that maybe Batman doesn't have to be a man-child wish fulfilment character still brooding over a trauma decades in the past, unable to connect with others. The film suggests that maybe he could be a fun character with friends who does what is right not for himself or to ease his own pain but instead to protect those he loves and because he loves his city. Also, this film has surprisingly great action direction, a great voice cast and possibly the best score of 2017 so far. I guess what I'm saying here is, go check this thing out. It is totally worth your time, especially if you are a Batfan. I'm giving it a 9 only because there is a slight sag in pacing right before the big climax but, in the grand scheme of things, it's a minor quibble in what is an otherwise superior film."
    },
    {
      "rating": "5",
      "text": "It put me to sleep... Maybe because i was tired, wait no it was 7:40pm showtime... It just didn't do it for me... it wasn't as good the LEGO movie...."
    },
    {
      "rating": "10",
      "text": "This was everything I ever hoped it would be and more. Hilarious, exciting, moving and wildly inventive. TLBM is the potential of the superhero movie fully realised. I think I genuinely LOVE this film."
    },
    {
      "rating": "3",
      "text": "Terrible. Watch something else instead of putting up with the terrible portrayal of Batman that casts him as an all-round **** Treat your family to a good book, in fact. They'll thank you for it."
    },
    {
      "rating": "6",
      "text": "Very funny for the first half, then descends into generic action.  The plot is very simple.  It's alright, but not a classic like the original Lego Movie."
    },
    {
      "rating": "5",
      "text": "Never a good sign when there are like 15 writers in the credits for an animated movie.  The movie had some good moments, but ultimately felt half baked and should have been a direct to video release.  Overall story was pretty weak.  My kids loved it, but it is no where near as good as The Lego movie, which had a way better flow while juggling 9 zillion characters."
    },
    {
      "rating": "7",
      "text": "I think this film was very great for family enjoyment. It is just like the Lego Movie, fun and entertaining. The LEGO Batman Movie had everything I was looking for. Will Arnett was funny. The cast came together to make a great film for all ages."
    },
    {
      "rating": "6",
      "text": "It happened last year in Deadpool, and now The LEGO Batman Movie does the same basic shindig: as the opening credits come up, Will Arnett speaks in his bat-voice, mocking the clichés utilized by the logo format. Then once the official story starts, the title character introduces himself… in LEGO form! Looks like we’re in for yet another wild mockery of heroism!Robot Chicken regular Chris McKay recreates the classic bat fun from both yesterday and today with explosively wild fight sequences and its own vocabulary of slang. Best of all, you don’t have to follow the bat-franchise to pick up the laughs aplenty; many jokes stem off “first world problems” such as waiting for food to heat up. Past the big bad bat’s self-absorbed nature, his little “irks” are hilariously relatable.All the caped crusader’s misadventures are guaranteed to trigger cheers from fans of the franchise as well as newcomers. Right from the first several minutes he takes on his baddest foe forever, (no not Superman) the Joker. He basically breaks the clown’s heart by telling him their enemy-ship means nothing to him, and he then goes straight to basking in the praise of Gotham. Everything else afterward both pokes fun at Batman’s old days and brings in every- literally every baddie he has ever had to fight (including the Condiment King!) over his near-eighty year existence.This new type of Batman behaves differently from the interpretations by West, Keaton, Kilmer, Clooney, Bale, and Affleck. He spends his free time eating microwaved lobster in the middle of a swimming pool and laughing at emotional scenes in romantic comedies including Jerry Maguire. (Yes, there are live-action films in the LEGO world; it makes no sense but who cares?) Then while out in the crowd under his cowl, he gloats about his abdominal “nine-pack”. While out of the suit as Bruce Wayne, anyone ought to feel stupid for not recognizing his egocentric personality. Normally, nobody would want to know him personally, but Will Arnett’s vocal performance as the Dark Knight is easy to love!The LEGO Movie was a big, unexpected surprise three years ago, and now the same LEGO universe gets an expansion with the same style of humor, except with Gotham now in the mix—a nine-year-old’s dream come true! The creative world designed off real LEGO bricks still brings out the same feel of playing with LEGO bricks at a young age, but now, not nearly enough creativity plays off the first movie’s celebrated concept. Heck, several of the smoke clouds and water floods are not even made of LEGO bricks! Bummer!Although the familiar joke a millisecond style of humor remains unscathed, which could turn away those who didn’t enjoy the first movie for that very reason. If you are overwhelmed by briskly paced dialogue and complementing loud colors, then don’t bother with such a franchise.At least it means The LEGO Batman Movie tries to be as far away from the overly serious character we’ve seen in the last few movies, and the given circumstances fit the cheesy nonsensical nature, more so than what Schumacher succumbed us to. The tiny LEGO universe stands out from all recreations of the famous crime fighter with its traditionally altered set of role models: the publicly praised heroes are actually bad guys in another way, and the publicly condemned villains have a means of becoming heroes in their own right. I mean, it makes the shoe fit, right? With his black, scary cowl, large cape, hoarse voice, and habit of bullying others, shouldn’t we consider Batman a villain? Maybe his new burden *ahem* responsibility of taking custody of orphan Dick Grayson to help stop the Joker’s evil plan will change things.Sure enough, LEGO Batman has no choice other than let his new adoptive son don a racially offensive Rastafari costume, name himself “Robin,” and fight against all the great pop culture baddies including Voldemort and Sauron. Against his wishes, Batman cannot fight alone: he needs all the help he can get to send these villains back to the “Phantom Zone” (which is an extra-dimensional prison for bad guys) they came from, or else risk Gotham splitting in half, exposing the bottomless abyss underneath.Overall, if you walk into The LEGO Batman Movie expecting a serious toned town character study, look elsewhere. If you go in expecting a smartly written love letter to the Dark Knight, one to tug on your heartstrings and bring back your inner child, tears of amazement are a guarantee."
    },
    {
      "rating": "0",
      "text": "Oh boy were those critics wrong here, and I'll also never ever see a film produced by, bleh, I just threw up in my mouth, Steve Mnuchin, current Treas. Sec. and the foreclosure king, good grief!  I didn't know that Wall Street real estate gurus were now getting into film production and might be part the reason films are getting so BAD.  The trailer consists of the only funny moments here, if you can even call them that, and the rest of the film is so overly long and obnoxious that you will literally lower your poor child's IQ level if you take them to it.  The Trump theme of going it alone to fight bad guys is the only theme here, and a hackneyed one at that.  A DAWG of the year, really really bad !!!"
    },
    {
      "rating": "5",
      "text": "Starts off well, but quickly devolves to childish humor and a pretty basic script that is more in-line with a Michael Bay movie (so a very basic script).  So even with Batman in the central role, this is far inferior to The Lego Movie, even though it copies many of it's aspects.  The ending was dissapointing and utterly silly, with logic only a child could accept."
    },
    {
      "rating": "0",
      "text": "As a children's film, The Lego Batman movie seems to appeal mostly to adults, which isn't surprising considering its generic pileup of references to other media. Much of the humor comes from changing the personality of Batman altogether. Scenes change so rapidly, the director must have a short attention span. The voice cast is terrible; it's as if they chose people based on their star power alone. Compared to The Lego Movie, it's a letdown, and compared to any other Batman film, it's a disaster."
    },
    {
      "rating": "9",
      "text": "It recaptures the non-stop, off-the-wall sense of humor and surprising heart of The Lego Movie, while this time making things more Batman-centric. One can expect to find plenty of laughs, a great message, and a surprisingly intricate look at the complexities of the Batman character in ways other movies about the character just haven't. Who would've thought a kids movie would be the one to examine the effects Batman's past tragedies have had on the character and the way his self-destructive life style blurs the lines between hero and villain. It's the most mature and meaningful bit of Bat-fiction in years, and it's been brought to life with animated Legos and family-friendly humor. The animation style is still really interesting. The screen does regularly get cluttered, making it hard to keep track of what's going on during some of it's larger action scenes. The voice cast is phenomenal and I loved the new takes on classic characters. There are also plenty of nods to Batman's long history in both comics, TV shows, movies, and much more. The amount of obscure Batman villains alone is sure to bring a smile to the face of any longtime Batman fan and excite the imaginations and interest of those who haven't heard of them.The story is simply great. It shows us Batman's relationships (or lack thereof) with the heroes and villains around him and asks the question of whether or not he can ever open up his heart and find a family. The humor is spot-on. The jokes come at you in a near-constant stream of hilarity. It tackles a wide variety of humor and always comes out on top. A perfect movie for Batman fans of any age. Don't make this mistake of missing out of this because it's \"made for kids.\" There's something here for everybody because it is so deceptively deep. Deeper than pretty much any other movie about the character with maybe the exception of the Nolan trilogy. What could have been a simple cash-in on both Batman and the masterful first movie is instead an incredibly well-made follow up that does the character and the newly arriving Lego Movie franchise a great service. Like the first Lego Movie, this is simply not to be skipped.9.3/10"
    },
    {
      "rating": "4",
      "text": "The movie has its moments.  From sweeping action sequences that remind us of hundreds of other dark crusader incarnations to a Mad Max-esque Hans Zimmer-ish musical backdrop (the guy works in the same office as Mr. Gladiator himself and is known as Lorne Balfe, previous work quite unknown) to beautiful, seemingly hand-crafted (seemingly) animation to... sappy emotional scenes? You heard right: the movie is unnecesarily ground to a screeching halt while Batman's familial isolationism is explored.  And why do we care about this? Oh, right, we don't.  Batman movies are about one thing: brooding action, music, and memorable villains (plus neat vehicles).  Lego movies, games, and shows are about.. cute comedy.  So how in the world did emotional bonding get thrown in this blender? 6/10"
    },
    {
      "rating": "7",
      "text": "It is good. Certainly not great, but good. It has a lot of good humor, (and plenty of jokes the kids will not get for years) but still, it is a very good movie."
    },
    {
      "rating": "8",
      "text": "With how much I loved \"The LEGO Movie,\" I was definitely excited when I heard that Batman, one of the first film's funniest characters, was going to get his own film. Having finally seen it, I was definitely entertained, but I felt there were a few flaws. Sure, the animation was great, the writing was solid and the film as a whole was clever and packed with fun references, but the film was nearly as charming as the first, and considering that this film didn't really use the \"LEGO\" part nearly as well as the first one did, I think it could've easily worked as a differently styled \"Batman\" film without the \"LEGO\" part. In some ways, I feel like the \"LEGO\" thing was merely a means to cash in on Batman's popularity. Even so, it's definitely an entertaining cash-in, and I would definitely suggest giving it a look."
    },
    {
      "rating": "7",
      "text": "Funny, moving, and animated well, The LEGO Batman Movie is a solid animated film as well as a solid Batman film that deals with themes such as loneliness and family with aplomb."
    }
  ],
  "recommendations": [
    "the_lego_ninjago_movie",
    "the_lego_movie_2_the_second_part",
    "penguins_of_madagascar",
    "thor_ragnarok",
    "hotel_transylvania_3_summer_vacation",
    "madagascar_escape_2_africa",
    "kung_fu_panda_2",
    "spider_man_into_the_spider_verse",
    "big_hero_6",
    "incredibles_2",
    "despicable_me_2",
    "my_little_pony_the_movie",
    "kung_fu_panda_3",
    "rango",
    "shazam",
    "the_croods",
    "guardians_of_the_galaxy",
    "puss_in_boots_the_last_wish",
    "indiana_jones_and_the_temple_of_doom",
    "shaun_the_sheep_movie",
    "hotel_transylvania_2",
    "the_lego_movie",
    "dumbo",
    "how_to_train_your_dragon_2",
    "onward"
  ]
}