{
  "id": 2269,
  "title": "The 6th Day",
  "starring": [
    "Arnold Schwarzenegger",
    "Michael Rapaport"
  ],
  "runtime": 123,
  "genre": [
    "Science Fiction",
    "Action",
    "Mystery"
  ],
  "description": "A world of the very near future in which cattle, fish, and even the family pet can be cloned. But cloning humans is illegal - that is until family man Adam Gibson (Arnold Schwarzenegger) comes home from work one day to find a clone has replaced him. Taken from his family and plunged into a sinister world he doesn't understand, Gibson must not only save himself from the assassins who must destroy him to protect their secret, but uncover who and what is behind the horrible things happening to him.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oKtQLgBXiC0UOT8d33yJMYYm34Z.jpg",
  "categories": {
    "plot": 6.222222222222222,
    "acting": 4.333333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 8.0,
    "action": 4.333333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A very underrated Arnold film. A timely story (for the time). Very good story. Less action, and more story than a usual action film. Good fx. Very good supporting cast."
    },
    {
      "rating": "6",
      "text": "OK, so I have heard of this one so I thought I was gonna check it out and I enjoyed it but not one of the best films I've seen but it does has some awesome action but not on the high note. Let me explain: On the 6th day, God created man (as you can tell by the tagline). \"God created man in His own image, and behold, it was very good. And the evening and the morning were the sixth day.\" Cloning humans and animals are acceptable. However, cloning is illegal and forbidden now. Adam Gibson played by Arnold Schwarzenegger is going on a skiing trip with his friend, Hank played by Michael Rapaport, then he goes to the \"RePet\" store not only to get Oliver cloned 'cause he died but to get a SimPal doll named Cindy for her daughter. When Adam got home, he discovers that not only Oliver was cloned but much worse, Adam himself was cloned and he's with his family. Four Replacement Technologies security agents arrive to kill him but he escapes, stole his cadillac and the chase is on. When those bad guys are dead they get cloned and if they see him with his family, they'll be killed. So now it's up to Adam to clear his name, protect his family and defeat the cloning baddies. Okay, okay, okay, so I have to get to the point where I share my opinion on The 6th Day. This is truly a generic, generic action film but it is enjoyable for the most part. The concept of this is pure genius and intriguing but disturbing, no way! But it was poorly executed by it's cheesiness and bad acting. Don't get me wrong, what's really surprising is that two Arnold Schwarzenegger's met together and now they team up to stop the cloning. I saw the commercials of \"RePet\" from the Special Features. Two of them to be exact. I think the reason for this is because they wanted to be in the film for the \"RePet\" store scene. I will say for one thing that Tony Goldwyn was such a letdown in this film. Really hated his character, didn't really represent anything and overall his character is quite boring and what I found out is that he's been dead for years and now he's being cloned. This would've been an awesome film if it weren't for the poor acting from both especially from Arnold Schwarzenegger and the clone and the cheesy dialogue but it does have some thought-provoking ideas with the illegal cloning. Gee, I wish smoking can be illegal so that people don't get cancer. Don't expect too much from this movie, it wasn't anything special but it was enjoyable for what it is. I don't hate it, I liked it for what it was, it was an okay film. Not one of Arnold's best and not as good as one of his previous films in the past."
    },
    {
      "rating": "7",
      "text": "The story is very interesting and the movie shows many interesting problems, thats the biggest strength of the movie. Also the setting in the future is good. The action scenes were more or less realistic, not exaggerated, like in some Arnie movies. The whole movie reminds a bit to Total Recall which was a great one. But here I noticed some cheap scenes, because some of them revealed how bad Arnie is an actor. Also Tony Goldwin as Mr. Drucker doesnt fit to his role as a CEO of a big corporation, he is too young and his acting skills were also low. And did you notice the feminist elements in the beginning? No use of fighting with a woman, they always win? Yes, sure with a wall.A good movie in my view, I am wondered, why it has only 4.3 user score, maybe from left extremists? The movie shows more conservative values."
    },
    {
      "rating": "8",
      "text": "```````````````````````````````````````````````````°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°¤¤¤¤¤¤¤¤¤¤"
    },
    {
      "rating": "8",
      "text": "Plot HolesWhen Tripp shoots Michael Drucker through the window of the helicopter, he shot Drucker right in the head. Later in the movie, Dr. Weir is playing back Drucker's last recorded memory that was recorded from his brain, they played back everything up to the point where Drucker was shot. According to the movie, this would not be possible since syncording can be made up to a few hours after death ONLY if the brain is intact."
    },
    {
      "rating": "8",
      "text": "Revealing MistakesHelicopter pilots always sit in the right seat, unlike captains of fixed-wing aircraft, who always sit in the left seat."
    },
    {
      "rating": "8",
      "text": "yeah i was very happy with how this movie turned out. I was a little skeptical going into it but luckily it was surprisingly good. Sure it felt a bit like total recal...you know cloning and erasing or creating memories both raise similar moral issues and the plot evoked similar feelings in not really knowing who's who and what is real. Aside from those two things the movie did however manage to gain its own identity. instead of being on mars and having crazy mutants this one is set on earth and focuses more on what things might look like in the future. All the futuristic technology, be it holograms, laser guns, or full size remote control/transforming helicopters are what really makes this movie interesting and stand out. The only real negative i can give to this movie is that at some moments it was very obvious that they were pushing for a pg-13 rating. There was only one f bomb and arnold later quotes himself but replaces said f bomb with a more socialy acceptable word...screw. The cast was great im a big fan of michael rapaport and michael rooker, as well as the big black guy who i cant remember his name but plays in a lot of comedies. Another plus was how much thought went into the plot and morality issues. They played around alot with the what ifs of cloning and there were plenty of different clever scenerios surrounding this basis. And lastly you get some great one liners we have all come to expect from arnie and this movie has some of the best of them. I'll leave you with a few of my favorites and if you have not yet seen this movie then stop reading now. \"You should go clone yourself while your still alive\" \"why so i can see things from your perspective?\" \"no, so you can go f@#$ yourself\". ahahaha that one was the best and another was when arnold walks in the room and is acknowledged by the villian and says \"i wish i could say the one and only\". i can tell that they put a lot of thought and effort into this movie and lines like these show that they also had a lot of fun with it. great movie."
    },
    {
      "rating": "8",
      "text": "Set in 2015, but released in 2000, the only accurate future technologies predicted (excluding cloning) were flatscreen televisions and self-driving vehicles (though as of 2018, they're still in the prototype phase)."
    },
    {
      "rating": "6",
      "text": "The plot wanted to express too much and was running out time. There were very good concepts and stories, but all these didn't develop well, which made certain parts came up too fast and unnatural, along with a bit abrupt ending."
    },
    {
      "rating": "8",
      "text": "Arnold is great in this Sci-Fi action thriller. He is cloned then he tries to get his life back from this evil agency who is cloning everyone without anyone knowing about the cloning. Cloning is illegal and if any clones are found they are killed, the clones are abominations in the eyes of society. The action is abundant, there are great one liners & some nifty technology is featured. The movie takes place in the future, but the movie doesn't say what year it just says in the near future."
    },
    {
      "rating": "10",
      "text": "The professional football league, for which Johnny Phoenix (Steve Bacic) plays, the XFL, was created in 2000 by WWE owner Vince McMahon. It only lasted one season."
    },
    {
      "rating": "7",
      "text": "Definitely one of Arnie's better films (other than the nostalgia films from back in the day). His acting is still terrible, and that's honestly the main thing that holds the movie back, but the plot is interesting enough that it doesn't matter too much."
    },
    {
      "rating": "10",
      "text": "Truly a classic Arnold Schwarzenegger film, up there with True Lies, Terminator 1-3, Jingle All the Way, and Total Recall."
    },
    {
      "rating": "4",
      "text": "Watching this in 2020 is nostalgically cute. It's not a great film and feels like a product of its time. Ironic given its set in the 'future'. Better stoned."
    },
    {
      "rating": "10",
      "text": "----------------------------------------------------------------------------"
    },
    {
      "rating": "1",
      "text": "Arnold Schwarzenegger has made many good action movies in years, some debateable and controversial and some just action classics with not one fault against it's name.... However The 6th Day came along and what year it was made is irrelevant because all that matters is the actual movie. I watched The 6th Day and it was about human cloning and some parts of this film are odd like the girl doll that talks to you of it's own accord and Schwarzenegger who plays Adam Gibson tells it to shut up constantly only failing to do so until you tell it to go to sleep, I found this weird and the scenes where Michael Rapaport treats a holographic hot lady as his real mistress is laughable and pathetic, can't he get a real woman who's flesh and blood I mean what's wrong with these people lol. The action scenes are crap, the villains are weak, cheesey and Michael Rooker sucks. The violence is unimpressive aswell so a poorly made and stupid film."
    },
    {
      "rating": "0",
      "text": "The 6th Day stars Arnold Schwarzenegger, Michael Rooker and Michael Rapaport.... It's a kind of sci-fi action film and is directed by Roger Spottiswoode who also directed James Bond flick Tomorrow Never Dies which is a great film in every way possible.... The 6th Day however isn't so great, full of stupid scenes like Michael Rapaport calling a holographic girl \"cupcake\" like she's his real girlfriend or something and the stupid doll that talks by itself which is annoying... Schwarzenegger even gets cloned in The 6th Day as he sees his double and most of the acting is laughable and same goes to the horrible characters and beyond bad villains and the poorly directed action scenes that look cheap and laughable. The 6th Day is a stinker in all departments."
    },
    {
      "rating": "6",
      "text": "Starts off well, with an interesting future where cloning seeps its way into the industry, as well as debates over its use. Unfortunately, despite some smarter moments, the film gets too unfocused as it progresses along. Still, it does pose the question of whether or not we should try to preserve the better people in our society. But, who decides who those people are? And based on what merits? Hope another, better movie comes along in the future to tackle those issues."
    },
    {
      "rating": "7",
      "text": "++××÷÷==//__@@##$$%%^^&&**()()--\"\"::;;!!??,,..{}[]▪▪○○●●□□■■♤♤♡♡◇◇♧♧☆☆⊙⊙°°••¤¤《《》》"
    }
  ]
}