{
  "id": 309,
  "title": "The Conjuring 2",
  "starring": [
    "Patrick Wilson",
    "Vera Farmiga"
  ],
  "runtime": 134,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Lorraine and Ed Warren travel to north London to help a single mother raising four children alone in a house plagued by malicious spirits.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zEqyD0SBt6HL7W9JQoWwtd5Do1T.jpg",
  "categories": {
    "plot": 7.476190476190476,
    "acting": 7.678571428571429,
    "ending": 7.3,
    "soundtrack": 7.333333333333333,
    "cinematography": 9.5,
    "familyFriendly": 3.0,
    "funny": 2.5,
    "action": 9.25
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This sequel is really well-done, the director (James Wan) created a work of art, this movie has many different genres, it has everything, it's a horror thriller movie but it has comedy, action, romance, drama, which is awesome! This movie tell us a great story since the beginning you can feel it! The plot is really awesome and entertaining. The scares were really creepy. This sequel is excellent !"
    },
    {
      "rating": "7",
      "text": "Despite not quite reaching the same level as its predecessor, this still managed to hold up surprisingly well for a horror sequel. James Wan does what he knows how to do best, which is make an imaginative and chilling film with several tense moments throughout. Patrick Wilson and Vera Farmiga also deliver strong lead performances once again. Overall, while it does explore familiar territory for the most part as well as draw from some horror and possession cliches, most of that is made up for through its fair share of clever and tense scares as well."
    },
    {
      "rating": "6",
      "text": "I usually like to take a mediator approach in all things: a recognition that there is always two, or more, sides to everything and you only possess a part of the puzzle. In this case I change my mind.\r The Conjuring 2 isn't genius, scary, interesting, fresh, horrific or any other overblown descriptor people care to toss around so haphazardly. It is, however, a cliched look into a complete non-event that took place in 70's England regarding a poor, single-mother family and some imaginative children desperate for attention.\r Why the powers that be chose to revolve this series of films around a dubious duo, known as the Warrens and well known to sceptics, giving them a credibility they don't deserve, is obvious. Plenty of tall tales to fictionalise further based off of their \"case studies\". Terms such as \"based on\" and \"inspired by\" should be taken as Hollywood shorthand for: we take a few of the interesting parts, jazz them up and make up the rest. In this context I would have preferred they simply created a fresh, fictional set of investigators and have them attempt to resolve each of these otherworldly experiences - an updated X-Files, if you will.\r That aside, you get a pretty straight forward yarn that gives you several ghosts of the week packed into the one film. The warrens are presented as prettier versions: altruistic, god-fearing, loving people who can't understand why people criticise their work. The family are serviceable as public housing tenants suddenly thrust into creepy events.\r Beyond this, I don't have much else to say about the film. I was never scared by the overdone premise, the ghosts were all typical types you've seen before, and the resolution is as absurd as ever--we know its name therefore we win. Aren't we tired of ghosts, zombies, vampires and demons yet? I guess not.\r I appreciate this genre for its ability to get under my skin, and provide different perspectives. If done properly it can achieve anything from simmering unease to heart-racing terror, whilst forcing us to focus on issues we would rather not. Horror has long been a vehicle for social commentary, but films like The Conjuring 2 have nothing to say beyond Box Office."
    },
    {
      "rating": "7",
      "text": "The Conjuring 2 may lack a \"Clap-clap\" level scare like the first film but offers everything else; romance, drama, action, tension and plenty of scares."
    },
    {
      "rating": "6",
      "text": "What this movie lacks in originality is well compensated by the good performances and the fine pacing of scare. it is the one of most enjoyable horror films of the year. By the way, does the designer of the demons have a thing with Marilyn Manson?"
    },
    {
      "rating": "7",
      "text": "The rare actually good horror sequel, The Conjuring 2 serves as yet another example of how James Wan is able to balance good, quality, and well-earned scares with a solid story that keeps you engrossed even when the scary bits take a bit of a break. As with the original, The Conjuring 2 has a lot going for it. Patrick Wilson and Vera Farmiga have terrific chemistry and make for a truly believable married couple who happen to fight demonic presences in homes. Plus, this new story - particularly the nun - made me produce more than a few bricks out of fear. The slow introduction of the presence and then the rising actions of its presence is great. The film is willing to build tension in a horror movie sense while then balancing it with the tension of whether or not everyone will believe the family. Most horror movies just want to skip into everything and just assumes everyone believes in ghosts. However, Wan knows he has skeptics in the crowd and must prove his case in order to scare them as well. This said, there is one major problem with The Conjuring 2 that holds it back; the ending. In order to defeat the demon, Lorraine must use its name against it. How does she know its name? Oh, it told her earlier in the movie. If the name gives humans power over the demon, why would the demon ever give up its name? I like to imagine that this demon was fired as Chief Possession Officer in England after such a rookie mistake. That said, The Conjuring 2 keeps you on edge for the entire film and effectively earns its scares, instead of relying on cheap tricks. Heck, even the jump scares are well earned, merely through the tension and atmosphere Wan creates. Though a minor stepback, The Conjuring 2 takes what made the original terrific horror and repackages it for another story."
    },
    {
      "rating": "7",
      "text": "The Conjuring 2 offers up some great scares and a very haunting demon, however it feels too familiar to the first and doesn't really break any new ground to the horror franchise."
    },
    {
      "rating": "4",
      "text": "All of the intelligence and freshness that the first conjuring brought to the horror genre is completely gone. The movie wasn't terrible but its a big disappointment for being a sequel to one of the best horror movies ever made."
    },
    {
      "rating": "10",
      "text": "The Conjuring 2 introduces a new way of doing horror movies. The film is a true mix of scares, afflictions, romances and drama. Everything is very well architected so that the film has a more sensitive and familiar touch. The film is certainly efficient in terror (perhaps even more than its predecessor), but the big bonus is the empathy that the viewer gets the family during the movie.\r Featuring new tracks for future movies and using their own resources to create effective antagonists, The Conjuring 2 is certainly the best horror movie I've ever seen."
    },
    {
      "rating": "7",
      "text": "The second entry into the Conjuring Cinematic Universe is fun, scary, but not particularly innovative. It follows mostly identical beats to the original film. However, this is not necessarily a bad thing! Ed and Lorraine Warren receive a lot more character development in this sequel. The introduction of the Nun as a villain also works incredibly well. However, there is also not one conjuring in this movie. There is another banishing, where the spirit is expelled from the home. No spirits are summoned at all. Just a little nomenclature fun fact!The direction is remarkably well done. The scares in the first act are especially scary. The finale is satisfying. This is a very enjoyable horror sequel. Can't wait to see the rest of the franchise!"
    },
    {
      "rating": "8",
      "text": "Very good horror movie. Left me pretty satisfied although it was slow in certain parts.\rIt could had maybe been even better movie but I don't really complain.\rIts very worthy movie to watch on the cinema.\r10/10 for the great acting of the actors in it.\rWe don't see many great  or that good horror scary movies on this genre often, that's for sure."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film. Very creepy atmosphere with plent of scares throughout. I also really liked the 1970s vibe which was done really well in this film."
    },
    {
      "rating": "8",
      "text": "Felt longer than it needed to be but it still told a great story and had that unease factors the first one gave me. Any scene with Valak was pure horror-esk. Overall a good watch but did feel like a small step down from the first one."
    },
    {
      "rating": "3",
      "text": "I went to see this because I liked the first one, and I saw there were some good reviews. This movie is bad, at times it feels like Scooby Doo. Just answers to unimaginable problems come out of thin air, not to mention the pointless -and sometimes downright silly-  statements about the paranormal.  The dialogue is horrendous, there are a few scares in the first forty fives minutes, but then it just becomes absurd and repetitive. It's waaaaaay too long with the same scares used over and over.. If you are over the age of 12, do not go see this."
    },
    {
      "rating": "9",
      "text": "Maybe the most touching heartfelt scare the crap out of me horror film I've ever seen.  The script in this film is great you really care about these characters and you really feel the love of The Warren's.  The extremely rare sequel that's better than the original.  A"
    },
    {
      "rating": "8",
      "text": "Horror sequels can be another horrible film following from it's predecessor's success that most filmmakers just want some money without any effort and interesting stuff to show,they are just blatantly lazy.Conjuring 2 didn't follow that but instead brought us new interesting things to this franchise with a captivating story and a hunting and creepy atmosphere,it is a well directed horror sequel.The performances were amazing,the chemistry of the Warrens was just marvelous and so thus the children in the film they were also excellent.As the film progress the tension gets higher and also thus the apprehension.This Horror film is far from the worst and near from the best it's on par with it's predecessor,Conjuring 2 is an example of a good horror sequel"
    },
    {
      "rating": "10",
      "text": "James Wan strikes again with another bone-chilling horror containing imagery that will haunt you for weeks. Enfield in the 70's acts as a brilliantly sombre setting for this take on the famous real-life haunting described as 'England's Amityville.'  I've watched some of the footage taken from around the time and although I'm a non-believer, some of the goings-on did phase me a little. For example, how did such a young girl manage to change the pitch of her voice so drastically without seriously damaging her throat? If is was all a hoax (which I'm almost certain it was) then it was all very convincing one and not bad for a bunch of nutty inbreds. It certainly makes for a great horror, especially in this hands of Wan, who takes it to a new level of course, throwing in the Warrens and a bad-ass demon to boot. What a film"
    },
    {
      "rating": "10",
      "text": "\"The Conjuring 2\" Is Equivalent To Its Predecessor, Diabolically Creepy\r James Wan is the genuine Sir Alfred Hitchcock of the 21st century\r Three years ago, the world went crazy with the 5th invention of the Malay director, James Wan - my king, master and role model -. \"The Conjuring\" triumphs in critics and box office bringing a breakthrough and resurgence to horror movies in the last decade,it's considered as the master jewel of malayan and the cinematographic of horror. Wan has continuously been providing us great achievements in commercial films, since his major debut as a director with \"Saw\" in 2004 to his first action film  \"7 Furious\" last year; his shiny and original style to portray suspense and horror through each frame, has made to the director reaches to the top of podium of the films, not only in the horror genre, also the action genre, and we hope more he'll try to experiment.\r \"The Conjuring 2\" opens the same iconic way that its predecessor, now is the famous case of Amityville (112 Ocean Avenue) which reveals to Ed and Lorraine Warren, the renowned paranormal investigators duo. Amityville was the event that gave them renown and recognition to investigators, but not by their horrible experiences, but by unbelief and ignorance of the people, which didn't believe it possible that those things happen. Later, within the film, we continue to validating in a 90s TV Show lack of confidence and credibility of the people towards the Warrens. Ironically, that skepticism would be powered once more with the Enfield Poltergeist, the case more documented to paranormal level. The famous massacre (DeFeo family) has been adapted millions and millions of times a big screen, however, Wan manages to save that gloomy essence of the night of the murder and projects it of a delirious and disturbing way in Lorraine's head, from the first minutes, \"HORROR\" genre shines.\r The Enfield Case is adapted with purity and splendour of a script credited to Carey Hayes and Chad Hayes & James Wan and David Leslie Johnson. Wan dodges references of the two small programs have focused on the event  to develop to Ed and Lorraine in the story (in real life, Warrens had not the least significance in the case, they only evidenced it one night). The film takes its time - somebody says that enough, I for one, the more see James's delights more I go crazy -  to introduces the destabilized life of Peggy Hodgson (Frances O'Connor). The events happened in a interval between 1977 and 1979, to capture each sublime moment of the epoch, it was vital the intervention of the Department of costume led by Kristin Burke, the Department of light and art led by Fiona Gavin, A. Todd Holland and Andrew Rothschild, which not exaggerated in capturing the atmosphere of the 70s and 80s. Wan is amazing to recreate complex and refined milieus and sets, every shadow, square, furniture, door, toy and even each color play a fundamental role in the creation of the style of the director, a director who is delicately precise with his details, even though was a humble house, without many luxuries or support tools, the visual tension is concurrent.\r On a night as any, Hodgson family is sleeping peacefully after a tiring day. Two of the four children, Janet (Madison Wolfe) and Margaret (Lauren Esposito) are awakened abruptly from their nap by an unknown entity, immediately, they go to tell what happened them to her mother, who refuses to believe and finds an Ouija board manually made by her daughters. Next day, harassment persist more sharply up to the point that the mother experiences with her own eyes paranormal events - James's interesting proposal to not to fall into the cliche that nobody believes them. Meanwhile, a suggestive sub-plot takes place in Warren family. Lorraine tends to keep fragments of each case and in their latest investigations, she sees to the Demon Nun (Bonnie Aarons), a superb and shocking demonic nun who torments them with a sinister intent, that purpose will intertwine of a sumptuous way with Hodgson's ending (which never happened).\r Wan knows how to distort every trick in his favor, rung by rung construction makes that final climax has really earned. Wan is distinguished by the ability to frighten or intimidate the audience with shots both day as at night, he knows play and combine the tools that possesses, knows to keep constant tone of his film, he doesn't allow his audience to sleep, and even though this time he uses to more jump-scares than its predecessor, are equally enjoyable and are not shamelessly used. All of the above is essential in the foundations, however, the actors take all the credit Ed, Lorraine, Peggy and her four children (especially Janet) are fabulous, measured and charismatic.\r \"The Conjuring 2\" is credited with the title \"Horror film of the year\" and is used for viewing the constant advancement of its director within the genre, it's hard to watch and hear, the film is not suitable for hearts or minds weak, \"The Conjuring 2\" an instant classic."
    },
    {
      "rating": "3",
      "text": "This would be a great comedy, but it turns out it's supposed to be a horror movie.\rThe scares are so cheesy and the special effects are so poor that I just couldn't stop myself from laughing.\rThe Conjuring 1 was actually creepy as hell. This one is just bad. I'm really glad I didn't see it in theaters because I'm sure my guffaws would have ruined it for everyone else.\r The story, moreso than the last movie, is focused on insisting that haunted houses are real, which really killed it for me. It's obvious what really happened - the movie even spells it out for you."
    },
    {
      "rating": "10",
      "text": "The Conjuring 2 is directed by James Wan and stars Patrick Wilson,Vera Farmiga, Madison Wolfe, Frances O' Connor, Simon McBurney and Lauren Esposito. Ok to start things off I really liked the first movie and I really wanted to like this, and I did. Since this was a horror movie sequel I had a feeling this wasn't  going to be any good.\rEveryone in the movie was great including the kids. There was one scene which I won't spoil had Patrick Wilson, Madison Wolfe and a glass of water. The nun you saw in the trailer was really scary. Even when the scary parts are not happening, the saw character moments are great. James Wan is a master of horror. You can tell he knows what he's doing.  The soundtrack is great, the scares are great, and the characters are great. One huge surprise was Simon McBurney, I haven't seen him in anything but he was great. Another great thing about the movie is that it's very entertaining. My only problem is that it uses some horror cliches but its just done so well that it feels different. That's my opinion though. This is the best horror sequel to come out. Is the film perfect, no, is it great, yes. You really should check the film out when you get the chance."
    },
    {
      "rating": "9",
      "text": "The movie is truly awesome. It has many well made scenes. I have made a video about this movie. Just visit youtube and then search \"The Conjuring 2 honest movie review (no spoilers) !!! Best Videos\".\rYou must watch this video for know the honest review."
    },
    {
      "rating": "10",
      "text": "Conjuring 2 is definitely one of the greatest horror movies ever made. Nearly every aspect of the movie is perfect . The use of claustrophobic environment and elimination of all the horror cliches makes the movie great , intense and Scary. A must see movie in theatre ."
    },
    {
      "rating": "5",
      "text": "User score: 7.9 ????!!!!!!!\r You must be joking, People!!! The screenplay is so predictable and so boring that even Patrick Wilson & Vera Farmiga are not able to save the movie.\rI am extremely disappointed mr. Wan."
    },
    {
      "rating": "5",
      "text": "RUBBISH........................... its not scary and no one dies so over hyped the story is good and acting to great just not as scary as the trailers make it out to be"
    },
    {
      "rating": "9",
      "text": "A well-written horror sequel master piece with great performances of the cast and a great hunting or creepy atmosphere that builds tension throughout the film.With scares that works best here this horror film is a must see if you are a horror fanatic"
    },
    {
      "rating": "8",
      "text": "Overall an enjoyable film, but for me the film was much too long and the London actors were not very interesting, just workmanlike. I was nodding off until Lorraine and Ed arrived in London – but then I thought the film really took off and was fantastic. The \"second half\" was beautifully acted with plenty of tension and great plot twists. Perhaps the problem was that the introduction to the haunting was not very interesting or original nor were the scenes of Lorraine and Ed at home,even though we are fond of them by now. Yes, I know this was necessary explanation but much of it was really dull and went on much too long. But once the plot strands came together – Wow!"
    },
    {
      "rating": "9",
      "text": "James Wan must be praised for this amazingly directed sequel to one of the best horror franchise of recent years. The conjuring 2 comes together brilliantly with the great performances, effects and scares. This is a must watch horror!"
    },
    {
      "rating": "9",
      "text": "Critics... I think they are just trolls sometimes.\r I loved this movie. The movie only has 1 moment that turn me off. The use of special effect doesn't really work  for me. If the Crooked Man would have been an actual person in costume, it would have been better."
    },
    {
      "rating": "2",
      "text": "Not even slightly scary. The weird fast forward thing they did when the \"ghosts\" appeared was pretty awful. The ghosts in general just looked like normal people in costumes. The fact they act like this is a true story is pretty hilarious with how fake everything looked. The soundtrack is great though."
    },
    {
      "rating": "10",
      "text": "4.8/5. James Wan has crafted the greatest horror film I've ever seen and solidified himself as the new age master of horror. I've never screamed out loud in sheer surprise/fear before but I did watching today. Imagine the best elements of The Exorcist, Poltergeist, The Amityville Horror, Insidious, and The conjuring, and you have this new age classic. The camera work in this is absolutely astonishing and evokes pure tension throughout. The atmosphere and lighting is executed perfectly. The plot has several different aspects intertwining into a fantastic story overall. The soundtrack is stunningly terrifying. The demonic entities are the most frightening I've ever seen. Seriously if you are a fan of horror or just film in general you must see this. I truly hope this franchise has several more movies because both films are amazing.\r\"Sometimes it takes a leap of faith, to believe when no one else will.\"- Ed Warren"
    },
    {
      "rating": "7",
      "text": "Hard to truly rate horror films in accordance to other genres but that being said this film was easily the best horror picture I've seen in years.  A little cheeky in parts but overall delivers the goods on scaring the crap out of you at times .....  and that is it's purpose is it not ?  I give it a 8.5 overall.  Don't cross your legs if the row in front of you reclines are you might get a sprain knee and a lap full of popcorn  :)"
    },
    {
      "rating": "9",
      "text": "Remains scary, but with a little more sentimentalism... and that's good. Familiarity with the characters may be the reason, but this only adds to the strange and dark story. This time, we have not the simple work of the first that makes it so scary, and I admit: it disturbs a little. But the strong performances of the actors outweigh any unnecessary exaggeration."
    },
    {
      "rating": "10",
      "text": "This is really one of the best and most scary horror movies I had seen in a very long time in my life. I recommend seeing it now! It is definitely worth all of the money!"
    },
    {
      "rating": "8",
      "text": "The Conjuring 2 is fine tuned to perfection. Its depiction of supposedly true events is extremely dubious and it offers absolutely nothing new, but the winning central performances and Wans masterful direction make this one of the best of the genre, and a steady improvement over the first film."
    },
    {
      "rating": "3",
      "text": "I heard about the movie Conjuring 2, about how great it was and how well it was rated, I immediately arrange a visit to the best cinema in town for the best experience. I must say, the movie is a total let down. It was supposed to be a horror movie, but it doesn't seems to be portraying as one. The concept of ghosts, demons, haunting, poltergeist, are not supposed to be jump scares or some imaginary crooked man that can actually twist limbs of an animal or puncture hole through a solid door! I am not sure if the screen writer and the director has lost touch, the supernatural entities are supposed to be eerie, mysterious, send chills down the spine, and make your imagination runs wild. A good and quality horror movie I was hoping for, is to have the feeling of having to wonder that might it be possible to happen the moment I step out of the cinema and won't even dare to walk alone in the dark, going to the washroom alone, go downstairs for a cup of water in the middle of the night, or switch off the lights when I sleep at night... A ghost or demon doesn't necessary be mutant looking to be scary... One look at her, the viewers can immediately conclude that she is the bad one, one look at him, he is the good one... What is wrong with the screen writer? It is so misleading... Before the movie even ends, my personal feelings are, phew, the movie's soon gonna be over, time to go back, what an overly exaggerated movie, piece of joke, definitely won't leave an impression... I am not saying that the movie must be realistic, I know, it is a movie, it is for entertainment purpose, it is supposed to be unrealistic and exaggerated, I totally get that... But, not to the point where it feels like watching Alien vs Predator movie... Horror genre, baby alien crawlers jumping out from air ducts / chests that scares the sh*t out of you, predator trying to kill you with its concealed weapon instead of an umbrella from thin air that can do bigger damage than a shotgun... With those abilities, I'm surprised that no one died in Conjuring 2... The whole story is so badly plotted, the ending is totally bollocks, so predictable, and it is very obvious that the screen writer has very little knowledge about supernatural and under pressure from the first Conjuring movie... I am not against anyone watching this movie, I did enjoy the humorous part with the police and Ed's jokes. There are a massive amount of positive feedbacks, but I'm sorry, it's just not up to my standards..."
    },
    {
      "rating": "7",
      "text": "The Conjuring 2 is a wonderful movie and excellent sequel, but is less scary that the first movie . Whatever, I think that is one of the few that are good of this genre in this times"
    },
    {
      "rating": "8",
      "text": "Muy buena película de terror/entretenimiento que cuenta dos historias a la vez. Soñé muchos dias con \"la monja\" pero que al final se le va la mano con lo fantástico y los efectos."
    },
    {
      "rating": "10",
      "text": "This is the best horror film I have seen. I'm very scared when I watch it because of its effect. I think this is a must-see. The acting of the main characters is good. I am very impressed by the role of Vera Farmiga."
    },
    {
      "rating": "3",
      "text": "The best part of the movie was the beginning. Everything else was boring. This movies definition of \"horror\" are jump scares that wear off quick. There is no tension, not a single person in this movie dies (Except some random family in the beginning), and it is full of cliches. Random things move around the house? Check. Demon possessing a little girl? Check. The horror only happens in dark rooms cause it's more scary? Check. Also, none of the characters are interesting. I don't remember anyone. Some of the logic that this little girl was faking being possessed was some of the stupidest crap I have seen. I know that this movie was based off a true story, but that doesn't make it a good story. Like I said, NOBODY DIES. I was actually begging for someone to be killed. This movie does not even deserve an \"R\" rating. The only rating it deserves is a \"3\""
    },
    {
      "rating": "10",
      "text": "The spookiest movie i have seen in my life.AMAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAZZZZZZZZZZIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIINNNNNNNNNNNNNNNGGGGGGGGGGGGGGGGGGGGGGG."
    },
    {
      "rating": "10",
      "text": "This is the best horror movie I have seen all year! It has everything in your checkbook on how to make an incredible horror film. I don't know how directors these days just don't know how to make a great horror film. It is scary, It has a lot of tension and suspense, actual characters you care about, a great fleshed out screenplay, great horror visuals, jump-scares that actually do frighten you unlike those false jump-scares, That's It Directors! THAT'S ALL YOU NEED TO DO! - Nicholas Cage. 10/10 go see it!!"
    },
    {
      "rating": "5",
      "text": "I actually thought this was a fairly decent horror film, though it’s not a classic, like The Witch or It Follows. The major reason being that whereas the first film felt like it was using a lot of the horror tropes to it’s advantage, this film feels like it’s using them as a crutch to cover up the cracks in the script, which I was really beginning to notice. The overall performances are pretty good and it’s a decent made horror film, but I really wish the Conjuring films would not market themselves as based on a true story and I hated the treatment of skeptics in the film and I don’t like the fact that these films are perpetuating the idea of exorcisms being true, a lot of people are not seeking medical help because they believe in exorcisms"
    },
    {
      "rating": "8",
      "text": "Sequels of horror genre have always been cursed to turn out poor yet director James Wan manages to set his bar as compelling as the first one; though not critically-acclaimed but overall a satisfying scare without blood and gore. Slightly longer than its predecessor, the 134 minutes running time enhances smooth pacing of the plot, allows further debate over the controversy of supernatural phenomenons and scientific psychology, human tricks and role play of the religion organisations; even if parts of its horror elements may feel routine, it is still able to trigger chills and unsettling moods. Characters development and emotional engagement especially the love life of Warren have made this follow up more to like a family crisis drama interrupted by a demonic figure, thanks to the strong performance of the young casts, eerie but not over loud thematic scores as well as the confident cinematography and visual effects. Overall, the efforts of remaining the styles from the first one, the decision to twist the final act and the addition of dramatic aspects are mixing so well which eventually it just feels so real that leaves the desire to follow up with the next documented case."
    },
    {
      "rating": "8",
      "text": "Very spooky movie.Good actor's game,atmosphere of terror everywher.Very nice film.this movie really scare you to crap his pants.I don't know what else to write just see this movie.Part 2"
    },
    {
      "rating": "8",
      "text": "A very well made movie with minor flaws. The first scene is one of the best openings to a horror movie ever. This alone proves that director, James Wan is a genius!  There's a lot of tension and a lot of scares. It gets to be over-the-top at times, which slightly detracts from the story's realism. My only beef with the movie is how the haunting is resolved. It could have been more clever. Other than that, this movie is a must see!"
    },
    {
      "rating": "0",
      "text": "Not Scary\r There is only so much ghostly door slamming that can happen before a person starts to think he wasted his money. The sound design is so awful it can only be compared to a 2 year old with the lungs of an Olympic swimmer screeching into your ear. I wish I could give a lower rating. The acting was good, but everything else was rediculous and annoying. In a word, this movie is forgettable. Don't waste your money on \"The Conjuring 2\" and go see \"Warcraft\" instead."
    },
    {
      "rating": "10",
      "text": "Simply the best 2016 horror film, a film epic and as good as the first , the story is diabolically chilling.\rThe BEEEEEEEEEEEEEEEEEEEEEEEEEEEEST EVER"
    },
    {
      "rating": "0",
      "text": "What disappoints me is that the story behind the Conjuring 2 is painfully boring and not scary in the slightest. The sub plot with the Nun was interesting and that should have been the focus instead of the junk main plot in England. Really disappointed as I was a fan of the first film."
    },
    {
      "rating": "10",
      "text": "Conjuring 2 redeems the franchise after the utterly terrible Annabelle. This movie satisfied me not only because of the well placed scares, but it was just brilliantly acted out and well shot. The special effects bugged me and disturbed me. James Wan is awesome."
    },
    {
      "rating": "2",
      "text": "There's no way I ain't falling for this obvious horror sequel bait again. Remember Insidious: Chapter 3? Well, this one manages to get positive reviews, but I fail to see what's the difference in me."
    }
  ]
}