{"id": 3286, "title": "The First Time", "starring": ["Dylan O'Brien", "Britt Robertson"], "runtime": 95, "genre": ["Drama", "Comedy", "Romance"], "description": "Dave, a high school senior, spends most of his time pining away over a girl he can’t have. Aubrey, a junior with artistic aspirations, has a hot boyfriend who doesn’t quite understand her or seem to care. Although they go to different schools, Dave and Aubrey find themselves at the same party. When both head outside to get some air, they meet. A casual conversation sparks an instant connection, and, over the course of a weekend, things turn magical, romantic, complicated, and funny as Aubrey and Dave discover what it's like to fall in love for the first time.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tG6jUndWd9FRuvI4j5Z2bhTuq0V.jpg", "categories": {"plot": 6.714285714285714, "acting": 7.428571428571429, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "I really enjoyed this movie, even though it's more suited to an audience far younger than I. The main reason I watched this was because of the great cast. The talented and sexy Britt Robertson and Molly C Quinn. Then there is a young Aussie actor of considerable talent, James Frecheville who starred in the amazing 'Animal Kingdom'. Being a red blooded male I used to watch 'The Secret Circle' (hey, what's wrong with that?? lol) so Britt was plenty enough reason to see this. I actually recognised a lot of the actors in this well written movie. Another reason to see this was the fact that writer/director Jon Kasdan's previous film was the wonderful 'The Land Of Woman' so I was keen to see if he was truly following in his very famous director fathers footsteps. Father, Lawrence is behind some of the biggest films in Hollywood, such as, 'Return of the Jedi', 'Wyatt Earp' and 'Dreamcatcher'. He has his fathers touch.\r The film is a sort of mild mannered affair about a boy (Dylan O'Brian) and a girl (Britt) who meet at the outskirts of a party, run from the cops and end up in her bedroom. They fall asleep and wake up to parents shouting for Aubrey to get out of bed. Dave jumps out the window and forgets to get her number. He gets given all sorts of silly advice from his friends on how to he should approach her the next time. I'm not going to get in to the whole thing but it follows from that.\r The bottom line is, this was funny, well acted (very well acted in fact), great production for a smaller budget movie and the writing was actually quite sublime, not in that young people won't get it but enough to keep older people interested. I also liked the characters which can make or break a film, imo.\r Highly Recommended\r Score: 7.1/10\r N∆V  navq@ymail.com"}, {"rating": "6", "text": "Brit Robertson and Dylan O'Brien make for two pretty great leads and it makes sense that they started dating during the shooting of The First Time. Their chemistry is outstanding and obviously the moments where the two are together are the highlights of the film. The fact that these characters are high school kids are both its rise and its downfall. The young characters make this more of a teen movie than anything but their innocence is also what makes the film unique. These characters go through some problems that a lot of young people have when falling in love for the first time.. There are so many cute moments throughout this movie. It's unfortunately pretty clichéd though, but it is still plain to see that both Brit Robertson and Dylan O'Brien were bound to become stars."}, {"rating": "7", "text": "Make a movie around this theme is a challenge, because needs don't let boring or so much explicit (depending of the public) but the cast made me enjoy it. They are amazing"}, {"rating": "4", "text": "Cute and everything but the script is very superficial and basically nothing big happens. Ok, two teens have sex after two days since they met and...? No interesting exploration about that on screen, I just felt empty. Robertson and O'Brien are great together and share some amazing scenes and this helps a lot. It just doesn't help the poorly developed story of the film."}, {"rating": "10", "text": "Best film in this genre I've seen for a long time ..Sexy and Funny\rThe cast were excellent in their roles in fact I have also watched the lead character in Teen Wolf and this is quite a departure from the role he plays in that\rTry not to miss it.You will like it,"}, {"rating": "9", "text": "I thought it was a decent romantic movie when i first watched it, but for some reason wanted to watch it again, and again over the next 2 weeks...  around the 4th or 5th time I finally realized it was because there is a lot of parallels to how my 2nd long term relationship started.oddly the girl acts like the girl i went out with for 7 months, and looks like the other girl that i decided not to go out with."}, {"rating": "6", "text": "A shy senior and a down - to - earth junior fall in love over one weekend. (6)"}], "recommendations": ["the_spectacular_now", "midnight_sun", "no_strings_attached", "13_going_on_30", "we_bought_a_zoo", "magic_mikes_last_dance", "10_things_i_hate_about_you", "last_vegas", "cruel_intentions", "17_again", "book_club", "aquamarine", "easy_a", "don_jon", "moonrise_kingdom", "the_intern", "the_holiday", "something_borrowed", "mean_girls", "the_perks_of_being_a_wallflower", "young_adult", "chef", "silver_linings_playbook", "you_again", "the_perfect_date"]}