{"id": 1779, "title": "The Interview", "starring": ["James Franco", "Seth Rogen"], "runtime": 113, "genre": ["Action", "Comedy"], "description": "Dave Skylark and his producer Aaron Rapaport run the celebrity tabloid show \"Skylark Tonight\". When they land an interview with a surprise fan, North Korean dictator Kim Jong-un, they are recruited by the CIA to turn their trip to Pyongyang into an assassination mission.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tIDC4xT65l7a8qbgg8GvwD5g8c5.jpg", "categories": {"plot": 3.0555555555555554, "acting": 4.538461538461538, "ending": 3.3333333333333335, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.28169014084507, "action": 6.0}, "reviews": [{"rating": "0", "text": "Cheap humor and even cheaper script. Probably the dumbest comedy I've seen in last few years. Kids may love it, but that's pretty much it. If not for all the Sony hacking fuzz, this comedy would probably be rated even bellow 5.4 score. They literally paid Eminem to show up in the film for a minute (which has nothing to do with the movie plot what so ever). As if they added Eminem just to advertise the movie. It's an insult to IQ."}, {"rating": "0", "text": "i was bored.  if i had a forward button i would have push it a lot of times.  sure a few scene where funny as heck but over all wait for the dvd and rent it.  i got a free ticket to it  that's the only reason i even went to see it"}, {"rating": "0", "text": "If it wasn't for the Sony hack (hoax?), nobody would even care to mention this piece of ****. Dumb humor, annoying main protagonist. It's not even in the ballpark of the vicinity of the neighborhood of political satire or any satire at all for that matter. Don't waste your time!"}, {"rating": "0", "text": "OMG, the media hype got me! I was sucked in & regret it now. Thank goodness it’s over! The news hype is the only reason I saw it. Watched the clock more than the movie. It's an embarrassing disappointment to see such poor work from Hollywood--Sony must have been smoking too much pot with Rogen to think the script was at all funny. I think I chuckled 2 times. Very dissatisfied & could not wait for this movie to be over. Don't waste your money but more importantly, don't waste your time. I think Sony exaggerated the hack just to get people to watch this movie because they knew it was going to be a flop!"}, {"rating": "0", "text": "The hacker should have deleted this film while they had the chance. Do not watch this film thinking its my right blah blah blah, it is just a very bad movie actually the worst film i've seen this year.The film is so over hyped but it's nothing but toilet humour and retardation. kim jong un has nothing to worry about the film should never have been allowed to be produced. it's attempts at satire is poor the jokes are made for 10 year olds and Seth rogen simply plays the same character in all his films. If its yellow or red on metacritic than save yourself the money."}, {"rating": "9", "text": "This is not a political satire. It is a satire on the media. It is about how the media appeals to our emotions to get us to feel a certain way about certain things. It is about how our opinions on certain events are mainly driven by how the media portrays them. This is a recurring idea throughout the movie, and it takes many forms. It criticizes the United States a lot more than you would think as well. The movie's screenplay deserves credit for its shrewd observations of the media and human emotions, and for its exciting story line. The opening scene, a song, is simultaneously hilarious for its lyrical content, and chilling for its disturbing social implication. In terms of comedy, there are a few clever jokes written, but the comedy, while there is a lot of it, mainly comes from the performances, especially from James Franco and Randall Park, who also both perform well in their dramatic scenes. The scene with the actual interview is one of my favorite scenes of the year. The movie deserves Oscar nominations for Franco, Park, and for the screenplay, but of course that will not happen, because the movie will be scoffed at by people who will never give it the credit it deserves simply because they will never be able to see past the fact that it is a James Franco / Seth Rogen comedy."}, {"rating": "10", "text": "Best movie I've ever seen in my entire life! I laughed through out the movie. James Franko and Seth Rogan are such a great team, especially when it comes to this movie."}, {"rating": "5", "text": "Most of the jokes in this movie were over the top and just meant as an insult, direct, unmasked and therefore not my type of humour. I laughed at times at some more clever things, but most of the time the movie is quite predictable and what you see is what you get.\rIf insulting people to the bone without any form of subtlety is your humour I guess you'll rather enjoy. Otherwise I advise to spend you time watching something else."}, {"rating": "5", "text": "Despite its initial hype concerning the actual North Korean government threatening the US because of this movie, \"The Interview\" turns out to be a major disappointment, with the buddy chemistry between Rogen and Franco failing miserably and the plot hitting a huge downfall starting from the second act."}, {"rating": "5", "text": "I didn't find the movie to be entirely funny. Granted there are scenes here and there that were hilarious, such as the irony of Katey Perry's \"Firework\", but the movie as a whole was not funny. Rather, as a South Korean, I was offended and left me wander if this is how US sees Koreans of BOTH nations."}, {"rating": "4", "text": "The film that almost caused the collapse of a film studio and nearly led to WWIII should really be a lot better. A TV chat show host is going to North Korea to interview Kim Jong-Un when the CIA get involved and tell him he must assassinate the leader while he is there. There are laughs to be had here but they are few and far between. As with all comedies from the Seth Rogan camp, scenes are allowed to go on way past their natural end point and it would seem most actors are told to go as BIG as possible. Worst offender here is James Franco, whose performance is nails-on-a-blackboard annoying!! In the end this is a inconsequential film that doesn't deserve the publicity that North Korea has given it, and in a years time we will all be struggling to remember what all the fuss was about"}, {"rating": "10", "text": "I dont know why so many people dislike this movie, its maybe because of type of humor. Yes, its childish and fart jokes etc.. But i really liked it, i like rogen humor and franco's acting, its their another typical movie. If you like them, you will like this. They hate us cause they ain't us!"}, {"rating": "7", "text": "Totally in line with most Rogen/Franco films. Mostly hilarious, a few jokes fall flat, and some questionable material. But reading the ridiculous click-bait articles about this movie \"It's racist\" \"It's sexist\" \"It makes light of North Korea\" are just click-bait. This movie is about as offensive as the Wedding Crashers. It's bawdy humor folks, grow up, Seth Rogen make a sex joke? Color me shocked.\r And to pretend like this is beyond the pale because it depicts an assassination, I'd refer the critics to literally any action movie from the 90s wherein almost every protagonist assassinates Saddam Hussein or Gaddafi.\r The movie was fun, it was gross, and it had a bit of heart. Can't ask for much more in a comedy."}, {"rating": "9", "text": "Funniest movie I've seen since This Is The End. Quite possibly the comedy or top 4 movies of the year. Its must buy or rent. If you did not like Neighbors or This Is The End you probably will not like this movie"}, {"rating": "5", "text": "The Interview is exactly what you expect it to be, a Franco-Rogen comedy with little in substance or themes outside their recurring joke repertoire. Although the film restricts its use of crude teenage humour, the overall tone never really goes beyond an adolescent mind. Are James Franco and Seth Rogen funny? Yes. Did this film cross any lines in terms of political content? Not really.\r The portrayal of Kim Jong-Un is not even close to how dehumanizing it could have been. The pop culture references throughout the film accent the premise of Franco as a talk show host who is up-to-date on current events, but the narrative had so much potential and fell very, very short.\r The Interview is nothing special and the only reason for Korea's disgust towards it would be the dethroning of the fearless leader off his godly pedestal. This film is Team America: World Police meets Tropic Thunder and it delivers exactly what you expect it to. I had high hopes for The Interview despite its controversial topic given the success of Franco and Rogen's last film This Is The End, but it just failed to deliver the smart comedy it could have been."}, {"rating": "10", "text": "My very low expectations of this film were completely wrong. This movie is funny and it did make me laugh a lot. . Maybe not for those who like all black and white, this comedy has a lot of gray humor. Take this movie for what it is, obviously is not Shakespeare but a mature and funny comedy. I really enjoyed the film. But be aware, this is not rocket science! But who cares there are moments that are simply hilarious."}, {"rating": "7", "text": "A good movie funny nice but as much as frist of it. That might at last 20 minutes make you bored. Some times that's very stereotype but good at all. That makes you laugh. What that most of today movies can't."}, {"rating": "8", "text": "Pretty damn funny in its own right, the Interview is incredibly entertaining and funny thanks to Seth Rogen and James Franco, but, unfortunately, has been overshadowed by controversy. 8/10 (Great)"}, {"rating": "6", "text": "Not the best comedy in the world must be admitted, far too many repetitive homosexual jokes in there. If this movie had not all the publicity around it, it would have flopped, but because of all the media hype (promotions) this movie will do well. I see why north korea would be unhappy, this movie really embarrasses them lol. But any more so than Scary Movies? National Lampoons? Final word: Spoof movie poor general comedy, but quite funny depications of korea leaders."}, {"rating": "10", "text": "This was straight up the greatest movie I've ever seen. ''The Interview'' brought some of my greatest laughs to the theater with me. Overall I would give this movie a 1000 out of 10 if I could."}, {"rating": "8", "text": "A Comedy That Took A Huge RiskThis Movie Is Funny, Dark Humored, Has Balls, And Well Acted."}, {"rating": "0", "text": "Once I saw Franco and Rogan on the cover I knew it was gonna just a stupid Seth Rogan movie with same ingredients: dick jokes, raciest jokes ( if you're free to talk doesn't mean your not offensive ), and an Eminem reference ( just like in Superbad and Funny guys ) the only thing that was missing was Jonah Hill\rthe story revolves around to american journalists who are appointed to kill a dictator disregarding that  this act would be ethical or not  the characters are too stupid to do anything on their own and that's not comedy sure you might laugh at their stupidity but the movie doesn't contain any comedy what so ever except the dick jokes people getting hit jokes and racist jokes ( sorry but I don't like being insulted so it would be hypocritical if I laughed at them I mean dammit can't you  make people laugh without insulting another group of people ) I think this sort of movie will make north korean people dislike you because they didn't only insult Kim Jung Un they insulted N.Korea which is a beautiful country with great culture it just happened it is ruled by a dictator and this doesn't put you in a position to laugh at them  what if you were in their shoes would you like your culture and country to be mocked regardless of the political situation and I'm pretty sure if N.Korea released a movie about killing a president of a Western country you people would go nuts and the movie would be considered an act of terror and all that freedom of speech you're preaching the world about won't be applied.\rone thing to say to the people who thought it wasn't  a publicity stunt Sony said that they were releasing the movie on the 25th Dec and the didn't delay the date of course that's only my opinion"}, {"rating": "5", "text": "For a film that caused a lot of havoc and controversy, I was expecting it to be a lot more humorous than it was.  I think if they made more witty jokes instead of ass jokes, then it could have been way better. It was just plain silly and trivial. I mean, if Kim Jong-Un is smart enough, he should feel like an imbecile getting so worked up about it after seeing that. Still though, it did make me laugh a few times but eh."}, {"rating": "4", "text": "I love Seth Rogan and James Franco, and I loved This is the End, but  I did not love this movie.  Something in me tells me the \"hack\" may have been a big publicity stunt to generate hype, because without all the hype, I could easily see this movie being a huge bomb.  It did have funny parts, but the plot and the humor overall was sub-par from what I expect from this team.  It seemed the anti- North Korea parts were overblown and really not needed.  Did we really need to see Kim being blown apart in slow motion, or poo himself?  Overall the publicity stunt that came with this movie was much more impressive than the movie itself."}, {"rating": "4", "text": "Unsurprisingly, The Interview offers little more than a cheap attempt at a promising premise. As Americans, we find this subject and the subject of free speech fascinating--however, this film relies much more heavily on cheap humor than what could've been much more clever."}, {"rating": "5", "text": "The Interview appeared to not be worth the controversy. This movie was funny at times but not like what I had hoped. It may be the controversy that surrounded this film that will result in its downfall. Its not the worst movie I ever saw but it certainly wasn't worth all the drama. Of course its offensive, in the beginning it appeared to be fairly non-controversial but the ending will surly offend some people. I was disappointed with James Franco in this movie, it seemed like Seth Rogen took the beat seat although he was a co-writer, but his role was tolerable. James Franco seemed like he was playing himself and it made me lose some respect for him as an actor because he was a stupid douchebag for the whole movie. Obviously Sony has lost 44 million on this movie and will likely not come close to gaining it back with the film being in a limited amount of theatres. I wanted to like this movie but to me its a bust. It wasn't worth pissing everybody off."}, {"rating": "4", "text": "2/5★ Not since Kim Kardashian has so much been made out of so little. The Interview offers little that is truly intelligent and if you are familiar with the movies that Seth Rogen and James Franco make together then you know what to expect: vulgarity, immaturity and sophomoric humor that we feel a need to apologize for laughing at. The irony is after all the reports of the horrors of North Korea that have been given little notice, the headlines and furor caused by this stupid Hollywood film has brought more attention to the matter then anything else and if that isn't the ultimate satire and sad commentary on the world today I don't know what is.\rVerdict: For the Franco & Rogen fan."}, {"rating": "1", "text": "The movie was painful to pay 6 bucks for, and even more painful to watch. It is horribly and excruciatingly \"bro-tastic.\" I didn't even laugh until the 10-minute climax sequence, which itself was only a little funny. Long story short: this is a comedy movie aimed at the 12-15 year-old male age demographic."}, {"rating": "0", "text": "If you like the Family Guy formula of constant old media references and dragging out a joke for 10 minutes you might like this movie.  For those above the age of 5 however you might want to stay away from it.  I'll summarize the majority of the plot for you:  Kim Jong Un likes Katy Perry and Seth Rogen has to put something in his ass.  Those \"jokes\" easily take up 30 minutes of the movie each.  Comedy gold!"}, {"rating": "5", "text": "The movie was better then what I expected it to be. had some funny parts in it. for a movie that was close to two hours. it didn't drag on, a soild 5 out of 10 stars!"}, {"rating": "1", "text": "i gave this film a 1 for the 1 time I laughed through the whole film...... this really was a bad bad and unfunny film. Think the whole hack thing was desperate PR for how bad the film was."}, {"rating": "4", "text": "While I strongly support free speech, I can't really recommend this movie to anyone.\r It is just very boring and juvenile, and not the fun kind of juvenile, but rather the very cringe-worthy one. Having Kim Jung Un poop his pants is just one of the many lazy attempts at humour. While I enjoyed \"This is the end\" by Franco/Rogen quite a lot, I didn't laugh once during this entire movie."}, {"rating": "6", "text": "Decent movie, but it's not worth the money in the cinema. If you like the actors you like the movie, the humor is their trademark. But I would recommend to view it somewhere online."}, {"rating": "1", "text": "I admit that after all of the drama I really wanted to see this movie.  I didn't really expect it to be good, but what I saw may have been one of the worst and unfunniest movies of all time.  The jokes in this movie must have been written my immature 12 year olds.  I gave it a two only because it wasn't visually terrible.  The only movie I've ever shut off in the middle of it was that awful Adam Sandler Chuck and Larry movie.  I really wanted to shut this one off.  But I watched it all because of the hype.  My penis could have wrote better jokes."}, {"rating": "6", "text": "The Interview is totally superior when it comes to acting, storyline and chemistry between characters. There are much sick, funny and entertaining moments in this film, but the second act is disappointing. It’s less funny and more serious. The movie is overall less entertaining than what I expected, and that includes the ending, which could have been much funnier. There are much slow scenes, and the screenplay should have been better. But it’s still one of the films of 2014 that’s worth watching.\r The Interview gets a 6/10."}, {"rating": "0", "text": "Wanted to know what all the sony commotion was about.\r Then wanted the movie to end after 15mins, was very hard to endure such childish, stupid and random jokes that didn't come across funny at all.\r Terrible movie."}, {"rating": "0", "text": "Think about the poor misfit kid from your public school, then imagine the bullies made a move to make fun of him and all the school watched and laughed.\r That's what  this movie is about.\r N. Korea is a serious problem, and one that we as a species should be working to resolve.  This movie can only worsen the problem.  We should all be ashamed."}, {"rating": "1", "text": "Not as good as it is hyped.\rThe film is a very big bore. The whole hype around the movie fades after a few minutes. Why?\rThere would be the first of the many lengths in the film. I rarely have to wait long for highlights. The opening scene has been the right bite but then the dog seems to have this thrown into the water glass.\rThe basic idea of the film is not bad but the execution is cruel dull."}, {"rating": "0", "text": "A dictatorship mockery has gone wrong. Even \" jack and Jill\" is a masterpiece next to the interview. A silly plot, over usage of gay jokes/ references and dodgy Korean accent. It is absolutely unfunny and insulting."}, {"rating": "6", "text": "Despite its overuse of trivial jokes, The Interview is an otherwise well acted and hilarious satire on both North Korean dictatorship and the American media."}, {"rating": "9", "text": "You need to go into this movie with an immature attitude. If you do that, then I promise you then you will enjoy this movie. It has funny references to other movies, James Franco and Seth Rogen are both fantastic in the film and I absolutely adored the \"Firework\" song in the movie.\rHowever, if you like sophisticated comedy then you most certainly will hate it. That's why a lot of people don't like it, But if you just embrace the craziness, then you'll be peeing yourself laughing."}, {"rating": "2", "text": "Ignoring the Sony hack and all the political crap associated with it, this movie was garbage. The entire plot is set up only to make North Korea look bad, not that it is unwarranted, however none of the jokes were original or actually made me laugh, they just felt forced and did not add to the humor at all. The only part that actually made me laugh was the beginning with eminem and the fight scene behind the cameras during the actual interview.\r Overall, this movie got way more attention than it deserved, and it probably would've been just another comedy turd shat out by the film industry like the rest of them were it not for the real-life events that preceded it's release."}, {"rating": "2", "text": "Foreign conflict movies used to be smart and funny; movies like Spies Like Us, MASH, Dr. Strangelove, Top Secret!, Stripes and so on but The Interview takes Kim Jong Un combined with a fart joke and makes and entire movie disguised as a media satire comedy out of it.  Really though, what would you expect from two stoners who know nothing but potty humor?  The Interview has an okay start but ends up being something in the 'worst things you have ever watched' category.  This movie extra sucks for all the negative hype it generated only for the payoff to be worth nothing.  The world is going to see this movie after all the threats that have been made and digital hacks that have been accomplished and say \"They deserved it.\"  For Seth Rogan to go on television and say that this movie wasn't created to cause controversy makes him just as idiotic as this movie was.  This movie relies on celebrity cameos and bottom of the bucket humor to keep it going, but again, we've seen the same in every other one of his movies so not sure why I expected anything different.  Only difference between this and his other 'great' works are that instead of this one being based in a frat house its based in the in the real life setting of the supreme leader of North Korea WHO just so happens to be a film buff, like his insane father, as well a hot head about global relations at the moment; so for Rogan to say nothing was intended by this movie is a total lie.  Maybe years down the road when this conflict is over, yes, but not in the heat of it.  If this fat, unfunny stoner really just made things for the world worse over a nearly unwatchable 'comedy' then I vote that it's time for this guy to go away."}, {"rating": "3", "text": "Sony is overestimating their work. People (and me) curious about North Korea, the most mysterious country in the world. But Sony has done one of the most rubbish propaganda film. Rogen & Franco did try their best but can help its have-no-brain script & incredibly terrible plot. W/o helps of North Korea hackers, this film will never stand even a single day in US cinemas."}, {"rating": "6", "text": "Kim Jong Un probably was responsible for the Sony hack. Maybe he ordered it after he saw the trailer. Then after the accusations of said hack they demanded to co-investigate or else. Things where heating up, North Korea was bringing their army in a state readiness. The keys for the nukes where already in the ignition and all battle-stations manned. WWIII was looming over Western Civilization. The end of mankind was nigh. All this probably happened while Kim was waiting for his copy of the film to arrive (on a Harddisk with a truck coz their internet was down thx to the Yankees). When he did finally see it he came to realize: this is just another stupid Seth Rogen comedy full of fart and f*ck jokes. I'm not wasting my Nukes over this! Soon after they released their statement that they didn't approve of the film's release (or any other future Seth Rogen comedies for that matter) but wouldn't retaliate. The world was safe again.\rSeriously, if they would have started WWIII over this, I would kill Seth Rogen myself if he somehow would have survived. Look, this 9,9/10 score on imdb is not a score for the movie itself. It's a reaction to Kim Jong Un's hack and his threats. So let me give this movie a realistic score: 6/10. It's actually not too bad as far as Seth Rogen comedies go, sometimes it was actually funny. Franco plays a retarded news presenter, Rogen plays the straight guy (cfr Pineapple Express). There is some criticism on the American media and it's obsession with fame as well as on suppressing regimes in general. But let's face it: this movie is just entertainment meant to entertain you for 107 mins and it does that fairly well. 'The Interview' wont change your life or the world. It's not a work a cinematic art to be remembered and cherished for years to come. Sony must be thinking they got the best free advertisement for the movie they could have ever dreamed. Now people will want to see it just to know what the fuss was all about.\rI do agree that people should be able to make any movie they want but in the end even Kim Jong-un must have cursed himself for making such a fuss about it. If he just kept quit it would have been a moderate success, after a few months it would have gone to DVD/BD and after a couple of years few people would have remembered it. Kim, you're advisers should have told you to keep your big mouth shut :)"}, {"rating": "4", "text": "Were it not for the hack, this movie would have been an unknown bomb quietly fizziling to an early DVD release. Now, that is irony.\r Must fill in the remaining space because metacritic does not believe in succinct reviews."}, {"rating": "6", "text": "Moderately amusing.\r Franco is a weak point for me - while Rogen managed to pull off a genuine character (albeit a very Rogenesque one) Franco pranced around being goofy. It just never solidified and the both fall into that \"riffing\" thing they seem to think is funny.\r It runs low on laughs and is very predictable but it's not a waste of time if you're looking for a basic comedy."}, {"rating": "4", "text": "It had some funny scenes. But overall it was meh and I don't understand all the hype. It seems like the Sony Hack(hoax) was a PR stunt for a bad movie. Offensive toilet humor, Seth Rogan is the same old typecast joker character. Don't pay money for this."}, {"rating": "1", "text": "This is a truly terrible movie. It's boring and, unfortunately, not funny at all. The acting is poor and the plot horrendous. People will see this movie because of the hype (I did), but you should resist and pass over this movie."}, {"rating": "6", "text": "Not so bad. I wasn't expecting much so I guess I was pleasantly surprised. A decent comedy. Not sure if it's worth seeing in the theater. Will probably have a pretty good dvd release. All the hacking publicity probably actually saved the movie. I wouldn't be surprised to learn that Sony has actually created the entire hacking scenario. So not as bad as some say and definitely not a 10. Rogan is better than Franco, some good laughs."}], "recommendations": ["the_dictator", "idiocracy", "borat_cultural_learnings_of_america_for_make_benefit_glorious_nation_of_kazakhstan", "a_million_ways_to_die_in_the_west", "movie_43", "sausage_party", "the_happytime_murders", "white_chicks", "wild_hogs", "deuce_bigalow_european_gigolo", "this_is_the_end", "the_hangover", "meet_the_spartans", "anchorman_2_the_legend_continues", "fifty_shades_of_black", "one_year_one_night", "a_haunted_house", "vampires_suck", "evan_almighty", "hot_tub_time_machine", "ted_2", "the_hangover_part_ii", "tropic_thunder", "jackass_the_movie", "barbershop_the_next_cut"]}