{
  "id": 3764,
  "title": "The Babadook",
  "starring": [
    "Essie Davis",
    "Noah Wiseman"
  ],
  "runtime": 94,
  "genre": [
    "Drama",
    "Horror"
  ],
  "description": "A single mother, plagued by the violent death of her husband, battles with her son's fear of a monster lurking in the house, but soon discovers a sinister presence all around her.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lszpCmmPCKHvzn2OBx7bAgXlfhC.jpg",
  "categories": {
    "plot": 8.035714285714286,
    "acting": 8.34375,
    "ending": 6.25,
    "soundtrack": 10.0,
    "cinematography": 8.666666666666666,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Far from traditional, this is by far the best horror film released in the past five years. Like the scariest bits taken from David Lynch but stretched over a 90 minute running time. The Babadook is a highly accomplished debut feature - great film making, powerfully performed and utterly terrifying."
    },
    {
      "rating": "6",
      "text": "Definitely overrated. Its not a bad movie but I thought it was long winded and ultimately not very convincing regardless of what you thought happened in the end. The biggest problem however is that it was not original, which is hard to do. But for that reason, I cannot really rate this thing over a 7. It brought nothing new to the table that we had not seen before and frankly I thought the kid was over acting while the mother was underacting or was just not believable in many ways. Again, its a horror movie so I am not expecting much but at the same time the movie itself didnt have much else to talk about. It was not fun like some horror movies and it was not written well enough to feel plausible. Its kind of like Friday the 13th taking itself seriously... A solid 6 in my opinion."
    },
    {
      "rating": "9",
      "text": "Misbehaving boy tries to fight a creature from a book before his mother realises it's real and locks it in her basement."
    },
    {
      "rating": "10",
      "text": "YOU\rCAN'T\rGET\rRID\rOF\rTHE\rBA-BA DOOOK!\rDOOK!\rDOOOK!\rDOOOOK!\rDOOOOOOOK!\rDOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOK!\rThe Babadook is a terrifying psychological horror film which is really well made and has tense moments. It is incredibly thrilling and it is the hell out of a ride. The film contains EXTREMELY HEAVY HORROR. Its the movie that makes people believe me when i say that Psychological Horror is more effective. If done in the right way, Like this movie, \"THE BABADOOK\", Does.\rOverall Score: 10/10 **** Mister Babadook."
    },
    {
      "rating": "10",
      "text": "Not your typical horror movie, The Babadook is more of a psychological thriller, than a mindless gore fest. Over the years horror movies have become cliched and predictable, but this movie gives us something new and fresh. You don't need that many jump scares to make a good horror movie, just unsettling behavior, and an unnerving environment and situations. Once you see this movie, you'll never think of pop-up books the same way again!"
    },
    {
      "rating": "10",
      "text": "Standing out amongst modern horror trends, \"The Babadook\" focuses on it's characters and intriguing plot, while giving a frightening psychological experience."
    },
    {
      "rating": "8",
      "text": "For sure \"The Babadook\" is one of the best horror movies i've ever watched, the way they work with the camera is really interessing, involve the viewer during the whole movie for who's watching, the kid is a great actor, the woman who interpreted the mom is even better, she did a amazing job, I could feel every single thing that the character wanted to transmite.Great movie."
    },
    {
      "rating": "8",
      "text": "A perfect blend of sound effects and editing zapping you with an enormous \"boo\".The BabadookJennifer Kent's debut as a writer-director is a monstrous call for attention. It is surprisingly one of those few horror flicks that I have encountered that fully uses every aspect of filmmaking in one direction. It channels everything to one simple thing. And it is not a scream that she wants from you, nor an awe gasping moment and definitely not a cheap elaborative sketch spread across the script for an insensitive commercial parlour trick. What she is interested in throwing out, is the character driven plot. All those scenes tied together just gives you a very strong case on what and how theses characters work. And they work fine. More than fine. They are extremely diligent on what they look like.How they are received by the others. In fact, every character is interested in doing so. Even the demons come with an introduction, a warning and are interested in following those set rules by them. They want to be taken seriously. Like they hold importance. A value that they could never reach. But would like to possess. And that is the crux of the supernatural element in the film. The entity is something that is not considered real.The psychological system feeds on fear and grows on your weakness or at least that's what we are told. And maybe that's why among these many set of characters, the kid, the child stands out different. His inexpressive behaviour, nature without any pattern doesn't make sense and it also does. This normalized humane behaviour that blends in at the back of our mind is what's alienated throughout the film. The Babadook then truly transforms into a monstrous lie. The horror title is deserved and the payoff is the oddest emotion that we carry and that is of course that we are attached to the idea."
    },
    {
      "rating": "10",
      "text": "The Babadook is a very unsettling film. Its atmosphere always puts you on edge, and never lets you go until it ends.Even when it ends, you still get the feeling that something's not right."
    },
    {
      "rating": "10",
      "text": "Great interpretative work. This film insufflates fresh air into the horror genre. The story-line has a sound explanation that renders realism into the film. Refreshing, compelling and actually scary."
    },
    {
      "rating": "10",
      "text": "Genuine Terror.Chilling and Sad.Ignore the One-Stars!Never written a review before. Haven't felt the need. But after seeing the 1 star reviews of this film,i just felt compelled.Firstly,what this is.I would say a cross between The Shining and We Need to talk about Kevin. This film is desperately sad. A woman who is haunted,first by her husbands death,then by the Babadook all while looking after her young son. This is a creepy, no jump scare, fantastic psychological horror. A rare gem that plays on all those fairytale fears that you may have had as a kid.Second.What this isn't?!Well,not \"The worst horror in years\".I get that people have different opinions.I do.But this isn't a film that can justify that sort of nonsensical comment. It isn't a dull jump scare-filled blockbuster. The characters are not hot teenagers. They are believable, disturbed and this makes the film the slow,creeping horror that it is.If you are a fan of horror,it really is a must see film"
    },
    {
      "rating": "10",
      "text": "The only movie Ive ever seen where the \"villian\" is never actually seen in their true form. Instead of jumpscares and death. The babadook pulls psychological tricks on the people in the movie. This movie is a great and scary time. The most unique and intriguing movies of all time."
    },
    {
      "rating": "10",
      "text": "One of the best horror films in the past decade, hands down.  It takes a lot to spook me anymore, but this one did the trick."
    },
    {
      "rating": "10",
      "text": "It was verrrrrrrrrrrrry good, if you are a person that didnt give a good review you are the dumbest person ever, untalented and mindless"
    },
    {
      "rating": "10",
      "text": "Nunca me atreví a ver esta película cuando se estrenó, pero me la acabo de ver y está buenísima"
    },
    {
      "rating": "10",
      "text": "Epic !!!! ---------------------------------------------------------------------"
    },
    {
      "rating": "10",
      "text": ":;:;:;:;:;\";\";\";\";'=\"=\"=\"=\"=\"$\"%\"$\"=,,,,,...****&&&####@●●●●●●●》》》》¡¡¡¡¡°°°°°°°°°°°°▪▪{}[]{}[]()),.,_._._"
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°+@+@+@+@+@+@+@+@+@+@@#+@@@@@_@_@_@_@_@_@_@_@_@_@_@_@_@_@"
    },
    {
      "rating": "10",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°°°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=__="
    },
    {
      "rating": "10",
      "text": "----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "10",
      "text": "What every modern horror movie is missing out on. You do not need jump scares, you do not need to see anything disturbing to witch it is laughable. All you need is a book and a house and bing badda boom i've shat myself. Honestly, this movie was terrifying, it was too realistic. This movie made me reflect upon my own life and that is rare coming from a horror movie. Of course, there are a couple slightly disturbing, but you're not laughing because you can sense that what the character is doing, is not plaid for laughs. What they just did was a genuine act of terror. The only, and I mean only horror movie which I have rated 10."
    },
    {
      "rating": "10",
      "text": "This is a splendid horror film that reminded me of Roman Polanski’s Repulsion in that it was horror based in madness and psychological truth and not in fake scares and other gimmicks. I was also not surprised to learn in the bonus features on the Blu-Ray that the director worked with Lars von Trier early in her career. The ending was inspired -- even playful -- psychologically true and the key to the entire film. Brilliant!"
    },
    {
      "rating": "10",
      "text": "A rumbling sound  Ba-ba  DOOK! DOOK! DOOK! That’s when you know he’s around, You’ll see him when you look. Don’t be afraid of The Babadook!\r One of my favorite quotes from the film “The Babadook.” A typical horror fan will see the same horror film with jump scares,cliche’d stories. Examples: (‘Ouija’ Annable, Woman in black 2: Angel of Death), their disposable horror films and are the exact same thing; when you watch ‘The Bababook’ you experience a different horror story and writer-director  Jennifer Kent creates the elements very unexpectedly and ‘subtle’ moments. Kent is off to a great career as a filmmaker as her debut is one of the best horror films i’ve seen in years since “The Exorcist”. Essie Davis  acting is horrific and a well acted portrayal of a mother dealing with a child with behavioral issues, also dealing with a monster. Grade A"
    },
    {
      "rating": "10",
      "text": "I think the movie portrays schizophrenia spot on, only someone that lived with someone with schizophrenia could have written and directed a movie like that so I assume this is biographical and has to do with something Kent lived and it's an artistic way of expressing it.  The desperation of trying to keep \"the monster\" at bay is impressively portrayed."
    },
    {
      "rating": "10",
      "text": "The Babadook lures you in with the familiar childhood fears about something lurking under your bed but delivers something fresh and even surprising.\r Watch here for free http://www.watchfree.to/watch-2a0f2d-The-Babadook-movie-online-free-putlocker.html"
    },
    {
      "rating": "9",
      "text": "Great movie! 2014 and 2015 have had some good artsy horror movies. This and It Follows are bringing some hope for a genre that has fallen into too many cliches. The acting and cinematography of this movie are amazing. The story is terrific. The scares... Ehh, there aren't many but it will get under your skin. Overall I enjoyed this movie. It felt more like a family drama with horror elements more than the reverse. This movie would be a 10 if it weren't for one problem... Whoever did the production and editing should go back to school. Parts of this movie are so quiet that I had to turn my tv all the way up then the next thing I know it's shaking my walls. Wish the sound was more stable."
    },
    {
      "rating": "10",
      "text": "Not even that scary to me, not many good jump scares... although i'll give it praise for being very creepy and chilling, and plus hearing the noises of the Babadook creature was enough to send chills up my spine. crazy creepy atmosphere, loved the cinematography/director of photography by Radek Ladczuk. The kid actor, Noah Wiseman, is very believable and amazing for a kid in a horror flick."
    },
    {
      "rating": "10",
      "text": "I haven't stopped thinking about THE BABADOOK since I saw it. In fact, I can hardly keep myself from SAYING BABADOOK or Ba ba ba DOOK DOOK DOOK. Truly the most memorable film of recent years for me. Great stuff."
    },
    {
      "rating": "10",
      "text": "\"I've never seen a more terrifying film than THE BABADOOK.\"\r So says William Friedkin, director of The Exorcist, a movie that itself is often considered the scariest movie ever made. The Babadook was the best reviewed movie of the holiday season per RottenTomatoes (98%), beating out all Oscar contenders except Boyhood.\r It features the best children's pop-up book ... EVER! And it was probably released in less theaters than The Interview.\r It's a story of grief, depression, and the tension/bond between a mother and child, all seamlessly weaved into an original and captivating supernatural horror flick. The performances of the mother and son are outstanding, although you'll want to strangle at least one of them initially for obnoxious behavior.\r It is currently topping many of 2014's \"Here Are the 10 Best Movies You Didn't See This Year.\"\r That will change by next year as one of \"The Best Horror Movies of All-Time.\""
    },
    {
      "rating": "10",
      "text": "I believe that this is possibly one of the best horrors to be made in recent years. However, i believe the user score is not as high as people have become accustomed to and expectant of a overused horror trope nowadays: the jump scare. This film has no jumpscares what so ever and this is why some people may not like it as much as they expect to s**t themselves for a second and then be \"all is okay now\". The thing that makes the Babadook so scary is that it relies on psychological horror and it's engaging and complex storyline that can actually be dissected and analysed instead of most horror films typical \"this person is possessed, save them\" or \"there is a monster coming to kill us, we must run\" or \"there's ghosts haunting us\". This films psychological horror really is a breath of fresh air as it's eerie, dark and ambiguous tone and atmosphere really send shivers done your spine. This never makes you jump really, but more makes you feel uncomfortable and unsettled. The performances are spot on by Essie Davis and Noah Wiseman plays his role excellently: he seems annoying and ungrateful and then turns sympathetic and understandable. 10/10 for creating an original horror that good es back to it's roots; it wants to chill you for days instead of make you jump for a few seconds. One of the classics of horror now. 10/10. Bravo to Jennifer Kent for creating this masterpiece."
    },
    {
      "rating": "10",
      "text": "This movie is great .. **** great.. One of the best horror movies ive seen in a longgg longggg time... Its in my top five.. Actually in my top 3 .. Because... I only think 3 horror movies are actually scary.but anyways... Idea come from the ring and the grugde ... (Witch is in my top 3 lol) its actually themed after the boogieman.. I origanlly saw this movie on netflix.. And immediatly thought it was wack.. Few months later i gave it a try and i was blown away... Very refreshing.. New type of horror.. Actually good.. I just loved it.. If you dont like this movie .. We cannot be friends this movie is one of the best.. Everything else is garbage... This along with \"it follows\" and \"the ring\" are my all time farverite horror movies .. And i watch ALOT of horror movies."
    },
    {
      "rating": "10",
      "text": "The Babadook is a very scary film with terrifying imagery along with fantastic and scary performance from Essie Davis the film also has underlying themes of depression that is very subtle and is worth a second watch to notice all of  the hints given. The Babadook is up there with likes of the shining and the exorcist\r10/10."
    },
    {
      "rating": "10",
      "text": "The Babadook is a horror masterpiece, a true modern classic. It stands out from the current productions of the genre, it's not your ordinary jumpscare ride. It uses real (in the literal sense of the word) tension and horror, combined with a gripping, powerful screenplay to achieve marvels. Its subtext is very well structured, layering the movie endlessly. Not to mention extraordinary performances from Essie Davis and Noah Wiseman and an breakthrough debut from director Jennifer Kent, already hands down the best horror director in the game nowadays."
    },
    {
      "rating": "9",
      "text": "The Babadook is a truly terrifying movie. Essie Davis gives an amazing performance that should have earned her a best actress nomination and the characters are very believable and not stupid adding to the level of horror. the cinematography is excellent and it takes the possession movie a tired and overdone genre and reinvigorates in way that is cleaver and creepy as hell, seriously give this one a watch it's an excellent example of the horror genre"
    },
    {
      "rating": "8",
      "text": "Finally a good horror film with no annoying jump scares.\r When a disturbing storybook called 'The Babadook' turns up at their house, Samuel is convinced that the Babadook is the creature he's been dreaming about. His hallucinations spiral out of control, he becomes more unpredictable and violent. Amelia, genuinely frightened by her son's behaviour, is forced to medicate him.\r They are so many bad horror films out there right now that I'm pretty tired and sick of seeing, but The Babadook is not like those films. This horror movie did something that Annabelle or Ouija couldn't do, and that is try to be original and scary.\r Babadook is a movie that got under my skin if I got to be honest. The chilling and uneasy atmosphere and it's sense of fear that this movie truly nails it for me and not like most horror films today that lost that sense fear and just allow on lazy Jump scars. The acting in this movie was so real and so top notch that I got to say that Essie Davis did excellent in this movie, even the little kid did good.\r The other thing that this movie get's right is the fact it says \"F'ck jump scares\", and tries to scary the viewing auditions and not be throwing loud sounds to make some people jump a little bit, no it goes for the good old fashioned method of a good horror film and that is showing frighting images that will stick in your mind until the movie is over.\r My only problems with this movie is it's slow at the beginning and the ending to the movie was a bit ridiculous if I got to say.\r But overall The Babadook is more than you're cliche monster movie, it focus on doubt's and depression which made the movie even scary, because if you got doubt's and depression running throw your head and meanwhile there might be something out there after you and your kid then it can mess with your mind and cause terror."
    },
    {
      "rating": "10",
      "text": "The Best Horror Movie in 2014!! Outstanding and Creepy! You must see it, prime up your Emotional. Perfect!!. ‘I couldn’t agree more’. I said. The Babadook adalah sebuah cerita horor yang begitu dalam dan sangat berbeda dari film-film horor biasanya. Bahkan dengan dimulainya opening scene yang jarang sekali saya temukan di film-film horor lainnya telah membuat saya mengerinyitkan alis dan berfikir matang apa yang akan disajikan selanjutnya oleh Kent dalam film debutnya ini."
    },
    {
      "rating": "10",
      "text": "Essie Davis is electrifying in \"The Babadook\", and the storyline itself is profound and crawly. Jennifer Kent's debut is an exemplary tale of catastrophe and tepidity."
    },
    {
      "rating": "10",
      "text": "Outstanding movie that works incredibly well on multiple levels.  It's a terrifying horror movie and a psychological thriller/exposition that any parent can identify with.  Fantastic."
    },
    {
      "rating": "10",
      "text": "Just to put it out there, I loved this movie. When I saw the trailer for The Babadook, I was hooked and, when I saw all the rave reviews it got, I was really excited. Then I saw the movie and I was sure that this was an awesome movie. Essie Davis is spectacular, the music in the background sets the mood perfectly and the way it is filmed just adds to its overall creep factor. Also, I must give this movie kudos for its use of symbolism and for it being the FIRST MOVIE of what should become Jennifer Kent's long and successful film career."
    },
    {
      "rating": "10",
      "text": "It has been ages since I haven't seen such a great horror film. Great characters, plot, and themes to discuss afterwards. It is a modern classic. Give it a try!!"
    },
    {
      "rating": "6",
      "text": "As a horror movie, this movie suffers from what a lot of decent horror movies do today.An intriguing build-up, with an unsatisfying ending that completely goes against the rest of the movie. In fact, the beginning to the last 20 minutes was EXTREMELY promising. A fantastic introduction to the Babadook entity, and a few thrilling sequences. The acting was also great. By both the woman and the son. But, again. That ending. it just crushed me."
    },
    {
      "rating": "10",
      "text": "There are the horror movies that acheive greatness by scaring you by what's on screen, jolting your conscious mind, and there are the ones that do it by sinking into your unconscious mind like a splinter, lingering and haunting you well after the show is over.  This is one of the latter, and a truly great example of it.  I've seen it a few times now and it gets better with each viewing."
    },
    {
      "rating": "2",
      "text": "My friend, who is big into horror films, demanded we watch this movie. \"It's the scariest movie of the year!\" she exclaimed over and over. \"We have to watch it!\" The scariest movie of the year? Well I have to watch that don't I? So, we did. The thing is, I really wish we hadn't. The Babadook starts off slow, building tension between a stressed out mother and her son, who I can only assume suffers from some form of mental handicap. Throughout the first half, the film builds tension, but never enough to have you on the edge of your seat, just barely enough to keep your eyes on the screen. The second half of the movie is even worse. There is a climax that just feels rushed and sloppy, and the ending literally caused me to throw my hands up in the air. It was just, terrible, for lack of a better word. There is nothing scary about The Babadook. There is little even worth watching in The Babadook. The only saving grace was the beautifully crafted book they used in the movie. Outside of that one prop, this film was an utter waste of time. It easily falls into my list of the worst films I've seen in 2014."
    },
    {
      "rating": "2",
      "text": "This movie gets a lower score due to how much potential it had. Given a good script rewrite it could have been a classic. It has some small pacing issues but thats nothing compared to the tiny cast of entirely unlikable characters. The kid is awful from the get go and you really hope he's the first to die. You empathize with the mom a bit for dealing with the little sh¡t but she isnt very likable either. Perhaps through the use of flashblacks they could have made you care about them more or if they added more characters to help give context rather than isolate the characters then they could have achieved the same result. But, in the end, it is just two unlikable characters that can't die soon enough."
    },
    {
      "rating": "10",
      "text": "I watched the Babadook and I must say I quite liked the movie because its type of horror distinguished itself from the others and left out the jumpscares advancing to the horror itself, had incredible performances from the two lead actors, Essie Davis and Noah Wiseman, a good story that led us to sympathize with the characters and to fear for them, and even a tone and a soundtrack that stand out. For me it deserves 10 on a scale of 1 to 10, because it was a great movie that really worked thanks to Jennifer Kent's amazing storytelling, and let's hope they launch The Babadook Book because I really loved its iconic character."
    },
    {
      "rating": "10",
      "text": "Though not totally scary, this movie clearly serves as a complex psychological drama that keeps you in suspense the whole time. The performances are remarkable, the scenery and filming are unusually excellent, but the best part is the plot itself.. Is Amelia fighting a real monster, or her own and broken memories and ghosts? To make it simple, this movie is not only spooky and weird, but also emotive and (most of all) mesmerizing."
    },
    {
      "rating": "6",
      "text": "A major let down after all the great reviews from critics and audiences. Very predictable story and not the thriller or psychological movie I was expecting. Ending was the final disappointment."
    },
    {
      "rating": "10",
      "text": "Jennifer Kent directs \"The Babadook\" the knew Australian Horror film, starring Essie Davis. This movie does not rely on pointless jump-scares or loud noises to be unsettling. This movie disturbed me more then any other thriller or horror film has since Johnathan Demme's \"The Silence of the Lambs\". And it even could be the best thriller since \"The Silence of the Lambs\".\rThis film has been compared to Stanley Kubrick's \"The Shining\". I can see why. The film-making strategy and over all story are very similar, but the use of electrify imagery, and implications outmatches \"The Shining\", by a huge margin.\rJennifer Kent's debut is exciting. If any of her upcoming projects are half as good as this one is, we may have the next Spielberg."
    },
    {
      "rating": "8",
      "text": "Much less a horror film than a chiller, \"The Babadook\" was a complex and profoundly unnerving film. It really was very good at making me squirm uncomfortably in my seat. Its use of imagery and sound to unsettle me, rather than jump scares to catch me off-guard, made it a far more interesting and worthwhile experience. I was not frightened, per se, but I was certainly creeped out. Essie Davis and Noah Wiseman gave exceptional performances and I'm pleased Davis is getting so much critical recognition for her role, as she is unlikely to get much attention on the major awards circuit, which is a damned shame because she plays her role to perfection, embodying both the victim and the villain of the movie by its gut-wrenching end. I did not enjoy \"The Babadook\", I did not need to. If I enjoyed it, it would not have been half as good as it was."
    },
    {
      "rating": "8",
      "text": "There are so many dumb horror movies out this year, but, believe you me, The Babadook is not one of them. For a 7 yr old, Noah Wiseman is a fantastic actor!\rAn interesting story, an \"A\" rated performance from the cast, and witful directing from Jennifer Kent round up this movie's strongest points. The ending though was rather dull and not quite what I expected, but I think it would have really soured my day if it concluded on a more tragic note (like most horror movies do).\rIn all, The Babadook is an enjoyable movie!"
    }
  ],
  "recommendations": [
    "the_conjuring_2",
    "it_follows",
    "the_conjuring",
    "the_witch",
    "it",
    "insidious_chapter_3",
    "the_ring",
    "ouija_origin_of_evil",
    "the_woman_in_black",
    "the_prodigy",
    "the_descent",
    "the_texas_chain_saw_massacre",
    "the_fly",
    "scary_stories_to_tell_in_the_dark",
    "the_possession",
    "the_conjuring_the_devil_made_me_do_it",
    "insidious_chapter_2",
    "sinister_2",
    "lights_out",
    "the_exorcism_of_emily_rose",
    "annabelle",
    "saw",
    "the_black_phone",
    "hellraiser",
    "insidious"
  ]
}