{
  "id": 2046,
  "title": "The Game Plan",
  "starring": [
    "Dwayne Johnson",
    "Madison Pettis"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "Bachelor football star Joe Kingman seems to have it all. He is wealthy and carefree, and his team is on the way to capturing a championship. Suddenly, he is tackled by some unexpected news: He has a young daughter, the result of a last fling with his ex-wife. Joe must learn to balance his personal and professional lives with the needs of his child.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fcLFvIqCUrhY96mkSmr3okxaMEw.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.4,
    "ending": 4.2,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 6.444444444444445,
    "action": 1.5
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Fun to watch - not much there in substance - then again I wasn't expecting any. I thought it could have had a better script - but I went away smiling and feeling good. More than I can say for some recent critically acclaimed films."
    },
    {
      "rating": "3",
      "text": "By the time it came out on DVD, I forgot it ever existed. That sums it all up. I don't hate it, or love it. I nothing it."
    },
    {
      "rating": "8",
      "text": "Very good and very funny. The rock is great in this movie. This is a must see"
    },
    {
      "rating": "7",
      "text": "At the end of two hours (especially if you have young girls in the house) you won't feel like you burned off brain cells. Dwayne Johnson could've phoned it in and got a check for his time, but instead goes through the whole film looking like he actually enjoyed the acting process. This is a decent family film, much better than Disney's recently released, abysmal Snow Buddies."
    },
    {
      "rating": "10",
      "text": "You people who say this movie sucks can shut up, the rock...well rocks and this movie was great. I loved it when he was sedimental about losing his daughter."
    },
    {
      "rating": "9",
      "text": "A very great and touching movie, with a great story and likable characters, it is extremely funny, a very enjoyable family movie, a very great movie all will enjoy."
    },
    {
      "rating": "9",
      "text": "Cutee Moviee !! it showa and tells alott . its a great fa,ily moviee, and is very enteraining . it was a greatt movie and if you have kids like 8 andd up its a wonderfull they will lovee it . I give it twoo thumbs upp !!"
    },
    {
      "rating": "3",
      "text": "The Game Plan went horribly array.\rA football playing dead beat dad basically tries to create a relationship with his daughter. The movie has poor acting, terrible script, and is really just a boring movie."
    },
    {
      "rating": "9",
      "text": "Thought this was a really cute movie. I took four nine-year-old boys to see it and they loved it. My husband and I thought it was entertaining. Great family movie!"
    },
    {
      "rating": "7",
      "text": "This movie is fun to watch and it's very entertaining too. First they put Vin Diesel in a kids movie and now The Rock I wonder who's next. But overall this movie is worth watching for all ages heck even a baby could enjoy this movie."
    },
    {
      "rating": "0",
      "text": "Horrible! I had to see this piece of crap with a group of friends and I left with a headache."
    },
    {
      "rating": "10",
      "text": "This movie is great. I don't know what you guys are talking about? Its pretty funny and very entertaining and very sad. Its also really unpredictablebut . SEE THIS MOVIE"
    },
    {
      "rating": "8",
      "text": "Come on, give the movie a break! Put it in perspective. If you have kids (8 yrs +) there are far worse movies to take them to. I was entertained and my Daughter loved it. If you don't have kids why on earth would you have gone to this movie in the first place?"
    },
    {
      "rating": "0",
      "text": "This movie was terrible. I actually liked Maid In Manhattan more than this. For god sake, they might as well put make a Pacifier 2 while they're at it."
    },
    {
      "rating": "0",
      "text": "I had to watch this on a long plane ride and I would rather watch the clouds and the wings. Truly insipid, why are people with kids bringing down the collective IQ for movie watching audiences? Really really stupid. The rock cannot act his way out of paper bag and spends most of the movie flexing and smiling."
    },
    {
      "rating": "10",
      "text": "This is the best movie... especially the end when you could see Joe being very sentimental losing his daughter. it was really touching. i cried watching this movie. the critics are ALL wrong!!!"
    },
    {
      "rating": "0",
      "text": "Oh please, give me a brake, what a terribly played movie. You could have at least chosen hayden christenson as the main role."
    },
    {
      "rating": "9",
      "text": "Typical Disney movie, but at least it's good clean fun. A winner."
    },
    {
      "rating": "3",
      "text": "We know the drill. We know the narcissistic jock will be taught a life lesson or two from his long-lost daughter so why not make the transformation more meaningful and let Joe Kingman(Dwayne Johnson) be a complete utter a-hole? The star quarterback is an egomaniac but seems like a nice enough guy. When Peyton(Madison Pettis) shows up at his door, we should feel as if this arrangement of parent and child will never pan out. That's why \"The Game Plan\" is hopelessly innocuous; a family film that suggests, but glosses over the very real issue of promiscuous athletes and their illegitimate children. This Disney production is technically yet another family-friendly sports film, but the most exciting example of kinetic activity isn't the big football game; it's a handsomely mounted ballet recital. \"The Game Plan\", however, intended or not, manages to sling one pointed satirical arrow at the culture of modern athletics. Joe is allergic to cinnamon. The spice would seem hard to miss but he eats the cookies his daughter baked for him in seemingly blissful ignorance. Joe is like the athlete who claims he didn't knowingly ingest HGH(human growth hormones). \"The Game Plan\" could've used more edgy moments such as this. It suffers from an overdose of cuteness."
    },
    {
      "rating": "7",
      "text": "It wasn't great but it had enough comedy in it to make it entertaining, and the Rock has shown once again that he can be a successful actor. Just good fun for the whole family."
    },
    {
      "rating": "0",
      "text": "Well, it is infected with a disease, a disease that cannot be cured: The Black Death. It felt as if I had that disease throughout the film, I felt weak, I gained boredom every second. Maybe it was the popcorn that of which is giving me lumps on my body? Is this it? Is this all the rock has to offer? Yeah, sure the story is fine, but the movie itself never stays focused, it never is on a certain balance. The main attention is the humor, which surprisingly is funny, and the Rock isn't all that bad in this, to me he sucks as an actor. In The Scorpion King he smelt. But in this he wasn't bad, as a Football player, that maybe his best role so far. That little girl though is so annoying, and the most of the comedy near the end wasn't there, I didn't catch any. It was too light hearted, very weak, and overplayed, the ending was like any other ending, maybe they could at least try something different than just showing the final game and let the good team win. It is so predictable, and obvious, the dialogue made me roll my eyes because dah they were gonna' say that. But the rest of the movie is okay and funny, but the only real engaging thing about the movie is the Football parts, those parts are good. just the ending wasted the whole movie, and after a while it seemed like the movie ran out of ideas. I just don't get why there has to be such a boring plot, because you know in some movies like Master and Commander: The far Side of the World is predictable but done very well. I love that movie, I adore it, it is the best movie of its year, it beats Pirates, the best Pirate movie ever. And it got 10 Academy Awards, by Russell Crowe, he performances excellently. You know I rather would rate this movie a 10 and talk about Master and commander than this, I would but I just have a few things to say about The Game Plan. So, overall, do not watch this movie, it is not worth it, nor for free, I watched 3:10 To yuma for free because the manager gave us free passes due to poor service last time at the Theatre, but don't waste your free Sunady night to go to a movie with free movie passes to this when you can go see a good movie. Believe me, this movie sucks. I fell asleep for the first time ever in a theatre, this movie is so boring. Period. I never fell asleep in Epic Movie and it was terrible, worth a 0/10, and at least it had exciting things happening, with stupid but fun context from beginning to end."
    },
    {
      "rating": "0",
      "text": "Really ridiculous, when a girl comes to your door without an agent and gives this strong buff football player saying that he is her Dad. You can't just say you are her Dad, when you would be knowing her your entire lfe if you had a Kid. So where did she come from? Is this a joke, because it sin't funny. There are so many flaws that is horrible."
    },
    {
      "rating": "5",
      "text": "Okay attempt at a movie for The Rock, and the movie is actually not that bad. I found myself liking it at some points, and other times it was dismal and bland. Fair exchange."
    },
    {
      "rating": "5",
      "text": "The chemistry between Dwayne Johnson and Madison Pettis is delightful as anything, but the end result for this Disney output is merely a mixed bag. An average family entertainment."
    },
    {
      "rating": "5",
      "text": "Te entretiene pero es una película muy vacía, super irreal y bastante básica."
    },
    {
      "rating": "6",
      "text": "Nothing special is in this movie. It didn't have a great script, but had some funny parts. The actors were not great, but they improved towards the end. The ending was actually good, which surprised me. It is worth a watch even with it's flaws."
    },
    {
      "rating": "10",
      "text": "dope movie this my favorite movie no lie il watching again Nd again  dope fam"
    },
    {
      "rating": "7",
      "text": "This is a Disney movie, so its obviously one that all the family can watch, as it has a universal rating. Its somewhere between a general family movie and a comedy and indeed there are some pretty funny moments in it. I haven't seen a Disney movie, even if it is live action, for a while, since I think that one with Tommy Lee Jones being made a fool out of (the one where he's in a house with cheerleaders lol) but I thought it'd be good for a laugh to see this one as this time its butch Dwayne 'The Rock' Johnson playing the lead role and having to deal with a VERY witty little girl, which was indeed, quite amusing!There are some gags that adults will note and enjoy, such as the license plates on Joe's cars and then of course there's the visual gags which im sure children of all ages will enjoy, such as when Joe is making a nutritious smoothie full of food that you wouldn't expect to see go into a blender, put it that way! and Peyton ends up lifting the lid as its blending it and it goes everywhere.Its also quite amusing to see 'The Rock' attempt to do ballet as he gets involved with Peytons ballet class (it turns out that there's quite a twist in the story which requires her to take photos of herself in the ballet class she goes to), like I say I'm all for seeing such people make a fool of themselves I must say haha! also the actress who plays the ballet instructor is Roselyn Sanchez, who you might know from the US drama show 'Without A Trace' (she plays Elena Delgado). Its clear from the movie that 'The Rock' and Madison Pettis, who plays the girl Peyton, got on quite well, or they certainly acted quite well I thought, the two of them are pretty animated (pardon the Disney related pun) and it is interesting to see how Joe responds to some of Peytons more challenging questions. Seeing how the other members of Joes football team respond to him having a more feminine side to himself is also amusing at points and its also quite typically Disney in terms of the story and what the moral is about, in terms of the importance of family above everything else (Joe says early on in the movie that all that matters to him is football, nothing else).Its pretty obvious stuff but it is a family movie and a Disney one at that and its certainly not un-entertaining.The movie is pretty amusing in points and im sure if you watched it with some younger viewers, you would enjoy it with them enough for it to be worth watching, so yes I would recommend it. Its a decent enough Disney movie and it had me laughing a few times - you can't beat a decent Disney movie! its hardly earth shattering stuff but it could be worse."
    }
  ]
}