{
  "id": 3333,
  "title": "The Jackal",
  "starring": [
    "Bruce Willis",
    "Richard Gere"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Thriller",
    "Adventure",
    "Crime"
  ],
  "description": "Hired by a powerful member of the Russian mafia to avenge an FBI sting that left his brother dead, a psychopathic hitman known only as The Jackal proves an elusive target for the people charged with the task of bringing him down: a deputy FBI director, a Russian MVK Major,  and a jailed IRA terrorist who can recognize him.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wkLF73oenC1n1DDKKU7oyLKVcMa.jpg",
  "categories": {
    "plot": 6.875,
    "acting": 7.5,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.857142857142857
  },
  "reviews": [
    {
      "rating": "7",
      "text": "..........,,,,,,,,,,nihihiihin@#$%^&*()),.?!;:\"'+×÷=▪○●♤♡◇♧{}[]¿¡》《¤•°☆▪○○●■●□□●○●●▪▪☆⊙●●■■▪¡"
    },
    {
      "rating": "7",
      "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "7",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "7",
      "text": "●°●°●°●°●°●°●°●°●°●°●●°●°●°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_==_=_=_=_=_=_=_=_=_=_=_=_=_=_=_="
    },
    {
      "rating": "7",
      "text": "(Around 55 minutes) Jack Black improvised his lines in the scene where the Jackal kills him. His instruction was to act stupid and annoy Bruce Willis."
    },
    {
      "rating": "7",
      "text": "________________________________________________________◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "7",
      "text": "●●●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■■\",\",\",\",\",\",\",\",\",\",\",\",\",\",+,+,+,+,+,÷.÷,=,=,=,=,....."
    },
    {
      "rating": "7",
      "text": "■●■●●■●■●■●■●■●■●■●■●■●■●■●■●■●■●■●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●"
    },
    {
      "rating": "7",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "7",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》□》■"
    },
    {
      "rating": "8",
      "text": "Underrated movie. Sure, it's a bit absurd at times. But that's what makes it entertaining.Most characters aren't that great though. But I found it entertaining. It delivers on the points this kind of movie is made to deliver on."
    },
    {
      "rating": "8",
      "text": "The Jackal is a 1997 film starring Bruce Willis, Richard Gere, Jack Black, Sidney Poitier and Diane Venora, it's a thriller with bits of action splattered throughout. The Jackal is not a bad film, some of the action scenes are good and some scenes more dull and depressing than others but I think because of the teamwork put in it's okay... There are some ridiculously stupid scenes that are so laughable though and moronic beyond belief, for instance, Jack Black gets asked by the Jackal (Bruce Willis) to stand Infront of a huge, powerful cannon gun that separates limbs from other limbs and spits out bullets faster than a dog on heat, this cannon would make mashed potato out of a human lol. However Jack Black being dumb stands in front of the Jackal's cannon knowing full well he's going to die, holds out a packet of cigarettes as instructed and sobs like a little girl lol. I've no sympathy for him because he's dumb and got himself killed because that's stupidity beyond belief and so unrealistic because any normal person wouldn't of stood infront of that cannon to die. Besides that stupid scene the Jackal is a good and fairly decent film but not perfect by any means. Still worth buying on dvd or watching on television though. Richard Gere plays some fake Irish accent dude named Declan Mulqueen who eventually stops the Jackal with the help of some lady friend. Overall an okay film."
    },
    {
      "rating": "10",
      "text": "An amazing movie, a real gem. Bruce Willis stole the show, the character he played was amazing, everyone has a rush of excitement for a master of disguise. We know films and this is a must see."
    },
    {
      "rating": "4",
      "text": "Essentially a modern day (Well, 1997 anyway) remake of The Day of the Jackal the movie revolves around a joint operation between the FBI and the MVD as they the hunt for a paid assassin.    The Jackal is a curious movie in that it in manages to be both absurd yet still feel flat for the majority of it’s running time. A good chunk of the movie is spent watching The Jackal (Willis) go to what seem like extremely convoluted lengths to complete his mission whilst the various members of law enforcement, plus Richard Gere and his terrible Irish accent, sit around and then suddenly come up with a revelation of what his plan may be. Once they do catch up to him the action lacks any real tension or seemingly any consequences (everyone just carries on as normal seconds after seeing a man leap in front of a subway car!) and one particular scene involving Gere and two subway cars is just laughable.    I’ll give this movie props for not being as dull as a few other movies I've watched recently but overall this is pretty damn poor..."
    },
    {
      "rating": "1",
      "text": "Remake foireux du film remarquable de 1973, ce Chacal de 1997 n'en reprend que la trame de base pour en faire un hamburger bien gras et bien dégueulasse : si Hollywood est (souvent) la malbouffe du cinéma en règle générale, on tient là le big mac qui dégouline de partout.ça commence avec le FBI qui intervient à Moscou (oui, oui, Moscou en Russie...) en coopération avec les autorités russes, ben voyons ! ils ne doutent de rien ces scénaristes yankees à chercher leurs \"brillantes\" idées dans des Kinders Surprises. La fliquette russe qui collabore étroitement avec le FBI est trop \"jolie\", alors on lui a collé une vilaine brûlure en plastique sur la joue (une dure-à-cuire sans doute). Quant à Sidney Poitier, il a besoin d'argent.Puis le Chacal fait son entrée en matière en la personne de... Bruce Willis ! de mieux en mieux, dites-moi, mais c'est un festival ! Cette buse de Bruce change de déguisement toutes les 5 minutes (il lui manque juste le nez rouge) et s'il tente de paraître plus sobre que d'habitude, il a toujours l'air con (sous son déguisement du jour) le petit sourire en prime... (on avait dit \"sobre\" Bruce, putain !).Comme si cela ne suffisait pas, voilà le gigolo qui fait son retour avec Richard Gere qui vient rouler des mécaniques parce seul, lui, le seul, le grand Richard a vu le Chacal ! mais ouais mon biquet c'est bien.Après, je ne sais plus, devant tant d'inepties j'ai dû user l'avance rapide jusqu'à la fin parce que l'air de rien, cette \"comédie\" est d'une grande mollesse. On rigole de dépit devant ces pitreries et on s'emmerde à 100 balles de l'heure. Et on pouffe, on pouffe : pfff, pfff, pfff..."
    },
    {
      "rating": "4",
      "text": "Surprisingly disappointing considering the leads, though I blame myself for setting my expectations too high."
    },
    {
      "rating": "3",
      "text": "A retelling of The Day Of The Jackal, and a really poor one at that.For an action thriller, this is dull and absurd. And that's saying something."
    },
    {
      "rating": "9",
      "text": "The Jackal was an impressive movie. good rolls for the main characters and everybody played their part good. But Bruce Willis and assasinators have become a stereotype now ha"
    },
    {
      "rating": "6",
      "text": "A competent and effective work, but devoid of any originality.In this film, we see the FBI's attempts to stop a mysterious killer whose face was never seen by anyone left alive to tell the authorities. He was hired to act and avenge the death of the brother of a Russian mafia boss, killed by US agents in an operation in Moscow. In order to identify their man, federal agents must go to prison and negotiate the release of a former IRA agent, the only one who has seen the killer's face.The film is quite good, but to a certain extent it reminds me of another one I saw, “The Rock”, a thriller where, as in this film, the success of the authorities' efforts depends on the help of a foreign prisoner. In both films, we also see the human side of this character, who is presented to us in the most sympathetic way possible. The time element is also an important factor in both films, where all the action takes place in a true race against the clock. I cannot, however, say that everything works perfectly: there are several points in the story that seem to me to have been included without any real use for the plot and perfectly illogical, exaggerated situations (the final climax with the machine gun is the most obvious since a real killer would never do that) or absurd (for example, the amount paid to the killer, who appears to be being paid to rob Fort Knox, given the exorbitant amount).Despite embodying a truly brutal and cold character, Bruce Willis is the actor who stands out the most in this film. For me, he really managed to deliver what the character demanded of him: a methodical, sinister and cruel brutality of someone who made killing his profession and is very meticulous in what he does. Richard Gere was also good, although in a much more monotonous, monotone, sometimes boring and lazy register. The rest of the cast is simply giving them the support they need, without really standing out, especially Sidney Poitier. Mathilda May is the actress who receives the worst material and the one who does the worst in the film, as a result.Despite being an action thriller movie, the pace is relatively slow, although that is a lesser evil and allows for the development of some sub-plots that would otherwise be stillborn. The cinematography does a very competent and safe job, and the filming was very well executed. The props, sets and costumes helped, but it's the special effects used, in conjunction with the excellent work of the action doubles, that bring the most impressive scenes to life."
    },
    {
      "rating": "10",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "7",
      "text": "Summary: A ruthless assassin (Willis) has been hired to eliminate someone at the very top of the U.S. government. Constantly changing his identity and location, he is known only as the Jackal. Everything about this assassin, including his timetable, is a secret."
    }
  ]
}