{
  "id": 829,
  "title": "The Hunger Games: Mockingjay - Part 2",
  "starring": [
    "Jennifer Lawrence",
    "Josh Hutcherson"
  ],
  "runtime": 137,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "With the nation of Panem in a full scale war, Katniss confronts President Snow in the final showdown. Teamed with a group of her closest friends – including Gale, Finnick, and Peeta – Katniss goes off on a mission with the unit from District 13 as they risk their lives to stage an assassination attempt on President Snow who has become increasingly obsessed with destroying her. The mortal traps, enemies, and moral choices that await Katniss will challenge her more than any arena she faced in The Hunger Games.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lImKHDfExAulp16grYm8zD5eONE.jpg",
  "categories": {
    "plot": 5.916666666666667,
    "acting": 5.852459016393443,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 3.7777777777777777,
    "familyFriendly": 4.818181818181818,
    "funny": 5.666666666666667,
    "action": 6.375
  },
  "reviews": [
    {
      "rating": "6",
      "text": "What starts off being one of the year's slowest movies eventually catches up to the hype. The first 45 minutes of the film was so slow, I started thinking to watch Creed instead. But then the action started coming, and I eventually found myself enjoying the film. Of course, it isn't Catching Fire great, but it is still a satisfying conclusion to the franchise. The storyline was very predictable and very sad and even dark at times, but the film does have its great scenes. This was probably the worst Hunger Games there was tied to the first Mockingjay, but it is still fun to watch with your friends if you are a teen. (68.5/100)"
    },
    {
      "rating": "4",
      "text": "A disappointing, dragged-out, occasionally ludicrous conclusion to this storied action adventure franchise. Whatever audience goodwill that had been built up in this film's forerunners (especially the second and third installments) is squandered here in a boring, inconsequential, poorly executed finale, easily the worst picture in the series. Had this film and its most recent predecessor been combined in a single film rather than two needlessly padded, mediocre offerings, the franchise might well have been finished off with a bang instead of a protracted, silly yawn, a genuinely lost opportunity."
    },
    {
      "rating": "6",
      "text": "Falling victim to unnecessarily splitting its source material, MOCKINGJAY PART 2 feels much less satisfying than it should. PART 1 saw a strong build and continued interest, which was only occasionally reciprocated in the finale. Lawrence and the cast are strong as ever, but it's still disappointing."
    },
    {
      "rating": "6",
      "text": "The Hunger Games: Mockingjay Part 2 should really only be approached by fans, and even then I think they might be un-satisfied by the conclusion like I was.  This film builds up very well but it doesn’t fully realise where it means to be and it just wasn’t that great.  I’m not a big fan of The Hunger Games Franchise but I don’t hate it at the same time, these films are all just ok at the end of the day and I am kind of glad I am done with them.  If you enjoyed the previous films you probably will enjoy this one, but I am not making any guarantees on that.  The action is good and I will say the build up to most of the acting is well done, but other than that I can’t give much praise to this one, especially the pointless nature of the 3D which feels like just another way to squeeze more money out of its fans.  Overall, not really my thing, you could probably wait for this one to come out on DVD although I suspect you will be waiting a while, as this one will probably do very well at the Box Office."
    },
    {
      "rating": "6",
      "text": "Mostly a dull affair, with a few exciting moments.  I liked the previous 3 films but this one certainly shows why it was a questionable decision to split the final novel in half."
    },
    {
      "rating": "5",
      "text": "The action is decent and the acting is as great as always, but the pacing is atrocious and as a big finale, it feels very anticlimactic!"
    },
    {
      "rating": "6",
      "text": "What a disappointing finale to this movie series.  I really liked the books, though I thought the third one would be hard to make into a film.  The first and second films were very entertaining and did a good job of capturing what the books were about, even with changes and omissions.  The third book just didn't have enough in it to make two movies and both Mockingjay films suffer from the decision to make two films.  But two films makes more money right?  Jennifer Lawrence has become one of the best actresses of her generation, but she can't save this.  The choices made to change key plot points really detract from the story here.  It is actually boring at times.  It is executed poorly.  How could they do that to these books?  Two movies makes more money than one.  I hope Hollywood eventually sees that this choice can ruin something that could have been great.  This is just ok, nothing more."
    },
    {
      "rating": "5",
      "text": "I never thought much of this series and I have not read the books. The first film was the best and this one is more interesting than part one. I will not give away the end but it was pretty much what I expected. All four films never rose to the level of the LOR in any category. Lawrence again looked bored as did Woody. Hoffman is dead and did this push him over that edge? In, fact everyone seemed relieved that it was over. I sure am.  Yes, it made a lot of money but no on will remember or care about this film or the series of all four once you close the door and head to your car."
    },
    {
      "rating": "6",
      "text": "Having followed the series casually, enjoying it but not exceptionally so, I can say that Mockingjay: Part 2 earns brownie points for capping off a series without ruining it in the finale. It was emotionally hitting even to someone who wasn't wholly invested in the story and the moments of genuine tension were enthralling. The end did feel a little rushed though.\r Jennifer Lawrence delivered a pretty fantastic performance as Katniss Everdeen (still one of the daftest names for a character ever, regardless of their position as the series' protagonist) although it was clear that there were a few flaws with the character's core writing and consistency.\rThe same can be said for Donald Sutherland, who commanded a respectable and powerful presence as an actor despite his character, President Snow, once again being somewhat thin.\r All in all, this wasn't a bad movie but I'd hardly call it this year's biggest blockbuster. Some of the dialogue was a little repetitive and some of the scenes dragged a bit."
    },
    {
      "rating": "6",
      "text": "A fitting if artless end to the Hunger Games series, with the exception of a bunch of added scenes this is pretty accurate to the book, but the amount of padding both here and in Mockingjay Pt. 1 really dilutes the experience, ruins the overall pacing, and creates an oppressive atmosphere without adding much to the thematic content.\r Nothing in the film is quite as believable as it should be, and scenes that should hit hard don't have too much impact, or they have their impact delayed. For instance, the much-hyped sewer sequence features the only decent action in the film and is admittedly freaky and tense, but the way it concludes seems tossed together and I didn't really believe it. There's a scene at the gate of Snow's mansion that is pretty sloppy. The writing was fine and much of it was true to the book but they did not go far enough into ideologies IMO. Given that they were going to add a bunch of stuff anyway, I wanted discussions on the immorality of war, on whether or not the rebels should even continue to have districts, and whether or not there should even be a central government anymore after the war.\r The performances are fine as always, though the movie still lingers far too much on Lawrence's Katniss, who's intense and determined and finally trying a little tenderness, but doesn't have that much to do, nor does she have a complete arc in this film that results in a change in her character. The film wants to get into her head space, but she still seems like a bit of a stranger. IMO the film does not really capture the inner turmoil she went through in the book, especially during the last act of the story, where it seemed like she was totally losing her mind. She does have a big breakdown that is well-acted but for the rest of the film she plays it pretty one-note. Philip Seymour Hoffman's death is also felt in the last act, but at least it gives Haymitch something more to do. Elizabeth Banks has one scene where she bids goodbye to Katniss and steals the show. Aside from the brooding Gale and Peeta and Coin and Snow (the two best supporting performances in this film - I wanted more of Donald Sutherland's scenery-chewing), the rest of the cast don't do much because the director is so focused on Katniss' brooding self.\r It's whatever and by the end of it I was actually legitimately bored. That should NOT happen. I read all of these books in a weekend because I was so addicted to them. But the movie just drags on and on with inconsequential scene after scene that does little to advance the story, characters, or themes beyond what has already been established. Given the source material, I thought this could be the strongest of the films, but in fact, it might be the worst. A lot of its impact is flat-out diluted due to sloppy directing and editing choices. For fans of the franchise, it's still worth watching and it does provide a subversive and fitting conclusion for this series. I just wish it were more artfully done and made with more confidence."
    },
    {
      "rating": "5",
      "text": "Jennifer Lawrence was terrific. The ending was satisfying in a very happily ever after sort of way. The beginning outlining the impossibility and danger of the trek to the palace was a nice setup. In between however was sorely lacking in believability. The trip of 76 city blocks to the capitol center taken underground felt like about 7 blocks. The goofy eyeless man snake lizardy fanged thingies came out of nowhere and faded almost as weirdly and quick after polishing off a couple of folks. The stadium filled with freed inhabitants who had been fighting and starved and sick and helpless for years was filled by what looked liked a bazillion people. Absurdly unrealistic. The \"big moment\" at the end was telegraphed so far in advance all I could say was, so do it already, tired of waiting.\rThe ending and quality of effects saved it from being disappointing but the slow first half followed by strangely fortuitous action sequences in the second half made this merely ok."
    },
    {
      "rating": "4",
      "text": "Lionsgate chose a director who could manufacture needless film in an effort to take a story that could have been something for the cinematic ages and turn it into a cash-grab.  A franchise should end with some sense of melancholy that it’s over, that the characters we’ve invested in have no more stories to tell.  With The Hunger Games: Mockingjay – Part 2, that melancholy is replaced with a sense of relief that the series, and the bilking, have finally ended."
    },
    {
      "rating": "6",
      "text": "If there's anything good about this movie is Jennifer Lawrence. And she portrays Katniss very well. Everdeen (still a dumb name) is pretty much weighed down by the 3-movie war, and her facial expression is more than an indication of that. So while the movie worked on that aspect, it ultimately dragged too long. I like using the word \"drag\" because intensifies that notion of something being slowly, really slowly drawn out, which happens here to my annoyance. Another thing, splitting the franchise's major conclusion is beyond irritating. It's tiresome, makes no sense, and affects the two-part films in predictable outcomes. If you want to make a movie about Snow's conflict with Katniss and build the world around them, that's fine by me, but for that, you have a long runtime, and editors. Yes, that's what editors are for. I hate when movies like these start off where the predecessor concluded. It just feels like I'm watching an extended episode of a TV Show and I pause at the very middle, one year later I continue the episode. This year's Maze Runner did it the same thing, though that movie was more of a crapfest.\r Visually, it's sound -- no question about it. The CGI is passable, and the cinematography is amazing. The camerawork is fine when the action isn't taking place in the cliché-ridden sewers scene. That scene with the zombies was more clichéd than anyone could fathom. The writers must have found their ways into copycatting similar jump scares, cheap jump scares. There's that scene where a character stares at the bottom of the sewer, and the last second is riddled with zombies coming out of nowhere. Yeah, 3 seconds ago everything was so quiet, I'm not buying that. It's just one of those few familiar YA tropes that really isn't effective.\r Do I recommend this movie? Only if you're a fan of the genre or even of Lawrence. I liked the action, the effects, I even liked the theme of the film, but this thing is getting so tiring. It's like eating stale bread from a stale store... oh well.\r Final Score: 6.5/10"
    },
    {
      "rating": "5",
      "text": "So apparently I am in the minority of people who actually loved Mockingjay so it disappointed me particularly that the final film was such a dud. The book had several very emotional moments, powerful moments that were completely butchered in the movie. They had none of the weight they were supposed to have.\r Usually I try to remain spoiler free in my reviews but this simply has to be mentioned. In the book we see Katniss mentally damaged following the events of the previous two books and none of that appears in the film, only briefly in Part 1. After Prim's death she has a complete breakdown, the part where she is yelling at Buttercup (the cat) is the most tear-jerking moment in the story. Yet in the film it all remains emotionless and Katniss seems barely moved by her sister's death.\r Emotionless. That would be a good word to describe this film. I almost wouldn't mind if they had changed the story and at least went out with a bang so we could have a grand ending to the series. But it feels like the makers lost heart for this franchise.\r Obviously splitting Mockingjay into two movies was a bad call. And even then they didn't have time for important stuff, but other parts are unnecessary dragged out. Overall this movie might be of interest to fans of the series and but I don't see what interest it would be to anyone else."
    },
    {
      "rating": "5",
      "text": "4.5/10\r+ Peeta was interesting\r+ Mutt sequence was tense…\r- … but the other action scenes were boring\r- Far too long\r- Drab colour scheme\r- Deaths are spectacularly mishandled"
    },
    {
      "rating": "5",
      "text": "Katniss Everdeen: \"Tonight, turn your weapons to the Capitol!\".\r The story in Mockingjay Part 2 is Katniss fully embracing her role as the face of the district revolution in the \"Mockingjay\" she leads an all-out assault on the capital to bring down President Snow and his autocratic rule once and for all.\r After the dull filler that was Mockingjay Part 1, I mean splitting movies into two parts isn't a great idea with some book adaption movies that don't need it, because the books themselves were not long and flowed together nicely. And yes Harry Potter did the splitting movies into two because well, the book itself was freaking huge, so huge that a little toddler can reach the top shelf by standing on the freaking book. It's completely pointless and now every book adaptation movie is doing it just to cash in more money.\r I didn't like Mockingjay Part 1 that much. Nothing interesting was developed in that movie and part 1 was nothing but a set up to the next movie, which you should never do, because when you do a marathon of all of the movies, part 1 is the one that you want to skip. That's what Part 1 was 'a set up' and it doesn't stand on it's own as film (In my opinion). But all that a side, I sawed Mockingjay Part 2 a few days ago and it wasn't that great. It was way better than Part 1 when comes to something happening, but that's not saying much, because while I was watching the movie I had the same uneasy feel that Part 1 gave me and not in a good way. It isn't a bad movie, but it wasn't great.\r The one major positive that I can give that was all throughout The Hunger Games franchise was Jennifer Lawrence. She has so much to do here and really makes her character shine in this movie. She once again dose a great performance that wasn't over acting or being too dramatic, but it was simple and locked down. She was without a doubt the best part of this movie.\r This is a very dark and grim movie with no comic relief from the other characters, and these no messing around here and that element in the movie dose work...sometimes. These many scenes in this movie that was overly sad and so dramatic, to the point that I said to myself \"Oh my lord, this movie is so miserable and grim\". I know a finale like this isn't going to end quietly and it worked sometimes, but sometimes it overly did it.\r This is Philip Seymour Hoffman's last movie and I think the movie did justice for his character in a respectful way due to the actors passing. I know it was hard for the cast to deal with Hoffman's death, since he's character had a major scene in this movie that he never got a chance to film due to his death. I thought the movie did great job of working around it respectfully. R.I.P Philip Seymour Hoffman.\r Now for the problems: The first half of this movie and the last is so freaking slow with it's pacing, to the point that it was basically killing the spirit of this movie with the lack of energy. The movie never made me feel like the stakes were high as it felt too easy. There was never a moment that made me feel like I was on the edge of my seat or biting my nails worried for what's going, because as I said before the stakes never felt high to me. That's really disappointing and I had so much high hopes for this movie to be an intense finale with a satisfying ending...well I got some of that, but not the satisfying or intense part.\r Was the ending satisfying? well, it was fine ending, but not the best as the movie didn't know how to end. The endings were dragged out.\r Overall Mockingjay Part 2 will satisfy some fans of the franchise. I do think it's better Part 1 as I felt like a lot of things were happening. Unfortunately this movie dose have the same problems that Part 1 had with it's pacing and it's lack of energy. I didn't think this movie was great and I know for a fact that five years from now I will completely forget about this movie."
    },
    {
      "rating": "4",
      "text": "This was a funny bad movie. The plot was all over the place, the action had no rhythm. Plotlines and characters were introduced and dropped out of nowhere, and it was just kind of sad to see these movies deteriorate. The first 2 were good, the third was meh, and this was just so bad. Go see it and laugh at it."
    },
    {
      "rating": "6",
      "text": "By now, I have seen every book and watched every movie of the series. But my enthusiasm has gradually decreased with each installment. Reaching the fourth movie, I saw it solely because I had seen and read everything else. Of course Mockingjay Part 2 was going to be a marketing gimmick. I don't even know at this point if it followed the book, and I don't even care.\r I can't say I would even call myself a fan of The Hunger Games, but it had potential – at one point. There are moments of brilliance that were begging to be brought out, like the killing of President Coin, yet I was left feeling like it didn't really matter. This dystopian world could have ben powerful and gripped our hearts, but the movie lost its way and fell into the typical trap of the love triangle. Thank god for Phillip Seymour-Hoffman. If it weren't for his performance shining through in a select few moments, I would be a little more down overall. Still breaks my heart that we don't see more of his role.\r I think Jennifer Lawrence tried her best to make this last glimpse of the franchise a success, but what could she do? She's aged several years since the release of the first movie, as has her audience – including myself. Stretching out the story for four years is bound to lose the originality and Mockingjay is no exception. We're different people and we've grown apart."
    },
    {
      "rating": "5",
      "text": "This is an example of another series that simply went on too long and lost all of the magic and shock factor it started with. As a reader of the books, I generally knew what was going to happen and when it was going to happen. What drew me in to the first two movies were the visualizations of things I had read about several times. With three films preceding this one, all of the \"wow\" factor is gone. With Mockingjay - Part 1, I said that the only way you could really appreciate the film was if you had read the books, Mockingyay - Part 2 is the opposite; you will enjoy this film more if you have not read the books. I suppose this is to be expected as it is the end of the series. The first mistake is that the cut between Part 1 and Part 2 was put in the wrong spot. The climax of part 1 should have been the events in District 2. In the book, it was a very important part of Katniss' character development. I felt putting it at the beginning of this film caused it to be glossed over and more of an afterthought.I wasn't crazy about how this film did not include or glossed over events that were very important for Katniss' character development. I think it left a hole in the story.  In the books, Katniss does not smuggle herself into the capital, she actually does training at District 13 and it is an pretty important developmental and rehabilitative experiment for her. This movie does not adequately portray how messed up Katniss is after Peeta attacks her. Yes, it is an easy sequence to delete, but I feel it is an important part of the story and it is a part of the books where Jena Malone's character is pretty important. I felt the lack of focus on the other characters was a mistake in this film. The Hunger Games series is written in first person, so one of the major areas where this film could have differentiated itself was in that it is third person. I felt just really tired of Katniss by the end of this film. Jennifer Lawrence is a good, not great actor, so she really shouldn't have the camera on her 90% of the time as it was in this film as her weaknesses become more and more apparent the more you see her. There were other good actors in this film, they should have been more involved. One of the best characters, Haymitch, is almost nowhere to be found for example. Overall, this is an average film. It's not terrible, but it's definitely not good."
    },
    {
      "rating": "4",
      "text": "This movie was pretty boring.  It was very talky and not too much action.  Also, was never a fan of the whole love triangle, anyway.  This was the worst of the series for me."
    },
    {
      "rating": "4",
      "text": "After 3 movies, you would think they would understand what people were coming for. Not a depressing melodramatic \"feels\" fest. We wanted a hard hitting action film to wrap things up. Instead we got this disaster of a movie with enough awkward love-triangle moments to the Twilight series proud. Come on guys, we expected better!"
    },
    {
      "rating": "5",
      "text": "The world and life of both the Hunger Games and Katniss Everdeen is a wonderful tale. The sad post-apocalyptic world is an interesting story while keeping us on the edge of our seats. The final chapter could have extended this and had a finale that would have been fantastic in scope. Sadly this didn't live up to the hype many was hoping for. The flaws out way the good in this final chapter.\r Everdeen now has to deal with the aftermath of Peeta almost killing her to try and fight a enemy that never sleeps. The resistance takes President Snow's last defense before the Capital. They push onto the capital where Snow has made an assortment of traps to stop the forces of the resistance. Though President Coin won't allow the \"Mockingjay\" to die in the front lines, so she sneaks onto the battlefield. Armed with a team of people introduced in the last movie, Everdeen has to face her face last obstacle. The 76th Hunger Games has begun.\r The movie starts off halfway into the movie. Like many other part 1 and part 2 movies in the past (Harry Potter and Hobbit), the movie have to of course fill in minutes by giving the audience filler. Like the Hobbit, it drags for great amount of time. However, the pacing issues aren't really the biggest flaws. They're relevant and easily scene, though the director decided to not clump them all together. Can't deny that they're there though. Moments where we're just given some exposition while other scenes of them not doing anything are thrown at us for three minutes at a time.\r It would be acceptable if those moments drove the story along or made for great character development. Though they're plainly obvious fillers, which bong down the time and kill the action and adventure tone. Scenes that could have kept an amazingly different pace, are slowed down so the movie won't end too early. The main source for this was the last movie. The last movie ended too far into the book, because nothing really happened in the last one. They had to end it at the part with Peeta because the movie would have felt boring otherwise. This results in the final chapter only being a quarter of the book that's stretched out into a 2 hour and 17 minute affair. Again, this wasn't even the worst part of the film.\r The worst parts of the film is the tone switches. The grim nature of the film is switched for cheap gimmicks throughout the film. The problem with talking about these gimmicks is that it will spoil parts of the film that are key. That won't happen in this review, but there might be a spoiler review coming up soon.\r There's been many stories of Suzanne Collins (author of the books) rushing the last book because of some contract disputes. It really feels like it in this one. *Small spoiler* Instead of us getting to know some of the characters in the film, she just kills them off because she really hits home the dread of the world. The sad and grim nature of the last book is translated into the film. However, the director and screenwriters still don't give even a small amount of time dedicated to character development for these characters. They're thrown into the film and are instantly taken out. This just makes the whole experience feel like a gimmick. Also, characters loved in the first two films are sometimes gone without any remorse. Some of these characters are gone and nothing is said about them afterwards. Characters which are beloved in the film. This doesn't always have to do with them dying though, but just disappearing from the film all together. Don't know if fault has to be laid on Collins or Francis Lawrence (the director). Though its a flaw that should be addressed. All of these flaws lead to one of the most disappointing endings this year.\r The end to the film won't be spoiled for those who haven't watched it. However, there's key parts of the ending that are extremely flawed. Some of the characters who die are randomly in locations for them to get killed in. Also, there's certain little tiny flaws (people would maybe say it's nitpicking) that are thrown right in the audience's face. It's hard not to notice them and it turns the film into what it was trying so hard not to do. Some might not find the ending predictable. However, it really was. The predictable ending steams from a rushed ending. It feels like a house without anything holding it up. This knocks down every other great aspect of the previous films, resulting in a conclusion that feels rushed while also being dragged on for a couple of minutes. The director seems to rush into the ending while not really having a clear cut one. It's convoluted in a unnecessary way. It's not necessary the directors fault, as he has to rely on material that's flawed on its own. The grim and not happy ending is very refreshing, and gives the true tone of what the final chapter is trying to portray. However, the flaws can't be overlooked.\r Overall, the great things about the movie are overshadowed by the good. The actors did a fine job, but the movie doesn't allow them to shine besides Jenifer Lawrence and Josh Hutcherson (which character is the only one who gets any character development in the whole movie). The movie is better than the last one, because stuff actually happens, however it doesn't give the series the great sendoff it deserves. The film is similar to Spectre, a somewhat fun movie, overshadowed by flaws.\r 5/10\r E"
    },
    {
      "rating": "6",
      "text": "Personally not being a fan of the books I really enjoyed the setting and darker tones this franchise has to offer up. However this instalment yet still entertaining and worth a watch was definitely my least favoured of the four. This isn't much of a review, though I'm simply pointing out my memorable highs, lows and gripes off the top of my head.\r Right off the bat this movie tosses in the burden of war which is great, the only problems being that in retrospec I can't really remember much of what happened in act 1.  Following the events of Part 1 Katniss had lost her voice though this is quickly resolved. I'm no biology expert or know anything regarding the books, though I'd have like to have seen her without a voice for much longer, perhaps even to the end. By this point Katniss is looking very much invincible, the idea of her struggling to talk while undergoing her journey would not only compliment her character, but make for an even more gripping story. Having to fight to speak up on camera etc.\r The traps in this one were fairly nice to see, however due to the device I feel like we had missed out on a lot more. Granted they couldn't add in too many and they had a small squad, but I'd like to have seen more from that. Perhaps even them and the peacekeepers battling it out in trap central.\r The sewers scene was probably the one that stood out most for me. Having been a big ALIEN nerd through high school this scene  really set the mood and tone. The suspense was done so right and was genuinely a small clip that I just loved. I even half expected a Xenomorph to pop out.\r In terms of the tone of this movie I feel like it had gone a bit under following the previous. There was a sense on need and hopelessness, but it seemed nowhere near as great as in the last two. Obviously there were some darker moments towards the end, however the wrap up seemed a bit too rushed for to have much of an impact. I'd have liked a longer build even though I wouldn't say I loved the ending either. Very much seemed like Katniss was knocked off of her pedestal at this point. Like she had no impact on the whole movie what so ever til her choices at very end; which was predictable by then.\r Personally though this movies biggest flaw is character development. I get this is Katniss's story, but over the past two films they have introduced so many interesting characters that the just don't bother flushing out. Natalie Dormer's character and her team were a group I really wanted to know more about and grow to love. I mean a group of capital film makers now soldiers? That's fuel for a movie alone I think. Granted they did dip in a little with some of them but it only seemed to be there for advancing the plot. Plutarch was another. I wanted to know his thinking, his master plan at the end. What was his ideal outcome? who was he before this? why was he fighting for this cause?\r Johanna was another heavy hitter for me. She was a fierce character who clearly had witnessed probably the absolute worst of the capital.  I wanted to know what happened before and after the games? Instead she is just there again to push forward the plot.\r Peeta was an odd one in this movie. I love the idea of him having to find himself again while battling the need to kill Katniss. However I'm undecided if he had become more interesting or more boring through this? He did pour out a few feelings, but I'd have like to have been hit with more venerability to actually feel more at one with the character.\r Gale was a character I found fairly boring anyways. However in the second movie and some of the third he did grow on me slightly. However as he shew his military colours early in this you kinda see where their relationship is going. It was almost as if he wasn't even fighting to get Katniss's approval in the end, he kinda just accepted the outcome.\r Overall I'd say see it if you've seen the rest at the cinema. However if you're not too fussed this is very skipable. In the end it had a slightly bitter sweet finale, though I'd have liked it to had hit me harder with more loss. I really do feel like not enough people died in this movie and not many deaths seemed meaningful. Main reason I'd give it what I did was that it had some nice scenes and some good ideas, but fell really short for me. Plus points for the 'ALIENS' scene.\r If anyone actually read this, well done. And apologies should there be any grammar errors."
    },
    {
      "rating": "8",
      "text": "A fitting conclusion to what has been a very accomplished series. Dark in both look and tone, this entry offers up a few surprises for those who haven’t read the books. Top lined by the current ‘it’ girl, Jennifer Lawrence, who is so good in the role of Katniss Everdeen that it is nigh on impossible to imagine another actress in the part. It has to be said that performances of this stature are not usually on evidence in these kind of commercial blockbusters. It is to her credit that the films have succeeded in no small measure due to her commitment to them.\rHaving said that the film does start with a whimper rather than a bang. However, as soon as our vengeful troop head for the capitol, and specifically the Mansion of Coriolanus Snow, the bangs start in earnest and we find ourselves tensely partaking in the 76th Hunger Games. There is one gob smacking set piece involving a sea of black oil and another nail biting, beautifully photographed episode, down in the sewers where the group come under attack from mutants.\rOngoing delights include excellent production design and James Newton Howard’s lovely score. Costumes are toned down from the amazingly wacky designs of earlier instalments and it is left to Elizabeth Banks (this year’s clothes horse for eye catching garb. See her in ‘Love and Mercy’) to carry the day in this area. The late Phillip Seymour Hoffman appears too little effect, but no doubt judicious cutting has had to play a part.\rThe film does rather outstays its welcome by tacking on a couple of unnecessary codas that add absolutely nothing. Overall, though, the series has maintained a strong emotional hold throughout. This in itself is quite rare in many franchises being made today, and the movie should be applauded for that alone."
    },
    {
      "rating": "9",
      "text": "With all the gore, brutality, and emotional heft the series is known for, in addition to a keen political undertone and excellent performances by many of the cast members, the Hunger Games series concludes on a high note with this well adapted and visually superb finale."
    },
    {
      "rating": "9",
      "text": "And the odds are finally in our favour with this brilliant conclusion to the epic story of Katniss Everdeen. This is a thoroughly well crafted film, with beautiful cinematography, gripping storyline and sumptuous costumes. The tension is held with precision, and those who have read the books will not be disappointed with the manner in which the plot unfolds. The performances are excellent and it's one of the few times I can say I'm happy with the decision to split the narrative across two films, as this allowed the director to dedicate the appropriate time and detail to this much anticipated resolution, and I'm happy to say it was a beautifully executed finale that is both thrilling and satisfying in equal measure. 9.23/10"
    },
    {
      "rating": "6",
      "text": "Mockingjay Part II is fine. The filmmakers do nothing work as far as story and presentation the only faults for the film come from what it is. Watching the film I was reminded how underwhelming the ending was from how it all gets resolved, to the deaths, and more importantly the unnecessarily epilogue. Adding to the hurt is that this is one chunk of a film with most of the character development being in the last installment so unless the film’s are watched back to back the film experience won’t do much for you. It’s hard to fault the filmmakers for the lame conclusion as that’s what it is in the books and they followed it well. Nonetheless, considering this is how the franchise ends it’s a shame that when you consider how good the last couple films are that the final note makes me feel empty and question my love for the series. Don’t take my shrug as criticism its an ok film. Its not the best conclusion to a franchise I’ve ever seen lacking the epic scale and satisfaction such films as Return of the King or Harry Potter and the Deathly Hallows Part II; but it wasn’t anywhere near as bloated as The Battle of Five Armies, seriously if Peter Jackson directed this he’d make the aftermath an entire film. Haven’t seen the conclusion to the Twilight saga but regardless of the faults of this final film it can’t be as stupid as that one is."
    },
    {
      "rating": "6",
      "text": "This movie is very very very slow. There are some good parts and the strong is sort of interesting at some parts but if your not a fan of the hunger games don't see this and if you are a fan you'll probably enjoy this but overall the movie is just ok."
    },
    {
      "rating": "10",
      "text": "For a fan of the books, one could not be more ecstatic with the outcome of this movie. It has all the brooding themes from the novel while adding components that create an even deeper, more connected story line. I could not think of a better way to end the era of The Hunger Games. Katniss Everdeen and the others have finally come full circle.\rI believe if they were to make more movies, most fans and other slightly curious observers would love to witness Haymitch Abernathy as he takes on 47 other tributes in his own game during the 2nd quarter quell."
    },
    {
      "rating": "10",
      "text": "Dark, emotional, heartbreaking and incredibly satisfying. The themes are socially and politically relevant to our society and I'm sure this will keep educating people on the consequences and horrors of war for generations to come. Brilliant movie. The best Hunger Games film."
    },
    {
      "rating": "5",
      "text": "The last--maybe--of \"The Hunger Games\" entitled \"Mockingjay  Part 2\" has arrived to tie up the loose ends of the 3 young adult book series turned into 4 films that made Jennifer Lawrence a star.\r It is too long, running 2 hours and 17 minutes, too many and too dark with scenes taking place underground and low lit scenes even above ground.\r The older adults are mainly given cameos to do such as Stanley Tucci who is on screen for about a minute while Philip Seymour Hoffman, who died a year and a half ago is inserted as if to say 'see what we can do', while Woody Harrelson comes and goes with one minutes scenes. Donald Sutherland fights for his power continuing his heartlessness and Elizabeth Banks does her scene stealing campy appearance. Julianne Moore--never thought I would say this--is colorless in a colorless written role. Jeffrey Wright comes and goes before you can even realize it his him.\r Loose ends regarding kid sister Prim (Willow Shields), the 'is he or isn't he' brainwashed problem regarding Peeta (Josh Hutcherson) and his competition with Gale (Liam Hemsworth) is played out while the squad team consisting of Sam Claflin, Jena Malone, Natalie Dormer and Mahershala Ali lend support to the leads as do Paula Malcomson, Evan Ross, Wes Chatham, Eugenie Bondurant and Elden Henson.\r The revelation of Jennifer Lawrence, as Katniss Everdeen, from the first film to this closing one shows the growth of an actress fitting into her body and being able to express her thoughts without saying a word is, if nothing else, the gift of \"The Hunger Games\" to the world of movies. She has shown her versatility in these movies along with \"Silver Linings Playbook\", \"American Hustle\" and she is the only one who could make me see \"X-Man\"! I am eagerly awaiting \"Joy\".\r The direction by Francis Lawrence along with the screenplay by Peter Craig and Danny Strong, along with adaptation by Suzanne Collins based on her trilogy, falters when it comes to the multiple endings as if they just didn't want the series to end. Here and there are a few twists that were expected and some that weren't--at least by me--which adds to a film's interest.\r At some points the musical background is jarring while during the many generated computer special effects by Steve Cremin and WSalter Garcia the audience will be pulled out of the story.\r \"Mockingjay Part 2\" will satisfy followers of the books, the movies and Jennifer Lawrence and I am definitely one of the latter!"
    },
    {
      "rating": "10",
      "text": "The Hunger Games series has finally come to an end with the fourth and final film in the franchise and serves as a continuation of Mockingjay - Part 1. Part 2 makes up for Part 1's lack of action by being the darkest, most violent and gritties Hunger Games film, even with the standards set by the previous films and succeeds in ending the saga in a suitably epic fashion. Mockingjay - Part 2 finds Katniss leading the rebels to the Capitol aiming to kill President Snow. The Gamemakers have rigged the entire city with lethal traps to make sport of their deaths, making it the most dangerous Hunger Games yet. If Part 1 was too slow or lacked adequate action, Part 2 is heart-pounding from beginning to end. The action scenes are more violent than anything seen in the series yet, making any deaths even more gut-wrenching. Fans of the series will find it hard to watch at times, and if you're like me, you'll be gripping your seat or hiding behind your shirt for a good portion of the film. The Hunger Games: Mockingjay - Part 2 ends one of the most exciting and relevant franchises today in a gripping, emotional and brutal way, and it might be the feel-bad movie of the year."
    },
    {
      "rating": "6",
      "text": "Katniss (Jennifer Lawrence, who gets LOTS of closeup brooding) and her posse lead the final assault on The Capital and President Snow (Donald Sutherland). This means a few battle sequences, although the first one is almost an hour in, thanks to all the YA drama that wraps up the group's fate. Those with an investment in the series and its characters should be gratified, but anyone looking for the cool inventiveness of the first film will find this one unimaginative. Despite being too long, it sill manages to create a mildly-compelling drama with adequately-staged action."
    },
    {
      "rating": "0",
      "text": "This is the worst movie I've seen in 10 years. Everything about it is a cliche, it was torture to sit through. Jennifer Lawrence has 3 expressions and mugs for the camera continuously, there are 4 camera shots, there is very little action... it is mostly people standing around talking, and talking, and talking. I haven't even mentioned the dialogue which anyone reading this review could write. Even before they finished their lines I was finishing it for them. Do not waste your money. As good as Jennifer Lawrence was in Winter's Bone, she is that bad in this movie. She is not the next Meryl Streep, she is the next Nicole Kidman. I can not figure out how the professional reviews gave it such high marks, I feel they must getting some kind of benefit on the side. If you haven't seen many movies in your life this might be OK if you are in your teens, but I would recommend you pick out another movie you can go to in the cineplex because in the first 10 minutes you will know what I'm talking about, it doesn't get better, it just continues to repeat the same scenes, over and over again in a different place with the same anguish."
    },
    {
      "rating": "0",
      "text": "This is very likely the worst movie I've ever sat through.  It is a example of the dangers of padding.\r Disclaimer: I liked the first and second movies.\r Hunger Games, with a good script writer and a disciplined director, could have been done in one movie.  With that, I think this could have done well as a trilogy as well.  There was no reason for Mockingjay to be split into two movies.\r I'll quickly explain why this movie was so bad:\r* It skipped the climax -- The scene of the confrontation at Snow's residence was glossed over because Katniss was knocked out (about the 4th time in this movie alone)\r* Nothing happened -- They used exposition to explain the plot in between short boring action sequences.\r* It was stupid -- Many of the plot elements were used to shamelessly jerk the audience around.  The performances were so rigid and simple (even Lawrence's high note performance of the show) presumably to placate the lack of intellect of fans of the movies and Suzanne Collin's books.\r How the hell did someone mention the cinematography in this movie as being excellent?  It was hard to watch it was so comically bad.\r Overall, I found myself laughing at many of the 'serious' scenes (like dropping bombs attached to little parachutes at the final battle sequence, really?)."
    },
    {
      "rating": "1",
      "text": "An extremely bloated runtime filled with 3-year-old dialogue and extremely predictable outcomes. The worst of the series, which is saying a lot since the entire series was enormously bad."
    },
    {
      "rating": "8",
      "text": "The Hunger Games book trilogy is one I could recommend to anyone, and as a fan of it, there was only one thing that left me unsatisfied: how Katniss ended up basically becoming a housewife with Peeta. Her true destiny was to live adventurously ever after with Gale *sob*. And I really thought this final installment would give Katniss the ending she deserves. All in all, however, this is a solid and complete final chapter for a franchise that has made young people learn about the idea of standing up for yourself and understand how the misuse of power can make for a corrupt, violent environment. As a fan of the books, I am left satisfied, if not for how they sticked with the book's ending. Also, having appreciated Francis Lawrence's previous adaptations, I didn't expect less. Jennifer Lawrence (who sometimes I overpraise) is purely magnetic as the Mockingjay and I don't think anyone else could've played her as wonderfully as she did. Conclusion: The Hunger Games ends its run somewhat similar to Harry Potter's in the way that it didn't compromise the authenticity of the literary works for commercial aspects. Franchises, after all, tend to be disgusting (Divergent, The Maze Runner, etc., etc.), so it's a glorious feeling that all fans will get to experience such an emotional yet genuine closure."
    },
    {
      "rating": "1",
      "text": "Fell asleep after the first thirty minutes.  I have never, ever fallen asleep in a movie theater until I saw this movie.  I remember that the characters were extremely serious, and that it seemed to be moving towards a huger games scenario, and I remember being really bored.  The next thing I remember is friends shaking me awake for the credits.  Apparently, I snored through most of it.  I'm giving the movie 2 stars, because the first half hour could be a cure for my insomnia."
    },
    {
      "rating": "2",
      "text": "It's been a decent franchise until this train wreck; Seems as though someone gave them a plot checklist and it goes like this: zombie zero dark chase, check. end the world's longest running love triangle, check. Drench the square in oil, send in a rocket, but don't have the oil catch on fire, check. Set up complicated tech gadget that serves no purpose for the plot, check. Cry until you spittle, check. Embarrassing end to an otherwise fun series. Check your brain at the door."
    },
    {
      "rating": "7",
      "text": "\"The Hunger Games\" franchise rounds out to a mostly satisfying note, bringing all pre-existing arcs to a worthy conclusion, whilst still proving itself to be one of cinema's preeminent young adult franchise."
    },
    {
      "rating": "7",
      "text": "The Hunger Games: Mockingjay - Part 2 is the darkest and grittiest Hunger Games movie so far. It stays true to the novel and delivers some thrilling action although emotional scenes are needlessly rushed over."
    },
    {
      "rating": "9",
      "text": "Copy of letter to Amy Nicholson, who gave the film 100. I gave it 90. Hi Amy, I read you when you were in LAWeekly.  Just saw fourth film.  I have to go back to the first Matrix movie for so bold a new angle on heroism.\r The normal treatment would have been a showdown between Coin and Katniss, where Coin reveals she, not Snow, bombed the children.  This scene is missing altogether (thank god) and the possibility of Coin as the new villain is a tossed off line with little weight or credibility given to it.  Then Katnis does what no hero ever does in film, she kills deliberately--and it works!\r Not since Matrix 1 have the rules been broken so wonderfully, in my memory.\r The end result is the fourth movie becomes a character study of Katnis.  The film is impossible to imagine without the landscape of Jennifer's face; especially, if you compare it to the heroine of Divergent, etc, etc.   You are right.  It's her withholding of emotion and impulsiveness which we learn to love.\r All in all quite a remarkable and creative achievement unlike most Hollywood fare.  I've read none of the books.  From a summary of Book three, it appears the movie sharpens the themes admirably."
    },
    {
      "rating": "8",
      "text": "I think this movie was incredibly well done. I also couldn't help but think that throughout the movie, this could relate to a Biblical worldview. In the previous movie, Peeta's mind is warped by president snow to change the way he views Katniss and in this final movie Katniss is trying so hard to change his mind and prove who she really is. This is what God is doing for His children. He is trying to show us who He really is by sending us His son and showing us continual and unending grace and love and compassion,just as Katniss did to Peeta."
    },
    {
      "rating": "9",
      "text": "Possibly one of the most criminally underrated series of all time. I think it's because of the stigma of being a teen series, and being a major Hollywood blockbuster, but it is far more complex and thought provoking than those labels would imply. This is one of the most moving films of the year, and a fantastic conclusion to the series. The themes explored in the first three grow to even greater intricacies, solidifying the series' status as a near masterpiece."
    },
    {
      "rating": "10",
      "text": "With a number of films to its credit , \"The Hunger Games : Mockingjay - Part 2\" shows the best side of all the series and makes it the most superior manner. \"Mockingjay - Part 2\" breaks barriers prodigious bestseller, \" Harry Potter \" did it,  \"Twilight\" did it, Why not use as bait to Katniss to torment the crazy fans once more ? Why not increase the capital of Lions Gate with Panem once more ?\r Unfortunately , the exciting saga comes to an end , and the wise decision  of dividing the last part in two films exalt its quality, tremendously. Lawrence is an undetectable be, her little expressiveness help in her role perfectly , no one knows what will do until it does . His ascension is great, since it was offered as tribute to become an idol of rebellion , really Lawrence is Katniss from head to toe.\r Thanks to Gary Ross , Suzanne Collins and Francis Lawrence, the fearless story of rebellion , revenge , love and social order ( districts) between Katniss Everdeen and Coriolanus Snow, remain etched in the soul , heart and mind of each of the fans.You can not deny that thanks to the boom that caused The Hunger Games different sagas quite similar in the way of narrative , history and most linked to a social order which is then implemented by some tragic event for humanity were produced \"The Maze Runner\", \"The Giver\", \"Divergent\".\r The first \"The Hunger Games\" disappointed in its development with respect to the book, for rampant deaths but as the saga arose its quality increased to the beautiful \" Mockingjay — Part 2 \".Wisely, Lawrence has made her war in Capitol and also with other interpretations , and because this is pointed his bow at the prestigious awards Oscars. Jennifer should be happy about the outcome, made ​​too much money and fame with the hit , but also made ​​its way to several nominations .\r The stars of the film are shown briefly giving us just a little of all the delight of each character, The abbreviated presence of Hoffman, who died in 2014 of an accidental overdose, is heartbreaking. Tucci appears all-too briefly as unctuous television announcer Caesar Flickerman. Elizabeth Banks shows up in a couple of her typically outrageous outfits as stylist and social climber Effie Trinket, and that’s about it.\r Katniss goes seriously this time , and once and for all she takes her role as ever, mixing his extreme courage and vulnerability to his worst enemy and put an end once and for all all suffering districts\r The relations of the girl on fire lit, and would have to choose which of the two suitors would stay and prove to herself that love is \"real or false\".\r This release has the best action sequences of the entire series, bringing us a lot of oil to a mine field with millions of traps with a single purpose \"Kill Katniss\" The road since the district until Snow's mansion is a perfect and dangerous journey that will slowly killing each of the characters , wounding our hearts more and more ( journey through the sewers).\r The dramatic part of the movie does drop a tear to everyone deaths , betrayals, murders , monsters , mines , fire , destruction , are the causes.\r A true end of the movie was fantastic trilogy by Suzanne and a real fairy tale ending of the movie by Francis Lawrence.\rDo you know, why this is the perfect movie?  It has each of the genres of the film world drama , action , adventure, science fiction, horror, suspense, thriller and even a little comedy but more importantly, the story unfolds to perfection leaving the name of The Hunger Games at the top.\r Definitely better end could never have it.\r Since the first words of the movie : You can say your name , Katniss, Until the last words of the film: There are many worse games. It is beautiful and totally entertaining.\r The movie that everyone wants has arrived and is called:\r\"The Hunger Games: Mockingjay - Part 2\""
    },
    {
      "rating": "0",
      "text": "As every minute of the film goes on, the film gets even sillier. I tried my hardest not to laugh at it's stupidity, but I couldn't even get through 15 minutes without laughing. The film was the worst way to end this trilogy."
    },
    {
      "rating": "0",
      "text": "Thank God this tragic series is over so we can all stop seeing / hearing the hype.\r With any luck Woody, Elizabeth Banks, and PSH (RIP) would find more meaningful projects to devote their time to.\r Jennifer Lawrence, someone bought you an Oscar and you completed your \"quadrilogy\". PLEASE just fade away like so many no talent flashes in the pan before you."
    },
    {
      "rating": "3",
      "text": "I haven't read the books but found the first two movies to be okay, the 3rd to be boring, this 4th one to be the worst\r Perhaps if you've read the books, this is better, but if you haven't, I'd avoid"
    },
    {
      "rating": "9",
      "text": "Satisfying conclusion to the Hunger Games Franchise. I actually think a prequel to continue the series would be great so we could learn how life used to be before the Hunger Games. Long Live The Hunger Games"
    },
    {
      "rating": "10",
      "text": "A spectacular conclusion to this amazing series. Francis Lawrence handles every detail with care and truly understands and respects the fans of these books. Emotional, action packed, thoughtful, grim, and real."
    }
  ],
  "recommendations": [
    "maze_runner_the_death_cure",
    "maze_runner_the_scorch_trials",
    "avengers_infinity_war",
    "the_hunger_games_mockingjay_part_1",
    "the_maze_runner",
    "the_hunger_games_catching_fire",
    "the_hunger_games",
    "a_quiet_place_part_ii",
    "avengers_endgame",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "what_happened_to_monday",
    "inferno",
    "the_hobbit_the_battle_of_the_five_armies",
    "harry_potter_and_the_goblet_of_fire",
    "glass",
    "the_matrix_revolutions",
    "harry_potter_and_the_half_blood_prince",
    "chaos_walking",
    "the_golden_compass",
    "death_note_relight_1_visions_of_a_god",
    "predestination",
    "x_men_apocalypse",
    "avengers_age_of_ultron",
    "sicario_day_of_the_soldado",
    "the_matrix_reloaded"
  ]
}