{
  "id": 1760,
  "title": "The Evil Dead",
  "starring": [
    "Bruce Campbell",
    "Ellen Sandweiss"
  ],
  "runtime": 85,
  "genre": [
    "Horror"
  ],
  "description": "In 1979, a group of college students find a Sumerian Book of the Dead in an old cabin they've rented for a weekend getaway.",
  "releaseYear": "1981",
  "mpaaRating": "NC-17",
  "imageUrl": "https://image.tmdb.org/t/p/w500/54C1qdaiSijIU5NeNb4WsPJdNkG.jpg",
  "categories": {
    "plot": 6.695652173913044,
    "acting": 6.84,
    "ending": 9.2,
    "soundtrack": 6.0,
    "cinematography": 8.4,
    "familyFriendly": 7.7,
    "funny": 7.0,
    "action": 7.888888888888889
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Nauseating and amusing in equal measure, \"Evil Dead\" is one horror movie that easily obtains its cult status, managing to surpass even your wildest imagination of gore and visceral violence. This is the first installment of the popular Evil Dead trilogy  a low-budget, B-grade gore-fest horror film with the Stephen King quote-tagline: \"the ultimate experience in grueling terror.\" A thinly scripted screenplay becomes a kaleidoscope of skewed camera angles and energetic panache under Raimi’s remarkably assured guidance and direction. His debut might be short on budget, but it’s hardly bereft of ideas or spirit.\r Five Michigan State University students spend the weekend in a remote Tennessee cabin, and inadvertently unleash dormant, demonic, evil spirits. In the cellar of the cabin, they find an archaeologist's tape-recording describing the contents of the Naturon Demonto (Book of the Dead). Unaware they are unleashing demonic forces  one by one  they must fight off evil spirits, and avoid becoming demoniacally possessed.\r It’s obvious that Raimi takes great pleasure in all of his demented material, and he’s eager to share it with an audience that’s left equally shocked and thrilled. \"The Evil Dead\" is much more of a straight horror movie than its successors, but it’s no less fun. Heads and arms are frequently severed, but it's all done in such a fun spirit, and in a over-the-top manner that it's difficult not to grin. \"The Evil Dead\" is at times genuinely creepy, due in part to the imaginative camera-work devised by Sam Raimi, and cinematographer Tim Philo. The \"shaky cam\" (in which the camera gave us the point-of-view of the demon rushing through the woods), became a staple of the Evil Dead series. Raimi and company empty the tank of all its gore, make-up, camera, and stop-motion tricks into an unforgettable, resounding success of entrepreneurial filmmaking."
    },
    {
      "rating": "10",
      "text": "This extremely low-budget ($90,000–400,000) movie is undoubtedly a classic work in horror genre, with Bruce Campbell's performance being so scary and haunting that he is probably the first chainsaw psychopath in the long history of horror flicks. Sam Raimi did a marvelous job that with few characters, and but a small, going-to-the-dogs house, audiences witness what true fear is like, with everything around those young men turning to live demons and trying to make them one of theirs. Compared to many modern stupid, horror-free movies which happened to be considered horror films, The Evil Dead is like Godfather part 1 in horror genre"
    },
    {
      "rating": "10",
      "text": "Plot/Summary,The nominal plot involves five vacationing college kids -- Ash (Bruce Campbell), his girlfriend Linda (Betsy Baker), and their classmates Cheryl (Ellen Sandweiss), Scott (Hal Delrich) and Shelly (Sarah York) -- making an unplanned stopover in an abandoned mountain cabin surrounded by impenetrable woods. Before settling in for the night, they come across an ancient-looking occult tome filled with dense hieroglyphics and macabre illustrations, a dagger fashioned from human bones, and a reel-to-reel tape recorder. The taped message, dictated by a professor of archaeology, describes the contents of the Sumerian \"Book of the Dead,\" filled with incantations used to bring otherworldly demons to life, giving them license to possess the living.\rMy Review\rIt has been called many things great,awesome,best horror,best zombie film, original. And all i have to say is that is a classic that both horror fans and non fans should indeed watch. This is a horror film classic and boy am i glad i saw it. This film starts off as any horror film would, in a place where none of the characters of heard about but claim to have found out from a friend,and unleash evil. This is actually no one of my favorite horror films of all time. I put this at number four . This movie stars Bruce Campbell who plays Ash who gives the best performance out of the whole cast but my second favorite actor in this film is Hal Derich as Scott. This movie is so damn bloody and brutal and great and the atmosphere of this is also pretty amazing. This film is all out fun and a really great horror film but i have one small problem the ending. You get this ending where it's in first person and im guessing something's running to Ash and he screams but you don't know what happens it just ends like that,but hey they might explain in the evil dead 2 and despite my one problem i still give it a 5 out of 5."
    },
    {
      "rating": "9",
      "text": "Ok, the actors are terrible (even Bruce Campbell), the special effects are terrible than the actors, but i don't care... Evil Dead is ridiculously funny!"
    },
    {
      "rating": "3",
      "text": "Clearly outdated movie that looks ridiculously today. It lives from their gore effects, but they are looking so cheap today and there is nothing more of the movie: the story is simple, the characters superficial, the actors average."
    },
    {
      "rating": "9",
      "text": "Probably one of the best horror films ever made. The creepy yet cheesy nature of this film is totally of its time and yet remains timeless. This film stands as, in my opinion, the best in the series."
    },
    {
      "rating": "8",
      "text": "Equal both in violence and gore, Sam Raimi does not just capture the viewer in a world of violent horror, but engulfs them in a world of fantastically amazing cinema."
    },
    {
      "rating": "10",
      "text": "The Evil Dead is my favorite horror movie ever, and one of my favorite movies ever. The film was shot on a shoestring budget, and it shows. However, it's obvious that Sam Raimi did everything he possibly could with the small budget. The cinematography is ingenious and rivals that of Alfred Hitchcock's films in its ability to unnerve and unsettle. Also like Hitchcock, Mr. Raimi has the ability to create unbearable suspense. The movie is at once very humorous and very frightening. A lot of my friends who have seen it have dismissed it as humorous and not scary. I disagree though: it contains some truly shocking scenes and, if you suspend your disbelief and let it carry you away, it is seriously frightening."
    },
    {
      "rating": "10",
      "text": "\"Bruce Campbell is the greatest chainsaw  pyschopath ghost hunter i have ever seen \". Evil Dead is one of the best scariest  movies of mankind there terrifying  , brilliant  horror  movie thanks Sam Raimi  for creating the scariest movie in the 80's  . Grade A+"
    },
    {
      "rating": "0",
      "text": "Umm what? For some reason I was expecting something much better. This is garbage. No atmosphere or story whatsoever and its not even scary. Totally silly. I watched the Hills have Eyes recently and that was equally underwhelming. Neither films live up to their cult status. At least John Carpenter's films still hold up, although whether you can call Halloween or the Fog scary is extremely debatable. But they have great music and atmosphere. I am yet to watch the Texas Chainsaw Massacre, the jury is out whether that will also disappoint."
    },
    {
      "rating": "9",
      "text": "Evil Dead is one of the best horror movies ever made. It revolutionized the horror genre from here on out and is just as scary now as it ever was. Its too bad the other films are not as strong as the first."
    },
    {
      "rating": "7",
      "text": "The Evil Dead is a horror classic. This may have been one of the first \"so-bad-it's-good\" and \"gore-or\" movies that I ever saw as a kid, and the cheesy B-movie ness of it all has aged incredibly well. The scares stick with you, and some of the more slap-stick moments really inspired the rest of the franchise. This is a great movie, and an incredibly fun watch."
    },
    {
      "rating": "9",
      "text": "Sam Raimi puts his the master of horror for Evil Dead becoming a banned but critically acclaimed success. This film is the birth of horror because it is the first film to put a style of steadycam, make-up FX and acting which is jump-scaring."
    },
    {
      "rating": "5",
      "text": "First time, that's three years ago, I enjoyed this movie due to its crude make-up and its handy violence. Surely, in the middle and up to the end, the gore pays the bill but, beyond that, I had the impression this movie loses the spark of some \"true evil\" going on within. Second time, last night, I found it really cheap, and I'm not talking about budget. Horror must be subtle, specially, so it can hit throw your soul. Anyway, this movie is neither great, nor boring, regular in its best, like a bulldozer doing the job against the impassiveness of a wall."
    },
    {
      "rating": "10",
      "text": "its totally something i mean bloody as **** random **** happening while the undead is happening i can't really tell you what i have experienced right now it was something tho"
    },
    {
      "rating": "10",
      "text": "\"The Evil Dead\" is really one of the greatest horror films I've ever seen. It's scary, over-the-top, and just plain disturbing. The gore is over-the-top, and the film has a very creepy atmosphere. The cinematography is also amazing as well; almost every shot is very beautiful and creepy to look at. I highly recommend it for any horror fan."
    },
    {
      "rating": "10",
      "text": "Evil Dead is a movie that truly makes you afraid of the woods. This movie has awesome scares, gore, and effects, though I don't see the laughs...  Full Review Coming Soon."
    },
    {
      "rating": "7",
      "text": "I thought this film was awesome and a great creative horror, but i didn't see it as highly rated as it is. Sam Raimi did an exceptional job making a great horror film with unique scares and some absolutely brilliant direction to create some interesting scares and amazing suspense. However the actors and dialogue seemed a bit bad, but the one weird thing with the acting was when they were all together it looked really bad but when you had someone acting by them selves on the scene they actually did a really good job. The effects haven't aged well and that may take a tint bit away from the viewing experience but overall it's a brilliant horror film. One to pick up for sure but one that when it came out would probably have been received better. I'd give it a 7.5 overall."
    },
    {
      "rating": "10",
      "text": "This is the definition of a cult classic and for good reason. Evil Dead is unique and insanely fun to watch. If you are a horror fan, This is a must watch."
    },
    {
      "rating": "6",
      "text": "All right let me get this straight, The Evil Dead is not a good movie. However like most old horror movies it is incredibly entertaining to watch and look back at what was actually scary for the time and laugh about it."
    },
    {
      "rating": "4",
      "text": "Sam Raimi's debut \"The Evil Dead\" is a good horror movie. Maybe it is due to small budget of $375,000 that the quality was bad and effects looked fake by today's standards. It could have been much much better. The actors were also inexperienced. None of them did good acting. It all looked fake. Only the story was strong and different. The pace was good and running time was also enough.Overall, the movie was great for that time (1981) but if you are willing to watch it today (2020) you may not enjoy it."
    },
    {
      "rating": "6",
      "text": "The Evil Dead us one of cheesiest and, stupidest horror films ever made. However it comes from a place of heart, so to speak, The heart of Sam Raimi. This is an absolutely amazing piece of cinema that is good but, not great. I can't really describe it to you."
    },
    {
      "rating": "0",
      "text": "I'm sorry, i will keep this review short because i do not want to write about this film. 1981's The Evil Dead is by far the worst film i've seen in months. (I dont watch many bad films, so it doesnt say much, but still)\rI am baffled by the fairly high scores here and on IMDb, i thought this movie was neither funny nor scary at all. (Except the awfully cheap jump scares, which is just a talentless way of scaring the audience) The acting is horrendous and hammy, there is no atmospheric tension, (Halloween is the best example of how atmospheric tension should be done, that movie has barely any blood or kills, but it's 10 times more unsettling and scary than The Evil Dead) the movie scares solely rely on jump scares and gore, which is the worst kind of horror, the plot is extremely simple yet it has so many plot holes, the solution to the film's main problem is abominable, the pacing is poor and so is the structure/ outline of the story. It is cheesy, silly and poorly made, with awful acting and many filming and continuity errors.\r The only things i do have an admiration for are the good makeup and special effects considering the limited budget it had.\r This is the first of the Evil Dead Trilogy (The Evil Dead, Evil Dead II, and Army of Darkness) i've seen, and i want to watch them all, but this did not make me excited to see more."
    },
    {
      "rating": "7",
      "text": "Some of the goriest, sickest, and meanest horror I've ever watched. This blood-soaked movies greatest strength is that you almost never know what's coming up next. Something more modern horror movies fail at. It's sets you up for a terrifying ride in the beginning with it's creepy camera angles and slow-building tension, but once things get going I found that it really wasn't a scary movie. At least not in my opinion. Still it's some old-school horror goodness that feels much more fresh than the more modern horror offerings out there today. At the very least it's worth watching for the stomach-churning gore alone. An overall enjoyable and fun horror movie. My total score for it is a 7.3/10."
    },
    {
      "rating": "7",
      "text": "It was good but not great like everyone thinks. I really did like it though. The movie really knows how to scare the heck out of you and at the same time make you laugh hysterically at how ridiculous it is. It's definitely good enough to buy."
    },
    {
      "rating": "9",
      "text": "I simply love The Evil Dead(1983). Five teens go to a cabin where recorded tape releases evil and cruel demons from the infamous Book of the Dead. And Ash Williams is in this film and is a great hero."
    },
    {
      "rating": "10",
      "text": "A great haunting and original film. It's home to some great special effects and camera work a long with Joseph LoDuca's extremely frighting and eerie soundtrack. Still one of Sam Raimi's greatest film making achievements to date."
    },
    {
      "rating": "8",
      "text": "Sam Raimi's The Evil Dead is a truly frustrating film to watch. Throughout the entirety of the film after the young college-age protagonists arrive at their cabin in the woods, it is impossible not yell out, \"USE THE AXE!\" or \"USE THE GUN!\" It is just one of those horror movies, I guess, where characters have weapons sitting right next to them and instead they opt to let the demon zombie continue to live and just sit right in front of them without doing anything. Nonetheless, this oddly a major part of the film's charm as a pulse pounding and thoroughly thrilling romp through the middle of nowhere while zombies possess everybody in this cabin. Luckily for them, they have the man who will become Ash Williams (Bruce Campbell) at the helm, ready to discover his true calling in life: putting zombies on ice.Providing scares from the moment this pack of morons find a spooky recording summoning demons from the Book of the Dead, Raimi's film consistently uses some exciting ways of spooking the audience and leaving us on edge. With the cryptic nature of that message being read as he shows us something coming to life under the soil, Raimi's film begins to fully realize the tension that had only been hinted at from the beginning. This hinting takes on the form of absolutely brilliant handheld point-of-view shots of something lurking outside of the cabin. Hanging about outside and whispering to Cheryl (Ellen Sandweiss) to \"join us\", Raimi smartly leaves us in the dark as to what is awaiting these kids before we finally get introduced to the sinister evil bubbling underneath the floor boards of this cabin in the woods. It is a terrifying way to build suspense without tipping the film's hand and it is only a mere hint at how scary this film will become.Through explosively campy and low-budget gore and make-up, The Evil Dead keeps the mood relatively light for how dark its plot becomes, but that does not mean it is not a horror film at its core. With tense and thrilling encounters between the kids and their now possessed friends, the film constantly shows the horror of having to kill your friends to survive, while also delivering terrific zombie scares throughout. Featuring an unsettling score that is occasionally accompanied by a truly haunting heartbeat sound and liberal usage of oblique angles when the climax arrives, The Evil Dead is a film that has no problem leaving the audience sweating what is awaiting Ash around the next corner. Compared to Army of Darkness, this initial entry into the trilogy is a lot less tongue-in-cheek and that lack of one-liners is felt when the zombies are around every corner and Ash has no idea how to finish them off. It is tense, thrilling, and an edge-of-your-seat thrill ride that will leave you curling up while wondering if you need to look away or not. It is truly unbridled fun that knows it is fun, but never lets that fact obscure just how scary the film becomes.As with many horror films, The Evil Dead certainly has something going on with the women in the film, namely Cheryl. The first one to get attacked by the demons, she runs in the woods (horrible idea) and gets attacked by the trees. Holding her down, ripping her clothes off, showing us a boob, and then having a tree branch penetrate her, the film quite overtly creates a rape scene. Many horror films include vaginal or penile imagery and this film is certainly no exception as that scene demonstrates. With many horror films also killing those who have sex during the course of the film, it is certainly not far-fetched to believe the two are firmly intertwined. Playing up on the typical sensuality felt when a sex scene is in a film by draping it in blood, guts, and horror, horror films manage to make the audience even more uncomfortable. It is unsettling to watch Cheryl get attacked by the trees and it is only worsened by how vulnerable she is when the trees strip her down. It seems as though there is nowhere to go as it violates it and puts a demon inside her and that inevitability at a point when she is so vulnerable and unprotected is really what makes the scene so effectively terrifying.Scary and thrilling throughout, The Evil Dead lacks the comedic bite of Army of Darkness and with how bad the effects are, that may not be a good thing. However, Raimi plays it so light with some self-awareness about how dumb it all looks that it winds up remaining truly scary and yet not scarring. That said, it was probably a good idea to turn its sequels into horror comedies, if only because it plays so nicely into Sam Raimi's wheelhouse and skillet. However, as a more straight-up horror film, The Evil Dead delivers the goods in a fun and thoroughly spooky film."
    },
    {
      "rating": "6",
      "text": "Cheesy, wacky, excessive and unique, \"The Evil Dead\" may be a movie that I ultimately value more for starting the career of Sam Raimi than for its merits as a piece of entertainment, but that doesn't mean my watching this for the first time was anything short of enjoyable. Dated in all the ways you'd think it'd feel more modern and modern in all the ways you'd think it'd feel more dated, \"The Evil Dead\" is a complicated movie to digest in the year of our Lord 2020. You find yourself impressed with the makeup and effects, yet disappointed with the performances and music. You appreciate the film's contributions to the genre and its totally unorthodox feel, yet lament the existence and question the purpose of the infamous \"tree rape\" scene. To compartmentalize such things is always suboptimal, and the experience overall was definitely wild and weird, but not one I'll forget so soon."
    },
    {
      "rating": "8",
      "text": "Forgetting that it's an older film with poor special effects this is actually a surprisingly good film I found very entertaining. Main reason why I saw it was to prepare myself for the remake that's coming out so I now know the story, and what a great story it is! A little corny, of course, but done in the right amount that makes it work, and the characters are great, Ash in particular. It got a little odd towards the end but overall I was impressed and certainly entertained."
    },
    {
      "rating": "4",
      "text": "Less easily impressed audience members will find themselves wanting to beat this film relentlessly until the maniacal laughing stops."
    },
    {
      "rating": "9",
      "text": "I was 14 and had the flu when a friend handed me The Evil Dead VHS tape back in 1981. My 11 year old sister was also home sick so with our parents at work I put this on and we were so FREAKED OUT! For awhile, I had a movie ranking system and Evil Dead was the goriest. The Thing was the scariest. Dawn of the Dead was both. It still amazes me how Sam Raimi did this on a shoe string budget."
    },
    {
      "rating": "10",
      "text": "One of the best movies of all time. Everything is good, must watch! Great plot and pace, memorable scenes and special effects (for its time). Overall a masterpiece."
    },
    {
      "rating": "9",
      "text": "A film that genuinely terrified me. With the low budget, the cinematography has a sinister charm, that leaves room for ambiguity and surprise. The shock value in here is great for people with a taste for horror."
    },
    {
      "rating": "8",
      "text": "or the film that kick started the careers of Sam Raimi and Bruce Cambell I can see why. The tone, the fun, the camera-work, all great. It is a scary movie, but the characters are rather likeable especially Bruce Cambell's. The camera work in this movie is so original and just makes it feel that much more original. The practical effects were pretty good and although the stop-motion had a cartoonish quality to it, it still felt like love was put into it. I did find some goofs though, really noticeably. But that aside, the film was gripping and held me on the edge of my seat the whole time."
    },
    {
      "rating": "7",
      "text": "I've watched this on YouTube a couple days ago and I can see why people liked it. It's not the most scariest movie ever made but it did try not to rely more on the cliches then other movies and plus it at times did made me jump. The movie is obviously low budgeted (of course) but I think that's the movie's bigger strength. I loved the camera in the movie, even though the camera for me doesn't make some of the scenes scary but at times it does make it feel like you are walking in a haunted house ride, plus the makeup for the deadites (yeah I don't like that name too) makes the experience more realistically fake. And as I said before the low budget is the movie's bigger strength because there are a lot of things to be inspired by, possibly one of the best films to admire and spark a passion for film making for future movie goers to horror fanatics. Sam Raimi, Bruce Campbell, and Robert Tapert did a great job on the film, not bad for a couple of amateur movie makers at the time don't you think? What else can I say but great work.\rNow for the ratings. To me The Evil Dead gets 3.5 trees/10 and for Metacritic a 7/10. Stay Groovy!"
    },
    {
      "rating": "10",
      "text": "Oh my, The Evil Dead was.... Amazingly brilliant, I loved the whole series, although this one sticks out the most. \"Swallow your Soul!\" I've watched this film over and over again, it still impresses me.\r100/100 (if i could rate Like that)\r\"Groovy\""
    },
    {
      "rating": "6",
      "text": "The movie was interesting and entertaining for the most part.The acting was not that bad and the practical effects were well made.Even though it is highly overrated and I didn't find the movie very funny, it's not a bad movie."
    },
    {
      "rating": "3",
      "text": "Evil Dead (1981)Sinopsis:En una misteriosa y aislada cabaña, un grupo de adolescentes resucitan por accidente a unas fuerzas demoníacas con un conjuro.Opinión:La verdad no me gustó mucho, en aspectos técnicos está bien lograda para ser de bajo presupuesto, pero en general me pareció plana y poco elocuente, los personajes actúan mejor estando poseídos que cuando no lo están y eso que los poseídos tienen una chispa y personalidad que raya en lo caricaturesco y cuando estaban en estado normal no parecían ni tener idea de donde estaban parados.No se si seguir viendo las secuelas y el remake, ya que no tuve una muy buena primera impresión."
    },
    {
      "rating": "9",
      "text": "Truly one of the best horror movies ever made. Sam Raimi's inspired foray into the genre has rightly gained an enormous cult following and as well of an extended franchise of its own including a superior sequel, a fun follow up, a solid remake and an amazing tv series. At its core is the handsome, charismatic Bruce Campbell as him and his friends are terrorized by a dark evil from the book of the dead, \"the necronomicon\". Que the grotesque possessions, blood spraying, tree raping, and mutilation. The movie is guerilla filming at it's best and most inspired. Slick cinematography and smart direction elevate the proceedings and make it all feel real, intense and at times comical despite its budgetary limitations.The results are one hell of a scary movie that helped defined the genre.Budget: $375,000Box Office: $2.6M9.5/10"
    },
    {
      "rating": "10",
      "text": "The Evil Dead is easily one of the best horror films that I have ever seen. Sam Raimi used his low budget to the fullest. The protagonist, Ash Williams, is just so AWESOME. The films story isn't really all that original but I can easily look past that. The film is also not for the faint of heart. It is VERY brutal and gory. In the end, I love this film to death and it is just so great."
    },
    {
      "rating": "6",
      "text": "A cult classic horror movie you either love or hate. Personally, I am not sure yet if l loved it or not. Maybe it was too gory for me, l wanted to vomit all the time. The night after l saw it, l couldn't sleep, lol."
    },
    {
      "rating": "6",
      "text": "I finally get why people consider Evil Dead II as one of the best and superior film sequels. For as much as I found this one truly innovative in terms of its stylish direction, some ideas, amazing camerawork and fantastic stop-motion animation, claymation and practical effects in general, it's in grave need of more self-awareness to compensate for its great lacking in substance and justify its unbelievably dumb characters. It's still good fun, though.(6/10)"
    },
    {
      "rating": "6",
      "text": "Cheesy even for a horror comedy, it's really overrated, and the stuff in here is just kinda dumb, but it was realy funy, and kinda good at times"
    },
    {
      "rating": "10",
      "text": "The first Evil Dead film from Director Sam Raimi is a classic early 80's Horror that inspired me with it's ingenuity, creativeness and gore. The original cabin in the woods movie has a supernatural force that seems to envelope every frame like something is always watching. Some people prefer the more comedic Evil Dead 2, which is also great, but with the small budget original everything seems more tense and atmospheric. The beautiful cinematography puts you in a state of dread, leading you up to shocking moments that can scare, nauseate, and disturb you. The claustrophobic nature of being trapped and cornered by an evil that constantly surrounds you, prays on weaknesses and vulnerability, and twists your brain into a state of fear and paranoia is conceptually brilliant. One of my favorite films, not just in Horror but in general."
    },
    {
      "rating": "8",
      "text": "Iconic. A true delight for horror movie fans. In less than an hour and a half, 'Evid Dead' manages to escalate really fast.There are many flaws I can depict, as the outdated special effects, some lame jumpscares, the makeup, the mismatches and the little holes in the pot.However to me this movie is notable because I totally was into it until the end. It is raw, visceral, raw, funny sometimes, violent, disgusting, cunning and often clever. It is so rare to witness horror movie characters doing things that are not totally dumb. I mean they often do very clever choices, not emotional ones.The acting oscillate between okay and terrible. Actresses showcase many varied emotions. Special thanks to Betsy Baker playing as Linda which was the most remarkable performance out there.The soundtrack and soundscape is amazing and contributes, in addition to the lighting, the travelings and the first-person shots to make us dive into these horrifc visions. Danger often comes where we don't expect it, leading to scenes full of surprises. In a word : intense."
    },
    {
      "rating": "10",
      "text": "Masterpiece!Music was literally chilling and terrifying at same time,acting,screenplay and story was Great,simple premise wonderful execution even though its 80's felt little off as per video quality but as per jump scares it a greatest movie,starting was nice the intro and certain elements were hinting and the camera work was astonishing,the starting Scott scare was unpredictable and shocking scare as we move in story the silence was key to build-up perfect scares some times its predictable even though it was literally shocking terrifying,the violence and blood was too much perfect fit for such theme the whole movie theme was dark and chilling,although the ending was little surprise about ash the blood and white thing was Grose to look,love the eye to eye scene and Ash survival overall it felt little old but literally its having greatest jump-scares with chilling music and blood,terrifying classic!"
    },
    {
      "rating": "10",
      "text": "watched the shining yesterday and the evil dead today, not sure which I prefer"
    },
    {
      "rating": "7",
      "text": "The Evil Dead is an extreme ride into the gory side of the horror genre. Often disgusting, disturbing and shocking, the film still presents itself as fun, and not to be taken seriously. Depending on the viewer. The production design was good, and the film blatantly and proudly shows off its gory and glorious violence, although sometimes it becomes pretty cartoonish. The cinematography is also quite good. The only problem is the acting and the dialogue. The acting was a little dry and unbelievably stale, and the dialogue was pretty cheap, though there are moments where the cheapness works."
    },
    {
      "rating": "10",
      "text": "This movie is great! A lot of people say the second one is better but I think this one is the easy winner"
    }
  ],
  "recommendations": [
    "hellraiser",
    "evil_dead_ii",
    "the_texas_chain_saw_massacre",
    "the_conjuring",
    "the_conjuring_2",
    "the_collector",
    "it_follows",
    "terrifier",
    "the_descent",
    "clown",
    "the_ring",
    "scream",
    "the_possession",
    "the_babadook",
    "wrong_turn",
    "the_return_of_the_living_dead",
    "cabin_fever",
    "the_woman_in_black",
    "the_texas_chainsaw_massacre",
    "house_of_1000_corpses",
    "ouija_origin_of_evil",
    "sinister_2",
    "annabelle_creation",
    "insidious",
    "annabelle"
  ]
}