{
  "id": 2786,
  "title": "The Day After Tomorrow",
  "starring": [
    "Dennis Quaid",
    "Jake Gyllenhaal"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Thriller"
  ],
  "description": "After years of increases in the greenhouse effect,  havoc is wreaked globally in the form of catastrophic hurricanes, tornadoes, tidal waves, floods and the beginning of a new Ice Age. Paleoclimatologist, Jack Hall tries to warn the world while also shepherding to safety his son, trapped in New York after the city is overwhelmed by the start of the new big freeze.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kNKy8eJemg6sCAMBgh4xrD0lleX.jpg",
  "categories": {
    "plot": 6.041666666666667,
    "acting": 5.826086956521739,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 1.5,
    "action": 6.3
  },
  "reviews": [
    {
      "rating": "5",
      "text": "\"The Day after Tomorrow\" starts in a broad scale with impressive visuals, but lacks the lasting appeal as well as the character depth. I can suspect where the movie wants itself headed to, but fails to execute in action."
    },
    {
      "rating": "6",
      "text": "As Paleoclimatologist Jack Hall discovers that a large ice sheet has been sheared off, he realizes that it triggered a massive climate shift that would affect the world population. Meanwhile, as his son, Sam and his friends attend an event in New York, they discovered that it has been raining for three weeks, but little do they know that the world will be entering the new ice age. Jack and his two friends make an attempt to rescue his son while surviving cold temperatures that could kill them.\r At times, the storyline and characters were undeveloped, but to give credit, the CGI looks cool and the moments with the storms were very intense and it keeps you interested in what's going on and sometimes the acting was pretty decent The Day After Tomorrow suffers from its lack of story and character, but keeps you interested with good CGI, good acting, and very good moments with the storms.\r 6/10"
    },
    {
      "rating": "9",
      "text": "Great movie.  Really good dialogue combined with a great visual presentation, helps to create a stressful environment that leaves you on the edge of you seat."
    },
    {
      "rating": "6",
      "text": "You can't deny that the visual effects are extremely cool to look at, but the script and the dialogue are rather weak. Also, after an exciting one and a half hour, the movie slows down to the point where not much is happening."
    },
    {
      "rating": "3",
      "text": "Wow! Outside some decent SFX this is horrible movie. The dialogue is wooden that at times I thought this a satirical comedy."
    },
    {
      "rating": "10",
      "text": "I don't care what the others say, but this movie is good."
    },
    {
      "rating": "5",
      "text": "Letâ"
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie but if I had to pick between 2012 or this movie, I would probably pick 2012."
    },
    {
      "rating": "10",
      "text": "This is the best film about climate change!  The effects are amazing. Is my favorite film  after Titanic, there are many scenes of action.   If you liked movies disaster this is your movie."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie- it's like 2012, but if it had better characters and more tragedy. And I like that the disaster was due to climate change rather than natural disaster, at least to convey the message of,\"STOP F***ING UP THE EARTH!\"\r And the theme song and effects were really awesome"
    },
    {
      "rating": "7",
      "text": "This movie is a visual masterpiece, it has created a cult classic and is iconic. However, this movie contains cliched flat characters, with thin plot so it is all about visuals and some tension. Is this movie worth watching? I was curious at first, and I know I wouldn't like it but I did it, I knew it won't be a perfect experience it isn't! It is a  B popcorn film that is all about visuals, with some tension and heartwarming moments."
    },
    {
      "rating": "6",
      "text": "Great Visuals and some very terrfying scenes about what nature can do but the acting and story are clumsy and the director mixes too much politics in the film. You will probably pay a lot more attention to the weather after this though."
    },
    {
      "rating": "6",
      "text": "Good special effects and entertaining."
    },
    {
      "rating": "2",
      "text": "Don't bother watching it. Not tomorrow, the day after tomorrow, or any other days after that."
    },
    {
      "rating": "0",
      "text": "This film is a disgrace portraying a real world problem with fantasy and pseudoscience that has undermined the need to address global warming. This film could have been done so much better if only it used real consequences of climate change and was set in the near future instead of apocalyptic rubbish...and that ending...what the  was that? Talk about undermining the need to address climate change if the problem can be solved that easily."
    },
    {
      "rating": "10",
      "text": "This is the best disaster movie ever. It's got apocalyptic atmosphere, flawless effects and a beautiful soundtrack. But more importantly, it has people running away from the cold! They literally run away from cold weather that's chasing them down corridors like Michael Myers! Isn't that hilarious?"
    },
    {
      "rating": "3",
      "text": "pretty crappy this movie dosent explain anything about the characters and they just expect you to know whats happening, some parts are exiting and funny but most of it is so unrealistic its funny. the spetial fx are good but most is pretty bad"
    },
    {
      "rating": "4",
      "text": "The Day After Tomorrow was a godawful movie, not worthy of any awards. An ice age cannot happen in 3 days - it takes time. This movie was generally 2 hours of my life wasted - and not in a good way. There were a lot of flaws in certain scenes, a lot of cliches - it's amazing that this movie even got good reviews.\r Of course, everyone has their own opinions. Don't rely on mine."
    },
    {
      "rating": "3",
      "text": "The Day After Tomorrow is an ice cold movie that doesn't really deserve to be liked at all. The only people who liked it are the people who are interested in the movie."
    },
    {
      "rating": "10",
      "text": "The Day After Tomorrow. The future that no one expected. Not strong in geology and other sciences, but I will say that the film was shot amazingly! Hurricanes, floods and other natural disasters, of course, you want to see only in the movies. Because only in the movies does it look so much bewitching."
    },
    {
      "rating": "0",
      "text": "If the world were indeed to end tomorrow I would die happy knowing the people who wrote this tripe went with it."
    },
    {
      "rating": "4",
      "text": "This could have been a better film than it is and has a really poor dialog but good effects."
    },
    {
      "rating": "6",
      "text": "Evocative and restrained musical score, stunning visualizations and immersing sound effects are featured as people struggle to survive in the shell of a city subjected to a natural catastrophe. Actually a striking movie if initially viewed following Hurricane Katrina, a perspective not available when the movie was released. Too many Hollywood cliffhanger elements, improbable weather events and environmentalist dogma preclude eligibility as an intelligent film. The enviros cover all their bases by claiming global warming can bring another ice age. Come on you phonies, do you understand how this planet works or not? However, I do believe that nature bats last, and a lot of the social interaction and political responses as the characters struggle to survive resemble today's news coverage and is truly touching."
    },
    {
      "rating": "6",
      "text": "you know, not as bad as the reviews said. wasn't great, and the \"animals are smarter than humans when it comes to the weather\" cliche was pretty stupid ... but all in all, a good popcorn movie with a message that is at least thinking about. yes, the climate isn't going to \"ice age\" us tomorrow, but it's still something to consider."
    },
    {
      "rating": "7",
      "text": "It was a really good movie it kept me awake through the night. I agree what Steve P. said it's a B movie."
    },
    {
      "rating": "10",
      "text": "I think this was a very effective film that had an impact on the audience, The special effects were brilliant. I think it was a brilliant way to get the point across that global warming is completely unpredictible and could happen in our lifetime, even if at times the special effects could be some what \"dramatic\"."
    },
    {
      "rating": "5",
      "text": "Pseudo-science spins a new apocalyptic disaster story that becomes increasingly less likely as the movie goes on. All of the characters are archetypes (loveable poor guy; lovestricken handsome young man; indignant snob; headstrong cop; bitter scientist; et. al.), so you can walk into this movie and know all you'll need to know about everyone without having to think. You'll have to leave your disbelief at the door, though, as you see wolves turned into maneaters after a day of freedom, and people literally running from cold that is creeping across the floor. The computer effects are largely beautiful, and certainly deserve commendation. Unfortunately unlike other, older disaster movies, since cold is the killer here, prepare to see a lot of slower, more agonizing deaths, and more sad corpses - things that hurt the escapist entertainment of such a movie. Its best point, like the novel World War Z, is the rare moments where this science fiction premise overlaps our real world and puts a creative spin on our current prejudices, like people illegally crossing the border INTO Mexico, or burning books for warmth. If creative touches like that were more frequent, it might be a really good movie. As it is, it's a take-it-or-leave-it disaster movie that's somber entries into the genre are usually frantic."
    },
    {
      "rating": "8",
      "text": "I seem to be the minority here; I liked this movie a lot. Not sure it was quite deserving of an 8, but it should get more than a 7. Incredible visual effects. The movie would be worth seeing simply for that reason. I personally also really liked the casting. Quaid and Ward were great. Gyllenhaal, in my opinion, is one of the more underappreciated actors I've seen recently, but I thought he put on a wonderful performance too. I was entertained from beginning to end, there was hardly a dull moment."
    },
    {
      "rating": "10",
      "text": "Not only is this movie an edge-of-your-seat thriller, it also spreads the message of the threat of global warming clearly."
    },
    {
      "rating": "10",
      "text": "This is not just some ordinary disaster movie. For those who pick out the little problems like the special effects, you are plainly: DUMB. Something similar to this will happen sometime in the future, when people are still on Earth, and at that time, even the special effects in the movie wouldn't be able to compare to the force of Mother Nature. Just wait and see.. or maybe let your grandchildren see, and pay the price for your consequences."
    },
    {
      "rating": "9",
      "text": "Ok... This movie was made in 2004, and the special effects looked real! The movie has a great plot. Unfortunately it's a little dull since its more science s**t than anything. Great movie."
    },
    {
      "rating": "10",
      "text": "One of the best films I've ever seen. Atmoshpere is very good I felt like i am in the cold New York and tried to stay alive."
    },
    {
      "rating": "7",
      "text": "I loved this movie; it is a modern-day Plan 9, a B movie with all the usual clunky plots. The wolves are missing? They'll show up again... on a ship in the middle of Manhattan! The guy says \"...and I'll go, too\"? Yes, he's going to die. We're trapped in a building full of wood... so all we can burn is books! Come on, people! This movie is brilliant... just not the way the writers intended. Grab some popcorn, rent this movie, and enjoy!"
    },
    {
      "rating": "0",
      "text": "Ok, so wolves held in captivity and fed not less than 12 hours ago, suddenly when freed (and apparently because it's cold) start attacking people with a ferociousness that even completely wild wolves would never attain. Then how about a hero who understands the situation better than anyone else and then turns his back on what's left of devastated humanity to go BACK and search for his son because of some stupid guilt problem. And by the way, if things were freezing so fast that you could see frost progress along walls and doors and such, the air would be unbreathably frozen long before they could run. This movie was crap."
    },
    {
      "rating": "6",
      "text": "Probably one of my favourite Emmerich film, next to Independence Day though I like it in a guilty pleasure kind of way. The acting is still tacky, scientific accuracy is out of the window and there are plot holes everywhere but at least the characters are actually slightly more human than the other Emmerich films because they actually look like they are struggling. The special effects are still good looking and though tacky, the acting wasn't as bad as from previous Emmerich films."
    },
    {
      "rating": "7",
      "text": "A few of the characters in the movie may feel unnecessary and / or annoying, but in the end, the message shown in the film is that we must do something to save our Earth or else the future will witness something similar to what was shown."
    },
    {
      "rating": "7",
      "text": "Perhaps one of the better Roland Emmerich movies but that's not saying much as most of them suck despite being very financially successful. The Day After Tomorrow's special effects are great but characters are lacking. Take away the special effects from this movie and you will have very little left. There also is a really stupid scene with CGI animated wolves, completely unnecessary but what more can you expect from Roland Emmerich?â"
    },
    {
      "rating": "7",
      "text": "Watchig tr movie right now in school. Its cool abd full of action"
    },
    {
      "rating": "8",
      "text": "This film is good - I like the characters but most of all I found the climate change plot fascinating. This made the intense scenes with the snow and the rain quite entertaining, but it was pretty emotionally intense  as well. It's not a perfect film, but I enjoyed it when I was younger and I enjoyed it now. It still delivers brilliantly, and Jake Gyllenhaal is still as clever and gorgeous as usual."
    },
    {
      "rating": "5",
      "text": "At times 'The Day After Tomorrow' feels more like a made for television disaster miniseries than a AAA Hollywood title. You know, those movies we're excited about when first hear the outrageous plot (usually involving the destruction of iconic American landmarks) but are entirely disappointed when we actually watch it. However, this isn't because the special effects are cheap and unbelievable, but more so because the acting in this picture is incredibly bad. Paris Hilton bad. Now that's hot... err, bad. Watch this flick for the destruction scenes ONLY."
    },
    {
      "rating": "7",
      "text": "In The Day After Tomorrow, the writers take a real life theory and magnify it by a billion, turning it into a apocalyptic special effects thrill ride. Something that is supposed to happen in thousands of years, happens in a couple days, with Jack and Sam Hall caught in the middle. While one is trapped in hard hit New York City, the other must track across the country to save him. Okay, it's a little cheesy and the acting isn't the best, but the special effects are some of the best I've ever seen. I like that it's based on fact and a look into a possible future, well beyond my lifetime and overall it was extremely entertaining. Many of my fellow reviews considered the film to be a warning on global warming, but that's really crazy. Unless you're Al Gore, you should see this movie for what it is. A bunch of smart writers having fun with a scientific theory that may or may not come true one day."
    },
    {
      "rating": "6",
      "text": "The Day After Tomorrow has no intention of sending some deep or subtle message to its audience. The film is meant to be sheer spectacle, and in that aspect, it succeeds."
    },
    {
      "rating": "6",
      "text": "There certainly are wasted opportunities throughout and the film does stumble over itself countless times. The Day After Tomorrow does; however, feature moving visuals and a fairly interesting plotline."
    },
    {
      "rating": "5",
      "text": "This movie thrives on the several action scenes it has. Everything else about it is a dull lazy script. I had no interest in what any of the characters were saying. Just show the tornadoes and tidal waves of destruction."
    },
    {
      "rating": "6",
      "text": "You can't deny that the visual effects in \"The Day After Tomorrow\" are stunning. However, after an exciting one and a half hour, the rest becomes increasingly dull where not much is happening."
    },
    {
      "rating": "7",
      "text": "An interesting (and, IMHO, entertaining) movie from, of all studios, FOX.  The basic premise is that, for whatever reason, there is a drastic change in the climate system of the earth.  The story is a classic 'scientist tries to warn people, but they won't listen' plot.  Of course, when things hit the fan, it's already too late (though it would seem that nothing could have been done to prevent the change, but an early decision to evacuate people from a danger zone, roughly anything north of the 30th parallel, may have saved many people from death).  I did like the special effects (though some of them, how can I say this, seemed 'forced').  The one major beef I have is that it seemed to drag on, maybe about 20 minutes longer than it should have.  Also, the heavy-handed approach to global warming/climate change also seemed forced.  Another thing is that it seemed like they director/producer were going out of their way to mock FOX news (not that I'm a fan of that network), to the point of ridiculousness (ie:  \"Tornadoes are attacking Los Angeles!).  But, on the other hand, I particularly got a kick out of the actor playing the Vice President...IMO, a dead-ringer for Vice President Cheney."
    },
    {
      "rating": "6",
      "text": "Its just your regular apocalypse movie with the same old story. But what an amazing visual dazzle."
    },
    {
      "rating": "5",
      "text": "The parts during the disasters were good, the parts with no disasters are bland.This movie lacks the emotion and the settings were the worst. A library is not a good place to set it, they should have just left the project instead of showing it."
    },
    {
      "rating": "4",
      "text": "The visual effects are very good, thanks to a big budget. And the basic story is a good idea, but very weak, because it has not many details. The movie focus on the fate of random people to touch feelings, but gets boring and superficial. So the characters are also superficial. In addition there are so many illogical scenes."
    },
    {
      "rating": "7",
      "text": "The Day After Tomorrow is a summer blockbuster that has some great disaster scenes and a good musical score. Other than that, the movie doesn't have much more to offer."
    }
  ],
  "recommendations": [
    "sunshine",
    "into_the_storm",
    "monsters",
    "battle_los_angeles",
    "elysium",
    "2012",
    "geostorm",
    "independence_day_resurgence",
    "the_tomorrow_war",
    "jurassic_world_fallen_kingdom",
    "war_of_the_worlds",
    "sanctum",
    "poseidon",
    "mortal_engines",
    "the_grey",
    "code_8",
    "pandorum",
    "independence_day",
    "gravity",
    "the_purge_election_year",
    "jupiter_ascending",
    "a_quiet_place_part_ii",
    "the_5th_wave",
    "captive_state",
    "tomorrowland"
  ]
}