{
  "id": 2776,
  "title": "The Reader",
  "starring": [
    "Kate Winslet",
    "Ralph Fiennes"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "The story of Michael Berg, a German lawyer who, as a teenager in the late 1950s, had an affair with an older woman, Hanna, who then disappeared only to resurface years later as one of the defendants in a war crimes trial stemming from her actions as a concentration camp guard late in the war. He alone realizes that Hanna is illiterate and may be concealing that fact at the expense of her freedom.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r0WURbmnhgKeBpHcpDULBgRedQM.jpg",
  "categories": {
    "plot": 6.088235294117647,
    "acting": 6.576923076923077,
    "ending": 6.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "To KL before ragging on this movie for the full frontal nudity of a teenager, maybe you should do some research, the \"teenager\" was born 7/90, making him 18 and of legal age of consent to film what ever he wants...so I urge you to judge the film on its actual content and not your uninformed opinion. This is fiction people!!"
    },
    {
      "rating": "1",
      "text": "There is a serious problem with this film. The first third of it includes graphic sex scenes between an adult and a teenager. And in this case, the actor portraying a teen is actually a teen. Since when is it legal to shoot full frontal nudity with kids??"
    },
    {
      "rating": "9",
      "text": "This movie is a great depiction of the victimization of women the world over. This single woman is jailed for the heinous crimes of Nazi men, and her single supporter who could have helped her kept silent...Ah, men, how dispicably you are portrayed in this film. She is held responsible for men's wars and is punished for them...Ugh, it is truly reprehensible."
    },
    {
      "rating": "7",
      "text": "Kate Winslet's shines in this bleak thought provoking movie. While it is gloomy and graphic, one can't help but feel sympathy for her character even though she should be despised. The story accomplished what it sought to tell, and it did so quite convincingly."
    },
    {
      "rating": "8",
      "text": "Winslet definitely deserved her Oscar (though I haven't seen Revolutionary Road yet)--her portrayal was fascinating from start to finish. There is nothing black and white about this film for me (other than that Winslet is great and I loved Kross as well). No easy judgement of the characters or what they did, mercy regarding personal shame and punishment--all totally shown in their complexity-- and I'm pretty sure that was the idea. As soon as you want to condemn someone, you must face your own moral relativity. This film gives you many chances to judge or sympathize and leaves it to you to figure it out. Bravo."
    },
    {
      "rating": "5",
      "text": "Frustratingly uneven throughout. Kate Winslet literally saves the film from being a complete mishmash. Ralph Fiennes is completely limp and adds nothing and is almost ridiculously inert. The young MIchael is an attractive and intriguing guy, but the college age MIchael looks and acts strange and not in a revealing or appropriate way. And was the daughter necessary at all?"
    },
    {
      "rating": "9",
      "text": "I completely agree with Maciej C. in one respect: Kate Winslet deserved her Oscar, but it should not have been for this movie. So nice to find a kindred spirit! Winslet's performance in \"Revolutionary Road\" was SHOCKINGLY good - awesome in the truest sense of the word. As for The Reader, I can understand the critics' opinions that parts of the 2nd half did not live up to the beginning. What I hate, though, is their seeming dislike of ambiguity. Hello! Ambiguity and a sense of the characters suffocating their emotions doesn't make for a bad, or even average, film. I found it heartbreaking in so many ways, and that's ok. Also, when critics are moralizing about their individual interpretations of The Holocaust, they are not reviewing a film. They're just trying to promote their opinions. This film doesn't FORCE you to have sympathy for a Nazi. It asks you, \"DO YOU THINK you could have sympathy for a Nazi?\" It draws no conclusions, just puts out plot points to make people think, and question their long-held opinions. I gave this film a 9 because it's not perfect. But in the world of current film-making, it is one of the best."
    },
    {
      "rating": "8",
      "text": "Winslet's powerful and remarkable performance makes this well worth watching. Very well written, fine period detail. The story is always interesting. The art direction and cinematography are exceptional."
    },
    {
      "rating": "10",
      "text": "The best performance of the year miss kate winslet"
    },
    {
      "rating": "10",
      "text": "This is on my top 10 list for 2008 right now. I found it a beautiful and powerful movie. It's like two separate films in one, the first half a love affair while the 2nd half was a resolution to the impact of secrets among ourselves. I strongly recommend this film for any serious movie goer."
    },
    {
      "rating": "10",
      "text": "Excellent movie. I'm surprised at the low scores given this movie and the ridiculous reasons for the low scores. I suspect that most people still prefer movies with really bad guys and really good guys such as a superhero movie. This movie has good and bad mixed all up and I'm sure that blows most people's minds and sense of decency."
    },
    {
      "rating": "10",
      "text": "I loved the moral ambiguity. It is one of the most thought-provoking films I've seen in a long time and Kate Winslet is outstanding."
    },
    {
      "rating": "7",
      "text": "My first impression was that this is great and striking movie. It was like an attempt to look on things and events from inside. Firstly this film reminded me The Captain Reddle in the way of showing the life in its shocking diversity. It raises the quastions of law and moral, what should be judged and what we could have a mercy on. So, frankly speaking, it seems a bit ideological, I mean an attempt to normalizing history. Is it possible to explain everything trough the feeling of obidience to law. Of course, moralizing is not the best way of accepting and interpretating because we should take into account different \"personal reasons\". Still as it was said in the film - every law is connected to current life. So from \"today moral values\" it seems like whitewashing of old crimes. PS. I am sorry for my grammar I am not a native speaker)))"
    },
    {
      "rating": "5",
      "text": "Peaking in a the sex was the only saving part of his film: bu evevn this left one conflicted....Ultimately, a boring overwrought film."
    },
    {
      "rating": "9",
      "text": "\"The Reader\" is a fine piece of filmmaking. It is one of all too infrequent examples of a truly adult film that many discerning adults will appreciate. Those who prefer their characters to be all this or all that should stay away. The film's moral ambiguity will not be to their liking. Kate Winslet, the best actress of her generation, is superb and is supported by a superior cast."
    },
    {
      "rating": "4",
      "text": "Kate Winslet is top-notch and the story has potential but everything is marred by a half unimaginative screenplay, a totally unimaginative direction and a thoroughly hypocritical and underdeveloped character, and that's not Hannah, it's Michael. And Ralph Fiennes is annoying, really really annoying."
    },
    {
      "rating": "9",
      "text": "Great cast and great performances - especially by Winslet and Kross."
    },
    {
      "rating": "10",
      "text": "Most reviewers who panned the movie missed the point (and they would benefit from viewing the Director's feature included on the DVD). If you're expecting a classic Holocaust film, this isn't it. But neither is it 'soft on the Nazis', as some claim. Watch it and draw your own conclusions -- they may not come easily, but that's what separates great films from good ones."
    },
    {
      "rating": "3",
      "text": "Call me crazy, but didn't Sophie's Choice work far better in 1982 when the young protagonist's first love was a Nazi VICTIM, not a perpetrator? The title character and narrator of Stephen Daldry's filmization of Bernhard Schlink's bestseller is a callow creature who hooks up with a streetcar conductor (Kate Winslet) in the 1950s, and due to her demand that he read aloud to her before sex, finds that The Adventures of Huckleberry Finn can be just as effective an aphrodisiac as Lady Chatterley's Lover. Through a series of contrived coincidences, he later learns that his friend with benefits had previously been a concentration camp guard, and he grows into Ralph Fiennes, experiencing a higher-than-average degree of Ralph Fiennes guilt. Stage director Daldry's one watchable film remains his first, Billy Elliott; otherwise he's the reigning king of WTHITA (What-The-Hell-Is-THIS-About) cinema, a first cousin to the WTHWTH (Why-The-Hell-Was-This-Made) film; his second effort, The Hours, taught that the height of 1950s women's liberation was to, under the inspiration of a suicidal novelist, dump your adoring husband, thus shattering your sensitive little boy's self-image and eventually destroying his life. The message of The Reader seems to be \"Nazi stooges need love too, especially if they're illiterate.\" Mind you, there's a universe of difference between HUMANIZING evil (as Fiennes did beautifully in Schindler's List) and whitewashing it; The Boy in the Striped Pajamas may have its share of haters, but at least it aptly communicates the horror of the camps. The Reader, in a misguided attempt to build sympathy for its central figure, deliberately abstracts her crimes and their effects, keeping us at a calculated distance...and no, a last-minute coda featuring Lena Olin (who's nevertheless excellent) doesn't help. I have no problem with Winslet winning a Golden Globe (and most likely an Oscar) for her portrayal; she admirably delivers a completely unsentimental performance that in no way buys into the filmmakers' apparent intent--in fact, under the circumstances perhaps she should also be up for a Congressional Medal of Honor. As for the rest of The Reader, if I want to look at Nazi porn (or, more precisely, if I'm forced to at gunpoint), I'll rent out Ilsa, She-Wolf of the SS or one of its sequels, which at least have the ever-so-slight advantage of unpretentiousness."
    },
    {
      "rating": "9",
      "text": "Wonderful movie with great acting.But isn't it illegal to show nude a 15-year old character even if the actor is over 18?"
    },
    {
      "rating": "9",
      "text": "Above all, The Reader is a beautifully filmed love story and not the Holocaust movie that critics led me to believe it was. Kate Winslet is illuminous and heartbreaking as Anna, reminding me of Vanessa Redgrave as Julia, and if she gets a supporting actor nomination for this she will be the clear favorite. Ralph Feinnes is once again outstanding and deserves recognition but with In Bruges, The Duchess and The Reader he will slpit his own votes and go without again this year. Please give The Reader a chance, it's not Schindler's List or The Pianist, it is a love story for the ages!"
    },
    {
      "rating": "6",
      "text": "When Ralph Fiennes starts looking wistful, and the flashbacks attack, the film lapses into sentimentality. Scenes of Winslet with young Kross, however, crackle with the power of sexual coming-of-age. Still, too many questions hover unanswered and we leave unsatisfied."
    },
    {
      "rating": "6",
      "text": "I remember reading the book many moons ago and being absorbed. I didn't have the same feeling with the film. Although dealing with a serious subject, I felt it lacked intensity, even if it was quite moving in parts. Kate Winslet was good but not outstanding. The young German actor Kross was excellent. That's my opinion of the film."
    },
    {
      "rating": "9",
      "text": "Kate Winslet and David Kross give deeply sensitive portrayals of complex characters. Kudos to them."
    },
    {
      "rating": "10",
      "text": "incredible and powerfull movie. Winslet, Kross and Fiennes are amazing."
    },
    {
      "rating": "8",
      "text": "An adult film that keeps your attention without throughout. Rating of 58 almost kept us away."
    },
    {
      "rating": "9",
      "text": "Pretty good movie. first I was like OMG to much sex in. but you only have to wathed till the end to see all the beauty of the acting the script the images the ... all the movie. and for those who can't do the part of fiction and reality you know some actors can play characters younger than they are."
    },
    {
      "rating": "6",
      "text": "Although most people seem to say the second half was the better half, focusing more on the German guilt and et cetera aspects, I really enjoyed the first half far more thoroughly. The human aspect was quietly well done, with a subdued resonance running beneath the dialogue. But once the film shifted, it started to gradually get weaker and weaker, not really knowing how to support itself, and ultimately falling flat, losing any emotion it had built along the way. Really, my main problem with the film is that there were so many things that could've been done with the plot and the characters, and it was reduced to barely a nub--the entire theme of protecting a secret and human shame was pratically nonexistant--though the entire film is built around it! Winslet's character already had many complicated layers built in, yet the filmmakers still managed to make her somewhat two dimensional. I went in expecting just an average movie posing as Oscar bait, and was surprised at the first half, only to be ultimately affirmed in the second half of me assumptions. I'm at a loss for putting my critique into words at this moment, but it just seems that all the many little things the film could have done with the plot and characters were ignored, when a truly fantastic film is lurking right beneath the surface, struggling to get out under much more daring hands. This and Benjamin Button were definitely the weakest of the Oscar contenders this year, both of which I consider pure Academy fodder, though not made without talent. Whereas Button had a weak first two hours and a great last hour, The Reader started off well and ended completely without resonance. In my opinion, Winslet gave a much better performance in Revolutioanry Road, which I also consider the best film of the year along with The Wrestler."
    },
    {
      "rating": "1",
      "text": "Kate Winslet deserved her Oscar, but definitely not for this movie. As noticed by Ron Rosenbaum in 'Slate', Hollywood seems to believe that if a film is about Holocaust, it must be acclaimed. And this particular flim is about a mass murderer who - the film suggests - we should feel sympathy for because she couldn't read; and because she didn't know that what she had done - namely, burning 300 women alive and selecting others to be gassed - was part of a bigger thing called 'Holocaust'. What should be noted here is that the story, although entangled with true historical events, is fictional. The illiterate female mass murdered was an invention of German writer Bernhard Schlink, author of the adapted novel. Rosenbaum, in his article, writes that the movie - apart from trying to evoke sympathy for a Nazi killer - acquits the 'ordinary Germans' of WWII era of acceptance of Holocaust, and the illiterate character is a symbol of Germans that supposedly had no idea about extermination of Jews - while in fact, they were perfectly aware of it. Personally, i think there are many other movies where this claim of 'unknowing Germans' (or Germans massively opposing Hitler) is made more blatantly. And although I realized how little and distorted is the historical knowledge of an average American, i really didn't think they will fall for this story: it seemed too absurd to me. I was wrong. The film affects almost anyone because of its use of the strongest weapon known to filmmakers: nudity. We see a beautiful woman having a passionate affair with a teenage boy - long before the woman turns out to be a Holocaust murderer. We can't judge what she has done (and what wasn't depicted onscreen, of course), remembering her naked body. Kate Winslet's body. Other big names on the film poster? Ralph Fiennes, Sydney Pollack, Frank Minghella (last movie he's produced), the director Stephen Daldry... All of them created a film that makes us sympathetic of a Nazi killer. It doesn't make us consider what she has done - the way the events are depicted makes sympathy the only proper reaction. What good can I say about this movie? Well, Kate Winslet (without an aging make-up) still looks great, and she has many occasions to show it up. A few truly amazing stills of her are the best things you can extract from this movie. What, a disrespect for a brilliant actress? Not as evident as this film has - for any kind of commonsense morality."
    },
    {
      "rating": "10",
      "text": "The Reader Professional reviewers had a hard time with this one. A majority were favorable, but like the minority, seemed unable to formulate what it was that they liked or disliked. I think this kind of review is a result of taboo on shame in our society. Like sex in Victorian society, doing it is one thing, but talking about it is another. Perhaps the film is mostly about the power of shame, both for the characters and for the audience. It repeatedly makes the point that the guilty are also innocent, and the innocent arealso guilty, because of shame and guilt. During the trial, Hanna is so ashamed of being illiterate that she accepts a life sentence. And Michael is so ashamed of his relationship with her that he doesn"
    },
    {
      "rating": "7",
      "text": "Bit late to review this particular movie, but was inspired to search the internet directly afterwards to see what others has drawn from it, to help me sort out my own concerns and was compelled to comment on the review in this forum by Thomas S. Your take on the deabilitating affliction of shame that shapes the course of human lives as it festers away under the calm construction of secrets and lies truly affected me........I guess the truth sets us all free."
    },
    {
      "rating": "10",
      "text": "I just loved everything. Perfect!"
    },
    {
      "rating": "10",
      "text": "It's a very good movie, and not dull at all."
    },
    {
      "rating": "10",
      "text": "Like the cinematic equivalent of a Henry James novel: difficult but worth the effort.  Kate Winslett turns in as subtle & convincing a performance as any I've seen: tender, harsh, sexy, angry, confused, and, finally, shattered by remorse.  Ralph Fiennes may finally have wiped out my memory of his horrendous turn in \"Ivanov\" a few years back.  Russian melancholy is too florid for him, but buttoned-up German melancholy is a great fit.  What I like best about the film, though, is that it's ethically all shades of grey--NOT pro-Nazi but posing questions such as how ordinary people come to commit atrocities, which strikes me as a much more important question than Hollywood's favorite, \"How much do we hate Nazis?\"  Not a film to be watched for diversion but for discussion and reflection.  Wish there were more such."
    },
    {
      "rating": "8",
      "text": "I totally get why some people don't care for this movie. I found it to be a fairly effective drama, one that raises more questions than it answers, especially (for me) questions about courage, and it's use, and the nature of betrayal. I suppose the parts of the film that interested me the most, and wish there had been time to explore further, were when they addressed the very broad brush that all Germans have been painted with since WWII, the anger that following generations have felt towards their parents and grandparents generations (as demonstrated by the law students), and the \"well what would you have done in this situation?\" question that lingers unasked in every wing of this film. I felt like it was well shot, well cast, and well acted. The script could maybe use some trimming, and some pumping up here and there. The relationship with the father and mother could have certainly benefited from 30 seconds of dialogue one way or another. What did they do during the war? How much did they lose? How did they feel about the people that had ruined their country, their lives, and their national reputation? There's a universe of possibilities in this film, and quickest path was sadly chosen. We can moralize and pass judgment all we want on the past, and yet we live, right now, in a world full of war crime, genocide, government excess, and police state fear. I doubt very much that man has learned anything about its self since the holocaust, other than to point fingers, and to tut tut \"evil foreigners\", which is precisely the mentality that lead human beings to attempt to cause the extinction of an entire other race of human beings. I don't think we are ever meant to feel sorry for anyone at any point in this movie, other than the victims of Nazi Germany, which, ironically, includes everyone in the movie to one extent or another! One is left with no doubt about how the Jewish victims felt certainly, or, more importantly still, how we should feel when confronted by the monstrosity that was the Nazi murder machine when we are given a solemn tour of a death camp (Auschwitz?). I think I was left with what the director intended by the end, a deep sense of ambivalence about humanity, the power of an individual, and our ability to tolerate the presence of real evil in our midst."
    },
    {
      "rating": "6",
      "text": "Watchable but not the movie it was hyped up to be. The whole movie was held together by the excellent performance by Winslett and I felt it would have worked better without the flash forward moments to the present which broke the flow of the movie."
    },
    {
      "rating": "4",
      "text": "This was an utter disappointment. It is not a terrible movie, but it is just not good. Mediocre as its best. The performances and the fame of the actors involved , helped to promote it.  Undoubtedly, the director and producers tried to create an original story but it was not. It was just cheesy and almost unethical. They want us to feel empathy for Kate Winslet's character, and they tried too hard. However, there was no good reason for us to feel sorry about her..She was just and outrageously selfish, calculating, despicable person. She took advantage of a boy, and used him; later, she became a Nazi, and as such, she coldly participated in crimes against the humanity and she doesn't show any regret about it; well at least not until many years later, when she is in jail (which is nothing to applaud). Is she then just a messed up person who deserves compassion and the incoditional love of the one she hurt and used? Not at all! The most unrealistic part of the film is when, in court, since she was embarrassed of not being literature, she prefers to go to jail rather than reveal the truth that could save/help her. I mean, honestly? A  mass murdered cares about what people thinks about her?. If just doesn't make sense! Finally, the ending was totally cheesy, cliche...!  I will never understand why as an adult, the boy still admired her and had feelings for her....!  They wanted to make a beautiful, touching movie...but the story is fake. This movie is not sensible;  the producers and director tried hard to manipulate the spectator's feelings.They are forgetting that unlike many other movies related to crime, punishment, and regret (e.g The Woodsman), what happened to the Jews was not just an abuse, was much, much more...millions died because of it! The victims...they were not just movie characters, they were real, they truly suffered. This movie is not even about understanding a 'good Nazi', but it focus in one of  the worse kind of people you can get (Winslet's character)..and people like her don't deserve a movie that aims to rescue their 'good nature'...what they deserve is our despise."
    },
    {
      "rating": "8",
      "text": "Kate Winslet's portrayal of Hanna in The Reader is her finest performance to date. It's rare that one actress has her two greatest roles in a single year. Oh, and the film with break every inch of your heart--it may appear tender at times, but this film is an emotional punch."
    },
    {
      "rating": "3",
      "text": "It is hard to like a film that is so depressing and dull at the same time with characters less interesting than blank wallpaper. The film doesn't give you anything to care about or notice besides the characters being naked half the time in the movie."
    },
    {
      "rating": "4",
      "text": "The Reader is a mixed bag. The first half is practically pornographic and, by the end of the film, feels entirely pointless. I am no prude, but the sex in the first half has no purpose other than to establish the relationship between this man and woman, which is plainly obvious to anyone watching. Even worse, it's pedophilia on the part of Kate Winslet's character and the way in which it is normalized is honestly sickening. The graphic nature of this first half is completely unnecessary and exists just to be titillating. The following thirty minutes attempt to extract sympathy for a woman who was a Nazi guard in Auschwitz just because of her \"secret\" and her earlier relationship with the main character. The final thirty minutes, however, are brilliant. In these sequences, Ralph Fiennes is absolutely a sight to behold and is brilliant. Kate Winslet is good here and received tons of accolades for her performance here. She is good, do not get me wrong, but Fiennes is the best part of the final quarter of this one which is the best part of the film. Poetic and beautiful, it is tragic the film was not this way. Instead, the first hour and a half are pointless, pandering, scandalous, and dreadfully boring. Overall, terrific acting here, but this one takes far too long to get to the point and instead is far too meandering and the end result is disappointment."
    },
    {
      "rating": "6",
      "text": "The Reader is an interesting little film. I love dramas and Stephen Daldry is one of my favorite directors (The Hours, Billy Elliot). The reason I say it's interesting is because it features some really great elements, but I don't think it's a \"great\" film. It's a gorgeous movie, Winslet is great (even though it's not her best performance imo), David Kross is surprisingly good, Daldry's direction is solid, and the supporting cast is quite nice, but overall the film suffers from some pacing problems and it felt a bit emotionally cold to me. I was reminded a lot of the English Patient, only The Reader isn't quite as epic or effective. Still worthy of a recommendation. Nominated for 5 Academy Awards including Best Picture, Best Director, and Best Actress."
    },
    {
      "rating": "0",
      "text": "I would only say: bad, bad movie. The protagonist isn't able to act, and the screenplay was atrocious and very bad. The main theme was trivial and repetitive. There are many other better movies about this theme and I think The Reader isn't absolutely brilliant or good one. Bye!"
    },
    {
      "rating": "3",
      "text": "Stephen Daldry's take on Bernhard Schlink's controversial novel is as cold a Holocaust movie as I've ever seen. The pseudo-intellectual mumbo-jumbo the film exudes, cleverly disguises its hollow and empty premise. It embraces irrelevance and glosses over relevance. Had it not been for standout performances from Winslet, Fiennes and Kross, there would've been absolutely no reason to praise the movie. The Reader doesn't just fail as a character study but it also fails in being a meaningful film."
    },
    {
      "rating": "7",
      "text": "Fascinating, philosophical, gloomy, and ambiguous drama. One can't help but admire conviction of Hanna Schmitz. Kate Winslet as Schmitz shines and sparkles in a role that's tailor made. The movie provokes the conscience of a cine-goer, and asks profound philosophical questions. The direction is deftly handled. The handling of penultimate scenes deserve kudos. Court room scenes are a stand out. Screenplay is wonderful.\rWhat one could object to is the extreme graphic nature of the movie. It could have been toned down. Nonetheless, it is a must watch !"
    },
    {
      "rating": "7",
      "text": "The Reader dealt with the Holocaust without actually dealing with it. It took an individual experience and skated around the issues with its own, seemingly less powerful one. It had the potential to be more than a story, but instead it took the lesser way out – avoiding the true pain with the shame of a former Nazi's literacy.\r The Holocaust was so huge, but the problem facing Hanna (Kate Winslet) is so trivial in comparison. She had the opportunity to free herself from prison, yet her embarrassment kept her in. This is a storyline that was supposed to evoke emotion, yet I found myself not caring at all. I should have been conflicted, but instead I didn't care about her fate – much like the older Michael (Ralph Phiennes) didn't seem to either. There was passion and intrigue in the state of the affair, but it fizzled as soon as the lovers were separated. At times I felt like we were missing out by not seeing these events play out; we just saw the aftermath.\r Illiteracy is a real problem – one that definitely should be addressed, but perhaps not in a way that erases the struggles of those hurt in the concentration camps? Hanna seemed to prey on the prisoners the same way she preyed on Michael. Rewarding them for reading to her – albeit in much different ways. She was a predator, and in the end I didn't have any emotion towards her. I should have felt disgust, perhaps even sympathy, but it fell flat. \"She never intended to leave,\" and I can't bring myself to care."
    },
    {
      "rating": "6",
      "text": "Nazi war crime drama. Young German lad has affair with illiterate Kate Winslet, and later discovers she was a guard in a concentration camp. Ralph Fiennes plays him later still. An interesting look at the interaction of relationships and response to the holocaust."
    },
    {
      "rating": "6",
      "text": "you don't have the power to upset me..The ReaderThe innocence and the selfless act behind it is the key and the makers were aware of it and narrows it down to it and brings out the best from the book gaining passion, attention and love from the viewers. Stephen Daldry despite of possessing such a beautiful script fails to project it on screen convincingly which makes the audience switch seats on picking a side, for the writing and adaptation is equally powerful on the other side. As these features require, the performance is not compromised on any level by Kate Winslet; she is brilliant, and also Ralph Fiennes from the supporting cast. The Reader has a powerful yet beautiful concept as we all are aware, but also the adaptation and the editing which provides enough space and range to the characters and the actors to flaunt themselves but what's indigestible is the execution and it doesn't pay well in the end."
    },
    {
      "rating": "8",
      "text": "I was impressed with this film. It is truly memorable. The story begins with young Michael, a German boy in his teens. He meets Hannah, a tram ticket collector somewhat older than himself, and is attracted to her. Later, they both start a very intense love affair, which marks the discovery of sexuality for Michael. The case lasted only one summer, but it impressively marked him: years later, already as a law student, he will find Hannah in a difficult situation, when she is accused of several heinous crimes related to Nazism.This film has an excellent script. The story of love and physical desire between the main characters may shock some people by their age difference, but I confess that I didn't feel uncomfortable with that. Hannah's permanently grumpy and rude attitude bothered me a lot more. The way in which the film approaches various situations that are morally debatable in a neutral way does not seem negative to me, it ends up allowing each viewer to think for himself about it. I also think that the psychology of Hannah has not been fully explored. There is so much about her that the film does not reveal, so much that we wanted to know... I feel that this is intentional, due to the way it involves the character in a tasty and charming mystery. Another thing that caught my attention was the nudity. The sex scenes are sometimes quite visual, although always short... it was not something that shocked me or that I really considered a problem, but some parents should consider it before leaving teenagers to see this movie.In addition to an attractive script, the film features good actors. Kate Winslet is the big star of the film and, really, is in excellent shape and gives us a superb interpretation. She deserved, in fact, the Oscar for Best Actress that she won with this work. The very young David Kross showed that it is a promise of European cinema with an intense performance of a shy, withdrawn and sometimes naive young man, and Ralph Fiennes did not disappoint us in the mature version of this character, offering us with an elegant and restrained work. The cast also has a good work by Bruno Ganz.Technically, it is a discreet film that does not bring anything new, despite doing what has to be done with professionalism. Cinematography is the standard, but it makes good use of the filming locations, also knowing how to play with shadows: in fact it is a cloudy film, and the Sun, like joy, rarely appears (as in the bicycle trip that the two central characters, at the height of their happiness, do it together). The sets are good and the costumes and props were chosen in order to recreate, with caution, the periods that the film is going through (from the 50s to the 90s). The soundtrack is good, but I confess that I didn't find it memorable."
    },
    {
      "rating": "7",
      "text": "Psychological morality play, romance and WWII aftermath. Hannah, a German woman who is unable to read is a Good Samaritan and helps Michael, an older teenage boy. They later enter into a romantic relationship. As he is completing his law studies his class attends a court case where Hannah is one of several defendants in a post-war prosecution of suspected Nazi “collaborators”. He knows she can’t read, a fact which could lesson her guilt and sentence but remains silent, in effect sealing her fate. This film focuses on moral grey areas, the ambiguity facing the protagonists and those immediately around them. Just as millions did nothing, standing by without defending the Jews, there are those who similarly will standby preferring to accept mis-truths about an accused person and watch with eyes closed-shut as others are condemned to suffer and die –JV. Drama, romance. Germany-US. AA: Actress (Kate Winslet). BAFTA: Best Leading Actress.  THE READER, dir. Stephen Daldry. Kate Winslet.."
    }
  ]
}