{
  "id": 4284,
  "title": "The Sting",
  "starring": [
    "Paul Newman",
    "Robert Redford"
  ],
  "runtime": 129,
  "genre": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "description": "A novice con man teams up with an acknowledged master to avenge the murder of a mutual friend by pulling off the ultimate big con and swindling a fortune from a big-time mobster.",
  "releaseYear": "1973",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fpxhmgeCuPQOeatfeCPwtOwUwlb.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 7.75,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Absolutely one of my all-time favorites.  The acting, the music, the dialogue:  \"Do you want a percentage or flat rate?  Who's the mark?   Doyle Lannigan... Flat Rate....\""
    },
    {
      "rating": "9",
      "text": "I really enjoyed this movie and consider it one of the classics. At first, before watching it (I watched it in 2017) I thought that it will be some outdated movie and I wondered why I haven't even heard about it. But after checking it out I thought it is one of the most interesting movies I have seen in a long time - a really great movie with great actors and interesting plot."
    },
    {
      "rating": "4",
      "text": "The Sting is the equivalent of Windows 95, foundational and necessary for subsequent follow ups but unless you have nostalgia for it, or just really wanna play the original solitaire, there's no reason to go back to it. The Sting is a heist movie, where several con men try to con the man who's never been conned. Con-versely I hope you haven’t seen Oceans 11 because if you have then congratulations you've seen The Sting. Oceans 11 achieves everything that The Sting sets out to do in a more concise, well edited manner. The only thing The Sting has on Oceans 11 is it's old retro style charm, title cards appear after each act like older films, which is an odd tradition thinking about it. To anyone who claims that modern attention spans are low, just know that moves used to have breaks in them. Other than the scheduled potty breaks, the movie also utilizes a traditional, minimal editing style throughout the movie. Simple wipes are used everywhere, horizontal wipes, vertical wipes even some unique shapes that should never be used outside myfirstproject.mov. Judging by my review score you can tell that I am personally not a fan of this older style of filmmaking. My favorite directors consist of Edgar Wright and Steven Kubrick, directors that heavily utilize distinct and direct cuts creating a great sense of flow and cohesion with every film they make, older editing styles just don't have that.  There's a good movie just below the surface of The Sting, it's just covered in a thick layer of dust caused by age. With some polish, modern editing software and brighter color palette The Sting could be a good movie. Just spit balling ideas, set it in Las Vegas,  expand the cast a little bit, focus more on the plan and less so the execution and you have an amazing film. Wonder if any film like that exists..."
    },
    {
      "rating": "10",
      "text": "The saying goes: a thief who steals a thief has 100 years of forgiveness. A '70s classic in its own right that cleverly mixes comedy with a crime story. What gives it more flavor with the performances of Robert Redford and Paul Newman, and the iconic musician Marvin Hamlich. It is not over seeing it now that it is 50 years old."
    },
    {
      "rating": "6",
      "text": "a viscous bite that spreads like fire in a forest..The Sting3 Out Of 5The Sting is a heist thriller about two con artists whose plan to take down the impossible might just be possible. The scrutiny in here isn't as convoluted or glorifying as the makers think but is undeniably impressive and breezy to encounter which comes with cons too, like the characters never seems to be in trouble and has a way out of every calculated conflicts; primary reason why audience feels disconnected with the viewers. It is short on technical aspects like sound department, cinematography and editing although has amazing costume design and background score in its favor. The writing is weak yet gripping with varied tactics of heists that helps keep the audience engaged in it. The screenplay by David S. Ward pitches an impactful heist tale that is unforgettable in its own way. George Roy Hill; the director, has done a marvelous job on executing the script which could have easily come off as a hoax. The performance is decently acted out by Paul Newman and Robert Redford in their parallel roles and Robert Shaw in a supporting role. The Sting has a viscous bite that spreads like fire in a forest for despite of being loosely written it certifiably makes it entertaining."
    },
    {
      "rating": "9",
      "text": "Funny, delightful, witty, thought-provoking, and aware of everything it's up to. The Sting is a stylish crime film that is for everyone. And, of course, Redford and Newman shine. It's just a bit convoluted in the first 20 minutes. Watch it ASAP, you follow? (9/10)"
    }
  ],
  "recommendations": [
    "the_grand_budapest_hotel",
    "the_french_dispatch",
    "chinatown",
    "motherless_brooklyn",
    "the_harder_they_fall",
    "the_great_gatsby",
    "reservoir_dogs",
    "murder_on_the_orient_express",
    "kingdom_of_heaven",
    "dune",
    "the_assassination_of_jesse_james_by_the_coward_robert_ford",
    "bone_tomahawk",
    "last_night_in_soho",
    "jackie_brown",
    "rear_window",
    "close_encounters_of_the_third_kind",
    "casino",
    "body_of_lies",
    "nocturnal_animals",
    "amadeus",
    "victor_frankenstein",
    "the_fifth_element",
    "hell_or_high_water",
    "the_last_of_the_mohicans",
    "true_grit"
  ]
}