{"id": 1122, "title": "The Ugly Truth", "starring": ["Katherine Heigl", "Gerard Butler"], "runtime": 96, "genre": ["Comedy", "Romance"], "description": "A romantically challenged morning show producer is reluctantly embroiled in a series of outrageous tests by her chauvinistic correspondent to prove his theories on relationships and help her find love. His clever ploys, however, lead to an unexpected result.", "releaseYear": "2009", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2rq96Ihbqb1eU3TEBVtgFlqbeX7.jpg", "categories": {"plot": 4.625, "acting": 5.222222222222222, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.592592592592593, "action": 5.0}, "reviews": [{"rating": "9", "text": "For me this movie was very funny and seemingly good romantic comedy."}, {"rating": "9", "text": "All of you people are crazy!! I laughed from beginning to end, as did my girlfriend, as did the entire theater. There was nothing misogynistic about this, it was damned truthful, and anyone that can't handle that has either deluded themselves, is an oversensitive woman, or a damned effeminate man."}, {"rating": "9", "text": "What a fun movie. Laughed like crazy as did most of the audience. Great chemistry between the actors and great writing. A bit crass at times but in this day and age that is how many people think, speak and feel. Just as the title say's \"The Honest Truth\"!"}, {"rating": "7", "text": "People, this is not such a bad movie!!!\rIt is funny, the characters are charming, and let's face it, it is true, that's the ugly truth :))))).\rOk, it is not a masterpiece either.\rIt is a good, nice, easy comedy"}, {"rating": "7", "text": "An unlikely pair have to work together.  He helps her \"catch\" her dream guy by telling her what to say and do, knowing what guys like, the ugly truth about relationships.  The friction between these two is what makes an interesting story."}, {"rating": "10", "text": "It was hilarious. And true."}, {"rating": "5", "text": "Your average romantic comedy. Butler and Heigl have fun with the roles but nothing else in this film tries to impress or entertain above the average level. Standard."}, {"rating": "8", "text": "A predicable but extremely enjoyable movie that uses its characters to its advantage to give the audience the best experience possible. The Ugly Truth is a hilarious romance/comedy with a Stella cast and plenty of collective laughs!"}, {"rating": "9", "text": "I really wish they still made movies like this. hilarious rom-com,  battle of the sexes, win-win feel good movie."}, {"rating": "0", "text": "Like OMG, I loved this move when it was called, 27 Dresses, Knocked Up, 50 First Dates, The Proposal, My Life in Ruins, The Ghosts of Girlfriend's Past, Duplicity, My Best Friend's Girl, What Happens in Vegas, No Reservations, Music and Lyrics, The Holiday, Failure to Launch, Must Love Dogs, The Wedding Date...Texas Chainsaw Massacre. I wish!"}, {"rating": "0", "text": "For the average person capable of grasping the concept of a meta-critic website - this movie is an insult! The amount of actual thinking (or lack thereof) invested in this piece of !@/&%! was shocking! HOW STUPID DO YOU THINK MOVIEGOERS ARE?"}, {"rating": "0", "text": "Absolute crap."}, {"rating": "0", "text": "The worst wide-release movie I have ever seen, by a long, long shot. Surely there is some law that the writers can be prosecuted under."}, {"rating": "0", "text": "Just watching scenes from this movie is genuinely painful. All the characters are insulting male stereotypes. It is not 'the ugly truth' that all men only care about watching women wrestle in jello. It's a cliche that gets overused by every sitcom and hacky romantic comedy for cheap laughs from women. But it's equally sexist as saying all women are bad drivers."}, {"rating": "3", "text": "Hard to believe this chauvinistic misogynistic rot was actually written by three females. Go figure. If the writers really believe that a jerk like"}, {"rating": "2", "text": "We get it, opposites attract. This movie is a waste of time."}, {"rating": "0", "text": "The only thought it leaves is:\"how could i have spent a tenner to watch such rubbish! vulgar, tasteless and with no proper story line. save your time, watch something else."}, {"rating": "2", "text": "I fell asleep at the cinema despite people roaring in laughter. I kept asking myself what was so funny. The movie was predictable from the beggining as I tried to enjoy it I failed and left Kathrine Heigl at a hotel room."}, {"rating": "4", "text": "Katherine Heigl and Gerard Butler are charming and funny at times. However, The Ugly Truth is immensely predictable and overly cliched, lacking both intelligence and chemistry between its leading actors."}, {"rating": "3", "text": "A weak romantic comedy that revels far too much in sex, sex references and pretty much anything else to do with sex. In fact, I can't think of a single joke that was unrelated to sex. I have no problem with sex jokes but when they are the only jokes on offer it makes the movie into a one trick pony. It pigeonholes itself into one form of comedy and this begins to grate very quickly. The chemistry between the leads is none existent as is a reason why they would like each other in any way beyond the physical. Their characters are unbelievable and the supporting cast is unmemorable. The Ugly Truth is so transfixed on pushing the boundaries of sex in comedies that it forgets that its primary job is to entertain."}, {"rating": "2", "text": "Perhaps the worst movie I've ever seen. Katherine Heigl puts on a dreadfully self-conscious performance but of course it's difficult to act with a script that tries so hard to out-do superior comedies in raunch and humor."}, {"rating": "0", "text": "If this movie was simply just a bag of awful jokes and formulaic rom-com cliches (yes, the movie actually takes itself seriously in the third act), this would just be a very awful romantic comedy. The movie attempts to be equally sexist in both regards, as if that somehow makes things better. But the problem is that the men and the women are portrayed as sexist in different ways. Men are given the treatment of shallow and sex-fueled without making light of the fact or satirically poking fun at it, while women are painted as the shrews that Heigl accused Knocked Up of representing. Oh, and here's cinch, the movie actually says that the men are right."}, {"rating": "1", "text": "Started so good but ended been the same **** romantic comedy is the reason why **** like twilight exist, because the good romantic movies are now forget because of this **** movie style"}, {"rating": "6", "text": "Gerard Butler is hilarious and Katherine Heigl is great and one of the more unique actresses in Hollywood. Together they have great chemistry in The Ugly Truth. The only real flaw in my opinion is how predictable the movie is though. Like most chick flicks, five minutes into the movie you know exactly how it's going to end. The crude humor is somewhat fresh in the genre though, as it's more of a guy comedy style, so it's still worth a watch."}, {"rating": "10", "text": "A 4? I can not believe .. How does such a good film can have a punctuation so low?"}, {"rating": "2", "text": "Must have seen this 100 times. Same old stuff, different actors. Boy meets girl, boy and girl fight, boy helps girl get other boy, girl and boy #1 realise they are in love....Why did I bother? Oh, yeah..for Gerard Butler...\rIf you liked The Proposal, than you are bound to LOVE this...."}, {"rating": "3", "text": "'The Ugly Truth' maybe has a \"hot\" cast but the ugly truth is that this movie relies on a lame script, boring dialogues and an amount of unfunny sentences that makes this flick unwatchable"}, {"rating": "4", "text": "It is weird to watch the female of the species feed upon themselves like cannibalistic savages from an era long departed. I can only assume that these writers (all women), knew exactly what they were doing and did so either for $$$ or because they actually believe that women have regressed to pre ice age mentality. Many of the lines are funny, and thus the 4 rating, but the concept is so chauvanistic and misogynistic that I am amazed so many women like the movie. Maybe the writers have seen a trend amongst yonger women back to the hormonal, look how beautiful I am, look how dumb I am and how my \"man\" can control me era of previous centuries. If, so, this movie will not help as the concept will rise light years above the heads of those individuals who will revel in the mundane, insipid and demeaning ideas of this movie."}, {"rating": "8", "text": "This is one of the funniest movies I have seen in a long time. I really liked it."}, {"rating": "1", "text": "I got suckered into seeing this as a friend had free passes. I would have paid not to see it. I can't even imagine this as a straight to video project. An absolute waste of time. Everyone associated with this should be embarrassed."}, {"rating": "6", "text": "Very good date movie. The personalities of both main characters was eerily similar to that and me of the girlfriend. She enjoyed it quite a bit, as did I. Butler's character was very amusing, and sure, the development's at the end were predictable but it was an entertaining and funny flick through and through. It's nothing compared to forgetting Sarah Marshall, but not much is... Definitely worth watching with your significant other."}, {"rating": "10", "text": "I loved this move... and seriously people that gave this movie a bad rating i don't know what u guys were doing because through out the whole movie i was laughing and it was really great and a movie that i will never forget... a 27 really?!?!?!?! what?!?!? Okay I get it so if a movie gets that low of a score it just means that people were too gutless to admit it was a good movie."}, {"rating": "1", "text": "This movie was annoying at best - it had one or two funny moments but those were lost to the over use of crass language - enough - I was disappointed."}, {"rating": "0", "text": "If you saw the trailers then you saw the only good parts- the rest was horrible!!"}, {"rating": "1", "text": "Genuine crap, not funny, not entertaining. A waste of money and time. Everyone involved in this movie should say an Act of Contrition."}, {"rating": "7", "text": "Pretty much same old formula but Katherine Heigl is so hot it makes it worth it."}, {"rating": "9", "text": "This movie was great fun! I and my 3 friends who went to it enjoyed it very much. I'm surprised that reviewers didnt' enjoy it."}, {"rating": "9", "text": "I thought this movie was very funny. You just need to have an open mind."}, {"rating": "4", "text": "Tiresome and formulaic. So bored of this stuff."}, {"rating": "8", "text": "Well more like 7.5. The movie obviously is not a summer box office blockbuster, but doesn't pretend to be. It's a fun little movie that, underlying all the humor, (and it is funny), lies some simple truths about how men and women relate to each other. Women are looking for the white knight of their dreams, and even the men that appear to be, aren't. So where do these women go from there? Reality and men are indeed very simple, but as long as either sex insists on the other thinking the way they do, there will always be lots of conflicts and hurt feelings."}, {"rating": "8", "text": "We enjoyed this movie. Saw it in a packed room, and there was LOTS of laughter throughout the movie. Very funny movie."}, {"rating": "2", "text": "No redeeming qualities."}, {"rating": "2", "text": "This is an updated Rock Hudson/Doris Day movie except this is 2009 not 1959. Gee, do you think you can guess the ending?"}, {"rating": "7", "text": "This movie was hilarious. It is your usual, by the numbers, rom com. Nothing new, but lots of laughs. I can't believe that people like The Proposal more. We laughed a lot and so did everyone else in the theater."}, {"rating": "8", "text": "This was a funny movie. I did not feel it was offensive."}, {"rating": "7", "text": "I really wasn't expecting much of this movie as I had seen the unflattering score it garnered on this page...but having low expectations almost always guarantees a pleasant surprise! I didn't find it misogynist, crass, rude, offensive or any other of the epithets bandied about...only genuinely funny at parts, which is more than I can say for critically acclaimed comedies like The Hangover, a film that barely got a smile out of me. Sure, it's formulaic and predictable, but then again, I don't decide to watch a rom com when I'm in the mood for something deep and innovative...I just expect some silly fun and a few laughs, and I got them with this film."}, {"rating": "0", "text": "I'm sick of romantic comedies that talk down to us women. Sick of it. Hated \"He's Just Not That Into You\", \"Confessions of a Shopaholic\", and now this (\"The Proposal\" is the only one I've seen lately that was SOMEWHAT decent). There's like some sort of feminist backlash recently in romantic comedies in terms of how women are portrayed as either humorless prudes, delusional romantics, or incompetent, frivolous ditzes. I'm going to stop going to them from now on, no matter how many of my friends are going, in favor of less patronizing takes on the genre like \"(500) days of Summer.\" Seriously, I'm done."}, {"rating": "9", "text": "I really liked it. Some of the jokes could have been a bit better, but it had enough genuine laughs for me and Heigl and Butler have real chemistry."}, {"rating": "7", "text": "Definitely not as bad as the critics say. Yeah, the plot was as predictable as can be, but some of the funny parts were actually genuine. I liked it and I'm a guy."}, {"rating": "10", "text": "Funniest romantic comedy i've seen all year!"}], "recommendations": ["knocked_up", "what_happens_in_vegas", "the_change_up", "the_40_year_old_virgin", "hall_pass", "bridesmaids", "superbad", "trainwreck", "rough_night", "the_hangover", "neighbors_2_sorority_rising", "grown_ups", "good_luck_chuck", "bad_moms", "white_chicks", "27_dresses", "the_watch", "miss_march", "jackass_presents_bad_grandpa", "this_is_the_end", "hot_tub_time_machine", "not_another_teen_movie", "jexi", "the_happytime_murders", "thunder_force"]}