{
  "id": 3308,
  "title": "The Howling",
  "starring": [
    "Dee Wallace",
    "Patrick Macnee"
  ],
  "runtime": 91,
  "genre": [
    "Horror"
  ],
  "description": "After a bizarre and near fatal encounter with a serial killer, a newswoman is sent to a rehabilitation center whose inhabitants may not be what they seem.",
  "releaseYear": "1981",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dEFMku7o825YhyUEHSlkvLDz1Dt.jpg",
  "categories": {
    "plot": 5.384615384615385,
    "acting": 5.142857142857143,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Amaomwofmfomvkhhoplpkcmmwergmjjsjxnfkfdkcmsmqsmxmcmfmsmfmkvmosmdkcmckmdkdmksmsksmskmm"
    },
    {
      "rating": "6",
      "text": "+Fantastic visual effects+Excellent story ideas-Weak screenplay-Terrible pacingI really got a strong xfiles like vibe from watching this (im of course aware how much older this was than that show!). It has a fascinating blend of a mystery serial killer investigation, a drama exploring the trauma of a journalist who gets too close to her case and a horror story that ties them all together. Sadly the pacing of this movie hasnt aged well and it just never stays slow enough in the horror scenes to be scary, and the cinematography and colour felt garish and basic which took away tension in the dramatic scenes between characters. The potential for this felt massive and watching this i just felt like it was the best it could be for its day and that the distraction of the visual effects behind the scenes got in the way of the storytelling. For anyone who enjoys a horror/mystery/thriller this is a must watch despite its flaws."
    },
    {
      "rating": "8",
      "text": "It's probably the best werewolf movie ever made and certainly my favorite of Joe Dante. It's entertaining and terryfing as hell. It's gourgeos, a must-see for everyone."
    },
    {
      "rating": "7",
      "text": "This is most definitely one of the better werewolf films that you can see but far from the best horror around. The first hour is a good and scary film but the last thirty minutes gets lost into a scrappy mess. It is such a shame as the first hour had me petrified on the edge of my seat. The problem is that the ending is like it is from a children’s film. It is almost a precursor to Joe Dante directing Gremlins which is almost a tongue-in-cheek horror. It also feels like it was finished in a rush with scrappy cuts and crosses throughout the last twenty minutes. It is good but be prepared for a disappointing and predictable ending but relish in the masterful fear and atmosphere before that. By the way the werewolf effects are impressive but occasionally overused except that we don’t see them fully in shot standing up ever."
    },
    {
      "rating": "5",
      "text": "Finding satisfying \"werewolf\" movies out in the wild (no pun intended) isn't perhaps as difficult as it is time sensitive, since most of us have essentially capitulated and are far less driven by our utterly fictitious fear of bogeyman or indeed the even rarer wolf-bogey-men.  All that being said, it seems from the period of the late 70's to mid 80's is about as good as it gets for most of the classics, but their were a handful in the 2000's as well, but arguably less impactful titles in the grand scheme of things.  Being older, the mere thought of such a creature presents load of ridiculous questions about how their anatomy would function, how they could biologically survive, and what environment could they possibly live in?  Obviously for the sake of films, book and other media, the same tropes were usually used for just about every story, so it requires LESS of suspension of disbelief.  The whole idea of werewolves secretly grouped together into some sort of pack is not only stupid, but basically goes against their very nature.  Every story typically frames werewolves as solitary hunters, or highly sexually aggressive beings that typically rend flesh or bite as well as get laid at the same time.  These are the most identifiable traits of fictional werewolves.  So why is \"the Howling,\" so dull even with all of these elements?  For one, it tells its story at the speed of molasses dribbling from a shallow wooden spoon.  Its not unnerving, or particularly tense, and it really doesn't leave our main character much intelligence to put all the pieces together (long after the audience already has).Many scenes in the film seem to follow a murder mystery, but then they forgot about that to focus on other aspects of character development, but even then it never really strikes the correct balance.  Their isn't much melodrama, yet characters seem to take a lifetime to figure out anything going on.  The main character has seen a werewolf and is subsequently traumatized, where after she finds herself being recommended by some sort of therapist to travel to a remote area to take a load off (with her husband along for the ride for some reason).  Its meant to be a retreat, but it establishes very big red flags almost immediately for any audience who had ever seen any horror film ever made by showcasing a few of the strange mannerisms and behaviors of the other people at the retreat.  The cabin retreat/ mental health rehab is also inexplicably in a dense, spooky, foggy, and eerie mountain forest for only one reason to begin with- to trap you into thinking you're not watching a horror film.  Which lasts for a good hour before a lot of the heavier practical makeup and special effects start painting the picture that maybe theirs more to these random assortment of individuals living in the eerie mountain forest then meets the eye.Its a fairly slow movie.  It takes ages for the supporting cast and the protagonist to actually figure things out even when their answers are literally staring them in the face or growling menacingly at them.  The ending is insipid and kind of terrible if I'm being quite honest and up until then I wouldn't blame anybody into thinking things might work out in a more positive manner.  It also ends when its already shown TOO MUCH, the last few minutes of the movie could have easily ended right before we see any evidence of werewolf transitioning, and in my opinion would've made for a much more decidedly ambiguous ending.  Its fairly disappointing to see some of the main characters go through so much and not really learn much from the whole experience.  At least in a Halloween film the surviving teenager would always lament their friends and inevitably come to the conclusion that all that pre-marital sex and underaged alcohol consumption might've contributed to their buddies untimely deaths.I think \"the howling\" is an interesting character study, but ends up coming across as sort of dated or diluted by popular horror movie culture.  Their have been much better movies in the genre of just Werewolves alone, so its difficult to stay mad at it.  Though it does sort of fail to garner much sympathy with some of the cheesy acting, it does have some excellent makeup and practical effects though they aren't used heavily.  This was likely due to budget.  Its a charming movie that ends on a rather mixed bag of feelings and feels somewhat pointless, but that's probably how the early 80's felt to a lot of people."
    }
  ]
}