{
  "id": 2554,
  "title": "The November Man",
  "starring": [
    "Pierce Brosnan",
    "Luke Bracey"
  ],
  "runtime": 108,
  "genre": [
    "Crime",
    "Action",
    "Thriller"
  ],
  "description": "An ex-CIA operative is brought back in on a very personal mission and finds himself pitted against his former pupil in a deadly game involving high level CIA officials and the Russian president-elect.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4ejNFbCgLMDAuy7jFQmc7cr6UAW.jpg",
  "categories": {
    "plot": 5.219512195121951,
    "acting": 5.95,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.4
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I'm a big Pierce Brosnan fan and after seeing the movie, it simply didn't have the energy and structure of an action or spy movie. It was filled in with too many pointless and inconsistent moments, both of the star characters, including Brosnan, felt like they were only putting in so little effort it was noticeable. There was a lot of talking, the story didn't make sense or engrossing at a lot of times, and some facepalm moments at what the characters were doing.\r The only reason I give it a 3 is because the last quarter of the movie was half-decent and delivered close to par and got my interest, but if the movie was revolved more around the pace of this last quarter it would've delivered a much better movie, probably soaring it to a 6 or 7 at least. But that's considering someone stays to watch it that long because a couple of people did walk out of the movie theater because of an obnoxious sex scene that confirmed their belief it was a terrible movie and a very brutal stab scene, with the latter even making me consider myself to walk out because it was a big 'WTF' moment.\r Overall, I wouldn't recommend it, even for a Pierce Brosnan fan even being one myself, the structure was very boring, unfulfilling, and messed up in places, and this is coming from someone who happens to like a lot of movies and rather forgiving on some of the less liked movies."
    },
    {
      "rating": "2",
      "text": "The film's sloppy, clichéd machination and half-baked characters will estrange even the most earnest spy thriller enthusiast. In fact, it is so difficult to stay interested in the plot and keep caring about the characters, that I found myself grappling from one stale action sequence to the next just to get through."
    },
    {
      "rating": "5",
      "text": "This movie is completely middle of the road. It is so generic that it looks like it could of been directed and acted in their sleep. From the look of the final product that might of been true. You get so many standard cliches that it is hard to keep up with all the monotony thrown at you. But, while playing it so safe it also does very little wrong. I mean yea the main characters make a couple of bonehead moves that make you want to reach out and slap the movie screen. You also get the standard plot holes found in this genre. Their explanation of why the guy is called November Man just make me scratch my head and wonder. What did that story have to do with the word November? Whatever... I guess you could do worse. At lease nobody made me watch another Step Up movie this year."
    },
    {
      "rating": "5",
      "text": "Lots of action, but not much work on the story line.  The budding romance story line doesn't much work.  Brosnan's character is pretty much one-dimensional."
    },
    {
      "rating": "5",
      "text": "Filled with incoherent exposition and a convoluted plot, Pierce Brosnan only partially rescues The November Man from stumbling in clichés brought by the familiar path it treads."
    },
    {
      "rating": "9",
      "text": "Very hot actress and Brosnan is good. They towed the jewish-supremacist hollywood line. Teasing a jewish character as the bad guy, then predictably making the a white christian evil incarnate"
    },
    {
      "rating": "1",
      "text": "Went to this movie expecting a James Bond type thriller with the class Pierce Brosnan is known for.  This movie was anything but.  Quite frankly, it was down right offensive.  It should have been rated X or NC-17.\r The movie reminded me of Arnold Schwarzenegger's Sabotage in that it came across as a desperate attempt by an aging star to change or \"enhance\" his image by appearing in a violent movie that had no redeeming value whatsoever.\r There's a rape scene of a minor presented in flashbacks, which made my skin crawl.  Besides gratuitous nudity, there is a sex scene in which they showed a little too much.  The violence is rather graphic.\r The story line was implausible and made little sense.  It made \"The Recruit\" with Al Pacino & Colin Farrell look like an Oscar winning screen play.\r There are better ways to spend your time and money."
    },
    {
      "rating": "5",
      "text": "Pierce Brosnan's character is a cross between 007 (sans the suave) and Jason Bourne (twice the age). He's an ex-CIA agent out to protect a woman (Olga Kurylenko) who could expose an international conspiracy, while matching wits and blows with his protégé (Luke Bracey). Nothing new here: chases and pursuits, an uncountable body count, some hi-tech paranoia and inevitable plot twists. That being said, it's adequately put together, usually well-paced (although a tad too long) and moderately entertaining. A passable September placeholder till the good releases return in October."
    },
    {
      "rating": "9",
      "text": "This review is for people who want to go and see the November Man with Pierce Brosnan, and are somewhat put off by the reviews. I'd arranged to go to see this film and set about reading reviews on the internet. After reading a lot of reviews I almost cancelled our night out because they were generally artsy or negative. I have a pet peeve with professional film critics who seem to have forgotten why we, the paying public go to see a movie. Some of my favourite movies were absolutely slammed by these so called experts, Jack Reacher for example, anyway I'm really glad I went to see the November Man, because I thoroughly enjoyed it and would recommend it to anyone. Go to see it and make your own mind up!"
    },
    {
      "rating": "9",
      "text": "We enjoyed the movie very much. It kept us on the edge of our seats pretty much the whole movie trying to figure out what they were figuring out. Luke Bracey might be the next Bruce Willis type of star with looks like Brad Pitt (who is not an action star) and we always enjoy Pierce Bronson. I think I'll be reading the series of books this movie came from. Olga did another wonderful job with her beauty and acting from the shy range and then trying to be like the guys. It won't win any academy awards, but it is entertaining!"
    },
    {
      "rating": "5",
      "text": "Overall an underwhelming movie. It's not that there are a lot of negatives but it's more along the lines that nothing in the movie really stands out as \"amazing\". The characters are all forgettable and you don't ever really get close to any of them. The plot isn't bad but you don't get to understand why the bad guys are so bad until too late in the movie and by then you're just waiting for the end. Recommend rent."
    },
    {
      "rating": "6",
      "text": "If you like spy movies, this is a spy movie. Because all the spy movie cliches are there. Basically its like a James Bond film. Except without the gadgets. Or most of the charisma. And not so many exotic locations. And simpler action sequences. OK its nothing like a James Bond film. Its more like a Bourne film, if the main character lost most of their skills and aged 20 years.\rIt is well executed, that is to say I'm sure this film is the best it could be with the plot they had. Its well put together but in the end its an amusing but forgettable flick."
    },
    {
      "rating": "8",
      "text": "A realistic spy thriller with no obvious tag line or one-sentence summary. The writing was intelligent, the acting was solid, and the direction and editing were tight.  Stunts and violence were given a stark presentation, without a gratuitous focus.  After a brief setup that establishes the characters\rand story, it maintains a steady pace with continuous tension right up to the end.  The surprises and reverses were plausible rather than shocking, and there wasn't much outside of the primary spy thriller plot (no subplots with humor, romance, etc.), so the appeal of the movie is probably restricted to those who are fans of the specific genre."
    },
    {
      "rating": "8",
      "text": "I liked the movie.  It kept my interest although it took awhile to figure out who was good and who was bad, but that is the some of the fun.  I can't believe the low reviews by the critics.  Wait a minute, yes I can.  The movies the critics rate low I usually love and the movies they rate high, I watch and wonder, how could they rate that movie so high?  I prefer the user reviews as a better guide of if a movie is good or not.   It was a fun movie and the way Pierce Brosnan kept \"teaching\" his student was great plus all the other stuff going on that gets clearer as the movie progresses."
    },
    {
      "rating": "4",
      "text": "Though it has some interesting unconventional and quiet intriguing plot lines,The November Man is a convoluted mess with too many plot lines, too many characters,way to much dialogue and a bunch of dull boring action scenes that are not riveting in any way."
    },
    {
      "rating": "6",
      "text": "I enjoyed the movie, and Pierce Brosnan already old\rThe mood is very very good, Brosnan and Kurylenko excellent actor/actress.\rLot of scene silly, but good and funny."
    },
    {
      "rating": "5",
      "text": "It's kind of like it takes Brosnan and tries too had to be a grittier Bond movie with more mature elements. It doesn't really work. The action is satisfying as a result though. It's extra violent and can get very bloody. However the jumbled plot fails to give us a reason to care about the conflict or it's characters.\r It starts off vague and unclear. It's not unlike movies to leave us a in the dark for a little bit, but it takes a while for the film to even establish simple motives. It had me asking myself why any of this was going on. The moments feel like they are there to push forward a plot that hasn't been created yet. The movie opens with no story and keeps it that way for quite a while. Things take shape eventually, but it doesn't change the fact that none of it is interesting.\r Why should we care about Devereax's (Brosnan) former protege? His inclusion feels hollow and unnecessary. What's our lead's deal? Brosnan plays a character who has the potential to be deep. He's clearly been changed by the things he has done in his life and is a little unhinged, but he's never fleshed out. The movie leaves us with bland characters that just serve as a vehicle to deliver brutal action scenes.\r Oh, how glorious those scenes are. They pack a punch other spy movies don't. I have to admit, while his character is dull Brosnan plays the cold, calculating, and aged ex-cia operative well. Scenes where Devereaux is showing just how ruthless he can be are just as satisfying as the action scenes. It's nice to see an agent who isn't afraid to rough up the competition on his way to get answers.\r However it fails because you are never really invested in it's world thanks to the sub-par plot and characters. The latter of which just aren't fleshed out enough to be anything more than generic character types. It also tries too hard to cram in as much from other movies like it. These inclusions feel pointless. What was the point of having the Russian hit woman? She's barely used. What was the point of the gratuitous sex scene? What's really the point of any of this?\r It's generic one minute and pointless the next. Some good action isn't enough to make this mediocre flick worth a watch. Those who would want to see the former Bond star play a darker version of something similar are going to be left wanting the most.\r I give \"The November Man\" a 5.3/10."
    },
    {
      "rating": "4",
      "text": "A veteran actor in the lead with a newcomer as his ‘student? CHECK! Car chases? CHECK! Car crashes? CHECK! Cars blown up? Check! An enemy who is the hero’s friend? CHECK! Doubles crosses? CHECK! People having secrets? CHECK! A pretty woman or three? CHECK! Bodies pile up as movie goes on? CHECK! A lot of computer work? CHECK! A lot of cell phones used? CHECK! And then disposed of? CHECK! A female villain in a non-James Bond film dressed in black leather and made up severely? CHECK! CIA? CHECK! Russian bad guys? CHECK! A ‘hot’ sex scene between two young leads? CHECK!\r Hey folks does this tell you that “The November Man” is a spy thriller? It is and for that reason alone leave your logic checked at the door and don’t ask any questions. Sit back in your chair and watch Pierce Brosnan, playing a less suave James Bond, shoot 10 guys, with guns, in a row without getting a scratch, though he does have a few scratches later on. His trainee, Luke Bracey, does the shower scene that Brosnon would have done 30 years ago while Olga Kurylenko is the 21st century idea of a femme fatale. Along the way are Mediha Musliovic, Bill Smitrovich, Will Patton, Lazar Ristovski and others playing both sides of the fences. Oh yes, something added to spy thrillers now, there is a big fight and chase between two females.\r “The November Man” is nothing you haven’t seen before unless you haven’t watched a movie in 50 years. It is a mindless, foolish, fast paced, enjoyable, yes enjoyable, movie to see over the weekend as you wait for the possible Oscar contenders start showing next month."
    },
    {
      "rating": "8",
      "text": "I'm glad I decided to watch this movie despite the professional critic's reviews.  How can you go wrong with Pierce Brosnan?  In addition to him I thought the acting was top notch.  I found the movie suspenseful and taut.  Is it breaking new ground?  No.  It is a by-the-book espionage thriller.  It would have been nice if Mason's (Devereaux's protege) decision to join sides with Devereaux in the end had been fleshed out more. But there didn't seem to be much room for that."
    },
    {
      "rating": "6",
      "text": "Typical retired spy movie with some typical spy/secret agent drama. Pierce Brosnan does a decent enough job at performing as an older shadow of his previous role as agent 007. The intrigue is not as predictable as I initially thought because there IS a little twist to it. Otherwise, it's run-of-the-mill spy stuff except without a lot of fancy high-tech gadgets. Not bad, but not great either."
    },
    {
      "rating": "6",
      "text": "Spy movies and espionage have come a long way, with more advanced tech to support the film. But every now and then a low-tech, traditional thriller enters the genre and feels heavily out of place but refreshing at the same time; this movie is The November Man. It features things like car chases and piano playing and negotiations held at fancy restaurants on a Mediterranean inlet; all the things the genre used to have, but have since been updated. While the movie itself feels a little too familiar in its plot and elements, it is nice to watch one of these kinds of films every once in a while as a guilty pleasure."
    },
    {
      "rating": "3",
      "text": "When Pierce Brosnan was playing 007, he said in interviews he wanted to do an edgy darker version, even R rated to get back to the spy thriller's origins.  Maybe Daniel Craig's is that more or less, and supposedly this movie is Pierce's attempt years later.  Unfortunately for him, it's a disaster.\rPhony, cheap, disjointed, incoherent, mind numbingly boring and poor style all come together here.\rNote to the director:  the hand held quick zooms and over-used over-the-top blood spatter helped ruin the poorly scripted film.  Note to writers:  your interview in the making-of doc have you saying \"we don't know what November Man means\" despite the fact it is precisely spelled out as to what it means in your own dialogue in the film!  How stupid can you get?"
    },
    {
      "rating": "4",
      "text": "It was nothing we haven't seen before. A spy movie with two past James Bond acotrs - Pierce Brosnan and Olga Kurylenko (Quantum of Solace in her case). A sort of twist, and yeah that's all there really is to this cheese."
    },
    {
      "rating": "2",
      "text": "Really HORRIBLE and BORING to death movie. Nothing special to watch than Pierce Brosnan firing some guns and run from place to another place. The plot is REALLY boring. By the time the movie starts you are very confused what is happening and you try to understand what is going on through out the whole film. There were many pointless scenes. Also, BAD directing...and casting (except Brosnan). I really dont know what Brosnan was thinking when filming the movie...!!! I felt like I lost 2 hours from my life watching this lame movie."
    },
    {
      "rating": "8",
      "text": "The November Man: Well, I have to give it to this movie…it did impress me. I came in to this movie with deep skepticism because these covert-ops, CIA, cloak and dagger movies usually do disappoint many audiences. I find that a lot of these movies blend together and give just a stereotypical perspective of this genre. The intricacies of a spy movie plot often become bogged down by the twists and turns, making it difficult to understand the significance of whatever is happening. Also the many different locals of a spy movie make it confusing. So I was relieved that The November Man actually paid off in both story, character, and action. This movie stills makes you pay careful attention, but it is very accessible and user-friendly. The plot revolves around two CIA agents in a mentor-student relationship. Pierce Brosnan plays a seasoned spy, Devereaux, and some other guy plays his pupil, Mason. They quickly split after a botched mission drives them a part right from the start of the movie. This scene alone sets the stage for a very thrilling back and forth between them as their paths later cross and their interests are at odds with each other. The rest of the story involves a would-be Russian president and other very interesting characters. I won’t say much more because it is easy to give too much away. Suffice to say the lead characters are rich in development as are the others. You will see many interesting exchanges along with an interesting story. This movie deserves a little praise for that and also for being a better and smarter movie than most films released now-a-days. And it might even be interesting to watch it one more time. 8/10"
    },
    {
      "rating": "4",
      "text": "Ce vieux Brosnan ne fait plus le double zéro mais continue de faire l'agent secret (pour la CIA ici) à ses heures perdues. Que voulez-vous, un vieux, il faut bien que ça mange ! A dire vrai, il se bonifie avec le temps comme un vin qui repose tranquillement et qu'on retourne de temps en temps.Le voilà dans un complot à la Bourne mais sans cette burne de Jason Burne (et c'est tant mieux), accompagné à l'insu de son plein gré par la toujours adorable Olga Kurylenko qu'on ne se lasse jamais de regarder, y compris dans les pires nanars qu'elle enchaîne à une cadence de stakhanoviste. Notez qu'elle est ukrainienne d'origine et non pas russe mais c'est pour la comparaison poétique.Justement, les Russes sont mêlés à ce complot assez habilement raconté mais dont l'invraisemblance atteint des sommets rarement... atteints. J'ai rarement vu une histoire aussi abracadabrante, à faire mourir de honte feu Tom Clancy qui doit avoir regretté... de ne pas avoir boulotté une connerie pareille.Du coup, malgré l'action qui revient à intervalles réguliers, une action très correctement filmée d'ailleurs, on finit par s'ennuyer, malgré Pierce et malgré Olga. Malgré également toutes les jolies pépées qu'on croise dans ce Belgrade dépaysant, qu'elles soient à la CIA ou pas. Mais ça donne envie d'aller en Serbie : il paraît que DSK y est allé, je comprends pourquoi maintenant.Le film se laisse aussi aller à quelques longueurs qui tiennent aux rebondissements du vilain complot qui ne veut décidément pas finir, ce qui finit par soûler plus vite que la vodka locale.Voilà donc un navet pas trop déplaisant mais pas forcément convaincant, c'est le moins qu'on puisse en dire."
    },
    {
      "rating": "2",
      "text": "What I noticed most about 'The November Man', was the extras. There are a lot of gunfights in the movie, most of which occur in places surrounded by people. Rather than spy movie type gunfights, they're more similar to what a \"Delta Force\" or \"SEAL\" team would do. For the most part, with the exception of the opening scene, people walk within a few feet of the agents holding and shooting all kinds of guns, like nothing was happening. It's an example of lack of attention to detail that pervades the movie. Of course, an increase in number and ferocity of action sequences has become more common in \"spy thriller\" type movies as of late, to the extent that the spying and thrilling has greatly diminished.It certainly shapes the storyline in 'The November...\"; it's pretty standard stuff, with a slight twist near the end.Overall, the movie progresses briskly, and it's entertaining up to a point, just, once finished, it seemed like there was something missing."
    },
    {
      "rating": "2",
      "text": "Found this one to be boring and cliched. Brosnan again is let down by a bad script and weak direction. This movie is trying to be a cross between a Bourne movie and a Daniel Craig Bond movie with the angle of an agent coming out of retirement. However, it doesn’t have anything that makes the Bourne and Craig Bond movies work and is just a generic action movie with a convoluted and messy storyline."
    },
    {
      "rating": "5",
      "text": "The November Man wastes a good performance by Brosnan while leaving his supporting players mostly stranded by a storyline that is neither fleshed out nor original. A shame, because the movie surely had the potential for much more."
    }
  ]
}