{
  "id": 2101,
  "title": "The Mummy: Tomb of the Dragon Emperor",
  "starring": [
    "Brendan Fraser",
    "Jet Li"
  ],
  "runtime": 112,
  "genre": [
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "description": "Archaeologist Rick O'Connell travels to China, pitting him against an emperor from the 2,000-year-old Han dynasty who's returned from the dead to pursue a quest for world domination. This time, O'Connell enlists the help of his wife and son to quash the so-called 'Dragon Emperor' and his abuse of supernatural power.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A3acM1lX5PNWQa6r5qeMAJOxbnT.jpg",
  "categories": {
    "plot": 3.193548387096774,
    "acting": 3.074074074074074,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 5.454545454545454,
    "funny": 4.666666666666667,
    "action": 6.125
  },
  "reviews": [
    {
      "rating": "2",
      "text": "It had some redeeming qualities...but the ending was terrible. \"soon after, mummies were found in Peru.\" if you saw the movie you know what I'm talking about. IMO this ruined the franchise."
    },
    {
      "rating": "5",
      "text": "My least favorite of the three. A lot of spectacle, but the story and characters fall flat. It's the kind of movie that reminds you that no amount of spectacle can replace having a solid story with characters you actually care about. Is it too much to ask for both, Hollywood?"
    },
    {
      "rating": "10",
      "text": "It may not be scary, it may have to many effects, it may not make any sense why their calling this chinese emperor a mummy. All there is to say is that this movie is repetitive but sooooo entertaining. It's the most satisfying Mummy movie yet. It looks much cooler, its big, exciting, and full of great action. It's not clunky, it's excellent."
    },
    {
      "rating": "4",
      "text": "This latest entry in the series kind of became a parody of itself, which is too bad because I really love the first two."
    },
    {
      "rating": "0",
      "text": "I couldn't believe they went ahead with the same character but with no Rachel Wiesz. Honestly getting someone to try to act like Rachel was a disgusting choice.Would have been better off just killing the character off and start over. That was the most disappointing move ever, and thats saying something considering I expected it to be utter crap. It was worse than that!!!"
    },
    {
      "rating": "4",
      "text": "The only thing good about the film are the special effects. However, without anything to support the FX, the movie blows. The humor (especially Jonathan's) is so forced at times. Oh, and the emperor - he was invincible when he was awaken; then he drank from the well of invincible water, and then he finally became invincible once more. A few seconds later, the good guys kill him. Darn. Oh, and the actress looked nice in her dresses."
    },
    {
      "rating": "4",
      "text": "This movie is a huge let down, even if your a fan of the series like I am you still wont like this, even the second one was better than this, don't watch this movie."
    },
    {
      "rating": "3",
      "text": "This movie would be great, it would be an awesome continuation of the Mummy series, except that it is in no way related to the previous two Mummies. It moves the setting to China, that's a little disappointing but not unforgivable; it ages one character almost a decade while leaving the others unchanged, but with all the ancient mysticism that they have been involved in maybe they don't age anymore; it changed one of the main characters, now what the h***! No back story, no notice, no dramatic character death, no attempt to patch the story at all, it's like the filmmakers just gave up on the story and characters. I mean, this wasn't some secondary character, this wasn't the first sequel, it was the third movie in the series and they swapped a main character, talk about breaking the third wall, they might as well have the characters smile and wave at the camera. This movie could have been great, it could have been fun, but it could never be the \"The Mummy\"."
    },
    {
      "rating": "2",
      "text": "Congrats! \"The Mummy: Tomb of the Dragon Emperor\" is the razzie-winning movie of the year! It's one of the few films that can be so terrible despite the abundant development years it was given. Hurray!"
    },
    {
      "rating": "1",
      "text": "It's pretty much the same old fare with a few Asian people thrown in for good measure (and abominable snowmen?) Honestly, two years later can anyone honestly say they remember this movie?"
    },
    {
      "rating": "2",
      "text": "The third Mummy movie is easily the worst in a franchise, turning bad a series that was just average so far. Special effects and large action set pieces take precedence over character development and plot. This may seem standard of any blockbuster but it is particularly glaring here. The characters are hastily drawn sketches, the romance feels forced and the drama is dead from the outset. The action that is supposed to thrill instead feel hollow and lifeless as we don't care what happens to anybody and we don't feel the significance of what is taking place. The plot is flimsy, made worse by ridiculous twists and coincidences where belief isn't so much suspended as it is thrown off a bridge. If visual effects are all that you want, you may get brief enjoyment out of it. If you want something of substance, something with heart, then you should look elsewhere."
    },
    {
      "rating": "0",
      "text": "I didn't expect much from this, the third installment in The Mummy series. The second movie in the series I found similarly uninspired, but this far surpassed all of my expectations. Truly, a horrible horrible movie. When your high point in a movie is an unexplained run-in with asian yetis, and a truly uninspired scene of yeti football, you're doing something wrong. Worse is the budget, you'd think they could spend a little on writers this time around. I wouldn't wish this movie on anyone, truly a torture device of mediocrity and insipid idiocy."
    },
    {
      "rating": "10",
      "text": "Amazing Special effects and the really big stuff happening makes this a great and highly solid and entertaining movie."
    },
    {
      "rating": "6",
      "text": "Not a true Mummy movie, but as a general action-adventure flick I don't really have any complaints. Just go in with some popcorn; normal expectations; don't try and over analyze the movie; and you should be fine."
    },
    {
      "rating": "10",
      "text": "It's a shame the critics gave such negative reviews. It's an awesome thrill ride, a very good action movie."
    },
    {
      "rating": "10",
      "text": "This is the best mummy I've seen in my life. All those criticize the movie are sucks."
    },
    {
      "rating": "0",
      "text": "The first 2 were great. This was absolute trash. It just felt like some B-movie piece of crap that just leaves you feeling like you've wasted hours on a movie that was so terrible you never want to see a sequel to it. The acting was crap, the setting was crap, the action was crap. Just crap.crap.crap Don't bother watching this"
    },
    {
      "rating": "3",
      "text": "Yhea it´s bad. It has some cool moments and watching fraser is always a joy but the movie just doesn´t have the original feeling. How people like this one more than the second is beyond me."
    },
    {
      "rating": "0",
      "text": "Such a poor film it will leave you pondering which was better... battlefield earth or this piece of garbage?"
    },
    {
      "rating": "1",
      "text": "I fell asleep watching this movie. No kidding - it's that boring. If there was an original or interesting line, event or character in there, it escaped me. I want those 2 hours of my life back!"
    },
    {
      "rating": "8",
      "text": "Just got back from Mummy 3 and it was quite enjoyable. But it's definetly NOT Mummy 3, it's Tomb of the Dragon Emperor. This latest installment is very different from the previous 2 movies. Although awesome I found it very hard to get used to the China setting rather than Egypt. I think that's partially because of how many times I've seen 1 & 2 on DVD or on TV. Other than that it has its cheesy moments just like the first 2, perhaps a little more. The CG is great and it has some unique FX. As far as Bello replacing Weisz (sp?), I actually noticed it more than I thought I would. But it didn't really come across as replacing.......she was almost like a different character. Not saying Maria Bello's performance wasn't good, but besides the english accent she seemed different. It almost would have been better to have some backstory of Evelyn and Rick divorcing with Bello being the new wife. Once again this opinion stems from the shear amount of times Mummy 1 and 2 have been viewed. Other than that it was an entertaining popcorn flick."
    },
    {
      "rating": "5",
      "text": "The story was good. The actors never jelled and the frantic action appeared pedestrian. Jet Li was subdued. Should have been a much better movie."
    },
    {
      "rating": "5",
      "text": "This is about the most \"meh\" of a movie ive seen ALL SUMMER. The first Mummy film became an instant classic in my book.....its simply simply a classic \"popcorn movie\" with a certain charm that dosen't tarnish over the years (ive seen the movie at least 100 times). The second Mummy film choked on its own extravagance trying to top the first film by adding 100s more effects shots that held the film back more than it helped.....in other words, the second Mummy movie pales in comparison to the first. This 3rd offerring......i just couldnt think of this as a film in the \"The Mummy\" franchise, it just didn't feel right. The action sequences are interesting.....but they are shot so quickly and edited so poorly its simply no fun to watch. The Yetis were.....neat.....and the whole field goal thing didn't bother nearly as much as the WHOLE FILM being a clutterred mess. Rick and Eveys characters seemed to be in the right place (Maria Bello did a.....decent job) but Ricks son Alex came off as annoying and his Chinese girlfriend didn't do so well either. Jonathon (John Hannah) gets NOTHING to do in this movie but sit their and look stupid.....and freak out when say.....an avalanche happens, and thats a shame.....i really enjoyed his character in the previous films, then again his character was written SO MUCH better in those films, here he is completely wasted. Its not a TOTAL loss.....but so close to it you may not even care, see with caution......either youll \"kinda like it\" or \"hate it\" completely."
    },
    {
      "rating": "7",
      "text": "The most under-rated film of the summer, no classic this but delivers on every promise it makes. Most of the criticism seems to be that it isn't really a \"Mummy\" film in the scarabs-and-sand sense, and that's true (of course if it was the critics would carp that the franchise was stale), but as a stylized adventure flick M3 is easily the match of the overhyped and overpraised Indiana Jones 4 with the benefit of being 30 minutes shorter and less self-serious (though, in fairness IJ4 *does* have a mummy in it, sorry Ms. Allen)."
    },
    {
      "rating": "2",
      "text": "I really loved the first two movies and I was very excited when I heared the news they were working on a new part, but this... Why does the third episode always go Asian? (Pirates of the carribean 3) Pfff, it lacks all the good things the other episodes had. High budget and brilliant effects, but a story that was better off written by some toddlers... Very dissapointing."
    },
    {
      "rating": "7",
      "text": "At first I was expecting the worst, especially after witnessing the travesty that was Indy 4, and the first twenty minutes bore the worst of my fears. But then, the film became entertaining, and good. This film is gleefully stupid and preposterous, and yet ridiculously fun to watch. I enjoyed this over-the-top film and it provided plenty of popcorn thrills and excitement even if the acting was B-movie at best and the script felt as if they made it up as they went along. Still, I had fun watching this film. It was the least of the trilogy, but it was still fun and at least I wasn't left pissed off like I was when I saw Indy 4. However, if you want the closest thing to a modern Indiana Jones, watch the Tomb Raider flicks they're pretty awesome."
    },
    {
      "rating": "5",
      "text": "Granted it is not a great movie, but it is well produced with good special effects. It does entertain but it also tends to drag a bit too much and seemed longer than its hour and 52 minute length."
    },
    {
      "rating": "10",
      "text": "A really cool movie. Some people have decided to work up a hatred for this film, but they haven't seen it-I have. And it's a LOT of fun. The fight scene between Fraser and Li is like a snake fighting a mongoose. And the visual effects make the effects in the first two look like an old Bruce Campbel movie."
    },
    {
      "rating": "10",
      "text": "Looked pretty good to me. It would have been way too tired as another movie set in Egypt. And mummies are all over the world, people. Go to a library."
    },
    {
      "rating": "0",
      "text": "it sucked. Why, because the flaws of CGI, casting of Maria Bello, and bad storyline. This will kill off the whole mummy franchise."
    },
    {
      "rating": "8",
      "text": "Dumb fun, but still fun."
    },
    {
      "rating": "2",
      "text": "This is honestly one of the worst movies I've seen in a really long time. Typically, I would enjoy a movie like this; even if the premise is silly, I'll like it if it's told and acted well. Unfortunately, this had a terrible story, terrible character development, terrible pacing, and terrible acting. This movie had everything working against it. It's almost as if they had a whole epic film written about China and the Emperor and then decided to throw the The Mummy characters in it for the hell of it. I suppose if your a huge Mummy fan or big Brendan Frasier fan, you'll at least be pleased seeing him and the franchise on the big screen again. But to everyone else, I'd say avoid at all cost. Don't even bother renting it."
    },
    {
      "rating": "9",
      "text": "Really fun, similar in a lot of things to the first episodes. A great moment."
    },
    {
      "rating": "6",
      "text": "If the beginning of this movie wasn't so over done and trying to look so good it would have made the movie a TON better. For the fighting scenes in the movie they were well done and so were the very popular camera angles. The story line was interesting it could have had so much life and excitement to it. But I'm afraid that the beginning puts you in a state of mind that they are trying to over due it."
    },
    {
      "rating": "5",
      "text": "This falls neatly under the category of 'big loud dumb fun.' While it is completely unmemorable, the film, in spite of itself, has a mild charm about it and some amusing dialogue and action to offset the general mediocrity of the proceedings. I must say, however, that Jet Li's villian has to be one of the most impotent of bad dudes in a big commercial film in as long as I can remember. OK entertainment and a decent distraction."
    },
    {
      "rating": "3",
      "text": "I really enjoyed the first two Mummy movies, but this one was terrible. If you came in halfway through the movie, you would be wondering if this was IJ4 or Mummy 3. Overall, save your money and Netfilx it."
    },
    {
      "rating": "3",
      "text": "The first two mummy films not being entirely great, but good enought to sit through the movie and walk out pleased with it. I was however dissapointed with this film. The story was as if the director told his 8 year old son to put a story together and hand it in. Brendan Fraiser wasnt as good, the chick who replaced Rachel Weisz as Evy was a terrible attribute to the film and the guy who played Alex was also terrible. Jet Li is the only character that played a decent part in the movie. RIP MUMMY SAGA."
    },
    {
      "rating": "5",
      "text": "Replacing Rachael Weisz with Maria Bello really compromises the chemistry of this franchise. Half of the fun of the first two movies was watching the interplay of Brendan Fraser's character with Ms Weisz; Ms Bello and him have about as much chemistry as two dead fish. Once the movie gets going, about a third in, it starts to become enjoyable, as long as Ms. Bello isn't a primary focus. Fun, but could have been so much better."
    },
    {
      "rating": "1",
      "text": "Horrible script Horrible acting, very scary to think that a movie like this exist."
    },
    {
      "rating": "3",
      "text": "They tried to recreate the same humorous courtship that happened with Rick & Evy from the first two movies, by using the Son and failed miserably. The characters all seemed out of place. Jet Li was the only worthwhile performance. The Yeti's were like Jar Jar Binks or the Ewoks...completely unnecessary. It was painful to watch the characters trod through a bad script."
    },
    {
      "rating": "0",
      "text": "WARNING: Do not watch this movie!! watch the Dark night or something good maybe pineapple express this movie is terrible how does Brendan Frasier get work, being the B class.....wait D class actor he is."
    },
    {
      "rating": "3",
      "text": "Besides the special effects the movie sucked... Horrible they really tried to do too much in this movie... love, comedy, action, drama, and oh did I mention love? You tried to kill me and I love you. (schoffs) too much English for people that lived in China for 2000 years."
    },
    {
      "rating": "10",
      "text": "Wow. Surprisingly awesome. Best action flick of the year."
    },
    {
      "rating": "5",
      "text": "Surprisingly not as bad as what the critics would make you believe. Go in with low expectations and you might have a little fun with it. The whole franchise is mindless popcorn trite so keep that in mind before you go."
    },
    {
      "rating": "0",
      "text": "Bad directing, bad dialouge, and hammy acting make this movie's predecessors look like The Godfather Part 1 and 2."
    },
    {
      "rating": "0",
      "text": "Dang i afraid this will tear off the franchise. Because it has weak story, flaw of casting of Mario Bello, and opposed of two Egyptian movies for the previous series. This got to be the worse of the mummy series ever."
    },
    {
      "rating": "7",
      "text": "I give it a seven because it was as fun as the rest of the mummy series, but also the worst one of them. I mean, what happened to Rachel Weis as Evy? Thats like terminator without Arnold Shwarzanagger! And, although its a new twist, it takes place in China, not egypt, and the jokes were'nt so funny. On the lighter side, still fun, still exciting, hot chicks, and great FX as usual. Definently a seven."
    },
    {
      "rating": "3",
      "text": "This movie was just ridiculous"
    },
    {
      "rating": "7",
      "text": "It was OK. It was much like \"IJ4\" in all respects. The kids will like it for it has non stop action for about one hour or so and although many of the gags fall flat a few of them do work. So if your looking for a mild diversion and lots of action sequences this is the ticket for you."
    },
    {
      "rating": "4",
      "text": "I'll admit it. I went into the theatre not expecting much from this film, and even then I was disappointed. As my mother and I left the theatre we didn't even talk about it. It just didn't have the same fun feeling that its prequels had. I wanted to like it, I tried to like it, but I couldn't."
    }
  ],
  "recommendations": [
    "teenage_mutant_ninja_turtles",
    "underworld_evolution",
    "transformers_revenge_of_the_fallen",
    "the_twilight_saga_eclipse",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "i_am_number_four",
    "poseidon",
    "the_twilight_saga_new_moon",
    "red_dawn",
    "the_darkest_hour",
    "doctor_strange_in_the_multiverse_of_madness",
    "into_the_storm",
    "national_treasure_book_of_secrets",
    "bloodshot",
    "the_twilight_saga_breaking_dawn_part_2",
    "gods_of_egypt",
    "volcano",
    "terminator_genisys",
    "the_day_the_earth_stood_still",
    "the_last_witch_hunter",
    "the_legend_of_hercules",
    "underworld_blood_wars",
    "pirates_of_the_caribbean_on_stranger_tides",
    "hercules",
    "night_at_the_museum_battle_of_the_smithsonian"
  ]
}