{
  "id": 403,
  "title": "The Simpsons Movie",
  "starring": [
    "Dan Castellaneta",
    "Julie Kavner"
  ],
  "runtime": 87,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "After Homer accidentally pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gzb6P78zeFTnv9eoFYnaJ2YrZ5q.jpg",
  "categories": {
    "plot": 6.230769230769231,
    "acting": 5.888888888888889,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.416666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "spiderpig spiderpig\rdoes whatever a spiderpig does\rcan he swing from a web\rno he can't he's a pig\rlook out he is a spiderpig"
    },
    {
      "rating": "4",
      "text": "More like 2 Episodes blown up to 90min with not-so-funny sidekicks (spider pig - wtf?) and not-so-ironic father& son stories. Too bad... and as usual - trailers took away most of the really awesome scenes (Moes Bar...)"
    },
    {
      "rating": "4",
      "text": "Highly, Highly over rated by critics and press critics alike. I absolutely love the Simpsons TV series and have watched it for over 10 years. I was almost afraid to go and watch this because I didn't see the point in them making the film when they had resisted for so long. being highly cynical i feel it is one last cash in before they go and count their cash in retirement. The jokes (if some of them can truly be called that) can be seen coming a mile off and lack the brilliant suggestion at deeper comment that made the simpsons so popular in the first place. Bart - one of the principal characters spends the whole film craving Flanders as a father figure which renders him completely impotent with regards to the impact that his normally mischievous character would have. I am going to stop before i get started because this film disappointed me more then any of the last five years. You all know that its rubbish really too, you just want it to be good so you pretend it is or you're too afraid to admit it. This is a criminal waste and an insult to the awesome franchise/legacy that they have spent the best part of the last two decades building up."
    },
    {
      "rating": "5",
      "text": "This movie is a tad better than the writing that's come out of the Simpson's in the last 5 or so seasons. In other words, it just slightly better than crap."
    },
    {
      "rating": "5",
      "text": "I grew up watching 'The Simpsons' TV show, you know, like everybody else in the entire world...so when I heard that they were making a movie out of a TV show that's been on for years and that I'm a huge fan of... you can imagine how excited I was feeling.\r Boy was I disappointed...massively disappointed. 'The Simpsons Movie' is a weak comedy that tries to have a big-scale plot and tries to throw in as many twists as possible, but for me, it just backfired.\r The movie's main focus is about the environment and keeping it safe, Homer, however after adopting a pet pig, makes a stupid decision to dump the \"Pig Crap\" silo into the river and polluting the environment. Meanwhile, Lisa has fallen for a boy named Collin who shares the same interests about keeping the environment safe. Bart, for reasons of his own, has built a relationship with Ned Flanders simply because Homer is not a good enough father and Flanders respects Bart.\r The family get under attack from the Springfield population after hearing what Homer did and because of his idiotic decision, it led Springfield to be trapped underneath the dome. The family manage to escape and reside in Alaska and start a new life there.\r The voice actors do a great job at showing all of the characters' different emotions as you'd expect since they've been doing this throughout the television show. Obviously, one cannot go wrong with the animation as well.\r My only issues with this film include the humor, it's not very funny. The television show had me laughing with the sarcastic humor and slapstick style. But this movie really scraped the bottom of the barrel here, the \"Spider Pig\" moment was supposed to be the funniest movie moment of 2007, but I had a straight face throughout the entire sequence...it just was not funny at all.\r The plot was just uninteresting and too big-scale, it did not feel like one long \"Simpsons\" episode, it just felt like a huge Simpsons movie-wannabe and did not pay off in any way.\r I am disappointed, I do not plan on watching this movie again...unless I am REALLY bored."
    },
    {
      "rating": "7",
      "text": "While I am an avid Simpsons fan, I do have to admit that this movie did feel more like a really long episode, which was a little disappointment. But, the improved animations and the obvious extra effort from the actors and writers do make for that a bit. For a show that has been on as long as it has, it must be really hard to come up with fresh material. Overall: For the Simpsons it isn't half bad, but this could easily have been cut into a three part episode."
    },
    {
      "rating": "10",
      "text": "A wonderful movie, absolutely great any movie with The Simpsons are great its a funny movie with a good story and a great plot i advise you to go see this movie."
    },
    {
      "rating": "10",
      "text": "The Simpsons movie it's the best movie of all time.There are all of the characters of the original TV series and a great story with epic events.The best movie ever."
    },
    {
      "rating": "8",
      "text": "This movie is freaking hilarious. Probably in my top 10 for the best comedy movies, not kidding. I laughed so hard in some scenes. I overall had a good time with this movie!"
    },
    {
      "rating": "8",
      "text": "I, personally, could not stop laughing throughout the entire movie. When I got out I realized my parents would not have liked it the least bit (except for the famous Spider Pig scene). Still, it's got some pretty inappropriate stuff in here. If you don't care and like stupid stuff, this is definitely your kind of thing."
    },
    {
      "rating": "8",
      "text": "The Simpsons movie is hilarious and has a good story. The only problems are when it gets too random or when it feels like an extended episode. All in all a great movie and a must see for \"Simpsons\" fans."
    },
    {
      "rating": "8",
      "text": "I was expecting to give this movie a 10 but I gave it an 8. But the movie is still amazing! Lets talk about why this movie is amazing. One word...spiderpig."
    },
    {
      "rating": "10",
      "text": "Look Out, He Is A Spider-PigLike The SpongeBob Movie And My Little Pony: The Movie, The Simpsons Movie Has Everything That Makes The Show So Good."
    },
    {
      "rating": "7",
      "text": "as long as you are with this sane family..The Simpsons MovieSilverman's 90 minutes of practically a flood of sharp humor is too much to handle. It literally is a flat out hilarious with gags like you have never seen and jokes like you have never heard. The stupidity, the cunningness, the slick one liners and the sarcasm, everything blends in with such flamboyancy in one whole act that it warps you back to your childhood days. You find yourself rooting for a more troubled and extreme sadistic version of the society that it mocks on such large scale. And it is that feeling that rarely does a comedy genre offers you, which is in plethora of.It teases you and satisfies you with its dumbness and ludicrous ideologies that keeps you giggling throughout the course of the feature. On terms of storytelling, it is basically a textbook satirical track that meddles with powers and responsibility. But with all the loud distractions and references that is drawing your attention through humor, you couldn't care less about where it takes you. You are just happy as long as you are with this sane family. The voice cast does a tremendous work as usual and cracks us up on each line possible, their comic timing is obviously off the hook. Homer's wise words are just pure gem, his quick ideas that backfires vigorously and his lazy notions that always brings trouble, he is a genuinely moving character that grounds this sketchy world. It also takes few things a bit too far that can be off putting, but the hard work of sketch artists is clearly visible in here where they use the entire frame on the screen to keep you attentive towards it. The Simpsons Movie is basically a two part episode stretched over by better material, it won't change a dime but then it doesn't have to when it is this funny."
    },
    {
      "rating": "8",
      "text": "Probably America's most daring movie ever made...."
    },
    {
      "rating": "3",
      "text": "For me this movie is the disappointment of the year. The hype for this movie alludes me, it was preachy and simply not funny unless I assume you're high. Seriously, I found myself shaking my head so many times in sheer disgust while bewildered at why in the world the audience was laughing. I only laughed 3 or 4 times and yes I DO have a sense of humor but have a tendency to laugh at things with wit, irony, and sarcasm- not senseless arbitrary humor that I honestly believe any high school stoner could have written. Prepare to be disappointed."
    },
    {
      "rating": "1",
      "text": "I have to say that I was VERY disappointed in this movie. It amounted to nothing more than an over-extended episode. The plot was fine for a half hour show but did not translate well into feature-length. I actually fell asleep after 45 minutes of this boring movie."
    },
    {
      "rating": "6",
      "text": "OK, but not great. Critics who raved about this should be required to watch the first few seasons of this show again, just to remind themselves of what the Simpsons represented at their peak -- a family just as significant as the Sopranos. My 7 year-old son laughed at the wiener jokes, and I felt depressingly old remembering just how good this show was years before he was born."
    },
    {
      "rating": "10",
      "text": "This has gotta be one of the best movies ever! It's smart, it's funny, and above all, the story is good. What else do you want from a comedy!?"
    },
    {
      "rating": "5",
      "text": "The Simpsons Movie is decent yet disappointing. The film feels like an everyday episode of the show but has it's jokes stretched out too thin. Not as good as it should have been."
    },
    {
      "rating": "10",
      "text": "The Simpsons Movie is one of the best movies of all time! The series has been going on for a long time with great episodes and this movie was awesome. It is really funny. It has a cool storyline. The voice actors are all back. This movie was a great movie and I highly recommend you watch it."
    },
    {
      "rating": "10",
      "text": "This movie was great! It's perfect if you look at the past, and what they did now."
    },
    {
      "rating": "10",
      "text": "1st Of All Thank You Critics!! :)This Movie Could Not Be Any Better.. So So So So Funny.. I Love The Cast.. This Movie Has Some Moments I Will Never Forget! The Best Movie Of 07! The Writing ROX!"
    },
    {
      "rating": "7",
      "text": "I thought this was pretty funny. 3/5 stars from me!"
    },
    {
      "rating": "8",
      "text": "It may seem more like a prolonged episode than anything else, but it is both way more funny as well as serious, resulting in a great first film for 'The Simpsons'. Both fans (and some who aren't) will adore this movie."
    },
    {
      "rating": "10",
      "text": "One Of The Best Movies Of All Time!\rThe Simpsons Is The Best T.V. Show Of All Time!"
    },
    {
      "rating": "6",
      "text": "The Simpsons Movie is simply that.\rA good all around movie capturing the eyes of its target audience. Laughs, a little story, and a good bit of fun all around."
    },
    {
      "rating": "0",
      "text": "A long tv show not a movie....stupid story....same jokes...nothing new = very dull and lifeless."
    },
    {
      "rating": "4",
      "text": "My advice to all the Simpsons fans out there: take this movie out of context. Imagine there was no Homer, no Bart, no Springfield. Imagine it was the exact same movie, except made by an indie Director. You may start saying: \"Wow, that movie was pretty bad! The only reason I liked it was because I like the Simpsons and go fanboy **** over everything that has their name on it!\". Matt, cancel the Simpsons, go onto new **** You've already lost your fanbase, now try saving Futurama or just make a new franchise before we lose faith in you."
    },
    {
      "rating": "1",
      "text": "Epic fail this should have been 2 an half hours long filled with satirical humor and critical insights about humanity but nope we get spider pig .  It should have had a R rating since they did not have to deal with TV censorship but nope they went for quick money of pg13 . What a complete waste just think of all the hard critique of society failure got thrown out for profit. This movie marks when they completely sold-out. The show itself has lost it's sense of fun and commentary because of Al Jean.   They could have crammed more jokes in a lot more.  Had I been in charge I would have used the actors to help get this movie to be 3 hours long."
    },
    {
      "rating": "5",
      "text": "The story was random just like almost every episode from 2000 to present. I laughed a few times but a dome going aroung springfield is not believable. I liked the movie 10 years ago but its gone to crap unfortunately. But there were some funny moments thats why it didnt get a 2."
    },
    {
      "rating": "2",
      "text": "I didn't go into this movie with any expectations, so I wasn't disappointed. That said, I just don't think it was funny in any way. It was almost sad for me to watch because as good as The Simpsons once was, that's how bad it is now. Don't waste your time with this one."
    },
    {
      "rating": "1",
      "text": "I really tried to like this film.......honest........ but it was just plain boring and not the least bit funny."
    },
    {
      "rating": "5",
      "text": "The Simpsons are dead. It went stale after season ten and they haven't made a decent episode since then. If this film was the best they could do then why not just make it into a two part episode? It feels a little draged out with a lot of filler lines and jokes (only a few which are funny). Family Guy and South Park are the way to go."
    },
    {
      "rating": "0",
      "text": "This film is lame just like the series when they start making it new. If The Simpson's series was canceled instead of Futurama series that will make a better entertainment."
    },
    {
      "rating": "1",
      "text": "I wish I had the time to do a video side by side of how many past episodes this movie shamelessly ripped off. Homer getting a Pig (Homer goes to college), Bart idolizing Flanders (Boy Scoutz 'n the Hood), Lisa crusading for the environment (The Old Man and Lisa), Springfield destroyed by pollution (Trash of the Titans), Homer goes on a hallucinogenic quest (El Viaje Misterioso de Nuestro Homer, and probably a few others), Marge and Homer having marital problems (every 6th episode), and that's all I can think of off the top of my head. Except none of it is as clever or smart or endearing as the show was for the first 10 seasons (more or less). Right about now, the shows creators would trot out the Comic Book Guy and have him point to me and say \"Worst Reviewer Ever!\", something they seemed to do a few seasons ago, for nearly every episode to deflect all the criticism the show had been receiving, rather than come to their senses. The sad reality is, The Simpsons has long faded from its intelligent, witty, and social relevance years ago. It has sadly devolved into a clichéd, mishmash of recycling old episodes and tired jokes. What's worse is that newer episodes are typically stapled together with potty humor, drug jokes, and chronically arduous slapstick. Something, the series used to sparring incorporate, and mostly for irony. This movie practically drowns in exhaustive slapstick, and includes at least 2 blows to the... \"family jewels\". Word of mouth and positive reviews gave me hope that years of development time and rewrites could've signaled a return to its brilliant form. It didn't even come close."
    },
    {
      "rating": "3",
      "text": "This wasn't as good as I thought it would be. I think that it could have been better"
    },
    {
      "rating": "5",
      "text": "More disappointment than dislike. I would have been completely satisfied if it was split into about 3 or 4 episodes and then put on TV, or if it were released straight to DVD. Homer may have said it perfectly at the beginning when they're watching the Itchy and Scratchy Movie, he said something along the lines of (possibly misquoted) \"Why did we pay to see something at the movies that we can see for free on TV?\" My thoughts exactly."
    },
    {
      "rating": "9",
      "text": "I loved this movie!I am a huge fan of the simpsons and i didnt think there was something to make me like it even more but I was WRONG! It still isnt perfect and i know that they could have made it much better but this is also good."
    },
    {
      "rating": "3",
      "text": "Clearly made for commercial rather then creative reasons. It's just a longer version of the new t.v episodes which are poor at best and dectract from the brilliance of the earlier ones. The spider-pig part which is early on in the film and thought of as the best part is not very funny at all and puts the rest of the film into perspective."
    },
    {
      "rating": "3",
      "text": "As a big Simpson's fan, I was really disappointed. Actually fell asleep in the second half. Some funny moments but overall felt like an overlong episode"
    },
    {
      "rating": "0",
      "text": "The Simpsons have always been heading downhill since the mid 90s, but the hill just got a lot steeper. I did not go into the movie with high expectations, but at least assuming that I would not regret spending 90 minutes watching it. But I did. It was a combination of the preposterous plot, the lack of the jokes that brought the Simpsons to fame in the first place, and the reliance on homer continually hurting himself, for example sticking a hammer in his eye. It was because of this that I found myself laughing very rarely, apart from a few flashes of brilliance (the parody using green day of the violinists in \"titanic\", and the 8 year old kids surrounding me laughing almost non-stop. The Simpsons has long been regarded as a show that will please both children and adults, but I am very worried that it is fast becoming just another kid's cartoon, and that would be a shame. A very great shame."
    },
    {
      "rating": "0",
      "text": "Anyone who likes this movie is a tool and will die alone. If you are married your wife/husband is more than obviously having an affair with you. Die already."
    },
    {
      "rating": "5",
      "text": "It was alright. Typical later years simpsons, thought it was just a long episode."
    },
    {
      "rating": "3",
      "text": "I loved the Simpson's but times have changed. Family guy and south park are fresh funny and of a much higher laugh per second ratio. i giggle twice in this film and cried a little at Bart Simpson naked full frontal. 100 from the Washington post?!?!?!? do they watch the same film that i do>?!"
    },
    {
      "rating": "0",
      "text": "This is the worst movie I have ever seen. Its boring, its lame and the story is crap. It makes the show look bad."
    },
    {
      "rating": "0",
      "text": "This movie sucked. Even with ten years of bad episodes behind us, this movies surpassed them all. I didn't laugh once. Just end the series now and put us out of our misery."
    },
    {
      "rating": "3",
      "text": "Those critic reviews are bullsh.t. They are judging the movie according to the old episodes of the simpsons, rather than the actual movie. I didn't even chuckle once. I am. well, i was, a simpsons fan but only the old episodes. The new episodes are crap. This movie was just a 2 hour special of the new episodes in my eyes. Two hours of crap."
    },
    {
      "rating": "0",
      "text": "the simpsons has being getting worse and worse for years now. and spider pig is not funny!"
    },
    {
      "rating": "5",
      "text": "Only funny if you watch it in theaters. You need an audience to appreciate and laugh hard while watching this. It's also only funny the first time. It lacks the charm and everything else that the show has. I was also discussed by the showing of Bart's penis. The writing was okay. My favorite line was \"Spiderpig, Spiderpig, does what ever Spiderpig does, can he swing from a web no he can't he's a pig lookout, lookout for Spiderpig.\" I'm not sure if that is how you write that line but you understand what I'm getting at."
    }
  ]
}