{
  "id": 3505,
  "title": "The Great Mouse Detective",
  "starring": [
    "Barrie Ingham",
    "Val Bettin"
  ],
  "runtime": 74,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "Mystery"
  ],
  "description": "When the diabolical Professor Ratigan kidnaps London's master toymaker, the brilliant master of disguise Basil of Baker Street and his trusted sidekick Dawson try to elude the ultimate trap and foil the perfect crime.",
  "releaseYear": "1986",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9uDr7vfjCFr39KGCcqrk44Cg7fQ.jpg",
  "categories": {
    "plot": 7.166666666666667,
    "acting": 7.5,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 9.5,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Policías y Ratones merece mas respeto y reconocimiento del que tiene, el detective Basil es un gran personaje, es muy histriónico, divertido e inteligente, una historia interesante y atractiva sin caer en la cursilería tradicional y último y no menos importante, un villano de tomo y lomo como lo es Ratigan."
    },
    {
      "rating": "10",
      "text": "After the disappointment of the forgettable Disney classic The Black Cauldron Disney has some interesting ideas for the next feature film Basil The Great Mouse Detective aka The Great Mouse Detective. It's about the Sherlock Holmes story where Basil and Dawson had to find Olivia's father from the evil villain voiced by the famous Vincent Price. The chase scenes are a lot of fun just like from the other Disney classics. There's even some scary scenes of a bat in it much like in The Black Cauldron, it is one of the darkest feature films ever. The animation and characters are great, my favorite character is Basil and and the animation is good as well but for the clock tower, the animators are computer animation to make it look like you're inside the big ben. If anyone's a huge Vincent Price fan, I guess this is a Disney classic for you."
    },
    {
      "rating": "7",
      "text": "A very funny Disney film with hilarious characters and decent story. Highly entertaining."
    },
    {
      "rating": "3",
      "text": "This movie just passes as your average animated action movie, doesn't pass on its own merits. It's not nearly as good as I remember it from my childhood. The primary problem is that this is supposed to be a Sherlock Holmes style mystery but it is not presented as a mystery. Rather it's presented as an action/adventure movie. There's no suspense or mystery to it because we know all along what happened to Olivia's father, who did it, why they did it, and what they want. It's shown to us very early on. There's no riddle to solve here and everything that comes out of Basil's mouth sounds like a bunch of clairvoyant woowoo nonsense because they stretch the limits of what can conceivably be derived from observation and deduction, breaking the suspension of disbelief. It could be an educational movie that teaches kids how to solve mysteries, riddles, or use deduction, but it doesn't do any of that. And before you go saying \"but it IS a kid's movie, aren't you being too harsh?\" No. Zootopia is a kid's movie. Harry Potter movies are kid's movies, and they have at least basic mysteries that can be explored and discovered by the viewers as the protagonists understand and learn more, not from an omniscient view where there's no riddle to solve because we already see what's happening on the villain's side. What are the positives of this film? Maybe some nostalgia fodder. Fun characters for the furries and those who like talking animal movies. Maybe one or two jokes that give a giggle. It's a bit overlong for what it is, and I love talking animal movies in general, so... Eh. Even the Rescuers movies are a better mystery than this, and this one's modeled after THE great mystery hero Sherlock Holmes. Doesn't do the genre justice.Most of the points I even give this review are for Ratigan's theme song. That's a rare moment of joy in an otherwise tepid movie. He's an underrated Disney villain and you can tell some of his animations were recycled from the ending fight sequences into the ending fight sequences of Beauty and the Beast. The scene glows when Ratigan is on, but I think it's a problem to have a villain who is much more interesting than the protagonist. Basil comes off as easy to give up, nagging, and can't be bothered. Ratigan by contrast has a sort of deranged charisma and humorous silliness."
    },
    {
      "rating": "9",
      "text": "Very CleverConsidering how disappointing and forgettable The Black Cauldron was, The Great Mouse Detective was exactly the kind of Disney movie we needed back in 1986."
    },
    {
      "rating": "8",
      "text": "The Great Mouse Detective es una de las películas animadas que mas nostalgia le tengo. Gráficamente se ve increíble para la época, los personajes son muy memorables y la historia es divertida dentro de todo, aunque si es cierto que a veces algunas cosas no son tan agradables (en el sentido de que puede ser un poquitito cliche o que lo que te estén contando no sea tan interesante a veces) y Basil como personaje no lo sentí tan bien hecho, ya que puede llegar a ser muy redundante y alargar bastante la trama con pistas forzadisimas que se las saca como si nada, chistes fuera de lugar o las típicas conversaciones genéricas vistas en muchas otras películas animadas. Al final de cuentas, el no aporta mucho a la investigación, haciendo el ridículo y es mas que nada Dawson el que hace todo el trabajo por el (obviamente quitando alguna que otra excepción). Basil como protagonista para mi no funciona del todo, y cuando en una historia los personajes secundarios tienen muchísimo mas interés que un personaje principal (incluso mejor diseño en lo personal), hay algo que va mal. Dawson, Fidget, Rattigan, Miss Kitty, Hiram y Olivia, Toby, Felicia, etc... son todos mas carismáticos que Basil en mi opinión (¡y eso que hablamos también de personajes terciarios!)... Honestamente le estuve por dar un 7 a esta película. Sin embargo, debido a que gráficamente es espectacular, ademas de cumplir en cuanto a historia como película animada para la época, junto con el carisma memorable de los personajes (excepto Basil) y el diseño de los mismos que me encanta (especialmente el del murciélago Fidget), se lo voy a subir a un 8. Muy recomendada."
    }
  ],
  "recommendations": [
    "big_hero_6",
    "the_road_to_el_dorado",
    "penguins_of_madagascar",
    "madagascar_escape_2_africa",
    "toy_story_2",
    "aladdin",
    "toy_story",
    "reign_of_the_supermen",
    "kung_fu_panda_3",
    "space_jam",
    "scoob",
    "stuart_little_2",
    "the_lego_batman_movie",
    "the_secret_life_of_pets",
    "madagascar",
    "rio_2",
    "treasure_planet",
    "kung_fu_panda_2",
    "brother_bear",
    "finding_nemo",
    "frankenweenie",
    "despicable_me_3",
    "pirates_of_the_caribbean_the_curse_of_the_black_pearl",
    "atlantis_the_lost_empire",
    "the_princess_and_the_frog"
  ]
}