{"id": 2845, "title": "The Master", "starring": ["Joaquin Phoenix", "Philip Seymour Hoffman"], "runtime": 137, "genre": ["Drama"], "description": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tvhE7TWGzLPgN82bBDuX1XtH5oE.jpg", "categories": {"plot": 6.0256410256410255, "acting": 7.053571428571429, "ending": 6.142857142857143, "soundtrack": 0.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 9.5, "action": 5.8}, "reviews": [{"rating": "10", "text": "Another amazing epic Paul Thomas Anderson film where every facet of the film is extremely dynamic. It is very dense and there's a lot to take in whether it be the tense, grinding score, the gorgeous shot choices (punctuated by vibrant color and detail in 70mm), or knock out performances from the lead males. The physical work that Joaquin does is outstanding, I have not seen an actor as fully committed and free in a long time, perhaps since Daniel Day in There Will Be Blood. Paul's most interesting film in terms of structure/ editing, jumping through time willy nilly, perhaps mirroring the teachings of Lancaster Dodd or perhaps entering the mind of Freddie continually going back to where he is stuck (the war/ lost loves). The relationship between Dodd and Quell is tense and at times adorable, they are so in love and desire so much to have what the other has: Lancaster wants to act on impulse and not be controlled by any \"Master\" and Freddie whats to break this insane cycle he seems to find himself trapped in. This film will absolutely take many more viewings and I believe it will continue to grow in my mind as PT's best film (potentially)."}, {"rating": "1", "text": "There is a growing chorus of hosannas greeting \"The Master\" that will no doubt crescendo around Oscar time, but I would like to add my voice to the minority.  There are very few negative reviews for this movie.  Those I have seen have usually received a stream of venom from readers, who fill the comments sections with wounded outrage.  The raves, meanwhile, are telling in their own way.  Consider this quote from our own Kenneth Turan (\"'The Master' mesmerizes in word and deed\", LA Times, 9/13/12): \"its interest is not in tidy narrative satisfactions but rather the excesses and extremes of human behavior, the interplay of troubled souls desperate to find their footing.\"  Tidy narrative satisfactions.  Here's another: \"This is a superbly crafted film that's at times intentionally opaque, as if its creator didn't want us to see all the way into its heart of darkness.\"  Anyone beginning to get a whiff of **** here?  No?  Perhaps we should take the advice of Entertainment Weekly's Lisa Schwarzbaum: \"the movie may not even be fully comprehensible on first viewing, the bigger patterns in the narrative and the rhythms of the filmmaking revealing themselves more fully and clearly only with a return visit. Even then The Master is enigmatic.\" Well, you can't have everything.  But Kenneth Turan deserves the final word: \"it's disconcerting that the relationship between (Dodd and Quell) gets murkier rather than clearer as time goes on, (but) that is perhaps the point.\"  Yes, we all love being disconcerted by murky enigmas, don't we?  There's a certain feeling of sophistication that comes along with it.  But this seems to me to be more like the shared thrill of a mob mentality, the kind of thing that gets dictators elected and cult leaders established, a projected fantasy of greatness that finds affirmation in incomprehensible mediocrity.  We've seen it before.  It would be perhaps too harsh to say that \"The Master\" is an example of this.  There is no doubt a lot fine work on display in this film.  But if I want opacity, I can always just stare at a wall."}, {"rating": "10", "text": "If Malick, Antonioni and Kubrick had a baby he would have made The Master. This  may be be PTA's most impressive movie, but you need to give it time to digest."}, {"rating": "6", "text": "Difficult and depressing. On the one hand, the acting is sensational - both Joaquin Phoenix and Phillip Seymour Hoffman are clearly amongst the greatest actors of their generation, and are absolutely compelling to watch. On the other hand, why put yourself through the trauma of watching horrible characters being horrible to each other and everybody else for about three hours? Occasionally humour, humanity and redemption do peek through, but it is still a bit of a slog. I had the same uneasy reaction to \"There Will Be Blood\". If you liked that, you will probably like this. But is this kind of relentless psychodrama a good night out? On balance, this is abject pandering to the desire of actors to stamp their authority on their art. Nevertheless, this movie is certainly different to anything else that is coming out, and as such deserves an airing. Just be aware that the subject matter and tone is unforgivingly dark."}, {"rating": "10", "text": "This is by far the best film of the year! The Master has two incredible performances (Phoenix, Hoffman), beautiful cinematography, and a powerful message. This film will tear out your heart by subtly exposing people for who they are at their core. I believe this to be true for all of the masterpieces creating by Paul Thomas Anderson. Bravo, sir, bravo!"}, {"rating": "9", "text": "This is a great movie. It's as captivating as any of PTA's work but maybe in different ways. This film isn't about competition like There Will Be Blood but more about a teacher/mentor relationship unlike any other. It would be easy to write Phoenix's character as a pure audience surrogate but instead we get an unreliable source who could actually benefit from guidance. Shot beautifully, there are enough breathtaking shots that would worth seeing it a second time but in 70mm if given the chance. The performances are also spectacular. Unsurprising Hoffman is the star here. He's able to create a charisma that makes you understand why people are drawn to him and yet you can see the gears in his head moving. His character is thinker whereas Planview was an animal in the way Hoffman detests. Phoenix is excellent as well, bringing more to his character than just his surface mannerisms. Adams is also very good."}, {"rating": "8", "text": "Beautifully crafted, perfectly acted  and a genius score to go with it. But, you cant help feel that the storyline was rather weak. you really want to connect with the characters and really get into the film, but it just doesn't seem to give as much as you want it to. Saying that it is still a brilliant piece of cinema!"}, {"rating": "8", "text": "The power house performances from Phoenix and Hoffman help create some of the most mesmerizing scenes of 2012, and Paul Thomas Anderson has a great eye for scenery. However, I felt that the story ultimately meandered around the concept of cult and towards the final act fell apart for me, leaving a sense of unfulfillment. It is not his best film to date (that honor still goes to 'There Will Be Blood') but any fan of Paul Thomas Anderson will find greatness through the failures."}, {"rating": "10", "text": "Excact same experience as There Will Be Blood. The first time you'll notice the amazing acting but the film with seem pretty empy. The next time you watch it you see all sorts of potential in it and the acting will seem even better. Every time you watch it after that it will seem rich and full, and you'll realize P. T. Anderson actually truelly knows what he is doing. My favorite movie of the year, and DD Lewis was great but I wish the oscar went to Jaoquine. Did you know his brother was River Phoenix? I somehow didn't know that till recently. Anyways, I digress."}, {"rating": "10", "text": "PT Anderson is one of the greatest talent's in American cinema, for one simple reason; He does not pander to the masses. This is a beautifully directed character study of a charasmatic man trying to levetate above animalistic biology and his antithesis, a man destined to succumb to them. At no point does Anderson give in to character exposition or reveal his intentions. The acting of both male leads was sublime. Phoenix, doing enough in my opinion, to best Day Lewis in Lincoln. The Oscar snub for Best film and director was clearly a reaction to the Scientology basis, even though this is not strictly a film about Scientology."}, {"rating": "10", "text": "Superbly crafted, The Master is the ultimate contemporary Avant-garde film. The complexity of the story and the lack of dramatic coherence and unity, combined with richly colored cinematography, Greenwood's brilliant score and  Anderson's nearly unprecedented artistic talent rich in philosophically adventurous and thematically exploitative spirit, makes The Master a layered statement against conventional narrative and determined resolution. Therefore, it  sustains its marvelous and enigmatic opacity and many may find it very difficult to deal with it. Nonetheless, even those who find it difficult to digest Anderson's lack of transparency and non-eventful story, should be able to find a lot to enjoy in, e.g. the masterclass performances. Besides the grand aesthetic values, the film also explores themes such as post-war American society, its psychological, emotional and moral structure, the western's world principles of freedom and the conflicting yet absorbing authority of the master, the loss, weirdness, sadness, mental illness, belief, accompanied with suggestive philosophical ideas such as the impossibility of reconstructing and ultimately, facing one' s past."}, {"rating": "10", "text": "I really can't wrap my head around why people hated this movie so much. I think alot of it has to do with expectations. i personally didn't love There Will Be Blood, so I went into this with no expectations. While it did have a few problems of its own, it was the most fantastic film-going experience I've had in a LOOOooong time. It doesn't have a cookie cutter narrative, and it certainly speaks in metaphors...lots of visual poetry and character development as metaphor. The narrative really exists inside the audience's mind. If you're not willing to think a little, you're missing out. I think American audiences are just a little too spoiled and ADD for this type of film in the 21st century. Maybe I'm wrong. I just really want to understand what people hate about this movie."}, {"rating": "10", "text": "This is an amazing film, but you can't go in expecting it to be an L. Ron Hubbard expose in the style of There Will Be Blood. Like all PTA movies, this changes the game."}, {"rating": "10", "text": "This is just as brilliant as any other PTA film... and it even provides more food for thought. The fact that so many people found this \"stupid and pointless\" while they the loved Inception just goes to show you that all you need to satisfy most movie goers is a couple guns and explosions."}, {"rating": "10", "text": "This is my favorite movie (yes of all time). I'm not sure who should take credit for it either. Joaquin Phoenix had a breathtaking performance, along with Philip Seymour Hoffman. Paul Thomas Anderson did a fantastic job directing, especially during the single shot realism takes. He chose to use an old Panavision camera and shot in 70 mm and it looks better than any other movie that I have ever seen. The DOP Mihai Malaimare Jr. did a fantastic and notable job on this film as well. A masterpiece."}, {"rating": "7", "text": "The acting prowess of the trio of Philip Seymour Hoffman, Joachim Phoenix, and Amy Adams that made this worth-while for viewers. Paul Thomas Anderson's \"The Master\" is fabulously well-acted and crafted--no question, but it's the material that is not clear. It has two performances of Oscar caliber, but how do they connect? \"The Master\" won't likely impress the audience of his earlier masterstroke. A film that starts off seeming like the best of 2012 slowly becomes a chore to sit through. It didn't have to be that way. The things that are lacking in \"The Master\"--are those any good screenwriter could have fixed. Alas, Anderson wrote this one himself.\r Phoenix plays Freddie Quell, a soldier back from the Second World War who's finding it hard to adjust back to society, given his violent tendencies and is usually in a floating world of his own, fueled by his own deadly mix and concoction of any liquids he can find to develop into bootleg alcohol. In his drunken stupor one day he stumbles upon the boat full of followers of The Cause, and as a stowaway gets to meet the charismatic Cause leader Lancaster Dodd (Hoffman), who decides to take him under his wing, with Freddie's ability to conjure up some of his magic juice a plus to have around the community. It's a toss-up as to what Freddie requires most  a master, a sponsor, or a shrink  and Dodd vacillates between all these roles when he takes Freddie on as a pet cause. For the next half hour, the film explores the odd bond that develops between this brilliant, articulate master manipulator and this confused, tongue-tied grifter. The Animated the first half hour soon slows down-- and then--sooner than later, grinds to a halt as \"The Master\" becomes a series of episodes. Just scenes from life inside a burgeoning cult-like organization.\r If you're hoping for insights into Scientology, or some kind of expose, there are none to be had. The movie's focus remains on those two men, Freddie and the Master, but there's really very little to explore there, and so the movie, ever so slowly and yet ever so definitely, begins to sag and then cave in. What made this film compelling to watch despite its scenes that seem to linger in indulgence--and requiring patience to sit through scores of repetition--are the powerhouse performances. Ultimately it's a plain sailing affair, with only its great performances to thank and shore up what's lacking in strength of story. \"The Master\" is a film that is too vague or compelling about it's Cause."}, {"rating": "4", "text": "THE MASTER is a very pretty turd of a film. Beautifully shot and acted but it's an incomprehensible mess. I've yet to find a person who can actually explain it, but quite a few who will leap to: \"the point is there is no point! It's art!\"  Really? In that case, I point you to the episode of the original Batman TV series where The Joker enters a \"painting\" into an art contest that's just a blank canvas, entitled \"The Emptiness of Life\". That managed the same trick and didn't take 2.5 hours to get there.  There's an ever-present sense while watching THE MASTER that something deep and profound is going on just out of sight, but the film itself can't seem to find it.  Maybe that's its point about Scientology, but if so, again, I say \"cheap trick\". Well, Darren Aronofsky had THE FOUNTAIN and now PT Anderson has his \"so incomprehensible the critics are afraid to pan it, but quickly forgotten\" film, too."}, {"rating": "10", "text": "This is a work of art and Paul Thomas Anderson has constantly shown us again and again that he may be the most artistically gifted film-maker working today. Although it's brimming with philosophical ideas about deception, manipulation, scientology and psychiatry and pervaded with beautiful visuals, at its essence the Master is a love story. It follows the storyline of a Naval veteran (brilliantly played by Joaquin Phoenix) who arrives home from war unsettled by the traumatic events he's been through and unsure of his place in the world. By the end of the film, we learn that the real question to ask isn't if he's ready to be a part of the world, but, \"Is the world ready to know him?\"."}, {"rating": "10", "text": "Superb acting is in this film - for viewers who love to see actors tear themselves apart with a role, here it is. Phoenix and Hoffman are at the pinnacle of their respective abilities. Phoenix, playing Freddie Quell draws you in the minute you see his creased up face answering questions from a psychological evaluation post WWII. Hoffman, the deranged but maybe even genius Lancaster Dodd does exactly what he always does - makes you fall dearly in love for twisted and maniacal men. And to give due credit to Paul Thomas Anderson, a director who literally can't have a bad idea; this is one of my favorite directors and this movie is what sparked my interest even more than it ever was in method-acting, the Daniel Day-Lewis-esque idea. With both Philip and Joaquin getting an Academy Award nomination, Amy Adams must also receive due credit and recognition for playing the far-seeing Peggy, whose eye's seem to be peering through people rather than at them. She received a nomination as well. I love this film and these actors. Watch it!"}, {"rating": "10", "text": "The master is, i believe, the best movie made by Paul Thomas Anderson. It has masterfull performances with Joaquin Phoenix on his best. The story may seem not to give much but believe me, it gives a lot to the movie. It´s incredible that a man could think in something like this and take it to the screen in a masterful way, but Thomas Anderson did."}, {"rating": "10", "text": "Truly one of the best films from this past decade. Amazingly acted and beautifully shot, The Master is the tale of one man who truly becomes his own master, while providing a thoughtful critique on human organizations. One of Paul Thomas Anderson's best works."}, {"rating": "9", "text": "Lots to chew on here, but there will certainly be skeptics on this one, as A.O. Scott mentions.  As epic as it feels in some respects, it is the smallest of epics.  It follows one fairly hard to connect with man wandering and struggling and not much else, narratively speaking.  There is some treasure for those who enjoy digging for it, but it is not as grandiose nor as tactually \"enjoyable\" as There Will Be Blood.  Really, the thing *I* am beginning to most appreciate about PTA is what will drive many others away - that he's not scared of wrestling with failure.  And with that sometimes comes moments that may surprise and bring something fresh to the screen, and other times one may feel he overreaches.  But whereas I once maybe felt his over reaching was of an egotistical sort, I find them now to be rather selfless in a way.  He has the command to make something impeccably polished and yet chooses to relinquish it, not to show off, but to explore something outside of that comfort zone.  Anyway, interesting stuff.  World class acting, and equally amazing score and cine.  Will definitely see it again."}, {"rating": "9", "text": "Hypnotic and mesmerizing.  I felt entranced throughout many portions of this movie.  Such a beautifully filmed piece of work; and the score by Jonny Greenwood was both jarring and unsettling, helping to maintain the unique observatory tone of this film.  Is it possible for Joaquin and Philip to split the best actor Oscar?  They keep you engaged at levels I've hardly experienced before (and Joaquin's physical presentation is astounding!).  The film explores so many ideas and leaves so many questions unanswered I don't know where to begin.  I definitely plan on seeing it again!"}, {"rating": "4", "text": "Whether a movie is good, bad, opaque or an epic, it should never be boring.  And, in my opinion, this film was boring.  Joaquin Phoenix´s acting was very good, but acting very well a bad script is a bad result.  Some situations were absurd, in the bad sense of the word.  The characters, except that of Mr. Phoenix´s, were not well delineated, and the directing was all over the place, something not surprising given the poor script.  The basis of the story was good, but it needed a good development.  This film lacks a good development."}, {"rating": "10", "text": "This is a great film that requires multiple viewings and thoughts. Here"}, {"rating": "9", "text": "This is a very polarizing film. I recall at least three people walking out. What does that mean? If you've come to watch a typical Hollywood movie, with typical storytelling and a predictable ending, I'm afraid you might be utterly disappointed. Possibly disgusted. This film isn't for you. It's creepy, uncomfortable, awkward, tense, exhilarating, vile, hilarious, somber, and beautiful. The lead actors deliver stunning performances. Their on-screen relationship is natural and believable. The supporting cast is also brilliant, there are no weak links in this chain. The unsettling, off-putting, gorgeous score from Jonny Greenwood is near perfect. The cinematography feels new, fresh, inspired. There is nothing else like this being done in major Hollywood productions. Without sounding pretentious, this film is a piece of art, first and foremost. If you want to see a beautiful film made by a director and actors at the top of their game, this just may be the film for you."}, {"rating": "9", "text": "This is a mesmerizing film. I haven't a clue if it's a good film, but it sure struts itself out as one. The acting is beyond superb, even if Phoenix made me squirm with his  part psycho, part PTSD, neanderthal, as loose a cannon that ever strode the silver screen. It's not a profound film, just made to look like one, but the film making is awesome. And I would love to see the Director's cut. It reminded me a lot of Orson Welles best  work, minus the heavy metaphors (except of course the sand lady). It's as quintessential American as any movie I've seen. Power, religion, ego, violence, unconscious self loathing, all wrapped into one complicated, and perplexing picture. And scene after scene of either/or hold your breath, squirm in your seat, shake your head tension, or all three."}, {"rating": "8", "text": "Cinephiles are not animals. We are not part of the animal kingdom. This movie is not for animals. Animals will not enjoy this movie. Cinephiles will enjoy this movie."}, {"rating": "5", "text": "As usual the user reviews are better than the professional critics. This film is surely epic in the sense that it has some amazing acting and some nice scenery and the sort of spaciousness that There Will Be Blood had. BUT.... pretty much nothing actually happens. Get it later on DVD and you will soon be drifting off and checking your email while the characters sit in rooms talking.  The plot is almost literally non-existent (apart from 'ex-sailor gets involved in religious cult') but really... it gets more and more boring as it goes on and the ending is very very lacklustre. It just sort of gives up. Almost as if there were no ideas. Style over substance. 90% of the film is people in rooms talking, about 8% Joaquin Phoenix's character swigging booze or looking perplexed, 2% action. ie some actual engaging movement on the screen.  At no point do you really give a toss about the main characters and what happens to them, as aside from some moments where JP starts to get programmed by the cult, he's really not a likeable character in the least and the cult leader himself is shown as no more than a clever manipulator not really any kind of vulnerable human being."}, {"rating": "5", "text": "My wife and I both felt that this was an assemblage of progressively weirder scenes rather than a story... and there was truly no one in it to like. To take the talents of these main actors, all of whom I love, and have their intensity in service of this thin gruel is pretty disappointing. Gorgeous to look at, and the mise en scene was brilliant, the period was presented wonderfully. That began to be odd in itself. Why be so faithful to this period if there was not a compelling story within it? The story could be either true or somehow dependent the era. This assemblage of mild depravity was neither. So I gather it was mainly in exercise in style."}, {"rating": "0", "text": "This is a public service announcement: Do not waste your money on this flick, we paid $1.00 at Redbox and stopped the movie 30 minutes in due to 'not wanting to waste another 2 hours of my life' on such a morose, insignificant, depressing, weird movie. These actors (who are superb, by the way) tried to save it, but couldn't. Other uses of my $1.00? Would have preferred the dollar menu at McDs or maybe a dime bag to forget I rented this slop."}, {"rating": "9", "text": "Paul Thomas Anderson continues to prove that he's one of the best directors going today.  If you want a film with superior acting and outstanding dialogue then I would highly recommend The Master."}, {"rating": "1", "text": "I have never seen so many people walk out of the theater about halfway through the movie.  To those of you expecting an Oscar-caliber film, while it may undeservedly be nominated for Oscars, this movie is nothing but a collection of beautifully shot but meandering scenes.  There's no story, no narrative arc, just two unlikeable characters interacting in crazier ways. It becomes tiresome, fast."}, {"rating": "0", "text": "It's tempting to label opaque films as profound.  Their ambiguity hints at a well of feeling percolating just beneath the surface, one that touches on pain, loss, sadness, everything it is to be human.  But, and this may be a hard pill to swallow, sometimes opaque films are just that: opaque.  They are pointless exercises in nebulous action and inactive structure for the sake of appearing profound.  The Master falls into this category.  It is a full 2.5 hours of unbridled fatuous nonsense.  Paul Thomas Anderson, who is no doubt a talented writer/director, seems to have gotten lost in his own reputation for literary mystique, and the result is one of the more narcissistic pieces of films I've had the displeasure of watching.  Be assured that if any no-name writer/director submitted this script for financing, he/she would have been met with a resounding chorus of criticism, and the project would never have gotten off the ground.  The Master presents no story, no real characters, nothing beyond a handsomely shot vacuous mess.  The film's climactic moments fail to stir an emotional response because they signify nothing grander than the cinematic arrogance of an auteur that relishes the label auteur.  If ever there was an example of narcissism in film, The Master is it.  As for the throngs of adoring fans, I would only suggest that artistic output, particularly vague, nonsensical artistic output, has the unique ability to coerce accolades by intimidation.  To suggest that there is nothing profound in The Master is to open oneself up to the criticism that he/she was incapable of picking up on the films nuances.  It's tempting instead to nod along with the discordant soundtrack and addled story structure and pretend to get it.  But I don't feel like nodding along to this because there is nothing here to get.  And the unending stream of praise might be the most pointed example of insecurity since the Emperor sauntered out in public wearing his new clothes."}, {"rating": "1", "text": "I use metacritic to help make my movie selections, so someone needs to say this! Yes, good acting. Yes, unusual music, though disturbing. Yes, good cinematography that you expect for any movie. But expected for any movie is a plot, a story, a reason to exist, to watch, to understand, to persuade, to enjoy or even to hate. There's nothing here. After 2 1/2 hours, thankfully it ends and you're grateful that you at least had a comfy chair and hot buttered popcorn to waste your time!"}, {"rating": "2", "text": "For me, this movie was a case of the critics serving the cool-aide and us moronic masses following their leaders (cult)! While I'll admit that the individual performances were good, the collective was an uninteresting mess. I had zero connection to any of the characters and could have cared less what happened to them. Dreadfully long, dreadfully boring. Our entire group simply hated it."}, {"rating": "0", "text": "I am with the other 19 reviewers giving this a negative review. People think way too hard. Any one who was coming out of this thinking that the movie was some grand statement or beautiful work saw a different movie than what I saw. I kept wanting to leave the movie, and didn't--just because I thought maybe, just maybe it would get better in the end. I have never run out of a theatre as fast as I did when that was over. It was really just a bore, and made me very, very upset, and taught me not to use Metacritic to pick which movies to see. Please don't see this. I'll feel bad if you do."}, {"rating": "8", "text": "It's an absolutely beautiful film - shot for shot - especially if you're seeing it in 70mm.  A couple of shots, actually, were probably the most amazing I've ever seen (ie., the boat leaving SF Harbor).  Phoenix and Hoffman deliver absolutely phenomenal performances - I was transfixed by the first couple of \"processing\" sequences.  The jailhouse scene is incredible. What prevented it from getting a higher score from me what that it loosened up toward the end and lost some focus.  It simply wasn't as coherent and tight as the artists best work - There Will Be Blood, Punch Drunk Love, et al."}, {"rating": "0", "text": "This movie should be called \"Blah, Blah, Blah\".  I tried to love it.  I wanted to love it.  I admire and respect all the creative artists involved.  It was pretty.  It was well acted.  But somewhere in the second hour (it would be incorrect to call it an \"act\", there are no \"acts\" in this film), I found myself wanted to chew through my arms to release myself from the theater.  Perhaps if I had seen it in 70 mm the drive, character arcs or (god forbid art house movie lovers)... the PLOT might have been revealed in greater detail.  As it was, I left shaking my head and wondering what I could have done if I got those 2 1/2 hours back..."}, {"rating": "5", "text": "Whenever the critics rate a movie above 80 I start to get nervous.  The closer to 100 the movie gets to 100 the chance the movie will be either great or an \"artsie\" disaster.  This movie was long, dull at times, and its message was obscure.  It wasn't a disaster but too \"artsie\" to be enjoyable.  Most in the theatre left with a look of \"what did I just spend 2 hours looking at\".  I gave the movie a solid 5"}, {"rating": "0", "text": "A long lamentable movie that has no positive qualities. It is among the most lifeless pieces of cinema I have ever seen. Why people love this movie is beyond my comprehension; it is just deplorable on every single level."}, {"rating": "10", "text": "A masterpiece and one of the best films of all time. If you dislike this film, then you shouldn't watch movies. Beautiful, haunting and flawlessly executed in all areas, it's a movie that will be analyzed and talked about for decades"}, {"rating": "1", "text": "I could not, for the life of me, believe in the premise of the movie, that the Seymour-Hoffman character was supposed to be this charismatic figure people flocked to.  His character was so uncharismatic, so completely banal -- why would any of the characters in the movie be interested in anything he said?  I was bored beyond caring halfway through the movie and wished I was watching Burt Lancaster in Elmer Gantry instead."}, {"rating": "2", "text": "I sat through this movie for almost 2 hours wondering where it was going and when. Maybe it was to artsy or just over my head. Whatever it was, I haven't been so confused about a movie since Memento, even Memento made you think. The master will probably win an Oscar, it only made me feel like I was punked."}, {"rating": "5", "text": ""}, {"rating": "9", "text": "Paul Thomas Anderson continues to mesmerise us with his gripping and powerful and intriguing techniques of film, and the journey doesn't stop with The Master,even if the film never fully let's us in on the whole plan.\rJoaquin Phoenix also proves once again that he is one of the finest and most hard working actors of his time with his performance as Freddie Quell, a man who Phoenix could have you convinced is very much real and sitting next to you, his personality erratic and broken after finding it extremely difficult adjusting to life after serving in World War II, his behaviour lands him in various amounts of trouble as he decides to take up portrait photography, but is continued abuse of alcohol and sexual obsession causes him nothing but problems, then Lancaster Dodd comes along, played by the growing phenomenon of acting that is Philip Seymour Hoffman, who in the film plays a man who is the leader of a movement of what can be outlined as free thinking and overcoming all sorts of issues, he truly has all the answers.\rHis approach to therapy along with his family is frowned upon by many, they stay in the houses of their followers while his wife Peggy (Amy Adams) sees that Freddie may be their downfall. The true outline of the film is how human behaviour and a large array of personalities can collide, Quell is damaged, erratic and full of surprise, almost bipolar, while Dodd is a collected and content man, with goals and ambitions always in his sight, his motives are unclear and these are indeed hidden from the viewer, a technique that works on many occasions, but at times can become puzzling and may be misinterpreted.\rA score from the same composer of There Will Be Blood has its important and pivotal part in this thrilling film, a mixture of sombre but upbeat tones perfectly mirrors the difference in characters who are bound to collide at some point.\rThe opacity that people are diving at to destroy the film is the ideal way for the viewer to interpret this film how they see fit, the movement that is prominent throughout the film is reminiscent of Scientology, and while not as horrific as The People's Temple, the flashes of mastery and looking to one true person leave it to the lucky viewer to decide exactly what is happening, plenty of questions lead to an array of interesting answers.\rA powerful and enthralling effort that will not cease to amaze in terms of performances and writing, you won't get these performances \"staring at a wall\"."}, {"rating": "10", "text": "Where do I begin with this mystical masterpiece, and where do I end? Off the heels of his modern day classic, The Will Be Blood, Paul Thomas Anderson constructs yet another challenging art film that’s sure to mystify and perplex viewers across the globe in The Master. The film follows Freddie Quell, an unstable drifter fueled by alcohol, who recently returned from the Second World War. Plunged deep within his most basic animalistic instincts, Quell stumbles upon the charismatic, self-actualized man known as Lacaster Dodd, who leads a movement (cult!) called the Cause. Dodd sees this man as a new challenge, and the film treks his attempt to tame this beast that is Freddie Quell. Is Dodd truly the Master (as he is commonly referred to in the film) or is it Quell who has mastered and embraced his animalistic instinct… One could even go further to question if Dodd’s wife (played with chilly precision by Amy Adams!!), who seems to be married to the Cause, has more clout than she lets on. Clearly inspired by scientology and its founding father, L. Ron Hubbard, the movie attempts to indulge us without being too candid. Its open ended-ness begs you to question whether there was any real resolution or if the extensive, thought provoking process was worth it. But these are the raging questions that make you appreciate this complex piece of work even more. Anderson constructs a masculine ballet of words, between man and animal. Both men played brilliantly by Joaquin Phoenix (Quell) and Philip Seymour Hoffman (Dodd). Phoenix channels much rage and aggression in a difficult role and Hoffman, conversely, channels a lot of charisma and wit (which may come across as easy) in an equally difficult role. Adams also gives one of the best performances of her career in this film; as the enigmatic, Peggy Dodd. With its brilliant editing and cinematography, not to mention the score that was a character of its own, the film proved to be a feast for the mind, eyes and ears. Next to Cloud Atlas, The Master is the most ambitious films of 2012, that’s expected to endure decades of analysis and reinterpretations. It is simply the year’s best."}, {"rating": "9", "text": "The maddening and precipitous nature that ran rampant across Joaquin Phoenix"}, {"rating": "0", "text": "Pointless. While this movie has nice cinematography and good acting, it is not tied together by a plot. So, I found myself staring at cinematographic diarreah for two hours that felt like four. One of the worst movies I've paid money to watch."}, {"rating": "10", "text": "Just because it's unconventional doesn't mean it's bad. Audiences need to stop being repulsed at the thought of being challenged by a film. This is one of the best movies I've seen, because it has so many layers. I could go back many times and get more and more meaning out of it."}], "recommendations": ["the_good_shepherd", "eyes_wide_shut", "you_were_never_really_here", "21_grams", "nocturnal_animals", "12_angry_men", "ex_machina", "roma", "the_social_network", "magnolia", "black_swan", "perfume_the_story_of_a_murderer", "first_man", "the_rover", "melancholia", "bringing_out_the_dead", "the_walk", "manchester_by_the_sea", "hereafter", "a_most_violent_year", "hotel_rwanda", "the_killing_of_a_sacred_deer", "dogville", "joker", "youth"]}