{
  "id": 2083,
  "title": "The Return of the Living Dead",
  "starring": [
    "Clu Gulager",
    "James Karen"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Comedy"
  ],
  "description": "When foreman Frank shows new employee Freddy a secret military experiment in a supply warehouse in Louisville, Kentucky, the two klutzes accidentally release a gas that reanimates corpses into flesh-eating zombies. As the epidemic spreads throughout the town, and the creatures satisfy their hunger in gory and outlandish ways, Frank and Freddy fight to survive with the help of their boss and a mysterious mortician.",
  "releaseYear": "1985",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qVTFBabgnWz4jZ8wOQRYZI5EITF.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 6.0,
    "ending": 8.0,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.571428571428571,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This movie is just flat out freaking stupid. It's very slow paced. And zombies don't appear until 30-40 minutes into the movie and even then it plays such a very small part of the movie since most of the film revolves around the cast trying to deciding what to do and how to deal with the zombies outside."
    },
    {
      "rating": "10",
      "text": "Simply stated: one of the most successful horror-comedies of all time.Why? Because it's very funny and genuinely scary, AT THE SAME TIME; it doesn’t simply alternate between the two like they’re mutually exclusive. Even its flaws seem utterly charming compared to most attempts at this melding of genres, and the dialogue remains eminently quotable.Not quite a flawless \"masterpiece\", perhaps, but a sentimental favourite that has aged remarkably well just the same."
    },
    {
      "rating": "5",
      "text": "With its trashy and fun attitude, this low budget horror was very entertaining. Watching it in 2022 it struggles to provide sufficient scares or laughs for a modern audience. A for effort!"
    },
    {
      "rating": "8",
      "text": "This is saying a lot too, because to me this is the only film of the five Return of the Living Dead films to be above good standard. The sequels varied in quality, with 2 and 3 being acceptable enough though with their problems and 4 (Necropolis) and 5 (Rave to the Grave) being terrible, the latter being marginally worse and being one of the worst sequels ever made. The original however is an immensely enjoyable film, with its very few flaws barely noticeable amidst the huge amount of good.It is definitely the best-looking film in the series, it is stylishly shot and lit with a wonderful ominous atmosphere, complete with atmospheric sets, above average effects and some great make-up on the zombies. There is a killer 80s soundtrack that still sounds good and haunting rather than cheesy, and instead of the outdated quality it could have had the soundtrack makes one nostalgic for the 80s. As well as a hilarious and clever script that's never forced, doesn't get bogged down in too many explanations or too much exposition, and that is very quotable (which I don't think any of the sequels achieved and it was something that 4 and 5 could only dream of doing so), and a story that seemed tired in concept but felt very fresh in execution with so many funny moments and an equal number of highly disturbing and scary ones.Return of the Living Dead is directed with adroit class and a clear fondness for the genre by Dan O' Bannon, and while some of the punk teens are annoyingly and one-dimensionally written and acted with not much spark (the sole problems with the film, and they are not that major), the leads are written very likeably and Clu Gulager, James Karen, Thom Mathews and Beverly Randolph are charming and lots of fun (all of them at least knowing what sort of film they're in), Gulager and Karen are particularly good. Don Calfa is also suitably shady. The film also cleverly and wisely makes the zombies the stars and uses them brilliantly, furthermore these zombies actually are very menacing, a real threat, do a lot more than just shuffle and plod around and are wonderfully tongue-in-cheek, exuding real personality. The twist is deliciously ironic, adding to the freshness when it easily could have been tired or anti-climactic.All in all, immensely enjoyable and the best of the series by some margin, being the only one to be completely satisfying. 8/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Crazy Scary fun this is one of best movies of 1980's that I see watch it if you like great horror movies 10+ all the way."
    },
    {
      "rating": "6",
      "text": "This is most certainly a 'so bad its good' kind of a film - borderline video nasty territory, I suppose, although for some there may not be enough gory scenes to count as such. The plotline is laughable, the performances are cheesy and the names of some of the rebellious teenagers certainly made me laugh. Its cheesy and silly and a bit creepy but I certainly wouldn't say its one of the genuinely scariest films I've ever seen. I understand why its categorised as comedy before horror - I'd assumed this would be more of a horror film, given the name and the images I'd seen. Seeing how the older men react when they realise what happened was amusing...it is amusing and pretty silly but its also really quite forgettable and so I can't really give it a higher rating than this. If you like trashy 80s films that border between comedy and horror, or/and if your keen on zombie films then this is probably worth a watch but otherwise I wouldn't bother really. Oh and...BRAINS!. Heh."
    },
    {
      "rating": "10",
      "text": "One of the best zombie films of all time.Perfect blend of comedy and horror,so many iconic moments!! Tarman forever!!!"
    },
    {
      "rating": "10",
      "text": "Great flick, watch it!!! It’s a story that has been told many times but this one is different. This movie has nudity, gore, and party vibes. 80’s gold man for real. Too many movies now a days are not as real as this. The rain is gonna happen, the killer rain man! Idk how to tell people but go dig a hole and hide. Buy a sword and hide with your dogs!!!!!!!!!!!!!!!!!!!"
    }
  ],
  "recommendations": [
    "wrong_turn",
    "evil_dead_ii",
    "the_cabin_in_the_woods",
    "scream_4",
    "malignant",
    "sinister_2",
    "the_texas_chain_saw_massacre",
    "the_evil_dead",
    "cabin_fever",
    "cooties",
    "annabelle",
    "zombieland",
    "poltergeist",
    "it_follows",
    "insidious",
    "krampus",
    "the_texas_chainsaw_massacre",
    "clown",
    "house_of_1000_corpses",
    "piranha_3dd",
    "the_conjuring_2",
    "scream_2",
    "the_possession",
    "drag_me_to_hell",
    "insidious_chapter_2"
  ]
}