{
  "id": 395,
  "title": "The Guilty",
  "starring": [
    "Jake Gyllenhaal",
    "Ethan Hawke"
  ],
  "runtime": 91,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "A demoted police officer assigned to a call dispatch desk is conflicted when he receives an emergency phone call from a kidnapped woman.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/m8aR1k35oZMOzZ1kYWUyt401mwq.jpg",
  "categories": {
    "plot": 7.5625,
    "acting": 7.6923076923076925,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is the most gripping movie I've seen in years.  The filmmaking and the lead (and only) actor is stunning.  See it before they ruin it with an American remake."
    },
    {
      "rating": "4",
      "text": "Classic tale with expected outcome. You'll guess the ending when you pass the first third of the movie. Bold directing with only one production set, but didn't reach the hoped for results."
    },
    {
      "rating": "9",
      "text": "This film is a masterpiece. This film, which takes place only in one place, does not become boring, but on the contrary becomes more interesting. The smart use of twists and good visual and audible quality increase suspense. Let's not forget about Jakob Cedergren who performs very well."
    },
    {
      "rating": "10",
      "text": "This is the best drama I've seen in years! It follows the classic Greek rule of unity in action, place, and time -- a single character and some voice actors, in a confined area, in real time, lasting a bit more than an hour. The authors mercilessly toy with your assumptions and prejudices, and have the courage to leave you a bit up in the air at the end. Not to give it all away, \"Who ya gonna call?\" is the question. The ghost of Sigmund Freud hovers over the shoulder of a singularly satisfying dramatic performance."
    },
    {
      "rating": "5",
      "text": "I was expecting good things with The Guilty based on the reviews so far, but was disappointed. It feels very much like a straight-to-TV film, with all that goes with i.e. average acting and an average story. Although not strictly a single character film, I've seen others that are far better e.g. Locke, and Buried."
    },
    {
      "rating": "7",
      "text": "Miller's skilled mannerism on verbally melting you down on your very right spot through speculative display of antics is frankly just plain impressive.Den SkyldigeMiller's skilled mannerism on verbally melting you down on your very right spot through speculative display of antics is frankly just plain impressive. It is a concept that has been overridden aplenty in the past despite of its uniqueness, but somehow Moller has seems to have decoded it. At a brisk of ninety minutes of showdown, his stage is busy and compelling enough to bedazzle you with one face. In his defense, that face is expressive. Narrowed down into a brief period of husky content, the concept is gripping enough to boost the makers for a much longer time, arguably the entire film. With an infomercial ground as such, there is very little space for the writers to weave out a genuine emotion out of such a confined place that is crowded to its full.Smartly, the writers has a backstory that they are not ready to reveal until the very last moment, they are waiting for the iron to be at its weakest stage in order to strike the hammer. And sharing that mutual thought or emotion, the only reason they took this much time is to create that arc, kudos to the writers to pull it off. Armed with such a brutal script, co-written by Moller himself alongside Albertsen, it is also a difficult subject to execute upon.Since there is not much room for Moller to satisfy the itch of using the camera work to its creativity, he has few tricks up his sleeve. And he is not a guy that quits at round one, he uses the tense environment on the script to foliate it by making Cedergren fumble on actions and words. He also uses props and surrounding of the office like shutting down the drapes, switching to a highly functional and efficient computer or table to increase the stakes.In order to depict the day to day issues that they go through with, he imputed various other cases as a phone call that sends a vital message out there. Another major aspect he uses for the audience to visualize the off screen action is by using sharp sound effects and clear cut audio on phone to makes thing easier. Aforementioned, Cedergren is the apt choice for such a role, his chiseled jawline should not be judged upfront, his vocabulary is generous, his words firm and his eyes speaks the guilt that the film has been endorsing about.Despite of various emotions he goes through the one that gets to you, is where there is a silent pitch on screen and there is nothing but him breathing is what's left between you and him. The primary reason why Moller's world is adaptive and the tale absorbing, is how humble it is, each character is dipped on their sorrow and is yet ready to shred the last inch of their life for the betterment of others, and on that beautiful note, it is hauntingly poignant. Den Skyldige is more theatrical act than it is cinematic, all the cards are not won over by it, but then not all of it were dealt."
    },
    {
      "rating": "7",
      "text": "Danish submission at the Oscars - THE GUILTY makes prolonged echo after credit rolls by defying my typical judgement that is coming from the premise only. Simple and thrilling, foreseeable revelation and deeply human, affecting story of seeking redemption out of thin air."
    },
    {
      "rating": "8",
      "text": "A story so gripping that you'd be glued to your seat. If you think you want to just play a movie in the background while you do something else, you can't do that with this movie. Thriller is written all over it. And the exclamation part is that the whole movie is inside one place. A feeling of helplessness kicks in, barging through the door and you are left wondering what is going to happen next? What will he do? Truly a must see movie."
    },
    {
      "rating": "9",
      "text": "This chilling tale of an overzealous but compassionate Copenhagen policeman assigned to emergency services desk duty while on probation serves up a taut, edge-of-your-seat psychological thriller about his valiant efforts to aid in the investigation of a possible kidnapping of a young mother by her ex-convict husband. Told almost entirely through a series of phone conversations between the officer and his colleagues, the victim and the alleged perpetrator, writer-director Gustav Moller relies on the sound of his performers' voices to carry the story, forcing viewers to use their own imaginations to visually fill in the gaps, an expert use of Hitchcock's rule if there ever were one. The result is a harrowing journey into the minds of the characters, as well as the viewers' own minds, aided by a script loaded with unexpected twists and turns. This captivating offering reaches out and grabs the audience's attention despite its simple, play-like staging, presenting a gripping story that only gets better the further along it goes. A genuine and vastly underrated cinematic knock-out."
    },
    {
      "rating": "5",
      "text": "A la manière d’un certain Searching qui se déroulait entièrement à partir d’un ordinateur, The Guilty se passe intégralement à partir d’un téléphone : c’est donc le film à distance, le télé-film !… même si on a eu droit en remontant plus loin à un certain Phone Game… bien entendu !En tout cas, ça fonctionne plutôt pas mal ici pour ce huis-clos fort intrigant qui suit le gars aux urgences téléphoniques, cette sorte de « Police Secours » comme on appelait ça dans le temps, du temps où les flics ne se faisaient pas caillasser par la racaille, bien sûr (mais gare, je m’égare, Garry, je me gare près de la gare et j’arrive).Bref, voilà le gars qui doit faire ce qu’il peut alors qu’il a au bout du fil une femme apeurée enlevée par son mari, ex-taulard violent de son état. Evidemment, ça pourrait être largement une pièce de théâtre qui se suffirait à elle-même avec un risque d’ennui plus ou moins alarmant mais contre toute attente, ça reste tout à fait intéressant.Le problème tout de même, c’est d’abord quelques détails qui peuvent chiffonner mais surtout le pathos omniprésent et de plus en plus envahissant qui nuit beaucoup à la crédibilité, d’autant que gars du téléphone a aussi son pathos à lui qui vient en remettre une couche ici et là, alors que la guimauve à deux balles déborde déjà à n’en plus pouvoir.En outre, lorsqu’on apprend le principal rebondissement (impardonnable) de l’affaire, puis plus tard la fin elle-même, on constate un côté bisounours et autoflagellatoire avec en prime une volonté de pseudo-rédemption à deux centimes par dessus le marché ! ça commence donc à faire beaucoup dans la lourdeur, quand même.En conséquence de quoi, ce film apparemment très prometteur loupe sensiblement le coche… et son sujet malgré d’indéniables bonnes idées."
    },
    {
      "rating": "6",
      "text": "in a way I must make a spoiler about the story of this film because of the way in which is narrated.This film is entirely centered on the main character: Asger Holm. The whole film is located in the same place: A police switchboard that receives emergency calls.The film never changes the scenario and everything is told with the main character through calls he is making to resolve what is initially a kidnapping, then a murder and then I'll just say a very interesting narrative twist that is conducted with a second narrative that involves the same character and that eventually gives meaning to the title and its resolution.The film is quite tense and quite entertaining. It only lasts 85 minutes and honestly considering its narrative resource it's very functional.I do recommend it."
    },
    {
      "rating": "9",
      "text": "Um dos melhores filmes de drama que vi nos últimos anos. é difícil manter a atenção do público tendo apenas um ator em cena, mas o brilhantismo do roteiro consegue superar esta barreira. Só senti um pouco a falta de alguma trilha sonora; entendo que a ideia era deixar o mais limpo possível, mas acho que não atrapalharia. Roteiro perfeito e atuações sensacionais.."
    },
    {
      "rating": "8",
      "text": "EMOCIONANTE, HACE VOLAR TU IMAGINACIÓN, SORPRENDENTE. LO MEJOR ES MUY ÁGIL Y RÁPIDA. EN MI TOP 3 DEL AÑO HASTA AHORA."
    },
    {
      "rating": "8",
      "text": "I found this quite a compelling watch, I suppose primarily because we're following the situation entirely from the viewpoint of the call handler. We can only imagine whats physically happened or happening and so there's a lot of suspense. I felt I could relate to the police officer taking the call, wanting desperately to help the lady in trouble and her kids but being hampered with limited information to pass on.I would definitely recommend this film."
    },
    {
      "rating": "10",
      "text": "Actually, the story is quite interesting and could be the base for a good film.  However, the movie itself if very boring. Very passive and 99% dark scenes."
    },
    {
      "rating": "9",
      "text": "Incredible movie. It has been a while since I've seen it. I still remember the moment I finished it and knew, just knew, that I had watched a masterpiece.An incredibly gripping, visceral experience that takes your emotions on a rollercoaster. The film gives us a mirror into the soul of the lead. All in one room. An indescribable satisfaction, this movie will stick with me. The kind of movie you wish you could forget, so as to watch it again. Simply beautiful."
    }
  ],
  "recommendations": [
    "you_were_never_really_here",
    "the_killing_of_a_sacred_deer",
    "searching",
    "the_card_counter",
    "personal_shopper",
    "ex_machina",
    "high_life",
    "the_beguiled",
    "the_good_shepherd",
    "incendies",
    "first_man",
    "beirut",
    "sicario_day_of_the_soldado",
    "thelma",
    "midnight_special",
    "sicario",
    "donnie_darko",
    "dark_waters",
    "trance",
    "a_history_of_violence",
    "patriots_day",
    "closed_circuit",
    "before_i_go_to_sleep",
    "miss_sloane",
    "21_grams"
  ]
}