{
  "id": 1024,
  "title": "The Boy Who Harnessed the Wind",
  "starring": [
    "Maxwell Simba",
    "Chiwetel Ejiofor"
  ],
  "runtime": 113,
  "genre": [
    "Drama",
    "History",
    "Family"
  ],
  "description": "Against all the odds, a thirteen year old boy in Malawi invents an unconventional way to save his family and village from famine.",
  "releaseYear": "2019",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/yOr7RxHw15MMXNxGMXSmngDqHyI.jpg",
  "categories": {
    "plot": 6.625,
    "acting": 7.083333333333333,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 7.666666666666667,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Make A Truce Or Lie.The Boy Who Harnessed The WindEjiofor's first major motion picture as a director is admirable, and just admirable, nothing beyond that. This biography has every ingredient that it should have, it breathes productive yet cliched method. It has everything you aspire and everything it ought to have, from a three part act to one dimensional characters that works as mere pawns. It is not groundbreaking in whatsoever form. Chiwetel Ejiofor is neither Bradley Cooper nor Kevin Costner while telling a story, primarily because there is no conviction in his speech. It is almost as if he doesn't believe in this tale. He craves for big dramatic antics but when it finally hits, he hides away inside a closet.Never in the film, does the filmmaker takes charge of it. Still, considering it as a debut, he has done a great work on stabilizing the film and keeping the tone persistent. The only part where he gets you for a brief period, is in its latter stages where everything crumbles down to nothing. The family and everyone we had been rooting for, gets cornered brutally with hard facts and poignant practicality of the society they live around.I would like to think it is the work of brilliant cast rather than narration. This marvelous cast exploring and guiding us through their ancient rituals and culture through a new language; for the audience, pouring all the heart there is in it. Ejiofor maybe on the lead, but he doesn't steal others thunder. He gives each character their stand alone moments to pitch in on the narration. And him balancing on the wrong side of the door, and accepting his flawed deeds, he is more powerful when he goes awry.These are the scenes to look out for, when he completely loses all his strained out and bottled up anger on his son played beautifully by Maxwell Simba, who is equally challenging to him when they strike horns on screen. Simba seems natural and probably that is why comes off as the most profound and promising among all. Aforementioned, the rift between a father and son, foliated by these cast is a delight to watch. But personally, I would lean for Ejiofor, for the rest of the act, he has to express innocence and vulnerability in its adequacy or inadequacy as a father.And he expresses that beautifully on screen. At the end of the line, if you are feeling for someone, it is for every man himself. The cast that plays the family too, gets to swing the bat, and when the mother hits her daughter as a rightful and explanatory context, there is a cathartic silence on the screen, that would be hard but overwhelming to swallow. The only thing itching in this film, is the flow of the narration, there is nothing unnecessary in here to scoff off, but a better build up to each scene would have electrified the drama to a whole new level, where it would be easy for The Boy Who Harnessed The Wind."
    },
    {
      "rating": "10",
      "text": "This was a very good and interesting film. It mainly showed about a boy who used wind to make water which in my opinion is very cool and interesting, therefore makes a very compelling film."
    },
    {
      "rating": "6",
      "text": "True stories which are lovingly made can produce positive or even inspirational films like this one. It felt a little too melodramatic at times but the beautiful cinematography and assured performances of the entire cast left a positive feeling overall.  The world would be a better place with more kids like William."
    },
    {
      "rating": "9",
      "text": "Really good movie and shows the reality of many poorer countries and how much they are dependent on agriculture sector. Emotional movie but with a good premise and actually based on real facts. Makes you think about what happenning in the world and how we need to give more attention to others not only think about ourselves or our own countries"
    },
    {
      "rating": "6",
      "text": "Inspired true story that talks about a boy in Malawi who used scarp parts to make a turbine for watering the dried topsoil and save his people from starvation. As a famous phrase says \"Necessity is the mother of invention\".This is the first movie that directed and wrote by Chiwetel Ejiofor, although it's an easy true story to direct, but it's a good start for him.Finally, it was a good movie to watch although it was slow."
    },
    {
      "rating": "8",
      "text": "La historia del triunfo sobre contra los pronósticos tiene su magia propia a pesar de ser de fórmula. Los esfuerzos de adaptar el libro en película son notables y mantienen el interés del espectador."
    },
    {
      "rating": "6",
      "text": "The boy who harnessed the wind on a film making perspective is a great stride for any director yet the story line moves so slowly that the film gets tiring. It involves lots op posing and visual tricks but not a clear and condensed plot. The film brings so many themes to the table such as cultural, environmental, government corruption, innovation, science, love, family and freindship. It is a fresh movie but is missing some crucial story building and fast paced storytelling."
    },
    {
      "rating": "7",
      "text": "75/100 This movie is good. The story is very interesting, based on a real-life story.  The acting is decent (Maxwell Simba is very good in this movie). It's kind of slow but it did not bother me much.  Oh, yeah... I almost forgot... it's a good inspirational movie."
    },
    {
      "rating": "9",
      "text": "Poignant, harrowing, and beautifully directed, \"The Boy Who Harnessed The Wind\" will have you rooting for the characters from beginning to end. JUst make sure you have your subtitles on."
    },
    {
      "rating": "8",
      "text": "I loved this movie.  It is well directed, generally good acting and fairly historically accurate. It's not a perfect film but you will leave the theater with a smile on your face. I wish more of these type's of movies were made instead of the tired, tent pole blockbusters the studios keep pushing down our throats."
    },
    {
      "rating": "8",
      "text": "Chiwetel Ejiofor's directorial debut and it's a strong start. Stuck in the fields, young William needs to find the courage to battle all the elements against him. Heavy rains followed by a dry season in a country which government does not provide enough for the lower classes of people, forcing him to work the fields so his family has enough to eat.Being a bright young man and good with technology, he soon knows that he can find a solution for the drought and help his family. The battle between William's duties and ideas is well translated. Ejiofor is a strong player as his father, yet due to this performance it is him that kind of steals the screen.It's not that the rest of the acting is bad, it's that one person stands above the rest, but it is unintentional. The photography is absolutely gorgeous and brands your eyes with the harsh thruth these people have to live with. Their goals are primal and the mistrust in technology to save them is warranted because having to build it takes away from the work needed to put in the field. The fact that they almost have to resort to praying for rain to survive is heartbraking enough.In the end, it is a story about persevering in what you're good at and following an idea that can actually help and improve people's situations in a decor that we're not used to seeing in any other Hollywood movie. Props to Netflix and Ejiofor for picking up this story and putting it on the screen."
    },
    {
      "rating": "10",
      "text": "This was a really good movie. It showed a really great view point of the African American culture."
    },
    {
      "rating": "9",
      "text": "It’s been a long time since I saw a movie that testified to the human spirit. This piece of amazing cinema, directed by the multi-talented Chiwetel Ejiofor, is full of searing heart wrenching performances. You see a father desperate to save his family, despite his inherent lack of imagination and skills. You see a mother trying to keep a brave face after a lifetime of disappointment. You see a sister struggling between her own dreams and her duty to family. And of course our real-life real-world hero, you see a young boy daring to dream big beyond his own limits and the chains of his existence. What an inspiring story of applying science and technology to improve one’s miserable existence. The solution explored in the film seems like the simplest thing, but the courage to implement it is the real story here. So many people have their destiny in their hands, and instead of being merciless under the foot of corrupt governments, they can seize their future. A must see movie based on an inspiring true story. One of my favorites this year."
    },
    {
      "rating": "8",
      "text": "This is a film with multiple emotions present - sadness, hope and frustration being the main ones. Its nice to see a film about a young individual able to make a positive impact on their community. I was particularly interested given its based on a true story. Hope can be a powerful emotion and I felt this film had just the right feel to it, to not be a corny Hollywood film that would seem too exaggerated or melodramatic - its more understated and I liked that, as it definitely felt more, what I imagine to be, realistic. The performances were all quite good and it certainly offers (pardon the pun) food for thought, given the plot. This certainly isn't to say that everything goes well - we're shown the many issues the family have to fight through, to live with and I found myself feeling worried/concerned for the family in question."
    },
    {
      "rating": "0",
      "text": "this movie is garbage i rather **** a transexual lesbian with a hairy vagina than watch this borin ass movie 0/10"
    }
  ]
}