{"id": 4636, "title": "The Uninvited", "starring": ["Emily Browning", "Arielle Kebbel"], "runtime": 87, "genre": ["Horror"], "description": "Anna returns home after spending time in a psychiatric facility following her mother's tragic death and discovers that her mother's former nurse, Rachel, has moved into their house and become engaged to her father. Soon after she learns this shocking news, Anna is visited by her mother's ghost, who warns her that Rachel has evil intentions.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1xQlzKUDLuCe3SUGIGL6K1PtldH.jpg", "categories": {"plot": 5.925925925925926, "acting": 5.888888888888889, "ending": 5.9, "soundtrack": 2.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "The movie is not a horror movie, is an interesting thriller that hooks you until the end, it won't give you fear, at most a fright, but it's still very good. The crowd likes movies much worse saying that is great. The big problem with this movie was playing guess in the face of the viewer all the time that her stepmother was bad, I can not remember if but... manipulate our thought. That thing to bet the killer, you know? The problem is that the film always pointed in the same direction, so the movie can give you a big surprise ending, which I guessed at parts, the other part that I didn't serve was really shocking... It's a great film, which suffers a lot yes, but worth being seen. I've watched this movie so many times coz I love it so much!"}, {"rating": "10", "text": "One of my favorite movies ever.  The movie really shows the revenge and sick mindedness that some people posess and the climax was the part that revealed how much a girl can alter and change the lif of everyone in the family.  A definite must see"}, {"rating": "10", "text": "Remarkable flick! Most horror movies can only grab your attention for the first 30 minutes or so and then they wear off and become predictable. Here they managed to work horror scenes into thriller perfectly. And that plot twist..."}, {"rating": "6", "text": "It had an interesting story, but a really unexpected ending."}, {"rating": "10", "text": "You think you know exactly what's going to happen but a twist in the story proves you oh-so wrong. I wasn't bored of this movie for a minute- it keeps you on your toes."}, {"rating": "8", "text": "Genuinely enjoyable film even when you guess whoo dunit. i was still impressed."}, {"rating": "5", "text": "It had an unexpected ending but other than that it was alright."}, {"rating": "9", "text": "I didn't see the end coming *at all*. The whole movie creeped me out for days afterwards."}, {"rating": "8", "text": "Ok, this one was a stand alone winner as far as twisted endings come. So well put together, that the ending was completely unforseen. It's one that gives no keys to the puzzle until the last couple minutes, and then BANG, there's the picture. I definitely want to see it again... great flick."}, {"rating": "4", "text": "Not nearly as good as the original Korean. Lacked the moodiness, creepiness, and ambiguity of the original. By making the plot clearer and simpler, it took away too much and all of the things that made the Tale of Two Sisters great. See the original."}, {"rating": "10", "text": "Surprising good movie."}, {"rating": "7", "text": "Alt-rock sweetheart Juliana Hatfield had a cool sister. You may remember the elder Hatfield; she's the one who would have taken Juliana to her first all-ages show. The Del-Fuegoes were playing. It's this same sisterly camaraderie which drove The Juliana Hatfield 3's near-hit \"My Sister\" out of alternative rock provincialism that also frees \"The Uninvited\" from the PG-13 horror film ghetto. Just back home after a stint in the mental ward, Anna's sister lightens the mood with remarks like \"better food, crazier people\" and \"while you were searching for your inner-psycho;\" remarks that only a sister could make. While Anna and her sister uncover the truth about their mother's death, \"The Uninvited\" imbues the girls' sleuthing with an appealing lightness that conveys a shared history together; a life before their mother's home-care provider(Elizabeth Banks) tore the family apart. In one scene, while they sit in the tub, we can picture their younger selves, just like old times, in cahoots; we sense their intimacy, as they plot their next move against the evil girlfriend. Even though the stakes are raised, the Nancy Drew twins can still muster up a smile if there's occasion to, like when they find Rachael's vibrator. Such a display of teen spirit is more important than all the undead children you can cram under a stove. In recent horror films such as \"The Haunting of Molly Hartley\" and \"The Unborn\", there's not a recognizable human being among them to be found. Alex(Arielle Kebbel) and especially Anna(Emily Browning), never feel like stock characters. It's the reason why this fatigued story has some giddy-up in its rote telling. Anna has Seoul."}, {"rating": "7", "text": "If you don't see it in the theater then make sure you catch it on dvd. Pretty cool flick that makes you think you know what is going on and you want to yell at the characters for doing the stupidest things and then at the end your like, ohhhh....that's what was going on! The only problem is that now I need to re-watch it so that I can see if the story holds water when you know what's going on........and I will be waiting for dvd to do that."}, {"rating": "5", "text": "Hard to follow after the strange ending."}, {"rating": "0", "text": "I kinda... well... hated the ending sooo good till the end...(i realy wanted the older sister to live) i just preaty much hated the end i mean you cant make that stuff up in your head."}, {"rating": "10", "text": "bunch of 'scary' movie cliches strung together, and hence not frightening at all... but as a movie it was fantastic! great acting by the australian girl from 'the series of unfortunate events', and a surprising (at least to me it was...) twist at the end. very underrated movie, with scores from the stupid 'professional' movie critics that are much lower than it deserves."}, {"rating": "9", "text": "The first genuinely creepy at times movie ive seen in a long time. its somewhat predictable but is very interesting throughout. MUUUUCH better than The Unborn which bored me to tears."}, {"rating": "4", "text": "Not much of a twist ending, too trying hard to impress the horror fans."}, {"rating": "5", "text": "Overall the movie was pretty fun to watch it kept me entertained throughout the whole movie. The ending I didn't like to much, I was expecting a better ending. So that backfired a lot for my rating. It was just way to much of a twist ending."}, {"rating": "7", "text": "What is it about this film that I really liked? Was it Emily Browning, whose portrayal was focused and memorizing playing a girl who has been released out of a mental hospital as she was traumatized by the death of her mother? Was it Elizabeth Banks, who played the stepmother that surprisingly charms and seduces the screen? Was it Christopher Young, who compose a score so beautifully for a horror movie?  It certainly wasn't the rubbish special effects and child actors. But The Uninvited leaves you satisfied and never goes blatantly over the top.  Some have said the ending was predictable, I didn't feel that at all."}, {"rating": "3", "text": "This movie was... ok? I didnt really like it. Everybody pitched in decent performances but this is trying so hard to be horror but it fails epicly. It shouldve been left as a murder mystery/thriller. It shoved in supernatural aspects but it came across as mediocre and gimmicky. Then when the twist came at the end, it makes no sense. Once i hit the twist I asked myself \"what was the point of watching this then?\" The twist was awful, but it gets points for being unexpected."}, {"rating": "8", "text": "I am so glad I purchased this film.\r The Uninvited made me jump a few times, and totally didn't see the twist at the end coming, I hadn't read about the twist beforehand, and am glad I didn't.\r The two girls looked great in this film, especially Arielle.\r I watched it a second time with my mum and her partner, and knowing how the story progressed while the other two were trying to work it all out, made me appreciate it more.\r Definitely one of the best horror films I've seen, although not the scariest."}, {"rating": "9", "text": "\"The Uninvited\" is a really amazingly great horror-thriller, this is what I call dramatically disturbingly scary movie, every second is enjoyable, from the beginning tell the end, perfect!"}, {"rating": "5", "text": "You know, the story starts to beat you and you will create multiple opportunities for all, and it turns out that, in the end, is the most annoying of them."}, {"rating": "5", "text": "The Uninvited is interesting and suspenseful, but is brought down deep because of It's useless plot twists, predictable content, and a disappointing conclusion."}, {"rating": "6", "text": "Actually the plot twist fulfills its role, but in addition, the script was very weak and with a little lazy performances."}, {"rating": "2", "text": "This movie is dull, not scary and does not keep me interested in the film. The poster is just a propaganda and it should not be believed. This is a terrible horror film."}, {"rating": "6", "text": "The Uninvited plays with your expectations. For the majority of the movie it gives off the appearance of being another generic, predictable horror movie, but in the final minutes, the plot twist that is revealed makes everything make sense. With decent acting performances, good cinematography and an interesting story, the movie definitely is a pleasant surprise. If you've seen the original Korean movie you might not like this remake, but if not, you should give it a try. Who knows, you might actually enjoy it."}, {"rating": "5", "text": "This is the remake of my favorite Asian horror film, A Tale of Two Sisters, so I think I set my sights high for this movie. I've gotta say that I'm a little disappointed. The movie is about this girl that comes home from a mental hospital, her dad gets a new psycho girlfriend after his wife dies, and there's a ghost in the house. The supernatural parts of this were shoehorned in just to make it more appealing to American audiences, and the scares were mostly generic PG-13 jump scares with bad CGI ghost children. In the original movie, there was a ghost in the house, but it wasn't the main focus of the movie. Back to the crazy girlfriend, her story is what makes this movie interesting. There are a few good twists in the movie regarding her, and I wish that the entire movie was about the girlfriend rather than some random, unexplained ghost in the house because the movie's most intense scenes involved her. There's also this twist at the end that's really good if you haven't seen A Tale of Two Sisters. The Uninvited has a decently interesting story and a good ending, but it's mostly boring and not very scary."}, {"rating": "2", "text": "A movie cannot gain credit for an ending alone. For an hour and twenty, this movie is so dull. I like a slow-moving film, but seriously,, there is nothing to sink your teeth into. The main character is boring, the setting is boring; and the soundtrack is just awful. Any tension dissipates as soon anything happens, because what you get is some laughably corny, supposedly scary, thing. It fails to make the most of the otherwise good directing, by the Guards, and the already plot from the original film."}, {"rating": "10", "text": "Absolutely loved this movie. The plot is fairly predictable at times, yes, but unless you've got a stick up your ass - which most people seem to these days - the plot twist at the end of the movie makes it worthwhile. I'd love to watch something similar in the near future."}, {"rating": "4", "text": "Everyone is excited about plot twist ending, but really, this movie does not set it up well at all in my opinion.Yes, you don't expect it but it still leaves questions unanswered and plot holes unfilled. The movie isn't even scary!"}, {"rating": "5", "text": "It is always one thing that is one my mind after every time I see this film; it is just pointless. Performances are servicable, scares are somewhat short, but the sense of mystery tied up to a decent atmosphere makes this movie worth awhile, if you have absolutley nothing else better to do."}, {"rating": "6", "text": "This movie seems to have been inspired by a Korean production called \"A Tale of Two Sisters\", but as I did not see this film I do not know exactly if it is a remake or if it only removed some elements, inspiring itself to create a new story. This film revolves around a young woman who returns home after a season in a psychiatric clinic, motivated by the early and unexpected death of her mother. At home, however, she finds her sister and her father living with another woman, who was once their mother's nurse. From here develops a thriller and a family drama where the human psyche is linked magisterial to the supernatural.The script is very good, full of twists that enrich and heighten the drama, grabbing the public until the end, absolutely unexpected, despite the subliminal messages that have prepared it since the beginning, and the public ignored. The cast is headed by David Strathairn, the father, Emily Browning, the young Anna, Arielle Kebbel, the eldest daughter, Alex, and Elizabeth Banks, the other woman. Browning is flawless in her role, a complex and disturbed character who shows itself to be suggestible and gives some signs of a strong Oedipus complex. In fact, this young actress almost managed to monopolize the film. The filming mostly takes place in a secluded house, beautiful, on the seashore, and its isolation not only makes the place almost paradisiacal but also accentuates the feeling of solitude and vulnerability that sometimes feels.In short, this light-hearted horror thriller is probably one of the most stylish and well-built I've seen lately. He plays poker with the public, hides the game until the end and manages to escape from the clichés, play with them, surprise us and frighten us without resorting to the usual recipes of CGI, gore, shocking images etc."}, {"rating": "9", "text": "Girl and her sister believe their father's new girlfriend killed their mother in a fire but it turns out that the girl did it and her sister has actually been dead the whole time, too."}, {"rating": "4", "text": "Looked fantastic except occasional CGI shots looking a touch goofy. Sound was good too but could have been a little more surrounding. I had no idea that this was a remake of something I had seen until I watched the extras. A Tale of Two Sisters (2003) was the original and almost unrecognisable. It didn't have a lot of horror or scare moments but there were one or two. The story seemed to have problems of logic but they all made sense at the end. Enjoyable with a solid story and twist I didn't guess. Shame that there are some plot holes that aren’t actually holes but you don’t realise this until the end. Shame there wasn’t just a little more horror."}], "recommendations": ["the_boy", "marrowbone", "orphan", "the_skeleton_key", "i_see_you", "case_39", "happy_death_day", "mama", "oculus", "house_at_the_end_of_the_street", "dark_skies", "the_forest", "dead_silence", "summer_of_84", "would_you_rather", "insidious_chapter_3", "happy_death_day_2u", "insidious_chapter_2", "annabelle_creation", "the_haunting_in_connecticut", "the_woman_in_black_2_angel_of_death", "jessabelle", "you_should_have_left", "brightburn", "the_autopsy_of_jane_doe"]}