{
  "id": 4279,
  "title": "The Man in the Iron Mask",
  "starring": [
    "Leonardo DiCaprio",
    "Jeremy Irons"
  ],
  "runtime": 132,
  "genre": [
    "Adventure",
    "Action",
    "Drama"
  ],
  "description": "Years have passed since the Three Musketeers, Aramis, Athos and Porthos, have fought together with their friend, D'Artagnan. But with the tyrannical King Louis using his power to wreak havoc in the kingdom while his twin brother, Philippe, remains imprisoned, the Musketeers reunite to abduct Louis and replace him with Philippe.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zHE9yRURvA7DyhYtQxkGTfE1Ywi.jpg",
  "categories": {
    "plot": 5.666666666666667,
    "acting": 6.083333333333333,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 3.5,
    "familyFriendly": 4.833333333333333,
    "funny": 4.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "In this film, based on a novel of Alexandre Dumas, king's musketeers seek to replace the ruthless French king for a twin brother of him, that people don't know and that has been kept secret by state reasons. Directed by Randall Wallace, which also provides the script, has the participation of Leonardo DiCaprio, Jeremy Irons, John Malkovich, Gerard Depardieu and Gabriel Byrne.The script is good and makes an interesting adaptation of the novel. Initially, I had few expectations about the film due to Randall Wallace, who was involved in the disaster that was \"Braveheart\". In fact, this film is low in historical accuracy, but Dumas also invented quite in his own novel. The recreation of the court environments, costumes and sets, on the other hand, seemed to me more in line with historical reality and also fill the expectations of the audience, showing the splendor of the Sun King's court. Maybe Wallace has taken some positive lessons from \"Braveheart\" after all. The action scenes were interesting, and the swashbuckler style sword fighting's deserves a positive note. Leo DiCaprio was at the highest level and showed great talent, having to make two characters deeply antagonistic. Depardieu was not bad but not surprised except in humor. His character is the funniest and the actor was perfectly able to play with it and make him funnier. John Malkovich, Gabriel Byrne and Jeremy Irons incarnated the deepest and psychologically demanding roles, having made an inspired performance and showing great ability to collaborate with each other. After all, they are all veterans and established actors, they don't have to prove anything to anyone. The soundtrack accompanied the film faithfully and fulfilled her role with style.Not being, nor by far, one of the best movies I know about this historical period, this film doesn't frustrate the expectations of the public and give him what he wants: fencing, old-fashioned chivalry, dances, the luxury of Ancient Regime and a story that combines, in the right measure, history, romance, drama and action."
    },
    {
      "rating": "4",
      "text": "The Man in the Iron Mask is forgettable and quite dull to watch. The cinematography and the costumes were great, but DiCaprio was no King Louis and it sucks saying that because I know Leo is better than this."
    },
    {
      "rating": "6",
      "text": "Dumb family friendly fun at some of it's finest. A very predictable script with some fun moments and good performances (minus the actress who plays Christine, who is just dreadful) The Man in the Iron Mask isn't a terrible way to kill 2 hours, but I am sure you could find some better alternatives."
    },
    {
      "rating": "6",
      "text": "A solid movie that has its moments but is not mind blowing. The great cast saves it in my eyes. The gold standard for all movie adaptions of „The Man with the Iron Mask“ is the 1977 movie with Richard Chamberlain for me. While I see this not as failure it never reaches the highs of the better adaptations. While based on the third book of “The three Musketeers” from Alexandre Dumas the man with the iron mask is based on a real life prisoner. There was a mysterious man who was imprisoned for decades wearing a mask during Louis XIV reign without anyone of his wardens knowing his identity. There is a lot of prove for this and much effort and money was put into securing this man. A lot of various theories about this mans identity exists. However the iron mask is probably fake as a velvet mask is described. Back to the review. The story is set during the reign of Louis XIV who is called the Sun King. He is the poster child for a monarch and has his place in history. While he lives a live of extravagance he is also slowly bankrupting the country. There is huge poverty, starvation and riots. From the 4 musketeers only D’Artagnan is remaining as captain but he is also disillusioned of the king. When he saved the king from an assassination attempt the musketeers unite again as there is more to it than it seems and a secret of the past will be a key. This is the set up for the movie. Like I already said it is not the first movie adaptation of the story. The story works as it is a classic but it is nowhere near the gold standard. The cast saves this movie from a lower rating. With Jeremy Irons, John Malkovich, Leonardo Di Caprio, Gabriel Byrne and Gerard Depardieu you cant go wrong. I enjoyed their arcs and interactions more than the actual story. The other roles also have good actors and I say the cast is the best asset of the movie. The visuals are really good. I like the costumes, sets and style. They deliver the atmosphere and era. Overall this is a movie you can watch and will forget it existed. Only by accident I remembered it by reading about another topic. It is not a misfire but also nothing to write home about. I give a 6/10 because of the great cast and their performance."
    },
    {
      "rating": "5",
      "text": "the actual story is so good that it really should be remade properly. this version, however, is horrifically written & directed, and absent 3 great decisions, terribly casted. Jeremy Irons' marvelous voice carries the movie. Gerard Depardieu and Gabriel Byrne more than carry their weight as well. John Malkovich, however, inspires laughter, and Leonardo, if it wasn't for having talent acting with his eyes, would do the same. There was no consistency with pronunciation of words, or the accent being sought. Even Hugh Laurie ends up looking like a community college drama student in this. the actual story, the sense of dignity in the musketeers' aspirations, and some very pretty shots of ''the french countryside'' keep this watchable, and ultimately, a fun 2 hours. but i would absolutely LOVE to see this remade with an actually professional script and thoughtful casting choices."
    },
    {
      "rating": "1",
      "text": "Je savais bien que c’était une daube ou je le subodorais fortement du moins… mais comme tout le monde, j’ai été appâté par la distribution vraiment très agréable et très judicieusement choisie : Di Caprio, Irons, Depardieu, Byrne, Malkovich, Parillaud, Sarsgaard… même la jolie Godrêche qui joue la godiche bien apprêtée se révèle charmante. C’est la foire aux beaux costumes et à la belle reconstitution, l’histoire est toute tracée (Alexandre Dumas, bon sang !) et il suffit de suivre le fil…Mais non, Randall Wallace malgré sa caméra fluide, presque guindée, démoule hélas une… daube ! J’étais plein de bonnes résolutions et j’avais coché la case « bon public » dans un recoin de ma cervelle peu habituée à de telles pratiques. Mais impossible de tenir jusqu’au bout, j’ai les neurones qui fument devant des dialogues aussi imbéciles, notre Depardieu national qui enchaîne pitrerie sur pitrerie, la musique gnangnan à dormir debout et les graves lenteurs d’un scénario dont même une tortue ne voudrait pas.Malgré la distribution, tout y est très compassé et maladroit, peu crédible et disons-le, carrément ridicule. C’est l’idée sans doute que se fait Hollywood des intrigues imaginées par Dumas à la Cour du Royaume de France : pédantes et grotesques. Un tel bling-bling partout, on se croirait à Las Vegas !"
    },
    {
      "rating": "3",
      "text": "Three stars just because of the Beauties Parillaud and Godrèche: The main reason of my rating, instead of \"0\" ! And then three stars also to Director Wallace that allowed Byrne-Malkowich-Irons-Depardieu to spend a nice and funny holiday in France, not to mention the \"double Leo\", the most ludicrous of them all (multiplied for 2 actually). That said, nice cinematography and stage costumes. Better let French deal with Alexandre Dumas..."
    },
    {
      "rating": "5",
      "text": "This is a historical costume drama with elements of action adventure and it covers themes including secrets, the aristocracy and abuse of power.It's a film I remember coming out in cinemas in the late 1990s but I avoided watching it at that time as I really didn't like the lead actor, Leonardo DiCaprio. I wouldn't say I'm his number 1 fan, by any means, even nowadays but I have enjoyed some period dramas in the recent past and I thought I'd give this a go with it being available via Netflix. I found the start a bit slow and slightly off putting in as much as just about all the characters seemed particularly snobby and unlikeable. There is a clear case of one upmanship present but I stuck with it. From early on, I found myself comparing it to the more recent Pirates of the Caribbean films - I suppose they also have bright and colourful settings and fancy costumes, being (of course) set in the past.This film definitely does have a strong sense of morality about it, with the main plot being quite depressing in a way but I liked some of the plot developments. The King is regarded, or, at least to me anyway, came across as something of a dictator and I think its fair to say that this isn't something solely confined to history books. The film seemed quite atmospheric and immersive, with some beautiful settings and fancy costumes shown - it obviously wasn't the cheapest of films to make and it didn't have anything like the feel of a low budget film, so thats a good thing. How accurate an adaptation it is to the original novels by Alexandre Dumas, I don't know.I found the main character, King Louis, to seem very naive and self important. I was quite taken aback by his response to some of the things he's told by advisors and others around him. He certainly isn't the most likeable of characters, as I say. I suppose there was an element of wanting to watch to see what became of him, if his people turned against him and so on, so in a sense maybe I did want to watch on to see what happened but equally I'd say that he wasn't the most appealing of people, neither did I feel emotionally concerned about him - if anything I was annoyed that he was so arrogant and disregarded important information and I hoped to see him learn the error of his ways. Musically speaking, the film features quite a sombre classical score, with heavy emphasis on strings. Having said that, when the plot pace gathers speed, it becomes more rousing and added to a sense of excitement present at that time.As I say, cast wise, I'm not usually that keen on Leonardo DiCaprio, who plays the main character, King Louis, although in this instance I thought he was well cast in some regards, as I do tend to presume him to be a rather smug type of a guy but thats maybe beside the point(?!). His somewhat thick American accent bothered me a bit, given the film isn't meant to be set in America but I suppose thats to be expected and perhaps thats better than if he were to have attempted an unconvincing French accent(?). As a character, he is quite cunning, quick witted and challenging at times. He is also a very determined and somewhat noble person, which DiCaprio depicts well. DiCaprio aside, the film features a surprising number of other big names, cast wise, some of which include Jeremy Irons as Aramis, John Malkovitch as Athos, Gerard Depardieu as Porthos (the 3 Musketeers), plus Gabriel Byrne as D'Artgnan. As well as this, Hugh Laurie appears as one of the kings advisors. One of the Musketeers also had a strong American accent, which I found distracting, although I did get a bit muddled about who was who, though I imagine it was Athos, being played by John Malkovich. In some scenes, it seemed almost as if it was a stage play with the relevant cast members looking the part but just not sounding right.Somewhat surprisingly, there was an amusing scene, in which a dark comedy aspect came in to play but I won't provide spoilers by going in to any details. The main story seems so sombre that perhaps that was needed to lighten things up a little bit, if but briefly.I felt that this film went on a bit too long and it could have done with having a fair bit of it taken out. At just over two hours and ten minutes long, its certainly not the shortest of films and at times its almost painful viewing, seeing how King Louis speaks to his ladies, how he regards himself. Having said that, it made me all the more keen to see things work out favourably for his brother.Content wise, the film features some moderately strong language, sex references and partial nudity, plus some moderate violence, involving swords and knives. The film carries a 12 rating to reflect this.This is most certainly not the best period drama, or costume drama, I've seen, although it would be a bit much to say that its awful - I'm sure it does appeal to some people but I didn't think a great deal of it overall."
    }
  ]
}