{"id": 2783, "title": "The Outpost", "starring": ["Scott Eastwood", "Caleb Landry Jones"], "runtime": 123, "genre": ["War", "Drama", "History", "Action"], "description": "A small unit of U.S. soldiers, alone at the remote Combat Outpost Keating, located deep in the valley of three mountains in Afghanistan, battles to defend against an overwhelming force of Taliban fighters in a coordinated attack. The Battle of Kamdesh, as it was known, was the bloodiest American engagement of the Afghan War in 2009 and Bravo Troop 3-61 CAV became one of the most decorated units of the 19-year conflict.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/hPkqY2EMqWUnFEoedukilIUieVG.jpg", "categories": {"plot": 9.333333333333334, "acting": 6.666666666666667, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 10.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Nothing spectacular, but features some creative and gritty battle sequences, and pays tribute to the fallen heroes."}, {"rating": "9", "text": "The Outpost is based on true events that happened around one of the most northern US military camps in Afghanistan. The camp was poorly placed and wasn't safe to defend, causing many soldiers to lose their life. And eventually, the series of errors lead to a catastrophe.The movie is expertly shot, using long uninterrupted shots instead of many cut frames. Explosions, military gear, wounds and tactics look realistic. The viewer gets to know the characters through dialogue and events, making a connection with these men as they are put in harms way. An impressive movie! I give it a 9/10."}, {"rating": "2", "text": "An objectively bad movie, bad writing, bad directing, the actors did the most of what they were given, this is a B movie made into a D movie by sheer laziness.  Skip it."}, {"rating": "7", "text": "+Excellent cast+Decent action sequences+Strong soundscape-Generic war movie feel-Eratic pacingOutpost was an enjoyable thrill ride with all the usual tropes of the genre. Lacks innovation in such a heavily saturated genre. Worth a look if you're a fan of war movies."}, {"rating": "8", "text": "True story, excellent photography, good editing, I never really thought Orlando Bloom was cool until this, he always seemed like kind of a panzy."}, {"rating": "9", "text": "A fantastic and absolutely tense movie, enjoyable from start to finish. The characters all feel real, and it make the gunfights all feel just as real. 93/100"}, {"rating": "6", "text": "Entertaining, well done, better than average and yet it never seems like you're seeing something that feels fresh or new.While it's true that this isn't necessarily a problem considering the things it does well, frankly I have spent a while without watching a film about the US military that feels like more than just a film of its time."}, {"rating": "0", "text": "Awful propaganda.  Looks like they made it more liberal than these flag-waving patriots films tend to be, that's new."}, {"rating": "10", "text": "As a soldier in the United States Army that works in the building right next to 3-61 I can’t begin to explain the importance of this film to the new real story war movie genre. We are in a time now that the war on terror is 20 years long and still going. And this film can hit us closer to the vest because it’s our sons and daughters that are involved and can be involved in the same war you’re watching on film. It was shot with such authenticity of the crude deployment humor and brotherhood along with the seriousness of battle that it has to be one of the best war films ever shot. (Even if I’m slightly biased.)"}, {"rating": "3", "text": "Extremely on the nose and basic plot. Corniest dialogue in a long time. Don’t waste your money paying to rent this."}], "recommendations": ["12_strong", "midway", "red_tails", "13_hours_the_secret_soldiers_of_benghazi", "jarhead", "dunkirk", "anthropoid", "greyhound", "sand_castle", "battle_los_angeles", "pearl_harbor", "the_kingdom", "mortal_engines", "the_hurt_locker", "lone_survivor", "blackhat", "captive_state", "the_purge_election_year", "alien_outpost", "the_matrix_reloaded", "the_matrix_revolutions", "sicario_day_of_the_soldado", "the_1517_to_paris", "deepwater_horizon", "zero_dark_thirty"]}