{
  "id": 1332,
  "title": "The Mask",
  "starring": [
    "Jim Carrey",
    "Cameron Diaz"
  ],
  "runtime": 101,
  "genre": [
    "Romance",
    "Comedy",
    "Crime",
    "Fantasy"
  ],
  "description": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
  "releaseYear": "1994",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xbbXp9px4o8Oe7IbGd0yIbla8mZ.jpg",
  "categories": {
    "plot": 8.9,
    "acting": 8.153846153846153,
    "ending": 5.666666666666667,
    "soundtrack": 10.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 6.793103448275862,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Truly one of Carrey's greatest films. He is amazing and his true comical side shines in this. Him, along with the very attractive Cameron Diaz make this a film you can watch over and over again without it losing it's comic value."
    },
    {
      "rating": "10",
      "text": "now thats what I wanna see since I was a little child back at the early 90s. awesome entertainment, great visuals, and radical comedy."
    },
    {
      "rating": "10",
      "text": "My favourite Jim Carrey movie of all time. The Mask tells the tale of Stanley Ipkiss (Jim Carrey), the typical nice guy who, unfortunately, always finishes last. He then finds a mythical mask and when he puts it on, he is transformed into a love-lorn, confident, zoot-suited, green faced maniac who performs extraordinary feats, all obviously influenced by cartoons. This film is filled with such a number of iconic scenes (\"The Mask and Tina dancing in Club Congo Bongo\", \"The Mask and the cops having a full out dancing session\") and is packed to the brim with briilliant references and gags. The truly best jokes occur when Jim Carrey is The Mask. The film isn't just full of comedy or of cartoon gags, theres also character progression, as the more Stanley is the Mask persona, the more confident he becomes when he's himself, especially when he stands up to his spoilt heir of a boss. The beginning of when Stanley first realises his power he declares he could do the dreamed thing and be a superhero, but rather does the human thing: he uses the powers to solve his problems. He gets revenge on the rip-off car repairmen by shoving huge car exhaust pipes up their asses, he uses his Mask persona to woo Cameron Diaz (come on men, who of us wouldn't?) and robs a bank (the last one was more of a heat of the moment thing) Stanleys dog, Milo, is definately the best dog I have seen on TV and film. He manages to follow his kidnapped owner to the police station, even helping him to escape, he manages to escape from a cop car when the Detective cannot and even wears the mask at one point to help his owner best the gangsters. By the end of the film, you'll want a dog just like Milo. Detective Kellerman is a great antagonist for Stanley, investigating into the Mask. He's the kind of antagonist who manages to be a serious character and, whilst being serious, manages to make the audience laugh (with the help of dimwitted partner Doyle) The effects really hold up well nowadays, not looking cheap or too computer generated. The Masked Milo looks a tad on the cheap side, but you'll get over it. The Mask is a fun film which takes it's influences from cartoons and is not afraid to show that off. Even if you're not a Jim Carrey fan, you must admit, there's no one more perfect for this role than Jim himself. Truly Sssssmokin'"
    },
    {
      "rating": "7",
      "text": "The Mask is an explosively fun and hilarious film filled with cheesy and comical scenes that you just can't help laughing at.  \"Tell Scarlet I DO give a damn!\""
    },
    {
      "rating": "8",
      "text": "This film, in my opinion, really captures everything that is great about Jim Carrey: from a down-on-his-luck guy to a fun maniac. This is easily one of his best films."
    },
    {
      "rating": "8",
      "text": "In order to have a good Mask movie, you must have Jim Carrey and it must not blow hard. Just look at Son of the Mask. Don't trust the users on that movie. Only trust the users on this one."
    },
    {
      "rating": "7",
      "text": "It's utterly ridiculous and has an outrageous script, yet Jim Carrey as the unpredictable and zany masked hero makes the film exciting to watch as he constantly manages to reel out the laughs."
    },
    {
      "rating": "8",
      "text": "This is definitely one of Jim Carrey's best comedies... maybe even movies! The cartoony fight scenes are hilarious, as are all the jokes in this movie. A great way to introduce Cameron Diaz into Hollywood. Would definitely recommend to someone."
    },
    {
      "rating": "8",
      "text": "¿How many things may happen when a meek finds the mystical mask of Loki, the Asgardian God? Too much. He becomes a wild thing capable of the impossible. Not quite faith to original comic but the homages to Tex Avery cartoons makes it worth. For know why Jim Carrey became a phenomenon in the not distant 90s."
    },
    {
      "rating": "8",
      "text": "This film is one of Jim Carrey's best. I don't really know what else to say because everything good about this movie has already been said. But yeah, great Carrey movie."
    },
    {
      "rating": "7",
      "text": "Typical 90s comedy that is both brilliant and ok but bad in small parts I enjoyed it."
    },
    {
      "rating": "8",
      "text": "I watched this movie again, and I still do not believe that they were able to make such an action-packed and fantastic movie in those years. It is a very beautiful, fun and attractive movie.‌‌ I love it"
    },
    {
      "rating": "10",
      "text": "This is without doubt one of Jim Carreys best movies.Jim performs in the way only he can, I consider this one of my all time favourite movies, and I could watch it over and over and never get bored of it.Cameron Diaz looks incredible in this movie, probably the best she's ever looked in her career, she is quite litterally 'Smokin' watch her first scene in the bank, and you'll know what I mean!"
    },
    {
      "rating": "7",
      "text": "\"The Mask\" is very childesh in a general term despite it's elite CGI. BUT. It's Jim Carrey's half real, half animated acting that saves the movie."
    },
    {
      "rating": "10",
      "text": "This is my all-time favourite movie. It's witty, it's fun and contains what is undoubtedly Jim Carrey's best performance. I honestly don't think anyone could do the role better than he could. Overall, a fantastic film for fans of looney tunes and Jim Carrey."
    },
    {
      "rating": "6",
      "text": "The Mask is good movie on a small level, it's entertaining, it's relatively funny, and it introduces us to Cameron Diaz. It is certainly not a must-see, great movie, but just simply OK?"
    },
    {
      "rating": "6",
      "text": "The Mask is a outright children's classic. Grotesque, funny and full of color it's guaranteed to send kids into a Loki fueled frenzy. For adults, The Mask makes for a nostalgic, sporadically funny but ultimately flawed movie. Love that dog, though!"
    },
    {
      "rating": "8",
      "text": "Well, here goes a new terrible actor, in a grand new movie, full of fun, action and terrific visual effects to enjoy the whole duration. The Mask should be another classic of all the times."
    },
    {
      "rating": "7",
      "text": "What kind of super hero is he? half the movie he spends his time trolling the police/gangsters. Still i found it hilarious when i was a kid. It is a good movie to watch for entertainment value."
    },
    {
      "rating": "6",
      "text": "With Jim Carrey in the titular role, I figured that \"The Mask\" would have been a riot. Turns out that it's only mildly entertaining. Jim Carrey is the best part of this movie, but that's not really saying much, for it's nowhere near his best role. The comedy is hit or miss at best, and the plot is extremely predictable. However, I did find the visuals to be surprisingly impressive for a early 90's movie. \"The Mask\" isn't bad it's just. . .decent, and worth seeing. . . .for free."
    },
    {
      "rating": "6",
      "text": "The actors are really good and like always Jim Carrey's overacting is pretty awesome.The scenario is interesting but  some of the jokes were not that funny and the movie was far too childish."
    },
    {
      "rating": "7",
      "text": "The Mask is a Jim Carrey classic. The film is so ridiculous and it really fits the personality that Jim Carrey became known for. I love the visual effects in this movie and they still hold up today even if some of the humour has expired. The Mask is one of the films that broke Jim Carrey and co-star Cameron Diaz into the mainstream."
    },
    {
      "rating": "5",
      "text": "despite the highly creative fun that goes on i consider this movie a five because it just gets a five....perhaps its just annoying to see carry hit on someone throughout....if your looking for a surprise this is the one for you."
    },
    {
      "rating": "10",
      "text": "I truly enjoy this film. It isn't the best movie ever or anything like that but it is still a hugely enjoyable comedy in my opinion. And I also think that along with Liar Liar and The Truman Show that The Mask is one of Jim Carrey's better movies. Here Carrey's role is split, his mild mannered banker and a wild, crazy superhero. Either way, he excels in this film, he is completely in his element and completely unpredictable. He is helped by the special effects, which are utterly amazing, a truly imaginative and sophisticated visual style that worked so well here. Here because of the special effects, Carrey moves around at whirlwind speed, pops his eyeballs and swaps parts of his anatomy for his cartoon equivalents and you know what it is jolly funny. There are so many good scenes though my favourite was the Bugs Bunny-style Cuban Pete routine. Also superb are the script, which is as funny and as imaginative as the film itself and the suitably tongue in cheek music score. Not to mention the adorable pet dog, underrated Peter Reigert, Peter Greene's Dorian and gorgeous Cameron Diaz. Overall, hugely enjoyable, funny and imaginative, so much better than its sequel Son of the Mask which I disliked so much I try to forget it exists. 10/10 Bethany Cox"
    },
    {
      "rating": "6",
      "text": "i want him here tomorrow, alive..The MaskThe Mask brings out everything alive from the cartoon and the comics with the help of Jim Carrey who is in tremendous form on his perfect comic timing."
    },
    {
      "rating": "9",
      "text": "Giving it a first full watch since I was a kid, it truly takes you back to a classic 90's feel. Jim Carrey is outstanding in his acting, plot is straight forward and enjoyable. Movie makes me want to own a replica of The Mask. Will re-watch it from time to time!"
    },
    {
      "rating": "1",
      "text": "Jim Carrey, Cameron Diaz, Amy Yasbeck, Peter Greene and a whole bunch of other actors star in this comedy slash romance but it's more on the comedy side if anything. Stanley Ipkiss played by Jim Carrey finds a mask and finds out it has extraordinary powers and turns him into a goofy greenfaced lunatic who tries to be funny and clever and he falls in love with Cameron Diaz's character. Peter Greene plays the villain and he has his badguy crew of gang who work for him. The Mask isn't that funny, it's mildly amusing but looking at it now it's rather trash and personally I found Ace Ventura: Pet Detective funnier and sure Jim Carrey has his eyeballs coming out of his head, his tongue rolling out and does some silly things and has fun in The Mask. Others find it funny and some is pretty funny but too cheesy for my liking. Only part of the movie I liked was Jim Carrey and Cameron Diaz at the end of the movie kissing and obviously Milo the dog. The rest sucks."
    },
    {
      "rating": "10",
      "text": "Best movie about lads..........................................................and quote me on that"
    },
    {
      "rating": "10",
      "text": "The perfect role for Carrey. I love this film. 'p.a.r.t.Y? BECAUSE I GOTTA!' DAMN."
    },
    {
      "rating": "10",
      "text": "I have seen nearly all of Jim Carrey's films and I can tell you that this is one of my all-time favorites. The situations he gets into are absolutely hilarious. Cameron Diaz is incredible in her film debut. I own the DVD, and, everytime I watch it, it makes me long for the days before Carey actually thought he could pull off a dramatic role. Jim, stick to what you're good at... comedy."
    },
    {
      "rating": "7",
      "text": "You know Jim Carrey will always put on a great show. Good but I've seen better I have to admit."
    },
    {
      "rating": "7",
      "text": "For what it was when it came out, it was great.\r But, even in the 90s this movie was perhaps a bit too cartoony for its own good and could have used a bit more overall depth.\r Overall:\rThe mask looks and feels like one long old school slapstick cartoon. It does have a few serious moments that suit the movie very well, but they are few and overshadowed by the comedy.\r Still, a fun and entertaining movie, a shame it wasn't more."
    },
    {
      "rating": "8",
      "text": "One of my favourites from the 90's and a Jim Carrey classic! It's not his best but its certainly up there and was a film that really made a name for himself. Concept is a little silly but Carrey makes it work so well with his witty Comedy, and it had a rather clever storyline. Cameron Diaz also shines in her film debut as Tina, and the two have great chemistry on screen. Overall it's a classic 90's Comedy and one I would be surprised that you haven't already seen!"
    },
    {
      "rating": "10",
      "text": "love this movie, Jim Carrey and Cameron Diaz,This movie is a classic and I won't ruin the plot for anyone that has not seen it so I'll keep spoilers out of this review. the characters are instantly relate-able and the acting in the movie is amazing, the sets and location are fantastic, they really makes you feel like your in the situation, along with the characters, the music is also vary well put together, and the right music was edited into the right places for the movie too like in clubs swank music plays, when Stanley gets in trouble the music gets tense. music is vary well put together the movie easily has a spot in my top 100 best movies of the 90s... Thank you Jim Carrey for putting all the effort into this brilliant classic, I miss seeing movies like this one."
    },
    {
      "rating": "8",
      "text": "Divertentissima commedia che ha per protagonista il mitico Jim Carrey nei panni di Stanley Ipkiss, un timido bancario bistrattato da tutti che viene in possesso di una misteriosa maschera in grado di trasformarlo in un ironico, sfacciato e spassoso personaggio dalla faccia verde dotato di incredibili poteri da cartone animato. Un film ben fatto che diverte grazie all'ironia del personaggio protagonista e che mette in risalto l'interessante questione sulla doppia natura degli esseri umani. Bravissimi nelle loro interpretazioni sia Jim Carrey che la bellissima Cameron Diaz."
    },
    {
      "rating": "10",
      "text": "How can't you love The Mask it's funny, bit perveted but in a good way, it have amazing songs, awesome special effects despite of it's age and it can cheer me up no matter how bad my day has been I always laugh my ass off when I see it"
    },
    {
      "rating": "6",
      "text": "I never thought it could happen. Jim Carrey (star of Ace Ventura: Pet Detective) upstaged -- and not once, but twice! While it's true that The Mask is another vehicle for the rubber-featured modern-day amalgamation of Jerry Lewis and the Three Stooges, this time around Carrey has some competition, and there are a number of scenes where he ends up playing second fiddle.\r The special effects are, for the most part, rather impressive, but they're as frequently guilty of overwhelming the star's performance as complimenting it. Nevertheless, if you think Carrey has an expressive face, wait 'til you see him with the mask on. Eyes pop out and jaws drop -- literally. ILM goes to work with their own version of live-action animation whenever anyone dons the mask. Good costumes and make-up serve only to enhance the computer-generated visuals.\r And, even as the audience's attention is arrested by the work of the effects wizards, there's still room for a canine scene-stealer. Milo (whose real name is Max) is the perfect foil for Carrey's goofiness and -- yes -- there are occasions where his animal antics divert the spotlight away from his two-legged co-star.\r Carrey, meanwhile, is playing a split role: mild-mannered Stanley Ipkiss and his superhuman alter-ego, the Mask. Stanley is a shy, unassuming man who works in a bank and lives with Milo in a small apartment. One day, following a terrible bout with Murphy's Law, Stanley finds a curious-looking mask floating amidst some debris in a river. Later, at home, when he finally gets around to trying the mask on, Stanley learns that this isn't some archeological curiosity. It has power - the power to transform. From the moment the mask clings to his skin and his face turns green, Stanley's personality undergoes a radical shift. Insecurity is replaced by flamboyance. Physically, there seems to be little that he can't do, from twisting his body into a pretzel to taking a bullet in the chest or forming a tommy gun out of a balloon.\r While wearing the mask, Stanley makes a comment about becoming a superhero, but he's really interested in one thing: Tina Carlyle (Cameron Diaz), a voluptuous nightclub singer who works for a local gangster (Peter Greene). Following a bank robbery (to finance his wooing), the Mask discovers that a cop, Lt. Mitch Kellaway (Peter Riegert), is hot on his trail. And it's not that difficult a trail to follow. After all, how many lime-faced bandits are there who move like the Warner Brothers cartoon Tasmanian Devil?\r Carrey plays Stanley with surprising restraint, giving his zaniness free reign only when the mask is on. In some ways, it's a Clark Kent/Superman thing. Stanley and the Mask might share the same body, but they're very different. One is a typical nice guy who finishes last. The other is Robin Williams' genie from Aladdin come to life (Carrey provides dozens of whirlwind impersonations).\r As a comedy, The Mask is genial, but its recycled plot is far too thin for the film to succeed as either an adventure or a spoof. \"Comic book\" and \"cartoon\" are two terms that come to mind for describing this movie. Neither is intended to be pejorative, but each conjures certain apt images.\r For me, Ace Ventura was too much concentrated Jim Carrey. In The Mask, the forceful personality is diluted. The star is mostly-subdued except during those off-the-wall bursts of energy that accompany the appearance of the Mask. The film is entertaining enough -- in a light, undemanding sort of way -- but more than the combined efforts of Carrey, ILM, and Max are demanded to camouflage the seams and holes still apparent in this production."
    },
    {
      "rating": "7",
      "text": "Porque Jim Carrey es tan genial en estos papeles es una pregunta que siempre me hago."
    },
    {
      "rating": "9",
      "text": "The Mask is a pretty cool and fun movie. I like the casting of Jim Carrey, along with the other characters and the unique premise the movie provides. If you haven't seen it before I would recommend checking it out."
    },
    {
      "rating": "9",
      "text": "You will laugh your false teeth out with this charming, cartoonish comedy. It's almost everything you'd expect out of a Jim Carrey Movie- That's a good thing!"
    },
    {
      "rating": "8",
      "text": "Mask is one of the best comedies of the 90s and in the filmography of Jim Carrey. Great light comedy for the evening. Great comedy of the absurd. Of course, most scenes look hypertrophied, but this is normal for the genre"
    },
    {
      "rating": "9",
      "text": "The mask has to be one of the funniest and most quotable movies going, Jim Carrey is amazing when he's playing The Mask and Stanley Ipkiss it makes the movie even more funnier than it already is. Finally, the rest of the cast do pretty well for what they're given and this movie alone is always fun to come back to. Overall, you need to watch this movie if you haven't, it's honestly one of the most funniest and most quotable movies going, it's honestly worth the watch."
    },
    {
      "rating": "8",
      "text": "Not as good as I remember, still an amusing watch regardless.It's been many, many years since I last watched 'The Mask', hence why I hadn't had it logged on here before now, and while it isn't as funny or as quotable as I thought it would be (I remember really liking it as a kid), there is still enough in there that I got much entertainment from.Jim Carrey's performance is superb, without him you'd have a very cringe and ultimately disappointing flick. Interesting to note that he did this, 'Ace Ventura: Pet Detective' and 'Dumb and Dumber' (which I gotta see at some point!) all in 1994 - quite the year! Peter Greene and Peter Riegert are also involved, though it's very much the debuting Cameron Diaz that is the best of the rest behind Carrey.Apparently this had a sequel released in 2005, 'Son of the Mask'. On paper it should be awful, so therefore I gotta go check it out!"
    },
    {
      "rating": "8",
      "text": "Another one of my favorites. Jim Carey finds this mask and discovers its secret powers. Turned a loser into a winner pretty much. Very hilarious movie."
    },
    {
      "rating": "9",
      "text": "Funny as hell! Jim Carrey was an excellent choice for the Mask himself and his character in general is so funny! He would fit so well in a Cartoon!!"
    }
  ],
  "recommendations": [
    "ace_ventura_pet_detective",
    "ace_ventura_when_nature_calls",
    "the_pink_panther",
    "austin_powers_international_man_of_mystery",
    "austin_powers_the_spy_who_shagged_me",
    "austin_powers_in_goldmember",
    "how_the_grinch_stole_christmas",
    "get_smart",
    "bruce_almighty",
    "the_longest_yard",
    "grudge_match",
    "batman_forever",
    "horrible_bosses",
    "spy",
    "liar_liar",
    "masterminds",
    "dodgeball_a_true_underdog_story",
    "red",
    "role_models",
    "red_2",
    "horrible_bosses_2",
    "beetlejuice",
    "paul",
    "ride_along_2",
    "due_date"
  ]
}