{
  "id": 257,
  "title": "The Conjuring",
  "starring": [
    "Patrick Wilson",
    "Vera Farmiga"
  ],
  "runtime": 112,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wVYREutTvI2tmxr6ujrHT704wGF.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 6.551724137931035,
    "ending": 7.769230769230769,
    "soundtrack": 7.5,
    "cinematography": 8.2,
    "familyFriendly": 3.0,
    "funny": 8.666666666666666,
    "action": 8.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "My girlfriend loves horror movies and has dragged me to a lot of stinkers, but this movie was not one of them. Possibly the best horror movie I have seen to date! Here are the top reasons why I enjoyed this movie so much\r 1. crapped my pants\r2. surprised my girlfriend didn't leave hand prints because she was gripping my arm so tightly\r3. the \"brave\" guys beside me made lame jokes to lighten the mood (I assume they didn't like being so scared)\r4. the plot was very good for a horror movie and did I mention I crapped my pants?\r if you like horror go see this movie! wear a diaper..."
    },
    {
      "rating": "4",
      "text": "If you're looking for a standard horror flick to watch on a night in then this will do the job well enough but for the most part it's the same cliche horror film that's been done to death a hundred times over. There aren't many original ideas to be found here and most of the 'scary' moments are just jack in the box jumps.\rThere are quite a few characters in it (a family of seven, two ghostbusters, a police sheriff and some guy with cameras) and none of them have that much depth or personality to the point where most of the cast seem unnecessary. Also some of the acting is pretty bad, particularly the father of the family. When the child actors are upstaging the adults then that's not a good sign.\rOne thing that I keep seeing in horror films is pianos! Why does every haunted house have a piano? And why to ghosts always feel the need to play it? I want to see a horror film where they find a dusty old Gibson in the basement and in the middle of the night everyone is woken up by the opening riff to sweet child of mine. It might not be scary at least it would be something that hasn't bee done before unlike pretty much everything in this film.\rOverall this might be a good time sink if you're bored at home but if you're a horror fan then this isn't going to stay with you for long."
    },
    {
      "rating": "8",
      "text": "People in my cinema were laughing just to feel comfortable, this movie will scare you for good, probably one of the best horror movies in the last decade, a must watch for every horror fan out there."
    },
    {
      "rating": "8",
      "text": "For the first time in a long time The Conjuring gives horror movies a chance to be good again. Everything from the score, to the cinematography, to a well though out story came together brilliantly to provide for a truly horrifying film."
    },
    {
      "rating": "8",
      "text": "Estamos ante, lo que parece, la mejor película de terror del año. En verdad, en mucho tiempo yo no veía una película de terror de esta magnitud, sustos bien logrados por todas partes, escenas perturbadoras, un verdadero argumento basado en hechos reales, y lo más importante, sin caer en lo absurdo. La verdad esta y otras películas como la saga de \"Saw\", \"Insidious\", la película \"Dead Silence\" y muchas más por venir, convierten a James Wan en uno de los pioneros del horror moderno entre Rob Zombie y Sam Raimi. Lástima que se este interesando en otro tipo de películas (Fast & Furious 7), pero ya esperaremos a otra más de sus brillantes películas de terror. Me inclino hacia este proyecto; un sólido 8."
    },
    {
      "rating": "9",
      "text": "The Conjuring thrills with its countless scares and tense atmosphere. Solid acting and great cinematography only excels this as a thoroughly enjoyable (and old-school) horror flick."
    },
    {
      "rating": "8",
      "text": "Why did people like this, how? This movie was cliche after cliche, everything in this movie was ripped from other (better) movies, and everything major that happened was so easy to see coming that it was PAINFUL."
    },
    {
      "rating": "9",
      "text": "\"The Conjuring\" is one of the better supernatural films to come out in the last few years. It's scary, intriguing, and highly enjoyable. The movie has a very 70's feel to it, especially the cinematography, and the story is pretty simple, yet it flows very well. Patrick Wilson and Vera Farmiga are great together as the Warrens. Really, the entire cast was great. This is a great movie to watch and get scared with your friends. I highly recommend it."
    },
    {
      "rating": "9",
      "text": "I don't have to write a long review on this. I can sum it up in a few words: the most terrifying film I've ever seen since the Exorcist (1973). I love horror movies, been watching them by myself since I was 4 and I have to say, do not see this alone like I did. The acting is good, the special effects (when necessary) were good, the storyline was fantastic, & the movie came together well."
    },
    {
      "rating": "8",
      "text": "I haven't liked a horror movie in a long time and I'm pleased to say that that period is over. The scares were calculated and chilling. The mood was consistent and did not let up. The acting was OK. It felt like I was watching a historical movie. It was cleverly shot. But I have a problem with the ending. It could have been more pessimistic. But given that the director wanted to make something more than just a horror flick, that is understandable. Do not miss this."
    },
    {
      "rating": "7",
      "text": "Finally a horror movie that's actually decent!  No, it's not anywhere near perfect.  There are still some lines and scenes that are laughable at best.  But there are some other ones that actually manage to creep you out.  I wouldn't call the movie terrifying, but a couple of the characters actually have some personality and depth to them, and the direction is also pretty competent most of the time.  This helped me to become mildly, but not drastically, engaged with the story.  It really isn't original at all, but you can tell that some thought went into its creation, and that gives it a noticeable advantage on its genre peers.  I still wouldn't expect anything come Oscar season though.  It's efficiently entertaining, but it's nothing masterful."
    },
    {
      "rating": "7",
      "text": "el conjuro, Expediente Warren y entre otros  nombres es lo que revoluciona el terror hacia algo mejor, esta pelicula esta bien realizada con unos 20 millones bien aprovechados y con un toque de tipico y unico terror"
    },
    {
      "rating": "5",
      "text": "It has its moments,But overall its dull and like they tried to hard to make it scary which ruined it in my opinion,Its more gross and disturbing than thrilling or scary,definitely no hair raising moments for me.The worst Paranormal activity was still better than this movie."
    },
    {
      "rating": "10",
      "text": "One of the rare films I found truly scary and truly captivating.  Well worth the watch for horror lovers.  Not sure why reviews have to be fifty characters long..."
    },
    {
      "rating": "7",
      "text": "The conjuring has a positive opening catching attention of the viewers. The Sound mixing and Sound track is amazing although it is a bit exaggerated. Overall the movie is good and gives viewers a good scare."
    },
    {
      "rating": "8",
      "text": "Before Christianity and Latin existed how did exorcists exorcise? A lingering question after watching The Conjuring, a film by James Wan.\r The age of Scary Movie-esque franchises has turned seeing dead people and being haunted by and evil spirits into mundanely comic events. Sexy vampires, farcical zombies, and ridiculous inside jokes about the world’s end begone! The Conjuring is a big horror film that is actually good and scary. Finally!\r Still, Director Wan uses all the old horror tricks to build up the suspense: creeping suggestive crescendos in the score, brief uncertain glimpses of unknown beings, and of course, lots of loud and unexpected jolts.\r The film opens as the Perron family arrives at their new home, a large fixer-upper in the Rhode Island countryside. As the family starts their life in the new house the haunting becomes apparent. Clocks stop, doors slam, people scream. Terror drives the family to huddle up in the living room where they spend their nights sleeping together. It makes the spirits calmer, they say.\r A little too conveniently, famous demonologists Ed and Lorraine Warren just so happen to be speaking nearby. Mrs. Perron persuades the Warrens to come inspect the house. Lorrain Warren, a kind of clairvoyant, senses real trouble in the Perron house immediately. Using cameras, Holy magic, and Latin scriptures, the fight begins to save not only the house from destruction, but the people inside it as well."
    },
    {
      "rating": "10",
      "text": "The Conjuring is quite possibly the best horror movie of the past 5 or so years. I've been watching horror movies for 15+ years now, and nothing scared me quite as bad as this one. Too scary to move to the edge of your seat, but too intense to sit back. The only other option was to curl up in my seat while being bombarded with a fantastic story and scare tactics beyond the average possession tale. It's too unique of a horror movie to miss."
    },
    {
      "rating": "8",
      "text": "Its true that The Conjuring plays on the same tried story of the haunted house, but it, unlike its predecessors plays it right. The films director, Wan, manages to take an overly developed storyline and streamline it into a frightfully believable tale that is shot in a way that removes the predicable scare tactics that plague the horror genre and replace it with well thought schemes and unpredictably eerie scenarios. A film worth watching, even for those averse to the genre."
    },
    {
      "rating": "10",
      "text": "I'm an avid horror fan. Lately I've been thinking there isn't much that can scare me (though Sinister got under my skin). I appreciate James Wan's films, I love the first Saw, Insidious was a damn good modern ghost story, but like all reviews have stated for it, the movie kinda loses it's momentum in the final act.\r The Conjuring is better, scarier, and more tense than Insidious. I'm gonna go out on a limb and say it's one of the best horror movies of the last 5 or 10 years. It goes back to the classic rule of horror film making, never show the bad guy fully to your audience. Plus this movie knows suspense, I tell you, I almost threw a water bottle at the screen from sheer terror once the scare finally happened. There are no fake jump scares, the movie earned an R rating without any blood, sex, or profanity, it's all from the terror that this movie builds upon.\r Not only is the movie scary, but as a film itself, it's almost a masterpiece. The script, acting, direction, style, tone, etc were all simply top notch. Wan's camera-work here is by far his best out of any of his movies. The choice to set the movie in the 70s was a stroke of genius as it feels so authentic and all the more real. If this story were set in the present, it simply wouldn't be as a effective or scary. The 70s style film making, costuming, and hair styling are a great throwback to likes of The Exorcist & The Amityville Horror.\r Though there are a few (extremely minor) flaws, such are length, repetitiveness, and a resolution that happens way too fast. I don't care, every horror movie (or movie in general) has it's flaws. There will never be a perfect horror movie, if there is one, I haven't seen it yet. But all I know is James Wan's The Conjuring is one of the best horror movies I've seen in a long time, and it's been a really long time that a movie has scared me this badly.\r 10/10 Don't miss this one, it's an amazing theater viewing experience."
    },
    {
      "rating": "10",
      "text": "This movie is definitely one of the best horror movies I have seen so far. I was a bit skeptical at first of this movie, but once it started, I could not keep my eyes off the screen. It was definitely a better movie to see than \"My Little Pony: Equestria Girls\". I can't wait for James Wan's next installment in the Warren paranormal investigators saga."
    },
    {
      "rating": "1",
      "text": "Haunted dolls, levitating, Attack of Blind Pigeons, cheesy \"dialogue\", slamming doors, crucifixes, basement-as-center of activity...zzzzzz.....But, don't worry, in the end we're all brought back to flowers and unicorns and bubble-teas by a mother's love and god. Awwww.\r This is galactically lame, desperate, and overdone with cheap jump-thrills. Just another horror movie that reminds us that The Exorcist is the gold standard which has yet to be beat."
    },
    {
      "rating": "10",
      "text": "This movie is my best horror movie. The story is based on true events wich makes the movie even more scary especially if it's well played. It has a lot of moments where you think there will be jump scare but in the end it's nothing and thats what makes it so scary, there are a few jump scares yes but not always. Just in the right moments."
    },
    {
      "rating": "7",
      "text": "The same old generic story of a family moving into a house that is apparently haunted by a demon wasn't anything new. But it was pretty effective in scares. I was surprisingly satisfied with this film. The characters were fairly developed and the acting was great especially the kids. This movie offered scares and unsettling. I definitely recommend this film for those looking for horrifying thrill."
    },
    {
      "rating": "10",
      "text": "This movie is awesome! Simple and well done. The camera work is impressive and the dialogue gives us the necessary familiarity with the characters. The tension scenes are very authentic even in the old-school scares. About the story, even if it has already worked in other films, it's well presented in many different ways. You'll like and will jump from your chair."
    },
    {
      "rating": "8",
      "text": "The Conjuring is a modern horror classic. The set up and execution of the scares is just flawless. You will care about the characters, and you will buy into the setting of the movie. It's very well written too, with some nice character development and dialog. This is not one to be missed."
    },
    {
      "rating": "4",
      "text": "I'm feeling as though I'm in a rather small majority on this one. The Conjuring was the horror film equivalent to Prometheus: concerning all of its high expectations. To put it simply, horror films are all about the set up and the release (or the \"pay-off\"), and I felt neither. In my opinion, having felt the lack of the release was due in part to the weak or unclear set up. I don't consider myself a writer, although I believe I could be capable of writing a screenplay that could get away with murder.\rSpeaking of murder, how many deaths occurred in the span of this film? Well, there are certainly various instances of implied murders, but other than that we only see the family’s dog and a scene that contains flocks upon flocks of birds that fall (or fly rather) to their death. All of the slayings surrounding any humans had taken occurrence in the past in regard to the history leading up to the family’s arrival. Whether a story is illustrated through a movie, a play, or a book (or any other medium), death is to be used as a plot device: a means to give a strong punctuation to the overall storyline. So what is death? Death is the looming threat that will eventually get the better of us, if we’re ready for it or if we’re not. The element of death can be represented symbolically as a warning, as significance, or the consequence of there being one.\rIf there isn’t a single main character that doesn’t die in a HORROR film amid the first and second act (even up to the third act), then the film instinctively looses its power, and one’s attentiveness along with it. At the conclusion of the film, one might ask, “So, what did we gain from this?” Well, we relearned that at the end of any successful exorcism, the film would automatically instill a peaceful and a settling mood to the environment. That type of mood is over portrayed in the conclusion, and doesn’t benefit the film at all; it felt forced. We also learned that “jump scares” are still being used as a gimmick these days (yes, there are “jump scares” in this) only to lift audience’s eyelids of slumber. And lastly, if there are occurrences of paranormal activity at any time shown in a horror film, it better had be at night (or in this case, at 3:07 am precisely).\rWhich now brings myself to the time to talk about the aspects of the film that I did enjoy, and thought that the film did justice to. The characters in the film are likeable enough to care for (to an extent) the cinematography is some of the best work I’ve seen in most recent years, the first shot and the last shot felt like the two highest points of visual stimulation, the score for the film was nice and booming (although in scene of the exorcism, the film decides to splice it along side with a character searching for someone in another section of the house, which lacks the tension in the score when it shifts back to him). There were a couple of Amityville Horror references that provided some sparks.  And the exorcism scene itself was creative and inventive with the environment of which it was set.\rHowever, the film did not deliver any emotional connection between my associates and I. We found ourselves pointing out (and chuckling about) where the next big scare would be, and we weren’t all that far off for the majority of them. There was only one time that the film caught me off guard. It dealt with the character Lorraine Warren, who was standing outside by the lake (or river) when her husband comes from behind her when, she spots a corpse hanging from the tree behind him, which gave the film some points. The reason the sequence worked as well as it did was due to the time it occurred: MIDDAY. Which is perfect in any horror film to strive for, because it will not be anticipated.\rI went into this film the same way I go into any film these days, which is to go into it without any knowledge of the plot, characters or anything. It is simply the trailers these days that can give away crucial large chucks of the film; thus I avoid them at all costs (though I wouldn’t have felt any more letdown than if I had). A lessor film would have added a cheap jump scare to the ending shot; this one does not, which it earns some more points for that as well.\rOverall, I thought there were various elements of the film that were rather rewarding to its plot. Though the film as a whole, felt somewhat lousy in its execution. Now there are some critics out there that are calling it something like “This generation’s The Exorcist!” It’s a statement that sounds a bit hefty for a film that might not age as well as the classic. In the end, if one were to compare the two, they will find a clear and strong difference between the two films: AUTHENTIC HORROR. Can you guess which one?"
    },
    {
      "rating": "7",
      "text": "\"The Conjuring\" with its based on a real story premise, attempts to revive the often over-saturated demonic horror genre market and inspire new frights. The film establishes its tale in a very classical horror formula, slow, tantalizing build up with loud (sometimes annoying) string music that teases one's nerves as the audience watch a family being terrorized by demonic presence(s). The story is also decidedly classic and certainly has been done before but rather than wasting time on the 'what' (ie: what is haunting them), the film does a good job where the majority of the story-line is focused on the 'how' (how to solve the problem). It is here where the slow/sluggish build up gives way to a torrent of thrills. Although most of the cinematic shots were impressive and the overall production design and atmosphere does its job splendidly, the film did not generate the frights that I was expecting. Too often, the frights came in the standard horror formula where people are already expecting something to appear. I also watched the film in a full theatre with my fellow cinema-goers ooing and ahhing at every corner which totally dis-immersed my experience and definitely altered my experience for the worse. This is definitely one film where I would advise dodging the crowded opening weekend and instead watching it with a group of friends in a empty theater for a far more immerse experience.\r Otherwise, expect a formula-driven fright film enveloped in classic horror sequence of the past."
    },
    {
      "rating": "10",
      "text": "What a great film. I'm giving it a 10 because of what it accomplishes. It is a straight-up old school haunted house flick, pulling no new tricks. And the plot is a very simple uphill ramp of gradually building suspense until all heck breaks loose. Yet it does everything well and somehow pulls it off, and manages to feel fresh and compelling. What a surprise!\r It's simply an honest attempt at telling a scary story within conventional and very familiar bounds. It does so wonderfully, beautifully, and quite artfully. What's not to like? The acting is superb, and each scene is thoughtfully prepared and executed expertly. Good acting, good directing, good scripting, good cinematography, good score.\r Horror movies rarely get better than this."
    },
    {
      "rating": "8",
      "text": "For a movie with no body count, it was genuinely creepy. Best possession film since the Exorcist. Still deserved its R rating, good pacing and good progression. Only real problem is it felt like a Christian horror movie at times. But not to an extent where it was un watchable."
    },
    {
      "rating": "8",
      "text": "\"The Conjuring\" is an enjoyable, spine-chilling paranormal saga directed by James Wan (\"Saw\", \"Insidious\"), and it has already been given the green light by New Line Cinema for a sequel before the first installment has even hit theaters on July 19. A welcome throwback to classic 1970s chillers, with spectacular production design work, a well-constructed script, impressive atmospheric set pieces, and rounded out with terrific performances from Patrick Wilson and Vera Farmiga. The film primarily utilizes the old bag of tricks for scares very effectively, creating a terrifying atmosphere of bloodless scaremongering.\r Set in the 1970s, \"The Conjuring\" tells the story of husband-and-wife demonologists Ed Warren (Patrick Wilson), and Lorraine Warren (Vera Farmiga), who are best known for their case involving the Amityville Horror, and are now investigating the secluded Harrisville, Rhode Island home of Carolyn and Roger Perron (Lili Taylor and Ron Livingston.) The family has recently moved into the house with their five daughters (Shanley Caswell, Hayley McFarland, Joey King, Mackenzie Foy and Kyla Deaver), and have begun experiencing a series of unexplained occurrences. Lorraine immediately detects that something isn't right in the house, and the pair conclude that the Perron's home is possessed by multiple demons, with their initial investigation revealing that the trouble may have begun as far back as the Salem Witch trials. Meanwhile, the Warren's presence enrages whatever is within the house, and the supernatural activity escalates to terrifying levels.\r James Wan and his group of frequent collaborators are clearly well in sync for \"The Conjuring.\" The film nods its head to everything from \"The Exorcist\" (1973) to \"The Amityville Horror\" (1979), while developing an atmosphere of trepidation, with well-timed scares that will keep viewers on the edge. All the ingredients of a standard paranormal story are present: a haunted and secluded house, a peaceful family being terrorized, strange noises in the night  and its all-familiar territory. However, the film is so finely tuned, it comes across as a respectable homage to the genre. It's reassuring to see a genre film that contains a compelling story and has interesting characters, rather than serving up a number of teenagers ready to be tortured.\r \"The Conjuring\" is primarily intended as a haunted-house attraction, a ride through a hall of nerve-racking horrors. Wan's direction is perfectly paced, pulling off some properly scary set pieces (a game of 'hide and clap'; some business involving a mirror and a music box), and slowly ratcheting up the tension. The frightening escalation of events gives a permanent tension in a feature film that is certainly predictable, but smoothly conducted to satisfaction."
    },
    {
      "rating": "9",
      "text": "Like the old-school horror flicks that inspired it, The Conjuring is more of an exercise in palpable tension and mounting dread than outright terror. It is a slow, quiet movie that definitely earns every scare it throws at you. Those suffering heart conditions might want to avoid this one."
    },
    {
      "rating": "3",
      "text": "I don't understand why people liked this movie. It did not have a single scary moment. The acting was bland and generic, to say the least. The Conjuring is an example of the horror genre is on 21st century life support. What a waste of money!"
    },
    {
      "rating": "9",
      "text": "It's a classic. From start to finish, this was true beautiful filmmaking. Two months ago I saw a tv spot of this and I thought this could be really good. I was beyond right. This movie is the Inception of horror movies. It was wonderfully put together and everything seemed to just simply work. You're right in there. Many a movies just present a visual that's symbolic through the writing, directing and acting for it's lack of care or passion or vision and just presenting an obviously gimmick picture that's only trying to make cash to give the producers a bigger ego. Now the rare films that actually have passion, care and a vision aren't entirely made to sell tickets. More of, to entertain and satisfy audiences to make the producers feel good to give them a raw feeling, other than the fake feeling of ego boosts, which is utter joy for their inspiring love for film. That's what The Conjuring is all about. It has all the passion, all the care, and all the vision to truly become a great piece of work. It draws you in, and presents a very classic and truly inspiring horror vision that easily got me going with the main titles, which is a small thing but in film the small things are the most important things and become big things in delivering a full, complete impact of a visual. From there on forward, we get phenomenal writing and acting and directing that I would say should be Oscar-worthy. Characters that are relatable and likeable and face empathetic conflicts. It draws you in and makes you believe wants happening on the screen is legit actually happening in front of you. I felt it was real.\r The directing of this film was passionate, the writing was unnerving, and the acting was high-caliber and every element aspect of filmmaking fed off each other to make an enthralling harmony of film magic. I wish every film had this. I mean I want to give this a 10/10, I'm not overly-critical, but giving this a 10 would mean comparing it to Citizen Kane or The Godfather. However this is so damn good, I'm giving it a deserving 9/10. In dire specifics, it'd be a 9.2 which is real high. But this is a horror masterpiece.\r It ends brilliantly. People misinterpret and misunderstand the fact that horror movies don't necessarily have to contain depressing themes. Isn't that kinda what film-noir is? But this stinger believes in delivering a movie, with a horror genre, with an original theme. I mean there's emotion in this. There's a flashback sequence towards the climax that brings a forgotten light in the visual that sustained darkness for the primary portion of the final act that gave me hope, care, and true feeling for these characters, and ultimately belief and inspiration for horror movies and in movies once again. I love it when movies have that and do that, and whenever they do, I'm inspired and obsessed. In this case, possessed.\r The movie felt so genuine, so real, and so authentic that (since it's based on a true story) when they showed the actual people who experienced this, I was truly haunted than I already was.  They had to put the stinger in there to make it even more real than it was. Oh, man I couldn't sleep.\r This is a true horror movie and as a summer movie, it's the most inspiring and well put together since Inception. I mean it. The ending was a signature of pure artistry. Like Inception. I don't care if you hate horror movies and/or the stereotype has brainwashed your opinion, GO SEE THIS NOW!!!!!"
    },
    {
      "rating": "7",
      "text": "The Conjuring has genuinely terrifying set piece moments, is decently shot and can by no means be described as a bad film. However, it falls into the trap that oh so many horrors before it has done by relying on excessive loud noise and hackneyed clichés to maintain attention throughout.\r For these reasons, it cannot be placed in the upper echelons of horror movie classics, but it does deserve a solid place in the second tier."
    },
    {
      "rating": "9",
      "text": "I saw this movie last weekend and, whoa!, scary scary. I know it's based on a true story but Patrick Wilson and Vera Farmiga are awesome! It takes the movie a little while to really pick up. They lay the ground work for the first hour but what comes later is well worth the wait. Definitely one I'll purchase for my Halloween and late nite collection."
    },
    {
      "rating": "8",
      "text": "Now this is a scary movie. It may not be an original movie, but it succeeds at scary the living crap out of people! Overall, The horror genre is back! Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "9",
      "text": "James Wan is a master. I haven't watched many films that he has made but the conjuring is just epic. The first hour it just builds the whole thing and in the second hour true horror comes in the screen. From the first scene, I knew that this movie is going to make me  bricks. And of course I was correct. Something really impressive was the actors and the cinematography of the film. Lili Taylor and Vera Farmiga were stunning. As for the cinematography I doubt that there is going to be a better film with that cinematography. Though it has no originality it gives to a horror fan what really wanted for many years. I don't think that there is going to be such a good horror movie in years. Thumbs up! 9,5/10"
    },
    {
      "rating": "9",
      "text": "Before saying that The Conjuring is terrifying as hell, it is extremely disturbing and manipulative. With its own twist and story it delivers a thrilling ride through hell, this is one of the best movies of 2013, more off, it is scariest than The Evil Dead remake. On the other hand, I felt like there is no haunted house horror movie those days, that can work without the usual, predictable and kind of annoying cliches! For Example: birds are breaking their nicks by hitting the house! Didn't we see it in The Last Exorcism Part II and before it Dark Skies? Doors slamming, like always, and thanks for the franchise that is known for doors slamming, and it worked and terrified us every time \"Paranormal Activity\" Can't James wan makes the door break after slamming, or just doesn't slam the door at all? I think he can do just way to more better, I actually blame him much because it was based on true story but not EVENTS, even though it isn't right if you have the accurate events. It is sometimes predictable and references much past horror movies ex: Poltergeist, Insidious, Paranormal Activity, Sinister, Drag me to hell and much more. But does make The Conjuring even close of being bad? Absolutely not! The cast is terrific, Vera Farmiga is hot and the plot is a through back to the '70s, it is not a bad movie, but not great one either but awfully close of being my favourite movie of 2013, if it wasn't for the cliches, it would have gotten a ten, but unfortunately, those cliches exist and I hate them, although some of them work, but not all of them. The Conjuring is the best horror movie 2013 and one of my favorite horror movies. I would highly recommend seeing it in theaters, IF YOU DARE!"
    },
    {
      "rating": "10",
      "text": "With minimal CGI, minimal jump scares, and awesome acting, James Wan's \"The Conjuring\" stands out as an awesome, original film. It's the kind of scary that gets under your skin and makes you feel very uncomfortable. Such a fun time in the movie theatre! Go watch this movie and have as much fun as I did!"
    },
    {
      "rating": "10",
      "text": "I watched The Conjuring Movie and saw that it was based on a true story that happened in Harrisville Rhode Island, so I decided to go check out the old farm house. http://www.youtube.com/watch?v=okCr61sYpsI"
    },
    {
      "rating": "8",
      "text": "Wow!  This was scary.  I normally don't dig horror films because I'm hard to scare but James Wan (director of \"Saw\") crafted a horror film about ghosts that felt real and authentic--and this is coming from a guy who doesn't even believe in the supernatural!  He perfectly used light, shadow and sound to make chilling sequences and the pace Wan brought to the film made scares that got better and more frightening as the film progressed.  Not to mention, terrific performances all around from the entire cast."
    },
    {
      "rating": "8",
      "text": "If you despise dolls but love horror films, watch this one.\rA lot of the time I wasn't on the edge of my seat, but sometimes it just gets you.\rFairly good in terms of most horrors, falls a bit short on occasion and the constant jump scares is a bit repetitive, but a good watch\rI recommend"
    },
    {
      "rating": "9",
      "text": "Very spooky movie.Good actor's game,atmosphere of terror everywher.Very nice film.this movie really scare you to crap his pants.I don't know what else to write just see this movie."
    },
    {
      "rating": "10",
      "text": "Despite having a fairly standard haunted house horror plot, James Wan has created a fun, scary and beautiful looking movie. In The Conjuring, Wan uses skills learnt directing his previous films and old school 70’s horror tricks to amp up the tension and ensure a sleepless night."
    },
    {
      "rating": "1",
      "text": "Why is this movie getting awesome scores? What happened in this movie that hasn't happened in every other horror movie? Random substories that popped up are never resolved, and the main plot never really goes anywhere outside the obvious foreshadowing it sets up. Most scenes involve a lot of characters staring at something that barely moved, followed by a jump scare that quickly cuts to a \"safe\" scene. Boring horror movie that'll eventually play every weekend on tv."
    },
    {
      "rating": "7",
      "text": "Going into this movie I was expecting something that would have me on the edge of my seat, but to be honest this movie was nothing more than any other \"horror film\" nothing but a few jump scares. It wasn't terrible, just way to predictable."
    },
    {
      "rating": "5",
      "text": "Not sure how this got an R rating...there was no bad language...no one ever really feels like something terrible is going to happen to them, there are few good creepy scenes and a couple of good jump scares using scary faces, the atmosphere is good but I was waiting for this film to really kick in."
    },
    {
      "rating": "9",
      "text": "It is definitely the best horror of the decade!!! Full package  great acting, super immersive action, interesting plot! The only week point is that the ending happened very rapidly! Great horror movie"
    },
    {
      "rating": "1",
      "text": "Stupid ass movie title! NOTHING is CONJURED in this movie!! Stupid writers and the director should go read a dictionary before slapping the title onto this movie! They also recycle the frickin UV-light **** again."
    },
    {
      "rating": "7",
      "text": "I never watched the trailers because I knew that were some scary scenes from the movie that was used in the trailers, I wanted to cover my eyes and to experience the scary ride without being spoiled by the trailers. The biggest question that I had when I was about to watch the movie was that would it be scary enough for me to walk away? There were scenes that gave me chills and sometimes made me back away but it wasn't super scary that I hoped it could have been. The movie has good acting and a decent story to make it a chilling story. The thing that really made my skin crawl was that this was based on a true story and the movie did a good job of making that story, into a movie that will appeal to all horror fans. Of course it still has a lot of characters that had short development and some that didn't really have one. Some scenes that could have been removed and that it just made the movie a bit dragging. The movie was still a decent horror movie and I am going to give The Conjuring a 7/10."
    }
  ]
}