{
  "id": 4554,
  "title": "The Florida Project",
  "starring": [
    "Brooklynn Prince",
    "Willem Dafoe"
  ],
  "runtime": 112,
  "genre": [
    "Drama"
  ],
  "description": "The story of a precocious six year-old and her ragtag group of friends whose summer break is filled with childhood wonder, possibility and a sense of adventure while the adults around them struggle with hard times.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bnSTP1PY2fDyat0eUa4QouuGV7F.jpg",
  "categories": {
    "plot": 7.044444444444444,
    "acting": 7.090909090909091,
    "ending": 7.217391304347826,
    "soundtrack": 4.0,
    "cinematography": 6.636363636363637,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The Florida Project hit me hard at the end. Part of my life I grew up in a situation that many steps ahead of this, but still lower class. I was fortunate enough to have at least had my own bed and a kitchen in the small 2 bedroom apartment that slept 5 of us. I had other friend who slept in the closet of the master bedroom because their family had 7 people. Our parents were mostly neglectful and we left the house from morning til night. It wasn't half as bad as the situation here, but I can relate and it felt very real.This is a wonderfully acted, far too real look into a poverty stricken group of people who get by one day at a time. It's heartbreaking and tense. Cinematography and colors are beautiful despite the mess of a life."
    },
    {
      "rating": "10",
      "text": "This is a brilliant film which follows underprivileged children and adults trying to live their lives in the Florida projects.  The acting is first rate, but the director, Sean Baker, should be commended for bringing out the best in all of them.  Don't be fooled by the low ratings here given by people saying that \"nothing happens\" because you will miss out on a wonderful film exposing a part of America that is rarely seen in movies.  This movie will stay with you for a while."
    },
    {
      "rating": "9",
      "text": "don't let the bright colors and sunshine fool you, this movie is far from happy. a concerning look at neglect, hardship and youth. told around the daily exploits or mischievous kids it contrasts youthful ignorance against the adults battle to say afloat.it is a harsh, natural depiction of the childhoods of those who were born to unfit parents. the cast is brilliant with the young protagonist carrying the movie effortlessly while guided by the sometimes meandering director. overall the Florida projects is a satisfying watch that stays with you long after the credits roll"
    },
    {
      "rating": "10",
      "text": "A beautiful, moving story. The Florida Project was one of the few movies that transfixed me and stayed with me a long time. The charming Moone tries to make every day an adventurous one taking us through the colourful motels, ice-cream parlours and abandoned homes. Her mother has a fierce love for Moone and tries to make ends meet. Bobby, though wary of Moone and her friends is still protective of them. He too works hard day to day and moves on. This one's a must watch!!"
    },
    {
      "rating": "8",
      "text": "This is an excellent movie by young and talented director Sean Baker.I loved his previous movie Tangerine. Similarly to Tangerine, this movie is about people who live in the underbelly of our society. Gruesome realism sprinkled with dark humor and occasional sympathy.Two of the film's protagonists, a 6-year-old Mooney and her good-for-nothing single mom Halley live in a seedy motel not far from Disneyworld, Florida.Being extremely curious and mischievous, Mooney and her friends run around and create chaos for both management and occupants. Utterly unfit parents love their kids but spoil them in so many ways. It is difficult to make a movie where kids behave naturally. Not a problem for Sean Baker.Young actress Brooklynn Prince who plays Mooney definitely deserves Oscar.I should also mention excellent casting and very impressive visuals."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised by Sean Baker's previous film 'Tangerine', so I was eager to check this one out. While the film does boast many great qualities, such as a rather naturalistic feel in terms of several aspects, such as the performances, cinematography, etc., it can't help but feel a little too episodic and greatly lacks a straightforward story. While this worked well at times, it felt like a bit of a stretch for a nearly two hour film. Like I said before however, the film wasn't without its positive aspects, such as great and natural cinematography, as well as standout performances, with Willem Dafoe in particular giving the tour de force performance of his career. Overall, it may have felt episodic and a little too cut-and-paste for me at times, and I wasn't particularly fond of its ambiguous ending, but the film truly has a powerful heart behind it, and the acting and other minor aspects make it worth seeking out."
    },
    {
      "rating": "9",
      "text": "A gorgeous piece of observational cinema.  People may be turned off by the lack of run of the mill film narrative, but the 'day in the life' realism holds quite strong.  Ensemble cast comprised of mostly child actors is a force, with Willem Defoe at the helm, guiding you through an omniscient look at a Florida housing project and the lives of those who dwell in it.  Superb cinematography. Florida Project is an art-cinemas lovers dream.  Saturated in serene color and soaked in for better or worse authenticity."
    },
    {
      "rating": "8",
      "text": "A beautiful slice-of-life film.  Willem Dafoe is excellent, the lead ladies are great, and the child actors really carry the film.  And I normally get annoyed with child actors!  If not for a couple of inconsequential scenes that could have (and maybe should have) been left out, I really enjoyed the movie.  Kudos to everyone involved with the project!"
    },
    {
      "rating": "10",
      "text": "A beautiful observational film that brings the audience into the world of some folks trying to keep their head above water when they have little to work with. I hated the main character (Moonie) at first but grew to understand her and then feel sympathetic for her. Another reviewer complained that there is no ending, so if you're looking for something that ties up nicely in the end then this isn't for you. I found the ending to be quite endearing."
    },
    {
      "rating": "10",
      "text": "I am noticing a disturbing pattern on Metacritic over the past couple of days: Angry Star Wars fans who hated The Last Jedi are lashing out against the critics for giving the film acclaim by giving rotten ratings to some of the most critically-acclaimed movies of 2017. Quite an immature thing to do in my book."
    },
    {
      "rating": "8",
      "text": "Sean Baker's previous film, Tangerine, followed a group of trans prostitutes on the streets of LA and featured non-actors in most roles (shot on an iPhone, no less). This film takes place in a very different world, but has same gritty, guerilla feel and vibrant cast. Brooklynn Prince is the movie's central character. Her spunky personality drives the lively exploits of her small group of friends, as they pass the days inside and outside a cheap, seedy Orlando motel. Bria Vinaite is another off-the-street casting who is interesting as her messed-up mother. There is known actor: Willem Dafoe, who plays the befuddled manager, balancing his business responsibilities with his heartfelt concern for the residents. There's not really a plot, just a series of moments that mostly involve the kids running around and getting into minor trouble. Still, there's a heart and warmth to the characters and Prince is one of the most delightfully compelling new personalities in recent screen memory."
    },
    {
      "rating": "10",
      "text": "If you give this movie your full attention, it will blow your mind. The young performances are so real, they will transport you. I absolutely loved it. Beautifully made. And not cheap and manipulative -- this pic is REAL."
    },
    {
      "rating": "8",
      "text": "\"...BUT NOTHING HAPPENS!?\" might be the dumbest possible critique of The Florida Project.  This is a \"slice of life\" movie where it's just a bunch of moments, loosely tied together, but affording the viewer pretty intimate details of a life that is totally foreign to a lot of us.  Overall I thought this movie was really well done but not exactly something I'd want to watch more than once because some of it was pretty bleak.  Know what you're watching; if you need a strong narrative arc or sympathetic characters or what have you, this might not be your kind of movie.  But I will say this about all of Sean Baker's movies:  they tend to stick with me long after I've left the theater which is more than I can say for the vast majority of other movies."
    },
    {
      "rating": "10",
      "text": "This is a great movie that will take you on a roller coaster of emotions. You know how it will end, but you can't wait to see what happens. Very reminiscent at times of Monster and also Moonlight.  The acting is phenomenal throughout the entire cast. It is sometimes difficult to watch, but well worth it, as it will stick with you long after you've left the theater."
    },
    {
      "rating": "8",
      "text": "The first thirty minutes of this film had me intrigued and at the same time puzzled, I didn't understand very well what the film was trying to show especially because it didn't seem to have a direct plot, a specific story, but shortly thereafter I understood and that's how I could enjoy it much better.The Florida Project is pretty much an observation, an observation surprisingly affective and effective of one side of American society that rarely receives attention and if it does, it's usually full of stereotypes.The Florida Project is a poignant and straightforward drama but not gratuitous at all, it does not force anything, it just let things happen and that effort achieves an incredibly solid and moving result. Another great movie by A24."
    },
    {
      "rating": "9",
      "text": "This movie is hauntingly real, the actors too real almost, their stories hurt in a way that i s hard to forget - perhaps because we, as the viewers with probably better situations are the ones who are to able to realize what these people can't have and what these simple, sweet, children are getting twisted and torn away from their chance at happiness of childhood.It would be unfair to say that they are orphans and are dying of hunger or not being helped at all. No, they have some form of family and even friendly hands reach out from time to time, but its not enough. It's never enough to give such troubled people to get out of their vicious cycle. More importantly though, this story is about telling that there are such people and they are living, in their own way. Do not pity them, but if anything help them out with some bucks and a job if you can. Lastly, it is not where you should come looking for solutions for there is ample evidence for a lot of people it is just another way of life they can't get out or want to, for almost the same reasons as any other person from some other lifestyle - after this while, maybe it just seems easier than stepping out of the box.Special and obvious mention to the Child Actor who plays Moni and her relationship with her mother, whose portrayal as the slummy white single mother is very well done. While Willem Dafoe is too much of esoteric iconoclast to even be pointed out for his subtle acting, all the additional child actors and supporting cast really bring the whole of The Florida Project seem excruciatingly original to the viewer. The sound and general editing does well to avoid any jarring realisation between the scene changes even though there a quite few contrasts in changing.To sum up, You should watch this movie for its excellent acting, casting, story, direction and editing among all else I forgot to single out. But here's why You must watch the movie - It will remind to be kind and contemplative in your compassion on those low days when your mind can't help be a frog in the well."
    },
    {
      "rating": "10",
      "text": "masterpiece,totally unique, incredible, beautiful, touching, amazing, talented,"
    },
    {
      "rating": "10",
      "text": "I couldn't stop myself from writing this after seeing such a low user score for such a great great great movie which might discourage some people from watching it(very bad habit).It's a wonderful magical lovely beautiful movie which will shatter your heart n moisten your eyes in the end but with a big smile for company.Go watch it."
    },
    {
      "rating": "8",
      "text": "i can't say it..The Florida ProjectI suppose it is difficult for anyone to talk about this movie and not use the word, \"beautiful\" in it for you cannot not fall in love with all the clips of these little kids playing all on their own whispering innocence on the screen. The Florida Project is a kind of movie that has an amazing premise and beautiful script along with it which comes off as a magic on screen but it also is kind of a movie that if not taken care of while executing it, it may come off dull and boring. And Sean Baker is ready to take all the responsibility for it and he carries it all around on his shoulder shooting and editing some of the most precious moments on the screen (it may remind you of those little clips that were shown in American Beauty; remember the guy that used to shoot any clips who lived across Kevin Spacey). The lead child actress is amazing in it and supporting her all through the course of the movie is Willem Dafoe who easily resembles to any man in charge of the responsibilities; he is simply brilliant in it. The Florida Project carries off these little sequences building it upto something more than one can imagine and flaunts it all over the screen like a magician."
    },
    {
      "rating": "8",
      "text": "Baker makes movies about people whose stories are not oft told and whose lives many people do not care about.  Just like with his first film Tangerine, The Florida Project (\"TFP\") tells such a story with compassion and insight, but without judgement or condemnation.  TFP delves into the lives of people who live in low cost motels because they can't afford to get permanent housing.  The story is told mostly from the perspective of a precocious, and completely unsupervised six-year old, Moonie,  who explores her world without fear.  The only recognizable actor is Willem Dafoe, who is excellent portraying the motel manager who cares for the property, enforces the rules (mostly) and protects his tenants and their children.  Though Moonie is portrayed by a young girl who has worked as an actress, her mother and her best were found by Baker on social media and in a Wal Mart with her mother, respectively.  There is a genuineness to every performance that is very compelling.  I suspect that some people will dislike this movie because it is not narrative driven; it is a slice of the lives of the characters.  Things happen, but the events seem to be less the point than the insight of how the characters in this story react, both to the events and to each other.  This is a film about week to week motel tenants, close to Disney World, living their lives and trying to get by.  If that idea appeals to you, then you'll enjoy this low budget indie film, if it does not, you should probably go see Geostorm."
    },
    {
      "rating": "8",
      "text": "The Florida Project follows the story of six year old Moonee living in a sleazy motel just outside of Disney World. Her mother is on the verge of poverty, constantly struggling just to keep up with the rent. Directed by Sean Baker and starring Brooklynn Prince, Bria Vinaite and Willem Dafoe.The harsh reality of life seen through the eyes of children. It's innocent, funny and sad all at the same time. You almost forget this is a movie, the child actors don't seem to be acting at all. Each and every interaction seems natural and believable. You're quickly brought into this story, laughing one minute and near tears the next. Although there's no clear lines between the beginning, middle and end. It moves in one smooth motion, giving you a glimpse into the life of Moonee and her friends. Without giving anything away I personally found the ending to be somewhat disappointing. The majority of the film doesn't shy away from the difficult lives these people are living so the ending seemed out of place. That aside it's heart breaking and has no problem provoking intense emotions from the audience. Truly incredible acting and one of the most immersive movies I have ever seen. You won't see a film quite like The Florida Project very often. Not to be missed and highly recommended."
    },
    {
      "rating": "6",
      "text": "One realizes about halfway through 'The Florida Project' that the entirety film is going to continue along a rather offbeat and non-traditional track.  The film is more atmospheric than plot driven, similar in that regard to last year's breakout hit 'Moonlight.'  Both the production team and acting talent on 'The Florida Project' did a phenomenal job at world-building, creating a realistic setting filled with distinct characters that oftentimes felt like watching a documentary.  However, it's the overall structure of the movie that makes it a flat-out chore to sit through.  Stories need a beginning, middle, and end.  'The Florida Project' is all middle.  Worse, it hardly has a main character.  Or at the very least it lacks any kind of protagonist/antagonist relationship in the traditional sense.  And by the time the asynchronous ending appeared on the screen, I was screaming in my head for the end credits to finally roll, as the two hour run-time felt more like three and I just wanted to go home."
    },
    {
      "rating": "1",
      "text": "The acting is realistic...too realistic.  That is the only positive thing I see in the movie.  The story line is a depressing look at the desperate misspent life of a young single mother and her child daughter.  It is a case of a rebellious, lying, foul-mouthed adult-child, raising a child who is quickly becoming, rebellious, lying, and foul-mouthed. The young mother spirals more and more out of control as the movie goes nowhere.  There is no hope or redemption, just the dark picture of what life is really like for a young woman who is on the wrong side of life. She is a curse to herself, society and to her unfortunate child. Watching the movie is a complete waste of two hours of life."
    },
    {
      "rating": "5",
      "text": "Of all of the Awards Season hopefuls going into the Oscars, this one seems to be getting snubbed the hardest. At least, that’s what I’d heard going in to this particular film. The Florida Project has received only one Oscar nod (for Willem Defoe’s supporting role). Much to my surprise, however, I agree with it’s singular nomination, however I would have liked to see it get a nod for it’s cinematography, also.As an antisocial person, I feel this film unintentionally captures my general outlook on the world, so in a way, I can derive my own meaning from it. The parts I enjoy greatly feature almost no people.  The cinematography is astoundingly gorgeous, and the locations, however bleak they may be, are beautiful in their desolation. The lighting looked very natural and as a result, many of the scenes felt rather intimate, almost mirroring real life. This effect would have been accomplished perfectly, if it weren’t for the main issue I had with the film: the performances.The characters, which many have claimed to be one of the defining features of the picture, almost ruined the film for me entirely. With a cast weighing heavily with children, however, The Florida Project was fighting an uphill battle to win my favour. I don’t know why I seem to despise both children, and child actors, but regardless, the only performance I didn’t mind in recent memory was Dafne Keen’s Laura, featured within Logan. Still, having heard the rave reviews before going in, I was actually hopeful. Those whom I was with at the time seemed incredibly pleased with the performances, commenting on how good they were multiple times throughout the film. I was less than impressed. Right from the first scene, I found them grating. Not only are the performances (in my opinion!!) lacking, the characters themselves are infuriating. The children are written to be obnoxiously loud, and terribly rude. I completely understand why this is, but regardless, it doesn’t make it any less painful for a viewer such as myself.Bria Vinaite is giving her first performance in a film. She was actually an instagram model, with no prior experience. Again, I completely understand why this casting decision was made, and I actually agree with it for the most part. Still, I felt her lack of experience was hard to ignore. Caleb Landry Jones (whom, might I add, has had a wonderful year in cinema: This, Three Billboards outside of Ebbing, Missouri, Get Out, and American Made) is barely in the film long enough to notice. I can remember two scenes, in which he does barely anything. The one performance which I actually enjoyed was Willem Defoe (which is rather odd to me as I can still only picture him as the Green Goblin). He plays Bobby, who is the one likeable character within the film. Naturally, he is the one character who is almost entirely pointless.I understand he’s a sort of morale compass, and he seems to legitimately care for these demon-spawn children, but ultimately none of his scenes equate to anything of importance. That’s a theme that runs through the film: pointlessness. Early in the film, you can tell where the plot will go. Still, it takes it’s time, meandering through scene after scene, rarely impacting the next. When the emotional climax finally came, I was so detached from the characters, I felt nothing but lacklustre contentedness that the characters would be better off than when they started.Straight after watching the film, I think I would have given it a 6/10. It was visually stunning despite showing very little of interest. Having had time to reflect, however, I feel I am generous in giving it a 5/10. All I took from it was the visuals, and a single serviceable character with a great performance behind it. I completely understand why many people enjoy this film, and I’m glad that it’s found it’s audience. Unfortunately, I am not a part of it."
    },
    {
      "rating": "7",
      "text": "You're either into the immersion of the world of these children or you're not. I was anxious for the obviously dangerous surroundings of these kids and therefore worried for them which is why it took my a while to warm up to their mischief as endearing. Many seemed put off by the trashiness of the mother character but I thought her acting was quite perfect for the role. All told, entertaining with an emotional payoff."
    },
    {
      "rating": "8",
      "text": "The Florida Project is a snap shot into the lives of the residents of the \"Magic Castle\", a Florida motel located close to Disney World, focusing specifically on six year old Moonee, her mother and the overworked hotel manager Bobby.The Florida Project forgoes conventional story telling techniques in favour of an almost documentary style of film-making that is content to simply offer a glimpse as to what life is like for people living in poverty and struggling day to day just to keep a roof over their head. The cast is what really helps to make this movie a success however. Willem Dafoe is excellent as always but it is Brooklyn Prince as Moonee that really steals the show in what is essentially the lead role. It's not a conventional movie but it's well worth watching."
    },
    {
      "rating": "7",
      "text": "A strong ending can't completely make up for the fact that this movie seems aimless for the first hour and a half. Well-directed."
    },
    {
      "rating": "9",
      "text": "As someone who grew up in a low income environment the communal aspect that goes on with these kids and families does ring true. This is a great piece of film making one of the year's best. A"
    },
    {
      "rating": "8",
      "text": "Intense story of six-year-old troublemaker Moonee and her rebellious mother Halley. Sensational and moving film that gives you second thoughts. A surprising picture of a world that we do not know at times."
    },
    {
      "rating": "7",
      "text": "While at times funny, touching and intensely absorbing, this look at life in an underrepresented segment of contemporary American society is ultimately unsatisfying and somewhat frustratingly episodic. Beautifully filmed and well acted with a terrific production design, the film succeeds visually and emotionally, but its implausible conclusion and a number of other hard-to-swallow incidents undermine the overall production. Director Sean Baker's latest evokes a number of strong heartfelt reactions, but, unfortunately, it always feels like it never quite knows where it wants to go -- or how to fulfillingly wrap things up."
    },
    {
      "rating": "9",
      "text": "LIFF31 2017 #4\"I can always tell when adults are about to cry\".\"The Florida Project\" is a bright candy-lit look on Florida lifestyle, which has it's dark moments underneath. The beautiful, but trashy Disney parody is presented from a little girls point of view. Every serious or traumatic event are completely overshadowed by a child; we only see it in the background. To be honest, a lot of the scenes in the film reminded me of \"Moonlight\". Little details that added to the similarities, but different in execution.I haven't seen Sean Baker's \"Tangerine \", so this is my first film from him and I gotta tell ya, it's a great start. While Baker directing isn't anything I could call a true master or anything, but the way directs certain scenes, even the ridiculous ones brings such life to the film. Mixed with the amazing cinematography is pure magic.The performances from everyone and several of the kid actors were all fantastic. A breakout role for Bria Vinaite and a impressive one from Brooklynn Prince, who carries the film. The camera is locked onto her through out. You never lose your focus, which alone is an accomplishment. This is best I've seen from Willem Dafoe. A restrain and moving performance that every time he leaves the screen, you miss him.My only issues with the film is sound editing. Some sound didn't match up or was delayed after it's action, such as fireworks. Then there's the ending which was so bad and out of place with the rest of movie, stopping it from being a perfect movie for me. The quality of being shot on a phone just looked sloppy compared to the rest of the film. It's like they didn't know how to end it.Putting complaints aside, this is still a phenomenal character study. Striking an emotional core with me. One of finest movies of 2017."
    },
    {
      "rating": "10",
      "text": "I had the incredible opportunity to see The Florida Project on 35 mm, and when shown in this format, this film is an easy 10/10. For real, everything just comes to life, and you can practically feel the texture of the settings. When watched digitally, it's about a 9/10. The story is wholly unique and original story. It's heartwarming, heartbreaking, and it captures the truth of living in poverty outside the Disney parks. The perfomances are fantastic and wholly believe-able. The script is out of this world.  Make this a must see movie for you!"
    },
    {
      "rating": "7",
      "text": "The Florida Project, much like last year's American Honey, gives a look into the everyday life of a young girl living in a trashy neighborhood. Both films succeed at giving an honest portrayal of this lifestyle, but where American Honey manages to deliver some poignancy about adolescence and relationships, The Florida Project lacks a clear point or underlying message (other than it being an ode to childhood). Though Brooklynn Prince gives a charming performance, the real star of the film was Willem Dafoe for me, he is absolutely fantastic. The film has an alluring sense of playfulness and just for Dafoe's flawless performance alone is worth a watch."
    },
    {
      "rating": "9",
      "text": "This movie was fantastic. The acting was great, the story was compelling. The brilliance and point of the story is the idea of a child trying to live a \"normal\" childhood in the midst of a terrifying situation. Her mother is negligent, she is in danger from many different things in her environment in the backdrop of the happiest place on earth. The film is about innocence in the face of adversity."
    },
    {
      "rating": "7",
      "text": "Other than the kid's acting being shotty until the final moments, this movie was firing on all cylinders. An anecdote that can be easily universalized to America and our need for connection, sacrifice and love. Wish I could have felt that way the whole movie though, didn't really hit me until the end. Willem Dafoe and Bria Vinaite kept me around, engaged and interested until the end. Direction, writing, stakes and message were spot on and timely."
    },
    {
      "rating": "10",
      "text": "I am usual not one for the modern indie movie, with fast cuts but this movie really just hit me. Beautiful acting, cinematography, and story. Heart breaking, hopeful, strong, disturbing, beautiful and elegant. This movie has it all. And for anyone complaining about the ending, (no spoilers) just put yourself in the shoes of these kids (which the movie does if you watch it) and it is a great ending."
    },
    {
      "rating": "9",
      "text": "I think this is one of the best written plots of the year. The plot escalates slowly, almost always driven by Halley's bad decisions/negligence. She is the antagonist. I think it's a traditional three act plot. The inciting incident is Halley losing her job, act 1 ends with the abandoned duplex's burning down, this leads to Halley's friend grounding her kid and not telling Haley why, which makes Halley turn against her, losing her friend, lifeline for cash and a place for her daughter to stay. This forces her to resort to desperate ways to earn the weekly rent. When she is finally turned in for doing an illegal activity this is the end of Act 2. Act 3 is my favorite final act of any movie I saw this year. The audience probably knows what's coming and even the other tenants can see it, but Halley can't, and that's tragic irony. I love the scene where she's cleaning out her room, and gives her weed to the cleaning lady, and the cleaning lady hugs her and tells her it's going to be ok and yet she still doesn't understand. For whatever reason the very end didn't quite pack the emotional punch I was hoping for. Maybe they needed to show the kid getting dragged away, van doors shutting on her for some finality, and then she could look out at disney world from the van window. I don't know. At any rate, still impressive. I never felt like the writing was condescending to the characters, however I think what the story was missing was a character that defied some stereotypes of the world Sean Baker is portraying. Great acting, great cinematography. I would definitely watch it again."
    },
    {
      "rating": "9",
      "text": "Following up the amazing Tangerine, Sean Baker brings home the goods again with this grungy slice of life tale. Sweet and unsparingly desperate. This is top level indie film making."
    },
    {
      "rating": "6",
      "text": "A little disappointing considering the innovation that was Tangerine. Someone told me he thought this would have been a really, really good short film and I think that hits the nail on the head. Sean Baker is clearly a talented director, getting terrific performances out of non-actors and planting seeds along the way that flower nicely later on in the script, but the story lacks. There’s no real arch, it kind of feels like it arrived at the wrong time after the release of recent films like American Honey, Moonlight, Room, and others that have covered similar territory better. The ending also feels tacked on. Willem Dafoe’s character doesn’t really go anywhere either, he seems like an unnecessary addition. Still, there are some wonderful moments in the film that capture childhood very well and the setting is unique but I can’t say I strongly recommend it."
    },
    {
      "rating": "4",
      "text": "Here is another indie movie that I can't say I enjoyed.  Although the visuals are very interesting, showing the sleazy underbelly near Disneyworld in Orlando, and there is some good acting, particularly by Willem Dafoe, the movie was seriously flawed.  Moonie's unemployed stripper mother was hardly sympathetic.  The ending of the film was predictable, the film itself was repetitive and slow moving, and I found myself impatiently waiting for the inevitable conclusion."
    },
    {
      "rating": "5",
      "text": "Despite the exuberance of the children in the movie and the appealing character played by Willem Dafoe, I couldn't get past the aspects of the film that were off-putting, including the circumscribed setting, the abrasive the mother of the child at the center of the film (thank you to hobocrit for this word that perfectly captures her) and the feeling of dread as I anticipated what horrors awaiting both the unsupervised children and the mother who did not seek out sustainable ways of making a living.This movie is set in a large city, but because the camera stays focused on a short stretch of roadway, you never get a sense that the people in the film live in a major metropolitan area. While this circumscribed setting mirrors the constraints limiting the character's lives, it also limits how much the viewer can enjoy watching the movie. I wish we learned more about what other attempts the mother had made to find a job, given that her maternal instincts were strong enough to keep her from becoming drug addict despite her circumstances. It's like the filmmaker is telling us that it doesn't matter how she got into her current situation, and that something bad is going to happen to the kids, but of course it matters. Whenever you sensing bad outcomes lurking, because you know the characters are facing circumstances that commonly lead to the worst possible things happening, I think it is important to show why those things haven't happened yet to the characters.I think it is important that we take seriously the precariousness of people's lives in our wealthy (by per capita measures) country. However, I think the abrasiveness stands in the way of us fully experiencing the humanity of mother and daughter. The daughter's joyousness is infectious, but at the end of the movie her fear seems forced to me.See this movie to watch Willem DaFoe's heroic motel manager (although we never find out why despite living in this world, he manages to stay above the difficulties his tenants face and not become hardened by it) and the performances of the kids but be prepared to be frustrated by the limited amount we see of the physical environment and the lives of the characters."
    },
    {
      "rating": "3",
      "text": "This was the most unpleasant movie I’ve seen in recent history.  I don’t understand why so many reviews rave. Granted Willem Dafoe’s performance is outstanding and the cinematography was highly creative.  The rest of the movie was abrasive to say the least. If you enjoy watching an unlikeable, emotionally damaged ( I stopped just short of saying pyschopathic) young mother raising an equally unlikeable, damaged brat daughter, then you might enjoy this movie.   The climax (anti-climax really) was predictable and should’ve  come within the first 10 minutes. Instead we are subjected to a boring and really irritating non-plot for almost two hours watching bratty, hateful children and the whacked out mother day after day.  Because the reviews were so great I kept waiting for something to happen. Trust me nothing happens. You can watch this movie for a few minutes and you’ve got the whole idea.  Poverty and slums juxtaposed against “the happiest place on earth” - I get it."
    },
    {
      "rating": "1",
      "text": "A CHILD'S GARDEN OF HORRORS - FOR ADULTS ONLY - R-RATED BY ME Not for kids not for family viewing. The childhood horrors here include:- Kids in abject poverty- Orphaned kids- Absent fathers- Absent mothers- Emotionally absent mothers- Potential pedophiles- Kids with matches and empty real estate- 100% junk food diets- Casual adult nudity (minor)- Kids in proximity to adult prostitutionI became interested in the movie after haring the director on KCRW The Business podcast.  he is aware of the Hal Roach Our Gang comedies.  However he uses the candid naturalism of Our Gang in teh service of a CHILD'S GARDEN OF HORRORS.  Anyone who has worked as a K-5 school teacher will be horrified and understand kids with this kind of early bio are very challenged to overcome it after puberty strikes.  Sadly, this is high artistic talent, a colorful palette, and better-than-deserved performances in the service of HORROR STORIES ABOUT MODERN CHILDHOOD."
    },
    {
      "rating": "9",
      "text": "Baker delves into another overlooked subject in this award contender, featuring a rebellious and underprivileged single mother and her equally foul attitude but playful daughter. Although the story consists of a series of seemingly separated anecdotes, the emotional delivery by the actors and choice of setting significantly contrast the destitution of adult world and the fantasy of childhood. Despite the fact that reality often persists, fantasy is always one form of perception."
    },
    {
      "rating": "6",
      "text": "Usualmente me gustan mucho este tipo de producciones, sobretodo si a24 forma parte de ellas, pero esta vez no fue de mi agrado ni pude terminar de verla, ese grupo de mocosos son realmente insoportables que no dan ganas de seguir viéndolos, es una película bien hecha en todos los sentidos, pero ese aspecto en particular se me hizo tedioso."
    },
    {
      "rating": "6",
      "text": "But at what point is this message, if you can call it that, worth my investment? I have to sit there and be assaulted by noise and colors and tantrum-throwing whores for almost two hours in order to come away feeling that, “y’know, poverty really is brutal”? It isn’t worth the trouble."
    },
    {
      "rating": "8",
      "text": "Heartbreaking, emotional with a strong message and solid performances throughout. This is one of those films that take you away, here it's into the lives of many living on the outskirts of Disneyland. The film is rather repetitive though which many may not like and I am not the greatest fan of the unexpected-ending which personally ruined a great film for me."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of 2017. Interesting characters that are hard to judge and kids having infectious amounts of fun. Excellent directing style that refrains from moralising in a difficult situation. It's funny, it's worrying, it's depressing and tear-jerking. Cinema at its finest."
    },
    {
      "rating": "4",
      "text": "I really don't understand this 92 rating. There was not a moment in this movie that I felt really moved with about it, except when that kid cries at the end. It just tells a story day after about a girl that was not ready to take care a child and struggles to keep them a home. The photography, color and acting are awesome, but I felt that the story overall was too flat. And that ending seems like they lost their super professional camera, bought the cheapest DSLR they found to record to complete the movie and download any soundtrack in a free stock website. That was really disappointing!"
    },
    {
      "rating": "3",
      "text": "A film which can led one into liking because of the kids. The visuals are beautiful and a great performance from Dafoe. Everything else just felt contrived, manipulative & tacky. Glorifying poverty & wayward behavior The ending was predictable."
    }
  ]
}