{
  "id": 13,
  "title": "The Deep House",
  "starring": [
    "James Jagger",
    "Camille Rowe"
  ],
  "runtime": 85,
  "genre": [
    "Horror"
  ],
  "description": "While diving in a remote French lake, a couple of YouTubers who specialise in underwater exploration videos discover a house submerged in the deep waters. What was initially a unique finding soon turns into a nightmare when they discover that the house was the scene of atrocious crimes. Trapped, with their oxygen reserves falling dangerously, they realise the worst is yet to come: they are not alone in the house.",
  "releaseYear": "2021",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/52E0LGcMKHOO91P4j6hdHKVwITP.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 3.6666666666666665,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Que película tan mala, no transmite nada, las actuaciones son planas y el guión es mediocre como mucho."
    },
    {
      "rating": "5",
      "text": "It was an interesting change to the haunted house formula, but in itself the mystery developed here is kinda poor, and also the same environment does not allow any kind of development for the characters other than constant back and forth around the house, where you can barely see anything because of the camera handling and the water.The climax that builds the story is disappointing and not scary at all, which adds to the deficiencies of this film.It wanted to break out of the mold and I can appreciate that, but it needed more than just changing the setting."
    },
    {
      "rating": "3",
      "text": "it sucks that such and good concept is wasted on such a bad movie, the movie gets interesting in the last 10 minutes and by then it was already to late. such a disappointment."
    },
    {
      "rating": "3",
      "text": "it sucks that such and good concept is wasted on such a bad movie, the movie gets interesting in the last 10 minutes and by then it was already to late. such a disappointment."
    },
    {
      "rating": "3",
      "text": "It's pretty terrible - it's like they came up with the novelty of the underwater haunted house, and gave it to some high school kids to write and direct. Everything here is so shallow (pun intended)....the material is weak, acting sucks, production design looks cheap, and the main characters are so annoying I wanted them to drown."
    },
    {
      "rating": "2",
      "text": "Really boring movie. There was so much potential with this concept but it was hampered by a low budget, bad acting, and bad writing."
    }
  ]
}