{
  "id": 2873,
  "title": "The Hateful Eight",
  "starring": [
    "Samuel L. Jackson",
    "Kurt Russell"
  ],
  "runtime": 188,
  "genre": [
    "Drama",
    "Mystery",
    "Western"
  ],
  "description": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jIywvdPjia2t3eKYbjVTcwBQlG8.jpg",
  "categories": {
    "plot": 3.784313725490196,
    "acting": 3.25,
    "ending": 5.125,
    "soundtrack": 6.0,
    "cinematography": 4.444444444444445,
    "familyFriendly": 3.0,
    "funny": 2.5,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Tarantino's latest is as cold and barren as the landscapes in the movie but certainly not as beautiful. It's an ugly, soulless movie, and I would have walked out halfway through except I had a morbid desire to see how bad things could get.\r In that respect I wasn't disappointed."
    },
    {
      "rating": "10",
      "text": "one more reason to love Tarantino because his new film of his best work. Plot, dialogue and characters are all done at the highest level and with love"
    },
    {
      "rating": "0",
      "text": "Pure boredom plain and simple. Good performances throughout but a pretty graphic, pointless, violent tale better suited for a graphic novel rather than a movie."
    },
    {
      "rating": "2",
      "text": "I can't help but think that all the positive reviews have come from die hard Tarantinophiles.! Tarantino has produced a few memorable movies. This is not one of them.\r If there is any justice this will be on a short list of worst movies of the year."
    },
    {
      "rating": "1",
      "text": "This is an awful, amateurish {in some respects} movie from a director who doesn't deserve the adoration he so often gets.\r The Hateful Eight is a nasty piece of work featuring crude caricatures of characters from much better Westerns.\r I hope this bombs at the box office and forces everyone involved with this rubbish to give pause for thought."
    },
    {
      "rating": "2",
      "text": "I'm no Tarantino fan by any means, though I have enjoyed a few of his movies. I do however love a good western and 'whodunit' which is what made me part with my cash to see this.\r All I can say is this is the biggest waste of close to three hours of my time that I've suffered in recent memory."
    },
    {
      "rating": "0",
      "text": "I tried to like this movie, but it was just as boring as hell and full of all kinds of repetitive clichés and drizzly dialogue. I couldn't believe how cringe worthy and lame this movie turned out to be."
    },
    {
      "rating": "3",
      "text": "really boring. i like boring movies but there has to be a purpose. the purpose of this movie was sold that it was shot with glorious 70mm ultra panavison film. the most of this glory will be during the opening credits, the rest of the film you are locked in a room hearing the n word over 200 times and seeing jennifer jason leigh be brutalized."
    },
    {
      "rating": "1",
      "text": "Boring, self-indulgent crap from a smug and arrogant director.  I could only sit through the first half, so perhaps it is saved by the second.  I will never know, however.  Outstanding actors cursed by third rate dialogue and, with some exceptions, by overly stylized (almost bordering on too cute, in some cases) characters to protray.  Leaden pace. 70mm wasted after the first few minutes of landscape shots. Offensive material drawn out for no dramatic purpose, but soley to offend, a prime example of which is the speech by Jackson that ends the first half.  Jackie Brown - Yes!  Pulp Fiction - Yes!  Basterds - well, OK. Hateful Eight - No, No, No!"
    },
    {
      "rating": "1",
      "text": "Quentin Tarantino sure had his moments but this is bottom of the barrel.Bloated,boring,ridiculous,pointless-the most repulsive piece of cinema I saw in a while.Lots of talents wasted for nothing.Do your self a favor and don't waste your time on this one."
    },
    {
      "rating": "3",
      "text": "Pure trash.  Yes, it celebrates its trashiness, revels in the purity of its trashiness, makes knowing reference to other trashiness, but it's still trash, and toxic.  In the next QT movie, I hope everyone just shoots each other in the first five minutes and gets it over with, followed by 90 minutes of high-def nature photography."
    },
    {
      "rating": "0",
      "text": "Awful. Way too many wasted words in the dialog. A very simple story drawn out over several monotonous hours of chitter chatter. I cannot remember seeing another western this bad. Arty up his own arsie, waste of time.\r The Man with no name would of shot them all on site and went on to make a good movie."
    },
    {
      "rating": "3",
      "text": "All style and very little substance, much like the massively disappointing Star Wars Episode VII. The talk {and boy is there a lot of talk!} gets frustratingly repetitive leaving only the cinematography to admire\r As the saying goes \"you can polish a turd but it's still a piece of crap\""
    },
    {
      "rating": "3",
      "text": "Based on the 168 minute version.\r There's no denying Quentin Tarantino's twisted genius and perverse vision. His films are unapologetic challenges to share the roller-coaster as long as one accepts Tarantino run the ride. No one seems to mind. It may be time to challenge that precept.\r In a \"Playboy\" interview, Tarantino stated, \"I just don't want to be an old-man filmmaker.\" Pure Tarantino, \"The Hateful Eight\" is poetic, profane, laconic, really nasty, bloody as all hell, and meditative; the first half - uncharacteristically old man-y, moody and brooding with meaningful dialogue sharp as a razor. There's promise of a re-think as if Tarantino's voice finally broke to adult from adolescent. Then the film derails to the usual Tarantino high jinks.\r This filmmaker is a master at creating tension; cinematic foreplay teasing and teasing until big, sweet, orgiastic release in blood and guts. He also deconstructs and spins plot twists and turns into gold. That task is easy in, essentially, a stage play with eight trapped in one room. A Tarantino film with social commentary as text, the subject under the microscope is race hatred. Setting the film post-Civil War allows the saying of things unacceptable in contemporary society. Like \"Django Unchained,\" nary a few minutes pass without a \"ni**er.\" And the room is divided into North and South.\r The length works against this film. At 168 minutes it was quite enough. The added twenty-odd minutes in the roadshow version might make the experience interminable. The film runs out of steam as it plays out and plays out with dialogue between the bang-bang – and there is plenty of blood.\r Then there's misogyny. \"The Hateful Eight\" revels in the abuse of Jennifer Jason Lee, even with her portrayal of a scheming, cold-hearted killer. Her multiple beatings and battered face appears as if a domestic violence victim – most unappealing.\r The cast does well with the material. There are no standouts, really, but Tim Roth channels Cristoph Waltz who must have been busy.\r The cinematography is spectacular. Not necessarily the lighting, but the incredible use of the wide screen frame. The look and feel is evocative of David Lean epics Tarantino emulates even to the use of 'Roadshow', a practice that passed out of favor fifty years ago. Films are no longer shot this way. In this regard it was a pleasure to watch.\r If Tarantino wished to create the emotion of hate in the audience, he succeeded. The hate spills over the footlights, but there is a fine line between using verbiage and posture to underscore race hatred and making a racist (and misogynistic) film. More than in other films, \"The Hateful Eight\" crosses that line. This film again leads to question Tarantino's personal attitude. He becomes more suspect peppering scripts with \"ni**er\" - even in his contemporary films (joining real life \"Black Lives Matter\" protesters notwithstanding). Sometimes racists hide behind satire and commentary. Every use of \"ni**er\" is another nail in that coffin. Also, his neurotic mentions of big black c**k in several films (here, sucking) skews toward wish fulfillment.\r This is a very distasteful, caveman film within grand entertainment. That push-pull leads to a zero sum, and self-reflection as to what exactly is entertaining about \"The Hateful Eight.\" Given the dichotomy, not a lot."
    },
    {
      "rating": "3",
      "text": "Definitely the most cynical Tarantino film yet, with no likeable characters and a focus on violence against over character development of plot. I've never believed the criticism levelled at Tarantino that he glorifies violence until I watched this. Really enjoyed his last two for films as they seemed to be making a statement and we're a lot more focused and purposeful. With Hateful Eight Tarantino seems to be just churning out a film for the sake of it. Imagine a film that removes everything that gives a film soul and leaves you with nothing but a nasty, exploitative mess wherein the actors become more like charicatures of typical Tarantino characters. I think he should either stop making films or have a serious look in the mirror and try to rediscover what makes a film exciting,namely characters you can engage with,  relate to or empathise with."
    },
    {
      "rating": "1",
      "text": "What a BIG BIG disappointment from an auteur as Quentin and would give it 0 stars if I could. I have loved all his exploitation cinema before and know deeply about it, but this was just a boring and tedious mess, and in a theater in Utah that was way too crowded on New Year's also. It's a prime example of way too many establishment and thus highly paid and over paid actors using name recognition to get folks in the seats. Next time, Quentin, please use little known and independent actors who are hungry vs. totally spoiled and get back to the great films that you used to make please."
    },
    {
      "rating": "10",
      "text": "É um show de atuação só ator caro e a história é boa fácil de entender e vai desenrolando de um jeito que te deixa preso no filme."
    },
    {
      "rating": "8",
      "text": "We have another Tarantino film, and this time it's a western. I like westerns, so I'm already liking Quentin Tarantino with this one. What's also great is the casting of Samuel L. Jackson. And now for the film. There's probably one big problem for most people here and that's the pacing. The movie is almost three hours long and not much happens for about an hour and a half. I didn't find that a problem and I'm not even a Tarantino fan. I don't mind slow movies in general, but for a lot of people, half the movie will probably be an ordeal. Later on, things start to happen and the plot gets pretty interesting and raises a few questions, which are of course answered at the end and you are left with a clearer picture when the film is over. What added to the film's juice were the frequent n-words, which Tarantino just isn't afraid of. I enjoyed myself and although the film was slow as I mentioned, I personally found it interesting. I don't know whether to recommend it then, because after all the pace probably won't suit everyone. In addition to that, the film changes a minimum of locations and the plot takes place in the same place, which will probably also displease a few people and I was a bit disappointed at the beginning, but it gradually stopped bothering me because I just found the plot interesting. For me, the film was great and I'll put it this way. I recommend it to fans of the director, because his style is classically signed here, for example in the form of chapter divisions or the occasional narrator speaking into the plot. Perhaps even more fans of the genre might find it fitting."
    },
    {
      "rating": "7",
      "text": "This movie has a great cinematography and good suspance and action though it is almost entirely shot in a ranch. But you're talking about Tarantino that can give entertainment with everything he touches. He mix some genres here giving homage to his beloved Spaghetti Western genre. An entertaining ensemble movie."
    },
    {
      "rating": "9",
      "text": "It was the best movie I have ever seen(Cause I have seen such few moviesat all). So cool actor's playing.  The Characters are really charismatic. Also the fantastic entourage is available in the movie. My applause for Quentin Tarantino. I recommend this film"
    },
    {
      "rating": "3",
      "text": "This movie was so good at the beginning and then the 2nd minute it drastically went downhill. Actually the 2nd minute was the 2nd of a 10 minute scene where a stagecoach was going unbelievably slow in the snow. This film was pointless and baseless. The good things: cinematography, acting, directing. The bad: bad script, hard to watch the first 1.5 hours, bad script, nauseating, a lot of yawning (by me, not the actors). After Pulp Fiction and Resovoir Dogs, Tarantino has gotten worse save a couple films and this isn't one. Avoid, even if it randomly comes on TV."
    },
    {
      "rating": "8",
      "text": "The Hateful Eight is a long, slow, beautiful burn of a film that serves as Quentin Tarantino's tribute to John Carpenter's The Thing. Strong characters and dialogue take the center stage in this film. The gory finale definitely delivers in strong, gratuitous Tarantino fashion. The film kind of loses its steam at some points, which holds it back from being a 9 or a 10. If you can somehow see this in 70mm, it is a solid 8 out of 10, otherwise, it's a strong 7."
    },
    {
      "rating": "10",
      "text": "Прекрасный фильм. Сюжет и диалоги на высшем уровне! Все в стиле Тарантино."
    },
    {
      "rating": "8",
      "text": "While the Hateful Eight's ending is a bit disappointing, the rest of the film manages to maintain the tension, and the uneasiness of being trapped at this claustrophobic setting  works well all throughout, featuring great acting, and some messed up violence that Tarantino has always delivered."
    },
    {
      "rating": "7",
      "text": "An almost three hour long dialog-western were most of the time is spent on exchanging stories, lies and basic human traits; how can that be fun? But it sure is, but not everybody appears to agree on that since, yes; it’s a slow film and there are some boring moments (!). QT is back with his most intense dialog-driven flick that might not surpass his previous films but it’s a near, but deeper, miss. It’s all about human traits, and this might be a meh-film for some, but a masterpiece for others. But it sure isn’t a wild action-western. The well written dialogs keeps the film have this cold, dark & deep feel for these crazy, sick & wild characters. The film is highly driven on unpredictability. The plot is like a puzzle; many small events that eventually leads to something greater (& bloody). TH8 is a brave move by Quentin, and a highly original and artistic one. Too slow plot, too dialog-driven, too stereotypical & a lack of plot-development & top-notch humor, might be flaws for some. But the beauty of basic filmmaking with stunning camerawork and a clever editing; well Tarantino does not lack creativity.\r Personal rating: 73/100\rCritical rating: 87/100"
    },
    {
      "rating": "4",
      "text": "I just got back from seeing \"The Hateful Eight\" and my head is\rspinning because it's such a weird movie I'm not sure if it's somewhat good or exceedingly awful. What's sad is that it starts off wonderfully -- I felt myself\rgetting excited by the prospect of Tarantino returning to form for\rabout a half hour -- then keeps getting sillier and sillier until it's\rnothing but a comedy -- and the comedy is so unsubtle, it might have\rbeen made by Mel Brooks or Jerry Lewis on acid.\r What's funny is the much touted, rich color of the Panavision stock and\rthe fake cabin interior of \"Minnies Haberdashery (not a hat in sight)\"\rmakes the film look like the over-saturated movies from the sixties\rlike \"Paint Your Wagon\" which always looked vaguely fake to me -- a\rplastic universe cobbled together on a back lot and lit with huge\roverhead arc lights. Add big splashes of red blood and it started to\rlook like the garish color of some the 60s Disney films, so there was\rthis bizarre set of associations going through my head.\r When the finale of the film turns to grand guignol slapstick in these\rhyper-pumped colors, I felt like I was having a flashback to a bad 60s\rDick van Dyke comedy like \"Fitzwilly\" or \"Cold Turkey,\" and, honestly,\rI left the theater stunned by the near absurdity of it all. It's as if\rsomeone unearthed an awful 60s comedy (Sergio Leone? Hah? That's a\rlaugh) that was buried in the vaults by the studios.\r This \"love letter to the cinema\" is really a love letter to himself, as\rTarantino riffs off elements of his own movies like \"Reservoir Dogs\"\rand throws in some steals from Paul Thomas Anderson (it almost sounds\rlike Anderson doing the narration. Narration? Where the $%^& did that\rcome from? Wow, talk about the weakest attempt I've ever seen to clue\ran audience when some sloppy structuring fails the film.)\r The dialogue is Tarantino-lite, like a second-rate writer trying to\rimitate him (Samuel Jackson's goading of Bruce Dern is probably the\rworst monologue Tarantino has written) and the story is Agatha Christie\rwith a lobotomy. There are some good performances (Kurt Russell is\rgreat as John Wayne) and some awful ones (Tim Roth at his over-the-top\rworst) but the film itself unravels like a spoonful of spaghetti\rWestern. And this isn't a spaghetti Western, it's a pizza and beer\rcomedy. I'm sure it will be a big hit at frat houses across America.\r I'm amazed how some people (known critics, as well) even venture to\rjustify the racial undercurrent as social commentary. Tarantino has\rnever written symbolically or allegorically. He writes character, and\rthat's that. \"The Hateful Eight\" is a \"political statement\" in the same\rway that \"I Spit on Your Grave\" is an indictment of contemporary\rreligion. Please.\r How do I sum this movie up in one word? Well, the one that comes to the\rtop of my head right now is: \"Goofy.\" Maybe those big Panavision camera\rgot to Tarantino because he subconsciously started to think he was\rmaking a bloody version of \"It's a Mad, Mad, Mad, Mad World.\"\r\rI need to have a drink. At this rate, I have to say \"thank god there's\ronly two more to go.\""
    },
    {
      "rating": "0",
      "text": "Well, I have to say this movie is beyond bad! Except for performance of Jennifer Jason Leigh. It is so hard for me to believe that the same man made this total waste of time and a is also responsible for Inglorious Bastards-unbelievable!"
    },
    {
      "rating": "0",
      "text": "This movie was advertised as something to look forward to (finally a quality western). From the onset however the hateful eight was despicable. This movie was a waste of effort, money, time, resources and whatever else was involved in making it.  All of Hollywood should be ashamed of this production. People want substance and creativity not emptiness and trash. It's so unfortunate that anyone would look up to this director... or that anyone would waste their talents on this type of production. The racism, sexism, anger, stupidity and filth expressed is inexcusable. Anyone who lasted through this 167 minutes of sickness and ignorance ...became less for doing so. This movie and other movies residing in the category of \"should have never been made\" ...make today's Hollywood very small and unworthy of the glory that Hollywood past once knew."
    },
    {
      "rating": "4",
      "text": "Typical Tarantino.\rThe first half of the story is intriguing.\rA Who-Done-It style film, set in a wild west backdrop quickly turns to pointless garbage as the second half of the film demolishes everything the first half had accomplished.\rWhat a waste."
    },
    {
      "rating": "0",
      "text": "DO NOT SEE THE HATEFUL 8!!!\r Warning... disgusting stuff, foul language and spoilers in this review. Not for kids to read.\r People, I haven't gotten on and ranted about a horrible movie since Noah but as a public service I have to warn you all against this piece of trash.\r Don't get me wrong, I am (or was) a big Tarantino fan. I loved pulp fiction, loved the Kill Bills, loved Inglorious Bastards, loved death proof...even loved Django (though the gratuitous violence and constant use of the N word was beginning to get old.)\r This movie though.... seriously, I should have got up and left half way through when Sam L. Jackson (in a horrific flash back) forces fellatio on a naked white guy who's on his knees begging for a blanket in the snow (Sam laughing his big signature Sam L. Jackson laugh the whole time). But I in cowardice looked away and waited for the movie to get better. It didn't.\r From the running gags where Jennifer Jason Leigh is repeatedly called a **** and punched in the face until her front teeth break off and she's covered in blood, to the big finally where Jackson (barely conscious from having his nuts shot off) along with a horrible mortally wounded racist sheriff team up to (in their dying moments) deliver true justice to Leigh but noosing her and lifting her to the rafters until she slowly dances to death at the end of the rope, this movie is nothing but gore-porn idiocy.\r There are no heroes to root for there are no Nazis or slave masters to hate. Everyone is horrible. Everything is violent. Everything is.... well... just gross. To make matters worse it's frekking BORING! After a relatively hopeful first half hour or so with a few funny bits, some smart dialogue, some dramatic building and beautiful scenery... the thing basically becomes a bloated whodunit play with every other line containing the word **** or **** I was so bored I nearly fell asleep two hours in. It just drags on and on.\r I literally felt dirty driving home. It really made me question my own media consumption habits and where I draw my lines in life. Maybe I should have know better? Perhaps I should have drawn the line at the rape scene in Kill Bill 12 years ago. But the would be rapist immediately gets his ass handed to him in that movie by one of the most interesting bad ass heroines to grace the silver screen. Creative,violent revenge against horrible people is intriguing and at times invigorating and delightful in Tarintinos previous films. The purposeless over the top all around evil in this one though... it just goes too far down a very dark road.\r I don't know.... This one really made me question my own discernment. Avoid at all costs!!!"
    },
    {
      "rating": "0",
      "text": "I was really looking forward to the Hateful 8 and have always been a fan of Tarantino's movies but I am pretty disappointed by this one. I just felt as though I didn't get anything our of it really. The characters and the occasional symbolism was interesting but it just didn't go anywhere."
    },
    {
      "rating": "4",
      "text": "If you’ve seen any of Quentin’s previous films, you know he’s pretty loose with his language–like the f-bomb is just another adjective. If you’ve seen Django Unchained, then you know he’s pretty loose with the n-word, too. Some people called it “authentic,” but I felt it was a little jarring. There was a point early in the movie when one character drops the n-word and another character says, “You know, black people don’t like to be called that.” At this point, I wondered if this film would be free of the n-word, or at least very light on it. Psych! The rest of the movie is very heavy on the word.\r The movie itself seemed like a stage play. One character walks up to another character and spills his entire life story as an introduction. The second character responds by spilling his entire life story. Both stories serve as an introduction for the audience, but come off as un-natural. I had a writing teacher describe this as “soap opera dialogue.” It was odd to see it on-screen. The Broadway production of The Hateful Eight is gonna be huge.\r The gore was heavy… In some parts of the movie I would consider it over-the-top. There was one scene that caused all of us to gasp. If you’ve seen The Kingsman, and you call that a “ten” for violence, I’d call this one an “eight.” It sneaks up on you, too. For the first part of the movie, little to no violence. Then BAM! Violence is hot and heavy. There’s at least one scene where I think there was violence just for violence sake–I don’t think it was realistic for that character to act that way.\r If you put the language and gore aside, how was the movie? Well, it’s quite a lot of both to put aside, but I’ll try. It definitely put you into what Wyoming during a blizzard in the Old West would feel like. The sets and costumes looked terribly authentic. You see characters ride in a stage coach, and you find yourself marveling at how rough it seems in comparison to modern automobiles.\r The characters wind up in a trading post cabin in the middle of nowhere on their way to a town in the middle of nowhere. It oozes authenticity, and is an eye-opener to what life was like in the Wild, Wild West.\r But the language and gore… It was tough to stomach. Was language really that rough at that time? I thought language of today was a product of hip-hop, street culture. Am I just being racist? I need to do some Googling now and find out when heavy language became a “thing.”"
    },
    {
      "rating": "0",
      "text": "The worst Tarantino movie ever. A total waste of time and money. I'm a huge Tarantino fan, liked all of his movies up to this one. It seems like he has run out of ideas."
    },
    {
      "rating": "0",
      "text": "This is Tarentino's latest drag through the gutter, but this time it is our sacred Western. Guess he needs money to buy more porno to impress his gay infested entertainment industry friends."
    },
    {
      "rating": "3",
      "text": "Wow, that's a study in depravity. So. Much. Blood and Guts. There was ample opportunity and motivation for rape but somehow QT dispensed with that. And wow, was this an N-word festival or what?! So there'll be a segment of the audience that will be thrilled with that, though I think SL Jackson was overqualified for his role, but he's a regular in QT's films so that was going to happen, but he doesn't play the role well; he doesn't capture the Civil War era well at all, and as we all know that falls to the director to ensure his actors are in the proper frame of time and mind, so that's a mark more against QT than SLJ. But mega props to Jennifer Jason Leigh as Daisy for taking so much in the face! She'll need therapy after this role, seriously. But speaking of therapy, QT is crying out for it. I mean the amount of time he had to think, visualize, and plan for the depravity in this film is crazy and then to actually produce it. Wow, this guy is some kind of warped."
    },
    {
      "rating": "6",
      "text": "The opening credits of ‘The Hateful Eight’ rather egotistically state that this is the eighth film by Quentin Tarantino. Presented in 70mm and complete with an overture and intermission, this can be seen as either a vanity undertaking by its director or as a passion project by someone who loves cinema and the old traditions it stood for. The story outline is a mere strand and it is overblown to epic proportions (a staggering 187 minutes) that it cannot possibly hope to sustain. Things start promisingly enough with Kurt Russell’s bounty hunter escorting Jennifer Jason Leigh’s Daisy, by stagecoach in a raging blizzard, to her date with destiny on the gallows. En-route they meet up with Samuel L Jackson and Walton Goggins before holing up with the rest of the titular number in a cabin which is the home of ‘Minnie’s Haberdashery’. The torturous corkscrewing of the plot plays out from here, but interest is lost after a while due to the overly talky first half. The intermission when it comes is almost a relief. Things pick up considerably after the break and the screenplay introduces flashbacks, narration and a plot twist that livens things up no end. These devices are, in fact, Tarantino’s forte. This second half also lets rip in the blood letting department and anyone who has seen a Tarantino film before will know exactly what to expect. The cast have a lot of fun, with the best performances coming from Samuel L Jackson, Jennifer Jason Leigh and, especially, an unknown Walton Goggins. The film is technically proficient, although when the actors are competing with both Ennio Morricone’s forceful score and the sound effects of the raging blizzard, much dialogue is lost as a result. The 70 mm presentation is stunning and Robert Richardson’s cinematography of both interiors and exteriors is ravishingly beautiful. It may not be vintage Tarantino, but despite the flaws it somehow manages to stay with you long after you have left the cinema."
    },
    {
      "rating": "6",
      "text": "Hateful Eight is an entertaining film, but Tarantino's previous work is better. The dialogue, plot, and characters are simply not as good as in his previous films, and the whole thing feels a little bit tedious and drawn-out.\r It's certainly still fun to watch and has all of the characteristic Tarantino things, but they're just not executed as well and feel a little obvious and tiring. For example, the film randomly throws in characters with non-American accents just for the hell of it rather than having a serious reason or explanation. Also when you really get down to it, the story is very simple and doesn't need to be drawn out for so long."
    },
    {
      "rating": "2",
      "text": "When the titlecard came up that said 'The Last Chapter', I swear I heard an audible sigh of relief throughout the entire theatre. This has to be QT's most self-indulgent film yet. The characters are crude two-dimensional jerks, the cinematography is nothing special, the plot was weak and would have been better told in the span of twenty minutes, not three hours. Maybe the film would have been saved had it had better pacing, I'm not sure. However, the gentleman sitting behind me who had fallen asleep and snored for a good hour seemed to fit right in with the atmosphere of the movie."
    },
    {
      "rating": "3",
      "text": "This is easily the worst Tarantino film. It seems more suited to a play or novel.\rBasically, if you want to hear the backstories of the rootinest, tootinest Yosemite Sammiest bad boys of the Ol' West told over the course of 3 hours of painfully slow one-on-one deaths, watch this.\r Whoever leaked the script was doing the director a favor. He should not have made this film."
    },
    {
      "rating": "2",
      "text": "I loved Django, Kill Bill, and Pulp Fiction, and I take a perverse amount of pride in my unusually high tolerance for racism, misogyny, and gore when it serves the story. The Hateful Eight had so many major story problems, huge plot holes, a narrator that appears halfway through for no good reason, that it took all the fun out of the spectacle. This should have been called 8 Actors in Search of an Author, or maybe 12 Angry Tropes."
    },
    {
      "rating": "1",
      "text": "Worst movie I've seen in while, and yes I'm a big fan of Tarantino movies.\r SPOILER ALERTS:  First few conversations are interesting with Russell and Jackson, then every other conversation (there are many, way too many) becomes bloated and extremely boring.   QT used to have a talent of making conversations between characters really interesting and funny, not in this movie.  The script is total trash.  After 2 hours of crap conversation I was over it, especially after the 'gay' oral sex rape scene...\r Obviously QT has an axe to grind re US history and racism, and QT went for a record on how many times the word ni##a could be used, it gets very old and boring about 30mins in...\r Tim Roth's character was rubbish and his 'speeches' were pointless and unbelievable.  The mexican character started well then was never used properly.  It was essentially a movie where the overblown script ruined every chance to connect with any character, much of the movie should have been left on the cutting room floor.\r Then there was the narration from QT about 70mins in, where I thought I was listening to a Directors cut special on a DVD, it was so bad, and also ruined any tension that may (or may not) have been building.\r Crap movie, don't pay a dime to see it, I'm still a little shocked at so many 'fan boys' who will never say a bad word about QT, this movie was a shocker, one word BORING :("
    },
    {
      "rating": "6",
      "text": "Snowy, cold, over lengthy, bloody, theatrical. These are the main keywords for this movie. All events occur in one location, the rest store for travelers \"Minnie's Haberdashery\". The first half of this more than three hours show is extremely boring with long dialogues involving racism and almost no real events. The second half is packed with violence after the plot of the gang was revealed. Now, which gang? The theatrical show is about a gang who killed the rest house owners to free the sister (Jennifer Jason Leigh) of their leader, sent to be hanged by a bounty hunter (Kurt Russel). The plot is spoiled by the arrival of a hangman (Samuel Jackson) and a would be sherif (Walton Goggins). The acting in general is good specially by Samuel Jackson, Jennifer Jason Leig, Kurt Russel, Walton Goggins. Directing is pretentious, the scenario is not for a movie packed with places and moving. The opening music is nice and reminds the Good, the Bad, the Ugly and for Few Dollars More. At the end of the more than three hours, no one is left alive, blood is shed generously every where. All in all, a \"show\" that can be missed; if attended you have to be patient or have nothing else to do."
    },
    {
      "rating": "2",
      "text": "Well acted but the plot never really gets going and the conclusion isn't worth sitting through the three hour run time for. I'm a huge Tarantino fan and this would hands down be my least favorite film of his."
    },
    {
      "rating": "2",
      "text": "I love Tarantino, but I honestly don't know what he was thinking while making The Hateful Eight. While the characters are cool, the twists do come, the film's shot well, and Ennio Morricone's score is great, the rest of the film, much unlike Tarantino's usual films, felt overwhelmingly boring and derivative. It did not have nearly the level of action or interest as in films past, the film's plot and dialogue drags on and on, and its near 3 hour self-indulgent running time is far from necessary. Overall, this film was far from one of Tarantino's best and one of the most underwhelming movies I have seen from a critically acclaimed director in a very long time."
    },
    {
      "rating": "5",
      "text": "I saw this because Inglorious Bastards was fun, and because Jennifer Jason Leigh is an unparalleled actress but she's about vanished this past decade. The Hateful Eight would finally give me a chance to see her in a movie again. However, this movie is the Samuel L. Jackson show, with everyone else getting a small piece of the pie; there are so many cast members that each piece is relatively small. So JJL didn't get much to sink her teeth into. But hey, I love Samuel L. Jackson, too, so it still could have been great.\r Problem is...\r ...this movie has no point. It has no soul. It has no purpose. It has no emotional core. It has no theme. It has nothing but a kooky plot about scheming and killing that any 12 year old could make up during recess period. I mean, there is just nothing to this.\r And to top it off, it's way too long. When they showed one of the characters removing his gloves loosening one finger at a time before taking them off, I knew we were in for trouble. The exact same script could have been shot with a half hour or forty minutes less running time and it would not have felt rushed. This film as shot just feels so slow it's painful, especially the length of time before they get to the cabin where most of the movie takes place. This is one of the only movies I ever fell asleep in, and it was for about fifteen minutes during that opening phase when the stagecoach is heading for the cabin or store or haberdashery, whatever the place is.\r I do not recommend this movie, but if you must see it, rent it and fast forward when things get slow."
    },
    {
      "rating": "4",
      "text": "Definitely, some good acting along with some good actors with some clear professional and artistic shots of the camera. That is literally all that is good about this movie. I won't rant on about the dull, shock value, politically driven drivel that is the story rather this sums it up...\r The Hateful Eight  = Reservoir Dogs part II minus everything that actually made Reservoir Dogs spectacular."
    },
    {
      "rating": "1",
      "text": "overrated.boring. and more boring\r i was going to quit in the half of the movie but i stayed for this review and it didint worth i want my money and time back .plot was bad . dialogues was so long and it didint drag me in to the movie! 1 point for samuel l. jackson"
    },
    {
      "rating": "1",
      "text": "I cant believe anyone would give this movie a 10 - because its a Tarantino movie ?\rIts a  3 hr snoozefest set in one room.\rSorry but i think Tarantino has lost the plot with this movie - literally."
    },
    {
      "rating": "3",
      "text": "I enjoyed myself for a good 45 minutes, but after the first hour watching it felt like utter torture. Great setting, great graphics, good choice in music, wonderful acting by Jennifer Jason Leigh. Unfortunately the movid did not quite live up to its potential.\rThe scenes were stretched too long making the movie monotone and boring."
    },
    {
      "rating": "0",
      "text": "Do not waste the money.  It is shocking to me the actors and actress would sign on to play in such a horrible movie.  I do not know who is \"curbing\" the results but everything I have read agrees that this is not worth wasting your time..  Whomever does not agree must be receiving compensation to say different."
    }
  ],
  "recommendations": [
    "the_power_of_the_dog",
    "midsommar",
    "the_counselor",
    "the_american",
    "bird_box",
    "gamer",
    "transformers_the_last_knight",
    "polar",
    "army_of_the_dead",
    "the_twilight_saga_breaking_dawn_part_1",
    "dragged_across_concrete",
    "inherent_vice",
    "red_sparrow",
    "all_eyez_on_me",
    "poseidon",
    "shadow_in_the_cloud",
    "there_will_be_blood",
    "sanctum",
    "wonder_woman_1984",
    "hereditary",
    "next",
    "the_wolf_of_wall_street",
    "blackhat",
    "miami_vice",
    "vantage_point"
  ]
}