{"id": 4599, "title": "The Good Liar", "starring": ["Helen Mirren", "Ian McKellen"], "runtime": 109, "genre": ["Crime"], "description": "Career con man Roy sets his sights on his latest mark: recently widowed Betty, worth millions. And he means to take it all. But as the two draw closer, what should have been another simple swindle takes on the ultimate stakes.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6kmxXfg3aSWrzUlEPt2L0YD4jz9.jpg", "categories": {"plot": 5.666666666666667, "acting": 4.75, "ending": 4.235294117647059, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "No Spoilers:Let's be honest here: the main draw of this story is its two lead actors, and both of them do a terrific job. I did like the story, but one could argue it's just an excuse to have these two amazing actors on screen. Think of it as watching a play in the theater that you already know: you don't go to see it for the story, but for the acting."}, {"rating": "4", "text": "You probably already know the general theme of the movie, and the main actors. You need to learn this too, though: it starts well, but the resolution of the plot is dumb. Really dumb. It could have been a scam-artist movie, it could have had a drama twist, it could have had a romance twist. Instead it choose a retarded nazi-twist. The usual modern-woke touches doesn't help either: in the last 5 minutes of the movie we find a rape, girl-upping the male character, a black nephew of a white grandma and his gay lover. For **** sake.... the movie stayed normal for most of it, wth happened at the end?"}, {"rating": "7", "text": "A deliciously devious game of bait and switch featuring intriguing and unexpected twists and turns, along with superb performances by Helen Mirren and Ian McKellen, that will keep you hooked right up until the end. While the film has some occasional pacing issues, an undercurrent of predictability and a few nasty incidents that seem out of place within the context of an otherwise-playful narrative, the picture nevertheless entertains thoroughly as the lead scoundrels spin their carefully orchestrated webs of deceit. Not groundbreaking cinema by any stretch but certainly passable, largely inoffensive fare that makes for a few good hours at the movies."}, {"rating": "7", "text": "Go into the theatre, buy your popcorn (or not) sit down for 109 minutes and be entertained by two charismatic, professional stars as they do their job. When you leave the theatre don't start questioning the screenplay by Jeffrey Hatcher, based on the novel by Nicholas Searle, because some of it didn't make any sense.Bill Condon directs the two stars in sparkling locations and backdrops whether it be in London or Berlin. Time frames are today and back in the 1940s and, thankfully, the younger actors playing the older ones are real and not movie 'magic'.Talking about that it seems most movies today have flashbacks when in most cases the movie can be told in linear fashion whereas in this movie we do have to go back to explain the present.Is it a love story? A story about scams? Con artists? A comedy? Drama? A mystery thriller? Are the people who they say are? It is all of these and yet when you leave the theatre all you will remember is Helen Mirren's smile and Ian McKellen's hangdog face plus their playing off and to each other.\"The Good Liar\" is just an entertaining movie, except for two quick violent scenes (unless violence entertains you), that was a perfect way to spend this very rainy afternoon."}, {"rating": "1", "text": "If this had just been a film about Mindless/light and relatively painless and COHERENT Con artistry I would have rated this much higher. Instead I watched an Incoherent, Poorly scripted Non-believable and VIOLENT flick. This should have reviewed and tightened up by the Director and Screenwriter. For shame!"}, {"rating": "2", "text": "A very 2/3 intriguing film that suddenly ends in a clumsy **** of Hollywood virtue signaling that is as misandrist and heterophobic as it is predictable."}, {"rating": "4", "text": "There is something very unsatisfying about this movie. I expected that such accomplished leads would be able to carry off just about anything but I was wrong! It starts off very slow, and to its credit picks up by the half way mark, but the ending leaves one feeling empty. Also, I anticipated the final major plot twist before its exposition so it was all anticlimactic. I personally think this was a waste of time, a couple of hours that could have been spent on just about anything else."}, {"rating": "2", "text": "The movie started well and made you interested in more. In the middle youre starting to predict the plot/ending. The end is full of incoherent story that leaves you with a lot of question marks above your head. Especially when the young Hans isnt anything like the old Hans or the woman claims she doesnt do all this because she wants revenge, even though it all points to revenge.And the very end is such blatant and pitiful virtue signalling that I almost felt bad for the makers of this movie, yet putting it at the very end feels more like deliberate deception of the viewer."}, {"rating": "2", "text": "So disappointed.  Great cast.  The acting was very good.  I expected a thriller or who done it.  But, it was totally preposterous.  I walked out of the movie theater asking why I was so excited to see this movie.  I love the actors, but the story was well beneath them."}, {"rating": "0", "text": "This movie was boring and predictable from the start and progressed into being a grossly over emphasized portrayal of a minor's sexual assault. Both the directors were men, so I don't know why they thought they should tackle the issue of women being sexually assaulted, but they did, and it unsurprisingly fails to be tasteful or to give the victim any sort of depth or complexity in her character AT ALL. Also who tf still makes nazi movies? Clearly negative thought was put into this movie and for the gratuitous assault scene alone it deserves 0 stars."}, {"rating": "6", "text": "This film pairs British greats Ian McKellen and Helen Mirren.  He plays a con artist out to scam her, but anyone who's ever seen a movie will know that she's somehow in on the game. It's enjoyable to watch this great duo work. It's also fun to try to outwit the script. While it's not especially surprising and certainly not suspenseful, it's still an adult-aimed film that is sufficiently entertaining."}, {"rating": "6", "text": "This programmer featuring strong performances by Mirren and McKellen is a bit too ambitious for its own good. What should have essentially been a story about a con artist and his relentless pursuit of his next victim gets bogged down with some rather convoluted plot twists. Not every film featuring septuagenarian leads needs to be of awards caliber. Just like films featuring younger actor's it's okay for it just to be fun."}, {"rating": "7", "text": "Predictably well acted and a generally good yarn, but it lacks the compelling urgency that made the book so riveting a read. The twists are good, but somewhat signposted even if you haven't read the novel. Also the flashbacks tend to slow the plot and the action down reducing one's tenuous involvement even further."}, {"rating": "4", "text": "Two skillful and interesting actors in a so-so film that is yet another “take” on the repercussions of World War II – as if we needed yet another one. I’ve liked Bill Condon’s films in the past (for example, “Mr. Holmes” and “Gods and Monsters”), but this one was not up to his standards either in style or story."}, {"rating": "2", "text": "Intriguing premise, and great actors let down with an awful payoff which left the 4 of us, 2 which were over 70, turning to each other wondering why the hell they went \"there\" A 100% missable snore-fest"}, {"rating": "8", "text": "I liked it. While at first I thought might be boring and like more of a love story about people in older age, it turned out more interesting. Plus very great acting, with seasoned actors. Plot was interesting too, even though had some loopholes - spoiler alert - mainly about why Helen Mirren's character had to go through all the trouble of going to Germany and askin McKellen's character if he was a nazi and all that if she already knew. I mean ok going to Germany to get what she needed (that hair or whatever even though for me that didn't seem much of a proof or whatever). I mean if digging deeper in story then can find many loopholes, but without doing that, it was very nice movie"}, {"rating": "3", "text": "The movie was going pretty well, until the end. The twist was unexpected, but it also came out of nowhere. Ian Mckellen is a talented liar and a ruthless criminal. Throughout the movie, he tries to gain the trust of Helen Mirren in order to gain her fortune. So, what’s the big twist? Maybe Helen Mirren knew Ian Mckellen’s motive all along and was testing to see if he changes his mind and decides he actually loves her? Maybe she’s trying to get revenge because Ian McKellen wronged her husband or son! Nope. Let’s just say Ian McKellen raped Helen Mirren during WWII! Brilliant! It’s just silly. The ending is a confusing mess that just ruins the whole movie."}, {"rating": "4", "text": "This was, unfortunately, slow and predictable. The lead performances are good, but there’s something missing from it all. You keep expecting some tension or unforeseen twist that really makes you think, but it never materializes. Maybe I’m not the target audience? Frankly, I’m not sure who is for a snoozer like this."}, {"rating": "6", "text": "Personally, it's great to see two established actors like Helen Mirren and Ian McKellen leading a good and interesting mystery thriller.While the story doesn't help them entirely, they're both so good at what they do that of course it helps a lot to turn this movie into something better than the average.The problems of course are inevitable and the one that ends up affecting most of the story is how predictable it can be. It's not that you infer the twist but that you know it's inevitable that it will come, therefore that element of surprise goes out the window.Another problem, although not big, is how calculated all its elements are. In some thrillers it works great but here things feel a bit automated and there comes a point where the plausibility of the characters begins to fade.It doesn't close consistently but it's conclusive enough.It's not a sensational or extraordinary film but it has other advantages over many other mediocre thrillers, so of course I recommend it."}, {"rating": "3", "text": "When a movie features a scene where the two aging stars go to a cinema to watch a Quinton Tarantino film you sort of know what to expect from the ensuing screenplay and, it’s exactly as you might expect. Just as Tarantino copies everyone else’s movies this overreaching con job copies the copier. Chock full of un-surprising surprises this stylized mess ticks all the director’s boxes, gay collaborators, bloody moments of needless gore, a con within a con that’s too clever for its own good – which just might leave analytical members of the audience wishing it would stop outstaying its welcome. The two stars are worthy of a far better script than this prawn head dressed up in a Lobster’s shell - even with its stylish cinematography and moody Carter Burwell score, it’s a disappointment. Another for those who gloss over the surface of their entertainment, without thinking all that much about it."}, {"rating": "1", "text": "(Mauro Lanari)A \"Pacco, doppio pacco e contropaccotto\" (Loy, 1993) between two over 70 years old with zero credibility and brutalized by a Tarantinian revenge. \"A con-artist movie that is something of a con itself\" (Barry Hertz, \"The Globe and Mail\", November 15, 2019)."}, {"rating": "8", "text": "I liked this film for the final plot twist at the end and also as both of the main cast members are big names and its nice to see them working with one another. The idea of McKellen as a retired conman is somewhat appealing and the way the plot turns out is quite satisfying - I won't say anymore, so as not to provide big spoilers. Yes I'd recommend this film."}, {"rating": "7", "text": "A film that was able to hold on to the mystery for a long time. The story was exciting without ‘over the top’ action. The plot took its time. It suited the story. The story was a bit predictable. Nevertheless a nice movie!"}, {"rating": "5", "text": "Both McKellen and Mirren are great in the film, but their characters aren't interesting enough in an already uninteresting plot."}], "recommendations": ["gone_girl", "the_loft", "man_on_a_ledge", "now_you_see_me", "broken_city", "a_perfect_getaway", "the_accountant", "before_i_go_to_sleep", "the_next_three_days", "what_happened_to_monday", "flight_of_the_phoenix", "i_see_you", "the_usual_suspects", "the_number_23", "run", "nerve", "the_prestige", "shutter_island", "bad_times_at_the_el_royale", "red_sparrow", "the_call", "knives_out", "cube", "the_equalizer_2", "lucky_number_slevin"]}