{
  "id": 1777,
  "title": "The Pursuit of Happyness",
  "starring": [
    "Will Smith",
    "Jaden Smith"
  ],
  "runtime": 117,
  "genre": [
    "Drama"
  ],
  "description": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f6l9rghSHORkWLurUGJhaKAiyjY.jpg",
  "categories": {
    "plot": 6.076923076923077,
    "acting": 6.64,
    "ending": 3.8333333333333335,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.4,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Horatio Alger meets The Bicycle Thief. Look, I'm as thrilled as anybody that Chris Gardner, the real-life figure on whom this movie is based, beat insurmountable odds to become a big-time stockbroker, caring for and feeding his little son (and sending him to what is apparently the world's crappiest day care center) while doing it. And I have no problem whatsoever with the critical acclaim and Oscar nomination that Will Smith has received for his heartfelt performance, although I can't help but wonder if Smith would've been as effective in maintaining such convincing screen rapport with child actor Jaden Smith if the latter weren't Will's own offspring. But this movie is so relentless in its apparent aim to make the audience feel as miserable (oh, excuse me, miserYble) as possible most of the way that the childish knock-knock joke that concludes the film, while not being all that funny in and of itself, got as big a reaction from my theater audience as the \"bean scene\" from Blazing Saddles normally would've...simply because it represents a change of pace, never mind how tiny, from two hours of punishment. I'm often a real sucker for good inspirational movies: I loved Akeelah and the Bee, The World's Fastest Indian, The Prize Winner of Defiance, Ohio, Gridiron Gang and the current examples Rocky Balboa and Freedom Writers, but all of those featured abundant moments of humor or joy to counterbalance the required scenes of hard knocks and heartbreak; conversely, I couldn't have wanted to exit The Pursuit of Happyness quicker if the theater had caught on fire! As the old blues song might say, if Gardner as depicted here didn't have bad luck he'd have no luck at all; he can't give away the bulky, outmoded medical devices he starves himself trying to sell to doctors, but that doesn't stop them from being frequently stolen; when given a crucial phone number to call for a job interview, he not only can't find something to write it down with, but people keep shouting other numbers at him while he's desperately trying to commit it to memory! After a while, this accumulation of obstacles reaches such a ridiculous, almost Pythonesque, red alert level that I actually found myself derisively laughing at it; callous as this may seem, my conscience is clear because the filmmakers seem to be fudging several crucial facts in order to artificially intensify the pathos. Apparently the real Gardner's son was an infant (not a preschooler) at the time, and apparently the Dean Witter brokerage firm didn't make Gardner and his 19 competitors do intern work for them for nothing, but paid them a small pittance...so if screenwriter Steve Conrad and director Gabriele Muccino are this willing to play fast and loose with the facts, then why should I automatically buy into their portrayal of Gardner's estranged wife as the biggest harpy on earth? I smell more than a whiff of Cinderella Man's fraudulent portrayal of the infinitely more complex than depicted boxing champ Max Baer as a one-dimensional sadist here; Conrad and Muccino are such enemies of fairmindedness and nuance here that they even make Thandie Newton (a very good actress) LOOK as unattractive as possible, even when she's down to bra and panties! But the worst aspect of The Pursuit of Happyness may well be the aftereffect that occurs down the road, as some of the same American corporations that a few years ago rocketed Spencer Johnson's book Who Moved My Cheese? to Number One on the bestseller lists by buying crates of it in order to convince their employees that being downsized is the best darn thing that could possibly happen to them begin doing the same with this movie on DVD, in essence to tell the rank and file, \"Look, so what if the CEO's giving himself another raise and you a pay cut? Be glad we pay you to come to work at all !\" If that's indeed what happens (and I don't doubt that it will), then The Pursuit of Happyness will make the long leap from simply being a bad movie to becoming an instrument of evil."
    },
    {
      "rating": "8",
      "text": "by far one of the best movies ever made in my opinion. I don't get the negative reviews, either after taking a look. Some say \"depressing and unrealistic\"? I am sorry what? Life, for many of us is no privileged fairytale. It's very realistic especially for time period movie is set in. Other review \"knock knock joke sucked\" Seriously? THAT's the takeaway from the movie for you? Pathetic. These negative reviews strawman and pinpoint stupid things from movie."
    },
    {
      "rating": "8",
      "text": "The Pursuit of Happyness is directed by Gabriele Mucino and stars Will Smith.  This movie is an amazing movie from Will Smith's prime.  The acting in this movie is outstanding although the film can feel repetitive at times. I almost cried in this movie and  I never cry.  This is a great movie to watch with your girlfriend on a Friday night.  I would give it a B+."
    },
    {
      "rating": "10",
      "text": "great movie. anyone who disagrees is a blind fool. it shows how real men take care of their kids. also a great movie on learning how to be a father and getting to know your kid. i don't even want to get into the motivational and other aspects of the movie. great acting jobs all around."
    },
    {
      "rating": "3",
      "text": "It's obvious from the beginning that the man on whom The Pursuit of Happyness is based was the subject of an episode of Oprah because the film plays out as if it were Letterman reads Oprah Transcripts! An hour and a half of suffering, desertion, rejection, suffering, humiliation, suffering, evictions, incarceration, suffering and the final fifteen minutes of finding ones inner-spirit, perseverance and redemption. Will Smith is the suffering hero in a role that seems to be written solely to get him an Oscar nod as a likeable, self confident man with a young son but not a single friend or relative willing to put him up for a night! Give me a break. With a foreign director and Oprah's endorsement to give it weight, it probably will get Mr. Smith his Oscar nomination, which means it's too late for Matt Damon or Ryan Gosling to get that kind of recognition they both truly deserve. Next year, go on Oprah!!"
    },
    {
      "rating": "2",
      "text": "I love Will Smith and you will love his real life son as that is the only worthwhile part of watching the movie. As for the rest, the script is totally lame, and the acting laughable. This is one very depressing movie but is so egregious in that nothing makes common sense that it loses its audience long before the conclusion. Will Smith portrays Rocky Balboa in the white shirt world. How much more can be dumped on this man? Avoid."
    },
    {
      "rating": "1",
      "text": "Too depressing for words and totally unrealistic. Will's real life son is a natural born ham as he steals the show."
    },
    {
      "rating": "2",
      "text": "Obviously a film called \"The Pursuit of Happyness\" is going to be provocative, especially as we see so little of the man's inner journey, and so much of his running around with a x ray machine chasing a buck. Good luck to the guy.. he had to put food on the table and provide for his son under difficult circumstances. But what happened to him when he got rich? Who is this man and why should we care as long as we dont get to find out anything about him other than the fact that he is a real tryer. Is it too much to ask? I mean, i don't want to accuse the film of being shallow or anything. You don't have to get into politics or ideological whatnot to wonder what on earth was the point of the movie. Or maybe you do. For a second i thought the film itself was actually mocking him when his son told him that joke...knock knock.. who's there?.. nobody.. nobody who?.. (silence). When his wife walks out on him, all he has to say is \"YOU ARE SO WEAK!\". And off she goes. So does he think he is \"strong\" and if so, how does it make him feel to have to go through all this pride swallowing, dignity sapping stuff day after day? Who the hell is this guy and does he have anything to say? How did he run his company after all this? Was he a good boss and a good man to work for? etc etc Will there be a part 2 or will we never get the chance to find out. Alas, this film goes no further."
    },
    {
      "rating": "2",
      "text": "I thought I was watching \"Chariots of Fire\" with all the running. This movie reaks of propaganda. Pursuing happyness comes from within, not from getting a job as a stock broker which the movie never touched on. Did anyone notice that the \"lower class\" kept stealing his machines but the \"upper class\" corporate world gave him so called, happyness. Talk about boot licking. It was a depressing movie full of subliminal messages of how the corporations give us the happYness we seek. Y is the male cromosome for a male dominated world."
    },
    {
      "rating": "0",
      "text": "Just the same boring scene repeated over and over. We all know how it's going to end so why not explain the characters? Where are the friends and family. How do coworkers not understand the gravity of the situation and offer to help? Who would invest money in a trainee without knowing the relationship will grow? The entire movie is preposterous from beginning to end. Awful!"
    },
    {
      "rating": "3",
      "text": "I thought this movie was just a real downer. It kept dragging on and on, and from the moment it started you knew how it was going to end. I liked the ending the best not because of the happyness, but because I could finaly leave."
    },
    {
      "rating": "2",
      "text": "Will Smith spends the majority of this film running around in a suit and thanking people earnestly. Very disappointing and way too cheesy. Cringeful in fact. That's 2 hours of my life I'll never get back. An awful film."
    },
    {
      "rating": "0",
      "text": "Please spare me this story had more holes than swiss cheese. Are we to believe that he sacrificed his wife, endangered his child and took a job without any compensation with his chance of success being less than 1%? If you believe that I have a bridge I would like to sell you. And his employer is portrayed as insensitive biggots. And do you think that a major financial institution would let a trainee/cold caller go see a very successful pension fund manager alone? Do you think that pension fund manager would even consider meeting with a trainee? Try using your brain instead of the garbage that Hollywood shoves down your throat. This is an awful film in which white is rich and happy and black is poor and downtrodden. And where were his friends and family to offer support financial or otherwise. This film was offensive."
    },
    {
      "rating": "0",
      "text": "Purusit of the almighty buck might be more like it. This is a poor movie with cliches at every corner. The character Will Smith had spunk but lacked brains or common sense. When you disect the glitter all that remains is a very poor script that is depressing and lacks reality or humanity. Avoid."
    },
    {
      "rating": "1",
      "text": "He starts smiling when he gets the job. Doesn't he know his life just ended? Will's subliminal message is \"get white\". This movie is shamed by \"My brother's keeper\", about ten years ago, where the real currency is between family who love each other and forego materialism. The information about how he sold his share of a business for a million dollars make me sick to my stomach."
    },
    {
      "rating": "5",
      "text": "I didn't get it. I couldn't sympathize with a man who would keep his son with him while homeless. It seemed a bit selfish. Also being a slave just to get a job at Dean Witter doesn't say much about Dean Witter or stock brokers (high priced salesmen)."
    },
    {
      "rating": "0",
      "text": "predictable story about how much garbage you can eat without complaining. The ending was sadly lacking and there were no character development to explain the lack of family and friends. To be a successful stock broker you have to have one part used car salesmen and two parts attorney in you. Will Smith had neither."
    },
    {
      "rating": "0",
      "text": "I don't even need to see this dreck to know that is another piece of Puritan work-ethic, unchecked capitalistic, bootstrap crap. How come nobody ever heard of this \"real\" person until the movie was released? Probably because he was fabricated for the movie's publicity. In other words, he never truly existed and still does not truly exist! It's just like that awful mess, \"Erin Brockovich.\" I mean, who ever heard of this broad before the movie? But, ta-da, when the movie is out, we all hear and see the \"real\" Brockovich, bosoms and all, on the news shows. The suit was most likely filed by the head of a multi-million law firm, and the secretary he was having an affair with got the credit and money to shut her up. That is the least astonishing conclusion. So I won't get sued for libel, this is my opinion, not proven fact. Unfortunately, I saw \"Crock-O-Bitch\"; I will not make the same mistake with \"Pursuit of Crappyness.\""
    },
    {
      "rating": "0",
      "text": "All down, down, down, down -- goes on too long with such agony. Not sure the when the man got the job that he actually won. Too depressing."
    },
    {
      "rating": "0",
      "text": "This was possibly the worst film I've seen. The entire movie is a montage of Will Smith running from place to place and snapping at people. We never get to see how he succeeds in his internship or the ways in which he works harder than the others around him. Every remotely compelling part of this film is shown in the previews. People seem to have made up their minds about loving this movie before taking the time to actually watch it. Long, boring and tortuous."
    },
    {
      "rating": "10",
      "text": "I'm surprised with the negative comments. This was a fantastic movie, dare I say the best movie I've seen all year. Seldom do movies capture the essence of the importance of life with such heart. I loved everything about it and highly recommend it."
    },
    {
      "rating": "0",
      "text": "This piece of junk edged out Babel as the worst film I saw in 2006, and stands firm as maybe the worst film I have ever seen. Definitely top five. The entire over-long endeavor essentially presents scene after scene of Will Smith running, being a jerk to people, running some more, riding busses, disobeying pedestrian traffic laws, sitting down, laying down, running, etc., etc. If you like this film you just have horrible taste. I can reach no other conclusion."
    },
    {
      "rating": "9",
      "text": "this part of my life.. this part right here..The Pursuit Of HappynessBrooding into its tragic situations Will Smith breathes life into the character, whether be it then portraying guilt, suffer or hopelessness; in this light drama The Pursuit Of Happyness, that questions some basic issues molded with innocence."
    },
    {
      "rating": "7",
      "text": "Much better than average. I liked the determination, motivation, and committment Gardner shows. Yup, it was predictable, and also a little bit too long, but that doesn't take away from the story. It's great to see a movie that isn't full of sex, violence and profanity."
    },
    {
      "rating": "8",
      "text": "The acting in this film outshines the film itself. Which means a lot considering this was a good film. It nearly rises to the level of great but falls short. Will Smith gives a performance that will surely get recgonized by Academy voters. The only thing that dragged this film down were its lighter moments in which everything seems normal. Will Smith's son gives a standout debut as well."
    },
    {
      "rating": "8",
      "text": "It's a great movie It inspire me."
    },
    {
      "rating": "5",
      "text": "Likeable characters and good acting, but would've been more inspirational if Smith had been working toward becoming a teacher, social worker, or other do-gooder. The message seems to be, work hard and you, too, can become rich helping other rich people avoid paying their taxes."
    },
    {
      "rating": "9",
      "text": "It was a good film with a fine performance by Will Smith. How ironic that the story about the grueling experiences of a down on his luck loser could also be one of the most inspiring films in quite some time. Here is hoping that Will Smith gets an Oscar nod for his understated performance."
    },
    {
      "rating": "10",
      "text": "This is what the world of father's need to see, this is one of the main problems going on in America. Men not stepping up to the plate and being the father that children need. This is a true example of a father."
    },
    {
      "rating": "5",
      "text": "The movie really dragged and we saw nothing that happened after he finally became a stockbroker. I thought the acting was below par also. Drama is not Will Smith's strong suit. Needs action movies."
    },
    {
      "rating": "4",
      "text": "Long and not very engaging, it certainly did not live up to the pre-release hype. I never felt pulled into the story, Will Smith was not nearly as compelling as I had hoped."
    },
    {
      "rating": "10",
      "text": "This movie is a perfect example of how anybody can get back on their feet. I loved it."
    },
    {
      "rating": "8",
      "text": "Good stuff. I enjoyed this movie a lot. Congrats Will Smith! Although the ending was a bit disappointing."
    },
    {
      "rating": "9",
      "text": "One hell of a good movie, and makes me appreciate my life so much more. Its a story about a guy who had a dream, went staight after it, and got it in the face of overwhelming odds. I was also expecting that this would be another picture portraying all whites as bad people, but it wasn't like that at all. In fact, while the people from his own neighborhood largely rejected him and kicked him out, it was a bunch of rich white guys in suits who ended up giving him his chance (after he worked like crazy to make it happen). It was an ironic twist to a wonderful film. I am also no Will Smith fan, but he was perfect in this role."
    },
    {
      "rating": "8",
      "text": "The lack of subtlety is distracting in some scenes. Also, the father and son operate in a vacuum oblivious to the importance of others. Otherwise, fine show, true-to-life, both realistic and upbeat, with valuable lessons. Time well spent."
    },
    {
      "rating": "10",
      "text": "This was a great movie. It made my husband cry. Will Smith did a great job and I now no only see him as a comedian but also a great actor."
    },
    {
      "rating": "10",
      "text": "The Story is great! Chris Gardner work so hard to get a job! The Funny Part is when he said \"I Cant Spell Happieness\"and he got hitted by a car! Story is about the on and off-homeless salesman-turned-stockbroker Chris Gardner and his son Christopher!"
    },
    {
      "rating": "10",
      "text": "Some serious acting from Will Smith. This and I am Legend show off his skills well, and if you find it boring, then maybe you should try to appreciate the achievements a bit more."
    },
    {
      "rating": "6",
      "text": "I love Will Smith's acting and his son is very good, but this movie is just too depressing. It was all about the \"pursuit\" and almost nothing about the happYness. I agree with most of what was said by the 2 rating reviewer. It seems unbelievable that someone can shoot them shelves in the foot so often. If he was so bright, why couldn't he just get a real job for awhile to keep his wife and family together when it was obvious the machines were poor sellers. It made me think the producers wanted to manipulate viewers into an unreal sympathy for the characters."
    },
    {
      "rating": "10",
      "text": "I loved it. It was a story that I have seen in front of my eyes before. I have a friend that is going through hardship, but has determination to make it through. It was beautiful to see smith react with his son. Oscar nod should be a definite, oscar win a great possibility."
    },
    {
      "rating": "6",
      "text": "Good acting by Will Smith and his son. However, there are two disturbing acts that question whether they should have been portrayed differently. In one scene, Will tells his son to \"Shut Up\", and in another he viloently shakes his son. Do we really want to see this on film, thus validating this type of behavior?"
    },
    {
      "rating": "10",
      "text": "It was a great movie. Will Smith had an outstanding performance."
    },
    {
      "rating": "10",
      "text": "The movie is great. EVERYONE in here that gave this movie less than 5 stars must either a) hate their own life and situation, or b) hate the fact that there ARE people like this out there- that don't give up. It makes me sick that the bulk of the criticism boils down to - it's unbelieveable (even though it's true), or why should anyone succeed because there are so many people suffering. That mindset is not only idiotic, it's dangerous. I bet if it depicted rich white people losing everything and winding up in the streets, they'd give it a 10. stop the hate."
    },
    {
      "rating": "10",
      "text": "This is a wonderful movie and so nice to FINALLY see a show that has some good moral values! Will Smith is a wonderful actor. It is so good to see a self made person and to know that determination pays off. This story is about Chris Gardner's life, not a made up fairy tale. This man is a very successful broker and recenty sold his brokerage firm and is using his monies to help others. Not just people here in the US, but other countries as well."
    },
    {
      "rating": "10",
      "text": "I have been in pursuit to find a great movie, one that evokes emotion, intelligence and one that is worth the cost of movies these days. I was Happy to find \" The Pursuit Of Happyness\". The most compelling part is when Chris Gardner tells his son to pursue his dreams no matter what. It was inspiring to see powerful positive words used to overcome the darkest shadows that the world can cast. It embodied my thoughts on how I would react in that type of situation, it is a true story, one that takes a strong sense of character to live through. This movie was beautifully told, a strong movie that allows one to think beyond the surface, to think deeply with our hearts. Something the world is lacking at the present time. The Pursuit of Happyness will make you think, and feel, for we all have dreams, and most importantly this connects all of us, for everyone is in pursuit of happiness."
    },
    {
      "rating": "10",
      "text": "A wonderful movie that leaves a lasting impression; one of the best I've ever seen."
    },
    {
      "rating": "9",
      "text": "I enjoyed this movie a lot. Not only did I think the acting was great, but it's nice to see movies about something for a change. Biography type movies make you remember that not everyone who is doing well for themselves was born with a silver spoon. And in watching this movie it allowed me to research a very respectable and decent person, in which this world is running short on. I thought Will and Jaden Smith did excellent jobs on portraying their character and not just being \"that actor\" in \"that movie\". For those of you who make opinions with basis, you are completely entitled to your opinion, but you shouldn't make comments without all the facts."
    },
    {
      "rating": "2",
      "text": "Obviously a film called \"The Pursuit of Happyness\" is going to be provocative, especially as we see so little of the man's inner journey, and so much of his running around with a x ray machine chasing a buck. Good luck to the guy.. he had to put food on the table and provide for his son under difficult circumstances. But what happened to him when he got rich? Who is this man and why should we care as long as we dont get to find out anything about him other than the fact that he is a real tryer. Is it too much to ask? I mean, i don't want to accuse the film of being shallow or anything. You don't have to get into politics or ideological whatnot to wonder what on earth was the point of the movie. Or maybe you do. For a second i thought the film itself was actually mocking him when his son told him that joke...knock knock.. who's there?.. nobody.. nobody who?.. (silence). When his wife walks out on him, all he has to say is \"YOU ARE SO WEAK!\". And off she goes. So does he think he is \"strong\" and if so, how does it make him feel to have to go through all this pride swallowing, dignity sapping stuff day after day? Who the hell is this guy and does he have anything to say? How did he run his company after all this? Was he a good boss and a good man to work for? etc etc Will there be a part 2 or will we never get the chance to find out. Alas, this film goes no further."
    },
    {
      "rating": "8",
      "text": "A very good movie. I'm not sure why all the negative comments, especially from some people who haven't even seen the movie!! Will Smith does a very good job, and his son is a natural. By the end, I forgot I was watching Will Smith. He completely became his character. I think this movie will resonate with anyone that has had to make a hard decision in trying to make a better life for themselves or in chasing down a dream. It makes you really care about the main character and root for him to succeed."
    },
    {
      "rating": "10",
      "text": "I give this movie a 10 because it teaches a life lesson about motivation, and how Chris was motivated to become a stock broker. It is a good movie for someone to watch that needs motivaton."
    }
  ]
}