{
  "id": 3615,
  "title": "The Social Dilemma",
  "starring": [
    "Skyler Gisondo",
    "Kara Hayward"
  ],
  "runtime": 94,
  "genre": [
    "Documentary",
    "Drama"
  ],
  "description": "This documentary-drama hybrid explores the dangerous human impact of social networking, with tech experts sounding the alarm on their own creations.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jcaM6V2tCtu6iMHDsGLBUbaYgYp.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 8.666666666666666,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Misleading in the worst possible way, the first part of the movie is good at highlighting the problem, but the second part of the movie is confusing, fear-inducing and the very thing that the movie warns you about. You leave the movie with a feeling of hopelessness that is completely unnecessary: there are solutions, and the engineers in the documentary know about the solutions, they are simple, but they aren't allowed to say them."
    },
    {
      "rating": "7",
      "text": "A really entertaining documentary with some fantastic subjects. Gives a really great insight into the tech world from ex-senior execs at the biggest social media companies. The dramatization parts let it down and it becomes too heavy handed in it's message. I agree with most of what the Doc has to say, though the heavy handedness is a bit overwhelming. Overall I really enjoyed it, great content and interviewees.. just go into it with the same objectivity that the filmmakers want you to go into social networks with."
    },
    {
      "rating": "7",
      "text": "I knew I was in for a documentary-drama on the dangers of social media and its excesive use (abuse). In an age where no teen is left behind of this new tools of conformity, one can't leave any stone unturned, especially those of us with kids. Very eye and mind openening in regards to the traps and methods used by large social media companies to shape us and direct us towards their goals.But the discerning mind can't help but notice the left-wing tendency of the documentary. They were doing very well on the pyschological effects of Instagram on teen girls' self esteem when all of a sudden we are talking about tumbling democracies and, oh, surprise, influencing elections. The second third of the documentary is all about politics and Facebook. They lash out on Zuckerberg's social media, when in fact Twitter is far more toxic and dangerous.While I do too belive that we are more divided than ever as humans, of course, the filmmakers very thinly accuse Facebook and Russia of dismantling democracies. They just never mention Trump because they are too wise.So they end up doing the very same thing they accuse the social networks of doing. Trying to influence your thought and ideas about politics, but now via Netflix (who, mind you, employ some of the very same tactics social media uses to keep you hooked).Finally they get back to the psychological and emotional effects of the abuse of SM, and suddenly it ends with the best advice of the whole movie: Delete your social netwoks. Especially Facebook, they said."
    },
    {
      "rating": "10",
      "text": "This documentary offers some insights and arguments that I hadn't thought about before. It implies that social media is in a way responsible for a wide range of social problems we face today. Many of which I had not linked to social media before.I believe it is one of the most important things to watch in 2020 and I will recommend it to everyone I know.Do watch it!"
    },
    {
      "rating": "8",
      "text": "”If you’re not paying for the product, then you’re the product.”Gostaria de dividir essa review em duas partes: crítica e opinião/experiência pessoal.\"The Social Dilemma\" é um documentário importantíssimo, que desenvolve muito bem as consequências de uma sociedade que, a cada dia, caminha para um fim devido a sua ignorância e auto-alienação.A produção como um todo está bem acima da média. A cinematografia é impecável, com uma elegância necessária para devido assunto. A narrativa intercala muito bem os três atos, e a \"mini-trama\" caminha muito bem continuamente, o que serve para observarmos alguns efeitos que parecem inofensivos na prática. As entrevistas são muito bem conduzidas pela direção na edição de vídeo, que sabe muito bem como extrair o melhor delas de acordo com o momento do filme. A OST aqui presente acrescenta muito na atmosfera, e a caracterização visual que eles criaram da tecnologia é bem intuitiva pra quem não entende tanto do assunto.A gama de informações contidas nesse longa é enorme. Se você, assim como eu, entende um pouco de sistemas de informação etc, já deve saber de uma boa base abordada, mas eles aprofundaram muito o tema, trazendo a discussão ao publico leigo e elevando o nível da mesma ao trazer pessoas relevantes. Há um certo tipo de dramatização do segundo ato em diante, que eu acredito ser bem dosada, impactando em pautas mais serias e deixando um nível de seriedade em outras. A narrativa é tão bem feita que, ao longo da obra, é como se uma mini-historia passasse pela sua cabeça, relacionada a acontecimentos que são exatamente iguais aos que ocorrem e são relatados no filme.Enfim, como relato pessoal, eu deletei todas minhas redes sociais há quase 2 anos - parece que faz muito mais tempo. Eu as deixei por questões de \"segurança biopsicologias\". Saber o que as redes me proporcionavam, como vicio em dopamina, alienação devido a bolhas sociais, reacionismo devido ao imediatismo, estado de alarmismo por conta das notificações, tempo perdido com algo fútil, necessidade de atenção e aceitação; enfim, eu poderia listar pontos negativos a noite toda. E sim, eu posso afirmar que me sinto muito melhor depois de abandoná-las. Ainda não estou completamente livre, pois o youtube me suga muito tempo, mas comecei a regrá-lo e limitá-lo há algum tempo e vem dando certo.\"The Social Dilemma\" trabalha com temas que dizem respeito ao intrínseco da sociedade atual, que não faz a minima ideia de que está sendo manipulada, o que pode nos levar ao completo fracasso - exceto se comecemos a mudar as coisas agora.Audio: English, with Portuguese subtitles. Q60T 50' TV Speakers [Dolby 5.1]Quality: 4k SDR [Netflix]"
    },
    {
      "rating": "3",
      "text": "A bunch of low to medium tier tech elites drone on about how society is going to collapse because they flew so close to the sun.  If only they had thought about the repercussions of their brilliance before they unleashed their radiant light upon us we might have been able to survive this modern craned neck dystopia.Each one seems to think think that silicon valley invented advertising.  They think all mass media hasn't been using these same techniques for decades.  At one point, the main scion of social media, compares the tech advertising model to a bicycle.  A bicycle never manipulated you into buying Coke over Pepsi did it? How about comparing it to any of the following: TV, Movies, Video Games, Music, Books, Newspapers.Absolute waste of time.  You're better off staring at a wall. At least you won't be stupider afterwards."
    },
    {
      "rating": "7",
      "text": "A first hand look into the most frightening aspects of social media. The testimonies of the insiders are great. The details they give about the industry should make many people think about when they share something on Facebook or Twitter. The enactments are kind of cheesy, but overall it's a very engaging documentary."
    },
    {
      "rating": "8",
      "text": "Great documentary. Harris shares how these companies prey on our psychology for their own profit. This is a problem that we all heard of one time, but forgotten on a daily basis."
    },
    {
      "rating": "8",
      "text": "As someone who has had mental issues excaserbated by social media, this documentary helped me understand more about the manipulation these platforms are doing to increase profitability. There were some new bits of information that I became aware of due to this film, but I've also seen videos of Jaron Lanier on Youtube and was a bit familiar with them thanks to him. For me, disabling Facebook helped my mood significantly, and it makes me wonder how much less divisive the world would be if it were gone tomorrow."
    },
    {
      "rating": "5",
      "text": "The same **** was said about video games...look at that industry now......................................................................................................"
    },
    {
      "rating": "9",
      "text": "Part documentary and part drama, The Social Dilemma is an eye opening and terrifying film to experience that makes you question your use of social media. Ironically, im using social media to talk about it but none the less with a great cast and a simple but captivating story, the Social Dilemma is a must watch for those who are interested"
    },
    {
      "rating": "5",
      "text": "Though the cautionary tales here are noteworthy (especially for the younger and more impressionable users of social media), \"The Social Dilemma\" tends to sideline such personal attributes as choice and free will in presenting its arguments, as if we're all too weak-willed to make decisions for ourselves. As a result, the absolutist nature of its contentions weakens their impact, suggesting that our behavior is unavoidably alterable and that we're all ill-equipped to handle the compellingly manipulative forces of technology and an intrusive business model relentlessly driven by profits at all costs that are mercilessly thrust upon us. What's more, the film under-emphasizes the human factor in the creation of these issues, generally putting the blame more on the technology that drives them than the individuals who initiated them, as well as on those (i.e., virtually all of us) who obviously lack the personal power to drag themselves away from these destructive influences. Through interviews with former social media and information technology experts, backed by fictionalized examples illustrating their assertions, director Jeff Orlowski's documentary makes some valid points that we should all be aware of, but its dogmatic approach -- despite the inclusion of some tangible and scary real world incidents -- effectively removes us from the equation in being able to do anything about it. A handful of solutions is offered to address this social dilemma, and fleeting references to the benefits this technology has afforded are given passing acknowledgment, but the prevailing outlook is one that we're all doomed by our inherent ignorance and an inability to protect ourselves. Personally, I refuse to give up that easily, and I'm troubled by a film that suggests resistance is futile. Responsibility is key, something this offering makes little allowance for."
    },
    {
      "rating": "7",
      "text": "This documentary perfectly articulates several nagging points of paranoia I have felt in the last 10 years of social media use and expansion. 1. Our daily consumer habits are being watched,tracked and monitored in order to sell to advertisers. Advertising uncannily responds, seemingly, to our most private of consumer impulses, to the point of it feeling like it can read our minds. Every platform, WhatsApp included, appears to be harnessing digital algorithms to triangulate our next purchase and take money so that advertisers can reach us and entice us towards their products. 2. Politics has become shockingly polarised due to social media's endless solipsistic feedback loop of confirmation bias and obfuscation of countervailing opinion. We are being radicalised by social media's promise of cosseting us with what we already like. Hence why the world is collapsing as the ideological battle for culture and political power is being waged at cross purposes on social media. Everything everywhere is partisan and our tribal instincts are being played out online and in the real world, whether you are left wing or right wing.3. Mental health has been hijacked by the engineered addiction cycle big tech has baked into social media. And, this has lead to massive increases in depression, anxiety and suicide. Social media is not good for our health as it has atomised and personalised our human interactions into abstract pavlovian rewards on a smart device. We are spiritually lost the more social media we use and the more our world becomes reliant on it to remain socially relevant and mobile. Things like Instagram, where we are confronted by daily reminders of our own shortcomings foster a sense of lack and low status. 4. We are poised on the precipice of some kind of social tipping point where the over saturation of social media is at the centre of our existential crisis. The projection is that things are only going to get worse. Hysteria, outrage, fear and disunity will only deepen as we move forward, as our collective neurosis mounts on top of us. And, the way out of this lay not just in our sense of individual responsibility but also in the hands of big tech itself, and any political oversight that can be leveraged to regulate the ill effects of unbridled silicon valley advancement.  So, how do we solve it? The documentary is flawed, and succumbs to some level of contradiction by engaging in a biased political view of the problem. It has selective focus. However, it slightly overstates, oversimplifies and disproportionately attributes cause to silicon valley in my opinion. Some human problems lay at the feet of our own human algorithms, built of our evolutionary circuitry. However, our incentives may be human and inalienable to some degree, but our social policy need not be so willing to play to those most base of human impulses for profit. Not all human problems can be solved but some problems are created and exacerbated by the systems we create and maintain. The film suggests we delete our social media as a way to curtail its spread and effect on our daily lives. It's not offered as a fix all or panacea, but as a starting point. I suggest that, as a person who routinely deletes apps, accounts and is constantly monitoring their usage, the most pernicious aspect of social media is that our very economic mobility is intricately tied to our social media presence now. By outright quitting social media you are effectively opting out of a public utility used as a standard highway to navigate modern life. Digital objectionism is the modernised equivalent of moving to a mountain shack and living off the land, a step made more extreme by our increasing reliance on technology for basic survival. In conclusion, the documentary is spreading awareness and attempting us to ask bigger and deeper questions about how our reality is shaped by our technology. That's a good thing."
    },
    {
      "rating": "10",
      "text": "It’s the important documentary of all time. I let everybody watch this. It changed my mind"
    },
    {
      "rating": "9",
      "text": "Mixing drama and documentary, it is a dissection of social networks and how they influence people more negatively than for the better, by the way they manipulate or enslave them through rumors and unfounded news. At first it feels slow but it grows like a snowball. After viewing it, you will not see your Facebook, Twitter, Instagram or WSP accounts in the same way."
    },
    {
      "rating": "9",
      "text": "This didn't get bad reviews, but I was surprised it didn't get near universal appraisal. My first thought was that it might be because of the lack of awareness that this is a serious problem, lack of understanding the point of the film, or genuine bad actors rebelling against the call out the movie gave them. Well ding, ding, ding, I'm a winner.The point of the film is not hard to figure out, as it is explicitly stated. At the beginning, they were asking these technologists what the problem was and by the end, they agreed the problem was misinformation and the inability of the general public to agree on basic facts. The fact that so many negative reviews failed to realize this is both prophetic and disturbing. As per usual, the typical radical actors have misrepresented this movie as either a shill for the right or the left, depending on which serves said actor best. Apparently this movie is critical of left wing protests and has the ultimate goal of regulating the media so as to prevent the sheeple from opening their eyes and fighting for equality. Oh, but also this movie is promoting radical left wing thought and has the ultimate goal of censoring conservative thought so as to prevent the sheeple from opening their eyes... They just don't want you to see the truth! Say the negative reviewers who range from authoritarian socialists to Qanoners who, if you don't know, have radically different ideas of what that \"truth\" might be.Some negative reviews actually rated it that way because the drama was genuinely bad, and that's fine, though I think it's weird to review a documentary the same way you would review a drama. That's the sole reason I'm not giving it a perfect 10/10. Society is only just beginning to pick up on the fact that this is a problem, so I appreciate the larger audience this movie can reach. We clearly have no idea what the proper solution is, so the movie is really just an introduction to the problem with tips to mitigate it, rather than solve it. Anyone who thinks there's someone out there sitting on the solution to misinformation while still respecting free speech is out of their mind. (Yes, delightfully I did find a review that claimed that these technologists know what the solution is but they're not allowed to say. Nothing like a conspiratorial review for a movie that calls out the spread of conspiracy theories.) The first step is just to get everyone to agree it is a problem, and clearly we're not there yet."
    },
    {
      "rating": "10",
      "text": "\"If you think this has a happy ending, you haven't been paying attention.\" #TikTok"
    },
    {
      "rating": "5",
      "text": "Anyone who believed that social media would be more of a benefit than a detriment, dreamed of a society that simply doesn't exist.Because frankly the kind of idiots that exist out there, are not a discovery, nor is it being discovered that many of the people who have access to them feel more comfortable sharing their poison all over the world. The worrying thing is to understand that these people have completely lost the ability to think for themselves because as long as they find something online that feeds their prejudices, that's completely enough for them. And if that doesn't scare you, then I don't know what will."
    },
    {
      "rating": "2",
      "text": "Without proof there is no truth. The documentary provides at most three points of evidence  throughout, let alone data. It relies on hypotheticals and apocalyptic metaphor to get their points across, which are ineffective when trying to prove them. The rest of it is inaccurate or outright provably false. It seems more like a poorly casted movie than something meant to persuade. I never leave negative reviews, but this mockumentary made me make an exception."
    },
    {
      "rating": "10",
      "text": "This is probably the most important documentary you can watch this year. I've been researching this topic for over two years now and was thrilled to see this now. High level exececutives of social media companies talk about the dopamine monster they have created. There were many new insights for me in this well done documentary. I also like that they illustrated the problem with a fictitious family. Since they didn't include early Facebook executive Chamath Palihapitiya's (responsible for growth within Facebook) quote to Stanford students that I love, I can quote him here, without spoilering anything, but the quote sums up the movies pretty well: \"I can control my decision, which is that I don’t use that sh##. I can control my kids’ decisions, which is that they’re not allowed to use that sh##.”"
    },
    {
      "rating": "8",
      "text": "This movie / documentary inspired me to delete almost all social media apps from my smartphoneand I only use social media sporadically now. I think that it could've proven a stronger point by delving more deeply into the topic, but the interviews with (former) employees of Google and other experts are impacting enough. Also it decided to go for the more flashy route, showing the extremes of social media addiction instead of focusing on the societal impact and the tech surrounding it, but, as said, it still has a lot of impact.If you're not paying for a service, you're the product."
    },
    {
      "rating": "10",
      "text": "So important to watch, especially in these times of great divisiveness. This doc exposes the core  of all of it. Please watch, especially if you have young kids"
    },
    {
      "rating": "10",
      "text": "pretty informative,a must see documentary,recommend to everyone that uses internet on daily basis"
    },
    {
      "rating": "7",
      "text": "The first half of the documentary is interesting, although perhaps a bit slow, but interesting nonetheless, information about how you are the real product in the Social Media business program, and how social media may be a pretty serious cause for teenage (and pre-teenage) suicide rates increasing. The first half is a 9/10. The second half talks about politics and its increasing polarization, and its when things get a bit messy. The documentary makes it seem like these problems are only caused by social media, and fails to explain that other factors that may even perhaps have more impact; like the socio-economical situation, and fails to make it clear that these problems existed and for the same reasons prior to social media (you wouldn’t read or buy a newspaper you don’t agree with). Note that the documentary doesn’t say that these problems didn’t exist prior to social media,it only commits the error of not analysing all the causes (which is precisely what they are protesting about in the first place, so it’s a bit hipocritical). Information and misinformation goes hand in hand, if more people has access to information, there will be more misinformation, it's a natural thing that we cannot solve quickly in a clean way (I’m not saying we shouldn’t do anything about it, though). Overall, second half gets a 5/10."
    },
    {
      "rating": "5",
      "text": "The first hour is an incredible, thought provoking look at the immense effects social media is having on our race. The last half an hour is a laughable attempt to characterise \"fake news\" as the reason for populist movements and outside the box thinking. Anyone with a working brain can remember that the \"fake news\" label was born to describe the relentless propaganda that the mainstream media incessantly forces on us through the television and social media platforms. To suggest that any social media platform has promoted \"conspiracy theories\" or anything outside of mainstream narratives is not only a lie but the complete opposite of reality. I have never once seen a Pizza Gate video or populist viewpoint promoted but almost daily see them buried and censored. Left wing narratives are to be expected on Netflix now the Obamas are on the board but to see it in an otherwise incredibly educational documentary is disappointing."
    },
    {
      "rating": "10",
      "text": "Profoundly important for the future of our democracy and our world.  Must watch- provocative"
    }
  ],
  "recommendations": [
    "before_the_flood",
    "sweat",
    "munich",
    "22_july",
    "spree",
    "the_show",
    "snowden",
    "cartel_land",
    "dark_waters",
    "war_room",
    "i_origins",
    "joe_bell",
    "the_hate_u_give",
    "the_shack",
    "official_secrets",
    "diego_maradona",
    "silence",
    "detroit",
    "mainstream",
    "free_state_of_jones",
    "in_the_shadow_of_the_moon",
    "nine_days",
    "the_legend_of_la_llorona",
    "the_case_for_christ",
    "cowboys"
  ]
}