{
  "id": 4525,
  "title": "The Numbers Station",
  "starring": [
    "John Cusack",
    "Malin Åkerman"
  ],
  "runtime": 90,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "When the moral values of a longtime wetwork black ops agent is tested during his last operation, he receives an unfavorable psych evaluation. Now he is given a break and a seemingly uncomplicated assignment of simply protecting the security of a young female code announcer, code resources and remote station they are assigned to. After an ambush and one phone call later, it becomes a complicated fight for their survival.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bcpaJ2JYM2WKzzuRUAB869uMWnK.jpg",
  "categories": {
    "plot": 6.3,
    "acting": 5.833333333333333,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.166666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Actually a really suspenseful movie  new concept, no overly complex backstory, characters that aren't overexplained. John Cusack carries the movie, the bad guys are bad and believable, the narrative is structured for slow unveil. Worth watching. No clue why the critics hated it."
    },
    {
      "rating": "7",
      "text": "Unfairly maligned by most everyone who seemed to be demanding Grosse Pointe Blank II.  This definitely is not that movie. Also not the standard action thriller suggested by the trailer.  It is a very good existential portrait of a spy/assassin ground down by the reality of his profession. Emerson Kent could be Martin Blank, 15 years later, if he had missed his high school reunion. Cusack's performance reminds me a bit of John Hurt's anxiety- ridden killer in The Hit (1984)."
    },
    {
      "rating": "1",
      "text": "And all the nonsense we do not even say that the actors brought this horror on their backs. I do not understand what he was director and screenwriter  Do not Look! Anyone who does so, that would take!"
    },
    {
      "rating": "4",
      "text": "The Numbers Station had a very interesting plot with tons of potential. The problem was, the movie was actually very boring, I hated John Cusack's take on his character, and the last 10% of the film was just stupid. Addressing each of those issues one-by-one, the bore factor was on the mediocre writing. The setting had the potential for an intense spy thriller but it was badly underutilized. As for Cusack, while I'm normally a fan of his, I didn't like the direction they went with his character. I think a Jason Bourne type of personality would've came across better on the screen. Instead Cusack almost seemed just empty. While I imagine that's what they were going for, it doesn't make for a very good protagonist. Lastly, the ending was just weak. Without getting into spoilers, it just felt unrealistic and almost rushed. For a movie that went nowhere for way too long, everything wrapped up a bit too quickly. Overall this film had some potential but was poorly executed."
    },
    {
      "rating": "7",
      "text": "John Cusack is a terrific actor and he proves it once again in The Numbers Station. Recently, Cusack has done a lot more direct-to-video stuff, deciding to be a big fish in a much smaller pond, and it has worked out very well. The Numbers Station is a secret CIA base in a secluded part of England, where encoded messages are sent to agents in the field. Emerson (John Cusack) was one of those agents, until his conscience caught up with him, and he is assigned to guard the station, a quiet, lonely job, until terrorists break in, and he is the last line of defense. A movie like this, with a small cast in a secluded location, only works if the stars of the film can keep you're attention and make the story believable, and both Cusack and Malin Akerman both do a terrific job of it. This movie is more about the intensity of the situation and the reaction of the people involved than it is about killing bad guys, and that is why Cusack was perfect choice for the lead in this film. Few actors bring the experience of intensity that John Cusack brings to a project. The story here, wasn't anything unique or extraordinary, but it was an action film from a more psychological point of few. Most action films are more about big explosions and special effects, the story is secondary, but in The Numbers Station, things are reversed and that's why I liked it so much. It's a fun film, that will keep you guessing, with a cast that will engage you the whole way. It may have been an independent direct-to-video film, but it has the bite of a much larger beast."
    },
    {
      "rating": "5",
      "text": "When one's professional ethics were tested.The idea for a film seems good, but it did not work out for this film. The screenplay lacks some good scenes. The suspense was weaker and so the action sequences. Though the film had good actors in the lead and visually looked fine, like the locations. Most of the story was set in a single location, except the opening sequence. Almost a minimal cast film. So it had all the qualities to succeed if the plot was developed smartly.The story of a CIA's field agent who has been assigned to one of their remote stations in England after he had failed to obey the order from his fellow senior officer. A code operator Katherine, whom he has to protect find himself in a tight position when their building was breached. Once again, his professional ethics are tested, but how he deals the situation is what covered in the remaining parts.Its most certain that John Cusack days are over in the entertainment industry, just like Nicolas Cage and John Travolta. But it's good to see them at least in small flicks like this. So I did not expect much from it, hence not got disappointed. But I thought it should have been better in a few areas, because I've seen lots of good B movies these days. One time watchable film, but looks like it is a simplified version of 'Wanted'.5/10"
    },
    {
      "rating": "7",
      "text": "Here's the thing:  The Num8bers Station isn't a James Bond gimmick-fest.  It's not a Wick action-murder fantasy.  It's not Tom Cruise flying helicopters into railway tunnels or going for a jog on the 80th floor windows of a skyscraper.  It's a spy flick.  The plot involves someone, apparently the Russians, using our own intelligence infrastructure against us in an attempt to decapitate the US intelligence services.  Because in the world of this film assassinations are commonplace and the ends justify the means, any means, any time, anywhere, and never mind how savage the means might be.Well, there's at least one guy with a conscience who decides that wholesale slaughter isn't quite what he signed up for.So the film delivers no glamorous super agents.  There are no fist fights or gun battles lasting half an hour.  No car chases with people driving off the roofs of buildings.  No Cigarette boats jumping from one canal to another.  No helicopters flying upside down inside aquariums full of molten lava.  No Plenty O'Tooles in bikinis.It's mostly about this one spook in a bunker.  His job:  protect the numbers, the codes, the computers, and the woman who runs them.  If that's not enough then go look for some guy in a jetsuit.  Just follow the trail of centerfold models."
    },
    {
      "rating": "5",
      "text": "Um filme com bons atores mais totalmente esquesivel, infelizmente poderia ser mais caprichado!!!"
    }
  ]
}