{
  "id": 2795,
  "title": "The Dig",
  "starring": [
    "Carey Mulligan",
    "Ralph Fiennes"
  ],
  "runtime": 112,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "As WWII looms, a wealthy widow hires an amateur archaeologist to excavate the burial mounds on her estate. When they make a historic discovery, the echoes of Britain's past resonate in the face of its uncertain future‎.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dFDNb9Gk1kyLRcconpj7Mc7C7IL.jpg",
  "categories": {
    "plot": 7.18,
    "acting": 7.346153846153846,
    "ending": 8.666666666666666,
    "soundtrack": 6.666666666666667,
    "cinematography": 6.666666666666667,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "(Mauro Lanari)\"The dig\" (of the grave)Simon Stone manipulated the real story in a single direction: Edith Pretty was involved in spiritualism, and from this he invented the classic rigmarole on the supposed immortality or eternity of love. Falsified romance stories between the two protagonists, between Peggy Piggott and Rory (a fictional character), and on the reasons for Basil's passion for archaeology. Nevertheless, the film maintains from the first scene, with Finnies hunched under the weight of age and fatigue, with the poignant soundtrack and desaturated photography, the opposite halo of a Beckettian transience: we all fail, every day."
    },
    {
      "rating": "10",
      "text": "In love with this film! Overall a very well acted amazing storytelling, a heartfelt, emotional, powerful true to life story. Fave film this year!"
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "5",
      "text": "Carey Mulligan plays a rich widow who hires an excavationist (Ralph Fiennes) to dig into the ancient mounds on her estate. This process and the discoveries are enjoyable and informative (based on true events). In an attempt to add depth, there are several subplots that stretch out the story and add too much time. Those who like period films (this is set at the verge of WWII) might enjoy the historical aspects. The characters and their complications are sufficiently interesting, but the languorous pace drags down the dig."
    },
    {
      "rating": "7",
      "text": "A slow burning character story based on real life events. Love the locations and understated performances, but for me there should have been more of the actual dig. The film also has a confused narrative, starting off with the relationship between Carey Mulligan and Ralph Fiennes' characters, then a third of the way through all these other characters are suddenly introduced and we are expected to become interested in their relationships instead. Great views of the Suffolk countryside."
    },
    {
      "rating": "9",
      "text": "Wonderful surprise film went beyond expectations! Great period piece with a fascinating true story. Carey Mulligan is marvelous."
    },
    {
      "rating": "10",
      "text": "I know this isn't a documentary or even a docudrama about the actual events.  This is a story about people.  About their passions and fears.  About life and death and the uncertainty of Britain where everyone knows war is coming.  That is the story being told with the events of this amazing find in Sutton Hoo.As a character movie, I loved it (and these aren't usually my preferred genre).  But it has also sparked my interest in the actual finds of Sutton Hoo and it's impacts on our understanding of British history.  So maybe this movie doesn't have the archeology or even the historical record exactly right, but if it makes people want to know more, then that's a bonus to the movie's credit.Don't watch this for a history lesson.  Watch it to enjoy the characters their story.  Then you can find a good book on Sutton Hoo."
    },
    {
      "rating": "6",
      "text": "I wanted more scenes about the actual excavation process. Too much time spent on somewhat hamfisted relationship stuff. Also, the music was pretty overbearing."
    },
    {
      "rating": "6",
      "text": "Despite fine production values and an excellent performance by Ralph Fiennes, this elegant fact-based period piece about a lonely widowed heiress who hires an underappreciated amateur archaeologist to excavate an enigmatic site on her estate looks great but has considerable trouble keeping its focus on the central narrative. Director Simon Stone's latest introduces a growing number of story threads as the picture progresses, many of them not particularly interesting, that draw attention away from where the film starts, a launching point that's not an especially compelling tale to begin with. The movie's lavish production values, beautiful cinematography and sweeping score help to make this release appear better than it actually is, but, once those cover attributes are swept aside, viewers are left with an underwhelming offering that's not as engaging as the filmmakers believe it to be."
    },
    {
      "rating": "6",
      "text": "For a movie that's very \"dry\", it sure is beautifully shot almost like a Terrence Malick movie, in terms of the floating camera movement."
    },
    {
      "rating": "8",
      "text": "The Dig (Netflix) is a touchingly understated film that once again showcases British reserve. It drifts a bit in the end with a distracting and rather contrived side plot, but even that cannot totally distract from this fine film, well directed and brilliantly acted.  If  you enjoy films that make understatement work as well as, if not better than overstatement, you're likely to enjoy The Dig.  As always, YMMV."
    },
    {
      "rating": "10",
      "text": "A story based on true events that works more as a drama than a documentary. The plot of how a discovery changes the life of a community, right on the eve of World War II, is sustained with excellent performances and an absorbing plot that never loses its rhythm. Do not lose sight of."
    },
    {
      "rating": "8",
      "text": "I'm always anxious to learn about real life stories like this one - one's that I've never heard about. Acting, script, and directing were all very well done and it is very evident that great care was taken to stay true to this fascinating story."
    },
    {
      "rating": "6",
      "text": "It pains me to say that despite beautiful visuals and fascinating story, the film oversteps the boundaries of creative liberties vs historical accuracy. I do realize films have to do that at times, but its pretty disturbing in this case. Again i say this with dissapointment and no malice"
    },
    {
      "rating": "7",
      "text": "For a movie with so many reviews teetering between either disparaging its direction as a Malick-wannabe or lauding it as having something eloquently poetic about it reminiscent of Terrence Malick, I was astonished to find The Dig far from being nearly as divisive as it should be. There's broad consensus that it's a well-acted and well-shot film despite its shortcomings. With only Days of Heaven under my belt (along with quite a few video essays about Malick's style), the only two rights I have here are to agree that: the comparison made here is valid; and the movie is decent at best. With low-angle, wide lens shots, wind-carried camera coming towards and away from the characters, and detaching the dialogue from the on-screen events that let us hover over the characters, it may well be argued that the technical approach rendered the film said poetic quality and a dream-like feel that implicitly beseech the viewer to give in to the meditative atmosphere that prevails the scene. Alas, this approach seems to be at odds with the most salient plotline in the story, or at least the one it was going for at first: the excavation of Sutton Hoo. For the movie neither probes into the remarkable discovery that forms the supposedly overarching thematic plotline nor does it completely ignore it. The story set it up in a fairly compelling way, only to ditch it quite early for the dramatic subplots surrounding the two lead characters, leaving the historic achievement merely skimmed over.To be fair, Basil Brown and Edith Pretty are multi-layered characters that reveal themselves more and more as the story proceeds, and I could tell that from the get-go, only looking at Fiennes and Mulligan's sorrow-laden countenances that seem to hide (and actually are hiding) secrets underneath the story would later unravel. Still, the movie wasn't keen on diving into the characters' profiles, leaving much to be desired. Then, out of nowhere, the story shift its focus to another subplot concerning Lily James's Peggy Piggott. It's quite possibly the most interesting segment in the story, and Lily James really gave one of her most riveting performances to date. Be that as it may, this jarring shift from one storyline to another is rather distracting, aggravating the movie's lack of consistency even further, and the fact Mrs. Pretty's storyline was sidetracked for no reason makes it all the worse. Thankfully, and as the story wraps up, the movie finally acquired a discernible identity. The character arcs were mostly tied up gracefully and neatly, the technical prowess at its most thriving, and the film regained its contemplative tone with a dash of weltschmerz tossed in for effective measure. Despite its blatant inextricably linked issues, The Dig is a stunning-looking, great film with even greater performances buried inside a rather muddled one.(7/10)"
    },
    {
      "rating": "7",
      "text": "A pleasant little surprise. This is in no way a groundbreaking film at all but it’s just a mostly enjoyable self contained story that does what it needs to do. The performances from Lily James, Ralph Fiennes, and Carey Mulligan are pretty good. Each have their own moment to shine without taking too much of the spotlight. Each has their own self contained story that’s mostly interesting even if Lily James’s character feels a little cliched at points. The story is engaging as it follows an archaeological exploration of a old Anglo-Saxon vessel. However, a solid 1/3 of this film is somewhat boring and slow. These moments are whenever we follow characters that aren’t portrayed by Mulligan, James, or Fiennes. The screenplay is fine. There is nothing extraordinary about it and it isn’t bad but there’s nothing really special about it. The cinematography was very good though. Each shoot looks very beautiful and is framed in an interesting way. Costumes and set design are on point too. This is a quiet little film that’s gonna go under the radar this year. If you want an enjoyable little self contained story then I would recommend checking this out."
    },
    {
      "rating": "7",
      "text": "La trama está bien y los actores son buenos; la recomiendo si eres fan de Ralph Fiennes o de las películas dramáticas."
    },
    {
      "rating": "5",
      "text": "The potential here for an educational and worthy tribute to the key players of the 1939 excavation of Sutton Hoo has been somewhat squandered by mid-production rejigging and the addition of parallel romantic storylines and refocus away from the central story of a landowner and her hired assistants digging for treasure, and finding it, against the clock, partially in battle with the archeological establishment and with her young son looking on with fascination, all set under the wide and beautifully shot Suffolk skies...why was that not enough?Buffini's script is sharp and the acting of high quality, especially Fiennes who plays his character with significant depth, intrigue and an apparent impeccable accent, and as the cinematography and gentle score gained momentum I was even almost able to forgive a moment of difficult-to-believe drama early on as I settled in to learn more about these characters and what they were about to unearth, only to have them sidelined by a number of other narrative threads that began to dominate the second half, leaving the original focus of the film neglected, it's conclusion rushed and much detail lost (or possibly even cut, as I suspect studio interference in an attempt to make the film more mainstream/easily-marketed)The result is, to some extent, an unsatisfactory narrative mess which, along with other production problems, goes some way towards ruining a project that still manages to achieve significant merit, interest and delight and I'm sure will be enjoyed by a wide audience, hopefully eventually in a proper cinematic release (and possibly with, as I argue for here, a writer-and-director-led recut!)"
    },
    {
      "rating": "0",
      "text": "Don't watch the movie, Watch the short behind It instead. The movie is absolute garbage."
    },
    {
      "rating": "6",
      "text": "In a film defined by understatement, it’s the little details that matter."
    },
    {
      "rating": "7",
      "text": "Fascinating story presented in a context of uncertainty, when the great war was about to break out."
    },
    {
      "rating": "9",
      "text": "Moved by this wonderful tales about age and maturity. Finnes is so incrdible."
    },
    {
      "rating": "8",
      "text": "Based on a true history \"The Dig\" is one of the best movies of 2021.In the Era of \"Godzilla vs Kong\" and \"The Tomorrow War\" which were of course nice the watch but none of them would come in par with the way of execution and the acting skills in \"The Dig\". The movie revolves around the excavation in Sutton Hoo Estate in Southeast Suffolk in 1937 where they witnessed a buried ship accompanied with priceless treasures. The movie also focuses on the life of Edith Pretty (Carey Mulligan) the owner of Sutton Hoo Estate, Basil Brown (Ralph Fiennes) an excavationar and Peggy Peggot(Lily James) an archeologist and also about the hurdles they face. The movie is so meaningful and well portrayed and the actors also give their best performance(especially Ralph Fiennes) that you also becomes part of their emotions and the breathtaking visuals and heartwarming soundtracks makes the movie a definite watch. This may be the only movie of 2021 that really captures your heart and makes you understand the actual truth of the famous Sutton Hoo excavation. This one is a must watch."
    },
    {
      "rating": "9",
      "text": "“and the 2021 OSCAR SNUB AWARD goes to…”'The Dig' is a beautifully photographed period film (circa 1939, Suffolk, Great Britain) that seemed a lock to garner first Oscars for Ralph Fiennes (*overdue) and Cinematographer Mike Eley. Therefore, I'm instituting the 1st Annual \"Oscar Snub Award\" to the film most undeservedly left out of nominations. This year it was a no brainer - 'The Dig' wins and it wasn't close. So on with my original review B. S. (\"Before Snub\")...Metaphors supporting Themes abound in 'The Dig' - \"life is fleeting\", \"the search for meaning in our lives\", \"our relevance in History\", and \"is this all there is\". Classic themes for dramas that are the eternal questions within our lives. The film intertwines those themes within the central characters, each conducting their own search for answers.The framework of the story occurs on the eve of WWII for Great Britain. The impending gravity of such hovers over the film, intensifying the characters' emotions and urgency in searching for answers to such questions - the telescope and magnifying glass used within the story serve as metaphors to that end. Collapsing walls of the dig site that almost takes Basil Brown's life illustrate the tenuous fragility of life which could end in a moment of randomness. There are many more such examples in 'The Dig'.Such poetic filmmaking takes painstaking attention to detail in production to pull off at the level achieved in this film. Utilizing the beautiful cinematography of Mike Eley and deft touch of Film Editor Jon Harris, Director Simon Stone succeeds in elevating the The Dig to an elite level of film art.This is without question the Best Picture of the Year, and I am thankful this beautiful film came in at the last possible minute to save an otherwise (and understandable) blah year in the film industry.Director Simon Stone's Oscar nomination for both Director and Best Picture is a virtual certainty.Ralph Fiennes (Basil Brown) never misses (except taking home an Oscar), but I predict he will FINALLY* be recognized by Academy members en masse for his best of the year acting in this film, along with Mike Eley for Cinematography.Carey Mulligan (Edith Pretty) should be nominated except she has two Oscar worthy films, both with a deserved good chance to take home an Oscar. Her spotlight lead part in 'A Promising Young Woman' has much more Oscar potential which will negate her role in The Dig - Mulligan should get Actress of the Year for putting forth two such great performances in one year!At the end of the night (Oscar night), 'The Dig' could sweep up wins in the aforementioned major Oscar categories for 2020 - I certainly wouldn't bet against it happening [EDIT: Boy was I wrong"
    },
    {
      "rating": "7",
      "text": "Very interesting the way to be of this movie, both in the directing until the acting."
    },
    {
      "rating": "6",
      "text": "An interesting story with good performances but the film definitely drags for a good portion of it."
    }
  ]
}