{
  "id": 1387,
  "title": "The Hunchback of Notre Dame",
  "starring": [
    "Tom Hulce",
    "Demi Moore"
  ],
  "runtime": 91,
  "genre": [
    "Drama",
    "Animation",
    "Family"
  ],
  "description": "At the urging of his gargoyle pals, Quasimodo leaves Notre Dame tower against the wishes of his guardian, the evil Judge Claude Frollo. He ventures out to the Festival of Fools and finds his first true friend, a Romani woman named Esmeralda, who entrusts him with a secret. When the secret is revealed, Quasi soon finds himself fighting to save the people and city he loves.",
  "releaseYear": "1996",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/44z8paOHQK1bDjTzEGcXsJ109ZS.jpg",
  "categories": {
    "plot": 8.894736842105264,
    "acting": 9.333333333333334,
    "ending": 5.0,
    "soundtrack": 9.75,
    "cinematography": 9.0,
    "familyFriendly": 5.5,
    "funny": 9.333333333333334,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The Hunchback of Notre Dame is one of the most visually stunning movies Disney has ever released. I really loved the animation and the visual effects, for the time they've must been breathtaking and honestly even now they hold up pretty well. It is also one of the darkest Disney movies ever made with some mature themes like lust, genocide, infanticide, among others and that's not a complaint, I actually liked that a Disney film took risks to tackle such themes in one of its movies. Stunning animation with some great, compelling and memorable characters...Except for the villain. I don't think Frollo is one of the best Disney villains, he's one of the darkest and one of the most perverse and evil, yes, but he's just a horrible person with a dumb plan, now I know that's because he's crazy but just having a character that's crazy \"just cause\" feels kind of lazy.However, while I praised this movies dark tone, it's one of the most tonally inconsistent Disney movies I've seen, maybe the most inconsistent. The dark themes and disturbing imagery might not be a problem if the movie wasn't rated G, which means that this is targeted towards kids, so they have to shove in a comic relief, in this case the gargoyles, who are one of the most annoying comic reliefs in any animated movie, maybe in any movie, period. Nothing they said or made actually made me laugh, I was insted rolling my eyes out and wishing that they were in a more tonally appropriate movie.We get from one lighthearted musical number and then immediatly the movie turns dark and disturbing, that's my problem with this movie. Maybe if they made this movie dark the whole time, remove the cheesy, lighthearted musical numbers and the gargoyles and not caring about getting a G rating, we could've get one of the best Disney movies ever, but sadly, that wasn't the case.Sure it's not a bad movie, it's a good movie but with forgettable songs and tonal issues."
    },
    {
      "rating": "10",
      "text": "Now this is the film that Sam Hudson and me really love because this disney classic is one of the darkest films of all time. I love the songs, I love the characters, I love the animation, I love the visuals, I love the music and I also love the story. Now do bare that in mind, I haven't read the novel by Victor Hugo but it's not by the original book which is rather strange because in the novel it mixes up the characters but still Frollo is the bad guy and he'll always will be. I won't go to any spoilers cause I don't even know where to start. OK, maybe I'm overexactrating a little but I have not read the original novel by Victor Hugo because what's really confusing me is the characters are dead or the story is absolutely different or not so that's it. Quasimodo is a likeable character who is deformed and ugly and abandoned by his mother and he was adopted by the main villain called Frollo voiced by a known actor that Sam Hudson told me Tony Jay. Esmeralda voiced by Demi Moore is a beautiful gypsy who is friends with Quasimodo. Judge Claude Frollo like I mention before is an evil villain who is the priest of Notre Dame who hates gypsies and vows to destroy them. Captain Phoebus played by, you guessed it, Kevin Kline who is an handsome soldier who is Frollo's captain of the guard and he disapproves of Frollo's methods of killing so he rescues people whenever they're in danger and he falls in love with Esmeralda. And if anyone notices: the main character doesn't get the girl. Like I mention the book there is a sex scene in the original novel which is quite unusual. And the last character is the gargoyles which are not in the book. The first gargoyle named Hugo, second is Victor and the third is Laverne played by an actress who died before the film's release so that's quite a shame. Many people find the gargoyles annoying but to me I like them, I find them funny. Now the songs. Boy, I love the songs. The first one is ''The Bells of Notre Dame'', the second is ''Out There'' where Quasimodo wants to get out for one day, the third is ''Topsy Turvy'' and all random ones and the one that my friend Sam Hudson want me to sing is which he said ''one of the darkest scenes in disney history'' ''Hellfire''. Yeah, I really love this song where Frollo vows to kill Esmeralda. The comedic song that the gargoyles been singing is ''A Guy Like You'' and last one Clopin sings is ''The Court of Miracles''. The music is just top-notch and you know it's Alan Menken who composed the music and the animation makes the visuals fantastic. So I have nothing againest the novel so I'm with both the film and the novel as it is. (Laughs) I've been watching it a million times and I still ain't bored with it. It's one of my favourites."
    },
    {
      "rating": "9",
      "text": "The comedy is out of place, but the movie is fantastic. The story is highly engaging, the animation looks beautiful, and the Gargoyles might be out of place, but the other characters manage to do more than just carry the film along with unforgettable songs. This is a must watch for Disney fans, but not to Victor Hugo fans..."
    },
    {
      "rating": "10",
      "text": "Este clásico tiene madera de sobra para establecerse entre los 10 mejores clásicos de Disney de todos los tiempos, por su apoteósica puesta en escena, sus entrañables personajes y el villano masculino mas ruin y perverso de toda la historia de Disney."
    },
    {
      "rating": "5",
      "text": "In 1482 Paris, Clopin, a Romani puppeteer, narrates the origin of the titular hunchback. A group of Romani sneak illegally into Paris, but are ambushed by Judge Claude Frollo, Paris' Minister of Justice, and his soldiers. A Romani woman in the group attempts to flee with her deformed baby, but Frollo chases and kills her outside Notre Dame. He tries to kill the baby as well, but the cathedral's archdeacon intervenes and accuses Frollo of murdering an innocent woman. To atone for his sin, Frollo reluctantly agrees to raise the deformed child in Notre Dame as his son, naming him \"Quasimodo\".Twenty years later in 1502, Quasimodo develops into a kind yet isolated young man, though still deformed and now with a pronounced hunchback, who has lived inside the cathedral his entire life. A trio of living stone gargoyles—Victor, Hugo, and Laverne—serve as Quasimodo's only company, and encourage him to attend the annually-held Festival of Fools. Despite Frollo's warnings that he would be shunned for his deformity, Quasimodo attends the festival and is celebrated for his awkward appearance, only to be humiliated by the crowd after two of Frollo's guards start a riot. Frollo refuses to help Quasimodo, but Esmeralda, a kind gypsy, intervenes by freeing the hunchback, and uses a magic trick to evade arrest. Frollo confronts Quasimodo and sends him back inside the cathedral.Esmeralda follows Quasimodo inside, only to be followed herself by Captain Phoebus of Frollo's guard. Phoebus refuses to arrest her for alleged witchcraft inside Notre Dame and instead has her confined to the cathedral. Esmeralda finds and befriends Quasimodo, who helps her escape Notre Dame out of gratitude for defending him. She entrusts Quasimodo a pendant containing a map to the gypsies' hideout, the Court of Miracles. Frollo soon develops lustful feelings for Esmeralda and, upon realizing them, begs the Virgin Mary to save him from her \"spell\" to avoid eternal damnation. When Frollo discovers that she escaped, he instigates a citywide manhunt for her which involves bribing and arresting gypsies and setting fire to countless houses in his way. Phoebus is appalled by Frollo's evil and openly defies him, and Frollo sentences him to death. While fleeing, Phoebus is struck by an arrow and falls into the River Seine, but Esmeralda rescues him and takes him to Notre Dame for refuge. The gargoyles encourage Quasimodo to confess his feelings for Esmeralda, but he is heartbroken to discover she and Phoebus have fallen in love.Frollo returns to Notre Dame later that night and discovers that Quasimodo helped Esmeralda escape. He bluffs to Quasimodo, saying that he knows about the Court of Miracles and that he intends to attack at dawn with 1,000 men. Using the map Esmeralda gave him, Quasimodo and Phoebus find the court to warn the gypsies, only for Frollo to follow them and capture all the gypsies present.Frollo prepares to burn Esmeralda at the stake after she rejects his advances, but Quasimodo rescues her and brings her to the cathedral. Phoebus releases the gypsies and rallies the Paris citizens against Frollo and his men, who try to break into the cathedral. Quasimodo and the gargoyles pour molten lead onto the streets to ensure no one enters, but Frollo successfully manages to get inside. He pursues Quasimodo and Esmeralda to the balcony where he and Quasimodo fight and both fall over the edge. Frollo falls to his death in the molten lead, while Quasimodo is caught by Phoebus on a lower floor. Afterward, Quasimodo comes to accept that Phoebus and Esmeralda are in love, and he gives them his blessing. The two encourage him to leave the cathedral into the outside world, where the citizens hail him as a hero and accept him into society."
    },
    {
      "rating": "9",
      "text": "This isn't as good as Beauty and the Beast, but it is miles better than the Black Cauldron and Home on the Range, which are probably the weakest Disney movies I've seen. Stop criticising it, because it is unfaithful to the book. There are some parts of the book, that just wouldn't work, like the character of Clopin, if he was the same as he was in the book he would be too frightening for kids. Don't get me wrong, it is an amazing book, but a very complex one as well. Of course, it is more adult than most Disney movies, but it means it is mature, and I found it a dark, powerful, poignant and really chilling film, if in comparison to other Disney movies is slightly disappointing. The IMDb rating for this movie is far too low, it deserves a 7.0 to be honest. The animation is fantastic, so crisp and smooth. Notre Dame has never looked so magnificent, even in real life. The highlight was Quasimodo saving Esmeralda from getting burnt at the stake, accompanied by a hauntingly-beautiful Dies Irae. The characters are also well done, and so is the theme-driven story, and the themes are very mature and complex. Speaking of the characters, I know all of them had changed, but they were so well-developed, unlike Black Cauldron. Quasimodo was poignantly voiced by Tom Hulce, and his character is possibly the most sensitive character in Disney history. Esmeralda was brilliantly voiced by Demi Moore, who brought a little bit of herself into the role. She is feisty and beautiful. When you look into her eyes, you instantly know how wrong Frollo is about her. I have always loved her hair, but her chief beauty are her eyes, a beautiful colour and filled with such sadness. Frollo is a very complex villain, and the sinister timbre of Tony Jay's voice flawlessly matched that. The sequence in front of the fireplace was a definite highlight and gave me goosebumps, as well as his death scene. He looked evil! Then there is Clopin, a very underrated and relevant character. Paul Kandel voiced him marvellously and his singing was out of this world. Pheobus was the most changed character, but Kevin Kline was really funny here. I liked the gargoyles, they were very funny. However, my only criticism about this movie, is to do with them. I liked their song \"Guy Like You\" but it was misplaced. It should have been put there 20 minutes earlier, not when Paris is burning down. The songs are on the whole just brilliant, and the score so powerful and emphatic! The magnificent opening is the best beginning to a Disney movie. \"Out there\" is very heartfelt, and \"Topsy Turvey\" is great fun. \"God help the Outcasts\" is hauntingly beautiful. The only song I had a problem with was the song in the Court of Miracles, because I couldn't hear a word they were singing, and I loved \"Someday\" and \"Heaven's Light\". Some bits made me laugh, but there were plenty of scenes that made me cry, especially when Quasimodo thinks Esmeralda is dead, and he is seen comforting her body. Really poignant! In conclusion, a brilliant movie, with one of the most poignant endings in an animated film. 9/10, though it was so close to a 10. Bethany Cox"
    },
    {
      "rating": "9",
      "text": "One Of Disney’s Most Underrated FilmsHunchback is by far one of Disney’s most underrated works especially with an absolutely horrifying villain."
    },
    {
      "rating": "8",
      "text": "One of the most underrated films of Disney. It contains an absolutely terrifying villain, amazing songs and many messages to give. Also, it's visually stuning. l liked it."
    },
    {
      "rating": "8",
      "text": "El Jorobado de Notre Dame es una película muy única, siendo de las pocas de Disney en tocar temas tan serios y darle muchísima profundidad a sus personajes. Sin embargo, siento que esto también le juega en contra, ya que a veces intenta meterle canciones y comedia (a lo clásica película de Disney), pero esto rompe totalmente con las partes serias que te intenta transmitir, sin lograr un buen equilibrio a diferencia de otras de la misma compañia. Realmente las gárgolas no aportan nada y están muy de relleno en la historia, sin embargo, si dejas pasar eso, personajes como Quasimodo, Esmeralda y Febo te caen muy bien y Frollo es facilmente uno de los mejores villanos de Disney. Muy desarrollados, y con muchos momentos de tensión y metafóricos que a mi realmente me encantan.No es una película perfecta ni mucho menos, pero las cosas que hizo son muy innovadoras y ha envejecido muy bien. La recomiendo."
    },
    {
      "rating": "9",
      "text": "Though it is a tonal mess, and many of the characters are annoying and/or uninteresting, the music is grand, the story is emotional and the animation is breathtaking."
    }
  ],
  "recommendations": [
    "pocahontas",
    "the_little_mermaid",
    "labyrinth",
    "aladdin",
    "brother_bear",
    "the_jungle_book",
    "the_road_to_el_dorado",
    "sing",
    "brave",
    "bambi",
    "mulan",
    "finding_nemo",
    "the_prince_of_egypt",
    "moana",
    "the_lion_king",
    "tarzan",
    "the_princess_and_the_frog",
    "a_street_cat_named_bob",
    "mary_poppins",
    "sing_street",
    "the_polar_express",
    "song_of_the_sea",
    "vivo",
    "the_craft",
    "footloose"
  ]
}