{
  "id": 1278,
  "title": "The Sword in the Stone",
  "starring": [
    "Sebastian Cabot",
    "Karl Swenson"
  ],
  "runtime": 79,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
  "releaseYear": "1963",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dYQhKThGXl3xQv71Ysw0RSmVmBA.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 8.833333333333334,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 9.0,
    "funny": 8.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "more like bored in the stone ohhhhhhhhhhh but yeah its very boring watch something else"
    },
    {
      "rating": "9",
      "text": "Divertidisima, los personajes son geniales y las situaciones también, aunque lo que tiene que ver con el título es casi nulo excepto por el abrupto y forzado final."
    },
    {
      "rating": "8",
      "text": "Terrifically funny animation with decent visuals, solid voice acting and entertaining story."
    },
    {
      "rating": "10",
      "text": "The one with the nostalgia to it is The Sword in the Stone cause it's one of my favorite disney classics of all time. Me and my friends from old school loved it and we were quoting all the lines and songs from it non stop, it is just a lot of fun as always. My favorite character is Wart because he looks just exactly like me and Liam is Merlin and the songs that are fun called Higitus Figitus and many more also speaking of characters, the characters are memorable. Wart is the main character who wants to learn education, Merlin is the wise and the most powerful wizard who learns magic, Archimedes an owl who is miserable as always until the wizards duel and many more are really pleased at Wart who pulls the sword from the stone and becomes king. This disney classic will change the world forever. I've seen it a million times and I will definitely watch it a million times agian. Though has anyone else notice that Wart clearly went through puberty when he was doing his voice?"
    },
    {
      "rating": "8",
      "text": "Moderate DisneyIt’s definitely not a milestone like Snow White, But this one’s still a memorable one."
    },
    {
      "rating": "6",
      "text": "I honestly have doubts whether or not this little film can be considered one of the Disney classics. It's old and has quality, it's a really good movie to see with the kids, without any contraindications, but I've always seen it as a little-known work, and I even thought that Disney itself never seemed very willing to make us remember it... so I leave the question: is it age just enough to be considered a classic film?The film is a retelling of the old tale of King Arthur: here, the king is a child, still, and is being trained to become the squire to a noble knight. However, his curiosity and initiative, as well as the inspiring and educational words of the wizard Merlin, will lead him to a very different path in life, after inadvertently removing an old sword from a stone... the sword that could only be removed by the right person to assume the vacant throne of England.The film is good, it has joy, it has color and movement. Even so, it's visually rough, with slightly imperfect features. The film was hand-drawn, and many artists were involved in its production, as was once common at Disney. Even so, the limited production budget has led to cost cuts that are surely at the root of this look, less elegant and smooth than the studio's older films.Karl Swenson does an impeccable job of voicing, but I also liked the thin voice of Martha Wentworth, who lent her voice to the witch Madame Min, one of the characters who would, later, move into comic books and other works in the Disney universe. Junius Matthews also did a very good job.A very important part of this movie is the music, and there are songs for almost every taste. The movie has a long list, but I honestly didn't feel touched by any of the songs, and none of them stayed in my ear for very long. That doesn't mean they aren't good... it means they lack something to make them truly memorable."
    },
    {
      "rating": "9",
      "text": "One of Disney's more underrated Disney film, while the ending feels a bit abrupt it gives us likable characters in Arthur and Merlin, has great animation, and gives us a classic story given a mature and respectful take."
    },
    {
      "rating": "7",
      "text": "It's most definitely an educational film, for kids, but it does a good job at providing a fun and memorable fantasy adventure; all without insulting its audience's intelligence. \u2028A minor classic from the Disney repertoire."
    }
  ]
}