{"id": 4524, "title": "The Boss", "starring": ["Melissa McCarthy", "Kristen Bell"], "runtime": 91, "genre": ["Comedy"], "description": "A titan of industry is sent to prison after she's caught for insider trading. When she emerges ready to rebrand herself as America's latest sweetheart, not everyone she screwed over is so quick to forgive and forget.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/q6TAy2EWMpuT6gpxlO3ofj0RYrq.jpg", "categories": {"plot": 3.611111111111111, "acting": 3.235294117647059, "ending": 2.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.0212765957446805, "action": 5.0}, "reviews": [{"rating": "3", "text": "Ylikes. Melissa McCarthy can only do so much for a movie. This is dreadful, with no wit or cleverness, just a lot of testicle-punching gags. No creativity required."}, {"rating": "2", "text": "The Boss is not only unfunny, she's loud obnoxious and just all around unlikeable.  Melissa McCarthy has played these loud characters before, but she usually brings heart to them.  No heart to be had here. This is almost a bad Happy Madison project.  D"}, {"rating": "3", "text": "The Boss is from the same team that brought you Tammy, however, this one is not as bad as that film, but again it really doesn’t raise any laughs whatsoever, except a slightly awkward performance from Peter Dinkcavage who really should know better than to be in this sort of a film.  It’s not very funny, it’s basically another Melissa McCarthy comedy, but not one of the good ones like Spy or The Heat or Bridesmaids, and thankfully I just didn’t care about this film, it was just boring, drab, the jokes weren’t funny, in fact I found a couple of them hugely offensive and I just wanted to be done with it.  Avoid this one"}, {"rating": "4", "text": "Sure The Boss can be funny at times, but for the duration of the movie, there are tons of stupidities. There are a few funny moments, but most of the film is just a pain to watch."}, {"rating": "4", "text": "While Melissa McCarthy plays her typical Melissa McCarthy role well, and there are a few scenes that were truly funny, The Boss ends up being a very cliché film with an absurd third act.  The movie, quite simply, falls apart in the last half hour and becomes way bigger than it ever had to be, and the film suffers quite a bit for that.  There are a good amount of laugh out loud moments, but there are just as many duds, and the plot can't make up for them."}, {"rating": "4", "text": "The Boss adds up another round of Melissa McCarthy as she takes over the role for the Boss and oh dear, what kind of ruckus would she be up to anyways? Oh, insider trading... I probably have no idea what that is, but I'll probably be looking at what it means after this review. Oh, what's next on the list anyways? Think smart, fast, and strong if you're going to see the Boss before coming out disappointingly because this lady knows how to control anyone around here and there."}, {"rating": "1", "text": "I seen the movie last night I think it is terrible humour very raunchy ! Normally love Mellissa in movies but there is too much swearing and sick humour to body parts ! I walked out near the end no need for certain parts it could have been so much better ! I would never recommend to go see this movie! Totally disgusted with the movie:("}, {"rating": "0", "text": "We were disappointed with Melissa. She is usually very funny. This was just smut and in front of young kids we didn't find it entertaining at all. Her TV show is good she should stick to cleaner humor."}, {"rating": "1", "text": "Melissa McCarthy's noble quest to derail the comedy night train might have finally come to fruition with her latest effort The Boss. Helmed by her husband, Ben Falcone and written by both of them with friend Steve Mallory, this deafeningly constipated attempt at squeezing the funny from a cinder block lays down the framework for the decline of American comedy while reminding you that comedy without profanity and excess is exactly like a car without wheels.\r The films plays out like an never-ending sketch not so dissimilar from Night at the Roxbury. It's the story of the darker side of girl power focusing on McCarthy's character Michelle Darnell, a ruthless high-powered corporate phenomenon who gets pitched thanks to her lover Renault (Peter Dinklage) for insider trading and lands it in the big house. After slumming it in white collar D block, she's released to find her assets seized and her home gone prompting her to shack up with her ex-assistant Claire (Kristen Bell) and her tween daughter Rachel (Ella Anderson).\r Now partially-ruthless Michelle sees the opportunity to hatch a business scheme selling cookies using Claire's brownie baking skills after observing group of Girl Scouts partaking in a similar venture at Rachel's school. To make the story tumble forward, Michelle's new business \"Darnell's Dandelions\" is a booming success which, as expected, creates a bitter rivalry between the two groups. This is where the funny is suppose to happen as Michelle uses her R-rated super-gag arsenal to physically and emotionally incapacitate the competition and its many soccer moms. Backhanding minors and colorfully drawn F-bomb are only the tip of the iceberg. Towards the end, Renault pops in to proclaim his undying love for a Michelle incapable of completing her character arc, culminating with an out-of-left-field swordfight on a rooftop.\r The Boss screams self-approval and aggrandizement at the top of its battered lungs as its excessively callous material points to clear differences between comedy brewed in one's basement and one vetted by thoughtful studio heads and established co-writers. As it throws vulgar buffoonery, dredged up from its bottomless cesspool, right past you, praying anything will stick, it will either having you wondering what you could've done with the money spent to get in or reminisce about your worse hangover yet.\r If raw slapstick or overly physical humor is your thing, by all means. If not, price of admission pays for a month's Netflix and a 4 for 4 at Wendy's: dinner and at least 50 movies.\r --FilmReviewWeekly"}, {"rating": "0", "text": "Almost as bad as Paul Blart. It's THAT bad. What few funny parts were in the movie were in the trailer. McCarthy works fine as a supporting actress in other movies, but has no chops as a lead."}, {"rating": "1", "text": "From the very first time I saw Melissa McCarthy on television in the series \"The Gilmore Girls\" playing Sookie I became a big fan of hers and continued to watch her in her \"Mike and Molly\" series. I was looking forward to her in movies when I would spot her in supporting roles and I was thrilled with her breakthrough role in \"Bridesmaids\" though I saw something I didn't like that was becoming trendy among female comic actresses in movies.\r There is no denying the true comic timing she has plus her ability to get into physical humor like very few male or female comics can. (I sometimes worry about what the results of all this will be on her body when she gets older.) She is fun to watch whether standing still and giving a look or gets as aggressive as any human being can be without thought to what can happen to them.\r Little by little though she was doing what other comic actresses were doing in films with using foul gestures and words as if to say \"We can be as gross, uncouth, vulgar and low down as male movie comic stars can be.\" Am I a prude? I don't think so but to hear a woman using the F word over and over among other street words, telling genitalia jokes, groping men and women, vomiting up profanity continuously quickly runs thin and is no longer funny but makes you shake your head asking why did she get into this.\r With McCarthy's talent is it very easy for her to rise above the material but when she is working with a screenplay below her strengths it all seems to be a string of foul abrasive lines thown out to garner a laugh but it doesn't.\r Melissa McCarthy can be a funny subtle actress as she proved in \"The Gilmore Girls\" and did fine work in a supporting role in 'St. Vincent\" but, and I am probably in a minority here, she is losing me as a fan trying to show how much lower she can get than any man in the business.\r \"The Boss\" was directed by her husband Ben Falcone and co-written by Falcone, McCarthy and Steve Mallory. It was produced by her, her husband, and why am I not surprised, Will Ferrell among others.\r McCarthy is a strong actress, a comic with extraordinary timing, and physical ability to throw herself into a set-up, but she needs people to push her to higher heights that her ability to go shines through at moments instead of sustaining a whole film. There is a brief cameo by Kathy Bates, who shows she can talk as 'dirty' as anyone, that makes you want to see them co-star and battle each other in a film for 90 minutes instead of 4 minutes.\r I really have no desire to see any more McCarthy films if they continue on this track and I don't recommend \"The Boss\".\r P.S. I understand McCarthy is returing in her role of Sookie to the new \"The Gilmore Girls\" remake!"}, {"rating": "9", "text": "I laughed the whole time. Melissa is one of the best comedic actors right now and she does it again with this film. Big slapstick moments and smaller verbal jabs had me crying with laughter."}, {"rating": "7", "text": "Melissa McCarthy and Ben Falcone's follow up to Tammy doesn't break any new ground for it's comedic talent. This is still very much a vehicle for McCarthy's vulgar brand of humor. The only difference is that it often dives into absurdist humor that clashes rather awkwardly with the regular, grounded tone of the plot setup.\r Yes, the humor is very much McCarthy. Admittedly that means there isn't much more to say. For her fans it's filled with a lot of laughs and chuckles, although there are moments that fall short. For those who aren't fans, yeah, don't watch. She isn't going to win you over here.\r Overall it's a funny McCarthy movie. The plot's a bit jumbled, but a lot of the humor is good. The movie also treats us to a memorable Peter Dinklage performance. A decent comedy that still isn't likely to appeal to anyone other than McCarthy fans. At least those fans should be amused here. I know I was."}, {"rating": "0", "text": "The problem with basing your movie completely on the talents of one person is that when that person isn't funny, neither is your movie.  This movie proves that point."}, {"rating": "2", "text": "First, I'm a guy (XY) and the demographic for this film is definitely XX. I endured half the 100-mins of the film before enough was enough. Also, Melissa goes through every scene of the film in throat-concealing turtle-necks. WTH is that about?! Is she hiding surgery or just her flabbiness?"}, {"rating": "5", "text": "While Melissa McCarthy just may be the best working comedienne today, her work with Paul Feig is much stronger than THE BOSS. As with TAMMY, some of her hilarity and brilliance is lost with the mediocre movie surrounding her. You're sure to laugh - even if you can't help but want more."}, {"rating": "7", "text": "You have every right to be scared about this movie it's written by Melissa McCarthy and director Ben Falcone  the team behind the atrocity \"Tammy\" but surprisingly \"The Boss\" is better than Tammy, it's outrageously funny and despite McCarthy playing the same role, she makes it work and it's fun watching her being this foul-mouthed crass narcissist. Melissa McCarthy plays Michelle Darnell a successful businesswomen who gets convicted for insider training. She is forced to move in with her employee (Kirsten Bell) and she tries to revamp her public image by helping a group of young girls in their quest to sell brownies. It's funny, chaotic and it's outrageous. 3 out of 4 stars"}, {"rating": "6", "text": "There are many laughs to be had here, though it's not brilliant overall. The mix of physical comedy and caricature is nicely balanced, but the storyline was predictable and the pacing could have been better. The performances are great, the dilogue is witty, and the audience were entertained. Whilst not as fun as Spy, it was a solid comedy from McCarthy, though I'd suggest waiting for the DVD. 6.03/10"}, {"rating": "7", "text": "There are good laughs to be found within \"The Boss\", however the plot lacks what it truly needs to bring out the most laughs from Melissa McCarthy. 7/10"}, {"rating": "3", "text": "Melissa McCarthy can be very funny, but when she's allowed free reign, her rants often become tedious. That's pretty much sums up this film (co-written with her husband), which has her barreling thru the plot and characters with lots of mean-spirited comments and cruel behavior. She plays a pompous successful businesswomen who loses it all, goes to jail, then tries to rebuild her life (with the help of her former assistant, played with no humor by Kristin Bell). While there are attempts to make her sympathetic and give the movie heart, those are as transparent and predictable as the entire plot. I'd be willing to forgive McCarthy for all her nastiness if she made me laff, but this film tries too hard to be outrageous and ends up just trying too hard. (And that high-neck look just gets weird). Stay thru the credits for even more unfunny moments."}, {"rating": "5", "text": "...In The Boss, a lot of jokes work, but an equal amount fail. McCarthy turns in a solid performance, and the pacing is nice and it moves quickly. It was just meh, not McCarthy's best, and not her worst, just meh..."}, {"rating": "3", "text": "Use on opportunity, build an empire and be the boss!\r I always liked Melissa McCarthy films when others said they were very bad, but this time it is totally different. I won't blame her, she always gives her one hundred per cent and so for this film. But it was the terrible script that let her down. Actually, it is a watchable film, because of her, but without her completely unimaginable. The trailer looked much better than the film. It is a comedy, but the laughs are too far, not even a little smile in your face easy to obtain.\r So it seems there are plenty of negatives about it than the good. I watched it to prove the people are wrong about it, but in the end I was wrong. This is the second time the director and McCarthy together for a film who are the real life couple. But I liked 'Tammy' better, not this one and there will be one more film that I hope they would come up with much more interesting than these two.\r She is not a solo type star, her films are always the multistarrer. So whenever I hear about her new films, I get curious about her new partner. Kristen Bell was not bad, even Peter Dinklage have given a nice performance. So The casting was good, but they all did not get the good script or the role. I did not enjoy it means not that I won't recommend it. It did not work for me, but it might to you, so I advise be carefully while choosing it.\r 3/10"}, {"rating": "6", "text": "To start off, if you don't like Melissa McCarthy, just don't go see The Boss. It's not some surprise role where she showcases her broad dramatic acting talent that will be loved and adored the world over. It's a Melissa McCarthy comedy, and I look for two things in comedies: a relatively likable atmosphere and, ya know, comedy. Funny comedy. The Boss has just enough of both of those to recommend to a comedy fan even if it's not as strong as McCarthy's work with Paul Feig. In The Boss, business tycoon Michelle Darnell is sent to prison for insider trading, and after she's released from prison five months later, Michelle is ready to rebuild her fortune at any cost. She is taken in by an old employee, Claire Rawlins, whose to-die-for brownies present the perfect opportunity to build another dynasty. With the help of Claire, her daughter and her girl scout troop, Michelle starts the brownie making business, but Michelle learns that people she screwed over in the past aren't so quick to forgive and forget. Melissa McCarthy has a knack for making the most despicable characters actually seem someone likable (maybe that's just because I can relate to an arrogant power-hungry business tycoon?), so you never outright hate Michelle Darnell. She grew up moving around several foster families, so it's hard not to show some sympathy towards her character and why she ended up so narcissistic. Although some of the jokes fall flat, there are two more jokes to make up for it, and there's some hilariously memorable lines in The Boss. Although it's not as consistently funny as some of her other work, The Boss should please Melissa McCarthy fans until Ghostbusters this summer."}, {"rating": "8", "text": "The Boss is your typical Melissa McCharthy movie minus the spy thriller aspect. It does get boring at times and the trailer gave away some good jokes, but it was entertaining. A good portion of the film had Kristen Bell in it and she was fantastic. Overall, I like The Boss and it was better than Tammy."}, {"rating": "8", "text": "I don't know why so many people gave this movie bad ratings. I really enjoyed it, ok I get if someone didn't like it a lot or whatever, but giving negative reviews - really? It was funny, of course with some stupidities, but it is a comedy, it is meant that way. Only thing which I didn't like was that it was a bit too unrealistic, but otherwise I did enjoyed it a lot."}, {"rating": "4", "text": "Melissa McCarthy still very talented in this role. There were some funny scenes and some silly scenes, but it doesn't fully deliver on what it could be."}, {"rating": "2", "text": "I absolutely love Melissa McCarthy especially when she is at her best like in \"The Spy\". But this movie is just awful, it starts out cute and somewhat funny, but then very quickly goes downhill after that. I hope in the future she picks or creates much better projects for herself to act in, so we can continue to see her playing characters much more deserving of her talent then Michelle Darnell."}, {"rating": "0", "text": "What a terrible movie, Not once did I laugh nor did the rest of the crowd with me. Melissa McCarthy needs a reality check. Her films just are not funny."}, {"rating": "5", "text": "Melissa McCarthy needs to change fast. The Boss is a disaster, the acting is terrible the plot is rehashed for the millionth time. The jokes hit sometimes which makes this movie watchable, but still Melissa McCarthy needs to do better."}, {"rating": "2", "text": "Talky but lifeless and charmless \"comedy\" about self-made business mogul (Melissa McCarthy) who goes to jail for insider trading and then bounces back, creating a cookie empire with former employee (Kristen Bell).The best that can be said about this misfire is that they try different things – buddy comedy, a colorful person story, inspirational girl power story with swearing, later even some rom-com and action.But nothing, even potentially the funniest parts like girlfight or comparing **** is developed far enough to have a real impact.You may laugh a couple of times but the result really is a weak, talky series of sketches that never pay off, or should not continue for 100 minutes... but it sadly does.What's worse, the characters are super bland (even Peter Dinklage and Kathy Bates are wasted) and the central heroine is as soulless and kind of zombified as the whole experience feels.Still not convinced that Melissa McCarthy can carry a movie. There's no single point that she really makes this role her own, instead of weakly impersonating Danny McBride and Vince Vaughn in their most boring movies.Thanks to the McCarthy's current star power and marketing it as a straight comedy, it managed to get 80 mil USD from cinemas. Way more than it deserves!Considering that McCarthy is also one of the screenwriters, and her husband Ben Falcone director and also one of the writers, it's surprising how they can't play to leading lady's strengths.Comparing to other recent big-name comedies, it's as useless as \"Zoolander 2\" and \"Anchorman 2\"."}, {"rating": "7", "text": "Just wanted to say that KRISTEN BELL & MELISSA McCARTHY have done a wonderful job in a very funny movie."}], "recommendations": ["the_dilemma", "the_heat", "due_date", "wanderlust", "tammy", "central_intelligence", "dodgeball_a_true_underdog_story", "dirty_grandpa", "spy", "get_hard", "paul_blart_mall_cop", "sisters", "neighbors", "forgetting_sarah_marshall", "the_spy_who_dumped_me", "blockers", "last_vegas", "the_hustle", "zoolander", "wedding_crashers", "tower_heist", "the_wedding_ringer", "along_came_polly", "a_bad_moms_christmas", "hall_pass"]}