{
  "id": 283,
  "title": "The Bridge on the River Kwai",
  "starring": [
    "William Holden",
    "Alec Guinness"
  ],
  "runtime": 161,
  "genre": [
    "Drama",
    "History",
    "War"
  ],
  "description": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson , the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
  "releaseYear": "1957",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7paXMt2e3Tr5dLmEZOGgFEn2Vo7.jpg",
  "categories": {
    "plot": 7.818181818181818,
    "acting": 8.384615384615385,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 8.0,
    "funny": 9.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Really enjoyed this movie and I think this movie will never get old even though it is already more than 60 years old at the moment I am writing it. It has action, many humorous moments and also actual drama"
    },
    {
      "rating": "8",
      "text": "The Bridge on the River Kwai is an excellent film, that says a lot more about the state of Hollywood in the time it was filmed than about World War II. There is some really stunning cinematography and beautiful acting, and this movie is just as worthy of accolades now as it was back in the day. There are a lot of errors in terms of realism and how characters would have acted and felt about the war, but that is kind of to be expected in a 1950s film. If you love classic movies, this is definitely one you should check out!"
    },
    {
      "rating": "10",
      "text": "This film is a thoroughly enjoyable watch, full of great characters, performances and iconic moments. Although only loosely based on true events it certainly gives a perspective of what it was like for P.O.W'S and there captures."
    },
    {
      "rating": "6",
      "text": "Some arresting location shots take centre stage in this pow movie that appears to somewhat explore the will of the human spirit to endure and overcome challenging hardships. Sadly it hasn't aged well and the slow pacing massively detracts from any tension buildup that might have improved the more dramatic sections of the screenplay."
    },
    {
      "rating": "10",
      "text": "The epic WW2 movie about a bunch of British P.O.W and their efforts to built a bridge and the efforts of a bunch of bold allied soldiers to bring it down and change the course of war. One of essentials of genre."
    },
    {
      "rating": "5",
      "text": "Un grand film de guerre ou plutôt sur la guerre et ses contingences, à savoir celle notamment d'un camp de prisonniers où l'on se demande parfois qui sont les prisonniers et qui sont les geôliers... Car si le Japonais est rigide et inflexible, l'Anglais est perfide et sournois. L'Anglais est également flegmatique et entre dans le camp au pas cadencé en sifflotant, très soucieux des apparences et de... l'honneur ou quelque chose comme ça.On se demande donc si c'est du lard ou du cochon, du pudding ou du sushi... sans doute un peu des deux, mon colonel. Le Japonais m'a d'ailleurs l'air un peu mou du genou, voire dépressif : moi, j'aurais commencé par faire un exemple et procédé à une décapitation au katana de quelques volontaires involontaires choisis au hasard. Après tout, le colonel nippon (ni mauvais) se balade toujours avec son coupe-chou...Tout cela est un peu drôle donc mais en même temps très sérieux et solennel, surtout que David Lean connaît son affaire pour donner de la grandeur à ses plans : il utilise le cinémascope comme personne mais aussi malheureusement une épouvantable \"nuit américaine\"... Les acteurs pour leur part sont excellents, le fameux trio Guinness-Holden-Hawkins fait des merveilles, l'acteur japonais également d'ailleurs. Holden qui est bien plus que le ballâtre de service qu'on aurait pu craindre, grâce à son personnage inattendu en fin de compte.Hélas, mille fois hélas, le film souffre d'un gros problème de rythme dans son dernier tiers : tout-à-coup, il se met à pédaler dans la semoule et fait du surplace : on a alors qu'une envie, lui donner un gros coup de pied au cul avec l'avance rapide de la télécommande. Mais ce n'est pas tout : tandis que la fin daigne arriver enfin, celle-ci se ridiculise et le colonel anglais fait n'importe quoi parce que dans le scénario, on a fait n'importe quoi. Je doute que la fin du bouquin de Pierre Boulle soit aussi... grotesque.En conclusion, nous avons là un beau film mais qui s'égare beaucoup trop dans ses longueurs et sa fin désordonnée. Dommage, j'ai bien rigolé au début mais aussi au milieu lorsqu'Hawkins manipule si perfidement (c'est-à-dire si britanniquement) Holden l'Américain."
    },
    {
      "rating": "8",
      "text": "a calculative allegory that symphonizes higher concept..The Bridge On The River KwaiThe Bridge On The River Kwai is a character driven war drama about a men with principles standing against the antagonist's camp as a protest with a never yielding spirit. The self-righteousness and morale conflicts is crafted with such nuance in here that the viewers never even questions it for once. And which then, breeds this portal of inner politics and torture and plethora of tactics like such, to convince and win over them in this mind game. The head to head arguments and political debates brewed among a pragmatic and brilliantly weaved conversations are electrifying to encounter on screen. Being aware of the innocence that these characters and brave tale is brimmed with, the makers easily draws out emotions from the audience that can easily melt you down. It is rich on technical aspects like background score, cinematography, editing and stunning camera work. Holden's practical and subtle portrayal is actually more than plausible but since the range offered to it, isn't as wide as Guinness's character that not only is given much more range and space but is also impressive as he flaunts it with such panache. The adaptation is smart and gripping despite of ticking for almost there hours, it contains a potentially jagged script. Lean's execution is always, layered and thought provoking where he takes its time eschewing the characters appropriately. The subjective procedure in here isn't crowded but competent and even busy that keeps the audience tangled in its chaotic and political war. Harrowing and mesmerizing images that shows both the aspects of the nature, inner politics in a camp and Guiness at the heart of it that fuels this war drama are the high points of the feature. The Bridge On The River Kwai is a calculative allegory that symphonizes higher concept through one's most simplistic nature."
    },
    {
      "rating": "9",
      "text": "This film is very lightly based on a true story of British prisoners of war who served in the construction of Indo-Chinese railways during World War II. Of course, the film (as well as, perhaps, the book on which it's based) takes a lot of creative liberties and isn't entirely stick to historical truth, which is normally bad but, in this case, is mitigated by the quality of the film itself. In fact, the film seeks to use this incident to portray the madness of war honor: on one hand, we have a Japanese officer who will have to commit suicide if he doesn't complete the bridge in required deadline; on the other side, a daring English colonel who literally wants to take all by the book and demands the military status of the prisoners respected by his captors. Both collide at first but then end up joining forces, in a way that we don't even realize what side the English are because their pride demands that the bridge be ready on time and be very good! Alec Guinness is the most notable actor, with a truly exceptional role and performance, but William Holden and Sessue Hayakawa also deserve applause for the way they stand. There are other actors who have been great but I highlight these by the psychological game of their characters. There is a lot of psychology in this movie and its merit of this trio. Cinematography is also good, with warm light and colors giving us the true feel of the infernal heat of rainforest. Another point I want to highlight is the costumes, especially prisoners. An army of rags. A final word to Colonel Bogey March who, with the film, became one of the most famous military marches in the world."
    },
    {
      "rating": "8",
      "text": "Alec Guinness masterclass, control and command in every scene.  The last 20 minutes is absolutely awesome.Drinking game where you drink every time they say \"good show\" would be rough."
    }
  ]
}