{
  "id": 3095,
  "title": "The King of Staten Island",
  "starring": [
    "Pete Davidson",
    "Marisa Tomei"
  ],
  "runtime": 137,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
  "categories": {
    "plot": 7.130434782608695,
    "acting": 7.303030303030303,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 7.862068965517241,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "For the people that says Pete Davidson was great.Did we see the same film? That dude is no fun at all. And that comes since SNL."
    },
    {
      "rating": "2",
      "text": "Amazingly pretentious film. You can tell that this guy is in love with himself in real life."
    },
    {
      "rating": "2",
      "text": "Boring and slow. It's a shame Buscemi signed onto this. Pete Davidson should be taken in microdoses, when you can't avoid his shtick."
    },
    {
      "rating": "4",
      "text": "This movie was sooooooo boring and long. This is not a comedy. This is a lifetime drama. Should of been at least 30 minutes shorter. Ok we get it, your dad was a firefighter, now get your **** together."
    },
    {
      "rating": "4",
      "text": "As a vehicle for Pete Davidson, I get what this film is doing. It is the typical experience for aimless young men who have collapsed under the pressure of our society (and trauma of loss). But this movie is really boring, unfocused, and annoying. As an Apatow movie, it is easily one of his weakest attempts. The faux naturalistic dialogue comes off pretty cringey and the characters are all fairly one dimensional. I could see enjoying this film when I was just getting into film as a young lad, but today it just feels like a waste of everyone's time."
    },
    {
      "rating": "0",
      "text": "Pete Davidson sucks. Judd Apatow and crew are the only thing keep this movie alive."
    },
    {
      "rating": "6",
      "text": "Honestly, I'm not a fan of Apatow's work or really him personally. I find his public persona to be that of a pandering, hypocritical Centrist hack. That said, after seeing the trailer and knowing a bit about Pete Davidson's personal backstory, I was looking forward to something a little funnier and with possibly some genuine heart. I was disappointed. I like Pete but the material here didn't really give him an opportunity to be very funny or show any emotional range. He was more or less a pet goldfish through the whole thing. It was like \"Yeah, he's moving and doing stuff but is watching this entertaining to people who aren't stoned... or even those who are?\" I mean, there are little bits and pieces of a character arc for Pete but they feel like teases for some bigger evolution that never happens. There's nothing that is clearly defined here. There is a lot of meandering in terms of story, wasted minutes that didn't need to be there, as with most of Apatow's films. And this film really doesn't have the truly poignant moments that allow an actor to show emotional range and show a clear pivot for the character. Does Pete's character grow or change over the course of the film? Maybe a little but somebody should have told his face that because he seems to have the same look on it through the whole thing. There was an opportunity for a really good, funny, moving film here and it was missed by a fairly wide margin. It's too bad because this could have been the career transforming vehicle for Pete that allows him to move on to film stardom and he seems like a nice guy."
    },
    {
      "rating": "5",
      "text": "Nice enough movie with the great talent of J. Apatow in transforming Pete Davidson as a truly likable character, which was quite a big task in my opionion. Biggest flaw of the movie lays however in its length and lack of rhythm of the last quarter."
    },
    {
      "rating": "0",
      "text": "Davidson is as insufferable in this movie as he is in real life, and about as funny here as on SNL.Incase the score didn't clue you in, that means this is terrible and you shouldn't waste your time."
    },
    {
      "rating": "7",
      "text": "Like most Apatow films, it’s funny and has some nice heart, while also being 20 minutes too long."
    },
    {
      "rating": "0",
      "text": "This movie is terrible boring and slow plus Pete really can't act don't even know why he is classed as a comedian really."
    },
    {
      "rating": "10",
      "text": "Good writing .period. Some funny moments no memorable but much better than the current garbage Rating is 7 (i give 10 for balancing)"
    },
    {
      "rating": "9",
      "text": "This movie is pretty good and is very entertaining, especially when Pete is on screen."
    },
    {
      "rating": "9",
      "text": "All the characters are interesting and likable. It's down to earth and you can identify with all the characters. It's an honest take on life and challenges in this timeline."
    },
    {
      "rating": "8",
      "text": "This was the latest film from Judd Apatow ('Knocked Up', 'The 40-Year-Old Virgin') and stars 'Saturday Night Live' star Pete Davidson as a slacker living with his mom in Staten Island trying to figure his future out and pursue his dreams of being a tattoo artist. He also tries to come to terms with his mom's new boyfriend, following the death of his firefighter father. This film is actually rather semi-autobiographical, as Davidson really did lose his firefighter father in real life due to the 9/11 attacks and currently lives in Staten Island. I've always found Davidson to be a pretty funny guy, and his comedic skills and even a surprising amount of dramatic skills are on display here with him, as he turns in some rather heartfelt moments in this. Marisa Tomei also turns in some great work as his mother, and even Steve Buscemi has a small role in this as a firefighter (Buscemi also happened to serve as a firefighter during the 9/11 attacks.) Really my only issue is that the film's runtime feels a little too stretched out, but otherwise, it's got plenty of laughs and tender moments to spare."
    },
    {
      "rating": "8",
      "text": "I'm a little surprised at both the user and the critic scores here. I thought that this was a really well put together film that had a lot of charm and explored something worth while. Possibly it's because people went into watching this thinking it was a \"comedy.\" I can understand how it not really being one could put viewers off. I found the movie to be pretty funny, but I had no expectations going into it because I though it was a drama before I started watching. (I really liked the Action Bronson sequence.) All of this said I thought the acting, story and cinematography where outstanding. When I say I'm not a big Pete Davidson fan it's not because I don't like him. I've literally never seen him in anything except a Comedy Central Roast, but I loved him here. He was fantastic. Both him and Bill Burr are so easy to connect with in this. I've seen some complaints about how long this movie is, but I never felt like it overstayed it's welcome. While I think the pacing of the story is fairly good, I do think that it took a little too long for it to get to what I'd consider the 3rd act. The thing is though, I'm not sure who this movie is for entirely? We all know or have that one person in our lives who is great and talented, but who also needs to get it together. This movie lets us root for them. I appreciate that because many times I feel like I am that person who needs to get it together."
    },
    {
      "rating": "10",
      "text": "really enjoyed the movie... very relatable... showing a good light on the heroics of the firemen and the struggles of the families they could leave behind. Worth a note...that I dislike Pete and his bad humor from SNL and even with that...the movie was great."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant. A great film to watch when in any mood. The tone is set right from the off and it is not only hilarious, but heartwarming. Amazing!"
    },
    {
      "rating": "10",
      "text": "Enjoyed every minute. Great character study, hilarious and amazing performances!"
    },
    {
      "rating": "10",
      "text": "Exceeds expectations. A strong “finding yourself” story that was hilarious but also emotional.. even more so due to the close parallels to Pete Davidson’s real life. Enjoyable story, great cinematography and acting.. it felt vulnerable in the best way. Hats off to all involved, especially Pete. Stole the show."
    },
    {
      "rating": "10",
      "text": "This movie isn’t exactly the best movie, but it is definitely an outstanding movie that shows how Pete Davidson’s mental health is and you can relate to it in a very heartfelt way. If you’ve struggled with getting your **** together and have lost a close relative it’s very relatable."
    },
    {
      "rating": "8",
      "text": "Really funny and entertaining dramedy, similar in the lines of Funny People. If you’re familiar with that, Apatow’s work, and Pete Davidson, then you’re going to really enjoy this movie."
    },
    {
      "rating": "9",
      "text": "Great movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "Wonderful surprise extremely well acted and thoughtful. Apatow at the  top of his game"
    },
    {
      "rating": "10",
      "text": "Davidson does great.   Good characters. I like the feel of the film.  Good ending."
    },
    {
      "rating": "10",
      "text": "amazing raw movie! love pete davidson and his story one of a kind"
    },
    {
      "rating": "10",
      "text": "Beautiful coming of age tale. Can’t wait to watch again! Pete Davidson, Bel Powley, Bill Burr, Marisa Tomei, Maude Apatow and the rest of the cast were amazing!"
    },
    {
      "rating": "10",
      "text": "Loved this movie so much! I watch a ton of movies and the balance of laugh out loud moments mixed with times I was tearing up was really high. Burr and Tomei killed it with the acting. Pete Davidson was incredible too. Judds directing was masterful - great pacing. Can’t recommend enough!"
    },
    {
      "rating": "10",
      "text": "This movie was great everything just flowed together so perfectly, the acting was great, it was funny, and again it was **** funny the humor was just great because their was obvious humor and subtle humor Which really tied the movie together. I really recommend this movie."
    },
    {
      "rating": "8",
      "text": "great movie has characters you can relate to while also being funny and having of message. Showcases the struggles of mental health and people even family not understanding how it feels."
    },
    {
      "rating": "6",
      "text": "This text does not contain spoilersAnd that's just a short review, not all parts of the film, and it's just a summary.It was better than the recently released movies in some funny moments and in some really silly moments.But on the whole, watching it once can keep you entertained for a while."
    },
    {
      "rating": "10",
      "text": "Incredible, true eye opening. Pete Davidson has made a stellar performance in this."
    },
    {
      "rating": "7",
      "text": "It's good but I was expecting a little better. I think the length and overall quality is decent."
    },
    {
      "rating": "9",
      "text": "So sad that the pandemic may have hurt this movie so much. SNL is such hot garbage I judged Davidson unfairly forgetting how young he is plus all that other tabloid nonsense. He is credited as writing or co-writing and that right there on top of his acting, the casting is near perfect - big home run in my opinion that Davidson may not be able to take a victory lap for. Wherever the movie lags, or looses its narrative threads - overall I was extremely impressed. Bill Burr's casting and performance really brings it together in a wonderful way. I may be biased or see things in this film, due to my own experiences losing my father when I was 19, others may not. I really enjoyed it and I came in expecting to hate it. Note: I actually had to shut it off after the first 20 mins and had to try again because I thought I knew where things were going. So glad I was wrong. Damn, so many good performances."
    },
    {
      "rating": "7",
      "text": "Easily Pete Davidson’s best and most genuine performance. This is a solid and funny and surprisingly moving film from Apatow and his best film from the underrated Funny People."
    },
    {
      "rating": "10",
      "text": "Do not get these user review scores at all. This wasnt just great humour all the way through. It was a genuinely moving drama. Great movie."
    },
    {
      "rating": "7",
      "text": "It was a good movie but the 2 hour length really holds it back, with the 2nd act being the weakest."
    },
    {
      "rating": "7",
      "text": "Pete Davidson’s first starring role was in Big Time Adolescence, which showcased his solid acting skills. This newer film was created/directed by comedy icon Judd Apatow, but it’s not really that funny. It’s more of a character drama with Davidson at the center. In a scenario inspired by his own life, he plays a slacker living at home with his mom (Marisa Tomei) and still grappling with the death of his firefighter father when he was seven. The film rambles thru his days, getting stoned with friends and other useless activities. When mom forms a relationship with another firefighter, it causes the predictable conflict. While the situations are interesting and the cast creates uniformly interesting characters, the focus is on Davidson, who once again demonstrates his undeniable charisma and considerable acting talent."
    },
    {
      "rating": "6",
      "text": "I have to admit, my interest in this project hinged almost entirely on Bill Burr's involvement and, in this admittedly flawed regard, I suppose \"The King Of Staten Island\" doesn't necessarily disappoint. There are some memorable Burr-isms throughout (rants, one-liners, ball-busting, etc.), but this obviously isn't the Bill Burr show. So, as a semi-autobiographical look into the life and struggles of Pete Davidson, I can say \"The King Of Staten Island\" does well enough. Some have offered up criticisms involving the likability of the lead character and I'll surely sit for those. My main, protagonist-centric gripe really only involves the amount of inertia present within him for such a long portion of the movie. I understand that laziness and disillusionment are big parts of the character's inner turmoil, but having to follow someone with no inclination for any sort of activity can spell for a trying watch. This was that kind of watch for me at times. You're also handed the typical, Apatow-ian pitfalls — directionless scenes, bloated running times, etc. — which I always expect, but somehow never quite get used to. It helps that the third act is actually the best part of the movie this time around, something I never thought I'd say about an Apatow film since \"the 40-Year-Old Virgin.\" In any case, though, this remains an ultimately enjoyable, yet occasionally rough offering."
    },
    {
      "rating": "0",
      "text": "here and again a well rated film that delivers absolutely nothing. wasted time."
    },
    {
      "rating": "7",
      "text": "Not a fan of Pete Davidson but its a fine day for something relatively funny. King of Staten Island is relatable and definitely worth a watch."
    },
    {
      "rating": "5",
      "text": "No matter how hard the filmmakers and cast tried to sell this story of an angst-ridden millennial perpetually mourning the loss of his firefighter father, I didn't buy it -- not for a minute, despite a semi-autobiographical story and script by protagonist Pete Davidson. Director Judd Apatow's overlong, unfocused comedy (a term I use loosely) takes far too long to find its feet, and it does so with an endless string of snappy, smarmy one-liners that don't jibe with the supposedly fragile mental state of the allegedly troubled lead character. And, when the film finally does start to move forward, the narrative's warm, fuzzy conclusion lacks plausibility in light of its cynical setup, a problem made worse by steaming heaps of melodrama and inordinately saintly characters primed for canonization. While the picture genuinely features a fine performance by Marisa Tomei, its attempt at making Davidson's character into more than the one-dimensional player he is sorely falls short, a fate not unlike that shared by many other former SNL regulars who have attempted to transition from the small to the big screen. In all, the premise here is shaky to begin with, and it's made all the worse by too many tangents, insufficient clarity and poor execution, suspicions that first surfaced when I screened the trailer and that became all too apparent while sitting through this endless slog."
    },
    {
      "rating": "7",
      "text": "I enjoyed it, was fun comedy, with interesting story, I like Pete Davidson and from all of comedies lately this was quite ok."
    },
    {
      "rating": "9",
      "text": "Very good performances and remarkable storytelling, Davidson in a real revelation."
    },
    {
      "rating": "10",
      "text": "The King of Staten Island was one of the funniest movies I have ever seen but also had great depth and was emotionally powerful, one of my favorite movies of all time. Pete Davidson's performance was astounding, just one of the most hilarious performances I have ever seen but with some strong emotional depth as well. Marisa Tomei and Bill Burr gave phenomenal supporting performances, they very both were really funny and Marisa had great emotional depth to her performance as well. Bel Powley, Steve Buscemi, Rickey Velez, Maude Apatow, and Moisés Arias gave funny performances. The writing was exceptional, it was hilarious and had great depth and emotional weight. The character development was stupendous especially with Scott. The costumes were fantastic especially ones wore by Pete Davidson, Bel Powley, and Marisa Tomei. The makeup and hairstyling was outstanding especially on Marisa Tomei, Bill Burr, and Bel Powley. Also the music was great. An A+ movie."
    },
    {
      "rating": "5",
      "text": "This film is really held up by its performances. Most everyone does a great job and portrays their respective characters very well. Pete Davidson and Bill Burr are easily the best parts about this film. I’ve never been a huge fan of Davidson but he really fits here. Burr brings his usual funny attitude here but shows a more sympathetic and kindhearted side which is nice to see. The biggest issue with this film is the screenplay. It feels like the first draft which means some of the dialogue is pretty rough. Some of the characters dialogue feels awkward and unnatural. I definitely would have enjoyed this film more if they had spent more time on the screenplay. The film is also about 30 minutes too long and that’s a complaint I’ve heard about a lot of Judd Apatow movies. A lot of moments could have either been cut out or just shortened. With all that aside, the film is well shot and I did get a couple of laughs here and there. Check this out if you want or if you like Pete Davidson and Bill Burr."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)Mirror, mirror on the wall, who is the most destroyed and narcissistic millennial of them all?"
    },
    {
      "rating": "0",
      "text": "Pete Davidson is a terribly unfunny person and a terrible actor as well. Sucks"
    },
    {
      "rating": "4",
      "text": "Garbage movie. I'm from Winnipeg, Manitoba Canada the home of the Canadian gangbang. This film doesn't really tell what's like for young bucks to lose their father. To pretend to do tattoos, etc. Out here son if your homeless you die cause  winter is -45 below. Ain't no fake fireman and stuff like that. And this film was shot in the NY? No, life is harder than that. Some 24 yr old no one hanging on by a thread. kids like that get snitched on in real life because their not real. Try to think about people before making a bunk film like this. Some rich ass kid who cries cause too hard smoking weed? I'll have the natives down here scalp a boy for turning his back on my crew. Pet my cats belly? WTF? More like support my wife and kids or I'll kill you when I get out of Stoney Mntn Pen for real."
    },
    {
      "rating": "9",
      "text": "Too long, as always, but I loved it anyway. Pete Davidson is a star. And Judd patow can do no wrong."
    }
  ],
  "recommendations": [
    "silver_linings_playbook",
    "greenberg",
    "destination_wedding",
    "logan_lucky",
    "the_upside",
    "chef",
    "palm_springs",
    "uncut_gems",
    "friends_with_benefits",
    "the_five_year_engagement",
    "meet_joe_black",
    "tag",
    "seven_psychopaths",
    "eddie_the_eagle",
    "good_will_hunting",
    "burnt",
    "the_dilemma",
    "that_awkward_moment",
    "instant_family",
    "the_nice_guys",
    "inherent_vice",
    "delivery_man",
    "the_intern",
    "hustlers",
    "the_break_up"
  ]
}