{"id": 1076, "title": "The Longest Yard", "starring": ["Adam Sandler", "Chris Rock"], "runtime": 113, "genre": ["Comedy"], "description": "Pro quarter-back, Paul Crewe and former college champion and coach, Nate Scarboro are doing time in the same prison. Asked to put together a team of inmates to take on the guards, Crewe enlists the help of Scarboro to coach the inmates to victory in a football game 'fixed' to turn out quite another way.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nbKcVBcxF96ARW2oKHqDYAcLdu.jpg", "categories": {"plot": 6.454545454545454, "acting": 6.285714285714286, "ending": 5.0, "soundtrack": 6.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.757575757575758, "action": 7.0}, "reviews": [{"rating": "10", "text": "If you are a foot ball fan you will love this movie it is funny, intersting, and weird but over all it is the BEST movie EVER!!!"}, {"rating": "6", "text": "While some of the jokes aren't very funny and the movie is cliché and predictable, it's still very watchable and entertaining. The acting is okay, the soundtrack is quite good, the movie was very entertaining and it was just an overall fun watch. While this is not one of Sandler's best comedies, it's still worth watching."}, {"rating": "5", "text": "\"The Longest Yard\" was a slightly funny movie, although at moments does not seem to be, the performance of Adam Sandler, was essential, and especially the story that was told in this film."}, {"rating": "5", "text": "It was ok. Had it's funny parts and it was good for about the first 1/2 of the film before it once again (like every Happy Madison production) became corny and generic. Still, I think the first half of the film alone makes it worth the watch."}, {"rating": "1", "text": "I usually don't give my advice on movies, but I'm shocked by Bit Burn 's review: GREAT STORYLINE ????  You can find this movie funny or not, but there is NO STORYLINE WHATSOEVER ! Honestly you have to be football fan and have a lot of pop-corn and friends aruond you if you want to spend a good time with this movie. lame."}, {"rating": "2", "text": "If you're a teenager and love American football and smoke joints: you can give a shot to this movie, since it is well-acted, but buy an illegal DVD instead of giving money to stupid filmmakers. The jokes are not great but the first part, with the car chase, is funny. Then Adam plays the hero, he's ok but not as good as when playing the anti-hero. If you're not a teenager and you have a brain, even high you should AVOID this movie ! After a nice beginning, you will be annoyed by easy jokes until you eventually totally fall asleep in front of a looooong game of American football. Totally dumb, should be a 1 half an hour movie for such emptiness."}, {"rating": "1", "text": "Lame. This prison is irrealictic. Watch Animal Factory for a better insight. This comedy is not very funny. Watch White Chick for truly funny stupid American jokes. Adam Sandler is not a charismatic hero. Watch any other Sandler movie to see him as a great looser, so much suited to him. Oh I like Adam and he plays well here, but he's just not charismatic. He's great as a sympathetic drunko the first minutes, but as a leader... pff. The football game part feels almost as long as a real one. Why don't you watch a real game ? The usual good feelings, petty morals, and happy ending, so dear to Hollywood cinema, sweeten a comedy already sweet at first. A family treat BEEERK."}, {"rating": "3", "text": "There is very little about this movie that is funny. Humorous is the best it gets in a few spots. It totally lacked the character development of the original and I found I could care less if the convicts won or lost."}, {"rating": "10", "text": "I love this movie. It is funny."}, {"rating": "2", "text": "This pitiful remake was even worse than the self-consciously mediocre original. Sandler is trying to make a career by reprising a variation of himself in every movie he's in. Is he that one-dimensional? Is there nothing else he has to offer? Apparently not."}, {"rating": "5", "text": "This is the definition of an Adam Sandler movie. It has some very funny scenes, but the scenarios are ridiculous and never would actually happen, the writing is very low on any sort of intelligence, and Sandler's performance is mediocre at best."}, {"rating": "10", "text": "This is the best movie in the hole world. i have watched it over and over and over again and i never get boared. if only every movie was as good as this one."}, {"rating": "10", "text": "Its the best movie ever."}, {"rating": "4", "text": "Hey, I'm a movie critic.  Anything a couple of decades old thats still metioned today is automatic five star cinema in my book. Stop kidding yourselves. The original was an average movie. This was an average movie."}, {"rating": "7", "text": "More like 7.5/10. Great storyline, good action scenes, fun to watch...then again I'm a big Sandler fan. It helps."}, {"rating": "8", "text": "This movie is funny. People who say it isn't need to get laid"}, {"rating": "10", "text": "I dont know why people dont like this movie. I thought it was funny to the max. One of the best scense I like the most is when Adam Sandler makes fun of that one short guy with the big ears. WOW that was great. Of course the prison is not realsic and I think the movie did want to make it realict, Come on people its a comandy, Its not to be realsict, thats why its funny haha love the black guy that gives out Mac donlads haha loved that. Well I give this 10, for the sweet hits and funny scenes."}, {"rating": "7", "text": "Adam Sandlar stars in an inserting role as a confused ex-football pro whose life gets turned upside down after he is arrested and sentenced to prison for drinking and driving with a vehicle he stole from his girlfriend. The first 15 minutes of the film are boring and leave the viewer indifferent. The jokes become more and more ridiculous as the plot unravels in a federal state prison. Sandlar continues to drain out his performance as a boring, heartless man while James Cromwell, Burt Reynolds, and Chris Rock essentially convey grand performances as very interesting and at times hilarious people. Seeing Sandlar"}, {"rating": "10", "text": "This was an absolutely outstanding movie."}, {"rating": "8", "text": "Very funny. Although the faces may look familiar, it's not quite a typical Adam Sandler movie like Little Nicky or Billy Madison. It has it's good jokes, it's cheap jokes, it's solemn moments, it's tense moments, and protagonist has a nice \"likable\" feel to them. I've never seen the original, so I won't compare. But either way, I reccomend this movie."}, {"rating": "10", "text": "Excellent movie,very well done,i liked the beginning the most were he crashs his girlfriends car."}, {"rating": "10", "text": "First of all for all haters out there ya'll need to stop because the actors on the longest yard did they thang. They were very funny and they worked extra hard too. That movie was very funny to me, Chris and Adam are so talented. But Nelly did his thang on the scene too, I never seen that man act so well and he was lookin' good too. Good job Nelly, keep it up and keep the haters comin' too."}, {"rating": "6", "text": "Has its moments, but all in all does not match up to the original."}, {"rating": "8", "text": "Adam Sandler and Chris Rock use their own expertise in comedy to inject a fair few laughs into this amusing (and, at one point, sad) flick. It will appeal to footballers and comedy-lovers alike."}, {"rating": "9", "text": "A very surprising comedy with darker tones than other Adam Sandler and Happy Madison movies, and honestly I didn't mind, although one or two of the more dramatic moments feel out of place or poorly handled, it's still a fantastic movie, Adam Sandler gave an amazing performance, and the whole thing kept me hooked until the end, and in my opinion this is a must see."}, {"rating": "7", "text": "It was a ok movie. I'm not to fond of the remakes, some movies just need to be left alone. This remake wasn't to bad, it keep almost to the original storyline,which make it worth watching. It had a also an all-star cast of actors. It's worth seeing,but not paying top dollar for."}, {"rating": "6", "text": "It was rather funny and enjoyable up until the last 1/3 or so of the movie when it became far too serious for it's own good and lost every bit of funniness to it. Still not that bad of a movie and worth checking out."}, {"rating": "8", "text": "really funny!!! i don't understand who criticize this movie because it not show the true life in jail...IT'S A COMEDY(probably the best Adam Sandler's movie)"}, {"rating": "6", "text": "The remake of the Original \"Longest Yard\" is indeed funny. It's has the shakes that will make you quake, The fries that will cross your eyes, and the burgers... Well, you get the point."}, {"rating": "8", "text": "People who are part of the Happy Madison audience will get exactly what they are expecting from an Adam Sandler comedy.  Juvenile humor, product placements, and sports jokes."}, {"rating": "7", "text": "The Longest Yard was the second best movie I've seen that starred Adam Sandler (first being Happy Gilmore), and I'm surprised that Burt Reynolds wanted to star in the film, because his character had to get rammed by one of the guards. Sure they used effects, but still, he's pretty old now."}, {"rating": "8", "text": "I'm not a huge football fan, but I love a good football comedy. The Longest Yard is as good as any. I never watched the original film but I think its cool to bring back Burt Reynolds who was the star of the original movie from 1974. This movie features Adam Sandler who was at the top of his game as an actor and producer and some of his common collaborators like Chris Rock ( who may be the best character in the film) and Terry Crews as the hilarious Cheeseburger Eddie. The Longest Yard has an outstanding cast overall with several funny characters and despite its clichés it still manages to be as strong of a sport comedy as they come. This film has made the rounds on cable television numerous times after 10 years and if you've never seen it tune in sometime."}, {"rating": "7", "text": "A rapper, Nelly, professional wrestlers Bill Goldberg, Bob Sapp, Dalip Singh (The Great Khali), and \"Stone Cold\" Steve Austin, and NFL stars Michael Irvin, Terry Crews, and Brian Bosworth, are the heart of The Longest Yard. The athletes' here have screen presence to spare, and the movie oozes with goofy machismo."}, {"rating": "3", "text": "longer than it accounts for..The Longest Yard1 And A Half Out Of 5The Longest Yard is a misguided plot driven feature whose fatal attempts to install humor forcibly gives it away within few minutes. As one does assume, the tone is similar as any other Sandler feature does and so does the humor and characters offered in here. It is short on technical aspects like sound department, background score, editing, costume and production design. The writing is weak and relies a lot upon the adaptation (except for humor) and offers a very little fresh perspective to feed upon. The updated screenplay might be funnier in its own terms but isn't something that holds the viewers and the primary reason would be its sometimes cheap humor and ludicrous attempts to draw in the laughs fails on whole life. Peter Segal; the director, requires some more work on the execution skills for it is uneven and loosely scattered around varied sequences. The performance by Adam Sandler is decent as he draws out most of the laughs but his supporting cast like Chris Rock and Burt Reynolds didn't seem in their A game. The Longest Yard is actually longer than it accounts for, as the blurred out vision of the destination never clears up for the makers."}, {"rating": "5", "text": "No he visto la original de 1974, pero juzgándola como película como tal por sus propios méritos puedo decir que zafa. Cumple a medias tanto como película de prisión, como de deporte. Tiene algunos momentos que valen la pena ver, pero se hace demasiado predecible, algunos chistes son malos, y nunca se nos explica porque el alcalde quería ganar a toda costa el partido. Ademas de que la primera parte de la película solo es una mera excusa para dar un conflicto. De hecho, nunca se vuelve a mencionar a la esposa del protagonista ni nada, así que esta parte podría haber sobrado totalmente."}, {"rating": "10", "text": "Is a real masterpiece. Obviously not the best storyline but I love how they could make jokes without restriction, you can´t find any movie nowadays like this. It makes you laugh and pray for a sequel"}, {"rating": "8", "text": "The Longest Yard is like The Waterboy, the differences is The Waterboy are more sweet, light, funny, and entertaining, The Longest Yard is more serious, pretty dark, funny, and entertaining too, so both movie are great, all the cast especially Sandler's played the character so well and he is really good in here, The Longest Yard is another fun movie from Adam Sandler and of course the Mean Machine Team."}], "recommendations": ["the_wedding_ringer", "hubie_halloween", "dodgeball_a_true_underdog_story", "ride_along", "zack_and_miri_make_a_porno", "sandy_wexler", "horrible_bosses_2", "the_other_guys", "central_intelligence", "forgetting_sarah_marshall", "30_minutes_or_less", "zoolander", "tropic_thunder", "thunder_force", "tower_heist", "horrible_bosses", "little_fockers", "get_smart", "the_break_up", "blended", "pitch_perfect_2", "identity_thief", "this_means_war", "my_spy", "just_go_with_it"]}