{"id": 1592, "title": "The 5th Wave", "starring": ["Chloë Grace Moretz", "Nick Robinson"], "runtime": 112, "genre": ["Science Fiction", "Adventure", "Action"], "description": "16-year-old Cassie Sullivan tries to survive in a world devastated by the waves of an alien invasion that has already decimated the population and knocked mankind back to the Stone Age.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/37vpRkrD4OxQN0MQ7C59eszkylh.jpg", "categories": {"plot": 6.136363636363637, "acting": 7.4, "ending": 8.176470588235293, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 9.0, "action": 7.75}, "reviews": [{"rating": "5", "text": "An almost exact mix of \"The Hunger Games\" and \"The Divergent Series\"\r One year more, and more best sellers have come. A teenage girl abandoned by her parents, five threatening waves, one brother to the rescue, and a couple of guys to fall in love. \"The 5th Wave\" is an adaption of the book of the 2013 written by Rick Yancey. Its main protagonist is the talented and beautiful Chloe Moretz as Cassie Sullivan,  a high school student who is threatened by one group called \"The Others \", she will need to survive in a dystopian world full of dangerous and enemies for one reason his younger brother. Director J Blakeson returns to be in the director's Chair and possibly create a successful and profitable franchise, emphasizing the script created by Jeff Pinkner, Susannah Grant and Akiva Goldsman that gives light to the atmosphere so off.\r In the beginning, the character played by Chloe (Cassie) is the kind of good American girl cliche of some films.  She attends a party up to certain time because her parents are home, loves his brother and sing you a song of good night, it's the same again.  This middle class girl suffers a rapid transformation process, it all begins with the arrival of the aliens.\r Appears momentarily the first wave, a pulse electromagnetic which leaves the town in shock. With a surprising and boring short duration each wave dismantling quickly, each with a duration of about 3 minutes, missed the potential that It had the introduction of the phases. Floods, tsunamis and tidal waves attack the world, establishing a short but sexy scene of Cassie escape and her brother.\r The third phase is the flu, and shows us the introduction of characters with short duration and unnecessary (Cassie best friend) used only to create a dramatic scene, the same thing again.\r As it was logical her family seek refuge after harrowing moments. The girl has to deal with horrible things (deaths, falls, lost, pains and all that stuff) but the worst is what gives way to the plot of the film, the abduction of her brother.\r The training of the young soldiers is very similar to the tone in \"Kingsman: The Secret Service\", taking refuge in a room for everyone and subjecting them to harsh tests.  The performance of Maika Monroe (Ringer) was quite successful and arguably is one of the young promises next to Chloe Moretz who truly have the honor to be called \"actresses\".\r They have arrived and the plot twist of a discovery is maintained in a stable limit, being predictable for some but unimaginable to others. So finally the 5th wave happens, and the argument starts during this.\r Walk through the dangerous forest with a gun makes see a totally powerful Lady and is on the road where it meets the twin \"Four\" ( The Divergent Series) Evan Walker (Alex Roe) a survivor with secrets who is madly in love with Cassie.\r The work of Sam Sullivan (Zackary Arthur) is as to the height of the roles of older people, can tell no difference with his companions, this boy have future.\r \"The 5th wave\" might be more successful if its producer Sony would have expected a little more of time, when the really interesting sagas like \"Divergent\" or \"Maze Runner\" had finished and the hungry young people will ask for new franchises. But they didn't , and now it seems to be an almost exact copy of its competitors. This film was not disappointing, but this was not the best time for Cassie."}, {"rating": "5", "text": "Everything about 'The 5th Wave' is very middle of the road. It isn't exactly a bad movie but nor is it one I would go out of my way to suggest people should go and see. A major problem with the film is the lack of originality in its narrative. As you watch it you start to see where the story of the film is going from a mile off, turning intended plot twists into confirmed predictions. Now this isn't to say that the film doesn't have entertaining moments, it does, but with the narrative being so by the numbers, the general flow of the film (particularly when it reaches the second act) starts to grind and become less engaging. A positive aspect for the film is the cast, in particularly Chloe Moretz (Kick Ass) who delivers a lot more range than any of her previous works, and takes to the lead role rather well. Considering this is the first movie of a planned trilogy and although I found it overall to be quite underwhelming, I would still like to watch the sequel as I can see there is potential, although perhaps that's more in the young actors rather than the film itself."}, {"rating": "4", "text": "The 5th Wave doesn't deliver, but it doesn't disappoint. The movie throughout is dull, and it tries too hard to bring in action and suspense. Good concept, but bad delivery."}, {"rating": "4", "text": "I went and saw this movie because Zootopia was sold out. From what I'd seen on the trailers, it looked like another Hunger Games/Divergent. I was right. I watched another female protagonist deal with family issues as she stumbled through the forest alone with nobody that could help her. Until, of course, she met a boy that she originally didn't like until she saw him bathing in a river. It was arguably better than most movies of its kind, however, given that it had some moments that actually made me cry. However, the part before \"the first wave\" was cheesy, a classic red-solo cup party with drama about a boy she liked. That part felt forced and awkward, probably because the director hasn't lived as a teenager today- understandable. The duration of the film in the first four waves was emotional and devastating, major props for that. However, aside from a few good scenes, everything else following that was much worse. Between flat characters (the \"agressive one\", the \"kid that needs protected\", the \"smart one\"), another plot where the teenagers have more power/skills than adults (probably meant to make teenagers feel empowered), and a rushed romance, the movie felt flat from a beginning that could have separated it from other movies of its type."}, {"rating": "3", "text": "Fairly cliche and often painstakingly boring. Chloe Moretz is awful here. I often wonder how book-to-movie adaptations such as this one go so wrong..."}, {"rating": "8", "text": "The 5th Wave dosen't disappoint. It was really-really good! The story was quiet excellent, really. But the only bad aspect of the movie was, for it's small \"Teen Drama Scene\" moments, and the s----y ending (no worries, I wont say a damn thing) Chloë Grace Moretz performance was really-really good, and so other actors... It wasn't really bad, actually. Just those parts I mention earlier... :D"}, {"rating": "10", "text": "Loved it! It was a great YA movie! If you're not into YA movies you probably won't like it and will be critical of everything, but from someone who loves YA movies this was great!"}, {"rating": "10", "text": "The 5th wave delivers. It grabs you and won't let you go until the credits end. It is hauntily gripping. I don't know what the critics saw, but it sure wasn't the 5th wave. The 5th wave takes a new form of YA adapations. It is a new spin of this gener.  The waves and action sequences are gripping. The actions are really good and mind blowing. Chole does a great job protraying Cassie. Go see this movie, you won't regret it."}, {"rating": "10", "text": "The strong female lead is what makes the film stand out, which Chloe does an amazing performance as Cassie.  The film in whole is a trill joy ride. The actions in this film is amazing. Seeing the waves coming alive is hauting. Don'tpay any minds to critics; they don't know anything. As you can tell, audiences enjoyed this film because it is really good and entertaining. Of cource it has a little love story, but the actions, the grippingniess, and the hautinginess is what makes the movie enjoyable. Watch the film and enjoy."}, {"rating": "10", "text": "The 5th wave is what movies all about. It is entertaining, has actions, has a great performances of a female lead, and most of all its haunting. Seeing the  waves  unfold is scary. Chloe does a great job as the leading role Cassie. Don't let others make you skeptical about this film. Go watch it!! It had great actions and is  higly entertaing.  You don't need to read the book to enjoy the film. The film stands on its own."}, {"rating": "10", "text": "I can't believe I'm actually saying this, but in a field of crowded dystopian films, The 5th Wave is one of the very best. From the first scene, I couldn't take my eyes off the screen. Chloe Grace Moretz was fantastic in this film as well as her boyfriend. I felt like there were some pretty good intense disaster sequences and the film just went really well. The plot is a bit predictable and the last 30 minutes were pretty slow, but that first hour just really blew me away. Most of the people who say this movie is bad or at least not entertaining probably didn't go see the film, because the film might have its flaws but everyone must admit they were entertained for at least a small bit. I've never read the book, and I probably won't but I'm dying to see if they make a sequel."}, {"rating": "10", "text": "Who do you trust when all humanity is lost? That is the basic theme of The 5th wave. Based on the first book of a planned trilogy, the present world is being invaded by aliens, eliminateing the human race with 5 waves. The last remaning humans are divided: Some are left alone to fight to surivive, some are taken in by the gorvement to form an elite group to take back their world, and some are taking by the \"others\". Cassie's little brother is taken by the others and it is up to her to save him.  Cassie is a stong female character, which makes the movie enjoyable. Chole does a great job of bring Cassie to life. Before going to see the movie, I thought I was not going to enjoy it becase it was other Hunger Games and Divergent, but I was wrong. I enjoy this movie; It has it's own twist and stands on it own. The action scenes are amazing and gripping. It has everything for the male and female audience."}, {"rating": "10", "text": "My son had mentioned me to see this movie, I really thought it would not surprise me let alone please me , but I actually found the fantastic movie without unnecessary dialogues and without much ado , I loved a lot and recommend it to everyone!"}, {"rating": "10", "text": "Shows an alien invasion a little different from what we have seen in Spielberg 's films for example, is not just explosions and advanced technology, has something else behind , say it's a very well-planned strategy , I particularly found a resemblance to \" the host \" as the long aliens, were parasites, but only that it reminded me of something that happened in another film and the course of the film to see a bit of cliché teen movies , but that does not diminish the movie , I promise to be a long VERY good and the sequence to be better, that defects will be corrected ."}, {"rating": "10", "text": "This movie has a very good argumentation and very good special effects ( if we don't count gunshots that are horrible ). Im really waiting to the second part"}, {"rating": "10", "text": "This film truned out to be actually good. I don't know why people are dislikeing it? Maybe becasue it other YA adaptations? That is being biased. Just becasue it is other YA, dosen't mean it's bad. YA is a type of genre; just like comedy and action.The 5th wave has a great stroy, the  actions are mindblowing and well done, the special effects are good. The strong female lead is what drives the stroy forward, which Chloe dose a great job. The Waves coming alive on screen is hauntingly. GIve this movie a chance and watch it. The best part of the films are the actions, which is action packed."}, {"rating": "10", "text": "I did not even being teens movie fan , the 5th wave surprised me , really good story and a post-apocalyptic world for us all refletimos.Adorei Chloe this film really deserves a continuation"}, {"rating": "10", "text": "A movie interesant and makes what the people can dream and think most. Chloe Grace Moretz makes fall in love and the movie is a good adaptation what can be the next Hunger Games"}, {"rating": "10", "text": "The 5th Wave is one of the best movies based on books currently , sorry that most critics only compares with the voracious games, but the film is perfect and performances are amazing and in no time the film gives sleep."}, {"rating": "9", "text": "The book was very good but not excellent and the movie is better than that. It is not an award winning epic movie but really a good story in the lines of the maze runner or the hunger games. Critics are being to hard on this movie, an excellent January release."}, {"rating": "10", "text": "I came to the theater with low expectations after reading some reviwes; however, I was wrong. The 5th wave is a good movie and highly entertaining. I don't know why people are so harsh. The film is gripping from the opening till the end credits. The actions in this film are really good and the film has a great pace. The actors doese a great job. The Waves are haunting and gripping. Watch this film, you will come out likeing this film regrardless what critics says. Just look at the user score: it has a GREEN 6.7 score out of 65 rating with 38 postive reviews. That speeks for it self."}, {"rating": "9", "text": "Another hit for the YA genre.  While most YA novels/movies are set in a future dystopian society, the 5th wave is set in present time with invasions coming in 5th waves to eliminate the human race. The polt of the 5th wave is what it makes it different from the rest of the YA adapation; let alone making it scary to think the alien invasion will happen this way. After the \"others\" take Cassie's, played by Chloe Grace Moretz, brother,she is set to look for him. Along the way, she meets Evan Walker who joins her to look for her brother, but somwthings not right with Evan. Is he one or the others or one of the last remaing human? The 5th wave won't dissapoint fans of the novel. It has twist and truns and lot of great action. It also answers the question Who do you really trust in the time of need?"}, {"rating": "8", "text": "Fans of the YA books rejoice! The 5th wave has finally has come. Not to be happy that the 5th wave has come to earth, because it is scary has heck. As a matter of fact, Waves 1-4 is shockingly terrifying, but that what makes the film adaptation gripping. To see the waves come alive on the big screen is terrifying. The actions scenes are best as it gets; it mix with war, surviving combat, and lets not forget about the waves, which will haunt you. The film adaptation will not let the fans of the book dow. It is a true adaptation that will grab you and won't let you go."}, {"rating": "3", "text": "When I saw the trailer of this movie I thought it would be a median action movie, but no! the actions scenes are horrible, the characters are all stereotyped, the scenes are totally predictable, and even in the end of the world the main concern is: which boy will the girl choose? it's like a twilight saga in the end of the world. The movie is not good, although I have liked the idea of waves specially the fifth one, but this is not enough."}, {"rating": "9", "text": "The 5th wave is actually good. Don't pay attention to the critics. The 5th wave has everything for eveyone. The actions sequences are gripping. Chole gives a great performance as Cassie. You wont regret watching this movie. You should take a chance and forget what critics say. Remember, they get paid to say whatever. Don't let others ruin your chance on watching this entertaining movie. Just read what the audience are saying, they too enjoy the film."}, {"rating": "10", "text": "The 5th wave is acutally good. I was skeptical about watching this because of the critics, but as all ways critics are wrong. The 5th wave is a fun and entertaining thriller movie. It will have you on the edge of your sets. The actions are great. The waves are gripping. Chloe does an amazing job. Take a chace. You will enjoy this movie."}, {"rating": "10", "text": "A full jolt of thrill ride. I normaly don't like this type of movie, but the 5th wave is actually good. It's actions sequences are not only mind blowing but gripping  also. Chole's performances is great.  The film stands out from other YA adapations due to its new twist and take. The film will thrill you from start to end. It is higly entertaing."}, {"rating": "10", "text": "Brace your self the Waves are comming. The 5th wave is not your average aliens invasion; it's way better. It gives something new to not only aliens but to the YA aswell. The performance of chloe is what makes the female strong lead interesting and enjoyable. The actions in this film is well played out. I won't lie and tell you that the film is not gripping; it is. The waves will hit you and grip you. I recommend the 5th wave. Watch it."}, {"rating": "10", "text": "A new take on YA adaptions with haunting elements that will surly have you on the edge of your seats. The 5th wave is a trill joy ride, no matter what the critrcs says. I came into the movie thinking the movie will be a drag, but i was wrong. From the first few  minutes the film will grab you and won't let you go. It is gripping watching the waves come alive from book to film.Chloe Grace Moretz  gives a strong performance as Cassie, one of the last survivors, in search of her little brother, after aliens invades earth in waves. NO, it is no tindependence day, it is way better and realistic.As with other reviews, the actions in this film is great and haunting. Go see this movie. You would not regret it. Take a chace like I did. You will find out that you will acutally enjoy this movie."}, {"rating": "9", "text": "I normally do not like YA adaptions, but I found The 5th Wave to be actually a entertaning movie. The film has great amount of actions that are not only mind blowing but also gripping. It has has good special effects of the  different waves. This film will not only taunt you, it will also grab you and not let you go!"}, {"rating": "10", "text": "I had low expectations after watching the trailer. I thought, \"Oh great! another pointless aliens taking over the world movie.\" However, I was wrong. The 5th wave is more than just about  aliens. It about the will to surviveand humanity  It is way better than independence day movie. What the 5th Wave does is take aliens and twist it around in a realistic  setting with real  humanity issues. It has great action and special effects. This movie is so realistic that it's gripping and taunting."}, {"rating": "10", "text": "Finally, another great YA to look forward to. The 5th wave delivers in a fast paced, gripping thriller. Yes, Gripping. The Waves and actions in this film is so realistic that is hauntingly gripping. Don't listen to the critics. This movie is worth the watch in theaters. Look at the 45 postive reviews. Obversely people are not paying any mind to the critics, and they end up likely the movie anyways, so would you. The actions and acting are so well done. Treat yourself to this  gripping film. You will like it."}, {"rating": "10", "text": "I was like eveyone, haitng this movie just beacuse it was another YA adapations. However, after seeing this film, I was mindblow. This movie has a new twist of Dystoipina. The actions and waves are  left me speechless and mindblowing; It is that great. The speacial effects are well done. The actores perfromaces are also good. The movie has lots of great actions.  Don't pay mind to the haters. Watch it for yourself. You will have so much fun on the edeg of your set thril ride."}, {"rating": "8", "text": "Scary. Haunting. Gripping. The 5th wave delivers. The fans of Rick Yancey's best selling YA novel won't be dissapointed in this adaptations. Chloe Grace Moretz gives a greatperformance as Cassie, a strong female character that made the novel gripping and loved by many. After aleins landed on earth and eliminating the human populations with forms of waves, Cassie is left alone to survive  after the others took her brother. Determined to save him, Cassie sets out to look for him. Along the way, Cassie meets Evan after he saves her from one of the others. But in a world where everything fight for your self, who should you trust? Is Evan one of the other? or is he really human? The 5th wave is a gripping movie that will have you on the edge of your set. The actions are mindblowing. The waves are scary.  The evierment is gripping. The 5th waves is awesome. You won't be disappointed."}, {"rating": "10", "text": "The book '' The 5th Wave '' is too large to develop each character , however, they measured right to be able to put everything , even taking some major parts that I really missed , it remains a great adaptation , performances really are very good, effects are not amazing 100% more are great ."}, {"rating": "0", "text": "How on earth do movies like this get made???  Good god!!  It's starts as an action movie - the slows down\rto a snails pace the rest of the film. It's complete with bad dialogue, cliche romance, etc...\rwhat a complete waste of money and time. I hope the movie studios go bankrupt for making all this crap and charging a fortune to see it."}, {"rating": "9", "text": "Don't pay any minds to the harsh reviwes of this film. The 5th wave is really good adaptation. It has allelements of a thriller/suspense film. The waves are haunting and scary. This movie is about the fight to save  humanity when all it lost. It is also about the will to live and survive. The strong female lead is well written and perfromed. The actions  in this movie is top notch.  So treat yourself to this movie. You will actually like it regradless what people are saying."}, {"rating": "10", "text": "The 5th wave is surpriseingly a good film. It takes a new route on YA adaptions and new twist on aliens invasion. It makes Independence  Day  look like child's play. The 5th wave is more on a serious note and touch bases on humanity and the will to survive when everything is lost. Instead of nonsese blowing up stuff like independence day, the actions in this film is hauntingly and gripping in a realistc setting. Chloe Grace Moretz gives a strong performace in the female lead. Give the film a chace and watch it. The actions are mindblowing and the Waves are haunting."}, {"rating": "10", "text": "This is not your average aliens coming to earth to wrack havoc. This film lies heavily on strong humanity, which makes other aliens film look like a mindless  cartoonish, Disney film. What sets The 5th Wave apart from other aliens films is that this film is on the realstic side. It's heart is fighting for humanty when everything is lost. The actions in this film are gripping and scary. Chole gives a great performance as Cassie, as well with the other actors. Don't follow the dislike reviews. This film is worth the watch in the big screeen; go see it."}, {"rating": "5", "text": "Didn't really know what to expect from the movie as I had never read the book. The movie started off really good with the different waves but then turned into a bit of a teen drama movie in the end"}, {"rating": "10", "text": "This film is surprisingly goood. I had low hopes for this film, but this film is amazingly entertaining. I think people should give this film a chance and watch it. You will find your self on the edge of your set. The actions are full blown amazing. The suspence is taunting. The waves is hauntingly  terrifyig. The 5th wave delivers."}, {"rating": "10", "text": "The 5th wave is not really a bad movie as people are saying. It a good entertaining movie. It even a fun thrill ride with twist and truns throughout the movie. The waves are scary and gripping. The actions in this film are throughout the film. It a new take on aliens invasion in a realastic enviorement. That what makes the  5th wave stands out. It is will pull you inside the film beacuse it has a realastic setting and realastic action. Go watch it before yor regret it."}, {"rating": "0", "text": "Avoid this one.\r About the FX, sorry but we are pretty sick of it  but its not the main problem. The history sounds great but the characters are  the problem, they are really unrealistic.\r People are more simple, when they are scared then they are scared (obvious, no?), not in love or with personal issues.   When people are scare then, they run, cry, getting shocked and so on. There is not time to talk about feeling. Why?, everybody feel like a crap.\rI wonder why Hollywood simply don't do a high school movie?."}, {"rating": "10", "text": "What a fantastic movie! I am a fan of alien movies but good ones can be hard to come by, at times. I loved the plot of this movie as well as the acting. I loved the idea that they attack in waves rather than just one sudden invasion. I have not read the book yet but look forward to doing so."}, {"rating": "6", "text": "I liked the idea of the movie and it was quite interesting throughout, I don't know why it has so many negative reviews. Only thing which I did not like was towards the end that it basically didn't solve anything and that some of the things started to be too weird and did not make sense. Plus they made it kinda that it will have sequels and if it is trying to make itself as another Maze Runner, Hunger Games etc franchise I think that's a bad idea."}, {"rating": "10", "text": "I read the book and I have to say the film really does hold true to it (for the most part), could almost say \"exactly how I imagined it\". It was done very well, the special effects were great, especially in the beginning. Perhaps only change i would want it the actor for Evan Walker, didn't really sell me on the part. Otherwise, really great film, I don't understand why critics are panning it."}, {"rating": "10", "text": "Be warned! You  will be taunted, haunted, and even jolted because the 5th wave will put you on a trill ride. This movie is good; no matter what others says. This dystopian film is so realistic  that you will be drawn into the films and characters. The actions in this film is fully loaded, which is also on the realistic stide. Chole gives a strong performace as the lead chatacter Cassie. You don't need to be a fan of the book to enjoy this film. It will blow you away."}, {"rating": "10", "text": "Wow! Just wow! From the opening scene the 5th wave will capative you. Then, it will grab you and won't let you go until the end credits. Then, it will leave you wanting more. I don't know why the haters dislike the YA adaptions. The 5th wave is a  good dystopian thril ride. The realistc enviorement is what makes the aliens invasion powerful  and scary. The actions are well done and top notch. It is full of twist and turns without the actions stopping. Watch this movie. you will like it."}, {"rating": "0", "text": "This movie is Horrid It Has no Suspense  Half The Movie is Predictable And The action Scenes Are Horrible The concept is pretty Cool Actually But It Was Pulled Of Horribly"}, {"rating": "3", "text": "Everything wrong with modern big budget film-making. An insult to intelligence with what is essentially a dragged out unimaginative and obvious twist. A waste of an example of a potential strong female leading role which instead culminates in a hilariously awful love triangle."}], "recommendations": ["maze_runner_the_scorch_trials", "maze_runner_the_death_cure", "a_quiet_place_part_ii", "super_8", "edge_of_tomorrow", "tomorrowland", "transformers_dark_of_the_moon", "glass", "avengers_age_of_ultron", "i_am_number_four", "bumblebee", "the_13th_warrior", "avengers_infinity_war", "limitless", "freaks", "mad_max_fury_road", "battle_los_angeles", "the_matrix_revolutions", "the_day_after_tomorrow", "the_matrix_reloaded", "bright", "pandorum", "they_live", "colossal", "the_hunger_games_mockingjay_part_1"]}