{
  "id": 556,
  "title": "The Experiment",
  "starring": [
    "Adrien Brody",
    "Cam Gigandet"
  ],
  "runtime": 96,
  "genre": [
    "Thriller",
    "Drama"
  ],
  "description": "20 men are chosen to participate in the roles of guards and prisoners in a psychological study that ultimately spirals out of control.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zy6hJYii2PJfMRoUBlULhfuLsgL.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 7.75,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Interesting throughout the complete duration. The love story integrated seemed kinda exaggerated but everything else was shocking and quite realistic."
    },
    {
      "rating": "6",
      "text": "This film was intense. It was based off the Stanford Prison Experiment, but if I remember correctly, nobody really died at the end of it, though someone did get removed early, and some of the psychologists actually tried to stop the experiment earlier than 6 days. Great performance by everyone in the cast. But I'm not a big fan of the story, since it seemed a bit melodramatic; the phrase \"that escalated quickly\" really describes this film. I wish they'd actually stuck to the facts instead of aiming for the disgust factor. They made the psychologists look like real genuine gullible idiots in this film; first, they let an ex-convict in (they obviously did not do any background checks), second, they let a potentially psychopathic guy in, third, they took their participants at their word (people lie, it's a fact)."
    },
    {
      "rating": "3",
      "text": "I got this movie after I discovered it was written, produced & directed by the genius behind Prison Break Paul T Scheuring.\r The two leads are brilliant, and it was clear from this film how they were both Oscar winners.\r A couple of the scenes were brutal, overall a good movie, not the best I've ever seen, but I'm glad I bought it."
    },
    {
      "rating": "9",
      "text": "There is only few mistakes: The movie is a bit unrealistic and sometimes the actors are too quiet and should speak louder. But other than that it is a top movie with good acting and humanistic meaning. Especially I like, that the movie focus on the psychological development of the characters."
    },
    {
      "rating": "7",
      "text": "\"Das Experiment\" the original version, was unsettling, so much that plays an important role in psychology and philosophical, good characters and a very good story that will keep you glued to the seat, so I felt it."
    },
    {
      "rating": "8",
      "text": "L'Expérience est une sorte de \"jeu\" grandeur nature, un \"test\" éminemment instructif et édifiant dans lequel 8 gardiens sont chargés de surveiller 12 détenus sous l'oeil attentif des expérimentateurs qui veulent ainsi regarder à la loupe, puis éventuellement disséquer le comportement humain dans une telle situation...C'est inspiré de faits réels et bien entendu on se doute bien que tout cela va partir en vrille bien vite... On pense évidemment avant cette \"expérience\" à celle de Stanley Milgram sur la soumission à l'autorité et la déshumanisation stupéfiante qu'elle a engendrée. Ici, le réalisateur allemand Oliver Hirschbiegel exploite à fond le concept et le creuse à l'extrême.De façon très progressive, il démonte et démontre habilement toute la mécanique qui va mener à la violence, au sadisme, à la cruauté et à l'humiliation. Puis au meurtre. L'ambiance est très réaliste, telle une sorte de quasi-documentaire et si quelques points scénaristiques sont sujets à caution (le rôle de la copine, anecdotique et dispensable notamment) si peut-être une certaine exagération fait pencher finalement le film vers le thriller plus classique, il n'en reste pas moins que l'objectif recherché est atteint : nous voilà sidérés par cette Expérience qui n'a rien perdu de son impact, bien des années après.On retrouve quelques pointures du cinéma allemand et la mise en scène caractéristique de Hirschbiegel : plutôt froide et peu amène en vérité mais contrairement au cinéma américain sans aucun effet de manches ou de guimauve superflue. Pas de \"leçon\" non plus, car les \"faits\" parlent d'eux-mêmes et ça, c'est très appréciable. Un film passionnant et très efficace, toujours aussi saisissant."
    },
    {
      "rating": "7",
      "text": "An interesting film that started innocently enough, but gradually started to build up and ended in a proper style. Prison had its own atmosphere and it was made even better by the fact that it was an experiment based on a true story. What I also liked was the brutality at times, which the film didn't shy away from. For me, a good film that I can recommend."
    }
  ],
  "recommendations": [
    "a_history_of_violence",
    "child_44",
    "the_machinist",
    "sicario_day_of_the_soldado",
    "hereafter",
    "no_country_for_old_men",
    "zodiac",
    "the_good_shepherd",
    "prisoners",
    "the_devil_all_the_time",
    "donnie_brasco",
    "the_last_duel",
    "memento",
    "savages",
    "eastern_promises",
    "good_time",
    "argo",
    "the_girl_with_the_dragon_tattoo",
    "elle",
    "allied",
    "the_beguiled",
    "white_boy_rick",
    "the_prestige",
    "you_were_never_really_here",
    "the_infiltrator"
  ]
}