{
  "id": 335,
  "title": "The Fate of the Furious",
  "starring": [
    "Vin Diesel",
    "Jason Statham"
  ],
  "runtime": 136,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "When a mysterious woman seduces Dom into the world of crime and a betrayal of those closest to him, the crew face trials that will test them as never before.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dImWM7GJqryWJO9LHa3XQ8DD5NH.jpg",
  "categories": {
    "plot": 7.066666666666666,
    "acting": 7.04,
    "ending": 6.777777777777778,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.625,
    "action": 7.341463414634147
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Entertainingly terrible and terribly entertaining, The Fate of the Furious muscles past its forgettable plot to deliver a symphony of glorious vehicular mayhem."
    },
    {
      "rating": "5",
      "text": "\"I'm gonna knock your teeth so far down your throat you'll have to shove a toothbrush up your ass to brush em'.\"How do you review a movie like this without being too critical. Like yeah, it's loud, stupid, and nothing makes sense. But that's what you expect by now if you've been following the series. It's simple entertainment and the film dose it's job well of doing just that. For me, it was a blast to watch and it had me smiling.I always enjoy the energy and the ridiculousness of these movies. Really pushing how far you can take this series. You've been with these characters for so long, the crew really do feel like family.Can I just say that the scenes between Dwayne Johnson and Jason Statham are the highlight of the film. The back & forward insults are so silly, but amazing to watch. I heard that a possible spin-off is in the works just with those two. I actually want to see that.But if I have to be critical, I will gladly do so. Because while I had fun with the movie, but I can't bring myself to call it a good film. The acting and the line delivery from everyone is really awful (expect for Dwayne, Statham, and Tyrese). Every time the movie gets serious, it's painful to watch. I don't mind where the series is going at this point, but I kinda feel like the last one (Furious 7) would've been the perfect ending. That's just me.Overall rating: FAMILY!"
    },
    {
      "rating": "4",
      "text": "What a mess this film was. For me, the most weakest instalment thus far. The villain was hardly memorable and her motives were for the most part, vague. There were numerous moments that didn't connect with each other well at all. The entire plot felt baseless and pulled out of nowhere a lot of the time. However, because it is Fast & Furious, it doesn't necessarily need to. There were obviously enjoyable moments behind these dumb segments. Though the action sequences as a whole weren't much of an improvement on the previous instalment, I still found them pretty good and the comedic value is still rich. Dwayne, Jason and Tyrese notably did pretty good jobs at exactly that.When it comes to this franchise, I expect great action and great comedy. It's peculiar in the sense that the action was alright and the comedy skits were very good, but the overall foundation of the film is incredibly poor to the extent that it stands out now unlike its predecessors. It just weighs everything else down. It has certainly faltered in quality. All I got from this film was the feeling of a franchise being dragged on for too long. I feel as though they should have left it after Paul Walker sadly passed away. It would have been the perfect and most appropriate swansong. Now it just feels like it's just dragging itself to the finish line in the longest way imaginable. But I'm still gonna see them - what's 2 more gonna do after I've seen this and the last 7?"
    },
    {
      "rating": "7",
      "text": "I love this movie I rated 7/10 because is no Fast and Furius 7 and its good as well but the plot holes are a lot but its soooo bad scripted and thats all"
    },
    {
      "rating": "6",
      "text": "By this point, there is no more to say to waht to expect from this movies than to do something more ridiculous than the previous one, and in that aspect, this movie delivers with crazy and memorable stunts. On the bad side, with the unfortunate passing of Paul Walker, Vin Diesel's character has moved to \"God\" level similar to the XXX series (which I don't like at all). Nevertheless, crazy stunts, some good funny lines, nice cars, explosions, and all around fun makes this an enjoyable ride all with the 50-60 times the word family comes around. If you are a fan, you probably have already seen this. If you hate dumb actiones movies, avoid but for a fun popcorn night, this definately works."
    },
    {
      "rating": "2",
      "text": "I generally enjoy the FF franchise because they're so over the top and doesn't take itself too seriously. This movie, not so much. Every scene felt like a commercial, everything was a one-liner, and the villain was boring. You may enjoy it but I couldn't even stay awake."
    },
    {
      "rating": "6",
      "text": "… Aaaand we’re back in the magical land of Vin Diesel, where the family always come first, the cup is always full, the national sport is grabbing life by the balls, and everybody and everything is at the very height of its powers, or ready to get annihilated.Thus far promoted mostly as „The Fate of the Furious“, there’s actually nothing ultimate or definitive about this eighth installment of loved larger-than-life action series.Just business as usual although there's nothing wrong with having some of the \"good old\" if it comes in such a spectacular package.Part 8 doesn’t disappoint here. There’s a lot of beauty on show – may it come in the form of people, cars, locales or physical laws defying action.Most of the setpieces are so cool that you just have to wonder at the amount of work all this must have required, done digitally or in real life – from the starting race in Cuba to the prison riot to the zombie car army to attacking the Arctic military base, or pretty much everything in-between.The Arctic part itself is so huge that it should have been saved for another movie, perhaps „FF9“. In current form it’s like a last dish in the end of the big feast: one could enjoy it more if the belly was not so full already. Also, it could benefit from having more breathing room. The events are so cramped together and the heroes get already comically lucky here, that it loses some of desired impact.In the competence porn subgenre, \"FF\" is still one of the big ones, alongside \"Mission: Impossible\" and James Bond. I wouldn’t call the new one also the new king but it’s good enough to satisfy the hunger for another slice of truly over the top action that Vin Diesel seems to have dedicated his career to. Not to forget, he appeared in another episode of „xXx“ earlier this year also.The cast is cool as always. We have:* most of the main crew (Vin Diesel, Michelle Rodriguez, Dwayne Johnson, Tyrese Gibson, Ludacris),* expected side crew (Kurt Russell, Jason Statham, Luke Evans, Nathalie Emmanuel)* and some promising fresh faces (Charlize Theron as the main baddie, Helen Mirren, also Celestino Cornielle and Kristofer Hivju in small but very intriguing parts). I hope some of the new ones figure heavily in future sequel(s) because they have not enough room to shine here.We have also Scott „son of Clint“ Eastwood who’s bit of surprising addition, lacking the screen charm or physicality of every other star here. I hope they are not considering making him a regular.Speaking of the future, I would be excited to see the \"FF\" series seriously considering the hard mission that it has usually avoided so far, part 7 maybe excluded.Namely, the original movie is not just about grabbing life by the balls, or beautiful girls and cars. It’s about staying true to family and building better life for them. It exhibits a strong sense of place and community; a world which is attractive already by itself, where the audience would like to stay in – not that often seen in movies, action or otherwise.I secretly believe that this hidden depth is a part of the reason the first „FF“ was able to birth this mega franchise we still get to enjoy all these years later. And this is where the series should head back to.Because let’s be honest, the action can’t get much more spectacular and over-the-top than we’ve seen so far – without doing Bollywood, at least. And the movies about having heart could actually do with having a bit more depth and heart.Two sequels have already been promised, in April 2019 and April 2021 respectively, and I am sure they will find ways to outshine (at least some of the) massive action setpieces seen so far. They always do, although it always seems kind of impossible having just finished watching the latest. But seriously, how about going back to the roots?The title abbreviation „FF8“ reminds me of the function key F8, commonly used in desktop computers to access Windows Safe Mode. Playing it safe is exactly the movie’s only downfall.The real drama is promised but ultimately missing, although the promise is great, with the central hero getting caught up with some demons and Diesel proving he has enough acting chops to play it out convincingly."
    },
    {
      "rating": "5",
      "text": "I had the hope that they would stop doing this movies in honor and respect to paul walker but they don't. the movie eeeh it has lost what people liked , bets. streets race , etc and now are policy,family,robbery Family, less cars, FAMILY!!!"
    },
    {
      "rating": "4",
      "text": "Let me get a few things clear; I buy into the franchise. The logic and physics although real, is a part of the series; and I get that.The reason I still enjoyed the series despite it's flaws was because it was fun. This installment however, is not fun. It is literally just 3 fun sequences held together by a bad plot. The movies as a whole is boring and predictable as hell. The law of diminishing returns in evident here.If tomorrow they announce that they won't be making a 9th part for this, I would be okay with that."
    },
    {
      "rating": "6",
      "text": "High octane ridiculousness, a total disregard for plot, and a submarine combine for the eighth installment of this surprisingly long-lived franchise. These films aren't about storyline or film craft, they are about explosions piled on top of fisticuffs with a layer of destruction derby and a sprinkling of absurdism; this latest offering delivers on all of these elements. The performances are hammy, though Theron does manage a few chilling moments, and the cinematography is the standout aspect of the film, with some brilliant sequences handled expertly. An utterly ludicrous film that revels in its own joie de vivre. 6.83/10"
    },
    {
      "rating": "6",
      "text": "We have better start calling the actual \"Fate of the Furious\" because this feels like this could go on forever. One of the things that Fate of the Furious failed to do is focus on the things that Furious 7 did not focus on often. Sure we got something new to the table, but the table needed new ideas to help this franchise go back to its original roots. Fans could love this film all they want, but once they get to the hanging of it, they'll probably forfeit the franchise like how these guys should've been a long time ago."
    },
    {
      "rating": "0",
      "text": "My very first 0 EVER This movie is more about kids than cars The next movie in the franchise should be called \"Fast Families.\" The Fast movies have become less furious and are losing what made them any good to begin with"
    },
    {
      "rating": "1",
      "text": "Bald meat-baby-man convinces the world he is an action star, not in fact, Groot. Questionably dreadlocked Charlize Theron, with the power to create mass hysteria via hacking superpowers and fly in a plane that never needs re-fueling - decides to instead hatch an absurdly elaborate plan involving a baby, bald-meat-baby-man, fancy cars, a nuke, and an old Russian submarine in order to \"make the world accountable?\" Green-screen work on par with that \"Reading Rainbow\" episode, you know the one, where LeVar climbs that mountain. Michelle Rodriguez attempts to hold in her lunch when kissing bald-baby-man-meat. Also, fake keyboard clicky-hacky wars - \"I've got her\" *click *click \"Take this\" *clicky *typey \"Darn, she locked me out. What a hacker.\" Thanks, China."
    },
    {
      "rating": "0",
      "text": "When did Fast & Furious go from racing to every other Action Movie in history.. and no racing.This doesn't even compare to FNF7, this series should've ended at 7, did I mention 7 was better? Cause it is."
    },
    {
      "rating": "6",
      "text": "Fast 8 still retains the ridiculous fun and absurdity that the series is known for at this point. But despite some excellent set pieces, this doesn't quite have the same charm that's made the past few so good. And a major reason for that is the absence of Paul Walker. The interactions between the cast members doesn't feel the same without him and it did hurt my enjoyment of the film as a whole. Despite some standout moments between Dwayne Johnson and Jason Statham, it feels like a mostly recycled film that is beginning to run out of ideas."
    },
    {
      "rating": "4",
      "text": "People were walking out of the showing I was in and at times I felt like joining them. The film starts out well and it has a few novel ideas but its mostly just packed out with so many special effects they end up being not special at all, car crash after car crash, explosion after explosion, after a while it all just gets boring. Most of the film is facepalm worthy, but the hacking sequences take the absurdity of the franchise to new lows.The plot is dumb as dumb can be and you can see the \"twists\" coming from a mile away. Hollywood think their audience is so thick they even spell out the plot in the simplest terms via dialogue, and flashback cutscenes, when its blatantly obvious already whats going on. The actors do a good job with the lack of script they were given and characters with the depth of a piece of paper.Switch your brain off, feel your IQ dropping by the minute its so dumb, and a few hours pass by.Apart from one original, fun, sequence near the end its all been done better before."
    },
    {
      "rating": "9",
      "text": "this series is running like never gonna run out of gas,please leave the term logic out of your mind, this one is not the best in the series,but still one enjoyable great ride ;full of entertainment! story is not strong here,still engaging, chemistry between the actors are excellent,especially rock n my favorite Jason ,he just steal the show ,Vin Diesel present one of his best performance and he is mass, rock is gigantic- u will know after watching it, highlight of the movie is massive and thrilling action scenes,after the 8'th film,i still got entertained,that is the victory for the team,perfect summer entertainer,blockbuster!"
    },
    {
      "rating": "8",
      "text": "With this movie you get a lightweight story line, action scenes that don’t feel like filler, and some genuinely funny jokes. Personally I’ve always enjoyed more serious, thought provoking movies but if you change your expectations from wanting a realistic, story driven movie to a well done movie that includes morals, humor, and over the top (yet not completely stupid) action then Fate and the Furious hits the spot. It was surprisingly fun to watch and it beat my expectations."
    },
    {
      "rating": "0",
      "text": "Ugh. If this movie was any cheesier it would turn into a big block of cheese.It was like watching some silly cartoon. They have hit new lows.---------"
    },
    {
      "rating": "0",
      "text": "Please stop watching this series of films! Because of some people with very bad taste we get every year one more part of this boring story. Even Transformers is more realistic than this ****"
    },
    {
      "rating": "5",
      "text": "Not so great, not so bad.I believe the franchise would be better off ending with the seventh movie, But this movie is actually far better than the **** I thought it would be. 5/10 no more, no less"
    },
    {
      "rating": "1",
      "text": "In the wise words of Kirk Lazarus, \"Everybody knows you never go full r3t*rd.\"  Well there's r3t*rd and then there is The Fate of the Furious... It goes above and beyond. Now this isn't my first F&F, but with each installment they have gotten more stupid than the next though they have remained enjoyable for turning one's brain off, a guilty pleasure. This one is just too stupid though...Just everything. It does need watching just to see if you could survive it after the mass car hacking spectacle.. That's where I gave up, after that it's just as idiotic throughout.Really, this is a special kind of film."
    },
    {
      "rating": "1",
      "text": "The best part of this film is the prison sequence 9/10. After that, only the usual action with the scary scripts comes 0/10.Berlin is not in a mountainous region."
    },
    {
      "rating": "8",
      "text": "People coming to this movie expecting an Oscar worthy script and acting will be disappointed, but if you've come just to see mindless action and awesome cars flying in the air, you'll probably be satisfied. F8 knows what it is, it doesn't try to take itself to seriously, the pacing is extremely fast so you really don't feel bored at any point in the film. Almost from the get go you're seeing cars racing and crashing each other."
    },
    {
      "rating": "10",
      "text": "le pongo esta calificación porque crecí con estas películas y me siento identificado con ellas y cuando llego furious 7 dije la saga va por buen camino y con esta senti que ese es el camino lo único que puedo destacar es la ausencia del grande paul walker."
    },
    {
      "rating": "6",
      "text": "Though it lacks some of the emotional storytelling featured in Furious 7, The Fate of the Furious still delivers the ridiculous action and heady family themes that fans have come to expect."
    },
    {
      "rating": "7",
      "text": "The Fate of the Furious continues the series' remarkable special effects and over the top action set pieces with remarkable style. It also has a good story behind it that I overall enjoyed as it was an interesting turn for the series and surprisingly thoughtful."
    },
    {
      "rating": "7",
      "text": "If you are expecting a complex and thrilling action movie, turn away from this movie. This does not include the heartfelt feel like the last instalment, but damn is it a fun movie. All characters still have that undoubtable chemistry and the film does not take the subject matter in a serious way at all. Even though everything that comes out of Vin Diesels mouth is a crappy quote, I still found his performance to not be as annoying as expected. Comedy and explosions fuel this blockbuster, making it a spring break popcorn flick that audiences can enjoy."
    },
    {
      "rating": "10",
      "text": "If you're the type of person who watches a Fast and the Furious movie and criticizes the realism and physics of the driving, well... I don't know how you watch any movie.  The Mythbusters have made multiple specials showing how all movies get ALL of it wrong; guys don't fly back when you shoot them, cars don't blow up like that, etc.  So criticize this franchise when you're willing to criticize your beloved (insert title here).  Having said that... I felt that the series got off the rails with the last movie (7), where they tried to contain a movie about fast cars primarily to a building.  Then I saw the trailers for this sequel, and I was furious (pun not intended); the entire series is predicated upon Dom Toretto caring more about family than anything else... how are they going to pull of him betraying family?  I was worried that the series had run out of ideas, and had to resort to the cliche of having protagonist turn antagonist.  I went through scenarios in my mind, wondering what they could try to make this feasible without ruining Dom as a character.  Don't make him a cliched \"agent gone rogue\"... Jack Bauer would go roque temporarily for the greater good; that's his job, he's a secret agent.  Dom Toretto wouldn't.  He would choose family.  He always chooses family.  So I actually went to see this movie to hate it.  I was sure they'd run out of ideas, and I was going to see what stupid thing they did to put out another sequel to make more money.Boy was I wrong!  I think this might be the best film of the franchise.  The earlier films had more personal connections; loyalties, betrayals, reasons characters felt strongly about things and would die for them.  The later sequels had more and better action as the bigger budgets were allotted due to the franchises success.  This takes elements from both of those and turns it up to 11!  For the first time in a long time I had a reason to feel really strongly personally invested in the characters, in their success or failure, and not just so they pull off a heist and get more money.  Real, human personal reasons.  And after the skyscraper jumping antics of the last movie, thankfully they decided to take this film back outside... and boy did they ever!  The scale and technical execution of this film is by far the most ambitious, and quite grandiose in its execution.  Sure, it takes a little dismissal of reality, don't think too hard about the physics, but if you can do that, if you'll grant these guys the same suspension of belief you give the Avengers (and that comparison is really not far off; in this movie, the Rock is pretty much a super hero) you are in for one of the best action movies to hit theaters in a while.  There are wow moments everywhere you look, and whether they make you laugh or drop your jaw in awe, they're immensely entertaining.  I don't know why all the bad or mediocre reviews of this film.  The people suggesting it \"jumps the shark\" don't seem to understand what that phrase means.  And the \"ridiculousness\" seems to be toward the fantastical elements; these are the same people who said Dark Knight was amazing even though almost physical stunt that happened in that movie was just as ridiculous.  And a lack of plot?  That's just blatantly false.  There is a tight, well constructed action movie plot, with a twist that's quite good.  Like I said, I have no idea what they're talking about.  This is fast car, lots of explosions, over the top action for the whole family.  With characters we already love and a new reason to root for them.  Best of the series if you ask me."
    },
    {
      "rating": "9",
      "text": "The Fate Of the Furious is definitely a really good entry to the franchise after the disappointing Furious 7. The movie is an absolute blast from start to finish with great one liners , high octane action sequences and show stealing chemistry from the whole crew especially Dwayne and Jason . Despite going a different turn with the story, the movie falls under clichéd routes with some of its story arcs losing its steam ."
    },
    {
      "rating": "8",
      "text": "Is it a really well thought out movie? NoBut its damn entertaining, and that's all i go for when i watch Fast and Furious franchise. Its hilarious and action packed, with some great camera work.Charlize Theron was amazing, a different kind of villain, that always has a plan, showing the thinking side of Toretto.The ending felt a bit unsatisfying as they made Cipher such a hateable character and didn't kill her. And a lot of unnecessary slow motion sequences.But they really entertain you in this amazing flick"
    },
    {
      "rating": "8",
      "text": "Really, I thought it was quite entertaining. It's exactly how I expected it to be: action-packed, Tyrese with his comedy, & the Rock with his comedy & ass-kicking. Some things could have been better but all & all this is a F&F movie & a good one at that. The prior one was better (but you can't replace Paul Walker)."
    },
    {
      "rating": "10",
      "text": "that wasnt better than furious 7 but it was pretty good .............................................................................................................."
    },
    {
      "rating": "10",
      "text": "I haven't seen this movie yet but I know it's gonna be totally awesome because they got Vin \"The Rock\" Diesel back again and he's Furious! He's Fast! There's gonna be gunfights, car chases, explosions, action, cool expensive cars, sexy ladies, car chases! Drama! Cool rap-rock music! Big guns and explosions! Expensive cars! Boobs! Explosions! So much here to love about the fast and the furious movies i love all of them i watch them every day, every day of the week i watch a different fast and furious movie cuz there's 7 movies and there's 7 days of the week i have them all on blu-ray and i can't get enough FAST&FURIOUS its the coolest!!!!"
    },
    {
      "rating": "9",
      "text": "This is great example of a movie that is purely made for entertainment achieving exactly what it set out to achieve. I thoroughly enjoyed all the action and crazy physics, and it felt much better made than furious 7 in terms of CGI and physics. The humour hit the right spot as well. Overall, I think this is one of their best efforts yet and a highly entertaining movie for people not looking for some deep meanings or life changing experiences."
    },
    {
      "rating": "7",
      "text": "This movie will go down into the history books as one of the best action flicks ever made. Fate of the Furious had a $250 million budget, and it was definitely put to great use. Tons of one-liners, lots of laughs, and SO MUCH ACTION! Most of it is practical effects to boot! You don't want to miss, possibly, the best film of the spring/summer seasons!"
    },
    {
      "rating": "7",
      "text": "My review of \"Furious 7\" basically sums up this sequel (you can find it on Metacritic), except that \"7\" was better. There's another world domination villain (Charlize Theron) and the gang races around the world to save the day (with the exception of one character twist) . The action starts in Cuba (a great old-school mano a mano contest), moves to New York City (a cool assault of autonomous vehicles) and finishes in the frozen plains of Russia (under the ice and over the top). Meanwhile, the baby on a plane adds some moments of \"awwww.\" There's still plenty of fun, so fans of the series won't be disappointed. Still, this one is more talky, more about the mission and less about fast cars."
    },
    {
      "rating": "8",
      "text": "The F&F returns yet again, and it just as loud, ridiculous, and fun as ever. Only now there's even another layer of absurd thrown on top to keep things going. The idea seems to be just keep getting bigger and bigger to ensure the entertainment continues on. For the most part it works. You get explosions, shootouts, cartoonish fisticuffs, and of course high-speed car chases and other forms of vehicular mayhem. The big set-pieces are fun, but what really is going to keep the fans happy is that once again we get to spend time with characters we've grown to love.Every character still active in the Dom family hijinks returns. Same for a few familiar villains too. This allows for a lot of great banter when they rag on each other or dole out threats. The dialog can be truly hilarious. Charlize Theron is the big new addition as the mysterious villain who is seemingly able to pull Dom over to the dark side. She's pretty cool, but some of her overly serious monologues can be a touch too boring for a movie such as this. At least her inclusion and swaying of the series lead makes for a nice new twist in terms of what gets the character motivated to take her down, even if the plot ends up following the same order of events in terms of narrative structure as the last two F&F films. It's all about fun, fast cars, and a group of people who came together to form a family. While things get dumber and more nonsensical than ever here, the series hasn't quite jumped the shark yet. If you've enjoyed the previous movies you'll enjoy this one as well. It's largely more of the same, but we get some of the biggest action scenes yet. That proves to be enough for now."
    },
    {
      "rating": "8",
      "text": "In a world full of reboots, remakes, and franchises, here's an octoquel that somehow manages to run circles around a lot of the tired and self-serious sorts that have been flooding our motion picture market as of late. \"The Fate Of The Furious\" is a rip-roaring, bombastic, and hilarious action film that's refreshingly self-aware of how dopey it really is. And with a gripping, plot-furthering twist in store for veteran fans of the franchise, it's definitely more than worth a watch. It takes a lot to keep me coming back for the fifth, sixth, seventh, and eighth installments of one of cinema's most ridiculous IP's, but with this much fun abound, I'm not sure I want the ride to ever end."
    },
    {
      "rating": "6",
      "text": "Yes, it was action-packed and entertaining as expected. However, that doesn't mean that it wasn't completely over-the-top and ridiculous as expected, the only difference with this one being that it was taken to a whole new level of ridiculous that even I couldn't handle. The cast does a fine job of keeping it fun and light-hearted like always​. On the other hand, I found Charlize Theron to be a rather weak villain with unbelievably wooden dialogue. The story, or what little of it there was, especially with these movies, wasn't very well thought out either in my opinion. Overall, it's stupid fun entertainment just like all the other installments, and the cast remains likable for the most part. But in terms of new or innovative ideas for the franchise, it comes up unbelievably short. Definitely one of the weaker entries in this franchise thus far, with only Tokyo Drift still remaining the worst."
    },
    {
      "rating": "7",
      "text": "I'd put the F8 of the Furious about on par with Fast 7, maybe even a tad bit better. I walked into this not expecting much, I figured this movie would likely flop the minute it was announced but I found myself pleasantly surprised by how good this was. Performances, acting-wise were more on point with Tyrese Gibson, Michelle Rodriguez and especially Jason Statham each stepping up their game for this one. Make no mistake though, Vin Diesel and The Rock make these movies and this one is no different. These movies know what they are, theyre not like the Transformers movies where Michael Bay tries to make them something that they're not. This movie is mindless fun and action, like most of its predecessors but this one also brings to the table a mich more serious element that includes morals, humor, and over the alot of over the top action."
    },
    {
      "rating": "10",
      "text": "Loved it. Had a few cheesy moments but overall was action packed and nice mix of comedy into it. Totally worth watching. Can't wait for it to come out on Blu-Ray."
    },
    {
      "rating": "10",
      "text": "Epic epic waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaWaaaaaaaaaaajfkkldjjdkkdkskdkdkdkdkkdkdjdjdjdjjdjdjddjjdddjdjsjdjjdjdjdaaaw"
    },
    {
      "rating": "6",
      "text": "\"The Fate and the Furious\" was another film of the adventures of Toretto and his \"family\" now with a dark tone, Toretto betraying his \"family\", and working with a terrorist hacker, but history brought us emotion , And something of humor, something that did not have in mind, the protagonists were well, but what most emphasize is the villainous role that played Charlize Theron, there was action, tense moments, but if adrenaline all the time."
    },
    {
      "rating": "7",
      "text": "A preposterous and illogical story with some of the best action sequences ever! Yes, the story is ridiculous (like everyone in the movie is a genius), but it hooked me with all the excitement. The last 45 minutes is just pure awesomeness of adrenalin rush. And Charlize Theron is just fantastic as any villain she plays. Hats off to F. Gary Gray for directing a great looking movie!"
    },
    {
      "rating": "8",
      "text": "Otra de las películas que fuí a ver a la fiesta del cine fue 'The Fate of the Furious' y, como no, cada película de a todo gas me parece absurda, si, pero me lo hace pasar tan bien que no puedo decir que no me ha gustado.Esta entrega, para mí, está a la altura de las últimas, por lo que me parece un espectaculo. El dúo \"the Rock\" - Statham, no puede molar más. Y es ahí, donde reside el mayor fallo en que no salgan más en pantalla. Y por contrapunto, el personaje de Toretto, que ya empieza a cansar muuuuuucho. El típico sentimentalista que se toma en serio toda la película y hace que no mole nada, en ese sentido. El resto de personajes está en su línea, destacando a Roman y Ludacris que sus chistes siguen funcionando como el primer día.El guión no hay por donde cogerle, es malo, está hecho por gente muy cafre, pero es que es tan ridículo que mola, no puedes decir que es aburrido. Aunque algunas resoluciones de conflicto... mejor tomárselo a chiste.En conclusión, lo mismo que los guardianes, si buscas una película divertida, no pienses más esta es tu peli. Si te importan las cosas que ves, con esta (como con el resto de la saga, te vas a enfadar) Yo se lo que voy a ver, y por lo tanto, me encanta, y la valoro como una película de entretenimiento, y pocas me entretienen más que esta franquicia. La doy un 9."
    },
    {
      "rating": "8",
      "text": "unrealistic but very funny so much cool action and hot girls make this one of the best action movies i have ever seenBut fast five is still better ( i didn't see the 7 yet)"
    },
    {
      "rating": "7",
      "text": "I think people shouldn't take these movies seriously, i mean its just a guilty pleasure.A bunch of freaking funny and commercial actors joined together in order to bring some good action scenes, tires screeching ,fast driving, and defying laws of physics. If you want to watch this movie with beer, some nachos, and girlfriend under your arm, its great, but if you expect some mind blowing lines,good written script and amazing acting, then get the f... out!"
    },
    {
      "rating": "8",
      "text": "The Fast & The Furiocho (spanish pun there jeje)I will start by saying that EVERYONE that will see o want to see the movie, know EXACTLY what kind of movie it is.  DO NOT expect a very intriguing story or something very ground to the ground.  This movie is just pure fast adrenaline and over the top events one after another (it does topped the box office record on opening day btw, beating none other than the Force Awakens)And what can you expect of this movie?  Hot gals, fast beautiful cars, crazy action sequences and a good time if you are in for it.It have some good laughs and the action if very cool. The action sequences are very inventive, most likely not possible in real life but fun as hell. the fighting is great thanks to a badass jason statham and a hulking The Rock.Everybody's acting is what you could expect from the characters they are playing so it fine, they are all Special forces, street racing, rebel underground super agents that are also normal family people that just wanna have barbecue on a perfect rooftop in NY.Who doesn't want that??"
    },
    {
      "rating": "10",
      "text": "It is an action film not gone with the wind and that's the way we like it. The action and comedy flows pretty well, a lot of people seem to be hurt by the fact that it is not accurate to what standards? I ask, sure it's not Louis the XVI Coachella party as promised but it's an awesome film that's quite enjoyable as long as no one lets the stick they have poke them too hard."
    }
  ],
  "recommendations": [
    "furious_7",
    "mission_impossible_iii",
    "xxx_return_of_xander_cage",
    "escape_plan",
    "need_for_speed",
    "salt",
    "death_race",
    "angel_has_fallen",
    "skyscraper",
    "transporter_3",
    "the_a_team",
    "lockout",
    "transformers_dark_of_the_moon",
    "infinite",
    "the_ice_road",
    "kingsman_the_golden_circle",
    "the_mechanic",
    "mad_max_fury_road",
    "wild_card",
    "the_expendables_3",
    "the_expendables_2",
    "transformers",
    "premium_rush",
    "crank",
    "bloodshot"
  ]
}