{
  "id": 4383,
  "title": "The Taking of Pelham 1 2 3",
  "starring": [
    "Denzel Washington",
    "John Travolta"
  ],
  "runtime": 106,
  "genre": [
    "Thriller",
    "Crime",
    "Action"
  ],
  "description": "Armed men hijack a New York City subway train, holding the passengers hostage in return for a ransom, and turning an ordinary day's work for dispatcher Walter Garber into a face-off with the mastermind behind the crime.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/baRXNiLDOpz3rH3VyjhayhgkWll.jpg",
  "categories": {
    "plot": 5.222222222222222,
    "acting": 5.705882352941177,
    "ending": 5.0,
    "soundtrack": 5.5,
    "cinematography": 7.5,
    "familyFriendly": 3.0,
    "funny": 1.0,
    "action": 5.8
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Despite the fact that the movie suffered painful cliches during the whole time, \"The Taking of Pelham 1 2 3\" is a great,fast paced remake of the 1974 original (never saw it though). The movie's highlight you would want to watch is the frenzied cinematography of director Tony Scott as well as the tense acting of John Travolta and Denzel Washington."
    },
    {
      "rating": "9",
      "text": "Great acting."
    },
    {
      "rating": "7",
      "text": "The perfect rental. Not very substantial, but always entertaining and very intense when it needs to be. Denzel and Travolta's good/bad guy relationship is the star of the show here."
    },
    {
      "rating": "5",
      "text": "I'm a fan of the book and '74 film starring Walter Matthau and Robert Shaw. When I saw it it was a great idea of updating the setting to post-9/11 New York. The acting from Denzel Washington and John Travolta is good and the film is like a ticking clock film. The biggest problem is that while the first 2 acts are strong, the third and final act turns into a cliche action movie with loses all the momentum. If they chose and final act similar to the book and original film it would of been a lot better."
    },
    {
      "rating": "1",
      "text": "A roller coaster ride that doesn't make any sense. Just outright stupid."
    },
    {
      "rating": "10",
      "text": "Actors in this movie seem like they were given a lot of freedom in this movie and just have fun. Denzel and Travolta are amazing in this movie."
    },
    {
      "rating": "6",
      "text": "Sort of boring, two good actors saves it."
    },
    {
      "rating": "6",
      "text": "Travolta's manic emoting was over the top. Why do screenwriters feel compelled to infect every other line of dialogue with the F word? It's both gratuitous and juvenile."
    },
    {
      "rating": "3",
      "text": "I'm a Travolta fan, and a big Denzel fan, but together they just plain blew. The whole time you're just waiting for the movie to get good and it never does. Not to mention the ending was horrible."
    },
    {
      "rating": "5",
      "text": "The Taking of Pelham is very entertaining.\rOverly qualified actors with an average to poor script mixed with great execution. Plot holes plague this otherwise exciting film, and the directing is good. The film is well paced and the entertainment value is great. The last half of the movie then becomes sloppy and loses some momentum."
    },
    {
      "rating": "9",
      "text": "Great performance by Travolta and Washington. I really was surprised by how entertaining this movie turned out to be."
    },
    {
      "rating": "5",
      "text": "Most of the action in this film just seems unnecessary. It is slightly captivating. John Travolta is just too much. Give it up for James Gandolfini being the goofy mayor. He was the best."
    },
    {
      "rating": "4",
      "text": "It's not a bad film, its just been done so many times before. Denzel is the same, Travolta's not bad as the villain, but films like this need to be smarter these days. This isn't 1985. We are over Die Hard and Speed-type movies. Films like Inside Man, which are more intelligent and creative need to be the prototype for dodgy-yet interesting-action movies in the 21st century."
    },
    {
      "rating": "3",
      "text": "This movie was extremely tiresome. The only thing that worked to it's favor was the first two minutes."
    },
    {
      "rating": "7",
      "text": "It may leave you at the edge of your seat most of the time but there's something lacking in the movie. Nevertheless, this is a movie that will be remembered as one of the best thrillers so far."
    },
    {
      "rating": "4",
      "text": "What was the ingenious twist in this movie? That the bad guy is making money on the stock exchange? That the good guy follows the bad guy after he had a chance to escape. No. It s a disappointment. The story could be done in 15 minutes also."
    },
    {
      "rating": "8",
      "text": "No waiting around for action in the movie. John is awesome as a bad guy in this movie. From begining to end this movie is great."
    },
    {
      "rating": "2",
      "text": "Another movie that Hollywood should not have re-made."
    },
    {
      "rating": "6",
      "text": "The more things change, the more they stay the same. Pioneering filmmakers Auguste and Louis Lumiere would be proud. Recalling a nineteenth century bijou audience's reaction to a train arriving at a station(from the short subject film \"L'arrive d'un train a la ciotat\"), a young woman backs away from her computer screen when one of the terrorists discovers her boyfriend's laptop. Since \"The Taking of Pelham 1 2 3\" isn't a Japanese horror movie, her agitated state caused by the approaching man is unwarranted. She doesn't cover her face like a moviegoer would during the scary parts(for instance, Hideo Nakata's \"Ringu\"); she forgets about the physical laws of demarcation, just like those patrons who fled their seats from the speeding locomotive circa 1897. She forgets her twenty-first century sophisticated self for a split second and cowers as if her life was in mortal danger. But a lot has indeed changed since 1974: a self-reflexive moment comments on the Joeph Sargent original, in which Camonetti(John Turturro), the official hostage negotiator, tries to replace Walter Garber(Denzel Washington) as the lead actor by taking over the impending crisis. Ryder(John Travolta), despite being the story's antagonist, on an extra-diegetic level, performs textually as the film's advocate for social change, when he restores Walter to his rightful spot of being the man in charge(the leading man). Sharing the same first name with the original film's star(Walter Matthau played Lt. Garber in the early-seventies \"classic\"), not only does \"The Taking of Pelham 1 2 3\" pay tribute to the late actor, it also comments discreetly on colorblind casting, in which a \"man of color\" can play a role originally written for a white actor, as Washington did in a fairly recent Broadway production of William Shakespeare's \"Julius Cesar\" where he played Brutus."
    },
    {
      "rating": "2",
      "text": "Sometimes they shoud just leave things alone. The original with Walter Mathau was great. They tried to up that one using two very popular actors in Denzel and John T. Although the acting was great the story fell apart in the second half of the movie. And where the movie started out worryng about the hostages, instead an untrained Washington turned the ending into a mano to mano cops and robber caper with the passengers all but forgotten leaving them to get out of their own misfortune. Awful writing."
    },
    {
      "rating": "1",
      "text": "The movie was sailing along very nicey until the last 30 minutes. Then nothing made any sense. Doesn't anyone read these scripts to see all the plot holes? Wait for this on TV."
    },
    {
      "rating": "7",
      "text": "Well done on acting, especially Denzel Washington. I am not sure if all the cursing was required on Travolta's part. While I was able to follow most of the plot, there were parts that lost my wife. Nice updating of the 1974 original."
    },
    {
      "rating": "10",
      "text": "A film that has it all, a rich and powerful storyline, believable and likable characters, and perhaps less importantly a great soundtrack and sense of humor."
    },
    {
      "rating": "10",
      "text": "A great movie! well acted with a very clever plot and a fantastic finale!!!"
    },
    {
      "rating": "8",
      "text": "Electric performances from Washington and Travolta - the tension arcs and crackles! Good performance too from Turturro. The story has some great plot twists and the camera work looks slick. Well worth a watch."
    },
    {
      "rating": "4",
      "text": "Seen it, survived it. for the action lovers it might be a little bit boring nd for the philosophers a bit shallow... anyway, already seen in many many movies."
    },
    {
      "rating": "6",
      "text": "Although it"
    },
    {
      "rating": "6",
      "text": "So So Hollywood fare. Denzel and Gandolfino were great but everyone and everything else was jjust medicore."
    },
    {
      "rating": "10",
      "text": "Loved it. Easy fast ride."
    },
    {
      "rating": "6",
      "text": "Good start, fell apart towards the middle too long a movie."
    },
    {
      "rating": "8",
      "text": "All action. Not a boring moment. A lot of fun."
    },
    {
      "rating": "6",
      "text": "Fast pace hostage thriller with John Travolta as the BAD guy and Denzel Washington the GOOD guy. Many plot holes in the story as it would have been nice to have character development to see why they became who they were? In the end, the movie loses its credibility as Denzel reverts from ordinary Joe Citizen to action hero. The whole premise was ridiculous in the first place. Not a bad movie but not a good one either. A nice way to spend a rainy afternoon."
    },
    {
      "rating": "1",
      "text": "Awful. And I'm not just saying that as a fan of the original. Tony Scott's horrible editing style makes no sense and adds nothing to the story. The music is terrible. The visual give-aways are an insult to anyone who has a brain. 1 point for Denzel's good performance. Skip it. You're missing nothing."
    },
    {
      "rating": "9",
      "text": "This was the best movie that I've seen this year!"
    },
    {
      "rating": "3",
      "text": "Action, action, and more action. The movie sucks you in from the beginning. Then in the last 30 minutes the movie falls apart as the credibility of the script cannot be overlooked. The Denzel Washington character goes from middle aged desk jockey without any training to Rambo."
    },
    {
      "rating": "7",
      "text": "I did not get too bored, however it was not what I really expected."
    },
    {
      "rating": "9",
      "text": "I'm surprised this movie got such mediocre reviews. It was good entertainment and well worth the admission. It's been a long time since I've seen the original - maybe I'll try and rent it."
    },
    {
      "rating": "9",
      "text": "Denzel was really good one more time.I just love his movies. the movie has a lot of action and and a powerful plot.of course also mentionable must be the amazing song of jigga \"99 problems\"!!!"
    },
    {
      "rating": "1",
      "text": "I really didn't know if I should laugh at the pure stupidity of this piece of insulting crap or cry because I wasted time on this nonsense. I wish Tony Scott would cut it out already with the grainy jittery shit. It was cute in Man on Fire but enough. I read most of the Users critics and no wonder the state of movie making is in the shape it is in, looks like most people will settle for anything. As long as there is a bang and a boom then some salty cursing every 2 minutes it doesn't matter that the movie made absolute ZERO sense. Entertain me but please don't insult me."
    },
    {
      "rating": "3",
      "text": "Just ridiculous. Spoilers omitted. John T plots hijack of subway train. Denzel works for the NYCTA as a dispatcher with a past. Somehow within an hour the police give him a gun and turn him loose on NYC even though he is not licensed to carry a gun or knows how to use it. And he is relentness like The Terminator. If you use your brain nothing makes any sense. Ridiculous."
    },
    {
      "rating": "1",
      "text": "The movie was good to start and then fell apart completely. Whoever writes this crap should be arrested for impersonating a writer. Let me ask a question? Would someone just released from prison use his own name and invest millions but never consummate the trade to lock up a profit? And would that person risk his own life instead of hiring thugs to pull off his masterplan for chump change? Would a mild mannered transit worker who rides the trains to and from work suddenly learn how to shoot a gun and drive thru the streets of NY like Evil Knievel? And if a black man ran around the streets of NY waving a gun do you think that somewhere someone may have called a policeman? And if a subway train is roaring out of control on elevated tracks do you think that one of the passengers might dial 911 on their cell to advise that there is no motorman? And there's an open computer the entire time. There were more plot holes in this movie than swiss cheese. After the movie is over you start thinking and nothing makes any sense. Just awful."
    },
    {
      "rating": "1",
      "text": "What makes this movie really bad is this: Every New Yorker knows that they would have shut-down the whole subway system if this really happened. In the movie, trains with passengers were going by the police on the tracks with rifles. Additionally, the hi-jackers had guns. And trains with everyday passengers were passing by. This would never happened. New Yorkers know better. The movie needed the cheap thrill of trains moving by. This made the film incredible. Maybe the folks who made the movie have never taken the NYC subways. But even someone who never rode the NYC subways can fiqure out that the whole entire system would have come to a stop!!!"
    },
    {
      "rating": "7",
      "text": "Ok, so first of all, I honsestly like John Travolta as Ryder, and I thought the banter between him and Garber was believable and interesting. He is beleivable, but some of his cohorts are simply un-cool."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movies!!! The critics got it all wrong. They said all of the 4 X-Men movies sucked, and they were all good weren't they?? They also said the movie Taken sucked. That was one of my favorite movies... Anyway, The Taking of Pelham 123 is an excellent movie. There is major suspense, and you always think you know what will happen, but then the movie just takes a different turn. This movie has a supreme story, and everything is just perfect."
    },
    {
      "rating": "6",
      "text": "The Taking of Pelham 1,2,3 is a pretty good remake since the 1974 of the original,but not that close. It has good scenes in the subway and some trains that they could ride. But little too much,I see that they swap the scenes that they shoot every subways and every trains that they located in New York City,but not different location that they where at. I'm more like a subway likable person that I see subways all the time. Denzel Washington is awesome in the cast. John Travolta was too weak as a villian,but okay. It has good scene when they take the hostages by those terrorists at the inside of the train. But it is a okay remake,but the original still is the best."
    },
    {
      "rating": "4",
      "text": "This movie could use some work, it seems as though it was made in a space a 1hr... because it's tripe... but with some advantages... NO further discussion... so 4!"
    },
    {
      "rating": "6",
      "text": "Not a patch on the original movie but not hideous either. I thought the train passengers were under used and there was no real character building for the gang members, (Travolta excluded) having said that I enjoyed the movie although how wrong can you go with the talents or John Travolta & Denzel Washington (and even though the part was much smaller James Gandolfini) which were the main reasons the movie reached a decent level. Turned into a cliche in the end but worth a watch none the less."
    },
    {
      "rating": "4",
      "text": "The script removes everything that is memorable  from the first film and yet tries to burden the main characters with complicated back stories which you won't really understand. Although the director's style of editing and blurring images do give it the upper hand sometimes, its a big pity that a crash scene steals the spotlight from the main event. Also with these types of films reality is normally not a problem, but it becomes so disengaging that its difficult to get by the miracle internet connection in the subway, how Ryder is hoping to profit from the heist and the fact that Garber seems to be the only one who knows the subway."
    },
    {
      "rating": "6",
      "text": "I'm going to get straight to it, upset fans of the original and say that on the whole I quite enjoyed this film. Don't get me wrong it is definitely not without it's flaws, none more so than the hugely anti-climatic ending, cut-out bad guys (except Travolta) and terrible character writing for James Gandolfini's Mayor but up until the ending I enjoyed Tony Scott's fast paced and stylish direction and Washington's performance. The opening sequence, in which the train is hijacked, is a fantastic sequence of New York both above and below ground, framed through quickly edited long-taken blurred shots of colourful taxis and trains all played out to Jay-Z's 99 Problem's.\r Travolta's role see him reprise his familiar, unhinged and over the top villain from Face/Off (as Cage) that I can cope with in reasonable doses. Unfortunately, he is given a really clichéd profanity heavy script that doesn't do the film any favours.\r The film works best when Ryder and Garber are separate and playing traditional roles of terrorist and negotiator and begins to stall when Garber leaves the office to meet up with Ryder. The less said about the film's ending the better."
    },
    {
      "rating": "8",
      "text": "Only posting this because I think this movie is a bit underrated. I haven't watched the 1974 original, but I must say that this is expertly crafted, with two great actors on the main roles - Denzel Washington and John Travolta - performing outstandingly, with great charisma. The movie, while presenting a pretty straightforward hostage situation plot (and some awkward subplots, like the teen couple), is very intense with suspense being almost palpable at certain moments.\rSo, know this: Tony Scott (rest in peace) didn't make bad movies. And Denzel Washington doesn't star in bad movies. So when Washington stars in a film by Scott, it just can't go wrong. And it didn't."
    }
  ]
}