{
  "id": 517,
  "title": "The Meg",
  "starring": [
    "Jason Statham",
    "Li Bingbing"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Science Fiction",
    "Horror"
  ],
  "description": "A deep sea submersible pilot revisits his past fears in the Mariana Trench, and accidentally unleashes the seventy foot ancestor of the Great White Shark believed to be extinct.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xqECHNvzbDL5I3iiOVUkVPJMSbc.jpg",
  "categories": {
    "plot": 5.761904761904762,
    "acting": 6.333333333333333,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 6.5,
    "familyFriendly": 6.0,
    "funny": 5.578947368421052,
    "action": 6.6875
  },
  "reviews": [
    {
      "rating": "4",
      "text": "A bland and charmless affair. Whilst not utterly awful, it's not very good either. The thrills are tepid and the shark not particularly menacing."
    },
    {
      "rating": "5",
      "text": "The meg is by no means a great movie, but it is at least entertaining. The special effects are great, which is expected by the big budget they had.Jason Statham is very good in it, he's character is actually has a better characterization than i expected, unfortunately other characters don't get the same privilege, making the deaths not sink in. I liked dynamic between Jason Statham and this little girl character \"Meying\".They tried forcing a romance in their, but it just distracted me from the real action, because it was totally out of place. Amongst all that, the movie didn't take itself too seriously, it was quite funny, which i can appreciate. When Jason Statham stabs the Meg's eye, was just that awesome Jason Statham moment every movie of his needs to have. Overall a good watch"
    },
    {
      "rating": "4",
      "text": "“Well, I’m in trouble”Jason Statham vs. giant shark - How’s that for a movie pitch. Ridiculous, but could be fun. And it was enjoyable, especially the last 20 minutes. Which shouldn’t be surprising the film swept at the box office and lives up to the concept of Statham fighting a 2.6 million year old, thought to be extinct shark. Just don’t be surprised if this becomes a meme in a few years.The movie literally ends with a Thai version of ‘’Hey Mickey you’re so fine’.Still, ‘The Meg’ was a lot of fun. Is it going to change cinema forever or give you a unique experience? Not really. It’s one of the dumbest movies of 2018, and yet, you can find some enjoyment out of it. You can even laugh at the corny scenes which was meant to be taken seriously. However, if I have to critique, I will gladly do so.This movie lacks balance in tone and knowing what it’s trying to be. There’s horror elements when the Megalodon attacks. There’s comedic elements that stops it from being gloomy. There’s dumb popcorn fluff to keep things vibrant. And there’s suspense when the shark is near. All tones mashed together with uneven results. I didn’t find any of the humor that funny and the only time I chuckled was something unintentional.The amount of charm Statham brings to the character already makes his presence likable. Too bad they didn’t give him any memorable one liners. You could pick out lines like “Chomp on this you ugly bastard.”, or “My god, it’s a Megalodon” - those are alright, although nothing will top “Smile you son of a b-”.Every time there’s a death scene or somebody is going to die, it’s telegraphed and obvious. Supporting characters with very little screen time - They goners. Also, I’ve haven’t seen Masi Oka in anything for awhile and I was surprised to see him here. Loved him in ‘Heroes’. Man, they did him wrong here.The CGI is OK, some of the acting wasn’t that good, and the overall experience feels like a water down blood-fest.Jon Turteltaub (the director) openly said the original cut was brutal and \"Horrifying, Disgusting\". In interviews, Turteltaub expressed his disappointment that we won’t see this cut in cinemas. Which makes me wonder what the original cut was like, not just in violence, but how terrifying it might be. Will it add anything? Who knows. Could have taken an enjoyable dumb film into a bloody good time. Perhaps this generations “Deep Blue Sea”.Overall Rating: Fin"
    },
    {
      "rating": "3",
      "text": "Unfortunately The Meg isn't so bad it's good. It's just so bad it's bad. Believe it or not I had a certain expectation for The Meg. Yes I know it's a Jason Statham movie about a deep sea submersible which has been attacked by a 75 foot pre-historic shark previously thought to be extinct. I know it's not going to be a masterpiece. I went to laugh and be entertained and well if it also featured Jason Statham punching Megalodon then that's just a bonus. Damn Jason you let me down again. I didn't expect much, but as far as bad monster movies go The Meg is definitely lacking.Mana One, a multi-million dollar undersea observation program send a crew down to what was previously believed to be the ocean's lowest point. But wait, it turns out it's just a freezing cold cloud concealing an entire new ocean beneath it. Completely unexplored and just so happens to be home to the Megalodon. With the crew trapped down there there's only one man to call apparently, and that man is none other than Jonas Taylor (Jason Statham). With time running out Jonas must confront his fears and rescue the crew from this massive shark.It didn't quite reach the \"so bad it's good\" category and honestly took itself way too seriously. I expected a massive shark to spend the majority of the movie chomping on everything and everyone. That's all I wanted, not too much to ask really. You get exactly what's advertised only less, ultimately The Meg did not have to try this hard. It's a movie about a giant pre-historic shark. It's ridiculous and should have played into that a lot more. Go big or go home, it needed more black comedy and less attempts at adding depth to the characters. The attempt at creating a serious shark movie is just not working when you have wooden actors and no script. I'm not going to compare it to Jaws because Jaws is in another league. Yet you will definitely be reminded of Jaws as The Meg just couldn't resist the temptation to pay homage to Jaws at every opportunity. There are so many bad shark movies out there you could do worse than The Meg, but then again it's not as fun as it should have been either. Maybe if it had an R rating, took itself less seriously and had more people being eaten it might have been better but I guess we'll never know. Although it made it's money back so don't be surprised if The Meg two comes along in a couple of years. So if you're the type of person who finds Deep Blue Sea or Jaws: The Revenge hilarious then be sure to check out The Meg, just make sure to go into it with zero expectations and leave your brain at home."
    },
    {
      "rating": "6",
      "text": "Not bad,not good. I'm a sucker for shark films though. It got right to business which was nice and never dallied between action scenes. The characters were underdeveloped and i wish they'd had someone other than Jason Stathan in the lead because he added nothing chemistry wise. The actor who plays Walt Longmire in the Longmire tv series was in it which was a bonus because i've never seen him in a film before.The shark shots were very well done and the action sequences were pretty good.Worth seeing if you like shark films."
    },
    {
      "rating": "8",
      "text": "Nice shark movie. I must say that there are emotions that I did not think I had. I thought gore and end of the world. Finally there is mystery, drama, end of the world, adventure and action. This surprise tells me that there are still some.Sympathique film de requin. Je dois dire que il y a des émotions que je ne pensais pas avoir. Je pensais gore et fin du monde. Finalement il y a mystère, drame, fin du monde, aventure et action. Cette surprise me dit qu'il en existe encore."
    },
    {
      "rating": "5",
      "text": "MehThe Meg certainly has a lot of fun moments, But it’s a little too ridiculous."
    },
    {
      "rating": "6",
      "text": "This film is an ode to b-rated shark flicks. It's not going to be the next Jaws but it is fun for what it is."
    },
    {
      "rating": "6",
      "text": "The visual effects were spectacular especially the creation of the Megalodon. The story and screenplay were not the best. The plot wasn't that bad. The acting was fantastic especially Jason Statham, Li Bingbing, Ruby Rose, Sophia Shuya Cai, Winston Chao, Jessica McNamee, and Cliff Curtis."
    },
    {
      "rating": "6",
      "text": "Big, dumb, fun summer movie.  Jason Statham, Ruby Rose, and the Megalodon are really the only thing good about this movie.  The other actors aren't so good.  Very bad acting, not believable whatsoever.  The CGI effects look really good.  Statham is his normal self.  He kind of plays the same guy in all of his movies, but that's ok, it works for him.  Lu Bingbing wasn't that great, but she was nice to look at.  I was hoping Page Kennedy got got, but it didn't happen.  He was annoying, but had a few funny lines.  Ruby Rose did not get enough screen time.  She is a future star!  I do recommend seeing this movie.  It is worth it."
    },
    {
      "rating": "6",
      "text": "I’m not able to watch The Meg without thinking of Jaws and I’m glad an individual sitting next to me reminds of the film Deep Blue Sea at the end of the film (The Meg). To me, The Meg is like the diverse-futuristic-inclusive Jaws though lacks the extreme effort set in the story telling of Jaws. I recently got to watch Jaws and I literally would not take my eyes off the screen from the very beginning of the film to the end. Both films, The Meg and Jaws, introduce their primary menace early on — but — Jaws creates more than one menace beyond the threats in the water. Jaws brings the audience to render the situations of the town as is and sets an importance on the beach for the town. There’s an entirely different set of circumstances which the audience has to not only recognize but deal with. It’s one thing to think about dead family members and friends. It’s an even more serious matter thinking of the livelihoods of an entire town — the economy — and long-term functions that rely heavily on a season’s production in conjunction with deaths, publicity, and responsibilities — responsible persons. My goodness. The Meg throws a huge number at everyone about a station that only really seems to affect only so many people in a particular area and industry. I’m not knocking The Meg as a thriller film — but there’s no way to ignore its potentially greatest influence Jaws.So, I’m going to discuss a few similar aspects that take very different routes of exploration. Let’s talk social. The Meg sets its social tone in a limiting way which Jaws explores way further. Jaws doesn’t simply throw out a large number then mention life being about sex, money, respect, and power (which I find to be a very lazy-overloaded-underspecified-vague term). The audience has to walk through the ins and outs of the town’s circumstances in Jaws and really has to set themselves in the shoes of many of the people in the film. What do you do as the mayor or sheriff of a town in need? That’s an initial question then the rest of the questions come concerning economy and safety which become of the greatest concerns of all parties able to affect change.There’s no way to avoid talking about intelligence. I like the mini shark lessons throughout Jaws which develop as the plans adjust. The Meg doesn’t really coerce me into believing any of the acting partners are actually knowledgeable about their circumstances. Realistically, the audience is thrown into scenarios with acting partners either claiming to be all knowing of their circumstances or having been set in a position as all knowing of their circumstances. Jaws leads scenarios so well. There are so many moments of solidification which back up the character types set in Jaws. The Meg has really nice facilities and looks good. I always feel like technology can never really look smarter than its developers or users — no matter how flashy it may look. Why cost so much looking good — if it doesn’t work so well? I’m into future developments but don’t force technological-self-autonomy on me until auto-correct is flawless. This might seem like a random rant — but, I assure you, it’s not. In Jaws, technology comes as an extension of the specialists’ knowledge and necessities. In The Meg, technology is present as a necessity which allows for specialists to delve into and encounter that which is fully unknown. In Jaws, the specialists are always analyzing bits to ensure to know as much as possible before their delve into any scenarios involving the sharks. Why wouldn’t the specialists in The Meg properly analyze every bit of the cloud with a machine from that billion dollar station so as to ensure proper safety parameters were set instead of relying completely on technological specs that were crushed? Why wouldn’t the specialists secure their vehicles properly to ensure their swift mobility out of any potentially dangerous situations? Precautions aren’t meant to be taken post dive. Live to explore another day with more intelligence and better research. My goodness.I’m going to take some time to appreciate the camera angles of Jaws. Cinematography really makes a film more effective. Jaws makes me feel like more matters than a complete movie; Jaws forces me to acknowledge all that is within the film as though constantly waving away the idea that I’m even watching a film. When I’m watching Jaws, I constantly feel like I’m receiving reminders that there is something more important going on here — look! When I’m watching The Meg, I’m more like — What’s going to happen next?! / What time is it?Overall Grade: C-/C— K.D.If you’re into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "6",
      "text": "Dumb entertaining fun. Don't expect much else. Sit back, relax and enjoy the show and it is entertaining and had the laughs for you. =)"
    },
    {
      "rating": "7",
      "text": "This adaptation of the novel is entertaining, but has some serious tone shifts that keep it from being a great movie. Despite that, performances from our leads carry this movie to it's conclusion."
    },
    {
      "rating": "7",
      "text": "It's a really fun watch for a weekend afternoon.It's silly , but in a good way.The CGI is pretty good.Who doesn't like Jason Statham ????"
    },
    {
      "rating": "7",
      "text": "It’s dumb fun that (mostly) knows what it is. Is there anything more you can ask for from a movie that features Jason Statham fighting a 75 foot shark?"
    },
    {
      "rating": "6",
      "text": "It's a fun summer flick, with lots of action and a semi-decent supporting cast.  However, Statham has virtually zero chemistry with his would-be love interest, which is too bad.  And they don't do a great job of juxtaposing the Meg with other objects so we can truly assess its size.  Like one of the other critics suggested, if you're torn, just go see Jaws instead."
    },
    {
      "rating": "7",
      "text": "What I like about this movie is that the tone just feels right - it's knowingly tongue in cheek without going too overboard with the silliness or campness. Despite being clichéd and at times dumb it also hits the right notes in terms of the humour and thrills. Don't take it too seriously and you'll probably enjoy it, it's a B movie after all but a very good B movie!"
    },
    {
      "rating": "5",
      "text": "This movie was mediocre. It wasn't bad, but it wasn't good. It was basically a Netflix Original put up on the big screen, but none of the action was awesome enough to really warrant seeing it on the big screen. The actors were fine, the plot was dead-center trope city, and it hit every not you expected. Unfortunately, the CGI was a bit under par, but it's infrequent enough that it's not a huge deal. Definitely don't bother with this in the theaters, maybe put it on as background noise once it is on Netflix."
    },
    {
      "rating": "0",
      "text": "When watching a creature film (in this case it's a shark), I expect to actually see it onscreen. Being genuinely honest, The sharks are onscreen for maybe 10 minutes out of the hour and 40 minute run time. A majority of that time is spent on teaser shots that don't even show the whole shark, Just bits and pieces of it underwater. And to make up with the severe lack of sharks in this movie, We are treated to a generic plot with some pretty poor over-acting by the cast. I'm so glad I didn't have to pay to see this garbage because I would have walked out after the first 20-30 minutes."
    },
    {
      "rating": "4",
      "text": "In a way, The Meg accomplishes exactly what it promises: big sharks and big action. Outside of that, it's pretty bland. There are some unintentionally hilarious scenes, but overall, it's not the worst movie ever, nor is it the best. I think it will be remembered as being a summer shark movie."
    },
    {
      "rating": "8",
      "text": "The Meg is a dumb movie. I'll happily point that out right here and now. It's outlandishly silly in concept and execution and threatens to buckle under the weight of any outside logic applied. But this is precisely part of what makes the film so fun - it's not trying to be the next Citizen Kane, but rather one that is as knowingly ridiculous as it is brainless, a movie that you can simply pop over to for some decent scares as well as laughs and action (courtesy of Jon Turtletaub, director of the equally ludicrous \"National Treasure\" films). The cast - including Rainn Wilson, Li Bingbing, Ruby Rose, and Page Kennedy as the typical assortment of stereotypes that come along within this sort of movie - is likable, and leading man Jason Statham channels both his typical stone-faced action hero schtick as well as some of the same comedic timing and wit that made him so surprisingly funny in Melissa McCarthy's \"Spy\" to give us one of his best performances in recent memories.True, fun as it may be, the film is riddled with cliches, many of the side-stories are underbaked, and the movie doesn't quite go as far off the deep end as you may hope, but it's almost exactly the best that one could ever hope for from a film that's like a big-budget Syfy Original movie with better writing, directing, acting, special effects and, well...basically everything. For me, that's more than enough - I'll take this over \"Jurassic World: Fallen Kingdom\" any day."
    },
    {
      "rating": "4",
      "text": "Once you watched this clichéd shark movie out of nowhere, it's time to actually think ourselves why the Jaws film from 1975 will forever be the best shark movie there could possibly be. It does not matter if your shark is different from the usual great white shark. It's so odd that we haven't even got a great shark movie in more than forty years and The Meg failed to deliver what it needed to deliver to bite the other shark movies to oblivion."
    },
    {
      "rating": "7",
      "text": "6.6/10 A cheesy RIDICULOUS somewhat self aware fun shark film. The Meg was very self-aware with it's ridiculous cliché characters and absolutely insanely stupid moments throughout but remained a visual feast for the eyes when we were witness to such a lush and wondrous underwater atmosphere with a behemoth prehistoric shark stalking its prey. The characters were constantly annoying and somewhat abhorrent especially the token black guy which was especially bad. A lot of the humor fell pretty flat most of the time but Statham remained a constant decent protagonist. When the shark is sparingly shown the CGI was very well done and it looks fantastic, but for once again being the main spectacle we barely get to see him it seems like. Instead we see many different useless scenes and attempts at tone shifts into more emotional aspects of the ridiculous characters . Also the violence and brutality was definitely toned down for this PG-13 cut and I think this movie would've benefited vastly from the original R-rated cut that was turned down by the studios. The finale worked solidly and was decently satisfying but overall this was at best a good yet utterly ridiculous short film that doesn't really separate itself from anything That's come before. The production value was very solid but for 150 million I would hope it would be. I definitely enjoyed the mana one underwater station lighting and design as well as some vast colorful underwater set pieces. I still think as far as new age shark films go that The Shallows and 47 meters down were slightly better. If you're a fan of sharks and just plain ridiculous spectacles, see this, just know what you're getting into and don't expect Jaws."
    },
    {
      "rating": "0",
      "text": "Pfffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "The Meg is definitely one of the better shark movies recently, far surpassing major letdowns such as 47 meters down. But what makes The Meg so great is that it isn't just your average shark film - there's a whole lot of depth associated with the characters and their relationships together were fantastic. Jason Statham was amazing as the lead role in this film, as were the other characters. The film did seem quite prolonged, but The Meg is still full of plenty of surprises and watching it was an excellent way to end the summer."
    },
    {
      "rating": "0",
      "text": "This is the most insincere movie I have ever seen. It seems that everyone from Director, writer, actors, vfx guys were uninterested and they knew that its gonna be a bad movie. Everything is half baked, unifinished and blood is missing in a shark movie! Yep, you don't believe me then see for yourself. Its attrociously bad. Heck,even Sharkanado series is better than this as at least they were upfront about what they were.0/10"
    },
    {
      "rating": "10",
      "text": "It is Tremendous because it is not a just movie on shark attack but a Movie in which they explore hidden deep sea places which and never discovered before and which has new giant  size creatures there and fighting with them also when it comes to Jason Statham its full of Tremendous Action & Tremdnous Dialoges...So everything Story , Cast , VFX, Dialogues etc is Tremendous...I really Liked the Film, Best Regards"
    },
    {
      "rating": "9",
      "text": "A massive creature attacks a deep-sea submersible, leaving it disabled and trapping the crew at the bottom of the Pacific Ocean. With time running out, rescue diver Jonas Taylor must save the crew and the ocean itself from an unimaginable threat -- a 75-foot-long prehistoric shark known as the Megalodon. The Meg sets audiences up for a good old-fashioned B-movie creature feature, but lacks the genre thrills -- or the cheesy bite -- to make it worth diving in. I'll give The Meg an A-."
    },
    {
      "rating": "8",
      "text": "I was really not expecting something good, and I must say I enjoyed this film, it’s re comforting to be in the theater room and see how thrilled it’s the audience, everybody was laughing and screaming. Still it was never supposed to be as good as JAWS and the movie acknowledged that. Correct film that even with a lot of cliches finds it's way to be fun enough to forget it."
    },
    {
      "rating": "7",
      "text": "Walking into this movie with 0 expectation really helped out. Now this is not movie of the year nor is it even close to it. I would have to say with the diverse cast and B actors with maybe one A actor it really delivered on character development and the acting skills were on a good level with the movies plot. Sure there were cheesy moments but the CGI Meg and the environments really were expressed in this movie. I will give this movie a recommendation to go see at the moments as this year there is not very much competitions on big summer action movies except MI6."
    },
    {
      "rating": "3",
      "text": "It made me chuckle 3 or 4 times. More than the average comedy nowadays. So I guess I give it a 3.The rest is just braindead action. The director has no clue how to build excitement, because the first few minutes expose the whole plot.I could always tell when someone was going to die next. Even if it was minutes away. And of course I could also tell who is not going to die.Predictable movie is predictable. And boring. And not worth your money."
    },
    {
      "rating": "5",
      "text": "The visuals are good but the movie fails to do anything clever or interesting."
    },
    {
      "rating": "7",
      "text": "The Meg is pretty much what you would expect it to be. Lots of action, CGI sharks, bland characters, cliché story and so on and so forth.... Despite it's blandness, it still manages to be quite the fun ride. The acting is surprisingly good, the CGI effects are impressive and the movie is never boring. If you want to watch a fun action flick where you are able to turn your brain off, The Meg will not disappoint."
    },
    {
      "rating": "3",
      "text": "Slightly more serious and well crafted USA/China co-production than the assumed D grade flick advertised, starting off that is, only to start...  No surprise this thing rips off \"Jaws\" taking it to beyond absurd levels (it doesn't just jump the shark, it rocket launches it), but it downright apes scene after scene to the point it's not clear if all an homage or the makers think they can just repackage guilt free and way over-the-top for today's pushover audience (one joke certainly is an obvious nod to fans).  Overall you can't be disappointed because you knew what you were in for, yet nonetheless it's too bad because the high concept here is a natural that was inevitable to be made and now that it has a much better version was not."
    },
    {
      "rating": "9",
      "text": "It isn't as silly, but it is a fun summer popcorn movie. This is exactly what you want it to be. Big shark, big scenes, fun ride. Very enjoyable film and packs a big bite! Worth checking out for sure."
    },
    {
      "rating": "7",
      "text": "Muy simple, a quienes les gusten los tiburones y las películas de tiburones, valga la redundancia, les puede gustar bastante esta película y a aquellos que les gusten mas las secuencias de acción puede quizás no satisfacerlos por completo, pero al fin y al cabo es disfrutable a todo dar en formato Real D 3D"
    },
    {
      "rating": "6",
      "text": "Solid fun - nothing more, nothing less.  I really does pale in comparison to the grand-daddy of this genre.  Even the score mimics the Jaws score.  Does it's job."
    },
    {
      "rating": "7",
      "text": "Fun and dumb just like a summer shark movie should be, let alone one about a massive prehistoric shark. If you're looking for a fun popcorn movie look no further."
    },
    {
      "rating": "7",
      "text": "This movie might not the best movie but it's hell fun to watch. Specially if you watch them in 4D cinema."
    },
    {
      "rating": "8",
      "text": "Its a fun shark film, dont take it too seriously and its brilliant. Hits all the right over the top shark film notes!"
    },
    {
      "rating": "8",
      "text": "Don't expect a more serious film like Jaws, The Abyss, or the original book. This is a popcorn film. It's directed by Joh Tuteltaub who directed National Treasure and The Sorcerer's Apprentice and has a similar feel. There are also some script issues. (Rainn Wilson's rich boss has some good lines but either the writer or actor seemed to have trouble with making him feel consistent. Page Kennedy appears to be straight man only to suddenly become the comical relief two-thirds in.) Still, although this is a lightweight film, its appeal.The characters are likable and mostly understandable, and the actors all seem to be having a nice time. Special credit should be given to Shuya Sophia Cai who is remarkably good for a child actress.Besides the film has a giant shark, and it is hard not to entertain with it. Although PG-13, I felt the violence was done pretty effectively under the restraints. There are a few pretty tense and eye-catching moments here. The final shark fight is completely unbelievable, but man is it fun to watch in how over-the-top it is. Overall, the film isn't deep but a lot of fun."
    },
    {
      "rating": "7",
      "text": "A very thrilling film, especially with Statham playing its protagonist. It was completely gripping almost the whole way through the film. The CGI Megladon looked as if it’d come from a real-life ocean! 7/10."
    },
    {
      "rating": "9",
      "text": "Okay this is a movie that knows what it is and what it wants to show. Its a fun and fast paste movie yes some flaws like messy script and some stupid scenes but it is still a fun time i highly recommend you see it."
    },
    {
      "rating": "8",
      "text": "I think this film is good. It surprises you on how you take it to be a huge Jaws rip off, but it does more than that. Without going into the spoiler section so quickly just know if you like B+ or B movies or summer blockbusters or maybe want to see a hardcore yet still softie Jason then this film is perfect for you. If you had an inclination of watching this act on it. Just don’t do IMAX It isn’t worth the extra bit for IMAX. Shuya Sophia Cai playing Meiying is the greatest thing of this film. I am over exaggerating but my gosh she is so adorable and has actual chemistry with Jason. In comparison to another summer blockbuster Sophia does so much better than Isabella Sermon. The girl who was in Jurassic World Fallen Kingdom. Cai is 2 years younger!! She did have one film experience before the Meg unlike Isabella who had her acting debut with Fallen Kingdom. Jason does great, arguably his best work in a long time. This movie is just a lot of fun. There are series moments, but they are in good taste and make sense on how they go about. So yes it`s a fun end of summer movie."
    },
    {
      "rating": "1",
      "text": "Not sure what I expected but man is this film awful. How it justified a sequel is beyond me but here it is. Maybe it falls into that Snakes on a Plane category of useless film? Who knows. Either way, even as a popcorn flick it's a complete waste of time and money."
    },
    {
      "rating": "8",
      "text": "I love this movie it has action, entertainment and hilarious scenes. I don't know why lots of people are hating."
    },
    {
      "rating": "7",
      "text": "The subject is very interesting and it could be better for me, but there are no other films like this on the market."
    },
    {
      "rating": "6",
      "text": "Scientists at an undersea observation station unleash a gigantic prehistoric shark. Only one man can save the day (and some trapped divers): Jason Statham. Like Dwayne Johnson in last month's Skyscraper, the hero has morphed into a everyman superhero, defying odds that can only be accomplished through movie effects. The plot is by-the-numbers, almost right down to every kill. The attacks are OK, but never spectacular or especially inventive. Still, for someone who enjoys a predictable popcorn escape, this one will keep you entertained. Consider it one step above the Sharknado series."
    },
    {
      "rating": "3",
      "text": "I am a big fan of horrors, thrillers and shark movies, but... I just couldnt watch it. to be honest I believe Sharknado was a better movie."
    },
    {
      "rating": "8",
      "text": "I personally thought this was better than jaws in many regards. I will say its good, I think its worth the ticket price, and its definitely not a shot by shot remake of jaws. The biggest flaw is the obvious cgi in the creature design... But it does its job. If you think someone is going to die off, chances are they are. It follows a lot of standard tropes in the genre... Minor spoiler alert, the black guy doesn't die. If you liked Jaws, there is a good chance you will like this."
    }
  ]
}