{"id": 2129, "title": "The Commuter", "starring": ["Liam Neeson", "Vera Farmiga"], "runtime": 104, "genre": ["Action", "Thriller", "Mystery"], "description": "A businessman, on his daily commute home, gets unwittingly caught up in a criminal conspiracy that threatens not only his life but the lives of those around him.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/rDeGK6FIUfVcXmuBdEORPAGPMNg.jpg", "categories": {"plot": 6.171428571428572, "acting": 6.290322580645161, "ending": 5.722222222222222, "soundtrack": 5.0, "cinematography": 5.4, "familyFriendly": 6.0, "funny": 5.0, "action": 5.956521739130435}, "reviews": [{"rating": "5", "text": "I've seen Liam Neeson playing this character several times before. I think I'm done."}, {"rating": "8", "text": "The movie reminded me of visual effects in the Final Destination movies with high-end camera moves, snazzy Computer Graphics and felt like a great blockbuster experience. I kind of imagine this eventually being made into a theme park ride at Universal Studios. All Aboard for Commuter! The characters were cast really well and I like the surprise twist at the end. Overall the movie somewhat reminded me of a trip I took from NY to DC on a commuter train. I remember buying an NY style pizza at the station similar to the one in the movie and it was delicious. 5 stars. Liam Neeson performs impeccably as a no-nonsense problem-solving genius and he is the hero every train deserves."}, {"rating": "6", "text": "I don't watch Liam Neeson action flicks.I totally get why people like (or love) him, so Im not against people being fan of him. I don't find that dumb or ridiculous. My fav action actor is Jason Statham though, and he's movies are enough to satisfy my action flick apetite.But then the trailer drops and Vera Farmiga is here making the pitch to Neeson. Vera Farmiga is just good at everything. So when I assumed she was going to be prominent as the villain in the movie I was hyped. The concept of the movie is great. Kind of a Detective Conan (the anime) episode, where you have to figure it our who of this people its the bad guy and then what to do with the \"offer\". And that was awesome for about 25 minutes and then the movie turns into a brainless action flick. In the end there are \"twists\" in the mystery of exactly what happened and who is who. But its after alot of brainless stuff, so it doesn't feel earned and honestly I didn't care much.But I was entertained all the way through and it had the good start and fine finish for this one not to be just mediocre."}, {"rating": "6", "text": "For what it is, another Liam Neeson action movie, The Commuter is pretty good.  The first two acts are entertaining to watch.  The whole twist at the end with his old partner trying to set him up, I personally did not see coming but I think that whole third act could have been done better.  There are definitely some cheesy moments that come along with action movies like this, such as the train worker's line about either the train or the people killing him.  The \"I'm Prynne, no I'm Prynne!\" scene was cringey and bad, and the train worker trying to provide comic relief could have been cut from the movie but all in all it was a fun movie to watch"}, {"rating": "7", "text": "Not the strongest of the Neeson-Serra collaborations, but this is intense, unpredictable and a lot of fun and Liam Neeson gives yet another solid performance."}, {"rating": "9", "text": "Liam Neeson continues his streak as the mature action hero. He plays an insurance salesman who commutes to NYC. When a mysterious woman asks him to perform a seemingly simple task, it unfolds a maze of lethal encounters, most of which take place on the train. The machinations of the plot are sometimes baffling,  but there are regular action beats to keep up interest (the highlight is the spectacular train derailment). The film is adequately made and mildly involving, but the sometimes confusing story strains credibility and undermines the potential tension."}, {"rating": "5", "text": "I like Liam Neeson movies, but this one was a little too far-fetched and very confusing to follow. The pieces come together in the end but it's still a stretch. The cinematography is great - you really feel like you're on the train and the background is authentic, but not even Neeson can pull this one out."}, {"rating": "4", "text": "Liam Neeson is no stranger to these generic popcorn flicks, in fact that's pretty much all he can do now and at his age that's more than surprising. Every now and again you'll get a dud, and well The Commuter is a giant dud. Settle down for nearly two hours of Liam Neeson sitting on a train, Liam Neeson stressfully pacing up and down the train, Liam Neeson glaring suspiciously at every other person on the train and Liam Neeson beating everyone to a bloody pulp on the train. I never expected anything special but I wasn't prepared for boredom.Liam Neeson is an insurance salesman who lives a rather mundane life, travelling on the same commuter train at the same time every day. Times are tough and money is tight so when he is approached by a random women (Vera Farmiga) offering him a substantial amount of money to take part in this apparent hypothetical situation to find the person on the train who \"does not belong\" he can't help but seize this opportunity. So why approach Liam Neeson? Well he needs the money, and he's an ex-cop conveniently so I guess you could say he has a special set of skills that make him appropriate for the job. Find the person on the train, carrying a bag and getting off at the end of the line. Not much to go on, but he's Liam Neeson, no ordinary guy so if anyone can do it Liam can. I understand that a lot of scenes might have been going for the claustrophobic atmosphere but honestly there was so much shaky camera work in The Commuter I was starting to get dizzy. The fight scenes are atrocious even for this kind of movie, it's very difficult to see who's punching who. Honestly there came a point when I stopped caring, but if you've managed not to fall asleep then you might actually get a laugh out of them. Maybe you've always wanted to see Liam Neeson beat someone half to death with a guitar. I genuinely believe the third act of this film is meant to be a comedy it's that ridiculous. There's one scene in particular that I can't mention for spoiler reasons, but believe me you'll know it when you see it. Liam Neeson has long since stopped caring about these movies, they're simply pay cheque performances, so if you're expecting the standard of Taken don't because The Commuter is so generic and predictable you'll be fighting off sleep. I felt stupid watching The Commuter, and I felt stupid wasting time on it, so save yourselves and give this one a miss. Not recommended unless you really enjoy these Liam Neeson action flicks, in that case enjoy."}, {"rating": "5", "text": "In ‘the good old days’ when they had double bills in the movie theatres consisting of 2 movies, a cartoon, a newsreel, coming attractions among other things “The Commuter” would be the B feature on the double bill.“The Commuter” is a ‘popcorn film’ where you check your logic at the door, sit back in the auditorium chair, eat your popcorn or whatever you buy, enjoy and forget as you walk out the theatre.Liam Nesson is our hero who can do no wrong and even lies for no reason by saying, in the movie, that he is 60 when in real life he is 65! Guess what? He is a commuter, which is shown in the first few minutes, married, has a kid and gets married after 10 years on a job and at one time had been a police officer.When the movie settles down he is on his way home and after sitting in his chair and opening a book to read he is approached by Vera Farmiga with an offer he can’t refuse, as only happens in a movie. The logic goes out the air with the proposition just as we see Neeson in fights that would kill normal men while he just gets up and fights the next guy or does minor, compared to other, deeds like falling off a train and jumping back on!Just recently Liam Neeson said he is too old to keep on making action movies but keep on he does and makes it look easy. I, personally, wish he would make a ‘serious drama’ like he used to now and then.The cast has the usual suspects but anyone with crime movies will guess the villain before it hits the halfway mark. I have yet to see Vera Farmiga give a bad performance and though she is seen briefly on screen just hearing her voice for a lot of the screen time is intriguing. With a fine supporting cast on the train, Adam Nagaitis as conductor Jimmy offers needed humor.Director of photography, Paul Cameron, along with director Jaume Collet-Serra, offers some dazzling camera work including a fight on the train that uses everything on hand along with arms, legs, train seats, windows, an ax, a gun, etc., constantly moving from train car to train car.“The Commuter” is for Liam Nesson fans, crime/thriller fans, train fans, B movie fans and a film to see on a rainy day to forget whatever troubles you might have and giving your brain a rest!"}, {"rating": "5", "text": "Another disposable action thriller where Liam Neeson plays an everyday man whose told that his family is in danger, and that he must carry out a dangerous task that he reluctantly agrees to only to ensure the safety of his family. In 'The Commuter', he plays Michael MacCauley, an insurance salesman who pretty much is being let go from his company. Feeling discouraged by what has happened, he takes his usual trip on the same train to a long journey, until he meets a woman who claims that she is an expert on body-language and overall human behavior, and she tells him some secrets about what's on the train, and what he's going to do. This leads to Michael receiving a phone-call, and he is told to carry out some dangerous tasks, or his family get killed (what a surprise!). The film ponders along trying to reveal a secret about one of the passenger's identities, and how integral they are to the plot. Most of the characters we come across are intentionally one-dimensional, yes, but everything the plot builds up to is basically trying to surpass expectations and predictability. Neeson does a good job here, as well as the supporting cast. But, the odd direction and uncomfortable editing style make this film a very difficult experience. There is a moment where Neeson's character is just sat opposite his employer at his desk, and, for some reason, we get unnecessary and extreme close-up shots of Neeson's face, even though the conversation they were having did not require such an editing skill. They didn't even start talking about his future at the company, and even then, it wouldn't require such  intense camera shots. 'The Commuter' is mainly forgettable and typically formulaic. If you enjoy this kind of film, by all means, see it. Neeson hasn't lost it as an \"Expendables\"-style action man, but all of these films could not be more uninspired if they tried. At least, try to tell a good story, with believable characters."}, {"rating": "8", "text": "“The Commuter” is an exciting, if implausible, action-mystery movie that reinforces Liam Neeson’s credentials as the most indestructible of senior citizens.  Despite plot holes big enough—and, pardon the phrase—“to drive a train through”, this commute is never less than interesting, and often exceptionally entertaining.  Though it derails near the end as it tries to tie up all the loose story ends, overall it’s a nifty genre film that is served very well by the big screen.  A technically impressive film, with fine performances, taut direction, and high production values; but, in need of a better script."}, {"rating": "5", "text": "It's hard to determine what The Commuter is actually trying to be because its length isn't long enough to tell me what it's actually trying to be. All in such, everyone did great as their roles for this movie especially Liam Neeson but they couldn't survive the struggle this film went to face after we get to the middle of the movie since at that specific point, the film knew it was going to lose enough pressure built up from the work put onto the film. All that pressure built up from the hype isn't going to get us anywhere though so don't expect your hype meter to be literal high for this one."}, {"rating": "3", "text": "Could've been a good, solid film except the director (Jaume Collet-Serra of \"Non-Stop\", another train film) didn't value plausibility enough this time. When you lack plausibility you just take the viewer out of the experience and that's just a shame since it's easily avoidable. For instance, Liam's character should've been much more beat up and fatigued if not critically injured in all this. Instead, he comes off as an action-hero which is fine in other circumstances but not these. And if you're twelve years old you'll appreciate Hollywood's \"Good triumphs over Evil\" for the billionth time, but those of us adults know the world is seldom so black and white. Overall, just disappointing."}, {"rating": "6", "text": "How do you rate a clever film that is fun to watch but only original in some of its plot twists? Liam Neeson is very convincing and Vera Farmiga and Sam Neill and all the minor characters were well done. No insight into The Human Condition, but I was happy to escape all life’s problems in the company of these fine actors for 103 minutes."}, {"rating": "7", "text": "The commuter is an average thriller that leans towards action, elevated somewhat by the sheer gravitas of Neeson's performance. If your'e a fan of taken/run all night then you will probably enjoy this. Great shots and effects help sell the scenario. Overall you may be entertained but the film lacks that special sauce of thriller flavour that keeps commuter from the echelons of which die hard and co still hold strong."}, {"rating": "6", "text": "A cliche story with solid action and pacing. It's probably good to see Liam Neeson does what he does best in action movies, but that's pretty much it."}, {"rating": "7", "text": "Good action & lots of intense scenes. Some spotty poor dialogue at times. Neeson still doing his thing but showing signs of aging. Not a blockbuster by any means but kept the audience attention by its mysterious twists & turns. I give it a solid 7.5"}, {"rating": "6", "text": "\"The Commuter\" was definitely a very good movie. Liam Neeson, even at an advanced age, still knows how to fight, although his level has dropped a bit, the story was regular but exciting. I think this movie did not disappoint me at all."}, {"rating": "7", "text": "Our boy, Liam Neeson, is back with another action packed, tense film. It's amazing how a mysterious woman who asks him to perform a simple task, could unfold a huge maze of lethal encounters which take place of this train."}, {"rating": "7", "text": "Not as bad as I thought it was going to be. Liam Neeson is good in his role as the typical Neeson Character. Some cool action sequences and great suspense in the early going of this film. Got a little slow towards the end and some of the scenes begun to get a little cheesy. A few little twists that I didn't see coming but the ending was a little disappointing. A decent film with some memorable scenes but nothing you need tgo check out right away."}, {"rating": "6", "text": "Another action movie by Liam Neeson, exciting and intriguing like others; but without leaving a cliché that has maintained since the trilogy of Taken (2007, 2012, 2015) and Non-Stop (2014).The action unfolds very well, and the mystery can be felt. But finally it ends up being another action blockbuster. 6.1 / 10"}, {"rating": "10", "text": "I HAVE WATCHED TONS OF ACTION AND THRILLER MOVIES AND I COULD SAY THAT THIS IS ONE OF MY ALL-TIME FAVORITES. DEFINITELY A MUST-TRY MOVIE! I LOVE LIAM NESSON. THE MOVIE IS AWESOME AND TO THOSE WHO RATED IT LOW! JUST **** OFF!"}, {"rating": "3", "text": "The trailer looked halfway between intriguing and ridiculous but then, so did the movie. No spoilers here, but what starts out like a remake of Hitchcock’s ‘Stranger on a Train’ - draws you towards hoping for some intelligent turnaround from action director Jaume Collet-Serra and predicable Liam Neeson moronic action fodder. Then, just as the journey begins to look interesting the signals change and the ride derails itself. Fans of mindless, impossible action, won’t be disappointed but, anyone looking to use their brain will be left at the ticket barrier. It’s a Big money-maker that apart from a cleverly designed (and endless) end credit sequence is somewhat worthless as quality entertainment."}, {"rating": "5", "text": "Entertaining and Neeson is good but premise is ridiculous and makes the movie unintelligible."}, {"rating": "6", "text": "A worth watching movie. That's all I have to say. It's not great, it's not that memorable, and it would not have been worth seeing at full theater price, but as a rental, it's well worth it. For only $1.50 at a Redbox machine, The Commuter is more than worth it."}, {"rating": "6", "text": "When a director and actor have a string of B level movies you'd expect some of these efforts to fail, but surprisingly the efforts continue to be solid entertainment. B-"}, {"rating": "5", "text": "The Commuter feels like the side story of Taken, where Liam Neeson tries to have a normal life and BAM his life is taken... over by an evil Vera Farmiga hell bent on a plot taken right out of a 1990s Stallone action flick (like Daylight or Cliffhanger)."}, {"rating": "7", "text": "\"The Commuter\" is an action-packed, suspenseful, and entertaining action thriller."}, {"rating": "7", "text": "I have to admit, I love Liam Neeson. After a bit of reservation thinking the movie would fall along the lines of Taken the wifey and I decided to give it a go. We were not disappointed. We both really enjoyed the movie, the story was good and the acting was really good. A great movie to watch on a Saturday! Of course no nude or porn so that's always a plus!!"}, {"rating": "7", "text": "Although very cliché and predictable, The Commuter is still a fairly enjoyable movie. The acting was good, the action sequences were well made and the last 20 minutes were quite interesting. While it isn't the most original action movie to come out in recent years, it's still worth a watch."}, {"rating": "7", "text": "A solid albeit predictable thriller.Neeson does his thing as the over-the-hill man with a pastPatrick Wilson's brief appearance telegraphs the twist due to type-casting.More mindless fun"}, {"rating": "5", "text": "Did Liam Neeson already star in a movie like this called 'Non-stop', but this time it's a train, not a plane. It's even got the same director, Jaume Collet-Serra."}, {"rating": "9", "text": "Another great Liam Nelson film. I wasn't really expecting much based on the trailer, however while watching this film, I found myself very interested. It was very suspenseful and it really touched my emotions. While it's a very predictable movie, The Commuter succeeds at entertaining us."}, {"rating": "5", "text": "The 8 stops 4 minutes apart should've made the movie approximately 40 minutes long, including intro and end scenes, which would've been just right. Unfortunately they added an extra hour of Liam Neeson trying to think."}, {"rating": "6", "text": "Neeson does a good job here. Despite being 65, he can still kick butt and does a role similar to what he did in other movies like Taken and Non-Stop. The thrills here are good too as there are a couple white-knuckle moments and some suspense. However, the writing is a bit sloppy. It's hard to understand what's going on at times, the story itself becomes implausible and over-the-top, and overall, there's not much that sets this apart from other mystery-thrillers. The Commuter is a decent movie. The story is a bit ridiculous and the writing weak, but nethertheless a fun thriller with a good performance from Liam Neeson."}, {"rating": "5", "text": "What could have been a great psicological thriller was instead a mediocre action movie with quite generic scenes and acting. The plot had promise, but wasn't used the right way, we could have got to know the characters in the train deeper, or the murder mistery could have been slowly solved during the movie, intead we got an exposition dump from every character we met. The plot twist of him finding the passanger was good, i didn't imagine that, but the twist of who was the killer was very obvious in my opinion. Some of the action was good, but others were unnecessary, in the end this will be another movie that nobody will talk about 1 day after watching"}, {"rating": "7", "text": "Liam Neeson stars as Michael MacCauley an everyday family man with a wife and son, who does the daily train commute to and from his work as an insurance salesman.Micheal is having another routine day at the Office when he is called in by one of the top executives at the company he works for and told that he is being let go because what the company expends on his job can no longer be sustained because of the inadequacy of what he brings in with his sales job.Disillusioned and uncertain of what the future holds, MacCauley, as he commutes back home, has an encounter with a random female passanger, or is she? MacCauley, subsequent to this encounter, gets caught up in a government conspiracy which has law enforcement officials who seek to uncover it pitted against those involved, determined to cover it up, the efforts of both sides directed at a passenger on the train. While not an outstanding movie, this  is a good race-against-time, fast-paced thriller."}, {"rating": "8", "text": "I’m late to the the “retired Liam Neeson with skills” movie genre, but I’m finally trying to get caught up. (This is my second one. I just watched a Walk among the Tombstones, which was also good, but that was more of a more grounded psychological thriller.)Commuter was a really good time. I could see some people being thrown off by it because it starts off like an actually good movie, and then it kind of gets sillier and more ridiculous and becomes a bit of a howl at the screen kind of ridiculous fun action movie.If that’s your kind of thing, then the Commuter is really good. Just a very minor spoiler: it’s not like a Jason Statham movie. Liam’s character is not a highly skilled former navy seal or assassin or something. Just a cop who can hold his own. Still the action and the fighting are fun."}, {"rating": "4", "text": "A flat and boringly made thriller that manages to be engaging enough regardless until it turns into an absolute farce in the final act. Not good, but still enjoyable due to its own silly self-seriousness."}, {"rating": "6", "text": "This movie felt like it was trying hard to be a 1 location-shot epic movie, which it turned up that it failed at it. Liam Neeson was the only one who delivered their character in style and with passion the other actors did not show enough interest and didn't gave depth to their roles. Although it is arguable that this was the point. Also immersion with the viewer was non existent. There is no humor which just makes a movie like this feel like a chore and totally dull. Sadly the plot is very shallow and has no entertainment value to it. The CGI was average at best within the action scenes. Sadly all the elements with the combined ending of the movie and the message it delivered, which was painfully cliche - are the exact reason this movie is just and above average."}, {"rating": "7", "text": "I think it's a good movie, the plot can sometimes get confusing, but Liam Neeson's acting was phenomenal and the mistery I found very interesting. It keeps you thinking throughout the whole movie."}, {"rating": "7", "text": "The Conmutter is the new film starring Liam Neeson, the same actor who filled us with adrenaline with the trilogy of Taken) escaping from international criminals and protecting his beloved family, returns to seduce us with a character designed just for him. In The Conmutter we see a loving family man, insurance salesman (retired policeman) and frequent user (Commuter) of the New York train system, confronting a criminal organization, which \"forces\" him to identify a possible witness for (his or her) subsequent elimination. When we write the word \"forces\" in quotes, we do so with all the intention, since it is really an offer that the character accepts under certain conditions.The Conmutter, is the fourth collaboration between the Irish actor and the Spanish director Jaume Collet-Serra, (after the successes of Unkoown, Non stop  and Run  all night )who seems to be responsible for the transformation of the high Irish actor in a Hollywood action hero, who made his name on the big screen at the hands of Steven Spielberg for Schindler's List (not exactly embodying an action hero) and the director's second collaboration with the beautiful and talented Vera Farmiga, after the success of The OrphanThe push that the Spanish director has given the Irish actor comes basically in turning his characters, from father of affectionate family, to an action hero, almost like a modern James Bond. This combination (of characters) seems more a mixture (in the good sense of the word) between James Steward and Clint Eastwood, or to be a bit more current between Tom Hanks and Tom Cruise (keeping the distances in both comparisons). The film is full of a progressive tension and a fast-paced action that feels and sees the viewer, along with the very good and customary performance that Liam Neeson gives us, along with a production that few would say was not filmed in the same train system in New York (it was actually filmed in recording studios in London, making exact replicas of the trains and the memorable Grand Central Terminal in New York)The Conmutter provides us with a character, married with children and responsible for them, and that due to unexpected economic situations sees the offer of an unknown woman in his daily trip on the train attractive, after having a moral dilemma, whether or not to follow the instructions that this mysterious woman sends him. Liam Neeson does not disappoint us, on the contrary he strengthens his image as an actor who plays the father protecting his family embarking on a fast-paced action, and the director repeats the magic of suspense that brought us with Non Stop flight.Finally, it is possible to conclude that it is worth paying the entrance to the cinema, and also a good movie theater combo, popcorn and full refreshments, so you do not to leave the cinema seat for a second."}, {"rating": "7", "text": "This is a fairly decent thriller - its a bit unbelievable but its got enough plot twists and some solid special effects for it to be a fairly good watch. Liam Neeson plays his usual stereotypical must-save-the-day type character. If you don't like far fetched stories then this may not be for you but otherwise its reasonably good and probably worth a watch."}, {"rating": "3", "text": "Overall the same movie as \"Non-Stop\", but in a train and not a plane. Liam Neeson is playing the same boring character as always, but, as always, the action is good."}], "recommendations": ["the_mechanic", "unstoppable", "the_equalizer", "3_days_to_kill", "21_bridges", "run_all_night", "the_ice_road", "honest_thief", "den_of_thieves", "angel_has_fallen", "the_accountant", "wrath_of_man", "man_on_a_ledge", "premium_rush", "taken", "cellular", "the_november_man", "triple_frontier", "the_equalizer_2", "escape_plan", "a_walk_among_the_tombstones", "the_call", "seeking_justice", "jack_ryan_shadow_recruit", "the_next_three_days"]}