{
  "id": 284,
  "title": "The Treasure of the Sierra Madre",
  "starring": [
    "Humphrey Bogart",
    "Walter Huston"
  ],
  "runtime": 126,
  "genre": [
    "Adventure",
    "Drama",
    "Western"
  ],
  "description": "Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.",
  "releaseYear": "1948",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pWcst7zVbi8Z8W6GFrdNE7HHRxL.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 8.142857142857142,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Compared to the movies of today, this holds up really well. A breath of fresh air from a good classic. Water is more valuable than gold when your'e a hundred miles from nowhere. Would you rather be a rich dead man or a living poor one with water & food scraps?"
    },
    {
      "rating": "10",
      "text": "The best, GREATEST thrilling movie ever made! With the best movie character ever portrayed: Humphrey Bogart as Fred C. Dobbs! And the best movie quote ever spoken: \"Badges? We ain't got no badges. We don't need no badges! I don't have to show you any stinking badges!\" And the best movie score ever composed!"
    },
    {
      "rating": "9",
      "text": "Remember that Treasure of Sierra Madre was a movie made under a context where gaves value to text and plot, which doesn't an exception here, beyond fit and well-tied form, here we got some demonstrations of loyalty, corruption, poverty and everything else that defines more-than-one individuals human relationship"
    },
    {
      "rating": "7",
      "text": "John Huston's classic tale of greed,  features one of Humphrey Bogart's best performances.  His journey from likeable loser to vulgar,  pathetic psycho, driven by a lust for gold,  is remarkable,  sobering, and disturbing"
    },
    {
      "rating": "7",
      "text": "The treasures of the movie are the acting performances of Bogart and Huston in this neo-Western journey full of twists and turns about a gold hunt in the mountains of Mexico, set in the 1920s.  A pleasurable watch."
    },
    {
      "rating": "8",
      "text": "procrastinating the humane accuracy and lunacy..The Treasure Of The Sierra Madre4 Out Of 5The Treasure Of The Sierra Madre is a tale about three partners going after the treasure and the irrevocable journey or adventure that it brings along with it. The inner politics depicted among the greedy friends and the good old \"morality\" conflicts that it raises, is the ingenious yet simply sensible take of the makers especially when the heat is communicated directly to the audience, it gets better as it ages on screen. It is rich on technical aspects like sound effects, background score, editing and art design. The primary reason the feature offers a satisfactory outcome is that not only is it unpredictable but is justifying with genuine reasoning which is the soul in here. The structure of the script may be familiar but its additional and side characters does make it worth keeping the audience engaged offering them enough work and art to explore in it. John Houston; the screenwriter-director, uses its smart adaptation wisely and brilliant execution skills on creating the anticipated vision on screen. The performance is decently acted by Humphrey Bogart and Tim Holt but the real gem of the feature is Walter Houston who gives a memorable performance as a supporting cast. The Treasure Of The Sierra Madre is an interesting take on morality while procrastinating the humane accuracy and lunacy on its backdrop that ticks loud and clear all through the way."
    },
    {
      "rating": "8",
      "text": "A great showcase of masculinity and male ignorance without a slight trace of women."
    },
    {
      "rating": "0",
      "text": "Une vieillerie chiante comme la pluie et pour cause, il s’agit d’une daube de John Huston, spécialiste émérite en la matière, la matière dont sont faites les daubes cinemerdographiques, à savoir les sales films de merde dont il avait le secret mais aussi la recette imparable !Aussi, ne sommes-nous point étonné de nous endormir dès les premières minutes du film, un film incongru d’ailleurs, vu que les immigrés ici sont américains et émigrent… vers le Mexique ! on est dans les années 20 mais quand même, la grande dépression n’est pas encore là.On y suit en tout cas l’excellent Bogart en clodo involontaire qui rame comme un crevard et traîne dans le pays sous-développé comme uin traîne-savate en compagnie d’ailleurs d’autres ‘compatriotes’ même si certains ont réussi et pètent dans la soie… quoi qu’il en soit, le voici qui se remet au boulot et s’en va chercher un trésor dans la Sierra Madre à ce qu’il paraît…Mais nous avons déjà arrêté les frais depuis longtemps (déjà), car cette chienlit est d’une lenteur à faire mourir de honte une tortue fatiguée ! à laquelle nous pissons à la raie (si elle avait une raie) parce que franchement (avec l’accent très marseillais) on s’en bat les couilles de tout ça et notamment des sales films de merde. Dommage pour Bogart mais de toute évidence, tout le monde peut se tromper. D’ailleurs, je crois bien qu’il ne roulait pas en Golf."
    },
    {
      "rating": "9",
      "text": "An all time classic.  Great movie,  Really great performances all around.  Set in the 1920's this movie is a very good re-enactment of that time."
    }
  ]
}