{"id": 1579, "title": "The Ring Two", "starring": ["Naomi Watts", "Simon Baker"], "runtime": 110, "genre": ["Drama", "Horror", "Thriller"], "description": "Rachel Keller must prevent evil Samara from taking possession of her son's soul.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8Mnthy6ymdKHVwVw5gJB7RtaO1F.jpg", "categories": {"plot": 5.857142857142857, "acting": 6.2, "ending": 4.5, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 4.6, "funny": 3.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "The first part was better. Much scarier than this. This movie was good to look at. Naomi Watts was good. Anyway I like it."}, {"rating": "7", "text": "Not as good as the original, but it's just as artistic."}, {"rating": "10", "text": "Naomi Watts is great and the movie is incredibly scary."}, {"rating": "10", "text": "Not as perfect as the first, but miles beyond anything else out there. I think that some of the things that don't make sense are because we have still yet to find out a bunch of stuff that will come in the form of the 3rd movie being a prequel. Because we still need to know why Samara is the way she is, that is not answered in this movie."}, {"rating": "3", "text": "I'll say it now: \"Damn you Ehren Kruger\". I've never laughed at a bad horror movie before. Why? Because I'm always bored during them. And this my friends, is a BAD one. But, I encourage you to rent it for a laugh. This movie is funnier than some of the so-called comedies Hollywood is throwing out. This is the FIRST horror movie I've ever laughed during, there's nothing scary about it whatsoever. Well... there may have been something towards the end that may have inspired fear in some people - but I was too giddy from laughing at the deer scene (I swear I was in tears) and the toliet scene. The so called scares were not scares at all, they were 'jump tactics' (i.e. Samara grabs someones arm). I also found humor in the fact that whenever Hideo Nakata wanted to show drama he whipped the camera around in a circle. Powerful? No. I was not impressed by his direction at all. The effects were also overdone and came off as silly excuses to spend money. The acting, if you can call it that, was just so... so... bleh. Thats the word. This whole movie can be discribed as \"bleh.\" You'll find yourself discribing it to people as \"bleh\" before you tell them how much you laughed during that deer scene. This movie is really that funny, but it's not scary which is what it set out to be. For that, it gets a lowly.... ===3.3/10==="}, {"rating": "3", "text": "As far as I'm concerned, it's official: Hollywood has lost the art of how to make horror films. Consider this year's entries as Exhibit A - everything from White Noise to The Ring 2 has been horrible. There's not a worthwhile film in the bunch. And nowadays, it has become popular to remake incoherent Japanese ghost stories into less cogent English-language versions. The Ring and The Grudge are prime examples of this kind of bankrupt storytelling philosophy. Give me Halloween, A Nightmare on Elm Street, or The Shining any day.\r I was not a fan of the American edition of The Ring. It did too little with an intriguing premise, offered a confusing and often dumb storyline, and was low on the creepiness scale. But compared to its successor, The Ring was pure genius. The Ring 2 is slickly made garbage - a dull, plodding horror movie that ventures into the realm of idiocy when it isn't busy remaking the first film. This is yet another example of what happens when money, not creativity, drives the production of a sequel. Despite its flaws, The Ring worked as a self-contained story. Opening it up for a second installment is a mistake. The evidence is on the screen.\r If you're expecting scares from The Ring 2, you will be disappointed. Except for a few half-hearted \"boo!\" moments, this film has little to offer that will raise the nape hairs. The horror, to the extent that it can be called by that word, is standard, by-the-book stuff that has been neutered in order to appeal to a PG-13 crowd. It's stale. Even the one potentially edgy aspect of the movie ends up being blunted to the point where it couldn't cut butter. And, because The Ring 2 doesn't have a clear idea of where it's going, its rules and restrictions regarding the ghost and her behavior are arbitrary.\r With the exception of an opening sequence that echoes that of The Ring, the most intriguing element of the first movie - that watching a video tape can result in a death sentence - is eliminated. Maybe the reason for this is that the VCR is fast becoming obsolete, joining the 8-track deck and the record player in garage sales. Can a DVD have ghostly beings encoded on it? Although The Ring 2 doesn't do much with videotapes, it offers something new: Bambi run amok. Watch and see why it's a good idea to allow hunters to thin the herd.\r Naomi Watts and David Dorfman have the thankless jobs of reprising their roles as Rachel and Aidan Keller. Everyone else from The Ring gets this film off. Replacements include Elizabeth Perkins as a psychologist, Simon Baker as a reporter, and Sissy Spacek as Carrie 35 years older (or something like that). None of these secondary characters comes close to growing a personality, but that's pretty much true of the leads as well. We identify with Rachel and her son because we have known them longer.\r In many ways, the film's production history is more interesting than the resulting movie. After Gore Verbinski (director of The Ring) decided he would rather go chasing pirates than try on a second Ring, the producers approached Hideo Nakata, who made both Ringu (the Japanese original) and Ringu 2 (the Japanese sequel). However, while The Ring was a remake of Ringu, The Ring 2 has nothing to do with Ringu 2. So this means Nakata got a chance to make two different first sequels. At least he can't claim that someone else messed up the American version of his franchise. He did it all by himself."}, {"rating": "1", "text": "One star for not naming everyone in the credits Alan Smithee. You have to earn the other nine by making something at least marginally watchable. This is an hour and fifty one minutes of my life that I will never get back. Hideo Nakata, I hold you responsible."}, {"rating": "5", "text": "Well because only it was disappointing whenRachel closes the well my 2nd mum says there will be a 3rd but i do not think so and when loads of people say that Adian will die and he did not get abused"}, {"rating": "0", "text": "What's that? Did she just tried to kill her child with cocaine? And a group of deer just attacked the car? Oh wait a second, I know why this is happening. Oh I get it! Because it's meant to be the worst horror movie of all time. Wow, I've never thought of that. Hmmm"}, {"rating": "0", "text": "There is nothing entertaining about this movie. Would someone please explain to me the scene with the deer? I didn't get it. There is nothing scary about this move and I have no idea how they got Sissy Spacek to play a cameo."}, {"rating": "2", "text": "Pros: Acting. Cons: Makes absolutely no sense. overview: DO NOT WATCH THIS FILM!!!"}, {"rating": "7", "text": "Not to bad the story continues but this time it dont focus on the 7 day cycle, instead we have samara focusing on rachel and a new ajenda. at least it isnt a remake of the first film."}, {"rating": "1", "text": "All I have to say is \"deer scene\" I have never laughed so hard in my life. Not to say that the rest of the film could even salvage this horrible film, but that scene in particular was so lame that I had to show all of my friends...they all hate me now."}, {"rating": "4", "text": "I was a huge fan of the first film so I was really disappointed by this half-baked piece of junk. This movie had none of the scares and definitely none of the creepiness of the first one. There were so many wholes in this story it was ridiculous. First, why the heck would Rachel even have a television in her house let alone a video player? Didn't the writer see Poltergeist and the all important last seen when the family shoves the television out of their motel room? And what was up with the deers? I mean were we supposed to believe that somehow deers can sense evil or was Aiden actually Damian from the Omen? And finally why didn't they just tell uswho or what Samara was? Maybe they think people will actually pay to see The Ring Three. If you haven't seen the first American version of The Ring see that and if you have don't waste your time on this."}, {"rating": "7", "text": "While thr first time I saw it made me jump a few times, all in all, this movie just wasn't that scary. Sure, it was better than the first, but like the first, it's only entertaining if you expect a good, well-done plot rather than a terrifying film. Also like the first one, it's only scary the first time."}, {"rating": "6", "text": "Mediocre sequel which takes the originality of the first movie and ruin it with a tired concept which has been done over and over. The actors to their best but part of me still cant help dislike the kid."}, {"rating": "5", "text": "Naomi Watts acted really well throughout the film, but that's about all that is good about it.  The film has plot holes everywhere, and after a while, everything becomes a bore.  A huge disappointment, especially compared to the original \"The Ring\", and the Japanese \"Ringu\"."}, {"rating": "6", "text": "It took me too long to finally get around to watching this. Being such a huge fan of the original, and hearing dreadful things about the sequel, my expectations were rather low. While it's nothing exceptional, The Ring Two is a moderately creepy sequel, even if it does seem like a departure from the original's themes. In The Ring Two, Rachel and her son, Aidan, have moved away to Oregon to get away from the terrifying events that occured in Seattle, but Samara has followed them and plans on taking Aidan's life for her own. Something you'll notice from the very first scene is how much different this movie is to its predecessor. Where The Ring used the seven-day time limit to create tension and simple, yet haunting visuals to scare its audience, The Ring Two seems to focus more on big, flashy special effects to overwhelm the viewer. That becomes a huge distraction throughout the entire film, as the CGI looks cheesy and outdated today. This tone of the movie also seems very unfocused. The tone meanders throughout the entire film, going from your average ghost flick to a mystery-thriller like the original to a sort of evil child movie. That's not to say it isn't engaging; The Ring Two is, for the most part, rather entertaining, and it never tries, fortunately, it never tries to be too \"intelligent\", and then end up being convoluted and confusing. The plot itself is very tight and controlled. It's just tonally inconsistent. I also want to mention the incredible score. It's seriously one of the best and most memorable scores to any horror film in recent memory, and it really adds to the creepy atmosphere of the movie. The Ring Two is certainly not a remarkable film, but it is an entertaining and creepy little supernatural thriller."}, {"rating": "10", "text": "Very interesting plot and special effects cool. The film is at the level of 1 part, worthy. The high-quality acting game of Naomi and Dorfman - allows  to get even deeper into the atmosphere of the film."}, {"rating": "6", "text": "'O Chamado 2'Fiquei um pouco decepcionado com a sequencia , ele começa bem , mais depois vai caindo , isso mais pro final , SPOILER : Aidan deveria ter morrido , era uma situação perfeita , iria dar um peso pra série , uma pena."}, {"rating": "10", "text": "the critics got it wrong it is an awessome movie. and i really like it. dont listen to the critics"}, {"rating": "9", "text": "I really loved this movie and it so amazing and so terrfying. Critics got it so wrong dont listen to them. I loved the dear part it was my favorit scene when i watched it was so Cool. They should have bring back Naomi Watts in rings because she is the best actress and she did a great job in the ring two. The script was well writen because the had such an fantastic and terryfing scene. I  recommand to watch this and dont listen to the critics because there is moment in this movie you dont want to miss so. Watch this movie online or buy so you can enjoy dont let negative backlash get you down. When Rachel climb out of the well and she Said i am not your mommy. I really feel bad for samara. Rachels power is just to protect aidan from Evil samara. Rachel is just want to so her job because she want samara to get out of aidans body. When you are possessed in degree a mother most kill the ghost inside your body because when evilyin try to drawn samara. Evelyin Said that her baby told to do. Rachel want to try to drawn aidan because he told her so samara can come out from his body. The deer attacked the car because they think that is samara and not aidan. This movie is not disspointed or Worst because people WHO Said that they are wrong. They dont think what is possession. This is why Rachel try to do is try to get out samara from his body and not try to kill him so IF you love the ring. You have to love this one"}, {"rating": "10", "text": "very good movie. i liked the deer scene it was very good the special effect was cool"}, {"rating": "8", "text": "Creepy girl and her mom are back again. A lot better then part 1. A lot more killing and more creepy stuff."}, {"rating": "7", "text": "The Ring 2 isn't as bad as some people say it is. It is almost same as first one. The concept and plot was almost same.The plot is a little more simple than the first one and there are a few places in the movie that could've been better, but it's still a good movie. The movie starts off in a similar way to the first film. After that there are some things that are a little to much like the first. The story starts out really well as I said the plot is kind of simple but its set out so that it takes a while to see the whole picture. There are some parts with CGI effects that aren't needed. Half way through it gets really good, you don't know whats happening and you don't know how they're going to stop it. After that it gets a bit obvious and kinda hurried. Overall, see this film for your self. Yes movie doesn't offer you anything new as it seems copy of first part only but you will not regret watching it."}, {"rating": "7", "text": "Mother from the first one starts working at a small town newspaper, burns the VHS tape but this got her kid possessed by what was in the tape so she has to try to drown him."}], "recommendations": ["the_grudge_2", "rings", "the_grudge", "stay_alive", "texas_chainsaw_3d", "the_curse_of_la_llorona", "the_possession", "blair_witch", "paranormal_activity_the_marked_ones", "paranormal_activity_2", "wish_upon", "insidious_chapter_2", "the_haunting_in_connecticut", "chernobyl_diaries", "the_texas_chainsaw_massacre_the_beginning", "paranormal_activity_4", "the_eye", "dead_silence", "unfriended", "paranormal_activity_3", "malignant", "the_ring", "insidious", "devil", "slender_man"]}