{
  "id": 1292,
  "title": "The Revenant",
  "starring": [
    "Leonardo DiCaprio",
    "Tom Hardy"
  ],
  "runtime": 157,
  "genre": [
    "Western",
    "Drama",
    "Adventure"
  ],
  "description": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ji3ecJphATlVgWNY0B0RVXZizdf.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 10.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.428571428571429,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Caught this movie recently on Cinemax. It's a darkly clever take on the genre: a vampire buddy pic?! It goes several directions and alternates between funny, touching and disturbing. Not a masterpiece, but fun to watch, very original and not too gory."
    },
    {
      "rating": "10",
      "text": "I never understood some critics, they give a positive rating to Star War Force awakens, although it was so bad, it could be a simple tv movie, only the users gave it what it deserves a negative rating, but for the Masterpiece The Revenant the users are the only people who rated it positive while the critics not... really something is wrong here. This is a Masterpiece of Cinema, so such Movie i didnt see since Interstellar...\r Thank You Iñaritu, you are the best example how spanish filmmakers know their arts and Disney/Hollywood sucks!"
    },
    {
      "rating": "10",
      "text": "Man, this movie was just awesome. I totally expected this movie to be a mediocre b-rated horror comedy but I was dead wrong. I was literally laughing out loud on several occassions.The interesting thing is the movie is more than just a comedy too... there were times during the movie where I was genuinely disturbed and also sad. The 2 main actors are rock solid and the supporting cast is great except for 2 extra soldier dudes in the 1st 5 minutes of the film. I reccomend this movie to anyone... doesn't matter if you are a fan of the genre or not. This one is a guaranteed future cult classic. Oh and the critics must have seen a different film, or they are mentally challenged, because there is no way this should be getting mixed reviews."
    },
    {
      "rating": "8",
      "text": "This movie is certainly darker than I would normally expect from a dark comedy, but it is a lot of fun. If you're looking to have a lighthearted laugh, this movie is not for you. The morale I got from this movie is that, you may feel on top of the world when you're having fun, but you will have to come down eventually and when you come down, you will come down hard."
    },
    {
      "rating": "8",
      "text": "Caught this on Syfy last night and thought it was pretty good.  It's an interesting take on horror/comedy that doesn't involve zombies, vampires, or werewolves.  David Anders and Chris Wylde both did a great job as buddies dealing with a \"unique\" situation.  The dialogue is the best part.  If you are paying attention there are some really funny jokes hidden in well delivered lines."
    },
    {
      "rating": "7",
      "text": "Slow starter that picks up the pace about half an hour along and really kicks into high gear around the halfway point.  The main flaw is that very little is done to explain how revenants happen, but by the end you probably won't care.  Not quite as funny as Scouts' Guide to the Zombie Apocalypse and nowhere near the sly masterpiece of Wyrmwood: Road of the Dead but definitely a must watch for any fan of the undead genre."
    },
    {
      "rating": "6",
      "text": "Interesting because without being overly absurd it got a lot of funny moments."
    }
  ],
  "recommendations": [
    "the_cabin_in_the_woods",
    "scouts_guide_to_the_zombie_apocalypse",
    "zombieland",
    "drag_me_to_hell",
    "bright",
    "zombieland_double_tap",
    "hot_fuzz",
    "from_dusk_till_dawn",
    "barbershop_the_next_cut",
    "iron_sky",
    "scream_4",
    "cabin_fever",
    "the_happytime_murders",
    "scary_movie_4",
    "the_babysitter",
    "the_dictator",
    "shaun_of_the_dead",
    "saw",
    "the_a_team",
    "the_host",
    "crank_high_voltage",
    "rambo_last_blood",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "a_haunted_house",
    "ginger_snaps"
  ]
}