{"id": 3824, "title": "The Layover", "starring": ["Alexandra Daddario", "Kate Upton"], "runtime": 88, "genre": ["Comedy", "Romance"], "description": "When their plane is rerouted due to a hurricane warning, two single female best friends find themselves competing for the same guy during an extended layover in St. Louis.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kb9osnqanXRpkpm1bnSqAhKoq5T.jpg", "categories": {"plot": 0.0, "acting": 0.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 0.0, "funny": 2.5, "action": 5.0}, "reviews": [{"rating": "0", "text": "Directed by William H Macy, The Layover takes the cake for one of the worst movies I've seen all year. While Macy is the director, I would certainly blame the writing and the creative team behind this for creating a screenplay that is so shameless that its doesn't make any attempts to be good in a shameless way. Daddario, clearly making films(Baywatch, True Detective) to showoff her body does nothing to disprove that she is an awful actress and Kate Upton is the same but to a worse degree. The characters in this movies are stupid and their characterizations are even more stupid hence it makes it almost impossible to relate or even sympathize with them in anyway. This is not a good movie, it has to be one of the worst comedies I've seen since Dirty Grandpa or at least one of the worst comedies Ive seen in a few years."}, {"rating": "5", "text": "Wasn't that bad I've seen worst we all do , main reason of watching this movie I wanted to kill some time in early morning 5am so other genres won't fit at this time so comedy was my choice also because of Alexandra Daddario in it ,  The movie was funny enough for me wasn't that great and wasn't that bad either so don't depend on the rating and reviews all the time  !"}, {"rating": "0", "text": "Shameful, not funny at all, Kate Upton proves that she is making movies for her body instead of having some kind of talent, so is Daddario, who has one of the worst comedy timings I've seen in years, she's completely graceless.A misfortune directed by William H. Macy from whom I will never get back the 90 minutes I invested in his filth."}, {"rating": "8", "text": "Commedia umoristica senza grandi preetese ma divertente:varie le situazioni comiche davvero spassose, buone regia, sceneggiatura e recitazione; brave e simpatiche le due protagoniste; bella e sexy la bionda Kate Upton. La cattiva accoglienza da parte della maggioranza della critica deriva certamente dal fatto che la storia (narrante le tragicomiche avventure di due amiche-rivali, invaghite dello stesso uomo)contravviene in modo palese ai dettami del femminismo alla moda,che vorrebbe vedere solo donne sicure e solidali fra loro,emancipate da ogni dipendenza dal mondo maschile, ma e' anche una prova di scarsa onesta' intellettuale e di eccessiva e inopportuna seriosita': il film infatti non va preso sul serio e il suo registro chiaramente scherzoso dovrebbe farlo capire al di la' di ogni ragionevole dubbio. La pellicola e' davvero carina e ben fatta e avrebbe meritato ben altra accoglienza."}, {"rating": "1", "text": "Whichever board of horndog film executives OK'd this film deserve to be dragged out into the street and shot. If anyone ever tries to tell you that the objectification of women is no longer a problem in mainstream film, get them to watch this movie so that they'll shut up."}], "recommendations": ["movie_43", "the_room", "tropic_thunder", "norbit", "the_ridiculous_6", "zack_and_miri_make_a_porno", "meet_the_spartans", "identity_thief", "jack_and_jill", "thunder_force", "dark_phoenix", "zoolander_2", "zoolander", "the_bounty_hunter", "the_departed", "gran_torino", "burn_after_reading", "tusk", "funny_people", "the_dilemma", "coming_2_america", "one_year_one_night", "miss_march", "trainwreck", "baywatch"]}