{"id": 811, "title": "The Hate U Give", "starring": ["Amandla Stenberg", "Regina Hall"], "runtime": 133, "genre": ["Crime", "Drama"], "description": "Raised in a poverty-stricken slum, a 16-year-old girl named Starr now attends a suburban prep school. After she witnesses a police officer shoot her unarmed best friend, she's torn between her two very different worlds as she tries to speak her truth.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/2icwBom0t5nmOuZI9FVXF3gkMK0.jpg", "categories": {"plot": 7.2105263157894735, "acting": 7.7894736842105265, "ending": 7.0, "soundtrack": 6.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 6.0, "action": 7.0}, "reviews": [{"rating": "9", "text": "One of the most powerful and overlooked films of 2018, The Hate U Give is a nevertheless a powerful, intelligent film with a lot to say. The production values of this movie are phenomenal. Amandla Stenberg gives a career defining performance. The only flaw this movie has is that the script holds the audience's hand a little too much, but the portrayal of the truth within a black community during unspeakable tragedy, and the director's vision of leaving no stone unturned does work in his favor. This is an awesome movie."}, {"rating": "7", "text": "Truth be told, I was kinda reluctant to check this one out, as it looked rather preachy to me, and I feel like the subject matter the film covers has been beaten to death, both in film and in real life. However, at the same time, there's no denying the timeliness of it as well, and this film definitely acknowledges that. And yes, it did get quite preachy often times like I feared, but the performances from the cast and some genuinely powerful moments were enough to make up for that for the most part. The message of fighting oppression and letting one's voice be heard has also been rather overdone as well, but this film handles it well for the most part and doesn't quite reach the point of beating you over the head with it thankfully."}, {"rating": "10", "text": "Easily one of the most important films I've seen. It's sad that in 2018, right here right now, this film and the subject matter is as relevant as ever. After seeing it, I felt very similar to the way I felt after seeing the 2004 film \"Crash\". Very well done, thought provoking, heartbreaking, and something that you won't be able to forget. Highly recommended for anyone who is concerned about the current state of affairs on this planet!"}, {"rating": "9", "text": "The real problem with a great factual based themed movie like this is. It won't get the good reviews it seserves Because in this right winged conservative Trump lead era, TRUTH is not respected. This people, is a very good movie which all of us White people should see."}, {"rating": "9", "text": "Amandla Stenberg gives an astonishing performance as a black teen who has to code switch to get thru her day: She blends in at her mostly-white prep school, while living in a crime-ridden, mostly-black neighborhood. After witnessing a tragic event, she begins to question her identity. What keeps this from becoming a simple adolescent melodrama is the intelligent writing that creates a solid family support system, while honestly examining the complexities of race relations. It almost borders on caricature and contrived situations. Sometimes intense, sometimes funny, this movie makes some powerful statements, while also being an affecting, absorbing and well-made film."}, {"rating": "6", "text": "THUG-LIFE (The Hate U Give- Little Infants F*** Everybody).The newest cinematic #BlackLivesMatter piece brings out that clear message for today’s ungenerous Americans who bottle up pride. Even now in 2018, if a young Black boy is bullied for being gay, the media cares less about his predicament than about how cute Emma Stone looks with Ryan Gosling; not anymore though, at least within the perspective of society’s true xenophobia by director George Tillman Jr. After The Hate U Give’s protagonist, Starr, sees her childhood friend get killed by a cop, it’s revealed how not just White people, but others like Starr’s father and cop uncle, are xenophobic.Hate does not describe my viewing experience of The Hate U Give, for far too many things are done right. It starts with the sincere direction that triggers inner division whenever Starr speaks with her White boyfriend, Chris. Tillman Jr. also initiates fear as he stages the pivotal cop scene without showing the officer’s face, especially with the content of the opening scene fresh in your head. These moments carry far more credibility than other buddy cop comedies that merely resort to a lazy visual difference between two leads to call it a racial allegory (I’m looking at you, Bright).Unbelievably, you forget that White people back in the early half of the 20th century refused physical contact with objects that Black people had touched, which still influences people now, even Starr’s White girlfriend who denies her discriminatory behavior. It’s just like how high schoolers in real life are still in the process of figuring out who their real friends are, a change forced onto Starr by a powerful motivational dad speech on the grass to remind her of what spite really means. Although a smaller cast in The Hate U Give would have allowed greater focus on Starr’s thought process, as unnecessary narrational exposition about these characters is abused to the point where they become nothing beyond words on a page.Give The Hate U Give a good watch however, then the neighborhood’s violent, originally peaceful, “Just Us for Justice” protest will assault the senses despite the mediocre characterizations. It turns especially effective because every individual actor marks clear motivations, especially the transparent Russell Hornsby (Fences) who holds the whole production together. The confused emotions pop up within the White characters too, as Chris’s peers accuse him of behaving Black, yet he misunderstands what Blackness really means. It’s the same level of detailing cultural relationships achieved in Guess Who’s Coming to Dinner?Little do I realize that The Hate U Give was speaking to me about my own prejudice I admit being guilty of. Here’s how: Before high school, I seldom saw differences between Black, Yellow, Red, Brown, White, or anything between. High school was when other non-Whites became the butt of jokes around my peers, until growing up made me realize how unacceptable it was. Now, I’ve been very, very conscious about my treatment of other Black people—even mentally tracking the times I physically touched one, thinking, “well, clearly, I’m not racist!” Except that thought process is racist, since it’s a special treatment that gives one specific attention because of their difference. Think of it in the way one with autism, such as myself, wants to be accepted like anyone else.Infants could call The Hate U Give flawless for this rare awareness that is difficult for a strong film to achieve, but like mentioned in paragraph 3, deeper analysis proves some flaws; an unnecessary flashback takes away the present-day conflict, accompanied by basic, overly sentimental music mixed in with complementary rap music. The jarring transitions by the editing inhibit focus on the implied Christian faith of Starr’s family, which needed to take center stage in an otherwise powerful depiction of the truth.Fork left in the road that is this film reel’s sidewalk, you must decide for yourself how to think after hearing some uncomfortable interpretations from The Hate U Give, such as Starr’s dad accusing Harry Potter of being a gang metaphor (kids separated by color to practice self-defense). In that same way, Starr’s life leans between the blue Catholic school (White world) and the orange neighborhood (Black world), two worlds colliding in an awkward moment when Dad meets Chris for the first time. It’s all a study of what really happens from the twinkling gaze of a teenager who watches a climax she can’t stop watching.Everybody makes mistakes that leave chaotic consequences; a prejudiced police officer shoots a man who may have shared blame by disrespecting the officer, which set off a chain of reactions on both sides that prove how hate has driven the United States down its own counterproductive hell hole."}, {"rating": "9", "text": "Powerful portrayals by  Amandla Stenberg, Regina Hall, Russell Hornsby, and others.  The ending was a bit tidy, but given how brutal and sad the realities of the world being depicted are, it was welcome.This movie is a must-see for Americans (above, maybe, 15 years old, because of the mature themes).  But how tragic that it is well-known to black Americans above, maybe, 7 years old, and so foreign to white Americans (especially those over 50 or under 15)."}, {"rating": "7", "text": "I’m sure there will be lots of 0’s from trolls, and then 10’s from people trying to counter them, but truth is this is a pretty good movie that just allows itself to become too bloated and heavy for its own good."}, {"rating": "10", "text": "Es una de las mejores películas del año. muestra la crueldad del ser humano y nos da una muestra de fortaleza interior del ser humano y la lucha por la igualdad universal."}, {"rating": "0", "text": "Oh boy. YA fiction. The place that's been the most heavily segregated, divided, and marginalized, ironically, by far lefties claiming diversity. Just look at their reviews- they say the film wont get the attention it deserves- then look at the newspaper/publication reviews. The media has a heavy liberal bias (except for a small few, like Fox), and that liberal bias has now become puritanical in its reviews of films and all art, claiming moral truth, as with this film/book and others- the more intersectionally self-righteous and didactic, the more 'factual,' therefore the better the review- especially right around election time. And its not even going to work- people of all types hate having this stuff rammed down their throat- you cant force diversity and creativity. Freethinking comes from being liberal minded, not narrow minded. Period."}, {"rating": "10", "text": "One of the most life-affirming movies I have ever seen. It is required viewing for anyone that calls themselves American."}, {"rating": "8", "text": "the movie remains as an insightful masterpiece, to begin with a very distinct message and tight premise, but surprisingly it isn't until the end where we get to see how tangled up everything really is, like a story and not just a message."}, {"rating": "8", "text": "The Hate U Give(THUG)I didn't think there was such a meaningful name.The film is also a very powerful story we see a really great scenario also liked to handle a current and social issue.Afro african community has shown us very well.We had the opportunity to watch their lives in a good way through their starr perspective.My eyes filled up in some scenes that impressed me a lot but in the scenes that could be much better has become a mess with a few bad details.I watched Amanda's movie Darkest Minds this year and I didn't like the acting there but I said it was bad in the movie.This time it's really a nice movie but i saw a little ineffective acting again, obviously, it needs to improve itself a lot(Amanda Stenberg)The rich and poor distinction of racism is very well summarized, in fact, the film could have been much better, and I think even this scenario would have been rewarded, but as I said, small details pushed the film back a bit.and Khalil live promised not to say a great thing in my opinion there could be created a more logical sentence with the most beautiful scene of the film."}, {"rating": "10", "text": "A performance such as 19-year-old Amandla Stenberg gives in “The Hate U Give” is one that I haven’t seen since I saw Charlize Theron in her Oscar-winning role in “Monster”.  Sadly, because of who she is, she probably won’t get any Oscar recognition for her performance.Stenberg plays Starr Carter, a Black girl who in the evenings and weekends spends time in the ghetto living with her parents, brother and half-brother while during the week goes to a private, white, elite school where she feels she is ‘Starr 2” to avoid being stereotyped.One night she is at a party and a friend, a boy, Khalil, played by Algee Smith, she has known since childhood offers to drive her home. Within 10 minutes Khalil, a black boy, who fails to signal when switching lanes is pulled over by a white policeman and when he reaches for a hairbrush is shot. Starr, handcuffed, watches her friend bleed out and die.Many people have heard about ‘the talk’ black parents have to have with their children, they have seen television newscasts and read accounts of many black kids being shot by while police with the former dying and the latter not paying any price for what they have done.This is a film that shows what the talk is about, what black kids and families go through and have to face. It takes us behind the newscasts we see and hear. Audrey Wells wrote the screenplay based on the book by Angie Thomas takes us into the mind of a young black girl, Starr, and allows us to see exactly how she is affected by not only those around her but by life.We meet her father Maverick (Russell Hornsby) an ex-convict, who has opened his own store and early in the film gives the ‘talk, to his 3 kids explaining what to do not if but when they are stopped by the police. His wife Lisa (Regina Hall) loves her husband and sees him through the bad times in his life and is now they embarrass their children by expressing their love to each other.Maverick’s brother, Carlos (Common) is a policeman and in talks with his niece Starr explains what a policeman goes through when he stops a black person as well as a white person.  We live what Starr goes through when threatened by a drug dealer named King (Anthony Mackie) because her telling the grand jury convened regarding whether to charge the policeman who killed her friend can get him into trouble and when an activist and lawyer, played by Issa Rae, guides her through that grand jury happenings and Starr’s conflict about whether to tell the truth or keep silent.This and much more, such as Starr having a white boyfriend, gets us inside her head about all that she is involved in and around her. Amanda Stenberg’s Starr lets us into the mind of a black teenager while the screenplay and the director, George Tillman, Jr., takes us behind the headlines, the lead stories and shows us what really happens.“The Hate U Give” is a must-see for many reasons including a performance by Amanda Stenberg that will be for her to beat and a movie that shows us that think we know it all know very little about other people."}, {"rating": "10", "text": "Outstanding movie about t difficulties African-Americans face in US society."}, {"rating": "9", "text": "This is a great movie. The acting and story are excellent. The film makes you feel the world from a different perspective. It looks like the overall user score was destroyed by narrow minded political partisans, who likely never saw the movie."}, {"rating": "7", "text": "updated their way of conveying a message..The Hate U GiveTillman Jr.'s familiar version on racism is a desperate call for attention but it is also drawn out with such finesse that you cannot not fall into its gut-wrenching honest bubble. The questions raised in here are rhetoric and doesn't make you think twice. Yes, it is ethically unstable and has morale conflicts for you to ponder about, but again that too are filled in on the usual shoes. And addition to that, what's intriguing is how fair it is. The perspective is three dimensional, the limelight spots on both the stage and the audience.It has captured the apt depiction of the current generation's lifestyle. The references, the vocab, the music, the slangs and the abbreviations, the research done by the makers is undoubtedly plausible. Even the preachings among the subsequent generations passing their legacies have updated their way of conveying the message. The stories that a father tells his children to get their attention, the route itself has changed and these are the real gems of the feature.This is the place where the writers are completely honest with you and they have given themselves this space at each aspects to keep the audience tangled and the story more grounded and practical. The performance is another strong aspect of the tale. Not only does it demand it, but is delivered aplenty in here especially by the protagonist Stenberg who is the trump card of this tale that carries it off all on her shoulder. She is surprisingly good on melting down and sparkling up, but the silent pitches that are essential is where she sweeps away the charm. Supporting her thoroughly lies a great cast like Hall, Hornsby and Mackie whose underdog character often steals the show.It is a sensitive subject to explore upon and the narration is very well aware of that. The structure of the script and the editing of the feature allows you to walk the balanced line. The aftermath or the repercussions that such an incident cause is calculated in detail and the magnitude of it communicates fluently with the audience because of the brilliant execution by Tillman Jr. Each emotion creates a long lasting impact because it has an essence of grit and intolerability that elevates as the clock ticks. Despite of having such a taboo subject the makers never manipulates the viewers to draw out the emotions, the storyline is kept prior to any other thing.By the last act arrives, you are put on a stand by the makers to judge upon it and stand on a definite answer and this is the kind of storytelling we need more; unbiased and non-provocative. The argumentative conversations, both sides of the points kept on the table, narrative monologues, jaggedly projected humane nature and stellar performances, is what fuels this tale for two hours. The Hate U Give is the infomercial that the makers gives us, and fortunately this endorsement isn't sponsored by anyone; it has a stamp credible like the law itself."}, {"rating": "10", "text": "Amazing film especially with everything going on right now. Watch the movie."}, {"rating": "7", "text": "Much more resonant by theme than by execution.It works and the message is very good and even though I finish satisfied, I think it could had exploit the theme a bit more."}, {"rating": "6", "text": "Es interesante, es una historia moderna, varias pelis la abordan, me gusta le final q deja a los balncos y a la policia un poco bien, y me extraña q nunca se vulve a llevar con su amiga blanca"}, {"rating": "4", "text": "This is not a good movie for the black people (especially for black lives matter), this is a parade of cliché !"}, {"rating": "7", "text": "This is by no means a bad film - it does well at making the necessary points known and would be a good watch for adolescents to consider the way the authorities have mis-judged situations etc. It isn't what I think of as an entirely memorable film and while the performances are good and the story decent, its no more than a fairly decent film. I felt one or two parts of the plot were predictable and its not the most impactful film I've ever seen but maybe to expect that would be expecting a bit much(?!). Overall its worth seeing if the story intrigues you, so yes, I'd recommend it."}, {"rating": "9", "text": "Phenomenal acting with an incredible message. This movie is a much recommend on my list."}, {"rating": "8", "text": "This film really hits you, the watching is not easy at all and that is exactly what makes this film so good, compelling and real!The acting is on point especially from Amanda Sternberg (AKA starr with two R's) who just nailed the part!The story moves just in the right pace and the film goes by without you noticing how the time went...Overall an excellent film that will make your heart come out but at the same time I don't think you could watch it again... in the best possible way..."}, {"rating": "6", "text": "It's a shame this movie drifts into cheesy predictablilty in the final act after it's strong start."}, {"rating": "9", "text": "I have watched this movie three times and every time I have pointed out something new and it has made me think every single time. If there were such thing as a book club for movies, this would be my first pick."}], "recommendations": ["crash", "the_help", "machine_gun_preacher", "captain_fantastic", "freedom_writers", "the_hunt", "just_mercy", "detroit", "ingrid_goes_west", "war_room", "babel", "hidden_figures", "judas_and_the_black_messiah", "the_miseducation_of_cameron_post", "green_book", "blackkklansman", "12_years_a_slave", "a_time_to_kill", "snowden", "the_book_thief", "the_white_tiger", "dark_waters", "the_boy_who_harnessed_the_wind", "silence", "to_the_bone"]}