{
  "id": 2084,
  "title": "The Perks of Being a Wallflower",
  "starring": [
    "Logan Lerman",
    "Emma Watson"
  ],
  "runtime": 103,
  "genre": [
    "Drama"
  ],
  "description": "Pittsburgh, Pennsylvania, 1991. High school freshman Charlie is a wallflower, always watching life from the sidelines, until two senior students, Sam and her stepbrother Patrick, become his mentors, helping him discover the joys of friendship, music and love.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aKCvdFFF5n80P2VdS7d8YBwbCjh.jpg",
  "categories": {
    "plot": 7.56,
    "acting": 7.677966101694915,
    "ending": 7.454545454545454,
    "soundtrack": 7.571428571428571,
    "cinematography": 9.0,
    "familyFriendly": 5.153846153846154,
    "funny": 7.428571428571429,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "If only EVERY screwed-up kid starting high school would connect on the very first weekend with a fun group of quirky, smart hipsters who would welcome him as one of their own! Overall, just too many cliches: The out-of-reach girl who's just a friend, the high school meanies, the brilliantly individualistic gay guy. Nothing you haven't seen before in \"The Wonder Years\" or a Michael Cera movie  or more heavy-duty films like \"Ordinary People.\" However  I found all of the young actors pretty appealing. The lead actor's emotional fragility was palpable and Emma Watson was fine as well."
    },
    {
      "rating": "5",
      "text": "Is this the most overrated film of the decade so far? Yes. I was expecting a witty and dry comedy with insight and warmth, as reviews and the feel of this indie film indicated. I was presented with melodrama, a flat plot, unimaginative teenage cliches and a devastating American accent from Emma Watson. What's all the fuss about?"
    },
    {
      "rating": "4",
      "text": "Though I'll admit it didn't make me feel as unclean or as angry as the book, it still had more than enough scenes that either made me queesie at the awkwardness, or just plain angry at character's stupidity to make it a bad movie."
    },
    {
      "rating": "5",
      "text": "in a few words, this movie like all high-school movies, not bad but not amazing, perfect performance by Logan, if you like high school movies you can watch it."
    },
    {
      "rating": "8",
      "text": "Brilliant film, funny uplifting and a real feel good heart warmer."
    },
    {
      "rating": "10",
      "text": "infinite... that's what this movie will be. A new cult classic! Charlies journey to find himself is a wonderful uplifting struggle against the days of high school i was instantly transported to the days i both hated and loved. Go see it with a good friend"
    },
    {
      "rating": "5",
      "text": "I am going to keep it short and simple and say that this film is beautiful, it's a comfortable length long, you can grow to love the main character Charlie but this film will also make you cry, the sadness and depression Charlie has through his life is so moving but in the end this film is a real heart warmer"
    },
    {
      "rating": "10",
      "text": "Seated at a cafe table for one, a beautiful, young woman, unaccountably lonely, peruses and pines over a comic book, and its handsome male hero. The music video for A-ha's \"Take on Me\" is the ultimate geek fantasy: the blond seems to have a fondness for an illustrated world over the real one, just like any introverted fanboy. The protagonist, as it turns out, a Norwegian protagonist, without explanation, blinks at the Londoner single, as the comic panel loses its static purpose, when the graphic hero reciprocates the customer's **** of the crush object with a crush of his own, and extends an open invitation to the startled reader, who nevertheless, grabs the hand protruding from the ephemeral page, and enters the diegesis of pencil sketches, suddenly made fluid by the alchemic properties of synth-pop music. In 1985, every sad, maladjusted boy wanted to be A-ha frontman Morten Harket, because that's how a wallflower could be heroic, by saving a damsel in distress from rival motorcyclists armed with pipe wrenches from the safety of a debauchery-free bedroom, alone with his Martha Quinn sex fantasies. Wallflowers get older. Some survive their awkward teenage years, and bloom, like Charlie undoubtedly will, in The Perks of Being a Wallflower, while others, such as Jorge, a morbidly shy dishwasher, will not, ever, in Steve Barron's Choking Man, a micro-indie that shows how ostracized children grow up to be ostracized children. Barron, the filmmaker who helmed \"Take on Me\", references his music video past, in a scene where Jorge's enemy, the restaurant manager, who delights in torturing the monosyllabic dishwasher about his aloofness, breaks into a mocking rendition of Kajagoogoo's \"Too Shy\", another early MTV classic. Again, animation is employed, but this time, the optimism, in regard to love, found in \"Take on Me\" has given way to resignation, and finally, vehemence. No wallflower, struggling through his adolescence, would want to co-opt Jorge's constipated ideas about love. His cartoon bunny rabbits won't even rub noses. Jorge doesn't dare, perhaps, since he knows the cute Chinese waitress could never love him back. For sure, the schizophrenia doesn't help, but the real reason that prevents him from competing with Steve for Aimee's heart is his ramshackle appearance, whereas Charlie, despite being saddled with PSTD, earns Sam's love because the unformed freshman more than offsets his emotional problems with an appealing visage. Charlie is less a nerd than unathletic. At the outset, he suffers the indignity of eating alone in the school cafeteria, but you're never worried for him. That's why the budding writer comes off as whiny and disingenuous when he expresses a concern about not making friends to his teacher. He's good-looking.. Soon enough, Sam, and her half-brother Patrick, take Charlie under their wing, and introduces him to people, self-described as castaways on \"the island of misfit toys\", wallflowers all. He finds his tribe. The film, and the Steven Chbosky novel it's based on, thankfully, avoids the shortcut of outfitting the nerd with glasses, like, for instance, Dawn Wiener, the president of the Special People Club, in Welcome to the Dollhouse. Whereas the misfits find each other and stick together at Charlie's school, in the Todd Solondz film, the estranged outcasts at Dawn's junior high estrange themselves from each other, choosing to go it alone rather than garner strength in numbers. Here, the weak pick on the weaker, like when Troy, pinned against his locker by the resident 7th grade bullies, lashes out at Dawn for defending him. \"Leave me alone, Wiener Dog,\" he grumbles, humiliated, doubly, since the girl who saves him is perceived as ugly. But even the consensus school pariah, the plucked to death wallflower, has a cruel streak, evoking Groucho Marx's famous quote: \"I don't care to belong to any club that will have me as a member,\" when Ralphie, a charter, and only member of Dawn's social organization, hears himself being called an \"a**hole\" and a host of other obscenities, as Missy tries to get her older sister to take his phone call. Unlike Charlie, there is no midnight screenings of The Rocky Horror Picture Show\" with friends, or being told by a girl that your first kiss should come from somebody who really loves you. Dawn has to settle for a sad night in her clubhouse with a boy, who in the way of introduction, tells her that he's going to rape her, as they stare at the night sky while Debbie Gibson's \"Lost in Your Eyes\" plays on a cheap tape recorder. Sam kisses Charlie because he has a naif-like animal magnetism. His predecessor, Lucas(from the 1986 film starring Corey Haim), does not, and as a result, Maggie, a cheerleader, rebuffs the younger boy's clumsy attempt at romance, by turning her lips away from his. When you're a wallflower that often gets confused for a weed, there are no perks."
    },
    {
      "rating": "10",
      "text": "I love this movie, I honestly cannot find anything I hate about it.\r I can honestly admit, I'm a guy and I cried during this movie. PLEASE EVERYONE GO WATCH THIS IT'S PERFECT 10/10"
    },
    {
      "rating": "10",
      "text": "Great movie!!!!!!!  Delicate pure and modern!\rAwesome soundtrack!!! And Charlie such a sweetheart!!\rShows the anxiety of an adolescent with sensibility\rA new cult movie!!!"
    },
    {
      "rating": "9",
      "text": "It's often quite hilarious while also hard-hitting, heartfelt, visually stunning, and completely engaging - the most honest, genuine John Hughes movie that John Hughes never made, seemingly pieced together (almost perfectly) with hot tips from big names in the indie spotlight."
    },
    {
      "rating": "8",
      "text": "“The Perks of Being a Wallflower” is a film about living life and not letting fear bind you. There also so many more underlining themes and messages within the film, such as lying, being more involved, loyalty, and so much more. It also deals with the complications of high school and the needing to fit in. It felt a lot of these themes are handled well, but the film tends to gloss over some of it. While not a big problem, it would just allow more depth to the story.\r The writing in the film is fairly strong. Like I said it handles a lot of themes, but again the film tends to gloss over some tiny things that could have made it better. For example, early on in the film the character talks about a friend he recently lost, which causes him to become so introverted, but we don’t get any real back story. On the other hand the three main characters are fairly well developed and they truly make the film. The directing is good and I like the ambiance that is created. We get a good sense of high school and the life of a teenager. A really great thing the director manages to accomplish is making us feel what the main character is feeling. When he’s shy, we’re shy, when he’s awkward, we feel awkward, and when he’s happy, we feel his happiness.\r The characters and acting are what makes this movie so good. Logan Lerman as Charlie is the awkward teenager with a troubled past. Logan does a good job of capturing the insecurities the character feels, He has little twitches and subtle body language that speaks volumes about the character. I really like how we see this character gradually changes and opens up. Emma Watson as Sam is the girl with the bad rep that’s trying to reinvent herself. She’s kind of loud at first, but when we pull away her facade we get a girl that really cares and needs some guidance. Ezra Miller as Patrick is the loud gay friend at least on the surface. As we pull back his carefree attitude we see just how much trouble he has as well. The thing about the characters in this movie is that they all have more depth to them. We learn more about them and fall in love with them.\r Overall “The Perks of Being a Wallflower,” is a pretty good film with a positive message. The writing is fairly strong, but I just wish that they would have gone more in depth with certain issues. However, the characters are likable and well performed. I give it a very high 4/5, good story with strong characters, but it just needed to go deeper into its themes."
    },
    {
      "rating": "10",
      "text": "Charlie is a shy freshman who has just started High School. He has never felt watched to anyone besides his best friend who recently committed suicide and his aunt who was killed in a road traffic collision on his 7th birthday. When he befriends two seniors though his world is turned upside down, he finally feels accepted and as if he has friends. He gets a new best friend in the form of Patrck a homosexual class clown, and his step-sister Sam who he falls in love with. However due to complications in all of their lives things start to spiral rapidly downhill for all three of them they realise they must confront their demons that they thought they had buried and make themselves better people from it.\rThe Perks of Being A Wallflower is the best feel good film I have ever seen, it deals with a huge amount of social and moral issues perfectly and knits them together with a great story, believable characters and a well picked cast. Wallflower is one of 2012's must see films"
    },
    {
      "rating": "7",
      "text": "This is a broken back film--its first hour plus is a typical high school story about an in group of jocks and cheerleader types versus the sensitive or flamboyantly odd rebels; its last forty minutes is a case history about a severely disturbed young man and the beginnings of his cure.    The main reason to see it is a young actor named Logan Lerman who gives an astounding performance.  He has the combination of vulnerability, intelligence, and tensile strength that Toby Maguire has, and he makes the movie."
    },
    {
      "rating": "9",
      "text": "God, I loved this film. Rarely do I watch a film and be left sitting there with chills and nothing but a stupid smile as I think of how this one film re-affirmed my love for film and showed me truly how powerful a medium it can be at times. Brilliantly acted by Logan Lerman, Emma Watson, and Ezra Miller, The Perks of Being a Wallflower is a marvelous look at those of us who are quiet and lonely. While I do not fully identify with Lerman's character, certainly a good portion of his life resembled mine and for that, it completely touched my heart and struck me to my core. However, even the parts I did not identify with did this. As a whole, it is truly just a powerful and moving film that is leaving me speechless right now. Brilliantly written, directed, and acted, the only problem I can truly think of for this one that keeps it from being a perfect film for me is that as honest a portrayal of life for wallflowers as it is, it can become a little...idealistic and, as such, unrealistic. Beyond that minor complaint though, this is an amazing coming age drama that should touch your heart and if it does not, I do not know what is wrong with you."
    },
    {
      "rating": "9",
      "text": "This film is so beautiful. It's perceptibly different from the novel, but I think it's a perfect adaption  probably because of the fact that the author of the TPOBAW novel, Stephen Chbosky, did write the screenplay to the movie as well and even directed it. And he was successful. The cast is so right and the dialogues are fantastic. There are so many magnificent things about this movie, i.e. the awesome soundtrack or the beautiful pictures of the night, but my tiny issue with this film is the same that I had with the novel: the ending does seem a bit out of place. Though I have to say that the ending was way better than in the novel mainly because it just appears better with flashbacks and this wonderful score in the background. It's one excellent movie and not only for wallflowers."
    },
    {
      "rating": "8",
      "text": "Going into this film I was a little hesitant by some people calling it \"The Breakfast Club for a new generation\". Not that I have a problem with that film, it's a classic, I just can't stand it when people try to compare new films to classics just because of a few similarities. But after seeing Perks I felt that both films have a lot in common. I think it's very easy to connect with the main character, especially if you weren't one of the \"cool\" kids in high school. You really feel for this guy and everything he's going through. It definitely helps that the author of the book is also the director of this film. Perks is worth checking out."
    },
    {
      "rating": "9",
      "text": "This movie is just perfect. The music, the acting, the script, the plot, the way they decided to make it, just everything. Just in a few parts you can feel it a little slow, but in the end everything worth it. Emma and Logan have chemestry and that is seen. But by far, the one who just made it absolutely perfect, was Ezra Miller. He showed us he can make us hate him in \"We Need To Talk About Kevin\", but in this movie you just cannot love him."
    },
    {
      "rating": "5",
      "text": "Although the characters are well drawn, and evident care went into the screenplay, as well as the whole production, I was really irked by this movie.  I did feel sympathy for the main character, but the movie's politics and ideals are seriously muddled.  It's a very left winged movie, supporting homosexual relationships, casual drug use, and teenage sex.  I'm unsure of whether or not it's acceptable for a dating couple to engage in breast fondling, but just so you know, it's in here too.  Yes, bullying is wrong, but that does not mean that teenage boys having sex with each other is condonable.  It's not shown, but it is discussed and supported in the movie.  Sometimes I feel like I'm the last conservative on Earth, but I'm not changing my stance on these issues, even if a movie is engaging and emotionally affecting."
    },
    {
      "rating": "10",
      "text": "The movie works hand in hand with the novel; as the novel is written in first person accounts in letter format, it lacks in dialogue. This movie brilliantly directed by the author gets to give you those moments and let you live them first hand, whilst still keeping the persona's of the characters true. Brilliant film/direction/cast/soundtrack. all we need now is a directors cut to live through the entire novel."
    },
    {
      "rating": "10",
      "text": "This is my favorite movie. It shows the progression of a kid in high school who goes from having no friends and going unnoticed by everyone to someone who has great friends that he enjoys and cares about. My favorite character was Charlie because of how much he reminded me of me."
    },
    {
      "rating": "10",
      "text": "This film blew me away.  From the great script to the outstanding performances, this film is one of the best of 2012.  The three leads bring out a very realistic sense of teenage problems (Ezra Miller being my favorite).  It's also good to see Paul Rudd in a different kind of role as the teacher."
    },
    {
      "rating": "9",
      "text": "You feel the love and joy and emotion that Charlie goes through during the film. Fabulous acting and was very relatable to my own life and struggles."
    },
    {
      "rating": "3",
      "text": "This movie was beautiful.\rIt brought tears to my eyes.\rAnd if you know me,\rthis is very hard to do.\rRating: 10/10\rIf you want to ask me any questions about this movie,\rOr any movie, please e-mail me at.....\rguyrunje@hotmail.com"
    },
    {
      "rating": "4",
      "text": "This movie's Beautiful.\rIt brought Tears to my eyes.\rAnd if you know me,\rThat is very hard to do.\rRating: 10/10\rIf you would like to contact me,\rAnd ask me about this movie\rOr any other movie e-mail me at.....\rguyrunje12@gmail.com"
    },
    {
      "rating": "8",
      "text": "The first time I watched it, I'm still confused. Then I read the book, but some parts still kept me asking why. Then I watched it again last night, I finally found the answers. But still I can't forget that Hermione expressions in Emma's face. It's not all her fault, I know. And clearly she's not bad. It's just that she's not fully Sam. Sorry... But Ezra and Logan are great."
    },
    {
      "rating": "1",
      "text": "People acting weird and spacy when they're high on weed is one of the biggest cliches of all time.  Perks pretty much revisits every single teen cliche and painfully offers no new perspective.  I guess I just came here to warn anyone thinking about wasting money on this stinkbomb that it will make your skull explode with boredom if you've ever seen or done anything ever. Gave it a one because I'm glad the gay kid from This Boy's Life is getting work."
    },
    {
      "rating": "1",
      "text": "I am sorry I disliked this movie so much. I liked the music and the first 10 minutes are quite promising. But there's never anything at stake and the characters all come across as shallow cliches of characters we've seen a million times before.\r Everything is underdeveloped and I especially disliked the scene where he was supposed to be high and saying interesting things. They weren;t interesting and if that kid has ever been high in his life prior to this scene he did NOT do a good job calling from experience."
    },
    {
      "rating": "3",
      "text": "The issue with \"Perks\" is that it represents the same tired argument that this generation (probably *my* generation) trots out with ever-increasing arrogance.  The system is wrong; and these \"free\" individuals are fighting, striving against it to liberate the world from conformity and materialism.  Never mind that all these kids live above-average white privileged lives, EXACTLY the kind of thing postmodernism would have targeted before complaining about how capitalism and the \"Top 40\" ruined music.  And the victories at the end of the movie don't redeem its narcissistic pessimism and misunderstood, \"coming of age\" angst.  It would be notable for its terribleness were it not so derivative dullness."
    },
    {
      "rating": "9",
      "text": "The trailer makes this movie look like a quirky and light teen flick a la Juno, but it's a serious movie that deals with important issues elegantly.  The writer/director introduced the film to my theater, which, to my surprise, included about 50 younger people who had read his book. I had no idea it was so popular.  I can see this movie having a similar appeal to teenagers to today that a film like Dead Poets Society had for my generation.  Emma Watson and Ezra Miller are outstanding, and the supporting actors including Melanie Lynskey and Paul Rudd are perfectly cast. It's one of the better movies I've seen this year."
    },
    {
      "rating": "9",
      "text": "The Perks of Being a Wallflower is a great coming of age film. Those that have read the book will not be disappointed (I wasn't and I've read this book more than I can count.) Stephen Chbosky makes obvious cuts where needed to make the film flow more consistently but still hits all the major plot points within the book. Emma Watson and Logan Lerman do a great job portraying these characters. Logan Lerman blew me away in his best performance yet. As many others have said, this film will be a cult classic for those who haven't read the book Those who have will be glad they saw the film to really appreciate Chbosky's story in all forms of art."
    },
    {
      "rating": "9",
      "text": "Wow this movie was amazing! It captures what's its like to be a freshman in high school. About trying to fit in and enjoy life! Charlie(main character) is a freshman that had a rough childhood and recently his best friend kills himself. He's lonely. Then he meets Sam & Patrick(Sam's step brother) are 2 seniors that take him under their wing and accept him for who he is. Charlie eventually falls for Sam which is his first crush. The movie shows how their relationship unfolds throughout the film. This movie isn't your typical high school movie. Anyone can relate to this movie which makes it so great. Go see it! You definitely won't be disappointed."
    },
    {
      "rating": "8",
      "text": "Surprising amount of depth for a high school drama. Has the feel of not being watered down in any sense (the author being the director has something to do with that). It goes without saying that the cast is outstanding."
    },
    {
      "rating": "9",
      "text": "For the purpose of reviewing this rather serious and at times quite sad movie, I decided to write about"
    },
    {
      "rating": "10",
      "text": "I can not put into words, is such a great feeling that any compliment he shall not be entitled to all that it means, is so sensitive, innocent and profound is a perfect movie."
    },
    {
      "rating": "8",
      "text": "a heartwarming, full of emotion classic film. every time I see Logan Lerman in the big screen, he always puts his charm in the right time. it lives up the greatness of the book. Stephen Chbosky did a fantastic job."
    },
    {
      "rating": "9",
      "text": "Dads will find this boring and moms will find this touching. But only teenagers can completely understand this film. There's a bit of confusion in some points but this film is like a rainbow, it has all the colours of a teenager's life. It's funny, moving, dramatic.. But first of all is real, it talks about real things that can happen to everyone. Outstanding performances by some actors, too. And good music!"
    },
    {
      "rating": "10",
      "text": "The Perks of being a Wallflower is a masterpiece.  This movie brilliantly directed by the author of the original novel but it doesn't stop short of giving you the moments that you loved from the book and allowing you to live them yourself,  whilst still keeping the persona's of the characters true. Their stories never felt cheesy. Just real, touching and moving. The Perks of Being a Wallflower is best if you can actually relate to the lead character or have experienced the struggles of being an adolescent. When it's not depressing, the film goes to those blissful moments that make us remember the good times in high school. Overall, The Perks is an amazing film. It's a film adaptation that replaces the cliches with some painful realities of adolescence and high school and simply lets you understand the whole point of it. In the end, it's quite a remarkable film."
    },
    {
      "rating": "7",
      "text": "It's not perfect (neither was the book for that matter), but Stephen Chbosky does an admirable job of translating his novel to the big screen.  Much of the credit goes to the young cast, particularly Logan Lerman as Charlie, for deftly capturing the joy, anxiety and sexual confusion of adolescence in a way that few films even try to."
    },
    {
      "rating": "9",
      "text": "Perks rises above your average teen coming-of-age flick by delivering us grown-up drama and well timed, heartfelt humor. The characters are so unique and fun to watch that we can't help but fall in love with them."
    },
    {
      "rating": "0",
      "text": "The problem with this movie is that there isn't a single likeable character throughout the whole of it. The entire movie is a cringe-fest, with quotes like \"don't you just love old music\" and \"everything sounds better on vinyl\" at every given opportunity, as if the writers were somehow trying to relate to the sort of hipsters that plaster their walls with The Beatles posters and think they're awesome for being such \"individuals.\" Not even Emma Watson could make you want to watch this, as she plays an obnoxious and totally unrealistic free spirit movie cliche. Essentially, the movie is just an endless reel of pretend quirkyness, lackluster narration, and an extremely slow developing plot. The only people who would like this movie, are the sort of people that wear black horn-rimmed glasses and pretend the characters in this movie are oh-so relateable to their quirky and \"unique\" nature. It's awful, and if you thought Emma Watson was annoying in the trailer when she stands up in the back of that car, then you'll hate the rest of the characters. Oh, and Paul Rudd is only in about 3 or 4 scenes, so don't let his casting be an influence in your decision to see this terrible movie."
    },
    {
      "rating": "0",
      "text": "I was looking for a teenage movie I could relate to. How hard is it to make a movie about teenagers who anyone can relate to? Not that hard as almost everyone in high school walks down some path after joining a click which there are a limited number of.\rInstead of that what I saw was a **** awful movie about a teenage ... wisdom. How that poor teenager who goes to an elite school and has his parents pamper him yet is so deep and troubled even thought he has no idea what hardship is. It tries to sell the idea that being a teenager is some kind of insurmountable challenge.... the **** It also stabs at gay issue which is so ever high on every schools agenda. Drugs make people more interesting apparently and all teenagers listen to vinyl ...  Also there is some sick and wired love going on that is expressed I kid you not in form of letters to a girl who is right **** next to him. If the character portrayed would be an actual person he should be locked up in mental institution."
    },
    {
      "rating": "7",
      "text": "A lovely picture about coming of age, with great performances from the protagonists (watch out for Ezra miller who continues to impress after \"We need to talk about Kevin\") and great music (The Smiths, Bowie, etc). What more could one ask?"
    },
    {
      "rating": "6",
      "text": "Don’t get me wrong, I liked  The Perks of Being a Wallflower”, but with all the recommendations and high praise this movie was getting, I thought I would like it more.\rFirstly, most of the characters feel very one dimensional and flat, and are just there for the sake of being there. Would it have hurt for the moviemakers to add more depth to Charlie's mother or maybe his sister?\rSecondly, the movie has a typical teen movie plot. You know the plot were the main character is this unpopular kid, but at one point he gains new friends, but later loses them and still gets back with them before the end, happy and smiling? Yeah, it's that plot again. To me this plot seemed very predicatable. Also, the big climax at the end felt really underwhelming and watered down because of all the teen drama.\rLike I said at the start of this “review”, I did like the movie. I liked the main character  Charlie. He was easy to relate to and he had an interesting past. Another thing I liked was Patrick; he seemed like a cheerful and likeable person despite having more of a tragic agenda later on. Also, the movie's use of 90s music really helped to set the mood and was fun to listen to.\rIn the end “Perks of Being a Wallflower” isn’t bad movie, but the way it’s made might not be acceptable for some people, myself included."
    },
    {
      "rating": "8",
      "text": "There is one word to describe this film, and it is the very same word I would use to describe the book upon which it was based  heartwarming. It was a stroke of genius to allow author Stephen Chbosky to adapt his own novel to the big screen, and it well and truly pays off. Logan Lerman is a near-perfect Charlie, finely balancing the character's naivety with his unique matter-of-fact attitude to life. If there was any doubt about Emma Watson as a serious actor it has briskly been swept under the dusty carpets of Hogwarts, as I instantly forgot she had ever appeared as geeky Hermione Granger in the Harry Potter series. Ezra Miller is superb as Patrick, adding depth to the character that I hadn't imagined whilst reading the book. This nostalgic charmer is a must-see for any fans of coming-of-age tales. Warning: You may even shed a tear or two."
    },
    {
      "rating": "8",
      "text": "A really affecting movie with a fine soundtrack. My wife and I could really relate to the isolation in HS so many years ago and the protection afforded by a small group of friends.\rHowever, and this is what makes it an 8 and not more, the narrow focus of being crippled or closed off due to sexual abuse doesn't do service to the rest of us from \"normally\" dysfunctional families or the bullying in grade school that can push an otherwise open person into a solitary corner for some time and there is the seeming reality that we are born with certain personality characteristics...as in shyness has been shown to have a genetic component..."
    },
    {
      "rating": "9",
      "text": "I got dragged along to this film by some friends and was all set to hate it, and it was a genuine surprise to me that it was actually really enjoyable. The story is great, and gets the viewer absorbed early on - although perhaps the ending is a bit too long. The characters are well-created and brilliantly acted by the young cast. There are some moments of real humour as well as tension. Definitely worth seeing."
    },
    {
      "rating": "9",
      "text": "Really, this is a great film; it revolves around a high school freshman who has trouble gaining friends, due to his introverted nature. When he makes an effort to try and change this, he meets our 2 other main characters; classy extroverts, who find out about his troubles, and take it upon themselves to improve his life.\r The movie explores the nature of psychology, and social structures, and unless you're bigoted or can't enjoy anything, the characters that are meant to be likeable, are very much so. Better yet, the movie even has you on your toes at least once.\r Not movie of the year or anything of that sort, but still a very good film, and something that is quite enjoyable to watch."
    },
    {
      "rating": "9",
      "text": "I would call this a modern day Breakfast Club kind of movie. I thought the plot was interesting and the acting was solid. The bad stuff \"drug use, etc...\" was not over the top. I think you will enjoy this one."
    },
    {
      "rating": "10",
      "text": "This wasn't just a coming-of-age film in regards to the story, but also for the actors and actresses involved in what could be one of the best films of the year.\rCharlie (Logan Lerman) is narrating the film as he enters high school, but he finds difficulty making new friends, only managing to speak friendly to his English teacher, Mr Anderson (Paul Rudd).\rHe soon builds the confidence to speak to Patrick (Ezra Miller), an eccentric but likeable senior, at this point Charlie is introduced to Patrick's stepsister, Sam (Emma Watson), he is immediately attracted to and begins to spend more time with the two as they embark on an adventure of self-discovery and the hardship of growing up.\rThe film moves at a feel-good pace that is hard to find flaw with, the characters are immediately likeable, even though they hold onto to personal woes and secrets, but when they merge as one, the film truly comes alive, with each character and talent playing them stepping out and being free, Miller is no longer a psychotic bow and arrow wielder from We Need to Talk About Kevin, Lerman no longer a demigod of Percy Jackson fame, nor is Watson, who does a wonderful turn as the beautiful Sam, leaving her Harry Potter days long behind her, each actor signifying their intention to move on.\rWallflower is certainly not without its drama though, and it does play out a little differently than a typical adolescent movie, but the film is carefully written so that it doesn't follow the same path involving drugs, sex and school, but subtly hints at all of the above, but at the same time creating an engaging story as to how these characters grow to rely on each other and their necessity to be different.\rThis attempt at difference involves a catchy and nostalgic soundtrack that will have you screaming the tunes as you watch the film. Where the film truly succeeds is its emotional journey of character development and personal achievements. The powerful performances of the three leads will have you engrossed from start to finish, they truly embrace their roles and let themselves enjoy the moment, and with an emotional climax that could just bring a tear to your eye, it certainly is an unexpected yet properly realistic and grounded ending that is heartfelt and touching.\rA feel-good and emotionally romantic journey of self-discovery, with plenty of drama and laughs that add up to an extremely enjoyable, well-written and fantastically acted film."
    }
  ]
}