{"id": 4530, "title": "The Break-Up", "starring": ["Jennifer Aniston", "Vince Vaughn"], "runtime": 106, "genre": ["Romance", "Comedy"], "description": "Pushed to the breaking-up point after their latest 'why can't you do this one little thing for me?' argument, Brooke calls it quits with her boyfriend Gary. What follows is a hilarious series of remedies, war tactics, overtures and undermining tricks – all encouraged by the former couple's friends and confidantes …and the occasional total stranger! When neither ex is willing to move out of their shared apartment, the only solution is to continue living as hostile roommates until one of them reaches breaking point.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/84AuLNXc9sEMXUJ3xAvHhpM3J8u.jpg", "categories": {"plot": 6.454545454545454, "acting": 5.521739130434782, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.081081081081081, "action": 8.0}, "reviews": [{"rating": "5", "text": "Although a half decent performance from Jennifer Aniston, the film is a complete waste of supposedly good actors who try to not be cliche by having an opposite of a romantic comedy and then it goes cliche, and lacks in laughs and good performances. I give this movie 47%."}, {"rating": "1", "text": "Take a 300 pound Vaughn, mix in a washed up actress whose best role was starring in Leprechaun and what do you get? Bad movie!"}, {"rating": "10", "text": "instant american comedy classic..absolutley terrific by far the best movie of the summer. well acted, funny, sweet, and it breaks the old hollywood ending...very well done and very smart...a instant comedy classic..go vaughn."}, {"rating": "10", "text": "all of it and more...its all you need and more. how beautiful is jennifer aniston, how funny is vince vaughn and how perfect is the funny at times and sad at times script by far the best movie of the summer. well acted, funny, sweet, and it breaks the old hollywood ending...very well done and very smart...a instant comedy classic"}, {"rating": "10", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\"\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\""}, {"rating": "4", "text": "To slightly amend the immortal words of Neil Sedaka, breaking up may be hard to do, but watching people break up isn't much of a picnic either...especially when both parties involved are as smug, self-centered and unlikable as they are in this mystifying box office hit, whose success can only be attributed to the by-now speedily waning goodwill generated by leads Vince Vaughn and Jennifer Aniston. Superficially reminiscent of 1989's War of the Roses, and to a lesser degree the 1967 Debbie Reynolds-Dick Van Dyke pic Divorce, American Style, but without either film's satiric precision, focus or gutsiness, The Break Up deals with a seriously mismatched yuppie couple playing psychological games with one another because one or both them have to vacate their Ponderosa-sized loft. Despite the time limit imposed on them by their Realtor, one of the film's failings is its absolute lack of ticking-clock suspense or comic tension, which is just as well because had these two stayed together much longer, it almost surely would've resulted in a job for the homicide division. The \"Telly Savalas\" bit and the a capella song sequence featured in the movie's trailers come off as less egregious than they otherwise would be because the whole movie is a haphazardly stacked series of rambling, pointless sequences arranged with a surprising lack of clarity by director Peyton Reed...and given how many nifty, original touches he brought to the cheerleader comedy Bring It On and the stylish, underrated Doris Day/ Rock Hudson parody Down With Love, the disappointment is truly painful. (His one good invention, if it was his idea, in The Break Up is the use of various splices of John Lennon's \"Jealous Guy\" as background musical stings.) And with the exceptions of Judy Davis and Jon Favreau, who at least has a pertinent third-act speech that cuts to the heart of Vaughn's character, I can't think of another recent movie that so thoroughly squanders such an interesting cast; I mean, how can the same movie come up with the brilliant notion of casting Ann-Margret as Aniston's mom and then give her virtually nothing to say or do? As far as the much-paparazzi'd leads are concerned, Vaughn's bloated, overgrown infant frat boy persona worked well for him in Wedding Crashers and Swingers but very little else, and it certainly doesn't here. (His best role and performance ever appeared in 1998's uncharacteristic, uncompromising and heartbreaking drug-smuggling drama Return to Paradise, but since that one didn't even crack the box-office Top 10, I doubt that we'll ever be seeing Vaughn challenge himself by doing the likes of it again.) And even though Aniston's character is right about 97% of the time (and yes, that includes the matter of the twelve lemons, too) she's so snooty and humorless that she all but negates the strength of her arguments. (She and that prig in the plaid shorts that she's seen with in the film's opening few minutes are true soulmates!) Aniston is a tremendously likable actress and most people's favorite Friend; I think just about all of America is rooting for her personal happiness and personal success, but this is by far her most mechanical and by-the-numbers performance yet...only in the lemon scene and her tear-stained moment of truth near the end does Aniston really catch fire. Perhaps instead of trying so hard to grasp the big brass ring with questionable projects like this and Rumor Has It, Aniston needs to keep doing more of the offbeat, independent material--like The Good Girl and the current Friends With Money--that really allows her to explore unusual avenues of her considerable talent and charm. THEN, after solidly establishing her indie cred, she can slowly build her commercial base. Hey, it worked for Reese Witherspoon, didn't it?"}, {"rating": "9", "text": "NOT romantic but a funny and realistic movie, highly entertaining and extremely believable story of a breakup. Everything Vaughn says is clever, entertaining funny and believable. The movie is fairly sophisticated and many complicated scenes work well. The producers of the trailer should never be hired again for misrepresenting this well done movie as a romantic comedy. Its a very funny and entertaining unromantic comedy."}, {"rating": "5", "text": "Worst ending ever . . .like it was an afterthought, or a poor set up for a sequel.... Other than that, the characters were shallow and inconsistent and Jennifer was acting just like Rachel; in other words, the way she always acts. This movie had a couple of funny moments, but overall a big letdown."}, {"rating": "9", "text": "The movie was a great comical approach to the problems we all face in our own relationships. I think Vince Vaugn and Jennifer Aniston had great chemistry and the movie had a lot of laughs and emotion. I don't understand why \"professional\" critics hated the movie so much because it really is worth seeing."}, {"rating": "8", "text": "Critics completely miss the boat."}, {"rating": "0", "text": "This movie is garbage. Very dissappointing"}, {"rating": "0", "text": "The movie is awful. About all the jokes it has are shown in the previews. The rest of the movie is just filled with crap."}, {"rating": "3", "text": "The only reason people went to see it was because of all the gossip press between Mr. Vaughn and Jennifer Anniston. However the movie was slow and boring and the acting horrible. I had to walk out before it was finished."}, {"rating": "10", "text": "Great Film...love the chemistry between aniston and vaughn."}, {"rating": "10", "text": "by far the best movie of the summer. well acted, funny, sweet, and it breaks the old hollywood ending...very well done and very smart...a instant comedy classicby far the best movie of the summer. well acted, funny, sweet, and it breaks the old hollywood ending...very well done and very smart...a instant comedy classic."}, {"rating": "3", "text": "Despite its completely unconvincing nature, it was also quite unoriginal and painful to watch. The ending was some small relief, in that it did not resolve anything."}, {"rating": "8", "text": "I would definitely give this movie a solid 8. Not the best, but definitely not among the worst. Vince Vaughan is absolutely hilarious, as always. And Jennifer Aniston is perfect. The jokes were good, but not over the top, and the plot was solid. Excellent script and lines, and Jon Favreau was a fabulous addition as a supporting character. The laughs were all genuine throughout the theater, and I can't wait for the sequel. Assuming Jen and Vince don't break up for real in the meantime and refuse to work together..."}, {"rating": "9", "text": "There's some great Vince Vaughn moments in the film...where you find yourself laughing along with the scenes...there's some tough moments too - but that's what makes the film worth seeing..."}, {"rating": "10", "text": "Ubsolutely the best movie in a longest time. Must see for men of all ages. Very true and sad. Great ending - real life."}, {"rating": "7", "text": "Not bad at all, actually very funny dark alterna romance movie. Vaughn is aces as usual and the movie really rests on his shoulders as Aniston really is as vacant as usual. Vaughn fans won't be disappointed guaranteed. Also Judy Davis and Justin Long are great as Aniston's boss and coworker who help with her scenes when Vaughn is gone. Also a side note Favereau and Vaughn look HORRIBLE, wow. I couldn't decide who was harder on the eyes them or Anistons strange overly tanned skeleton look."}, {"rating": "4", "text": "A movie that just seemed to miss the boat every step of the way. It can be defined by everything that's not believeable. [***SPOILERS***] For most of movie it's not really believeable that these 2 people would ever have gotten together in the first place, then all of a sudden, late in movie, it becomes not really believeable (and contrived) that they wouldn't be able to work out their problems. Vaughn's such a self-asborbed jerk for most of movie, that when he shows up as someone more sympathetic late in the film, it's not really believeable he's the same character we saw up to then. And it's not like ealier in film he was a flawed but likable guy (as he was, for instance, in \"The wedding crashers\") Here, you just don't like him, or care about him. And it's not really believeable that Anniston would have the bizzare idea, that the way to improved her relationship with Vaughn, is to treat him like garbage. While this is something that might have worked in a more screwballish kind of comedy, here it just seems weird. In fact, movie did start off like it intended to be more screwballish, but somewhere along the line it changed its mind, and took itself more seriously. It seems alot of people here don't think much of Jennifer Anniston. I think she is a good actress, and has genuine screen charisma, but like quite a few actresses in Hollywood today, she has lousy judgement when it comes to picking her films."}, {"rating": "7", "text": "We saw this movie despite the critics' reviews (and because Poseidon Adventure would truly be an act of desperation) only to find the movie pretty entertaining. Certainly better than what was promised."}, {"rating": "10", "text": "Excellent film I love it."}, {"rating": "5", "text": "Needed more bite and insight and less Pepsi product placements. It could have been a fine relationship dramedy if it wasn't done in by it inability to actually say or show anything actually meaningful. i.e.: Men can be selfish juvinile jerks, women refuse to say what they mean. Stop the presses! (At least they all love Pepsi...)"}, {"rating": "8", "text": "A solid movie. Very funny, with lots of great characters including Vincent D'onofrio, Justin Long, and especially Judy Davis. There were no moments that I felt annoyed by the characters or their so-called lack of chemistry - I felt it was very well executed. And like some of the other reviewers, I did not feel that the ending was the set up for a sequel, more of a \"you believe what you want\" kind of ending like The Graduate. I would recommend to anyone, especially anyone who has ever found Vince Vaughn funny."}, {"rating": "8", "text": "Loved it! Lauged the whole time. It was definitely better than I expected."}, {"rating": "4", "text": "It"}, {"rating": "2", "text": "Totally boring movie. such a waste of time and money. i'll never watch any aniston movies again. I'll always end up disappointed."}, {"rating": "1", "text": "Everyone loves Jen. And all she keeps doing is regurgitating one awful movie after another. I'm sorry to say that this is as bad as the rest of the crapola she has made. And they had to change the ending as it was even worse before they did?"}, {"rating": "0", "text": "What utter irritating drivel. I can't believe crap like this is made."}, {"rating": "8", "text": "Wow, did the critics ever get this one wrong. It was a wonderful movie filled with laughs, tender moments and raw emotion. The end brought the whole story together. This movie is cathargic in a way, because it reminds us that everyone goes through break ups. Must see."}, {"rating": "2", "text": "This movie was awful its felt like i was sitting there for three hours just anticipating the end. the first movie where i was happy that i had to pee during just so i had an excuse to leave for a few minutes."}, {"rating": "1", "text": "Yuk as I think I want to puke. There were a few funny moments but overall this was one awful movie. As for the chemistry between Jen and Vince, where was it?"}, {"rating": "8", "text": "Critic's have ego's and they are really showing their faults when they review this film. \r[***SPOILERS***] So what if the couple don't ride off together in your typical hollywood ending! I'm sick of critics saying the ending was re-shot and don't work."}, {"rating": "8", "text": "I thought this was a very interesting movie with moments of truth about relationships. It was funny at times, but it wasn't a comedy. I really liked it."}, {"rating": "8", "text": "Aniston is a very good actress.... better than I expected."}, {"rating": "5", "text": "I had really low expectations when I went. It was my girlfriend who wanted to go and I was expecting a \"chick flick\". I was a little surprised and it exceeded my low expectations. I still dosed off once, but it wasn't bad."}, {"rating": "10", "text": "by far the best movie of the summer. well acted, funny, sweet, and it breaks the old hollywood ending...very well done and very smart...a instant comedy classic."}, {"rating": "6", "text": "Good film but it doesn't get the balance between comedy and drama right. Personally, I think it worked better as a drama. Plus, why is Brooke so desperate to get back with Gary when he is such an asshole? Anyway, great acting from Vaugh and Aniston (especially Aniston) and still a good film despite its flaws."}, {"rating": "2", "text": "I typically love Vince's wit and command of the English language, but this movie was painfully dull. The outakes were funnier than the movie. The onlyredeeming factor, which allowed me to give this movie any points at all, was that it was shot in Chicago."}, {"rating": "9", "text": "I've recently seen hillarious recut trailers for \"movies\" such as \"Brokeback to the Future\" and The Shining Redux, called simply, \"Shining\". (If you haven't seen these yet, check them out). They're makers prove a point, which is that movie footage can be manipulated to create trailers that seems to belong to completely different movies. I think The Break-Up suffered from a little bit of this. After viewing the trailer, most people who went to see it were likely expecting a light, breezy romantic comedy (ugh) and I'm sure were greatly disappointed. This movie is much more About Last Night (minus the almost pornographic elements) than it is How to Lose a Guy in Ten Days. As such, it is a wonderfully realistic portrayal of a relationship gone sour. If you like to see real life reflected on the big screen, go see this. If you're looking for escape, look elsewhere."}, {"rating": "8", "text": "Sure, it's not going to win any Oscars, and it doesn't make you think \"wow, that's the funniest movie I've ever seen\". However, it's a fun movie. As with most actors and actresses, some views may like them while others do not. For me, I'm a fan of both Aniston and Vaugn, and I enjoyed them both in this movie. Admittently, some of the fight scenes go a little long (you can only sit still during a relationship fight scene for so long before getting uncomfortable), but there are enough funny bits to make it effective. As others have said, this movie is about a breakup, and the actors were convincing enough to make me believe their emotional investment and hardship. In the end, I left the movie threater feeling entertained. At least it's a break from the typical romantic comedy genre..."}, {"rating": "7", "text": "When Vince Vaughn is being his usual fast-talking sardonic self, The Break Up looks promising, unfortunately, that's only about the first 15 minutes and then it becomes a Who's Afraid of Virginia Woolf? spin-off except by this time we're already unsympathetic for both of them and just want it to end, it doesn't matter how, just end already. The supporting cast, especially Judy Davis and Vincent D'Onofrio, shine in their all to brief roles. Vince Vaughn's \"Idea\" for the story must have been a Great Indie script but the anti-romantic dramedy has been turned into a big Hollywood anti-entertaining film, and would somebody please tell Jennifer Anniston that there are roles out there that are not \"A cute Rachel type woman.\""}, {"rating": "1", "text": "Horrible... There was absolutely nothing funny about this movie... All the people do is yell at each other the ENTIRE movie..."}, {"rating": "5", "text": "Went to this one with low expectations and was pleastly surprised by the strong humor. Though Vaughn and Anniston seem like a mismatch before, during, and after (the ghost of Pitt maybe?), the humor works and you will definitely be entertained. It's a shame that they tacked on a ridiculously amateur and incredibly forced ending. I would suggest you leave when you think it is over, but then you'd miss the delightful Tone Rangers rendition of \"Rainbow Connection.\" Overall? Not overwhelmed, not underwhelmed, just whelmed."}, {"rating": "6", "text": "Better than I had expected from the trailers. Some clever humor. Although I agree with some of the critics that it was tiring to listen to people argue for 2 hours and I found myself looking at my watch frequently."}, {"rating": "7", "text": "Overall it was a really interesting movie, which of course had it's lows, but overall was worth seeing. Vince Vaughn and Jennifer Aniston deliver amazingingly well done acting that was so perfect...unfortunatley the directing does tend to drag out the wrong parts too long. If it had moved a little more seamlessly it would have been a great hit, but it's still really good and has it's value none-the-less. It's a little weird to see Vince Vaughn as the obvious antagonist, even though he's usually good at showing those moments we love to laugh at but don't want to be like in many movies. They really played on the strengths of the actors in that, and like I said, the timing is the only thing throwing it off. It would have come together more if they could have had just a slightly more satisfying ending too, as compared to the \"there's hope\" ending. I guess that once again comes up to timing on the director's part."}, {"rating": "8", "text": "I thought this movie was actually really good. I'm not gonna lie before I actually sat down to watch it I thought maybe this movie wasn't going to be all that good, I thought it would only be funny for the first 20 minutes and then go downhill from there, but I was wrong. It was actually really really funny. Then again what movie isn't funny when Vince Vaughn is in it? I thought he did a really good job in this movie, especially with the serious parts, cause that's usually a side you don't see in him in movies. Jennifer Aniston was also good! I don't think she can ever do bad in a movie. She's defiantly one of my favorite actresses. I recommend this movie to anyone who wants to see a good romantic comedy that also has its serious parts that might be a tear jerker."}, {"rating": "7", "text": "Definitely better than I expected. Johnny O AKA Jon Favreau was hilarious as his best bud/confidant. Jason Bateman as his bud/real estate agent/therapist had a small but very funny part. The ending however is what through me off & lowered the overall rating."}, {"rating": "7", "text": "Funny, cute, engaging, but I didn't like the ending."}], "recommendations": ["friends_with_benefits", "50_first_dates", "forgetting_sarah_marshall", "zack_and_miri_make_a_porno", "the_proposal", "no_strings_attached", "click", "sandy_wexler", "pitch_perfect_2", "just_go_with_it", "this_means_war", "that_awkward_moment", "trainwreck", "the_dilemma", "the_wedding_ringer", "tammy", "delivery_man", "27_dresses", "funny_people", "identity_thief", "a_bad_moms_christmas", "just_friends", "central_intelligence", "the_five_year_engagement", "17_again"]}