{
  "id": 1550,
  "title": "The Lego Movie 2: The Second Part",
  "starring": [
    "Chris Pratt",
    "Elizabeth Banks"
  ],
  "runtime": 106,
  "genre": [
    "Action",
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "It's been five years since everything was awesome and the citizens are facing a huge new threat: LEGO DUPLO® invaders from outer space, wrecking everything faster than they can rebuild.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/QTESAsBVZwjtGJNDP7utiGV37z.jpg",
  "categories": {
    "plot": 7.066666666666666,
    "acting": 7.225806451612903,
    "ending": 6.722222222222222,
    "soundtrack": 7.5,
    "cinematography": 5.0,
    "familyFriendly": 7.041666666666667,
    "funny": 7.095238095238095,
    "action": 5.333333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Nice for the kids but not really that good a movie if you're an adult. The concept is all nice, sweet and politically correct but it lacks pretty much anything really worth remembering. It seems way more childish than the first installment and the humor is pretty so-so. Not an improvement in my book. Kids may find it great fun."
    },
    {
      "rating": "4",
      "text": "Fast furious and frenetic. This is like reading a book without punctuation. An indecipherable story line still provides much wit and invention that will keep those kids and adults interested more than content. Throw in at least 3 reasonable songs and adulation will just soar. For those less enamoured everything is certainly not awesome and the drawn out multiple endings is just the nail in the coffin for the detractors."
    },
    {
      "rating": "9",
      "text": "Although it wasn't as good as the first one, it was still very fun to watch"
    },
    {
      "rating": "8",
      "text": "Similar to another recent animated sequel (\"Ralph Breaks The Internet\") \"The Lego Movie 2: The Second Part\" in no way matches the amount of brilliance or novelty that its legendary predecessor possessed. \"Not as good\" is not the same as \"not good at all,\" however, and this film definitely contains a lot to like and even love. The thematic backbone of this story, namely, is one of the more admirable and unique features in play, featuring some genuinely effective heart and a truly affecting message that should strike an emotional chord with most viewers. The humor, while definitely nowhere near as polished and indelible as the first film, is still worthy of note, featuring a couple of real banger jokes and a multitude of other relatively funny ones. The music even gets a bit of an updo this time, utilizing the decidedly hilarious musical talents of one Jon Lajoie to its added benefit. Again, none of this is particularly better than the original, but still valid at most. Just don't expect lightning to strike the same place it did back in 2014."
    },
    {
      "rating": "7",
      "text": "The sequel to the Lego Movie is cute. It has some good ideas, but what made the first one so good was the idea of the unknown and the breaking of the 4th wall. This film takes that little bit of magic and uses it a little too much."
    },
    {
      "rating": "6",
      "text": "A slightly above average movie. The main idea behind it is nice and sweet. The way it was made was also generally fine and it is a movie worth watching.However, there are some negative things to point out. In the first movie, the father was portrayed in a generally positive way. This time however, they painted him as a distant father, who was always missing. Why is that? There were some moments also that I felt they were trying to emphasize political correctness in this movie. But to be fair, even with that it was done in a fairly tasteful way.A more negative point for me were some details that made the movie more childish than the first one, which does not exactly fit the fact that the children have grown since then. Also, it did not meet the same quality of humor from the first movie. That is why I cannot give it a higher rating than 6."
    },
    {
      "rating": "0",
      "text": "It has the floss, this movie is ****, its very Cringe, please dont watch it"
    },
    {
      "rating": "6",
      "text": "While not actually bad, it's so far behind the original and the Lego Batman Movie, it feels a lot weaker than it actually is.Would MUCH rather watch those two again than watch this."
    },
    {
      "rating": "7",
      "text": "I loved the first film, and I also really enjoyed the Lego Batman and Lego Ninjago spinoff films as well, so I was excited but also skeptical knowing how difficult it is for sequels to live up to expectations. But I gotta say that this thankfully still had most of the fun and charm of the first film, albeit a few drawbacks (there's a lot more singing in this one, and I never was big into musicals personally), and there's even one song that contains lyrics about it being so catchy that it gets stuck in your head, which I definitely wasn't crazy about. The rest of the film, however, was highly imaginative and colorful as expected, even if it does also contain some somewhat ridiculous moments of toys/inanimate objects defying the laws of gravity, physics, etc. But overall, it'll likely prove enjoyable enough for Lego fans and fans of some of their previous films thus far."
    },
    {
      "rating": "10",
      "text": "An amazing and awesome sequel improving upon the original is all sorts of wonderful surprises! The voice cast is still incredible as always, the animation is brilliant and amazing, the multiple pop culture references and joke are fantastic and well timed, and the story is original and heartfelt. A brilliant and a must see sequel equally enjoyable as the first!"
    },
    {
      "rating": "8",
      "text": "The Lego Movie 2: the Second Part is the sequel to the original Lego Movie and is directed by Mike Mitchell. It takes place 5 years after the events of first film where a once colorful Lego as turned into a baron wasteland during the invasions done by the Sistar System. Leaving the people to become harden and serious from the devastation all except Emmet voiced by Chris Pratt who still believes that there is still something positive in this wasteland. Until 5 of his friends, Wyldstyle voiced by Elizebeth Banks, Batman voiced by Will Arnett, Unikitty voiced by Alison Brie, Metalbeard voiced by Nick Offerman, and Benny voiced by Charlie day, are kidnapped by General Mayhem voiced by Stephanie Beatriz and brought to the Sistar System leaving Emmet to pursue them. I thought the first Lego Movie was a good film but I didn't think it needed a sequel so I didn't expect much from this film but man was I wrong. This flick is fantastic with a story that keeps you engaged from begging to end. All the returning characters are highlighted excellently in this film, they even throw in some references to the Lego Batman movie. The comedy is nice and balanced. The new characters fit in nicely especially Queen Whatevera Wa'nabi voiced by Tiffany Haddish a form changing queen who is always more than she appears to be. But the best part of the film by far are the songs. They're are perfectly composed and paced to the point that there really isn't a bad one in the bunch. However the film does have one issue with that of it's message. You see film tries to have multiple messages, that of the relationship between siblings and that of growing up losing that childhood whimsy. Both messages are fine on there own but putting them together can cause the problem of feeling like there's something out of place, because inevitably one message will out way the other. If I where the film makers I would have just focused on the relationship between siblings message, since that would fit with what the first film did. In conclusion though I can't say this film is perfect I did find my self thoroughly entertained through it's entire running time, so if you've seen the first film than sit down and enjoy the show."
    },
    {
      "rating": "9",
      "text": "Though it's not quite as good as the its predecessor, Lego Movie 2: the Second Part is a very enjoyable film. I'd put it in a tie with Lego Batman for the second best installment in the franchise.This is a natural progression from the first one as we see LEGOs go against DUPLO and the girl audience-style LEGOs. Considering that they're the two other biggest brands of LEGOs, it just makes sense. It is also an interesting viewpoint on conflicting styles on imagination based on age and gender.Though you couldn't really top the surprising twist from the first film, this one does contain a couple pretty effective reveals which like the first really support the emotional beats of the film.LM2 is also a bit of a light musical. Due to the success of \"Everything is Awesome,\" they added on the songs here and they work pretty well. The two best musical numbers hands down go to the ones sung by Tiffany Haddish's Queen Watevra Wa'Nabi. The comedian/actress is a surprisingly good singer. The songs are even catchier than the \"Catchy Song,\" which was the movie's attempt to match \"EiA.\" (I mean it's catchy but only short-term catchy.)The movie looks great. The new universe of the Systar System is really well designed and colorful. The scenes that take place in the \"other dimenson\" are really well lit and have a very 80's/90's feel to them. The constantly shape-shifting Queen Watevra Wa'Nabi is an impressive bit of animation. (Though it still doesn't match the amount of effort that went into the form-changing Greedy scene from Raggedy Ann & Andy: a Musical Adventure. Check it out, it's really impressive.)As mentioned, this doesn't quite match the first, which in fairness is a high bar to reach considering how everything worked almost flawlessly. There are many funny jokes here, but not the rapid succession that were in the first. Pacing isn't as fluid either. The likes of Benny, Ultrakitty, and Metalbeard are present throughout and have some nice lines, but they really don't contribute much. Basically, the writers were trying to include the whole cast, but since they were telling a more personal story between leads Emmett and Wildfire, they didn't seem to know what to do with everyone else.Nitpicks aside this is a film that I think the whole family will like."
    },
    {
      "rating": "8",
      "text": "The Lego Movie 2 is a worthy and very entertaining sequel but the problem is nothing new is done to help excel this movie beyond its previous films. The cast is great as always, especially Chris Pratt who's pulling double booty playing not just Emit, but a new character. The rest of the cast is very funny, and the animation overall is beautiful as ever, as we get much more landscapes and we see even more of this Lego world. Overall The Lego Movie 2 does it'a job correctly and it does it very well but just lacks some of the key magic moments from the original or Lego Batman and just kind of sits between good but forgettable."
    },
    {
      "rating": "4",
      "text": "I guess it didn't have the surprise factor the first movie did. It is full of clichés which it often sends up but in a similar manner each time and plus, this doesn't exactly excuse this. It was OK until the beginning of the third act in which it tries far too hard to tie the fake world to reality and in the process breaking the illusion and creating a lot of confusing plot holes and breaking the rules of its universe. There are still a good number of decent jokes but they are all very similar. Also, I love Richard Ayoade but voice acting is not his calling, and the same with Tiffany Haddish, who is for some bizarre reason in literally everything. Oh, and the songs are pretty rubbish. They tried too hard to make another \"Everything is Awesome\". Too much of the humour consists of different levels of being meta, also adding to the confusion of the movie. I was underwhelmed, and the third act was far too drawn out. The vast majority of real life scenes should've been cut entirely, the number in the first movie was great. The cinematography in the live action scenes was pretty pisspoor but probably because it is an animation studio, which is why I think there are too many of these. It does have redeeming features though and the humour keeps it afloat. I still think this far it has been overrated."
    },
    {
      "rating": "10",
      "text": "The critics are insane! How dare they give this masterpiece the same score as Bumblebee! Are you serious? This is amazing! It's really charming, it has really likable characters, and it has a good pace of jokes and comedic moments. If this movie doesn't at least get nominated for best animated feature next year I don't know what I'm going to do because this movie was tons of fun. I think it might be even better than the first movie! Lord and Miller can run the world for all I care. They nailed it once again!"
    },
    {
      "rating": "10",
      "text": "Is everything I was waiting to see in the sequel and more. Great plot twists, characters, animation, jokes and heartwarming moments. Is an improvement over the last 2 LEGO movies we got, and I can't wait to see it again"
    },
    {
      "rating": "10",
      "text": "I love it! So many funny jokes that you cannot even remember from laughing so hard. It makes you feel like a kid again."
    },
    {
      "rating": "10",
      "text": "I didn't think it could be done. I never thought The Lego Movie 2 would be better than the original. Boy, was I wrong! This movie is better by at least 37 miles! The story was amazingly well crafted. The returning characters never lost their charm, even after 5 years, and the new characters redefine the word \"charm\", at least for me. The music, again, was phenomenal. The jokes are even better than the original. I never mentioned this in my review of the original, but the animation is actually pretty realistic. If you didn't already know that it was CG, you would think it was stop motion. But it isn't. That is awesome. And the ending was just amazing! If a 3rd Lego Movie comes out, I don't know how they'll top that (kinda like Toy Story). Overall, I don't think I've ever enjoyed myself more with a movie than with The Lego Movie 2. I do have one minor complaint, though. Why is Batman dressed in all white flossing? Just why?"
    },
    {
      "rating": "7",
      "text": "When the original Lego Movie was first announced there was a resounding groan from a lot of audience members, with people worried that it would end up being some weak corporate cash grab, just like the Emoji movie ended up being three years later. But to the surprise of many, it ended up being one of the most wholesome hits of 2014, one that was so good people were annoyed to see it absent from the 2014 Oscar nominations for best animated feature. Seeing franchise potential, Warner Bros quickly released a spin-off with Lego Batman, which received similar acclaim, and announced that a sequel following on from where the first left off was now being developed. (There was also a Lego Ninjago movie at some point, but I'm not sure if anyone saw or even remembers that one.)Now five years after the events of the original Lego Movie, Emmet and his friends are now living in a Mad Max style world, where all the characters have become dark and brooding, apart from Emmet who is still jollily singing about how Everything Is Awesome. But Duplar invaders from the Sis-star system invade and end up taking Lucy, Batman and all of Emmet's other friends leaving Emmet to find a way to save his friends to stop Armomageddon.On his journey to the Sis-star system, Emmet teams up with Rex Dangervest, a galaxy defending archaeologist cowboy and raptor who's basically an amalgamation of Pratt's post-Lego career in a hilarious duel performance from Pratt. It's kind of like seeing Parks & Rec Chris Pratt meet blockbuster superstar Chris Pratt.We're also introduced to a whole new batch of characters from the Sis-star system, including a sparkly DJ vampire, an awkward ice cream cone and their queen Watevra Wa'nabi a character made out of blocks who can transform into anything she wants. The queen also has a very helpful introduction through the song \"Not Evil\" where she goes on to explain that she doesn't have any evil plans and no ulterior motives. It's very nice when a kidnapper can be very open about how very not evil they are.There are actually quite a few songs in this one, following on from the success of Everything is Awesome. Somehow these songs seem even more self aware, including a song which literally has the lyrics \"This song is gonna get stuck inside your head\" and possibly one of the best end credits songs I've heard. Some of these songs differ in quality and there's probably one music sequence too many, but there's definitely enough songs here for kids to irritate their parents with on a loop. At least until the end of the year when Frozen 2 comes out.Just like the previous films, Miller and Lord go all in on their own brand of meta humour, ranging from characters being self aware of their own roles in the film to cameos from a Ruth Bader Ginsburg figure and Bruce Willis, which includes a voice over cameo which is depressingly his best performance since Looper. There's also another real world lesson mirroring the events in the film, this time involving sibling rivalry and learning to play nicely with one another. But whilst this is definitely a really enjoyable second outing, the film does lack the same spark of originality that the original Lego Movie had. But anyone who enjoyed the fast paced wholesome quality of the first Lego Movie will not be disappointed by this entertaining follow up."
    },
    {
      "rating": "6",
      "text": "A Toy Story.The Lego Movie 2: The Second PartMitchell is clearly afraid to try anything new. Looped in the same process that we have already seen before, this installment works on nothing but humor. And as always, the humor has been ironical, pointing out the obvious in each scenario, it mocks down its own flaws and characters from all the sides. The references too helps in a lot, a culmination of all iconic characters, bubbles up the films, TVs, sports and pop cultural references that clearly is kept in mind in order to tickle its younger audience. And mind you, it's not for that younger audience- for them the visual effects and action is enough to blow their minds- it is more armed towards the teenage audience.The musical sequences are my favorites, especially the way they start. There is always one among them opposing to hum along the tune, usually it's Banks. But personally for me, Arnett's musical numbers makes me tickle the most. In fact, his entire track is the highlight of the film. Not tied into any strings from the actual plot, he is literally there to mock everyone. His attitude of not accepting his mistakes, no matter how many time they ride that joke, comes out hilarious.His entire image has gone topsy-turvy; he wears white cloak, he is not a bachelor anymore and he sings and dance to all the beats, and Haddish is the one to blame. Her character swoops in with charm and electrifies the whole screen like a concert. The non-animated part of the film is not only poorly performed but also shot with dull camera work that anchors the film. The emotions that it is trying to capture through it, seems in-congruent to its tone, we are so sunk in this tomfoolery world, that sincerity grows into a myth and the makers should have been aware of it and should have toned it down a bit.Pratt, voicing two characters this time, is pretty much decent in his revisiting role but much more effecting in his newer suit. The endorsement he does of himself with such commitment and a \"cool\" voice does fool us along with the characters around him. Banks, the voice of the reason, gets to play the mellow part, despite of having a completely different persona than any other characters, she fails to stand out on her own merits, \"her character just isn't ready to change.\"Unlike the previous one, there aren't lots of things going on in screen, the makers have definitely minimized the plethora of characters version which helps us stay with the narration easily. The comments passed by famous stars every now and then, steals the thunder of the scene, like when everyone rushes down Batman's house, Alfred yells, \"No shoes!\" or Bruce Willis jumping in or an eerie equation of Superman and Green Lantern, the film keeps us busy through these formulas and we all nod along effervescently. The Lego Movie 2: The Second Part is a step down for the franchise where it still might be worth playing with but the original essence is clearly missing."
    },
    {
      "rating": "8",
      "text": "A solid film that is good, yet not as good as the original. Probably the third best in the Lego franchise. Which isn`t a bad thing. All of the other movies do good. This movie looks really good. The Lego style again succeeds. A great family film for the whole gang."
    },
    {
      "rating": "9",
      "text": "Next to the First this is the next Best. People need to see this a lot like the first its damn creative funny and awesome. the end credits are also hilarious because lonely island has a song. I am 16 personally the first lego movie is in my top 10 movies of all time this is amazing but not as good. Doesn't matter your kids deserve good content not freaking ugly dolls, and boss baby ok. So please see this and if not see Lord and Millers other great movie spiderverse. They are amazing writers. Thank you To all the Lego movies for so much joy. I will be watching Lego movie 2, 2 more times this week."
    },
    {
      "rating": "8",
      "text": "The first film was a new innovative idea that shattered the animated realm. The second one is just as good as the first, filled with outstanding acting, gorgeous animation, and very funny jokes that had the whole audience going for it. I highly recommend this for families looking to have a fun night."
    },
    {
      "rating": "8",
      "text": "with all of the villains changing subsequently, and the fake endings here in there, it's no wonder this movie got so much traction. They even broke the fourth wall at the credits scene (which made us watch the credits even more)"
    },
    {
      "rating": "2",
      "text": "Everything is not awesome. It took until the third act for any real jokes to land their punches. Overall, I left the theater completely underwhelmed compared to the first movie."
    },
    {
      "rating": "9",
      "text": "the story about family and grow up. delightful and still awesome like previous film"
    },
    {
      "rating": "0",
      "text": "This movie was  childish and had a lot of sexual sitings in it.This is recommended for pornhub. MANY VIEWS"
    },
    {
      "rating": "8",
      "text": "I really did not expect to walk of the theater having the opinion that I enjoyed the sequel more than the original but that is totally where I'm at right now. They freaking nailed it."
    },
    {
      "rating": "7",
      "text": "Funny at times, boring at times, but overall a solid movie that tells an okay story about being a child and what it takes to grow up. Nothing mind blowing, but also not bad."
    },
    {
      "rating": "4",
      "text": "i was expecting funny jokes and clever cute lines yet was highly disappointed. i started to fall asleep the second half of the film and ended up walking out before the movie was finished. if i was a family man with kids maybe it would have been different. my son is grown up and a phd physicist at cornell u so we dont see many movies together. i cant recommend this film because it was not as original as the first lego movie, which i really liked. see it with kids or wait until it is on tv."
    },
    {
      "rating": "6",
      "text": "It’s a real revolution the way the LEGO series grew similarly with its viewers. Compared to my experience back in 2014, I only wrote one movie review every few months for my parents’ blog. Now, it’s a weekly side hobby as I stretch to someday do it professionally. Much like my own gradual growth, these two parts to the LEGO cinematic universe keenly adapt to the values of the time. While The LEGO Movie 2: The Second Part remains inconsistently nonsensical like the first movie, it still does more to develop greater complexity of what it analyzes about our culture. Director Mike Mitchell picks up exactly from the instant of the last feature’s finale for a new, mature direction you’d never guess the franchise could go, yet it goes there, to results that are both different and the same as before.Not that it means the returning familiar characters, such as the Dark Knight, change in a way that enhances the entire product. There’s still a thoughtless plot twist that randomly throws itself about alongside cameos of Harley Quinn, “Larry” Poppins, Velma from Scooby Doo, and an unnecessary parody to “Let’s all go to the lobby.” Yes, it’s that kind of writing; the kind that weakens the main romance from before because the returning screenwriters, Phil Lord and Chris Miller, dig too shallow into a young boy’s psychology beyond the fist-shaped spaceship, “Rexcelsior.” They also dig too shallow into a young girl’s psychology, as the ruler of the feminized galaxy, the “Sistar System,” doesn’t feel like much of a threat.These contrasting galaxies try to establish a metaphor saying siblings should play together, except Batman’s floss dance to maracas played by dinosaurs isn’t necessary for that message to get across. Other types of jokes milk the entertainment factor too far, particularly cartoon gags in a dainty little house, the return of that dreaded double decker couch (with an upgrade), and more jokes on the Batman franchise. Few important aspects from this abuse of self-aware humor prove significance beyond what audiences may be sick of by now.Then Bricksburg becomes Apocalypseburg centered around a desolate lady liberty. But less on that, onto the girly toyland of the Sistar system, and its ruler, Queen Watevra Wa'Nabi. This queen is detailed with fingerprinted bricks that take on fun animations throughout two musical numbers, exclaiming she’s “totally not evil,” much like the adorably destructive vivid invaders with huge puppy dog eyes on cute little weapons shaped like hearts and stars. She could probably cause Ar-mama-gedds-in, a feared event that is actually a clever depiction of simple kid playtime problems, such as the older sibling forbidding the younger sibling from touching his or her toys. It all builds a better portrait of girl toys combined with very Muppet-esque humor to go against the style of the first movie, ultimately becoming a distinct twist on older alien invasion flicks.Yet there’s plenty enough like the first movie to keep the familiar lovability intact; it keeps up with some fun little Easter eggs, as a LEGO Oscar appears for the satisfaction of those who still feel angered by the first movie’s infamous snub four years ago (myself included). Everybody from the snobby cinema scholars to the casual popcorn-happy moviegoers, will find guaranteed emotional satisfaction from the eventual fate of the Sistar system’s massive glory.Yet to everyone who’s about to see this, a little fair warning: there’s a new song called, “Catchy Song,” that indeed gets stuck inside your head like the lyrics say they will. That song comes up specifically to be a mind-control device in an ominously happy scene that’s ultimately childish without a hint of sense. Regardless, I for one still find myself tapping away to “Catchy Song” whenever it plays! That’s my experience with LEGO on film: it’s still plenty of fun despite the clear flaws.There’s a real proven power of LEGO’s motion pictures:The LEGO Movie criticized the Obama administration exploiting corporate America so it could obtain an impractically perfect vision. Batman’s spinoff redefined our famous crusader as we reconsidered our sense of morality shortly after Trump’s inauguration. Ninjago is pure garbage, so it doesn’t count. Now, The LEGO Movie 2: The Second Part brings pop culture of boys and girls together to help tomorrow’s generation build a better society together. My, what a cultural shift we’ve made, and through something that looks like a toy commercial! Just compare that to thirty years ago, when anything with the word, “movie” in the title never carried depth besides commercialism. Keep it up, Warner Animation Group! Continue inspiring future artists to do better!"
    },
    {
      "rating": "8",
      "text": "I'll come back with a review over three months when it comes to Blu-Ray because I could not focus on the movie at all because of the kids behind me. Among the worst cinema experiences."
    },
    {
      "rating": "8",
      "text": "Not as good as the original or maybe we were surprised with the first. Anyhow, a feel good movie without an agenda. Only bad part was the preshow with Brie Larson pushing her agenda and clips of the upcoming S**t show called Captain Marvel. Spend your movie on this movie or Alita and avoid Captain Marvel."
    },
    {
      "rating": "9",
      "text": "Definitely, do not watch this if you didn't watch the first one. It's a good movie that requires at least some context from the first movie and more of a family or friend film than anything. It wasn't as good as the first movie but perfectly fills the role of a good Lego Movie Sequel"
    },
    {
      "rating": "10",
      "text": "it is a good movie i will recommend for the whole family and friends enjoyable sad in comedy"
    },
    {
      "rating": "6",
      "text": "All in all, The LEGO Movie 2 is a very enjoyable time at the cinema. While it doesn’t have the impact of the original, it’s a nice course correction for the LEGO Franchise after the bore-fest that was The LEGO Ninjago Movie, and it will have some elements that will live long in the memory, most notably a shoo-in for another Best Original Song Oscar nomination in the shape of its end credits song."
    },
    {
      "rating": "4",
      "text": "This time around takes place in a post-apocalyptic world (yes, in LEGOs), but the plot is a mishmash of rescue efforts. Not surprisingly, a lot of what I said about the original movie remains true: \"The visual style is cluttered, none of the characters are particularly memorable and the many chases are lively but unfocused. Still, the sometimes creative visuals and overall energetic approach should please eager young viewers, giving fans of the form plenty to play with.\" They seem to be going for an audience of older kids (8 - 12), because a lot of the dialogue is pretty \"grown up,\" plus, there are 2 human kids around those ages that pop in and out. Even though I only laffed once, I was never bored (and all those catchy pop songs keep it bouncing along)."
    },
    {
      "rating": "7",
      "text": "A good movie, though not nearly as good as the first one. The plot is a little confusing, and we lack a clear villain like lord business. The jokes come so quickly that it's a little hard to keep up at times. Much like the original, this is one that will reward repeat viewing. Some decent songs and set pieces. You get all the characters from the first one, but not that many new characters. The whole thing feels a little samey. Will Ferrell gets a credit for literally two lines, both of which are delivered when he's not onscreen. Bruce Willis does a good cameo. The older of the two children in the real world is too old to be still playing with Lego. Overall if you enjoyed the original you'll enjoy this, but don't expect a \"Toy Story 2\""
    },
    {
      "rating": "5",
      "text": "Has many funny bits and the animation is excellent but the script is inconsistent and story stupid."
    },
    {
      "rating": "2",
      "text": "The movie doesn't even come close to living up to the previous film. They just recycled everything that was already done before and coupled it with a generic story that fails to every remotely entertain you. There is a reason it bombed in the box office."
    },
    {
      "rating": "0",
      "text": "Utterly regret watching this movie with my kids. It's actually slightly ruined the first one for me (which I loved). Its far too weird to really be suitable for younger kids, but also has some bizarre ending morals, which I had to tell my kids are not very good rules for life. If I could rate it a minus I would, genuinely regret watching this."
    },
    {
      "rating": "10",
      "text": "Loved the movie! SO very inventive and imaginative!!My spoiler comment is regarding the ending. So Rex Dangervest is Emmet grown older, and he's the villain because in real life he represents the boy now older and something of a bully to his sister, busting her girly creations. I can buy that, but Rex's character wasn't altogether bad. He grabbed the bull by the horns and got things done. And resourceful (with his high-tech ship and trained raptors)! I think in the end, women want someone who's in between Emmet and Rex. Nice guy, but also man enough to take care of them, provide for them."
    },
    {
      "rating": "6",
      "text": "I think kids will find it fun and for adults, some references sprinkled inside to not make it boring. I like overall message (I used to fight with my sister too over toys) and the best part of the movie is the end credits. The do overdo metajokes and 4th wall breaks a bit too much here honestly. They  tried to push \"open your heart\" thing, sure it is sweet but does not work well.Of course the real and lego world in movie has weird laws, at one moment lego can move around real world and then back to lego world and does not acknowledge other \"real\" world?  The time travel thing ruined second half and made it useless, but ending was OK. It's fun for kids, but nothing much for adults."
    },
    {
      "rating": "8",
      "text": "“How do you continue a great movie?” was the question me and a friend of mine posed while walking after school finished (although we were talking about Interstellar that moment…).But that was the question I always had whenever I thought about The LEGO Movie 2:The Second Part.Because,now that you made a unique movie that is a giant ad for LEGO at the same time,you surely want to churn out a franchise out of it. And,after the likes of Batman and Ninjago,I could say I was on board with the LEGO Franchise (Almost). And now that we have a follow-up to one of the greatest Animated Movies of All-Time,the question will finally be answered. And yes. Hell yeah,it's really good (nowhere near the first one's qualities),although there’s something that’ll keep bugging me whenever I’ll think of this movie. I just can't stop thinking about what happened in the writing room. Not about who has the upper hand on Creative Freedom,but on the enjoyment factor. This is a script that,while it takes the audience with big respect,is surrounded by a Virus,of an .exe quality. Something I’d like to call the “MikMitchell.exe” virus. Picture it this way. Phil Lord and Chris Miller are having a blast writing the script that is fun,exciting,full of plot twists and heartwarming to an extent,but then,when Mike Mitchell (sadly,the director of this movie) comes in and checks the script,he becomes the evil and serious professor that says “NO! THIS PART SUCKS” or “Just put in a musical number here so the kids will still be awake”,”I don’t want a cohesive story,you dumb imbeciles. When I say ‘Throw in a fart joke or a vomit joke’ are you simpletons?!?” (There’s a world that made me think of Suburbicon,but a Musical that would literally make Mike Mitchell happy). Think of it as a Creative Civil War. A great and intelligent script that is still surrounded by sheer stupidity. Emmet is trying to make the world awesome again,Lucy and the rest want their world to be dark and bleak in this Mad Max-styled city called Apocalypseburg,Queen Whatevra Wa’Nabi (a character that shifts to whatever form or figure she wants) wants to get married with Batman,all of it sprinkled with a message about playing differently with your kids,boys or girls,it doesn’t matter. And then,throw in a vomiting star,or a character that says the A word at the end of the movie because remember,it’s directed by the same guy who directed Trolls (and the upcoming TROLLS WORLD TOUR. AREN’T YOU EXCITED?!?) . Big potential realized for half of the movie. Man,do I want to punch Mitchell in the face just for that…That’s not to say it’s a mixed bag. The Animation is,once again,great,and I love everytime Queen Whatevra Wa’Nabi moves. Mark Mothersbaugh’s score got a big improvement from the first movie,with the themes now being fully orchestral rather than a 50/50 between orchestra and techno vibes. The musical bits were great,but unnecessary,And Chris Pratt playing two characters that with different motifs was infinitely better than Steve Carell playing two characters in Despicable Me 3 (God,that was insufferable).And again,the script was meddling at times,but nothing...too distracting or baffling. And there’s enough material in here that will entertain both kids and adults. Nowhere near as great as the first one,but still fun to watch. If anything,it gave me a big sense of hope after The LEGO Ninjago Movie gave me a sense of death for the Franchise."
    },
    {
      "rating": "5",
      "text": "First of all, my main problem with the film is the plot. The first movie has a clear plot and knew where it wanted to go. This film has really no idea where they wanted to go with anything in this film. This causes lots of issues in the movie because they didn’t have a straight forward plot that everybody could easily follow. I’m going to try and not spoil it but in the first movie, there was a great plot twist that caught everybody off guard but this film they tried to do that and caused more issues in the plot. It made no sense and could have easily been taken out of the film and it would be a bit better. In the first film, we got the great song “Everything is Awesome” so this film had to try and outdo that song and I will give them credit for trying. One of the songs is called “Catchy Song” and it’s not catchy one bit. At some points, the film just comes to a halt so they can fit in a pointless song that it doesn’t need. All we needed was one good song in the film and instead, we got ten annoying songs. The first movie didn’t overuse humour but this one tried to stuff it in at every point they could and it doesn’t work. They used humour that broke the fourth wall and only older audience members would get which isn’t good since this is a film that’s gear towards kids. The message in this film is a good one but it’s forced down your throat so much that you don’t really care about it. They also pretty much say it and spell it out throughout the entire movie. The pacing in this film is way to fast to help understand anything that’s happening in the film. Really the only good thing about this film is the animation. In the end, I think this film could have been good if they kept the original directors on board. This film isn’t good for teens or adults and maybe kids will enjoy it but I would suggest seeing something else instead of this film."
    },
    {
      "rating": "7",
      "text": "Not even close to as good as the first one, but still entertaining with great voice work and animation."
    },
    {
      "rating": "8",
      "text": "Though this movie is not as good as the first LEGO Movie, or the LEGO Batman Movie, it is still enjoyable and fun. The animation was great, and so was the music throughout the movie. The characters are funny and most characters have some good jokes throughout the entire movie. The villain is good, and almost as good as the original LEGO Movie’s villain. The beginning is interesting, the middle is very funny, and the end was great. I recommend to fans of the original."
    },
    {
      "rating": "8",
      "text": "A Bit Disappointing, But Still FunThough it’s plot it’s kinda bland and kinda forgettable, The LEGO Movie 2 definitely still has the laughs, beautiful animation, and spot on voice acting from the previous film."
    },
    {
      "rating": "8",
      "text": "It seems there's a clear intent in this sequel which differentiates it from its predecessor and which is surprisingly not mentioned in many reviews. Yes, it's essentially a comedy, but it clearly has a message of tolerance and forgiveness at its core. This slowly makes itself evident but becomes obvious by the movie's end.I didn't laugh as much as I did in the first movie, but I still laughed a lot and even had my heart warmed as the events of the Lego world revealed themselves as the product of the conflict (and ultimate resolution thereof) between siblings."
    },
    {
      "rating": "7",
      "text": "The second part doesn't have the charm of the first but it's still a fun movie. I think the plot was somehow complicated (especially for a younger audience). The jokes weren't all that good. The music was enjoyable. I give a 72%. It was a decent movie."
    }
  ]
}