{"id": 789, "title": "The Good Dinosaur", "starring": ["Frances McDormand", "Raymond Ochoa"], "runtime": 93, "genre": ["Adventure", "Animation", "Family"], "description": "An epic journey into the world of dinosaurs where an Apatosaurus named Arlo makes an unlikely human friend.", "releaseYear": "2015", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/8RSkxOO80btfKjyiC5ZiTaCHIT8.jpg", "categories": {"plot": 6.818181818181818, "acting": 7.1395348837209305, "ending": 5.933333333333334, "soundtrack": 7.0, "cinematography": 5.0, "familyFriendly": 6.380952380952381, "funny": 7.785714285714286, "action": 6.857142857142857}, "reviews": [{"rating": "7", "text": "It's mainly in the title, Pixar's 16th feature 'The Good Dinosaur' is...well...good! Let's start from the simple points...\r ...The story mainly focuses on a family of dinosaurs which mainly consists of a father (voiced by Jeffery Wright), a mother (Frances McDormand) and three little children...the main one is Arlo (Raymond Ochoa).\r Arlo is pretty much like any Disney or Pixar protagonist you have seen before...a vulnerable little boy who is scared and inexperienced in life and the outside world. The story is essentially 'The Lion King' (1994) and 'Finding Nemo' (2003).\r Arlo ends up missing long away from home and finds a young toddler boy who he befriends throughout his journey as they try to survive finding food and keeping away from the storm.\r Arlo ends up coming across a T-Rex family, the lead who is the father named Butch (Sam Elliott) that teaches Arlo that there is nothing wrong with being scared, as long as you survive, then you will be fine.\r 'The Good Dinosaur' is pretty pain-by-numbers in terms of storytelling...it isn't as inventive as Pixar's previous feature 'Inside Out' (2015), a movie that nearly brought me to tears (and I rated it 10/10). Like I said earlier...it's similar to 'The Lion King' (1994) and 'Finding Nemo' (2003), the fact that it focuses on a father-and-son relationship and the son goes on an adventure to go from a boy to a man.\r It's a good feature debut for director Peter Sohn, who directed the short 'Partly Cloudy' (2009). Sohn may not be among the Pixar juggernauts like John Lasseter, Pete Docter, Andrew Stanton and Brad Bird...but he could end up getting better after a couple of more features.\r All in all, 'The Good Dinosaur' is good Pixar fare...it may not be up there with 'Toy Story' (1995), 'Finding Nemo' (2003), 'The Incredibles' (2004) or even 'Inside Out' (2015)...but it is certainly better than 'Cars 2' (2011) and 'Brave' (2012)...however...it's a movie with great animation, great music and the funny moments are funny, and the sad moments are sad...like most Pixar films."}, {"rating": "7", "text": "I've always had a soft spot for Pixar movies and I went into this with high expectations. I was not disappointed but it is definitely not as good as some other features they have made like toy story and up, but this film is still very fun like every Pixar movies. The backdrops look very very realalistic but the characters are very cartoony like they are in every Pixar movie and I like that. I thought the story was just ok. Not great but not bad just great. It is worth checking out but I don't think it stands out next to the other Pixar movies."}, {"rating": "7", "text": "Is this top tier Pixar? No, it's not. But is it bad? No, not really. The narrative is simple and overly episodic, the message is simple, the central conceit is odd and possibly of little value (why is featuring dinosaurs in a western any better than just doing a western?), the film doesn't make use of it's own ticking clock device very well and the design choices probably won't work for everyone. However, the incredibly strong character work, especially the central relationship between Arlo and Spot, carry the film over these rough patches and make it all work on a visceral emotional level without ever tipping into manipulation. It doesn't hurt that this is the most visually stunning work that Pixar has ever done. So, it won't live along side Toy Story, Up and Inside Out, but it's better than Cars. Take that for what it's worth."}, {"rating": "7", "text": "I was expecting the movie to do a lot better than Inside Out. Sure it's dark, intense and weird, but it gave me emotional feels and I tried not to cry. The movie was pretty good and still better than Inside Out."}, {"rating": "8", "text": "Another Pixar great. Don't listen to the other reviews, it is a very great story. It follows Arlo and Spot, Arlo is a dinosaur that acts like a human and Spot is a human that acts like a dog. It follows them on their emotional journey home."}, {"rating": "8", "text": "The Good Dinosaur is a great addition to the Pixar Family movies from the Disney's world of movies. Although it might not had the great impact that previous Pixar films have had in the past - it still managed to make a great impact with its characters, colorful environment and story. If you watched Brother bear - you can say its somewhat similar to that movie but entirely different and original on its own."}, {"rating": "6", "text": "The Good Dinosaur is a below average Pixar film. admitted there is a few very funny moments, and the family issues i a great talking point with your kids when the lights in the Cinema is turned on Again. But I just feel that Pixar could have gotten so much more out of the story/settings.\rThe effects and Visuals are stunning, the story not so much."}, {"rating": "7", "text": "Brilliant animation and excellent production values help make this an engaging watch in spite of a predictable storyline with not much novelty........"}, {"rating": "7", "text": "An enjoyable film that really plays with your emotions. The story did a feel a bit bare though, and it felt a lot shorter than it was.\rThe visuals and the soundtrack were great, but it just felt like a poor attempt to live up to other pixar films like Toy Story. While I understand the challenge of having a mute main character, Arlo has somewhat of an annoying voice.\rWhat there is of a story is entertaining however, but I do wish it was a bit more fleshed out. Action scenes are no more than a few minutes long and the rest of the film is fairly uninteresting"}, {"rating": "6", "text": "The Good Dinosaur is a disappointing film.  The rich, complex environments are a stark contrast to weak, uninspiring characters.  The overall story arc is about as predictable as they come, but held against Pixar standards it's simply astounding this film was made.  There are definite moments of well timed comedy, but again, these are strangely offset by poor pacing and a meandering plot.\r As if this strange outlier of Pixar misfires isn't enough to make you scratch your head, consider feeding your head first as The Good Dinosaur actually includes a scene in which the protagonists consume psychotropic wild berries.  Go ask Alice.  I think she'll know why The Good Dinosaur defies logic and proportion."}, {"rating": "10", "text": "The Good Dinosaur is an animated comedy-drama adventure film and the 16th Pixar animated movie. It is directed by Peter Sohn and written by Meg LeFauve.\rThe movie asks the question, what if the asteroid that supposedly wiped out the dinosaurs 65 million years ago, missed ? The main character is Arlo, a young dinosaur who lives with his parents and two siblings at a farm. After a tragedy occurs with a close member of his family, he then has to go on an adventure, where he will learn many things and even befriend a human being, Spot.\rThis movie is just great in every sense of the word. I genuinely do not get all the hate that this has received, I mean sure it got a very good and certified fresh 76% rating on Rotten Tomatoes but many people are calling this as a disappointment simply because it is not the next Toy Story or whatever. Grow up people, cause not everything Pixar does is going to be perfect, and if you can't accept that then the problem is with you, and not the movie.\rThis is definitely one of the best looking animated movies ever made. Sure the characters are not as real looking as the landscapes in the background but you have to remember that this is an animated movie, and usually they are meant for kids who really do not care if a movie looks perfectly real or not. If the character designs are your problem that you're definitely just nitpicking.\rThe voice cast is brilliant all around, and maybe it doesn't have stand out voice performances like Inside Out does but then again, Inside Out is one of the best animated movies ever made so you can't really compare these two simply because they were made by the same production company. The Good Dinosaur is also very touching and heartfelt with a very good message, plus it is for adults too with many jokes that kids will surely not understand but the older can enjoy and appreciate. So basically there's something for everyone here and yet again it made the least money for any Pixar movie ever, which is just stupid.\rI hope people buy this more on Blu-Ray and DVD so that it does not continue to be as underrated as it as right now."}, {"rating": "5", "text": "The Good Dinosaur, although an adequate family film, lacks qualities that have made many of Pixar’s previous productions classics. Less a major animated effort than a late-autumn “filler”, the movie offers enough to enthrall children without boring parents but, at the same time, fails to provide the thematic depth and richness on offer in such previous titles like Toy Story 3, The Incredibles, and WALL-E. To that extent, The Good Dinosaur is a disappointment, although most viewers who pay $10 to see it likely won’t regret the purchase.\r The Good Dinosaur had a troubled production history and that may have been the root cause of the on-screen problems. It spent nearly six years in development and two years ago underwent a reconstruction with major rewrites, the jettisoning of the director and most of the original voice cast, and a “repurposing” of the project. Although Disney claims to be “very pleased” with the end result, The Good Dinosaur’s meandering storyline shows signs of what may have concerned the studio.\r The film offers a variety of cobbled together genres. The early scenes echo themes and moments from The Lion King and The Jungle Book. A majority of the running time represents a road trip with buddy film elements. Portions of the second half pay homage to the Western, complete with a campfire, a round-up, musical cues inspired by The Magnificent Seven, and the gravelly intonations of Sam Elliott. The typical Disney messages about tolerance, friendship, and perseverance are in evidence but they seem obligatory and are clumsily integrated.\r The opening sequence provides setup to explain (for anyone who cares…) the Flintstones-friendly co-existence of humans and dinosaurs during the same era. The asteroid hypothesized to have caused the mass extinction event misses the Earth, allowing the behemoths to continue their existence unimpeded by global climate change.  Several million years later, dinosaurs have developed into anthropomorphized creatures while humans favor walking on all fours and yapping like dogs. The Good Dinosaur’s hero, Arlo (voice of Raymond Ochoa), is the youngest member of an Apatosaurus (a.k.a. “Brontosaurus”) family - Dad (Jeffrey Wright), Mom (Frances McDormand), and three kids. They’re farmers, stocking up for the winter. But they have a “pest” problem - a human child (later named “Spot”) is sneaking into their stores and eating their corn. Dad tasks Arlo with the chore of exterminating the intruder. But the young dinosaur can’t bring himself to kill. A chase ensues and, when Arlo and his father are caught in a sudden storm, tragedy occurs. The rest of the movie follows Arlo and Spot, swept away by a river to a far-off place, as they make the homeward journey.\r Visually, The Good Dinosaur boasts some of the most amazingly photo-realistic sets I have seen in any animated film. There are times when it appears as if the filmmakers inserted the characters/creatures into real world footage. The water scenes - often troublesome in animated films - are flawlessly rendered. If The Good Dinosaur falls short in the narrative department, it represents a step forward for Pixar’s artists.  The realism of the surroundings makes the dinosaurs seem more cute and cartoonish than they might otherwise. It’s a conscious choice since photo-realistic dinosaurs might be too frightening for young children. After all, this isn’t Jurassic World.\r A role reversal casts a non-human as the chatty protagonist and a (prehistoric) homo sapien as the sidekick/pet. Although it’s an accepted conceit that animals often talk in Disney movies, few are as verbally skilled as Arlo. And Spot (thus named to re-inforce his similarities to a loyal canine) never utters a word, although he scratches himself and howls from time-to-time. Unfortunately, this clever inversion doesn’t make either Arlo or Spot more interesting. They’re generic cookie-cutter characters.\r The pace, as is often the case with road movies regardless of the species of the protagonists or the terrain through which they travel, is uneven. There are long stretches when little happens punctuated by action set pieces.  Many “popular” dinosaurs make appearances, including T-Rexes and velociraptors. Perhaps the best moment comes during an understated scene where Arlo and Spot, who don’t share a language, use sticks to communicate. There’s emotion and pathos in this sequence - something the rest of the movie could have used more of.\r The problem is that the film’s uncertain narrative creates a variable viewing experience. Despite some of Pixar’s recent failures, there’s still an expectation that anything with their name attached with be better than features produced by their rivals, but that’s not the case with The Good Dinosaur. The movie isn’t appreciably better or worse than a Madagascar or an Ice Age. It’s top-quality animation in service of a less than top-quality script."}, {"rating": "10", "text": "I might of posted this before, but here it is again.One of the most underrated films I have ever seen, by FAR. It is one of the best films I have ever seen in general and deserves more attention then what it got. This movie sent me on an emotional roller-coaster ride, that no film has ever done for me before. This movie makes you emotionally engaged with not just the beautiful CGI, but also the characters in, once again, a way that has never done for me before as well. Just look up 1 picture of Arlo smiling and tell me that you don't want to smile at that. Exactly, no matter how hard I try, I just smile at it. So by far, an amazing film and honestly, in my eyes, this is the best of Pixar. DEFINATLEY go check this out."}, {"rating": "7", "text": "The Good Dinosaur is a fun enough movie, filled with the usual Disney-cliche where the parent dies and the kid feels a need to prove themselves. After timid and runt-of-the-litter dinosaur Arlo is swept away from home by a raging river, he begins his long adventure back home. Along the way, he meets a human child who acts very much like an uncivilized dog. Arlo names the child “Spot” and the two go on their adventure back home, meeting lots of new characters along the way. In conclusion, The Good Dinosaur is not exactly anything special, but it’s a heartwarming story about friendship and family. It does good in most parts, but when it falls, the plunder is evident. If you want something to do for a good hour, put this movie on. You may not be particularly enthralled, and you may not be moved at all when the credits roll by on-screen, but at least Spot is cute."}, {"rating": "8", "text": "So I never really felt the urge to watch this movie as I'm not really interested in dinosaurs and the promos for the movie didn’t look too interesting to me. Today it was recommended to me on Disney Plus so I decided to watch it and damn I did not expect to like it this much.One thing that was pretty unexpected was the role distribution. I expected for Arlo (the dinosaur) to be more like an animal that can’t talk and is treated like a pet and the boy, Spot, to talk and teach him things but it’s the exact opposite. Arlo can talk, while Spot doesn’t say a word and behaves like a dog. That was quite a suprise and a nice change since it’s usually always the other way around in movies like this.The next thing that I want to point out is the incredible animation. The animation is so good, the landscapes literally look real. Especially the water impressed me. Of course, the characters look more cartoonish because they aren’t supposed to look too realistic and are supposed to stand out but damn the landscapes and backgrounds? Beautiful.The plot reminds me a lot of \"Finding Nemo\" in some parts. A little boy who is not that brave and is different than the others gets lost and has to find his way back home and he gets help from others and finds new friends but also meets bad people along the way. Of course, a parent also dies while we’re at it (Arlo's father). So the plot is pretty predictable. Only after a few minutes I already knew that his father would die and then he did exactly in the moment where you'd expect him to die lol. That’s one negative thing, the fact the plot is so predictable. Another bad thing is the way that the animals eat each other. I know it’s part of nature and I‘d be okay with it if it wouldn’t happen over and over again. They’ve overdone it with the killing scenes in my opinion. The scene were Spot rips the head off of an insect can’t be good for children. Otherwise, I thought the movie was beautiful. I cried three or four times throughout the movie. I love the way that Spot is used in this movie. He doesn’t speak and has less screen time than you'd expect but he’s so much more than just Arlo's friend or sidekick. He’s kind of a metaphor. He steals the food on the farm and Arlo's father wants him to kill Spot. Arlo can’t do it because he’s too afraid of Spot. Arlo's father wants to help him beat his fear though and to do his job so they follow Spot and that’s when Arlo's father dies. After his father's death, Arlo makes Spot responsible for his dad‘s death and wants to kill him the next time he sees him. They both get carried away by the stream and that’s when their journey to find their way back home begins. On the way they face a lot of tough and dangerous situations and save each other multiple times. I’m gonna stop describing the plot and come to the point. What I‘m trying to say here is that killing Spot was Arlo’s job to get his mark and become brave but in the end, Arlo faced his fears and Spot was the one that helped him become brave. I can’t really describe it better than that and I‘m probably not making any sense but yeah, Spot has a very important role here. So all in all, \"The Good Dinosaur\" is a beautiful, extremely well animated movie, which I did not really expect but I like to be suprised. There are some funny scenes but also some extremely sad scenes that‘ll make everyone cry. The ending is pretty abrupt but still a full circle moment that made me cry."}, {"rating": "10", "text": "My grandchildren absolutely love this movieWhy are there adults posting reviews it’s a kids movieMy mrs and myself our daughter and hubby have sat with the kids at least 20 times each so yes we love it too"}, {"rating": "7", "text": "This movie has some flaws: the story is very straight forward, the animation doesn't focus on its tone, some non flashed out characters and those that are have little likeability in them. However, this is pretty good with a heartfelt story, some likable characters and great animation. This is a recommendation from me of you want something that doesn't afraid to be action pact and pretty horror at some points."}, {"rating": "7", "text": "The Good Dinosaur is a good family film with a couple minor issues, and while I don’t feel it quite beats its predecessor Inside Out, it’s still a good movie and I would really recommend taking your family to see it this Christmas if they haven’t got Star Wars tickets.  It feels like one of those films played at Christmas to give you a warm good hearted feel and that’s down to its good plot, great characters and its gorgeous animation even if the designs do feel like they slightly clash.  It’s not the most original film in the world, but it’s well made, well directed and it’s clearly made with a lot of heart and soul and is designed to entertain both the kids and the adults watching.  Keep an eye out for this film because I reckon it will stick around for a while.  While the 3D is good and it had some good moments, though it’s hardly essential.  The only major negative I had with this film was that its villains felt a bit tacked on and unnecessary."}, {"rating": "6", "text": "Being an animator and having a huge love and respect for Pixar, I wanted to love this movie. I had been looking forward to it for months but it after seeing it I fell like they just missed the mark. The character design felt completely out of place from the environments and even between Spot and Arlo. The most obvious of all was the lack of story. It didn't seem like they really nailed down the story in the development phase before moving into production. Not their best one, but still had a few good laughs."}, {"rating": "6", "text": "The Good Dinosaur is one beautiful animated movie with many creativity elements in it, but the movie itself sadly doesn't hold up. The story isn't anything special, it's very predictable at times and overall it was really disappointing. It's not bad as some people say, but it's not great"}, {"rating": "6", "text": "I'm starting to think it's me and not Pixar.  The magic is mostly gone and it may not be their fault.  Was it the novelty of the CG animation in all its newness that eventually wore away over 20 years?  Have all the spins on familiar archetypal stories been used up?  Has the wit become par for the course?  I don't know exactly, but while I can see nothing particularly wrong with this movie, it didn't hold my interest strongly either.  All the elements seem to be in place and as astutely executed as ever with stunning visual detail and clever humor throughout.  The over-arching story is so familiar though.  This time it comes off as been there done that once too often, but for kids it's still great I'm sure.  The best of Pixar works exceedingly well for all."}, {"rating": "6", "text": "The Good Dinosaur may be perhaps one of the most frustrating viewing experiences I've had at any Pixar movie. On the one hand, it is one of the most technically impressive films the studio has done, with near photorealistic environments and incredible attention to detail in the characters. Furthermore, the characters are all, for the most part, quite memorable, and there are moments of excellent visual storytelling that match the studio's typical high mark in quality. At the same time, The Good Dinosaur has almost as many frustrating moments, where the plot falls into cliches, where the storytelling becomes on the nose and rushed, and where the bad parts often times stand out more, unfortunately, because of the glimmers of brilliance throughout. The Good Dinosaur still lives up to the name of being \"good\", but in a movie where it had the potential to be \"excellent\", I cannot say that I'm not slightly disappointed."}, {"rating": "4", "text": "After the visual masterpiece that is Inside Out, I thought Pixar had returned completely back to form, but its \"new\" directors continue to bring the company and its films down. The Good Dinosaur is not a film worthy of the Pixar name. Even though its animation is gorgeous and the relationship between Arlo and his human companion Spot is great, it struggles strongly in the story department. The film feels very formulaic and I became generally disinterested in it about 45 minutes in. It also has very simple themes which don't stand up, even in comparison to Pixar's worst films. It's a cute movie, but far from a great one due to its unoriginal and bland story. Pixar needs to utilize its vets rather than giving projects to its rookie directors."}, {"rating": "7", "text": "The Good Dinosaur is another highly enjoyable film from Pixar, even if it doesn't reach the heights of the studio's best. As can be expected from a Pixar film, the animation was stunning. I'd even go as far as to say, it just might be one of their most visually amazing films to date. It wasn't as deep or groundbreaking as \"Inside Out\" but when you think about it, few movies are. The protagonists, Arlo and Spot were both very likeable and Sam Elliot gave a solid vocal performance as Butch the T-Rex. Speaking of T-Rexes, I think Pixar deserve some recognition for making him a good guy rather than a villain or an obstacle, like most dinosaur movies do. As well as visually stunning, the movie was quite emotional- which isn't surprising for a Pixar movie. So overall, while it lacks the complexity of previous Pixar films, The Good Dinosaur makes up for this with beautiful animation and heartfelt emotion."}, {"rating": "10", "text": "For 2 years, Monsters University was the best Pixar movie I ever saw. Then this film came along. I got to say, when I saw the trailer for this movie, I was kind of disappointed. I expected this film to be terrible. But I saw the film and I didn't regret it. Not one bit. The film is my second favorite movie of all time currently. The animation is stellar, the characters are hilarious and the plot is incredible. So basically a kid named Arlo's dad dies (which is the first time that ever happened in a Pixar movie) and he blames the human-dog kid, soon to be named Spot. The two of them get lost in the middle of nowhere and try to get home. It has old classic Pixar comedy, and lots of fun voices, such as Jeffrey Wright, Sam Elliot and even Steve Zahn as the villain. In total, The Good Dinosaur is a definite watch and a 10/10."}, {"rating": "6", "text": "I'm really conflicted on this one. On the one hand, the photo-realistic landscapes are stunningly gorgeous and there are some shots (the setting sun and the T-Rex ranchers) that will take your breath away. Some of the best moments in this film are told cinematically, without any dialogue whatsoever.\r On the other hand, the story is so basic and the beats so predictable that most adults will have checked out by the time the film takes its sweet time winding down to its conclusion, which seems more like a relief than a revelation.\r Don't get me wrong, there are some seriously quality scenes (the campfire with the T-Rexes, the way Arlo learns to swim, the 'howling' scene) but the whole is way less than the sum of its parts (some of which strongly resemble \"The Lion King\" and \"The Land Before Time\", both of which are clearly better films). Director Pete Sohn does his best and nails the visual tone poem side of things, but there's really only so far you can take this bare-bones coming-of-age-and-overcoming-your-fears story, especially since Pixar's \"storyboard-by-committee\" technique has lately resulted in their films playing it super safe so that the message translates into global box office. I'm fine with people all over the world being able to relate to their films on a deep level, but when shooting for the lowest common denominator gets to the point of robbing the work of personality and leaving the audience with a third act that runs on cruise control, it's time to dial it back a notch.\r When your kid-friendly dinosaur film gets most of its personality from characters' accents, that's when you know the fact that your leads are actual DINOSAURS is underutilized and under-emphasized (throughout, the movie plays it straight, treating dinosaurs as Wild West-era Americans, and Spot as a kind of dog-human hybrid). The lead, Arlo, is actually one of the film's big problems, because the kid that voices him is so annoying I wanted to walk into the voice recording booth and shove a sock in his mouth.\r Also, just so you all know, the dinosaurs are not meant to represent actual dinosaurs, but rather dinosaurs as they might have been in something likely closer to modern times had they not been wiped out.\r I have been a Pixar fan since the beginning, but after \"Up\", their output has been really uneven, with the exception of \"Inside Out\", which was really well put-together but did not portray the workings of the brain with anything resembling reality. With \"The Good Dinosaur,\" if Pixar either eschewed a script altogether and made an experimental dialogue-free film that emphasized the landscapes and mise-en-scene, or cranked out a halfway decent script that wasn't riddled with cliches, this might have even been deserving of being ranked with the likes of \"Wall-E\" and \"Finding Nemo\". Instead, it's just slightly better than \"Brave\" and \"Cars 2\".\r I am giving this a 6 because I felt like it could have been so much more. Everything about this film is a missed opportunity. It was a waste of some beautiful backgrounds to pair them up with such ugly character designs, a waste of great voice talent by having them recite a script that nearly put me to sleep, and a waste of the time of their adult audience members, whose kids will probably enjoy this film once or twice but quickly get bored."}, {"rating": "10", "text": "Ok, I honestly do not get what the mixed and negative comments are all about-because this movie was breathtaking. This movie not only left you on your edge of your seat through Arlo's wild journey, but it also warmed your heart, and made you cry your eyes out. Every single time I walk out of a Disney movie, I always say the same thing: \"I knew it would be good, but not that good\", and let me tell you, this time was certainly no exception. I get easily moved by movies, but hardly ever cry. In this movie, I actually cried at the beauty, symbolism, and heart-warming feels which Disney and Pixar surely delivered on. Honestly, this is a great movie for kids and adults to see, as there is something for everyone, and surely a movie which will leave you wanting more."}, {"rating": "9", "text": "Great Pixar movie, the animation is absolutely fantastic, probably the best ever made for an animated film, the landscapes, the animals and all the little touches like water effects were breath-taking. On a technical standpoint, it gets an A+++. Now for the movie itself it is not as amazing as the animation, but it is still very good. The voice actors are great, the story is very simple  and not that original, but coherent and investing and the strongest point of the film besides a technical tour de force, is its heart. It is very emotionally rich and gut wrenching at times. I think the movie deserves way more credit than it got, it is without any doubt worthy of the Pixar studio quality standard they set for themselves since Toy Story."}, {"rating": "7", "text": "Being Pixar, The Good Dinosaur was a must-see. This new take on dinosaurs was interesting to see play out, but the movie seemed to get lost at the point where it is so focused on Arlo earning his mark and becoming a part of the family. That is where the magic was lost.\r With unexpected frights and turns mixed in, the movie retained some quality. It was scary enough for the kids in the theater to whimper in distress. I just wonder why Pixar felt the need to follow this stereotypical storyline and arc of returning home and proving one's self worth.\r Spot being a human was not as much of a surprise or oddity as the creators would have liked us to believe – this is an imaginative world, after all. Anything is possible, but instead we are sticking with the beings that we are – and a world that we know has never existed. Humans and dinosaurs do not exist together. I would say that nobody even wants to see a world where such a relationship exists, but I am not the target audience of this film. What the audience wants to see is not my choice."}, {"rating": "7", "text": "\" The Good Dinosaur \" is a good piece of Disney - Pixar waiting to be moving , but only in one scene, it 's actually very funny, also with a surprising reflection, a good movie."}, {"rating": "7", "text": "The reason I saw The Good Dinosaur is whether the critics were right. Many said it was very good, others said it was bad, but after seeing it I thought it was... good. Not bad, it is not that great and not reach of the height of Inside Out, is just good. The Problems of The Good Dinosaur are 1- The script is cliché (Arlo's father dies, \"that original\") 2 The villains, I thought it was a story that needed no villains like Inside Out, but surprise, they had villains. Thunderclap and his team of \"rescuers\" want to eat the caveman boy. That's pretty stupid, they have thousands of stray animals and just want to eat one. And 3- the designs of the characters they don't fit with the beautifusl and realistics backgrounds. Why they didn't do betters designs and look realistic as Dinosaur (2000)?. and I thought it would be the worst of Pixar, but it is not so bad. The backgrounds are beautiful, the voices are decent, the animation is good and the music is beautiful, but the problem of The Good Dinosaur is that don't feel like a Pixar film is more Disney. But at least no worse than Cars 2. I happy i having i saw and has not obtained the nomination to the academy. They didn't deserve it"}, {"rating": "7", "text": "minha irmã queria assistir tanto este filme que acabamos por ir ao cinema vê-lo e, sinceramente, me decepcionou um pouco, com tudo o que eles tinham falado, com aquele trailer e tudo isso, achei que seria um filme bem melhor, não é ruim, claro, mas é bem mediano."}, {"rating": "9", "text": "If a rat can be lovable.There is no doubt that pixar can make a cowardly green apatosaur can be lovable. It is just so enjoyable and I am glad I got to see the premier of the movie."}, {"rating": "9", "text": "\"The Good Dinosaur\" is breathtakingly gorgeous and tells an incredibly emotional and heartfelt tale. The ending is abrupt, but i'd be lying if I said it didn't make me tear up. One of the most watchable films of the year, a great time at the movies."}, {"rating": "8", "text": "Simple, straightforward and predictable, the second Pixar's production of the year might not be creative as usual, appear to be familiar and formulaic plot but overall still has no problem to become a holiday enjoyment of the young and the old one. The main part of the story sets between human and the dinosaur based on a reversed formula which the dinosaur talks; it is a smooth A to Z educational animation which is filled with a lot of positive values that intends to influence the young adults. Presented in colorful photorealistic sets, it is visually stunning and there are certainly some beautiful scenes without any single dialogue, which effectively works well just like Wall-E, together with satisfying scores from academy awards winner Mychael Danna (Life of Pi). The adventure of grow and learn, cherishing family bonding and appreciating the value of friendship are the three major elements of usual Pixar's trademark, not only adorable, charming and family-friendly, but also emotionally engaging at certain times that might challenge audiences tear holding power.\r Short Film: Sanjay's Super Team\rSimilar to the film, strong family bonding element in between the father and son, effectively presented without dialogue (except final scene), strong culture element and creatively featuring Gods as superheroes warriors."}, {"rating": "7", "text": "While probably Pixar's most visually stunning film to date, The Good Dinosaur is also one of Pixar's greatest disappointments and feels more like a Dreamworks film than a Pixar film."}, {"rating": "9", "text": "What separates the good dinosaur from inside out, and why it is better than inside out, is the ballsy brutality that this dinosaur, Arlo, faces, the pain he suffers is naturalistic and bruising. So the climactic end is nothing  short of heart pounding. I really also enjoyed how they chose stylised american accents to make this journey seem like a USA road trip. Some T-rex's from Texas and some Pterodactyls straight from the likes of Fargo. And talk about an lushly animated environment to drool over, a flaw may come from a slight contrast with the cartoonish dinosaurs and the script doesn't delve into anything that complex, although there are some truly heart found messages."}, {"rating": "2", "text": "Doesn't Feel Like A Pixar Movie [average CGI, silly storyline...worst Pixar movie I'v seen so far]\rMost of the reason I saw this movie is because I will always watch a Pixar movie despite the fact that they have mess up quite a bit lately. This movie, in my opinion, is more proof to show that Pixar has sort of lost it. Thanks to Inside Out, I will still give Pixar movies a fair chance in the future, but if they end up like this movie, I will no longer be giving Pixar a good name. Below average, will be forgotten very soon."}, {"rating": "7", "text": "This takes place in a different Wild West: One in which the dinosaurs are not extinct, but are farmers. One young dino gets lost and has adventures that help him conquer his fears. Along the way he befriends a caveboy. This movie's greatest asset is the stunning landscapes. Not only are they gorgeous, but look completely realistic. On the other hand, the creatures have a more stylistic cartoon look, which is a bit of a mismatch. This is also the darkest film in the studio's history (lots of danger and death) and it rambles into weird territory (literally and figuratively). Despite its flaws, it still manages to some sweet characters and a gentle lesson. Pixar most unusual short plays before the feature: \"Sanjay's Super Team\" is about an Indian boy who intersperses his superheroes with Hindu gods."}, {"rating": "7", "text": "The really wild bunch…\r Simplicity is the ultimate sophistication, was a phrase the late Pixar co-founder Steve Jobs was fond of, and it could almost be a maxim for The Good Dinosaur. 2015 marks the first time two Pixar films have been released in one year, and in a lot of respects, this second effort couldn't be more different from summer’s Inside Out.\r While the first 2015 Pixar film out of the gate gloried in its complexity, personifying emotions and making tweenage brain processes of a piece with the action, The Good Dinosaur – as the title hints – feels at heart like a child’s picture book, from the bright, colourful characters, to the simple linear plot.\r That comparison isn’t intended as an insult; this is a rich and rewarding family film. That it doesn’t quite reach Pixar’s highest standards for invention and storytelling verve is unfortunately exacerbated by its proximity to the insta-masterpiece released earlier this year.\r The fact that two Pixar films ended up being released in the same year is down to well-documented production problems: The Good Dinosaur was postponed when original co-director Bob Peterson was moved to a different project, leaving Peter Sohn (director of short Partly Cloudy) solely at the helm.\r The film that’s been salvaged kicks off 65 million years ago, with the asteroid destined to destroy Earth narrowly missing, meaning that some millions of years later, humans and dinosaurs co-exist.\r As the story proper begins, dino-parents Momma (Frances McDormand) and Poppa (Jeffrey Wright) raise three kids on their farm. Gangly Arlo (voiced by Jack McGraw, and later, when he’s a little older, by Raymond Ochoa) is the runt of the litter, struggling to live up to his father’s expectations.\r Oddly, the family are farmers, ploughing fields and tending to crops, but this particular concept of industrial dinosaurs isn't really explored much after tragedy strikes and Arlo finds himself lost in the wilderness, with only a feral human child named Spot for company. Maybe the idea was played down as part of the behind-the-scenes shake-up, as none of the other dinosaurs Arlo encounters on his journey have evolved to use machinery.\r A four-legged, long-necked klutz, Arlo is ostensibly an Apatosaurus, but that sort of information isn't offered up readily. The filmmakers might earn a few science points for giving some Velociraptor-like beasts feathers, but it’s likely that these dinosaurs will simply be classified as ‘the green one’, ‘the funny one’, ‘the scary one’, as opposed to any technical genus. It feels like a confident, conscious decision, rather than a lack of research (although as is always the case, the food chain is glossed over).\r The bold hues of the prehistoric creatures only stand to make the mountainous backdrops all the more stunning. Paying homage to the western with lush ranges and treacherous rivers (even some cattle herding), the scenery is among the most beautiful to ever spring from a computer, and the rain is so gorgeously executed you can practically smell it.\r That landscape certainly gives Arlo a rough time of it – battered, bruised and tormented, he’s one of the more put-upon animated heroes of recent times, and some of the rival species he comes across could prove a touch too scary for the youngest viewers. One scene, in which a pack of helpers turn threatening on a dime is genuinely tense. There’s also a nice balance of adult-friendly gags (fermented berries! Paranoid triceratops!) thrown in with the visual humour, while pop-culture references are pretty much absent.\r Where TGD really comes into its own is in Arlo’s interactions with Spot. Sohn has always been upfront about this being a ‘boy and his dog’ story, with the killer Pixar twist here being that the human is the dog. Arlo and Spot form the customary road-tripping odd couple that’s become as much as mark of Pixar as the Luxo lamp.\r While Arlo will no doubt sell more merchandise, Spot is an incredible creation, skittish, snarling, scrambling around on all fours. The inevitable relationship that develops between the two has real heart, and will have you feigning grit in your eye more than once. In one of the finest moments, Sohn musters more emotion with stick figures and dirt than lesser animations manage in a whole movie.\r Certain flaws keep The Good Dinosaur from earning a spot on the Pixar podium. For all the scares thrown in en route, it never really feels that Arlo is ever that far away from home. The parental figures have a tendency to talk in platitudes, and the human/prehistoric creatures don’t feel as fresh as some other Pixar creations; this territory won't feel entirely unfamiliar to anyone who's seen Ice Age or The Croods. But for a film of uncomplicated pleasures, there's much to delight in.\r Simple but effective, The Good Dinosaur doesn’t reinvent the wheel, but it’s still damn fine family entertainment. Slow to get going, it comes into its own when its heroes buddy up."}, {"rating": "3", "text": "I used to love most Pixar movies but this one is just weird.   Not only do I not feel it's appropriate for kids I don't even feel it's appropriate for adults.    It seems like it's trying to teach a lesson but the only less I got was that you need to kill people when your dad tells you to or you're a wimp that is basically responsible if your family dies.   It made even less sense than that when I was in the theatre.   It's like the movie makers were on weird drugs and had only read about the real world in comic books.    The animation was really impressive but the story was truly twisted and nonsensical with on random disconnected scene after another ending with the longest goodbye scene yet put on film.   No more 'kids' films for me!   Wow."}, {"rating": "1", "text": "I admit this review might be sort of unfair. Why? Because I fell asleep somewhere in the middle. But hey-- that's not a great sign is it??\r What makes this film unique and interesting? It starts and ends with the premise. \"What if the Dinosaurs survived? What happens then?\" Apparently, not much! I don't even know how the premise relates to the actual story... If altering the course of the earth and creating a parallel universe was all just so some little kid could meet up with a dinosaur and become 'sorta friends'.. then I'm sorry, that's just a total waste of a premise.\r From there on, you can approach this film two ways: Frustratingly illogical... or just incredibly bland and repetitive. I understand the production underwent a lot of revisions/problems and there were probably 30 uncredited writers on the film. It definitely shows. It feels safe and at times lacking strong direction or purpose. Why's the main character the 'Good' Dinosaur anyway? What did he do that was so good? And why the hell are they farming?? How the hell did they figure out how to farm? How many animals are smart enough to start farming? Why not give them blue jeans and eyeglasses while you're at it?\r The worst was the last scene, that was begging to be a tear jerker; in the end the dinosaur and the kid can't be together. The kid needs to be taken in by some RANDOM FAMILY THAT HE NEVER MET IN HIS LIFE. Why would you leave this kid with a bunch of strangers, that for all we know could be cannibals?? Why can't he just stay with his dinosaur friend? Because they don't look the same? Isn't that called segregation?\r Ohhh I know. Because they want to make it all sad and touchy-feely. Fine. Whatever. I'm tearing up because of how hard it's trying. It's pathetic. And it's just a terrible message.\r Aside from the story, I was not very impressed with the characters designs (aside from maybe the little cave boy) or art direction. They just felt super basic and unoriginal. A lot of the secondary characters felt like they were lifted right out of Ice Age. Sure, the environments felt super realistic and golly gee whiz, that sure is a great accomplishment. Technically. But c'mon.. how about being creative with things? If I want to see a photo realistic flower... I'll watch National Geographic. You just spent millions of dollars trying to make a 3D tree look like a real tree... why not just shoot video of a real tree if that's what you want. Ugh.\r The Croods (2013) may have had it's flaws, but it was so much better on every level. Go watch that instead."}, {"rating": "7", "text": "If it were not for the fact that the animation was beautiful, I would have left a mixed review. I felt the movie was too short, and that it should have had a better story. But what everyone is saying is true, the animation was some of the best we've ever seen in a movie, and the voice acting performances were great too. I just felt like so much was missing."}, {"rating": "8", "text": "The Good Dinosaur is predictable and has a simple plot, but executes it with rich attention to detail, beautiful animation and a lot of emotion. Another great film by Pixar."}, {"rating": "7", "text": "The Good Dinosaur is not as good as Inside Out, but it'll be another well-worth movie to see for your Pixar collection once it comes out on Blu-ray. For Pixar's year in 2015, I will say Inside Out is better than the Good Dinosaur, but this one's still enjoyable anyways."}, {"rating": "9", "text": "The Good Dinosaur is a beauty. Pixar returns with a great friendship story that will make you laugh, smile, and even cry. This is, by far, the best animated movie of 2015, and one of the best movies of 2015 itself."}, {"rating": "10", "text": "The Good Dinosaur is a visually stunning film and a good hearted  family friendly story for the whole family to enjoy. The richness and detail of the animation is unlike anything that has come out before."}, {"rating": "6", "text": "Good Dinosaur, Bad Movie?\rOK, OK, “The Good Dinosaur” was not really a bad movie. But Disney/Pixar, and we the public audience along with it, have set the bar pretty high for its films. When “Finding Nemo” was announced, I scoffed at the idea of a movie about the ocean and a couple fish. I watched it, and it became one of my favorite movies. “Toy Story 3” came out years after its predecessors, and it brought along a darker tone and heavier moments, but it all worked so well and we felt like we were continuing life’s journey with the favorite childhood toy characters again. I generally liked all Pixar/Disney movies, to varying degrees. That being said, I definitely had high hopes for “The Good Dinosaur.” After all, dinosaurs alone sound more exciting than a couple of fish in the sea, right?\r [SPOILER ALERT]\r“The Good Dinosaur” (TGD) has its moments. There are the clear values of family and the life lesson of growing up and facing your fears (seriously, that is mentioned aloud how many times in the movie?). There are the emotional, tear-jerking scenes. There is character development and growth (to an extent) in an obvious plotline.\rBut something about “TGD” was different. What sticks out the most is the portrayal of the human characters in this alternate universe. Some may call it dehumanizing, because that’s exactly what it is. But that word only makes sense in a world where we have become the top intellectual species. It’s humbling (and amusing) to think of what might have been if the history of the Earth had taken a different path. So I could suspend the awkward feelings I initially had when I first saw Spot, thinking it would ultimately teach a lesson about us humans in the world (just as “Wall-E” criticized society). But I doubt TGD meant anything more by it than I already mentioned; it was just an alternate universe where humans did not come out on top.\r There were a lot of scenes atypical of Disney/Pixar movies. They caught me by surprise. The movie didn’t seem completely kid-friendly, a notion validated by its “PG” rating. There were barbaric moments, including Spot with the bug’s head and Thunderclaw with the “free critter.” I really had to ask myself, “Is this really a Disney/Pixar movie?? This movie just keeps getting weirder.” So by the time Spot took a chunk out of Thunderclaw’s wing, I was unfazed. Then there was the moment with the bad fruit/psychedelic/drug-suggesting scene. Was that really necessary??\r Ultimately, TGD ended too soon for me. Not as in “this movie is so good I need more of it!” but rather, it felt incomplete. Personally, I didn’t experience catharsis (the emotional release you feel at the end of a story/movie when everything is resolved). I still had questions, and I’m not sure I was OK with how everything worked out. Arlo’s “Poppa” died, and Arlo no longer blamed it on Spot. I’m guessing Arlo realized that if he hadn’t been afraid to do his “job” earlier, his father would still be alive. So Arlo realizes the blame lies largely with him and his fears. But his job was to MURDER a critter (Spot), and what lesson was his dad teaching him there? Hello, is this a Disney/Pixar movie, advocating killing?? Poppa was quite nonchalant about it, too. Ignoring that, has Arlo vindicated himself by the end? Has he grown enough to compensate for his father’s death? That I am not sure of. There’s also that weird moment with Arlo talking to his Poppa in his imagination, and Arlo exclaims that he loves Spot. Uhm, weird, even just the WAY he said it. Half the movie, he blames Spot for his father’s tragic death, and then Arlo loves Spot like a young boy loves his beloved pet dog. Character growth/development? I guess\r Then there are the logical flaws, but suspension of disbelief is required in most movies. For fun, I’ll still point out a few. Somehow, Spot travels the entire distance Arlo got washed down the river. That is impressive, judging by the return journey Arlo takes home. Secondly, Arlo gets caught full force by the mudslide/raging torrents of water AND falls down a waterfall, and somehow survives. But his tough Poppa died from a similar fate??  Not to mention the endless hits Arlo sustained to his head. And lastly, just to be nit-picky, Arlo draws the circle in the ground around Spot and his family without moving from his standing spot. He’s not tall enough nor does he have a neck long enough to realistically do that.\rI look at the positives of this film. The scenery and animations are gorgeous, top-notched. Emotions are jerked, laughs had. Lessons can be found. There are clever play on words/ideas (storm birds, the scene with their “head in the clouds,” Spot as a “lone wolf”).Let’s say that I accept that the film requires a more mature perspective, and that the uncharacteristic scenes mentioned above ultimately don’t bother me. Would I say TGD is a good movie? Sadly no. It was just lacking for me. It didn’t feel as complete as all of Disney/Pixar’s other works."}, {"rating": "9", "text": "Now this might stir some controversy but I’m going to say it anyway; I enjoyed The Good Dinosaur more than Inside Out. Now let me explain.\rTGD has a far more typical and formulaic plot and premise to what was happening which is why it may not have been seen as highly as Inside Out due to that having its original premise, but TGD’s is far more fully realised and executed better.\rI found the film was more emotional, with the reason for the events of the film taking place actually making me a bit upset due to how well they executed it. Albeit this, the film has more laughs per minute than Inside Out and hits its jokes well. The film is oddly a bit more mature, with a hysterical but rather worrying drug trip sequence and even Dinosaurs eating other Dinosaurs on screen. I mean WHAT THE F**K…. a kid bites off a bugs head. It’s savage and kinda shocking but also makes you laugh at how unexpected it is! I think this adds a more serious tone over the film which is why it is a PG but it is still definitely a kids film. I mean look at it like this kids aren’t stupid; if they like Dinosaurs or know anything about Dinosaurs then they know they eat each other. Don’t undermine then and speak on behalf of them saying they will not enjoy that.\rNow, the animation in this film is by far the best Pixar have ever released. Everything almost looks real, with photorealistic water and focus shots that really make it a cinematic marvel to be honest. The characters in the film are all pretty quirky too, and really offer up some loveable and memorable ones that add to the film. I also prefer the character design to Inside Out’s, as I found them a bit too glittery and fluffy In animation.\rEither way, both films are great, but I think TGD is the better one really as it seriously takes risks and gets rewarded for it. I would like to see more from Peter Sohn at Pixar, he really has a good eye for things and the writers did a great job. Additionally, I must say I think the ending was played on between the two main characters a little too much, but hardly detracts from the rest of this films charm. I will round my score up as I think it deserves it. Check this one out!!\r8.5/10"}, {"rating": "9", "text": "ok took ,my sister to see this movie last night and it was a high emotional journy 'on every level ' first u were laughing then crying then doing both all over agin it shows what a true friendship can be it was too sweet for words i cant help but suggest this movie to anyone and everyone sweet family fun for almost all ages just be careful with really small kidos"}], "recommendations": ["raya_and_the_last_dragon", "the_croods", "brave", "turbo", "how_to_train_your_dragon_2", "next_gen", "how_to_train_your_dragon_the_hidden_world", "okja", "the_boxtrolls", "bumblebee", "incredibles_2", "the_iron_giant", "finding_nemo", "rio_2", "smallfoot", "frozen_ii", "onward", "super_8", "cloudy_with_a_chance_of_meatballs_2", "big_hero_6", "the_secret_life_of_pets", "the_polar_express", "the_call_of_the_wild", "smurfs_the_lost_village", "the_incredibles"]}