{
  "id": 3772,
  "title": "The Core",
  "starring": [
    "Aaron Eckhart",
    "Hilary Swank"
  ],
  "runtime": 136,
  "genre": [
    "Action",
    "Thriller",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Geophysicist Dr. Josh Keyes discovers that an unknown force has caused the earth's inner core to stop rotating. With the planet's magnetic field rapidly deteriorating, our atmosphere literally starts to come apart at the seams with catastrophic consequences. To resolve the crisis, Keyes, along with a team of the world's most gifted scientists, travel into the earth's core. Their mission: detonate a device that will reactivate the core.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jaG2vih2z4V5fP9pnYSIL65lr8d.jpg",
  "categories": {
    "plot": 5.111111111111111,
    "acting": 6.857142857142857,
    "ending": 3.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.8,
    "funny": 7.0,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The characters are a bit arrogant and the USA is \"of course\" the only country, who can save the world. This movie could be more interesting or have a better atmosphere, which I think is quite important for a space movie. The science isn't so important for me since it's still a science-FICTION-movie. But I unfortunately miss a (deep) meaning to this movie.\r I don't know why people think \"Armageddon\" would be better. Has it more \"cool\" scenes? Because unlike it, \"The Core\" has more serious characters, some mysterious scenes and even a more interesting travel. Why should \"Armageddon\" deserve some Oscar-nominations and \"The Core\" not even a simple nomination?"
    },
    {
      "rating": "0",
      "text": "Wow. I hope no one got paid for writing this. This has got to have one of the worst plots of any film with some of the biggest holes ever (no pun intended)."
    },
    {
      "rating": "0",
      "text": "This movie is the worst piece of shit I have ever seen in my life! i nearly fell asleep!"
    },
    {
      "rating": "6",
      "text": "An enjoyable and exciting action movie with silly science. Not quite \"so bad it's good\" but certainly a guilty pleasure. A good cast though they are largely wasted. As long as you don't get too worked up by the bad science you might find that you are enjoying yourself."
    },
    {
      "rating": "7",
      "text": "The story is highly improbable, not credible (pigeons tearing bullet holes through plate glass windows[!?!], hysterical, ill-trained \"terranauts\", a terraship infinitely more complicated than the \"Manhattan Project\" built in 90 days, static electrical storms that feature lightning strikes that blow up things instead of going to ground) BUT the story was FUN!  It was a hell of a ride if we can turn off our skeptical minds for a couple of hours.  The production values were excellent.  The principle actors and their director did really well with a comic-book script.  Swank, Eckart, Tucci were great and their interplay with the others in the crews of the ship and \"Houston-on-Surface\" were the credible features of the film.\rThink about it this way: had you gone with your kids, they would have loved it!  The \"zero\" reviewers need to lighten up.  My 8 year old gave it a \"ten\" and her pleasure was good enough for me.  I give it a borderline pass and a score of 65."
    },
    {
      "rating": "5",
      "text": "Terrible disaster movie wastes it's decent cast and production value on a very weak popcorn movie script. The effects have aged terribly and there are just too many leaps of logic for it to work as a concept. Still. Despite all that for the mood I was in it was quite fun."
    },
    {
      "rating": "5",
      "text": "The Core: 5/10: Disaster movies always seem to do better when the disaster is local in scope. A city threatened by avalanche, a tower threatened by an inferno, a Poseidon threatened by an adventure, that kind of thing. Earth killer movies are always a harder road.\r You have your 4 standard horseman of the earth disaster; nuclear war, space invaders, plagues (esp. those that create zombies), and meteors. Lately earth killing movies have gotten creative and lets face it stupid, global warming (The Day after Tomorrow), President George W Bush (Fahrenheit 911) and now The Core with it's well… I'm still not sure what broke.\r The core of the earth stopped spinning (not the earth itself mind you) which is causing the electromagnetic field to dissipate. Okay, that sounds serious. So that would cause what exactly? Apparently the movie wasn't all that sure so we get scenes of some the lamest and implausible disasters ever. Lets put two under the scientific microphone shall we.\r One involves birds going all Hitchcock in London due to their inability to navigate using the magnetic field. Okay that may effect the birds ability to fly south (Oh my god the pigeons they're going east!), but even the Mr. Magoo of the avian world wouldn't start flying into statues and buses.\r In another all too short montage a lightning storm destroys the Roman Coliseum. I'm not sure what is more unlikely, lighting striking relatively short rock structures, or the granite exploding when it does. Lightning, last time I checked, was attracted to metal.\r But what would you expect from a movie that puts a giant windshield in a rock-drilling machine (Made with that magic metal Unobtainium). Keep in mind I've only scratched the surface of the silliness.\r Acting wise Stanley Tucci is a joy, Hillary Swank still kind of looks like a guy, and everyone else is forgettable. The Core is enjoyable in that bad 50's sci-fi kind of way. But they needed more (and more plausible) disasters, and much less well everything else."
    },
    {
      "rating": "4",
      "text": "It's like that 20,000 Leagues Under the Sea novel, but instead of sea, you get core and instead of leagues, you get degrees. The core is actually 10,832 °F, but what's with the extra 9,168 °F? Try to figure that question out to yourself."
    },
    {
      "rating": "5",
      "text": "The Core is probably the most stupid and unrealistic film disaster. Even the film \"2012\" seems more scientific. The Core is very similar to Armageddon, but inferior to it in everything. Suspense is not enough for the whole film, the ending so generally spoils the impression. Humanity has no opportunity to fly to the moon for more than half a century, but you can drill a hole to the center of the planet and return back. One of the most delusional films"
    },
    {
      "rating": "5",
      "text": "Some innovative ideas, but unfortunately it ultimately leads to the overbearing Hollywood-action clichés, which the movie desperately tried to avoid with its distinctive A+ casting supported by great sci-fi references. Overall it's not good nor bad, simply average. You could like it or hate it."
    },
    {
      "rating": "2",
      "text": "A disastrous disaster film.In this film the Earth's core stops spinning, which promises to cause chaos and put an end to life on Earth, so they need someone to go to the center of the Earth and bust some bombs to the core resume's spinning. Directed by Jon Amiel, the film has screenplay by Cooper Layne and John Rogers. The cast attended, among others, Aaron Eckhart, Hilary Swank, Bruce Greenwood and Stanley Tucci.This short presentation I wrote seems to suggest that this movie was somehow inspired by the Verne's novel \"Journey to the Center of the Earth\". I don't know if it was indeed but chances are yes, as the central idea of ​​the plot is the journey to the core, regardless of the reason. Therefore, the idea is good and would have given an excellent movie if production had sought best scientific advisers to assist them. Yes, because the biggest problem with this film is the complete and utter lack of logic and plausibility.All right, when a scientific film is done there is always some mistakes but the production seems to think that the audience is totally stupid. In the past, the Earth's magnetic field has undergone changes that never led to mass extinctions, and the idea of ​​\"killers holes\" in atmosphere, melting bridges thanks to solar radiation, is so absurd that fancy ask the writers if they think that we didn't go to school. There are other situations and stupid ideas in the film, which is an affront to the intelligence of those who perceive science or, at least, attended high school.In addition to these important details concerning credibility, its necessary to say that the cast didn't shine. Most actors complied well with its function but there was any notable interpretation or worthy of some spotlight. Conclusion: \"The Core\" is a great movie for stupid people, or those who want special effects without bothering with the plot. Everyone else, don't worry, there are always other movies to see."
    },
    {
      "rating": "4",
      "text": "Not a bad film, but the story is simply too stupid. Going to the core of the earth? That is total rubbish. However, at least there is some excitment."
    },
    {
      "rating": "0",
      "text": "The label of \"science fiction\" doesn't mean you get to do whatever you want and expect audiences to believe it."
    },
    {
      "rating": "10",
      "text": "I love this movie!  I show it to my high school students every year when we talk about Earth structure and the dynamo in which the rotating liquid outer core generates a magnetic field.  The acting is emotional and realistic. I've seen this film probably a hundred times and it still gives me goose bumps i.e. \"Why didn't you do it!\" This film rocks!  I think those that are very critical don't understand the science of the film and therefore don't appreciate the subtle ways in which it was expressed. I will take this film with me to the grave lol."
    },
    {
      "rating": "6",
      "text": "The movie is science fiction proving scientific theories wrong still the movie is brought as a good job."
    },
    {
      "rating": "6",
      "text": "This movie is quite interesting.. But then it's really impossible for them to go onto the core!! their ship must have melt even if they're still on the mantle!! haha... but it really made me laugh!"
    },
    {
      "rating": "8",
      "text": "I really liked this movie. Sure, it wasn't as deep as \"Truman Show\", but it was gripping and the characters were better than in \"Poseidon\". And no, if you are a physical scientist, who just stumbled over this movie by chance: do not watch it! It is not the most truthful movie in the world! But then, which movie Hollywood ever produced was?"
    },
    {
      "rating": "10",
      "text": "I loved it."
    },
    {
      "rating": "7",
      "text": "rated best for the amazing effects and twists and funny bits, but worst due to nonsensical bits which in fact, the mantle cant stop spinning for no reason at least it was good although somewhat scary. despite the plot holes and badly done bits, it was, in fact, AWESOME!!!!"
    },
    {
      "rating": "10",
      "text": "This movie was a fast. Quick, pace thriller. I cannot believe the awful reviews they gave tom this movie. I loved it. I really did. The Core showed me that everything that is impossible can be possible. Don't listen to the critics of those who just like movies with woman. Listen to me... You are going to LOVE it!"
    },
    {
      "rating": "8",
      "text": "After being initially disgusted by the sheer stupidity of this film, i've gradually come to love it for the same reason. No disaster movie is more memorable than this one; with the eye-poppingly bad science simply adding to the charm."
    },
    {
      "rating": "10",
      "text": "I love this film. I don't care about the plot-holes and implausibility"
    },
    {
      "rating": "7",
      "text": "Sometimes these ratings just don't make sense to me. Sure it was an all right science fiction depiction. The beginning kind of took its time and the only problem is that they didn't actually launch the ship until past half way through. And then they sped through a quick adventure through the core. The film was exciting and dull at the same time, its kind of cool how the director wishes to kill everyone off, well it still was a good sci-fi film. But I totally disagree with these reviews given here. Just a pretty good movie with a disappointing plot."
    },
    {
      "rating": "5",
      "text": "Not a bad film, but the story is simply too stupid. Going to the core of the earth? That is total rubbish. However, at least there is some excitment."
    },
    {
      "rating": "5",
      "text": "I somewhat enjoyed this movie. I'm not very picky when it comes to sci-fi movies, but I think this couldv'e done a lot better, and I've lost a lot of respect for these great actors after being in a mediocre movie such as this. I think this a so and so movie that was okay, but couldv'e been much better."
    },
    {
      "rating": "10",
      "text": "This was a great concept, and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"
    },
    {
      "rating": "10",
      "text": "This was a great concept and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"
    },
    {
      "rating": "10",
      "text": "This was a great concept, and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"
    },
    {
      "rating": "10",
      "text": "This was a great concept and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"
    },
    {
      "rating": "10",
      "text": "This was a great concept, and it was a great movie i enjoyed in my younger years and i still do, i wish they would make a remake. #MovieThirst"
    },
    {
      "rating": "0",
      "text": "Alerta de Spoilers...La tipa mata a todos, (menos al profesor de universidad), y es Mary Sue.   Y además se cree la buena de la historia. (Además de todo lo que ya dije... No la meten a la cárcel por matar a todos)."
    }
  ],
  "recommendations": [
    "geostorm",
    "the_tomorrow_war",
    "pandorum",
    "independence_day_resurgence",
    "sunshine",
    "the_cloverfield_paradox",
    "jupiter_ascending",
    "prometheus",
    "the_darkest_hour",
    "surrogates",
    "riddick",
    "war_of_the_worlds",
    "source_code",
    "lucy",
    "the_last_days_on_mars",
    "the_day_after_tomorrow",
    "city_of_ember",
    "world_war_z",
    "elysium",
    "the_book_of_eli",
    "jurassic_world_dominion",
    "transformers_the_last_knight",
    "captive_state",
    "bright",
    "star_trek_v_the_final_frontier"
  ]
}