{
  "id": 3620,
  "title": "The Holiday",
  "starring": [
    "Cameron Diaz",
    "Kate Winslet"
  ],
  "runtime": 136,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Two women, one from the United States and one from the United Kingdom, swap homes at Christmas time after bad breakups with their boyfriends. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6fbqG49Q7IWBWdyJ7asNTcNbnG6.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 7.190476190476191,
    "ending": 6.4,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 7.2727272727272725,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "One of the few modern Christmas classics. Such easy watching with great heart."
    },
    {
      "rating": "10",
      "text": "Loved it! A fun, romantic, wholesome christmas rom-com which reminded me of the classics like Love Actually and Notting Hill."
    },
    {
      "rating": "9",
      "text": "I liked this movie a lot. It made me laugh and also clap my hands. Very good movie indeed."
    },
    {
      "rating": "7",
      "text": "This film includes a witty script by director Nancy Meyers and good performances by Kate Winslet, Jude Law, and Cameron Diaz. But the movie is stolen by the unlikely duo of Jack Black and 91-year-old Eli Wallach."
    },
    {
      "rating": "10",
      "text": "This movie was a true love story. it appealed to a real audience and it touched me in place that most others fail to reach."
    },
    {
      "rating": "10",
      "text": "Never have I ever had a musical score move me like this one.  It fits the story so well. It brings the characters to life in a way that is absolutely indescribable. It takes a movie that would be maybe a 7 and converts it to a strong 10."
    },
    {
      "rating": "8",
      "text": "There are some romantic comedies that I don't like, but The Holiday is an exception. I found it sweet and very entertaining at times. The four stars, Cameron Diaz, Kate Winslet, Jude Law and Jack Black are very talented actors, and their performances take centre stage here. Kate Winslet was lovely as Iris, but I was really delighted with Cameron Diaz as Amanda, especially when she is seen wearing stilettos in the snow. At my first viewing the whole cinema were like \"How does she do that?\" I also thought their exchange on the phone was hilarious too. As the men, I really liked Jack Black as Miles, a perfect blend of subtlety and spirit. Jude Law, an actor who isn't always my cup of tea, does very well indeed, as Diaz's new friend Graham. This tells the story of two women who swap homes and make lifelong friends, or something along the lines of that. My sister has this on DVD and absolutely loves it. I have only two quibbles with this movie, the script is a little weak and frothy at times, and there are some places where the story is underdeveloped. Still a beautiful-looking and hugely enjoyable film. 8/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Loooove this movie! The cast, the story, the suroundings, location, everything. Cant get enough of it, I watch it every year and its my alltime favorite christmas guilty pleasure."
    },
    {
      "rating": "9",
      "text": "I liked this movie. Second time watching it. I have a short attention span when it comes to movies. It's not common for a movie to grip me, have me watch it then rewatch it years later. LOVED the film score. Cry by Hans Zimmer, go listen that on Spotify."
    },
    {
      "rating": "8",
      "text": "I am not ashamed to admit that I enjoy a good chick-flick. And this is a good one. Not great. But very good. (To give you some idea of scale, 1982's AN OFFICER AND A GENTLEMAN, 1983's TERMS OF ENDEARMENT and 1942's CASABLANCA are ~great~ chick-flicks--great movies.) Cameron Diaz, Jude Law, Kate Winslet, and Jack Black star in THE HOLIDAY. The movie is about two women who trade houses, (one in L.A. and one in England), and get romantically involved with men they meet there. A guy who looks like Jack Black gives most normal guys false movie-hope that they could ever date a girl who looks like Kate Winslet... But, Jack is funny. He writes movie music--and no one seems to notice that movie soundtracks to romantic comedies are not written by women. Ever. But women do direct beautiful movies on occasion. (Nora Ephron, for example.) At 136 minutes, director Nancy Meyers' film is not too long. It's just that I wish the emotional payoff at the end were a whole lot stronger. Of course, there is the Hollywood-obligatory (and always premature) fornication. Actually, love stories on film are traditionally a protracted exercise in longing. Usually, once the two declare their love for each other and kiss, the credits roll. I would like to have seen more scenes of the the relationship between Jack and Kate. The film includes impossibly beautiful shots of the English countryside. If you want to redecorate your house and make it look like happiness incarnate, this is the film to see. Making one of the men a book editor and the other man a film-score composer and one of the women a film-trailer producer adds to the movie-romance homage. There is even a great scene in a Blockbuster movie store where Jack is commenting on movies, (tangentially reprising his role for a moment from HIGH FIDELITY). The camera briefly shows us that one of the stars from one of the classic movies Jack is praising is in the store next to them, and this person overhears him. This is a beautiful romance feel-good movie with a lot of class, kindness and beauty. While not an emotional powerhouse, I do recommend it. My rating: 8.2 out of 10. C The most important truths: \"...the Word (Jesus) was God...\" \"...the Word (Jesus) became flesh...\" >>John 1:1;14. \"He who believes in the Son (Jesus) *has* everlasting life; and He who does not believe the Son (Jesus) shall not see life, but the wrath of God abides on him.\" >>John 3:36. For by *grace* you have been saved through faith, and that not of yourselves; it is the *gift* of God, *not* of works, lest anyone should boast. >>Ephesians 2:8,9. Believe in Jesus: that He is God, that He suffered and died on the cross for all of your sins: past, present and future; that He was buried, that He physically rose from death on the third day--and you will be immediately forgiven, saved forever, and go to Heaven the minute you die. *** Please check out my blog site, which is frequently updated: http://believersworldview.blogstream.com"
    },
    {
      "rating": "8",
      "text": "Very enjoyable. Drags a little, and my husband was bored. Not me. Fun characters and fun story line. Suitable for most people because the sex scenes were very underplayed."
    },
    {
      "rating": "9",
      "text": "Contrary to Rev. Rikard's response, I felt that Diaz & Jude's relationship was deep and meaningful despite its predictability. For me, they made the movie. They clicked so well together, their onscreen chemistry combined with a fantastic musical score (thanks zimmer!!) get a 9 out of 10 stars in my book. Only downside to the film was that the ending dragged on for a bit in the last two scenes, other than that, no quibs!"
    },
    {
      "rating": "4",
      "text": "This film suffers from 3 main problems. Firstly it's just too long, if it was 30 or 40 minutes shorter it might have had the wit and sharpness it lacks. Secondly the most interesting relationship , between Iris (Kate Winslet) and Arthur (Eli Wallach), is left half developed and feels like an afterthought. Thirdly there is a huge lack of chemistry between the leads which coupled with the length of the film just leaves you feeling totally uninvolved and frankly a bit bored. I gave a 4 mainly because my girlfriend liked it :-)"
    },
    {
      "rating": "8",
      "text": "This was pure chick flick, which is not my favorite genre, but I was surprised at how well I was entertained The beginning is a bit of a stretch in terms of believability, but once it gets going, if you suspend your disbelief a little bit, it works well. Good acting, real-seeming interaction between characters (for the most part) and a lot of original dialogue. The famous, aging film director feature added a nice touch, and so did the lightening fast cameo appearance by Dustin Hoffman. A well made film, but my instincts are that many men will really find this film boring, too \"mushy.\""
    },
    {
      "rating": "6",
      "text": "I loved Kate Winslet when she was describing how it felt to ache after someone who did not return the feeling. I also loved that it did not throw in some gratuitous \"gay\" friend. I am so tired of that. Hollywood needs to stop pushing it."
    },
    {
      "rating": "8",
      "text": "Definitely for the ladies. A two-for-the-price-of-one romantic comedy. It has its flaws (too long, Diaz still can't act) but for the most part it is heartfelt and sweet and uplifting. Too much time is spent on the Diaz/Law relationship and not enough time on the Winslet/Black pairing. Also, I would have liked more of Eli Wallach's character and his friendship with Winslet. But generally speaking, I walked out of the theater smiling. Also, very happy I went with girlfriends instead of husband!!"
    },
    {
      "rating": "5",
      "text": "The Holiday is a shining example of a \"Movie-for-the-Masses\" romantic comedy. It's got it all covered and it takes a bloated 2 1/4 hours to cover it! Cameron Diaz and Kate Winslet are the two poor plain janes who can't find love and keep picking the cads who use them. Jude Law is the handsome widower with two precious daughters that he doesn't acknowledge for fear of scaring away single woman, Jack Black is the loveable teddy bear who has fallen for a girl that's two-timing him on the side, and Eli Wallach is the crusty old Hollywood writer whose stories of the old glamour days are just what the 4 leads are really looking for and what the The Holiday tries so desperately to be. It's all here and guaranteed not to offend anyone who loves those vintage romantic comedies of days gone bye. It's really just \"Something's Gotta Give\" without Jack Nicholson and Diane Keaton!!"
    },
    {
      "rating": "6",
      "text": "The first 1/3 or 40 minutes are boring, because the setups didn't feel genuine (e.g. arguement between Diaz and Burns). After 40 mins or so, the movie really does take shape and has a compelling story to tell about love. The relationship between Winslet and Wallach is warm and important. Unfortunately, most watchers only catch the unrealistic chance meeting between Law and Diaz, and start to have fantasies that this is reality. Note to most viewers: life is hardly that easy, and if you believe that is it, I'm sure there's a Friends episode on TBS that you're missing. The movie ends on a positive note and with an important message about love. Give it away (Winlset and Wallach), Trust it (Diaz and Law), Experiment with it (Winslet and Black), Know when to let it go (Winslet and Sewell)."
    },
    {
      "rating": "7",
      "text": "Movie was better then expected. Well-written script. Jack Black playing the role of a serious actor was intresting."
    },
    {
      "rating": "8",
      "text": "This extremely likable, pleasant seasonal snowball will go down in 2006 film history as The Other Kate Winslet Movie. Her beautifully shaded, finely modulated portrayal of the intellectually and emotionally frustrated suburban housewife in Todd Field's Little Children is indeed a performance for the ages, but her more popularly accessible work here as a lonely woman who Finds True Love after trading homes (and continents) with another (Cameron Diaz) is absolutely nothing to sneeze at either. In fact, Winslet has a monologue more than midway through the film in which she laments the plight of being in an unequal, unrequited relationship with someone who treats her with cavalier disrespect and absolutely no regard for her well-being that had the audience I saw this with sniffling and reaching for Kleenex. (OK, full disclosure time: I was among them.) The fact that Jack Black (nailing an image-busting role that nevertheless takes advantage of his many one-of-a-kind qualities), as a friend of hers who has the potential to be something more, then rejoinders with the perfect, tension-releasing reply is an indication of just how much of a master of crowd-pleasing, satisfyingly manipulative entertainment Nancy Meyers can be. Since professionally and personally splitting with her former partner Charles Shyer (The Affair of the Necklace, Alfie) Meyers has definitely proven herself to be the talented one in the former duo; she elicited a wonderfully graceful, career-redefining performance from Diane Keaton in Something's Gotta Give (as well as Keanu Reeves's most charming work ever in the same movie) and proved in What Women Want that the same Mel Gibson who spent the last several years torturing, crucifying and eviscerating the main characters in his own directorial efforts actually has a light comic side too! Meyers works similar wonders with Jude Law as well; maybe part of it is the desult of pairing him with the delightful Diaz, but this is the first movie I've liked him in since The Talented Mr. Ripley in 1999. If Meyers has an essential flaw, it may be that she's a wee bit TOO eager to please: a movie that features a cute old man, two cute little girls AND a cute dog may be pushing a tad too hard. Perhaps Meyers needs to bring a little less of the cute and a little more of the funny, especially since her contributions in the latter category, such as Black's Bobby McFerrin-like renditions of various popular movie themes, really score. But it's impossible not to like a romantic comedy in which, for once, the mismatched couples we see at the beginning of the movie have overridingly good reasons for NOT belonging together, and one or the other halves isn't getting romantic walking papers for having allergies or liking Styx or some other stupid, contrived reason that serves no other purpose than to make the dumper look unnecessarily petty and superficial. Sometimes you don't necessarily want your cinematic entertainment to reinvent the wheel; you just want NICE, and The Holiday fully delivers. And as recent Christmas-themed movies go (it seems like we get half a dozen new ones every season), ones like this and last year's Christmas in the Clouds and the three-year-old Love, Actually not only perform the essential service of counterbalancing such juvenile junk as Surviving Christmas and Deck the Halls, but provide the very warm feeling of being smooched under the mistletoe by your favorite person while standing in front of a warm fire a few moments before you open that one Christmas gift that's EXACTLY what you wanted."
    },
    {
      "rating": "7",
      "text": "This certainly doesn't rival Hollywood at its best, best a 20/100? That's ridiculous. A film can be funny and warm - and be good, even if the writing isn't as crisp and clean as something Jane Austen might have penned. The problem with the film is that it tried to tell two stories, when it had only one - Cameron Diaz and Jude Law. And the other problem, which should be evident, is Jack Black. It's no wonder that Diaz and Law received the majority of the screen time."
    },
    {
      "rating": "1",
      "text": "Jack Black and Kate Winslet have  some nice chemistry, but they can't save this disaster of a movie. The Cameron Diaz-Jude Law scenes are tedious and take-up  two-thirds of the movie, there is a preachy subplot about \"old Hollywood values\" and though Cameron Diaz and Jude Law are boinking each other throughout, Kate Winslet and Jack Black don't even get to share a real kiss a the end of the movie! Is this because they are, ahem, fat? As bad as a mainstream can get."
    },
    {
      "rating": "6",
      "text": "It is a shame this film earns only one score for the whole. Its dual storyline, in this unique case, should allow it a \"split-score.\" The story revovling around Diaz and Jude law is predicatable and shallow. The relationships never delve below the surface. I would rate it a 3. However, the second story involving Black, Winslet and Wallach offers far more passion and the relationships are interesting. In spite of all the star power this movie uses to draw an audience, it is Wallach's movie. He is the heart and passion of the story that is most meaningful and touching. For this storyline I offer a rating of 8. However, placing the two side by side results in a feeble attempt to. . .I don't have a clue!"
    },
    {
      "rating": "8",
      "text": "It's two, two, two romantic comedies in one. Nothing very profound here -- unless, perhaps, you feel urgently in need of trading lives with someone in a nice place far away, as the women get to do here. But if you're in the mood for a romantic comedy, this will hit the spot nicely. Likable actors, some funny lines and an enjoyable score."
    },
    {
      "rating": "0",
      "text": "My girlfriend made me watch this film under duress, this is by far the worst and most BORING film i have ever seen in my entire life, completely pointless to watch i found myself wondering if i was in purgatory! jack black is diabolical, the role is the worst role hes ever played and he doesn't even play it well, as for the rest nothing wrong with the acting just the most pointless and boring film OF ALL TIME it makes me feel like puking all over myself just talking about it."
    },
    {
      "rating": "2",
      "text": "If you have ever wanted to watch a movie where nothing at all happens, then the Holiday is for you. Lifeless and dull as they come, it's proof you can't just throw a bunch of A-list actors at a script and make it work. My girlfriend is still watching it, but I've resorted to writing this review and shopping online rather than bothering with last half hour."
    },
    {
      "rating": "2",
      "text": "Predictable, unbelievable drivel, with more mugging than a \"Three's Company\" intro. Even the college-age girls sitting near me exclaimed \"ridiculous\". Sorry, I wanted to like it, really I did."
    },
    {
      "rating": "8",
      "text": "Is it possible for Nancy Meyers to ever fail us? The Holiday is charming and romantic in every way necessary. The chemistry between these actors is astonishing. I'd watch this one at any time of the year."
    },
    {
      "rating": "4",
      "text": "This movie was way to sappy. It was too much of a romantic story that could have branched off. Kate Winslet and jack Black's story line as far more interesting than the other side."
    },
    {
      "rating": "7",
      "text": "The Holiday is one my all-time favorite rom-coms. At a seemingly lengthy 2 hours and 15 minutes, a typical romantic comedy would crumble and overstay its welcome; thankfully, The Holiday is not your typical rom-com. It features some strong central performances by actors that have great chemistry together. The result is a wholly satisfying film where you actually care about the characters involved."
    },
    {
      "rating": "9",
      "text": "guys do not watch this movie!!  its  a chick flick and lovely. .though joe black and kate winslet let it down.Jude law  is lovely in it i really enjoyed it"
    },
    {
      "rating": "7",
      "text": "Yes. Yes! YES!!! Is this what sports people feel like when a touchdown is made? Last Christmas, I gave Love, Actually a chance but the second I watched it was all kinds of offensive. This year, I watched The Holiday, and I found a new favorite movie! Wow, did not mean to make that sound like \"Last Christmas\" the song. The point is, I had all the hopes up for Love, Actually but it was all kinds of mean. Around the same time, I watched 12 Dates of Christmas, hoping for the corney, and got something super boring. Was the Christmas Rom Com destined to be unenjoyable? Nope, this one hits the right notes! But, to be fair, it doesn't even really center around the holidays. The jokes are super blunt but super funny. I had to mark it down though because Jude Law was a terrible father, every scene with the kids was tedious, and the old man...was it really necessary? Not to mention, poor Jack Black is just not a love interest. They could not make it work. I think it would take a miracle worker.  But, I don't really care because it was a funny ride which is really all that counts in a rom com."
    },
    {
      "rating": "0",
      "text": "This movie is so Unbelievably bad, I honestly can’t believe it.  Even more unbelievable is the user score on metacritic.  The writing is absolutely atrocious.  Jack black was criminally underused as he was the only person with any actual potential in the whole movie.  Just abysmal.  Save yourself the over 2 hours you would spend on this movie. Unbelievable run time by the way.  2 hours of the nothing.  The same story could be told in 30 minutes."
    },
    {
      "rating": "8",
      "text": "It is a cute movie with great actors. Maybe a bit long drawn-out. Good for a cold evening."
    },
    {
      "rating": "7",
      "text": "Es una simple historia de amor, pero es entretenida y divertida, la recomiendo."
    }
  ],
  "recommendations": [
    "life_as_we_know_it",
    "we_bought_a_zoo",
    "happiest_season",
    "last_christmas",
    "friends_with_benefits",
    "love_actually",
    "silver_linings_playbook",
    "the_notebook",
    "the_lake_house",
    "no_strings_attached",
    "chef",
    "the_intern",
    "17_again",
    "leap_year",
    "something_borrowed",
    "the_vow",
    "midnight_sun",
    "the_perfect_date",
    "if_i_stay",
    "me_before_you",
    "last_vegas",
    "book_club",
    "the_blind_side",
    "a_walk_to_remember",
    "hustlers"
  ]
}