{"id": 3120, "title": "The Amazing Spider-Man", "starring": ["Andrew Garfield", "Emma Stone"], "runtime": 136, "genre": ["Action", "Adventure", "Fantasy"], "description": "Peter Parker is an outcast high schooler abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben and Aunt May. Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance – leading him directly to Oscorp and the lab of Dr. Curt Connors, his father's former partner. As Spider-Man is set on a collision course with Connors' alter ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/jIfkQNARYyERqRAq1p1c8xgePp4.jpg", "categories": {"plot": 7.771929824561403, "acting": 7.638297872340425, "ending": 7.444444444444445, "soundtrack": 8.5, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 7.0, "action": 8.15}, "reviews": [{"rating": "10", "text": "Fantastic movie!  It kept my attention from beginning to end, which is hard to do for a movie that is over 2 hours long!  The story was the best ever for Spider-Man, and everything was easy to understand and follow.  Intense action sequences and very little to no swearing.  Be sure to stay through half of the credits, there is a surprise at the end for a plot for a sequel!"}, {"rating": "5", "text": "I loved it and hated it at the same time.  I don't think it was as good as Spider-Man or Spider-Man 2...Spider Man 3 sucked, so it was better than that one.  I think if you're going to reboot a series so soon, you should only do it if the former sucked and needed to be redone.  I don't think the 2002 Spider-Man needed to be redone.  I'm all for more Spider-Man movies with a new actor in a new universe, that's just fine, but 75% of this movie was just his origin story that we just saw in 2002 Spider-Man.  I was just sitting there thinking \"yeah, I know, move on already\" for 90 minutes.  Yeah, a few details were different...I think they could have changed more.  I could also tell that this movie was very geared towards teenagers and the MTV crowd, and that made it seem stupid to me.  The Twilight preview before the movie didn't help.  Neither did the girls screaming \"woo\" in the theatre when Peter and Gwen kissed.  Please.  I also HATE cheesy 3D tricks, and this movie ended with the stupidest \"this would look cool in 3D!\" trick ever.  It it so stupid and cheesy and not quality cinema.  I don't give a crap about 3D!  I just want to see a movie with real characters and a story, not watch Spider-Man shoot a web right at my face just because it would look cool in 3D.    So enough venting, there were things I liked.  One thing I did like was that they did a more humorous take on Spider-Man.  This one definitely was funnier that the previous series.  They also were obviously going for a more realistic character, as even as Spider-Man he was still clumsy, and his climbing and jumping was more human and less overdone with CGI.  They also allowed the suit to look like real clothing, and not digitally enhanced.  You could see wrinkles and I think even a zipper.  How \"perfect\" the spidey suit always looked in the previous movies always bugged me.  So, I kind of liked the new one, even though it seemed unpolished, since that's what they were going for.  Overall it was entertaining and worth seeing, but most of the movie was unnecessary and redundant."}, {"rating": "9", "text": "AMAZING SPIDER-MAN: 9.5 This film is a terrific \"reboot\" of the spider-man franchise.  While we did have some retread of familiar ground, the necessary story elements that were repeated were done in a slightly fresher approach.  From the spider bite origin of our hero to the inevitable death of Uncle Ben each classic moment was given a fresh coat of paint and melded into the modern story nicely.  Even though I did enjoy Toby's portrait of the web head, Andrew Garfield fits the bill as BOTH high-schooler Peter Parker and Spidey himself. Garfield able to maintain every bit of the character in and out of the blue and red costume that made his portrayal feel more like the comic book character than ever before. The changes in the costume were not distracting in the least, the main villain was well thought out and acted plus all of the supporting characters built the frame work for what could be a terrific series of Spider-man Movies for today's audience.  It may not be the big \"explosive\" blockbuster that was Avengers, but it is full of fun,heart and excitement all the same. Go see it and finally see why SPIDER-MAN has been such an enduring comic book character all these years.   I look forward to more films in this newly minted franchise."}, {"rating": "10", "text": "I just finished watching the midnight showing and I can proudly say that this movie is an improvement over the previous ones. The way he gets his powers and why he has them are much more explained. The villain is amazing and the actors are great. There's also some comedy which put together with everything else makes this a fantastic movie."}, {"rating": "10", "text": "This Movie By far was better than the entire Raimi trilogy. The story was compelling and the action scenes were great. Not to mention Spider-Man cracking jokes is awesome (Just like he should be) As for the 3D effects they were quite good especially The first-person shots. That's when the 3D shined, But the 3D is great throughout the entire film. I also like the relationship with Gwen and Peter. Also the fact that Spider-man is a Vigilante to The police which was actually very very compelling. Also the ending was top notch!. You should stay after the credits when the film is over ;)"}, {"rating": "0", "text": "This movied is the definition of boring. It is basically the same as the first spiderman with the lizard instead of green Goblin as well as spiderman getting his powers in a new way. Too add to that, the first spiderman movies  already had pleasing visuals where as this one had effects that were just ugly to watch. The Lizard looked so fake it were as if I was looking at a creature from minecraft. In fact I challenge those who read this review to watch spiderman 1 and tell me the amazing spiderman is still a good movie. The acting was poor and forced and the only real part I enjoyed of this movie was watching uncle ben get shot and adrew garfield crying like a little girl. In comparison this movie is no where near as good as the first and second spiderman, yet it may be better then the third however that is no accomplishment.  Overall this movie is a fail and it is an embarsment to the other spiderman movies, I cant even say that this one is a remake, for any two year old could of made a movie like this.  Just dont waste your money."}, {"rating": "7", "text": "It"}, {"rating": "7", "text": "Its a made well movie but not great. Some errors like lines and ageing makes it bad, worst part is that they are 29 and 27. THEY ARE TEENS! They can't be 30 it's like seeing Iron Man be 74. It is a movie likely to succeed but a prequel would not be high in getting a prequel."}, {"rating": "7", "text": "When I heard that Spider-Man was going to be rebooted, I was not supportive of the idea because I felt the story might not be good, and it's going to be weird seeing Andrew Garfield as Peter Parker /Spider-Man instead of Tobey Maguire. Nevertheless, I saw the Amazing Spider-Man and I was pleasantly surprised about what I saw. Its not perfect, but still manages to be a well creative story. So whats different about this movie? Well, the movie does a better job of telling Peter Parker's back story than the original Spider-Man trilogy. Second is the relationship between Uncle Ben and Peter Parker is a lot better. Third, I loved Uncle Ben in the original film, but I felt like he was side-tracked and I didn't knew much about him. This Uncle Ben is funny, he cares about his Peter, and wants to help him through his troubles. Its a sham that he dies during the movie because I really liked him. All these make the Amazing Spider-Man good, but I still have a few major issues with it. First is Andrew Garfield's dialogue isn't that great. He is good in the suit, but not in the speaking. Second is the characters, Emma Stone is a good actress and she does a good job as Gwen Stacy, but others like Dr. Conners isn't really that interesting, Denis Leary as Gwen's father was disappointing. I like Denis Leary, but I believe this is not one of his better movies, and everyone else is bland. The main problem I have with all these characters is we don't know much about their back story or their motive. Dr. Conners was okay, but I didn't know much about him. Even though the movie is basely on Spider-Man, I want to know about other characters even the scene is only 5 minutes long. The Amazing Spider-Man is a good movie, not one of my personal favorite, but still watchable."}, {"rating": "7", "text": "Very threadbare in terms of the totality of what it is, but everything that it does provide is decent. There's not much to complain about. Andrew Garfield and Emma Stone are both great though."}, {"rating": "10", "text": "anyone who hates this film is just being a whiny little dog. great action, story, and characters"}, {"rating": "7", "text": "I still like this movie as there are some genuinely really great things about the movie such as the acting and the music as well as the action scenes. First off Emma Stone as Gwen Stacy is much better than Kirsten as MJ. And Andrew Garfield as Spiderman I thought was good as acting-wise he does a better job than Tobey and he does get the character of both Peter Parker and Spiderman (although Tobey is still the best Peter Parker). But overall the plot was kind of mediocre the I was not a fan of the dark tone, and the Lizard while cool was kind of a boring villain. the movie also isn't very rewatchable in my opinion as there just not as fun as the Raimi movies."}, {"rating": "5", "text": "I was disappointed with this film because it does not do anything meaningful that the previous Spider-Man trilogy already accomplished. There was no need for another movie that does nothing to distinguish itself."}, {"rating": "6", "text": "Its been a mere decade since Sam Raimi helmed Tobey Maguire (as twenty-something Peter Parker) and company together to set the modern standard for the webslinging hero. As the first two films experienced both commerical and critical success, it's understandable as to why the latest project, The Amazing Spider-Man may strike some fans as being \"too soon.\" But, such popular wisdom didn't halt the 500 Days of Summer director Marc Webb from attempting to prove the nay seyers wrong. Challenged with the prospect of following 2002's Spiderman, this Spidey-film, in production, suffered from the sole disadvantage of being a subsequent act: avoiding semblance. Being a remake, however, involves at least some similarity. In any regard, the film succeeds in distinguishing itself largely due to the new Peter Parker, Andrew Garfield. Known for his spotlighted performance in The Social Network, Garfield assumes a modernized persona in 'Spider-Man.' He, though playing a bit older of a teenager than did Maguire in his debut, is instantly accepted in his role, having a fresh-faced innocence framed with anxious tics, angst, wry humor, and an unpretentiously down-played charisma that realistically reflects towards today's youth. Moreover, unlike the hackneyed \"nerdy\" image Maguire attained, Garfield is a punkish, skateboarding, internet-surfing, texting teen who just feels right; factor in the tall, lengthy stature that fills the red and blue arachnid suit which draws a far closer semblance to the comics than does Maguire's diminutive clumsiness. Peter Parker, then, is an abounding improvement; we even get to see him as a child in the Prologue. His love interest, the newly monikered Gwen Stacy--no more scarlet-headed Mary Jane--played by the ultra-talented Emma Stone is a beachy, yet intelligent blonde, all emo-short skirts, high boots and blimpingly gazing eyes underscored with thick-painted eyeliner; she is terrific and delightfully lighter and more expressive in character than the cold, equivocally taciturn Mary Jane of previous films. The two together, though, don't always stick like one would want them to, as the pathos and jokes don't land consistently, but individually they work wonders. When a mid-plot twist reveals Gwen's father (Denis Leary) is head honcho of the police force, (Leary miserably nods along) the divided love affair between the two crossed teenagers assumes more of the same division as between Peter and Mary Jane, and ups the ante in cohesive sentiment. As for Martin Sheen and Sally Field as Uncle Ben and Aunt May, they are near perfect castings but neither is used nearly enough. And, the one-armed scientist-reptile-symbiote, Curt Connors (Rhys Ifans) the screenplay's poor excuse of a villain, is a character no more an antagonist than Peter Parker for a chunk of the film. He is brought to his monstrous transgressions by one Dr. Ratha, who demands that Connors create an antidote for an ailing company superior. While The Amazing Spider-Man does devote some attention to character revamping, namely Peter Parker and the fledgling Gwen Stacy, as well as capturing some subtle nuances from the comics, it also fails to web its components together, often revisiting the same plot points of its predecessor. Though forgiving the latter is sensible, the former is impeachable. What we're talking about: plot contrivances, continuity errors, gaping lapses in logic, and embarrassing coincidences. For one, not nearly enough is said about Peter's parents, particularly his father. Early on, Peter is searching the web (why is a teenage prodigy using Bing?) and it is there he whimsically finds an article of his father with Connors. Others include: what happened to Uncle Ben's murderer? What happened to Dr. Ratha after he was seen in his vehicle on the Williamsburg bridge? Why are no photos taken of the 8-foot tall reptile rampaging through cars like magots? Why are a swarm of lizards walking on a web of Spiderman's in the sewer? Who writes \"Property of\" on anything? Why do crane operators work during evacuations? If Dr. Connors' reptile-transforming serum was ephemeral, and thereby needed to be injected every four hours or so, why would he expose the entire New York population to it?; the effects would be short-lived. And, the last I will mention, why is Denis Leary the only police officer on the roof of the building in the finale, when hundreds of other SWAT personnel are meandering on the street, watching the hero and villain fight? It's these contrivances and more that mar all that 'Spider-man' offers; director Marc Webb can only feint the mishaps with unfulfilled emotive closeups that merely break up the pervasive silliness for a short time, but such aren't ever forgotten. By the looks of it, the making of 'Spider-man' was lost right from the boardroom; oh, there it is, WHOP! It's an icky mess to clean up."}, {"rating": "1", "text": "This movie just sucks. How do you even think about remaking a movie about spiderman? Another one was realeased not many years ago and it was quite good. This one instead it's just spiderman for kids, the story is all messed up, the main character looks like a boy band member to catch some young teenager public (cmon peter parker should look and be just like a nerd, not a bieber/breaking dawn/skater/genius/rebel boy). Oh please it's just so bad.."}, {"rating": "6", "text": "At the end of the day , regardless of how hard director Marc Webb tries to veil it , you simply cannot escape the fact that the Amazing Spider - Man is nothing more than old wine in a new bottle . Director Webb's decision to re - visit Spidey's origin , has in my opinion backfired . It lacks the maturity and slick sense of style so very characteristic of Christopher Nolan's Batman films , being overly - reliant on traditional comic book movie cliche and somewhat unimaginative set - pieces . The performances of the entire cast - Garfield and Stone in particular - are worth a mention as they keep you invested in some otherwise dull moments . At the end of the day , I can't help but feel that The Amazing Spider - Man could have been so much better had the creators not decided to take an overly - conservative approach and instead would've dared to think outside - the - box the way Nolan did with his Batman films . Nonetheless , it's still decent fun if you've got a few hours to spare , just don't set your expectations sky high"}, {"rating": "9", "text": "This may not be the best Spider-Man film, but its an excellent reboot. The cast is definetely one of the best. The movie kills it with action, emotion and origin. It's a retelling of Spider-Man but in a way that has secrets.\rI give TASM a 9/10"}, {"rating": "6", "text": "I liked this movie when I first saw it, but It's quite forgettable, really. Andrew Garfield really isn't as good a Spider-Man as Tobey Maguire, and Rhys Ifans' Lizard isn't as interesting as Willem Dafoe's Green Goblin. All in all, it's an alright movie, but it's no match for the original trilogy."}, {"rating": "7", "text": "I enjoyed the first Raimi Spider-Man film (and hated the second one). At the time, with nothing to really compare them to,  I thought Tobey and Dunst were solid enough, but after seeing The Amazing Spider-Man, I realize that there was real chemistry lacking between the original's leads.  Garfield is much better than Tobey - Tobey's unaffected, bored look worked in The Cider House Rules, but not as Peter Parker.  I buy Garfield much more as a high school kid, and Emma Stone is so much more dynamic than Dunst (who excels in such art house flicks as The Virgin Suicides and Melancholia - but not in the popcorn / comic flick realm). Even the antagonist is much more believable and even sympathetic in the right ways.  All-around, I think this is the best big screen version of Spidey. No, it's nothing like the Batman Begins reinvention of that franchise, but it's still superior fare."}, {"rating": "7", "text": "This movie is good fun. Lots of action, fighting, etc as you would expect from a Spiderman film. If you like Spiderman you should like this movie, if not, then why not?!?!"}, {"rating": "9", "text": "Well, I really loved it. I wasn't keen on these Marvel heroes like Spider-man or Hulk, but I liked this movie, and it attracted me. I just wanted to keep on watching. I also like when things are realistic."}, {"rating": "9", "text": "This was an outstanding movie and, in my opinion, better than the Spider-Man films of a decade ago. I enjoy the way Andrew Garfield portrays the Peter Parker character much more than Toby McGuire. He is not such a dweeb, is more charismatic, wittier, and just a better actor in general. And thank you to whoever decided to use Emma Stone as the romantic/love interest. Not only is she one of the best young actresses in Hollywood but she is absolutely stunning. Much more believable for the role of the beautiful \"damsel in distress\" than Kirsten Dunst. I'm sorry but I am not a fan of Dunst and don't understand why people find her attractive. I also thought the rest of the cast was great. Denis Leary and Martin Sheen almost stole the show. The director also made the physics more realistic. With the exception of a football bending a goal post in half, the physics felt more authentic throughout, not only the combat but also just the gliding through the city shooting out webs. I also liked the plot development. I had a friend mention how they prolonged the \"origin\" too much for his tastes but I actually enjoyed that a lot. If they are making this into a trilogy, there's plenty of time for Spider-Man moments but you can never come back and capture the beginning stages of the superhero and the person behind the mask. Ultimately, the only thing that held this movie back for me was that it felt like we've seen it before. Other than some minor alterations to the story and obviously different actors, this was very similar to the one a decade ago and more than anything, it FELT like the older one. I thought it was better but not by much, mainly because it had the same overall feel and tone. I would've much rather had them take the Spider-Man story they had here and made it a little darker and more intense and dramatic. There is plenty of potential there but they don't take advantage of it. Instead, you essentially have yet another little kid/teenager superhero movie. Out of all of the superhero movies being made, it's definitely the least mature of them and that holds it back for me. Give Christopher Nolan this story and he'll make it amazing."}, {"rating": "3", "text": "Sally Fields as aunt may just doesn't seem right... she is a great actress.  but as Aunt may, I just don't see it.  This movie was too drawn out and unnecessary really, I really enjoyed Tobey Maguire as spidey more-so.  Not sure what to make of the suit in this movie either... Although the premise of having Gwen Stacy as his first girl friend went along with the comic book series.  I wished we could all just agree to forget about spider-man 3 and just let Sam Raimi remake it.  but this time keep venom out of it until much later on.  But I would say this one is just as bad as Spider-man 3, but on the other side of the spectrum. Where Spider-man 3 tried to bite off more than Sam Raimi could chew in a single length movie.  This one is the utter lack there of."}, {"rating": "10", "text": "Realistically, this movie probably isn't worth more than a 7, mainly because of the redundancy with the first Spider-man movie. Yes, The Amazing Spider-man promised us an \"untold story\", but turns out it was just false promises, it ends up being an almost copy of the first film, just improved. The biggest improvement it brings to the table is the romance, or should I say the love interest. Emma Stone's Gwen Stacy was a joy, she was an actual character that could stand on her own and not just a pretty prize like Mary Jane in the original trilogy. The interactions between her and Peter were really cute too (also great chemistry between the two actors), you get the feel they were partners supporting each other, which you didn't get at all in the Raimi trilogy, Mary Jane was more of a burden on Peter than anything else. It's simply put the best romance I've seen in any superhero movies to date. Special effects were pretty good too, especially Spider-man swinging, and the pacing was very good, I was never bored or wondering what was the point of a scene any time during the film. The weakest point of the movie was the villain though, he came across as very cartoony (and frankly stupid) which really clashed with the otherwise realistic interactions between the characters, his plan wasn't very smart either. Ultimately, this movie suffers from not departing enough from the original movie, which depending on how much you like the character, or how fresh the original is in your mind, may or may not be a problem. For me it just wasn't but I can see how it could be for some. Overall though this is still a very solid superhero movie in my opinion."}, {"rating": "4", "text": "I must say I'm disappointed. I've read a review, on one site I usually have similar opinions with, promising that it'll be an entirely different perspective on the spider man, new and refreshing, and had quite high hopes for this movie. However, it's nothing new at all, same story about becoming a hero, with all its melodramatic boring moments about dying family and so on. What's worse, the action is scarce and not especially entertaining. What I did like were those short 1st-person view moments, which were quite breathtaking. All in all, it's a mediocre superhero movie, which I wouldn't be afraid to miss."}, {"rating": "9", "text": "This is a solid reboot of a rather recent series of films that probably didn't need to be done so soon, but it has been done very well. Andrew Garfield is great as the new Peter Parker and overall it's a great cast! Storyline is similar to how the other series starts out but things change here and there. MJ is no more but Gwen is in the leading lady role played by the gorgeous Emma Stone who does a great job! Overall it's nothing but entertainment and quite enjoyable to watch"}, {"rating": "3", "text": "Ok, I will say that the Amazing Spider-Man had some decent visuals, and a really great performance from Andrew Garfield. He was absolutely hilarious as Spider Man. Emma Stone was decent enough as Gwen Stacy. My biggest problem with the film is that just 10 years after the first Spider Man film was released, this is just a rehash of everything that happened. Not only that, but it was done worse than the original Spider Man. It felt rushed, like they were trying to cram a lot of stuff into a short window of time. It felt like they were competing with the first Spider Man, and they lost on almost every front. I didn't feel much of a connection to the villain, either. He was simply there, and for what reason? A good hero makes half of a good story, a good villain completes it. We are left with half of a good story, which isn't enough to keep this movie above water. It kept me entertained enough for the time I watched it, but afterwards, it simply left me disappointed and frustrated. One of the worst movies of 2012."}, {"rating": "0", "text": "It's interesting that The Amazing Spider-Man and Spider-man is different. They have very different characters, but really there are not really a different. Which is boring. Almost all story, scenes, actions were the same. Boring. I thought Tobey Maguire should be only be the spider-man, and The Amazing Spider-Man. But really tired of same movies, same sequels. same characters. Movies that are brought from comics. I want to see completely new ideas that made by director or writer."}, {"rating": "10", "text": "Please do not hate me for saying this, but this is my favorite Spider-Man film.I love the cast, especially Andrew Garfield and Emma Stone with their awesome chemistry. The Lizard is an interesting character and villain to me. His character has a special relationship to Peter's backstory parents that disappeared, which makes him stand out to me. This film has great action scenes and is backed up with a nice supporting cast.So this film has my favorite Spider-Man, favorite love interest, and favorite villain. It brings back the important elements from the first film, and creates a new story along the way. It doesn't have my favorite action scenes, because its sequel does those in an excellent way to me. But I can safely say, this is amazing.I just wished the sequel was better"}, {"rating": "7", "text": "Five years after the last Raimi Spider-man film which was an utter disappointment comes The Amazing Spider-Man to bring the hero back into gear. But is it better than its predecessors? The answer is yes and no. The Amazing Spider-Man shows a new Peter Parker, who instead of a nerd, is actually a chill hipster dude who skateboard. Yeah, um that's not who Peter Parker is supposed to be. But putting that aside, Spider-man was almost perfectly done. One-liners and just taken in a plain humorous sense in some parts of the movie. But, the movie did try to get serious in many scenes like when Uncle Ben dies and that part was actually well done and creates more emotion to Peter's and his uncle's relationship which wasn't so strong in 2002's Spider-Man. The origin story has been told before but this one was well done to say the least. The Lizard looked weird and honestly, didn't even look like a lizard. The action in this movie is really well done also because the camera follows Spidey really well and Andrew Garfield did a decent job as his role. Emma Stone is perfect as Gwen Stacey, probably even better than Garfield as Peter Parker/Spider-man. She is much more of a likable character than Mary Jane ever was in the previous movies. This movie was far from being AMAZING but it sure was pretty fun to watch and all Spidey fans should check it out and give it a chance."}, {"rating": "10", "text": "This movie has exceeded all expectations i had for the movie. Having not read the comics as a kid and with the earlier trilogy being the only real connection i had to spider-man i am not comparing it so much to the comics and the previous trilogy. While this movie is more grounded and connected to the comics, the closer connection to the comics is not what makes this movie great for me--the fact that the movie is great is what makes this movie great for me. The acting is superb, as is the writing, and i was able to relate to the characters and feel that they were actual people. The plot kept moving and revisited the earlier events in Peter Parker's story in a way that was fresh enough to hold my attention, and keep me from getting bored. The action is fast, suspenseful, and sure to please. Over all this movie is fantastic! You really are missing out if you do not take the time to witness such a great film!"}, {"rating": "10", "text": "I attended the midnight premier of The Amazing Spiderman last night and I'd have to say that it is the best Spiderman movie to ever hit theaters. It is far superior to the previous Tobey Maguire trilogy. The acting is great by Garfield and Stone and the actor playing Dr. Connors plays the role perfectly. It seems that the negative reviews for this movie are coming from people who are grasping for attention by saying they disliked the movie. This is a great movie for any Spiderman fan."}, {"rating": "3", "text": "You're going to love this movie if you're new to Spiderman and the history behind this character. If you're an old Spiderman fan, you either loved it because you love Spiderman so much or hated the movie because it did not exactly portray the origins of Spiderman and his powers, except for Uncle Bens death. For an 2 hour film it seems the movie spend most of the time showing how a guy went from being the hipster d-bag at starbucks to the hipster d-bag holding a starbucks cup with super powers trying to do a kick flip in an abandon garage. Compared to the Dark Knight: Rises and the Avengers, this super hero movie is a super zero movie. I can't pathom how hard I tried to keep this movie from boring me to tears with scenes only suitable for teenagers who are going through puberty and can get off with such bland story line."}, {"rating": "5", "text": "I had very mixed feelings for this film. I read the ultimate spider man comics, and  had high expectations for this film to be based more on it. Which is kinda is and kinda isn't. I understand bringing in lizard man to introduce the new spider man. But the way they placed big events and brought characters in the movie I dont understand how they are going to make the second one good and especially making this series beat Sam Raimis spider man movies. This movie was ok, But throwing out main events out of the comic books and not following the story of how it should go, its going to end up like Sam Raimi's series. Bringing in Gwen Stacy and Her Father and killing her dad so quickly was a stupid idea. I just wish someone would actually follow a storyline for once."}, {"rating": "8", "text": "It has all element a good entertaining superhero movie needs. A good plot with nice performances. Its more thought provoking than Sam Raimi's Spider-Man."}, {"rating": "7", "text": "I liked the Raimi Spider Man movies (even the third one was ok), but unlike those movies I really liked how Marc Webb handles the relationship between Peter and Gwen."}, {"rating": "2", "text": "One of the most over rated movie ever this had me sleeping\rthis earns a highest of 2/10\rA very bad movie\r............................................"}, {"rating": "9", "text": "I went into this with low expectations but really really enjoyed what it had to offer. Honestly, Im a huge spiderman fan regardless growing up in the 80s and 90s but this really was better then the avengers. The CGI is flawless and imax 3D make this movie look absolutely amazing. The story was very compelling and the star studded cast was fantastic from Dennis Leary to Emma Stone who should be nominated for some type of award.\r There were its share of cheesy moments but this is a super hero movie and it is to be expected. Also, if I had to complain about anything, it would be the terrible music and sound throughout the movie. Truly, music can really make or break certain parts and this movies sound music wise was pretty terrible. Regardless for any super hero fan, an absolute must see"}, {"rating": "8", "text": "Andrew Garfield and Emma Stone bound is undeniably charming. With sure-handed direction from Marc Webb, pull the memories of Raimi's trilogy. Spider-Man is only human being with spider bite, it's the most realistic but really close to its source. People complain about the 3D, so am I. But it's the agenda from the start, looks deeper."}, {"rating": "7", "text": "I quite enjoyed this movie.The lead actor is far better than Toby Mquire in my opinion,& the film definately had its moments & it felt 'more real' in the way it was presented as opposed to the very bright & colourful look of the Sam Raimi films.I dont think the action was anywhere near as good as the Raimi films so far though,& no where near as much of it.Still,its only the first movie in this series,so theres room for improvment in this area in any sequels,of which i hope there are."}, {"rating": "7", "text": "İf u ask me why 7 but not 10 i can state that main problem is Connors. He is good, i mean lizard is cool. but it is like a weaker copy of hulk. Even when it acts and fights. oh the other hand both avengers and reboot spider man's budget is 220 million. but look at the difference, Avengers action scene's are more incredible and lasts at least 30 minutes more than spider man. and cast is perfect, then for what producers spent 220 million. and where is the j,j? spider-man without his raging boss doesnt seem warm, as a movie it is good and watchable, some lacks of screenplay wounded and hardly walking spider at the end fight even doesnt feel his injuries. my points are 7-marc webb 9-andrew garfield 9 emma stone 6-screenplay 8-visual effects 10- stan lee's cameo:)"}, {"rating": "8", "text": "The movie is pretty good. The storyline is great and not much of the basics change from the original film. I like the fact that Merry Jane is not in the movie and Andrew Garfield is relly good. There are both action and funny scenes and there is the romance element as well.. And most important there is a scene after the credits so stay and watch ;)"}, {"rating": "8", "text": "Right off the bat, The Amazing Spider-Man is the best out of all four Spider-Man movies released so far. The key positive aspect of Mark Webb's reboot and what Sam Raimi failed to achieve with his franchise is remain faithful to the comic books. All of Peter Parker's iconic moments is still intact, the inevitable spider bite, uncle Ben's death, the first time he dons the realistic-looking suit, it's covered in greater detail and you don't feel the"}, {"rating": "9", "text": "The Amazing Spider-Man, above all else, has heart. If you take away the brilliant acting of the main characters in Amazing Spider Man you're left with a far grittier and human take on the webslinger's story. Gone from this reboot is the campiness of the Raimi/Macguire rendition - replaced with the believable awkwardness of an adolescent dealing with something much bigger than himself. Fortunately, we don't have to take away the tremendous job of Andrew Garfield and Emma Stone. While the supporting cast was largely terrific in their roles, Garfield and Stone slipped into their roles flawlessly. I had mixed expectations going with how Garfield would do, but any doubts were quickly quelled. Garfield's unbelievably awkward and emotional performance was believable - a commodity in most super hero flicks - without coming across as the typical whiny protagonist. Stone, once again, knocked it out of the park as Gwen Stacey playing showing true chemistry with her nerdy counter part. The story wasn't fantastic, but very serviceable give the need to once again delve into the origin of the arachnid hero. However, the dialogue was fairly good throughout but truly shined in parts. I would love to dive deeper and deeper into this, but the bottom line is The Amazing Spiderman is a very good movie and borders on great when firing on all cylinders. Webb has set a solid foundation in place to get the most out of his new franchise. I can only hope that, like most super hero series, we won't have to suffer through diminishing returns."}, {"rating": "9", "text": "The Amazing Spider-Man is as stylish and slick as it is emotionally grounded in the world we live in. Director Marc Webb takes the superhero genre and doesn't try to make it larger than life. Instead, he makes it down to Earth, in a way that Joss Whedon couldn't do with The Avengers and in a way that Christopher Nolan couldn't do with The Dark Knight. Spider-Man is back."}, {"rating": "9", "text": "Is it amazing? In terms of grasp on character, yes it sure is, from peter parker or his alter ego all the way to a small part like flash thompson, every character gets a little defining character moment to show their a real human being not a dumb stereotype. Is the action amazing? Very nearly its strong but needs a little work though one scene in slow mo in a library is both greatly choreographed and hilarious. Special effects are mainly very good, the lizard for the most part becomes a very believable creation you believe he's dr connors and the most amazing thing is that even when he's talking It dosent seem weird it makes more sense to the character. Their are flaws but mainly their nit picks. He way this film makes you believe and want to cheer for the love, the relationships, the action is just fantastic, this is a foundation which an amazing sequel could be built upon."}, {"rating": "9", "text": "Let me start with a little background before I get stuck into The Amazing Spider-Man. Now, I was a massive fan of Sam Raimi"}, {"rating": "10", "text": "Saw the midnight premiere and was blown away by how great the movie was. The movie went into so much more detail than the original trilogy. The characters are amazing and the relationship between Peter and Gwenneth is done very well. The movie is fun and exciting. Get your tickets!"}, {"rating": "7", "text": "Different twist in building an origin of the superhero, some emotional scenes and new swinging action of the skinny Spiderman is not enough to wipe out Tobby Maguire Spiderman image from your head. Though exciting fun is there to make people come to cinema and I watched in a full packed Hall. Complete review @ http://bit.ly/KK1QuK"}, {"rating": "9", "text": "Last year X-Men (First Class)reboot was very fantastic, and The Rise of the Planet Apes was also very good! This year, Marc Webb dared to begin another Spider-Man Franchise, and to my surprise; was amazingly done.Not as good as Batman Begins but is as good as last year X-Men: First Class.\r Fresh and old plot-lines were mixed up to gave the audience an exquisite story of old-brand new spidey hero. Again, heroism brand of spider-man focus on his relationship to his family, friends and peers, and of course our superhero is one-hell of a lover-boy; new love interest which an ingredient of fresh story and is a sample exploits an untold story which I think the major flaw of the movie because it doesn't elaborates the secret behind his parents death which I hope can be lighten to us the next spidey-movie.\r Overall, Andrew was great to replicate what Tobey done and Emma and other cast were good. The story maybe a shadow of the Sam Raimi's Spider-Man Franchise but is still effective enough to let you bite. Action and web-slinging choreography and other visual effects were great even the background music, especially Coldplay's \"Till Kingdom Come\" track."}], "recommendations": ["spider_man_homecoming", "spider_man_far_from_home", "man_of_steel", "spider_man_no_way_home", "thor", "spider_man", "daredevil", "spider_man_3", "iron_man", "superman", "the_amazing_spider_man_2", "captain_america_the_first_avenger", "superman_returns", "fantastic_beasts_the_secrets_of_dumbledore", "x_men_apocalypse", "spider_man_into_the_spider_verse", "sin_city_a_dame_to_kill_for", "ant_man_and_the_wasp_quantumania", "wonder_woman", "bumblebee", "snow_white_and_the_huntsman", "the_karate_kid_part_iii", "the_karate_kid_part_ii", "creed_ii", "the_suicide_squad"]}