{
  "id": 1530,
  "title": "The Texas Chainsaw Massacre: The Beginning",
  "starring": [
    "Jordana Brewster",
    "Taylor Handley"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Chrissie and her friends set out on a road trip for a final fling before one is shipped off to Vietnam. Along the way, bikers harass the foursome and cause an accident that throws Chrissie from the vehicle. The lawman who arrives on the scene kills one of the bikers and brings Chrissie's friends to the Hewitt homestead, where young Leatherface is learning the tools of terror.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2S0XKVZGZUnsF4DjLOyZ0C63bWO.jpg",
  "categories": {
    "plot": 5.545454545454546,
    "acting": 4.9,
    "ending": 5.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I made the mistake of buying some fast food before sitting down to watch this one and all the meat certainly didn't make me want to take a bite out of my double melt. I've never seen a movie with so many people covered in (and becoming) meat."
    },
    {
      "rating": "2",
      "text": "For those who have lost track of the Texas Chainsaw Massacre franchise, here's the deal with The Texas Chainsaw Massacre: The Beginning: It's a prequel to the 2003 remake The Texas Chainsaw Massacre, not a prequel to Tobe Hooper's original 1974 The Texas Chain Saw Massacre. And it has no connection with Texas Chainsaw Massacre: The Next Generation, starring Matthew McConaughey and Renée Zellweger before they knew better. Got it? Okay. Here's everything else you need to know about The Texas Chainsaw Massacre: The Beginning: It's really gory and really dull. Mostly just dull. And it's far worse than a cash-in prequel to a mercenary Texas Chainsaw Massacre sequel has any right to be.\r Hooper's film has a blood-drenched reputation, but it built its scares out of skillfully crafted suspense. Like its 2003 predecessor, The Texas Chainsaw Massacre: The Beginning relies on made-you-jump shocks and more fake entrails than a Jaycees haunted house. It wastes no time in getting to either, but it's still a tremendous waste of time.\r In drill-sergeant mode, as always, character actor R. Lee Ermey returns as the patriarch of an inbred, cannibalistic Texas clan which, this time out, terrorizes two attractive, unfortunate couples. The male half of one (Matthew Bomer) is on his way to re-enlist for service in Vietnam, not knowing that his brother (Taylor Handley) plans to dodge the draft in Mexico. That whole question quickly becomes moot once Ermey and his adopted, leather-faced \"nephew\" start chopping them up one by one, a process that sadly takes up much of the movie.\r There's a lot to dislike about TTCM: TB, beginning with the fact that it repeats whole scenes from its immediate predecessor. They didn't work that well the first time around, and they aren't improved here. Really, the film is only worth considering as part of a trend of films that seem to exist to show audiences what torture looks like in graphic detail, almost as if torture had become some kind of national anxiety. But that couldn't be the case, could it?"
    },
    {
      "rating": "8",
      "text": "I like this film for its interesting characters, torture, gore, and prequel backstories. A few plot points however could've been altered for better though."
    },
    {
      "rating": "10",
      "text": "I Donno why people are so boring come on this was a good movie and i must say that the youngsters who starred in this movie were amazingly believable especially the blonde chick, i gave this a ten beacause it deserves it"
    },
    {
      "rating": "8",
      "text": "Really enjoyed this - loved the original remake too. R Lee Ermey makes this film - loads of blood and overall worth a watch."
    },
    {
      "rating": "5",
      "text": "This movie actually really surprised me. When I saw the previews for this movie I scoffed at the thought of them trying to make a prequel. This movie actually did a pretty good job of explaining some of the habits of the family as well as a little bit of leatherface and why he is the way he is. The acting was also pretty good for a horror movie. Overall not nearly as good as the original but still a fairly good watch."
    },
    {
      "rating": "2",
      "text": "This completely rehash the remake and the original '74 classic. What it does is answer questions that were never asked in the first place. It fails like every horror prequel ever made, it relies on blood and cheap scares instead taking the basic steps in making a horror movie. A complete failure."
    },
    {
      "rating": "4",
      "text": "All blood, all gore, no real scares, just lots of gross outs ... nothing like the initial remake, which was FAR superior."
    },
    {
      "rating": "0",
      "text": "The beauty of the original Texas is its almost total lack of blood and gore. The Beginning could be the most disgusting movie I have ever seen. Its abuse of blood and violence was unnecessary. It's chilling premise could have been as effective as the original, but it was lost. There's a difference between scary and gory. This was not in the least scary. Covering my eyes was my way of protecting my dinner and maintaining it in my stomach. A waste of time, money, and brain cells. Disgusting."
    },
    {
      "rating": "2",
      "text": "As if the horrible remake of the 1970s classic wasn't bad enough, here comes the prequel. Even worse than the remake. The original was so great because it was terrifying without being gruesome. It also stayed close to the truth. But this movie is the exact opposite. It's a ridiculously gory and a ridiculously absurb movie. So, what do you get? Another horrible slasher film. What should you do to escape this movie? Rent the original or get it off eBay. But unless you REALLY want to see someone get their face cut off, run. And fast."
    },
    {
      "rating": "10",
      "text": "The Best Of the Best of the Chainsaw flicks Scary Suspenseful and Gory as hell Leatherface rules."
    },
    {
      "rating": "8",
      "text": "I liked it even better then the previous film. Though the acting wasnt as good this time around, It was far more suspensful and terrorifying then the previous film."
    },
    {
      "rating": "7",
      "text": "Those hoping for any sort of nuanced exploration into what caused the Hewitt family to become so depraved will be disappointed. This origin story has only the briefest mention of some P.O.W. related trauma so Leatherface and his relatives are just depicted as psychos from the get-go. We see how they got their start at butchering random travellers though and with plenty of little revelations about stuff from the 2003 film (like how Sheriff Hoyt lost his front teeth). However, it's not like anyone is looking for any real depth here anyways. We're here to see people get killed and on that front the movie delivers in grotesquely satisfying ways.The opening birthing sequence feels like something straight out of an exploitation flick. In fact the whole thing is so much more grindhouse than its predecessor that I imagine it will have a hard time appealing to the more mainstream horror audience. The increased amount of torture and nastiness have definite hardcore appeal. The real improvement are found in the pacing though. There's not a moment of downtime on the way to the incredibly bleak ending and that makes a lot of difference.There's no depth or any reason to care about anybody onscreen, but if you enjoy occasionally trekking through the muck and mire this entrail laden journey can provide a good time. If you have a strong stomach that is. Proof that even if your movie is sadistic, it doesn't have to be miserable to watch. At least not from an entertainment standpoint.7.9/10"
    },
    {
      "rating": "6",
      "text": "Great movie...quite thrilling. All the people acting in the movie have done a great job i bet. But i still duno why some people hate this movie..wat ever! I enjoyed this movie...Happy watching!"
    },
    {
      "rating": "7",
      "text": "Suprisingly better then the previous remake and that is saying something because I enjoyed the first remake quite a bit. The acting is average (neither good nor bad), The plot is interesting (its nice to finally see the backstory of Leatherface). Its a pretty decent horror film."
    },
    {
      "rating": "7",
      "text": "TEXAS CHAINSAW MASSACRE takes a step back in time to reveal the origins of the infamous Hewitt family in TEXAS CHAINSAW MASSACRE: THE BEGINNING. A deformed child is rescued and raised by a penniless family out in the sticks of Texas, a family that is forced into cannibalism when the local slaughterhouse is put out of business. Unfortunately for a group of travelers who are on their way to Austin to enlist for Vietnam, this means that they are the next item on the menu! For the most part, THE BEGINNING keeps up with the remake that preceded it, but as a prequel it falls into many unavoidable traps. The filmmakers feel obliged to as many questions as possible in only a limited amount of time, which leads to a number of plot contrivances. Here, we learn where Thomas Hewitt got his saw, why Hoyt became the sheriff, how Uncle Monty lost his legs, and where Leatherface got his nickname... All in the same night! For a family whose killing spree lasted over four years, this just seems forced. The political weight of Vietnam is also heavier load than the film can bear, and comes off as being ignorant and ungenuine. THE BEGINNING is the bloodiest of any of the CHAINSAW films, however, with many graphic and gory murder scenes. A decent follow up, and still one of the better sequels. -Carl Manes\rI Like Horror Movies"
    },
    {
      "rating": "5",
      "text": "Movie very gore and pessimistic. Only entertaining."
    },
    {
      "rating": "10",
      "text": "It's really sad that this film has an even lower rating than the slightly earlier remake. It kicks the crap out of all that came before and after, including the original. This is the best told version of the Hewitt story, hands down. R. Lee Ermey is at his most evil, and really steals the show. The vibe is much like The Hills Have Eyes remake  properly twisted."
    },
    {
      "rating": "9",
      "text": "This prequel was just slightly better than the remake but both are amazing Horror films! Once again the more I watch it the more I appreciate it as it's got everything a good Horror film needs, especially with a killer like Leatherface at the reigns. Jordana Brewster steps in to fill Biel's shoes and does a great job I think, but once again the cast as a whole is just great  Overall another impressive addition to the TCM series and I now look forward to tracking down the original ones!"
    },
    {
      "rating": "6",
      "text": "That's what I call a horror, disturbing, vulgar, slasher, thriller, gory, amazing, shocking, breathtaking film! Not Micheal Bay's The Texas Chainsaw Massacre remake for 9 years old, a PG horror, I HATE Micheal Bay's The Texas Chainsaw Massacre, the prequel \"movie I am reviewing\" is way to better, GOD! Worth the watch!"
    },
    {
      "rating": "5",
      "text": "Fine, but not great. Not scary or whatsoever at all and I think that this \"reboot-prequel\" is the worst that I've ever saw. I hope to not watch a movie like this again in my life...I doubt.\rI liked the atmosphere, makeups and some other little things. Stop here. Cheers!"
    },
    {
      "rating": "8",
      "text": "The acting was good, the gore effects were well made and the movie was entertaining all the way through. I honestly don't understand all the hate against this movie.It's a bloody (literally)  fun movie."
    },
    {
      "rating": "8",
      "text": "Después de la original y el remake esta viene siendo la mejor, y entre todas creo que es la más sangrienta de la saga, no sorprende como el remake que salió antes, pero es la última buena película que nos dieron de la franquicia, aquí se ve claramente que la familia Hewitt son peores que el propio Leatherface."
    },
    {
      "rating": "8",
      "text": "Movie was better than the previous movie (which I rated 2/10). Leatherface was pretty creepy with his new mask and more gore. The end of the movie was not what I expected. The movie was good with barely any flaws. 8/10"
    },
    {
      "rating": "10",
      "text": "its great movie its scary have good story and good leatherface kills its just good and i enjoyed it and its not bad some people say its bad but its not"
    },
    {
      "rating": "2",
      "text": "Jordana Brewster was the only likable character of the ones your supposed to like. The gore was excessive and not at all creative. And it lacked any suspense because with the exception of one small tidbit in the end, It is the same exact movie as the first one. Its ridiculously bad, but I'll give it 2 points for Jordana, at least she tried."
    },
    {
      "rating": "10",
      "text": "Great movie."
    },
    {
      "rating": "2",
      "text": "[***SPOILERS***] It's amazing to me how a 300 lb guy carrying a 50 lb chainsaw can just pop up out of thin air. How the sheriff character can seemingly be in two places at once, and women were wearing low rider jeans in 1969. Andrew Bryniarski had better find himself a tux come Oscar time. NOT! Boring and pathetic lets hope it kills this franchise."
    },
    {
      "rating": "10",
      "text": "Classy gore...tasteful carnage truly in line with the Leatherface tradition"
    },
    {
      "rating": "10",
      "text": "While the film generally sticks to the formula, it does it with a panache not seen in similar films. I'm a fan of the franchise hands down so this may be a bit biased but I found it to be an intense and stylish romp through the world of splatter films. Two thumbs up"
    },
    {
      "rating": "7",
      "text": "Not great or really much different from the last version, but still not bad. Didn't think it was deserving of being panned by most critics. Definitely was one of the goriest movies I have seen. I left the theatre feeling the same as I did after seeing The Hills Have Eyes: like I needed a shower."
    },
    {
      "rating": "10",
      "text": "Impressed, I was with this installment."
    },
    {
      "rating": "10",
      "text": "I thought it was a worthwhile use of my time. I shrieked a lot."
    },
    {
      "rating": "2",
      "text": "All hamburger with no fear or suspense."
    },
    {
      "rating": "10",
      "text": "I thought is was better than the first one (remake) and I thought they were both better than the original. I loved it.."
    },
    {
      "rating": "6",
      "text": "the movie is alright nothing spectacular or great. the movie shouldve been longer than 84 min to tell the story of how leather face became to be. no need for gore when u dont need it like half the movie does. i was suprised though with the end and they did good on that part. still the 2 newer ones dont come close to being as good as the original one"
    },
    {
      "rating": "1",
      "text": "There is a difference between a movie being scary, and a movie just being nasty. This movie isn't scary at all, just very gruesome and loud. A waste of time imo."
    },
    {
      "rating": "7",
      "text": "Im not really a fan of this type of movie. It doesn't scare me, or really get any emotion out of me- except \"Gosh. That was gross.\" That said, this movie was amusing, and probably better than the first one, or even the original in my opinion. Which isn't saying too much. Two other movies of similar calibre would be HOSTEL, or WOLF'S CREEK. I would rate all three about the same."
    },
    {
      "rating": "8",
      "text": "Although it does have the formulated Boogeyman storyline and yes the stupid teenagers (everything from gung ho to no go), this movie actually had a few parts that made me jump. Not sure if it was because most of the female audience members screamed and I wasn't ready or I was actually scared in some parts. What truly made this a good movie for me is that one final scare. When you see it, you may debate the formulated value of it and yes, you may even say it is predictable, but it's just that ONE moment that it happens that catches you off guard. One of the other things I liked about this version is that there was no reservations on the gore factor. My suggestion is do not see this on a full stomach if it is weak because it is a bloodbath at some points, but all in all it was a fun way to pass a couple of hours!!"
    },
    {
      "rating": "7",
      "text": "Good movie. R Lee Ermey and Letaherface rescue this movie from sinking."
    },
    {
      "rating": "0",
      "text": "Can't believe people went to see this in theatres. I know i would have asked to be refunded. Or left before the end to get it. Its THAT bad. Really. REALLY!"
    },
    {
      "rating": "10",
      "text": "This is by far the best movie of the Texas Chainsaw Massacre movies. Its by far the most brutal movie, and includes such graphic scenes as Leather Faces first \"face peel\" and \"the birth of the monster\" Two thumbs WAY UP!"
    },
    {
      "rating": "8",
      "text": "The movie was great but seriously. Jordana Brewster could have just ran away for her life and screw her friends."
    },
    {
      "rating": "4",
      "text": "This movie just follows the mold of the stereotypical horror flick that you"
    },
    {
      "rating": "10",
      "text": "A great movie."
    },
    {
      "rating": "1",
      "text": "Could have been so much better but the director lacked the talent to manipulate the suspense. Don't waste your time."
    },
    {
      "rating": "2",
      "text": "The horror genre is the unique area of filmmaking in which filmmakers never need or even want a good reason to turn out endless exploitative sequels of successful horror originals. There is absolutely no point to this derivative prequel. If the film's intent is to tell the story of Leatherface's origin, it clearly has nothing new to say. You won't learn any special insights into the mind of this assembly line serial killer that you haven't already been bludgeoned over the head with in previous installments. 'The Beginning' is very gory, but never scary. In fact, the Hewitt family isn't perversely fascinating and tantalizingly maniacal like the best screen villians should be. Frankly, I just found them annoying and grating. The death scenes are sufficiently grisly to please fans of ultragore, and there is yet another twisted dinner scene, but the film is utterly forgettable. By the end, you will most assuredly be praying that Leatherface's chainsaw FINALLY runs out of gas. God knows this series did ages ago!"
    },
    {
      "rating": "0",
      "text": "A waste of time and money"
    },
    {
      "rating": "8",
      "text": "IT was a whole lot better than the last one. But I did find myself thinking about other things for a little bit of the movie. As gore goes, it's the best gorey movie of its season!!!!!!"
    },
    {
      "rating": "2",
      "text": "The critics are right  about the 29 review. The beginning is the beginning of the worst Texas Chainsaw Massacre movie and can't be watched. The only thing there to watch are bland sets and terrible voice acting."
    }
  ],
  "recommendations": [
    "the_texas_chainsaw_massacre",
    "texas_chainsaw_3d",
    "friday_the_13th",
    "the_hills_have_eyes",
    "house_of_1000_corpses",
    "the_collection",
    "hostel_part_ii",
    "the_grudge_2",
    "the_ring_two",
    "the_last_house_on_the_left",
    "the_grudge",
    "a_nightmare_on_elm_street",
    "scream_4",
    "halloween_ii",
    "cabin_fever",
    "see_no_evil",
    "the_amityville_horror",
    "wish_upon",
    "saw",
    "rings",
    "the_green_inferno",
    "malignant",
    "final_destination_2",
    "jigsaw",
    "halloween_iii_season_of_the_witch"
  ]
}