{
  "id": 1031,
  "title": "The Witch",
  "starring": [
    "Anya Taylor-Joy",
    "Ralph Ineson"
  ],
  "runtime": 92,
  "genre": [
    "Drama",
    "Fantasy",
    "Horror",
    "Mystery"
  ],
  "description": "In 1630, a farmer relocates his family to a remote plot of land on the edge of a forest where strange, unsettling things happen. With suspicion and paranoia mounting, each family member's faith, loyalty and love are tested in shocking ways.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o384OC1tCV8nCnozkM6y4MiSqsw.jpg",
  "categories": {
    "plot": 6.444444444444445,
    "acting": 7.419354838709677,
    "ending": 6.75,
    "soundtrack": 8.5,
    "cinematography": 7.9,
    "familyFriendly": 3.0,
    "funny": 5.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A stunning, impressively acted period piece. Though it will surely bore those who also hated The Babadook and It Follows, The Witch is another example of what horror is capable of -- truly great, atmospheric filmmaking.What The Witch has that the other recent great horror flicks of recent years doesn't though is a completely satisfying, unambiguous conclusion that will be welcomed by viewers who aren't a fan of \"artsy\" horror. It's a gorgeous, masterfully edited and scored, shocking 90 minutes."
    },
    {
      "rating": "6",
      "text": "A snooze fest with no deep hidden meaning to make the incredibly drawn out pacing worth it. The old time dialogue only brings out the confusion this movie brings to the table, and between that and the nearly pitch black scenes, many parts of this movie will leave you flat out boggled. Some good cinematography, acting, and surprising moments save this movie from being bad, but ultimately this one is a bore."
    },
    {
      "rating": "5",
      "text": "Respectable acting, cinematography, and writing, but not much else. Anyone that says this movie is \"terrifying\" on any level is most likely a paid review. The movie wastes plenty of time giving you details about the family rather than trying to scare you, although none of it feels like it was worth taking up 75% PERCENT of the movie's runtime. At best you could watch this movie as a mystery/drama. The fact that this movie is at all classified as horror is just asking for people to be disappointed."
    },
    {
      "rating": "4",
      "text": "Long dragging, boring drama at best. The VVitch is not a horror film. I found the acting horrible at times. The plot is predictable and failed to build. The only positive about The VVitch is the cinematography. I found it to be more arty yet lacked when it comes to the writing and creating suspense. It just never leaved up to its potential."
    },
    {
      "rating": "3",
      "text": "A lot of people who didn't like this movie are getting criticism from those who did enjoy it. I'm a movie buff and I like the occasional indie film as well, but this movie was just plain bad. I know what suspenseful buildup is and I know what intentional slow burn is. I wasn't expecting a jump scare gory blood bath horror flick. I knew what type of movie I was getting myself into. That said, this movie was still dreadfully boring and had very little payoff. It barely had anything enticing about it except for the final 10 minutes, although even that was quite predictable. It was a historically accurate period piece sure, but was it entertaining horror? No. If you want to \"live deliciously\" just youtube the ending. It's really about the only thing this bore fest has going for it."
    },
    {
      "rating": "3",
      "text": "Not a Horror imo. Loved the use of Old English but nothing about it was scary. I see some reviews say sense of dread etc, but I got none of that at all, I was very dissappointed, no insight into why he was banished and the ending, well, say no more"
    },
    {
      "rating": "5",
      "text": "I was extremely let down by this movie.  All the critic reviews claimed that it was terrifying and thought-provoking, but it is not.  There are some beautiful scenes and some creepy images, but that seems to be all there is.  The characters in the movie don't react to anything, you never get the sense that the father is someone who would have been banished from a New England colony and they never go into why they are out there.  The main characters are all well-acted, but since none of them have an arch, it doesn't matter.  There's no story being driven forward by the characters, it's just things happening and aren't they scary?  No.  Not really.  Even the one feeble jump scare that seemed to get everyone in the theater was ultimately made pointless by the reveal at the end.  I was trying to think of why it was just not very satisfying and maybe I wasn't getting it (I'm sure \"real\" critics would argue that very idea), but after we left the theater, a girl walking nearby who had just seen it just said \"that was the worst movie I've ever seen\", and I started laughing because, yeah, I wanted to like it like the professional critics seem to, but I don't.  It's not entertaining, it's not interesting, it's well-made like a stock photo is well-made.  Parts seem to point to a whole, but there's no more to be had."
    },
    {
      "rating": "10",
      "text": "This movie proves that you can create a masterpiece with low budgets. The Witch is one of the best suspense/horror films ever made, rolled in a simple location, with convincing actors, not using the abusive gore that is so common in this kind of movies nowadays, and with a great screenplay.\rCongratulations to the high talented team who made this excellent work.\r...and thanks"
    },
    {
      "rating": "8",
      "text": "A very enjoyable period piece. The horror is muted and largely psychological, but there will definitely be some scares. What comes through more strongly, however, is the enormity of the untamed wilderness around them, the absurdity of malnourished subsistence farmers living alone in the New World. The threat of witchcraft hanging over them can barely rival that.\r The movie brings different colors to the table. Dread is intermingled with humor, often through some oddly well-cast goats. The performances and dialogue are credible. The movie has a real ending, but questions are nonetheless left unanswered, even from the opening scene. The score is creepy, the direction taut, and I would want to see more from this creative team."
    },
    {
      "rating": "7",
      "text": "Generally quite creepy, and very disturbing in places. It gets you on edge. You see this plantation era, god fearing family turn against one another one by one, its hard to watch in places. It genuinely deserves the description of unnerving. Even the damn goats were creepy, how does that happen? Anyway, goats aside i thought this movie was a good horror film, with very unique cinematography, and a totally new spin on the worn out cliche story of the witch in the woods."
    },
    {
      "rating": "7",
      "text": "I am going to walk through the entire movie and explain everything that actually happens. Based on reading this, it is unlikely you will have a desire to see this movie, so stop here if you so wish, or just take my word for it that this movie is definitely worth a watch. Okay, here is The Witch at face value. The movie starts with a family of 7 being kicked out of a puritan community because...well I have no idea why they were kicked out, they speak in this crazy language that sounds like drunk Shakespeare. Dost thou barter a pic sixpense for me ninny? Is something that was said during this movie. So the family drives this wagon (that totally looks like it's going to fall over) out of Jamestown or Boston or some s*** and drive it to a field where they're gonna start new lives. The father builds a house and other manly s*** while the daughter plays peekaboo with the family baby. She closes her eye for like 4 seconds and loses the baby. Horrible babysitter. The family moves on, because you know, back in those days like 80% of babies died. Anyway, The father and eldest son go hunting and try to shoot a rabbit, but the rabbit looks at them menacingly and his gun jams and something flies in his eyes, which are unaffected for the rest of the film. Then the boy and father get home and the two youngest children are playing with the family goat. The next morning the boy wants to go hunting but his older sister won't let him go alone and so she goes with him. After like a mile the girl falls off of the family horse and the boy goes on without her and makes out with this hot but clearly evil woman who came out of a tree. The girl wakes up and runs home to tell the family, later that night the boy teleports back to the home completely naked. The eldest daughter is accused of being a witch because the naked boy who was left out in the rain won't wake up. Then he wakes up and it turns out he was just choking on a gross apple. Then he re enacts what would appear to be an entire performance of Macbeth before dying. The Father thinks a witch killed his son and does what every rational parent would do, and locks every one of his 3 remaining children in sheds outside. He then stays outside and prays while eating dirt. Meanwhile, a crow goes in to motor boat the mother. Morning comes, the family goat kills the father, the two youngest children vanish and the mother tries to kill her only remaining child. The eldest daughter stabs the mother, goes to nap in a shed, wakes up to talk to the devil, then goes into the woods where tons of tastefully nude women are dancing and flying. The end. That's the movie, but you have to believe me...it's worth a watch."
    },
    {
      "rating": "7",
      "text": "Wanted to love it after the excellent trailer, didn't quite live up to those hopes but still a decent film. It's not really a frightening piece so much as an unsettling one. There are a lot of beautiful elements here (cinematography, production values, solid performances, score), but somehow the sum is a bit less than its individual parts."
    },
    {
      "rating": "8",
      "text": "The Witch didn't exactly terrify me, but that's okay because I don't think that was the point. The film is marketed as an incredibly disturbing horror film set in the 1600s, which kind of misrepresents it to some degree. If you go into this film expecting the next Exorcist, you will be truly disappointed because it's not exactly like. The Witch feels more like a period piece that's a historical commentary on religious hysteria and the dark side of witchcraft.\r In The Witch, a Puritan family is banished to the edge of a large forest which happens to be home to a repulsive witch (my apologies to the actress playing her) and supernatural things begin to happen which tear the family apart. Eventually, everyone bar the main character Thomasin dies and then Thomasin makes a pact with Satan and joins the witches. An ending which has mystified and, strangely, angered many movie-goers. The ending is representative of Thomasin's desperation. If she didn't make the pact, her options were to risk going back to the plantation on foot, a journey that would take her several days on foot in addition to her possibly being tried as a witch if she was to explain the events that transpired on the farm. Or she could stay on the farm and starve to death. If I was in her shoes, I'd do the same thing.\r The film, however, does have it's roots firmly planted in the horror genre despite this fact through its usage of truly disturbing imagery. Samuel being turned into \"flying ointment\" at the very beginning sets the bleak tone of film incredibly. The family gradually tearing itself apart is a consistent theme that is executed excellently during the films tight one hour and thirty minute run-time. Other events such as Caleb's seduction and subsequent possession in addition to the creepy twins being, well, creepy twins helps the film fulfill it's promises of being a horror movie.  The use of lighting to conceal the witch is a brilliant touch, we never see her face in broad daylight except for one scene where she assumes a younger (and FAR better looking form) simply to seduce Caleb. In a scene where the witch appears at nighttime in the stables to startle the twins and Thomasin, her face is concealed by the shadows of night. This shot preys on our fear of the unknown and elevates the film into its status of critically acclaimed.\r I feel like The Witch's biggest flaw is just how radical it is. This is definitely a film that the common moviegoer will not understand, hence why many reviewers have given it a low score. In addition to this, the marketing portrays the film as more grandiose than it is, confusing any audience members (like me) who followed the marketing. Overall, the film is great for what it is, but as stated before, don't raise the bar too high."
    },
    {
      "rating": "9",
      "text": "Not for the average moviegoer.  If you love the Transformer movies and think The Rock is a great actor and never miss an Adam Sandler movie, THIS ONE is not for you.  Plan on bringing your old English dictionary with you, and listen closely.  I need to see this movie again because I'm sure I missed plenty along the way.  This movie will play very well on Blu-ray or Netflix in the privacy of your living room.\rWhat do you really need to know about this movie?\rIt's beautifully-acted and hard to watch.  It's very dark and disturbing and one can lose the reality they're watching a movie and not some real family falling apart.  This movie is incredibly unsettling and not for the faint of heart.  Some surprises along the way, but not a lot \"happens.\"  You need patience to appreciate this one.  I wasn't a huge fan of the VERY end, but everything else was superbly done.  This movie gets from me a \"9\" on the horror scale..  because it is SO well done and SO different."
    },
    {
      "rating": "9",
      "text": "It's not your typical horror movie. Its very slow paced but artistic, eerie, and true to the time and setting. Its not the cliche' jump at you scary movie. Very realistic. I appreciate the tone of it and the acting was the best I've ever seen in a horror movie. Every line was like a verse from the Bible or a Shakespeare quote. If you appreciate good artistic cinema than you'll enjoy this. I usually laugh while watching horror movies cause I can't take them serious or i'll predict what will happen at the end, but this movie was absolutely terrifying. I'm still haunted just thinking about what happened in that movie. Again, it's not for everybody but for me its an instant classic."
    },
    {
      "rating": "9",
      "text": "The negative fan reviews shock me almost as much as this amazing, creepy, beautiful, terrifying film. I saw it several months ago at a screening and couldn't wait to see it again. Everything: soundtrack, dialogue, cinematography, acting, pace seamlessly create a mood of real dread unlike anything I've seen in years.\r Maybe some people going in were expecting a jump scare, slasher film. This isn't that. Its a deeply moody slow boil about a family unraveling as evil eats it from the inside out.\r Go see it."
    },
    {
      "rating": "10",
      "text": "Slow-burning tension, chilling atmosphere, superb acting and direction make this a can't miss horror-thriller that breathes new life into the genre. If you are into cheap jump scares this is NOT the film for you."
    },
    {
      "rating": "9",
      "text": "The Witch is truly the most disturbing horror film i have seen in years and i don't say that lightly. the acting is great, the script is amazing and period detail is very authentic. Robert Eggers gives us an incredible writing and directing debut with virtually no jump scares and proves that the best horror films rely on psychology over loud noises and too many special effects. seriously worth a watch unless you like cliche **** horror films"
    },
    {
      "rating": "10",
      "text": "Incredible storyline, intelligent film, a horror as not seen for years. It is not a sustinhos film (which I prefer), but you pass a bad energy, agony. Explore the silence and accurately show how humans are alienable when it comes to cults and religious beliefs. Despite the name \"The Witch\" the film has no protagonist or antagonist direct a witch, only around mid-long witch is revealed and then find that they are witches in the plural. The big mistake was that it was sold as the scariest movie of all time and this definitely is not it, this film to be seen with expectations for a great movie and not a scary movie. Congratulations to director Robert Eggers for his creative script and a canny direction. Another that deserves a round of applause is Anya Taylor-Joy for his great performance as the protagonist."
    },
    {
      "rating": "0",
      "text": "I want my 90 minutes back.  Worst movie I've suffered through in the last decade, at least.  Filmed in such low light virtually nothing was visible.  Absolutely no plot; no continuity of story (no story) and zero intelligence required to watch it.  Sadly, I'm now proof of that.  IF you feel the need to watch this, wait for it to be free on a low grade movie channel.  Frankly though, even 'free' is too high a price to pay.  I can't find anything nice to say and wouldn't be saying anything at all if I didn't truly want to save prospective viewers from wasting their time."
    },
    {
      "rating": "6",
      "text": "I was expecting more from this film based on the critical acclaim it garnered but left the theater disappointed. The movie is definitely well-made and original but it seemed somewhat uninteresting. I thoroughly enjoyed the concept but feel the creators did not deliver a product that reached its full potential. Highly unsettling and disturbing throughout but just not very scary or interesting. 5.9/10."
    },
    {
      "rating": "10",
      "text": "Mystery/Thriller not a Horror film. Wrong genre is being given. Complex and perfectly crafted. Everything about this film exudes quality - the acting, production design, editing, pacing, sound and story. To be both complicated and high quality is tough and the director pulled it off. Satisfying ending.\r Go see this movie is you like a perfect Mystery/Thriller. Highly recommended."
    },
    {
      "rating": "10",
      "text": "Metal. As. F**k This movie is weird, very weird, after the 3rd scene, the entire audience audibly said \"what did I just watch\" lots of people hated it, but I LOVE IT. I loved everything about this movie. The shots are beautiful, very creepy, no jump out parts. My perfect movie. This movie is as metal as you can get :)"
    },
    {
      "rating": "9",
      "text": "Incredibly well-acted, beautifully shot, and with a gripping score, The Witch is a tremendously terrifying film with some legitimate drama tied in.  This movie consistently created extreme tension, and is definitely one of the best horror films I have seen in the last few years."
    },
    {
      "rating": "7",
      "text": "This is not really a horror movie, though there are some very disturbing images.  It is also not a movie that people who want clean resolutions and happy endings will appreciate.  The cinematography offers the viewer a bleak and rather desolate glimpse into isolated frontier life, albeit from an earlier time period.  The acting is pretty strong.  The complications and tragedy which befall the purposefully isolated family ranges from uncomfortable to disturbing to rather silly and overwrought.  Still, it is not the typical film of this genre and there was a strong attempt to do something different.  I was really on the fence about rating this.  I suspect that very religious people will be offended and horror movie buffs will be greatly disappointed.  It is thoughtful and accepting of the supernatural being real, which will surely disturb and anger some.  There is not a tremendous amount of character development, just bad and unfair things happening to people.  This will not be everyone's cup of tea,"
    },
    {
      "rating": "7",
      "text": "Do NOT see this film if you are expecting a typical horror film. This is a Sundance film. There won't be jumpscares or anything like that. The movie is really more of a period piece drama with psychological horror. The purpose isn't to freak you out but instead to explore themes such as paranoia, faith, and sin. The ending has proven to be very divisive. I wasn't wowed but I wasn't disappointed either. The acting is top notch, especially when it comes to the child actors, and it is shot better than most \"horror\" movies. See it if you are interested in a well made drama with some creepy elements."
    },
    {
      "rating": "7",
      "text": "I agree that this movie is a horror masterpiece. Very suspenseful, a little confusing because of the accents of the actors. It definitely stays with you long after you leave the theater. I want to see it again, now that I know how it ends. You don't need cheap scares to be considered as a horror flick. The entire movie is a mind trip."
    },
    {
      "rating": "7",
      "text": "I won't dispute that this movie is enjoyable and a little creepy.  However, it's being proclaimed a horror masterpiece.  This is not even a sliver as scary as \"The Exorcist.\"  It's beautiful to look at, well-acted, and has a good musical score.  It's one of those movies that many film critics and industry insiders really seem to appreciate.  Many actual consumers who are horror fans will be left asking those critics, \"How out of touch are you?\"  I haven't been this disappointed with a film critic darling pick for horror since \"A Girl Walks Home Alone at Night.\"  Both are good films, but way too much hype on the fear factor."
    },
    {
      "rating": "10",
      "text": "Ever since seeing the trailer a few months ago, I've been dying to see The Witch. It calls to mind recent arthouse horror movies like The Babadook and Goodnight Mommy, but The Witch is far scarier than those movies. It's a grim, perverse, and disturbing tale of religious paranoia among a crumbling family that will surely be remembered alongside the likes of Rosemary's Baby and The Omen. The Witch takes place in 17th century in Puritan-era New England. A family is excommunicated from their village and settles on the edge of a vast forest. Soon thereafter, their baby goes missing into the woods, and the family is torn apart by accusations of witchcraft, black magic and possession. From the first ten minutes, The Witch has a morose atmosphere and starts out with an incredibly disturbing scene. The initial shock is carried through the next few scenes which are dialog-heavy and slower, causing the dread to continue to the next horror. The terror never lets up and only amplifies as the plot progresses until the final 20 minutes are agonizing to watch. I could only vaguely tell you how the movie ended because I was watching through my fingers. It's perversely scary. The acting is fantastic from the entire cast, especially from the child actors. They're given heavy stuff to work with and pull it off with unsettling results. Along with amazing cinematography and an ominous score, it'll be difficult to find a better horror movie than The Witch this year. It'll leave you shaking."
    },
    {
      "rating": "9",
      "text": "The Witch is not your typical horror movie. It has more in common with the work of Kubrick and Tarkovsky than the most recent Saw or Paranormal Activities sequel. It's deliberately paced, painstakingly detailed, impeccably researched and more concerned with existential horror than jump scares. If you are willing to give yourself over to the film, the rewards are great. However, if you come into this film with preconceived notions of what a horror film should be, you will probably be disappointed"
    },
    {
      "rating": "9",
      "text": "This movie was fantastic! This was more of a slow burn of dread than an actual horror movie. This movie won't be for everyone, if you are expecting traditional jump scares you will be disapointed. This is more of a drama with themes of pride, fear of the unknown, and loss of faith, in a horror setting. I won't give any spoilers, but while the acting was terrific, Black Phillip was the star of the show."
    },
    {
      "rating": "1",
      "text": "it's a howling mess...right from the large passages of unintelligible dialogue to the hilarious witch tropes like gnarly old moondancing women who straddle broomsticks and take off into the night sky.  but it's just the sort of sundance trifle that causes a stir and a tsunami of gushing praise by a large group of critics apparently overcome in the throes of mass hysteria.\r is it supposed to be some kind of stroke of iconoclastic genius that fevered religiosity should end up bringing down upon itself the terrors of which it constantly warns its flock?  far too much to hope that the makers of this film might not be such blatant panderers, and that they might have something original--or at least brave--to say on the subject."
    },
    {
      "rating": "9",
      "text": "The Witch realistically recreates the paranoia that can come of living alone in a forest, separated from the support of a community, when things start to go wrong and spiral out of control. This dark film is both gripping and devastating because you know what is going to happen and can see no way out of its inevitable outcome. You hope for a savior and yet you also know that none is coming. Is it a horror film? Definitely and perhaps more devastating than most because Robert Eggers, the writer and director, takes the type of story we have read and seen many times before and makes it utterly real. It is also an indictment of the type of religious belief that makes people, who are proud, independent, afraid, and starving, show no compassion but think the worst of each other, even their own children. This is a very powerful film that is in many ways an indictment of and explanation for the callous and rigid religious fanaticism that America was founded on. I have only one criticism – in his pursuit of mood and realism, Eggers let the actors slur their words, confusing the audience about what exactly is going on more than necessary. The director only got away with this because we are probably as familiar with the tales of witchcraft in colonial New England as we are with Jack the Ripper."
    },
    {
      "rating": "2",
      "text": "This film has been receiving amazing reviews since last year, it's been described as terrifying, haunting etc. I guess I must have been watching a completely different movie. 1 hour and 32 minutes of sitting there wondering what in the hell am I watching? It starts off slow and when it eventually starts to pick up it never takes you anywhere finally diving headfirst into the trap so many of these movies fall into, a chaotic ending. This is all atmosphere and not much else, in fact there is nothing else, it leaves you with a sense of dread for the whole movie but that's it, no story and terrible dialogue. Is it really too much to ask for a good horror movie? Apparently it is. I expect a certain kind of standard for this genre and The Witch doesn't even come close, not recommended."
    },
    {
      "rating": "0",
      "text": "this movie is boring i dont know what is the horror in it, i think all the critics were drunk or high while watching the movie.This is the worst movie I have ever seen. Do not believe the critic reviews. This movie is boring, slow, and the characters are not only annoying, but most of the time I could not even understand them due to their accents. Stay FAR away from this trash."
    },
    {
      "rating": "9",
      "text": "Incredible.  As far as being a period piece, it rivals The Revenant for authenticity.  As a horror piece, it delivers on all levels.  And maybe a nomination for Best Supporting Actress by Anja Taylor-Joy?  She was riveting."
    },
    {
      "rating": "8",
      "text": "The Witch uses its best-in-detailed moments to perfectly describe its perfect storyline and it also uses the best effects any horror movie can have in a movie since who even knows the last movie."
    },
    {
      "rating": "10",
      "text": "The Witch is a genuinely terrifying horror film that shows how religion and faith can be much scarier than a loud noise on a video camera.\rA new horror movie staple. I love, love, love this film. Go see it!!!!"
    },
    {
      "rating": "8",
      "text": "Dark and ominous is the feeling you get while watching The Witch.  More than your typical jump scare horror film with The Witch most of the scares come psychologically.  A-"
    },
    {
      "rating": "2",
      "text": "This movie gets a 2 for the cinematographer, and Period perfect setting. They got those 2 things right, especially the camera work. This movie is boring. So VERY BORING! It was only an hour and a half, but felt twice as long. This is really not a horror movie, as much as a period film about early American settlers. Please don't listen to the hype. Save your money."
    },
    {
      "rating": "10",
      "text": "Powerful, deeply unsettling, eerily beautiful, and profoundly creepy. Also brilliantly directed and scripted, and perfectly acted, edited, shot, and scored. This is a superbly made, thematically complex, and startlingly, uncompromisingly original horror movie, the best since It Follows, and, similarly a masterpiece. Yes, horror movie-- obviously a very subjective notion; personally i've been creeped out for days since i saw it."
    },
    {
      "rating": "10",
      "text": "The Witch was fantastic. The acting, even amongst the child actors, was great. The score was creepy. The story was really suspenseful. I'll agree with a lot of the others here who say that it wasn't very scary. However, it didn't feel like it was supposed to be overly scary. They didn't resort to cheap tricks or anything. They just told a really creepy story. It also didn't feel like it had been done before a million times. It was a fresh perspective of witch folklore."
    },
    {
      "rating": "7",
      "text": "The movie was like the \"The Visit\" for me.  Potentially a great movie but the writing or editing makes the storyline a little disjointed or swiss cheese like.  I would wait for video or a cheap theatre.  It was visually a great story and the actors were all good."
    },
    {
      "rating": "7",
      "text": "The cinematography, landscapes and music make for one creepy, dreary, disturbing movie. The Witch isn't all that scary when you watch it, only when you start to think about it afterwards does it get to you."
    },
    {
      "rating": "4",
      "text": "Evil Dead was an independent horror movie.  The Witch is not.  I knew nothing about this movie going into it except that it was a horror movie.  It started out OK- excellent creepiness when The Witch of the Wood stole the baby, but that's where the horror ended.  The rest was a drawn out \"beautifully crafted\" drama typical of independent movies- but the only thing I was scared of, was falling asleep.  It appeared the cast and crew made a true effort to recreate the detail of the time period.  The acting, costumes, set design were all good.  The only reason I'm rating this movie as a disappointment is because it was sold as something else and didn't deliver."
    },
    {
      "rating": "9",
      "text": "This was masterfully written and directed slow yes but if you like steady build up and finer details in a movie then this is the movie for you. At the end it gave one a pleasant mood. What a terrific film. People are used to Hollywood styled movies these days."
    },
    {
      "rating": "8",
      "text": "The Witch is a good movie, but it also has a very narrow audience. For those that love slow, yet tense, horror films that are as bizarre as they are scary, this film is for you. The Witch is unnerving, super realistic, and wacky to a fault. I will say that the film’s writer and director Robert Eggers did an amazing job for a directorial debut, and he is undoubtedly a force to watch in the future.\r From the opening scene of the film to the very end the film is unnerving. The film is quite slow, but never really boring, because the filmmakers did a great job creating a very tense tone. The tone is essentially formed from three major elements of the movie, the bone-chilling music, the ominous cinematography (especially in the forest), and the always noticeable presence of darkness lurking. In this film the titular character isn’t in the film often, but their presence is felt. Combine that with the excruciating attention to detail, and the film takes on a sense of reality.\r The film is extremely realistic, and that is because Eggers took the time, and had the attention to detail to make the film as realistic as possible. While the dialogue may distract some, it is exactly how people used to talk in the colonial era. The lighting is usually dim, but is to is realistic as the film is literally made to look as if it’s being lit by candlelight or moonlight. The actors were on point, most likely due to great direction, and the sets were almost exactly what one would expect things to look like back then. That kind of dedication, deserves respect, but it also helps the audience get lost in the filmic world.\r However, the film is downright wacky, and in some ways that’s great, and in others it hurt the film a little. The film is unlike anything I’ve ever seen before, in an interview Eggers said his original pitch was “too weird, or too obscure” considering the film he made, I want to see that film because this one was wonderfully obscure and weird. However, the film was a little hard to follow, at times it felt as though too many things would happen in a short period filled with moments of confusion, which did help reinforce the insanity the characters were growing into, but made it harder to follow.\rIt may not have helped the film, but as an observation, the film was devoid of humor. In the end, the film is original, unnerving, realistic, very well made, but does have an obscure feeling to it. The cinematography is beautiful, the filmmakers had an amazing attention to detail, and horror fans will most likely like the film. If you like the wacky, weird, obscure horror films that don’t rely on cliches and jump scares, check this film out."
    },
    {
      "rating": "2",
      "text": "[2/10]\rPros:\r1.Good suspence\r2.Good violence.\rCons.\r1.Not a typical horror movie, very few horror scene.\r2.No spine chilling horror.\r3.Slow paced, boring plot.\r4.Predictable climax."
    },
    {
      "rating": "10",
      "text": "If you want to see an original, intensely atmospheric and horrifying film and you have a strong constitution for suffering on a new level then the Witch is the film for you. Wrath of God induced Paranoia - check. Bleak cinematography that captures the mood perfectly - check. Painstaking attention to detail in terms of the period - check - superb acting from everyone - check. Be warned, this isn't a mainstream film out to give you a warm tingly feeling or hold your hand and give you all the answers. It was made with the sole purpose of disturbing you on every level -  which it achieves perfectly. Think of 'The Road,' just with a Witch and without Viggo."
    },
    {
      "rating": "10",
      "text": "Horror cinematography as it should always be. Eerie music and beautiful dark photography, excellent acting, omission of too much splatter, all combine to create a phobic atmosphere and a paradigm in horror cinema."
    }
  ]
}