{"id": 3268, "title": "The Rookie", "starring": ["Dennis Quaid", "Rachel Griffiths"], "runtime": 127, "genre": ["Drama", "Family"], "description": "Jim Morris never made it out of the minor leagues before a shoulder injury ended his pitching career twelve years ago. Now a married-with-children high-school chemistry teacher and baseball coach in Texas, Jim's team makes a deal with him: if they win the district championship, Jim will try out with a major-league organization. The bet proves incentive enough for the team, and they go from worst to first, making it to state for the first time in the history of the school. Jim, forced to live up to his end of the deal, is nearly laughed off the try-out field--until he gets onto the mound, where he confounds the scouts (and himself) by clocking successive 98 mph fastballs, good enough for a minor-league contract with the Tampa Bay Devil Rays. Jim's still got a lot of pitches to throw before he makes it to The Show, but with his big-league dreams revived, there's no telling where he could go.", "releaseYear": "2002", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/sQ2TLmcYxuWNWn5QDNUc2UDQBW1.jpg", "categories": {"plot": 10.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "Hey! It's the feel good movie of the zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz..........................................."}, {"rating": "10", "text": "A baseball pltcher blows out his elbow and becomes a chemistry teacher, husband, father, and coach of the high school baseball team.  Okay so far.  Now his team needs to see faster pitches in practice so they can hit the opposing team's pitcher during the games.  Little does the coach know he's throwing in the high 90's; that's Major League \"stuff.\"  His players make a deal, they win, he goes to a Major League tryout.  Who knew this was a true story about a real person?  I don't have that many DVDs but this one is in my collection."}, {"rating": "8", "text": "Rookies were meant to live up its own years of starting to become experienced at things and the Rookie somehow brings all of the baseball team in and you'll know what happens next."}, {"rating": "7", "text": "Bardzo dobry film... Film oparty na faktach... Fajne jest to że takie zdarzenia mają miejsce."}], "recommendations": ["moneyball", "sky_high", "the_kissing_booth", "fighting_with_my_family", "the_game_plan", "high_school_teacher_maturing", "fist_fight", "big", "assault_on_wall_street", "my_little_pony_equestria_girls_forgotten_friendship", "42", "bee_movie", "to_all_the_boys_always_and_forever", "a_street_cat_named_bob", "college", "something_borrowed", "the_craft", "cars_3", "race", "the_basketball_diaries", "alvin_and_the_chipmunks_the_road_chip", "you_again", "ralph_breaks_the_internet", "rocky_balboa", "blow"]}