{
  "id": 1593,
  "title": "The Road to El Dorado",
  "starring": [
    "Kenneth Branagh",
    "Kevin Kline"
  ],
  "runtime": 89,
  "genre": [
    "Family",
    "Adventure",
    "Animation",
    "Comedy",
    "Fantasy"
  ],
  "description": "After a failed swindle, two con-men end up with a map to El Dorado, the fabled \"city of gold,\" and an unintended trip to the New World.  Much to their surprise, the map does lead the pair to the mythical city, where the startled inhabitants promptly begin to worship them as gods.  The only question is, do they take the worshipful natives for all they're worth, or is there a bit more to El Dorado than riches?",
  "releaseYear": "2000",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ryXm7xp4aqQyda0FU2eMfHehPBg.jpg",
  "categories": {
    "plot": 6.739130434782608,
    "acting": 6.666666666666667,
    "ending": 7.25,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 7.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Genuinely surprised that this is considered one of the bad Dreamworks films.The Road To El Dorado is not perfect, but it's charming. I thought the first 20 minutes were somewhat draggy and the backgrounds were kind of bland, but immediately when the main characters Miguel and Tulio actually get to El Dorado, the movie picks up a lot. The environment becomes colorful and beautifully detailed, the soundtrack is awesome and I was genuinely interested in everything.Though to be honest, the story is kind of bad. Once the characters get to El Dorado, the goal they set pretty much breaks the feeling of progressive plot movement because the characters basically just tell how this movie is going to end. Almost everything that actually happens in the El Dorado place feels like filler. It's not bad filler, it's very entertaining and charming to look at, but it's nonetheless filler. The only thing that has effect in anything is when the movie establishes the villain, who by the way was pretty useless in the end. And eventually when the third act kicks in, the movie isn't really even trying to build tension, and instead just rushes the ending and then just f*cks off. It really left me scratching my head and ass like \"that's it?\"None of this means that the movie is awful though. I really did enjoy it even though it has some flaws. The animation was very good, even though a bit weird from time to time. Especially in the last ten minutes where there was a weird blend of CGI and traditional that didn't go well together, but overall not a big problem. The characters were pretty nice, except the horse that was just pointless and retarded, and the villain that couldn't do anything. And the songs were really catchy. Almost everything has enough redeeming qualities to outweigh the flaws, even though there clearly are some."
    },
    {
      "rating": "10",
      "text": "It's one of my favourite cartoons and I can't find any significant flaws in it."
    },
    {
      "rating": "10",
      "text": "an excellent cartoon movie for kids"
    },
    {
      "rating": "7",
      "text": "\"The Road to El Dorado\" is like watching a animated Indiana Jones (2 of them) flying around and arousing traps and entertainment to the audience. The movie may move quite linear, but in the end its zesty and thrilling."
    },
    {
      "rating": "10",
      "text": "Bueno, se que probablemente no hagáis caso a esta crítica por varias circunstancias, como que la he hecho bastante tarde y encima la estoy haciendo en español, junto a todo esto he de añadir que solo tengo 15 años y seguramente busquéis a alguien con más experiencia que yo lo cual comprenderé, pero me gustaría que por una vez te sentaras e intentaras leer a gente con poca experiencia en el mundo de la crítica, ya que alguna vez deberás haber sido principiante en algo. Pero bueno, que me enrollo, \"El dorado\" era una película que siempre había querido analizar ya que la gente la había valorado fatal, lo que pasaba, es que yo en esa época no conocía ninguna web como esta, además si hubiera escrito algún análisis en esos tiempo os hubieran sangrado los ojos de la cantidad de faltas de ortografía que veríais.Bueno, que había dicho que no me iba a enrollar mucho, esta película es una película de comedia con un toque de aventuras basada en la época de la colonización, esta situación es bastante original, ya que aunque bastantes películas se habían ambientado en esta época, no muchas se habían atrevido a hacer comedía con ella, pero esto es normal ya que es un pasado muy oscuro de la historia tanto española como del mundo. Respecto a la comedía, que bajo mi punto de vista es el punto más importante de la película, he decir que es brillante ya que usando un humor muy blanco te hace reír una y otra vez, pues aun habiéndola visto varias veces anteriormente, la última vez que la vi (que es desde la cual estoy dando mi punto de vista), lo que destaca en el humor blanco son los rostros, ya que tonterías como las que hace Miguel (uno de los dos protagonistas) pueden llegar a ser bastante graciosas.Respecto al tema de las canciones, yo he las he escuchado en Castellano, cantadas por Sergio Dalma. Estas me parecen un gran aporte a la película ya que están muy bien llevadas e incluso he de decir que cuando no se que canciones escuchar me pongo canciones de esta película.Claro, pero todo en la película no está perfectamente llevado, como por ejemplo las escenas que tienen chistes sexuales, excepto una o dos que están bien llevadas, las otras son muy simples y no te hace reír.Bueno y eso es todo, espero que os haya gustado y creo que por ello se merece un 10 esta película."
    },
    {
      "rating": "6",
      "text": "De la mano de DreamWorks llega la primera película de animación en la que sus dos protagonistas principales son españoles. Una peli de aventuras simplona, absurda y sin mucho trasfondo. Miguel y Tulio son el típico dúo de protagonistas patosos, estúpidos y cobardes pero de buen corazón, Chel la típica chica coqueta, guapa y hábil y Tzekel-kan un malo del montón. La animación está bien, sin más. La banda sonora me parece bastante floja para venir de los señores Powell y Zimmer. La historia mediocre, predecible y plana. Sinceramente, no es una gran cinta; entretenida, sin pretensiones y para pasar el rato. Poco más. A los más pequeños seguro que les gusta pero a mí como gran fan del cine de animación me ha dicho más bien poco."
    },
    {
      "rating": "0",
      "text": "What's not to love about a movie that shows you how to laugh about the spanish conquest of Mexico which resulted in the death of millions of innocent people at the tip of spanish swords?  What's next?  One of these about the holocaust?  This is unfortunately what this movie is, a tragic event in world history turned into animated entertainment.  The movie further perpetuates the negative slander of the spanish against the natives as cruel savages.  Truly an offensive movie for anyone who knows anything about history."
    },
    {
      "rating": "8",
      "text": "A great film for all audiences with inclusions of memorable humour and a charming score. While the story and morals delivered by this film may be more challenging for children to understand, that does not steal away from the final score."
    },
    {
      "rating": "10",
      "text": "Simply put, an underrated animated classic. Good humor for both adults and children, great action, awsome animation and even some social commentary regarding religion. This is a must see movie."
    },
    {
      "rating": "7",
      "text": "While Road to El Dorado is not a super strong flick I liked it and am glad I saw it. It is a bit more edgy than your average animated kids film. There is some great animation especially on the backgrounds. Some good humor from some likeable characters. Plus, you get a couple good songs. If you have some time to kill and this flick is On Demand, like it is right now until 5/30, check it out. While it may not be as hilarious as something like Dirty Rotten Scoundrels its characters and humor are good enough to make this worth a watch."
    },
    {
      "rating": "5",
      "text": "Some good humour, music and animation is let down by a dumb story and middling screenplay."
    },
    {
      "rating": "10",
      "text": "OK, now let me tell you something, guys, you know this movie, right? Me and my Nathan really really love this movie. We quoted all the lines, we singing the songs from it and we know every single second from it by heart. It's pure entertainment! Every single scene, every single second of this film is just non-stop fun! Quotes are like:Depart mortal, before we strike you with a lightning bolt!Beware the wrath of the Gods! Be gone! Kkh kkh!Save it for the High Priest, honey, you're gonna need it.Kkh kkh!Miguel, it's not working.Kkh kkh!Miguel, you've been caught!Kkh kkh!Miguel. Miguel, wake up. We're there.We found it!Oh, yeah. We found it!Fantastic! Where is it? How far?Right here.Where?Here.Behind the rock?No, no. This is it.But, but... Give me that! This can't...Apparently, ''El Dorado'' is native for... GREAT... BIG.. ROCK!Hey, but I'll tell you what: I'm feeling generous, so you can have my share!You don't think Cortes could've gotten here before us and... and..And what? Taken all the really big rocks? The SCOUNDREL!Tulio! We... we've have to think about this, I... I mean we come all this way and... we... we... we... we should...Get... on... the horse!No, no, not with the face. Stop. Looks like there's a pass right over there....and many more.So Tulio and Miguel was voiced by Kevin Kline and Kenneth Branagh are going to the city of gold also known as El Dorado to find gold along with Altivo. They come across Tzekel-Kan voiced by Armand Assante, the chief and Chel. The songs are by Elton John and Tim Rice who worked on The Lion King however Hans Zimmer composed this movie with John Powell. The songs are upbeat and catchy as hell like the ones which Elton John sings apart from one song that is my personal favorite ''It's Tough To Be A God''. Me and Nathan have been singing it while we're travel training from our old school. This song will be stuck in my head for ages. I know everybody says that. The animation is (as always) is brilliant and that's it. That's all I can say about it. If you guys haven't seen it go watch it, you won't regret it. I mean, where would you be? You're missing out! Me and my friend Nathan Tolson loved it. It's very underrated! I'm surprised that I found out it's a box office bomb in the recent years and didn't make any sequels."
    },
    {
      "rating": "4",
      "text": "An animated combo of the old Bob Hope--Bing Crosby \"Road\" pictures and \"The Man Who Would Be King,\" DreamWorks' third major feature cartoon, \"The Road to El Dorado,\" is a strained and pallid concoction that won't fire the collective imaginations of modern children.\r Five years in production, epic buddy picture went through two sets of directors and numerous evolving concepts, arriving finally at a middle ground between outright romp and a serious take on the arrival of the conquistadors in the New World. Subject matter is rife with possibilities, even for a moppet-oriented effort that obviously isn’t going to grapple with such heavy themes as conquest and subjugation. “Pocahontas” showed that it is possible to tread this sensitive terrain with a degree of balance and sensitivity in terms that kids can grasp.\r But whenever “El Dorado” threatens to get serious, it backs off, retreating into loud shenanigans between its two mischievous heroes, complete with annoyingly anachronistic mannerisms such as high-fiving and shouts of “Yes!”; vampy scheming on the part of its heroine, who looks and sounds like a Las Vegas tart; rambunctious action sequences and montage-oriented musical numbers that tend to center on general concepts (“The Trail We Blaze,” “It’s Tough to Be a God”) rather than on immediate emotions.\r First quarter-hour introduces dark-haired Tulio (voiced by Kevin Kline) and blond-maned Miguel (Kenneth Branagh) as Spanish rascals who delight in creating scrapes and extricating themselves with devilish aplomb. After one prank too many, however, they find themselves trapped in barrels and placed aboard one of Cortes’ ships headed across the Atlantic in 1519. With Cortes’ noble horse, they escape in a lifeboat and finally wash up on a beautiful beach bordered by jungle.\r Quickly captured by imposing bronze-skinned natives, the boys think their goose is cooked upon arrival at the fabled city of gold, El Dorado. But the coming of such “gods,” as they are perceived to be, has been prophesied, and, after a bit of lucky shuffling and hocus-pocus, Tulio and Miguel are installed in exclusive quarters atop one of the city’s many pyramids. Local babe Chel (Rosie Perez) is on to their game and blackmails the flummoxed pair into including her in their plan to escape El Dorado with a bounty of gold, courtesy of a large boat to be built especially for them.\r Although there is a local chief (Edward James Olmos), he, along with the rest of the community, is dominated by high priest Tzekel-Kan (Armand Assante), a commanding figure who pays elaborate homage to the white strangers at first but gradually becomes skeptical of their presumed divinity. The severe holy man is especially offended by the newcomers’ oh-so-sensitive objections to human sacrifice, first when they prevent an execution, and later after the “gods” manage to win a furious ball game and then insist that the losers, contrary to custom, be spared. In a direct lift from the film “The Man Who Would Be King,” Tzekel-Kan realizes that the visitors are just human beings after all when Miguel bleeds from a cut.\r Far too much time is devoted to the two charlatans’ silly arguments about if and how they’re going to pull off their charade, and to contretemps concerning Chel, whom they declare to be off-limits romantically but who manages to come between them nevertheless. By contrast, one of the script’s more promising elements — Miguel’s sudden surge of feeling for the local citizens and their gentle lifestyle when he mingles with them, to the consternation of his anxious partner — is given unduly short shrift. Even if “the allure of the primitive” reps a cliche in the adventure/exploration genre, a bit more time devoted to it would have brought the setting and its inhabitants more to the foreground; as it is, there is no individuation among the native people.\r Kline and Branagh (last paired in “Wild Wild West”) give boisterous, spirited readings to their characters, even if Ted Elliott and Terry Rossio’s script provides them with few shadings or interesting traits. Assante registers strongly as the powerful priest.\r But the Chel character is so contemporary, and in a vulgar way to boot, as to be incredible and off-putting, and Perez’s urbanite voicing doesn’t help. Even Chel’s motivation is unbelievable: El Dorado is presented as a Shangri-La–like paradise, and no one in this sealed-off city would even know about another place to which he or she would want to flee.\r Visual design as overseen by directors Eric “Bibo” Bergeron and Don Paul is colorful, sometimes attractive but never breathtaking. Animation, compositions and editing favor dramatic angles and fluidly changing perspectives that keep things interesting, while the characters are more commonly conceived; a few elements, notably the gold, are rendered with near-photographic realism. The animals on view comprehendingly participate in human endeavors but aren’t anthropomorphized in traditional Disney fashion"
    },
    {
      "rating": "7",
      "text": "It was a fun, one-time movie to watch, clearly the end of 2D animation. This movie is actually partially 2.5D, i.e. uses some 2D tricks to achieve 3D effect. Story is fine, villains are a bit underdeveloped I think, they could have done more with Cortes for example. I would have been really good 2 hour movie if they fixed some other plot points and \"convenience sake\" parts. But overall, it is fun. Some memes here and there, has some adult, non-childish moments that explore people's ambitions and how they change. Ends well, message is within \"seek what you really need, not what you want just because\". I disagree with critics."
    },
    {
      "rating": "6",
      "text": "The film captures the atmosphere of adventure, and culture of the fiction El Dorado which we could be related to if we love learning culture but The Road To El Dorado does have a good vision about visualizing colouful imagery with Elton John's great music. Still not a great film but hardly the worst."
    },
    {
      "rating": "8",
      "text": "Road To El Dorado es otra de esas películas animadas bastante infravaloradas. La vi junto con El Príncipe De Egipto y la primera me pareció mucho mejor. Si que me he dado cuenta de que hay varias cosas que no se explican, porque Chel se quiere escapar de su pueblo, las verdaderas intenciones de Tzekel-Kan o lo forzado que fue el encontrar la isla de el Dorado y como hicieron los españoles para llegar allí también. Pero quitando eso, la historia esta muy bien contada, situaciones variadas, gráficos increíbles, los protagonistas te caen bastante bien, gran banda sonora, en resumen, es una película con mucha energía, y eso me encanta. Faltaron cosas que mejorar, pero es una película bastante simple y pulida por donde se le mire."
    },
    {
      "rating": "7",
      "text": "A slightly above average adventure comedy that doesn't take itself too seriously and it's meant to have a fun time. It has some good humor (although some jokes weren't funny), the characters are fun to watch and the pacing is good for the most part. The writing is fine I guess but there were some plot points that could've been fixed (Like the forced romance with two characters with no chemistry) and at times the movie drags with some filler scenes that could've been cut or made shorter (Like a battle that happens right before the third act, honestly, that scene was pointless). This might be an unpopular opinion, but I didn't really like the songs. Some of them were pretty forgettable and I felt like the movie was like \"Oh I'm an animated kids movie, I need to have songs\".The animation is fantastic. I have a love for 2D animation and I think it's hard to find a mainstream 2D movie you could say it looks bad. The backgrounds are eye-popping and beautiful, the characters are expressive and their movement flows smoothly. Really the animation saves this movie and gives it a lot of extra credit.Overall, this is one of Dreamwork's most underrated movies. It's a shame that it bombed when it first came out. I really liked it. I was entertained and invested in the journey even when it had some clichés and pointless scenes. I'm not gonna nitpick too much because this movie is really easy to nitpick. Here's one: \"How come everyone speaks English?\""
    },
    {
      "rating": "10",
      "text": "Damn, I loved every second of this amazing movie, From the marvelous chemistry between our 2 main protagonists to the beautiful and grandiose animation with it's spectacular palette of colors, this animated movie blew me away, i had a blast watching it and i will surely recommend it to everyone, because it deserves it! i cannot believe this movie was made 2 decades ago! 10/10"
    },
    {
      "rating": "10",
      "text": "A beautiful underrated movie, with an original theme that is now considered art."
    },
    {
      "rating": "8",
      "text": "I can understand why people don't like this movie, the characters don't change much, and the story is very predictable. But they seem to also believe this is a bad thing. You don't need complicated characters and an incomprehensible story to have a good movie."
    },
    {
      "rating": "7",
      "text": "Przyjemna animacja, z klimatem przygody, archetypicznymi postaciami oraz dość prostą historią. Tylko zakończenie mnie rozczarowało trochę"
    },
    {
      "rating": "9",
      "text": "Underrated. A highly entertaining movie, beautifully animated with some great jokes. DreamWorks should have stayed making 2D animated films."
    },
    {
      "rating": "10",
      "text": "Underrated movie for sure. Kevin Kline and Kenneth Branagh are great in the roles of Miguel and Tulio, the villain is intensely intimidating, and Elton John does a fantastic job on the soundtrack. Not quite as good as The Lion King, but still brilliant. Even my neighbour and her four daughters enjoyed this film when I showed it to them, it leaves that much of an impression! The Road to El Dorado is simply a great and charming movie. Definitely one of Dreamworks's best, and most underrated. I. Love. This. Movie."
    }
  ],
  "recommendations": [
    "rio_2",
    "trolls",
    "the_boxtrolls",
    "ratatouille",
    "moana",
    "pocahontas",
    "raya_and_the_last_dragon",
    "the_good_dinosaur",
    "finding_nemo",
    "the_lego_movie_2_the_second_part",
    "over_the_moon",
    "big_hero_6",
    "brave",
    "how_to_train_your_dragon_2",
    "strange_magic",
    "luca",
    "shark_tale",
    "rio",
    "okja",
    "my_little_pony_a_new_generation",
    "the_nutcracker_and_the_four_realms",
    "the_iron_giant",
    "smurfs_the_lost_village",
    "rango",
    "how_to_train_your_dragon_the_hidden_world"
  ]
}