{
  "id": 2811,
  "title": "The Kill Team",
  "starring": [
    "Nat Wolff",
    "Alexander Skarsgård"
  ],
  "runtime": 87,
  "genre": [
    "War",
    "Action",
    "Drama"
  ],
  "description": "When Andrew Briggman—a young soldier in the US invasion of Afghanistan—witnesses other recruits killing innocent civilians under the direction of a sadistic Sergeant, he considers reporting them to higher-ups. However, the heavily-armed and increasingly-violent platoon becomes suspicious that someone in their ranks has turned on them, and Andrew begins to fear that he'll be the next target.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wLRZbtrbV51oQuvqNeK6vhb6btV.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Fairly haunting documentary about war crimes, very well-made by most counts."
    },
    {
      "rating": "8",
      "text": "For who is unfamiliar with the name The Kill Team  - we are, after all, not all American citizens -: it was given to themselves by a group of soldiers that were active in Afghanistan around 2010 and subsequently the name was taken over and spread by the media when these men were accused, arrested and convicted for crimes including pre-meditated murder during an incident known as the Maywand District Killings.(See wikipedia for details)\r The scene is set up well as we are introduced to the setting -Afghanistan in the first decade of the 21st century - then given some background on the soldiers in general and finally shift to the handful of individual soldiers that are the subjects of the documentary.\r In particular The Kill Team follows Adam Winfield, who had attempted to alert the army of  The Kill Team's existence prior to the Maywand incident. The actual whistle blower however was Justin Stoner. We should remind ourselves not to confuse Winfield with Stoner. The first made an attempt to alert the army, did not succeed, and then did not stop the murders from occurring. He was thus sentenced to prison and got an dishonorable discharge. Stoner did notify the army and thus the investigation was started on his instigation. He was dismissed with honorable discharge. I want to mention this because at first it seemed as if the whistle blower got punished for it. For more details: read wikipedia.\r The documentary does an excellent job of portraying Winfield and his parents as they struggle with what he has become. We even get a moment where he cries over what has happened and tells us at one point that he once planned his own suicide. We get an in-depth view of the anguish of a man who knew what happened was wrong, what others did was wrong, what he did was wrong and did not stop it, mostly because he was unable to. It was a truly sad thing.\r But when the documentary wraps it up it feels like something is missing. In fact, besides the interviews and some spurious remarks about what happened to the key people involved, there is nothing that is lifted above the level of personal drama. Isn't there a bigger picture?\r Stoner sums it up at the end: Your job is to kill.You're infantry.[] Well, why the hell are you pissed off when we do it?\r And here the documentary fails. If soldiers are taught to kill and just kill regardless is that what we want them to do? And if we don't, how come they do things that we don't want them to do?\rWould that not be a valid question to ask, explore and answer?\r Here is a few quotes that gives us a startling insight in the armies way of thinking(see the wikipedia):\r \"Colonel Harry Tunnell's (of the 5th Stryker Brigade) \"inattentiveness to administrative matters … may have helped create an environment in which misconduct could occur.\"\r And\r \"The brigade, was reported to be \"rife with lapses of discipline, misdirection and mixed signals about its mission.\"\r And\r \"As an Army, we are troubled that any soldier would lose his ‘moral compass’ as one soldier said during his trial.\"\r Does it mean that soldiers get bad when their commanders allow them to go bad? Is losing your moral compass the expected behavior when a lack of proper discipline releases a soldier from the leash that his superior keeps him in check with? Like a dog?\rDoes morality come with rank?\rIs that how we see people?\r But if that explains it, why were those soldiers punished at all? I mean, without their commanders keeping them on the right track, they are bound to go off in the deep end as the reports seem to suggest. They lost their moral compass.. can't they plead insanity(as in A time to kill) or amorality?\r The kill team is a well made documentary but also one that leaves something to be desired. The documentary doesn't spent much time on the bigger picture and keeps the camera focused on the personal drama of a few individuals, which makes for a gripping tale, but not much more and that is a pity. It would have been a lot stronger if it they had asked themselves: why did this come about? It tells you the who, the what, the how but does not address the why."
    }
  ]
}