{"id": 31, "title": "The Tomorrow War", "starring": ["Chris Pratt", "Yvonne Strahovski"], "runtime": 138, "genre": ["Action", "Science Fiction", "Adventure"], "description": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg", "categories": {"plot": 4.818181818181818, "acting": 4.964285714285714, "ending": 6.888888888888889, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.571428571428571, "action": 5.7727272727272725}, "reviews": [{"rating": "0", "text": "Alright, let's break it down.You send conscripted, untrained civilians to the front lines of a war, mostly urban and with an unconventional enemy and expect them to save you?You don't even develop a videogame you could sell to train BILLIONS of people at the same time so they could get the basics on how to fight that enemy?And after decades, even with that time advantage to prepare during peacetime in the past and the whole world's resource at their disposal they haven't developed effective weapons to deal with their armored body?Did the writers have any ideas how fast killing weapons can evolve? It's adapt or die. Anyone who studied war history or knows at least the basics knows this.I'm not even military, yet I'm cringing how completely inept at suspending disbelief this script is.At least other future alien wars movies had evolved their weapons to fight aliens and had at least half-useful training grounds. It was at least somewhat believable.But this... It's an insult to people's intelligence.And don't even mention the \"capture\" sequence... No tranq darts, no tazers, no nothing, just ropes... You'll shake your head so hard you'll get brain damage, and maybe then you'll enjoy the rest?The critic reviews much more closely resemble the real ratings than the user score, which is baffling. So I'm gonna have to rebalance the user score a bit toward the saner side with a big fat ZERO.It's more like a 3-4 if you completely disconnect your brain tho. If that's your thing, you'll have fun. Otherwise, HARD PASS, don't bother."}, {"rating": "6", "text": "Not my cup of tea. The first 30-40 minutes are good, and really like how the future arrives in our present time. But the drafting of soldiers is nonsense, the last part is so predictable and Chris Pratt doesnt really seem interested. By the way alien design is cool."}, {"rating": "5", "text": "Great plot, good graphics, but the movie gets worse and worse as it goes on. The humor feels misplaced and the writing becomes very lazy as it nears completion. Turn your brain off if you'd like to enjoy this one - and then you'll be fine."}, {"rating": "6", "text": "It's a dumb sci fi movie but it knows that and has fun with it. It has an interesting concept too but don't think too much about the entire logic of it as it doesn't make a lot of sense.It's a fun action movie and that's okay."}, {"rating": "0", "text": "A horrible movie, people that liked it should get tested because they have no taste."}, {"rating": "4", "text": "This film spells out “PERFECTLY AVERAGE” in big bold letters. It isn’t bad at all and it’s a turn your brain off kind of movie but it still isn’t great. Chris Pratt is good. He brings a fun and engaging set of charisma to his roles and he is no different here. His character is very one note though. His only motivation is that he cares about his daughter which isn’t a bad motivation but the film is begging for more character development so that the emotional moments feel more impactful. Sam Richardson was fun but he really doesn’t do a lot during the movie besides adding some comic relief to it. All of the other characters are very forgettable although I did enjoy J. K. Simmons presence even if he had basically nothing to do. Since this is a time travel movie, the logic is out of the window. There were several moments involving the creatures or characters that made me think, “Hold on. That’s a big paradox”. One moment involves Chris Pratt’s character and the general from 50 years in the future. He wants to bring her back to the future with him but he cares so much about doing it that he almost dies at one point which would have screwed over the people in the past. And even if he succeeded in bringing her back, that would have created a massive paradox with two of the same character not to mention that she would just disappear since the future wouldn’t happen. Like I said, the more you think about it, the worse the story gets. The action is fine. It isn’t super impressive but it’s not bad. It’s serviceable for the story and it has its moments. The visual effects, aside from a few shots, are really impressive actually. The creature design looks terrifying and the visual effect artists do a great job making them look real. If anything, you should check this movie out for that. If you want a fun Chris Pratt movie then I would recommend checking this out but don’t expect a masterpiece."}, {"rating": "9", "text": "So refreshing to see a good old action sci fi that is well done and has plenty of heart. So rare to see family values in movies. I loved it!"}, {"rating": "5", "text": "Tomorrow war is watchable but is very derivative and a bit stupid. The story have been told many times, except they put some time travel in it. The level of stupidity of the main character is quite daunting. For a scientific person , he is totally unaware of time travel paradoxes. His relation and decisions to a future family member, feels totally out of places and lacks any kinds of logic. If the humour is good, the lines they say are really weak at times. The time travel aspect is full of holes. At least the movie have good actors in it. The performance of Pratt felt somewhat, robotic at times. The FX are really AAA. Nothing bad to say about the CGI. The Aliens are very convincing. The music is pretty good. A bit out of place on 2-3 occasions. Great sound. I give it 55%. Mainly because of the secondary actors that were very solid, and the quality of the production. But that scenario and dialogues weren't amazing."}, {"rating": "0", "text": "I created an account here specifically to review this rubbish. As another review says, a 4 year old could have written a script with less holes in it. The special effects are fine, but there is too much filler before the action starts, and the never-ending plots holes had me shouting at the TV every 5 minutes. Avoid, avoid, avoid...unless you can completely turn your brain off while watching it."}, {"rating": "10", "text": "Great movie. Dads friendly movie.I watched with my kid 17 and daughter 13, we all enjoyed it.Original script, nice acting  compelling story about a family man, fighting a war against all odds.Recommended"}, {"rating": "5", "text": "It has a million plotholes, scientific errors and believability problems, but I guess, that's not the point for a movie like this. It has a simple emotional family story in which even sexist seniors can have their part. I had more sympathy for the aliens, than the cast, but overall, if you lower your expectations and amount of brain cells powered on, it can be a popcorn movie evening. It reminded me a little of Starship Troopers, but without the cult movie quality. Average 5/10, would only watch once."}, {"rating": "1", "text": "Special effect are great. The science is awful and if you know anything about the science behind time and space you’ll be very disappointed."}, {"rating": "9", "text": "I liked this movie.  I have decided I want to see Yvonne Strahovski in more action movies -- I really liked her.  I'd be happy if she and Chris Pratt did something like this again!  JK Simmons was a surprise!  He seems like a filler actor on TV but did a nice job.  The plot seems like Edge of Tomorrow, but I like this movie better I think, although Edge of Tomorrow is a bit tighter.  I like how this film wraps everything up into a multi-generational family healing film.You can read some harsh negative reviews.  OK - believe them if you want.  I think that people are just too cynical.  The plot is not that bad -- its pretty good.  But if you are looking for enjoyable entertainment with a positive feeling at the end of the movie, this one works fine and should not be condemned.  I will probably watch it several times."}, {"rating": "10", "text": "It's fun classic summer movie no hidden agenda no LGBT **** politics it's is made just to give you a fun night..."}, {"rating": "8", "text": "Just finished this movie and I really liked and thought it lived up to the hype of it. I thought it was a solid movie with some comic relief along with some family drama that (for a dad with kids) could pull at the heart strings a bit. I thoroughly enjoyed this movie."}, {"rating": "1", "text": "I gotta say... I expected it to be bad... But this was worse that I could have ever imagined. There was nothing I liked about this movie. Aside from a couple of self aware groaner jokes, the movie fails on almost every level.It was built on an illogical premise, bad acting and other nonsense."}, {"rating": "9", "text": "Finally a movie that has a beginning, middle and end with no cliffhangers or sequel bated story. Original with great casting and only suttle political messaging. This sifi has a great family Togetherness and morality in this shoot them up story with purpose. Good job everyone involved."}, {"rating": "3", "text": "A pathetic (and unintentional) JOKE of a movie. What makes it worse is that it has all the ingredients (A-list actor..top notch SPFX..obviously a BIG budget) to make it GREAT but is lacking the EASIEST and CHEAPEST BUT MOST IMPORTANT element of any movie: GOOD WRITING/STORYLINE/PLOT!WHATEVER you wanna call it this movie has virtually NONE of it.  I usually give sci-fi/fantasy and big pass when it comes to \"checking your mind at the door\" and the concept of \"suspension of disbelief\".  INDEPENDENCE DAY comes to mind in that it never took itself too seriously (Randy Quaid played as \"Cousin Eddie got abducted\" helped a lot in that regard..Genius! BTW) so I could give a lot of latitude to it (hacking into an alien computer to download a virus? what? where they using Windows98 or something?)This? Tomorrow War..Jeez what a trainwreck! All I can say is thank god I can cancel my Amazon account in 30 days..so I basically got to see this for free..but what a disappointment.  Much like Wonder Woman 1984 was used to get people to sign up for HBOMax..this is the same hustle.  That was a bad film..and so is this..If Hollywood stars are considered BANKABLE cuz they've done so many entertaining movies (I'm thinking of Harrison Ford or Eddie Murphy back in the 80s and 90s) that audiences basically say Oh, Chris Pratt is in this movie..he was in Guardians and Avengers and Jurassic Park..I bet this has to be good.I consider this a BLACK MARK against you StarLord (you're better than this)"}, {"rating": "9", "text": "I'm giving the film a 9 instead of an 8 because it for not being a reboot/sequel or poor adaptation of someone else work. It barrows from a lot of other science fiction properties like parts of Warhammer 40K for the aliens and the final objective is reminiscent to the plot of the movie Reign of Fire while being much better executed. But that's more originality then you will get from most Hollywood movies. The movies biggest strength is the creatures and the surprising relationship Pratt has with a female military's officer once gets to the future. Those scenes together were really powerful. Really the only thing stopping the movie from being a 10 are some minor flaws and nitpicks."}, {"rating": "10", "text": "Ignore the critics and watch for yourself, I really enjoyed it, the critics wouldn't know what movies an average person like you and me would like. Chris Pratt is amazing"}, {"rating": "8", "text": "So the movie is quite good. There are a few flaws but that's to be expected when messing with time travel.The whole concept of sending regular people to the future is explained simply in the people they're sending I.e those who wouldn't be alive at the time of the war. That's troops who otherwise wouldn't be helpful in the futureThe complaints about weaponry not being  technologically advanced is easily explained too. They say the teleporter is held together with chewing gum and chicken wire. That's because they don't have resources. With the whitespikes wiping out humanity so fast, all economy and technology would be unavailable (who wants to farm resources mid alien invasion) so they pooled their last resources to create the teleporter. The ideas of tanks and jets are also good, if you don't take into account that they were used (jets anyway) and seemingly sparingly, almost like they don't have the resources. Couple that with the accelerated breeding of the whitespikes, humanity is pretty outnumbered.The ending however is a brutal paradox that ruined the movie in my eyes. How can they go to the future to learn of the whitespikes and find the toxin to kill them, if that future never existed. No future, no toxin, no knowledge of whitespikes and that's the end right thereOther than that a rather enjoyable movie"}, {"rating": "0", "text": "Hands down one of the worst movies I've ever seen. Not a single coherent scene or even 1nanometer of plot thickening to one not worth anyone's time. Severely disappointed. Laughably mediocre. Who let this be released? Kept thinking, This has to be a joke...100% pissed wasted that much time by watching till the end."}, {"rating": "3", "text": "This is an insultingly dumb movie. Soldiers from the future arrive from their state of the art beauty salon to warn us about aliens attacking humanity in 2030.Nope, that would make sense, instead soldiers from the future emerge from their beauty salon and demand we send people to their surprisingly pristine future to pointlessly die when they've already lost.It does not occur to anyone at all to prepare to prepare to wipe out the creatures with the decade of warning they've just received. In fact no one question s anything, they all just march like lemmings to their death. It gets so much worse. It finally dawns on 2 people to do the painfully obvious thing of a pre-emptive strike in the present.They use a child's knowledge of volcanoes to locate the aliens in Russia, at which point they tell president Putin and his elite special forces what they know. So they are able to wipe out the creature's as the should have done in the 1st place. Nope. That would make sense.Instead the The thick heroes smuggle themselves into Russian airspace.  (try doing that in real life)They  heroically kill the creature's creating a really  stupid time paradox. The thing, Alien and The Terminator are 3 vastly superior movies they badly rip off. Watch those instead."}, {"rating": "0", "text": "I have never been as sickened/disappointed in a movie than I was with this...I was going to mark this review with a spoiler tag, but you cannot spoil a plot that appears to have been created by a hyperactive four year old girl. Absolutely nothing in the movie makes any practical sense. Not a single moment of the entire movie will engage your attention, simply because your brain will be saying \"an idiot in a hurry would have come up with a better plan than that\".If you want to experience a virtually-unbeatable 12-foot alien (with thousands of razor-sharp teeth, armoured skin, missile launchers for hands) get punched in the face and kicked off a cliff......then maybe you should make up a story with your 4-year-old daughter.NOTE: There are obvious attempts happening to artificially improve the score of this title. I have come across 20 almost identical 10-rated reviews. DON'T BELIEVE THE RATING, this is a 0 to 1 score in reality!!! unwatchable"}, {"rating": "9", "text": "The movie was exactly as it is presented.  A fun time travel romp that does not overly concern itself with heavy time paradox rules.  Some parts do seem under developed or a bit slow but overall an excellent action flick with family issues mixed in."}, {"rating": "9", "text": "The movie is just plain fun. Great action, funny, and heartfelt. Way better than Independence Day."}, {"rating": "8", "text": "A fun movie. Chris Pratt shoots aliens. The VFX are pretty good, much better than a lot of movies. Alien designs are cool. The plot is a little messy in places but the performances carry it. I didn't watch Jurassic Park for the plot and this is the same kind of thing, CGI monsters and Chris Pratt. I preferred this to Jurassic Park."}, {"rating": "2", "text": "As expected from 99% of streaming original movies - great production, star cast, absolutely horrible story, directing, and screenplay. You must disconnect your brain to be able to enjoy this movie, which you can, there's plenty of action sequences to do that with half-decent CGI.I understand logic isn't your best friend when trying to enjoy science fiction movies BUT things that we can relate to in our own time and the real world should be grounded in reality to make things reasonable. You want me to believe that a Director of Research on Earth and Atmospheric Sciences at GeorgiaTech, clearly one of the top minds in his field in the entire world goes to a school kid for geology answers!?!? You are just doing slapstick comedy at that point. Don't worry, there's non-stop ridiculous writing and acting in this from start to finish.The film deserves 0/10, but I'll give it 2 points for Strahovski (as a fan of Chuck and Handmaid's Tale but her acting in this film is pretty bad) and Pratt (the director clearly wanted some of his Starlord performance, the best I can say is that Pratt isn't terrible for some parts of the film)."}, {"rating": "8", "text": "Ignore the critic hate. Yes the plot isn’t perfect. But the actors, action, and special effects keep you engaged. With a plot good enough to tie it together in a fun sci-fi flick."}, {"rating": "1", "text": "Terrible overacting all around, except for JK Simmons during his too short time onscreen. None of the characters get developed, and you end up caring about nobody. You can drop Strahovsky and most of the cast, and the story is the same. Guns never run out of bullets. Script is boring, filled with pointless conversations that exist so actors can have time on screen. It is a very long movie that feels even longer. Spend your time elsewhere, you will be sorely disappointed. This is a bad B-movie."}, {"rating": "7", "text": "The movie started off slow. The first 20-30 minutes of set up could be condensed into 10 to make room for far more interesting scenes. But once the main story and action got started I was very impressed. The parts set in the future were excellent and the last act was a pleasant surprise from where I thought the story would go.This is also Chris Pratts best movie after Guardians ( I actually prefer this but I think I'll be in the minority).The cgi effects were excellent and I could rarely tell the creatures were computer generated which kept me in the movie.After so many streaming blockbuster failures I'm happy one of these attempts turned out to be enjoyable."}, {"rating": "2", "text": "What an illogical, flawed and mostly boring movie! The whole story is not completely illogical from front to back! Why are there no explosive and intelligent weapons? why do the humans fight with small MP's (!!) against dangerous aliens, why can't you produce enough and stronger weapons in the past and take them into the future etc. etc.??? Why are the dialogues so long and uninspired? A really lousy and ridiculous movie! Only the well done but ridiculous action scenes are watchable, the rest of the almost 2.5 hours are pure stupid boredom!"}, {"rating": "1", "text": "I actually created an account just to write this review; the people giving this movie 5+ I assume were not watching the same movie I was. I had so much hope and anticipation that this movie was going to be at least \"decent\" given the solid marketing budget displayed. From the onset, the movie offers a promising narrative that by the 20-minute mark has caught fire and began a terminal free-fall towards the ground. I won't rehash what others have echoed as to the gaping plot-holes and the like; I will add though that Amazon missed an opportunity here. The director/producers it seems tried to meld together Frequency (2000) with the plotline of The Day After Tomorrow (2004) and a shade of Starship Troopers (1997) all the while detracting from what made those movies likable. If the plotholes had been somewhat addressed maybe...maybe the movie could have been better. It seems that the writers sat down and said how do we achieve every movie trope we can in one sitting. Beyond a few comedic quips by ancillary characters, the movie is devoid of relief from what is otherwise a predictable plotline."}, {"rating": "10", "text": "Great Action Sci Fi movie without the the usual Hollyweird crap!A bit long but the action was really good and the cast was good."}, {"rating": "5", "text": "The very model of average.While it starts off visually appealing, those slick graphics quickly give way to bog standard concrete cooridors, warehouses and refinery sets. Much as you would expect from middle of the road sci fi.The premise is exactly what you would expect. A war in the future, so time travel hyjinx and paradoxes ensue.Nothing here is particularly wonderful. It just succeeds on being average and not offensively so.One of the pros this film has is it has one of the most clearly defined 3 act setup as any film in recent memory.Just dont let the solid  performances from the cast or the early slick graphics or the later huge cgi esplosun set pieces deceive you. This is very predictable, by the numbers affair. Its reasonably watchable. I know I have wasted time on far FAR worse without half the nominal payoff this film provides. Just watch it and then just as quickly forget about it. You probably will never think of this again after watching it as long as you live, but it will mostly keep your attention for its run time. 5/10. Firm"}, {"rating": "3", "text": "Interesting concept that is pretty poorly executed.The illogical plot takes some bizarre routes that most sane people are going to struggle to buy.The two \"twists\" are both telegraphed so loud you'll spot them way before they happen.Effects range from average to low end.Acting is pretty good though.In summary (and as some one else mentions here) feels like a fan made movie"}, {"rating": "0", "text": "Don't believe the bots, this \"film\" is complete and utter garbage. This is a horribly directed, horrendously written insult to your intelligence if you're a mentally deficient hamster. Don't make my mistake and stay far away from this one."}, {"rating": "3", "text": "Wow! Was that movie bad. 1 point for pratt, 1 point for strahovski and 1 point for simmons. I love those three actors. Everything else about this movie was pure torture. What a waste of great talent."}, {"rating": "2", "text": "This story makes no sense. They had 25 years to not only pass information from the future to the present, but develop better weapons against basically xenomorphs from aliens. And the second half of the movie was filled with cheap dialogue to explain why much easier solutions weren't used to justify the last 30 minutes of action. It was basically written by children to fool kids. And the writers knew it since they deliberately added the dialogue to explain why their convoluted story makes sense."}, {"rating": "10", "text": "It was a awesome movie it’s funny lot of action my number one favorite now."}, {"rating": "7", "text": "Like a lot of movies these days this barrows from several other films and books, yet it managed to entertain me all the way to the cheesy ending. I really liked all of the performances here and even more I appreciated the somewhat fresh turn of where the antagonists originated. While I would likely watch this again it would be purely for the action sequences because frankly the set up for the story to move the plot forward at every point breaks my suspension of disbelief. I’m not recommending it beyond people who love sci-fi, but if you have “Prime” and if the other creature driven movies that Pratt has recently been in entertained you then you might enjoy spending the time on this popcorn flick. (I didn’t know were to put this, but Sam Richardson is quickly becoming someone who if they are in a movie or TV show I’ll watch it. He’s really entertaining and he doesn’t disappoint here.)"}, {"rating": "1", "text": "Nothing new and poorly done. Horrible storyline and disappointing because of the great cast… that’s including Richard Splett!"}, {"rating": "3", "text": "Leaden. Takes an interesting premise and yaks all the suspense out if. If you’re going to do a time travel story you can’t allow the entire thing to be a paradox never explained"}, {"rating": "3", "text": "I only recommend watching this movie an a second screen while playing some games on the other. Don't worry, you won't miss anything.The main problem I had with this movie is that it isn't consistent in how it treats its own world and that ruined the experience for me. If that is a deal breaker for you as well, don't touch this movie.I am fine with the logical problems time travel stories pose and I was expecting a shallow action flick, which is certainly what I got. At the very least, characters in a movie need to react in consistence with themselves and their world though, for us to believe their emotions. I felt like this was not the case at all.The enemies in this movie get initially presented as very powerful killers, almost impervious to small arms fire and therefore a single enemy poses a serious threat to an entire squad. Only moments later the number of enemies multiplies and while this should mean the end of the movie from a consistent POV, the rules just change. And not in a way that can be cognitively grasped. The threat level just changes, to make scenes work.This dynamic gets WAY WORSE during the rest of the movie, when suddenly single shots from small arms fire outright kill the same enemies (the problem wasn't the aiming). It makes no sense at all and the movie just pushes forward throwing in stuff that either contradicts things that happened before or just never gets explained.When you get to the end, a serious decision is made for how to tackle a mission that is so outright idiotic that you can only laugh, when the movie wants you to think that this is a well thought out decision that demands a lot of the protagonists. It's just stupid. Wasted acting potential on a horrible script."}, {"rating": "10", "text": "The movie & acting is very good..Is the plot retarded>YES!But so are most action flicks..*The countries Governments really are dumb in this & it didnt bother me much.but i was still aware that Humanity could be defeated by advanced aggro animals that Bline towards an enemy.. Esp considering Bullets & explosions kill them...But Just like Alien back n the day= The SPace Jockey(dead giant pilot)the ending Alien ship is 100% identical to Alien/Prometheus..But i like it....I did score the movie a 10 because Pratt is awesome and very likeable..I can't believe Hollywood wants to cancel him for being a Christian..politics smolitics..."}, {"rating": "3", "text": "Acting was very bad. Chris Pratt can’t carry a whole movie as evidence shows. Supporting cast ??? *confused gif*Graphics and production value were 5/5Story premise and plot line were littered with infuriating moments, sprinkled with holes and finished with … tbh I didn’t finish it and don’t care to."}, {"rating": "7", "text": "If you’re willing to suspend disbelief for a while this movie was pretty enjoyable.  There was some cheesy dialogue and the movie yada yada’s past quite a bit but I wasn’t bored.  Chris Pratt and the supporting cast were likable and there was a lot of heart.  It’s no classic but it was fun and I’d say worth the watch if the concept interests you."}, {"rating": "8", "text": "As a whole, a pretty great movie. Critics obviously don’t know what they’re talking about. It obviously has some downsides, but still great"}, {"rating": "8", "text": "I think this was a solid movie. I will say that it's not original in the sense since it's basically go to the future to try to save the present and fight an alien species with of course the female/queen is the toughest. it's somewhat cliché, but there are some plot points that add some unique twists. The acting is also good. great fight scenes. I'm not sure why this movie is getting such a low rating by the critics. If you're able to watch this film, go ahead it's not that bad. I do think the movie could have been shorten just a bit, like the few first minutes of the movie doesn't really add that much to the film and could of honestly skipped the first 5-10mins. Because this movie is like 2hrs which is definitely a time commitment.Overall 8/10"}, {"rating": "8", "text": "I don't get the low brow response to this film. Frankly as a harsh critic of all things action and Sci fi, the premise of the film was absolutely captivating. Chris Pratt played his character amazingly while pulling at some heart string too."}], "recommendations": ["geostorm", "independence_day_resurgence", "surrogates", "shadow_in_the_cloud", "war_of_the_worlds", "battleship", "the_darkest_hour", "knowing", "infinite", "elysium", "riddick", "pacific_rim_uprising", "2012", "jurassic_world_fallen_kingdom", "army_of_the_dead", "the_cloverfield_paradox", "what_happened_to_monday", "jurassic_world_dominion", "pandorum", "the_purge_election_year", "poseidon", "the_new_mutants", "the_book_of_eli", "jupiter_ascending", "stowaway"]}