{
  "id": 2821,
  "title": "The Cloverfield Paradox",
  "starring": [
    "Gugu Mbatha-Raw",
    "Daniel Brühl"
  ],
  "runtime": 102,
  "genre": [
    "Horror",
    "Science Fiction",
    "Action",
    "Thriller"
  ],
  "description": "Orbiting above a planet on the brink of war, scientists test a device to solve an energy crisis and end up face-to-face with a dark alternate reality.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vJi2ExTcWdJR3150VPKqqtdGxsT.jpg",
  "categories": {
    "plot": 3.381818181818182,
    "acting": 3.3461538461538463,
    "ending": 3.8421052631578947,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 3.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "While \"The Cloverfield Paradox\" has interesting concepts to share, and is competently directed and acted, the dull and confusing script disappoints all the aforementioned efforts."
    },
    {
      "rating": "2",
      "text": "So I have to be honest up front, I would have scored this movie 4/10 but I have to knock 2 points off which I would explain in a bit but lets cover the actual movie. (and yes there be spoilers ahead, lots of spoilers actually)The principle of the movie has at heart quite an interesting idea but not novel, it's yet another energy mguffin causing a tear to another reality / dimension (so far so much like Killswitch and about a dozen other movies in the last few years.)Script is meh, acting is passible and the SFX's do their job, the main problem is it works very hard to hit all the typical sci-fi / horror tropes but never actually has the guts to properly deliver and in the process gets itself wound up into a muddled mess where the only \"character\" who actually has a clue how to fix stuff is a guys disemboded arm (not that it's ever explained how it knows what it knows or even how it stays animated) It's all very by the numbers just without a payoff (keeping it PG like those movies with bloodless swords etc) It's like the writer(s?) literally wrote this thing by trawling TV tropes. The \"tinfoil hat guy who's right\", This thing needs the keys turning at the same time (for no reason), The x times we have done this to fine another way that doesn't work (Chain reaction, also about energy sources), There's \"the infected\" (see Promethious), Solid objects sucking people in, Animated body parts, The (not)Gruesome Autopsy, an airlock malfunction (okay this one was a least somewhat original, mostly because for reasons best known to the whoever wrote this garbage,  the airlock in question pumps water not oxygen), The tools / structure comes alive and has tendrils to suck in a chacter, we have the deception to pull a heroic sacrifice off to save the ship and the sucked out of the window / porthole. And yet ALL these ideas are done better in other movies with much better delivery and pay off.So yeah this movie would be another run of the mill flick that doesn't set the world alight but it's worst crime is simply they have very obviously gone back and filmed scenes with the leading actresses screen husband and set them around the original cloverfield (with nod to 10CFL) to try and tie it into the cloververse (and it's painfully obvious and badly done because of the utter absence of this in the scenes set on the station) so yet again they are just using the cloverfield name as a sticking plaster onto unrelated movies because they don't feel they are strong enough to stand on it's own merits."
    },
    {
      "rating": "1",
      "text": "This is a steaming heap of garbage from the self cognizant arm to the ludicrous conclusions which characters come to based off of seemingly nothing other than ruminating about things while locked in a soundproof medical exam room with only glass walls.  Why does an electrically activated sealant foam react to magnetic fluctuations by reaching out and grabbing someone?  Where did all that water come from and why did it wind up where it did?  This film simply does not know what it is, other than fundamentally stupid.  Is it a supernatural horror?  Is it a sci-fi horror?  Is it a comedy?  Don't care anymore, it certainly didn't start as a Cloverfield production."
    },
    {
      "rating": "5",
      "text": "It starts very well. There's a period in the film where you are on edge, unsure of what's next, freaked out and thrown by the craziness the film is indugling in. Then... it is like a different writer took over. The craziness stops and it becomes more of a thriller. It doesn't work, not at all, and in the end you are wondering why they bothered going the crazy route when it was just for bizarre plot devices."
    },
    {
      "rating": "5",
      "text": "It becomes rather confusing and doesn't cover every single event leaving a lot of unanswered questions."
    },
    {
      "rating": "5",
      "text": "It works fine as a stand-alone sci-fi movie, but as a Clovefield movie it's very disappointing and the tie-ins don't make any sense. It's a shame because this starts out promising, there's some intense scenes, and the whole cast turns in solid work. It's one I like less the more I think about it."
    },
    {
      "rating": "4",
      "text": "While there are people that dislike this movie because of it failing to connect the past two Cloverfield films together who are outside of the original marketing for the first film back in 2008, almost ten years ago, my complaint with this movie is that on it's own it's not very good. The acting ranges from great to just okay, with the standout being Gugu Mbatha-Raw, but that is because she has the most material to work with, everyone else is basically a stock horror cliché when it comes with close containment horror like the Mist, the Thing, and the first Alien film. But that would imply that this movie is scary at all. It does have scares, stock scares, but instead it is just a jumbled film that shifts between different story elements while also connecting to the previous films within the Cloverfield films. From stock horror tropes, to sci-fi thriller, to the \"levity\" that comes from a misplaced Chris O'Dowd, the movie has no idea what it wants to be and devolves into a tepid slog of different narrative elements that are crammed into one horrid Frankenstein monster with expendable characters that you don't really care much about. The production design is pretty great, but that doesn't save a sloppy script."
    },
    {
      "rating": "4",
      "text": "The film has a solid first act, but everything goes downhill from there. The cast is decent, there are  some highly enjoyable scenes and a bunch of interesting ideas in the script, but their execution is really all over the place... making The Cloverfield Paradox ultimately nothing more than a sorta enjoyable mess."
    },
    {
      "rating": "3",
      "text": "Orbiting above a planet on the brink of war, scientists test a device to solve an energy crisis and end up face-to-face with a dark alternate reality.Let’s just say… I understand why Paramount sold this film to Netflix. Incredibly boring, and slow paced mess. This film probably has two redeeming features:1. Chris O’Dowd2. The last scene I have nothing else to say"
    },
    {
      "rating": "3",
      "text": "Okay, movie, but doesn’t live up to the Cloverfield brand.  Read the Caliban comic books by Garth Ennis to see this sort of story done well."
    },
    {
      "rating": "4",
      "text": "Although not the worst movie i've ever watched, i am glad i didn't pay to see it on the big screen. Ultimately it felt like a nice 'extra' on a DVD release of the first movie. Some interesting ideas but most were left unexplored and/or unanswered, using alternate realities as a reason to not explain anything is something i find lazy when overused."
    },
    {
      "rating": "3",
      "text": "As a Sci-Fi thriller, you can find some entertainment in \"The Cloverfield Paradox\", but the film doesn't hold back with its head-spinning pacing and head-scratching moments. Other than some good acting, cool visuals and some glimmers of cleverness, the film comes out as a major disappointment in the Cloverfield franchise and leaves you with a giant question mark over your head."
    },
    {
      "rating": "4",
      "text": "I wanted to love this movie so much. I was such a huge fan of the original Cloverfield and an even bigger fan of 10 Cloverfield Lane and unfortunately this film does not live up to those two. It is a Sci-Fi mess with bizarre storytelling and writing that would have been great in the hands of a better director. I am truly so upset that this movie was not what I wanted and hoped it to be."
    },
    {
      "rating": "3",
      "text": "...What was THAT?? Gave more questions than answers. I guess we'll never get our answers for all three movies..."
    },
    {
      "rating": "4",
      "text": "This movie, in the end, leaves me with mixed feelings. While the set production was great, the actors were talented, and the CGI was top notch, the script was where things got tripped up.Much of the story was bogged down in cliches and rushed timing. Characters were not given time to become interesting, and this crew was not given proper time to rationally react to what is happening around them. What results is a plot that feels like it has a lot of missing pieces, and characters that become caricatures.This is by no means a terrible movie, it just represents a lot of missed potential. Hopefully a fourth film can get this universe back on track, because I love the Cloverfield universe, and definitely want to keep exploring."
    },
    {
      "rating": "4",
      "text": "Lots of bad exposition, tons of unanswered questions, and no real identity as a movie.  Characters made mind-bogglingly stupid decisions and it really seemed like they pieced the story and general motives of the characters on a whim.  Wanted this to be good but some of these Netflix movies are starting to seem a lot more like the bargain bin at Walmart than a studio defeating juggernaut.   B- for effort, D for execution."
    },
    {
      "rating": "5",
      "text": "If you enjoyed the unique way in which Cloverfield tackled the standard kaiju/monster movie and really enjoyed the unique way 10 Cloverfield Lane approached a typical alien invasion story, prepared to be disappointed by the way The Cloverfield Paradox goes through its story in a completely unoriginal way. The movie is a hodgepodge of other sci-fi movies like Alien, Event Horizon, and even recent ones like Life, with some interesting scenes that are never given time to simmer, and the link to the Cloverfield universe is about as shoehorned as you can possibly get. What's worse, the world this movie is in bears almost no resemblance to the one in the original movie. Sure, some may excuse this by saying that world wasn't really fleshed out, but that's the lazy mans way of explaining things, and that's exactly what this movie is: Lazy."
    },
    {
      "rating": "3",
      "text": "The Cloverfield Paradox: It's like \"Alien,\" only terrible. Nowhere in this incomprehensible mess of a science fiction script is anything made clear. The rest of the production doesn't fare any better. Actors slipping in and out of terrible accents, wonky expository dialogue, and lackluster set-pieces all hamper this straight to Netflix production. The film's advertising was so low key that it only aired one spot (during the Super Bowl no less). One wonders now if that sleight of hand marketing tactic was done out of sheer embarrassment. That's the problem with these Cloverfield movies. They're over-hyped schlock. The first film, \"Cloverfield\" (2008) was advertised much like the Blair Witch Project. The marketing team positioned it as a groundbreaking cultural event, yet the final product resembled little more than a found footage Godzilla movie. \"10 Cloverfield Lane\" (2016), was also shrouded in secrecy. An otherwise competent B movie, 10 Cloverfield Lane's ludicrous ending completely jumped the shark. Unfortunately for the latest entry in the J.J. Abrams produced franchise, there is nothing more to offer than a derivative sci-fi distraction."
    },
    {
      "rating": "3",
      "text": "The real paradox of \"The Cloverfield Paradox\" is that the movie is both longer and less interesting than it's entire ad campaign. Marketing-driven \"event\" films are the new norm in Hollywood, but this takes the formula to a whole new level, serving as nothing more than one big marketing stunt for Netflix and for the Cloverfield franchise (universe? anthology?).  The film itself is generic, forgettable, sloppy, and all-too-worthy of its straight-to-streaming-video fate. Whereas the previous two Cloverfield films were so wholly unique and unexpected that it was easy to forgive their flaws, with \"Paradox\" we have a standard disaster-in-space flick that recalls way too many other recent exercises in sci-fi schlock. A fantastic international cast of fine actors is wasted on characters that are thinly written and indistinctly characterized even by the low standards of the genre. It's unfair to even call them cannon fodder, because when they meet their inevitable end it barely even registers. The direction is limp, the special effects and production design are perfunctory, and the story has a hap-dash feel where anything can happen at anytime in order to advance the plot or cause a jumpscare because, hey, it's a \"paradox.\" If you're a diehard Cloverfield fan that absolutely needs to know what is happening and why it started, you'll finally get your answers (as well as some likely disappointment and boredom).  If you're looking for suspense/terror/survival in outer space, just go ahead and watch one of the Alien movies, or Sunshine, or Gravity, or Life, or Event Horizon, or Moon, or Interstellar, or Apollo 13, or... wait, no it's at least better than Geostorm, barely."
    },
    {
      "rating": "2",
      "text": "I wanted so badly for this to be amazing and I really wanted to like it. As the movie went on, I kept telling myself that I like it... but then it ended.What does this movie have to do with anything... let alone the Cloverfield universe?? Honestly. What does the space station situation have anything to do with the Godzilla conflict that is going on in the previous two movies? What answers do we get that bring us closer to what questions the first movie so ingeniously raised??Where does the franchise go from here? The second movie, at least, gave us a different perspective that relates to the first movie's cause. This didn't feel anything like a Cloverfield movie. It felt more like a dysfunctional Alien/Life wannabe. A total of 10 minutes of this movie actually have anything to do with the creature that is reeking havock down on earth. Even if this wasn't a Cloverfield movie and was just a science fiction movie, there are so many questions left unanswered. Why does everyone know about the \"Paradox\" phenomenon, but we are left in the dark? What does the arm have to do with anything? How did certain parts end up in a certain person's body?Even when the characters are pitching their solutions to solve the problems, none of it makes sense and that they are just pulling crap out of their a**es, while everyone stands in a circle pretending to agree and know what to do next.This is the most jumbled movie I think I have ever seen. The only reason for the 2 score is primarily for Chris O'dowd's performance and humor, along with the ambiance of the film.They set the tone right but never executed... and again, what in the hell does this have to do whth Cloverfield??"
    },
    {
      "rating": "1",
      "text": "I wanted to continue my 2018 theme of the critics must be crazy.However, for the love of all that is true and good, the critics are right. Please DO NOT waste 2 hours of your life watching this movie. You will NEVER get them back. You’ve been warned.This movie has nothing to do with any of the other Cloverfield films and is a fraudulent cash grab rebranding a generic Paramount science fiction film The God Particle, as a Cloverfield film and having Netflix purchase and stream this film as a Netflix original.We need Mueller off the Russian investigation and onto this travesty ASAP!"
    },
    {
      "rating": "2",
      "text": "Basically it was way more enjoyable for me to watch the trailer compared to watching the movie.  The best parts of the plot were way underplayed because the concept was actually very interesting.  By the end, I didnt care.  If you like the strangeness of the trailer, skip this movie, it wasnt strange at all.  Star Trek did a better job with this plot."
    },
    {
      "rating": "5",
      "text": "The Cloverfield Paradox is a generic mish-mash of almost every notable \"a team in space aboard a space station\" film.Rather than a sci-fi spectacle it feels more like a mediocre 'Black Mirror' which happened to have a large budget.While it doesn't deliver anything memorable, it is still enjoyable for fans of the Cloverfield franchise and ties up a few loose ends of the mysteries presented in the other films."
    },
    {
      "rating": "3",
      "text": "Very mediocre. Not a fun watch. A jumbled mess from end to end, it lacks characters that even care about the film they are working on. It didn't need to be a cloverfield movie, it just is."
    },
    {
      "rating": "4",
      "text": "Started off decent but around the halfway point it settled into a completely banal and predictable rescue/survival story that just didn't go anywhere interesting. It seems they had the idea to show the catalyst for what we see in the previously released Cloverfield films, both of which I enjoyed thoroughly, but they didn't quite manage to flesh it out enough to make a satisfying feature. The mystery and horror of the first half dissipates completely and leaves us with nothing much exciting to hold onto as the film hobbles to its glaringly obvious conclusion. I wouldn't recommend watching it to be honest but if you're really bored you might find it passable."
    },
    {
      "rating": "4",
      "text": "Think of every sci-fi thriller/budget horror cliché that you can and write it down. Congrats: you're now a screenwriter! Now you just need your movie to sit untouched for a few years until someone shows it to J.J. Abrams. He'll buy it, re-edit some things, re-brand it as a Cloverfield movie, and voilà - your movie now gets a wide release!Realtalk: this movie was predictable despite its attempts to be \"hella random lol ;) ;)\".  At times it feels like entire exchanges between characters were cut out mid-scene. Characters are level-headed and a second later are suddenly screaming at each other over some super-forced point of drama.I'm convinced that Netflix bought the rights to this just so they can get people interested in Altered Carbon."
    },
    {
      "rating": "3",
      "text": "Oh dear. Every character seems to be in a different movie. Hamilton is in Gravity, Bruhl & Zhang are in a bad Alien rip-off, and O'Dowd is in Hitchhiker's Guide to the Galaxy. The stitches connecting this collection of cockpit and hallway shots to the Cloverfield universe are obvious and clumsy, and the attempt to add a Cloverfield twist to the end is telegraphed so clearly that it's no fun at all. Oh well. Hope this doesn't kill the franchise; first two were loads of fun."
    },
    {
      "rating": "2",
      "text": "Cloverfield (2008) was enjoyable film in it's own right, 10 Cloverfield Lane was Genius, and The Cloverfield Paradox is a complete and utter mess. Once again tooting the name of the lense flare God JJ Abrams as a producer, and holding an estimated 26 million dollar budget, there is really no excuse for The Cloverfield Paradox to be such a sh*tty film, yet the films director Julius Onah, makes it look all too effortless. Prior to being bought out by Neflix, The Cloverfield Paradox was held in development hell by it's original distributer, Paramount pictures, at The time many questioned this decision by Paramount considering the surprising success of 10 Cloverfield lane two years. Cut to present day and the decision by Paramount seems all too logical as The Cloverfield Paradox, suffers from plot holes, pacing errors, bad plot decisions, boring characters, and a predictable story among other things. Starting in the not to distant future, but not the future, because Cloverfield takes place in 2008, so not to distant past i guess, a group of scientist decide it would be a great idea to manipulate the space time continuum, what ensures is a bunch of wacky hijinks that don't add up or make any sense leading to death, death and more needlessly stupid death. To put it simply this movie left me frustrated, 5 minutes in my head hurt, and after 30 minutes i wanted it to stop, surprisingly enough this film isn't that long at 102 minutes, but i'll be damned if i didn't feel every last minute. The cast is also heavy underutilized, Daniel Bruhl, Chris O'Dowd and Gugu Mbatha-Raw are good actors and they show at times how good they could have been in this film. But some seriously awful dialogue and confusing story choices make their effort go to naught with frequent incompetence by the films director who shows he has no idea what to do in a film let alone with 26 million.  I would continue this review however everything i say will just become repetitious, the are far too many bad decisions in this film and it fails in almost every degree."
    },
    {
      "rating": "5",
      "text": "Following the chaotic rumble of the 32nd Super Bowl,Paramount decides to release a movie whose marketing and release were really really misguided (kind of),and that movie is The Cloverfield Paradox,directed by someone who really saw a ton of movies with Alex Kurtzman as a writer,a producer who's really talented at Sci-Fi,and somehow (somehow...),Executive Produced by MATT CREEPIN' REEVES (Cloverfield 2008 and 2017's War For The Planet Of The Apes). Whenever a Marvel or DC Movie gets announced,we can't help it,but just get excited at it,but most importantly,create whatever expectations we want,and that's great as a fan of a franchise,and that sure is what I did as someone who really liked Cloverfield '08 and 10 Cloverfield Lane.And I was interested in seeing how the director could handle this mish-mash of a concept,but unfortunately...Yes it's THAT kind of movie.The Cloverfield Paradox joins movies like Geostorm and The Snowman at being just a movie that wants to do something else rather than telling its own story.And again,the concept is great,although it is sometimes hard to understand,even if it's done in a really well done montage at the beginning of the movie (like Geostorm).This isn't saying that the movie is pretty bad (*coff coff* Winchester *coff coff*),because there are some good things in it...Maybe too good for this movie.The acting and the cast choices are too good to be in this movie,like Gugu Mbatha Raw,who (just like Henson in Proud Mary) seems like if she wanted to do better than this. Same with Elizabeth Debicki and Daniel Oyelowo,who seemed kind of bored trough the entire movie and just wanted to be there for a paycheck. Daniel Bruhl (Rush,MARVEL Studios'Captain America Civil War),who I think is a great actor,really disappointed me with his performance,since he has to be this dude who almost does nothing for the entire movie.Whoever wrote the story must be a literal Alex Kurtzman fan,since during the movie you could always count on bits of setup for a Cloverfield/Dark Universe thing,instead of telling its own story through scenes that are kind of hard to understand,and yes,even in the logic of a Cloverfield Movie.Oh,and the teachnicl aspect? Yeah,it's just distracting for the movie,except the ''Alien Covenant'' shot of the movie who I'll save,since it made me happy as a Cloverfield Fan.But that last shot isn't enough to save this hot mess of a movie. The Cloverfield Paradox will make some fans of the franchise conscious,but if you want a better Sci-Fi Horror flick,just watch Cloverfield '08 and/or 10 Cloverfield Lane,and try seeing bthis for your own \"Netflix And Chill\"-y risk."
    },
    {
      "rating": "5",
      "text": "Honestly I can now see why this was released only on netflix. Overall it's a very slow paced film that borders on mediocrity up until the final minutes. The cast is pretty dull and none of characters were interesting in the slightest. As far as it connecting to the Cloververse, it waits till the last 10 min just like 10 Cloverfield Ln, the difference is that film was interesting and had a fantastic cast/story. This has some very scattered far reaching plot points within its story, and really doesn't pull any punches other than a couple little attempts at space horror which are few and far between.If you wanted to see creatures/aliens consistently, be prepared to be let down. Overall this was a disappointment where the other 2 films are excellent and stand on their own. the hype earlier tonight was completely deflated for me. 2.8/5 at best and it really reminds you of a syfy original generic film full of cliches. Could and should have been way more. Im actually quite furious with this film."
    },
    {
      "rating": "1",
      "text": "The good thing about watching this on Netflix is the ability to fast forward this mess. It looks so cheap. No thrill, no excitement, very bad acted. This is the worst Bad Robot production and I am a huge fan of the company. The spaceship looks so silly, the general mood and theme is absurd. I hope they can come back with a good idea and please let the Cloverfield thing die. You guys killed it."
    },
    {
      "rating": "3",
      "text": "Worst Black Mirror episode ev- oh wait.Didn't expect this to be released today on Netflix and after seeing it, I can see why. You know it's not a good sign when things get rushed and the release date gets canceled just to be dumped on Netflix. Doesn't feel like an actual movie with nothing cinematic about it.Wasn't hyped for this in the first place, but the end result is disappointing."
    },
    {
      "rating": "2",
      "text": "I would have love it if it was a funny movie. poor scenario, poor acting. the worst is the reaction of that poor guy who just lost his wife, or that scientist laughing at his missing arm..."
    },
    {
      "rating": "5",
      "text": "If there is something too obvious when you finish this movie, it's that it was far from being part of Cloverfield's anthology and that is quite clear when the events begin to unfold.The Cloverfield Paradox cannot help feeling like two different films, probably the fact that the decision to add it to the Cloverfield universe was taken during the filming had a lot to do with it.The narrative in general is too confusing and the little development that is allowed to the story and the characters is too poor, of all the actors despite being a certainly recognized cast, only Gugu Mbatha-Raw has a dramatic and emotional weight in the plot .The editing only confuses more and being honest if they had really given more treatment to the script they could have created something more interesting, flashy and dynamic, because the story lent itself to it, it's true that the narrative resource of a dimensional rupture might seem too cliché within the field of Sci-Fi but here there were enough arguments to make it better, especially because of the enormous cult the original movie created and all the questions that left unanswered.The Cloverfield Paradox apparently ends up giving an origin to the creature of the original film and the ending gives enough material to believe two possible things: or the original creature is still alive or that monster is the mother of that creature and let's say that's why this film will get a lot more validation from the fans.Unquestionably and ironically the biggest flaw of the film ends up being its connection with the Cloverfield universe because obviously all of it feels forced, like an argumentative and narrative crutch, therefore the film never flows as it should and the real and more interesting mystery gets completely forgotten.I don't consider it a disappointment, but frankly what it offered did not come anywhere near expectations much less the hype that was unleashed by its unconventional release. It certainly works for Netflix because of the exclusivity but I really hope that if Abrams plans to continue with this, as it seems to indicate Cloverfield: Overlord arriving in October, I hope better stories and honestly he should avoid continuing to give such crumbs of information, because it will work a few times but at that rate the audiences will get fed up."
    },
    {
      "rating": "0",
      "text": "In the sphere of turd gilding, one can assume that turds can be silver plated as well.   By extension, this film excreta has been chromed.    It's bright and shiny, but a turd none the less.   Paradox has a script devoid of a basic knowledge of physics with insipid dialogue and zero internal logic that reenacts scenes wholesale from other genre films and then neatly wraps up everything with a cynical Cloverfield bow.   Paramount and Abrams have no shame.   Skip this steamy cow pie."
    },
    {
      "rating": "0",
      "text": "The most tasteless, annoying and stupid movie that I have seen in years. I have registered here just to warn other people.But, hey, it is politically correct."
    },
    {
      "rating": "2",
      "text": "The movie was flawed from pre-production on. The budget ballooned to 10 times the original budget and even then there was still serious work to be done. And when they realized there was no hope for a theatrical release, Paramount shipped it off to Netflix. And truly, The problems show throughout.The cast does a good enough job but the story just isn't here. And there isn't enough material to truly tie it into the Cloverfield lore, Heck there isn't any at all aside from the Cloverfield name drop every now and then. This film is an insult to fans of the franchise and I've been once since the first film came out."
    },
    {
      "rating": "3",
      "text": "Despite it's shock value, and the strength of it's franchise, Paradox is a car crash of poor performance, poor script and poor delivery. Very little of it makes sense and despite several points where it tries it's best almost everything falls flat. Chris O'Dowd takes the gong for best line when forced to confront the plot itself in the form of his on severed arm writing out a message on the floor. Only for that little gem to never be explained either. Miss it, you're better off just not knowing."
    },
    {
      "rating": "2",
      "text": "If you have seen any space horror movie from 1980 to 2018 then you can fast forward and condense this 110 minute movie into a 30 minute viewing. It borrows every cliche from the genre and fails to use any of them well. As to how this movie fits into or expands the Cloverfield universe is baffling. It confuses the timeline and adds too many new \"ideas\" without explaining any of the ideas that it falls flat."
    },
    {
      "rating": "1",
      "text": "Completely terrible. The characters are awfully written, the story makes no sense, and completely throughs away the original story of the cloverfield monster. First let me start with the story and how it makes no sense. Humans are using up all the energy so that makes some scientists go to space to fire some laser for unlimited energy. 'Why don't they use solar panels or wind turbines?' you ask. Simple, the writers needed a cheap plot device to show how the monster appears in the original movie, because the original story for the clover field monster was that it is a normal sea creature that was hatched from a large egg deep under the atlantic ocean. Its NOT an alien and its most certainly not from another universe. Besides the boring story and the contradictions, the characters are so badly written that i ended up not caring for or even remembering any of the characters. Half of these characters act as a 12 year old child. These are scientist astronauts, people that would be calm in the most tense situation but here we have grown men yelling and screaming at one another for the smallest reasons. If you have literally nothing else to do for the next hour and a half than doing literally anything other than watching this movie would be better."
    },
    {
      "rating": "6",
      "text": "The Cloverfield Paradox was alright, and after watching it, it's pretty obvious that so much storyline reshoot work would have been necessary to present this as a theatrical release that they sold it to Netflix on the cheap.  Not a terrible movie, but nothing you haven't seen before in Alien, Even Horizon, etc etc etc"
    },
    {
      "rating": "5",
      "text": "As the Cloverfield franchise continues to surprise and take risks- 'The Cloverfield Paradox' still stumbles with poor writing that fails to execute anything that it tries to accomplish. With a good cast to helm, and a somewhat unique premise- it might satisfy the causal viewer- though, it may leave you disappointing as a Cloverfield fan."
    },
    {
      "rating": "6",
      "text": "It ain't as bad as they say, but is mainly a plot filler for original Cloverfield and 10CL. This could really be done as a short movie, because really half of the movie seems meaningless. Either way, you can treat it as a mediocre Black Mirror episode with a connection to a bigger universe. Also, ending does not make any sense, if you did not watch the previous entries."
    },
    {
      "rating": "9",
      "text": "This movie is nothing like, and exactly like, what you would expect to see in a Cloverfield movie. I won't pretend to be some sort of film expert (and maybe I'm just a Cloverfield fanboy) but I really loved this movie."
    },
    {
      "rating": "3",
      "text": "Well... Back in 2008 i remember cloverfield as something interesting. It was a kaiju movie, a monster movie. Good, great. But this... it's so forced into the cloverfield universe. It's a space movie, with a few touches of cloverfield so people could say \"Ohhhh yeah so that's why is called cloverfield, oh yeah, now i get it\" or something like that. It's an ok movie... average, almost mediocre.. but ends up being bad.It could be called The shepard paradox, The average space station paradox, or whatever, let's say... \"Movie\". Because that's what it is, a movie we have seen before... mmmmmaaaany times. Totally unnoriginal."
    },
    {
      "rating": "6",
      "text": "It's hard to say if this movie was made only to explain Cloverfield. It surely does in many ways. They try to turn this story around multi-dimensions and quantum stuff. Yet, for a bunch of scientists they do a poor job explaining it. And somehow this all feels like pseudo and unconvincing science. I loved the actors in general, but some of them are given very little to act on. The fun part was with the unexpected events on the station but it could have been more...why not show those dimensions ? The FX were really good, the action somewhat decent too. The ending was good but predictable. I give it a 60% because the story was lacking in almost every department."
    },
    {
      "rating": "6",
      "text": "This is a completely competent sci-fi film, but definitely a let down in the Cloverfield universe. The biggest problem is that they seemingly shoe horned in this connection and all the pieces don't seem to fit. B-"
    },
    {
      "rating": "6",
      "text": "The Cloverfield Paradox is a good space thriller but a very average Cloverfield film. The cast does a phenomenal job with what they are given which helps elevate this movie past the ok script. I feel like there are some sections that were added in after the fact to help \"connect\" this to the other Cloverfield movies. However, it seems like this film has made the timelines even more confusing given the introduction of multiple universes. It is cool to see the Cloverfield monster (or monsters) but that doesn't make this movie great. While this movie is a little disappointing, I'm still interested where they go with this franchise."
    },
    {
      "rating": "6",
      "text": "So I kind of feel like I just watched two completely different movies. It started off dark and scary, and at some point it kind of flips a switch and starts to feel a lot like a new Star Trek movie.This feels like a movie someone took a chance on, the studio maybe got cold feet, and then they brought in Bad Robot to save the day. Stick a vague franchise tag on it, toss in a few easter eggs, and bam! you have a Cloverfield movie.I appreciate a lot about the movie, but it was just too jarring of a change."
    },
    {
      "rating": "6",
      "text": "First things first isolation sci fi thrillers are my favorite genre.  That being said I give this movie a  6 out of 10.  It felt like a B movie that hired a lot of well-known actors, not a total waste of time but something I might be upset if I paid money to see in theater.  Luckily for me this was a Netflix exclusive so it was a nice little bonus film for having the service.    For me this was the weakest entry in the Cloverfield franchise, the film was clearly piggy backing off the success of the previous films without bringing much new to the table. I did like the space setting and the actors worked well with the scripts they had, though they did fall prey to the familiar horror movie tropes. You would think the greatest minds in the world would be a bit more informed on space time theories and paradoxes.  It did have a nice little connection to the other films and somewhat offered a vague explanation to the origins of the previous films.    If you have Netflix and want a sci fi film to pass the time on a day off, then give it a shot.  Just remember, you might be a little let down If you are expecting the same quality as the 1st and 2nd Cloverfield movies."
    }
  ]
}