{
  "id": 2023,
  "title": "The Punisher",
  "starring": [
    "Thomas Jane",
    "John Travolta"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "description": "When undercover FBI agent Frank Castle's wife and son are slaughtered, he becomes 'the Punisher' -- a ruthless vigilante willing to go to any length to avenge his family.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7rmA1HwYp2GKM85BL0cVwCaosGr.jpg",
  "categories": {
    "plot": 6.833333333333333,
    "acting": 6.363636363636363,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 8.11111111111111
  },
  "reviews": [
    {
      "rating": "9",
      "text": "As usual, the critics got it wrong with this one. It's been a while since I first saw it but even after knowing what happens and how and when it does, it's still a great movie. Other than Daredevil, this would probably the most underrated comic-to-film adaptation I've ever seen. Thomas Jane leads a solid cast and the plot is interesting and complex without losing the audience. Overall, a very enjoyable experience."
    },
    {
      "rating": "9",
      "text": "I love this movie! One of my favorite comic book movies ever! I don't care what critics say about it. I can watch this movie 100 times and not get bored. The scenes with the assassins are easily the best parts and so much fun to watch. Tom Jane will forever be the Punisher to me. Great movie!"
    },
    {
      "rating": "10",
      "text": "My favourite all-time film! It's not, by any means, an impressive film.. But it's a film that you can sit back, switch off and watch over and over. It's a feel-good-kick-ass film. 10/10"
    },
    {
      "rating": "0",
      "text": "The Punisher is such a bad film that it becomes inadvertently entertaining; it’s"
    },
    {
      "rating": "4",
      "text": "The most earnest attempt at bringing this Marvel comics character to the big screen, The Punisher is still ultimately a grim, dour, and dull beast."
    },
    {
      "rating": "9",
      "text": "I really don't get why people are hating this movie! I recently watched it on t.v. and it is now one of my all time favorites! Don't listen to the critics. They don't know what they are talking about on some movies."
    },
    {
      "rating": "9",
      "text": "Have recently watched this whole series on Netflix, back to back. Hands down the best series I watched last year (2017). It’s a marvel movie that finally allows the main protagonist to take off their PC gloves and give the villains the payback they deserve. It came across as being far more realistic than other movies of this genera. I highly recommend it, and have done to many of my friends, who have also given me good feedback on it."
    },
    {
      "rating": "9",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$..............................》》》》》》》》》》》》》》》》》●■●■●■●■●■●■●■●"
    },
    {
      "rating": "10",
      "text": "A+ Thomas, John, Samantha, Ben, Will & Rebecca are perfect. ****************"
    },
    {
      "rating": "9",
      "text": "Revealing mistakes (around 24 mins) After Castle shoots the gas tank, it blows up the henchman setting him on fire and you can see the fireproof mask and gloves on him."
    },
    {
      "rating": "9",
      "text": "++++++++++××××÷++++++sodmdkmdkdmksmsks÷÷÷÷÷$+++++++===÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "\"*\"*\"*\"*\"*\"*\"*\"**:*:*:*:*\"*\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "9",
      "text": "Before the MCU came into being and saved the day, a lot of Marvel characters were having a rough time finding success on the big-screen during the 2000s. Spider-Man and the X-Men were doing fine, and even Blade did well enough to get himself a trilogy. The rest of the Marvel heroes though? Not so much. They were met with poor reviews and disappointed fans. Even The Punisher was met with critical backlash, although for the life of me I can't see why.It's an awesome origin story that plays out as a superhero revenge story. It's dark, brutal, and Thomas Jane absolutely nails it as Frank Castle. There are even some nice bits of dark humor, scenes pulled straight from the comics, and is just as violent as one would expect a Punisher movie to be. Unlike Daredevil it actually manages to nail the mature, gritty tone. Something a lot of superhero movies have struggled with over the years and even still do.It's interesting to see how many familiar faces were pulled from Punisher comics to fill out the supporting cast. The movie offers quite a bit of fan-service for those who are clued in. The mob family Castle sees himself fighting against feels a little generic, and Travolta is surprisingly flat as the main villain, but none of that gets in the way of how satisfying the violence is. It's also got an old-school feel. Revenge has never been quite so satisfying.Yes, the early 2000s weren't the kindest to a lot of Marvel's characters. The critics took shots at The Punisher that honestly feel undeserved. During a time when Daredevil, The Fantastic Four, and even Hulk were failing to do those classic characters justice (they really tried though, I'll give them that), The Punisher stood tall and delivered. It's one heck of a satisfying revenge flick, a bleak vigilante tale, a throwback to the gritty action movies of the 70's and 80's, and something truly different from every other superhero movie out there. It's a treat for fans of the comics and a great action movie for everyone else."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this film. It wasn't made to impress critics with high expectations who've never read the comic and give harsh reviews. Behind the violence, justified by the actions the mob took against Castle, there is a story. This movie was based on a comic and stays loyal to it. If you're not a fan of the comic or action films, instead of trying to figure out reasons to hate it try and commend what the director and actors have brought forward. This film stays a lot more loyal to the comic than the 1989 film. The atmosphere of the comic is well recreated and and isn't just typical Hollywood bullsh*t."
    },
    {
      "rating": "2",
      "text": "/    /"
    },
    {
      "rating": "8",
      "text": "It´s not as good as the one with Dolph Lundgren but still is quite awesome. I wish they made a sequel."
    },
    {
      "rating": "10",
      "text": "Stylized CreditsThe Marvel Comics logo features comic-book images of the Punisher in its pages; after it fully forms, it is shot three times and \"bleeds\" white paint which forms the Punisher's skull, and the film's title. See more »"
    },
    {
      "rating": "10",
      "text": "The original film, with no edits, clocked in at 2 hours and 56 minutes."
    },
    {
      "rating": "10",
      "text": "This is a great bloody cold hearted action flick from start to finish. It's **** awesome!"
    },
    {
      "rating": "9",
      "text": "When this was released on DVD in September 2004, it surprised \"Marvel\" by selling nearly 2 million copies in its first five days."
    },
    {
      "rating": "9",
      "text": "...........,,,,,,,,,jjjjjjikjsodmo@#$%+×÷=€£&(()^.,?!!;:▪○●□■☆⊙°•¤《》♡◇◇♧♤¡¿{}[[~▪⊙●□■•¤°⊙☆▪●□■●"
    },
    {
      "rating": "9",
      "text": "⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙°•⊙:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:.:."
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》》°》°》°》°》°》@;@;@;@;@;@;@;@;@!@!@!@!@!!@!@:@:@;@;@;@;@;@;@;@;@;;@;@"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:::;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡••¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "4",
      "text": "Rewatching this film was a mistake, I remember liking it when i was younger but now...The acting is painfully awkward and cringey. Frank's motivations for taking revenge are on point but you never feel that it was a big loss for him, they try to compensate that with: \"Look how much he drinks\" and \"Look how dead inside he looks\". He lost his entire family very recently and it looks like all of that happened many years ago or he never cared about them.The motivations for people to help him are very thin, there's all that stuff about family with the people he shares building but there's barely any development between them and Frank.The pacing is bad, it goes to fast, not enough time to develop characters and situations.The writing and dialog are also really low quality.It's sad, because I think Thomas Jane looks great as The Punisher."
    },
    {
      "rating": "7",
      "text": "The Punisher. Only one word - Revenge. The Punisher is reminiscent of a typical action movie from the 70s and 80s. An unkillable hero and a vicious villain. Thomas Jane showed his hero well, for which we thank him!"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%&"
    },
    {
      "rating": "9",
      "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:______________________________♡◇♡◇♡◇♡◇♡◇"
    },
    {
      "rating": "8",
      "text": "Well executed revenge flick, well acted, with great action. But it's not really about revenge, it's punishment! Love that line. Tom Jane is great as the Punisher and I love the music."
    },
    {
      "rating": "8",
      "text": "Firstly I want to say this is another case of the respected critics seeming to not live in the same world as the rest of us. Not everyone will like this movie but rating it so low just tells me that the respect these critics have is not deserved.I really enjoyed this movie. Classic revenge story (sorry, Punishment story), with a bit of unexpected almost goofy humour along with some seemingly intentional tongue in cheek scenes that I very much enjoyed. Plus penty of old west style quick-draws to add to the fun. Captured the essence of a comic book better than most comic book movies. Interestingly John Travolta doesn't stand out as some over the top villian like he usually does in other villian roles. Instead he, and everything else, somehow has a believable realistic feel to it. It makes it more disturbing that he feels like a real person that surely exists in the real world in some form. An interesting balance was achieved in this film between reality and comic book fantasy, as well as seriousness and humour. It all feels more believable than something like Batman Begins, which itself aimed more for realism than past comic movies. The superhero is never really super (though that is true of the comic it is based off of). And there is plenty of luck involved in his success as well as some clever preparation and equipment.I have no real issues with the film. Only really wanting more from it. Wish they'd fleshed out the bad guys wife a bit more since she was a key player. I rate it an 8 but I am up to rewatch it more often than many other movies I'd rate at 9. It does what it does really well.The movie that comes to mind that is most alike to this is \"Payback\" with Mel Gibson \"Payback\" is cooler and grittier but \"Punisher is more fun and with several humourous scenes that always maintain the overall seriousness of the subject matter without ever getting too dark. If you like that film you should enjoy this one and vice-versa."
    },
    {
      "rating": "8",
      "text": "I've seen both the extended cut and theatrical cuts of this film and in terms of being a feature length film, this was and still is a fine movie about revenge, justice and punishment.Thomas Jane plays Frank Castle/The Punisher perfectly, showing great depth and ability to a stoic character. John Travolta also plays a fine villian in Howard Saint but it doesnt help the character is thinly written to be something more than a cardboard cutout mob boss.As I said, even in 2019 and with Netflix's adaptation being (somewhat) successful this is still a very good movie. It has obvious flaws, especially in the second half but \"The Punisher\" is still a fine film about revenge, punishment, justice and letting go."
    },
    {
      "rating": "8",
      "text": "I really enjoy that movie when I was a kid and continuing liking it. Thats not the kinda movie too win a oscar or something but its a fine one........"
    },
    {
      "rating": "2",
      "text": "Man! This movie sucks! It’s so bloody and horrible! This movie is so horrible because it’s very bloody!"
    },
    {
      "rating": "7",
      "text": "I actually thoroughly enjoyed this sensibly written film with its complex lead character."
    },
    {
      "rating": "7",
      "text": "This movie wasn't as bad as people say it was, as a fan of The Punisher i thought it was decent, it had some good moments, although it didn't follow the comics much. Also Thomas Jane was fantastic as Frank Castle/The Punisher he nailed it. If you haven't watched it give it a shot you might enjoy it."
    },
    {
      "rating": "7",
      "text": "Esta es una película de origen, he visto a mucha gente odiándolas... Watchmen, XmenOrigenesWolverine, Hancock etc. Esta película muestra el origen del castigador. Aquí nos muestran como le destrozan la vida a Frank Castle y como la justicia no logra hacer nada, el toma la justicia por sus propias manos. Mírala sabiendo que es para conocer al personaje no para verlo en una súper aventura o eso. Le doy un 07/10 es una película mas que decente."
    },
    {
      "rating": "6",
      "text": "The problem with this movie was that it couldn't make up its mind about what it wanted to be, and this ultimately led to its downfall at the box office. The beginning of the film is really intense and it seems like it's going to be one of those, 'it could happen in real life' comic book adaptations. After the first half hour though, that's gone and replaced with the typical unrealistic bull  This film also couldn't decide whether or not it wanted to be PG-13 or R. Ultimately it got the R rating and has the violence that goes with it, but clearly the producers were hoping for the PG-13, and have some really childish parts to it. I hate when that happens, make up your mind! If you're going to be violent and crazy, then go all out, and if not, tone it down and get the PG-13. When they mix both styles, they don't appeal to a larger audience, they appeal to a smaller one. The cast did an adequate job, the story was alright, and the action was pretty cool, but there really isn't much here."
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    },
    {
      "rating": "5",
      "text": "This simple revenge story is an odd mixture of camp and seriousness.  The violence is pretty intense, but the most impressive bit was the explosions (of which there are many)."
    },
    {
      "rating": "5",
      "text": "This movie was meh. I liked the book alot better."
    },
    {
      "rating": "7",
      "text": "Marvel's unstoppable vigilante hits the big screen. After losing his family in to mob violence, undercover FBI agent and former Marine Frank Castle (Jane) decides to dedicate himself fully to the eradication of crime from America."
    },
    {
      "rating": "6",
      "text": "PunisherSo this review will be a no-holds-barred spoilerfest because discerning film buffs may have something better to do with their time.1) The first half hour is devoted to Frank Castle the Cop and Frank Castle the Family Man.  I was expecting to see The Punisher.  Maybe I was expecting Blade.  I liked Blade because it started “in media res” with no time wasted and evolved from there.  Everything in the first half hour of Punisher could have been handled in flashbacks lasting a sum total of 5 minutes.  Yeah, it would’ve cut the “emotional content” available to the audience, but, seriously, who watches a film like this for the emotional content?  Fifteen year old girls who think Punisher dude is dishy?2) Frank Castle the Family Man ends with a platoon of bad guys traveling to Puerto Rico to slaughter Frank’s entire extended family.  They approach under full daylight and don’t even bother wearing masks.  There are apparently no people in Puerto Rico except Frank’s kin and the assassins and the assassins shoot up everybody.  Kids and grandmas tumble like toy dolls.  Things explode into roaring fireballs.  Frank is shot at point blank range by one of these “professional killers” and is then blown into the Caribbean by an explosion and of course he survives.  I guess the salt water sterilizes the wounds.  Some guy in a rowboat picks him up later.  Maybe some guy from the comic’s origin story.  I didn’t bother looking it up.In the middle of the slaughter Frank looks out a window and sees his mom being gunned down.  His reaction is, “Mom?”  Like he either can’t believe his eyes or I don’t know what.  And it’s not like this is Frank’s first rodeo.  The movie starts with a fair bit of shooting.  You’d think the “veteran cop” would instantly risk life and limb to save Mom, or at least spout off with a few raging WTFs!!!!!3) Frank goes on to wreak havoc and exact vengeance.  This part is fairly interesting if you like to see bad guys get what they deserve and you’re not too particular about due process under US law.  Apparently the actual police are all on vacation as they never put in an appearance.4) John Pinette, the late standup comedian, does a nice job in a minor supporting role.  There are several people in minor supporting roles.  For the most part, these roles only distract from the whole point of the film (vengeance) and pad out the runtime.5) The world’s greatest “hitman” is called in to kill Frank.  He starts off by carrying a guitar into a diner and singing Frank a song.  I guess this is supposed to imply that the guy is such a great hitman that he can break all the rules and still take down his target.  Naturally, the hitman ends up dead.  Frank takes his car.6) “The Russian” is called in to kill Frank.  I guess he's #2 in the world.  You know the type.  He’s like seven feet tall and you can smash him in the head with a crowbar and he doesn’t even bleed.  But only in comics and movies.  It turns out he’s vulnerable to burning hot grease in the face.  He dies too.7) There’s a girl in the film.  She’s a bad judge of men. Frank saves her from getting murdered.  That takes about one minute of screen time.  Frank eats the girl’s cooking but keeps his emotional content to himself.8) Overall, Punisher isn’t such a bad film.  It’s just not any better than the typical action-adventure flick being churned out by the hundreds every year.  There’s nothing really clever about the story.  It ends pretty much where you’d expect.If you're a real fan of the comic, you'll probably like it.  If not, maybe you won't.  There are plenty of options that would be far worse."
    },
    {
      "rating": "5",
      "text": "It has moments of greatness but overall it drags and doesn't get to what you want fast enough. Thomas Jane is great in the role though."
    },
    {
      "rating": "5",
      "text": "Jane is decent and the tone is right but this film has some terrible pacing, plotting and writing."
    },
    {
      "rating": "3",
      "text": "The last real icon created by Marvel Comics, The Punisher began life as a bad-guy variation on Charles Bronson's Death Wish vigilante in the '70s, turned into a grotesque version of a law-and-order hero in the Reagan '80s (even spawning a direct-to-video Dolph Lundgren vehicle), and withered away in the Clinton years. More recently, he experienced a black-comedy revival in the hands of writer Garth Ennis, but the latest film version doesn't have much to do with that. A return to the character's righteous, murdering '80s ways, 2004's The Punisher seems all too of-the-moment now that \"an eye for an eye\" has become national policy.\r Shortly after The Punisher opens, thugs hired by overacting Tampa gang lord John Travolta turn a family reunion into the bloodiest social gathering since Guns N' Roses' \"November Rain\" video. Robbing recently retired undercover FBI officer Frank Castle (Thomas Jane) of his wife, child, father (an apparently eager-to-work Roy Scheider), and a handful of aunts, uncles, and cousins, Travolta's otherwise-thorough henchmen only stop short of making sure that the man himself has died. When he resurfaces, Jane returns to Tampa to exact revenge.\r And that's the movie, a revenge scenario so simple it could have been created on a playground. In the right hands, it might have worked: John Woo could have turned it into a bullet-drenched melodrama, some kind of crazy variation on In The Bedroom. With Kill Bill, Quentin Tarantino turns a similar scenario into a meditation on honor, justice, and a century of different styles of cinematic violence. Sadly, The Punisher is about little more than bullets hitting bone, and how good it might feel to be on the right end of a gun.\r Armageddon screenwriter turned first-time director Jonathan Hensleigh displays a lot of enthusiasm for stormy lighting, as well as a fashion photographer's skill at putting his actors in memorable poses, but the whole show is watching Jane mow down the bad guys, taking the occasional breather to hang out with new friends Rebecca Romijn-Stamos and her misfit hangers-on, and to drown his sorrows in a bottle of Wild Turkey. (The brand is featured so prominently that it must be product placement, but is \"the drink of choice for bloodthirsty gunmen\" a desirable tagline?) There's not even a hint of suspense over the outcome; Jane is portrayed as such an unstoppable machine that only professional wrestler Kevin Nash is made to look like a formidable adversary.\r The Punisher has one inspired sequence. Wearing a teardrop tattoo, a Memphis hit man serenades Jane before attempting to kill him. The scene lasts about a minute. The movie goes on much longer."
    },
    {
      "rating": "0",
      "text": "If you didn't see every single mind-numbing piece of \"action\" coming from a mile away, then you are some kind of retarded half-man, half-monkey hybrid"
    },
    {
      "rating": "7",
      "text": "Thomas Jane was a good lead and a great pick as the Punisher. The rest of the cast was solid as well but Trevolta was very disapointing, Didnt live up to his name imo. There was a lot of good action scenes as well. However the dialouge between characters was incredibly poor at times and rather disapointing. Still, I have watched it numerous times and I still enjoy it."
    },
    {
      "rating": "4",
      "text": "The film had potential to be a great dark vigilante revenge thriller, but it's shot down by uneven pacing and a story that displays more explosion than it does emotion."
    }
  ],
  "recommendations": [
    "cold_pursuit",
    "punisher_war_zone",
    "savages",
    "taken",
    "iron_man_3",
    "death_wish",
    "spider_man_3",
    "kingsman_the_golden_circle",
    "sin_city_a_dame_to_kill_for",
    "nobody",
    "x_men_apocalypse",
    "daredevil",
    "ant_man_and_the_wasp_quantumania",
    "four_brothers",
    "jack_reacher",
    "the_equalizer",
    "creed_ii",
    "jack_reacher_never_go_back",
    "the_marksman",
    "angel_has_fallen",
    "3_days_to_kill",
    "iron_man",
    "no_escape",
    "spider_man_no_way_home",
    "repo_men"
  ]
}