{"id": 1105, "title": "The Amazing Spider-Man 2", "starring": ["Andrew Garfield", "Emma Stone"], "runtime": 141, "genre": ["Action", "Adventure", "Fantasy"], "description": "For Peter Parker, life is busy. Between taking out the bad guys as Spider-Man and spending time with the person he loves, Gwen Stacy, high school graduation cannot come quickly enough. Peter has not forgotten about the promise he made to Gwen’s father to protect her by staying away, but that is a promise he cannot keep. Things will change for Peter when a new villain, Electro, emerges, an old friend, Harry Osborn, returns, and Peter uncovers new clues about his past.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/c3e9e18SSlvFd1cQaGmUj5tqL5P.jpg", "categories": {"plot": 9.636363636363637, "acting": 9.621621621621621, "ending": 10.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 10.0, "action": 9.6875}, "reviews": [{"rating": "10", "text": "Spider-Man 2 may be called a comic book movie, but is so much more than that. The film improves the action thanks to a larger budget, has awesome acting and characters, and an excellent script which has a heart and entertains. Spider-Man 2 is a movie you truly have to see to believe, it is the master of comic book movies along with The Dark Knight. Even if you are not a Spider-Man fan, SEE THIS MOVIE!"}, {"rating": "9", "text": "Spider-Man 2 is some of the most fun I have had during a movie. It is much more than a comic book movie and the character development in this movie is just great. I cared much more for the characters in this movie than Spider-Man (2002). The action sequences are brilliant in this movie, especially the train battle between our friendly-neighborhood Spider-Man and Doctor Octopus. Mary Jane is a forceful character in this movie though and by that, I mean, we are forced to like her as a character. She wasn't nearly as charming as Emma Stone was in The Amazing Spider-Man (2012) but this still is and will be, at least for a while i believe, the first movie which pops into my head when I think of \"Spider-Man.\""}, {"rating": "10", "text": "Sequels are always common ground for big franchise and surprise hits in the film world, but they don’t always succeed, actors may not want to return, drastic changes are often made which hampers the success of the original and they never really come up as strong, but this is not the case whatsoever with Spider-Man 2, a film which gets everything right, it has a real story, an emotional journey of self-esteem and the tests that face relationships and friendship when people are clouded by uncontrollable rage.\rTobey Maguire puts in much more personal performance in his second outing as the now conflicted web slinger, unable to juggle his crime fighting alter-ego and his attempt at an ordinary life of college and living alone. We see a world around him that doesn’t appreciate the pizza delivery man and the one behind the mask, branded an outlaw as Spider-Man and a slacking student as Peter Parker, his hard life reflects is superpowers too, which begin to fade in and out as his troubles worsen. The film is a dark and personal story which is such a triumph as the film goes along, we have another villain in the form of Dr. Otto Octavius (Alfred Molina), a genius scientist who is attempting to create free energy, but a disastrous accident sends the man insane, now pursuing the person he sees responsible, Spider-Man.The film cleverly explores each avenue of problematic issues with having a dual lifestyle.\rPeter sees everyone he loves drifting away from him, we see a touching performance from Rosemary Harris playing Aunt May, a stubborn woman who fends for herself, and we see a different side to the woman when Peter reveals the truth about the tragic death of Uncle Ben in the first film, the continuity continues to flow throughout the film, calling back previous plots helps stay involved. We also have one of the most visually spectacular films to date, with various scenes including stopping a train, catapulting from one building to the next and a very explosive finale that hits the right buttons each and every turn, with excellent scenes that leave you in awe, that is sure to leave everyone satisfied.\rOne of the best sequels ever made, and certainly one of the best superhero films to date, it is hard-hitting, personal, beautiful and very character-driven that it works as both an action epic and a dramatic story, the superhero film that has always been desired."}, {"rating": "10", "text": "The perfect sequel and the best Spider-Man movie that has ever been made. The movie is just excellent and Alfred Molina is the greatest Spider-Man villain of all as he plays Doctor Octopus."}, {"rating": "8", "text": "Second Spidey film, man builds extra arms, get out of control, becomes evil, Spiderman loses his powers & his girl, can he get them back?Bigger in everyway than the very entertaining first & maybe a bit too much CGI rather than story. However, still a very good watch. Tobey Maguire is perfect in the role as is the very under-rated J.K Simmons (I love him in Juno).Sort of on par with the first but for different reasons."}, {"rating": "9", "text": "a great follow-up to Spiderman"}, {"rating": "10", "text": "i loved this movie from start to finish.  it captured spider man in his fullest.  this was almost like the comic book.   it was great.   this movie was incredible.  the train scene was unbelievable.  this was way better than spider man 3.  its the best spider man movie.   near perfect"}, {"rating": "10", "text": "Spider-man 2 is the perfect comic book movie, quite possibly the best ever made up until this time. It's a movie with character, love, and life, and prior to what you might think it's not really a movie about killing bad guys at all...it's a beautiful love story. Wonderously acted, funny, witty, smart, it hits all the right notes. There are scenes in this movie that just make you smile with pure joy like, \"I can't believe they did that!\" but oh they do, from Spider-man losing grip on his powers, to losing friends and gaining enemies, to accepting the fact that he shouldn't be the web slinger any longer (*hint\" the \"rain drops  keep fallin' on my head\" sequence was perfection). Everything about Spider-man 2 shows a flawed character trying to live his own life. Toby Maguire's Peter Parker is a character we can all relate to. Whether he's struggling with old demons from the past, working with love all the while dealing with criminals on a daily basis, trying to make his own life by going to school and working, and dealing with, quite possibly, the most legendary and sinister Spider-man villain of all time. Anytime you think you've got it hard take a step into this man's life and you'll witness hard. The movie is sad, joyful, funny, loving, and full of life! It feels like a movie actually touched by human hands. It seems Sam Raimi's main focus was character development, an excellent story, excellent perfomances, and character. All which are nailed all too perfectly. But this does not take away from the action, which is beautifully shot, fantastically created, and perfectly executed. The action in this flick will keep you on the edge of your seat and keep you chearing, it's a modern epic, and what a sure super hero film should be all about."}, {"rating": "9", "text": "This is even better than the original! The acting is still up to scratch, the visual effects are much improved and it has a deep emotional focus that never goes insipid at any point. Alfred Molina as Doc Ock HAS to be one of the greatest villains of all time. It's less cheesy than the first, but that doesn't mean it's not cheesy at all. Still, nonetheless, this and The Dark Knight are the best superhero sequels of all time."}, {"rating": "9", "text": "Spider-Man 2 and Sam Raimi take the video game approach to sequels and I say this in the best possible way. All he really does is take what he did so well in the first one and build on it, with a snazzy new villain (played to perfection by Alfred Molina), subtle progression of the main characters and overall a story that is about as fun (if not more so) as the first film. Its a great popcorn film with some thrilling set pieces (especially the segments involving the train). It isn't timeless (I don't know a superhero movie that is) but its great, really great. Peter Parkers journey seems realistic in its progression (given the whole radioactive spider of it all) with the relationships between the characters being the main draw of the film despite the brilliant action. The dynamic between Peter and Mary Jane (Kirsten Dunst) or Peter and his aunt are engaging with the latter bringing some serious emotions out that had been stored up since the first film. Its a great next step in a story I think will only get better.........oh wait its Eddie Brock."}, {"rating": "10", "text": "After a long break, from writing reviews for movies, I've decided to start out with Spider-Man 2. Spider-Man 2, the best in the series. I've just finished seeing it, for like the 3rd time. There are not a lot of movie sequel that improve the non-sequel version. Spider-Man 2 is definitely not in that category. Even though I was really impressed about Spider-Man back in 2002, when it broke all records, Spider-Man 2 raise up to its level and in some areas even surpassed it. I'm not going to give you any spoilers on the movie, not really my style. But I will say this, the story line, the characters raise up to their full potential. It's not just action followed by more action, its something more, it impresses in every area of movies. Breathtaking moments, action packed fights, great development in the story, everything to make you see at least once...So, hope you enjoyed :) my personal opinion on 2004's Spider-Man 2. (10/10)"}, {"rating": "10", "text": "This film goes far beyond just a superhero movie, in fact, it can be called a movie treasure. Spider-Man 2 improves tremendously over its predecessor with a storyline that immerses the audience on a deep emotional level, supplies plenty of good humor, and brings a fan favorite villain to life in an exciting fashion. Not only is Spider-Man 2 the perfect superhero movie, but it's also the set standard on how a great movie should be made in the first place. This also happens to be my favorite superhero movie, and one of my favorite movies of all time, with an entertainment value for ages to come."}, {"rating": "10", "text": "The best way to describe this Spider-Man: More action and more fleshed-out characters. Doc Ock was a great choice for the villain and Tobey Maguire is great here."}, {"rating": "10", "text": "Rarely does a sequel come along that it better than the already-great first movie, with more action and a better story. But screw movie logic, Spider-Man 2 does it anyway."}, {"rating": "10", "text": "This was a great movie and my second favorite Marvel movie next to Iron Man! This was the only Marvel movie I've ever seen where I've actually liked the ending! I can't say anymore than that without spoiling something so Nuff' said!"}, {"rating": "10", "text": "What can be said about \"Spider-Man 2\" that hasn't been said yet? Well, opss! It has already been said: It's the best Spider-Man movie to date. Everything from the deeply emotional relationship between Peter and Aunt May to the mind-blowing action is a delight watching. Full review soon.\r :D"}, {"rating": "10", "text": "Easily the greatest Spider-Man movie ever created in the history of ever. Seriously, go see this movie. Everything about this movie is absolutely perfect, I cannot imagine a greater superhero movie. A combination of an all-star cast, perfect acting, and action scenes that will rock your socks make this the greatest super-hero ever made, and the greatest superhero movie that will ever be made. Except for maybe X-Men: Days of Future Past, which blows this movie right out of the water. Seriously, go see X-Men: Days of Future Past. It is literally a perfect movie."}, {"rating": "10", "text": "One of the best superhero movies ever and the best Spider-Man movies ever,with one of the best villains ever: Otto Octavius alias Doctor Octopus.An epic movie."}, {"rating": "10", "text": "Most relatable superhero ever. And one of the best protagonist of all time."}, {"rating": "10", "text": "Spiderman 2 is not only better than the first but it succeeds expectations from its time and holds up very well. Spiderman 2 is still easily a masterpiece and is without a shadow of a doubt one of the best superhero movies ever made right up there with TDK and Infinity War. The action is a major improvement as the train scene is still not only the best action scene in any Spiderman movie but is one of the greatest action scenes in any comic-book movie. The acting again from everyone is solid. Doctor Octopus was a fantastic villain that taught many themes and lessons that can be used in the real world and the way he sacrificed himself to save the world was very well done. Again just like the first, the directing is very good and the music is perfect for conveying emotion. Finally Spiderman 2 features one of the greatest stories in any comic-book movie as the Spiderman No more arc in my opinion is the best part of the film. It really fleshed out Peter Parker and makes him a very likable and relatable protagonist. I do have one problem with this movie and it is that MJ can be a very unlikeable character at times but overall I didn't think she was that bad. Anyways very good movie and it for sure deserves a 10/10."}, {"rating": "10", "text": "Great movie, great and interesting history, the relationship between Peter Parker and Mary Jane is good, good action scenes, the film shows the problems and responsibilities of Peter Parker, shows that it is not a super invincible hero."}, {"rating": "10", "text": "La mejor película de Super Héroes de todos los tiempos. Spider-Man 2 es mejor que su antecesora en todos los aspectos, los efectos especiales son increíbles, las actuaciones siguen siendo excelentes y sobre todo, Alfred Molina ofrece un excelente villano y de lejos uno de los mejores vistos en cine. La historia de esta segunda parte es asombrosa, divertida y dramática a la vez , violenta y oscura sin dudarlo, pero sobre todo, ofrece un mensaje único y conmovedor. Ah, olvide mencionar que esta película tiene una de las mejores secuencias de acción que eh visto en mucho tiempo, la escena de Spider-Man VS Doctor Octopus en el tren es épica, brillante y emocionante.\r Repito: Es la mejor película de Super Héroes que eh visto en mucho tiempo, si hacemos un TOP, detrás de Spider-Man 2 le sigue Iron Man y Ant Man"}, {"rating": "10", "text": "el hombre araña 2 es un 100% maravilla  aun mejor que su procesedor y una de las majores peliculas de marvel comics basadas en spiderman junto a su precuela"}, {"rating": "10", "text": "This is obviously one of the most memorable movie during my childhood. I watch both 2 and 2.1 and the plot was just so damn good, it gave you extreme pulse racing visuals that really let you see through his eyes, Spider Man's personality is one anyone can literally become apart of. The action scenes are actually very realistic, I enjoyed that the producers actually put Peter in realistic situations that just always pushed the limits of his possibilities.This film made him one of my favorite super heroes, I wish they used this same type of creativity in the new films."}, {"rating": "10", "text": "One Of The Best Superhero Movies Ever MadeSpider-Man 2 isn’t only better than it's predecessor, It’s one of the best Superhero movies ever made."}, {"rating": "10", "text": "This is the real Spider-man ! Not Homecoming !Every aspect of the movie is on point,just like the 1st one!"}, {"rating": "10", "text": "You're not a real Spider-Man fan if you haven't watched this. I'm a true fan and I've watched it more than 10 times ..."}, {"rating": "10", "text": "Sequels usually have this thing where they end up being total garbage compared to the first, but surprisingly, Spider Man 2 was on point. Same quality, same amazing plot, and same award-winning performance by Tobey Maguire."}, {"rating": "10", "text": "Definitely a fan's dream-come-true! Studios of today should take notes from films like this if they want to produce a successful superhero film."}, {"rating": "10", "text": "One of the best super hero movies ever made. The first movie was great, but somehow this movie is better in every way possible. A better villain, better action, better choreography, and more emotional story make this the ultimate viewing of your friendly neighbourhood Spider-Man."}, {"rating": "10", "text": "Best Spider-Man movie,one of the pioneers of today's superhero movies.The action scenes are amazing and the villain (Doc Oc) is the best thing on the movie"}, {"rating": "10", "text": "Most overrated superhero movie in existence. This movie does not hold up at all."}, {"rating": "10", "text": "Spider-Man 3 is the Lawrence Of Arabia of the superhero movies world. It is epic, sprawling, magnificent, meaningful, beautiful. Anyone who doesn't enjoy this movie must be a pretty spoilt brat or a cynical old misery. For near on three hours it envelops you in its world and makes you CARE about the characters. How's that for a special effects laden blockbuster, a movie with characters that matter? The comedy works, the emotion works, the action works. Everything Raimi tries comes off. The set pieces are particularly astounding, ranging from an out of control crane to Spidey's numerous battles with the meaty villains on show. Like others, I think this is by far the best of the three (though I loved the first two as well). It's a modern-day classic, an enrapturing fantasy that exhibits all that's best in modern movie making. An experience not to be missed."}, {"rating": "10", "text": "This film is a masterpiece. If you don't believe it, ask these critics and IMDB fans alike. The division is what creates brilliance. Heck, there was even division among Bobby and Babel, and even among Queen. This film is certainly better than the first two (with Babel being like \"Crash\" the lite version), and is on a par with Queen. This film is a masterpiece. Just go ask IMDB fans."}, {"rating": "10", "text": "In my opinion one of the best superhero films ever, has excellent visuals, writing, story, acting and music."}, {"rating": "10", "text": "Spider-Man 2 improves upon the original in every possible way. It's truly a sequel that not only rivals but I feel even tops the original and that is such a rare thing nowadays."}, {"rating": "9", "text": "A deeper movie than the first, not just about the cool action sequences, but about life, love, loss, and grief. The sequel outshines the original movie, which focused on the beginning, while in 'Spider Man 2', the pathos is more pragmatic and conveys some emotion, which few action movies do. The acting, specifically the complexity of Alfred Molina, is natural and doesn't come off as blatantly campy. The effects are cool, the direction is spot on. Hardly anything to complain about."}, {"rating": "10", "text": "This may be a very personal opinion, but I think \"Spider-Man 2\" is the best superhero film ever made, so far. It's slightly superior to the original on every way.  Also, Doctor Octopus as a villain, he's the best. And, if there's one character more important or better than Spider-Man himself, that's Peter Parker. You get to know Peter's feelings and personal troubles so well that by the end of the film you end up caring not only for him, but also for his family, friends and acquaintances. And that is the definition of a perfect movie."}, {"rating": "10", "text": "While this the first one had a light tone and an emphasis on fun, this movie was able to surpass the first one in quality and enjoyment while having a much darker and serious tone. The cast still does a fantastic job and Dr. Octopus is the best Marvel villain to date. His character is incredibly well developed, emotionally resonant and interesting. The story is very coherent, thrilling and heartfelt. This movie is a superhero film masterpiece. Every single aspect of this movie, every beat, every character, every action scene, every CG effect and every story arc is perfectly on point and how it should be. There is absolutely nothing wrong with this film, a gloriously smart blockbuster by Sam Raimi. The best Marvel movie ever."}, {"rating": "10", "text": "Spiderman 2 is my favourite comic book film mainly because the performances are top notch the story is intriguing the action is exhilarating the characters are very well fleshed out ugh I love this movie!!!."}, {"rating": "8", "text": "Still the greatest Spider-Man movie to date. Filled with great action, heart, emotion and a complex story that really does make you feel for Peter. The movie does suffer from poor dialogue between MJ and Peter. This movie has one of the greatest action sequences in a comic book movie, the Train sequence. 8.5/10"}, {"rating": "9", "text": "The Godfather II of Superhero movies. The action scenes are so complex and spectacular. Tobey Maguire is brilliant as Peter Parker, who goes through his most challenging character arc yet. Molina steals every scene he's in as Doc Oc. Didn't get a 10 because some of the cgi dates the film."}, {"rating": "9", "text": "Removing some moments that are ridiculous nowadays, Spider-Man 2 stands as the best spiderman movie and one of the best superhero movies."}, {"rating": "10", "text": "Spider-Man 2 is one of my favorite films of all time and is the first movie I saw in theaters. This is a film that feels much more than a comic book movie, it's characters are much more fleshed out the film has a great villain, Alfred Molina nailed his performance as Doctor Octopus, J.K Simmons back as J. Jonah Jameson, and for me this film feels like it has the most polished directing in the Trilogy. And this film has some of my favorite action set pieces in any comic book movies especially that Train Scene and the hospital scene this film also has some great comedic moments. This again I agree with being on of the greatest comic book movies along with The Dark Knight and Logan. This film with it's many great action moments and great comedic moments is fun, I recommend that you go and see this film right now, you're gonna have a great time"}, {"rating": "10", "text": "Perfection. All around a huge improvement on the already great first entry in the series. The definitive Spider-Man movie including one of the best Marvel villains ever put on screen.  Amazing movie."}, {"rating": "10", "text": "Spider-Man 2 is the Best Spider-Man Movie Ever, It Has Perfect Visual Effects and CGI, One of the Best Villains in Movie History, The Best Fight Sequence in Any Movie, and a Well Told Story, Spider-Man is the 2nd Best Superhero Movie Ever."}, {"rating": "9", "text": "This is a classic, definitely my favorite Sam Raimi Spider-Man movie, better than the first in every way possible, more action, better characters and pretty good writing."}, {"rating": "9", "text": "An incredible movie and must see for any superheroes fan and still to this day (2019), the greatest superhero film I’ve seen to date. It put me close to tears at how such an amazing film came out of a superhero I have zero F’s about. It isn’t just mindless action like these other superhero films of that time and now, all these characters have deep motives and understandable ideologies with some straight up heart-touching performances.This holds the golden standard of how a superhero film should be and strive to be. None of these MCU films have even come close and certainly not that homecoming movie."}, {"rating": "9", "text": "Spider-Man 1 was already amazing, but Raimi blew Spider-Man 1 out of the water with this movie. This movie has a lot more emotional scenes, improved action scenes and the special effects hold up to this day. I am not afraid to say that this is one of the best movies ever made."}, {"rating": "10", "text": "It was amazing to see what they did to Harry's character. He went from being Peter's best friend to mortal enemy. I can't blame him though cause what do you expect would happen if you found out your best friend was the one who killed your father?"}], "recommendations": ["spider_man_into_the_spider_verse", "man_of_steel", "the_amazing_spider_man", "spider_man_far_from_home", "x_men_days_of_future_past", "spider_man_homecoming", "spider_man", "thor", "captain_america_the_first_avenger", "superman", "spider_man_no_way_home", "superman_returns", "the_dark_knight", "war_for_the_planet_of_the_apes", "black_widow", "iron_man", "hulk", "spider_man_3", "creed", "doctor_strange", "terminator_2_judgment_day", "top_gun_maverick", "conan_the_barbarian", "rocky_balboa", "how_to_train_your_dragon_2"]}