{
  "id": 4542,
  "title": "The Witches",
  "starring": [
    "Jasen Fisher",
    "Mai Zetterling"
  ],
  "runtime": 91,
  "genre": [
    "Adventure",
    "Fantasy",
    "Horror",
    "Comedy",
    "Family",
    "Mystery"
  ],
  "description": "A young boy named Luke and his grandmother go on vacation only to discover their hotel is hosting an international witch convention, where the Grand High Witch is unveiling her master plan to turn all children into mice. Will Luke fall victim to the witches' plot before he can stop them?",
  "releaseYear": "1990",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mPYBjVkeHakkPGY7WaKyyNU4RWm.jpg",
  "categories": {
    "plot": 4.777777777777778,
    "acting": 5.75,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 6.6,
    "funny": 6.666666666666667,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "I guess I should congratulate on Hathaway becoming the next Nicole Kidman. If she is the star of the movie, then it is not good. Kidman figured out how to accept \"character\" roles. We will see if Hathaway can manage a similar transtion. In regards to this movie, I must admit I had to start fast forwarding."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)Two of the \"tres amigos\" join Zemeckis for another of their films more full of politically correct metaphors than emotions, with the reproposal of the Hathaway-Tucci pairing that makes one believe to a watered-down sequel to the already indecent \"The Devil Wears Prada\" (Frankel 2006)."
    },
    {
      "rating": "1",
      "text": "I haven’t had this much fun since my appendix burst on a flight to Monte Carlo at 3am.Another example why remakes shouldn’t be made. Truly, truly awful."
    },
    {
      "rating": "3",
      "text": "Let me just say this... no one can top Anjelica Huston. Anne Hathaway did not do the character justice"
    },
    {
      "rating": "0",
      "text": "El 2020 parece lindo a lado de esta horrible película. Muy aburrida, de baja calidad y las actuaciones muy pésimas, a pesar de tener un gran elenco."
    },
    {
      "rating": "0",
      "text": "This movie was terrible!!! Not only do they use Chris Rock to narrate which was unnecessary and not the best choice, but they also moved the location of the story completely. This version had less of an impact to feel for the kids turning into mice than the original. There are a couple of things I did like about the movie, the mixture of the cast , and some of the actors . Would I recommend this movie..\"NO\", but would suggest watching the original. Not every movie has to be Americanized"
    },
    {
      "rating": "2",
      "text": "I don't see how even the cast and crew of this remake can possibly think this comes even close to the original. The only reason I even gave it 2 stars is for Roald Dahl. This remake ended the way the book ended, with the children staying mice.  The original movie had a happier ending where they were turned back into human by a witch that had turned good.  I much prefer the happier ending of the original movie myself, but Roald Dahl hated it, he wanted it to end with the children staying mice because that's how he wrote the book.  I read that he even stood outside some theaters trying to talk people out of going into see it.  So the only reason I'm giving it 2 instead of 0 is for Roald Dahl (may he RIP), even though most people probably prefer the original, he may have preferred this remake."
    },
    {
      "rating": "0",
      "text": "The original Witches movie was as good an adaptation of Roald Dahls book as it could have possibly been. Great direction and a fantastic cast, in particular Angelica huston who was superb as the grand high witch. Why anyone thought this needed a remake i don't know.Why take the setting of the movie to Alabama?!! or the U.S in general? why do we feel the need to Americanise everything?! Everything about this horrible remake is awful, the cast are bad and over act to a ludicrous degree and all the creepiness of Dahls writing has been replaced with a Disney like sugar coating. As a huge Dahl fan it's hard to put into words how bad i think this film is.."
    },
    {
      "rating": "0",
      "text": "I feel like watching this movie was the worst thing to ever happen to anyone perhaps ever"
    },
    {
      "rating": "0",
      "text": "I love Anne Hathaway but.  I'm sorry. This movie was trash.  I put the original one on right after, so my kids didn't remember that garbage."
    },
    {
      "rating": "1",
      "text": "I have no words to describe how terrible this movie was. Anne Hathaway was the wrong choice for this role! Her accent is so bad and at times it breaks into American. Awful is the only words I can describe this mess. The special effects are pretty bad too - seems like a low budget film. Maybe they used all the budge on Anne fee!"
    },
    {
      "rating": "3",
      "text": "A soulless remake that may be too frightening for kids and too dumb for adults. The lack of charisma in the young actors and the overuse of CGI makes the previous film superior on every level. The only good thing about this movie is the presence of Hathaway and Spencer, whose scenes are the funniest. There's also an important racial subtext at the beginning, but Zemeckis and del Toro don't develop it further."
    },
    {
      "rating": "6",
      "text": "Having never seen the original film, I can say, in my humble opinion that this isn't a bad movie by any means. Anne Hathaway is great as is Octavia Spencer and while its far from Zemeckis's best film, it works as a family comedy.On the negative side, I wasnt a fan of some of the screenplay decisions that they made and I found it odd that they gave the witches Ectrodactyly hands and feet and did it with low budget B-movie CGI. Still, if you are in the mood for a family comedy with a dark mood then give it a try."
    },
    {
      "rating": "5",
      "text": "Although they brought representativeness and modernized the film, it still has the air that something else was missing. Because it is a remake, it should at least be good in relation to the original, but this film is dispensable."
    },
    {
      "rating": "4",
      "text": "Although countless people see this as a remake and not as a new adaptation, it's true that it's inevitable to compare it with Nicolas Roeg film, and unfortunately for this one, in that comparison it loses out.This new version by Robert Zemeckis is aimed at a child audience, like the first one, and I think that in that regard kids will enjoy it as those who enjoyed the 1990 film.However, if you take a closer look at what this film does wrong, you will realize that it far outweighs what it does well.And it is that Zemeckis abandoned the virtues of a strong narrative long ago and changed them for the visual impact and he makes that mistake again here.The film feels artificial, from the performances to the sets.Like a cartoonish world, unable to captivate or immerse you in its tonality.It doesn't risk anything and that same passivity is what makes it a film that perhaps can entertain the little ones for a while, but for any movie fan over 15 years old, there's nothing to rescue here."
    },
    {
      "rating": "10",
      "text": "The movie was fun and exciting to me. In my opinion, Anne Hathaway did a marvelous job of portraying her character. She is such a brilliant actress that is so talented. To me, the movie was very exciting and worthy of applause."
    },
    {
      "rating": "10",
      "text": "This movie is definitely going to be in our Halloween collection every year. My 5 year old son loved the movie, and I enjoyed it as much as well. Such an entertaining movie! Love it."
    },
    {
      "rating": "10",
      "text": "Thi movies is so good. I love this movies because the Grand High Witch changed Hero Boy to the mouse and Bruno too."
    },
    {
      "rating": "7",
      "text": "I braced myself for a poor adaptation but I was pleasantly surprised, I'd like to think Dahl would be fairly happy with this especially if it makes more kids read the books. Lets not sugarcoat the original too much, changes were made from the source material which even as a kid I wasnt happy with. But this is a fun film, kept me engaged.  Hatherway obviously had a great time filming and it shows, and Octavia Spencer was the standout.  CG is occasionally  meh however the film looked gorgeous,  I didnt mind the transfer to America as its general themes run true wherever you base the plot."
    },
    {
      "rating": "7",
      "text": "Though this film rushes the good bits of the original (and the book) there is something in its ability to be slightly original. The main problem though is there isn't really a lot of character development, rather a focus on special effects. I see the target audience as young children."
    },
    {
      "rating": "10",
      "text": "Anne Hathaway did an amazing job! I love the cast! They brought the characters to life"
    },
    {
      "rating": "7",
      "text": "Los efectos especiales son pésimos, la caracterización de las brujas es desconcertante y Anne Hathaway fue excesivamente sobre actuada, pero aún así es una película muy divertida, las generaciones que crecieron con la película de 1990 posiblemente la odiaran, pero a los niños de hoy les podría encantar, a mi con todas sus pifias me pareció muy divertida."
    },
    {
      "rating": "10",
      "text": "Anne Hathaway always delivers, so it's no surprise that the movie was good. I'm not sure if it matches the original, although I may be blinded by nostalgia (as many of the negative reviews are) but it is a good adaption of the source material that will expose a new generation of kids to check out Roald Dahl books and media, as the Dahl movies in the 90s did."
    },
    {
      "rating": "10",
      "text": "It was super cute! Anne Hathaway is super scary, she does a great job. I can see how kids might even find this scary! Feel good Halloween movie."
    },
    {
      "rating": "10",
      "text": "Amei, o filme a equipe e o elenco estão de parabéns ficou ótimo mesmo, muito bom"
    },
    {
      "rating": "8",
      "text": "Feels weird to watch a children's movie tailor-made to scare the crap out of them. Actually, upon reflection I'm amazed at how many horror flicks were designed with kids in mind. From Gremlins to Coraline and pretty much everything from Tim Burton, apparently watching something with the potential to give you nightmares is fun regardless of your age. And let me tell you parents, you're definitely risking your son and/or daughter's sleeping pattern with this one.The titular witches are terrifying in their disgusting, monstrous true forms. Not even Anne Hathaway's figure flattering dress and ridiculous, yet very committed performance can make her any less unsettling to look at when she loses the wig and gloves. Personally, I don't think I would have been able to handle this growing up.In order to keep things from getting too frightening for the target audience, the film balances the more hair-raising stuff with plenty of silly humor. There's a whimsical, escapist tone running throughout even during the darker moments that keeps things from ever getting too serious or intense and crossing over into the realm of adult-oriented entertainment. Perhaps too much so during the second half. The movie starts off with the perfect amount of fantasy and fairytale vibes. There's a strong emotional component that allows you to sympathize with and get invested in the young protagonist and his grandmother, with hints of race-related social commentary going on in the background. As soon as the first person gets turned into a mouse though it all starts to get steadily more over-the-top before devolving into a full-blown farce by the end.Yet, its worse flaw is Chris Rock's narration. His unbelievable old southern man accent only served to make me question how I could have possibly failed to notice he can't act before now. Outside of that there's not much too complain about. So if you've ever wanted to help ensure your future cinephile(s) enter adulthood with a healthy appreciation for the horror genre this will make for a nice building block. You may want to start with something tamer like 2015's Goosebumps, but regardless of when you get around to showing this to them I'm sure you'll find it to be petrifying fun for the whole family.8.3/10"
    },
    {
      "rating": "7",
      "text": "It isn't a GREAT movie, but it will be an  awesome movie for kids, which is all the movie is going for."
    },
    {
      "rating": "7",
      "text": "Didn't expect it to be that good. Zemeckis is an overrated film master that does not get enough credit. The film is a good vehicle for the two ladies and a joy to watch and to have fun with."
    },
    {
      "rating": "6",
      "text": "Okay movie with okay performances.  Overall with a ploy that should be serious, the filmmakers make it really silly."
    },
    {
      "rating": "6",
      "text": "Another high budget adaptation of a children's book. Zemekis chooses to focus on sweeping 3d camerawork and digital visual effects throughout the movie. Sadly there is something lacking in the small changes to the setting and plot that take away from the flavour of the original book in my opinion. Octavia is fantastic throughout but Chris rock as the grown narrator felt like mis casting to me. Minor gripes aside it was a fun 'switch off' and watch film."
    },
    {
      "rating": "5",
      "text": "So many well written but bad directed movies available for a remake and Hollywood keep choosing plenty of good ones with the same result, worst than the original !!"
    },
    {
      "rating": "10",
      "text": "Es muy difícil superar la película Clásica, pero supieron como llevar la historia muy bien, si bien no logra ser tan buena como el clásico, no está nada mal."
    },
    {
      "rating": "3",
      "text": "This is a hot mess of a movie that is fundamentally rotten at its core. Firstly, the story is clearly suited to children, especially around 8-12 yo, however they have overlayed an almost horror-esque SFX take that is actively disturbing rather than suggestively scary. Then there Anne Hathaway's character - possibly the worst acting I've seen (and making me think she was entirely a CG actor... please learn how to do accents). Finally there was the overall structure of the movie... it was just cartoonish to the point of absurdity. The fact this is based on a Dahl book doesn't matter - it's a horrible movie, and one I think was more scarring to our kids in an almost sadistic and creepy way. This was a huge missed opportunity..."
    },
    {
      "rating": "5",
      "text": "The Witches can't help to fall too short of its predecessor, a lot more CGI, and better video quality is not always the answer.The film takes the job to remake a classic and we can see a clear tribute and almost obligation to follow the earlier, but what happens when all that there is to offer is a few visual improvements on the ones that everybody loves (or fear)? The Witches came from good intentions but it stays there, just an homage to the classic and nothing more."
    }
  ]
}