{
  "id": 3026,
  "title": "The Bone Collector",
  "starring": [
    "Denzel Washington",
    "Angelina Jolie"
  ],
  "runtime": 118,
  "genre": [
    "Drama",
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "description": "Rookie cop, Amelia Donaghy reluctantly teams with Lincoln Rhyme – formerly the department's top homicide detective but now paralyzed as a result of a spinal injury – to catch a grisly serial killer dubbed 'The Bone Collector'. The murderer's special signature is to leave tantalizing clues based on the grim remains of his crimes.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4HiIegmRMV147NDLAEhXI8duho.jpg",
  "categories": {
    "plot": 4.875,
    "acting": 4.1,
    "ending": 4.2,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Very dumb climax - the motive for a long series of complex murders is absolutely unsustainable"
    },
    {
      "rating": "3",
      "text": "Isn't there some rule of writing whodunits that says you never introduce the culprit as a random nobody in the last act? There are times when breaking the rules works fantastically well; this was not one of those times. An abysmal waste of Denzel Washington second only to 'The Equalizer'."
    },
    {
      "rating": "2",
      "text": "A one-time thriller that is tiring and was clearly poorly done and poorly written. Only Angelina and Denzel's performance can be saved.This film focuses on the figure of Lincoln Rhyme, a prestigious former forensic investigator who withdrew after an accident in service that left him quadriplegic. Sick but far from invalid, he remains a valuable ally of the New York Police, who seek to consult him in more difficult cases. This happened when street police Amelia Donaghy found a body in an unusual crime scene, carefully staged to leave messages about a new murder yet to be carried out. Unable to move, Rhyme will use Donaghy's eyes, ears and police skills to investigate the crime without leaving home.Okay, we've seen a lot of similar things since there are literally a lot of movies focused on police investigating killers who want to be discovered and leave messages on their crimes. But the problem with this movie is not the lack of originality, but the laziness, sloppiness and illogicality of the whole story. Never could a former police officer conduct an ongoing investigation, and even if that were possible, he would never do so from his own home (to give an example of the illogic I referred to). The whole investigation, including Jolie's crime scenes, sounds fake and forced, with evidence coming out of sheer luck or because the character happened to recall a fact that later becomes relevant. But if we are able to ignore or lessen this, the movie will roll all the way to the end ... that's when things really get off track for one of the worst endings I've ever seen in a thriller movie. Pure non-sense.Ultimately, it is the satisfying work of Denzel Washington and Angelina Jolie that saves the movie from being truly evil. The two actors are two lost pearls in this movie, never having the space or material to reveal all the potential they undoubtedly have. The supporting cast gives some strength to both actors but also has no space or material to substantially improve the film. Technically, it is a regular movie, which does not stand out for the positive and even has badly filmed scenes so dark that they become unpleasant to look at.In short, this movie is a poor and careless thriller, made without the care it should have had. I'm sure Angelina and Denzel won't have fond memories of him. It's a one-time movie, falling into oblivion after seeing how bad it is."
    },
    {
      "rating": "6",
      "text": "I love the actors/actress in this movie, especially Denzel Washington, but the movie itself, the story is terrible. I guess this is supposed to be a thriller, but when I watched it, it felt more like comedy, so bad and so unrealistic that it's funny, there were times when I couldn't stop laughing, add some good acting and this movie is definitely watchable"
    },
    {
      "rating": "7",
      "text": "\"Destiny is what we make it\" - Lincoln Rhyme.\r I expect to be a great movie..but is disappointed.Great Actors...but a \"meh\" story and so boring.\r ."
    },
    {
      "rating": "4",
      "text": "The Bone Collector refuses to create fun, thus makes bone collecting in general look insanely boring and I can tell you that any bone collector would never say that."
    },
    {
      "rating": "5",
      "text": "'Bone Collector': A Taxi Ride to Torture Provokes a Chase!\r Since movies keep pushing the envelope of the acceptably gruesome, even the nastiest sights glimpsed in Phillip Noyce's preposterous thriller \"Bone Collector\" should strike jaded moviegoers (those who relished \"Seven,\" for instance) as ho-hum shocks.\r A woman found shackled in the bowels of New York and cooked alive by scalding steam resembles a giant oozing radish. A young man, also held underground in shackles, is discovered covered with squirming rats that, when dispersed by a gunshot, reveal his greedily picked-over body.\r Near the end of the film, during a life-and-death tussle, one character sinks his teeth into the jugular of his attacker and emerges looking like a vampire with unusually sloppy table manners.\r These unsettling moments have become par for the course in a modern horror thriller. And \"The Bone Collector,\" which stars Denzel Washington as a brilliant forensic detective tracking down a serial killer who leaves elaborate clues near his victims' bodies, is an efficient purveyor of such stock genre jolts.\r In addition to corpses and gushing veins, those jolts include the usual false alarms: harsh musical clangs, slowly turning doorknobs and menacing shadows. There is even one glowering, character whom the movie blatantly manipulates us into assuming is the culprit.\r The killer meets his victims in a way that should tap into a paranoid New Yorker's worst nightmares. He picks them up in a taxi, at the airport or Grand Central Terminal, locks them in his car and speeds off into the middle of nowhere.\r Most find themselves strung up in deserted turn-of-the-century slaughterhouses and abandoned subway stations that resemble medieval torture chambers.\r Although there is nothing remotely believable about this drawn-out cat-and-mouse game of a movie crossed with a whodunit, that's almost the point. \"The Bone Collector,\" adapted from a novel by Jeffery Deaver, is a cinematic game that might be called Urban Creep Show, New York-style, and its rules are comfortably predetermined.\r We can be pretty sure that the hero, Lincoln Rhyme (Washington), a detective who has been a quadriplegic for four years and suffers from seizures, any of which could reduce him to a vegetative state, will outwit the demon killer.\r The gimmick is that Lincoln can solve the case without budging from bed. Using a computer and an illuminated viewing screen to pore over the evidence, he is able to make impossible, lightning-quick determinations about where the next victim is likely to found.\r Communicating by cell phone with Amelia Donaghy (Angelina Jolie), a beautiful young police officer (and former model) whom he has drafted as his assistant, he instructs her on what to look for at the crime scene and how to handle the evidence.\r The role of Lincoln is a piece of cake for Washington, who departs from his customary Boy Scout mode to display matching streaks of imperiousness and cunning. The film revels in close-ups of Washington's handsome face, whose glinting eyes and dazzling teeth do a seductive duet.\r The camera is even more enamored of Ms. Jolie, with her impossibly sensual lips and eyes that brim with a soft melting fire. In sheer smoldering screen charisma, Ms. Jolie has every other young Hollywood actress beat hands down. Whether she can really act remains to be seen.\r Because Lincoln is a quadriplegic, the film suggests that there is little hope of a sexual relationship between him and Amelia. But in the same way that it delivers jarring false alarms, the movie suggests an unacknowledged erotic heat between its stars. Unlike so many other screen couples nowadays, these two have chemistry."
    },
    {
      "rating": "3",
      "text": "Tout cela est un peu ballot, car la base d'un bon polar est là, toute proche, il suffit d'arranger le tout justement, au sens le plus éthymologique : de façon juste et ordonnée.Bien sûr, Bone Collector nous impose ce jeu de piste à remettre dans le bon sens et les acteurs s'activent comme des fourmis à reconstituer le puzzle comme dans un épisode de l'une de ces innombrables séries américaines où l'on se fait chier à suivre les zouaves qui suivent les **** cailloux laissés par le très vilain tueur psychopathe. Un peu comme cette longue phrase qui impose de suivre et poursuivre sa lecture jusqu'à la fin pour en comprendre toute la teneur et toute sa finalité même si sa conclusion n'apporte pas grand'chose de neuf, contrairement à ce que l'on pouvait espérer. Plutôt énervant, non ?Bien que réalisé très correctement, le film nous impose ce petit jeu qui nous ennuie jusqu'à cette fin (enfin !) qui tombe comme un cheveu sur la soupe : tout ça pour ça ? se demande-t-on. Mais de qui se moque-t-on à la fin ?... Denzel très paternaliste dirige tout de son plumard, suivie par Angelina aux ordres, très jolie, la bouche en coeur. Elle pleurniche aussi de temps à autre, c'est Angelina quoi. Et Denzel même coincé sur le pieu est un héros héroîque qui triomphe du vilain méchant psychopathe, très énervé parce qu'on a pas remis de rouleau de pécul dans le dérouleur.Bon, enfin, bref."
    },
    {
      "rating": "6",
      "text": "This is one of those movies you wake up to after the prime-time is over. It's not really bad or anything, it's just a pretty standard crime-drama with a feisty cop with daddy issues and a guy who got crushed by a 2 ton block of cement and now can only movie his head appropriately."
    },
    {
      "rating": "6",
      "text": "While the story was interesting, the acting was okay and the ending was entertaining, the movie was very cliché, predictable and even boring at times. The Bone Collector is not a bad movie, it's just very average."
    },
    {
      "rating": "6",
      "text": "The Bone Collector is a classic thriller from the 90s. The only thing here, although they tried to make a strong and courageous main character, were completely mistaken in the actor. Angelina Jolie is too weak an actor to play such roles. If the same Julianne Moore or Sigourney Weaver starred here, then the film would be perceived differently. And so this is a good thriller, but no more. The story twist worked for me."
    },
    {
      "rating": "5",
      "text": "A rather predictable and quite dull crime thriller. Even Washington & Jolie can't save this movie and it's lacklustre screenplay."
    }
  ]
}