{"id": 1266, "title": "The Mortuary Collection", "starring": ["Clancy Brown", "Caitlin Custer"], "runtime": 108, "genre": ["Fantasy", "Horror"], "description": "In the phantasmagorical town of Raven's End, a misguided young girl takes refuge in a decrepit old mortuary. The eccentric undertaker chronicles the strange history of the town through a series of twisted tales, each more terrifying than the last, but the young girl's world is unhinged when she discovers that the final story... is her own.", "releaseYear": "2020", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/5WXeYnezavNI6hXH74aQYv6yFzj.jpg", "categories": {"plot": 8.0, "acting": 8.0, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This is a solid horror film with fantastic set design, brilliant cinematography, solid acting and a genuinely creepy feel to it. Each of the stories is unique and disturbing in its own right. Unfortunately the ending is sloppy and rushed and much about it makes no sense. Its supposed to end where is began, as we see the small paper boy talking to the new Mortuary keeper, but in the beginning he actually ran away from the house. It doesn't explain what he's actually doing inside there now. So much of it just seems sloppy and rushed. It leaves you puzzled as to why this new person is supposed to make such a valid new candidate for a keeper. All of her stories are similar after all. She kills kids and eats them. Was Montgomery a murderer himself? Is that how he ended up there? How were the burnt children able to climb out of the books and eat her? Why was there a horror film playing that was mirroring the events actually hapenning? Just a cute little gimmick? And young attractive women don't tend to be cannabilistic serial killers. It's like the Director tacked it all on and hoped for the best. It probably all makes sense and someone could explain it to me, but if I'm left confused that's just jarring. It certainly isn't obvious. Still, I loved this film."}, {"rating": "10", "text": "Must watch movie!!!!!!!!!!!!! It's so good. Any fan of movies will enjoy it."}, {"rating": "10", "text": "Honestly best horror anthology in a long while. Everything was amazing loved this movie 10/10 would recommend."}], "recommendations": ["ouija_origin_of_evil", "the_ritual", "you_should_have_left", "the_autopsy_of_jane_doe", "annabelle_creation", "the_boy", "the_woman_in_black_2_angel_of_death", "the_skeleton_key", "mama", "the_haunting_in_connecticut", "the_forest", "oculus", "the_witch", "scary_stories_to_tell_in_the_dark", "the_woman_in_black", "insidious_chapter_3", "dark_skies", "insidious_chapter_2", "the_conjuring_the_devil_made_me_do_it", "freaks", "a_cure_for_wellness", "dead_silence", "the_uninvited", "annabelle_comes_home", "it_follows"]}