{
  "id": 2357,
  "title": "The Babysitter",
  "starring": [
    "Judah Lewis",
    "Samara Weaving"
  ],
  "runtime": 85,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "When Cole stays up past his bedtime, he discovers that his hot babysitter is part of a Satanic cult that will stop at nothing to keep him quiet.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/86a7GRVRCwfl7wdI4QadyvKa6Zu.jpg",
  "categories": {
    "plot": 7.266666666666667,
    "acting": 7.4,
    "ending": 5.0,
    "soundtrack": 9.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.48,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I really enjoyed \"The Babysitter,\" probably alot more than I expected. Its a nice Black Comedy with a interesting story and fine characters with some pretty memorable situational comedy and dialogue lines. Its an enjoyable movie"
    },
    {
      "rating": "8",
      "text": "A fantastic comedic horror movie, once again showing how Netflix handily beats out the bigger movie companies.POSSIBLE SPOILERSThe story is pretty straight forward, a boy just entering teen years who is picked on by bullies and who is afraid of everything.Cole is surrounded by a lot of people including his parents who love him, but are distant. A close female friend that encourages and supports him. Then there is Bee, the babysitter who is attractive, smart and loves spending time with him. It is unfortunate that he is then surrounded by a satanic cult, and large tarantulas.The movie is fast paced. Shortly after you learn to like Bee, you learn to hate her about as much as Cole accidentally learns that Bee leads a Satanic cult, intent on drinking blood, praying to Satan and killing Cole.The Satanic Cult is priceless. I loved Max, the bad guy quarterback (played by Robbie Amell, first cousin of Stephen Amell who plays Arrow). John was also a great character, wanting sex, but screaming a lot when trouble happens. Unfortunately I wasn't as impressed with the two other women in the cult, not because they were bad actresses but because of their roles.I cannot express how much I loved Max being a murdering satanic cultist chasing Cole, who stops and shows Cole how to defend himself against bullies. I won't say anymore, but that scene is the high point of the movie for me.The movie is directed by McG, the same person that brought us Supernatural, and you can see his influence. The movie feels like something that could happen in the Supernatural world.The good: Everything about this was good. I especially enjoyed the back and forth between Cole and Max.The bad: That it was over in less than 90 minutes (actually that is probably good, they didn't let it drag).This just shows why I will almost always watch anything done by Netflix. Even with a few stinkers, Netflix usually supplies what I look for."
    },
    {
      "rating": "9",
      "text": "Super fun slasher film, nicely shot and with cool acting from all involved. Best part for me was the combination of comedy and horror. There's a hint of a part 2 and I really hope it will happen."
    },
    {
      "rating": "7",
      "text": "Finally the black comedy that Netflix deserves. Great humor and brilliant brutal scenes. Interesting characters and a lot of situational humor. Main character was annoyed by the little but the babysitter kicks ass."
    },
    {
      "rating": "7",
      "text": "good subject. Thanks McG to bring that to the attention of the public as it is very real and happening today. Thankfully are hunting and it wont stop now. It's still a great movie with a light tone 80s vibe (when these freaks used to make decent flicks) ...  :-)"
    },
    {
      "rating": "7",
      "text": "It's a bad movie but you will love it... at least if you are into horror-comedies. I was not expecting much from it but decided to click it on a night I was tired and wife was out and I had a great great time. It's not perfect, it's not even good. But it's awesome and sometimes this is the only thing that matters:)"
    },
    {
      "rating": "9",
      "text": "A fantastic movie. Entertaining, taps into horror and comedy in all the right places. Some epic scenes too. If you enjoy horror movies like Evil Dead or Ash vs Evil Dead then I think you will like this movie too."
    },
    {
      "rating": "10",
      "text": "I don't get all the hate this movie gets. It's not supposed to be taken seriously, it's more in the vein of classic bad b-movies, and it works great for this film! The story is straight forward, you don't really need much background unless you have no idea what a cult is. Classic teen and childhood angst mixed with amazing and often hilarious death sequences, plus a few 80's references and an amazing vehicle crash scene make this a great watch with your bff and laugh your ass off movie!"
    },
    {
      "rating": "9",
      "text": "Although the story was a bit foreseeable, there were many interesting hints, a good cast, nice comedy and acting. I really enjoyed this movie, quite refreshing."
    },
    {
      "rating": "7",
      "text": "yet to come ---------------------------------------------------------------"
    },
    {
      "rating": "10",
      "text": "Trop cool , hyper divertissant, ça ne fait pas peur du tout certes mais c’est amusant !"
    },
    {
      "rating": "7",
      "text": "Um engraçado horror cómico, com personagens bem desenvolvidas e escritas. A história é emocionante, o suspense está bem presente e a comédia foi pensada para tornar uma experiência positiva para todos aqueles que gostam do género de comédia de terror."
    },
    {
      "rating": "8",
      "text": "The Babysitter is the kind of fun horror comedy that I've been looking for for years. It uses dark comedy to everything and has quite a few nice throwbacks to the light horror I used to watch when I was young, so it just felt like an amazing time all the way through."
    },
    {
      "rating": "9",
      "text": "A funny comedic horror, with well-developed and written characters with a believable friendship at the film's heart. The story is gripping, the suspense built well, and the comedy well thought out to make this an enjoyable experience for all who like the horror comedy genre."
    },
    {
      "rating": "10",
      "text": "An amazing, wonderful, funny, exceptional, excellent, great teen movie, comedic horror... I’m just in love. Netflix is doing totally good this year, like ever. Bella Thorne, funny and pretty; her character, like the entire cast, is good as hell. This is the true about this; cross my heart."
    },
    {
      "rating": "10",
      "text": "Es muy recomendable para todo el publico ya que tiene buenos chistes y es de una buena calidad aunque muchos del reparto no son muy reconocibles pero dieron lo mejor para que este proyecto fuera lo mejor"
    },
    {
      "rating": "9",
      "text": "I'll be honest; I was quite surprised this film came from McG. It is well written, acted and directed. It actually comes across as what you would think a remake of Home Alone would be."
    },
    {
      "rating": "10",
      "text": "Best film after home alone, and i think is really better... I really recommend... the film is light, funny and really good to watch. Is not a horror movie so dont judge like this."
    },
    {
      "rating": "8",
      "text": "It's a nice movie, some scenes reminded me of Tarantino as well as the \"drag me to hell\" and \"jennifer's body\" ones. I'd watch it all over just to make sure didn't miss a thing of how amazing this is."
    },
    {
      "rating": "3",
      "text": "Man this was **** Whatever the hell this was supposed to be - comedy, horror, sentimental growing up claptrap - it failed miserably. Not one joke lands. The whole thing feels written by adults trying to write as their childhood selves but being so good at it that they think literally every single thing they think of is just so clever and couldn't possibly be bad. This movie literally has a scene where the hot babysitter and the geeky 13 year old kid watch a vintage western in the backyard on a projector while acting out the whole thing in front of it. No irony intended. It's just meant to be a bonding moment I guess? I mean, wtf is this?"
    },
    {
      "rating": "3",
      "text": "There were a few moments that made me chuckle but for the most part, This film simply couldn't decide if it was gonna be a comedy or a meta-horror movie. The cast does a decent enough job carrying the film but that only goes so far IMO."
    },
    {
      "rating": "2",
      "text": "An annoying, nonsensical waste of time. I’ve heard that this was supposed to be a “horror comedy” but the film falls completely flat in both genres. When your story doesn’t make any sense and is never explained it makes it a little bit difficult to get invested in it. The death scenes also didn’t make any sense to me. It seems the laws of physics, gravity and so on aren’t present in this movie so I’m constantly left scratching my head whenever someone dies. I felt no investment in the main lead and, while not a bad performance, I really didn’t care about his character. This film is an over the top, cartoony, unrealistic mess. And I hated it. But apparently I’m in the minority with that opinion."
    },
    {
      "rating": "4",
      "text": "On the same day Netflix released a good film and a regular kinda **** film. Had to see both and yeah, unless you're into mindless gory horror films you'll have fun with this one, on the other hand it barely works as entertainment.I know this sort of movies don't have to be too cerebral but they shouldn't be that dumb either."
    },
    {
      "rating": "4",
      "text": "This movie felt like a chore with all of it's problems. Bad acting, over pushed scenes, no real character development, immersion fun or entertainment. The directing style was the only decent thing that was done right in this movie. The humor is just not real, so it can't be considered humor. Sadly the acting is amateur at best. Pacing issues all over the roof, and when it get's to the point is essentially skipped over. Visual look very good though and the sound effect where right on point, which save the movie. But it's just overall not that entertaining. The protagonist is not interesting enough, and the only connection the audience can immerse themselves in to lasts to little, and is destroyed at the end. The plot is shallow and it has a lot of plot holes, which are left unexplained. Overall this is below average movie, because of the sheer fact that this is not what it was advertised. It's not a horror movie at all, and by far not a comedy. It's a teenage sci-fi and an average at that. The movie just has to many bad factors to be considered better."
    },
    {
      "rating": "4",
      "text": "This is like an edgy Nickelodeon original movie.What kind of name is McG?Bella Thorne and Andrew Bachelor should seriously stop starring in movies, because both of them can't act at all.Samara Weaving is the only saving grace in this. She's trying really hard to work with the terrible writing."
    },
    {
      "rating": "8",
      "text": "Its ridiculous but also funny and a joy to watch. Very enjoyable dark comedy type of movie. 85/100"
    },
    {
      "rating": "9",
      "text": "This show was straight-up fun. Good music and comical characters. The actors synergize in a way that is entertaining and (again)fun. The Babysitter Part 2 is just as good. It's too bad there isn't some kind of award for well-put-together films. There are no Oscars here but just the same the talent is real."
    },
    {
      "rating": "5",
      "text": "This has to be one of the stupidest ideas for a horror film. But it's kind of fun."
    },
    {
      "rating": "8",
      "text": "\"The Babysitter\" é um filme muito divertido, com situações e diálogos cómicos memoráveis e com um suspense bem trabalhado.8/10"
    },
    {
      "rating": "10",
      "text": "Cole (Judah Lewis) is your typical twelve year old. On the cusp of becoming a teenager he's dealing with all your typical coming of age problems. From dealing with his awkward Gen-X parents (Leslie Bibb & Ken Marino) failing marriage to bullies (Miles J. Harvey) that follows him home from school. He'll learn to manage his budding feelings for his classmates (Emily Alyn Lind) and his babysitter (Samara Weaving). All while surviving an assault from a Satanic Murder Cult (Robbie Amell, Hanna Mae Lee, Bella Thorne & Andrew Bachelor). The Babysitter is a 2017 Netflix horror film from director McG (Terminator Salvation, Charlies Angels). Famous for some of the best music videos of the 90's; this is the first feature from McG I've actually enjoyed. It's schlock without being schlocky.  It's a perfect grindhouse-esque B-movie elevated to perfection. The plot is tight, gruesome, and funny with a nice runtime of an hour twenty-five. The story has tons of set-up and payoffs with enough twists to keep you engaged. Its special effects are mostly practical, beautiful and only once did an effect stick out as fake. There are tons of great uses of slow-mo to show a deeper relationship between characters. Text abruptly pops up on screen in a funny stylistic fashion. The staging of every scene is set up with care which makes me think the films storyboarding must have been incredible. Not only is the technical direction of The Babysitter perfect; the cast is fantastic as well. Judah Lewis excels as a confused preteen trying to figure out who he is. He has a real emotional journey over the course of the film that is always grounded and real. Meanwhile Samara Weaving is devastating in her role as Bee the Babysitter. A perfect blend of charming and predatory, she'll leave you guessing Bee's true intentions long after the movie ends. Her band of merry murders are also entertaining. With a stand out performance from Robbie Amell who plays a psycho-killer more charming and fun than Ted Bundy.I'm actually disappointed it's taken me three years and a global pandemic to sit down and watch the Babysitter. It's been on my radar since its release in October 2017. Now it's one of my favourite horror movies. With the Babysitter 2 is post-production at the time of writing this, I hope we'll see a release in October 2020. For those reasons I'm giving the Babysitter a grade of perfect 10."
    },
    {
      "rating": "3",
      "text": "Babysitter is sacrificing innocents to get a wish from Satan and brings along a group of morons to help her do it."
    },
    {
      "rating": "10",
      "text": "Really a great movie that mixes horror and comedy. it makes me laugh a lot and make me scare too."
    },
    {
      "rating": "8",
      "text": "The Babysitter: Well McG sure out did himself from Terminator Salvation. Alright so before I start just want to say that tomorrow there are going to be two reviews Forrest Gump and the sequel to this movie. So some things I don’t like is that Bella Thorne and some vine guy are in this movie and vine guy just sucks but Bella is not terrible. Now I love the other actors though mainly the babysitter herself Samara Weaving she is amazing as always, she brings a bit of shyness but also being terrifying at the same time. I adore the gore in this movie man, from vine man getting impaled through the neck with a trophy, to Bella Thorne getting her head blasted clean off. Overall some minor problems but makes up for it with Samara’s performance along with the main boy and the awesome kills, it’s a Netflix original so go watch it. Ranking Amazing."
    },
    {
      "rating": "9",
      "text": "Im glad my friend showed me this movie. I never thought that such a basic concept could be interpreted so well."
    },
    {
      "rating": "7",
      "text": "Anchored by a very charming performance by Samara Weaving, the Babysitter provides 80 minutes of good time."
    }
  ]
}