{
  "id": 4392,
  "title": "The Counselor",
  "starring": [
    "Michael Fassbender",
    "Penélope Cruz"
  ],
  "runtime": 117,
  "genre": [
    "Thriller",
    "Crime",
    "Drama"
  ],
  "description": "A lawyer finds himself in far over his head when he attempts to get involved in drug trafficking.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aNiLkGnzVb5CorZHKk16w9S4COt.jpg",
  "categories": {
    "plot": 2.6,
    "acting": 3.019230769230769,
    "ending": 4.153846153846154,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 0.8571428571428571,
    "funny": 1.3333333333333333,
    "action": 5.75
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Holy  this was just god awful, dialogue is not human, women are treated as nothing but sex objects, minorities are all portrayed as bad, there's no discernible characters development, it's just  awful save your money"
    },
    {
      "rating": "10",
      "text": "In my ever-humble opinion, this is a saddening example of metacritic's inevitable deception. Many will see the generally unfavorable reception towards this film and write it off without the blink of an eye.\r Now I am in no way saying that my opinion is absolute (it so clearly is not), and I would also like to point out that I do not throw around 10-ratings lightly.\rThis film is, without a doubt, one of the most brilliant films I have seen in years.\rRidley Scott is an artist with a 'true vision', and I will not argue that it requires one to be on a certain wavelength in order to perceive this vision (I do not mean to sound pretentious).\rEvery inch of Cormac McCarthy's dialogue is profoundly thought-provoking and unknowingly exposing,\rand the performances are brilliant to the point of the cast's A-list status coming off as a mere coincidental detail. Fassbender, Pitt, Diaz, Bardem, and Cruz all exhibit the same fearless resolve as Scott on the other side of the lense.\rDespite common criticism of the film's 'lack of cohesion' or 'identity confusion', I assert that this film's self-identity is actually stronger than most. Those who cannot recognize this cannot see the forest for the trees. Those who are not familiar with a more 'Art-house' approach to film-making/story-telling will most likely end up alienated. This movie makes no attempt to ease viewers into its twisted and bizarrely real world, and that is ENTIRELY intentional.\r Again, I do not mean to sound aggressive towards those many who dislike this film.\rI simply wanted to present my personal appreciation for this film which I consider monumental, and for those intrigued but disenchanted by the negative reception to persevere until they can form their own opinion."
    },
    {
      "rating": "0",
      "text": "This film is why the term \"hot mess\" was coined.  Its writer is more interested in his familiar theory that we are all becoming dehumanized and that the world is coming to an end.  Perhaps, but could we spend our last days watching films with coherent plots, believable characters.  It is risible to hear drug cartel figures spout about inevitability."
    },
    {
      "rating": "0",
      "text": "What a disappointment with this cast.  Clumsy plot and bad sequencing.  Do not waste your time or money on this one.  Getting mugged is a better investment than seeing this film."
    },
    {
      "rating": "0",
      "text": "There was nothing for me to like about this movie. The story evolves around a Counsellor and the people surrounding him. For reasons unbeknown to us he decides to go into the drug business, and pseudo-intellectual existential dialogues between the protagonists ensue, with the main focus being on greed and how sexual everything appears to them. Cheetahs chasing jackrabbits is sexual, a yellow Ferrari is so sexual that Diaz' character decides to make-out with it (yes, you read that correctly). The Counsellor is constantly being counselled on life and it's meaning by philosophical drug-dealers and cartel members. The tediousness of these overdrawn, often repetitive and rather self-indulged exchanges make the film feel so ill paced. The chemistry between the two main couples (Fassbender-Cruz, Bardem-Diaz) was non-existent. The characters are hardly developed. Were we suppose to empathise with the Counsellor? The acting was NOT good. The ultimate attraction to this film, for me, was the cast who in it's majority has seldom - if ever - let me down. And yet, here, even they were, to put it mildly, not on top form. The emphasis had been given on the aforementioned dialogue, something that was more obvious when the main plot of the film became increasingly convoluted and thus hard to follow. At the end all I felt was content that it was over. This is, unfortunately, the worst film I've seen this year."
    },
    {
      "rating": "0",
      "text": "Whenever I watch such \"movies\" I feel ashamed for their \"creators\". I myself don't even feel insulted by the garbage they threw at me from the screen disdain for moviegoers has become common place nowadays. R.Scott was lucky to make couple of good movies, since then all he cares about is money. What was he expecting the spectators to say after having watched the film? Amazing interiors\", :\"fast cheetahs\", \"Fassbinder licking muffin of Penelope Cruz who complains that it's dirty\", \"Queer Bardem\", Diaz screwing the Ferrari\" \"Pitt loses his head due to idiotic device\"... What a sham! But the worst part is dialogues. A good movie talking should do three things: move forward the plot, explore the characters, elicit some emotions. Here you have long imbecile speeches which try to pretend sexy, philosophic or smart. EVERY single person speaks as if they majored at ancient Greek literature. My god, what happened to good screenwriters? Studios should give the process back to independent producers, otherwise, in 5 years, people will go the cinemas just to eat some popcorn and play bowing"
    },
    {
      "rating": "5",
      "text": "I have never seen a movie split people in half. You either love it, or you absolutely want to rip your head off. I never thought that a movie made from the legendary Ridley Scott could fall down this path. Long story short, \"The Counselor\" truly suffers with its script. It doesn't know what it is. It makes the actors say a bunch of mumbo jumbo and makes the grisly violence seem less appealing to the source material it's given. Now I don't hate the movie, but there's something seriously wrong with this story. Its one thing, then its another. It's like they're trying to pull an Inception on me. And the movie is only about drug trafficking!! I don't know, but what I do know is that, you'll get sucked into a mindless and grisly film or you'll absolutely devour the crap out this confusing and off-setting story. Overall, it has its merits, but suffers in screenplay, which makes everything else suffer. I give it a C."
    },
    {
      "rating": "1",
      "text": "This is one of the saddest excuse for a movie I have seen in a long time :( Two hours of my life that I will never get back. What a travesty. Sometimes ingredients just don't mix. I tried orange juice and cola once. Never again. Mr. Scott tried mixing philosophy, a megalomanic script and his own pretentious ego. This movie tries to convey some sort of sensuality about violence or what? Of course, I didn't 'get' the movie. But I'm glad I didn't. Oh, and don't be fooled by miss Diaz trying to pretend she can act. She can't. :("
    },
    {
      "rating": "0",
      "text": "I recently viewed \"12 Years a Slave\" and as I was watching the brutality of this film I was constantly reminded of \"The Counselor\".  These movies have absolutely nothing in common other than the simple fact that man just cannot help its hatred for its fellow man.  This movie is the modern version of just that time when people were property and were totally expendable with no remorse or thought of them as humans.  This a mess of a movie and I would beg you not to see it...the graphic and brutal violence in the film has not left my mind since the viewing and reminds me how far we have not come since the 1800s."
    },
    {
      "rating": "0",
      "text": "This is a dishonest film. It is not what it says on the tin. From the trailer, cast, director, synopsis etc you are probably expecting a high octane, on the edge of your seat thriller, with a strong plot line and characters you can love or hate. Sorry but it does not give that at all. This simply is a self-indulgent film (self-indulgent by the writer), with actors badly delivering unintelligible lines of philosophic dialogue with neither rhyme nor reason as to how they got there and what their motives are. This is the sort of thing you would expect to have to sit through, not too willingly, when you have a very good friend who is taking screenplay classes and has to do an obscure showcase. Most students, if not all, refrain from applying a Hollywood budget, getting Ridley Scott to direct and having Brad Pitt et al in these showcases though and maybe McCarthy should have thought twice about having his screenplay debut in such a fashion and kept to the more traditional avenue of a few friends in a small theatre. I am sure his friends would have said nice things about it but I can't think of one."
    },
    {
      "rating": "0",
      "text": "One of the most depressing movies ever made. And surely one of the worst. I would rank it 2nd worst ever after Tree of Life which is simply untoppable. Non exisiting story, endless pointless scenes and pseudo-philosophical, yawn inducing dialogue rivalling even Matrix III.\r I find it hard to fathom that this trainwreck was directed by the same man who brought us Blade Runner, Alien, Gladiator and Thelma & Louise. Ridley, you should be ashamed of yourself.\r PS.: Brad Pitt seems to become the ultimate seal of approval for crap movies: Benjamin Button, Babel, World War Z, Tree of Life and now this abomination. Next time I see his name on a DVD I'm gonna avoid it like the plague ..."
    },
    {
      "rating": "0",
      "text": "The Counselor is beyond terrible. From the moment it started to the very last scene, it irritated me so much because of how incomprehensible it was. From the long meaningless conversations to the poor directing, the counselor could not have been made any worse."
    },
    {
      "rating": "0",
      "text": "One of the worst movies I have seen in about a year. This proves that no matter who is attached to a film it could still be a disaster. Don't ask me what happened, I have no idea. Nor do I care."
    },
    {
      "rating": "3",
      "text": "This movie was the most surprisingly, disappointed movie i've ever watch in 2013. With the A list casts and their actings, they can't help how mess this movie's plot. Really disappointed"
    },
    {
      "rating": "3",
      "text": "3 points for Javier Bardem's wardrobe, 0 points for everything else.\r Heineken.\rAnd here's some more characters because I have nothing else to say about this film."
    },
    {
      "rating": "1",
      "text": "While certainly not as gory and sexually exploitive as some, it is meaningless trash, as one other reviewer put it \"a waste of talent\" of some great stars who put in their usual good work. The plot is stupid. Not one of these characters has ever seen a spy or cartel movie? They don't protect themselves in any way. They go home and sit around? They are not suspicious of beautiful women who just happen to pass by and fall for them? They walk around the streets thinking they are invisible?"
    },
    {
      "rating": "1",
      "text": "I'll start out with the pros. Good production value, acting was slightly north of mediocre. Moods set in the begging of the film are effective and moving. And the Cons. This movie was a disgusting display of a lack of respect for human life. It's attempts to build a solid logical architecture behind the plot, causes it to be have unnecessary heaps endless of pseudo-philosophical monologues that  are boring and ineffective. This is a film for the kind of person who watches an actual cartel beheading and is left asking \"That's all?\". This movie is incredibly brutal. This is coming from a gamer, in fact I enjoy the violent ones, even the most violent and gory ones. Hell I was in a better mood after watching \"A Serbian Film\" than when this movie's credit's rolled. The Counselor went way over the edge and into a dark unforgivable side of humanity, and I fear it may have left me with some permanent psychological scars that will probably never leave me. If that's what you're looking for, this is the movie for you."
    },
    {
      "rating": "2",
      "text": "I can truly see why the overall score ratings are close for both, positive and negative, reviews. It all relies in the story, where must of all characters have a philosophical, similar kind of elevated speech which some cannot digest as being veracious while others claim it was very \" artsy\" and intellectually attractive.\rI am sorry, but I am in the first group. not even so many great actors can rescue this movie from its awful script."
    },
    {
      "rating": "0",
      "text": "Don't waste your time on this movie. Totally disjointed plot. The term \"counselor\" was used in every other sentence. Acting was pretty good all around, but even good actors couldn't salvage this trainwreck."
    },
    {
      "rating": "5",
      "text": "Chaotic, unclear, unstructured with very stupid end. Great actors, just the story sucked."
    },
    {
      "rating": "1",
      "text": "Absolutely dreadful; a total dogs breakfast of a film. I can't think of a worse example of squandered potential in recent memory. if you are looking for a truer, scarier and altogether more believable portrayal of the drugs business, I suggest looking no further than Breaking Bad."
    },
    {
      "rating": "1",
      "text": "There's so much wrong with it on so many levels. With everyone involved, it quite frankly should have been a masterpiece, and is the absolute inverse of that. A complete trainwreck on every level. The movie is less than 2 hours long, but I was bored before the halfway mark and almost left multiple times. The most disappointing movie of the year."
    },
    {
      "rating": "0",
      "text": "We went to see this film last night and I witnessed something I've never seen before. 50% of the audience got up and left during the film. The poor remaining few who stayed until the end in blind hope that the film can't really be this bad simply vocalised their opinions at the end shouting out \"worst film ever\", \"no wonder people left\"!! Anyone who rates this film higher than a 2 must be on the pay roll or trying to act like a critic and see something which really isn't there. The film is a confused blend of poor acting, guess work and an incredibly simple, boring plot line made overly complicated with pointless and annoying dialogue. This film could have been over in 15 minutes, that's how simple it it, yet through pointless boring and confused conversations it managed to get up to nearly 2 hours. I don't feel good writing this review as I admire many of the actors involved and the director but this is truly appalling and one of the worst films I've ever seen.  If by writing this review I stop just one person going to see this film then I feel like my work is done. Avoid at all costs, poor script, poor acting, and poor direction make this film a total joke."
    },
    {
      "rating": "1",
      "text": "What a bunch of cut scenes stapled together so they could call it a movie. I stuck around to the end only to see what the big payoff would of been but like the rest of the movie it just left me completely disappointed. The most upsetting thing about this so called story is that there is a real good movie in there somewhere. It is just the director and screenwriter completely dropped the ball. Better luck next time Brad Pitt."
    },
    {
      "rating": "2",
      "text": "In 2007, Michael Bay created a mega, summer movie blockbuster event that brought some incredible advances in special effects, a slew of unnecessary sequels and most importantly, made famous the incredibly sexy, sweaty grease-monkey character Mikaela Banes, also knows as Megan Fox. If there is anything Michael Bay did right in that film, was give audience members as well as pop-culture enthusiasts one of the most memorable cinematic stills since Marilyn Monroe in 1954′s The Seven Year Itch. Leaning on the sizzling hood of Sam Witwicky’s 1976 Chevrolet Camaro’s hood, allowing the heat from the engine to soak Mikaela’s body with sweet sweat, Bay created eternal movie magic with that iconic scene. Since then, audiences, as well as critics alike, never thought that the day would come when an overly  sexual image involving a car would ever come. Oh, it came!\r The only difference between Diaz‘s Malkina’s outrageous car scene and Fox‘s iconic heated scene is that, Diaz and company wish they had as good a movie as Transformers on their hands and a film that people will actually care to watch and recommend, and that’s putting it nicely.\r The Counselor seemed to have no advising or counseling on it at all, because director Ridley Scott and company deliver what is surely going to be one of the worst decisions in their careers in a long time. What looked like a thrilling game of cat and mouse, quickly becomes a dry, careless piece of gorgeous snuff.\r The Counselor follows, well, the counselor (Michael Fassbender) as he navigates the waters of his first ever, illegal and immoral business venture of drug trafficking from Mexico across the United States boarder. That is pretty well everything you need to know and everything that is really told. Just like the lack to give a name to the lead, The Counselor is a cold, informal and perplexing film of too many characters and not enough explanation or purpose.\r The Counselor shows the relationship between himself and his gorgeous wife Laura (Penelope Cruz), his relationship with people in the underworld including Westray (Brad Pitt) a middle man between professionals and the cartels, Reiner (Javier Bardem) a man of means, and Malkina (Cameron Diaz) the lavish girlfriend of Reiner. Other than that, things go from bad, to worse, in both the narrative of the film, and the film itself.\r Lacking any real storyline or empathetic characters, The Counselor serves as an ill-advised example of the power within Hollywood. Following in the footsteps of other complete disaster ensemble films like this year’s Movie 43 and The Coen Brother’s 2008 tragedy Burn After Reading, the film serves no purpose other than Diaz‘s amazing showcase of acrobatics, sensuality and unexplained perversion.\r The film itself is a stylized and beautifully shot piece of work. Sadly, pieces of art share more of an emotional response than this film does. The film is flooding with lost scenes, pathetic foreshadowing and unflinching action/reaction shots.\r One of the most noticeable disappointments of The Counselor is its script. Acclaimed author Cormac McCarthy is a recognized and respected writing force. So many of the most striking narrative feature pieces of the last decade, including No Country For Old Men and The Road, have used McCarthy‘s work as source material and enhanced the characters and narrative of McCarthy‘s narrative worlds. In his first venture as feature screenwriter, McCarthy overcompensates with nonsense,  directionless and often sleepy dialogue. I’m unsure if McCarthy was pulling inspiration from Shakespeare or Hemingway, but instead of delivering on precise, metaphorically driven, analogical monologues and conversations between characters, McCarthy simply loses his audience and instead allows his talented actors to give long-winded, spoken word lullabies.\r Every so often, there comes a movie that really makes me scratch my head and wonder how and why all the talented individuals involved could possibly sign on to a movie like this. The Counselor is well on its way to being one of the worst movies of 2013. Strangled with boredom that even scenes of decapitation couldn’t possibly help make it even a bit interesting, The Counselor is a failed attempt for everyone involved but Diaz. Diaz will surely be remembered for years to come for her scene atop a bright yellow Ferrari, a vacant golf course and a priceless face made by Bardem, who encompasses the feeling of the whole movie, with one facial expression. Disbelief is the best way to describe it, or gynecological, if that even makes sense, because nothing in this film attempts to make sense. This film is in desperate need of some professional help."
    },
    {
      "rating": "1",
      "text": "If you listen carefully you can almost here the snapping and cracking of the backs of a million Carmac McCarthy and Ridley Scott fans who are bending over backwards to try to rationalize and justify the mess that is the Counselor.\r I fall into the camp of people that found this to movie to be a monstrosity.  The script is indescribably terrible  the dialogue is stilted, wordy, pompous, unnatural, shallow, unrealistic and pointless, and it manages to explain too much and explain too little, miraculously, all at the same time. Perhaps with better direction and editing the plot (which is actually fairly simple) would have made a bit more sense but at times you will likely still struggle to follow what's happening because the scenes are put together so poorly and the script introduces new characters at random.  This is a movie that gives off the impression, at first glance, of being intelligent. You'll get to hear speeches that draw on the many worlds intepretation of choice and the potential lack thereof, meaningfulness, etc. from unlikely sources. Having majored in philosophy I found them superficial and insulting. If I didn't have a background in philosophy, I would merely have found them preechy and pointless, I'm guessing.  The writing was stylistic but yet tried to be conversational and just failed in every way conceivable.\r There are a couple decent action sequences and a cool murder scene at the end but the characters are lifeless or caricatures of interesting characters because the writing is laughably abysmal.  This movie is a complete and utter failure, and I have a great attention span, have liked movies with little to no plot and was not expecting a suspense filled thriller.  This was just a complete turd.  I'm guessing what happened is that no one had the courage to tell McCarthy that his script was terrible or someone thought it was deep (even though it isn't) and greenlighted this movie. What a mistake."
    },
    {
      "rating": "1",
      "text": "What a waste of perfectly good actors. It had all the potential of being a great movie but feel extremely short. Very confusing and terrible ending of that's what you call the last part of the movie. Waste of my money and time."
    },
    {
      "rating": "0",
      "text": "Absolutely the worst movie I have seen in a very long time.  What a shame.  Great writer, great actors, but dreadful movie.  The story is disjointed with characters that you simply don't care about and can't get invested in.  Horrible editing.   I recommend that no-one spends any money or time watching this.   I absolutely can't imagine anyone rating this above a \"2\" maximum, even if you are a Brad Pitt, Cameron Diaz, or Penalupe Cruz fan.   It crossed my mind several times to walk out on this one but stayed to see if somehow it would come together nicely at the end, and well, it didn't."
    },
    {
      "rating": "1",
      "text": "Whenever I watch such \"movies\" I feel ashamed for their \"creators\". I myself don't even feel insulted by the garbage they threw at me from the screen  disdain for moviegoers has become common place nowadays. R.Scott was lucky to make couple of good movies, since then all he cares about is money. What was he expecting the spectators to say after having watched the film?  Amazing interiors\", :\"fast cheetahs\", \"Fassbinder licking muffin of Penelope Cruz who complains that it's dirty\", \"Queer Bardem\",  Diaz screwing the Ferrari\"  \"Pitt loses his head due to idiotic device\"... What a sham! But the worst part is dialogues. A good movie talking should do three things: move forward the plot, explore the characters, elicit some emotions. Here you have long imbecile speeches which try to pretend sexy, philosophic or smart. EVERY single person speaks as if they majored at ancient Greek literature. My god, what happened to good screenwriters? Studios should give the process back to independent producers, otherwise, in 5 years, people will go the cinemas just to eat some popcorn and play bowing."
    },
    {
      "rating": "3",
      "text": "I have no idea what happened here, or really what I watched. I kept waiting for the character interactions to make any sense whatsoever. They never did. The places that hurt the worst were Diaz and Bardem, and for opposite reasons.\r Watching Diaz try to deliver that last pseudo monologue in the restaurant was awful. I was on a date and had to work to keep from laughing because I thought it would come across as arrogant. She's just not capable of delivering complex, philosophic dialog in a believable way. Afterward, and I think in the moment too, I kept comparing that scene with the last scene from No Country for Old Men and Tommy Lee Jones' monologue. I think maybe Ridley Scott thought we'd be too busy fixated on a very sexy Diaz to notice the difference in quality.\r She played the animal really well. Did we have to have her hump a car though? I mean she lives with leopards and has her own leopard spots. We get it. She's the only thing that can survive in the drug trade--an animal.\r But I think what hurt the most was wasting Javier Bardem on an idiot character who 1) consistently and genuinely claims to not know anything of substance while obviously knowing enough to live in the lap of luxury, and 2) spouts McCarthy's (in this film frequently turgid) lines with his trademark talent...which here contrasts so badly with everything else we observe about his character that we reject both the character and the lines as absurd caricatures of McCarthy's writing.\r Waste of good film!"
    },
    {
      "rating": "8",
      "text": "Wow! What a movie! Michael Fassbender, Goran Visnjic, Brad Pitt, Javier Bardem John Leguizamo (and other female characters that I am not mentioning on purpose)... these are all fine actors and they each have different acting styles on their own (if it can be said like this). What I am trying to say here is that if you have one of these male actors, you will try to get the best out of them, but if you have all of them things are little complicated. I expected much more from this stellar acting crew, I expected it to be something like Oceans Eleven. Instead I watched something that was good, with a blurred story line and and an everyday performance from some of these actors. Not disappointed, but expected way more."
    },
    {
      "rating": "1",
      "text": "Wow, I was surprised at how bad this film was. Coming from such a great director I was more disappointed than when I saw Prometheus. First of all the writing in this movie is god awful. I found myself often questioning what was going through their minds when they wrote some of these down? Most of the conversations in the movie are cringe worthy and don't advance the plot further.  The character development is just as bad as the dialogue. I had no emotion to put in any of the characters, they are all hollow shells that just take up screen space. The plot is sickeningly boring and confusing. It jump cuts around several story lines and doesn't bother to stop and explain them to any degree. They just kind of assume you know whats going on. If there is any positive note to hit its that the cinematography was great. It carries this No Country For Old Men kind of feel that's both visually appealing for the viewer and compliments the mood that the movie sets. Ridley Scott's worst work to date, but the good thing is that his movies can't get much worse than this."
    },
    {
      "rating": "3",
      "text": "I can't lie to you about your chances,but anybody who sees this movie has my sympathies. Good dialogue and acting are a must for any successful film,and apparently Ridley Scott thought that they were in such abundance he needed nothing more. The plot is simple and sophomoric. You keep waiting for the underlying grand design to slowly manifest itself,but when the credits start to roll you see that this is it. By the half-way point,or sooner,you will have figured out who's good,bad,or just stupid. Also,almost every character gets their turn to wax philosophic. Even the owner of a broken down hole in the wall bar shares his lugubrious outlook on life. And lastly,I know movies like to drop in the title of the show periodically if it's appropriate,and counselor is a popular euphemism for attorney, but the word \"counselor\" is used so often it borders on ludicrous. Some might consider \"Someone to Watch Over Me\" one of Scott's lesser films,but it's ten times the movie \"The Counselor\" is."
    },
    {
      "rating": "1",
      "text": "Boring, confusing, disjointed and downright a mishmosh of jumble mania. The movie did not let me care what happened to any of the characters.  The story line was so weak."
    },
    {
      "rating": "0",
      "text": "I think the word to sum up this movie is sick.  It adds nothing to the human experience. Brad Pitt et al should be ashamed of themselves. There are not many movies where I would say don't bother to go ...but ..really..don't bother."
    },
    {
      "rating": "0",
      "text": "Wow that was bad.  I do not have any problem with complex plots that leave things out or open for interpretation but this thing has no plot.  Or perhaps the right way to say it is the plot is so obscured by speeches and preachy dialog sprinkled with dramatic gore that no one can figure out what the plot is.  I still cannot tell who the second guys who stole the truck worked for.  Or was it the first guys who stole the truck I could not figure out.  And having people who are not what the seem is OK but there has to be some explanation as to how they have access to all this information and resources suddenly.  And having multiple characters that are on screen for one scene with no explanation of any kind  this is just bad story telling.  There is no other way of saying it.\r This was one of those movies that at the end I wished I had left the theater when I realized this was going no where.  I have to work on that because I could have spent that hour listening to the radio in the parking lot and left the theater happier."
    },
    {
      "rating": "3",
      "text": "Something tells me that Cormac Mcarthy has some interesting opinions and experiences with women after seeing this film.  This is one of the few movies I actually felt bad for the talent involved.  The dialogue is just so terrible.  Particularly every conversation has some awkward self-conscious feel to it or just some random chit chat about women and how men cant understand them.  The only scenes that I felt worked were the opening scene in the bedroom and the conversation the counselor has with the main drug boss near the end.  Everything else is this dry philosophical edge.  When things finally get going a bunch a stuff happens and its really not as compelling as it set up to be.  The cameos are terrible too, they have no meaning what so ever.  I knew going in it wasnt a well reviewed movie but, I wanted to see it for myself.  I was surprised people talked so much in it, cause in Mcarthy's literature he can say a lot without really saying much.  This one had me running for the border...i mean the exit."
    },
    {
      "rating": "1",
      "text": "If you want to see a depressing, over-the-top, grotesquely violent film have yourself a great time. This movie goer is sick of gore for the sheer blech of it. The only intelligent message of the film is obscured and is at best one that I hope isn't true for the sake of mankind. What has happened to our culture and to values? Some of the acting was good. What a waste. And what's with Cormac McCarthy and his twisted mind? What kind of brain thinks of such killing devices as in this film? Yuck."
    },
    {
      "rating": "6",
      "text": "Could anyone please tell me why this movie exists??? Was it difficult for that doomed all star cast to read the plot first and then agree to star in this movie?????? Please explain me!!!\r Well, I went to the premiere and I was disgusted after the first 40 seconds. Javier Bardem was the only one who tried to save tha movie, but he actually didn't. All the cast was lost. The worst movie of 2013, the worst movie of McCarthy, a usual film of Ridley Scott(meaning on how the film was directed).\rDon't see it!!! Save your money!!!"
    },
    {
      "rating": "2",
      "text": "What a waste of talent! The Counselor joins the club of the garbage movies of 2013! Absolutely the worst Ridley Scott's directing in his career. I give it 2  10 for acting part, every other aspect is a disaster"
    },
    {
      "rating": "1",
      "text": "Writers should NOT write screen plays! They can't! What a waste of some good actors and my time.\rEvery actor had a long, long speech on live, love and the reason we are all here. I was embarrassed\rfor the poor actors."
    },
    {
      "rating": "10",
      "text": "I can quite understand why some will not take favor with The Counselor; one's who can only see what's put right in front of them. The mystical Cormac McCarthy presents some pieces and expects, demands his audience to pay close attention and then decide exactly what happened. Just like most of his characters we are only shown so much, but certainly enough to know up from down and right from wrong. A great thought provoking film, which I admit is one of my favorite types of films. I hate leaving a cinema knowing all I will ever know about a film. It's a shame great films like this, one's that leap far away from the mundane can only be appreciated by some while others expect the mundane and are thus disappointed by an 'outside the box' presentation. Outside the box is what you should crave!!\r The Counselor is sharp, stylish cinema that cuts out all the crap and delivers only what it needs to & the rest is up to you."
    },
    {
      "rating": "10",
      "text": "I’ve seldom seen published reviews of a film that have so misunderstood a film.  Banging on THE COUNSELOR as a failed thriller is like disparaging a hat for not being a shoe.\r THE COUNSELOR announces what it is, early on and self-referentially  not a thriller but a moral fable, a cautionary tale  and then proceeds to deliver just that, impeccably.  No hair-raising car chases, no miraculous escapes, no ingenious last-minute victory for the hero, and thank god for it.\r Austere in its point of view, anti-naturalistic by design, and florid in its dazzlingly tawdry material surfaces, this story moves toward its inevitable outcome without missing a beat.  In essence, it says don’t trifle with evil, guy…don’t even.  Because evil will answer your invitation, will visit its tragic dance upon you.  Here, watch it destroy you in a cold torrent of pain.\r Scott and McCarthy deliver this excellent work on their own terms and within their own parameters, no hedging, no apologies.  The plot is always two steps ahead of the audience, so pay attention please.  The dialogue, which has elsewhere been quoted with jeers, actually plays magnificently.  Along the way are some amazing performances, Fassbender as, fundamentally, an innocent looking for a fast, casual score, Diaz as a devastated soul, Pitt as a candidly self-aware crook.  And of course the ever inventive and brilliant Javier Bardem as the sybaritic ‘mastermind’ with a stripe of stupid running through him.\r If you merely want someone to root for, go to a ball game.  If you want fast food, look elsewhere.  Scott and McCarthy serve up a coherent fictional world to which the viewer must simply surrender.  This film will last and be revisited again and again, long after other routine thriller fare has been lost and forgotten in the streaming video graveyards."
    },
    {
      "rating": "4",
      "text": "Some of Cormac McCarthy's books have made successful movies (No Country for Old Men, The Road), but this time pens his own screenplay and it's a talky, tedious mess. Novels can afford to take time to develop characters and, in McCarthy's case, wax philosophical, but a movie needs some brevity and this one is lacking. Michael Fassbender plays an attorney who gets embroiled in a drug deal, but he's as confused as the viewer: Who are all these people and what is their relationship to him and the deal? With almost non-stop chatter, you'd think this would be clear, but it's just a confusing muddle.You'd think director Ridley Scott would know better, but he just adds a stylish edge."
    },
    {
      "rating": "4",
      "text": "Not a good movie. Don't get lured by the big names attached to this movie. While their acting is actually good, especially Fassbender who is quite convincing, the [lack of] story is embarassing and quickly becomes an excuse for an escalating and gratuitous violence. Then, there's the meaningless philosophical exchanges between the characters, trying to make you believe you are watching a great movie.\rGoods: Michael Fassbender & Javier Bardem. The scene where the truck gets washed, repaired, repainted after a shooting by men and women who \"just do their job\" and clean the blood everywhere, as if nothing serious had happened. Bad: pretty much everything else, amongs other the robotic acting by Cameron Diaz, who still tries to convince she is attractive. Ugly: violent and bloody scenes just for the sake of it (that scene with Brad Pitt' character being killed in London is just ridiculous)."
    },
    {
      "rating": "10",
      "text": "After you wach this movie you can feel a hole into your stomach.This is not a movie is a greek tragedy. a very sad poem converted into a movie.The traffic of narchotics is just a background. it could be any other one.Is not a matter of good and bad like a police movie.is a matter of destiny.You have to read Faulkner or melville or kafka to understand and feel and touch the greatness of some tragedies.We put together two genius like ridley  Scott and Cormac Maccarthy and the result is this shakesperian tragedy.\rNo matter the jumps or interruptions of the plot they are intentional to make your brain start to work.\rThere is a sense of emptiness and loneliness that you can almost touch with your fingertips.\rThe mesage is that we are puppets in the hands of a higher destiny.Its like the ancient greek tragedies where the humans are mere instruments in the hands of the gods.The druglords take the place of ancient gods.they are unreachable and nobody can discuss their decissions.Nobody can see them\rbut you know they have eyes and slaves everywhere.\rThis is not a movie about drug traficking is about destiny,about human weaknesses and the evil they can bring into everybodys lives.\rIn short its not a movie for everybody  but is great very great........... and also very devastating."
    },
    {
      "rating": "0",
      "text": "Brad Pitt should think twice before he lets people put his name on idiotic films like this just to attract movie goers. Speechless ! I could not bring myself to watch the movie past the 15 minute mark. It looks like the producers made their initial investment back and came few bucks on top thanks to Brad and that's all that matters, I guess. I am sure there are some idiots out there who will give it a four or five stars and call it an \"art\", but believe me there is NOTHING artistic about this piece of crap. Poor acting and vulgar opening scene does not qualify as art. I understand there is a scene with Cameron Diaz rubbing her kooch against the Ferrari !? This is why you gave it four or five stars, you moron(s) ? Go rent a porn ! I, also, read that director's brother jumped of the bridge. Now I know why."
    },
    {
      "rating": "8",
      "text": "All I want to say is that the movie was confusing at many moments, but it is still a great movie. Trying not to implicate something that will cause a spoiler effect, but all the actors played their roles perfectly."
    },
    {
      "rating": "10",
      "text": "The Counselor is one of the best films I have seen in years--mesmerizing, ethereal, even captivating in spite of the theme.  Critics expecting, or insisting on, an action-adventure genre picture where everything is neatly solved at the end were disappointed, and responded hyperbolically.  The film will fail at the box office in this country, but it doesn't fail as a film.  Here are a few random thoughts, in no particular order:\rFirst, the Counselor himself is not an innocent, naive, or likable figure (except in his relationship with Laura).  He is from the beginning a morally compromised player--as we can see in his arrogance, in his dealings with women, with Reiner, and with the mysterious figure who gets him to El Jefe, and even in his odd question to Westray about whether he has slept with Malkina.  Now that everything in his life seems perfect, he is driven to destroy it, piling on debts that put his \"back against the wall\" and \"force\" him to get involved with the drug deal.  In reality he is driven to annihilation by something inside him.  (I thought of Freud, Civilization and its Discontents).\rSecond, we know very little about the drug deal and how it falls apart, and that little we do know is given to us in bits and pieces.  We are exactly in the place of the protagonist, who also is surrounded by a menace he does not fully understand.  It is a very uncomfortable place.  In the end there is nothing he can do, except aimlessly travel and plead.  By the time he realizes he is in trouble, it is already too late.  The idea that human individual action may be useless is one that is hard to accept.  We want to see the hero solve things, and we aren't going to get that here.\rThird, the dialogue is gorgeous and endlessly quotable, just as the film itself is beautifully shot, edited, visualized.\rFourth, the sequence that ends the life of Westray is one of the most chilling horror scenes I have ever watched.  It is described for us early on; we feel the suspense as Westray is followed, and then we are left to watch as the horrific scene, whose ending we already know, plays out.\rFifth, and finally, the performances are first rate.  Pitt, Bardem, Cruz, Diaz, Blades, Perez, Leguizamo, and others are at the top of their form.  Fassbender in particular is a stand-out for his ability to create a character from a sparsely written role.  The best scene, in retrospect, is his phone conversation with El Jefe, photographed through his dirty windshield.  El Jefe gently but ruthlessly tells him that it is over and there is nothing for him to do.  Fassbender's pleas--\"Maybe we could meet someplace\"; \"Can you help me?\" are, like all of his dialogue, almost banal (in contrast to the glorious words of the rest) but he is able to use that contrast to create an unforgettable character.  We don't know what happens to him at the end.  It would almost be too much to bear.\rI'm sorry that this film is not doing well at the box office in the US.  My only consolation is that this film--like Vertigo, Touch of Evil (which it resembles in some ways), or Blade Runner itself--will get its reevaluation, and be seen as the classic that it is."
    },
    {
      "rating": "10",
      "text": "The Counselor will leave many mystified  even those who enjoy it. The story envelops rather than unspools, a guttural experience. As Scott stages the confined action, bouncing from location to location like a Pinter play's moving sets, the musical score pulsates with dread. In one scene, a nameless assailant strings a steel wire across a desert road, intending to slice a speeding biker who will eventually appear. That's the movie in one note: taught, prophetic, and hushed. We don't have our finger on why this is happening, but we can feel what's coming. We know it's grisly. We can't look away."
    }
  ]
}