{
  "id": 4521,
  "title": "The Many Adventures of Winnie the Pooh",
  "starring": [
    "Sterling Holloway",
    "John Fiedler"
  ],
  "runtime": 74,
  "genre": [
    "Animation",
    "Family"
  ],
  "description": "Whether we’re young or forever young at heart, the Hundred Acre Wood calls to that place in each of us that still believes in magic. Join pals Pooh, Piglet, Kanga, Roo, Owl, Rabbit, Tigger and Christopher Robin as they enjoy their days together and sing their way through adventures.",
  "releaseYear": "1977",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/njqwnMbU0OtmD87Rc5vM7fNjv9T.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 10.0,
    "funny": 9.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is my 2nd favorite Winnie the Pooh movie. Gorgeous animation and sweet stories one of Disney's best animated movies ever. The story's and direction were fantastic. I loved ever single song in the movie. Winnie The Pooh is one of the cutest Disney characters and one of my favorites. This is one of my favorite Disney movies ever and one of my favorite animated movies ever as well."
    },
    {
      "rating": "8",
      "text": "Very entertaining children's film with hilarious writing and great characters."
    },
    {
      "rating": "10",
      "text": "This must be Disney's last package film to be released. I didn't review any of Disney's package films because I didn't watch them when I was a kid. I did remember The Three Caballeros trailer and when I was a teenager i did watch them so that's saying something. Now Winnie the Pooh. Pooh Bear. He sounds like Mr Stork from Dumbo, The Cheshire Cat from Alice in Wonderland, Kaa from The Jungle Book and Roquefort from The Aristocats. He can do all the voices in all the Disney classics, he can also narrate too. Speaking of narration the narrator sounds like Bagheera from The Jungle Book. The songs are catchy like for example the Heffalumps and Woozles song where pooh is dreaming surely reminds me of Pink Elephants from Dumbo. The scenes are funny with those disney characters, Pooh Bear is the most lovable character and likes eating honey, Piglet is a smart pig who I can't describe him cause he's seemed to be a cute character, Tigger is a bouncing tigger who likes to bounce a whole lot, Rabbit is funny and wants his garden to be clean and doesn't Tigger bouncing, Eeyore is a bored donkey and has nothing to be worry and Christopher Robin who is Pooh's best friend and like animals friends. There is one scene where Rabbit told Tigger he promised not to bounce again not even the smidgen of a bounce so Tigger walks away sadly and that makes me cry when I was a kid now I'm sure nobody notice that but that's over Rabbit admits he likes the old Tigger and I forgot to mention the scene where Rabbit wondering around the forest, that's funny too.Wherever they go, and whatever happens to them on the way, in their enchanted place on top of the forest, a little bear will always be waiting."
    },
    {
      "rating": "9",
      "text": "Delicious As HoneyThis film about Winnie The Pooh is definitely a satisfying one."
    }
  ],
  "recommendations": [
    "the_aristocats",
    "winnie_the_pooh_blood_and_honey",
    "tangled",
    "aladdin",
    "the_fox_and_the_hound",
    "toy_story",
    "the_jungle_book",
    "moana",
    "the_princess_and_the_frog",
    "the_sword_in_the_stone",
    "the_grinch",
    "rio",
    "madagascar",
    "home_on_the_range",
    "trolls",
    "the_peanuts_movie",
    "brother_bear",
    "bolt",
    "looney_tunes_back_in_action",
    "the_nightmare_before_christmas",
    "strange_magic",
    "enchanted",
    "the_little_mermaid",
    "shaun_the_sheep_movie",
    "the_muppets"
  ]
}