{"id": 1268, "title": "The Wild", "starring": ["Kiefer Sutherland", "Jim Belushi"], "runtime": 95, "genre": ["Family", "Animation"], "description": "An adolescent lion is accidentally shipped from the New York Zoo to Africa. Now running free, his zoo pals must put aside their differences to help bring him back.", "releaseYear": "2006", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/sxqzaOto1qyUseSg6YpIP9Su5lp.jpg", "categories": {"plot": 2.9047619047619047, "acting": 1.6666666666666667, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 4.846153846153846, "action": 4.75}, "reviews": [{"rating": "1", "text": "The Wild is possibly the most irritating animated film I've ever seen. Everything about it is just plain annoying. The best part of the whole movie is when the wildebeasts sing the \"I'm Having A Nice Day\" song, and the only reason I like that part is because it's easy to annoy people by singing it nonstop. And it's the only thing I really remember other than the story is like the version of Madagascar that got thrown out and some body picked it out of the trash and made it, the most annoying voice I've ever heard for the lead character, and other mismatched voices that didn't seem to fit very well, jokes that weren't funny... I could go on and on. But I wont. This movie sucks."}, {"rating": "3", "text": "It's like someone threw Madagascar into a blender with Finding Nemo. The plot is very unoriginal, the humor is overly silly and childish, and the characters aren't very memorable. As far as animation goes, it's alright. Not necessarily bad, just... alright. All in all, The Wild is an mediocre, overly goofy mish-mash of stories that have already been told before. Definitely NOT something you would expect from Disney. 3/10."}, {"rating": "3", "text": "There's that one laugh here and there but al in all this was a hard film to watch do to the fact that you want to shut up every one of those animals mouths. The plot was pretty drowsy and the characters were obnoxious. All I'll say is I've seen worst. So nice try Disney maybe next time"}, {"rating": "0", "text": "I took my 3 year old to see it and HE wanted to leave! This movie is Horrible. I'm dissapointed in Disney. I don't understand why Disney needs to stamp out movie after movie, where the main character doesn't have a MOM, and there is unnecessary violence and scary scenes. \"Hey Disney... you're making CHILDREN'S movies, REMEMBER!\" The Wild is boring, doesn't make any sense, a rip-off, too scary, too stupid. Sorry I wasted my time and money."}, {"rating": "0", "text": "A massive rip off of Madagascar and it is also so boring, not funny, and childishly written. I find this film to be terribly animated and terrible altogether. I give this movie 1%."}, {"rating": "8", "text": "Better than most of the pack in this summers CG race. Visually stunning to behold it's sometimes difficult get into the story because you are so wow'd by the visuals. It moves along at a breakneck pace reaching the end in what seems a lot shorter time than it's 94 minutes suggests. Sill funny without succuming to too many pop culture references and fart jokes kids will enjoy and adults will not be bored."}, {"rating": "8", "text": "Good."}, {"rating": "10", "text": "Surprisingly entertaining.  A film similar to this, Madagascar, got all the attention, but in retrospect, this is a far better story.  It actually HAS a story.  Voice talent is good particularly eddie izzard as a not so lovable koala.  Visually there's a lot to see and there are some nice shots, but the realistic take could have been more fun if they animals did more broadly funny stuff that would take advantage of the fact that this is animated and not live-action.  Overall, worth checking out."}, {"rating": "1", "text": "I really didn't enjoy this movie. It is way too similar to the movie Madagascar. The story and even some of the animals are similar to Madagascar, which is superior to this by far."}, {"rating": "10", "text": "i remember seeing this movie in theaters i loved it so much that the minute it came out on dvd i bought it as soon as you could say EARS it was that good go check it out :)"}, {"rating": "10", "text": "not as worst    as everyone put it    itt needs help............................................................."}, {"rating": "10", "text": "Surprisingly entertaining. The movie has humor and heart and a unique look. Worth checking out."}, {"rating": "0", "text": "What happens when you take Madagascar, a horrible movie, and make it even horribler? You get The Wild, a steaming pile of unfunny, unexciting, and just plain boring crap with average visuals, no witty jokes, no gross-out jokes, no smart jokes, no slapstick jokes, no innenuendo jokes, just a lot of really, really, bad gags taped together to a rip-off of a bad movie. I wouldn't wish this one my worst enemy. What's wrong with Hollywood? How hard is it to make a decent movie?"}, {"rating": "0", "text": "Quite possibly the worst film of all time. I'm loathe to say it though as I love Eddie Izzard. My 9 year old daughter was looking forward to it but was devastated by how \"rubbish\" is was. Do yourself a favour and see Madagascar instead."}, {"rating": "10", "text": "This is a fast paced and visually stunning movie."}, {"rating": "9", "text": "Technically brilliant. Kids should love it."}, {"rating": "2", "text": "The Wild is a piece of garbage. The plot is unoriginal, predictable, and cliché giving us nothing we haven’t seen before. There is no heart in this film just a lot of dumb laughs. The characters are not good at all. Most of them are either soulless and/or exist to get a cheap laugh or have dumb jokes. It doesn’t help that the animation is ugly. Even without comparing it to Madagascar and how this movie is a rip off of that one this movie sucks. Unless you are a toddler who has no taste in film I would recommend avoiding this movie at all costs it is a whole lot of nothing. It is depressing to see Disney sink this low (I’ve heard it was another animation company that did this but still regardless no studio should have this on their track record)."}, {"rating": "8", "text": "Extremely funny and a good movie for kids, and even better adults won't be bored out of their minds watching it. The story is a lot like Madagascar, animals escape from the zoo and got to \"The Wild\", so it's not all that original but it's funny enough to keep you and your kids entertained on a family movie night. Worth a rental."}, {"rating": "5", "text": "The plot, settings and entire idea is unfortunately almost identical to 'Madagascar'.  Its all completely and totally predictable with visual gags that have been used all before. The animation isn't that bad, a different style to 'Madagascar' with fur effects giving a little more realism, Ryan the cub is undeniably cute. The wildebeests actually look pretty cool I though, quite evil and I liked the little intro animation revolving around them at the start.\r Shame they chose to include modern pop music within the film but other than that its a fair animation that is fun to watch. Had it come out before Madagascar,  then the tables would be turned, but such is life."}, {"rating": "4", "text": "That movie is another farce, since the plot was a carbon copy of Finding Nemo but a wild look and play the same style of Poseidon the resounding winner is Madagascar."}, {"rating": "1", "text": "I Hate this movie, so much that i consider this the WORST Disney Animated Movie. Is even worst that Chicken Little or Home of the Range. The characters are bland, the jokes are not funny, the plot is predictable and cliche and the message sucks. Everything about this movie screw up. So please, DON'T SEE THIS MOVIE. You better see Madagascar, is 100.000.000 better then this."}, {"rating": "2", "text": "super duper subpair and unoriginal and well just completely crap.no just no. Finding Nemo Madagascar and a hint of lion king done completely wrong and stupid."}, {"rating": "2", "text": "If DreamWorks can rip-off several Disney movies, then Disney will rip-off one DreamWorks movie before DreamWorks can even rip-off a Disney movie. Disney's trying to rip-off Madagascar, folks. DreamWorks Animation should've sued Disney on this film after it was released. Madagascar will always be better than the Wild no matter what these critics say."}, {"rating": "1", "text": "If you saw the previews, and thought this movie would be an inferior ripoff of Madagascar, Finding Nemo, Ice Age, The Lion King and Anastasia, well, you would be right. The plot is terrible, the movie is not funny, and it's all been done before. Worse, much of it doesn't make sense. A tugboat that can cross the ocean? Chameleons that can make things invisible? WTF? Hell no! That's unacceptable!!! It's as if the movie didn't exist. So don't watch it. It's garbage. No one cares about The Wild. If you wanna better film, watch Anastasia, Ice Age, Shrek, Titan A.E. or any other good movie out there better than this horrible movie. And now let's grade the film. Animation: F- Characters: F Story: F+ For Kids: No freaking way. Nuh-uh. NO! Music: F Voice Acting: F Overall: F-. So yeah. It sucks dick. IT MUST BE FREAKING BANNED FROM THE WHOLE WORLD!!!!!!!!!!!! GRAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! >8O"}, {"rating": "6", "text": "The Wild roars and thunders back from a rocky 1970s' opening act to a storming last reel, just managing to claw its way above comparisons with \"Madagascar.\""}, {"rating": "6", "text": "The Wild roars and thunders back from a rocky 1970s' opening act to a storming last reel, just managing to claw its way above comparisons with \"Madagascar.\""}, {"rating": "3", "text": "A massive rip off of Madagascar and it is also so boring, not funny, and childishly written. I find this film to be terribly animated and terrible altogether. I give this movie 33%."}, {"rating": "4", "text": "That movie is another farce, since the plot was a carbon copy of Finding Nemo but a wild look and play the same style of Poseidon the resounding winner is Madagascar."}, {"rating": "3", "text": "A massive rip off of Madagascar and it is also so boring, not funny, and childishly written. I find this film to be terribly animated and terrible altogether. I give this movie 33%."}, {"rating": "5", "text": "That movie is another farce, since the plot was a carbon copy of Finding Nemo but a wild look and play the same style of Poseidon the resounding winner is Madagascar."}, {"rating": "6", "text": "The Wild roars and thunders back from a rocky 1970s' opening act to a storming last reel, just managing to claw its way above comparisons with \"Madagascar.\""}, {"rating": "6", "text": "That movie is another farce, since the plot was a carbon copy of Finding Nemo but a wild look and play the same style of Poseidon the resounding winner is Madagascar."}, {"rating": "6", "text": "The Wild roars and thunders back from a rocky Walt Disney opening act to a storming last reel, just managing to claw its way above comparisons with \"Madagascar.\""}, {"rating": "1", "text": "I Hate this movie, so much that i consider this the WORST Disney Animated Movie. It is even worse than Frozen. The characters are bland, the jokes are not funny, the plot is predictable and cliche and the message sucks A$$. Everything about this movie screws up. So please, DON'T SEE THIS MOVIE AT ALL. You better see Madagascar, Finding Nemo, or the Lion King. Those three are all 100,000,000 better than this piece of $#!T Grade: 0.8/10 F!"}], "recommendations": ["chicken_little", "yogi_bear", "uglydolls", "planet_51", "monsters_vs_aliens", "free_birds", "alvin_and_the_chipmunks_chipwrecked", "alvin_and_the_chipmunks", "transformers_revenge_of_the_fallen", "escape_from_planet_earth", "the_spongebob_movie_sponge_out_of_water", "scooby_doo_2_monsters_unleashed", "scooby_doo", "the_smurfs", "teen_titans_go_to_the_movies", "the_boss_baby_family_business", "hotel_transylvania", "ice_age_dawn_of_the_dinosaurs", "show_dogs", "home_on_the_range", "wonder_park", "norm_of_the_north", "the_lego_movie", "the_cat_in_the_hat", "barnyard"]}