{
  "id": 2844,
  "title": "The Forbidden Kingdom",
  "starring": [
    "Jackie Chan",
    "Jet Li"
  ],
  "runtime": 104,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "An American teenager who is obsessed with Hong Kong cinema and kung-fu classics makes an extraordinary discovery in a Chinatown pawnshop: the legendary stick weapon of the Chinese sage and warrior, the Monkey King. With the lost relic in hand, the teenager unexpectedly finds himself travelling back to ancient China to join a crew of warriors from martial arts lore on a dangerous quest to free the imprisoned Monkey King.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mkrwLBAFHwLnQF8qdhCH0VOQqff.jpg",
  "categories": {
    "plot": 6.67741935483871,
    "acting": 7.105263157894737,
    "ending": 7.75,
    "soundtrack": 5.0,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 8.666666666666666,
    "action": 7.086956521739131
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I liked Jackie Chan and Jet Li in one great kung fu fighting movie. I recommend it to everyone who love's this type of movie."
    },
    {
      "rating": "7",
      "text": "Excellent action and good humor. Could even take your kids to see it."
    },
    {
      "rating": "7",
      "text": "It was ok suprisingly. The action was good and it was great to finally see Chan and Li fight against each other in a film. The plot was alright but it was just a bit too stupid at times. Overall though it was entertaining and worth the watch."
    },
    {
      "rating": "9",
      "text": "I was surprised by this movie since I didn`t hear much about it. I guess I shouldn`t be cause Jet Li, and Jackie Chan are a great duo.The sounds the action all make for a great adventure.The Heroes and the Villans give you a feeling of a different world, and that`s what I look for in a movie."
    },
    {
      "rating": "10",
      "text": "The story is to return the staff to the right owner. Great movie. Full of action. A decent martial arts movie."
    },
    {
      "rating": "8",
      "text": "If you love martial arts flicks as much as everyone involved in this production, you'll have a blast! Light-hearted in tone with every variety of kung fu and countless references to Hong Kong classics."
    },
    {
      "rating": "8",
      "text": "While the dialogue in the movie is cheesy at times this movie is definately entertaining."
    },
    {
      "rating": "3",
      "text": "I desperately looked forward to this and was thoroughly disappointed. The story was garbage, the kiddie lead annoying, and they didn't give Li or Chan enough quality fighting time."
    },
    {
      "rating": "10",
      "text": "This movie is so entertaining that I want to see it again. It is hilarious and doesn't take itself seriously. Beautiful cinematography and well done CG, with awesome kung fu. Simply put, I love it. It should've been marketed as summer blockbuster movie. I highly recommend it."
    },
    {
      "rating": "6",
      "text": "I wanted to like this movie -- I really, really did. Jackie Chan and Jet Li are (well, were) the best at martial arts action films, and the prospect of them as a kind of chop-socky Odd Couple was irresistible. I'd been looking forward to it for months, and went to see it on opening day. What I didn't realize was that this was neither a martial arts comedy (like Chan is known for) or an epic (like Li has done) but rather, at its core, a children's movie. It's like The Karate Kid meets The Neverending Story -- complete with training montages, \"real world\" bookends, and a gawky hero that was a little too aggressively banal to like. There are moments of excellence; Jet Li's exuberance as the trickster Monkey King is genuinely delightful, and both the good-girl and bad-girl characters are ridiculously attractive. In the end, though, all I could think about was how much I would've enjoyed the film if I were 11. To be fair, parents of 11-year-olds should definitely consider this one for a Saturday afternoon. The rest of us, however, should save our money."
    },
    {
      "rating": "7",
      "text": "What does John Lennon and \"The Forbidden Kingdom\" have in common? They both do the Oz; but they don't do God. Against the backdrop of a cerulean sky, Jason(Michael Angarano) envisions kung fu fighting on dreamscape mountaintops. The warriors fly around like substitute angels. Their staffs are malevolent harps. Later on, when Jason finds himself in a predicament that confirms the timelessness of Newton's Law, life doesn't flash before his eyes like a god-fearing man. Instead, he goes to the mythical China of celluloid reality, just like how a Yoda acolyte-wanna-be would jettison himself to a planet far, far away, in a heartbeat, if his heart stopped. Once there, Jason demonstrates his knowledge of chopsocky. The narrative is standard fare. He's not trying to reinvent the wheel, like Ang Lee(\"Crouching Tiger, Hidden Dragon\"), but the boy's narrative shows the influence of his own culture; popular culture(e.g. the preponderance of CGI effects). As the casting director of his own imagination, he uses a twilight Jackie Chan, and an equally white dwarf-ish Jet Li, to help him free the monkey king(Li as Bruce Lee in code. \"Monkey Man\" was a ska classic by The Specials. Bruce Lee was special. Jason could be a ska fan. An anagram for \"ska\" suggests Kansas: \"Ka[n]s[as]\".). To Jason's credit, in the film within a film, he learns kung fu, but not to an extent, in which he'd defeat an obviously superior opponent, mano-a-(wo)mano. The martial arts-neophyte needs help. He's subordinate to Lu Yan(Jackie Chan) and the Silent Monk(Jet Li). Jason doesn't colonize his daydream by upstaging the people indigenous to the films he loves. It respects the genre. Like Victor Fleming's \"The Wizard of Oz\", Jason populates the movie in his head, with people from his life. Aware of Pink Floyd's enthusiasm for \"Oz\" during the recording of \"Dark Side of the Moon\", \"The Forbidden Kingdom\" seems to draw from John Lennon's solo debut \"Plastic Ono Band\"(\"God\", \"Do the Oz\"). The ex-Beatle believed in Yoko. Jason used to believe in \"Enter the Dragon\". But now that he's met Golden Sparrow(Yifei Liu), there's a good chance that the fantasy-addled boy, will enter the."
    },
    {
      "rating": "7",
      "text": "Jackie Chan and Jet Li give a magnificent performance. It's a shame the movie is not really about them. As has been said, it's a really a movie aimed for younger audiences. The fight scenes are impressive but the lead character is really quite obnoxious. I will give it a 7 because I got what I wanted out of this movie, and that is excellent fight choreography by 2 of my favorite film martial artists. I did my best to shut my eyes to the rest."
    },
    {
      "rating": "5",
      "text": "Those rating this movie above a 7 are, well, let"
    },
    {
      "rating": "9",
      "text": "The perfect adventure movie! You'll like it and your kids will love it. Well, to tell the truth, I loved it too. But then I have a thing for beautiful fighting scenes, amazing scenery and feel-good-fantasy-stories."
    },
    {
      "rating": "10",
      "text": "This movie i think is great, its a modern twist to the original monkey king. (i advise you to watch or read about the original monkey king before you watch this movie or else you might think its corny or cheesy- like many people) = I liked the twist at the end when jet li turned into one of monkey king's hair, i just thought he was acting 2 parts in the beginning/ = would i recommend it? - yes."
    },
    {
      "rating": "10",
      "text": "This Movie is great despite reviews, you love martial arts, Jackie Chan and Jet Li. This Movie is for you. I love martial arts and this movie was awesome."
    },
    {
      "rating": "10",
      "text": "It's just one big love letter to kung fu movies, and a real tribute to its two amazing stars!"
    },
    {
      "rating": "8",
      "text": "Though the storyline, as well as some choregraphy seem recycled from older movies, it's a breath of fresh air in the kung fu flick genre. It's great to see that Jackie and Jet are working together as well, and together, they made art in the style of martial arts. My only problem is the teenage boy who seems to ruin the movie at certain points."
    },
    {
      "rating": "10",
      "text": "I think it was absolutely brilliant. The style was a lot of fun to watch, and they handled a plot that could have been incredibly cheesy with a lot of finesse and believability. From a critical standpoint, they did a great job with this movie in the atmosphere they intended. In reviewing any movie, you have to consider what the intent of the movie was before you decide if it was good \"for you\". More critics (at least profession ones) need to learn to review from the point of view of the intended audience, not the reviewer him/herself, to decide whether the movie was good."
    },
    {
      "rating": "10",
      "text": "Great movie. I loved Jackie Chan and Jet Li together on the screen. The actress with the long white hair was really good. The teen actress was beautifull too. Loved it!"
    },
    {
      "rating": "8",
      "text": "The romance is complete crap but the fighting and story are really good"
    },
    {
      "rating": "6",
      "text": "It was not as good as I expected it be. You would thin that the two greatest martial artest would have been in a better. It was just not a good. I didn't understand anywhere it was coming from. The plot seem unreal. The only good thing that I like about the movie is that Jackiee Chan and Jet li was in it. It is about time that we saw a movie with the greatest Martial Art stars togther. It was a good movie but not the best."
    },
    {
      "rating": "8",
      "text": "Pretty good. The fighting was exciting, the dialogue was interesting, and the concept was excellent. Unfortunately the movie felt kind of rushed to me. It was too short and if it was to be really good it should have been lengthened to a trilogy."
    },
    {
      "rating": "10",
      "text": "Fricking amazing, can't believe didn't get an official box office release here in Oz (or did and I somehow missed it). I also kinda can't believe it got such a low score here on metacritic... Ah well I guess an ode to classic kung fu is not everyones idea of a great film... but Jet Li and Jackie Chan (especially without a bad Hollywood comedy script) was my idea of cinema gold."
    },
    {
      "rating": "10",
      "text": "This is the perfect escapist Far Eastern fantasy. For anyone (like myself) who has read lots of Eastern philosophy and mythology, this movie is an excellent blend of humour and fantasy. There are plenty of humorous references to Toaist and Zen Buddhism texts and legends. I loved when Jackie Chan mistaked a boy's stunned silence for complete understanding (\"He speaks does not know, he who knows does not speak\"). In this movie you will see characters and places from the Seven Taoist Masters, ancient Chinese folklore, and hear teachings from Zen Buddism. Its really alot of fun, with beautiful scenery, cool fight scenes, and plenty of comedy."
    },
    {
      "rating": "10",
      "text": "I love this movie, it's alot of fun for the whole family. Enjoy it for what it is a saturday morning kung fu flick on steroids."
    },
    {
      "rating": "4",
      "text": "Fighting is fine, but not a believable story. Don't take your watch with you, you'll be looking at it regularly."
    },
    {
      "rating": "9",
      "text": "The cast says it all and it lives up to every bit of it. If you like these movies you will get your moneys worth."
    },
    {
      "rating": "8",
      "text": "That's why American People dont appreciate asian cinemas, they do not know the real story of the Monkey King, well they have team up together the 2 martial arts superstars, and the story line is supperb, but they should not put an american actor in the film anyways."
    },
    {
      "rating": "10",
      "text": "I thought this movie was tremendous. I love martial arts flicks, and this one was funny, well-acted, and had lots of nods to fans of the two leads. I enjoyed the heck out of it!"
    },
    {
      "rating": "6",
      "text": "A pleasant surprise, I am not at all into martial arts/kung fu films, but the production was excellent, great special effects and a good story. The cast was fine. Good plot and enjoyable, very entertaining."
    },
    {
      "rating": "8",
      "text": "The plot in this movie is bogus and the dialog is cheesy, it will scratch the Kung-Fu maniacs itch, there is a lot of reasons to love or hate this movie, I would recommend trying this for yourself."
    },
    {
      "rating": "7",
      "text": "Jet Li and Jackie Chan's combination of powerful performances combined with decent storytelling make this a decent action movie."
    },
    {
      "rating": "7",
      "text": "Clever, dashing, and fairly amusing, \"The Forbidden Kingdom\" is a special kind of action adventure film that actually stimulates the audiences' minds as well as their eyes."
    },
    {
      "rating": "7",
      "text": "From the beginning of this movie (which I just decided to watch while channel surfing) I was not sure what I was getting into but was intrigued. This is a GREAT story that kept me interested, watching and completely entertained. Even the ending was well done and I never felt like the director \"jumped the shark\" with any plot lines or insulted my intelligence. Who knew the kid star in this movie had some serious skills! At the end I felt great about the movie and made sure to save it so my kids could watch it to. For kung-fu fanatics the opening scene may worry you a bit but the action gets better and better all the way to the end."
    },
    {
      "rating": "8",
      "text": "This is a great and entertaining movie on one hand but on the other hand if you think about Jackie Chan and Jet Li in one movie it misses the expectations a bit. Also it is their first collaboration which is mindblowing looking at both actors long list of roles in the same genre. I like the story, worldbuilding and characters atop of the humor. I don't think I need to mention that the martial arts and fight scenes are really good when you have both legends Jackie Chan and Jet Li atop on others and choreographer Yuen Woo Ping in the team. The story starts with Kung Fu fan Jason Tripitikas who after a chain of unlucky events ends with an ancient staff and is drawn into the (mythical) ancient China. Here he is told that the staff is far more important than he imagined and is chosen on a quest to return it. I am vague here because of mayor spoilers. The story is excellent and uses a lot of legends and myths of China. Be it elements from Journey to the West, the legendary eight Immortals and fantasy tropes. I think it uses a lot of care and love to make staples and tropes enjoyable and worthwhile. While I am at it I want to praise the visuals to. Be it the sets, costumes and locations. Everything adds to the style and atmosphere of the movie. Lets continue with the actors. Jet Li and Jackie Chan deliver. It might be neither s best performance but it is enjoyable, humorous and entertaining. Michael Anagarano as Jason Tripitikas is surprisingly good. A good heroes journey. The villains are enjoyable too with Collin Chou as ruthless and well plotting Jade Warlord and Li Bingbing as intimidating and unrelenting Ni Chang. From Liu Yifei as Golden Sparrow I wished to see more as she is a great addition. I think the cast delivered a great and fitting performance. Then there is the humor. It may not be a comedy but it delivers some good humor. I still remembered the summoning rain scene;-). The humor is a good addition and well integrated into the story. There is a fine balance for movies between being serious and still have humor. Too much or bad humor harms a movie with serious themes. Overall this was an enjoyable movie and worth watching. I fully admit that I expected more but this did not harm my experience. (Yes this is possible but a rare event). Might not be the greatest movie but a well crafted fairy-tale with good characters and enjoyable martial arts."
    },
    {
      "rating": "4",
      "text": "On se réjouit de voir enfin réunis les deux virtuoses du Kung Fu dans le même film (non, ce n'est pas le mariage pour tous...) ; les deux stars s'affrontent gentiment mais spectaculairement, puis se taquinent mutuellement pour la plus grande joie du spectateur.En même temps, on regrette que cette superbe occasion soit si mal organisée, si niaise et si maladroite... car dans le \"Royaume interdit\", nos héros sont déjà bien vieux et s'effacent devant le véritable \"héros\" de l'histoire (à dormir debout), en l'occurrence un jeune gogol double combo (tronche de cake -et- tête à claques) qui doit remettre le bâton perdu au Roi-Singe prisonnier...L'occasion en tout cas de moult combats très correctement filmés qui n'abusent -pas trop- des câbles... et outre nos deux vieux (pas si vieux tout de même, j'exagère...) la présence de deux beautés chinoises ravissantes (une gentille et une méchante...).Trop bêbête et trop grand public, le film ne convainc jamais et se révèle un rendez-vous manqué, vite oublié mais qui restera dans les rouleaux de l'anecdote super...ficielle."
    },
    {
      "rating": "5",
      "text": "Watching teenage oriented Jackie Chan movies is a bit of a guilty pleasure of mine at times and I had seen an advert for the movie so I though it might be of interest, now having seen it, I'm left with the usual feeling that it was neither a bad nor a particularly good movie. I can't decide how to feel about such movies, their the kind of movie where you feel when your watching it that its quite entertaining and interesting but a day or so afterwards, you struggle to remember most of the story and its highly doubtful that I'd want to watch it again. The movie is quite fantasy based with the scenes with 'Golden Sparrow' (the female love interest, who appears like an angel) for example and some of the landscape shots and im sure it would look quite impressive if played on a large widescreen TV, the cinematography in itself is pretty good, although equally it doesn't have the feel of being a film where the largest budget was spent either (its somewhere inbetween, if that makes any sense), its not quite Crouching Tiger Hidden Dragon, the scenes in mythical China have an almost animated feel to them. I thought that it reminded me of the Final Fantasy console games perhaps. The characters were interesting at first but the story seemed to lack something and thats what lets it down, I feel. I'm pretty sure that a good amount of young teenagers will enjoy this movie for the fighting scenes, which are quite good and the whole coming of age element to it but if you analyse the movie in terms of the character development and what substance there is other than the pretty good scenery, your not left with all that much. The story just seemed too much of a 're-hash' job, I mean there are so many similar movies really and I feel this had the potential to be better. The main character of Jason I didn't feel was overly likeable either, not much is really told about him until quite far into the movie and I think perhaps if more was somehow told and there was more background information provided on both Jason and his small group of followers that end up joining him on his quest, then that would add quite a bit to the movie, it certainly helps when the viewer feels sufficiently keen to see a good outcome for those involved but there didn't seem to be enough details provided to make the viewer feel particularly strongly either way, IMO, which is perhaps a little cruel but either way I do think this movie badly lacked enough character development to give us viewers a strong enough vested interest in the result of 'the big finale'.As it turns out, Jackie Chan is joined by Jet Li in this movie, both of which are, obviously, very successful actors but yet they only play secondary roles as Jasons companions and it did feel as if their potential hadn't been fully used, which was a shame. Watching the scenes where they all walked through deserts and other landscapes on their way to fight the Jade Warlord, it dawned on me that this movie is perhaps somewhat also like the Lord of the Rings movies/stories perhaps, in that its trying to be an epic comg of age type adventure or discovery or something, so it certainly had lofty ambitions, you could say, it just doesn't quite come up to scratch somehow. Its not a very long movie, however, at under two hours long and it would probably keep the attention of a younger audience (its rated 12 so young teenagers, which is clearly the intended audience anyway, I guess im getting old to be watching such movies lol) compared to the Lord of the Rings movies and it is just one movie and not three, which is perhaps an advantage to some! I just felt that it wasn't anything particularly new, story wise really, its a movie that feels like it has potential and they tried to make it seem quite fantastical, indeed the scenery is quite impressive at times and the acting is pretty good but the characters lack real depth and the story is somewhat formulaic, plus the ending I felt was rather unfulfilling and might disappoint others. I can't say that I feel this is an awful movie because I did enjoy some aspects of it, some of the scenes such as the fight scenes, were done well and the landscapes are quite impressive, there's a pretty good cast and its entertaining enough to pass the time it just could have quite a bit better and its a shame it wasn't I think. Its quite possible that younger people (ugh I really must be getting old lol) will enjoy it more than I did and I wouldn't say its not worth giving it a chance if it comes on TV but its not a movie I'd rush out to see in itself. Basically it could be better but it could be worse, I'll give it a 5 out of 10 for effort! lol.If your particularly interested in seeing this due to the cast then I'd recommend you rent it rather than buying it because its really not the sort of movie I think many people would want to re-watch and so I can't recommend purchasing it specifically. Its not really bad but its certainly not memorable either, in my opinion."
    }
  ],
  "recommendations": [
    "kung_fu_panda_2",
    "shang_chi_and_the_legend_of_the_ten_rings",
    "kung_fu_panda_3",
    "hercules",
    "captain_america_the_first_avenger",
    "the_mummy",
    "the_scorpion_king",
    "tron_legacy",
    "kung_fu_panda",
    "dredd",
    "indiana_jones_and_the_temple_of_doom",
    "fearless",
    "morbius",
    "top_gun_maverick",
    "prince_of_persia_the_sands_of_time",
    "the_suicide_squad",
    "the_three_musketeers",
    "the_adventures_of_tintin",
    "thor_ragnarok",
    "avengers_age_of_ultron",
    "the_karate_kid",
    "last_action_hero",
    "the_one",
    "around_the_world_in_80_days",
    "rango"
  ]
}