{
  "id": 4054,
  "title": "The Thomas Crown Affair",
  "starring": [
    "Pierce Brosnan",
    "Rene Russo"
  ],
  "runtime": 113,
  "genre": [
    "Drama",
    "Crime",
    "Romance"
  ],
  "description": "A very rich and successful playboy amuses himself by stealing artwork, but may have met his match in a seductive detective.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5yqs1MVlqdIg1DY5adC5jFx3d7j.jpg",
  "categories": {
    "plot": 5.75,
    "acting": 7.5,
    "ending": 0.0,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The Thomas Crown Affair proves to be a decent movie with a slick, confident performance from Russo, and an even slicker, more confident performance from Brosnan. The story is interesting, and the chemistry between the two leads is top-notch."
    },
    {
      "rating": "10",
      "text": "Brilliant! Definitely better than the first, gripping right from the start. Loved it."
    },
    {
      "rating": "10",
      "text": "Pierce Brosnan and René Russo in absolute top form! A heist-movie that is one of the great paragons for the also brilliant Ocean's-movies. And, of course, one that doesn't have to hide behind them. Awesome!!!"
    },
    {
      "rating": "9",
      "text": "The world didn't need a remake of The Thomas Crown Affair. We didn't need it, but we got it anyway -- and it's absolutely positively absuredly terrific."
    },
    {
      "rating": "10",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%%%%%%%%%%%%%\"\"\"\"\"\"\"\"\"``````............................"
    },
    {
      "rating": "10",
      "text": "..........,,,,,,......,,,,,,@#$%^&*()_=_÷×+€?\";?!;;▪○[]{}♡■♤●•▪○¤●●■■▪▪¡¡《》¿○▪☆⊙⊙°°●⊙》¡°••●●■●"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "$.$.$.$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "knonihhiihihihhonjoojonininnoonigugffyfttyuuyyyuuuininojjojoojohojohhiguygugihihihihihhi"
    },
    {
      "rating": "10",
      "text": "bjugugggugugihihihigyfrsytigugugihihuftsreytututuguguugu•••••••••••••••••••••••••••••••••••••••"
    },
    {
      "rating": "0",
      "text": "This was easily MCTiernan's worst film.  Rene Russo was horribly miscast, the music was awful and overbearing, the ending was wrought with cliches and the majority of the film suffers from cheesiness.  It is a cringeworthy experience."
    },
    {
      "rating": "9",
      "text": "This is one of the best remakes I've ever watched.  It's been too long since I watched the original but this movie stands on its own with powerful performances from both lead actors.  And the score is brilliant as well."
    },
    {
      "rating": "5",
      "text": "breathes well enough to survive..The Thomas Crown AffairThe Thomas Crown Affair is a plot driven thriller drama about a heist that undergoes a severe investigation enfolding and revealing brutal information. The camera work is daft and utterly busy where its instability that ought to create the crisp and instead backfires vigorously. No matter how sleezy the subjective procedure gets, its resultant effect leaves quite an impression that makes it supremely watchable. The narrative is gripping and adaptive if not layered as the makers might suggest for its self-constructed methodology is its doom. The background score is incongruent with questionable cinematography and amateur editing. Ticking for almost two hours, it is thoroughly entertaining and at times a bit cheesy too. The scoreboard mentality on the script is not a con but a pro of it since it is foliated in a chess game where uncertainty is the ultimate adrenaline rush it can offer to the viewers. Brosnan is equally mysterious and vocal about his experiences and so is Russo and Dunaway supporting him thoroughly. The chemistry between the lead cast is what fuels this sometimes sloppy and over-stretched tale that leaves the audience with mixed feeling. The nature of an affair might be exaggerated but has aptly adapted the metaphor that it soars through the entire feature. McTeirnan's execution is more style than substance and this time he has substance that allows him to flaunt on a large scale and it works like a charm. The tiny notions that all the tactics are brimmed with which leaves the audience in an awe of it, the panache Brosnan carries it in his briefcase and gripping and tightly packed screenplay that keeps us tangled in its smoke and mirrors bubble are the high points of the feature. The Thomas Crown Affair may never be more than a heist, but it is competent faith on his existence and it breathes well enough to survive."
    },
    {
      "rating": "8",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"
    }
  ]
}