{"id": 4349, "title": "The Witches of Eastwick", "starring": ["Jack Nicholson", "Cher"], "runtime": 118, "genre": ["Comedy", "Fantasy"], "description": "Three single women in a picturesque Rhode Island village have their wishes granted - at a cost - when a mysterious and flamboyant man arrives in their lives.", "releaseYear": "1987", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mKX8o7BVFrpyXoN8iKIUDLSj6xX.jpg", "categories": {"plot": 8.107142857142858, "acting": 8.0, "ending": 8.0, "soundtrack": 7.6, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 7.571428571428571, "action": 8.0}, "reviews": [{"rating": "7", "text": "The Witches of Eastwick is a natural follow-up to the Mad Max series for director George Miller. I mean, what else was a man who directed a trilogy of gritty Australian action movies expected to make? This New England set suburban fantasy horror comedy focuses on three women. Divorced, deserted, or widowed, from their husbands, the trio of Jane (Susan Sarandon), Sukie (Michelle Pfeiffer), and Alexandra (Cher) are lonely and occupy their time by hanging out with one another and their kids. In other words, they have no lives left whatsoever beyond discussing how they hate men and desperately want to meet the perfect guy. In steps the mysterious Daryl Van Horne (Jack Nicholson). Bewitchingly devilish, Daryl manages to rope in these three women and successfully seduces all of them, turning them into his little sex slaves. A comedy for the whole family, The Witches of Eastwick is a battle of the sexes for the ages.Throughout this film, men are really criticized. Even Daryl gets in on the action, lamenting how men kill women in marriage by squeezing out every bit of life in them, arguing that men keep women oppressed due to their own self-consciousness over penis size and power, and believing that women blossom once they ditch the men in their life. For the trio of witches/women, they whole-heartedly agree and see men as slick, repulsive, arrogant, and selfish. Yet, they cannot help themselves. Once they hear Daryl say he wants them, even if they would normally say no and do not find him attractive, they give in to his every whim. On the other hand, Daryl goes from praising women for their ability to give birth and produce milk to ripping them apart as nothing but a mistake and curse from God. After giving them so much, he is baffled as to how they could now reject him. How could they want more? He has already given them the world and powers previously inconceivable! Why are these women so unsatisfied?However, the truth lies in the relationship between men and women. Unless you are gay, the fact that men and women do not work together at times yet desperately need one another at all times will personally impact your life. Even then, you may hear friends in relationships lament about how awful their mate is, yet then express love for them to the next day. This \"cannot live with them, cannot live without them\" element is very much the status quo at times. Going from loving to being annoyed, The Witches of Eastwick oddly enough perfectly exemplifies this turbulent relationship, though shown between witches and the devil himself. If nothing else, it shows that nobody is immune from the strife that arises between two vastly different people coming to live with one another and build a life together as a single entity. This on-again and off-again relationship is one also shown by Clyde (Richard Jenkins) and wife Felicia (Veronica Cartwright) once she breaks her leg and becomes a tool for the devil to punish her incessant warnings about Daryl's home. Annoyed with her, Clyde is nonetheless beholden to her - as he rips his own reporter, Sukie, in a story about Daryl after Felicia begged him to do so - and annoyed with her - as he works the fire and gets some nefarious ideas and actions regarding his now grating wife. Yet, these extremes of sacrificing everything to sometimes wanting to ring their neck (not literally) is what defines the relationship between men and women. In The Witches of Eastwick, Miller showcases just how challenging it can be, especially when it is three women versus one man.Furthermore, the film often exemplifies the ideas of Laura Mulvey. To Mulvey, women in film have two roles. One, that of child-rearer. Second, as castrator due to their incessant penis envy. For the former, the film shows them all get pregnant or be mothers with Daryl lauding women's ability to get pregnant and carry a child to term. For the latter, the women frequently talk about the size of men's penises and what they would prefer only to later give Daryl's voodoo doll a very noticeable member. Often **** these women - especially as they seduce Daryl later in the film - The Witches of Eastwick is a film that is all about penises. Men have them. Women do not. Men are protective and self-conscious. Women want them. Why? Penises represent power. Men must shield theirs and push women down to ensure that they can keep the power. Women want the power and will come straight for the jugular to get this power. By the time the women take down Daryl, we see his shriveled body and later see him as just a head on a television set where the women have the remote to shut him off. Losing his penis, and thus his power, Daryl is now beholden to the whim of these women as they have, effectively, castrated him while nonetheless giving birth to his children. Exemplifying this role of castrator and child-rearer, these women are ones who want the power and will stop at nothing to take it all from Daryl."}, {"rating": "6", "text": "This film is a 1987 comedy fantasy/horror but also some romance features added to it. The Witches of Eastwick is based on a novel by John Updike and stars Michelle Pfeiffer, Susan Sarandon, Cher, Richard Jenkins, Veronica Cartwright and Jack Nicholson..... It's basically about good vs evil and I can't remember if the three women (Cher, Sarandon and Pfeiffer) are witches in the movie but as far as I remember they are but don't quote me. Anyway a mysterious stranger comes into their lives (Nicholson) and the rest you can judge for yourselves. A fairly violent film and Jack Nicholson mocking God which is hilarious and the vomiting grapes scene by Veronica Cartwright and the use of witchcraft, voodoo or some nonsense and romance. It's a strange film and a strange story by director George Miller but entertaining however not the best film but by no means the worst and if you want some recommendations about better Jack Nicholson films I suggest watching Five Easy Pieces, Chinatown and The Shining."}, {"rating": "9", "text": "A good movie that won me over by the great performance of the cast and the story. Recently I discovered that it is based on a book of the same name by John Updike. This is the rare kind of movies that improves the story from the source material. It follows the set up and story of the book before adding a lot of ideas that makes this the better story for me. It is rare to say that a movie adaptation is better than the book. The story follows the three woman Alexandra, Jane and Sukie who are good friends and dissatisfied with their lives who live in Eastwick. All have bad luck with their marriages aka husbands. Once in the week they meet to a coffee party. One day they have the funny idea to summon a dream man for them. Out of this idea they make a ritual that non of them takes serious. However shortly after the mysterious Daryl van Horne arrives and buys an old mansion in Eastwick. This is the set up for the story. The story works well with the cast. They enhance the story and fully deliver. It is enjoyable and the progress is always interesting and increases the immersion. The climax and conclusion are great too. I will praise the director George Miller who is normally only or better said firstly associated with the Mad Max franchise. He made other movies which is normally not mentioned or ignored. This and Lorenzo’s Oil I see as hidden gems. Now to the cast. We have an intense Jack Nicholson as Daryl van Horne. An absolute great performance and I don't see how to improve this or how another actor would fit better. It ends not there as the female main characters also fully deliver. Be it Susan Sarandon as Jane Spofford, Cher as Alexandra Medford or Michelle Pfeiffer as Sukie Ridgemont. All are truly great in this movie and fully believable. For the rest of the cast I will praise Veronica Cartwright as Felicia Alden. All others have to small roles. The 4 main characters make this an excellent experience for me. Then we have a soundtrack from the legend John Williams. As always he enhances every movie he is involved. The special effects are well used in the movie. They enhance the scenes too and a failure here would cheapen this. Overall this is a hidden gem and I do not know why it is forgotten or lets say not more popular. I recommend this movie to everyone for a good entertainment."}, {"rating": "8", "text": "The Witches Of Eastwick is a great fantasy comedy. Excellent acting by major actors, especially Jack Nicholson. So only he could play the devil. The plot is based on a literary source, but not so gloomy, Daryl is not so cruel and selfish. Well, the ending here is great)"}, {"rating": "7", "text": "I confess that I expected something different from this movie, but I didn't feel dissatisfied with what I saw. It's an interesting and very provocative comedy that brings to the screen much of the content of a novel that I've never seen or read. The film, however, works on the basis of provocation for the audience, and launches barbs well aimed at our concept of God and Devil, of Good and Evil, our construction of moral values, the way we see women (or how it faces itself). It's a good movie, but it seems bent on annoying.The script is set in a small town where everyone knows everyone else, and where the arrival of a rich and eccentric new resident, who acquires a nearby mansion, is the reason for great confusion: he is strangely seductive in his way of being and speaking, and manages to charm three friends who end up romantically pairing up with him, which will cause scandal in the community, particularly in the more religious sectors. However, as they get to know him better, they begin to realize that they are capable of making what they really want to happen, and they will begin to learn to use these powers.It is with the arrival of the new resident that the film starts to get interesting, after almost fifteen minutes of preparation, introducing the characters and creating the environment. Strangely, and although it is obvious who the witches are, this is never said or discussed openly among them: they never come out and when they talk about their powers they do so almost without actually being plainspoken about it. For me, this worked poorly because it doesn't make sense, especially in a very tight circle of close friends, where one could generally speak more openly about any subject. Thus, the film leaves the magic and witchcraft almost implied. Towards the end, it insists on some lines that are highly provocative and make many moral and ethical issues questionable, even questioning the logic of divine creation by leaving the question whether God created Woman intentionally or did she end up being a \"failure of course\" of the Creator. I believe that some issues really bothered the public.There's no doubt that Jack Nicholson is the most striking face of this film, with an almost offensively sarcastic performance. He's ideal for the character, who combines cynicism and malevolence well with doses of charm that make us like him. As for the three witches, played by Cher, Susan Sarandon and Michelle Pfeiffer, I think they're great on their own and even better when they are together. It is quite visible throughout the film how the actresses understood each other and worked well together, and the quality of the interpretation reflects the effort and the combined work. Veronica Cartwright is, in my view, the actress who is responsible for giving the film a more regular villain, as her character, with tics of evident religious fanaticism, is the great opponent, both for the millionaire newcomer and for the three young companions who join him.Technically, the film has many values to consider, starting with tasteful cinematography, with a penchant for good wide-angle shots and aerial view perspectives. Good colors and a judicious choice of sets and filming locations (in particular the mansion, which is beautiful) help the film to have a truly elegant look and aesthetic. The film also has many special effects, convincing visuals and sound, with characters flying and levitating, tennis balls that seem to have a life of their own, cyclonic winds that seem to hit only one character amidst everything else and that unforgettable vomit that seems taken away from \"The Exorcist\". The music is masterfully used, helping to set the mood, starting right away with the idyllic and surreal environments of the mansion, with opera arias and classical music skillfully combined with an original soundtrack that is average but fulfills its role."}, {"rating": "8", "text": "This film combines a mix of fantasy, mild horror, mystery, comedy (relatively dark comedy at that) and drama - I suppose if anything its mostly a comedy drama, although it would also be fair to say that its a bit of a 'chick flick' as well, in as much as it features many female characters who are clearly good friends and are seen gossipping often. The main theme present in this film is obviously black magic, although sexual harassment does also play a part.It is quite dialogue heavy and the plot pace seemed relatively slow to start with. However, the film does well to build a sense of mystery, so as a viewer your left wanting to keep watching, to try and discover why things are as they are. It may seem a bit mundane at first and there isn't a great deal of obvious comedy as such from the get go but it is present as the plot builds. I found myself giggling at times due to the social faux pas situations that ocurred. It'd be fair to say that there is a definite element of eccentricity present in some of the characters and I quite enjoyed that (primarily it applies to Daryl Van Horne).Cast and character wise, Daryl Van Horne is played by Jack Nicholson, who portrays Daryl as a very flirtatious, suave yet perverse and creepy sounding middle aged guy. The other main characters include Alexandra Medford, played by Cher (the singer and actress), who seemed to (if anything) play her role a bit too strong, exaggerating her characters demeanour in a way that didn't entirely ring true to me, while Jane Spofford is played by Susan Sarandon and Sukie Ridgemont is played by Michelle Pfeiffer.I felt some of the dialogue was borderline misogynistic or otherwise somewhat sexist at times, although I did feel that there was an element of irony used and that those who made such comments were hardly seen in an entirely positive light. The way that the local community are depicted with the various community events and so on I thought was quite nice - it certainly had a quirkiness to it. Suffice to say, this is hardly a film which should be taken seriously, or one that even seems to take itself seriously and I was fine with that personally. There are comedies (black comedy or otherwise) which are so 'off the wall' and fairly ridiculous in terms of the paper thin plot that I lose interest and can't watch all the way through but I felt that this film had a decent amount of mystery present for the majority of it and it thankfully didn't feature continual toilet humour and extremely graphic language (although there certainly are instances of very strong language present). It seemed a bit better thought out than some of the comedies I've seen and given up with (two recent examples being Ace Ventura: When Nature Calls, which was beyond dire (in my humble opinion) and Your Highness, which was embarrassingly moronic and more immature than I'd even expected with my limited expectations to start with). The comedy is definitely less visual based and more dialogue based, for some of the scenes certainly.Music wise, instrumental music is featured in various parts of the film, as a character is shown playing the instrument (a cello by the looks of things).Content wise, this film features strong language, sex references, moderate violence and a few potentially distressing scenes which feature vomiting and the like. I wouldn't say its as upsetting as a few films I've seen in the past but its not ideal for anyone who is entirely squeamish I suppose. There is also a drug reference featured and multiple characters are shown drinking and smoking, so its maybe not ideal for youngish and impressionable teenagers to watch at a guess?. It carries an 18 rating, which surprised me given the fact that I've seen 15 rated films which were just as racy as this and I didn't feel the violence necessarily warranted the high rating - I can only put it down to the frequent sex references, plus a few instances where sex was clearly implied to be taking place if slightly off camera. I suppose it would be a bit embarrassing to watch with parents perhaps but then in the first half of the film, there were a good few scenes which barely featured any (to my mind certainly) explicit content but sexual promiscuity is certainly hinted at, if not shown in any sort of extreme detail (thankfully, some may think). Yes I'd recommend this film, as I felt it to be quirky and intriguing with some good characters and a decent amount of comedy, with some fairly witty dialogue. It is quite racy in parts with some graphic sex references and there are some distressing scenes featuring violence present but it isn't what I'd class as a major gross-out style film, it isn't exactly a slasher horror film, put it that way. I was semi-surprised it had been given an 18 rating and I can only put that down to the sex references, which are fairly explicit I suppose, hence I wouldn't actively encourage younger teens to see it but that aside, I'd say its worth a watch."}], "recommendations": ["elle", "unforgettable", "trainspotting", "20th_century_women", "don_jon", "closer", "thoroughbreds", "legends_of_the_fall", "secretary", "a_simple_favor", "the_favourite", "ingrid_goes_west", "bombshell", "the_last_duel", "enola_holmes_2", "me_before_you", "i_spit_on_your_grave_iii_vengeance_is_mine", "the_help", "moonrise_kingdom", "stoker", "the_reader", "black_swan", "captain_fantastic", "lady_bird", "swallow"]}