{
  "id": 1018,
  "title": "The Texas Chainsaw Massacre",
  "starring": [
    "Jessica Biel",
    "Jonathan Tucker"
  ],
  "runtime": 98,
  "genre": [
    "Horror"
  ],
  "description": "After picking up a traumatized young hitchhiker, five friends find themselves stalked and hunted by a chainsaw-wielding killer and his family of equally psychopathic killers.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qJ9Cw1J4EmhBApoue4qlhqVrCZ7.jpg",
  "categories": {
    "plot": 6.818181818181818,
    "acting": 6.294117647058823,
    "ending": 2.5,
    "soundtrack": 3.0,
    "cinematography": 6.090909090909091,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The original is about artistic insanity.The remake is about traumatic horror.And I love both of them."
    },
    {
      "rating": "2",
      "text": "Hardly produces a scare, or even a minute thrill. Poorly acted, poorly directed, and on a whole, very poor."
    },
    {
      "rating": "9",
      "text": "This movie gets alot of hell for being to far from the original. I personally think its better than the original. Its a extremely well made horror film. Instead of making an exact replica of the 1974 cult film, they take the basic idea and run with it, adding a great likable cast, gritty camera work, and a top notch musical score. While this is the remake that started the trend, its also one of the best horror films of the 20th century. 9/10."
    },
    {
      "rating": "7",
      "text": "Better than the Original. It had more storyline, the effects were better and it was much scarier. My only criticism is that it relies on bloody violence to make it more scary, but there was some brilliant suspense."
    },
    {
      "rating": "0",
      "text": "Seriously! Do you call this a horror movie! Can I even compare it with its prequel?! It is not scare not an R-Rated \"Horror\" should be at least a PG-13 or a hard PG if the first kissing scene edited, this is not a horror, its prequel is way to better, watch Texas Chainsaw 3D less **** and save your time, Micheal Bay's The Texas Chainsaw a good time for a 9 years old! Pretty much it!"
    },
    {
      "rating": "10",
      "text": "These characters have more development than the ones from the original.I also love how this film takes a similar path to the original, but does different things. Instead of a weirdo hitchhiker, now it's a victim who shoots herself.The original is very simple, but this remake has a lot of detailed storytelling, and the third act is very different as well.I love this film"
    },
    {
      "rating": "3",
      "text": "Terrible, just terrible. What Marcus Nispel demonstrated throughout the movie is how much blood he can present to the audience and how far his movie can fall into the Abyss of failure."
    },
    {
      "rating": "0",
      "text": "Just gross gore. There is NOTHING scary about this film. Films like this ought not be called 'horrors,' since they just gross people out. There is not a single psychologically frightening scene in this film... Made for teenagers, really."
    },
    {
      "rating": "9",
      "text": "In August, 1973, five teens set across the Texas highway on their way to a concert, when a chance encounter with a suicidal hitchhiker forces them to stop for help. As they wait for the town's hick sheriff to collect the body, two of the teens run off to a nearby house to use the phone, where they come face to face with a murderous clan of cannibals and their chainsaw-wielding son, Leatherface! THE TEXAS CHAINSAW MASSACRE is reborn in Platinum Dunes' 2003 remake, but where so many other attempts to revitalize the 1970's and 80's Slasher craze have failed, THE TEXAS CHAINSAW MASSACRE succeeds in shocking and terrifying a whole new generation of moviegoers. It is just what a remake should be, honoring the original with the same basic plot outline and characters, while creating its own unique identity and mood. Marcus Nispel's washed out color palette is drowned in putrid greens and blues, which give the misty forest and dilapidated hallways of the Hewitt household a sickening overall effect. While this version does feature more gore, it is not built on simply disgusting the audience, but takes just as much time developing a deep-seated terror and suspense. This creates moments of intense anticipation that pay off in jolting shocks! Although Nispel has chosen to fill the cast with familiar teen favorites, Scott Kosar's script makes them likeable characters with whom the audience can relate. The best choice obviously comes in the decision to hire R. Lee Ermy, whose crass behavior and vulgar humor make him perfect in the role of Sheriff Hoyt. Ermy dominates the film, and becomes even more sadistic and frightening than Leatherface, himself! Andrew Bryniarski's fast and forceful approach to the character makes him very imposing as well, even if he falls slightly behind Gunnar Hansen as the iconic killer. TEXAS CHAINSAW MASSACRE may not leave the same lasting impression as its predecessor, but its horrifying, edge-of-your seat excitement easily makes it the best remake to come out of the 2000's.\r -Carl Manes\rI Like Horror Movies"
    },
    {
      "rating": "3",
      "text": "The film was just good, but all the killings were very realistic. At some point it wasn't fun at all."
    },
    {
      "rating": "0",
      "text": "If you were scared byenjoyed this, firstly: may God have mercy on your soul, and secondly: watch the original. That was a masterpeice, taking terror into new, occasionally surreal, dimensions, pulling you protesting along with it. This is a pointless, mean-spirited, lazy-ass bloodbath that's even worse than the pointless, lazy-ass bloodbath that was Tobe Hooper's own TCM 2 from the burning radioactive wilderness of the 1980s. That Hooper's name is attached to this car-boot-sale remake is a very human tragedy. And they show Leatherface's face, which is like putting a voiceover at the end of 2001 explaining where the monoliths came from. Get out."
    },
    {
      "rating": "5",
      "text": "Not scary. But R Lee Ermey's performance as the Sheriff bangs you. [***SPOILERS***] Also, the slaughter-house scene where Jessica Biel cuts Leatherface's hand with a meat cleaver is good. Just the movie is too violent at times."
    },
    {
      "rating": "10",
      "text": "Fantastic! The way a good horror remake should be. The different approach to the story makes helps this film stand on its own. Performances were great as was the tension. Fantastic direction and camera work make it an enjoyable watch."
    },
    {
      "rating": "6",
      "text": "I watched the 1974 original before watching this remake. well, this one had a few changes with the killing scenes and the storyline, but to be fair, lets just say that whoever made it sure had a good try."
    },
    {
      "rating": "5",
      "text": "I enjoy horror movies. I'm not some crazy fan who will watch nothing but them, but i enjoy them. Is this movie good? No, not really. Is it bad? No, not really. Its EXACTLY in the middle. The acting was bearable and the movie changed up some scenes from the original which keeps it from being same old deaths (which the first one was over and over). The original was god aweful. Don't call me stupid for saything that because it's true. The only reason you people like it is because it's a \"classic\" and the only reason it's a classic is because it's \"true\". This movie did have useless gore in it but not enough to make me turn it off. Overall; Not bad, but not good.\rPS- To all you idiots out there who like it because it had gore in it. SCREW YOU! That does not make a movie so shut up. Blood does not make a movie good. You people just don't know movies."
    },
    {
      "rating": "8",
      "text": "A good remake so scary that you will die of fear."
    },
    {
      "rating": "9",
      "text": "No es tan aterradora ni grotesca como la original, pero tienes méritos propios como el hecho de ser una buena producción y ser el remake de clásicos del género más influyente de todos, sin este no existirían versiones actualizadas de Halloween, Viernes 13, Pesadilla En Elm Street, etc."
    },
    {
      "rating": "7",
      "text": "I am obsessed with The Texas Chainsaw Massacre series, and like all fans, I prefer the original. The remake is better than I expected, but it's still not as good as it's father. Although it was too hollywood for my tastes, it wasn't a 'bad' movie, and provided some entertaining scenes."
    },
    {
      "rating": "7",
      "text": "One of the better horror movies I've seen. It was so scary in parts I felt compelled to turn the VCR off several times."
    },
    {
      "rating": "9",
      "text": "I was absolutely scared out of my mind while watching this movie. Critics might not like it because they are comparing it to the oringinal, but they have to understand that the original was made in the 70's! I saw the original and I thought this new one was better. Maybe it's because I have seen my share of horror movies that came after the 70's version so when I actually saw the original it didn't have the same effect it had on others who saw in the 70's. TCM(2003) delivers that goods. Not only did I scream and jump, but I also felt sick and creeped out just watching and thinking about what was gong on. I would recommend this to anyone. Don't pay attention to the \"oldies\" who watched the original when there were no good horror movies out there. Go and see this new one! You actually feel and relate to the characters, which never usually happens in horror movies."
    },
    {
      "rating": "8",
      "text": "A pretty solid film that is,at the same time revolting. I was on edge multiple times waiting for the next gruesome surprise. Don't get me wrong,alot of this IS uneccesery, I just thought at the same time it was well put together. Could I go without the young mental woman in the beginning of the movie pulling a hidden gun out of...(like I said \"uneccesery\")and blowing her skull computer to smithereens?The answer would be yes BUT at the same time I Would not have been treated to cult anti - hero,Leatherface unmercifully instinctively and,almost gleefully destroying smug,spoiled,oversexed,potheaded brats(that I am shamefully jealous of,which,coincidentally fuels a fair amount of my affinity for this film). Watch it at night, with the lights out and the volume up. I guarantee if you like horror(not the most intelligent type but horror all the same)you'll like this movie."
    },
    {
      "rating": "9",
      "text": "Superbly gruesome and shockingly suspenseful with a touch of humor."
    },
    {
      "rating": "4",
      "text": "Disturbing and oogy."
    },
    {
      "rating": "7",
      "text": "It was a good film. It was scary and interesting and I thought it was a solid remake. The only bad thing is the lack of originality in it and a poor female lead."
    },
    {
      "rating": "3",
      "text": "Everything this does is completely miss the mark of the original. The '74 classic gives a grim realistic tone, relying on building atmosphere before frightening us. It doesn't rely on buckets of blood since it was low-budget. This reimagining just amps it up with gore, lots of blood and too polished in terms of production values. The characters are forgettable which makes you care less if they suffer and die. R. Lee Ermey doesn't even bring any justice as the impersonating sheriff who's also a member of the insane family. His death scene made me scream \"Hell yeah!\"; unlike in the original where the hitchhiker is killed during the final chase scene that made my heart beat faster. Leatherface in this movie is just ridiculous, his mask looks like a clown mask shoved in an easy-bake oven. The original mask is made of flesh from past victims and poorly made. It tries to recreate the original scenes with no sense of subtlety. A shameless remake that doesn't deserve to be seen."
    },
    {
      "rating": "6",
      "text": "Deliverance meets The Hills Have Eyes in this sicker, meaner remake of Tobe Hooper's 1974 classic. It misses the point of the original as so many of the things that movie gets praised for aren't in this one. There's not even any indication that the Hewitt's are cannibals in this version. Yet if you're a sucker for gore and grime there's still a decent time to be had here. You just have to deal with some pacing issues.Things don't really get going until the extended chase sequence, which covers a wider variety of locales this time around. Until then it's just watching the five survivors ignore the incredibly obvious signs that something isn't right and getting subjected to acts of increasing cruelty. The events are so disgusting and sadistic that the whole thing feels more like a torture porn flick than a slasher film.Let me tell you, the protagonists here are some real dummies. On top of the aforementioned inability to pick up on how sketchy their situation is, a few of them apparently have the attention spans of squirrels with ADD. Regularly getting distracted from their task of finding one another to poke around in places that don't make sense. Like how at one point a guy stops looking for his missing buddy and decides to scan the potential killer's refrigerator instead.When all is said and done this is little more than a pointless, mean-spirited, and brainless bit of savagery. Watching people get tormented by backwoods psychopaths still has its appeal however. It's far from scary, but could very well make you wince and gag. Plus, even at its dullest it's more energetic than the original. Making it a fine alternative should you want a more lively take on the premise with an extra layer of filth added on top."
    },
    {
      "rating": "5",
      "text": "The first one from those remakes' trend which lasts till today, unlike the majority which came later, The Texas Chainsaw Massacre remake is worthy and valid, which followed a path somewhat different from the original, a bit away from that amateurism (many think that's what made the first film so creepy), but without economizing the suspense and blood. The direction from Niespel Marcus is quite stylish, the cast, despite only containing  good looking actors, is good. It is really worthwhile."
    },
    {
      "rating": "7",
      "text": "I am a big fan of Horror movies, but believe it or not, this is the only version of The Texas Chainsaw Massacre that I ever liked. The reason is simple, for this one, they actually got a real cast that include two of my favorite actors and the gorgeous Jessica Biel. This story isn't any different than the other ones. A bunch of friends on a road trip take a wrong turn and find themselves being hunted by a mad man. The film is full of gore, bad jokes, and beautiful people, it's really nothing out of the ordinary, except for the cast. Great actors can make anything entertaining, even the most bland and repetitive film gets new life when you introduce a cast like this. Three extremely talented and under appreciated actors, give support to the less experienced cast members, and while much of the film was focused on Biel and Leatherface, you could still see the influence of the veteran stars on the rest of this cast. If you don't like Horror, this film won't change your mind. If you're looking for originality, you won't find it here. If you're looking for some good performances from a very talented cast, that is something The remake of Texas Chainsaw Massacre will give you."
    },
    {
      "rating": "7",
      "text": "A solid horror remake imo. It introduces a new generation of fans to the series and it worked out very well imo. It was scary, It featured decent acting through out, and imo its one of the best horror films released in the 2000s."
    },
    {
      "rating": "0",
      "text": "What an awful film. Like. Seriously!!! Everything was predictable and not one character was likable. So glad I borrowed the DVD and not wasted my money on it"
    },
    {
      "rating": "9",
      "text": "This was a very impressive Horror film that only seems to keep getting better every time I watch it. The flaws are minimal but the major one that's worth pointing out is the almost PG death scenes (studio was avoiding hitting a R rating) but that aside it's a great remake! Jessica Beil is great as the leading lady and joined by a talented cast. Storyline can't be messed around with too much but it wasn't and it made for a very effective remake and a real delight to watch for any Horror fan!"
    },
    {
      "rating": "2",
      "text": "Couldn't finish it, couldn't watch half of it. Every bit of violence is inevitable from the beginning five to ten minutes of the film. The only reason I saw it was because I could look at Jessica Biel. That's all horror movies offer these days; attractive damsels in distress."
    },
    {
      "rating": "6",
      "text": "An above average remake of the Texas Chainsaw Massacre. Fully packed violence, and acceptable acting keep the film alive but lacks the strength the original has."
    },
    {
      "rating": "7",
      "text": "The acting wasn't bad and the movie was kind of entertaining.But, the movie was predictable and was downright stupid at times.It's not a bad remake, nor a bad movie but, it's certainly is not a good movie."
    },
    {
      "rating": "5",
      "text": "This movie was just average, as I expected. I wasn't expecting the remake to match the original but it certainly wasn't the worst horror movie remake I've seen. Continuing the Texas Chainsaw Massacre movies only seems to generate more and more money for the franchise, considering the budget for the movies is so small to begin with. I didn't have many scares in the film, not nearly as scary as the original. However I enjoyed Jessica Biel  and R Lee Ermy. I thought they played their roles fairly well. With Michael Bay being involved in this film I'm not shocked that it got mixed reviews as he never seems to be able to get any sort of critical acclaim. He's bringing in the money though."
    },
    {
      "rating": "0",
      "text": "Just saw this today on a rental DVD. It wasn't scary or suspenseful, just gross. One of the worst horror films of all time in my opinion. Skip it and watch something else."
    },
    {
      "rating": "3",
      "text": "Another Long March to the Slaughterhouse!\r With  a budget many times that of the 1974 drive-in classic on which it is based, Marcus Nispel's \"Texas Chainsaw Massacre\" delivers proportionately fewer thrills and no discernible suspense. It is, instead, a long march to the slaughterhouse that seems to take forever to get going and, once it does, goes nowhere that hasn't been visited before by more talented filmmakers.\r Inspired as much by Jonathan Demme's 1991 \"Silence of the Lambs\" (from which it borrows its repulsively detailed inventory of a killer's lair) and by David Fincher's 1995 \"Seven\" (the bled-out color and atmosphere of decay) as by Tobe Hooper's original film, this movie seems painfully derivative just where Mr. Hooper's was technically crude but quite original: in its application of the psychology of horror.\r Very much a product of its time, the original was a paranoid vision in which a band of hippies fell into the clutches of a monstrous family evolved from Richard Nixon's middle Americans. Mr. Hooper imagined the rotting nuclear family formed by the Sawyer clan (oddly renamed the Hewitts in the remake) exacting its final parental revenge on the flower-power generation, represented as a group of helpless children.\r In the remake, with Hollywood's current master of budgetary excess, Michael Bay (\"Pearl Harbor\") as co-producer, the killings have little sociological or psychological resonance. This is a blunt and graphic gore film, replete with close-ups of splattered brain matter and twitching severed limbs.\r To his credit, Mr. Nispel, a veteran of music videos making his first feature, does not take refuge in camp humor; he plays the violence as straight and as punishingly as possible. But punishment is not what the action public of 2003 is looking for: since \"The Silence of the Lambs,\" the audience has been encouraged to identify with charismatic killers as they go about their business, something the remade \"Chainsaw\" staunchly refuses to offer.\r From R. Lee Ermey's degenerate small-town sheriff to Andrew Bryniarski's hulking Leatherface (the chainsaw-wielding killer, now with a mask fashioned out of human flesh), the villains are either too grotesque or too remote to invite easy assimilation. Reduced to identifying, uncomfortably enough, with the victims (chiefly, the lovely but inexpressive Jessica Biel), the audience made its dissatisfaction vocally clear at a recent New York preview screening of Mr. Nispel's film, which opens today nationwide. Rather than exhilaration, this bilious film offers only entrapment and despair. It's about as much fun as sitting in on an autopsy."
    },
    {
      "rating": "4",
      "text": "This was a very scary movie when I was a teenager. Forty years later it seems too full of young women screaming. There's too little gore to scare me today, which just shows how brutal other movies have become. I even felt like fast-forwarding through the first 45 minutes, but the anticipation built up towards the end is still effeective.."
    },
    {
      "rating": "2",
      "text": "The movie was not as good as I expected. The movie was not scary at all and barely any blood and gore. One of my least favorite Texas Chainsaw movies.2/10"
    },
    {
      "rating": "10",
      "text": "its good movie really i enjoyed it its scary its a good remake of texas chainsaw masscre 1974 i dont know why people saying its a bad remake i dont understand but really its fun"
    },
    {
      "rating": "9",
      "text": "The original Chainsaw is my favorite horror film of all time. So when this was initially announced I really had no interest in seeing it, Especially after finding out Michael Bay was involved. Until that awesome sales trailer came out followed by what may be the best horror trailer ever released spliced with the songs Song to the Siren by This Mortal Coil and Signal to Noise by Peter Gabriel. And when it finally came out I still went in quite cautiously besides the solid buzz. And when I walked I had witnessed one of the best horror remakes of all time. The film works as an uber polished pop version of the original with truly striking cinematography and solid performances all around especially from Jessica Biel who redefines what scared is in horror movies. The movie is a fast, intense, aggressive, stylish nightmarish horror ride with scenes that just stick to you long after it's over. Although it doesn't have the impact of the original or the high quality I'd be lying if I didn't say they truly did a fantastic job with the material proving they had reason to revisit it.Budget: $9.5MBox Office: $107M9/10"
    },
    {
      "rating": "6",
      "text": "Definitely better than most of the classic horror movie remakes out there, but it also suffers from disposable characters and continuity errors."
    },
    {
      "rating": "5",
      "text": "Fine of its own, but compared to the realistic almost documentary like feel of the original, it starts feeling more like a genreic early 2000's slasher."
    },
    {
      "rating": "10",
      "text": "My favorite one out of the series. Just a group of friends on a road trip who pick up an injured hitch hiker. She commits suicide right in front of them all. They stop to get help but unfortunately it's in leatherface's town."
    },
    {
      "rating": "7",
      "text": "I really think the whole movie was great before the whole chases scene that was unfortunately pretty boring, it was not bad but it's pretty boring, the movie did well performed by the cast and i really appreciate the movie not completely remake the same story and scene from the original, Marcus Nispel Texas Chainsaw Massacre didn't feel fresh for me, and that's the point of making a remake movie, try as good as possible to make it look like it was new even though it was already made, no matter if you already watch the original or not, i didn't feel that, and like i mention before, the whole chases scene is really the big step down of the film, if it's shorter and just added some dialogue, i definitely can go up to 8, but overall Marcus Nispel Texas Chainsaw Massacre is not a terrible remake or awful remake but it's also not an incredible remake too, so it was an ok movie overall."
    },
    {
      "rating": "5",
      "text": "I'll be honest, I think I saw this version before I saw the original 1974 version. This isn't a bad movie, and I really enjoyed it the first several times that I watched it. However, after watching the original since then, I realize that this version is inferior to the original in almost every way. Yes, the acting in the original can be a little campy and cheesy. Yes, the original's cinematography can also sometimes feel more dated, however sometimes the cinematography of the original absolutely surpasses the cinematography of the 2003 remake. There's a shot in the original where the camera follows a female character as she transitions from sitting on a swing to when she stands up and walks towards the house, the camera just glides under the swing she was sitting on and follows her in perfect harmony to the house. It's honestly done in such a beautiful and epic fashion. Unfortunately when it comes to this remake it's very much a product of it's time cinematically speaking. Does that mean it's bad? No, just means it's not that great either. When it comes to remakes of classic horror movies, this one is better than most. Is it as good a remake as the 2013 remake of 'The Evil Dead'? No, absolutely not."
    },
    {
      "rating": "2",
      "text": "The early 2000s sludge filter and lighting is 100% trash. On the whole the movie is very plodding and predictable and light on scares."
    }
  ]
}