{"id": 132, "title": "The Virtuoso", "starring": ["Anthony Hopkins", "Anson Mount"], "runtime": 105, "genre": ["Thriller", "Crime"], "description": "A lonesome stranger with nerves of steel must track down and kill a rogue hitman to satisfy an outstanding debt. But the only information he's been given is a time and location where to find his quarry. No name. No description. Nothing.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/vXHzO26mJaOt4VO7ZFiM6No5ScT.jpg", "categories": {"plot": 8.0, "acting": 8.0, "ending": 1.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "1", "text": "Do not watch this movie. Absolute waste of time. Instant regret. From the first scene you know the ending. Why would Anthony Hopkins accept this role. It left me frustrated with how bad it is."}, {"rating": "1", "text": "I'd like to think that this won't be Mr. Hopkins's last film before he dies from complications of being 150 years old. This would be a **** way to end a fabulous career!"}, {"rating": "8", "text": "This film has all the elements I enjoy in mysteries. Without divulging any spoilers, it's beautifully shot in a weird small town, with those spooky small town vibes. Like a late night glass of bourbon, you get more and more into it as it goes along. I like the choices that were made in the rhythm and pacing of the film, letting the actors take their time with the emotions and their characters' inner processes. They all did a wonderful job.This movie may not satisfy some movie-watchers' insta-needs for constant stimulation, but if you're looking to perk up your night with an intriguing story told in a different way, with charming leads and artful execution, it's worth your time."}, {"rating": "3", "text": "Come on guys, Anthony Hopkins brought a brand new house that came with a piano, he had to pay it off somehow."}, {"rating": "2", "text": "Wow did this film suck! It baits you with some slick noire narration and a taste of action, then drags you along for long monologues and telegraphed \"plot twists\". I was only left wondering how they got Anthony Hopkins to star in it. I guess a check is a check..."}, {"rating": "6", "text": "(Mauro Lanari)\"Seven billion people on the planet [by now almost eight], and even with medical advances, the odds are, in only 130 years, maybe less, every single person currently alive will be dead. Seven billion. Your work doesn't even equate to a rounding error.\" It will be a wordy, convoluted, implausible film, but it is the first to spit out, as a true noir, the most tabooed concept in the history of cinema and popular culture."}], "recommendations": ["a_cure_for_wellness", "predestination", "the_american", "hereafter", "enemy", "donnie_darko", "no_country_for_old_men", "vanilla_sky", "hugo", "bad_times_at_the_el_royale", "a_ghost_story", "vivarium", "the_power_of_the_dog", "shutter_island", "a_quiet_place_part_ii", "the_butterfly_effect", "there_will_be_blood", "memento", "reminiscence", "the_autopsy_of_jane_doe", "colossal", "downsizing", "the_hunger_games_mockingjay_part_1", "source_code", "searching"]}