{
  "id": 4610,
  "title": "The Secret Life of Pets",
  "starring": [
    "Louis C.K.",
    "Eric Stonestreet"
  ],
  "runtime": 86,
  "genre": [
    "Adventure",
    "Comedy",
    "Animation",
    "Family"
  ],
  "description": "The quiet life of a terrier named Max is upended when his owner takes in Duke, a stray whom Max instantly dislikes.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hfsoAEE3MdTy9SLlGnez9iR9Mch.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.163265306122449,
    "ending": 5.285714285714286,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 6.916666666666667,
    "funny": 6.3023255813953485,
    "action": 8.25
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The Secret Life of Pets has some good things going for it, such as the characters and how they perfectly matched the personalitites of the animals, but the story sometimes doesn't flow right and they try to add a touchy subject, and then completely ignore it seconds later. In the end, Secret Life of Pets is a one time fun ride, but the movie doesn't leave a impact like Illumination has done in the past."
    },
    {
      "rating": "8",
      "text": "The Secret Life of Pets is insane, but in a fun way. First, I'll say the problems I had with this movie. For one, it's too noisy in places. There is a lot of screaming from the characters and the action is non- stop. There is never a quiet moment, just constant noise. The pacing is also too fast, which doesn't allow for full character development. In addition, it makes the emotional moments not as emotional or deep as they could have been. But that's about it, now to the fun stuff.\r What makes up for the lack of character development is the vocal performances. The celebrity voice actors all do a great job of giving life to the characters. Louis C.K., Jenny Slate, and Bobby Moynihan all do a fine job. And despite yelling a bit too much, Kevin Hart also does a good job. As far as the story goes; yes; it's like Toy Story in the beginning and ending. Also that the whole premise of \"what your pets do when you're not around\" is also like Toy Story. But this is thrown out the window after just the first two minutes, devolving ultimately into a series of chases for 90 minutes. Frankly, that's fine. The biggest pleasure I had watching this was the amount of sheer craziness that happens. Not only is it fun, but it goes far beyond anything Disney or Pixar would ever do. Some themes (like death) are presented in an even more blunt manner then Disney or Pixar. The jokes and Looney Tunes- esque comedy work, thanks to good writing and timing. Pets isn't necessarily a funny film, but it is fun and will put you in a good mood. What makes something like this work for Pets, but not for something like Angry Birds, is the characters. Thanks to the voice work, most of the characters here are lovable and memorable. Max and Duke are fine main characters, Snowball and Gidget are fine secondary characters, and even the large supporting cast is fine. Thanks to the large cast, it allows the film's subplots to all work and support the standard main plot. While the main plot is basically Toy Story or Garfield, it's where the emotion comes from. Snowball's subplot about revolution is interesting and original. The other subplot about the others rescuing Max and Duke is where the comedy comes from. All together, it works out. Not to mention the awesome jazzy soundtrack by Alexandre Desplat.\r Making all the physical comedy work is thanks to the animation. While a bit basic, I love the unique stylization this goes for. All the pets have big bodies, but very skinny legs. New York City looks the way a tourist would see it, clean and gleaming. The fast movements, the variety of pets, the cuteness of the pets, and the many different settings keep the animation interesting.\r Overall, The Secret Life of Pets was surprisingly a great movie. It doesn't pander to the audience with over cuteness, pop culture gags, or bathroom based jokes. Instead, thanks to wonderful writing, slapstick like Looney Tunes, subplots that nicely support the main plot, and lovable characters, makes Pets is a very good movie. As a pet owner myself; specifically a cat owner; I can say that the stereotypes depicted here about all the various pets are hilariously accurate. Pets is a bit too loud and fast at times, but simply is a fun and heartwarming experience."
    },
    {
      "rating": "7",
      "text": "Heartwarming movie with cute animals and stuff. Extra points if you are a dog person. Nicely done puppetry. It's a kids movie, but as per usual, there's something there for the adults. Or is there? I can't remember. Apparently, deep down inside all the wild and surly animals just want to be pets, but when I was a kid I had a rabbit and it escaped. True story."
    },
    {
      "rating": "10",
      "text": "This movie had our whole family, ages five, eight, twelve, fourteen, laughing from beginning to end. There are so many dynamic/comic details that keep you engaged, even if you are not focused on the main characters."
    },
    {
      "rating": "7",
      "text": "I was ready to hate this movie\rBut actually i enjoyed it\rIllumination has proved to be one of the best recent animated studios\rNot great but still its a lot of fun"
    },
    {
      "rating": "7",
      "text": "It's not Up and it's not Inside Out, but it is a bit like Finding Nemo only with dogs. There's plenty to keep the kids entertained, maybe even on a second viewing. Boo the baddies, cheer the team of heros and even have the odd laugh. It won't change your mind or even your memory, but it is cute and family-friendly."
    },
    {
      "rating": "8",
      "text": "I found this movie to be cute and refreshing! It was nice to sit down and watch a movie with the whole family and laugh. The instantly fall in love with the character's personalities and imagine how your own pet behaves while you're gone. It's not exactly as memorable as other Disney movies that have come out in the past, but I would definitely watch it again for the laughs."
    },
    {
      "rating": "7",
      "text": "Street pets versus the house pets! A day adventure in a big city!Animation films always fascinate me, because of its varieties. Even animals can be the heroes and villains. So this kind of new story perspective, including technology, what makes adults too can enjoy them like the kids does. This is now in the list of top 50 highest grossing films of all time and top 10 of the year 2016. Moreover, it is the highest grossing non Disney and non Pixar animation film. This is a very enjoyable family flick that directed by the 'Despicable Me' famed filmmaker.Kind of similar to 'Bolt', but totally a different experience. This story happens in just one day. It follows a young dog named Max, one day when his owner brings another pet dog, he thinks she does not love him anymore. So to keep his position safe in the house, he strikes a deal by blackmailing his new housemate, Duke. As a revenge act, when Duke tries to get him back, something goes wrong and they get stranded on the street. So getting back to home is their biggest challenge and it should be done before the sun sets. The rest is the Max and Duke's a day adventure in the New York City.I was not expecting a masterpiece, just the last week I saw one, 'Finding Dory'. This is a good entertainer, that has some great names in the voice-over cast. Particularly you will love Kevin Hart like I did. But watch out for his impolite dialogues, if you are watching with your kids. Though there's nothing seriously affecting, just a typical Kevin Hart, but awesome. A simple story, a simple adventure, but very likable characters and screen presentation.From the pets' perspective about during the daytime when their owners and the kids left for the work and school, respectively, how they make their day is what's revealed in this. So the 'Secret Life' means, theirs secret get together and do whatever they want to. But an unexpected clash takes place between the two gangs, the house pets and the street pets. In so many ways, it was better than I anticipated. There are lots of untold stuffs, especially the Duke's past which might be covered in the sequel which is officially announced now. So I'm waiting for the 2018 summer. Meanwhile, watch it if you haven't yet, particularly if you like animation.7/10"
    },
    {
      "rating": "6",
      "text": "Kids will love it, but lacks the creative humor I was hoping for in a Louis C.K movie. The cliche story gets boring in places with so many characters. Overall though, there were plenty of simple laughs and fun moments to keep it rolling"
    },
    {
      "rating": "5",
      "text": "At least it's a great original concept for an animated feature unlike Pixar's latest, but unlike Pixar it doesn't have quite the usual level of cleverness they exhibit nor the heartfelt warmth of emotion that can get adults as well.  This is mostly played for laughs though, laughs for the very young.\rNew York City has perhaps never looked more livably appealing in a movie with its shimmering Emerald City like epic glittering skylines and vivid colorful autumn setting.  Unfortunately the story drags."
    },
    {
      "rating": "6",
      "text": "I definitely enjoyed this one a lot more than i thought in fact it does not deserve a 6 rather a 6.5 but sense metacrtic won't let me do that oh well. Every character was well voiced.. Thats one of the things great animated movies bring is well voiced characters. There was a funny nod to musical theater fans as well as few laugh out load moments. The climax will definitely make you cry and this movie is definitely illuminations best sense despicable me. The film does suffer from an uneven story focusing on max and the big does relationship, finding there way back home and a rabbit planning an uprising against all happily owned pet owners.I could have gone with just a buddy comedy type movie. This movie was good not as good as finding dory or even star trek but this film made me restore faith in illumination studios. lets hope sing is not a total dud"
    },
    {
      "rating": "5",
      "text": "If you've seen the trailers, you already saw about 45% of what makes the movie good.  Kevin Hart steals the show again, even if he's the smallest cartoon character in the movie.  Great cast but story was missing something"
    },
    {
      "rating": "8",
      "text": "This is a very fun movie, even if you are not a kid.  The theater was full when I went and the adults were enjoying the movie as much as the kids.  There are lots of laughs and the characters are fun to watch.  Some parts may be a bit intense for small children, but all in all, the kids in the theater were loving it.  You don't have to take a child to see this movie.  Plenty of adults without kids were there.  I generally don't like to go to kids' movies, but I very often enjoy them after I get to the theater.  This was one of the best I have seen.  Lots of heart and lots of laughs."
    },
    {
      "rating": "8",
      "text": "The Secret Life of Pets is nowhere as good as Zootopia and Finding Dory, but it is a cute film that children would love to see. It tries to be funny at times, and sometimes, does work. The cast was great and the trailer gave a brief introduction without spoiling too much. However, my biggest issue with this film is how the plot goes along and it just seemed too childish and long. However, The Secret Life of Pets is still overall enjoyable but some parents might fall asleep halfway through the film. (75/100)"
    },
    {
      "rating": "10",
      "text": "Funny and fresh, The Secret Life of Pets is full of fun characters and one-liners that will keep you laughing for the whole film. Add on top of that an exciting and action-filled story line, along with a touch of dark humor, and you get a perfect animated feature that will entertain kids, teenagers, and adults alike."
    },
    {
      "rating": "10",
      "text": "I went to go see the secret life of pets. I was amazed at how funny it was . All the other people were laughing like non stop that was how funny it was.the pets were one of a kind . It was also very cute when they make the eyes really big . Go see it you be amazed like I was."
    },
    {
      "rating": "5",
      "text": "I'm not a huge fan of \"kiddie animation\" (Pixar, etc.), but I enjoyed the characters here - love dogs & cats in general.  But after a really fun beginning, this film gets a little too dark and pessimistic too quickly.  It lost me.  It ramped up by the end, but I wasn't a fan of the movie in general.  Love Kevin Hart, but this bunny character is grating."
    },
    {
      "rating": "2",
      "text": "well the story goes bonkers very fast, and actually not much about the \"life\" of Pets. I felt the movie was random, used scrit blueprints with nothing new to watch, and the ending was so fast you can miss it on a piss break"
    },
    {
      "rating": "6",
      "text": "While not as charming or as thought provoking as many really top notch animated features these days, The Secret Life of Pets is still a solid film that kids will really enjoy.  B-"
    },
    {
      "rating": "6",
      "text": "Have you ever gone to work and felt bad about leaving your pet at home? No? Well you will now. As far as animations go these days, this is good, original and more importantly it’s funny. Worth a watch, recommended if you’ve nothing else to do."
    },
    {
      "rating": "6",
      "text": "An ok movie,probably really fun for kids cause you know these kind of movies are made for kids not adults that gave it 1 cause they did not like it .  Weak plot but it was an ok movie,the type of movie that you see on a bored sunday and it get's you through it"
    },
    {
      "rating": "2",
      "text": "Such a complete mess of a movie. There must have been a dozen writers on it. The joke about dogs coming from wolves definitely did not come from the same brain that thought up the wiener factory dream sequence (so stupid and unnecessary). And suddenly the two dogs are driving a bus? WTH? They can talk, sure, but if they can drive, the whole first 90% of the movie makes no sense. Someone thought it'd be ironic/cute to have a blue-eyed bunny talk in ebonics, but it didn't work. Just... kind of offensive and I wish we were beyond this, but we're not.  Duke's old owner dying, Duke flipping out on the family, WHY? The bad guys and good guys joining forces -- what? Why?  So contrived and inventing scenes and side-stories that only confuse the plot, which should be simple, with lots of character interaction. instead, the story was utterly complicated -- I dare any person, child or adult, to retell this movie the next day -- and there are too many characters, so we invest in none of them, and...where'd the voiceover at the beginning go? Is it Max's movie or not?  Very poorly done. Insulting."
    },
    {
      "rating": "0",
      "text": "What a total waste of Time and Money ... Bad Screenplay, terrible animations (sophomoric) ... I feel sorry for the actors who go sucked into this project.  NOT Worthy ! Not going to be a reasonable rental either.\rThe studio exec who approved this crap should seriously consider quitting."
    },
    {
      "rating": "0",
      "text": "So disappointed in this movie. The beginning was okay, but the plot quickly takes a dark and almost violent turn with a \"gang\" of underground pets who talk about killing their owners (like it's a good, \"cool\" thing), initiation via a snake bite ritual, etc. I was hoping that this movie would redeem itself with some sort of great ending, but it didn't. I don't recommend this movie for kids and for adults, it's just not that funny or entertaining."
    },
    {
      "rating": "4",
      "text": "With a striking similar plot of the first Toy Story with a tiny bit of Toy Story 2,we The Secret Life Of Pets.I am not saying that the movie is a huge rip-off,I think if it handled correctly we will notice it while watching but this film just threw me off the cliff with it's horrible humor and annoying characters.Characters we don't care,they are just their that doesn't contribute to the plot and underdeveloped.The animation is okay their is a little bit creativity on it but overall the film didn't have anything special to deliver.Reused plot,messy characters,okay-ish animation and a horrible humor approach that makes you wonder \"is this the people who made Despicable Me?\". They are so many great animated films like zootopia,finding dory and kung fu panda 3.This movie falls on the category with angry birds but at least it's not bad as norm of the north and ratchet and clank.\r courtesy to Graham43,Illumination studios started great with despicable me but they lower their quality after that,don't why maybe because their greed and how successful minions re no matter how stupid it is they will release a mediocre film without any effort to it"
    },
    {
      "rating": "5",
      "text": "Illumination Entertainment started off with movies like The Lorax and Despicable Me.  The movies became lower in quality from Minions to Illuminations new feature film, The Secret Life of Pets.  This movie has a pretty good cast so not enjoying the movie is sort of a let down, but not a surprise.  Overall, Illumination does not make movies that are that great anymore."
    },
    {
      "rating": "2",
      "text": "Beginning. VIOLENCE. Ending. Seemed to have to many storylines. Not for smaller or sensitive kids. I was disappointed and wanted to leave mid-movie. Glad we went to the $5 showing cause it wasnt worth full price."
    },
    {
      "rating": "7",
      "text": "Ever wonder what your pets get into when you're not around? Well, it turns out their adventures are darker and more violent than you might expect. However the results are still plenty amusing. Plus it's got a high quality cast and inventive characters and scenarios.The real problem with the movie is that it feels all to familiar to the Pixar classic Toy Story. The rivalry main characters Max and Duke have over their place in the world is very much akin to that of Buzz and Woody. Given that they feel so generic and just end up going through the familiar motion makes it hard to care about them. It's the side characters that really steal your heart.Oh, and what supporting characters they are. Jenny Slate's Gidget has a quest that is far more compelling than the leads. Kevin Hart steals the show as the hilarious villain \"Snowball.\" Every member of the voice cast does an incredible job and fit their character perfectly, but none are able to match Hart. His energy and performance are incredible. This is probably his best work yet. He really does deserve some awards for this.For what Secret Life of Pets lacks in storytelling strength it more than makes up for in humor. There's a surprising originality to the gags and one-liners on display. Something that makes the movie feel like a fresh face in the ever growing crowd of animated movies. Some of it is questionable though. Particularly for kids.With topics like death and violence sometimes sneaking their way in, this might not be the best choice for all kids. For more discerning parents though, the humor and characters could make this a darn fine option for family movie night. The storytelling woes are noticeable, but the humor usually does a fair job of compensating for it. Thankfully the movies lightning pace means there's always a fresh set of jokes waiting for you right around the next corner."
    },
    {
      "rating": "5",
      "text": "The Secret Life of Pets is a vaguely amusing animated movie. It has some cute characters and some funny scenes, but lacks the heart or meaning of Pixar's films."
    },
    {
      "rating": "6",
      "text": "The kids will love it and the minions short at the beginning. It's cool seeing the great graphics. But don't expect a sequel. There isn't much more to say. For me it's just another movie. Now to get ready for Star Trek (please don't suck) beyond."
    },
    {
      "rating": "3",
      "text": "The only merit this film has is not being either a reboot or a sequel.\rBesides it, it relies so heavily on secondary characters that it becomes a collection of isolated jokes in a sequence where the main plot dilutes as the film advances, making the whole story pointless."
    },
    {
      "rating": "6",
      "text": "Toy Story With Pets\r \"The Secret Life Of Pets\" does not obtain the reflective level of films from Pixar or Dreamworks, nevertheless , it can entertain at least most of the movie. The analogies with the \"Toy Story\" franchise are relevant, this causes the originality is reduced to a couple of jokes and an incredible animated landscapes, detailed  with realistic, brilliant and vivid colors. Pets' Story' pretends to be a recycled version of the animation classic, same narrative theme, same characters, same relationships, worse results. Story is a sophistry - but, we knew its plot - however, the film benefits of the vastness of oral and visual jokes, the connection between the protagonists, its screenplay and its professional cast of voices to entertain children and amuse to adults.\r Yarrow Cheney and Chris Renaud conceive an urban environment as compelling as soul of the pets, but the charm is inversely proportional until to fall in state of trance, in generic state, a linear state. It is a child product, but we cannot underestimate children, they need beneficial films and last production of Illumination does not offer it. Taking advantage of recurrent formulas and few surprises, the characters give life to the project, not with the same satisfaction of toys, nevertheless, they make sacrifices to achieve it.\r Max (Louis CK) modestly lives with his owner Katie (Ellie Kemper) in a homey apartment in the center of Manhattan. What does Max do when Katie is not at home? Every morning, the adorable canine waits anxious and impatiently at the arrival of his owner, but he enjoys hour by hour with his friends of the building, other pets that do the same like Max; a self-centered and gluttonous cat called Chloe (Lake Bell), a distracted and grouch pug called Mel (Bobby Moynihan), a film bird and even a relaxed and unworried dachshund (Hannibal Burress). Ideal life for a domestic animal, unlimited food, friendly friends, a comfortable bed, a perfect owner, but what would happen if they aren't two plates of food, three plates of food at home?\r Max has the drama of a only child, after Katie decided to adopt to Duke (Eric Stonestreet), a huge dog coffee; from there, the similarities with the film's toys are visible, two different beings who must join forces later a dispute between the two animals - I am amazed, it is the same premise -, they are defenceless in the real world, outside. Their enemies are a weak point which is added to the weaknesses of the film. The contrast of a cute white bunny (Snowball, Kevin Hart) with a wicked and vengeful rabbit is somewhat curious and very fruitful for the development, nevertheless, its ending is vain and unfinished, it did reduce consistency and weight to the story line.\r Delicate it is observe that the prominence of the support characters was bigger than the main characters, as in the case of Gidget (Jenny Slate), madly in love for Max. She seeing that her platonic love does not return of the walk with his dog walker, she is alert and leaves to see her side most aggressive in order to rescue him, for this, she assembles one special squad and they take the path, an acceptable adventure. A girl in search of her lost brave prince, this plot works better than the 'copy and paste' from the main.\r Illumination compensates for the lack of narrative originality with accustomed visual aspects of its movies, a sausage factory full of colors and charm curvatures, an alleyway with clothes hanging out on a rope and even sewers inhabited by stray animals are representations of the potential behind the minds of the company. Despite its visual magnetism and its auditory knowledge, it falls severely on the monotonous twists and predictable moments.\r \"The Secret Life Of Pets\" wasted millions of opportunities, starting with a good story to tell; With what we saw, we wish that the life of our pets were a secret. Continuous laughs and sparkling graphics do not cover to the slow-paced of the film, nor vanish a history already narrated. It accomplishes the unique and poor function of a summer movie, entertain, nevertheless, we would have wished a product more beneficial. Pets had not to leave of their houses and their movie neither, one funny mistake but disappointing."
    },
    {
      "rating": "5",
      "text": "With a plot very simar to toy story, the secret life of pets is just that, but for pets. The story was really rushed with things just going along as it goes on without it really devoloping anything. The characters are really undeveloped, I actually only remembered one of the characters names. Plus character motivation feels really rushed, and when it tries to get emotional, it just doesn't cut out what its trying to do. The animation though is still pretty good. And the humor is ok, some were cleaver, most of it though we seen before. Overall it's watchable, but very disappointing."
    },
    {
      "rating": "3",
      "text": "The best parts of this movie were all in the trailer, just watch that and save your time. My 10 year old was bored and my 8 year old was not very interested. It is a shame, good start and then very boring."
    },
    {
      "rating": "3",
      "text": "It was a little funny, but the whole plot was nothing if not a Toy Story rip off. Some of it was also dark-hearted and disturbing and the sausage fantasy scene was pretty creepy. Sorry Illumination, but I'm not a big fan of your movies."
    },
    {
      "rating": "7",
      "text": "Deutsche Review - Kritik\r Story: 13/25 Punkte\rCharaktere: 22/25 Punkte\rTechnick/ Bildbearbeitung: 21/25 Punkte\rSound/ Voice: 18/25 Punkte\r Gesamtpunktzahl\r 74/100 Punkte"
    },
    {
      "rating": "8",
      "text": "I couldn't really tell who the main character, the hero, and the enemy were. My prediction is that there is no main character, hero, or enemy, which makes no sense because without those three roles, the movie doesn't have any color per se. I would say that the voice actors were very consistent and played their roles perfectly!\rIt was hard for me what the meaning of the movie was, or what the director is trying to say to us. In all, this movie is great for kids and maybe even adults!"
    },
    {
      "rating": "4",
      "text": "SECRET LIFE OF PETS was bland and mostly humorless - although there are touches that lead to a few laughs; usually in the manner of incorporating the animals natural, normal actions; my focus being on the cats as I'm a catguy. Plotwise it's a retread of TOY STORY, with the a few additions. Unlike PIXAR'S classic, all the characters are one-note and without anything endearing to make them stick; and such we don't really care about them. Both the leads, Max and Duke, are **** - straight up. Woody and Buzz are both jerks, too but they have their reasons and their changes as they grow through the film(s). instead Max and Duke: \"I hate you, I hate you. Hey you're alright. We're friends\".It's almost like they found out their mom's names are both Martha. Doesn't help that they are voiced by Louis CK and Eric Stonestreet (two actors I normally like); both with rather droll voices. The other voice actors do just fine with what they're given: the standout being the continual stand out of Albert Brooks (with FINDING DORY makes him in two animated features right now). A problem is there is little energy; sequences that could be entertaining (such as some slapstick or Looney Tunes inspired bits) plod along. I feel a better edit, moving at a faster clip, would bring much more to the proceedings. On the weird end, there is a dusting of death to it all; it is continually threatened and even happens a few times, strange for such a light film. Finally in Bob Overthinks Things Corner: I question the level of sentience. Max doesn't know the name of a spoon but knows all sorts of tougher concepts and stuff he shouldn't' know if he spends all day looking at a door or playing with a ball. If the pets (and other animals) have sentience, why do they act in some ways? Why keep it hidden? Okay, one more final note: the MINIONS short before the film was just bloody awful. Uninspired and underwhelming. Prime example of how not to build humor and gags, they lean on \"look a Minion with a leaf blower! hahahahaha!\" and fail to build each part until a climax."
    },
    {
      "rating": "8",
      "text": "This is an amazing movie for both children and adults, although children may enjoy it more. The plot was intriguing, the scenery design and the animation were astounding, and the character build left you feeling on edge when the characters were in the line of fire.\r I personally went to see it with my family, and my younger sister didn't seem to mind that there were a few acts of violence involved. If you have a child younger than 5, some of the scenes may frighten or startle them. Make sure they are fine with tiny acts of violence, like hitting, grabbing, or fighting.\r There is only one strange or weird scene in the entire movie, which involved the main character and his still bonding companion arriving at the sausage factory in an act of hunger. It will make older audiences uncomfortable, but do it for the kids if you have any. Older teens will not be mature, so please make an effort to place them farther away from the young, innocent ears.\r Aside from that, this movie was fantastic. Highly recommend you take one-hour out of your day to see it with your family to teach them more about loving your pet."
    },
    {
      "rating": "9",
      "text": "I love how original the concept of animals having their own lives when their owners aren't around. I thought this movie was pretty funny. The animation was terrific and I loved how colorful it was. I especially loved the excellent voice over performances from Kevin Hart, Albert Brooks, Eric Stonestreet, Lake Bell, Dana Carvey, Louis C.K., Jenny Slate, Bobby Moynihan, and Chris Renaud. This is one of my favorite animated movies of all time."
    },
    {
      "rating": "7",
      "text": "Decent film with great animation and some interesting characters. Plot was a bit thin, nothing more than a long chase sequence, and I left the theatre feeling I would forget all about seeing this film in not too long a time."
    },
    {
      "rating": "4",
      "text": "Not as much a kid's movie as you might think.\r Animations are top notch. Voice work is solid. And some of the animals are genuinely cute and funny.\r But this movie contains numerous references to death and killing. Violent, lustful glorification of killing surfaces on numerous occasions. Threats of death abound throughout the middle of the film. And while much of this is comedically over the top, I found myself concerned that much of the target audience is too young to recognize and make that distinction.\r So be aware: If you're bringing your children to see this movie, I urge you to think twice about just how young a group you would want to see this film. Chances are...its not a movie for quite so young a crowd as you might think. Not to mention: The airing we took kids to see was seen by a daycare group at the same time, and I dont think I heard members of that group laugh more than two or three times throughout the entire film.\r Really not as good as the trailers make it out to be, and the degree to which those same trailers took pains to leave out the numerous references to death, violence and glorified killing, I felt more deceived than entertained. I will think twice seeing anything this studio produces."
    },
    {
      "rating": "5",
      "text": "Mildly diverting with some good humour and competent animation but it's really not doing anything of note."
    },
    {
      "rating": "10",
      "text": "Absolute perfection! From beginning to end, this movie was nothing shy of a hilarious, heart felt time. I highly recommend it for anyone who loves animated movies."
    },
    {
      "rating": "10",
      "text": "The Secret Life of Pets is my new favorite modern animated movie.  The movie is jam packed full of pet humor and pet cuteness.  It also has a lot of heart and is a joy to watch.  The visuals are also breathtakingly stunning.  I'm looking forward to rewatching this one down the road someday.  Perfect for kids AND adults."
    },
    {
      "rating": "5",
      "text": "Remember the awful scene in a Finding Dory, an otherwise good movie, where the animals all drive the truck? Ever want to see a full movie about animals walking the streets and driving vehicles? No? Well, too bad! Here is The Secret Life of Pets, a largely cute and harmless slice of family entertainment with a too-good voice cast and good animation. Decently funny and likely the best film a five-year-old has ever seen, this one is yet another film from Illumination and my first time coming across their films. Largely disposable entertainment, it simply lacks the heart good animation needs to be more than just watchable for adults. Pixar gets this and so does Laika (from what I have seen). Sadly, this one is just a series of jokes with a disposable and cliched plot.Fortunately, the voice cast really does liven this one up a lot. Louis CK, Ellie Kemper, Eric Stonestreet, Lake Bell, Kevin Hart, Jenny Slate, Albert Brooks, Dana Carvey, Hannibal Buress, Bobby Moynihan, and Steve Coogan, are all well-cast voice actors who deliver terrific roles. Hart's bunny may be a bit racist since Hart is black and the character is a street-wise gangster type, but regardless, he does the voice incredibly well. The rest of the cast is also quite strong, making the most of this paper thin plot. In particular, Steve Coogan's small roles were a real highlight and added great character to this film. Fortunately, these voice actors are also all quite adept with comedy and it shows, as each punchline really do hit quite well.The talented voice cast is met with good animation that really captures the size and odd beauty of New York City incredibly well. Shots from across the river of the city skyline do look quite good, even if the animation is not some of the best around. It does the job well and looks okay, making it more than passable for children and adults alike.Unfortunately, the plot is terrible and just a rip-off of Toy Story. I can deal with it being inspired by Toy Story, but it just rips it and every buddy comedy off from the very beginning. It never tries to innovate or become unique, instead opting to play it safe and put pop song band-aids over its open sores. This does become pretty annoying, even if the pop songs are poppy and the comedy works. It is impossible to look past entirely, though the plot will likely feel fresh and interesting young children, hence Illumination can get away with it, but as an adult who has seen more than three movies in my life, it does become overly predictable. A shame since the concept of giving an inside look at pets when their owners are gone is a cute idea for an animated family film. Unfortunately, it got the conveyor belt treatment.Funny, cute, and disposable, The Secret Life of Pets is a marketing opportunity for Sing, PetSmart, YouTube, and more. It also gives a spot for the talented cast to show off their impeccable voice acting ability. While not a great - or even good - film, The Secret Life of Pets is fun and will make the whole family life and be entertained for a little over an hour (merciful length really, prayers to the parents who will have to watch this one weekly/daily)."
    },
    {
      "rating": "6",
      "text": "One of the first animated films I've seen in a while that actually has the audience's attitudes shift wildly in relation to the main characters. And that's not necessarily a good thing. Pick a character. Any character. Did I like them consistently throughout the film? No. Did I dislike them consistently throughout the film? No. Did I end up liking them in the end? Most likely, but it's still a flawed system. There are a lot of prickly, jagged-edged ideas in play here -- ideas and concepts that we've honestly seen done much better in other films (see \"Toy Story,\" \"Zootopia,\" etc.) But it's honestly the intention, the overall sweetness of the ending, and the undeniably creative animation that won me over in the end, thus allowing Illumination to -- once again -- JUST skirt by, in my eyes."
    },
    {
      "rating": "4",
      "text": "Generic and uninspiring. Wasn't so much a secret life of pets and more let's have an adventure movie. Stereotyped characters with little development. Had a couple funny moments but yawn inducing for a vast majority of the film."
    },
    {
      "rating": "8",
      "text": "Man, I took a pretty big L with this one. For months before this film's release, I was constantly touting it as \"Toy Story with pets\" and I was in a constant state of belief that the film was not going to be good. Then I decided to watch it...and I was horribly wrong. Sure, it's still \"Toy Story with pets,\" but it's still a surprising good film! It's hilarious, it's beautifully animated, it's exciting, and it's got some pretty memorable characters. I still probably won't be able to shake the \"it's Toy Story with pets\" vibe anytime soon, but all in all, \"The Secret Life of Pets\" is an entertaining and fun animated film that family members of all ages can enjoy!"
    },
    {
      "rating": "6",
      "text": "It was a good movie, but I didn't much care for it. The characters were done right, the animation was amazing, and some jokes were good. The issue to this movie was that the story felt unnecessary at some parts. The \"Villain\" (The Bunny) was bland, he was a bad guy in the beginning, then he was a good guy in the end which felt strange. After all, it's a good movie, but it's not my cup of tea. At least it's better than Ice Age: Collision Course and Norm Of The North."
    }
  ],
  "recommendations": [
    "bolt",
    "turbo",
    "the_croods",
    "the_secret_life_of_pets_2",
    "rio_2",
    "penguins_of_madagascar",
    "rise_of_the_guardians",
    "hotel_transylvania_2",
    "despicable_me",
    "storks",
    "cloudy_with_a_chance_of_meatballs_2",
    "dora_and_the_lost_city_of_gold",
    "the_good_dinosaur",
    "despicable_me_3",
    "ice_age_the_meltdown",
    "the_willoughbys",
    "the_lego_movie_2_the_second_part",
    "spies_in_disguise",
    "incredibles_2",
    "hotel_transylvania",
    "the_angry_birds_movie",
    "the_boss_baby_christmas_bonus",
    "hotel_transylvania_3_summer_vacation",
    "big_hero_6",
    "astro_boy"
  ]
}