{
  "id": 3827,
  "title": "The Physician",
  "starring": [
    "Tom Payne",
    "Ben Kingsley"
  ],
  "runtime": 155,
  "genre": [
    "Adventure",
    "Drama",
    "History"
  ],
  "description": "England, 1021. Rob Cole, a boy born in a miserable mining town, swears to become a physician and vanquish disease and death. His harsh path of many years, a quest for knowledge besieged by countless challenges and sacrifices, leads him to the remote Isfahan, in Persia, where he meets Ibn Sina, the greatest healer of his time.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6koFQEuyZKNYcBMSVEHYtAeIpUE.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This review has some minor spoilers, but nothing if you haven't already read the book. The film is a bad adaptation of Noah Gordon's best-seller. The director has created an entirely new story based on some events of the book. He chose to completely ignore the major events. Rob is shown as an innocent boy rather than a man who killed to survive and paid for prostitutes in his leisure time. While the book is focused on friendship, loyalty, love, innovation and pursuing your dreams, the movie has fallen into bad \"orientalism\" with a pinch of Zionism. Rob's Christian wife is replaced by a Jewish woman. As usual mainstream production companies love to focus on the victimisation of the Jewish people, even if the context doesn't fit into the given scenario. There has been never any persecution of the Jewish people in Iran/Persia (Esther is a fable based on no historical evidence). Even today, Iran holds the largest Jewish community in the middle east after Israel. Why is the movie so hell-bent to show the Jewish being persecuted violently by the Muslims in 1022 AD when the reality was anything but that? The orientalism is also a major issue that is discussed among scholars in recent years. Persia is shown like an Alladin fable from Walt Disney. For some reason, the director believes Persia is situated in Africa. Prostitutes approaching Rob are Black actresses speaking with thick Nigerian accents. The main bodyguards of the Shah are black men. Black people didn't settle in Persia until 600 years later when the Portuguese brought in some slaves from Africa to settle in the southern port of Bandar Abbas in the Persian Gulf. It is unnecessary to inject the multiculturalism and need for political correctness from 21st century into past events.But the movie showed also some amazing attention to detail that requires praise. All the extras on the streets of Isfahan spoke the Persian language. The numbers, songs and text used in scriptures were also in the Persian language. The armours of the soldiers and particularly the king in the final scene were historically correct. The most amazing part was when Rob spoke to a Zoroastrian patient in the hospital and discussed life after death to shed some light on the old Persian religion/culture.All in all an ok movie, but it remains a major disappointment when you already have read the book. Like the book, the film should have focused on the medical journey, discovery and life in the middle ages."
    }
  ],
  "recommendations": [
    "22_july",
    "a_united_kingdom",
    "aftermath",
    "joe_bell",
    "free_state_of_jones",
    "the_young_messiah",
    "munich",
    "13_minutes",
    "on_the_basis_of_sex",
    "emperor",
    "american_pastoral",
    "diego_maradona",
    "the_social_dilemma",
    "the_white_tiger",
    "the_pianist",
    "letters_from_iwo_jima",
    "the_hate_u_give",
    "race",
    "sweat",
    "cowboys",
    "deliver_us_from_evil",
    "the_33",
    "detroit",
    "the_miseducation_of_cameron_post",
    "a_hidden_life"
  ]
}