{"id": 4504, "title": "The Professor and the Madman", "starring": ["Mel Gibson", "Sean Penn"], "runtime": 124, "genre": ["History", "Drama", "Mystery", "Thriller"], "description": "Professor James Murray begins work compiling words for the first edition of the Oxford English Dictionary in the mid 19th century, and receives over 10,000 entries from a patient at Broadmoor Criminal Lunatic Asylum, Dr. William Minor.", "releaseYear": "2019", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/gtGCDLhfjW96qVarwctnuTpGOtD.jpg", "categories": {"plot": 7.615384615384615, "acting": 7.1, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 10.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "I don't agree with the professional critics giving this film such a low score. I thought Mel Gibson did a fine job as well as Sean Penn. The story keeps moving at a nice clip and is interesting."}, {"rating": "10", "text": "This is an excellent movie. This is one of the best I've seen lately. Strongly disagree with critics."}, {"rating": "10", "text": "Moving!Great acting!Memorable Story!Awesome!The story is an unknown history lesson.The lead actors and the supporting cast is simply great."}, {"rating": "4", "text": "One might think that with Mel Gibson and Sean Penn as main actors this would be a little bit better but no.Very slow, very passive and very boring."}, {"rating": "5", "text": "tienes escenas muy shockeantes innecesarias, la historia esta mal contada, y la viuda se ve que es la razon por la cula aceptaron estas estrellas."}, {"rating": "4", "text": "Gibson and Penn give brilliant performances that are sadly brought down by the slow pacing and the terrible second half. I can see why Gibson and the director disavowed this film."}, {"rating": "7", "text": "Don't heed the critics, who aparrently wanted to see another movie with other actors (maybe they walked into the wrong cinema by accident?). Not every movie has to win Oscars. The professor and the madman is an interesting story well told, combining historical events few probably knew about with human drama which Gibson and Penn both are well-equipped to portray. Watch it with family and enjoy on a Sunday evening."}, {"rating": "7", "text": "I loved the movie. The story is about a friendship between a \"mad\" American and an English professor. And, it is a story of love between the mad man and a widow. I learned a lot of things about Oxford English Dictionary. The actors are great. Please watch it."}, {"rating": "9", "text": "Very nicely photographed, acted, edited and directed.  An excellent historically accurate story of the creation of the first dictionary (hard to imagine an interesting story about a dictionary). Sean Penn and Mel Gibson (both good crazy people) both carry a strong role."}, {"rating": "8", "text": "In this rather monumental quest to tell the story of a tortured man who lived through his work, I find that this film did its absolute best to convey what happened at the birth of the dictionary.The sheer amount of the acting power that was on display in the person of two of the most skillful actors of all time is just amazing to watch, Sean Penn was and always be one of my favorite actors, the way he displayed emotion and pain in this film just goes to proves the mastery of his craft, he in a way, materialize the ideas of the character he was playing and took us on a journey to get to know this tortured man's life, it was an absolute joy to watch, and to have Mel Gibson on the other end is just amazing, this pair needs to do another film again, their charisma leaps through the screen.Granted that the film faces some problems with the transition at times critical moments of its narrative, but it serves its purpose and then some, and for that, I believe this film was great, flawed, it might be, but excellent nevertheless."}, {"rating": "4", "text": "The plot I'd read of this film sounded interesting and the cast seemed decent enough (I like Sean Penn, certainly), so I thought I'd give this a go. At first it was interesting but I lost interest in it after a while - I couldn't entirely follow some of the sub plots and its rather sombre. I certainly didn't find it gripping or anything. I wouldn't recommend this, no."}, {"rating": "9", "text": "This movie engulfed me.  Its music, lyrical writing and the ensemble cast brought to life a story of a redemptive nature we sorely need today.  It answers the question; If love .... Then what?  Well worth the time.  High praise indeed!"}], "recommendations": ["lincoln", "i_am_sam", "the_aviator", "a_beautiful_mind", "american_hustle", "the_theory_of_everything", "cinderella_man", "catch_me_if_you_can", "breakthrough", "scent_of_a_woman", "rush", "magnolia", "joy", "my_name_is_khan", "the_last_of_the_mohicans", "the_upside", "the_devil_all_the_time", "the_hurricane", "american_gangster", "changeling", "good_will_hunting", "the_place_beyond_the_pines", "steve_jobs", "murder_on_the_orient_express", "mystic_river"]}