{"id": 3866, "title": "The Ninth Gate", "starring": ["Johnny Depp", "Frank Langella"], "runtime": 133, "genre": ["Mystery", "Thriller", "Horror"], "description": "An all-expenses-paid international search for a rare copy of the book 'The Nine Gates of the Kingdom  of Shadows' brings an unscrupulous book dealer deep into a world of murder, double-dealing and satanic worship.", "releaseYear": "1999", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/cMd8zkd6NdWnQQoG7bQ9xJ8gjQR.jpg", "categories": {"plot": 6.833333333333333, "acting": 6.6, "ending": 6.888888888888889, "soundtrack": 5.0, "cinematography": 3.3333333333333335, "familyFriendly": 3.0, "funny": 0.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "A masterpiece that's highly underrated!!!! It's very hard to make a movie like that these days. Watch and enjoy THE NINTH GATE!!!! One of Roman's and Depp's best!!!"}, {"rating": "10", "text": "Johnny is brilliant in this movie and the storyline is horrifying. A very unique, offbeat classic."}, {"rating": "9", "text": "This film tells the story of Dean Corso, an expert on trade of rare books, which engages in a macabre story while trying to ascertain the authenticity of a rare book for a wealthy client. Directed by Roman Polanski, which also provides the script with John Brownjohn and Enrique Urbizu, this movie is starring Johnny Depp, Frank Langella and Lena Olin.This is one of the least known films of Depp's career, an actor who is fashionable and has many admirers. Perhaps the reason why this happens is the uncomfortable atmosphere of mystery surrounding the movie until, finally, \"swallows\" the main actor. The story is deeply mysterious: a book written by the Devil, pictures that can be used to invoke it, and a search across Europe, where every step you can find a strange place. Indeed, it was not by chance that Polanski chose Sintra as one of the scenarios for the story. The small Portuguese village is famous for the mysterious and enigmatic environment, as well as the legends it has. The choice of an ancient Cathar castle for the grand finale is also not devoid of sense, for all those who have studied history and know what were the Cathars.But the film is not only based on demonic mysteries, rare books and enigmatic places. The actors greatly contributed to the quality of the final work, with Depp to give evidence of tremendous versatility and talent, and Langella wisely using his grim appearance and incredibly dense voice to build a very calm character, but extremely scary and dark. Lena Olin is excellent, and although its no longer a young girl, she managed to build a great and sexually powerful character. But one of the strangest and most controversial characters is played by Emmanuelle Seigner, the wife of Roman Polanski. Its an attractive girl whose name is never revealed, but it will follow throughout the film, never showing clearly what it is, or who she is, despite giving various clues and proofs of supernatural powers and to know more about the events than it really wants to reveal. Guess who she is...The sets and shooting locations were chosen carefully, to give the film a dark and Gothic look. The photograph, something misty and dark, will also give their contribution to this environment, as well as the soundtrack, which is a great quality. It's a movie to see and review, although only people with some insight will be able to understand the film in its entirety."}, {"rating": "10", "text": "A rare dark gem. Slow-burning, haunting, mysterious. One of the most gripping, atmospheric thrillers I have ever seen and I've seen many. A technical masterpiece that sticks with you. The ending is indeed somewhat underwhelming and abrupt. Still, one of my all time favorite thrillers. I can only assume that the low \"Critic\" scores have at least something to do with the name Polanski."}, {"rating": "8", "text": "It was confusing in a good way. I loved it, but it was a little slow.. and i loved johnny again."}, {"rating": "10", "text": "Masterpiece, Polanski should be proud of this one.A Dark occult feature, feels like a film noir although it is not, great performance by the ensemble lead by Johnnie Depp."}, {"rating": "10", "text": "The Ninth Gate is a masterpiece, the music is dark, deep and fits the movie perfectly. Depp should make more horror movies, this is one of the best horror movies filled with endless mystery."}, {"rating": "8", "text": "If you simply want a movie that tells a story without having climaxes, this movie is for you\rThe plot is great, the mood is great - but the movie is slow. Which I personally really enjoy but it sure isn't something for everyone."}, {"rating": "9", "text": "Le genre ésotérico-satano-diabolique est souvent casse-gueule pour ceux qui tentent de s'y aventurer sans précaution et même Roman Polanski en sait quelque chose avec sa Rosemary... mais ici le réalisateur polonais y revient armé d'un scénario remarquable qui joue très habilement sur la corde raide du réalisme, du fantastique et du folklore hérético-biblique.Mené à la fois comme un polar, un thriller et une fable occulte, le film s'avère passionnant du début à la fin sur ses plus de deux heures bien tassées. Polanski maîtrise parfaitement son sujet et la distribution judicieusement choisie fait le reste avec le petit Johnny en libraire cynique et opiniâtre, le grand Langella en personnage trouble, la furie cougar Lena Olin (oui, c'était bien elle dans Romeo is bleeding...) et l'énigmatique Emmanuelle Seigner.La musique soignée accompagne le tout avec à-propos et seule la fin laisse quelque peu sur sa faim, bien qu'elle se suffise à elle-même d'une certaine façon... mais des interrogations demeurent quant à cette bien étrange cabale (et cavale). La vérité est sans doute ailleurs mais quelle ambiance fascinante ! on ne s'en lasse pas."}, {"rating": "8", "text": "I really liked this movie up until the end.  Depp's search for the books and the variations he found among them was very interesting.  However, I thought the end was schmaltzy and not in keeping with the rest of the film.  The scenes involving the meeting of the secret society and the death of Depp's client were particularly silly.  It could have been really wonderful had the end lived up to expectations based on the rest of the movie."}, {"rating": "10", "text": "Special, unforgettable, surrealist, explendid."}, {"rating": "10", "text": "A masterpiece of work, Johnny Depp is brilliant, one of the best mystery movies ever!I watched it so many times, it's highly underrated. Roman Polanski's best work, brilliant, brilliant, brilliant!"}, {"rating": "2", "text": "Utterly...utterly...boring. Nothing ever happens. I give it a 2 just because I am a fan of Lena Olin. The movie is perfect from a cinematographic point of view, except maybe for the protragonist's disgusting habit of lighting up a cigarette every 5 minutes. But the story is so lame, it is hard to stay awake. The devil is too stupid to get a simple book ? Bad news for all the evil people in the world, when their own boss is so dumb..."}, {"rating": "0", "text": "IDK how this is so loved, I really don't. Nothing worked in this film. The premise, while interesting, didn't develop well into an interesting story. The acting couldn't make up for the cheesy dialogue the cast was given and the soundtrack was almost comedic sounding at times despite this being a rather dark film. And that ending was just utter garbage. I'm disappointed I wasted 2 hours on this junk."}, {"rating": "3", "text": "Roman Polanski"}, {"rating": "7", "text": "I do not know how this could be called unthrilling or unchilling. I have seen many a horror/thriller and this one had me on pins and needles throughout. While it lacks true scares, director Roman Polanski repeatedly crafts a deliciously creepy and unsettling atmosphere dripping with mystery. As the film is unveiled, it continues to be compelling especially when Depp is on the search for the books and when he deals with the girl. Really the only moments that do not pay off are the final 20 minutes that simply feel awkward and clumsy, though the very ending is an interesting touch. That said, The Ninth Gate features a great performance from Depp and though inferior to Rosemary's Baby (obviously) and Chinatown (due to its neo-noir elements), it demonstrates Polanski's immense skill while working with mystery and horror, especially together. A devilishly mysterious and creepy thriller, The Ninth Gates more than satisfies."}, {"rating": "5", "text": "Despite the original and interesting story and the great score, nothing could really save this movie from being a bit ridiculous and even boring at times. With average at best acting performances and an insanely over the top third act, \"The Ninth Gate\" might be appealing to some if they are fans of Johnny Depp or Roman Polanski, but for he majority of people, it will probably be a disappointment."}, {"rating": "4", "text": "`The Ninth Gate': Off to Hell in a Handbasket, Trusty Book in Hand.\r For  those with an interest in seeing a dinner-theater version of \"Eyes Wide Shut,\" then look no further. Roman Polanski's \"Ninth Gate,\" with its wizened decadence -- Darius Khondji's velveteen cinematography looks as if it came out of Rembrandt's Fotomat -- and its tired stabs at comedy, is calling your name.\r Frank Langella, wearing a hairpiece that is most assuredly from the Stygian depths of Hell, is Boris Balkan, a wealthy and therefore evil collector of Devil-inspired antiquities who hires Dean Corso (Johnny Depp), a weedy rogue book dealer, to locate a volume called \"The Nine Gates.\"\r You can tell that Corso is a rebel kind of book dealer: he smokes as he pores over vintage tomes and he doesn't wear gloves to keep his skin oils from the delicate pages. Balkan hires Corso to find the volume that will unlock the Nine Gates.\r The book is so pernicious that it drives an elderly man to hang himself from a noose that doesn't look capable of supporting a pair of socks.\r Equipped with debonair slashes of white across the sides of his head, Corso begins a search that will take him over several continents and at least 90 minutes because there are three versions of the book in question. He must ascertain which \"Gates\" is authentic and stay a step ahead of Liana (Lena Olin), who cuts a striking figure in black; she was born to be a widow. It was her husband who killed himself, driven mad by some intoxicating combination of her fatale figure and having such a horrific tome in his possession.\r Aided by his aerodynamic hair detailing, Corso goes from one \"Gates\" owner to another to check out their copies. He's pursued by a sylph (Emmanuelle Seigner) with the vacant stare and bored pout of a 14-year-old idly channel-surfing in hopes of finding MTV's Carson Daly. She races across Europe after Corso.\r Is she on Corso's side? Will Balkan get Satan's powers in his clutches through mastery of \"The Nine Gates\"? And what about Satan? Since the rich in these Devil-quest spectaculars are always searching for the Devil but often come to a bad end, does this mean he's a socialist? Or perhaps, since money attracts money, that he's a supply-sider? These are questions to be answered sooner or later in an issue of Cahiers du Cinéma. Or The Industry Standard.\r In adapting the European slight-fright best seller \"El Club Dumas,\" Mr. Polanski is out to cross \"Rosemary's Baby\" with his saucy spoof \"The Fearless Vampire Killers,\" but this movie is about as scary as a sock-puppet re-enactment of \"The Blair Witch Project,\" and not nearly as funny.\r There's no leading man less interested in staying close to type than Mr. Depp. His Dean Corso is a craven hustler who makes the detached, cowardly Ichabod Crane he portrayed in \"Sleepy Hollow\" seem as forceful as Buffy the Vampire Slayer; he shows no interest in vesting learned characters with courage. Mr. Polanski's reflexes are gone, so all he can do is watch the camera pass gracefully from set to set."}, {"rating": "1", "text": "Very Boring. One of Johnny Depp's worst and it seems like the story comes to nothing in the end."}, {"rating": "6", "text": "This is just to note my score for this movie which I watched long time ago and totally forgot the details."}, {"rating": "9", "text": "The 1st portion was COOL but later part is really bad but depp is excellent."}, {"rating": "3", "text": "completely ok n plane movie, There isn't really that much to say about it because I cannot really remember much from it I watch it yesterday and my memory is already gone this is a really bad sign from the movie"}, {"rating": "8", "text": "The journey of a \"pilgrim\" in search of the devil presented in the form of a detective thriller on the surface. On the layer below there is atmospheric mysticism and irony. And underneath, on the bottom, it is a fascinating journey, a quest, with a mysterious beautiful stranger, money and power, turned out to be a fall, corruption and the devil himself in the form of a Babylonian harlot, riding the beast which the main character became.The path to the devil turned out to be hidden not in the texts of the books and not in mysterious illustrations, but in the ordinary perpetrations of the protagonist, committed in such a way that he did not notice these evil acts. Just as Satanists, eager to meet with the devil, do not notice him while the object of their desire openly walks among them in the form of a beautiful green-eyed girl in multi-colored socks - what could seem more innocent?Step by step, Corso steps down the path to hell, even without knowing it, and becomes the chosen one of the unclean, not because of some secret knowledge or spells, but by breaking one prohibition after another, in the name of generally good goals - money, pleasure and then out of revenge and in search of power. Until the \"ninth gate\" was opened.All these is not obvious and audience can remain at any of the levels suggested by the director. Maybe just enjoy the leisurely, atmospheric and ironic, aesthetic storytelling. Isn't that the beauty of a good movie?"}, {"rating": "3", "text": "Banal and predictable movie, betraying the novel in many ways. Everybody miscasted. Seigner is a Beauty with just one expression, also while \"flying\". Depp seems to be interested more in his CV (acting with RP) than in the production itself. Langella and Olin look as grotesque caricatures of their characters. The \"Evil Reunion\" at the castle is laughable... In short, Polanski at his worst (think of \"Rosemary's Baby\" instead !). Not to mention \"the end\" !!!"}, {"rating": "4", "text": "Not the best movie from Johnny Depp. Suppose to be like a santainic movie. It's really boring and the ending is dumb. It keeps you interested throughout though."}, {"rating": "9", "text": "assdfghjkopqkeomfoglpfkckmsksmdomfosmxomskamkwmemgrkeawipepslsmdkskskdksk,,,,,"}, {"rating": "9", "text": "ohhiguguihihhihifyfyughihiigguigugugguguugugugugugugugugugugugugugguugugugughuugugugyftdtdtfyvibigihihihihhiihih"}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;@,@,@,@,@,@,........"}, {"rating": "9", "text": "*::*:*:*:*:*:**\"*\"*\"*\"*\"*\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "9", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡"}, {"rating": "8", "text": "Symbolic, demonic scripture, cults and the occult, international travel mixed with mystery and satanic ritual, fire, death, orgies, and a gothic musical score. Thoroughly gripping throughout."}], "recommendations": ["dark_city", "constantine", "last_night_in_soho", "doctor_sleep", "the_crow", "crimson_peak", "the_cell", "secret_window", "the_raven", "a_cure_for_wellness", "stoker", "the_birds", "the_autopsy_of_jane_doe", "lost_highway", "the_mothman_prophecies", "midnight_special", "mandy", "what_lies_beneath", "the_others", "fantastic_beasts_and_where_to_find_them", "personal_shopper", "the_conjuring_the_devil_made_me_do_it", "annihilation", "the_ritual", "1408"]}