{
  "id": 1801,
  "title": "The Darkest Minds",
  "starring": [
    "Amandla Stenberg",
    "Harris Dickinson"
  ],
  "runtime": 105,
  "genre": [
    "Action",
    "Adventure",
    "Drama"
  ],
  "description": "After a disease kills 98% of America's children, the surviving 2% develop superpowers and are placed in internment camps. A 16-year-old girl escapes her camp and joins a group of other teens on the run from the government.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/94RaS52zmsqaiAe1TG20pdbJCZr.jpg",
  "categories": {
    "plot": 5.88,
    "acting": 4.928571428571429,
    "ending": 5.375,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 1.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I don't understand the bad reviews this film got. It's a really good film. The only downsides to it is that it's not really accurate to the first book (which is the only it's based on) and it should have been longer."
    },
    {
      "rating": "6",
      "text": "A conglomeration of pretty much every single trope in Young Adult literature, The Darkest Minds isn't outstanding or unique in anyway, and yet I found myself enjoying the ride. I think the strongest element that this movie has going for it is the chemistry between its actors. Once the clunky expository beginning is out of the way, and the party of misfit superpowered youths has assembled, the movie is quite enjoyable. The scenes where the kids hang out and become friends are some of the truest scenes in the movie. From a production standpoint, it feels like a straight to Netflix or straight to TV presentation. The script is full of plotholes as well. However, if you like YA or enjoyably good acting, check this one out."
    },
    {
      "rating": "3",
      "text": "Have you seen the Fox series ''Gifted'' that ties to the X-Men franchise? It demands more time but it's kind of the same deal and it's way better."
    },
    {
      "rating": "7",
      "text": "As someone that has read the books, I feel that it missed key aspects to the plot in the later books. I do understand why this was done: not sure how the movie will do... don't want to add story lines that won't matter if their won't be another film. With this being said I feel that the story was rushed and time was lost...it seems like the story only took place between a few weeks but the books elongates their journey, bringing them closer: a family. Looking at the movie from a viewpoint of someone that hasn't read the books, the story was exciting and real. I definitely feel that the book was better but I did enjoy the acting and the production as a whole. I never felt bored... always waiting for what was to come."
    },
    {
      "rating": "2",
      "text": "Darkest Minds begins hitting heavy, but unfortunately fails to continue that way. What really seems to me like a remix of the movie \"Divergent\" (which isn't a good thing), The Darkest Minds, focuses on a very forced love story, forcing even more a triangle than actually focusing on children dying over something that gives the survivors powers.Instead it turns into a generic, boring and heavily cliched movie, with corny dialogue that will make you roll your eyes until you have a migraine.There is absolutely NO RESOLUTION to any plot lines, making this feel like a 104 minute long introduction to a sequel. But let's be honest here, will a sequel really happen?"
    },
    {
      "rating": "8",
      "text": "I must say, I like The Darkest Minds. There’s definitely potential for character growths in sequels. There are a few developmental concepts that are shown which I shall discuss further on. Initially, I’m watching the movie thinking to myself: is this a wannabe X-Men/sequel to Logan? Yet, I find The Darkest Minds really comes to approach difficult generational hypotheticals and topics set under conditions that make the film’s intentions effective as well as the overall film more interesting.The first developmental concept I want to discuss is the use of the term ‘us’ in the film. The film is set in a childless world with a suffering economy. ‘Us’ becomes a generational word in phrases indicating a separation as well as a unity between differences and alikeness on the basis of generational circumstances. Highlighting Generation Z in relation to Millennials, Generation X, Baby Boomers, and the Silent Generation raises interesting stances concerning developments of the modern world. Connections between each generation really affects the outcome of the story.The second developmental concept branching from the first examines the requirements of society. People will have to work regardless of their generation in order to create sustainable-thriving societies. The film situates ‘us’ in manners which denote ways for generations, in particular Generation Z, to thrive relying on each individual in their own generation (long-term with the assistance of the capable, honest, and willing from prior generations?) and their natural surroundings due to the misappropriations of societal necessities by larger entities of earlier generations. Life and the skills one has in their life are core to the value systems in the film. What is even wilder is that particulars of earlier generations are using individuals with certain skill sets from newer generations and pitting them against each other for their own purposes.The third developmental concept concerns the use of technologies. The film focuses on the skills each individual is capable of utilizing effectively, their natural-super abilities, and only touches base with other forms of tech to connect with divisive behaviors from earlier generations. Keep in mind, the film is highlighting large entities, figures that may greatly affect scapes of societies, and is not indicting entire generations under an umbrella of same though highlights types of behaviors, circumstances, and mindsets that cause generational mayhem and unease as well as the opposites of all the aforementioned which may cause peace and ease.The fourth developmental concept I want to discuss concerns war. Aren’t we able to transform all of the worlds war materials into extremely large extra-curricular training facilities? People have to stop wanting to use each other for ill and have to stop wanting ill for other people. Amidst so much grand nature and a world of so many extra-curricular activities, I don’t understand the purpose of constantly warring. Misery should not be anyone’s choice equilibrium.The Darkest Minds looks good and flows well. The sound editing is one of its strongest areas and really boosts the cinematography. The acting is really decent though I think the film may really do well with more character development overall. Societies have come a long way. Plagues have been real detrimental factors shaping communities for generations. Germs and disease are an important area of discussion which is not given any more attention than is necessary to propel the story at moments though very important to discuss especially in accordance with developing medical technologies.The story is touching — not gripping — but, at the end of the film, I find myself slightly upset — though understanding — upset — slightly. I’m not going to spoil the ending for you. The film sets a lot of emphasis on memories and relationships between people as a catalyst for the story which I think is a strong point of the story that may have a lot more impact with more details.I think every film serves a purpose; some films are really good pieces overall, some films are meant to incite one to think of the film’s presentations, some films are distractions, and — well — some films do more than the descriptions or reputations their genres might seem to entail — especially for a viewer. It’s like how I feel about Teeth: I low-key want to own that film on DVD. The Darkest Minds brings to light interesting topics to converse about due to the settings which the topics exist in. I think the film is worth watching and, if there is one, I will be finding my way to watch a sequel.Overall Rating: B/B+— K.D.If you’re into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "7",
      "text": "I didn’t really have many expectations going into the movie (good or bad), but I actually really enjoyed it. I really liked the characters and the banter between them (especially the protagonist, Ruby) and I found the system of powers interesting and logical. The movie does at times feel a bit light for the dystopian world it’s set in, but I feel like it hits on some heavier themes without being grotesque, which is important for the audience it was targeting. It wasn’t a perfect movie, of course, but I don’t think it deserves the strongly negative reviews I’ve notice. At the very least, I feel like its a movie worth seeing so you can form your own opinions."
    },
    {
      "rating": "7",
      "text": "Ok... Let's be honest. It cannot be the best movie but is quite enjoyable. The movie has the potential to develop a great plot for future movies. The movie starts a premise that was previously known (dystopian worlds), but it develops the whole idea in a somewhat different way than other films of the genre and that is good. The protagonists manage to empathize and are credible (especially Ruby and Liam). The movie turns out to be just what fans of the genre like. It is sad that in its best moments, the movie goes too fast without really focusing on the images and content of these, because when these kinds of movies are filmed, it is required to take some risks in order to have a good product (we must remember that the world of the darkest minds can be interesting and exciting)."
    },
    {
      "rating": "2",
      "text": "Movie for children, advertaized for adaults. Actors palyed good, but script sucked big one. Written by kids for braindeads."
    },
    {
      "rating": "2",
      "text": "Its like they tried to pack a TV series into a film. The main character's parents forget who she is and 2 seconds later she's being picked up by dudes in biohazard suits? The country is post-apocalyptic because there aren't any children? The open ending indicating a sequel...yeah right. Don't bother watching this. It should have been dumped on Netflix."
    },
    {
      "rating": "4",
      "text": "\"The Darkest Minds\" was a somewhat predictable and not very entertaining film, where the performances and visual effects were decent but a story with many incongruities in the plot was the main trigger for the film to fail at the bottom leaving its story unfinished, another day and another Cinematic saga that ran out of end and oblivion."
    },
    {
      "rating": "5",
      "text": "The plot isn't so bad, but the pace of storytelling is too slow which makes people bored. Certain moments are so obvious and unnecessary for the main plot. I would've fast-forwarded those moments if it was an online streaming. The ending looks like implying a sequel, not sure if this movie will get one."
    },
    {
      "rating": "0",
      "text": "In addition to this movie just being flat out stupid, it's another exercise in 'ethnic absurdity' rather than diversity. In the US, the population is comprised of roughly 70% white people, 17% Hispanic, 12% black and 3% asian and .03% Indian. That means in a room of 100 people - 70 would be white , 17 hispanic, 12 blacks, 3 asians and almost 1 indian. Going to the movies and watching this piece of crap movie and unrealistic/absurd version of reality where asians, blacks, whites and indians are all EQUALLY present is just annoying. Hollywood needs to stop. Just make a decent movie and stop worrying about what minority is represented. BTW -- I didn't see ONE gay character??? They make up 10% of the population!!  I want next Superman to be Asian, and lex Luther to be gay and black and Lois Lane to a be transexual."
    },
    {
      "rating": "2",
      "text": "babababbaba boring. not a movie for 16 years + send your kids they would love the lack of plot"
    },
    {
      "rating": "5",
      "text": "This movie is jumping on the YA trend about 2 years too late. It's based on a series of books about yet another dystopian future, where young people are singled out for their gifts,..but not in a good way. There are some OK special effects and passable action, but too much of the plot is taken up by the romance between the 2 leads (Amandla Stenberg & Harris Dickinson). Even though they're compelling enough, these scenes drag down the momentum. Overall, it's a decent adventure for the intended audience, but breaks no new ground. NOTE: The ending doesn't conclude, but leaves you hanging for the sequel."
    },
    {
      "rating": "9",
      "text": "Much better than I expected.   Much better than it needed to be.  Wonderful lead performance.  Yes, it's more mutant mayhem, but no costumes and much more characterization.  What surprised me most here is the story is approximately empathy science fiction.  The lead does surprising things with empathy. I think another movie too humanistic, too sensitive, too much about Feelings for the average critic.  Go see it."
    },
    {
      "rating": "5",
      "text": "This kind of movies are popular in the same divergent and hunger games stranger things is an example of this, but these films are not the same beauty as the subject. Like I wrote in the title, it came to me like a children's movie. I became a little amateur. I do not like acting. obviously I was not bored watching movies in the cinema but I felt like I was bored in this movie My last words are good subject but not so good. Acting is bad I do not like the way I think it is bad :( :( :( :( :("
    },
    {
      "rating": "0",
      "text": "Une grosse merde woke avec un agenda SJW à la clé, à savoir de la diversité forcenée de partout, tout le temps (des gens de couleur partout, tout le temps) et des préoccupations de justice sociale à deux dollars et demi (on est ‘différent’, on est donc persécuté ! salauds de société naz… etc, etc).En l’occurrence, ces ados mutants et leurs pouvoirs surhumains, un thème déjà vu parmi la licence foisonnante X-Men mais traitée ici sans nuance et victimisée au maximum : l’on erre ici comme des étagères cassées en pleine crise des droits civiques des mutants à la mords-moi-le-noeud…C’est tout simplement insupportable à regarder, à entendre et à suivre… nous nous rebellons instinctivement devant ce film-étron, lequel s’avère par ailleurs chiant, chiatique et complètement con et nul à chier, de toute façon ! une daube wokiste de plus qui donne la nausée avec sa propagande nauséabonde d’extrême-gauche."
    },
    {
      "rating": "10",
      "text": "awesome movie i loved it so much definitely one of the best ones ive ever seen id love to see a sequel coming out soon ill keep my fingers crossed through all the bad reviews and the hate this movie is getting though, yall people dont know awesomeness when you see it sorry"
    },
    {
      "rating": "1",
      "text": "Stupid, dull, lame, generic, unoriginal, cliched, cringe-worthy, soulless X-Men, Hunger Games, Maze Runner, Divergent, and Twilight rip-off. This is the most generic YA novel adaptation ever. This is pandered to post-millennials. This was one of the worst movies of 2018. The acting from the cast is bad and with a horrible cast like this, you shouldn’t be surprised. The action is dull. The visual effects are terrible. The writing is horrific. The directing is terrible. The characters are so painfully generic and uninteresting. The cast is horrible. This movie has Amandla Stenberg and Mandy Moore in it, so it was always guaranteed to suck. They’re both terrible actresses, especially Stenberg. Amandla Stenberg is an annoying, boring, and untalented actress who has absolutely no charisma at all. She is also very wooden.I am so happy that this horrible movie bombed so hard at the box office. If it bombed really hard with critics, then it definitely deserved to bomb really hard at the box office. The Darkest Minds is nothing more a super generic and very unoriginal snooze-fest was that copies a lot of other YA adaptations. The movie was a bore fest and with that god-awful cast, it was also a dork fest. This movie is so cliched that it is cringe-worthy and the characters are so stereotypical.Oh, and the ending is stupid."
    },
    {
      "rating": "10",
      "text": "This movie is by far my favorite movie. The ending made me cry and it was left on a cliffhanger. I really hope that they make the second book, \"Never Fade\" into a movie."
    },
    {
      "rating": "6",
      "text": "This film had the ability to be soooo good but, for some reason, with the shoddy acting and terrible music with a quite boring cast and awful story line, this film didn’t turn out to be good at all. Also, what’s the deal with all these voice overs??? What I will say, however, is that this movie is one that you may wanna watch as a last resort - like when you’re ill or just really bored. There r sooooo many better films out there though so I’d just say choose one of those. I just feel sorry for some of the well known actors in this movie and I think they were really let down by the outcome"
    },
    {
      "rating": "10",
      "text": "Beautiful movie I loved it and the cast it left so much open for the second movie and I cant wait for that one too"
    },
    {
      "rating": "6",
      "text": "This is a movie in the same vein as \"The Hunger Games\" which is better than this and \"Maze Runner\" which is worse.  It has an interesting premise.  The actors are better than average and entirely new to me.  I recommend it for those with a few hours to kill instead of watching either of the other two I've mentioned above for the millionth time."
    },
    {
      "rating": "10",
      "text": "It’s an amazing movie for teens it doesn’t deserve the bad rep it gets if you are looking to watch it you will most likely enjoy it!"
    },
    {
      "rating": "5",
      "text": "Just finished the book and this movie is just meh. Casting Ruby as black was a bad choice, the acting was stilted and the movie felt so rushed. The book had filler but the movie was skipping it. This movie from what I can tell was trying to be the next hunger games. I have an issue that because the book was pov, there was no narration unlike another movie i love called the host. That movie was perfect for detailing a pov petspective on a movie. I bloody well hope that disney make this a movie series thats as dark as the books and not make bad casting choices."
    }
  ]
}