{
  "id": 3786,
  "title": "The Spy Who Dumped Me",
  "starring": [
    "Mila Kunis",
    "Kate McKinnon"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "A couple of thirtysomething best friends unwittingly become entangled in an international conspiracy when one’s ex-boyfriend shows up at their apartment with a team of deadly assassins on his trail.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tpPERI5i6yjT73jYWyZ9iWltQ9L.jpg",
  "categories": {
    "plot": 4.894736842105263,
    "acting": 5.066666666666666,
    "ending": 5.2,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.075,
    "action": 6.05
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Checks all the boxes for me. It's a legit action film starring two dynamo comedians who have the most incredible chemistry, so name a few. The action scenes are absolutely thrilling, and I wanted a sequel as soon as it ended. This is the spy movie we needed."
    },
    {
      "rating": "8",
      "text": "หนังโครตฮา/โครตบันเทิง/โครตมันส์ชอบหลายอย่างของหนังมาก มันให้อารมณ์เหมือนสองสาวพาเราไปเที่ยวเลย ฉาก Action ก็ไม่ธรรมดา เกินคาดมากไม่คิดว่าจะดุเดือดขนาดนี้ มุขตลกก็ทำได้ฮามากโดยเฉพาะ Kate McKinnonเล่นใหญ่สุด ฮาทุกครั้งที่นางโผล่มา ไม่เสียแรงที่ตัดสินใจดูเพราะคลิปตลก #SNL ของนางเลย >>> https://youtu.be/jJKEkZL9qrMส่วน Mila Kunis ถึงนางจะไม่ได้ปล่อยมุขมาก แต่ก็ได้ปล่อยความสวยแซ่บเท่ ทุกชีนแต่แอบเสียดายที่ แอดดูเสียงไทย ได้ทีมพากย์ พันธมิตรบางชีนเลยยังพากย์ฮาได้ไม่สุดพอ ใครที่ชอบหนัง Action ตลกแซ่บๆ ต้องรีบจัดเลยยย"
    },
    {
      "rating": "8",
      "text": "This movie was fun!  I enjoyed every minute and Mila Kunis and Kate mcKinnon are great as two ordinary, very innocent ladies who get thrown into a spy feeding frenzy when a boyfriend gives one of the ladies an object that all the spy agencies in the world are after.  As Audrey and Morgan, they are subjected to all kinds of danger and come through in hilarious fashion.  McKinnon especially is so fun to watch as she hams it up as the crazier one of the teo.  Especially loved a Cirque type performamce McKinnon ends up involved in.  Lots of car chases, close fighting and close calls.  I thought the laughs were right on and I loved the chemistry between the two and their bond in the film.  Great fun with lady spies for a change.  I too will be hoping for a sequel!"
    },
    {
      "rating": "10",
      "text": "This movie was so funny! I love the chemistry between Mila Kunis and the hilarious Kate McKinnon. Production companies have discovered the women like action movies too, and I am glad."
    },
    {
      "rating": "8",
      "text": "Legitimately funny movie, but be prepared to watch it more for the jokes than the plot.In the first ten minutes, I had my doubts. The characters and jokes appeared obvious and tired. (Plus, the movie has one of those  relationships where you have two attractive actors, but somehow Justin Theroux’s character is considered out of Mila Kunis’ character’s league.) However, when the spy stuff starts and Kunis and Kate McKinnon are whisked out of their everyday lives, things get really funny.There is a lot of great comedy to be mined here from having the characters go from one insane situation to the next. There is some shockingly, surprising stuff in here. The theater audience laughed quite a lot. The action is delightfully violent and over-the-top.Good cast overall, but the MVPs are Hasan Minhaj and Ivanna Sakhno. Minhaj is delightfully douchey as a CIA agent who can’t stop mentioning that he went to Harvard. Sakhno is the assassin trailing them and she kills it, no pun intended. She plays the role entirely seriously as she plays the kind-of-odd and completely dangerous pursuer.As much as I liked this movie, it could have been a little shorter. It tries to be an over-the-top R-rated comedy and a BFF-road trip of discovery, and it never quite balances perfectly. It’s not that I disagree with the character work, plus Kunis and McKinnon have great chemistry together, but they didn’t need to spend so much time on it. Those scenes just slow things down. Plus, the film also gives McKinnon’s character more comic screen time than needed, and it feels too indulgent."
    },
    {
      "rating": "8",
      "text": "While I wasn't crazy about some of the (unnecessary) foul language in the movie, the plot was lively, the action was nearly constant, the straight-lines a natural foil for highlighting the comedy portion, and I actually laughed outloud a lot! Newcomer to the big screen Sam Heughan balanced Kate McKinnon and Mila Kunis' zaniness rather well.  Go see it and get ready to laugh."
    },
    {
      "rating": "10",
      "text": "This movie rules and it makes zero sense that it has mediocre reviews. Kate McKinnon is hysterical. There's so many scenes where what she's doing physically absolutely killed me (no spoilers).I think this is a similar situation to Dumb and Dumber. When that came out, critics were like meh, and that's how we learned that movie critics are completely clueless when it comes to comedy. No idea why the masses also give mediocre reviews, but I have a strong suspicion the reason begins with m.... they're morons."
    },
    {
      "rating": "10",
      "text": "The chick flick with a twist, funny, witty and full of messages wrapped in cliches - stupid Americans, cold and brutal Easterners, clumsy agents and female BFFs. Pure adrenaline and hilarious ride through Euro capitols."
    },
    {
      "rating": "9",
      "text": "Red Sparrow (2018) shot footage in the same Budapest café that was used in \"The Spy Who Dumped Me.\" After \"Red Sparrow\" finished filming, director Susanna Fogel said that there were plans to tear down the café in order to renovate the building, but they offered to let \"The Spy Who Dumped Me\" destroy it first."
    },
    {
      "rating": "4",
      "text": "Runs out of jokes and energy *long* before the two-hour runtime, and the plot becomes practically incoherent by the end. Fans of McKinnon may find enough to justify watching it but otherwise just watch McCarthy’s SPY."
    },
    {
      "rating": "10",
      "text": "Kate McKinnon proves she's one of the most naturally funny comedians out there. Her first scene is GOLD !"
    },
    {
      "rating": "3",
      "text": "This movie tries so hard to be funny, yet it falls flat every time. Just another example of recycled ideas repackaged with women in an attempt to appeal to a certain audience."
    },
    {
      "rating": "10",
      "text": "+++++××××÷÷÷÷×××++++++++÷÷÷÷÷=====÷÷÷÷÷÷÷÷÷÷÷÷%%÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "6",
      "text": "Full of sex jokes, kind of entertaining, but a little bit tiring and disappointed in the end."
    },
    {
      "rating": "0",
      "text": "Since when u retards found this marked in Vilnius Lithuania ? u where filming in early 1918 ? and since when we sell this crap in out country? and SINCE WHEN people of our Country are this ugly ? Plz come at least visit our capital once before making a movie... **** retards 0 FOR THIS **** u DONT DESERVE MORE!!!"
    },
    {
      "rating": "4",
      "text": "– A pleasant enough summer movie on a hot afternoon. The lead actresses are personable and fun to watch, and the actors are handsome, hectic, and inoffensive. There is no wit in the film, but the script is mildly funny and the action non-stop. Europe looks nice (it never rains in comedies like this), and there are no lechers or sex jokes – well, there’s one sex joke early on, but it is so bad, it probably doesn’t count. Overall the film feels much too long, and cutting a half hour probably would have helped a lot."
    },
    {
      "rating": "0",
      "text": "Too unfunny to be a comedy.  Too dull to be an action film.  The characters are too unlikable to be a 'buddy' movie.There is nothing to recommend about this film."
    },
    {
      "rating": "6",
      "text": "In an attempt to put a comic twist on the spy genre, Mila Kunis and Kate McKinnon play friends who get haplessly caught up in international intrigue. The plot stars with some impressive stunts and chases, but it soon becomes more about interactions and silliness than action. The women have fun chemistry, but McKinnon handles most of the humor with her wonderfully wacky approach. Even so, the script doesn't provide enuff funny lines or situations. Ultimately, there's an upbeat approach that keeps it from sucking, but it's not sufficient to realize the potential hilarity of the premise. NOTE: There are some additional bits during the closing credits."
    },
    {
      "rating": "3",
      "text": "What is this, another Saturday Night Live production?! Half the cast are washouts from there. I think this was supposed to be Mila Kunis' biggest feature, she has top billing in it, but sorry, due to the on-all-the-time \"Family Guy\" show, I can only see her as the voice of \"Meg\" and even here you want to say \"Shut up, Meg.\" This effort is tough to rate. It's got great production values but Meg, I mean Mila, and Kate are just junior varsity in this, they don't have the chops, the gravitas to play in the big leagues. And the film is conflicted in what it wants to be and that falls on junior director/writer Susanna Fogel. At times it's a comedy/parody - mostly when Kate is active, and at others it tries to be a spy drama, featuring a serious Mila. But she's out of her element, she wants to be a \"big girl\" ala Angelina Jolie or Famke Janssen but she's just too small and cute, like Sarah Hyland, ha, they could be sisters/cousins. She's a romcom queen, not an action star, and that just poisons the experience. And it doesn't help that she runs around in soccer mom attire for 90% of the run time. The Powers That Be gave these gals a chance, but it's clear we won't be seeing them losing anymore studio money on their own."
    },
    {
      "rating": "5",
      "text": "I mean this movie has it all; violence, a basic script, two white blondes hooking up, an offensive joke about Canadians and poop humour. But hey, I'm glad to see more female driven action films by women directors."
    },
    {
      "rating": "5",
      "text": "\"The Spy Who Dumped Me\" is a watchable action-comedy that delivers exactly what is expected from it. While the plot makes zero sense, the lead actresses have good chemistry, and some of the jokes land."
    },
    {
      "rating": "6",
      "text": "Surprisingly good action scenes, hit and miss comedy, lackluster plot. There were several amazing stunts in this film, executed better than any of the Bourne Identity shaky-camera junk. Unfortunately, the solid spy action is wasted on a totally boilerplate story, and the action rarely has much plot motivation behind it. The comedy see-saws from laugh-out-loud to groan-inducing. The production quality is also inconsistent, with some high quality fight scenes spliced in between awkward cut-aways where Kunis and Mckinnon are clearly filmed during a different shoot."
    },
    {
      "rating": "7",
      "text": "I liked it, but it doesn't have any outstanding jokes or things like that as now that Im writing review months after watching it, I don't remember much of the jokes or anything, just the general plot. Would be higher if would stand out more, but doesnt really."
    },
    {
      "rating": "5",
      "text": "\"The Spy Who Dumped Me\" was a movie where jokes are not lacking and do not fail, the performances were decent, so Mila Kunis and Kte McKinnon don´t made a great job but neither a bad job, their job is decent like their chemistry, but the story was long and bad that greatly affected the rhythm of the film, and that the combination of genres such as comedy and spies is good in every movie, but in this one you feel less thanks to the story, a good attempt quite wasted."
    },
    {
      "rating": "4",
      "text": "Substandard.  Kunis is always great in this sort of film, but she sort of mails it in here.  And Kate McKinnon is just not good enough.  She needed to be much stronger in that role to make it work.  Why Justin Theroux would do this film is beyond me."
    },
    {
      "rating": "5",
      "text": "Pelicula bastante surrealista que te deja con muchas dudas a lo largo de la pelicula pero aun asi no llega a ser mala pelicula del todo."
    },
    {
      "rating": "2",
      "text": "Utter garbage.  Vile language, nudity, scatological and gynecological references, jokes that land with a thud and fail to evoke so much as a chuckle, and a plot so absurd that the viewer is motivated to endure till the end just to find out how the writers attempt to salvage it before the credits roll.  The $1.87 I paid to rent it from Redbox was too high a price to pay for a chance to watch such bilge."
    },
    {
      "rating": "4",
      "text": "Mila Kunis is terrible as a comedian which is actually a bad thing when you're watching a comedy and she's the main character.Also this film only came to reinforce my strong opinion that Kate McKinnon gets way too much credit, I mean what she does on Saturday Night Live is excellent but I think it works so well because they are small sketches, but in films, the truth is that for me she has not done anything worth mentioning and this forgettable comedy is just another forgettable role for her."
    },
    {
      "rating": "4",
      "text": "While some of the action scenes are pretty good, the humor is good in spots and after a while you get the schtick and it stops being funny.  I think they should've edited out about 20-30 minutes out of it and it probably would've played better.I think in the hands of a better director, it probably would've been a bigger hit.  As someone who's from Freehold, NJ, I did like the reference there.  :)  But you can't judge a movie by that.  I still think the whole thing of everyone chasing after a flash drive is kind of lazy.  No one has a laptop?  No one has a way to copy the drive and then give it to people?Also with the fingerprint and the phone, before you cut off his thumb, did you think.... gee, I don't know.... maybe you could add your own fingerprint to the phone so you didn't have to carry around a cut-off finger in your purse?  Anyone who has had a phone with a fingerprint sensor could tell you that.But I think the twists that were in here were meant to be bigger than they came across as.  In Prague, that one was pretty good... but at the end, the twist was OK... nothing amazing though.Maybe it's me but Kate McKinnon trying to be funny is good in small doses.  It's kind of like Kristin Wiig.  She realized that her SNL schtick wasn't something people wanted to see all the time and she has had some good roles.  With McKinnon, it's funny to a point, but you get tired of it after a while.  When I saw the ending, I figured OK.... what's going on?  And I kind of knew who everyone was but I really didn't care.I still think that if you get a flash drive decrypted that maybe you should back up the decrypted files to the hard drive so you can have them later?  But no one really tries to even write down the password he gave to them...  I liked the concept but it was better than the previews made it out to be... but not as good as it should've been considering how good Kunis is."
    },
    {
      "rating": "6",
      "text": "This movie is better than it deserves to be. It could have been so bad, but it does good with its cast. Everyone in this film does their best to sell it. Unfortunately, the thing they are selling is mediocre. If you replace this cast which has a great chemistry together with some other actors and actresses, this film becomes a solid 4 or 5. Mila and Kate are great together and really sell the best friend aspect of the film. There are a couple of missed jokes in my opinions, a forced love triangle of sorts that lasts three seconds. Not a lot of twists that happen and if, so they are predictable or so random and unpredictable that it just hurts the film in the long run.  Still a fun ride for the most part. Pacing is good if only to get to the next fun set piece. Some decent action and running gags. One bit with a CIA agent being very funny and almost genuine. Like they recorded a blooper real in character. The title gives away that Mila has gotten dumped by a spy, for the CIA, and an ex Machina device is found, and Mila and Co. find their way around the world to deliver it to the right hand with many hijinks throughout."
    },
    {
      "rating": "4",
      "text": "No es graciosa, la rubia es muy mala cómica, mila ya se ve muy vieja. La historia es casi l misma que Spy de la gorda , law y statan"
    },
    {
      "rating": "7",
      "text": "The Spy Who Dumped Me is a funny and witty movie. Kate McKinnon is the best part of the film, I died of laughter in several parts of the film. The action sequences are pretty great too, considering this a comedy film."
    },
    {
      "rating": "7",
      "text": "No one would fault you for looking at Kunis' track record in comedies and being dubious, but this one is an outlier and the inverse: rather than being broad-appealing and not actually very funny, it's quite niche and shockingly hilarious.  McKinnon is always a strong premise and the chase scenes are impressive."
    },
    {
      "rating": "1",
      "text": "Based on the first ten minutes of this movie, it is clear why it took less than 2 months for it to go from the big screen to DVD.  I found the chemistry between Mila Kunis and Kate McKinnon lacking. Kate seems as though she is trying way too hard to be funny, and Mila's character is just dull. There was absolutely no character development. It is hard to follow a movie, even for laughs, when the dialogue is so juvenile, and the plot is non existent. This movie is just bad acting, mediocre jokes, unimaginative writing, and poor production quality."
    },
    {
      "rating": "1",
      "text": "This movie is worser than my cat's litter box. The jokes were not satisfying, and it was so boring and predictable that i fell asleep during the movie.Do not see. I'm sure there are some better movies out there that actually provide some jokes."
    },
    {
      "rating": "6",
      "text": "This was not bad. I happened to giggle and enjoy it most of the time! I will say there's not much explanation at the end of the movie, which lost me. Who was working for who? Anyways, not a bad watch."
    },
    {
      "rating": "10",
      "text": "mmnnbbvvxcvjjkkhhggfffdsafguiiiytthmmokhuftdtdygjbiknojh⊙⊙⊙⊙☆☆☆☆》》》¡¡¡¡¿¿¿¿♧♤♡◇{}[]●□■○▪●●::;;$$,.."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤::::::::::::::::::::::::::::\"\";\";\";\";\";\";\";\";\";\";\";\";\";÷"
    },
    {
      "rating": "10",
      "text": "¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•"
    },
    {
      "rating": "10",
      "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:÷:=:=:=:=;=;=;=;_______________________________♡◇♡◇♡◇♡◇"
    },
    {
      "rating": "5",
      "text": "Too unfunny to be a comedy. Too dull to be an action film. The characters are too unlikable to be a 'buddy' movie.There is nothing to recommend about this film.This is the second Kate McKinnon buddy comedy I wanted to like--and DISliked mightily.  After suffering thru two of these I have a guess what's off.  I believe the whole premise is in conflict with the role of women now, since 2001 or perhaps 2012 (such shifts happen gradually).  The healthy aspects of women's liberation was NOT to empower women to make and star in Road To... movies ala Hope & Crosby, or character-driven buddy fare like Laurel and Hardy. Those old movies are farce made by men about the farcical world males create, populate and sustain with tired genre tropes. What healthy roles women women's liberated to play?  To LEAD in replacing conflict and competition with connection, collaboration and win-win negotiation.  The LEAD in replacing war with diplomacy, in business especially.  We see women stepping into these new roles very few places yet in pop culture.   The clearest examples so far is perhaps the first Gal Godot Wonder Woman movie. In mythological terms that actress and that director  demonstrate the new role of women.  Wonder Woman aspires to defeat the God of War himself.  By the Wonder Woman standard, very capable women playing buffoons, in a world run by buffoonish men, in a buffoonish world, made by men living one sided lives, is a theme more appropriate to the 1930s, 1940s or the era of  James Bond parody films. In 2018 or 2021, the premise of this film, is out of step with the exciting directions women are evolving."
    },
    {
      "rating": "4",
      "text": "This is a pretty bland action film. There are some chase scenes, some explosions and the like but I never felt engaged with it. The plot is predictable and a bit slow and I certainly didn't laugh at any of the jokes. I wouldn't recommend this film, no."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡$*$*$*$*$*$*$*$*$*$*$*$*$$*"
    }
  ]
}