{
  "id": 1111,
  "title": "The Equalizer 2",
  "starring": [
    "Denzel Washington",
    "Pedro Pascal"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Robert McCall, who serves an unflinching justice for the exploited and oppressed, embarks on a relentless, globe-trotting quest for vengeance when a long-time girl friend is murdered.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cQvc9N6JiMVKqol3wcYrGshsIdZ.jpg",
  "categories": {
    "plot": 6.162162162162162,
    "acting": 6.173913043478261,
    "ending": 5.375,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.431818181818182
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Denzel, now 64!, plays a retired (previously reported \"dead\") special ops guy that makes  a prosaic living as a Lyft operator. This affords him various opportunities to perform vigilante justice, not far removed from Batman, where he kicks butts that are 20-30 yrs younger, hmm. In fact, given he always talks calm, measured and low and has a panic room in his place which further fosters the superhero image. So if you're expecting authenticity and plausibility, sorry. His fight scenes are purely showcases for his awesomeness, I don't think he's ever even injured, not a cut, so... The one scene that held my interest for a few moments was the table talk he had with Dave a bit more than half way through, discussing the philosophy that justifies. The rest of the film is Denzel as plainclothes Batman, meh."
    },
    {
      "rating": "6",
      "text": "+Looks gorgeous in 4k HDR+Great fight choreography+Excellent cast elevate the limited writingAfter an incredibly silly bond style opening, Equalizer 2 does little to setup its main plot until a good 20 mins in. Sadly the more interesting material from the original has been stripped to its bare reducing our protagonist to just 'ex cia vigilante'. It feels like a missed opportunity to put out titular character to the test but instead its just another easy win for the infallible character."
    },
    {
      "rating": "5",
      "text": "If there's one thing that's never missing from cinemas for very long it's an action movie about a middle aged man, retired from *insert generic suspicious job here*, tormented by his past, possibly the death of a loved one (usually the wife) and dead set on helping the less fortunate. Sure he's no Keanu Reeves or Liam Neeson but Denzel ain't talking no crap from no one. I never saw the first Equalizer and I was able to keep up so you've no excuse.Robert McCall (Denzel Washington) the lyft driver uses his spare time to help random people with certain problems which always tend to result in violence. I never knew I wanted to see a super slow-motion shot of some scumbag getting his bones snapped reflected in the shot of an eyeball. With a clear strong sense of justice Denzel finds himself in a situation where he must question how far he will go to protect those he cares about. The thing about The Equalizer 2 is there are quite a few subplots going on simultaneously which in this case isn't a bad thing. We've seen this type of film countless times before so the subplots keep you interested. That is to say most of the subplots were interesting. Losing 20 minutes and at least one subplot would have made the Equalizer more compact. For me the last act was the most engaging but overall The Equalizer 2 delivers exactly what you expect. Generic, predictable and it was really helpful how the ominous sound of thunder rumbling can be heard every few minutes to maintain the atmosphere. It may not be a groundbreaking action movie but already it's doing better than the Taken franchise so you can bet we'll probably be seeing another Equalizer movie at some point. Enjoyable in the moment but honestly I'm already starting to forget it. Recommended for all you Denzel fans out there."
    },
    {
      "rating": "3",
      "text": "Boring and predictable. completely unneccessary and flat supporting characters."
    },
    {
      "rating": "9",
      "text": "For a long time I was very nervous.This action movie is brutal throughout.But sometimes it's touching.The two elements intertwined and it's great.PS(LOVE DANZEL WASHINGTON)"
    },
    {
      "rating": "10",
      "text": "For me I loved the original, and as always it's hard to top with a sequel.  In \"The Equalizer 2\" you just might have say this isn't the case, as it may have just actually happened.  For me this was the most fun I have had at a movie all summer.  Denzel is like a fine oiled machine who is at his best, and not sure maybe anyone else could have carried the movie like he did.  The movie kind of reminds you of Reeves in John Wick, don't piss either one of them off, and hurt someone they love as they will find you.  The story is slick and moves along at a very fast pace, I could feel the audience tense up at times, and also found myself shredding my fingernails as this one is a true nail biter.  The script keeps you guessing as to where it's all headed, very well written.  I loved the supporting cast in the movie as they bolstered the story.  If you looking for an action movie that won't leave you bored and give you an adrenaline shot for the summer, then this is the movie to go see.  My favorite so far for the summer of 2018, so good I may just have to go see it a second time!!"
    },
    {
      "rating": "9",
      "text": "Thanks to Denzel and Antoine Fuqua for another awesome Equalizer Film , plenty of action and subplots to keep you guessing. I like Ashton Sanders , too."
    },
    {
      "rating": "6",
      "text": "I really wanted to score this film in the green just because Denzel was playing the main character but the current 6.8 is more accurate. The story's theme kind of drifted in & out too much. Watchable but personally I enjoyed the original a bit more."
    },
    {
      "rating": "10",
      "text": "Some say its too slow but this was actually an overall good comeback sequel with a good plot and the last showdown really stole the show and was creative."
    },
    {
      "rating": "5",
      "text": "Practical entertainment but really forgettable in everything else. The truth is that this is not the sort of film that needed a sequel. I mean it's good and nice to see Denzel Washington working at this level despite his age, let's say he's now playing in the same arena as Liam Neeson but in reality the film isn't providing you with something fresh.You have seen this before and obviously if you saw the first one then you pretty much know what awaits you and certainly that's a big problem because there's nothing that would surprise you, it's predictable and in action films, predictability is death."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the first equalizer .I was happy that they remained faithful to the premise of the tv show which i also enjoyed unlike the Mission Impossible films that chose to be different.This film carries on in the same mode with McCall helping people but it also morphs nicely into a spy movie for the last half .The action scenes are very well done,the fights brutal and merciless and the results is very satisfying in this political correct world.Denzel excels in his role ,showing all the right acting chops.Bill Pullman also appears in a strangely minor and subdued role for him.Overall very enjoyable film."
    },
    {
      "rating": "1",
      "text": "A mess. I enjoyed the first one as an update of the TV show and Denzel fit the role nicely. This sequel has no particular focus and the pacing is tedious. It wakes up a bit when it's finally revealed who the villains actually are and the movie recognizes that all sorts of moral conflicts have come into play. Unfortunately it does nothing to explore those moral conflicts and just throws together a noisy action set piece to pointlessly end it all."
    },
    {
      "rating": "7",
      "text": "I really did not enjoy the first film so I went in almost dreading this, but I was thoroughly surprised. Denzel, even in these “throwaway” roles, continues to show why he is one of the best to ever do it, and the action and plot were much more clean and concise this time around. It’s solid in-the-moment escapism if nothing else."
    },
    {
      "rating": "10",
      "text": "For a good time, see this movie.  Writing this review to counteract all the reviews written by the pretentious, momma-mia loving reviewers."
    },
    {
      "rating": "8",
      "text": "One name. Denzel. He makes the movie. Solid throughout. Good score. Good characters. But Denzel makes the movie fascinating. He is a movie star. Knows when to underplay. But always has his power. Go see this and save Mamma Mia for Netflix and Chill where you miss it entirely."
    },
    {
      "rating": "8",
      "text": "Personally, I enjoyed this sequel as much as the first one, but I can see how this movie might not work for everyone.Surprisingly, the movie bucks the sequel trend by actually having less fight scenes than the original. Yet, it strangely works. The movie doesn't forget the purpose of The Equalizer: focusing on the little guy. A good portion of the film is just Denzel hanging out with people. Although this is an action film, it is also a journey through humanity, both the good and the bad. It doesn't hurt that Denzel as usual gives an excellent performance. He plays a man both charming and intimidating. A man who strives for the light even if he realizes the world may be ultimately grey.The action scenes that do happen do not disappoint. One reason it makes  sense there aren't as many fights is that Denzel's opponents in this film in contrast to the Russian mobsters from the last film have a lot more training and are more on the main character's level and aren't just cannon fodder. The final fight at the end really makes up in my opinion. I think it even rivals the fight at the end of Skyfall.Also, the very empathetic should be forwarned: the murders of civilians get really violent and protracted, more-so-than-usual."
    },
    {
      "rating": "4",
      "text": "an improvement but not an essential one..The Equalizer 22 Out Of 5The Equalizer 2 is a plot driven commercial action feature that depicts a typical revenge tale of a broken character that serves well to the society. The feature isn't ground-breaking or has a newer perspective to its genre but it undoubtedly is a passion project which is clearly visible as the euphoric energy on the screen never wears off.It is rich on technical aspects like its choreography of the action sequence, sharp sound effects and typical-cowboy-western-y dialogues (which may not work always) but unfortunately falls flat on cinematography, editing, background score and camera work which could have been a lot better.The writing isn't as smart or mature as the writers think which creates this vortex of disappointment for the audience that never leaves them throughout the course of it. The relationship projected between Washington and Sanders easily connects with the audience and helps it bind the plot tracks and keeps it grounded. The screenplay by Richard Wenk may be gripping but is too shallow and unnerving for the audience to care and root for the characters. Antoine Fuqua; the director, holds on to his role convincingly and delivers the expected execution but the concept and the structure of the script is the real culprit that never had enough crisp to make it to the screen in the first place.Denzel Washington; at the heart of it, is achingly good and makes it worth investing on it with a good supporting cast like Ashton Sanders and Pedro Pascal. The attitude of the protagonist and few little smooth action tactics are the only high points of the feature.The Equalizer 2 may be an improvement on terms of keeping the audience tangled into its crime world but it surely isn't an essential one or layered as the makers might suggest; none is wiser after the curtain drops."
    },
    {
      "rating": "7",
      "text": "The Equalizer 2 provides a solid experience. The directing was excellent - a certain scene later on displayed a mastery of camera angles, cuts, and intensity of action in a controlled manner, rather than the over-the-top, tiring trend of today. Some have already mentioned that the plot has issues - it is not focused enough, at least in the first half of the movie. Possibly too slow of a buildup towards the third act. However, I think that does not detract much from the experience. It does allow for character development, and gradual introduction of personalities, especially for viewers who did not watch the first film.Denzel Washington's acting easily carries the film. The villains were forgettable, unfortunately. I also found the scene with the \"office rapists\" that can be seen in the trailer terribly contrived and ill-convincing.Despite it all, if you want some solid, mature action, and a likable main character, this film is a worthy watch."
    },
    {
      "rating": "9",
      "text": "better than i expected, better than the first Equalizer. also one of the better movies i have seen this year. the highly rated movies i have seen recently were not that good, to hell with the professional critics! a few minor details like what happens when the cops find all the dead bodies? lol but who cares? or the young painter leaving an almost full gallon of paint uncovered as he walks away when its about to rain? minor details, a really good movie. Danzel delivers."
    },
    {
      "rating": "7",
      "text": "The movie was better than what I expected.  I enjoyed the storyline and the acting."
    },
    {
      "rating": "8",
      "text": "There are a few acting partners which I have only seen in good films and a few acting partners that have always been good in films that I’ve seen with them in it. Denzel Washington is one of the few. Mind you, I’ve not seen all acting partners in existence perform. Plus, let’s not forget the re-occurring living art on the stage entertaining frequently different guests. It’s really a different experience watching an in-person-live theatrical performance. Still — let’s not befuddle genres and mediums of acting(though so near in relation — apart, as Vachel Lindsay agrees).   I’m sitting in a theater watching the commercials before the previews; after a woman cop explains safety measures to take on a road especially when dealing with law enforcement, the previews begin, and more people trickle into the theater until the theater is nearly full. Now, observing individuals in a theater is similar to being on a roller coaster ride; everyone has a different reason for being and a different reaction being in a particular theater watching a particular film without any real idea of the countenances of their neighboring individuals in their seats in relation to content being shown before them.   There are two film trailers which I’ve seen garner the same reaction in theaters every single time as of late prior to their release: Equalizer II and The Nun. Each draws a different reaction; people lean in as though preparing to give an offering to the screen when Equalizer II’s trailer comes on, and people always jump during The Nun’s trailer (to be honest, my heart jumps every time though I already have seen the trailer many times — it’s weird. I’m definitely going to see The Nun). Alas, Equalizer II’s trailer makes me a bit skeptical about the film. The trailer does not draw me in so much — but, when I watch the film, oh my goodness — the trailer does it no true justice (to me — in my opinion).   Equalizer II turns out to be a really good film. It’s so easy to re-watch too. The acting partners are way better in full flow than in trailer bits. The story flows well and is not overwrought. It’s a good-simple movie that is better than good and simple in viewing.   The film brings up a lot of good points concerning communicating (seeking youths, female to male, etc.), communities (cleanliness, representation, homeliness, etc.), financial opportunities (employment for youth, employment from responsible others with money in communities, etc.), inclusivity (branching from diversity, showing love in others forms not too popularly shown i.e. older lovers, etc.), graffiti art (there are towns in the world that use graffiti to really liven up their areas artistically), mentorship (the film really shows how deep mentorship may actually get symbolically — though one never really knows…), and being in really simple ways intricately woven. The film actually shows a lot more than it tells and is really intricate in its functions to a fine degree that doesn’t take away from its entertainment value. Talk about never judging a book by its cover; never judge a film by its trailer. Plus, I’m really digging “In the Name of Love” by Jacob Banks which you have to watch the entirety of the film to get to.   Overall Grade: B  — K.D.  If you’re into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "4",
      "text": "The problem with this movie is simple, it's mundane and depressingly boring at times. It fluctuates up and down through action and meaningless dialogue. Denzel Washington was good, but that's about it. This movie isn't worth seeing."
    },
    {
      "rating": "9",
      "text": "A faithful follow up to a surprise hit. The Equalizer 2 delivers on all fronts. Yes there are some glaring similarities to the first movie and the reveal of the antagonist is thoroughly unsurprising. A classic example of an if it ain't broke don't fix it. Loved it!"
    },
    {
      "rating": "10",
      "text": "Compared to the first one, they really took it to a whole new level. Plot was addictive. Very good movie!!!!!!!!!!!!"
    },
    {
      "rating": "8",
      "text": "This is a very good action movie.  I am not completely certain i understand the plot, but that is often true for me.  DW plays McCall, a super smart, sorta psychic guy who knows what moves the bad guys are going to make before they even know.  He is so great as the Equalizer, and the supporting cast is up to the challenge.  Melissa Leo, Bill Pullman and Pedro Pascal are equally good in their respective roles.  I love watching the hand to hand fighting and also watching McCall as he gives the bad guys time to think they have the drop on him.  Very entertaining and fun.  Violent, of course.  But so engrossing."
    },
    {
      "rating": "6",
      "text": "Denzel Washington teams up director Antoine Fuqua (the 1st \"Equalizer\" & \"Training Day\") for another hard-hitting action film (well, at least some of it). To dilute the action, they've tossed in a few elements of Washington's Oscar-nominated \"Fences\" with a subplot about a talented neighborhood teen who's headed for trouble. The main scenario involves finding the killers of some seemingly unrelated people (and it's never clear what the motive was). There are some scenes that allow Washington to wreak violent havoc, but there's plenty of heavy drama to let him show off his acting licks. This is combined with several unnecessary elements that just confuse the narrative. Overall, Washington fans will find plenty to like."
    },
    {
      "rating": "10",
      "text": "A must see movie! especially if you are Denzel fan you are going to have a blast"
    },
    {
      "rating": "7",
      "text": "If it wasnt for Washington - noe of this would work.  But it does.  A light and very entertaining spy games thriller mixed with a dash of the urban man with no name.  Washington elevates everything he touches - this is worth a night at the movies even if its not as compelling as the first edition of the films series."
    },
    {
      "rating": "10",
      "text": "I loved this movie if you gave this move a 8 or less you must be a Troll. Number 1 movie in America now. Very fast pace and action what more should I say."
    },
    {
      "rating": "0",
      "text": "This movie is so bad, it made me create an account to write this. It is pure garbage. I'm taking a **** and I am more talented than the director and writers of the movie. On a more serious note, there were too many undeveloped story lines that concluded nowhere."
    },
    {
      "rating": "1",
      "text": "The best I can say is that the director provided a few interesting camera angles, but overall I was thoroughly disappointed by this sequel. Both the victims and villains were colorless, and Denzel (one of my favorite actors) walked through the role like someone simply going through the motions. No soul, no emotion, not even much determination. Nobody made me care. However, I will grant that the final “act” during the storm was quite well done, although the movie as a whole was a huge disappointment to me."
    },
    {
      "rating": "5",
      "text": "A much slower paced film that the first, even if Washington’s performance is remarkable."
    },
    {
      "rating": "5",
      "text": "The definition of mediocre.  Sure, there are fun moments, but it just doesn't add up to anything coherent. And the bad guy/girl? (no spoilers)  You never generate that hate for him/her that's necessary for you to get super pumped for Denzel to waste him/her."
    },
    {
      "rating": "5",
      "text": "The Equalizer 2 picks up not that long after The Equalizer concluded and Robert McCall (Denzel Washington) is now a Lyft driver. He picks up people and takes them wherever they need to be, and occasionally he does contract work for people on the side. Eventually, one of his friends is killed and he is set onto a quest for revenge. The Equalizer 2 is not as good as its predecessor. That's just how it is. The first 25 minutes or so of the film are used to fill us in on what McCall is doing these days and drags on far too long. There's a lot of him just driving people around during this section of the film and frankly it gets kind of boring. And really, this film should have been severely cut down in editing. It's a two hour, maybe a little over, long film that could have easily been done in about an hour and forty minutes. Antoine Fuqua attempts to provide a more complex story than the first film, but he fails to keep it entertaining and when the \"twist\" comes it's not a surprise at all. It's a twist that has been done dozens and dozens of times before and most people will be expecting it. The B Story in this film feels like a side quest in a video game, not an integral or even necessary part of the film. It's meant to show us the human side of Denzel, but it never fully does its job. The action is very good when it happens, but considering the reason why most people will see this film is because of the action, it seems a bit too spread out. Sometimes that's fine, but the story here isn't good enough to warrant such long gaps in-between the action. Furthermore, the final fight should be the best part of a film like this. The entire film was leading up to it, after all. But it's incredibly disappointing and I still can't believe this but it's arguably the worst part of this film. There is entertainment to be had here. But unless you have a theater subscription, or maybe you're a huge fan of the first one, I can't recommend spending the money to see this one on the big screen."
    },
    {
      "rating": "10",
      "text": "The Equalizer 2 was awesome, sequels tend to be meh, but they actually did a really good job, everything I loved with the first movie I could find in this one with a new story. Denzel Washington doing a great job as usual. 10/10 *I hope they do one more and because there is definitely another story that could develop from this one. *When you watch the movie you will know what I mean."
    },
    {
      "rating": "6",
      "text": "How You view this movie will heavily depend on what you think of the first.  I didn't mind the fist one, I was a bit disappointed because while though what I got was entertaining it wasn't as smart as I would have liked it to be and didn't give me those adrenaline filled action scenes that you normally get from most Antoine Fuqua movies. As much as I commend him for tying a different route I don't think it pulled off. This movie offers more of those wild and adrenaline filled action scenes that I like to see, similar to the magnificent seven.  That's this movies biggest praise, the action scenes, they are filmed in a very old fashioned kind of way that reminds me of 90's action films.  Denzel is great, there is no surprise there and I do like the emotions we get to explore with his character.  Besides that, this movie does have a very messy plot with a lot of supporting characters that are very boring and bring no further praise to the movie.  Its entertaining,  if you watch this movie for the action scenes and Denzel then that's all you really need to see."
    },
    {
      "rating": "7",
      "text": "If you have watched and enjoyed the first film you know what to expect from the second.That said the film moves on rapidly keeping the audiance entertained and although not gripping or suspenceful the actors are engaging and tbis was enjoyable to watch."
    },
    {
      "rating": "5",
      "text": "Washington is great and the film is stylistically very good but has serious issues with its script and story."
    },
    {
      "rating": "2",
      "text": "They wasted a good cast on junk writing. There are so many needless sub-plots that are a total waste of time, Especially when they revolve around one-off characters that won't even be around for the sequel (if there is one). And the action is too far and in-between. Also, What was up with him just immediately figuring out the real villain behind it all not even halfway through the movie? Denzel's character pretty much flat out confronts him and says \"I know it was you\". It's like the writer didn't even attempt some kind of grand reveal or mystery behind it and the real villain's reasoning is just painfully generic too."
    },
    {
      "rating": "9",
      "text": "all the sub-plots are really enjoyable and the main story shows a real motivation from Denzel character. I don't give a 10 because of some super-convenient plot devises (typical on action movies) but I had a blast beginning to end."
    },
    {
      "rating": "7",
      "text": "There are scrub leading men, there are average leading men, there are A-list leading men and then there's Denzel Washington. Regardless of the director, screenplay or supporting cast, the guy simply elevates every project he's associated with to — at the very least — par. I've yet to see a truly unenjoyable movie with him at the forefront. \"The Equalizer 2\" is no different. As an admitted fan of the first film, I can't say I wasn't excited to see him re-team with Antoine Fuqua for a follow-up. And, while it's nowhere near as much of a pleasant surprise as the first installment, it's still thoroughly entertaining. The action is helmed with unsurprising vigor, once again proving Fuqua's innate understanding of how to craft a good set piece. It's the screenplay, however, that sadly brings up the rear this time around, what with its inability to truly replicate that same sort of novelty and creativity I enjoyed so much about the first film. There are some decent little flourishes to the narrative here and there (namely the way that a few scenes are staged and also one particular subplot involving \"Moonlight\" standout Ashton Sanders) but you're really only here to see Denzel kick all sorts of ass. I'm just disappointed that this fact is a tad more overt now than it was in 2014."
    },
    {
      "rating": "6",
      "text": "The start was already horrible. Washington is showing a lot of political correct elements, especially I was shocked how the movie shows a father who took his daughter from her mother and is punished for that. There were no details given, so this is how it always should be. Aha...yes of course .-.-In addition it was annoying to see his character as such a noble hero, always good, solving so many problems, blabla. Fairy tale."
    },
    {
      "rating": "7",
      "text": "I like the action of this movie and while it is not as good as the first one, it still has many good action moments and the plot is not too bad either. If you like movies where a guy goes alone against many people and its full of action then this is one of the best ones in recent years (besides maybe John Wick)"
    },
    {
      "rating": "6",
      "text": "Adorei o primeiro filme, este segundo não deslumbra e mantem a mesma toada o que não foi muito bom. Ficar pelo primeiro teria sido o melhor."
    },
    {
      "rating": "6",
      "text": "tak się zastanawiam, a może ja po prostu podświadomie lubię filmy - rozpierduchy?"
    },
    {
      "rating": "6",
      "text": "Bueno no ha sido nada del otro mundo bastante entretenida aun que en grandes rasgos me esperaba un poco mas de esta pelicula."
    },
    {
      "rating": "7",
      "text": "Cet épisode est si froid que ce qu'il dégage sortit de la salle et le côté sombre. Un partit pris loin d'être détestable qui donne tout le charme à ce film. Ce parti pris le rend mieux que le premier sur beaucoup d'aspects, mais le fait perdre sur le côté affectueux du personnage.. J'attends le troisième."
    },
    {
      "rating": "7",
      "text": "This movie is a bit more subtle then the first. The story of the first was focus around the actions and the tactical violence. This time you actually get the agent doing some searching and analyzing in between point A to point B. It's not sexy and slow the pace of the movie, but I think it is necessary. It also shows that Denzel can do this character on a different level of acting. The action is still gory and violent. The tactical aspect of it is still present. Good music. Maybe the storm at the end was more or less convincing at times. I give it 72%. I think they took the time to show more about the Equalizer and I did appreciate the superb acting in this movie."
    },
    {
      "rating": "6",
      "text": "The best scenes in the film are actually when Denzel is monologuing to the other characters. There is a reason he's considered one of the best actors of our generation."
    },
    {
      "rating": "5",
      "text": "Denzel Washington shows off his star-power once again, but the film itself is too slowly paced and doesn't have enough to keep me interested besides the action and one or two likable, if not unoriginal, characters."
    }
  ]
}