{
  "id": 3054,
  "title": "The Girl with All the Gifts",
  "starring": [
    "Sennia Nanua",
    "Gemma Arterton"
  ],
  "runtime": 110,
  "genre": [
    "Drama",
    "Horror",
    "Thriller",
    "Science Fiction"
  ],
  "description": "In the future, a strange fungus has changed nearly everyone into a thoughtless, flesh-eating monster. When a scientist and a teacher find a girl who seems to be immune to the fungus, they all begin a journey to save humanity.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vdCD8z55a4RNmHQDPIpuMFqoY2B.jpg",
  "categories": {
    "plot": 6.45,
    "acting": 7.083333333333333,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "It is hilarious to compare the pretentious prattle of Clayton Dillard(Slantmagazine) dishing this one a 38 out of 100 to Helen O'Hara(Empire) who lauds it with an astonishing 100 out of 100. Dillard spots a lack of precision in the geometrically conceived stylization and feels it is a let down compared to Resident Evil: Retribution and Children of Men. I kid you not. If you happen to feel that this movie doesn't stand up to Alien(s), Blade Runner and Jurassic Park due to the egregious lack of a captivating comparative social narrative you are totally valid in that assessment. Just remember that pretentiousness demands the combination of at least three important sounding words, bonus points for adding more(I got four).O'Hara in turn praises not only the acting skills of the kid wonder but predicts that it’s the dense social commentary(note: three words) and moral dilemmas that will haunt you. A denseness that will haunt you? I know it will...I wonder who is on a trip further away from reality? And did they snort the same pods?In any event.. for those who live closer to the real world: it is an zombie flick in which the zombies are called hungries as to deceive you into thinking that these flesh eating dead aren't zombies. This time it isn't a virus, but a fungus. Not that it matters: it works the same way: get bitten and you become one. Further stuff we might have seen before. Mad Scientist(capitals as it is a trope), played by Glenn Close, who thinks she can save the world by using infected kids as ingredients for her cure. An infected kid who is jolly polite and eats cats(the latter amounts to the greatest sin of all according to my daughters). An accidental hero(ine) who thwarts the Mad Scientist. Doomed soldiers who are there to die(obviously). A military base that gets overrun(cause zombies win from machineguns, flamethrowers, rockets and nukes hands down every time). And Important Words.As extra you will see the kids from Beyond the Thunderdome as smart zombies hunt down one of hapless soldiers. Then they get put in their place when the jolly kid defeats their leader in a truly atrocious kids fight. Do they ever learn? In between stuff happening the band of hapless survivors talk about stuff. Feelings, their spouses and siblings and the end of the world. It must be that dense social commentary I missed. Well, I didn't actually, but I did.It's a decent flick.. but it cannot be held against you when you think it a dime in a dozen. Cause frankly.. it is all it is. The acting is at least okay even though nothing remarkable comes from it. Let me favor it with a six cause it is Tuesday."
    },
    {
      "rating": "5",
      "text": "Very much \"inspired\" by The Last of Us. Or ripped off more like. Which is fine, if it at least felt inspired by that story. Instead it feels rote. Even the twist of the climax isn't earned, it feels like it's done for its own sake."
    },
    {
      "rating": "7",
      "text": "The movie was predictable, it gets a little boring halfway through and the ending was pretty bad. Fortunately, the acting was very good, the action scenes were well made and violent and you do get attached to some of the characters. Overall, it's an above average zombie movie. Don't expect it to blow your mind."
    },
    {
      "rating": "7",
      "text": "\"The Girl with all the Gifts\" was a movie, extremely good, disturbing and moving, the story was good, the stage was good and the characters were good, the protagonist of the movie was the girl Sienna Nanua, her performance will lead her to Guide to stardom in the future. Gemma Arterton, Paddy Considine, and Glenn Closs, also stood out, and I did not imagine the film could be an adaptation of 28 Days Later ... Indie Edition, but the story I liked, it disturbed me a bit but I liked it."
    },
    {
      "rating": "0",
      "text": "This movie comes from a very disturbed mind.. and not in a good way.  It celebrates sympathy for the devil.  Zombies are to be empathized with, and people are the monsters.  Zombies are nothing more than the earth's ecology taking over the planet, as is right and proper.  If you're a liberal you're going to love this one!  Why bring politics into this you might say?  Because to minds like the one who conceived of this horrible film, politics is not about management of the society, it's a quest to display the more altruism than the next person.  This movie takes altruism, to the extent of rebellion against mankind itself.. in favor of nature, to a disturbing level.  I hope historians of the future view this movie as a good example of the mass insanity which plagued our age.. or perhaps like in the movie, a new species will reign that actually views this insanity as appealing.  If you're someone who believes in relocating ISIS to sanctuary cities, and that failure of the economy is justified in the name of fighting climate change, you're really going to love this movie."
    },
    {
      "rating": "10",
      "text": "The Girl with all the gifts has taken the generic and predictable zombie/virus movies and brought it to a whole new level. It skips the whole breakout of the virus that we’ve all seen before and kicks off right in the middle. Original and dark with terrific performances from everyone but the stand out performance definitely comes from Sennia Nanua. I loved this movie, it's simply wonderful. Highly recommended and a must see for horror fans."
    },
    {
      "rating": "10",
      "text": "The Girl With All The Gifts is an amazing adaptation on the novel it is based upon it is a refreshing new look at the zombie genre with Acton styling of 28 days later and amazing cinematography that puts you in mind of the post apocalyptic scenery from The Last Of Us bit brought to life it a fantastic movie and a must watch"
    },
    {
      "rating": "10",
      "text": "10 out of 10. I was suprised by how god it was. The start and the ending. All amazing. The makeup and effects are awesome. I read the book and both are awesome."
    },
    {
      "rating": "10",
      "text": "This movie is the culmination of the zombie film. From the writing to the cinematography, nothing feels out of place. The characters are exceptional and the entire cast is really solid. The lead actor, Sennia Nanua, makes the role. She has made a genre film that will only get better with time. I look forward to watching it often."
    },
    {
      "rating": "8",
      "text": "It's absolutely brilliant and fairly fresh. I would say it bears definite similarities to 28 Days Later, so in a sense, it's not totally original. Also, the first 70 minutes (or so) is better than the last 45 minutes. Based purely on the first 70 minutes, this would've been a 9."
    },
    {
      "rating": "5",
      "text": "The Girl with All the Gifts is the secret film adaptation from the videogame The Last of Us. Despite the author said that his inspiration was from a documentary of ants (the same as the game), the book came out a year later the game was release, suspicious. The idea, main protagonist and zombie behavior are identical to The Last of Us; the plot is similar until the outcome, which is a breeze of fresh air, thankfully. It is hard to evaluate the movie on its own, because all said before, but both treat a complex theme, when in a single person fight what is best for mankind versus individuality. The ending is strange though; difficult to understand how they reach a situation like that. Sennia Nenua is impressive, she carries out the entire movie and does such an amazing thing, to manipulate de viewer, in order to like her, hate her and be confused sometimes. Glenn Close is also pretty good."
    },
    {
      "rating": "7",
      "text": "The first step towards the new order after a great disaster.A dystopian British film. Zombie theme based on the book of the same name. The story of a few survivours, but all the focus was on the little girl. Thematically a very familiar film, but the storyline from the characters' perspective makes it unique. Nice cast, but it was not about Gemma Arterton. Her part was small, despite she can be seen in the film's entire stretch.At the beginning, I did not know what's happening. Only after the second stage of the story commence, most of the doubts were cleared. But again, till the final scene, the film holds us with the strong progression. In some parts, it looks silly, but makes sense on the basis of its all the developments.After their enclosure was broke, a group of survivours roams around the London looking for the food and the safe place. They manage to get away in some of the close encounters with the running deads. But how long it goes like that becomes the question. Besides, they divide when the girl comes into their topic. How the story ends was with a small twist.There were some good zombie films in the last two years. This is one of those. If you like zombie theme, you might find it a refreshing. Not the storywise, but the characters. The little kid was so good. They have picked the right one for that role. Looks like it could be a cult film. Ends high, but I don't think there will be any sequel or prequel in the future. Definitely worth a try.7/10"
    },
    {
      "rating": "8",
      "text": "Reminded me a bit of \"The Last of US\" and \"28 Days Later\" in terms of its premise and execution, this is a very solid entry into the Zombie/ horror movie genre.  Major props to the lead actor, Sennia Nanua, who does extremely well and shows great depth for such a young actor. The incredibly beautiful, Gemma Arterton is always a pleasure to watch as well"
    },
    {
      "rating": "8",
      "text": "I give this film a 7.5 rounded up to 8 on the strength of the acting talent and a few new twists on the reliable old zombie formula.  The characters are engaging, the story marches on relentlessly toward what seems like an inevitable doom, and for the most part the screenplay avoids the ridiculous errors the genre too often relies on because no one is clever enough to invent reasonable plot points that heighten the dramatic tension.  My main complaint is that the film begins right in the middle of the apocalypse and I for one would have preferred some backstory just to provide more context.All in all, a solid entry into the zombie catalog.  Any horror fans should definitely give it a watch."
    },
    {
      "rating": "6",
      "text": "It's another colourless zombie movie littered with zombie clichés, but the moral dilemmas that haunt the latter part of the film are clever & intriguing."
    },
    {
      "rating": "9",
      "text": "One advantage - if you can say so - of the zombie apocalypse genre is that it still doesn't show signs of being saturated or exhausted. The story knows how to convey fear to the viewer, especially because of the musical score and the final act that leaves us with doubts."
    },
    {
      "rating": "7",
      "text": "nicely photographed, edited and acted.  The zombie genre is evergreen as long as the script is strong and production values don't suffer.  This loses a lot of steam after the first act."
    },
    {
      "rating": "7",
      "text": "Rechtfertigt das Überleben von Millionen den Tod eines einzelnen? Diese auch in der Filmwelt uralte Frage steht im Zentrum von Colm McCarthys postapokalyptischem Quasi-Zombiefilm The Girl with all the Gifts. Ähnlich wie beim Videospiel The Last of Us macht hier ein brandgefährlicher Pilz hilflose Menschen zu fressgeilen Hungries, während der Rest im reizvoll überwucherten England um sein Überleben kämpft. Ein mögliches Gegenmittel trägt die infizierte, aber so gar nicht hirntote Melanie im Blut – dafür müsste das unschuldige Mädchen allerdings sterben. So entbrennt auf der rasanten Flucht durch die britische Heide ein moralischer Disput zwischen utilitaristischen Wissenschaftlern und ungewöhnlich menschlichen Soldaten. Schön, dass The Girl with all the Gifts dabei nicht nur als Gesellschaftssatire ziemlich gut funktioniert – auch als Horrorthriller ist der gut ausbalancierte Streifen dank viel Blut und Abwechslung der vielleicht beste Genrefilm seit 28 Days Later."
    },
    {
      "rating": "6",
      "text": "The movie starts off strong but with every gradual reveal in the movie it just gets worse and worse and almost borderline comical"
    },
    {
      "rating": "2",
      "text": "I lost interest halfway through. The plot makes absolutely no sense, and the science is vague at best. There's no character development at all which makes me feel like I'm wasting my time. The film has no resolution which is unsatisfying. Why is it that almost all zombie movies have no ending or answer as to what caused the apocalypse or how it was resolved? Hopefully the book was better. There are way better zombie movies out there. I'd skip this one.I wanted to like this one. But they spent way too much time in quiet school-setting talking scenes that had nothing to do with the plot. Zombie movies benefit from quick plot development cut with mind-numbing action. This film just took too long to get there. Also, the genre is saturated with these films, and this is a generic entry in a long list of zombie movies. It wasn't bad, but it wasn't great either. It was...OK."
    },
    {
      "rating": "4",
      "text": "The Girl with All the Gifts is a pretentious post apocalyptic flick, that try hard to bring it up into an author film but just mess as it was a poor budgeted foreign zombie film. The acting was good and the original score very effective, but otherwise nothing was really well done. Story is boring, directing is just lame and the makeup effects aren't good enough to keep the viewer entertained. The slow pacing and the lack of innovation and zombies sequences are what you just have to deal with. And as stated by another user, this is just a kind of Last of Us rip-off."
    },
    {
      "rating": "8",
      "text": "One of the better zombie movies of recent years in this crowded space. Worth checking out"
    }
  ],
  "recommendations": [
    "28_days_later",
    "world_war_z",
    "annabelle_comes_home",
    "the_purge_election_year",
    "daybreakers",
    "annihilation",
    "what_happened_to_monday",
    "sunshine",
    "reign_of_fire",
    "captive_state",
    "the_ritual",
    "maze_runner_the_scorch_trials",
    "lucy",
    "repo_men",
    "colossal",
    "they_live",
    "mortal_engines",
    "chaos_walking",
    "constantine",
    "color_out_of_space",
    "the_darkest_minds",
    "the_conjuring_the_devil_made_me_do_it",
    "death_note_relight_1_visions_of_a_god",
    "the_13th_warrior",
    "ouija_origin_of_evil"
  ]
}