{
  "id": 4560,
  "title": "The Secret Scripture",
  "starring": [
    "Rooney Mara",
    "Theo James"
  ],
  "runtime": 108,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "The hidden memoir of an elderly woman confined to a mental hospital reveals the history of her passionate yet tortured life, and of the religious and political upheavals in Ireland during the 1920s and 30s.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iVoZqwvGAwxvGVbYV5y04wpiBob.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.2,
    "ending": 7.555555555555555,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This should have been one of the great tragic love stories of the decade. It takes a well deserved look at the abuses of Catholic guilt and institutions – as well as the tragedy of undeserved admissions metered out to certain people hidden away in mental asylums of the day. The approach that director/co-writer (with Johnny Ferguson) Jim Sheridan has chosen, follows an unnecessarily trendy flash-back jigsaw puzzle style. This offers the audience little help to fully comprehend the complex relationships between the principle characters.  Characters are seen talking to each other (very briefly) without giving us the chance to easily identify with them as the focus of the story develops. It’s as if the numerous flash-back-fast-forward device is being used to hide various production problems.  The Irish locations are beautiful and accompanied by a haunting music score that helps add the much need atmosphere. There are very good performances throughout the picture but the situations are presented in a somewhat uninvolving manner. Make no mistake, this is a sad story indeed but lacks the much needed emotional cohesion to help us fully engage with the vital relationships. Those who don’t mind working harder than should be needed for a standard love story of the era may not mind the convoluted outcome but, many others will need to go back for another look and, this could amplify the stories huge reliance on several rather strained coincidences. The song that plays over the end titles is nothing less than excellent and packs an emotional wallop to help win over the viewer’s final feelings for this sad but not always convincing story.  An ‘upmarket’ sex scene that cements the lover’s relationship is played out in the heroines broken down cottage and even though there is a warm cosy bed in full view the director chooses the small, cold, bare wooden table for this to play out upon - somehow, I don’t quite think so."
    },
    {
      "rating": "8",
      "text": "The never-ending struggle for women in the male dominated world!This is a surprise film. Almost my favourite. Because I don't know when the last time I wetted my eyes. I'm not ashamed to say that I love sentimental films. This was not like a thorough tearjerker, but it gets there at some point. It was like I have been waiting for such film a very long time, so that I ended up liking it more than I was anticipating.An Irish-English language film with a wonderful cast. Because of those actors I have watched it, despite it was not promoted big like the Hollywood films. It's not in the mainstream films list. That's why not many people do not know about this film. Rooney Mara's one of the best performances. The remaining cast too had big roles, but was not powerful as hers.Films has genres, books has genres, but not all of those works converted to each other form works out. This is such a rare genre where both formats triumphs. Watching this film is almost as experience of reading the book. You know those literatures explaining the events, character deeply, emotionally, that's quite matching in this film with beautiful locations and nice background score.The suspense kept me expecting every moment of my watch. The end twist was not that difficult, but not all the viewers can predict it easily. It is a tale from the first half of the 20th century. But most of it was split into early and the later events. Overwhelmed by the flashback, the film reveals an old and a last woman in a mental asylum to evacuate the building to a new location. So those last moments of her stay in there, she explains why she's refusing to leave.-xX] There's a sickness in people that stops them seeing the truth. [Xx-A doctor from another place is now reviewing her case, has to go through her story to understand the situation and act accordingly, that's accompanied by a nurse. So she reveals her secret romance when she was young, when the whole town turned against her. Particularly a young priest. How she had ended up in the mental hospital, and after 40 years, now denying to leave the building. The story ends emotionally.The film was like the mix of 'The Little Prince' and 'Neverwas'. Because the reality and the other way around were nicely put together. Only it all were told from the grown up's perspective. They are showing something means does not you have to believe it. So it all comes to the final twist, how it ends by revealing what. No doubt if it resembles someone's real life, perhaps in the past, because in the earlier centuries, such fate, particularly for women is so common. That's where it's heart-wrenching.A perfect title for what it narrated. The older version of the lead role was too well performed. The romance part was short, but mystery extended till the final scene. Overall, the focus given to what to narrate and what not were nicely done. A very satisfying film, glad that I saw it.I don't know everybody would like it as much I did, but surely worth a try. Since the story was told from a woman's point of view about her struggle in the men dominated world, they might like it better than others. Because, as I know in the recent, the women's empowerment rising to equal men than never before. All I say is, just watch it!8.5/10"
    },
    {
      "rating": "5",
      "text": "Почему пастор такой злой я так и не понял. Просто постоянно крипово себя вел и делал пакости. Единственный норм поступок это когда он передал ребёнка, но опять же, вся ситуация была его рук дело, поэтому не считается."
    },
    {
      "rating": "10",
      "text": "A touching movie.It starts really slow... quite dark... but in the end it unfolds."
    }
  ],
  "recommendations": [
    "personal_shopper",
    "incendies",
    "leave_no_trace",
    "frantz",
    "20th_century_women",
    "the_book_thief",
    "i_kill_giants",
    "breathe",
    "the_33",
    "the_light_between_oceans",
    "lion",
    "the_age_of_adaline",
    "melancholia",
    "disobedience",
    "the_way_back",
    "a_monster_calls",
    "blue_valentine",
    "five_feet_apart",
    "the_road",
    "call_me_by_your_name",
    "searching",
    "thoroughbreds",
    "the_florida_project",
    "secretary",
    "elle"
  ]
}