{
  "id": 4306,
  "title": "The Skeleton Key",
  "starring": [
    "Kate Hudson",
    "Gena Rowlands"
  ],
  "runtime": 104,
  "genre": [
    "Drama",
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "A hospice nurse working at a spooky New Orleans plantation home finds herself entangled in a mystery involving the house's dark past.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sH7mDPlWwFTqVUg6yKRvToCMH3B.jpg",
  "categories": {
    "plot": 7.448275862068965,
    "acting": 7.647058823529412,
    "ending": 8.583333333333334,
    "soundtrack": 8.5,
    "cinematography": 7.0,
    "familyFriendly": 5.75,
    "funny": 4.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Caroline Ellis: It's like, hypnotism, right? Suggestion? And when this stuff works, its because someone believes it works?.. And if you thought, you know, that magic made you sick... you might believe in a magic cure?Mama Cynthia: Somebody been workin' roots on you.Caroline Ellis: Say I knew someone who thought that they'd been.Mama Cynthia: Crossed?Caroline Ellis: Crossed. Would they believe that they could be... uncrossed?"
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "10",
      "text": "The actors give impeccable performances, they also play off of one another making their acting & the movie better. The spooky atmosphere is the perfect feel for the plot and the twist at the end ties up loose ends. The twist is freaky as hell ! The Skeleton Key is by far Kate Hudson's best movie. I just hope that one day she decides to make another foray into the dimension of horror, 20 out of 10."
    },
    {
      "rating": "10",
      "text": "The skeleton key is a must see thriller. The movie is set in the swamps of the boondocks of louisiana. It is a heart quickening thriller with shocking twists."
    },
    {
      "rating": "10",
      "text": "In my opinion, this is Kate's best film. It is scary, clever & surprising. It is a spooky masterpiece that you have to see."
    },
    {
      "rating": "10",
      "text": "This contemporary supernatural thriller, set largely in the dark atmospheric backwoods just outside of New Orleans, stars Hudson as a live-in nurse hired to care for an elderly woman's (Rowlands) ailing husband (Hurt) in their home...a foreboding and decrepit mansion in the Louisiana delta. (Universal Pictures)"
    },
    {
      "rating": "10",
      "text": "Why the twist at the end of the movie is very disturbing.I thought this movie was great because of the twist at the end. I have seen this movie on a couple of occasions and 2 out of 3 people miss the most creepy and disturbing part of the whole movie. The funny thing about this movie is that the sacrifices all started with the children of the wealthy banker. Papa Justify and Mama Cecile took over the children's bodies during the party and then the people at the party hung and burned the children thinking it was the servants. That in itself was disturbing. They then shot the wealthy banker & his wife, then took over the house and lived there until they took over the new couples bodies in 1962."
    },
    {
      "rating": "10",
      "text": "Early in the film, Violet voices her dismay that Caroline doesn't have a New Orleans accent. This is due to her plan to possess Caroline by the end of the film - and their accents wouldn't match."
    },
    {
      "rating": "10",
      "text": "Caroline Ellis: I thought the key opens everything.Violet Devereaux: The key? What key?Caroline Ellis: The key you gave me for the house. There is a door in the attic it doesn't work for.Violet Devereaux: Oh, the attic, it's never opened that."
    },
    {
      "rating": "10",
      "text": "Caroline Ellis: I told you I wanted a black one this time.Luke: You know the black ones never stay. Beggars can't be choosers. I think it suits you beautifully. It's better than Violet or Grace, even. We'll get used to it. We always do."
    },
    {
      "rating": "10",
      "text": "When Luke (Peter Sarsgaard) is talking to Caroline (Kate Hudson) in her room, Violet (Gena Rowlands) walks in and says \"so you two kids are getting to know each other\", to which Luke replies that she (Violet) is the only woman in his life. This foreshadows the twist about Luke's and Violet's true identities."
    },
    {
      "rating": "10",
      "text": "abcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyz--"
    },
    {
      "rating": "10",
      "text": "artsughuvhjbyfgjttdgjujhkoloouujjguyfgyvgffewwwdwqsxfujjjkopkpmloihgfgjkiyewqsxgyjjook"
    },
    {
      "rating": "10",
      "text": "Suspenseful and surprising movie!This movie is definitely my favorite movie ever. It was packed with suspense and action. So many mysterious things happening and you can't wait to see what will happen!I was wary about seeing this movie...It seemed like it would be another overdone horror. However, this was not a horror film. It was more of a thriller type. You learn about the eccentric religion of Hoodoo and about the strange happenings going on in the South. Kate Hudson is absolutely phenomenal playing Caroline. She captures the character perfectly and there were so many twists in this thriller."
    },
    {
      "rating": "10",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,------------------------"
    },
    {
      "rating": "10",
      "text": "□■□■□■□■□■□■□■□■□■□■□■□□■□■□■□■□■□■~♤♡◇♧♤♡◇♧♤♡◇♧♤♡◇♧♤♡◇♧°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°"
    },
    {
      "rating": "10",
      "text": "Character error Caroline needs chalk to make a protective hoodoo symbol. She uses blackboard chalk, but that is made of gypsum, not of calcite"
    },
    {
      "rating": "10",
      "text": "Factual errors The LP record couldn't have been recorded in 1920, since it was only invented in 1948."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡•¡•¡•¡¤¡¤¡•¡•¡•¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°¡°¡°¡°¡°¡°"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#+÷%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$+÷"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "3",
      "text": "Uh, no; the critics are pretty much right"
    },
    {
      "rating": "5",
      "text": "If Caroline (Kate Hudson) is supposed to be a prospective nurse, she should probably make a bigger deal over her patient's ability to crawl out of his room, knowing that he was diagnosed with a massive stroke. This incident, in which the geriatric man somehow survives a tumble from his roof, seems to be forgotten by the hospice worker. If she remembered that a temporary awakening of the body is atypical of stroke victims, \"Skeleton Key\" would've been a lot shorter. But if Caroline was smarter, we'd be deprived of the unintentionally funny moment when she runs around the house with a jar of dirt."
    },
    {
      "rating": "3",
      "text": "Painful to watch a fine cast wasted in such a horrible film."
    },
    {
      "rating": "5",
      "text": "I really liked it at first but it's one of those movies that tries to be original and shock you with a plot twist. Unfortunatly it just gave too many clues and it's very easy to figue out what's going on and it's annoying to watch the clueless protagonist. At least it gets props for a unstereotypical ending."
    },
    {
      "rating": "7",
      "text": "I am an avowed fan of horror films but I must confess that films with haunted houses are so common that it gradually became uninteresting. Still, there's nothing like giving new material a chance. That's what I did here. And I was reasonably satisfied: its a film that knows how to build atmosphere and tension and a pleasant mystery, even if its not capable of frightening.Everything takes place in the swamps of the suburbs of the mysterious old New Orleans. In an old colonial house lives an elderly couple who hires Caroline, a nurse and elderly caregiver who goes to that house at the hand of the family notary in order to care for Ben, the family patriarch, very weakened by a stroke that left him disabled. But it doesn't take long for the young woman to discover that the house hides many ancient secrets and some of these secrets can really be a threat.As a pure horror film its weak... but it has a satisfactory cast and a tense atmosphere that, coupled with a decent script, with the inclusion of witchcraft and vodoo themes (it's New Orleans, how could we not think in this?) helps the plot and serves as glue to everything we have here. I felt that the character Caroline is not developed properly and is poorly presented to the public, since we don't know much about her and that makes her a figure more than a character that we can feel and that touches us. Even so, it is a functional film that delivers more or less what it promises, despite not being able to scare or go beyond tension and some occasional chills.The cast has several names of some weight. Peter Sarsgaard is the most resonant name, but he is guarded by a character who doesn't appear that much but guarantees him a minimum of presence. Kate Hudson is elegant and beautiful, and knows how to play her role, but does not seem to feel her character as she should, in some scenes that seem less well worked or well Gena Rowlands, in turn, is extraordinary and makes a character truly colossal.Technically, I would like to highlight the quality of cinematography and the work of filming and editing, which gave the film a very important visual beauty to build the environment that the film requires. The scenes and landscapes of the swamps and the city are excellent and were used in the best way. The effects are minimal, but they fulfill their role, the sets and costumes, as well as the Swedish landscapes (with or without snow) increase the visual beauty of the whole set. The soundtrack does its job well."
    },
    {
      "rating": "5",
      "text": "Pair of black servants in Louisiana were killed for practising Hoodoo in a banker's house and now switch bodies through rituals that only work if you believe in them."
    },
    {
      "rating": "9",
      "text": "●●●●●●●●●●●●●●●●●○○○○○○○○○○○○○○○○○○\",\",\",\",\",\",\",\",\",\",\",\",\",+,+,+,+,÷,÷,=,=,=,÷,÷,÷,......"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    },
    {
      "rating": "2",
      "text": "Not even in a moment of boredom should you go see this movie. The plots and twists and everything...all borrowed...nothing new."
    },
    {
      "rating": "5",
      "text": "Pretty good up until that worthless twist ending."
    },
    {
      "rating": "10",
      "text": "The opening shots of sunlight turning rain in the moss into jewels captured my eyes, and the soundtrack hooked right into my heart. Like Caroline, I entered the Devereaux world an unbeliever, but mood, pace, atmosphere, and evocative scenery banked securely on a haunting score drew me in. It's worth more than one viewing and run, don't walk, to buy the score."
    },
    {
      "rating": "8",
      "text": "Suspenseful movie and pretty good acting, but if you've seen Burnt Offerings (from 1976) and Die Die My Darling! (from the 1960s), you've already seen it. It is not an original movie -- it is a remake."
    },
    {
      "rating": "8",
      "text": "Not the scariest film out there but the intriguing storyline makes up for it. I absolutely detested/adored the ending. It"
    },
    {
      "rating": "6",
      "text": "It is a movie intended to scare and frighten the audience. What is most frightening and scary is that some reputable critics and newspapers found it worthy of positive comments and recommendations. There is no doubt that, as badly written as this film is, it has a cast that tries very hard to make it work. This is Kate Hudson"
    },
    {
      "rating": "8",
      "text": "Great premise and idea. Awful execution for first half, great execution for the second half."
    },
    {
      "rating": "5",
      "text": "There was one good scare at this movie, and that was a loud roaring of thunder at exactly the right time to cause a jump. Hopefully that will alert you to the extent of this movie's horror. It's just not scary. You have a haunted house, (done well in The Grudge,) you have a creepy setting, (done well in Secret Window,) and you have a concept that isn't often seen in mainstream horror. So why does this movie suck this badly? It's not scary. The characters are flat. There is almost no action. The \"twist\" ending really isn't anything special, and the fact that they're now promoting it as \"The next Sixth Sense\" is really just going to disappoint people. It's a nice twist, kind of, but when they are using that to promote the movie, it had better be an AWESOME twist."
    },
    {
      "rating": "8",
      "text": "What an ending! But I don't want to spill any suspense ;-) I enjoyed this movie from start to finish."
    },
    {
      "rating": "8",
      "text": "A very well-done thriller. One of the more underrated films of 2005. First of all, you have some supremely talented actors who could probably make any script work. Also, the screenplay is very intelligent. The characters are fairly fleshed out, and the story never veers over the top. The twist is a corkscrew in and of itself, strengthening everything that came before it. In fact, it may take moviegoers two viewings to realize it's true power. To top it all off, the movie is beautifully designed and photographed. A solid rating from me."
    },
    {
      "rating": "10",
      "text": "Suspenseful and heart-quickening, this thriller had me on the edge of my seat, hiding. The ending had me rooting for Caroline and her adventure. A+"
    },
    {
      "rating": "1",
      "text": "Its like unintentionally funny multiplied itself by unintentionally funny and they canceled eachother out."
    },
    {
      "rating": "8",
      "text": "Suspensful and morraly correct, a product of fear with surprising sequences that will leave you haunted, masterful work, the climax is stunning!"
    },
    {
      "rating": "8",
      "text": "Three days later this movie is still running thru my head. It's one of those movies that moves like the first few chapters of an undiscussed suspense novel.. Minimum Shock & Boo.. Unsure of where it's going to go but interesting enough to continue. But the ending made what preceded disturbing."
    },
    {
      "rating": "3",
      "text": "This is seriously bad. The three is there because of a good performance by always solid Peter Sarsgaard and for some nice cinematography. kate hudson is awful and so is the screenplay. Save your money."
    },
    {
      "rating": "7",
      "text": "This movie is quite good I think, although you'll have to be rather open minded towards supernatural, occult type things and such like, to really 'believe' it. Kate does quite well in this role, becoming gradually more concerned and and consumed by what she discovers, along with the viewer and it does become really quite atmospheric and spooky as little by little we start to realise what has happened and what certain things mean. Its hard to say too much without giving away too much obviously but little by little, the mystery starts to be unravelled. I would say that this movie is less outright scary and more spooky/sinister really, personally I didn't find it very scary but thats not to say that I think its a bad movie and it didn't have any effect on me and certainly if you watch it at night with the lights off, it is pretty creepy, just it doesn't feature much in the way of blood and gore or very heavy violence as such, which was a relief for me since thats what puts me off, I can't handle horror movies that are too visually graphic in that sense. Instead I suppose I could say that its more similar to movies, in feel, to What Lies Beneath or even The Blair Witch Project. The shocks don't come as often as perhaps they do in The Blair Witch Project but there again in a sense thats perhaps a good thing as when they do, their more likely to take you by surprise!.I liked the plot of the movie in a way as it was fairly thought out, there was a proper story behind it, which became somewhat more intriguing as the movie continued, it didn't strike me as a rushed and sloppy movie in that aspect, so thats good. If your going to be overly critical then you may find things a little silly, for instance I thought the character of the towns estate lawyer, Luke Marshall, was a bit daft, given what happens towards the end. I would also point out that you do need to pay a fair bit of attention to the ins and outs of the story as it plays out because the movie has quite a twist at the end and it might not be too obvious or clear or otherwise make a great deal of sense if you don't keep track of whats going on, which is perhaps common sense but I did get a bit mixed up at times, so I thought I'd add that (I have to say over the last while, I've been getting steadily worse at concentrating on movies but I don't feel its the movies fault, its me lol its so difficult to concentrate and not keep checking the 'net and everything else at the same time, so, my bad lol).I think as a creepy supernatural thriller, it does quite well, the story is pretty good and the main performances are fine too, plus at one hour and forty minutes long, its a good length movie too, not dragging on or ending too abruptly. The twist near the end also may well take you by surprise, so all in all its a pretty decent movie.Yes, I'll recommend this movie as, like I've said already, its got a decent enough story and the acting is fine too. It is pretty creepy at times and does quite well as a supernatural or psychological thriller probably moreso than as a horror movie, though I've seen it classified as both. It perhaps requires a bit of open minded-ness (if such a term exists?) to be able to be properly taken in by what happens but the same can be said for pretty much any and all such movies in this genre and I liked how the story seemed to only be revealed bit by bit, with the twist at the end. It perhaps isn't totally flawless but its pretty decent all the same, so overall yes, I would recommend it."
    },
    {
      "rating": "10",
      "text": "10/10 OMG... this is the best movie ever!Just so you know, the total spoiler is at the bottom... so you can read until it says spoilerKate Hudson really did it this time. This is one of the best movies ever made. Because it was filmed in the murky woods and swamps of New Orleans Louisianna, the thought of hoodoo and magic run through your mind. Chills run down your spine, and you just want to look behind you just one more time. The trailer partially directs you in one direction, and then the movie turns the hole movie around. This is a fantastically written ghost story, that took my world by storm. This movie creeps you out, but not heavily. The movie is not boring at all, at any times. Perfectly acted, and with a great storyline, no movie could possibly beat this. The ending is way more surprising then sixth sense. It is the most surprising ending i have ever seen in my life. The ending is sad, and exciting, and creepy all at the same time. You can also learn that you can not always trust anybody. The movie is also funny, mysterious, and dramatic. You feel the fear that Caroline (Kate Hudson) feels, after stumbling upon an attic, with hoodoo rituals inside. I recommend this movie to everyone! This is a must-see!Lets get to the story anyhow: Caroline (hudson) is a kind caretaker that is tired of her job, where her fellow co-workers don't really seem to care for anyone. She finally finds a new job - taking care of Ben (Hurt). Hurt had a stroke in the attic, and is paralyzed and mute. Violet (Rowlands) is trying to make her husband feel better by getting him the caretaker (caroline) which she does not like at first. Within the huge house, you hear a *creek* or two every now and then, and the attic is just damn right suspicious. After checking the attic a few times, Caroline is suspicious that something is going on in this house, especially the fact that there are no mirrors anywhere.....I absolutely loved this movie to the bone. I thought it had some creepy scenes with fantastic acting, especially from Rowlands, who does an exceptional job as Violet. John Hurt also does a great job as Ben. And we can't forget the dramatic switch from Romantic Comedies to Thriller/Suspense by Kate Hudson, who convincingly plays Caroline.*Spoiler* - The TwistFor those who do not know the twist and want to know it - well, here it is.Violet is actually Mama Cecile, and Luke is actually Papa Justify. Along time ago, Cecile and Justify swapped bodies with their masters children, and when the children were hung - the real Cecile and justify who were in the children's bodies didn't say a word. Then, when Violets character and Bens character come along in 62, Cecile and Justify switch again, causing the real Ben and violet to go into the children's bodies.The children's bodies die, and the real Ben and violets souls with it. Now, we have Caroline and Luke. Luke had already swapped places with Justify (who is now in Luke's body, as the real Luke is in Ben's body). And Cecile is trying to get into Caroline's body.Well...*end spoiler*This movie has it all.Some slight topless actionA small ghost storyTop 3 ActingBone-Chilling EndingOriginal plotA few scaresdisturbing sequencesAll wrapped up to create....******T*H*E***S*K*E*L*E*T*0*N***K*E*Y******very highly recommended!10/10 all the way"
    },
    {
      "rating": "9",
      "text": "-----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}[][][][][][][][][]()()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    }
  ],
  "recommendations": [
    "the_autopsy_of_jane_doe",
    "the_uninvited",
    "identity",
    "the_others",
    "annabelle_creation",
    "orphan",
    "lights_out",
    "the_forest",
    "the_boy",
    "ouija_origin_of_evil",
    "the_rental",
    "the_invisible_man",
    "the_mothman_prophecies",
    "the_woman_in_black",
    "marrowbone",
    "i_see_you",
    "mama",
    "a_cure_for_wellness",
    "1408",
    "the_lodge",
    "insidious_chapter_3",
    "the_woman_in_black_2_angel_of_death",
    "oculus",
    "the_call",
    "split"
  ]
}