{
  "id": 4549,
  "title": "The Best of Me",
  "starring": [
    "Michelle Monaghan",
    "James Marsden"
  ],
  "runtime": 117,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A pair of former high school sweethearts reunite after many years when they return to visit their small hometown.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8QBWh2Iwf1iUfsu2NfCue2V1hpV.jpg",
  "categories": {
    "plot": 4.785714285714286,
    "acting": 3.375,
    "ending": 6.25,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Another annoying love story, The Best of Me was unoriginal, predictable, and will be known as \"another love movie.\" Director Michael Hoffman does not give a legitimate interpretation of a realistic relationship, and the whole film reads \"drama\" all over it."
    },
    {
      "rating": "6",
      "text": "Overrated movie, with a predictable, but nice story. I don't think it was so bad, but it can't be called a good movie. I'm not sorry I watched it but I wouldn't do it again."
    },
    {
      "rating": "7",
      "text": "\"You never forget your first love.\"  Yes, \"The Best of Me\" could be considered cheesy romantic predictable fluff, but I enjoyed it.  Maybe I'm guilty of projecting my own \"first love\" memories as I watched this film, but I don't feel guilty about that one bit.  If you're a fan of romance, and you don't have a problem removing the \"critics\" hat for a trip down memory lane, and for those feelings you had... that still kind of have you, give \"The Best of Me\" a shot."
    },
    {
      "rating": "0",
      "text": "The Best Of Me takes the title of the worst romance movie of the century. And those words can sum up how tiring, rushed and how Un- Nicholas Sparks it is. It cut out major plot details from the book, gave us a horrible screenplay with both Marsden and Monaghan doing an atrocious job at their ultimate worst! This movie is a major disappointment to the fans of the book, including me (this was the only romance book that I read). This is a major exampke of book adaptations gone HORRIBLY WRONG. Its not even worth renting,  and you know what this movie deserves my 0."
    },
    {
      "rating": "4",
      "text": "In “The Best Of Me” it is 1992 and Amanda (Liana Liberato) and Dawson (Luke Bracey--looking too old) become high school sweethearts. She comes from a wealthy Louisiana family while he is described as ‘poor white trash’ by his father (Sean Bridgers), with her father, Jon Tenney, trying to buy Dawson off, not succeeding. For unknown reasons Dawson leaves the town and Liana.\r Twenty years later we meet Dawson (James Marsden) who is now an oil rig worker who just escaped death and Amanda (Michelle Monaghan) is married, has a son, lost a younger daughter to leukemia and whose husband (Sebastian Arcelus) is a drunkard.\r Based on a book by Nicholas Sparks, with the screenplay by J. Mills Goodloe and Will Fetters, we know true love won’t run smooth. Along the way we meet Dawson’s two redneck brothers played byHunter Burke and Rob Mello, Gerald McRaney, as Tuck, his mentor and the reason for Amanda and Dawson getting together again all these years later. The writers throw in all the cliché twists and turns that good romance novels/films have hopefully in paying off with the audience in tears. There are two surprise twists that unfortunately are telegraphed before they happened.\r The soundtrack tries to work on the heartstrings while Louisiana is photographed in all its hanging moss glory, skies with millions of stars, the actors looking their best and\r A HUGE mistake, which might not have been as obvious had the movie not constantly shifted between 1992 and 2012, is the fact that the younger Dawson, not only looking too old, has no resemblance to the older Dawson plus none to his father and two brothers. At least the young and older Amanda both have long curled hair so there is some resemblance. All the actors do what is required of them and there is chemistry between the younger Amanda and Dawson along with the older pair.\r “The Best Of Me” is not an unforgettable romance movie but gives the audience what it comes for, though logic has to be left at the door when walking in. Having to choose between this movie and “Fury” we made a good choice."
    },
    {
      "rating": "3",
      "text": "A standard love story, and it's something that you'd expect nowadays. Its bad, but had its moments. But really, it could have done better. However, its a poorly executed movie."
    },
    {
      "rating": "3",
      "text": "I hate Nicholas Sparks romantic book series into films, i also hate the the fact that screenwriters got inspired to the make Sparks' bestseller and into a dumb atrocity romantic cliche'd screenplay. Will Fetters ( writer of 'Remember Me' and The Lucky One) turns another Nicholas Sparks bestseller into another careless screenplay HEY DO ME FAVOR AND LEAVE SHOW BUSINESS. This movie is about is two high school sweet heart reunite in to their small hometown after tuck died. James Marsden plays Dawson Cole, Michelle Monaghan plays Amanda, two like able actors are forced into Nicholas Sparks' toxic bubble. Michael Hoffman directed and co-wrote the screenplay, clearly he has no legitimate interpretation of a realistic relationship (what are going to expect of course this movie has no legitimate interpretation of a realistic relationship cause it's a Nicholas Sparks movie). This movie was doing great in the beginning of the movie i was going to give this movie a B but the movie was getting worst in the middle and the end it  was predictable. The script was hilariously awful and the direction has gone wrong. Grade D-  I not enjoy 'The Longest Ride' coming this year"
    },
    {
      "rating": "3",
      "text": "Usually I do not agree with the critics’ score but they just about nailed this one! I should however mention I do not like romantic movies or “chick flicks”. The only reason I watched this was because my girlfriend, yet again, forced me to another Nicholas Sparks’ so-called “masterpiece”. Now, I never read the book so I am unable to compare the two, which is why I am just basing my opinion as a random-movie-watcher-fan and not a die-hard Nicholas Sparks’ fan.\r Anyways, The Best of Me was somewhat entertaining and I found myself to enjoy it more than other romantic movies, the acting was fair majority of the time, it had some matured elements, and it was not overly dramatic in my opinion, but they were some scenes that ruined it for me. The movie was predictable; I was able to determine several plot twists and upcoming scenes. I was disappointed several times between the plot, ending, and themes.\r In conclusion, I know this movie deserves a three when my girlfriend has mixed feelings over it...enough said. I personally would not recommend this movie to anyone I know. I guess for Nicholas Sparks’ fans, this movie may be worth watching in theaters, but for non-Nicholas Sparks’ fans (like me) do yourself a favor and wait to Redbox this one."
    },
    {
      "rating": "2",
      "text": "One of the most \"painful\" films I have ever sat through.  My girlfriend was recommended this movie (it had to be a 'set-up') and as stated in a few reviews prior, although I don't typically agree with Critic(s) Reviews, they absolutely hit the hammer on the nail with this (Critic Average Score: mid-20's).  The acting is brutal, the story line predictable and the acting melodramatic/over-the-top (and unrealistic).  The title (\"The Best of Me\") should be a dead giveaway, however, if you must, proceed with low expectations and wondering to yourself, \"Why? Why? Why? Did I waste two (2) solid hours on this?  Why?\"  I give the cast an \"A\" for effort (as they really, really, really tried to pull this off) but it fails miserably, as it Yo-Yo's you through 120 minutes of fluff.  \"The Best of Me\", No.  Could easily be re-branded/repackaged/resold as \"The Worst of Me\" and (being fair) set the viewer up for what's to come."
    },
    {
      "rating": "6",
      "text": "A failed high school romance and one more chance to fix it in the later years.Based on one of the Nicholas Sparks book of the same name. The story of a failed high school romance who meet again later in their lives. But the flashback comes right away after the initial segment to reveal theirs young romance and what made them part away. Between the present and the past, it keeps up the momentum and concludes the tale with a twist. Though you would know mile away what's coming.I did not like all the films based on the stories from the original author. But this one looked okay to me, not so good or too bad. All his films are romance theme, but in this film, that part was very weak. I did not expect that, particularly emotionless when compared to his other flicks. Still, the filmmaking was decent, with the good actors. But the casting was confusing at the beginning for having two sets of actors and then soon it cleared out all the doubts.Kind of supernatural theme, but not a fantasy. Feels a bit long, because the story developments were slow and most of the parts are not interesting. This is not a romance film I was looking for, but different where everything was dragged to the final twist, especially since the accident that happened at the opening. I did not watch it till now, because I did not feel I wanted to after watching its trailer. But I knew some day I would see it and that is now. I don't know what you thought of it, but for me it is an average film.6/10"
    },
    {
      "rating": "6",
      "text": "The movie itself is a quality film containing a different feel, ending and plot than many sappy, love films. However, the film will be unsatisfying to readers of the book because of the unnecessary plot changes."
    },
    {
      "rating": "3",
      "text": "very disgusting film and another insult to my taste and intelligence the film falters with dull chemistry from James Marsden and the overrated talentless of Liana Liberato, I can just say Nicholas Sparks has no writing talent except give finding a terrible way to make more outrageous chick flicks that outweigh even Twilight that I want to pressure Sparks into either staying away from Hollywood or have him slam a hammer repeatedly into his head until amnesia can re-correct his mind and do something better and new for once rather than making more stupid stories of a southern caucasian male and female meeting and falling in love in the rural country bound by dull drama and stupid suspense bullcrap! its an inferior love story"
    },
    {
      "rating": "10",
      "text": "If you are looking for a movie that makes your heart wrench with romance, this is it.This was easily one of the best romantic movies I have watched till date. If you are in the right mood, this movie will strike your core. It will shake you up, and drench you in every ounce of romance. I don't usually cry while watching movies, but this one was an exception. The plot is very well woven and I ended up appreciating slightest of the elements. And of course, complementing the great story is the phenomenonal acting.If you have recently watched an adaptation of Nicholas Sparks, like The Notebook, I would recommend holding off for a while and then watching this. In case you end up liking the movie, check out other movies based off Nicholas Sparks' novels."
    }
  ],
  "recommendations": [
    "the_vow",
    "paper_towns",
    "the_lucky_one",
    "the_lake_house",
    "if_i_stay",
    "the_notebook",
    "gone_girl",
    "the_fault_in_our_stars",
    "inferno",
    "we_bought_a_zoo",
    "hancock",
    "gone_baby_gone",
    "the_twilight_saga_eclipse",
    "vampire_academy",
    "the_last_song",
    "no_strings_attached",
    "terminator_genisys",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "harry_potter_and_the_goblet_of_fire",
    "a_walk_to_remember",
    "aquamarine",
    "inkheart",
    "the_craft_legacy",
    "the_adjustment_bureau",
    "stardust"
  ]
}