{
  "id": 1039,
  "title": "The Fox and the Hound",
  "starring": [
    "Mickey Rooney",
    "Kurt Russell"
  ],
  "runtime": 82,
  "genre": [
    "Adventure",
    "Animation",
    "Drama",
    "Family"
  ],
  "description": "When a feisty little fox named Tod is adopted into a farm family, he quickly becomes friends with a fun and adorable hound puppy named Copper. Life is full of hilarious adventures until Copper is expected to take on his role as a hunting dog -- and the object of his search is his best friend!",
  "releaseYear": "1981",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1382VHxqZDXu2t8i46zf4fP71JG.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 9.2,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Tan solo \"esa escena\" pega tan fuerte que te rompe el corazón en mil pedazos, es suficiente para merecer un 10, pero es muy difícil poder volver a ver una película como esta."
    },
    {
      "rating": "8",
      "text": "I really like this movie. The only real drawback I have with it is that despite the lovely incidental music, the opening credits were a bit too long. Another drawback is that the adult animals aren't quite as compelling as the child animals in terms of written quality. Despite these qualms, this still an immensely charming and beautifully animated film. The animation is beautiful, full of rich and colourful backgrounds, that aren't quite as good as Lion King and Bambi, though the bear is a triumph of character animation. The songs are heartfelt, especially \"Best of Friends\", but they aren't showstoppers like the ones in Beauty and the Beast. I had no problem with the voice talents. Mickey Rooney, Kurt Russell, Jeannette Nolan, Jack Albertson, (Willy Wonka and the Chocolate Factory)Pat Buttram and Paul Winchell bring their really cute characters to life in the equally charming story of ever-lasting friendship. I will say I found the ending when Copper saves Tod's life and vice versa very moving, as well as the scenes in the forest-Widow Tweed taking leave of Tod is a real tearjerker. It did actually show that friendship isn't always forever, which is true to some extent, but loyalty is. I have heard complaints about Boomer and his friends slowing the film down, but I honestly thought their antics were really funny, and actually added to the charm that the film already had. This was one of my favourites, and still moves me, but in conclusion to me now, it is a charming film that is vastly underrated. 8/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "The Fox and the Hound is one of those movies that I really love as a kid and a teenager I still loved it and Nathan had seen it as well. The scenes in it are funny with Dinky and Boomer and I when I was a kid Boomer sounds like Tigger and he even laughs like him. The chase scenes are a lot of fun and the bear scene, that whole is awesome. I used to watch it over and over when I was younger. It's creative and it's just got the climax. And much like The Jungle Book the opening credits, the opening credits is scary with no music. All they have here is forest noises that is until the female fox appears. This scares me when I was a kid. The scenes sometimes gets scary and sometimes gets quiet. The movie is really good much like Sleeping Beauty."
    },
    {
      "rating": "9",
      "text": "Very UnderratedWith a great cast, good writing, well executed romance between Tod and Vixey, and a very touching ending, The Fox And The Hound is a rather forgotten relic of the 80s."
    },
    {
      "rating": "8",
      "text": "Good movie its a very charming and has good voice acting and the plot is very nice it is underrated Disney movie that deserves credit because of it story voice acting and overall animation"
    }
  ],
  "recommendations": [
    "winnie_the_pooh_blood_and_honey",
    "bolt",
    "rio",
    "my_little_pony_equestria_girls_rainbow_rocks",
    "mary_poppins",
    "trolls",
    "ice_age",
    "over_the_moon",
    "tangled",
    "stuart_little_2",
    "the_croods",
    "rio_2",
    "madagascar",
    "rise_of_the_guardians",
    "brother_bear",
    "the_aristocats",
    "finding_nemo",
    "corpse_bride",
    "aladdin",
    "vivo",
    "the_secret_life_of_pets",
    "grease",
    "how_to_train_your_dragon",
    "strange_magic",
    "robots"
  ]
}