{
  "id": 2264,
  "title": "The Exorcism of Emily Rose",
  "starring": [
    "Laura Linney",
    "Tom Wilkinson"
  ],
  "runtime": 122,
  "genre": [
    "Crime",
    "Drama",
    "Horror",
    "Thriller"
  ],
  "description": "When a younger girl called Emily Rose dies, everyone puts blame on the exorcism which was performed on her by Father Moore prior to her death. The priest is arrested on suspicion of murder. The trial begins with lawyer Erin Bruner representing Moore, but it is not going to be easy, as no one wants to believe what Father Moore says is true.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qMN0HIP34f736kkQcfvTfmL9TP3.jpg",
  "categories": {
    "plot": 7.121212121212121,
    "acting": 7.428571428571429,
    "ending": 7.6,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This film was far better than the reviews made it out to be - I agree with the Chronicle's review \"a thinking man's horror film\". I'm a huge Laura Linney fan and thought she was fabulous. I was sucked in, and much more scared and shook up than I am by stupid grotesque slasher movies. This film avoids cheap exploitations to try to convey what actually happened, and I find that to be more unsettling. Go see it. It's interesting that the users' ratings are so much higher than the critics'."
    },
    {
      "rating": "4",
      "text": "As much as I had hoped this story would captivate me, I simply never found the film adequately engaging. Most of the plot is conveyed through flashbacks that are distressingly deviant in tone and purpose from the present day scenes set in a courtroom. If the audience is meant to question the forces of evil that may exist in the world or is asked to feel sympathy and compassion for Emily's fate, we are never given a real sense of why any of this really matters. I fully dismiss all supernatural explanations, but I am still intrigued by the notion that there are people who don't. Emily Rose ultimately fails to meaningfully connect to its audience because the screenplay is never quite sure what it wants to do. Is it fright film? Is it allegory? Is it a tale of mental illness? Is it a tale of demonic possession? Is it a courtroom battle between reason and faith? Maybe the film is all of these things. Unfortunately all of these ambiguous angles eventually steal each other's thunder. The film is too cluttered with ideas, but the performances are no less than adequate. In any case, Emily Rose is a mixed bag. Proceed with caution!"
    },
    {
      "rating": "7",
      "text": "The Exorcism of Emily Rose is inspired by a true story of possession. Emily Rose passes away during the exorcism the priest responsible for the exorcism is charged with multiple charges. In terms of being a court-room drama, its an effective film exploring both sides of the narrative convincingly. Jennifer Carpenter offers up an incredible performance as the doomed Emily Rose with fantastic performances from Laura Linney and Tom Wilkinson to boot. The movie offers some thrills, the scenes involving Emily and creepy mostly due to Carpenter's incredible performance."
    },
    {
      "rating": "10",
      "text": "This is (for now) the only film about an exorcism that I found very disturbing and original after The Exorcist. Based on a true story the film manages to keep tension in the spectator filled with moments of suspense, good actors and a very good director. To see."
    },
    {
      "rating": "0",
      "text": "Laura Linney said in the commentry \" movies are movies and they are entertaining and they should be entertaining.\" To me this is a way for her to say that it is ok to lie about a certain story as long as it is entertaining. There is no Emily Rose. There is, however, a story about Anneliesel Michel, which this horrible movie was based on, and believe me, is a far cry away from the truth."
    },
    {
      "rating": "3",
      "text": "Since this dog-days box office smash does double duty as a demonic possession thriller AND would-be hot-button courtroom drama, it allows cowriter/director Scott Derrickson the admittedly unique if dubious distinction of having done TWO of the worst directing jobs of 2005! His handling of the trial scenes, in which attorneys Laura Linney and Campbell Scott face off over whether or not catholic priest Tom Wilkinson was negligent in ordering the failed exorcism of (and denying medicine to) a sweet, earnest but devil-infested girl (Jennifer Carpenter) who was eventually killed by whoever or whatever took over her body, is as lazy and perfunctory as a garden-variety 1975 ABC-TV Movie of the Week at best...which still makes it preferable to his fraudulent and endless use of P. T. Barnum-like gimmicks in the allegedly scary flashback sequences. At least legendary schlockmeister/showman William Castle was ambitious enough in his day to jerry-rig entire movie theaters showing his stuff; whenever Derrickson wants to get an unearned rise out of his audience, he simply turns the sound up to 11, and running faucets, doorknobs and Fluffy the cat become objects of phony terror. (I mean, if the mere presence of loud, sudden noises is normally indicative that the minions of darkness are present, then shouldn't anyone living down the street from a bowling alley call Ghostbusters?) I've always found William Friedkin's film that started all this, The Exorcist, to be one of the most ridiculously overrated horror films of all time largely because it doesn't really immerse its audience in the situation beyond the blasphemous grossouts; whenever I've viewed it in theaters, many of the viewers only paid attention during the sensationalistic pea-soup-vomit/ use-a-crucifix-for-a-nonworshipful-purpose / kick-the-priest-in-a-place- that-ensures-he'll-never-be-a-father-should-he-change- his-mind-about-his-calling sequences; during the talky scenes, they often talk too. The Exorcism of Emily Rose has the exact opposite problem; the trial, as uninterestingly as it's filmed, at least brings up a few potentially provocative questions: how responsible is a man of God in a Christian country when his actions, sincerely believed to be God's will, go disastrously wrong? When do medicine and religion get to work hand and hand and when must they of necessity be at odds with one another? Can an agnostic believe in the possibility of good and evil supernatural forces and still be an agnostic? Does revealing the preence and methods of the Devil truly glorify God or put undue emphasis on His enemy? Sadly, every time Derrickson threatens to deal with one or more of these questions, he nervously reverts to the trite, third-rate boogedy-boogedy-boogedy once again. He also fails his wonderful actors, who are certainly capable of rich, multishaded characterizations, but you couldn't prove it here; smug, supercilious Scott, gruff-but-principled Wilkinson, and doubtful-but-compassionate Linney are all drawn with the thickest of crayons. Ultimately, it's Jennifer Carpenter in the title role who suffers the most, however; her endless possession scenes are technically skillful to be sure, but only once do we get a brief glimpse of what Emily was like before being taken over, and as a result Derrickson robs both Carpenter of the chance to prove that she's an actress of any more range than Linda Blair, and us of the opportunity to truly experience her tragedy since we don't get a real chance to know what she could've been. Actually Derrickson's approach reminded me not so much of The Exorcist as of another notorious 1970s box office hit, the el cheapo psuedodocumentary In Search of Noah's Ark, which packed movie houses (for a week, anyway) by promising to reveal where the ark was hidden, then completely copping out. The Exorcism of Emily Rose's $30 million opening weekend gross seems to indicate that Sony Pictures has the same ability to pack in the herds as Sunn Classic once did, but my question is, how did they also con so many distinguished Academy award nominees to also sign on for this exploitative drivel?"
    },
    {
      "rating": "0",
      "text": "Completely illogical and sappy. the dumbest defense of a client in all legal history."
    },
    {
      "rating": "2",
      "text": "It had a few scenes that made me jump, which is important in a horror movie, but the movie wasn't any good. I was very disappointed."
    },
    {
      "rating": "1",
      "text": "trash, avoid at all cost. The only reason this movie got a 1 was because it made me laugh a few times. The pathetic scenes of \"acting\" is just pathetic. Watch at your own risk."
    },
    {
      "rating": "1",
      "text": "This movie was terrible. In name of my Lord Jesus Christ, this movie should be banned. Everyone knows that demonic possession is an issue that causes a lot of pain and a lot of suffering to a lot of families in de United States only. I think that the director of this movie should be stoned to death... I'm just sayin'-"
    },
    {
      "rating": "2",
      "text": "Que esté supuestamente basada en hechos reales no la hace mejor película que las que sean enteramente de ficción, en lo personal me aburrió a más no poder, con más de la mitad de la película desarrollada en escenas de tribunales y lo supuestamente perturbador no tiene nada del otro mundo."
    },
    {
      "rating": "10",
      "text": "Excellent direction and acting all around. The must see movie of the year."
    },
    {
      "rating": "9",
      "text": "I went into this one very mixed. The trailers really peaked my interest but the critics labeled it as \"neither scary nor intellectually provocative\" and \"a devilishly dull scary movie\". But I'm sorry ... they were WRONG! The movie was great and it had plenty of genuine \"under your skin, white knuckle\" moments. And the court room drama made it more than just another horror flick. If you like a good movie w/genuine scares and a compelling storyline ... go see it. Well worth your money!"
    },
    {
      "rating": "4",
      "text": "I really wanted this movie to be scary. I wanted to return home at night and feel i had to turn on all the lights and keep my back to the wall. Alas, it was more of a comedy than a horror flick. Some great talent (Linney, Wilkinson, even Carpenter) did the best they could, but instead of letting us share in the potentially terrifying uncertainty supposed to develop in the mind of defense attorney Erin Bruner (Linney) we are left to little screams of \"boo!\" at predictable places along the way. The \"real life\" story gets lost in a fictitous world where dormitories and jails are incredibly poorly lit (how convenient) and where on character scared in the dark bothers to turn on a single light. Instead of considering the plausabilities, as Bruner does in her closing arguments, the team that put this yawn together resorts to parlor tricks. What could have been a psychological thriller primarily because of its tie to a true story ends up a boring laughable cliche of a movie."
    },
    {
      "rating": "7",
      "text": "This is an above average horror flick. A 7.5. Performances are great, the drama part of it balances the fright scenes, and are most welcome. Critics will always trash horror flicks. Funny enough, in the list displayed here, we have one critic writing about the \"topnotch performances\" and the other one stating that they are \"bad-atrocious\". Would they be suffering of the on-reel duality they can't seem to agree on? Worth seeing. As always, trust the users average score. It says much more than overpaid journalists who lost the joy of movie watching."
    },
    {
      "rating": "8",
      "text": "Good movie. Keeps you on your toes. Great pick. Not real scary but will give you goose bumps."
    },
    {
      "rating": "8",
      "text": "The screenplay is far beyond the type we usually see in a horror movie and that makes this movie one of the best in its genre. Acting is good, however it would have been better apart from Emily's character.. however the technical aspects of this film could have been better."
    },
    {
      "rating": "7",
      "text": "I thought it was aiight this movie. Not the best I've seen but it was interesting enough and worth seeing. Laura Linney puts up a great performance."
    },
    {
      "rating": "9",
      "text": "Isn't this a top notch film of this type? The storyline was intriguing and it kept you on the edge of your seat."
    },
    {
      "rating": "8",
      "text": "This movie was good... it was freaky...the whole trial thing gave off this vibe that all this really happend...which makes it scary when they showed what happend to her."
    },
    {
      "rating": "10",
      "text": "Instant classic horror."
    },
    {
      "rating": "7",
      "text": "There are gonna be a lot of very disappointed horror fanatics out there, because this film is more of a court room drama with a metaphysical twist instead of a satanic slasher film. When I watched it in in a fully packed theater, I saw quite a few people just get up and leave right in the middle of it. This is because the marketing of this film was very misleading. After all of the hype, I was under the impression that this was going to be a straight up horror movie, and with the word \"exorcism\" in the title, it just automatically conjures up images of that other \"exorcist\" film which was truly scary. Yet instead what you get is a very well acted court room drama, with just a dab of demonic possession. Yet despite the lack of creepy visceral blood and guts moments, this is still a pretty good film. This is because it is more of a thinking person's film, which invites the audience to come to their own conclusions about some of life's greatest mysteries. Does God exist? Is there a hereafter? Those who left the theater early tonight were uanable to recognize these inferences, or to impatient to care. I found this movie very thought provoking, but I am also feeling mislead and cheated becuase it didn't give me of what I realy wanted, which is a film that is truly horrific. Unfortunately, the best horror images can be seen in the trailer of this film, but I found the intellectual aspect worth the price of my ticket. It wasn't as good as \"The Ring\", but it was waaaaay better than \"I Know What You Did Last Summer\"."
    },
    {
      "rating": "10",
      "text": "This movie draws you in and doesnt let go. As far as the one reviewer who stated that \"why would the lawyer risk her career?...because she risked her career to represent the truth. At first, the lawery was trying to climb the career ladder at her firm, but by the end, she sincerely believes her client, she doesnt convert(she is an agnostic), but she does believe in the facts of the case, and that there is reasonable doubt to let her client off. She does have alot of pressure, and there is a inner conflict between her professional and personal, integrity, but that is just one of the engaging subplots that makes this movie so interesting. The path it takes to get her to make the profound decision to risk her career, as well as the story of Emily Rose, is horrifically, yet emotionally and intellectually, engaging. It goes from demonic possession to exorcism, and back and forth to the court room. If you like The Passion, Star Wars, Red Eye, Batman Begins, or the Fantastic Four, you will enjoy this movie. You know the same professional critics who give this movie low ratings have given so many good movies low ratings lately, that it amazes me that anyone sees them at all. The Passion and the Fantastic Four are classic examples of drastically low rated & reviewed movies, and yet they (and even a good amount of reviews for Batman Begins, Star wars, & War of the Worlds were unfairly very low) are some of the most viewed & enjoyable movies in the last 4 years. Since I am a member of the viewing public, and not the elitist \"professional \" reviewers club, I say check out this movie for yourself. I saw this movie late show Saturday night, and the theatre was somewhat rowdy/talkative in the first 1/2 hour, it was a fairly young crowd, but by the end of this movie you could hear a pin drop. This was a very well acted and produced movie and by the end you felt for the characters. You realized what an inner struggle they all went thru to arrive at the not so beautiful conclusion. Film did not have as much CGI as you would think. It was used where it was necessary, and not just for \"special effects.\" There were great uses of color, shadows, and lighting. Also, all the characters roles, even the minor ones, played an integral part to the story plot. No filler, all thriller...enjoy without any reservations."
    },
    {
      "rating": "10",
      "text": "This movie was excellent. I'm not Catholic, or anything like that. But I must say, it really altered my opinion towards religions. Excellent movie."
    },
    {
      "rating": "4",
      "text": "Not what I was hoping for. The plot is very predictable and this \"horror\" was not scary for one second. The film lacks originality nothing new that hasnt been seen in other exorcism movies. I'm giving it a \"4\" because it isnt 100% bad it does have it's moments."
    },
    {
      "rating": "7",
      "text": "In the wrong hands, a story like this can come across as just a lot of nonsense, an insult to anyone watching it. Such is not the case here, the result being an intelligent, well-balanced approach to a fascinating question. The acting by all concerned is top-notch, with special honors going to Laura Linney, one of the best actresses around."
    },
    {
      "rating": "8",
      "text": "Very impressed-but pepl mow wud less believe in demons and the other worlds coz this true story was turned into a movie.people now dont see the value of emily rose coz it is now a movie...coz this was turned in a movie now its believed to be sci fi and people will lose interest quickly. but the movie was exceptional and captured all emily's impacts with satan."
    },
    {
      "rating": "8",
      "text": "One of the scariest movies I've seen in a long time. Just the idea of it being based on a true story (however loosely) gives it that much more of an edge."
    },
    {
      "rating": "7",
      "text": "This movie was very scary but the story line could have been better."
    },
    {
      "rating": "8",
      "text": "I went to see this movie because I was bored but I really liked it! It was engrossing and interesting without ever failing in it's ability to be scary in it's own way. An unusually good September release."
    },
    {
      "rating": "4",
      "text": "If Erin Bruner(Laura Linney) wants to make senior partner at the firm, why would she take on a case that could potentially make her the laughingstock of her profession? At a cocktail party, you can imagine other lawyers whispering to each other, \"That's the lawyer who believes in demonic possessions.\" When Erin plays the tape recording of Emily's exorcism, we cut away from the courtroom and see the event being played out for ourselves. For some unknown reason, there are no reaction shots of the people in that courtroom. Emily's howls are a lot scarier as audio on a tape recorder than seeing Jennifer Carpenter make Runaway Bride eyes. We need to see the jury being convinced of Father Moore's innocence or guilt. \"The Exorcism of Emily Rose\" mainly doesn't work because we're so distanced from the titular character we're supposed to care about. This film wants to be \"Snow Falling on Cedars\" directed by Dario Argento."
    },
    {
      "rating": "4",
      "text": "This film should have been called THE TRIAL OF THE PRIEST. There is nothing scary about this film other than having to pay to see it."
    },
    {
      "rating": "7",
      "text": "It's by no means a masterpiece, but it's a decent courtroom drama. People who are prejudiced against belief in the supernatural will likely be biased against it, for the \"reasonable doubt\" sought for in the defense is essentially that demons may possibly exist."
    },
    {
      "rating": "8",
      "text": "Since I read the bad reviews here before watching the movie, I was surprise how good it turned out. If you're a mature viewer don't believe the negative comments here. I think most people went into this movie hoping it be some \"scary\" teen movie. The concept of mixing courtroom drama and horror film flow together nicely. The excellent job done by the cast provided that realism feel which most movies in this genre lacks. My only complaint was that the director didn't edit out the shot where Emily looks up, as seen on the movie trailer. That part looks completely cheesy."
    },
    {
      "rating": "8",
      "text": "ARE YOU KIDDING ME??? Whoever said that this movie was not scary, must be on something because this scared the living daylights out of me. Granted, it's not anything like the original Excorsist, but it still is quite frightening. Besides, if people were expecting to be really freaked out and were disapointed, then they should have read its genre:drama, horror, and suspense/thriller. HELLO? It doesnt say only horror. It's a mixture of different aspects and they all come together quite nicely. Maybe people should stop having expectations of movies before they watch them so that way they will enjoy the movie rather then being so judgmetal of it."
    },
    {
      "rating": "7",
      "text": "Magnifica pelicula que mezcla terro y thriller judicial. Muy recomendable."
    },
    {
      "rating": "9",
      "text": "1 amazing film its amazing the way they have based it on a true story its its great the amount of suspense on the film especially the music it did the film a great job. the music made the scary bits worse and it was that scary that every time scary music came on i hid my face."
    },
    {
      "rating": "10",
      "text": "The movie is really great its very scary because knowing that can happend in real life that just makes it alot scarier based on a true story and all it was very scary and a great movie i really enjoyed it."
    },
    {
      "rating": "10",
      "text": "I think this movie was an excellent portrayal of Anneliese Michel's true life incident. It touched me in many ways and made me really feel for the Girl who went through so much in her early years. I think a lot of people expected more horror and fright but I feel if you analyse this movie as a real life situation you will realise how scary it must have been for Anneliese Michel, i think that thought scares you enough..it certainly scares me and makes me feel for her. Im proud of her courage and determination to fight it till the end. May god shine on her always."
    },
    {
      "rating": "10",
      "text": "Think it is the best movie ever. It's scary because it could happen to any body. I feel bad for her. She died because of this and she gave it her best."
    },
    {
      "rating": "8",
      "text": "Not the best movie of the year, but definetly the most powerful."
    },
    {
      "rating": "7",
      "text": "I went to this movie expecting a horror movie with the jump-in-your-seat scares I both loved and loved to hate. Instead, I saw the Exorcist gone Law and Order. Sound ridiculous? It does, but this movie pulls it off. Great acting, great directing, great almost everything. I know it sounds perfect, but it's not. The part with Emily's beaded pencil case wiggling made me laugh really hard...and some of the other \"spooks\" caused my friends and I to attract glares with our laughter. But the movie itself is good."
    },
    {
      "rating": "10",
      "text": "I think that this movie was amazoing. It had court room drama and horror/ my friend john said it was going to be bad but i guess u have to be there to see it to judge it."
    },
    {
      "rating": "6",
      "text": "I love horror films. The Exorcism of Emily Rose was a good movie but I was expecting a horror film. I have to admit the graphics were great but I saw all the good parts in the previews basically. If scenes were reversed and the previews showed the court case that would have been a great twist. Did I menyion That I did not have to spend money on this film. If I did I would have to give it a 5."
    },
    {
      "rating": "7",
      "text": "The film was done in an interresting way. Rather than going through scenes chronologically, flashes of what happened to Emily Rose were sprinkled throughout the court trial. I enjoyed it very much, since I knew going in that it was basically a court movie w/ horror sprinkled in along the way. I was not disappointed. Great acting and a great story."
    },
    {
      "rating": "10",
      "text": "Great movie! definitely thought provoking...also some of these reviewers comments are ridiculously cynical and sarcastic... they are way off base...this is classic horror and courtroom drama... A great movie, as others are finding out."
    },
    {
      "rating": "0",
      "text": "This movie stinks on just about every way shape and form. slow stupid full of nonsense. dont waste your time."
    },
    {
      "rating": "0",
      "text": "Bad just bad. nothing good about this movie. just plain old boring and dumb."
    },
    {
      "rating": "9",
      "text": "so many horror films are the usaul formula . some whacko with some form of wepon goes on a rampage killing abunch of people with there being no focus but on blood and guts and all the scares seen coming a mile away. this movie is differnt . its a well told story with great acting and kept me on the edge of my seat on what was gona happen next. the scares dont come at you every second . instead its more of a pace that builds up slow and picks up then stops for awhile then picks back up again . its more of a drama horror film which is welcome to me. if you wana see a bunch of blood and guts and teens girls running around with there tops off .. see some thing els . if you wana see more of a intellegent horror film see this."
    },
    {
      "rating": "7",
      "text": "Before I saw this film. I know it's based on a true story. So I know these can not be any too dramatic scene in this film. And I believe my guess is right. This film don't want to give a clear answer about the exist of God and Demon. The film just show the whole thing through the film and let US decide these issues. At the end of this film I believe the director hope that we all could have our beliefs back and love the whole world (not only religious stuff I think). Also the scary scene in this film can be ambiguous. You can not actually tell what  happened the father and the actress is delusion or there is really ghost or demon in this world. After all, this is a great film."
    }
  ]
}