{
  "id": 1009,
  "title": "The Chronicles of Narnia: Prince Caspian",
  "starring": [
    "Georgie Henley",
    "Skandar Keynes"
  ],
  "runtime": 150,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "One year after their incredible adventures in the Lion, the Witch and the Wardrobe, Peter, Edmund, Lucy and Susan Pevensie return to Narnia to aid a young prince whose life has been threatened by the evil King Miraz. Now, with the help of a colorful cast of new characters, including Trufflehunter the badger and Nikabrik the dwarf, the Pevensie clan embarks on an incredible quest to ensure that Narnia is returned to its rightful heir.",
  "releaseYear": "2008",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qxz3WIyjZiSKUhaTIEJ3c1GcC9z.jpg",
  "categories": {
    "plot": 6.375,
    "acting": 6.666666666666667,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 5.285714285714286,
    "funny": 9.0,
    "action": 6.6
  },
  "reviews": [
    {
      "rating": "9",
      "text": "An absolutely wonderful movie. It expands upon the original classic book while remaining true to its spirit. The young actors have matured in their craft, and Peter Dinklage is delightful as the dwarf Trumpkin. The special effects are marvelous, too. Don't miss this one -- it's best seen on a big theatre screen to appreciate the spectacle!"
    },
    {
      "rating": "9",
      "text": "Better than the first. wish the christianity was not so watered down. gorgeous moviemaking. Kept all 3 kids up all the way through 2:20 am last night. worth the price of admission."
    },
    {
      "rating": "5",
      "text": "\"Prince Caspian\" is simply a decent movie. It's fun like \"The Chronicles of Narnia\", but as every sequel does, it lacks the originality and every other components compared to the prequel film."
    },
    {
      "rating": "9",
      "text": "While not as memorable as The Lion, The With, and The Wardrobe, it was still a good movie that introduced Prince Caspian, who, from what I've heard, is a very important character in future Narnia stories."
    },
    {
      "rating": "10",
      "text": "One of the best movies of the summer. It is far too underrated, don't believe me, go watch the movie especially the last battle and you will see what I mean. 100 times better then the first."
    },
    {
      "rating": "10",
      "text": "Its as good as the first movie with great development, great action scenes, and awesome special fx."
    },
    {
      "rating": "2",
      "text": "I have read all of the Chronicles of Narnia twice, and so I unfortunately have something to compare the movies to. While the novels weren't all that great I still thought thought they might be able to do great things with the films. I am going to be honest, I have not seen all of Prince Caspian (out of choice). I kept waiting and waiting to awake out of my tedious boredom. It was far from aesthetically pleasing. It seems almost as if they didn't want the story to be engaging, even though I am sure it could have been if done properly. There were no parts or aspects of the film that kept me watching it. I had to walk away by what would have been just after the halfway point. If you are thinking of watching this movie, DON'T."
    },
    {
      "rating": "3",
      "text": "This is the film that made me go to sleep in the cinema. it is a **** load of **** the best thing about it is mr pegg who is amazing. the rest is rubbish apart from aslan because i like liam and lions. It was the best worst film of my life."
    },
    {
      "rating": "7",
      "text": "Do I review this on how close they kept to the book or just the movie itself? The changes relating to the battles were more significant than the first movie I think and if I hadn't read the books perhaps it would have been okay. The question is did the movie need it and I have to say no as it was rather long and dragged a bit in places. Perhaps the feeling was that there wasn't enough tension between the characters to carry the movie? I think they added a bit too much. I guess the thing is that I would hate to see appreciation of the book to be reduced for young readers by so many changes to the story. Sticking to the book by Including more about the trees would have tied them into the story a little better than seeming like an add-on or stealing from LOTR and there was room for some more Aslan which was nicely done in the book and poorly organized in the movie. Okay but not great with respect to making good use of the source, and not bad with respect to the movie and effects."
    },
    {
      "rating": "0",
      "text": "This is the worst movie I have ever seen. I walked out of \"Weekend at Bernie's 2\", so maybe that was a little worse. But how can anyone give this any praise. Everything about it sucked. Horrible pacing, the editing looked like it was done by an 12 year old on i-moive, the camera work was tedious and unoriginal, the special fx look like leftovers from the first Narnia, the acting was beyond bad - there were accents coming and going every other minute... and the list goes on."
    },
    {
      "rating": "9",
      "text": "Way underrated. More exciting and funny than the first."
    },
    {
      "rating": "6",
      "text": "As with most sequels this film suffers from a lack of originality that made the first intriguing. Sure we get to see familiar characters, but all the curiosity is gone as we know the formula already. 4 kid heroes, a few fight sequences, a few dwarfs and minotaurs, the end. No new real unique story or mystery here... no new character development, which a series like Harry Potter manages to recreate with each of its movies. I think this 2nd film was most suffering from a good villain. There really wasn't one... just a guy who made me constantly picture Cortez of Spain conquering the Aztecs every time I saw him on screen [maybe I got kind of bored]. The special effects are fine... and there was really no faults in the story... just nothing exciting [and the movie was too long]. A solid 6."
    },
    {
      "rating": "7",
      "text": "i was disappointed by this sequel due to the fact that i loved the first one and was highly anticipating the release of prince caspian. it felt dragged out and i felt confused and bored a lot of times. i liked the story but i didnt like the prince caspian actor and peters acting skills were hard to watch. it was ok, but could have been a lot better. i have high hopes for the next one, if there is one?"
    },
    {
      "rating": "5",
      "text": "Better than the first but still not great.  It was better because the action was better and there was more story to follow.  Also, What was up with that bear?  Seemed really dumb and out of place."
    },
    {
      "rating": "0",
      "text": "I hate the lion, human form lamb, Beaver, Prince, story, fight scenes.\r Why does Holleywood spend so much money on producing film. I don't like all top 56 most expensive movies.\rWhy don't they save money, spend no more than 63 million dollars on producing film.These expensive movie doesn't look expensive also. There are so many great films that did not cost so much to produce."
    },
    {
      "rating": "4",
      "text": "Okay overall, but that stupid cheesy song they play in the end scene ruins it all."
    },
    {
      "rating": "3",
      "text": "For a movie that doesn't really have much story to tell, it seems painfully long. Basically, The heir to the throne is overthrown, he finds help, then comes the 4 kids and Aslan, then the good guys win."
    },
    {
      "rating": "9",
      "text": "Adamson does a great job again with keeping the essence of the story true to the books. First rate effects and well acted!"
    },
    {
      "rating": "5",
      "text": "Eddie Izzard's Reepicheep steals the show, although Anna Popplewell's pouty lips do rate mention. Otherwise this is awkwardly, clumsily filmed. To be fair the novel doesn't lend itself easily to filming and Adamson hasn't come up with any kind of solution."
    },
    {
      "rating": "10",
      "text": "A superior movie, both in terms of its predecessor and its source material. Two thumbs up, all around."
    },
    {
      "rating": "8",
      "text": "This movie is definitely worth watching if you saw the first, cuz it will give you hope in such movies again. Lets start with the good points. Dialogue and acting is BRILLIANT in most places, with only a few little twinges that you forget several mintues later. AMAZING fight scenes, especially during the duels. And finally, a story that had twists and turns that genuinely surprised me! Although there are several things that are less then favorable. Half of the movie is dominated by walking scenes, Aslan's involvement makes barely any sense, and some of the losse ends leeft at the end of the movie not only pretty much seal a sequel, but also leave some questions that the viewer deserved the answers to...Unanswered. Overall a step inm the right direction, and an absolutely enjoyable movie. If they clear up a few mistakes and fill some of those tedious forest scenes with some dialogue or swordfights, this movie would make a top ten list easily."
    },
    {
      "rating": "9",
      "text": "Visually rich and entertaining"
    },
    {
      "rating": "8",
      "text": "I thought it was a great follow up to the first with good action from start to finish."
    },
    {
      "rating": "6",
      "text": "The Chronicles of Borednia."
    },
    {
      "rating": "10",
      "text": "Incredible. Perfectly paced action movie that stays faithful to the book's spirit. A beautiful family film that is sure to become a classic. Great music, effects, acting and directing. In line with movies like Star Wars and Lord of the Rings and ahead of Harry Potter i hope this series presses on and prospers."
    },
    {
      "rating": "6",
      "text": "Not a bad movie, per say. Just not as good as the 1st one. Still a good movie to entertain my 5 year old daughter and keep her father entertained as well. Seemed like it took forever for the movie to get anywhere (too much time explaining what had happened to the Pevensie children). And what's the deal with all the Telemarine's being Spanish? After awhile, everyone in the theater was sounding like a background actor in \"Zorro\". I hope the next one is a little better done."
    },
    {
      "rating": "3",
      "text": "Horrible, just horrible. It rips off Lord of the Rings and does it horribly."
    },
    {
      "rating": "4",
      "text": "First off I enjoyed the first Narnia movie quite a bit. I was hoping that the second movie would be a repeat performance. Unfortunately it didn't come close in enjoyment for me and my wife. When she looks at me during the movie I know its getting tedious. Needless to say she looked my way alot. I would say this movie was slow and plodding. The bridge building scene was straight out of Ceasar marching against the Germanic tribes way back when. And the battle scene was a dead theft from Lord of the Rings, with walking tress fighting the bad guys. Sorry, this one was a stinker, with little to offer."
    },
    {
      "rating": "5",
      "text": "Great visuals and a decent set of action scenes. My main upset is that the \"The Lon, WItch and the Wardrobe\" followed the book in great detail. This took a drastic cuts and side bars. Susan and Peter had crossed personalities that did not follow the previous release nor the book."
    },
    {
      "rating": "4",
      "text": "Convoluted. Spends no time explaining why anything is happening, assumes the audience has read the book and knows why things are happening (Or in some cases, what should have been happening.)"
    },
    {
      "rating": "4",
      "text": "Maybe it was too long a stretch between this film and the first one? I found it hard to follow and understand.The dialoge was muddled half the time as well. It seemed like the special effects were either poorly done, or just not as polished as the first film. In short , I was never able to get into this Narnia story as I was the first time. I came prepared for something the film never delivered."
    },
    {
      "rating": "3",
      "text": "I had high hopes for this after the Lion, the witch and the wardrobe, but it was all I could do not to walk out. Did they even read the book before making this? The first 5 chapters of the book where left out, the attack on the castle completely made up, the dynamic between Peter and Caspain totally changed, and what on earth was the relationship between Susan and Caspian about? She's supposed to be about 12 - 14, as she's only 16 by the last book! Yet another totally horrible book to movie conversion."
    },
    {
      "rating": "3",
      "text": "A movie that felt much longer than it actually was, delivered no real interest for its underdeveloped characters, nor its plot, and had me leaving the movie before it ever finally ended."
    },
    {
      "rating": "6",
      "text": "Visually it is very impressive, the special effects are awesome, the cinematography exquisite, good costumes and art direction. But it is curiously nit very involving and it did outstay it's welcome at 149 minutes."
    },
    {
      "rating": "9",
      "text": "This movie was a great popcorn munching blockbuster. The effects were good, the conflicts seemed realistic. The best of the blockbuster movies to have come out this year."
    },
    {
      "rating": "10",
      "text": "Very good! Followed story line very well."
    },
    {
      "rating": "10",
      "text": "I just got back from the theater after watching and it was SPECTACULAR!! I don't understand how anybody can not like this if they liked the first one! One thing is for sure: I will soon own the game and the DVD when they come out."
    },
    {
      "rating": "9",
      "text": "\"Prince Caspian,\" like its predecessor, delivers sweeping, swashbuckling action in a handsome production, albeit one that leaves viewers feeling quite pummeled. Full to bursting with duels, battles, showdowns and other literal and figurative forms of ritualized aggression, this chapter of the \"Narnia\" series sometimes seems like an endless Battle Royale."
    },
    {
      "rating": "8",
      "text": "If the Lord of the Rings series was a 10, and Harry Potter was a 9, to me The Lion, the Witch, and the Wardrobe came in somewhere around a 5 or 6... Prince Caspian upped the ante quite a bit for the series though. The first movie lacked the emotional pull that LotR had, and Prince Caspian still isn't all the way there, but it was a much better effort in my opinion. A solid 8 on that scale and on its way up. It did a much better job of pulling you emotionally in to the world of Narnia."
    },
    {
      "rating": "3",
      "text": "Didn't enjoy the first one of the movie series, and this one delves even further into the thinly veiled Christian theology that the series is known for. While I admire the attempt at originality, replayed via directing just as C.S. Lewis tried while writing the stories, this will never hold a candle to similar fantasies like Lord of the Rings. The label \"dark\" is applied relative to the earlier movie, this movie will provide nothing intellectually engaging or \"dark\" compared even to a mediocre drama and tends to drudge along at a slow pace, even during the barely interesting battle scenes. Keep your expectations low and you wont be disappointed in the theater."
    },
    {
      "rating": "10",
      "text": "This movie kept me on the edge of my seat during the entire movie!"
    },
    {
      "rating": "2",
      "text": "Horrible Movie. Too long, mundane, and monotonous. Not worth it."
    },
    {
      "rating": "2",
      "text": "Terrible story, nothing is explained well, everything is solved too easily and has bad jokes. Also very boring for children and too violent for kids as well. Only gets a 2 for some nice CG effects. P.S. Watch for the random retard bear screaming out \"For Narnia!\" That made me laugh."
    },
    {
      "rating": "9",
      "text": "I've seen the movie twice this weekend. As a long time Narnian reader (practically know the story by heart) I was initially disappointed that the timeline was quite jumbled and a LOT was added. That said, I can see where the things that were added fit the spirit of the book and made it more appealing cinema. There was a lot of pleasant dialog in the book that wouldn't translate well to the screen. To those who say they \"stole\" from LotR, please! Don't you realize that C.S. Lewis and J.R.R. Tolkein were friends who hung around at the local pub together? They were probably writing these books at the same time. Read the Narnia books! \"They\" (the movie makers) did NOT \"rip off the trees and the water\" and it was done quite well, actually. Can't wait for the extended version on DVD."
    },
    {
      "rating": "9",
      "text": "Much better than the first in the series -- very engrossing!"
    },
    {
      "rating": "8",
      "text": "A fun movie, great for kids and parents alike."
    },
    {
      "rating": "10",
      "text": "i loved it. the cast could very well act, the scenery was gorgeous and the cg animation was brilliant. very exciting indeed. wasn't too fond of the ending, but it is based on the book. but highly recommended!"
    },
    {
      "rating": "6",
      "text": "I never saw the 1st one so a couple things in the movie didn't make sense. *Spoilers* *You Have Been Warned* The entire journey that the kids go through is boiled down to a random horse ride out into the woods to find a lion who is basically as powerful as god him self... For that reason alone this movie gets low points. Thanks for wasting my time.. btw though the graphics are super good and the action is decent so its not a total waste of time :P"
    },
    {
      "rating": "5",
      "text": "I thought the movie was okay. it was very korny, but kid movies are suppossed to be korny. the thing that makes me hate the movie is the insane amount of obvious religious allusions. i dont remember the books that well since I read them when Ii was in fourth grade. they should have seriously downplayed the religious stuff. lotr was also religious and i didnt feel like a bible was being hurtled at my face while watching that movie. lol the trees walked in this movie."
    },
    {
      "rating": "9",
      "text": "As good or better than the first Narnia movie. Well written, acted and good graphics."
    }
  ]
}