{
  "id": 3071,
  "title": "The Grudge 2",
  "starring": [
    "Amber Tamblyn",
    "Sarah Michelle Gellar"
  ],
  "runtime": 102,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A young woman encounters a malevolent supernatural force while searching for her missing sister in Tokyo, a mean high school prank goes horribly wrong, and strange things begin happening in a Chicago apartment building.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gzr7ywaU9mUfASN57FYsKRFb4l0.jpg",
  "categories": {
    "plot": 4.321428571428571,
    "acting": 3.6153846153846154,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 5.25,
    "funny": 1.8333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Awesome, I loved the movie the Grudge. It is really scary and there is a purpose to it. I jumped when I was watching it. But after that I couldn't keep my eyes off of it. The second movie was great too. I love horror movies."
    },
    {
      "rating": "3",
      "text": "I agree with \"A Movie Critic\" that The Grudge 2 is best understood in context with its American and Japanese predecessors, although in my opinion it's simply not a very good film. The Grudge 2 is indeed more similar to the original Ju-On than to The Grudge 1 in that it constantly shifts between multiple storylines and multiple characters, which leads to more spectacular fright scenes. The nature of J-horror is that it doesn't matter if one is an \"innocent\" or \"evil\" character -- anyone can end up dead. It is the utter randomness of awful deaths that make J-horror so compelling. That said, I actually liked Grudge 1 better than Ju-On because its (more) linear plotline builds both tension and history with each scene. Ju-On, to me, seemed like a pastiche of fright scenes, which may be the point, but it still doesn't do it for me. Grudge 2 is a return to Ju-On's jumpy storylines and inconsequential characters. The acting and the dialogue is worse than ever before. There is some promise of Kyako's back-story, similar to the Ring, but it fails to deliver any greater understanding because it's ridiculous and inconsequential. Basically, nothing really matters in this movie except jumping out of your seat when ghosts appear out of the shadows. That in itself has some value ... but not much."
    },
    {
      "rating": "2",
      "text": "Awful. And Sarah Michelle Gellar's appearance has contractual obligation written all over it."
    },
    {
      "rating": "10",
      "text": "Its is scary, and one of my favorite movies."
    },
    {
      "rating": "2",
      "text": "Por lejos peor que la primera, lenta, tediosa y aburrida con un conjunto horrible de personajes que te valen madres."
    },
    {
      "rating": "9",
      "text": "I thought I'd jump in here because these professional reviews pain me to read. What use does anyone have for such a technical and mechanical analysis of a film that is supposed to be fun and enjoyable. They would do better to write about an emotional reaction they had, should it even be a negative one. That said, my emotional reaction is why I love this movie. I'm sure this will upset all the people who hated this film for it's technical flaws, but I love \"The Grudge 2\" for the experience it creates...I think the girl \"Kyako\" is genius, and she scares me, and makes me afraid to turn off the lights at night. I'm 28 years old. Enough said. This film is powerful, fun, and creepy enough to be worth my 9 bucks. Reviewers, I have realized, hate horror movies. Furthermore, they are more concerned with showing how brilliantly they can write than actually giving you something useful to ponder over. Ultimately, if you liked the first Grudge film, see this one...if you didn't, don't. That's my best advice to you."
    },
    {
      "rating": "2",
      "text": "This is a terrible film. It really went nowhere. They needed to get someone to write a plot for it. There is no point having good make-up and special effects if there is no storyline."
    },
    {
      "rating": "4",
      "text": "Typical J-horror scares abound, the latest entry into \"The Grudge\" franchise brings nothing new to the table, except an even more terrible performance by Ms. Gellar."
    },
    {
      "rating": "10",
      "text": "A great sequel, not better than the first, but still eerie and scary!"
    },
    {
      "rating": "2",
      "text": "How horribly predictable, not scary especially if you've seen any other grudge film."
    },
    {
      "rating": "8",
      "text": "Pretty good, but too many plots and no story is resolved."
    },
    {
      "rating": "2",
      "text": "Trying to peel a hard-boiled egg without breaking the shell is scarier."
    },
    {
      "rating": "1",
      "text": "Let me start off buy saying that I am a big fan of Japanese horror. The only horror in this American remake is the money I paid to see this horrible film. There is almost no coherent plot. There is no character development. Why should we care that these people are meeting their demise. I had to laugh when the main character goes out into a small town to find out the truth...only to learn nothing new. What a waste of time. I went with a large group of friends and we all came to the same conclusion. This movie is horrible. Two more points. Almost everyone in the audience yelled \"this movie sucked\" when it was over. I don't know the last time I saw that reaction from a movie audience PS...The trailer also reveals a major plot point...what were they thinking when they made the trailer... Go rent a much better horror movie \"The Eye\"... Tom Cruise is producing the American remake...please see the amazing Japanese version before his remake arrives at a town near you. The Grudge is a correct title...we should all have a Grudge with the studio that made this terrible movie called \"The Grudge 2\""
    },
    {
      "rating": "7",
      "text": "The Ju On films were never about storyline, they were more about scaring the audience as much as possible. They are done in episodes, simply going from one character to another to watch their bizarre, scary deaths one after another. I was disappointed with The Grudge, because not only did it lack the suspense and horror of the Japanese original, but they tried too hard to add a plot and romance and it just ended up bogging the movie down. The Grudge 2 is more along the lines of the Japanese versions. There's less plot, and more scares. The scares themselves are also much sharper and less \"PG-13\" (In fact, they really stretch that rating here) than its predecessor. Some scenes are completely scary and really suspenseful. Yet there are lots of jumps as well. If you like the Ju On films better than you liked 2004's Grudge remake, you'll really like The Grudge 2. Fans of the first Grudge may not be as into The Grudge 2, though. Compared to the first Grudge, this one is definitely less of a \"movie.\" Somewhat worse acting, less star power, worse dialogue, less plot and less structure makes it seem more like a \"right to DVD sequel\" at times than something that was made with the same care as its predecessor. But that wasn't the case. The case was simply that they wanted to return this series to its roots of being, primarily, a fright fest. That said, though, due to the need to keep the PG-13 rating, (therefore keeping the ghosts mostly off-screen, unlike the Japanese versions, where these corpses are crawling all over the place,) it's still not as scary or suspenseful as the Japanese versions and unfortunately, the movie's plot twist at the end WILL confuse people who are not aware that the 3 stories each take place years apart from each other. (Something the movie never makes clear.) The Grudge 2 also lacks a huge climactic scene like The Grudge's stair crawl. Still, though, this was a scary movie and a step in the right direction for these remakes, if they choose to continue them. If they do, though, (and I can't stress this enough) they should really go for the R-rating because building suspense by having these ghosts fully onscreen (especially Kayoko, in all her blood-covered glory,) is more effective than simply having these ghosts just jump out and scare you."
    },
    {
      "rating": "1",
      "text": "Here's a universal truth for horror buffs...when it's adapted from an Asian original...SKIP IT. The original is infinitely better. ALWAYS."
    },
    {
      "rating": "0",
      "text": "I'm a huge fan of Ju-On, which got under my skin and into my head. Traditionally, however, American horror films are about blood, and jumping out of the shadows and making the audience recoil in its seats. The Grudge 2 had none of this. [***SPOILERS***] I thought watching a girl regurgitate milk into its container to be one of the scariest moments in the film I loved the original Ju-On, which showed character development, and developed sympathy towards Kayako and Toshio, instead of showing them as mindless psychopaths. The movie The Grudge 2 was utterly stupid, and trying to double the fear by having more leap-outs, and two \"grudges: appear near the end of the film. The only people who were freaked out by the movie were the 40 or so pre-teen yuppies who were giggling and \"eek!\"-ing the whole time. They were more engaging than the film I was watching. Save it for video, or not at all. If you want to be scared, watch Ju-On and its sequel."
    },
    {
      "rating": "0",
      "text": "If you haven't already seen this film, do yourself a favor and DON'T. It's as flat as a room temperature Coke and about as scary as an old shoe. It was unwittingly funny because the scares were so ridiculous, the plot is M.I.A., and features some of the worst performances anyone could ever hope of squeezing out of any actor (c'mon Sarah! You are SO much better than this dog feces). THE GRUDGE 2 made the first movie look like CASABLANCA. At one point a kid looks almost directly into the camera and says: \"There's something bad here.\" (Get Out! Ya think?) No truer words were ever spoken."
    },
    {
      "rating": "0",
      "text": "This might be the worst movie I have ever seen! Wow, what a waste of time. Very disjointed. Just horrible!"
    },
    {
      "rating": "2",
      "text": "Much worse than the prequel, less scary and the plot mixes too many stories."
    },
    {
      "rating": "0",
      "text": "Horrible. My friend and I walked out after 40 minutes or so. Acting was awful up to that point, and I found myself laughing instead of being scared."
    },
    {
      "rating": "8",
      "text": "The Grudge 2 is like the devil's haiku... the flowing hair, the flashing shadow images, the screams, the groans...an exceptional horror film and sequel no matter how you look at it, also includes superior acting and a more diverse and captivating plot line."
    },
    {
      "rating": "3",
      "text": "Some parts were scary but over all the movie made me laugh and thats pretty bad on the count of it was suppose to be scary if you want to see a comedy its great. But if you want ot see a scary movie it sucks."
    },
    {
      "rating": "5",
      "text": "As far as the J-horror phenomenon goes, The Grudge (Ju-On) is probably the best series to be \"Americanized\" (which may be why Sam Raimi chose this one to adapt.) The sequel gives director Shimizu a chance to abridge his original 4 movie series into two films and except for a few scenes and an ending that's fright, but not right - it's pretty consistent with the original. These movies will only be as memorable as long as the phenomenon of J-horror survives, and that may have pretty well run it's course."
    },
    {
      "rating": "10",
      "text": "WOW! Way better than the first. This also made more sense and tied the story together."
    },
    {
      "rating": "8",
      "text": "This movie really suprised me, especially considering the horrible reviews by \"professional\" movie critics. It all boils down to whether you liked the first Grudge. I loved it, and this one actually creates more tension and unease then the first. There are some very shocking visuals that will stay with you for a while."
    },
    {
      "rating": "7",
      "text": "I Love The Grudge..... But The Grudge 2 Didnt Seem To Spark Me As Much...My Score Went Down Alot Because Sarah Michelle Gellar Dies  In The Movie.... I Loved Karen Davis!!!"
    },
    {
      "rating": "4",
      "text": "Just a cheap copy of what this is all based on, nothing new, no new secrets revealed, they didn't even took the work to imagine or invent some new secrets and revealed mysteries about anything."
    },
    {
      "rating": "5",
      "text": "If you generally like your horror films to contain a semblance of normality then I would suggest to find another movie. Honestly, the plot is somewhat of a mess and you will often be left scratching your head in utter confusion. I will admit The Grudge 2 has some frightful \"gotcha\" moments but even the scare factor isn't as creepy when compared to the original 2004 film. A good flick to rent on a dark and stormy night but sadly nothing else."
    },
    {
      "rating": "7",
      "text": "creepier and more vicious than it's sleepwalking predecessor, i actually found myself enjoying this, whereas the first felt like i was completely detached from the experience."
    },
    {
      "rating": "2",
      "text": "Terrible. When I was watching the movie, I literally was counting when the jump-scare was going to pop out. Three... two... one... indeed,    it did."
    },
    {
      "rating": "7",
      "text": "there is a lot more happening in this film than the first, most of these new happenings are interesting, and some quite creepy, something the first grudge only achieved when it actually got off it's ass and tried, i will admit, it is a rather hard act to follow, but following it isn't entirely necessary for the better aspects to make it through to you - samarathenymph xoxo"
    },
    {
      "rating": "6",
      "text": "well, at least it's one hell of an improvement over the first film, though it is, to put it nicely, incoherent as all f**k, but it doesn't take too much away from the scares, which are more effective by far."
    },
    {
      "rating": "10",
      "text": "almost anything that isn't the first film is fine by me, not only does this top the first ones mediocre ambition, but it does so well, it actually could have been a standalone film."
    },
    {
      "rating": "7",
      "text": "So much scarier and more entertaining than the first one. Takashi Shimizu is one of my favorite horror directors. After The Grudge 3, I really hope there will be a Grudge 4."
    },
    {
      "rating": "4",
      "text": "This film is badly made, is more funny than scary and really is a weakest entry in the series. Overall I'd say it's probably not worth a watch."
    },
    {
      "rating": "9",
      "text": "This film is extremely creepy and scary. It is also extremely dark and horrifying. This is an extremely good horror movie that you will enjoy. Like most horror films, it has a bad ending. I really wish that in the future, most horror movies will have better/good endings."
    },
    {
      "rating": "3",
      "text": "This was boring as hell, and the scares were so god damn repetitive. How many times does the movie feel it needs to show Kayako's hands coming from behind someone's head before killing them? We already saw that in the first one, and it was a lot more effective there. It had a good score and some great eye candy, and there were a couple times I did jump. However, this was just an unnecessary and tedious sequel made for the sole purpose of showing more ways that Kayako can kill people."
    },
    {
      "rating": "4",
      "text": "This movie is the sequel to \"The Grudge\", an American remake of a Japanese horror film based on the story of a powerful haunt. The first movie is good enough to be worth it but this sequel does not have the same strength and quality. The script is an unlikely story of haunting involving teenagers and the younger sister of the first film protagonist while the curse, almost unbelievably, moves to the United States. The story simply never has the credibility or ability to get us involved, even though there are several scary moments that remind us of the strength of the first movie. Everything always sounds false and forced. Another bad thing is the poor quality of the cast, which doesn't do more than it really has to do. The direction of Takashi Shimizu is relatively acceptable but, from the moment the script was written and developed in a bad and unrealistic way, the film is irreparably damaged. It's a good movie to see if we're able to ignore the lack of logic and coherence of the story and focus on what we're watching, but its far from the first film and probably miles away from the original Japanese."
    },
    {
      "rating": "2",
      "text": "Amber Tamblyn is the lone bright spot in another forgettable entry to this franchise. The two main plot threads followed throughout the length of the film are almost entirely disconnected. The film is marred by nearly-universal poor acting and a story that starts at point A and ends at point A. The ever-creepy ghost of Kayako has a high ceiling, but this film again wastes the spirit's potential."
    },
    {
      "rating": "6",
      "text": "Great movie. It kind of sucked that Sarah Michelle Gellar had to die right away. They could have at least had her in the movie more. That alone bumped my rating down to a 6."
    },
    {
      "rating": "6",
      "text": "The murdered wife from the first one was only bad because the mother put evil spirits into her as a child and she spends this film killing more (mostly American) people."
    },
    {
      "rating": "10",
      "text": "Me gusta. una de mis pelis de terror favoritas. De vez en cuando la veo y sigue traumándome en algunas partes."
    }
  ]
}