{
  "id": 3776,
  "title": "The Miseducation of Cameron Post",
  "starring": [
    "Chloë Grace Moretz",
    "John Gallagher Jr."
  ],
  "runtime": 92,
  "genre": [
    "Drama"
  ],
  "description": "Pennsylvania, 1993. After getting caught with another girl, teenager Cameron Post is sent to a conversion therapy center run by the strict Dr. Lydia Marsh and her brother, Reverend Rick, whose treatment consists in repenting for feeling “same sex attraction.” Cameron befriends fellow sinners Jane and Adam, thus creating a new family to deal with the surrounding intolerance.",
  "releaseYear": "2018",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xFLJDW3na8AADFzQJT6bM1VU5zs.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 5.846153846153846,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "With 4 States, 41 counties and municipalities plus the District of Columbia banning gay conversion therapy and others having it on their agenda it was a perfect time for a film dealing with just that subject but “The Miseducation of Cameron Post” isn’t that film to get an audience.It deals with Cameron, a teenager, caught in the back of an automobile with another girl, Coley, their panties down, and going at ‘it’ at the prom where they had been taken by their boyfriends. Nothing happens to Coley but the consequences for Cameron are that she is sent to God’s Promise camp, one of the many known ‘pray away the gay’ around the States.The topic of whether you are born Gay or learn to be ‘that way’ is discussed very briefly but since this is a ‘Christian’ place God and the Devil are part of a lot of the conversations by the adults. At 90 minutes ‘Miseducation’ moves very slowly with very little drama, except, of course, how we can have a Christian film about gays without one committing suicide! (No it’s not a spoiler.)A big problem with the movie is the stereotyping of gay people by the screenwriters Desiree Akhavan, who also directed, and Cecillia Frugiuele. One lost their parents in a crash years before and is being raised by an aunt and uncle while another, who lost a leg in an accident, was born in commune and is Black while a third is a Native American Indian who was born into a tribe that recognizes a third gender but their father has become a politician and converted to Christianity. There is a boy who is too feminine for his father and a girl who is the boy her father never had, raising her to be a sports fan, as I said, all the stereotypes, no one having a ‘normal’ background so being born gay is really a non-issue.The acting by the 12-14 kids can’t be faulted with Chloe Grace Moretz as Cameron, Sasha Lane who goes by the name of ‘Jane Fonda’, Forrest Goodluck as Adam, Emily Skeggs as Erin and Owen Campbell as Mark, the standouts with Coley acted by Quinn Shephard.Among the adults are John Gallagher Jr. as Reverend Rick, a man ‘saved and finding God’ in a gay bar whose sister Dr. Lydia Marsh, a Christian psychologist, played by Jennifer Ehle, who runs God’s Promise Camp.Possibly I expected too much from “The Miseducation of Cameron Post”, based on the YA book by Emily M. Danforth, but, in any case, I can’t recommend it.Before the film started there was a preview of a coming movie called “Boy Erased” about The son of a Baptist preacher who is forced to participate in a church-supported conversion starring Lucan Hedges, Nicole Kidman, Russell Crowe and Cherry Jones. I am hoping this is what I wanted “Miseducation” to be and wasn’t."
    },
    {
      "rating": "6",
      "text": "After a teenager girl (Chloë Grace Moretz) gets caught making out with her girlfriend, she's sent off to gay conversion camp. There, she's subjected to religious discipline, but also finds sympathetic friends. The script delights in exposing the outrageous treatments and cruel concepts of this misguided approach, but it also presents a relatively rounded look at various \"disciples\" in the program. There's considerable focus on making the story earnest. The performances help, but the film never reaches an emotionally-compelling level.  A personal complaint: from my limited experience, most of the people at these facilities are predictable stereotypes, but none of the males in this movie was especially effeminate nor the females that butch."
    },
    {
      "rating": "8",
      "text": "The Miseducation of Cameron Post is truly a spectacle of wondrous filmmaking despite its critical and often overlooked subject matter."
    },
    {
      "rating": "7",
      "text": "All at once dreamlike and nightmarish, The Miseducation of Cameron Post is a film I enjoyed a lot more than I thought I would. I can see why this movie won the Grand Jury Prize at Sundance. It's incredibly well made.I've seen a few films about life at gay conversion therapy camps, most notably \"Boy Erased\" and I liked this movie way better. In Boy Erased, the staff at the camp felt like mustache-twirling villains. In Cameron Post, the staff at the camp and all of the adults in the film truly believed they were doing the right thing, but they were miseducated as well. The best thing about Cameron Post is that it really understands the culture of misinformation that allows gay therapy camps to thrive. Everyone thinks they are doing the right thing, but at the end of the day, the road to hell is paved with good intentions, and the camp does more harm then good.I really liked that the teenaged characters at the camp were rebellious. It felt way more realistic than everyone meekly submitting to the conversion therapy. The acting was top notch, and Chloe Grace Moretz and Sasha Lane were fantastic. My biggest problems with this film were that the dream sequences felt a little too gratuitous at times, and the pacing in this movie is just laborious. However, the slow pacing helps the ending feel really hopeful and well-earned. This is a movie that is well worth checking out if you are interested."
    },
    {
      "rating": "8",
      "text": "Chloë Grace Moretz has been squarely on our radar since 2011's phenomenal 'Hugo.'  In 'The Miseducation of Cameron Post,' she plays a high school junior who gets caught in the back seat of a car with another girl during prom and is subsequently sent to a religious gay conversion facility.Playing a gay character is a rite of passage for many young actors and actresses.  At its most poignant, such a performance brings the potential for an Academy Award into the realm of possibility (Tom Hanks in Philadelphia is one such example).  In 'Miseducation,' Moretz puts her acting chops on full display and we couldn't be happier to see her continuing to push the boundaries of her talent.  While the film itself is superb, it's also likely to fly too far under the radar to land Moretz any awards.  However, the expectations for her to someday have enough hardware to fill up her mantle have never been higher."
    },
    {
      "rating": "4",
      "text": "Regardless of the fact that its theme remains incredibly relevant especially for people who still believe that conversion therapy works; The Miseducation of Cameron Post seemed like a very poor film that only covers certain elements without deepening at any time and that makes it feel superficial and empty.Also the slow narrative plays against the film and although I had heard that Chloë Grace Moretz offered the best performance of her career, the truth is that I saw nothing that I haven't seen before and I'm neither surprised nor satisfied with her performance.Worse still when the film reaches a truly dramatic moment its director practically hides it, even its repercussions and only shows the idyllic escape of its protagonists. Disappointing.But as a reminder it does functions well. Get away from any unhealthy elements of any religion. Live with pride and decision about what you are."
    },
    {
      "rating": "8",
      "text": "The Miseducation of Cameron Post doesn't bother making the case that gay conversion camps don't work. (I'm sure it is very possible to come out of those awful places and decide to live a \"straight\" life in misery). Rather its light touch allows deeper truths to come through, such as the reality at the heart of the program: These kids are not wanted by their families and society, and one way or another, they will have to tear themselves down and reconstruct themselves completely in order to survive a culture where God's love means self-hate."
    },
    {
      "rating": "2",
      "text": "This movie must be an adaptation of a high school student's senior project. This movie is flat.  There is NO character development, no story arch, basically nothing. The positive reviews must be based on, \"Oh, isn't so great someone made a movie about how horrible conversion therapy is.\" That can be done in a PSA or an ABC after school special."
    },
    {
      "rating": "7",
      "text": "Small and significant, Desiree Akhavan’s THE MISEDUCATION OF CAMERON POST is delicate abuse and force-feeding of gay conversion, matched by Chloe Grace Moretz’s most calculated performance to date. She blends in, blooms, a salvation for this girl’s career from being erased."
    },
    {
      "rating": "2",
      "text": "Shallow, primitive and vulgar.Not even surprised by relatively high reviews.*Any* movie about homosexuals PLUS poo-pooing Christianity automatically becomes almost a masterpiece. Ugh... And I am not even religious...Waste of time and money."
    },
    {
      "rating": "8",
      "text": "For such a critical and often overlooked subject matter, one can't help but feel that the punch has been pulled.  While attempting to, one suspects, highlight the banality of this particular evil by quietly underplaying most of it, the film instead comes off as distant and nearly sleepy.  Even the most horrific thing in the film happens off screen, minimizing the actual damage.  Even so, the cast is good, the dialogue is there and anything that can shine a light on this timely issue is helpful."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)The assemblage of the best Breeders album (\"Last Splash\", 1992), the Saint Paul of 2 Corinthians 12:7-10 and the \"bleach\" of Nirvana's debut (1989) is as contrived as the novel of the same name (Danforth, 2012) on which the film was based, and it could have won the Grand Jury Prize only at Sundance, where they are not at all interested in such details."
    },
    {
      "rating": "8",
      "text": "Another movie of defying one's existence. It's great, heartw welcoming amongst teenanger suffering from hatred form their own parents"
    },
    {
      "rating": "7",
      "text": "This is a good film, although its (understandably) a tough watch in places. Its thought provoking and Chloe Grace Moretz gives a good performance. I would recommend this film."
    },
    {
      "rating": "4",
      "text": "I saw The Miseducation of Cameron Post at cinema's and had no idea what it was about but somebody told me it was about a lesbian so I was excited to see it!!!!! I thought it would have lots of sex in it and be a decent film, however I was wrong because it turned out to be some drama which is okay but this drama was a road to nowhere and the ending was rubbish."
    },
    {
      "rating": "6",
      "text": "Interesting film with a strong cast.  At the crux of it is an unadorned view of both teenagers and adults trying to figure out sexuality.  Some of them are misguided, and most make mistakes."
    }
  ]
}