{
  "id": 3024,
  "title": "The Italian Job",
  "starring": [
    "Mark Wahlberg",
    "Charlize Theron"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Crime"
  ],
  "description": "Charlie Croker pulled off the crime of a lifetime. The one thing that he didn't plan on was being double-crossed. Along with a drop-dead gorgeous safecracker, Croker and his team take off to re-steal the loot and end up in a pulse-pounding, pedal-to-the-metal chase that careens up, down, above and below the streets of Los Angeles.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eSkjK4kctyrWpFhxl35GPvSs6tI.jpg",
  "categories": {
    "plot": 6.3076923076923075,
    "acting": 6.631578947368421,
    "ending": 8.4,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.25,
    "action": 7.090909090909091
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Intelligent action, nothing too absurd, and great acting. Theron and Wahlberg have chemistry, and all the other characters work well together. Overall, a very satisfying movie."
    },
    {
      "rating": "10",
      "text": "great movie very well done it seems they really took a lot of time putting this movie together.great cast Mark Wahlberg is a great actor.The scene where they created a traffic jam was great. really liked this movie lots of good action very entertaining.Would watch it with a good beer."
    },
    {
      "rating": "3",
      "text": "The first half hour of this remake is great fun. I especially enjoyed seeing Donald Sutherland. I lost interest after that. Things immediately flagged in the second act, which shifted focus almost exclusively to Mark Wahlberg, a despicable human being who I have a hard time watching in anything. A violent and repeat criminal who blinded a man in one eye in a vicious attack. Why is this guy not in prison? He also just doesn't have charisma the way movie stars should. Do women find him sexy? If so, I don't know why. Charlize Theron played an uninteresting character cliche, and for a woman who looks incredibly sexy in still photos, she was somehow utterly unsexy in motion here. It was as if she didn't care, but was just reading lines. I know she can act, but here she just had no intensity and no passion, no charisma. I just couldn't maintain my interest and stopped watching about 40 minutes in. Listen, maybe the movie got great the second after I turned it off, but one has to make decisions based on the information one has. The information I had told me I was wasting my time. Someone needs to make a movie starring Donald Sutherland again, rather than just using him as a minor supporting player. That guy knows what he's doing."
    },
    {
      "rating": "8",
      "text": "That's a good example of what the thrillers of that genre should looks like.Great acting performances,great story and awesome action scenes.This movie is just one of the best(in this genre)."
    },
    {
      "rating": "9",
      "text": "njbjgjhihhiibbijbjbhjihdttdyfgutdsyiopkkkmbcdjhfcdwjfuugggugughftsrswwryionngyjhhhdxedxftdgsseffjghkknj,,,,,,,,,"
    },
    {
      "rating": "9",
      "text": "A heist movie at its best, The Italian Job is very fun and never lets go of your attention. Pretty good acting by Mark Wahlberg and the crew, and the movie has a nice, witty script."
    },
    {
      "rating": "10",
      "text": "F. Gary Gray dirige esse ótimo Remake,com um final satisfatório ao contrário do genial Law Abiding Citizen que tem um final horrível,Jason Statham no começo da carreira já mostrava talento como Rob O Bonitão,Mos Def é ótimo como orelha esquerda,Charlize Theron é ótima como Stella Bridger E Mark Wahlberg está ótimo Charlie Croker,Donald Sutherland E Seth Green estão ótimos também.\rAchei meio imbecil Edward Norton dizer que esse é seu pior filme."
    },
    {
      "rating": "10",
      "text": "Excellent cast    ."
    },
    {
      "rating": "10",
      "text": "Cool."
    },
    {
      "rating": "6",
      "text": "To me this is not a remake. To be fair I really wish they had not put Italian Job in the Title. In the UK its call 'The Italian Job: LA Heist' and from this I wish it was just called 'LA Heist'. The story is not all that bad. Its fairly generic but engaging. Most of the parts in the film are played well and I did think the cast was good. The only real reason that this is The Italian Job is through the choice of cars (New BMW MINIS). The plot moves at a decent pace and has plenty of set pieces, action moments along with some emotions (these feel a little obvious and fairly predictable) but its not a bad way to spend an hour and a half.\rThe ending is a little cheap for me but its not the worst you will ever see.\rRent rather than buy."
    },
    {
      "rating": "3",
      "text": "I chose to watch it so none to blame. I wanted to be entertained, that's it. Of course, there is much better entertainment out there that doesn't completely feel like a waste of time. There is a lack of life in the characters (?) and  relationships that makes it just a factory made cliche. The part with Sutherland is slightly better."
    },
    {
      "rating": "7",
      "text": "Certainly an entertaining heist film that fulfills all of its purposes. It intrigues the viewer, it gets you to root for the good guys and against the bad guy, and you are left amazed at how crafty these guys really are as they get what they want. The cast was really good; Wahlberg, Theron, and Norton, all turned in good performances as expected. Overall, it's certainly a movie I'd recommend to people as there's not much wrong with it."
    },
    {
      "rating": "6",
      "text": "I originally saw this movie in theaters, and I really liked it a lot, but it took me about 20 years to watch it again, and I am saddened to state that it just hasn't aged well.  I can't pick out any particular reason for the disappointment.  The heist is interesting, and it is always a pleasure to see non-CGI action scenes, but the movie just wasn't fun.  Maybe it is just less enjoyable after learning all of the twists in the story.  I give it a C - If you’ve already seen all of the A’s and B’s, but you insist on seeing a movie, try this one out"
    },
    {
      "rating": "6",
      "text": "Really has nothing to do with the original film except, you know, the main characters are all criminals.The original was a straight caper flick.  Every scene was either leading up to or leading away from the Great Crime of the Century and when it's all over our moral standards are rescued from enjoying a film in which the bad guys actually get away with the crime.In the remake, we start off with a crime, then a betrayal, and from that a tale of revenge, which consumes 85-90% of the runtime.  We do some boating in Venice, but that's about it for Italy.  We visit something that could be Switzerland, but then it's on to LA for most of the film.  And, yes, we do get a trio of Mini Coopers, and a computer whiz who does amazing things with traffic control, but that's about all the remake has in common with the original.And, basically, this film is just as silly as the original.  Just as silly as James Bond and a thousand other action fantasies.  I mean, the main characters could walk in, blow away their betrayer, and take back the gold, but how much more satisfying it would be to plan a whole big Mission Impossible style heist to steal the gold, which the betrayer naturally discovers, and then concoct a big bang-up finale in which some evil third party takes the betrayer prisoner and promises to torture him to death.  And that way we're saved from being forced to recognize that the bad guys, the criminals, have won, and we're swimming through a movie with a moral compass that only Donald Trump could love.It's possible I missed it, I guess, but I don't remember ever finding out who got ripped off for the gold in the first fifteen minutes of the film.And the romance scenes were just bleh."
    },
    {
      "rating": "6",
      "text": "Normal, ordinary. It's ok to watch when you have free time. Forgettable for me."
    },
    {
      "rating": "9",
      "text": "Fantastic movie... every actor/actress fit the mould perfectly. Plot was neat, chase scenes and special effects were sweet, lines were witty... The Italian Job is a really entertaining movie! After multiple plays, I am still not bored of it. MUST SEE!"
    },
    {
      "rating": "5",
      "text": "Fun movie, but rather dumb. They make so many poor choices leading up to the heist that the suspension of disbelief is non-existent. Unlike the Ocean's crew, these guys not only do things in the most un-slick, non subtle way possible, but they leave gaping holes in the plan and just make bad choices. Like having the gang leader's daughter spy on the antagonist as a cable repairwoman. Really? You don't think he might have seen her before, working with him all those years?If you can set aside all the logic problems, it's a fun movie with a great pulse. Edward Norton is always awesome, even as a sniveling bad guy. But intelligent this movie is not."
    },
    {
      "rating": "7",
      "text": "The Italian Job turned out to be better than I expected. Looking through the cast I was worried that the director was relying on the ensemble of heavyweight actors to carry the film, but dialogue and story-wise, The Italian Job wasn't bad at all. There's a lot of unnecessary filler scenes in the middle third, and the director/editor could have easily cut out a good ten-fifteen minutes. As pointed out by a few users, Edward Norton is fairly disappointing as the film's villain among villains, and I would've preferred to see him cast as the lead man. That being said, Mark Wahlberg does a surprisingly good job, not overplaying the role. The supporting cast, particularly Mos Def and Jason Statham, lend some comic relief and and give an all-round solid performance. There's a heap of implausible moments in The Italian Job, so much so that I was scoffing at times at the ludicrousness of it all, but it's to be expected from a high-adrenaline action film."
    },
    {
      "rating": "6",
      "text": "Bottom Line: Not that it should be passed on, but Oceanâ"
    },
    {
      "rating": "6",
      "text": "Perfect length, good choice of actors and best of all, the story is told almost flawlessly. Every minute of the film has been put to good use, so there are no fillers and it's all straight in there. It's \"smart but simple\" with some humour and good action scenes. I don't think it's a great film though. It's too gimmicky and lacking focus or the wow factor, but it's a good action film that won't dissapoint."
    },
    {
      "rating": "6",
      "text": "Fairly entertaining but often totally unbelievable heist film. Acting is solid."
    },
    {
      "rating": "4",
      "text": "Sub-par remake of an already sub-par heist adventure. Charlize Theron does excite--but is lost amidst unnecessary action. I fear that all I will take away from this experience is a vision of the Mini-Cooper."
    },
    {
      "rating": "8",
      "text": "It's a first-rate action thriller."
    },
    {
      "rating": "7",
      "text": "About as solid of a remake that you can ask for, considering how celebrated the original is, F. Gary Gray's \"The Italian Job\" gets things done and then some, offering up well-designed set pieces, admirable plotting and thrilling camerawork in lieu of an exact, shot-for-shot approach in addressing the 1969 caper. The iconography is there (i.e. the Mini Coopers, the Venetian canals, etc.) but this time around, you're also treated to early 2000's humor, early 2000's technology and early 2000's Marky Mark. It's kitschy as all hell, but charming in a weird, admittedly nostalgic way. Kind of a wonder (and a bummer) that I haven't seen this one earlier."
    },
    {
      "rating": "10",
      "text": "Heist movies at their best, I saw the Italian Job a few years back and I remember loving it, then I noticed that it was playing on Showtime, so I recorded it, and watched it, and it just gets more and more awesome every time I watch it. I just love a good heist movie, doesn't everyone? Its smart, funny, interesting, engrossing, and bad ass. The movie was very well acted, but one guy stole the show as the funniest character in the movie and that's Seth Greens character, he was funny, he had witty dialogue, an awesome back story that added realism to his character. But everyone else is awesome too. If you like realistic heist movies, you will like this movie. And if you don't like heist movies in general, you may like it but you won't love it."
    },
    {
      "rating": "6",
      "text": "At least the movie is not dumb and the beginning is great. But the characters are soooo cool and the hidden advertisement for BMW Mini is obvious."
    },
    {
      "rating": "5",
      "text": "The Italian Job gets promoted.\rThere is very little to speak of, The Italian Job is filled with overly qualified actors that are handed paper thin characters and cheesy one liners. An entertaining heist film with poor logic and no substance."
    },
    {
      "rating": "10",
      "text": "[10/10]Pros:1.Perfect in all aspects:be it action,car chase, emotion everything.2.Theron and Wahlberg had good chemistry.3.Cool cars like BMW,Aston Martin...4.Scenic beauty of Venice :) Cons:1.At the end theron opened the vault without much effort, seemed little absurd."
    },
    {
      "rating": "6",
      "text": "2003's classic remake ''The Italian Job'' is mediocrity at its best. It's neither great, original, surprising or anything of such sorts, nor is it bad in any way, shape or form. It's an entertaining film, it certainly is, but that's really al it is. The script is predictable and filled with plot-holes as you expect with films like this, the acting isnt good, nor is it bad, no one in particular stands out, Edward Norton maybe, he plays a cool villain, but in the opening scene of the film (and knowing the general synopsis of the film beforehand) you instantly know he was going to be the one to betray them, with his scary face and the moustache.\rThe film has cool ideas, despite having seen them all done before a hundred times, it has impressive set pieces, car/boat chases, good locations and a stellar cast. The way it was executed reminded me in a good way of Fast Five/Furious Six/ and Furious Seven. The same style of a rag-tag team planning a big heist, with car chases, lots of money, and just a great time watching\r All in all ''The Italian Job'' is certainly an entertaining flick, but extremely conventional, predictable, same with the characters."
    },
    {
      "rating": "8",
      "text": "The Italian Job is a good comedy action movie. The original did not look. Great cast, easy plot. Of course, the acting of Edward Norton is terrible, probably its worst role. The dynamics of the film are excellent."
    },
    {
      "rating": "7",
      "text": "The Italian Job is a very entertaining film, slow-burning but never boring."
    },
    {
      "rating": "8",
      "text": "Entertaining as hell!pace was perfect score was making  me part of the ride and performances was quite good And most importantly while the heist i was really in to what is About to happen which is great! although a great entertainer pumped with a great storyline!"
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "7",
      "text": "----------------------------------7.4/10-----------------------------------"
    }
  ],
  "recommendations": [
    "contraband",
    "triple_frontier",
    "16_blocks",
    "2_guns",
    "parker",
    "brick_mansions",
    "spenser_confidential",
    "gangster_squad",
    "street_kings",
    "rocknrolla",
    "run_all_night",
    "angel_has_fallen",
    "fantastic_four",
    "copshop",
    "collide",
    "safe_house",
    "wrath_of_man",
    "bloodshot",
    "red_notice",
    "alex_cross",
    "a_walk_among_the_tombstones",
    "escape_plan",
    "the_taking_of_pelham_1_2_3",
    "the_bank_job",
    "american_ultra"
  ]
}