{
  "id": 4030,
  "title": "The Bank Job",
  "starring": [
    "Jason Statham",
    "Saffron Burrows"
  ],
  "runtime": 112,
  "genre": [
    "Thriller",
    "Crime",
    "Drama"
  ],
  "description": "Terry is a small-time car dealer trying to leave his shady past behind and start a family. Martine is a beautiful model from Terry's old neighbourhood who knows that Terry is no angel. When Martine proposes a foolproof plan to rob a bank, Terry recognises the danger but realises this may be the opportunity of a lifetime. As the resourceful band of thieves burrows its way into a safe-deposit vault at a Lloyds Bank, they quickly realise that, besides millions in riches, the boxes also contain secrets that implicate everyone from London's most notorious underworld gangsters to powerful government figures, and even the Royal Family. Although the heist makes headlines throughout Britain for several days, a government gag order eventually brings all reporting of the case to an immediate halt.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ayrGDJDsSBczjztGUWKqmzL97xg.jpg",
  "categories": {
    "plot": 7.36,
    "acting": 7.588235294117647,
    "ending": 8.0,
    "soundtrack": 5.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Statham does more thought provoking movies than anyone out there. And if you think you can keep up with him physically, well he'll just kick your ASS there, too."
    },
    {
      "rating": "5",
      "text": "Not very exciting. not too intriguing either. Even if it was based on a true story, this film sucked."
    },
    {
      "rating": "2",
      "text": "What has happened to the mind of Stephanie Zacharek? This erstwhile movie reviewer for Salon.com is almost never wrong. But she loved this movie and this movie sucks in so many ways. The problem with \"The Bank Job\" is that it's simply a hokie movie - hokie directing, hokie acting, and hokie soundtrack. The director is so dump he must have thought that really awful '70s-style direction and soundtrack would somehow invoke the '70s, but all it invokes is what was truly awful about the '70s. And now this movie adds to the list of things about the '70s and make people want to cringe."
    },
    {
      "rating": "9",
      "text": "A very well written and acted movie. One of the best I've seen since the original Ocean's 11. If you like those kinds of movies, you'll definitely like this one. Highly recommend!"
    },
    {
      "rating": "10",
      "text": "Best film I saw in 12 monthsI saw the movie with my son, 38, my Aunt 86, and I'm an alter cocker ... we 3 generations all loved it. Exciting, unusual, gripping and based on a real story. Tension you could cut with a hack saw (OK \"knife\" is old fashioned.) Not to be missed."
    },
    {
      "rating": "9",
      "text": "Loved this movie! Great story, even better because it's based in truth. Great dialogue and action - no car chase - almost no guns - just lots of reality and well rounded characters. What a relief after this years lousy Oscar winners!"
    },
    {
      "rating": "9",
      "text": "Great story, well told. The explicitness of the sex scenes was not needed to make the point. Good script, fast-moving pace and excellent acting, especially Strathan and his wife. The Vogel character was perfectly slimy as well."
    },
    {
      "rating": "6",
      "text": "Solid film, good acting, great story. Didn't understand all of the British slang, but the basic message was comprehensible. I was surprised by the amount of nudity, the film definately earned its R rating. Very entertaining."
    },
    {
      "rating": "6",
      "text": "Decent film, good story but could have been improved very easily with some changes to the script and some terrible supporting cast roles, particularly those of Stathams 2 \"sidekicks\". It also seemed far too easy to break into the bank, like anyone could have done it. Some aspects of the story weren't made clear either. You get the feeling a bigger budget would have made it go a lot further."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this flick a lot. It has a little bit of everything: a little action, a lot of intrigue and suspense, a little nudity, a touch of comedy, and a nifty little story based on actual events. Somehow it all came together really well. I definitely recommend it."
    },
    {
      "rating": "10",
      "text": "Exciting, funny, and non stop action. The fact that it is based on true story makes it all the more intriguing. The acting was top notch."
    },
    {
      "rating": "9",
      "text": "Excellent, suspenseful, well cast, well written and edited."
    },
    {
      "rating": "6",
      "text": "Slightly entertaining but not exceptional in any way."
    },
    {
      "rating": "7",
      "text": "Well constructed thriller, great cast, well written. It always held my interest and has enough twists to keep the viewer engrossed. Well photographed and suspenseful."
    },
    {
      "rating": "8",
      "text": "If part of this movie is true, it is proof that life can be better than fiction. I have no doubt some liberties were taken with the story, but the movie does become more than just another bank robbery movie. The characters do feel very unoriginal, but then again it is supposed to be about real people. There are only so many character types out there. If you are looking for big time action flick, this is not it. There is some action, but they seem to try and keep more realistic. There are a couple of moments of action that felt fake, but it was not bad. The acting is generally good, although there are a few moments where people should have been more shaken up or rough looking considering what they just did or were doing. I think the casting was fine, but again, very predictable. Bottom line, is this a great look at a unique part of British history, well I am sure some where under the layers of Hollywoodizations it is, but that is the key. Watch this movie for entertainment, not for facts. Otherwise it is a good movie well worth renting and ownership if it is on sale."
    },
    {
      "rating": "9",
      "text": "I'm constantly bemused by reviews that state that the director is 'dump' - oh the irony. Ignoring the fact that this is set in the '70s (yes, cos that's when it actually happened), perfect combination of suspense and grit, and even the odd bit of humour, it's one of those precious few action films that isn't so predictable you actually want to find out how it ends. I was entertained and thrilled - can't believe people want more these days."
    },
    {
      "rating": "9",
      "text": "One of the best films I've seen in a long time. The European flavour is always appealing, the cast was great. I've watched the DVD 4 times & each time I'm on the edge of my seat, nervously. If you liked SNATCH this is a must see movie."
    },
    {
      "rating": "8",
      "text": "Not quite the comedy the trailer might lead you to believe, this is a straight up heist flick. Besides being about 20 min too long, The Bank Job exceeded my expectations. If you have an interest, at the very least check it out on video down the road."
    },
    {
      "rating": "9",
      "text": "Very involving retro bank heist movie with a lot of very interesting turns. Well cast, well paced, and a great music track. Can't understand why they gave it such a terrible title."
    },
    {
      "rating": "10",
      "text": "I thought this film was a delight to watch, proper British made quality. Best film I've seen at the cinema for a while. All the actors excelled where needed!"
    },
    {
      "rating": "7",
      "text": "\"The Bank Job\" differs from other bank heist pictures in one crucial way; instead of money, these thieves ransack people's safety deposit boxes. Money is so impersonal, it almost feels like a victimless crime. But a personal message scribbled on some woman's panties were not meant for random inspection. Bottles of vintage wine are uncorked like they were soft drink tabs. We all want to be filthy rich, but not like this. These aren't your suave and debonair bank robbers from \"Ocean's Eleven\". They're basically good, these English lads(and a bird), but Terry(Jason Statham) is boffing Marinte(Saffron Burrows), and one guy used to be the stud(not just the fluffer like the guy from \"Love, Actually\") in raincoat cinema(the producer looks like Martin Scorsese). To put it simply, an American audience won't identify with these crooks. Unlike, say, Joel and Ethan Coen's \"The Ladykillers\", we can better see that a crime is being committed. The objective differs in \"The Bank Job\"; the robbery isn't simply about accruing wealth. When Martine comes to Terry with her plan, getting rich is just a smokescreen to her real agenda. More complex than your average heist pic, things really start to heat up in \"The Bank Job\" after the hooligans leave bank premises. Unlike \"Ocean's Eleven\", or any number of bank heist movies, we don't live vicariously through these people because their booty is too damn hot. We want to be rich. Not die."
    },
    {
      "rating": "8",
      "text": "Very interesting plot and well done. If 90% of the movie is true, it is quite a story ! I recommend it highly, it is not a boring bank heist movie we've seen before."
    },
    {
      "rating": "9",
      "text": "A very intelligent bank heist movie, and especially entertaining because of its \"real life\"roots. Go and enjoy!"
    },
    {
      "rating": "9",
      "text": "It kept me going throughout the entire flick. I liked it."
    },
    {
      "rating": "8",
      "text": "Takes time to develop, but in the end all the plot twists and turns keep you engrossed."
    },
    {
      "rating": "7",
      "text": "The actors try their best with the lines they are given, but the \"movie about a real bank robbery\" is on auto-pilot most of the time. It greatly resembles a 70's film by letting the characters drive the story. As a result there's a lot of dialog. But its not very interesting dialog. It is an instantly forgettable film."
    },
    {
      "rating": "7",
      "text": "It's a \"for the most part\" entertaining little caper flick with some twists and turns in the same vein as films like Snatch and Lock Stock and Two Smoking Barrels, however, this film is a bit more serious in tone. It involves a wide spectrum of characters but this is kind of a problem in the sense that you will constantly be trying to keep up with everyone in this movie and what they are all about and what they are trying to accomplish......it becomes a borderline mish-mash of ideas. Overall its an effective flick that while a little too complicated for its own good proves to be entertaining none the less. This is easily Jason Stathams best performance as a serious actor, meaning there is no ludicrous plot, no \"brain cell killing\" action sequences, or dialog that makes George Lucas look like Scorcese. Definately worth a look, should not just be passed up."
    },
    {
      "rating": "7",
      "text": "Great fun ... Statham is believable as the leader of the gang mixed up in trouble they can not imagine."
    },
    {
      "rating": "8",
      "text": "Extremely well done, maintaining its intensity--almost--to the very end."
    },
    {
      "rating": "7",
      "text": "Based on real events the film is amusing enough and keeps going at a decent enough pace to be enjoyable. Good storyline and fun recreation of 70s London - especially all the cars. Jason Statham goes out on a limb to play an(other) East End gangster but does it very well. Plenty of gratuitous nudity too for good measure. Recommended."
    },
    {
      "rating": "6",
      "text": "I thought this was going to be like Lock Stock after watching the characters introduce and the plot was set up, but the film turns a bit dark and tries to be a more like a thriller, I was expecting comedy punchlines! Not bad but it feels a bit muddled in style."
    },
    {
      "rating": "8",
      "text": "Ten times better than 99% of the action movie sh%t that comes out of the states. Worth checking out! Awesome poster too"
    },
    {
      "rating": "7",
      "text": "Based on a true story, cockney geezas rob a bank then it's a right knees-up & barrel of monkeys.Does what it says on the tin, Jason Statham plays his usual whispering cockney self but quite entertaining overall."
    },
    {
      "rating": "7",
      "text": "I was very surprised by The Bank Job. I went in expecting a brainless action flick but was rewarded with a suspenseful and well-paced crime drama. It feels very much like the old British crime films of the past, not just in period dressing but in it's acting and directing, too. Very nostalgic and entertaining."
    },
    {
      "rating": "7",
      "text": "The film could have been longer, developing some relationships and exploring  a couple of interesting characters. It feels a little rushed. In any case, I enjoyed it. Nice period piece, good acting (mostly) and an intricate  and dynamic plot."
    },
    {
      "rating": "7",
      "text": "Enjoyable bank heist movie with enough twists, turns and sub plots to make you believe you may be watching a Guy Ritchie movie. Statham is excellent as usual and the rest of the cast fits the bill well. Gritty in parts, humorous in others overall it's well worth a watch."
    },
    {
      "rating": "7",
      "text": "You'd think that a Jason Statham film about a bank robbery can only mean one thing: cliché Hollywood tricks, comical action and no story or organisation. However, The Bank Job is the complete opposite. The focus is on the main character as well as the crucial moments of the robbery itself. It's not one of those films which spends only 2 minutes on the bit that actually matters. Aside from this, there is a lot more going on at any given point, and everything that happens has a purpose and its own story behind it. If you want a break from mindless action films, you should definitely give this one a go."
    },
    {
      "rating": "6",
      "text": "Decent Jason Statham film with good acting and a fairly entertaining story."
    },
    {
      "rating": "7",
      "text": "The Bank Job is a good movie based on the legendary 1971 London bank heist. While I enjoyed the fast paced action this film offers, it jumps around so much and so fast, that it's pretty hard to keep up with. I found myself quite confused at many different points in the film, especially at the end, when I had to rewind 3 or 4 times. Jason Statham is far and away the top action star out there today. What's so great about him falling under the radar is that he gets to do what he wants to do, instead of getting stuck with nothing but big budget disasters with no plot. The story behind The Bank Job and what led up to it, who was really involved in, was really interesting and made for a great plot. The constant jumping from place to place made for a confusing film, that while good, wasn't nearly what it should have been."
    },
    {
      "rating": "6",
      "text": "The Bank Job is a well made, well acted bank heist thriller. It interweaves all of the facets of the real life heist and the rocks it turned over very well and that made this one quite a compelling watch. However, the main positive in this one is the fact that it's based on a true story. Without it, a lot of this one would have been far less compelling to watch unfold. The whole heist and everything surrounding it was quite thrilling and, as I said, it was well directed and well acted, however, the non-heist portions and non-controversial parts, kind of fell flat. The amount of webs it weaves is entirely worth watching this one though, because it does quite well. It introduces many scenarios that could overwhelm, yet finds a way to keep its wits about it and not overwhelm its viewers. Overall, The Bank Job is an average bank heist thriller that thrives due to the fact it's based on a true story and it manages to take all of the portions of that truth and add them together nicely."
    },
    {
      "rating": "5",
      "text": "The kind of cloyingly standard, unmistakably dubious adaptation of a real-life event that makes you wish for the more straight-laced, docudrama approach, Roger Donaldson's \"The Bank Job\" may claim to shed some sort of light on the fascinating true crime story it's based on. Though, even a cursory glance at the actual case will quickly result in doubt. Beyond that, this just wasn't the right approach for me. The look, the sound, the tone — it all felt too clean. This is like a competently painted slab of drywall for what could have been a grimier, more textured facade of a film. The heist scene itself is fun enough, but once you're out of it, there's still lots to do. None of those things, however, are anywhere near as interesting and, as the stakes are raised, you very swiftly realize that your investment in these characters is insubstantial, at best. Quite an underwhelming experience and waste of potential, overall."
    },
    {
      "rating": "10",
      "text": "This movie based on a real story is well directed, silent, fast paced, suspense thriller. I watch it again and again and never get bored. Very entertaining!!!"
    },
    {
      "rating": "10",
      "text": "Este filme é a mais sensata prova que Jason Statham é um ator muito talentoso e cheio de carisma,e que se os críticos forem mas bondosos e menos arrogantes fazeram justiça. Um drama bem executado contém cenas bem tensas,uma história de assombrar esse filme baseado em fatos reais é uma nova obra-prima excelente roteiro e elenco."
    },
    {
      "rating": "8",
      "text": "The Bank Job is not the usual Statham vehicle-- it's actually quite smart and compelling. It is easy to watch and there are thrills to be had. As far as a heist movie goes, the movie is much more interesting than its title."
    },
    {
      "rating": "7",
      "text": "The Bank Job cashes in.\rThe movie starts at a good pace and continues without letting up. A solid telling of a true story. Statham continues to entertain with his gritty intensity and likeability."
    },
    {
      "rating": "10",
      "text": "a tense movie    very good thriller    incredible movie..."
    },
    {
      "rating": "8",
      "text": "Sincerely loved this movie... & was insane... it's truly scary to think this is all based on true events."
    }
  ]
}