{
  "id": 527,
  "title": "The Purge",
  "starring": [
    "Ethan Hawke",
    "Lena Headey"
  ],
  "runtime": 86,
  "genre": [
    "Science Fiction",
    "Horror",
    "Thriller"
  ],
  "description": "Given the country's overcrowded prisons, the U.S. government begins to allow 12-hour periods of time in which all illegal activity is legal. During one of these free-for-alls, a family must protect themselves from a home invasion.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/x6hwbnR2nGacSzljqYaXY25w1Me.jpg",
  "categories": {
    "plot": 4.181818181818182,
    "acting": 4.162162162162162,
    "ending": 4.142857142857143,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.25,
    "funny": 3.0,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Let me preface this by saying my lord did this movie actually have an original, interesting story. When I saw the first preview for this I thought it had potential. Okay, got that out of the way, now, on to the point.\r Saw the movie with moderate expectations, didn't think it would be overly great, and didn't think it would be terrible either. So, the movie starts, the annual Purge starts, okay, so good, so far. Pretty good opening. When the neighbor woman handed Lena Headey's character the cookies, I knew something was going to happen towards the end. Like I said, The Purge starts and so far so good. Then, like every movie with kids, they ruin everything. Not going to give any spoilers, but the movie, a good part of the movie was a search & destroy mission, then the final part of the movie went along with deciding what the right and wrong things were to do in the Purge and a final showdown and just when you think its about to end.....they SUCK you in for one last act of The Purge, it was predictable to a certain degree, and it wasn't really good. A let down and it felt very forced and stupid.\r All in all, it wasn't horrible, but it didn't approach decent either, it was stupid. The acting was okay. I mean, Ethan Hawke is a very good, underrated actor, we all know that from his past work, but this wasn't his best role. The idea was original and fantastic, exciting really. However, the execution was poor, the story was badly written and if in the 12-hour window of the Purge, all crime is legal, why did they focus on just murder? I understand that was suppose to be the whole theme of it, but all crime is legal. Be realistic. Where's the rape, the bank robbing, the drugs, etc? The movie felt like one big run around and got very boring. Don't waste your time on this over-hyped crap."
    },
    {
      "rating": "0",
      "text": "That this movie isn't universally ridiculed is a sign of how bad things have gotten in America.\rThe concept is ridiculous and the execution is very stupid:\rThe two messages are:\r- too much violence is bad, so perhaps we should reduce violence.\r- The purge is already happening: The one percent is waging class warfare against the middle class and the poor, with their predatory lending schemes and with their continued sabotaging of the health care system. Many reviews fail to mention that with the Health Care System, a purge is already being waged against the very poor.\r Both the lousy concept and the poor execution are getting in the way of all that.\r Concept:\rThe idea that a purge would work on any level is ridiculous:\r- revenge killing!\r- who's gonna prevent killing from being done after 7:01? And if I call it self-defense, who would challenge me? I can murder anyone, claiming that, which is what Zimmerman did, knowing full well no white jury would ever convict a white man.\r- too much pressure on EMT services the day after.\r- the risk that arson would destroy other homes than the targets is too great.\r- the enormous destruction of property.\r The execution:\rAs a movie it's sooo full of plotholes, it's frankly beyond believe.\r1. The BIGGEST and BADDEST security expert allows his 11 year old to access the security system and open the door for a total stranger.\r2. The BIGGEST and BADDEST security expert, who's also very rich have no back up generator???\r3. The house apparently has no small battlement loopholes as in an opening or apertures in the wall, from which potential intruders can be shot. Like those bored rich kids.\r4. the kids keep running off, makes no sense.\r5. they keep splitting up.\r6. daughter goes with the BF after BF tries to shoot her father. Very unlikely\r7. Mother allows neighbor to walk after neighbor beeyatch tries to kill her kids, TWICE! Some very gentle kind soft natured mother will pump you full of lead if you even look at their kids funny.\r8. BF shoots the father for no real reason and expects daughter to still love him?? Very unlikely\r9. Won't there gigantic revenge killing the next day?\r10. A purge day will lead to wanton and GIGANTIC destruction of property, that's always bad.\r Given all these problems I think the movie should be more taken as an allegory than literal, it's like the Bible on that note."
    },
    {
      "rating": "0",
      "text": "The Purge is simply awful. Awful concept, unbelievable  awful writing. The son in this movie is an imbecile. He essentially got his father killed by letting a homeless man in their house. The said homeless man lives at the end. How he lives I don't know. He walked away at the end after bleeding out for about 12 straight hours. Yeah ok.....The father creates top of the line security systems, yet says \"The security systems are not made for events like this\"....Dude, you live in a society where every year people are allowed to go on killing sprees, so why would you say something so preposterous.....The neighbors at the end wanted the family dead, until the massive blood losing homeless man saves them, then the mother lets the neighbors go?.....Why  so she can tell stories in the produce aisle? Wait for the neighbors to try and kill them next year?...Possibly the worse written plot ever...For such a great concept, so much more could have been done. A waste of a great plot."
    },
    {
      "rating": "0",
      "text": "Dumb, dumb, dumb that defines The Purge.  Terrible script and yes a terrible premise.  I know some think the premise is interesting, but the more you think about it the more it's just stupid.  I mean who would want to live in a country where people can legally murder and as for unemployment being at 1%, how.  Why would anyone want to go to work and potentially anger the wrong person who would then just kill you on The Purge.  Ethan Hawke is fine, but the kids are stupid and the invaders are stupid.  Not scary, not thrilling, not a piece about society.  Just plain DUMB!!!"
    },
    {
      "rating": "4",
      "text": "I watched the Purge this weekend and I gotta say I wasn't even in the least bit impressed. Before I continue, I have to say that this is the dumbest concept for a movie ever! So let me get this straight, in this movie, people are contempt with being able to commit a crime only on one day an that just basically stops crime? What about serial killers? Beyond that apparently, everyone just kinda excepted this Idea as there were no talks of people standing against the purging. To make matters worse this is in 2022 and according to the movie it started in 2017 just five years later and everyone celebrates a purging like it's the Super Bowl. Hell, they literally have a Purge TV. In other words I already Hate these people right off the bat. .By the way another huge problem with the concept is that it isn't explained how it works. During the broadcast you are allowed to use weapons except for class 5 and above. So, no rocket launchers? You also can't hurt Class 10 Government officials I think. So Don't kill the president and his cabinet? Also medical aid/police stations/fire stations are suspended. So what happens if you have a heart attack? What stops you from killing all cops? That is the main problem with the concept it doesn't go into details with the rules. But I digress. The next problem is the movie starts a pointless plot point that goes nowhere. We spend about 20 minutes on the boyfriend explaining that he would talk to the girl's father, only to be axed early and almost completely forgotten. We could use this time to explain the rules and reason for the purge, but nope, completely wasted.Something else annoying is this movie isn't scary in the least, but tries with a couple hundred jump scares. JUMP SCARES ARE NOT SCARY! There are alot of annoying things that appear in the movie so as to say  this is a plot point, you stupid monkey\". Like when you see a burnt up baby toy with wheels and a camera. Geez, I wonder if this is important. The reason for this is that one of the main producers is Platinum Dunes. If you don't know what that is, does Micheal Bay ring a bell? Nuff Said. In the story the family locks themselves in there house for protection against the aforementioned Purge. BTW is it me or is the only reason the purge exist in this movie, an excuse for the plot to happen. It is just there so the home invasion movie can happen for a contrived reason. When the son lets a wounded homeless man in his house cause he's a dumb ass. The man is followed by a gang of youths who are trying to kill him. To bring the movies message deeper they make the youths from an affluent neighborhood and mostly white while making the man Black, homeless and a veteran. This is a cheap way to gain sympathy for the character, that really isn't needed. The youths tell them that they need to find the man, so they kill him just for being poor. If they don't, they will be killed with him. At this point the movie becomes a hunting movie with nothing happening until he is found and we are shown why we shouldn't like the characters in the movie. however the family for no reason completely out of nowhere decide to save the man and fight. At this point it becomes a home invasion movie as the youths move in to kill them. Yes it is like you walked into a different movie. A bunch of people die and there is a trifecta of Deus Ex Machinas. I won't spoil the ending except to say that the movie ends without being climactic and just comes off strange yet hilarious. And what was the point there was no change nothing was improve, making this movie COMPLETELY POINTLESS! It is sad cause this movie had great actors in it(except for the main villain), but they had nothing to work with. This movie is a 4/10 to me, it's just meh. You'll forget this movie after watching it. Hell I had to look up some thing to write this review. A stupid plot, pointless filler, uneven pace, and generally crap atmosphere. I might be being nice but I am going to leave it at that."
    },
    {
      "rating": "0",
      "text": "Bad movie, the story is just  The ending is just crap. rtgdrgpdrkgdtgfoijtohoixfhjokviidryhiduhophukthiothufbjhutibtuyhtgkjhtimounstjunsoujynstiouyjtosuynioioioioioioiotujsouysroiynsotiyu"
    },
    {
      "rating": "5",
      "text": "Listen, the movie is good and the acting is outstanding. It's the idea, that's brutally disturbing and repulsive. Also somehow the plot felt unfinished and flat. Because of the mentally crushing idea and on moments the unnecessary and weird scenes, this movie, in my opinion deserves 5/10. Also, did you notice the characters of the children, what for God sake was those confused faces. I remember the scene where the mother cooked or something and the little son was mystеriously watching her with his camera. And nothing happened. Totally unnecessary. And the daughter who sees her father and her boyfriend getting shot and pays attention only to the boyfriend. Stupid.Overall it was not horrible, definitely with potential, but not particularly grabbing."
    },
    {
      "rating": "8",
      "text": "I was excited to see this movie.  I thought the previews for the movie were great.  I was not disappointed by this movie.  I was worried by some of the reviews that I had seen before going to the movie--I almost decided not to go because of the reviews--but the movie was very good.  I enjoyed The Purge."
    },
    {
      "rating": "5",
      "text": "magine a world where crime is basically non-existent and almost everyone has a job and is doing well.  Imagine this utopia is in the US in the year 2022.  Thanks to a night held once a year called The Purge, this is all somehow possible.  Any crime is legal for a night every year until morning comes.  That is the basic setting for the movie.\rI‘ll cut to the chase.  It’s supposed to be a horror sci-fi thriller but it fits none of the two supposed genres.  It’s a short film (85 minutes) and the first roughly thirty consist of a wealthy Ethan Hawke and his family gearing up for the night.  Other events complicate the family’s safety, and finally there are a few actually decent action scenes about an hour into the film and lead to a predictable yet tasteless ending.\rThe main villain is a young fella who is the leader of a group of college-aged kids taking part in The Purge (because c’mon, who doesn’t want to kill somebody?) and his acting job is creepily sinister and ends up giving you an overall solid job of being the bad guy.  Otherwise, if you come expecting a scary, thrilling, and violent movie, you get none of the first two adjectives and a little bit of the third.\rI will have to say that the idea the movie presents is spectacular.  It could be turned into an awesome futuristic film if taken seriously and turned into something serious (maybe down the lines of Looper, Cloud Atlas, etc.) so I’ll give writer-director James DeMonaco that."
    },
    {
      "rating": "1",
      "text": "I have just a few things to say.  First off, if this ever happens to Any of you,  THIS IS NOT the way to go about saving your family. Second of all, poor script. Lastly I would rather watch 5 monkeys throw sh°t on each other."
    },
    {
      "rating": "7",
      "text": "I had read consistent bad reviews and seen low ratings for this movie which led my wife and I to stray away from spending good money on seeing this in theaters. However, after renting this I can easily say it was worth the $5.00 spent. The action scenes were executed well and for the most part, I did like the characters enough to actually care what happened to them.\r I did find myself consistently thinking that even if this scenario of \"the purge\" were real, the way the characters acted would not be anything near how they would in real life. It is a shame that such a creative premise was somehow mismanaged and not used to its full potential but it was very entertaining nonetheless. The Purge obviously lacks in some areas and falls short in others, but ultimately triumphs in providing what it was intended to do; leave your brains at the door, sit back and enjoy some creepy entertainment."
    },
    {
      "rating": "0",
      "text": "I signed up just to let people know how terrible this movie is, the idea of there being a single day in the year (which turns out to be only 12 hours starting from 7pm...  in which people are legally allowed to commit heinous crimes, but higher level govt. employees are for some reason exempt, is so stupid, if you are drawn to a plot as ridiculous as this then maybe you need to be purged.\rThe story is so bad and made no sense, there was no depth to it, the acting was terrible, and character's idiotic decisions were enraging, i hated myself for wasting my valueless time watching this  movie, the only reason why i did was because i acquired a pirated copy for which i am thankful for, because if i had actually spent any money to see this, i would be so depressed and angry and would have demanded my money back."
    },
    {
      "rating": "4",
      "text": "Draws viewers in with an interesting idea, and the first half looks promising, but succumbs to cliches. The second half is boring rather than suspenseful."
    },
    {
      "rating": "3",
      "text": "3 points for the concept, which was great and left me anticipating the release. Sooooo disappointed, wanted to leave before it ended. Everybody was so very stupid in the story, that it was all so predictable. This could have been a great movie."
    },
    {
      "rating": "0",
      "text": "Watch this movie. Watch this movie if you like the feeling of anger pulsing through your bloodstream because you gave Ethan Hawke another chance. Because you thought the plot sounded cool, because you wanted to see rich people die.\rIf not, leave this one alone, because it is one of the most infuriating movies I have ever had the opportunity to see.\rI wish there was an annual \"purge\" (like that fairy tale BS would fly in any country)  so that I could legally execute the talented individuals who brought us this film."
    },
    {
      "rating": "5",
      "text": "The Purge has an interesting idea that is a lot of fun. However, the total implausibility of the world this movie builds is only compounded by a half-assed message that \"violence is bad, even when mandated by the government.\" However, by the end of the movie, you will believe that VIOLENCE IS AWESOME! Seriously, the movie sets up this whole philosophical argument about how violence is cruel and unnecessary, but by the end of the movie, you will want to use violence to solve all of your problems. All in all, it's definitely a fun watch, if nothing else!"
    },
    {
      "rating": "3",
      "text": "The story of this film had everything to be excellent but they gave us the same boredom as always, someone makes a mistake that ends up screwing everyone ..."
    },
    {
      "rating": "5",
      "text": "This movie had an interesting and original story, but it doesn't have all the elements to work together. The movie doesn't really have the scary feel its suppose to have. Plus, the people in the mask only express their  how psychotic they really are. They don't deliver any purpose. If it was more like the Joker in \"The Dark Knight\", then they would actually make this movie work. But honestly, these actors weren't made for their roles. I wish I had more to say, but that's all I have to say about this extremely short \"psychological\" movie. Overall, it doesn't completely work together."
    },
    {
      "rating": "3",
      "text": "The problem is that The Purge has a powerful plot and ideas that are never used before, what happens here is that it is turned into a tired, cliché ridden, low budget slasher horror film, that could have been great and thought provoking. Lost opportunity."
    },
    {
      "rating": "0",
      "text": "There’s something powerful in the way horror movies and thrillers are able to tap into the cultural fears of a given moment. Whether it’s the sexual politics of the 1980s slasher movie, or the torture porn explosion in the wake of the US wars in Iraq and Afghanistan, no other genre is so adept at saying, “Here’s what's on our minds right now, and it’s scaring the hell out of us.”\rThat’s the tradition writer-director James DeMonaco hopes to join with The Purge. A home invasion flick wrapped in Occupy-era themes and fears, it starts off strong but is ultimately neither scary nor smart enough to kick off the kind of thought-provoking conversations it so clearly wants to be part of. The setup is certainly promising. The year is 2022. In response to a tremendous economic crisis, America has been reborn at the hands of the \"New Founding Fathers\"  a group of elected officials who initiated something called The Purge upon taking office. The problem with America, goes the rhetoric, is that its citizens are not able to keep their animalistic nature at bay. So once a year, all laws are suspended for 12 hours, during which citizens can rape, murder, and pillage to their heart’s content. And somehow this system has worked, quelling economic panic and returning America to prosperity. It’s Ayn Rand with a shotgun, and while there’s certainly territory to be mined here DeMonaco fails to follow through after he sets up the pieces. He tries again with a few character turns given to the mysterious drifter  played by a black actor, because the film’s class warfare is subtle like that  but they’re clumsy and obvious, the kind of after-school special lessons you know are coming the minute the drifter is put at odds with the Sandins. It’s a case of unfulfilled promise, and I can’t help but wonder if there was a great socio-political satire that got lost somewhere along the way. The high-concept setup is so ridiculous  it reeks of the kind of over-the-top commentary we saw in the original RoboCop  that it’s a shame the film drags through its 85 minutes without paying it off. The Purge does have moments that shine  there’s a a great gag about the government regulating just which kinds of weapons can be used during the night of lawlessness, and Hodge does a lot with a thinly written role. The film even manages to squeeze in a surprise plot twist or two. But it’s a slog of a journey that ultimately leaves you wishing you could see the film The Purge wants to be instead of the film that it is."
    },
    {
      "rating": "3",
      "text": "A decent number of thrill scenes still can't make up for a dull beggining and end. Too much on explaining why people purge and not enough purging. We were sold on a horror movie and what we got was a force feed on why American society has gone to crap and to make up for it we get 15 minutes of good thrills. Also I dont think I have ever been so annoyed by so many characters between the stupid children, the villians and the number of rediculous actions the family takes. Really there are killers coming intot he house but im going to decide to run away from my family because im upset at dad. SO STUPID!"
    },
    {
      "rating": "3",
      "text": "When Ethan Hawke showed up in last years legitimately scary Sinister I was happy to see the actor branch out slightly and give the genre picture a go. I was also glad he paired with the director of one of my other favorite scary movies of the last ten years, The Exorcism of Emily Rose. Upon seeing the first trailers and promotional materials for The Purge though I thought he might have jumped in head first too quickly and began splurging on the kinds of roles in the kinds of movies that might eventually end up in the five dollar bin. While this second trip into scary movie-land is not as intriguing or mysterious as the aforementioned Sinister it has an interesting enough premise to draw people towards it (and the creepy, over exaggerated face masks are always a plus in home invasion thrillers). Director James DeMonaco, who has only directed one previous feature before this, has also composed a script that contains a fair amount of potential in the points it is trying to make and the message it is trying to get across, but unfortunately we never really see any of the gritty realities of this new found way of life. No, instead of diving into that real potential the film could have brought to the experience it instead quickly dissolves into that standard home invasion film where we see every plot twist coming and every supposed scare is as obvious as how this whole thing is going to end up. There were times the movie almost had me fooled, had me thinking it was going to go a different way, but heaven forbid it do such a thing as to dare to make the audience unhappy. This timid nature ultimately results in the most typical conclusion led up to by the least surprising and least effective set of circumstances. Worse than all of this is the fact there are no likable characters here. We don't like our supposed protagonists from the beginning because they've succumbed to this annual event that makes little sense and we don't like their kids or their new enemies because they all make dumb decisions. In the end, there is only one word that comes to mind when I reflect on what this turned out to be: pointless.\r read the whole review at www.reviewsfromabed.com"
    },
    {
      "rating": "4",
      "text": "The trailer makes it look like a Funny Games for the 99 percent. (Ugh. That sounded terrible.... forgive me.)  But it's nowhere near as interesting or as diabolical as Funny Games.  And being predictable isn't the worst thing in the world so long as the movie is executed with skill, but this one is very much the former but nowhere near the latter.  Still, Hawke and Heady make it interesting.  The kid from Parenthood is serviceable, but it would have been more interesting if he were actually playing his character from Parenthood."
    },
    {
      "rating": "0",
      "text": "I really liked the concept up until I saw the movie. So stupid and just as cash grab. What happened to all the great horror movies. So bad. I could barely sit through it in the theater."
    },
    {
      "rating": "8",
      "text": "I find the movie very entertaining  very suspenseful i loved it  i really just didn't like the ending that much i don't think the dad shoulda died i think he shoulda made it to the end"
    },
    {
      "rating": "3",
      "text": "This movie was extremely mediocre at best. The story was very shallow and dull. The characters were boring and had no development whatsoever and the sound effects were alright. Also, the movie is short, very very short. I would not recommend anyone seeing this. Save your money for something better."
    },
    {
      "rating": "5",
      "text": "Never, in my all my years of film, have I been more frustrated and physically irritated by characters and their dumb decisions. They struggle to make not only the right choice, but a comprehensible one. When guns start to go off the film is good. Only problem is that's the final 15 minutes of an 85 minute movie. It's not bad, but it wasted its potential."
    },
    {
      "rating": "8",
      "text": "What is wrong with people? Purge is exactly what the audience wants. Action,horror,suspense and blood. How people didn't like it? The plot may sound silly and some people may not like it  I accept that) but it is original something that most horror movies nowadays aren't. I also don't understand how critics like The Cabin in the woods which is a  movie and they didn't like the Purge which was a scary intense film. Lena Headey was a big surprise to me as I've only seen here in Game of thrones where she is excellent as \"the bad guy\" and she was even good playing \"the good guy\" and the mother who protects her daughter and son. In overall there is suspense and The Purge it has a good original plot that many people will like and others will not. I like the Purge and I consider it as one of the best horror-thriller movie that I have seen  Thumbs up!"
    },
    {
      "rating": "7",
      "text": "The movie keeps your heart beating from the start to the end. Its takes a ludicrous plot and provides a fairly reasonable and logical explanation that gives an almost surreal feel to the event. There are many… many cliches to in the film and character development is non existent… still a good watch. pretty entertaining."
    },
    {
      "rating": "3",
      "text": "I can't say that my expectations for this movie were very high at all, but nonetheless I was disappointed. You'll hear everyone, even critics, praise The Purge for the original premise, but it's really a silly concept at its core. The concept of the annual \"purge\" serves best as a symbolic meaning, but in reality, making all crime legal for one day would hardly do anything to improve the overall situation. It is a logistical nightmare and it is never once explained HOW the annual purge improves day-to-day life. I thought the underlying tones of religious oligopoly and the clear discrimination present in society would have been much more interesting to explore. You can't just introduce such a new concept as an annual purge and only dedicate a few scenes to its exposition. A small scale home-intruder thriller does not fit this sort of concept, in my opinion. This also has to do in part with the fact that The Purge is a bad movie front and back, in almost all senses. The acting is unremarkable, although I'm pleased with the limited amount of overacting by the leads. The lead delinquent character was well thought-out and acted, but the writing was awful. Everything has extremely heavy-handed and there was no concept of subtlety with the plot. Events were foreshadowed a scene or two ahead of time, and the pacing was awful. I found myself getting more enjoyment out of the reactions from fellow moviegoers, rather than the film itself. I found that the movie was awkward and each twist seemed more forced than the last. And honestly, I have never been more frustrated at characters' choices than I have during this movie. The best part of the movie was the very beginning, when the stock footage of people killing and being killed during the annual purge is shown. It's truly chilling and helped hash out the world that the average American at the time would be living in. Of course, the rest of the film worked as hard as it could to undo all of this.The Purge is bad enough to be universally recognized as a poorly-made horror flick. Unfortunately, it really isn't bad enough to be worth screening at a Halloween party for good humor. It's too mediocre to be taken seriously, but not bad enough to be remarkable. It was a horrible limbo to be caught in, and I wish that the admittedly interesting concept was taken on at a larger level and scope than the cruddy thriller we got."
    },
    {
      "rating": "5",
      "text": "Although The Purge has an interesting and original story/concept, the slow start to the film and the eventual climax leaves you feeling rather underwhelmed."
    },
    {
      "rating": "5",
      "text": "Extremely disappointing. Cool concept, good acting, poor execution, and terrible story. It seems an impossible task to be frightened by mainstream Hollywood \"thrillers\" unless you completely shut off your brain. It felt like the film was going half-speed in the beginning, doing a fairly decent job of building tension but once the break-in occurred, it all felt horribly rushed. The group of young wanna-be Clockwork Orangesque punks turned into simple shotgun fodder and lost any of the scary edge they built up while waiting outdoors. And by the end, I wished that I got to see what was going on outside of this rich white family's home during the \"Annual Purge\". A far better tale would have been someone trapped alone while anarchy reigned  this felt like a poor rip-off of Panic Room in many ways. Great concept but they could have used a proper story to back it up, which just makes me sad to think about the missed opportunity. I am actually hoping for a sequel that focuses on another aspect of the night."
    },
    {
      "rating": "9",
      "text": "This movie wasn't spectacular but it sure was intense. Not a real deep plot but good scares and tension. The moral choice that plagued the protagonist and his family was a tough one. The ending and length of the movie were the only things I found wrong with it. Still a good movie I liked it better than the strangers which reminds me of this."
    },
    {
      "rating": "7",
      "text": "Review From www.thereiopinion.com\r All Originality Has Been Purged\rI came across the preview for this movie a couple months back and I thought that though the horror genre as a whole has been overdone (I Love Horror Just The Same) this movie seemed to have a generally original concept. The year is 2022 and america has been reborn under new founding fathers who these founding fathers are is never elaborated on any further which I think is one of the faults of this movie there is a much larger story to be told here but as this is a horror movie we follow the very narrow view of this one upper class family. The family is made up of four people James Sanden (Ethan Hawke, of Training Day & Daybreakers) who in this new world of yearly purges sells security systems his target market is wealthy home owners. Mary Sandin (Lena Headey, of 300 & GOT) his wife and mother of there two children Charlie Sandin (Max Burkholder) a young boy who seems to be the only person in the movie to have any sense of how wrong the purge really is and Zoey Sandin (Adelaide Kane) his older sister who plays your average teenage girl rebelling against her parents with an older man.There is very little character development in this movie at all many of the characters are not even given names and are merely there so that they can be killed off later. Just to give a quick overview of the movie once the purge commences Charlie sees a man outside the house looking for help and being the only character with any sense of right or wrong he brings down there security system to allow him inside. Once in the house the man disappears in the wake of all the chaos and the group hunting him soon come looking this group of psychos is lead by a character I have only seen called the  polite stranger (Rhys Wakefield, of Sanctum) he kindly tells James that either he supply the man they are looking for or they will be forced to break into the house and kill everyone inside his blend of complete insanity and yet polite discord was one of the highlights of the movie for me his character shows what I believe to be the truest effect of the purge which is the extermination of the lower class by the upper class through out the movie it is shown that those with money are completely unaffected by the purge unless they choose to participate.  In the end in true horror movie fashion mayhem and chaos follow with a lot of brutal deaths and stupid decisions made by underdeveloped characters and what was once a interesting concept starts to fall short. The movie ends up being your average summer horror movie if your are a big horror buff you could do worse than to go see it in the theater if your not a big time horror fan I would wait and give this a rent all though I am not not even sure you could call this a horror movie more of a thriller while there are some parts that could get a jump out of you it had more of an overall action movie to me than a true horror movie .\r Pros:\rPerformance by  Rhys Wakefield as the polite stranger was fantastic\rThe overall concept of the purge is still an interesting one there appear to be subtle political undertones throughout the movie\r Cons:\rUnderdeveloped characters\rPredictable ending (more on this in a minute)\rToo many unbelievable choices and scenarios"
    },
    {
      "rating": "4",
      "text": "This movie very predictable, for me anyways. The plot was okay, but the way they executed it could have been much better. This movie actually reminded me of the movie \"The Strangers.\" It had many strong points, but the ending sucked. It was more comical than horrific. I wanted so bad for someone to commit a crime after the 12th hour..."
    },
    {
      "rating": "3",
      "text": "This movie, concerns my self with great duplicity. A confusing story line, horrible scenarios, and blood thirsty laws. It was a quick sell, but left a horrible taste in my mouth nearly only 10 minutes of being introduced or as I felt involuntarily robbed of my precious time.\r I would rather Adam Sandler played the main role, because obviously a joke would make this script interact much more fluently. It would have been better, if the daughter of main character opened the door to her unsuspecting boyfriend, and the boyfriend had turned suicidal killer been a moment of zen.\r But no, it seems that between Coffey and toiletry's the real substance of this film was left in the tub with a dirty ring. Good movies leave room for sequels, and if you have a Nikon it doesn't man your blogger neither.\r Overall, the film sold me for the first 15 seconds, and than shoved, denial and words like durably down my throat, slowly churning its way down my amphibious gut which than bubbled up the regurgitation of a small picnic which in all totality should be a weeks worth.\r I'm ashamed I didn't remember the preview, obviously with enough sell out guides previews have now adays. I could negatively shriek intimate donkey spoil, on the mild manure pre-ordained growing lands over my spouted interest in good being well. The work put into this, would measure the time, and integrity required of a Home Depot employee that has better time to sort stock, than had prepped the future shed and kitchen display. Who deserves the credit for this Bull****?\r V/R\rDr Saint G"
    },
    {
      "rating": "3",
      "text": "The premise of the movie is a bit far-fetched, and the way it played out was lacking and tacky.\r For myself, it is always weird to see Ethan Hawke playing a character other than a rookie cop (as in Training Day).\r The plot was lacking on a lot of what I wanted to see, such as: the antagonist dying a more horrific and painful death, the main character rising from his injuries, racism towards the black intruder, and a resolution that was clear on how things would play out beyond the ending. I don't understand why the black homeless intruder left so easily. I was expecting him to get together with the wife and become part of the family. The movie is a senseless anecdote."
    },
    {
      "rating": "3",
      "text": "The Purge's premise is wasted here, it doesn't even need to exist. The Purge is just a cheap slasher horror movie and even bad at that. At no point in this film did I get scared, really I was just bored throughout  the  whole movie. Everyone in the movie does a good job but it just wasn't enough. This movie is extremely predictable. Overall I wouldn't recommend watching this movie."
    },
    {
      "rating": "3",
      "text": "The premise is interesting at the cost of being completely implausible and so, pointless. In fact, it doesn't even play a major factor in the subsequent home invasion film that relies on startling pop-ups to even come close to a scare..."
    },
    {
      "rating": "0",
      "text": "The only reason I would ever give this more than a 0 is the fact that the actors were decent and the idea was too. Super unrealistic and extremely predictable with ridiculously bloodthirsty characters.. In fact there are only about 5 people in the movie who are not trying to get this \"cleanse\" by killing other random people."
    },
    {
      "rating": "0",
      "text": "this flim is pure  bull ****  tries to take on serious issues but ****s itself and ends focusess on some douche bag getting inthe house .family  get thearten by bad guy they spend 20 minutes **** all .the movie is **** horrible  it was the worst movie ever .  the acting was so awful.  ethen hawke  was the worst actor in the film. the ending  was most awful  i have  ever seen  . this  film is'nt enjoible awful like event horison . it's   the one were you enjoy smashing it awful."
    },
    {
      "rating": "8",
      "text": "In my opinion, The Purge is the best home invasion movie ever made. It has such an original and thrilling plot compared to most horror movies these days. I really don't understand why most critics don't like this film. If you want to see this movie, see it and don't listen to the negative reviews because in my opinion they are all wrong. If you want thrills or if you want to be creeped out this is the movie for you. Warning: Spoilers!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I can't wait until The Purge 2!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "In my opinion, The Purge was an.... entertaining movie. I can't deny that it did keep me on edge. To my relief, it wasn't very scary either. It was more interesting and intense. The plot is very original, and it will definitely keep you entertained. Although it was a good movie, it was not great. I cannot stress how idiotic and stupid the family was enough. I found myself constantly realizing how fake the movie was. The actors didn't seem scared enough. Also, they kept making mistakes throughout the movie even though they knew that their lives were on the line!  It was also really annoying how the killers tried to have a sense of humor. The killers seemed psychotic and creepy. The ending was really crazy too. The ending was awkward, funny, idiotic, surprising, and just interesting. On the other hand though, I liked the movie, but I wouldn't spend a lot to see it. Wait for it to come out and get it from the red box. It is very interesting, and even though it might not be your favorite movie, you will have something to enjoy from it."
    },
    {
      "rating": "0",
      "text": "\"There’s something powerful in the way horror movies and thrillers are able to tap into the cultural fears of a given moment. Whether it’s the sexual politics of the 1980s slasher movie, or the torture porn explosion in the wake of the US wars in Iraq and Afghanistan, no other genre is so adept at saying, “Here’s what's on our minds right now, and it’s scaring the hell out of us.” Agree!"
    },
    {
      "rating": "5",
      "text": "From the producers of Paranormal Activity (as is all horror films these days) The Purge tells the story of a near future were crime is at an all time low and unemployment stands at under 1% of the US population, to compensate for one night a year all crime (including murder) is legal for 12 hours allowing society some kind of release.\r The film revolves around the Sandin family who are confronted by a group of college students hunting a man on the night of the Purge who the family had allowed into their home after lockdown. The Purgers (lead by Rhys Wakefield) drastically try to break into the family’s home causing James (Ethan Hawke) and Mary (Lena Headey) to protect their children from the invaders in order to survive the night.\r The main problem with the film is the premise itself, whilst interesting is filled with flaws and holes that just make the whole idea ridiculous. Such as what happens to the serial killers and career criminals of this world? Do they just control their urges to kill or steal for the other 364 days until the next Purge, as well what if someone has a heart attack on the night of The Purge? Is it just a case of bad luck you chose the wrong night to need medical care?\rDespite the flaws of the premise, the film repeatedly ignores the possibilities of the premise, instead of exploring the ideas behind the Purge or the events that occur on the night of the Purge from different perspectives and situations. Instead the film settles for a typical home invasion story that although done well, is nothing we haven’t seen done in many other films. The Purge in the end seems to only be the premise of this film to stop the age old question of “Why don’t they just call the police?” in home invasion films.\r To the films credit it is quite subtle, there’s a running theme that the Purge is just an excuse for the upper classes to exterminate the poor, driven by all the attackers wearing prep school blazers and the person they are chasing wearing dog tags around his neck. The film also contains some strong performances, especially from Ethan Hawke (Training Day, Lord of War) and Lena Headey (Dredd, Game of Thrones) who carry the film throughout. The film also has a twist near the end which allows the audience to get inside the heads of the people during this night.\r That cant be said for the leader of the Purger’s played by Rhys Wakefield (Sanctum, Home and Away)whose performance is slightly cringe worthy, hes trying to be psychotic yet in control of the proceedings but it just comes across as a amateur dramatics’ version of The Joker. He just never seems like a really threat and just a creepy next door neighbour.\r The film also contains some bizarre and just plain weird set pieces, such as the families’ son who builds a spy camera on a chard baby doll on the top of a rhino tank from Warhammer 40,000. The thing looks like a demented contraption from Sid’s bedroom in Toy Story.\r Overall, The Purge is an ok home invasion film, there are moments of suspense and a couple of jump scares are effective. The wasted potential of the premise is the films main downfall which could have lead to a more effective and possible original film then what we got in the end."
    },
    {
      "rating": "7",
      "text": "The movie was great. I loved it. I really keeps you on your feet the movie but the movie is very short. But I would recommend seeing it. It's a whole new paradigm. The movie has a bit of that horror feeling and jumps but it won't leave you with nightmares but only the illusion that keeps you wondering...could this ever happen.??"
    },
    {
      "rating": "0",
      "text": "HORRIBLE HORRIBLE HORRIBLE HORRIBLE. The movie plot and story is not well thought and very bad. COMPLETELY predictable it leaves nothing to surprise there is just no point. I feel like taking a lesson from southpark and going to the directors and getting paid for watching this movie."
    },
    {
      "rating": "10",
      "text": "I don't feel that the low user score is warranted. The movie deserves an 8/10 for originality alone. A great concept with some really quality acting, I thoroughly enjoyed this movie which leans more towards the more extreme portions of the human condition but is nonetheless a thoroughly entertaining flick (unless you're a pacifist or bleeding heart liberal) which is certainly worth a watch"
    },
    {
      "rating": "7",
      "text": "The movie is a breathe of fresh air with a new idea which is out of the ordinary for Hollywood now a days and welcomed by the audience. The story moves at a relativity adequate pace without to much being tied down in a romance story that holds a lot of movies in this class. The movie only slows down and even gets lackluster in the end. The stories conclusion is very simple and easily seen coming even minutes into the open. The simple write can draw in those who are new to cinema but those who have seen a few thrillers will not be impressed or shocked by the ending and even disappointed that they chose such a pedestrian reason for such a great stories conclusion."
    },
    {
      "rating": "0",
      "text": "This movie is terrible. The story, the background, the whole script is a mess. I believe that this flick is racist to an utter extent, the mere title says it all. The plot has no foundation, it lacks everything that is expected from a thriller, you barely get in touch with each character that englobes the directors message to the expectator. Lacks details that may had placed them on a score of 1. And my review ends with one question to the director, Why do you believe that the poor and the minority in 2022 are the Afro-americans?."
    }
  ]
}