{"id": 3263, "title": "The Illusionist", "starring": ["Edward Norton", "Paul Giamatti"], "runtime": 110, "genre": ["Fantasy", "Drama", "Thriller", "Romance"], "description": "With his eye on a lovely aristocrat, a gifted illusionist named Eisenheim uses his powers to win her away from her betrothed, a crown prince. But Eisenheim's scheme creates tumult within the monarchy and ignites the suspicion of a dogged inspector.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/4I1oOPHNrHLcvz3wTMuETJLws9z.jpg", "categories": {"plot": 5.45, "acting": 7.318181818181818, "ending": 7.875, "soundtrack": 9.0, "cinematography": 3.5, "familyFriendly": 6.0, "funny": 7.714285714285714, "action": 5.0}, "reviews": [{"rating": "10", "text": "Awesome. Great plot, great acting. This is sort of steampunk-like movies (like Sleepy Hollow). Plot takes you from the beginning till the end, I dont want to spoil, but at the end of the movie I has the same face as of Paul Giamatti ))\rJessica Bil is very cute!"}, {"rating": "5", "text": "Looks great, but the pay-off at the end isn't big enough to justify the rest of the film. Leaves you with a \"oh... and?\" feeling."}, {"rating": "4", "text": "The Illusionist is just like the worst kind of magic act. Far from being incompetent, it puts on quite a show, but never instills you with a sense of wonder, empty as it is below the surface. The cast, who look pretty good on paper, are largely wasted, with Edward Norton being up-staged by his own beard playing Eisenheim the Illusionist, and Jessica Biel being bland and utterly forgettable as love interest Duchess Sophie von Teschen. Even the usually brilliant Eddie Marsan makes little impact, as his character, Eisenheim's manager is under-used and has very little to do. Thank goodness the film also stars Paul Giamatti, who imbues his character of Inspector Uhl with a pleasing sincerity and complex morality, and tries his very best to elevate the film's rather clunky script, and Rufus Sewell, who makes a very entertaining, menacing antagonist as the scheming Crown Prince Leopold. The film is very visually impressive, with striking cinematography and high-quality production design with some pleasing period details. Philip Glass's moody soundrack is also rather effective in maintaining a consistent tone throughout the film. Despite these positives, the Illusionist has a disappointing amount of negative counter-points. A film can be as pretty as atmospheric as you like, but when the story is dull (and by jingo, The Illusionist's is boring) and the characters unengaging, its impact, and ultimately its enjoyability is limited. I found myself comparing the film to other, better examples of its type. The Illusionist lacks the sheer beauty, playfulness and soul of Sylvain Chomet's animation of the same name, and the intricate plotting and pure entertainment value of The Prestige. It's just not particularly interesting or memorable, and is disappointingly unmagical. The Illusionist may look the part, and Giamatti and Sewell put on quite a show, but ultimately the sub-par script, underwhelming characterisation and uninvolving story threatens to ruin the film, and alarmingly often, it does. There's no fooling the audience here, the film just isn't magic."}, {"rating": "6", "text": "The Illusionist suffers from coming out around the same time as The Prestige (a far better movie in comparison) and a poor story line. Has anyone ever given you the \"OMG\" look because you haven't seen the Illusionist ?"}, {"rating": "6", "text": "Honestly, Idon't know how to express the feeling I got after I saw it. I went to the movies to watch it, and it looked so interesting that I had expectations; yet, well...I didn't get the 'wow' feeling. I perhaps should watch it again...should I? don't even remember the ending. Does that say something about how interesting it was? I guess so. I will say a 6...? I may go and watch it again! I don't want to be unfair, and I am curious to see how I feel about it this time. So far, just a 6."}, {"rating": "10", "text": "There's a great atmosphere and a surprising end - at least the first time you see it. It's now the third time and still I'm fascinated by the strong role playing. It's a love story - yes - but more than this it's a strategic careful consideration of a magician to play with emotions and to provide hints. At the end also the chief inspector cannot avoid to laugh about these cleverness - he feel sympathy for Eisenheim the whole time..."}, {"rating": "8", "text": "Yes, The Illusionist is not very believable, however, that does not mean it does not allow you to suspend what you know to be true for the two hour spectacle, just as in Eisenheim's performances. Edward Norton shines as always in the lead role and is central to mystical and magical nature of the film that makes it so enjoyable."}, {"rating": "5", "text": "I'm don't know what to say. This movie is not either bad or good. It's just so unfinished. Could be a lot better! 5/10 is my score, very boring and decent movie."}, {"rating": "5", "text": "Maybe I'm biased seeing as I saw the Illusionist after the Prestige, and yes, the two films are alike enough to be compared to one another. Whereas the Prestige seemed like something different, this film felt like a copy. E Norton was good, but P Giamatti stole the show here. it's a shame, coz it actually had a good twist at the end"}, {"rating": "6", "text": "The Illusionist shows off its tricks.\rThe Illusionist initially has eye popping appeal with a cast of great actors. The premise itself is as mysterious as it sounds, and the result it a fine movie. It suffers though with a lack of explanation for blatant phenomenon's it preforms and then ignores."}, {"rating": "8", "text": "Im a big fan of Norton, and this movie was enjoyable, but if we were supposed to believe that he was capable of this sort of illusion, then that is what sat wrong with me. Not even close to being feasible."}, {"rating": "10", "text": "A great movie, I loved the twist right at the end. The entire movie was brilliant from the cast, costume, and story. It got me interested in illusionists now - I would love to see a live show."}, {"rating": "7", "text": "Not as good as The Prestige, but a brilliant movie nonetheless. I really enjoyed this one, especially how he always has you wondering whether the magic is real, or just a trick"}, {"rating": "0", "text": "Could have build up the character of Crown Prince establishing him as a\rcruel person.....there isn't even one scene at least to establish\rthat....He didn't seem to me as a Villain.....Actually I felt sorry for\rhim being failed by his man, the foolish chief inspector.....And for\rthe surprise element its easy for any film buff to guess that she\r(Biel) was not actually murdered at that night....and from there it is\rjust impatient watch till the climax....which ends making us (atleast\rpeople like me) feeling sorry for the Prince and I just couldn't watch\rthat foolish Inspector laughing for being fooled and lost the Prince\rwith his incapacity. And there's one question - Since she is a Duchess\rthe royal families must have attended her funeral.....And if there\risn't any funeral and they haven't attended then she must be alive\rsomewhere else.....Steven Millhauser..."}, {"rating": "9", "text": "I'm very biased towards Norton because I love every role I've ever seen him in. And the crazy thing about this movie is that I myself was tricked by the illusion that he wasn't acting as well as I'm used to seeing him. Instead, I get to the end of the movie and realize he wasn't acting for the audience, he was acting for the other characters in the movie. It's like you can see everything coming and think your not fooled and once the ending sequence hits, you immediately realize you were duped. Great acting by all and anyone who doesn't like this movie needs to go back and watch again and realize why its as good as it is and why anything Norton has the Midas touch."}, {"rating": "2", "text": "First, to introduce myself - I adored The Age Of Innocence but disliked Pride and Prejudice. The Illusionist is a total bore - from beginning to end. The film is based on a short story. The problem is there is only enough real content for a short film - the rest of the film is filler. And the short story is not special. You've seen the basic story before and done much better. The casting is atrocious. Almost all the actors were chosen for star power rather than talent. They are all supposed to be Austrian. But the top three characters seemed like Americans with fake accents. I've realized it is quite hard to make a good film and it is entirely possible to not want to see any movie currently in release. When that happens, rent an old classic or do something else. But don't waste your money on a weak film."}, {"rating": "7", "text": "\"The Illusionist\" cheats a little. Without giving away anything, what actually transpires at the end seems contrary to what is being set up because the special effects are too good. In the third act, a crucial bit of information that goes unsaid feels like a contrivance to extend the film's running time since it would've facilitated the same end result anyway. If the film went in another direction, it would've emboldened the creepy atmospherics of the illusionist's stage show. Since \"The Illusionist\" goes for the too happy ending, the filmmaker undermined the strongest part of his film. Still, it's a film worth seeing in spite of being burdened by the star-crossed lovers ordeal, and the duel of elaborate facial hair presentation between Edward Norton and Paul Giamatti."}, {"rating": "10", "text": "This is one or the most entertaining films I've seen in years."}, {"rating": "9", "text": "Actually I would have given this movie an 8.5 maybe even an 8.8 but this rating system will not let us be that refined. I would have given this movie a straight up 9 even a 9.5 and potentially a 10 if it weren't for a few factors. The first and less important is the film had the illussion of being a bit short. [***SPOILERS***]There was no time revealed between Eisenheims childhood romance and 15 tears later when he comes back to Vienna. I could have lived with this as revealing too much spoils the illusion hence is no fun. However my second point is where I have a much more valid issue.  I was happy and yet disappointed at the same time by the end of the movie. I was happy that like some artistic movies that end on a downer this one didn't. The world is full of unhappy endings, and as a vast general I don't go to the movies to get reminded of it. So a happy ending with Jessica Biel is an ultra plus in my book. But here comes the prestige of my argument is that at the end of the movie it is all but revealed how he preformed his illusion to fool the Prince and his cronies thereby gaining his childhood love. I think it would have been much more powerful if it was not revealed and it left the audience wondering was the magic real of was it just an illusion. I guess this is why they call it the illusionist but isn"}, {"rating": "6", "text": "It wasn't the best movie I've ever seen but it was entertaining enough to watch. The ending was predictable like most movies nowadays. The guy was an illusionist so how else could it have ended?"}, {"rating": "9", "text": "A movie that is what movies should be. Norton and Giamatti are wonderful as always, and Jessica Biel shows surprising talent in a role many actresses would have sleepwalked through."}, {"rating": "10", "text": "This is incredible. Norton, Giamatti and Beil shine in a superb film."}, {"rating": "9", "text": "Magical! One of the best of the year so far."}, {"rating": "10", "text": "I was lucky enough to see this film a little more than six months ago at an advance screening. I -- and the entire audience -- was mesmerized. I'm glad to see that it's finally been released and that the overall reaction to it is as favorable as it has been. I know when my husband and I saw it we walked out of the theater completely impressed by the story, the cast, and the overall production values of this film. It's a little gem."}, {"rating": "9", "text": "Wonderful from start to finish. Nothing fake here, worth the price just to watch Giamatti's expressions and his reaction to the denouement."}, {"rating": "10", "text": "It's been awhile since Hollywood has produced such an intelligent film. Paul Giamatti was superb and Ed Horton believable. The twist at the end was the icing on the cake. Bravo!!"}, {"rating": "9", "text": "I saw this with my main squeeze Carol Ann. We both loved it. The acting is first rate and the story was great. The only negative was at the end it would have been fun to see how everything was really done. Well, we all know about CGI but I mean it would have been neat to see a little more detail. Great movie anyway. Go see and enjoy."}, {"rating": "9", "text": "A beautiful movie. I love it when hollywood gets off its butt and does something original, dramatic, and tells a good story. It has a mystery novel feel about it. Acting is great all around."}, {"rating": "10", "text": "This is a great movie from beginning to end. It will definitely be a nominee in next year's Oscars."}, {"rating": "7", "text": "Attention holding and beautifully designed. This film suceeds in maintaining its mystery to the very end."}, {"rating": "10", "text": "This movie has stayed with me for three days. It's been years since that happened."}, {"rating": "9", "text": "A wonderful period piece, well acted and directed. Edward Norton is spellbinding in the lead role, but Paul Giamatti steals the movie....but what else is new??"}, {"rating": "10", "text": "I haven't seen a better film in years. If you're into magic/fantasy/cinematography/great acting/an actual plot/and human characters, go for a wonderful experience. I saw it in a nice, new theater, and I'm glad I did."}, {"rating": "10", "text": "My interest in the film grew as it went along; by the end I was hooked. Of course, it was easy to guess going in that the film would end in some kind of \"illusion,\" but getting there was fascinating. One measure of a film is whether viewers discuss it afterward. We did extensiviely and agreed that we would have to see it again (on DVD) to catch all the illusions. Norton and Giamatti were terrific."}, {"rating": "8", "text": "Those who want to try to pidgeon hole this as a murder mystery have totally missed the point. In reality it is a touching romance, but without any of the pretensious slushiness that makes most unwatchable. This was a real surprise to me - excellent acting, Paul Giamatti excellent as always and no attempt by the 'stars' Jessica Biel and Ed Norton top steal the show by making more of their characters than they actually are. OK, the twist may be a little obvious, but for todays savvy audiences who almost expect it anyway this shouldn't be a surprise. The only real shocker here is how little coverage this moving has received."}, {"rating": "7", "text": "Not really understand how this movie is better than The Prestige..In deed, a good story and even a better ending. I was thinking about this end though , but quite remarkable. Still not having the depth and intensity of The Prestige, nor the interpretation of the actors rise to one from The Prestige. A good movie, but not one to be seen again, and again..."}, {"rating": "7", "text": "(7.5) I like Edward Norton, and I like English accents. I do not like Edward Norton's English accent. Reminds me of Jude Law's American accent in I Heart Huckabee's (especially put up against Naomi Watts' American accent, which is better than mine, and I live here). Giamatti is at his bearded, bug-eyed best, and retains his position as my second-favorite heir to character genius Martin Balsam. (Bill Macy being number one). The movie's not earth-shattering, but pretty and just smart enough to leave you with no regrets."}, {"rating": "10", "text": "This was one of the best movies I have seen in some time. I see the voting is all over the board. Yes, if you think too hard, you will come to the conclusion, the conclusions relied on for the \"hoax\" to come together is a reach, and you can complain (like so many in the movie) they wanted explanations to the illusions, but as any good magician knows, don't give up the secrets, it adds to their effect, and so be it in a magician's movie. The book of directions for the orange tree at the end tell us they affirm to all that they were just illusions after all. If you have a week romantic side, and just want to be entertained, this is a great movie. Much better than the other similar movies that have all seemed to hit recently. I liked the small shack at the end as well. Proof they had no quest for material things, just themselves."}, {"rating": "8", "text": "The entire leading cast does an amazing job, just as Norton and Giamatti always do. The shooting, lighting, and visual effects are perfect, led by some amazing magic scenes. The plot takes the viewer to some amazing places, but the ending sequence really ruins the magic."}, {"rating": "4", "text": "A wasted opportunity. It was a beautiful portrait that had drained the life out of its subject. The writing was flat, uninspired and lacked depth. I do not mind that the twist was apparent early on, but apart from narrative revelation there was nothing else for the mind to feed on. There was no real passion or magnetism to the characters, no depth to their behaviour. A tale about an illusiionist and a prince could have offered some insight into perception, the human capacity for delusion and the artifice of social hierarchy, but this tale was purely confectionary. Furthermore, it suffered from a Philip Glass score. This kind of score is insistent in its repitition, it does not vary in its constitution, it merely pauses to breathe. It is perfect for montage movies (see The Hours, Notes on a Scandal). Time passes, scenes change, but the score remains the same. It may smooth over rough edges in a film but it sucks away individual scene vitality, in favour of an overall drab consistency. It is a sure sign that a director is not doing his job. Nice lighting by Dick Pope though."}, {"rating": "3", "text": "C'mon Len H. Dont make excuses for the movie. \"If you have a week romantic side... this is a great movie\" ??? I dont think the romantics went to watch this movie. It failed... it built up a tremendous plot, but only managed to blow hot air in the end. Its a cop out. .... The unpredictability was in its predictability.... plus its outrageous ending and wind up. Its easy to come up with a thriller if you dont plan to reveal the answers. So what's with the butterflies... and what's with the orange tree coming to life (the picture showed mechanical instrument underneath the pot --- give me a break...) If you're into credibility of a storyline first and foremost... this one is no good. If you care about all the other stuff mentioned here, how great the cinematography or lighting is... then go for it."}, {"rating": "10", "text": "Beautiful cinematography, wonderful acting, and a delightful, atmospheric splendor of a movie; a romance in full bloom. I was enchanted and it's a movie that I will not forget too soon. There's no illusion here. This is the real deal."}, {"rating": "10", "text": "There's one word that can describe this film, pure genius! this amazing period piece mystery stars Edward Norton as Eisenheim a traveling Illusionist who while doing a show in Vienna meets up with an old childhood sweetheart Sophie, she is know the fiancee of the crowned prince Leopold. The illusionist is a lavish film that is bathed in dark tones, and amazing cinematography. This film is much different them the Prestige a movie that came out in the exact same year, the Prestige deals with the three rules of a magician. While the illusionist doesn't it deals with mystery ,murder & deception. And it blends perfectly into such a way that this film will leave you absolutely stumped until the very end ( and I mean the very end!) Edward Norton turns in an oscar worthy performance as a mysterious traveling magician, and Paul Giamatti(also exceptional) proves he's just as good as the rest. This movie is one that you can enjoy over and over again, and no mater how many times you see it you still be in awe of the vast beauty of it all."}, {"rating": "9", "text": "Everything clicked and came together beautifully -- the acting, film sets, music (Philip Glass), photography, and even the fairy-tale-like ending. Excellent."}, {"rating": "7", "text": "I thought this was very good, into it shot itself in the foot at the end, with a twist ending that felt pedestrian, and haphazardly tacked on. Just because it went along with the theme of the movie (a trick ending, for a movie about someone who performs tricks) isn't enough to make it clever."}, {"rating": "10", "text": "Easily one of the best films I've seen all year. It's beautiful and romantic and intriguing all at once. Like a great magic show it sucks you in and makes you believe."}, {"rating": "10", "text": "This movie was truly amazing. I was on the edge of my seat and completely entranced the whole way through."}, {"rating": "9", "text": "Loved it for the most part but there were some scenes where the dialogue might have expanded and given rise to sharper drama and conflict--yes, *passion* in every sense. Sometimes Eisenheim (Norton) was a little too controlled as were his reunion conversations with his long lost love. I would have enjoyed a stronger show of distress from him. Other than that, great storytelling, pacing, structure and costumes. [***SPOILERS***] A wonderful mystery, complete with ghosts!"}, {"rating": "9", "text": "A classic romance. Well written, albeit with a few holes in the conceit. The acting was enormously strong, which is no surprise from the likes of Edward Norton or Paul Giamatti. However, Jessica Biel's strong performance was a revelation. I found myself smiling like a fool at the very end, but I won't give away the secret why..."}, {"rating": "10", "text": "One of the year's best- i do not understand why it has not been better promoted. Great acting by all of the leads, visually stunning."}], "recommendations": ["the_prestige", "maleficent", "alice_through_the_looking_glass", "eternals", "snow_white_and_the_huntsman", "now_you_see_me", "shutter_island", "atonement", "hugo", "the_lovely_bones", "glass", "tomorrowland", "the_usual_suspects", "the_lucky_one", "fantastic_beasts_the_secrets_of_dumbledore", "maleficent_mistress_of_evil", "magnolia", "gone_girl", "oz_the_great_and_powerful", "stardust", "fantastic_beasts_the_crimes_of_grindelwald", "changeling", "super_8", "uncut_gems", "reminiscence"]}