{"id": 2575, "title": "The DUFF", "starring": ["Mae Whitman", "Robbie Amell"], "runtime": 100, "genre": ["Romance", "Comedy"], "description": "Bianca's universe turns upside down when she learns that her high school refers to her as a ‘DUFF' (Designated Ugly Fat Friend). Hoping to erase that label, she enlists the help of a charming jock and her favorite teacher. Together they'll face the school's mean girl and remind everyone that we are all someone's DUFF… and that's totally fine.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nfad87VEmIHUf7LM2sl5RxDQzUS.jpg", "categories": {"plot": 5.916666666666667, "acting": 6.5625, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.631578947368421, "action": 5.25}, "reviews": [{"rating": "5", "text": "It's genial and means well - and it's LEAGUES better than Hot Tub Time Machine 2 - but it lacks a bit of puch that similar movies like 10 Things I Hate About You have. The bad **** isn't bad enough.  The \"good\" cool guy stays the same throughout the movie.  And the lead just isn't quite dynamic enough.  However, the two leads are extremely likable, and it's fun to root for them."}, {"rating": "5", "text": "The movie is preachy and predictable but at times came across genuine among the two lead actors. The DUFF is basically Mean Girls 3, only not as funny."}, {"rating": "5", "text": "Another Mean girls movie. Between good and bad. A movie for teenagers, school and bullying lovers. I wish thins kind of movie wasn't so superficial, take things into a deeper level of thinking and making conscience about bullying and teenagers ideas and real living in school would make me rate it better."}, {"rating": "10", "text": "This movie was outstanding. It teaches young adults to not try to change who they are and be themselves.Sadly, I didn't see the turnout i was hoping for of the amount of people but it was a very good Movie. 10/10"}, {"rating": "9", "text": "The DUFF is something clearly not made for people like me. I am looking for comedy without borders, but DUFF keeps it in the borders, when I look for acting, I find Bella Thorne, which is really not amusing. But, it was fresh, original and admittedly, funny. This is a film that climbes up the ladder of High School dramedies and becomes a total king of them. The dialogue is sharp and brilliantly written, while the starpower make for some interesting acting skills. The DUFF is a witty film, that is funny enough to hold your attention."}, {"rating": "4", "text": "I had to choose between an action movie and this one, i wish i had chosen the former. The Duff turned out to be a teen comedy, so if you're 17 and below, this movie is for you. Felt like watching 2 episode of a disney channel series. The story is fun but childish, it's about a high-school girl who discovers that she's the designated ugly fat friend (duff) and wants to change that and un-duff herself. cool"}, {"rating": "8", "text": "I got sorta dragged into seeing this, and guess I was expecting more of a straight up comedy. I got a lot more than I had hoped. The movie was really funny; it had a bunch of scenes where I laughed hard. This really worked so well mostly because of Mae Whitman, who plays \"the DUFF\". She's a great actress, and she acts like any normal teenager would with just a slight awkwardness and a lot of sarcasm and heart. The movie even slips in some lessons on cyberbullying and just being yourself, but it's never preachy about it. The morals are worked in smoothly. It's definitely a huge surprise to me that I liked The DUFF so much, and I would recommend this to all of you."}, {"rating": "8", "text": "This movie is a coming of age movie, witch means it was made for high schools in mind. This movie was fun and interesting. It showed how high school really works in today's society."}, {"rating": "6", "text": "The DUFF is quite entertaining and has a really nice poignant message. The film captures life, I mean the characters, and I'm mostly refering to Wesley (Robbie Amell) and Bianca (Mae Whitman), are realistic, humanized. I got a weird sense that I was watching people I knew and not a stereotypical film version of them. The movie has that documentary feel to it and it's due to how the leads portrayed their characters and how easy it is to relate to them.\r The only real disappointment I have with the movie is that I thought it would be funnier. It's still a comedy but it's a little more serious than I expected. Watching the trailer I thought that I would laugh a hell of a lot more, specially when you look at the established comedic cast in it. Whitman and Amell do have good comedic timing and The DUFF is fairly funny but the quality of the jokes are not as high as I hopped they would be.\r The story is intelligent, insightful, and kind of funny but it's still very predictable. The DUFF is on the edge of being great but it’s not.\r @wornoutspines"}, {"rating": "8", "text": "I am always hesitant to go see Teen Movies these days as few are like the greats I grew up with, such as The Breakfast Club, Ferris Bueller's Day Off, Don't Tell Mom the Baby Sitter's Dead, Weird Science, 16 Candles, and so on!!  The main reason I went to see this one is I loved Mae Whitman in \"Parenthood\" as I think she is a great little actress, and bingo I guessed right as she pulls this movie off in a grand way.  Actually it is well written minus all the stupid humor injected unnecessarily, does have some meaning to it for either if you are old or young, and Mae's supporting cast does a good job as the glue to make it all fit.  There is humor, humor that made me laugh, but humor that wasn't over the top!!  This I think this should be added to the list of great teen movies.  Well done Bravo Ari Sandel who is the director, hope we get to see more from you in the future as you got this one right!!  Thanks for all your effort and again well done!!  Was an enjoyable evening at the movies."}, {"rating": "9", "text": "I wasn't expecting much from this film, as it appeared to be a retelling of yet another 'victimized teen' drama, but with a modern 'update' via the latest technological weapons of social assault.  What I witnessed was a deeply moving, funny, creative, instant classic.  Mae Whitman was absolutely FANTASTIC !!!"}, {"rating": "7", "text": "It's not about a GEEK, but somebody's DUFF.\r Yet, another movie about an intelligent high school teen girl who socially unfit among others. After realising her issue, she fights back to regain what she was missing. This type of concept is extremely common, but initiating a fresh idea on where the narration can develop the plots and finishes off high note is the vital for a movie's success. This film had one of that and that is called the DUFF. You can find out what that stands for in its official posters.\r The movie was above the average. The characters were great, but not the unique ones. Everything was enjoyable, I mean it was not a usual annoying teen movie. Well directed because he got a good screenplay that extracted from the book of the same name. The cast was good, nice performances and so it is official that Bella Thorne classified for those mean girl roles.\r Anyway the main character Bianca was so good. Whitman was too old for the role, but outclassed it. Carefully handled to get under the PG13, and it succeeds. So kids with the matured minds are pretty much allowed to watch it and I don't see any serious offensive to keep them away other than facts the film talks about. Overall a nice watch for sure.\r 6.5/10"}, {"rating": "6", "text": "Was surprised by this one. A meaty performance from Mae Whitman pushes this past regular teen fodder into a fresh comedic space, even if the ending is predictable."}, {"rating": "8", "text": "The Duff chick flick movie, is something that  teenagers can relate, and some just eh not so so much. I am a dude so i can not relate to this **** and \"the popular girl,\" Bella Thorne her acting skills is not that well done she has no place to be in Hollywood. There is some mean spirited humor, but even though it does get hilarious. Grade C+"}, {"rating": "7", "text": "The Duff is a strong teen movie, that was kind of unexpected. Mae Whitman has a great performance in this film which is unexpected for her first major leading role. We end up cheering for her throughout the film like an underdog sports team. She's not necessarily that funny all the time but she does draw you in. Robbie Amell was also really good which we doesn't always expect from the good looking love interest guy. This film conquers some teen issues that are apparent in high schools today and I'm sure a lot of young adults will be able to make connections to this movie and that will be what makes it special."}, {"rating": "8", "text": "Very cute. Typical ending but does convey a positive message. Light hearted comedy.\rConsidering i loved the main character in parenthood i was expecting alot. It did remind me of a tv show called lizzy miguire because if the effects. But i did enjoy it. A nice family movie\r."}, {"rating": "8", "text": "I hadn't even heard of this film until my mate asked me to go and see it ! I was thinking ohhhh this will be okishhhh I presume .... Well I have not laughed out loud that much for a long time.... It was very cheesy in parts but what can you expect for a high school American film , it's to be expected. This makes people see that bullying isn't nice and it hurts people's feelings, it only makes the people doing it look more insecure . Brilliant film !"}, {"rating": "9", "text": "Great movie with a powerful message. For a dramedy, it wasn't that funny, just entertaining. Also amazing performances by pretty much everybody. I wish they keep on making movies like this aimed toward teens."}, {"rating": "10", "text": "Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo. Filme divertido. Gosto muito mesmo."}, {"rating": "9", "text": "I really enjoyed this movie. made me laugh quite a bit. It was predictable, not much new, but still good and we'll acted! :) Love the cast of this film the most, probably what made me like it so much."}, {"rating": "10", "text": "Some of the best movies in my opinion sometimes get some of the worst reviews. The movie the Duff is given some of the worst reviews for the movie. One of them says that it has a draggy tone. In my opinion the Duff shows the mindset of a teenage female in high school. Me and Bianca are so similar yet so different. We both are considered fat, but we do not have the same wideness. We also have a difficulty getting a boyfriend, or having a boy like us. Another bad review for this wonderful movie is that someone called it exceptionally Dumb. Even though it is supposed to be like the book but it is not like it really that much. In the end of both of them she ends up getting the womanizer/playboy Wesley Rush. In the end of the year i will probably not have a boyfriend like Bianca.\r Like most teenage movies that involve boys and other junk that actually happened in real life, this talks about how she uses Wesley the playboy as a distraction from how horrible how her life is. In a stark contrast from the book her mom is the alcoholic in the movie, and in the book her dad is the alcoholic. The DUFF which is an acronym for The Designated Ugly Fat Friend. Everyone is a DUFF in their own special way, like who ever reads this review for the DUFF you are a DUFF, so is the other person. This movie is based on the Author of the book’s real life. Kody Keplinger, She is such an amazing author and she has 6 other books. If you really want a good movie watch this movie. It is rated Pg-13 so do not let your young ones watch it without having you around or if your teenagers want to watch this teenage drama movie than this is the movie for them. :) ;)"}, {"rating": "5", "text": "Enjoyable, but overall very predictable. I still recommend it to all teens out there looking for a movie - it deserves a watch. But i'm giving it a 5/10 because it was a decent movie for me and i can't tell if you'll like it or not."}, {"rating": "6", "text": "This movie stars a bunch of talented young Hollywood types that do a fairly good job, but for me it came across as an upscale Nickelodeon special. Not my cup of tea."}, {"rating": "8", "text": "The movie may have some snappy, modern dialogue that young people will get a kick out of, but it's the film's incredibly charming leads that make it entertaining.\r Watch this movie online http://www.watchfree.to/watch-2a1b22-The-DUFF-movie-online-free-putlocker.html"}, {"rating": "5", "text": "WHAT I LIKED: For a movie to just while away a couple of hours - you could do much worse than 'The Duff.' There's just enough fun humour, character development and good acting to keep you engaged - it's just a bit of fun that carries a slight whiff of serious theme and relationship development to carry you along.\rWHAT I DIDN'T LIKE: Overall, it's by no means the most exciting, funny or interesting film out there by any stretch of the imagination. It's plot is unbelievably one dimensional and cliched, and the ending is horrible - but these are all things which won't really affect you if you don't get too into it (which I certainly didn't)\rVERDICT: You can have a bit of fun with this movie, but you'll forget about it as soon as you've seen it. 'The Duff' is a thoroughly average teen flick with little exciting to offer."}, {"rating": "5", "text": "Completely generic and full of clichés, how many times have we not seen this story? The thing that distinguishes and saves the movie a little more is the nice performance of its protagonist, Mae Whitman.Honestly the film does not expose anything new but is a pleasant comedy for a weekend."}, {"rating": "1", "text": "The whole movie is cliche and it didn't even work like a teen comedy - there are good ones and this is far away from good. It wasn't funny, but not serious too. The main character was somehow charming, but the movie was still dumb."}, {"rating": "8", "text": "\"El último baile\" titulado así en España, es una película de \"amor\" y comedia, bastante entretenida y sincera consigo misma, no busca ser mas de lo que es, un filme de amor no correspondido. Bien actuada, le pongo un 8 sobre 10. Mi vigesimotercera crítica u/o review de la sección de Movies."}, {"rating": "5", "text": "Honestly this movie is fine, but nothing better nothing worse. A lot of the dialog felt really dated and cringy, and the actors looked nothing like teenagers. And I get that it is better to use older actors, but these people looked like they were 30 not 17. I would say that anyone who wanted to watch this movie could probably consume the same quality media by reading a sub-par teen romcom on wattpad."}], "recommendations": ["17_again", "mean_girls", "easy_a", "booksmart", "goosebumps", "clueless", "the_cobbler", "bedtime_stories", "herbie_fully_loaded", "shazam", "my_spy", "10_things_i_hate_about_you", "the_change_up", "the_babysitter", "cloudy_with_a_chance_of_meatballs", "the_pacifier", "no_strings_attached", "the_croods_a_new_age", "the_green_hornet", "how_to_be_single", "minions", "alvin_and_the_chipmunks_the_squeakquel", "knocked_up", "alvin_and_the_chipmunks_chipwrecked", "diary_of_a_wimpy_kid_the_long_haul"]}