{
  "id": 2112,
  "title": "The Exorcist III",
  "starring": [
    "George C. Scott",
    "Ed Flanders"
  ],
  "runtime": 110,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "Fifteen years after the original film, the philosophical Lieutenant William F. Kinderman is investigating a baffling series of murders on Georgetown that all contain the hallmarks of The Gemini, a deceased serial killer. His investigation eventually leads him to a catatonic patient in a psychiatric hospital who has recently started to speak, claiming he is The Gemini and detailing the murders, but bears a striking resemblance to Father Damien Karras.",
  "releaseYear": "1990",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bl6nSPcyqz6xD2Igd2VQvz8qWo0.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "To me, The Exorcist III is a nice mysterious horror flick with many nice scary moments."
    },
    {
      "rating": "8",
      "text": "La única y mejor secuela de la saga, aún si se tratara de una película aparte, se sostiene perfectamente por sí sola, buenas actuaciones, buena historia y pese a que es más Thriller que Terror, logra tener momentos aterradores."
    },
    {
      "rating": "6",
      "text": "Definitely Better Than 2It may be no classic like the first film, But it’s a major improvement over the 2nd film."
    },
    {
      "rating": "7",
      "text": "The atmosphere just builds and builds and builds... And George C. Scott & Brad Dourif are simply amazing in this!"
    },
    {
      "rating": "7",
      "text": "The Exorcist III is in fact the only entry in the franchise that really scare the s**t out of me. Some sequences are just creepy as hell. As always both George C Scott and Brad Dourif are absolutely brilliant and the directing is actually very fine for someone who wasn't a director (since the job was done by William Peter Blatty, the franchise's creator). The director's cut (titled The Exorcist III Legion) is superior on many points, but the theatrical version is still a very good version. Barry DeVorzon's original score added more scare and is also probably the best of the franchise, ironically the soundtrack is still unreleased to date. Some boring unnecessary sequences are going to decrease the overall rating but that's nothing to be mad about."
    }
  ],
  "recommendations": [
    "psycho",
    "halloween_the_curse_of_michael_myers",
    "sleepy_hollow",
    "halloween_4_the_return_of_michael_myers",
    "halloween_h20_20_years_later",
    "the_shining",
    "the_texas_chainsaw_massacre_2",
    "the_omen",
    "the_texas_chainsaw_massacre",
    "candyman",
    "the_wolfman",
    "halloween_ii",
    "the_thing",
    "jaws_2",
    "jaws",
    "swamp_thing",
    "hellraiser",
    "evil_dead_ii",
    "batman",
    "scream_3",
    "a_nightmare_on_elm_street_4_the_dream_master",
    "gremlins_2_the_new_batch",
    "halloween_iii_season_of_the_witch",
    "the_conjuring_2",
    "poltergeist"
  ]
}