{"id": 4777, "title": "The Next 365 Days", "starring": ["Anna-Maria Sieklucka", "Michele Morrone"], "runtime": 112, "genre": ["Romance", "Drama"], "description": "Laura and Massimo's relationship hangs in the balance as they try to overcome trust issues while a tenacious Nacho works to push them apart.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6FsGeIp7heHm5eh4tIxTzHIRxmt.jpg", "categories": {"plot": 2.0, "acting": 2.3076923076923075, "ending": 3.0, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "7", "text": "A daring mixture of “The Godfather,” “Beauty and the Beast,” and  “Pretty Woman,” “365 dni (Days)” makes “Fifty Shades of Grey” look like kindergarten. The totally unbelievable plot is accentuated by the clever parallel introduction of the two main characters, and then its off to the races in a fascinating world of danger, eroticism, and the redemptive power of love. Supremely addictive!"}, {"rating": "0", "text": "Imagine 'Beauty and the Beast', 'The Godfather', and 'Fifty Shades of Grey' had a threesome, but after many failed abortions, it crawled out of the womb and slithered into cinema.Yep, that describes it.It's so bad that with a little bit of re-shoots and re-writes, this could have been a Jeffrey Epstien origin film. I'm not even joking. My jaw is on the floor that a movie like this exists, especially after the MeToo and Times Up movement.Please never forget that humanity created this movie. Everyone who was involved in this movie should be ashamed of themselves."}, {"rating": "0", "text": "Take everything you hate about fifty shades of grey, (glorification of abuse, shallow characters, bad portrayal of bdsm relationships) and amplify it times hundred. Then add in stockholm syndrome as well as an nonsensical plot, and tadaaa, you get this movie."}, {"rating": "0", "text": "This film Incites sexual violence. As The scenes, the soundtrack's terrible."}, {"rating": "0", "text": "Completely pointless. Promotes violence against women. How did this get produced? Seriously, im not being rhetorical"}, {"rating": "0", "text": "It's embarrassing how they try to make people sympathise with a sociopath and think it's totally okay to kidnap and harass someone until they fall in love with you. Not to mention the idea that you can do whatever you want with a woman that's tied up, if you THINK she likes it. The worst movie I've ever seen in my life. It's terrible!"}, {"rating": "0", "text": "This film should not exist, it promote an abusive relationship. Plus the film is overall awefull..."}, {"rating": "0", "text": "Pretty much a run of the mill, edited for wide release soft-core porn movie. The story borders on absurdity and It glorifies stalking, rape, kidnapping and Stockholm syndrome in some weird contrived way.Are you lost Baby Girl?!?!?"}, {"rating": "0", "text": "LOL O.3 seems a bit high for this one. Who gave it the 1 it needed to get past 0.0?"}, {"rating": "0", "text": "To insult viewers like this is beyond ridicule and frustration.AVOID THIS **** AT ALL COST!!!!!"}, {"rating": "0", "text": "The most shallow, empty and bad quality movie I have ever seen. Defínete not worth it. Period."}, {"rating": "0", "text": "That's literally one of the worst movie I have ever watched in my like. This movie doesn't make any sense"}, {"rating": "1", "text": "trash movie,sex for no reasons, violance,bad soundtrack,they have worst english accent"}, {"rating": "1", "text": "Even two gorgeous bodies are not enough to offset the inevitable reflex of eye rolling and exasperation that comes from watching such an outdated, chauvinistic, sexist plot. I would say this is like the movie incarnation of a bad erotic novel, except that would do erotic novels a disservice. Good only for mindless entertainment which definitely has a place during the pandemic! (Not being sarcastic.)"}, {"rating": "0", "text": "A \"film\" about sex trafficking & stockholm syndrome, disguised as a \"romance\".Horribly, god awfully offensive. Shame on you netflix, production, director, and cast.I'd rather watch the Orange man pooping on the toilet."}, {"rating": "0", "text": "Ok è brutto ma servirà all’Italia dopo il 29 giugno quindi guardatelo è ottimo come alternativa al porno"}, {"rating": "1", "text": "The plot makes this a (bad) 114 min soft-core porn movie that does pretty much everything wrong. Also, the message it delivers is borderline psychopathic to say the least."}, {"rating": "0", "text": "It starts like a cringe ripoff of the 50 shades trilogy with elements of the Beauty and the Beast. It shows nothing more than some petite **** And guess what, it won’t give any more than that. Don’t waste your time. I regret my 2 hours of free time."}, {"rating": "1", "text": "The **** (pardon the pun)It's actually impressive how diabolically terrible '365 Days' is. I had heard small details about how sexual this was but hadn't seen anything about the film's other aspects. Now I know why, there aren't any.It's just one big illicit romp with practically nothing holding it together, a cynic would say this is Netflix just getting pornography on their platform through the back door (pardon the p... nevermind).The worse part about this is the glorification of sexual violence, whether it be kidnapping or even - startlingly - rape. How the plot plays out is actually extraordinary - it turns out THIS is the way into a would-be lover's heart... who knew?! It's crazy. You could argue it's a sexually explicit retelling of 'Beauty and the Beast', but that's an argument for another day.They could've done this without the aforementioned and still got the same vibe out of the film, it's bizarre why they choose to go down this direction. You can make characters hate each other before jumping into bed together, you simply do not need the criminality aspect. If I were to offer minor solaces of 'praise' about this 'film': the music (random Mabel is random) and the end scene, which is well shot."}, {"rating": "2", "text": "Esta película tiene una pésima historia, que aunque trate de ser ejecutada de buena manera por los actores, no deja de ser una historia sin sentido."}, {"rating": "0", "text": "This **** Sucks, give me back my money, my time, and my f***ng life please, u know. hhuis"}, {"rating": "10", "text": "Gostei do filme, roteiro, elenco, equipe e produção estão de parabéns , ficou bom"}, {"rating": "7", "text": "Um filme que apela para o lado erótico feminino, assisti a pedido de uma pessoa, porque honestamente não teria noção alguma ver isso, enfim, a história parece bem fraca do começo ao meio, e o fato de não ser dublado em PT-BR atrapalha bastante, ao menos para mim que não gosto de ficar lendo legendas por mais de 1 horas, mas admito que o final deste filme é uma verdadeira surpresa inesperada, eu diria que triste, porém posso dizer que foi o clímax do filme."}, {"rating": "2", "text": "This Polish import was #1 for 10 days, which is the 2nd highest record in Netflix history. A hunky but impossibly chauvinistic Sicilian boss becomes obsessed by a woman he sees on the beach. He kidnaps her with the deal that she has a year to fall in love with him or she'll be released. The plot trajectory is obvious, but it's not the story or characters that matter: The profusion of sometimes cruel, sometimes forced sex scenes reminded me of the old soft core days of Cinemax. Pretty much everything about the narrative is absurd, but the locations and lifestyles are rich. That doesn't make up for the misogynistic attitude and extended porno-adjacent scenes (always accompanied by a terrible soundtrack)."}, {"rating": "0", "text": "Las personas que gustan de ver esta pseudo película, lo hacen enteramente por el atractivo del protagonista masculino, gran parte de ese público son mujeres que hipócritamente luchan contra la violencia contra la mujer.¿Por qué violencia?En este caso porque alaban este tipo de producciones que muestran exactamente el tipo de malas actitudes por la que muchas personas luchan en estos días, si el protagonista fuese muy poco agraciado dirían que es malo, machista, vulgar y deshonesto.De la misma forma en que vapulearon Las 50 Sombras de Grey, deberían ser igual de consecuentes con estas porquerías."}, {"rating": "1", "text": "Meu Deus ainda bem que sair pulando o filme inteiro, 1 só pra dar um desconto do trabalho da filmagem, fora isso... A história não tem nexo algum e péssimas atuações."}, {"rating": "1", "text": "Horrible pointless movie seeming to idolize money, extravagant lifestyle and power no mater the cost. And that this people should be allowed to rule and do as they please???Further more , the opinions i agree with and a description of the movie as i watch it xD (a friend said i Must see this movie )This film Incites sexual violence and  it promote an abusive relationship. It glorifies stalking, rape, kidnapping and Stockholm syndrome. The scenes, the soundtrack's terrible.disguised as a \"romance\".Description of the film as I see it:So, the first three minutes we are forced / allegedly to sympathize with a privileged mafia family, where the father is currently negotiating and building a relationship with human traffickers, dealing with girls under the age of 12.So the main character uses his power to exploit other people, blackmail them due to sexual preferences, whatever ... willing to ruin families, and live whatever it takes to achieve his goal.When something goes against him in life, he turns to exploit the closest woman and sexually abuse her (using his influence of power).This after 13 minutesThe main character is crazy and traumatized after the father's death, and he becomes obsessed with the last woman he saw before his father died and almost him. So he kidnaps this woman, and then he treats Stockholm, brainwashing syndrome ...Then he starts sexually harassing here, while saying he won't, and threatening here if he doesn't comply.Scene in hostage scene tied up, he obviously could easily get out of those ropes xD Why does a kidnapped abused girl feel threatened in his life, smile and seem to like the situation?I get she wants to  buy large quantities to piss him off,  but why sexy lingerie?So among other sexual abuse this movie promotes the idea that  you can do whatever you want with a woman that's tied up, if you THINK she likes it. Blowjob scene being in front of her. I show you what you are missing, 30 seconds later it runs in the mouth of a prostitute.So the only one that is alowed to take advantage and **** her - is him, legitimateHe \"saved\" her while she almost died running away from himThe whole final sex thing is very anticlimax, ordinary and boring, with no foreplay, teasing or buildup ...So, obviously, this woman is very superficial. No deep feelings or meaning are needed as long as you have an extravagant lifestyle30 seconds before he comes? no pleasing  the woman her? (yes the ultimate sexy dream)You don't need 365 days ... love ... consumption, extravagant lifestyle and cheap domination sex, playing brat ... playing games ... This is what she loved ...She doesn't even know him.I hate constant games, a false personality ...And then wtf ????She dies pregnant ...What is the point of this movie? Dreaming of fancy things and being used for sex? (and obviously not very good sex), before it's too late and you're dead."}, {"rating": "5", "text": "The acting was horrendous by both actors, especially the lead female. The sex scenes were the highlight of the entire movie, very realistic."}, {"rating": "1", "text": "The fact that this film tries to morally justify people kidnapping others and forcing them to fall in love with them automatically gives this film a low score. It’s pathetic, dumb, and idiotic. Every other aspect of the film just continues to lower and lower the score. This is the most boring film I have seen all year so far. I found myself constantly checking how much time is left. It’s so boring because the story takes a backseat to the sex scenes which in themselves are poorly shot, undeserved, and cringy. The plot takes such a backseat that I honestly don’t know what exactly happened except that the guy kidnaps the girl and that’s it. The performances are fine but the actors have nothing to work with. Every other aspect such as the cinematography, editing, and musical score is incredibly bland. Avoid this at all costs no matter what you hear."}, {"rating": "0", "text": "This is what happens when you have a script for a porno and think \"you know what? I bet if I make the sex scenes less explicit I can turn this into a theatrical movie\", but you keep the awful dialogue and the disgusting kidnaping plot that was too tasteless for even the most desperate porn studios and expect no one to notice.Also, from a writing standpoint, what's the point of making it 365 days to fall in love with him if she's just gonna fall in love with him on like the third day? Couldn't they at least made it clearer how much time has passed, because half the time I have no idea if it's been week or five months. It does feel like a year, that's for sure."}, {"rating": "0", "text": "Um total exemplo de como não fazer um filme. Por mais que ele seja bem fotografado e tenha um certo profissionalismo na equipe de produção, tudo é feito para dar vida a uma história extremamente misógina, incoerente e totalmente entediante."}, {"rating": "0", "text": "This movie is the worst movie I've ever seen ARE YOU LOST BABY GIRL BRUH WHAT THE **** I don't know how Netflix even allowed this movie to be on the platform"}, {"rating": "0", "text": "The film tries to romanticize sex trafficking. The script is terrible. If the intention is to build an erotic film, better to go watch an amateur video on Pornhub."}, {"rating": "3", "text": "It's an erotic film, and it draws on that quite a lot, too, I'd say. The story isn't that great and actually I think it's not that great. Fans of erotica will probably find their thing here, but otherwise I would advise avoiding this film. For me, a weak film that I don't recommend."}, {"rating": "0", "text": "Terrible acting, characters speak in 4 word sentences, cameraman is shaking all the time, laughable plotJust go watch something on pornhub, theres better acting"}, {"rating": "0", "text": "Please do not watch 365 Days, this movie was so bad, so awful, and even worse than Fifty Shades of Grey."}, {"rating": "0", "text": "0 to i tak za duża ocena jak na ten film.. reżyser był na planie ?? film ,tfu co coś jest tragiczne"}, {"rating": "1", "text": "Zwykłe porno i zero głębi.Współczuję utraconych pieniędzy tym, którzy nacieli się na bilet w kinie, a wszystkim innym czasu zmarnowanego na zapoznanie się z tym wątpliwej jakości \"arcydziełem\"..."}, {"rating": "0", "text": "this carrion has been in the top 10 for months on netflix. During this 2-hour period, 95% of people related to sex would be ashamed to give it a score above 3."}, {"rating": "0", "text": "Como posso dizer isso: chato, sem graça, sem história, sem vida e sem sentido."}, {"rating": "9", "text": "A few facts first :- This site tried to censor me hard several times for the writting of my review.- It's the most watched movie of 2022 on Netflix.- It's the second most watched movie OF ALL TIME on Netflix.- NO, it is NOT a mygonystic movie about a woman afllicted by some Stockholm syndrome.- Rotten Tomatoes gives this movie a score of 0, which tells you that it's actually good and very much worth watching :)To the review now :It tells the story of a man portrayed by Michele Morrone who is a the head of a Sicilian mafia family and who is utterly smitten by the beauty of a polish woman who just so happens to visit Sicilia. He abducts her, and tells her that he will do everything in his power to make her fall in love with him within 365 days. If he fails, he will admit defeat and release her.The trick is that this man, being a gangster by trade, is used to take everything by force, he's 6\"2 (1.90cm), he has a body that looks as though he's been sculpted by Zeus himself, and even though he is very sophisticated, charismatic, wealthy, and very much of an alpha male, he also can be a little rough around the edges when it comes to intersexual relationships.The woman, portrayed by Anna Maria Sieklucka, is of course impossibly beautiful, and sports nothing less than the perfect body and the perfect face. She can have quite a temper, be provokative and very much disobedient. She also is very smart.The combination of the 2 of course makes for a very explosive relationship (initially) and a lot of funny moments.Now, what i found quite remarkable is the way it approaches the relationship dynamics, which is very unapologetic in the way it portrays on one side the man being extremely powerful, dominant, ruthless, but also deeply charismatic, kind and caring... and on the other side the woman being physically very weak, at the man's mercy, very much submitted to him and upset to find herself in that situation, but at the same time intrigued about him, and in conflict with her own feelings: should she allow herself to fall for him, should she resist....In this movie, you will NOT find any self entitled and self obsessed, arrogant, condescending, petulant, and deluded western women who can only complain about 'Where did all the good men go', not realizing that they're the N°1 reason why no men want to have anything to do with them. You will NOT find any self proclaimed 'strong and independant woman' who is affected so much by the Schrodinger syndrome that she will abuse her victim status every time she feels it's convenient, again not realizing the cringe inducing paradox and the reason why she is in reality anything but strong and independant.This movie absolutely and utterly goes away with that kind of brainwashed women, deluded and miserable. Instead it goes back to the true inner woman's nature and their desire : the need for a powerful, strong, reliable, dominant and capable male. The need to submit and feel loved and protected. The need to let go and let herself be lead.This movie tells you a secret about women that today's society fiercly tries to hide by any means : in their heart of hearts, women crave a relationship like this. It is in fact more than a craving, it is a deep viceral need.If anything, this movie is about a woman who learns to abandon the teachings of a western society gone wrong, a society that would want to see women equal to men in every way, despite all their differences : in biology, needs, nature....And if indeed men and women should have the same rights in front of the law, they are anything but equal when it comes to intersexual relationships. Instead, they are complementary.Let me say that again : NOT equal, but complementary.This movie perfectly reflects that. This is why it is so refreshing. It is void of all feminist **** or leftist activism.All in all, that kind of movie is really not my usual choice, but i was pleasantly surprised and entertained. I enjoyed watching the woman slowly falling in love with the gangster, and him in return learning to express his inner kindness and be more civilized towards her.The acting was ok, but nothing fantastic either, so i won't watch it twice for sure, but it was good enough while it lasted."}, {"rating": "0", "text": "The worst movie I have ever watched. The acting is so bad that makes me feel uncomfortable and they don't even talk they only have s£x"}, {"rating": "1", "text": "Stockholm Syndrome the movie. Really bad in pretty much every aspect and it's really boring."}], "recommendations": ["unforgettable", "fifty_shades_of_grey", "the_shape_of_water", "shame", "showgirls", "knock_at_the_cabin", "elle", "fifty_shades_freed", "the_wolf_of_wall_street", "the_lobster", "tall_girl", "fifty_shades_darker", "to_the_bone", "sex_and_the_city_2", "promising_young_woman", "siberia", "eden_lake", "children_of_men", "babel", "the_hunt", "magic_mikes_last_dance", "i_spit_on_your_grave", "the_girl_next_door", "swiss_army_man", "slumdog_millionaire"]}