{
  "id": 4522,
  "title": "The Dead Pool",
  "starring": [
    "Clint Eastwood",
    "Patricia Clarkson"
  ],
  "runtime": 91,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Dirty Harry Callahan returns for his final film adventure. Together with his partner Al Quan, he must investigate the systematic murder of actors and musicians. By the time Harry learns that the murders are a part of a sick game to predict the deaths of celebrities before they happen, it may be too late...",
  "releaseYear": "1988",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mqwGpW0Ptrvz1GmfCnLAOA4cQ8g.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 5.0,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I can’t understand why this movie got so low a score in average from critics, certainly it’s not for this movie’s being changeable, as Inspector Callahan keeps his iron heart and inflexible working style to the end, and shows not a trace of any possibility of change. Even with his constant role, this sequel of Dirty Harry deserves more cheers.\rI gave it a score of eight, 1 point above that changeable third Iron Man.\rBy the interval of one or two years, this movie will appeal to me for another watching. Besides, the lady in the film looks so tender, but she lacks no courage."
    },
    {
      "rating": "9",
      "text": "Completely underrated movie the Dirty Harry Franchise"
    },
    {
      "rating": "5",
      "text": "Probably the worst in the franchise though still somewhat enjoyable, Eastwood has lost his edge a bit."
    },
    {
      "rating": "6",
      "text": "The Dead Pool is the last fifth Dirty Harry movie. 3 and 4 the film already looks like a self-replay, they tried to bring a new one to the fifth film, but it looks mediocre, the most important plot twist is read by the viewer even before the middle of the film. There is no suspense because of this. In general, The Dead Pool is a passing film, watched it more by inertia, after all the previous parts. But here there is a young Liam Neeson in an atypical applause and the most pleasant - the first appearance in the cinema Jim Carrey."
    },
    {
      "rating": "3",
      "text": "Harry se fait vieux et l'heure de la retraite approche à grands pas : il a dégommé tellement de malfrats avec son Magnum qu'il en est devenu célèbre. Aussi est-il devenu une cible à son tour ! ma foi, voilà qui pouvait ou aurait pu donner lieu à quelque chose d'éventuellement intéressant ou au moins divertissant. Avec un peu de recul peut-être, le poids des années aidant... le poids d'un \"anti-héros\" sur-exploité pendant plus de 15 ans... une façon de tirer sa révérence avec dignité (non, pose cette arme Harry, c'est une façon de parler).Si seulement on avait confié cela à un scénariste pas trop con qui n'essaie pas de vous endormir pendant la moitié d'un film qui ne dure qu'une heure et demi ! une histoire aux grosses ficelles qui rappelle un Columbo rassis que l'on regarde en ronflant. Suranné et dérisoire ce dernier Inspecteur Harry ! Clint a encore quelques bons mots et dégomme les vilains d'une seule balle, une seule et s'il prend la mouche avec sa hiérarchie, il fait mouche à chaque coup. Comme d'habitude. Mais la recette est devenue foireuse, il est temps de se retirer et de ranger le flingue. Au musée."
    },
    {
      "rating": "7",
      "text": "*insert Marvel/Ryan Reynolds joke here*'The Dead Pool', whilst being the weakest of the 'Dirty Harry' films and feeling a little out of place, is still good fun in my opinion. Clint Eastwood is supreme once more and is joined by some standout names in Liam Neeson and, to my big surprise, a certain yet to be famous Canadian-born actor!This one features a very silly plot but it does make for mindless entertainment. I had a solid time with it, anyway. There is one ridiculous, yet amusing, car chase sequence. Due to that, and other parts, it kinda doesn't feel like it quite fits with the other releases, though that's not an issue in my eyes. Overall, it ends an enjoyable series well."
    }
  ],
  "recommendations": [
    "the_legend_of_zorro",
    "octopussy",
    "trouble_with_the_curve",
    "rocky_ii",
    "red_2",
    "unforgiven",
    "true_grit",
    "the_second_best_exotic_marigold_hotel",
    "daredevil",
    "django_unchained",
    "the_quick_and_the_dead",
    "spider_man_homecoming",
    "back_to_the_future_part_iii",
    "gangster_squad",
    "indiana_jones_and_the_temple_of_doom",
    "last_action_hero",
    "the_godfather_part_iii",
    "for_your_eyes_only",
    "the_spy_who_loved_me",
    "die_another_day",
    "highlander",
    "legend",
    "casino",
    "lawless",
    "indiana_jones_and_the_last_crusade"
  ]
}