{
  "id": 4048,
  "title": "The White Tiger",
  "starring": [
    "Adarsh Gourav",
    "Rajkummar Rao"
  ],
  "runtime": 125,
  "genre": [
    "Drama"
  ],
  "description": "An ambitious Indian driver uses his wit and cunning to escape from poverty and rise to the top. An epic journey based on the New York Times bestseller.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5JnmseS3DZ6ad2VMbrnbGCs8Rst.jpg",
  "categories": {
    "plot": 8.045454545454545,
    "acting": 8.416666666666666,
    "ending": 7.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The harsh living and working conditions in India are well documented, but this film addresses the class disparity with a provocative personal story. Adarsh Gourav plays a poor villager who lands a job driving a rich couple in Delhi (including Priyanka Chopra-Jonas who also exec produced). His subservience is humiliating to watch, but his eager attitude launches the narrative as an upbeat success story. However, after a crucial incident, he begins to question the system and the story takes a dark turn. Gourav is superb in the lead, growing from a simple servant to a savvy businessman with depth and appeal. The glimpses into the impoverished class and their outrageous treatment is the dominant theme, but the direction has kept the story interesting and the ultimate outcome is an intriguing morality tale. (In English and Hindi with subtitles)"
    },
    {
      "rating": "10",
      "text": "What a brilliant film! The White Tiger is gripping, enthralling, satirical take on class disparity in India backed up by magnificent performances from the lead cast especially Adarsh Gourav who is nothing short of a revelation! There's bound to be comparisons to Parasite & Slumdog, but the story holds its own. A must watch!"
    },
    {
      "rating": "4",
      "text": "As much as I wanted to like the movie it had no depth. It was like following a zombie nowhere. The plot was shallow with pieces just falling on to the screen for no particular reason."
    },
    {
      "rating": "7",
      "text": "The White Tiger is a great movie. It shows how hard life can be in India for those without money and the journey the main character embarks on to change his reality.The movie attempts on taking some dark turns, but it all feels a bit shallow. The resolution feels simply too easy.Regardless of these little bad critiques, it's a very good movie.It was very interesting to see how Balram thought about himself and about life in the beginning of the movie and how it changes as he makes darker choices while learning \"how the world works\"2 hours well spent.Beautiful shots, locations and colors. Camera work was just ok, but good enough I guess."
    },
    {
      "rating": "7",
      "text": "Una muy buena historia que es muy dramática y emocionante; además, las actuaciones son excelentes; la recomiendo mucho."
    },
    {
      "rating": "9",
      "text": "The movie is based on the book of same name which I read and wondered can this type of story be adapted into a movie. I felt the white tiger as a movie was little bit better than the book as we can understand the situation more in the movie. Every cast member, especially the main lead played their part nicely and story was properly told.Overall, this movie properly adapted the novel. It's a good watch and would recommend this movie to drama and satire lovers."
    },
    {
      "rating": "7",
      "text": "The White Tiger opens with a letter being written by Balram to Chinese leadership, detailing his rise to wealth.  It is a rise, he warns, that is fraught with evil deeds, but defines him as a true entrepreneur, unlike many of his statesmen among the poor.  Balram, in order to escape a life of hopelessness, arranged marriages, and poverty, has decided to become a driver for one of the wealthy and influential families in India.  He enjoys driving the young couple, and even befriends them, but soon learns that having a servant’s heart will not lead him out of poverty.  In fact, despite occasional graciousness by those he serves, he is ultimately hated by those too far above his status to consider him human.  A misstep by his masters sours him to his plight, and Balram discovers that it is time for the White Tiger to follow his nature. The White Tiger was written and directed by Ramin Bahrani (Fahrenheit 451) based on the book of the same name written by Aravind Adiga.  Adarsh Gourav plays Balram, the poor entrepreneurial Indian driver looking to escape the bleak future his station promises.  The wealthy couple he serves is played by Rajkummar Rao as Ashok, and his wife Pinky, played by Priyanka Chopra (Baywatch, Marvel Avengers Academy as Kamala Khan).  Balram’s overbearing grandmother is played by Kamlesh Gill, and the wealthy patriarchs by Mahesh Manjrekar (Slumdog Millionaire) as the Stork, and believably gangster performance by Vijay Maurya as the family enforcer, the Mongoose.   The White Tiger follows Balram's life as yet another of the poor in India.  But he knows he is different, destined for greater if only he can take advantage of the right opportunity.  He manages to become discovered by a wealthy, but also politically involved and dangerous, family as the driver for the newly married son and his wife.  They enjoy Balram, befriending him, and giving him opportunities he never had, causing him to believe he discovered the life he dreamed of.  But, being of a lower caste also makes you expendable, as Balram discovers when he is asked to take the blame for an accident caused by Pinky. As Balram considers his rapidly deteriorating relevance to his current position, he views a White Tiger, rare, one to a generation, dangerous, as he could be.   I recommend this movie as a stunningly filmed documentary of the many facets of India, and on the strength of Balram.  While the movie has many strong performances, it is the fluidity of Adarsh Gourav’s Balram, meek and strong, servant and villain, that White Tiger relies on to strengthen its grander ethical themes.  The movie and writer may find some love from the Academy this year, but it is Gourav that deserves the most acclaim, and possibly an Oscar nod.  On the strength of the story and his performance I give the White Tiger 3.5/5 Stars."
    },
    {
      "rating": "9",
      "text": "It's a well crafted one , the overall acting is quite good but sometime it's have some drawbacks"
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "10",
      "text": "Amazing performances are present in White Tiger. Moreover, the film explores the harsh reality in India in such an informative and emotional way. This satire mocks the societal structure and harsh treatment by the rich and wealthy in a dramatic and suspenseful way. Through the story of the main character, this theme is vividly explored to an extent where you are left in shock at the end of the film and have to remind yourself, but this is the reality."
    },
    {
      "rating": "7",
      "text": "An interesting film about the social disparity in India. What could be considered the anti-Slumdog Millionaire perspective of the situation, 'The White Tiger' explores the messy relationship between master and servant and how there's a whole culture about it in the country. With some good acting, especially that of Adarsh Gourav, director Ramin Bahrani delivers a solid statement about social mobility, although the hasty conclusion somewhat hurts the story."
    },
    {
      "rating": "6",
      "text": "When attempting satire, one needs to make sure it genuinely works. However, in this story of an ambitious Indian entrepreneur and his tale of upward mobility, the satire is so muted that its impact rarely comes through as intended and just seems mean instead. What's more, the film's conclusion comes across more like the midpoint than the end of the protagonist's story, given the long set-up employed in reaching that point. Add to that some rather implausible aspects in character development (and a complete lack thereof for a number of monodimensional players), and you've got a story that many viewers may find challenging to care much about. Director Ramin Bahrani's latest is far from awful, but it's just not terribly memorable and fails to measure up to some of his previous (and much better) works."
    },
    {
      "rating": "9",
      "text": "What if you put together Slumdog millionaire and Goodfellas? This is the story of an outcast and his rapid rise to glory. The script was able to perfectly combine social criticism and black humor, with incredible performances. From India, a rare bird not to be missed."
    },
    {
      "rating": "6",
      "text": "A bit of melodrama, social classes, monetary power, and corruption.It has good intentions but considering the approach of the story, the result is inevitable and known: You may have good wishes and good intentions, but you hardly come out clean if you want to climb the ladder controlled by those who want to keep you down."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)In India the class struggle is turned into caste struggle, it is not a happy island but even there iniquity, corruption and malfeasance dominate. Epochal revelation. Redemptive way? Replacing the masters, rich, thieves and murderers by becoming a criminal like them. Further jump of amazement. Bahrani basks in cynicism while, 21 years later, Miss World 2000 has grown wider than tall."
    },
    {
      "rating": "10",
      "text": "I still remember my first and only trip to India, finding The White Tiger and purchasing it from a book stall in a train station in Calcutta. I devoured the book over my next week and a half in the country. That was a long time ago. I was surprised to find this movie on netflix. I didn't expect it to be made into one. And as I watched I not only was transported back to the story I fell in love with, but also a country I spent time in and learned about. I can't tell you whether this movie is a very faithful retelling or not because to be honest, I can't remember the book all too well. But it did feel faintly familiar as I watched. It is thought and emotion provoking. I enjoyed it very much. I hope you do too."
    },
    {
      "rating": "7",
      "text": "The movie does a decent job in portaying the social, economic and politcal divide in India as well as the consequences of ambition and loyalty.At times, it does feel as though parts of the story have been moulded to fit a narrative, and it suffers as a result."
    },
    {
      "rating": "8",
      "text": "Great performance from Adarsh Gourav, I mean really great that I would give him an Oscar for it, Ramin did a great job too, the story is just perfect delivered smoothly to us, I received the story with smiles and laughs sometimes, with sadness sometimes, I lived with the main character and felt him, I didn't agree for sure with his moral compass yet I felt him, the only negative points is the coldness of Rajkummar Rao he did a good job but could be better much better actually, and also the ending was not shocking at all, this movie literally shouted out loud that this year will be full of good movies, I mean we are still in January and we already have a masterpiece like this. And lastly, the movie opened our eyes to some cultural and economic problems in India, and I learned a lot actually about how life is going there...A summary: YOU MUST WATCH THE MOVIE it's great not the best but surely in my 100 list"
    },
    {
      "rating": "8",
      "text": "This movie breaks the molds for this kind of Indian movies, to be the greatest for get nominated to the Academy Awards."
    }
  ]
}