{"id": 4295, "title": "The Bucket List", "starring": ["Jack Nicholson", "Morgan Freeman"], "runtime": 97, "genre": ["Drama", "Comedy"], "description": "Corporate billionaire Edward Cole and working class mechanic Carter Chambers are worlds apart. At a crossroads in their lives, they share a hospital room and discover they have two things in common: a desire to spend the time they have left doing everything they ever wanted to do and an unrealized need to come to terms with who they are. Together they embark on the road trip of a lifetime, becoming friends along the way and learning to live life to the fullest, with insight and humor.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/idbNSe8zsYKQL97dJApfOrDSdya.jpg", "categories": {"plot": 7.5, "acting": 9.545454545454545, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.625, "action": 5.0}, "reviews": [{"rating": "10", "text": "Once again, the critics have it all wrong.  Glad we didn't rely on their rating.  The movie is wonderful in every way.  The only part that was over the top was the crashing of the two cars.   Making a \"Bucket List\" is a good idea for everyone, as it is helpful to set goals and contemplate one's mortality.  We will highly recommend this movie."}, {"rating": "2", "text": "Normally I'm a fan of Reiner's work, as well as Freeman's. Nicholson I can take or leave; I personally feel he hasn't done a good project in a decade. This movie doesn't change my opinion of him. From their first meeting (which was contrived) to the premise (which made me wonder throughout the entire movie whether that money they spent could have been better invested in medical research, at the least!) I had trouble sitting through this one. My wife liked it better, but she's not reviewing it."}, {"rating": "2", "text": "Seriously? You are dying and you tell you wife and kids \"See ya!\" just so you can get in some cheap thrills? Talk about sending a message about the pointlessness of life."}, {"rating": "3", "text": "You'd think that a movies starring two of Hollywood's greatest wouldn't be half-bad. You'd think that if it was directed by Rob Reiner that it would be better. The bucket list will make you think wrong. A lame premise is made lamer by cheesy dialogue and plot devices, and the jokes are just plain unfunny."}, {"rating": "5", "text": "A billionaire like Edward Cole(Jack Nicholson), a man who can afford to cancel luncheons with glamorous movie stars, in all likelihood would be beyond the formality of being discreet. But there he is, being discreet, tiptoeing back to his airplane seat after f****** the stewardess. Is Edward simply being courteous about not wanting to rouse Carter(Morgan Freeman) from his mile-high slumber, or is he fearful of making his new \"friend\" jealous? In another scene, the two men have dinner at a restaurant Edward uses to wine and dine women. Carter is his first man. Back at the tycoon's palacial estate, Carter takes a luxurious bath in a porcerlain tub. All that's missing is the bubbles. In Egypt, Edwards asks Carter if he can call him \"my main man, Ray\"(a possible code for \"my best girl\"?). After awhile, you stop watching the official narrative(which is depressing and sentimental), because the subtext is a lot more interesting. Since 2005's \"Brokeback Mountain\", there hasn't been a serious gay-themed movie backed by a major studio, even though the Ang Lee-directed film was a box office success and won three Oscars(albeit not \"Best Picture\" as expected). \"The Bucket List\" is a lot like watching William Wyler's \"The Children's Hour\", in which audiences speculated about the nature of the friendship between Audrey Hepburn and Shirley MacLaine. What does it say about major studio films in their treatment of homosexuality when virtually every scene in \"The Bucket List\" is fraught with a nudge and a wink like it was 1961 all over again? After returning from his travels with Edward, Carter is surrounded by his family at the dinner table. He looks happy, but given the context, you wonder if that smile is genuine, or a domesticated mask? Sometimes the true feelings of these two men aren't even all that subtle. Listen closely to Edward's eulogy, and watch with amusement at how the screenwriter prevents Carter from sharing an intimate moment with his wife. Their final resting place is practically a homage to the Ang Lee film, and Annie Proulx short-story(from the short-story collection \"Close Range: Wyoming Stories\"). Two good friends- wink, wink, nudge, nudge- finally, at peace."}, {"rating": "8", "text": "It made me laugh, cry and think and wish I could make my own \"bucket list\"."}, {"rating": "10", "text": "As I left the theater I felt I didn't need to see another movie this year... I had just seen the best. Yes it played heavily on our emotions and often turned humor to sadness. ALL the actors delivered award winning performances and the critics.... well... Think they may have over analyzed it... again proving they often don't have a clue what the audience reacts to."}, {"rating": "10", "text": "Spectacular movie! It made me laugh, and cry. It didn't feel like watching a movie, I felt I was there."}, {"rating": "10", "text": "The Bucket List- Critics are such losers; moviegoers decide for themselves. I loved this movie. I don't care if it is realistic. Jack and Morgan made me think about my best friend and what we want before we die. We often say things like: \"Which ten people would you have to dinner if you want to learn something?\" . Now we will make out a \"bucket list\"."}, {"rating": "10", "text": "In today's times when theaters and all film and video production is overwhelmed by violence - needles to say that our ancestors are becoming lost idiotic FPS slayers that often mix reality and fantasy - hat down goes to screenwriter, director, Jack and Morgan for this emotional life experience. By the way I'm 36 now if someone thinks I'm an old pathetic grandpa. And those critics - they are becoming corrupted irrelevant personas."}, {"rating": "8", "text": "Why is this so badly received by critics?  It's not terrible at all, and it's really, really good for a film starring two very well-known names.  Yeah, it's predictable (in case you don't know the movie, the guys both die, and it's hinted at from the very beginning) but it's sooooo funny."}, {"rating": "0", "text": "I know we're only a few days in, but i'll be hard pressed to find a worse movie in 2008."}, {"rating": "10", "text": "To all the critics on this page - You guys are straight f***ing crazy. To find so many negative aspects in something so simple and beautiful should be a crime. If you honestly think this movie was garbage you need to do some soul searching. Try to venture far your arrogant minds and appreciate the simple things in life. Something tells me you think way to much of yourselves."}, {"rating": "10", "text": "Beautiful and heart warming movie. Touched the cord!! Go take a hike...and rethink your life all you moronic critics!!"}, {"rating": "8", "text": "Slow to get going but a very powerful movie. Made me laugh through out, but guaranteed to make you cry. First time i have ever cryed in a movie! very emotional at the end but well worth the watch. In my opinion it's Jack and Morgan that make the movie so good, wouldn't be much without them."}, {"rating": "10", "text": "What a funny movie! My kids enjoyed it and thought that Jack was what made the movie even more fantastic."}, {"rating": "10", "text": "I don't understand why some crtics said that this movie was a waste of time. To me this movie is one of the most beautiful and touching story. There are laughs and there are cries. After watching this movie, I have put it in my list of favorite movies. Despite what the critics have to say, I think that this movie is definitely worth the time to watch and I think that this movie DOES indeed have alot of reality in it. It's Wonderful. I loved every minute of it."}, {"rating": "9", "text": "What a fun flick! And to Chad's comment \"my main man, Ray\" is a direct reference to \"Rain Main\".... calls him that because Carter has all these facts in his head (remember how Rain Man was like that with all kinds of information?)."}, {"rating": "10", "text": "Couldn't have been better. Made me cry like a baby"}, {"rating": "10", "text": "I base3 this purely on the strong acting of Nicholson and freeman, as well as a heartwarming story..very much enjoyed."}, {"rating": "10", "text": "Beautiful in all of its simplicity."}, {"rating": "7", "text": "The Bucket List is a film that had so much potential. The trailers really played it up as I recall and it looked like it was going to be a really strong film. I was late watching this film but I have realized that it has already lost some of it significance after 8 years and I'm sure that at some point it won't matter at all. Morgan Freeman and Jack Nicholson give the audience be expectations and they really do their best, but I just find the film crudely shot and the script is below average. This film could've been a true memorable film."}, {"rating": "9", "text": "My wife and I just viewed the movie this evening and both of us found it to be a very heart-warming movie. An enjoyable film and a typical of Rob Reiner film. We would highly recommend it. It would resonate well with anyone coming to grips with their mortality. Judging from the audience reactions, the moments of levity were spot on."}, {"rating": "8", "text": "If you are 60+, you will be able to relate to it, a fantasy that is totally enjoyable."}, {"rating": "10", "text": "The Bucket List is a great film. Nice storyline. Very entertaining. Audiences kept filling the theater with laughter. Touching at times. The critics have got it wrong. Love it~!!"}, {"rating": "10", "text": "The best movie I have seen in years. The critics definitely got it wrong and need to get in touch with what most people are looking for in movies - entertainment."}, {"rating": "6", "text": "Surprisingly trite and over sympathetic, but it is still an enjoyable film. Jack Nicholson and Morgan Freeman certainly make the film worth watching. Good direction, but the writing is the films main flaw."}, {"rating": "10", "text": "A movie full of wisdom and fun. If you don't like this movie, the problem lies within yourself."}, {"rating": "10", "text": "I think it was a great movie. It's a feel good movie, I laughed and cried but I really enjoyed it. A real clean, nice movie."}, {"rating": "10", "text": "I thought it was very funny and at the same time very touching. There was a lot of chemistry between the 2 characters."}, {"rating": "10", "text": "Jack & Morgan put on quite a show together. Totally believable and each of the characters they portray is very much like we (the public) see them as great actors. They touch every emotion and present impending death in a very dignified manor. Excellent."}, {"rating": "9", "text": "It's a great movie with 2 fantastic actors! That some can't see the irony in this movie is not the movies issue. They should look in the mirror and start their own Bucket List! I am sure they will need it someday and I venture to guess they won't face the inevitable with such grace!"}, {"rating": "6", "text": "Although the movie has been acted by two of the best Hollywood actors, the movie lacked depth of plot. There were many good scenes, but the movie didn't immerse the audience in the plot."}, {"rating": "9", "text": "Way better than I expected. Those who give it a thumbs down tend to be those under age 50? Rob Reiner did a fine job as did the two leads."}, {"rating": "7", "text": "Although an adorable movie, it is not stunning;still certainly much better than what the critics have said."}, {"rating": "5", "text": "Not as good as I expected and I am a big Morgan Freeman fan but not bad."}, {"rating": "8", "text": "Good dialogue at the start but the film loses itself midway through only to regain its footing at the end; worth watching for the chemistry between the two lead actors."}, {"rating": "8", "text": "Thought it was a sad comedy but enjoyed it and felt that it was 'thought provoking'. Everybody should make their own bucket list to ensure that we led life to the fullest."}, {"rating": "8", "text": "A perfect example of how utterly wrong the critcs often are. A wonderful romp with two marvelous actors that will probably produce some of the most rethinking of death and dying than anything in the mainstream press for years."}, {"rating": "10", "text": "How can the critics give a 40% to this movie? They can give 80% to the Hulk, and a 42% to this? I don't have words to describe this movie. One of the best movies I have seen. Period. It will make you look at life in a different way..make you realize what is really important in life, things we have forgotten in this hectic, materialistic life..Watch the movie. You wont regret it one bit."}, {"rating": "9", "text": "Perfect example of why I never read critics reviews. If I ever get brain damage I can always be a movie critic, what morons. Watched it last night with my wife, it gives you a different perspective on life and death. Probably happens in real life more than one would think. We laughed and my wife cried. Enjoyed it!"}, {"rating": "9", "text": "very good, the setting were great, the idea of the movie was kind of dumb and well they meet and then go around the world , it ws a very good drama and well worth seeing"}, {"rating": "7", "text": "Cute and funny, but not exactly original. Not moving, but it does make you think. Freeman and Nicholson make a great pair."}, {"rating": "8", "text": "Very enjoyable film loved the characters, the locations and the story was quite moving."}, {"rating": "2", "text": "I feel bad for any true cancer patients going out to see this as an activity on their own bucket list."}, {"rating": "10", "text": "I will admit that at first the movie seemed to start off a little slow. But, as you watch the movie you realize that it explains the incredible bond that is created between these two terminally ill cancer patients. This movie is now near the top of my list as one of the greatest movies I have seen. It makes a person realize that your problems aren't nearly as bad as those of the people, family and friends who deal with this kind of problem. Enjoy."}, {"rating": "10", "text": "I find it kind of heartless how such a movie is dismissed as a piece of sentimental frivolity. Since when? I find it difficult to understand that this sort of movie is sentimental - it may be in parts, but that's not the point. This was about morality, about humanity, the human condition. To show you that you shouldn't blow all your life away, because of life's unpredictability. This had a meaning, a PROPER meaning, unlike other movies. I would highly recommend this movie, because when you cry during this movie, you will feel better for it. Sometimes it's good to cry, and where a movie can make you laugh and cry around the same time, there's no way you'd want to miss this. If you want a REAL sentimental pile of garbage, go check out Titanic, which in my opinion, is TOTALLY overrated."}, {"rating": "9", "text": "Truly don't understand the critics, yes some scenes were over the top: two cars crashing together, Nicholson's hairy arm after chemotherapy, etc. Truth is money can't buy you love or joy. Very touching film and worth watching, once again...what the hell critics."}, {"rating": "4", "text": "Between Rob Reiner, Jack Nicholson and Morgan Freeman there are some truly touching moments. But the missed opportunities are far too common. A real shame, too."}, {"rating": "7", "text": "A genuinely good movie that doesn't deserve the flack it received at the time of release."}], "recommendations": ["confessions_of_a_shopaholic", "seven_pounds", "greenberg", "minions_the_rise_of_gru", "the_art_of_racing_in_the_rain", "click", "bridge_to_terabithia", "pay_it_forward", "how_to_be_single", "funny_people", "the_vow", "17_again", "the_family_man", "3_idiots", "chef", "slumdog_millionaire", "yes_man", "the_blind_side", "the_lake_house", "passengers", "there_will_be_blood", "the_butterfly_effect", "tomorrowland", "the_adjustment_bureau", "burn_after_reading"]}