{"id": 3855, "title": "The Night Before", "starring": ["Joseph Gordon-Levitt", "Seth Rogen"], "runtime": 101, "genre": ["Comedy", "Adventure", "Fantasy"], "description": "In New York City for their annual tradition of Christmas Eve debauchery, three lifelong best friends set out to find the Holy Grail of Christmas parties since their yearly reunion might be coming to an end.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rfeNBaiMBg0UQsBQFv1qsjTjZWn.jpg", "categories": {"plot": 6.4375, "acting": 7.444444444444445, "ending": 8.166666666666666, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.518518518518518, "action": 9.0}, "reviews": [{"rating": "1", "text": "Painfully stupid and cringe worthy.  Sure, there's a few laughs here, but really, it's so incredibly awful that I wanted it to just end.  I would think the post-college crowd could be awarded with better writing.  Seems like a big haze of stupid song lyrics and unrealistic drug combos that awkwardly kept partaking in the same joke, over and over and over.  Seriously bad.  A few people left the theater--  something I would have done, yet my friend was my ride.  Terrible!"}, {"rating": "2", "text": "It is unfortunate that holidays in American culture have become an excuse for people to seek a giant party.  This movie, sadly, is more accurate than I'd like to admit when it comes to what people these days do during the holidays.  Being with those closest to you such as friends and family is the only thing I can pull from this movie that is of any worth.  What happened to families being together, appreciating one another, and even making it a point to be in a church service on a holiday that used to be regarded as religious? Now, all that seems to be desired is to get together, party, and goof off.  It seems to me that our culture needs to get its priorities back in line and this movie is the exact opposite of what our nation needs.  Although there may be some laughs provided, they only appeal to a side that is not necessarily uplifting within our nature."}, {"rating": "0", "text": "how the heck do movies like this keep getting made? first, it was god-awful, not funny at all. second, sloth rogen is awful. he's plays the fat sloth with the same idiotic laugh in every movie. it's a joke."}, {"rating": "6", "text": "If you're looking for mindless comedy that doesn't require any critical thinking skills, then this classic buddy comedy is for you.  It's somewhat predictable, of course, but this type of genre comedy usually is.  Joseph Gordon-Levitt and Seth Rogen deliver good performances, and Michael Shannon's character offers some comic relief and running gags.  The storyline for Mackie's character is the most predictable of all."}, {"rating": "5", "text": "The landing bag on The Night Before might be embarrassing to look at especially bringing three typical idiots at their best. The comedy here blew, but I did manage to have a few chuckles at it."}, {"rating": "0", "text": "Stupid, pointless waste of time and money. Seth Rogen's scam is to get paid to use his bloat to enhance marketability of junk movies. And this is junk...."}, {"rating": "0", "text": "Good movie to take your enemies to go see when you really want to torture them. I now know why Seth's fiance wants to bang other dudes, he's just all wrong."}, {"rating": "0", "text": "stupid awful bad story its not comedy at all .i think metacritic should consider a negative review below zero\rso this movie  deserve (-10 ) just dont watch it or you will get depressed"}, {"rating": "3", "text": "The Night Before is a silly attempt at a comedy. Sure, some scenes are funny, and some are just hilarious, but most of the movie is only there to make a reasonable runtime."}, {"rating": "9", "text": "(In carolling tone) Twas the night before Christmas and all was in order, then three childhood friends, with some drugs and some booze, brought much disorder.\r Some of my favourite Christmas movies of all time range from scared and helpless little boys stuck in the big apple, to a grown-up elf stuck in the big city, to an under appreciative working man looking back at the good in his life and the world as a whole. Christmas is always a joyous, overfilling and highly commercialized time of year with some redeeming life lessons mixed in for good measure. So it came to be a big surprise for me that, The Night Before, one of my new favourite Christmas movies of all time, brought something new to the holiday movie genre we have never seen before; narcotics, sex and a threesome bromance we haven’t seen this good since the early Apatow films.\r TNB1\r The premise is simple, the movie centers on three very different friends; Ethan, Isaac and Chris (played perfectly by Joseph Gordon-Levitt, Seth Rogen and Anthony Mackie, respectively) who start a new boys night Christmas eve tradition after the tragic passing of Ethan’s parents by a drunk driver. What starts off as a simple tradition of getting drunk, egg drop soup, a visit to the Rockefeller Centre Christmas Tree, and of course, like any good Rogen and company film, getting completely high and f*cked up, quickly turns into a search for the ultimate party. After a couple of years perfecting their Christmas shenanigans, the trio get wind of an epic and secretive Nutcracker Ball (think Great Gatsby-esque type shindig), that only happens by invite and to a very exclusive bunch. Unable to find the actual party for many years, the three give up and eventually mutually decide to end the tradition, seeing that Isaac is in the midst of having a baby and family, Chris and his high cost of success and fame as a football star, and all three moving on and getting too old.\r One of the best aspects of The Night Before, much like the previous Rogen/Gordon-Levitt collaboration 50/50 is the film’s fantastic ability to be silly, wild and completely chaotic, yet maintain a very emotional and deep connection of friendship, love and a believable bromance between three highly unlikely and different people. New to the Rogen crew this time around is Anthony Mackie (you may know him as Falcon in the Marvel universe), a very talented and versatile actor, who gathers as many laughs as Rogen and Gordon-Levitt within all of his scenes.\r Rogen, who is hysterical as always, uses his very apparent Jewish roots and heritage for the basis of his humor and the foundation of many laughs throughout. From foreshadowing a very symbolic crucifixion, to some hilarious blasphemous religious gags within or outside of the church, hilarious bar scenarios, and ultimately to one of my favourite dinner texting scene ever in a film, Rogen always brings the laughs to a maximum.\r TNB\r Gordon-Levitt, the cute and cuddly of the bunch, brings many nostalgic moments of friendship that really hold the emotional core of the film. Having recently suffered a break-up with his ex Diana (Lizzy Caplan), Ethan is easily the most lost of the bunch; roaming through dead end jobs (like serving hors d’oeuvres on Christmas eve dressed up as an elf), being an unheard musical talent and not doing much with it, to living alone while Chris grows professionally and Isaac as a father and husband, Ethan gains much of the holiday empathy we are so used to chucking around this time of year.\r While The Night Before is surely an acquired taste for many, the movie aims for a mostly young demographic overall. My parents wouldn’t be the people I’d recommend the film to, especially given the very strong hints of marijuana flooding the theatre, The Night Before proves to be a perfect buddy holiday cinema-going experience from beginning to end.\r Like any good Rogen and company film, the film is filled with unexpected and sometimes utterly perfect cameos and roles for some amazing actors, including Michael Shannon (Man of Steel), who plays Mr. Green, the boys’ drug dealer and whimsically mysterious entity; to Jillian Bell (22 Jump Street), who plays Rogen’s wife and drug supplier for the group, to Miley Cyrus who rings in a great cameo and fantastic little over-the top scene, to Mindy Kaling, Jason Jones, Jason Mantzoukas, Randall Park (The Interview) and Tracy Morgan after his very public and publicized car accident.\r TNB0\r As we grow older and stressed, Christmas is never really our thing, whether or not we believe in the holiday at all. Between the commercial onslaughts, to the joyous overkill, the holidays become more of a dreaded family melodrama more than anything. Thankfully, The Night Before is a perfect way to counteract all your holidays blues, while still staying in the Christmas spirit."}, {"rating": "7", "text": "The standard for over-the top gross out comedy is the payoff worth the defilement? For example: after seeing a mail-it-in Sandler-esque movie, one simply feels violated (especially in the pocketbook and timebank; ie: could have scheduled a colonoscopy instead.) In this uneven but hilarious romp, Seth Rogen rants & steals his way to some of the all time classic scenes, that places his performance and the movie's other shenanigans amongst the all-time Bad Santa-like class(less) holiday staples."}, {"rating": "9", "text": "Not your typical Christmas movie, but what a howl.  Along the lines of \"Bad Santa\" it's irreverent.  But I need some contrast to the usual Christmas movies (Scrooge, 34th Street, etc.)  And as usual, putting the 3 amigos (Gordon-Levitt, Rogan, and Franco) together makes for a raunchy, joke filled, sexual innuendo packed movie.  And the supporting actors play it straight, like it's a real Christmas movie, which makes it even funnier.  Don't know why everyone gave it such low ratings, or maybe I'm weird."}, {"rating": "7", "text": "The Night Before was one of the films I was the most excited about for late in 2015. Joseph Gordon-Levitt and Seth Rogen reunite with Jonathan Levine, the director of 50/50 which was an excellent film. Levitt stars in the second of three films to be released this year as he has been working hard and expanding his acting range with dramatic performances in The Walk and Snowden later this year.\r The writing for The Night Before was better than I thought it would be and there is some emotional parts in the movie and you never really feel like this movie solely exists to make you laugh. You can connect with the three friends in Rogen, Levitt and Mackie all of which have their own struggles in life that they have to deal with throughout the night. There is also a character Mr. Green, played by Michael Shannon, that has some significance that you would never notice at the start of the film, but his role in the film becomes more and more noticeable as the film goes on and in the end you get a very interesting reveal.\r The thing that brought The Night Before down a little was the humour. There were several scenes in the film that were really, really funny but it was not consistently funny like Neighbours was last year. I’m sure that there will be people that will find this movie to be one of the funniest this year but to me some of the humour just didn’t catch. There are some cool cameos to watch for that are pretty funny though and that makes the film even more enjoyable.\r All together I enjoyed the Night Before and although it may not be considered a “classic” holiday comedy I can see myself watching this one over again at Christmas time in the future."}, {"rating": "7", "text": "This movie offered a lot of laughs and you can't help but cheer on to hear the next joke. The Night Before is not Seth Rogens best, but it's still a good time. It might not offer the best comedy this year, but it offers laughter to remember, and I think it's a good offensive type Christmas movie. This is a hate it or love it. And I liked it, It offers good laughs."}, {"rating": "7", "text": "The purist goal for a comedy is to make the audience laugh, and it succeeds at doing that. It helps that each of the characters played by Gordon-Levitt, Rogen and Mackie are all likable characters, with problems that any average person could relate to. My only problem with the story is the lack of backstory for any character, even the main character. We get the jist of why he is the way he is, but there's another aspect that I feel was completely skipped over. Nonetheless, it's a funny movie with good spirit."}, {"rating": "8", "text": "\"The Night Before\" is   a   great   theater   experience   with   tons   of   laughs, heart,   and holiday cheer. One of the best comedies of the year"}, {"rating": "9", "text": "I feel like this kind of movie shouldn't get such a high rating but nonetheless this film deserves it. Genuinely, this movie ticked all the boxes I look for in a Christmas film and spoof as well as a dramedie. The references to Christmas traditions blend in so well with overall dismissal of tradition so you can move on with your life is perfect, I guess a couple flaws may come from the fact that there were some conflicting elements in the abruptness being good and bad from Joseph Gordon Levitt's character, and the abusal of drug jokes (Seth Rogen....so it HAS to be included....). But Overall, the simplistic nature of the drama it proposed worked so well with the sweetness of the comedy. This comes close to elf as my favourite Christmas comedy of all time."}, {"rating": "8", "text": "Another constantly funny comedy from Seth Rogen and friends! Rogen, Joseph Gordon-Levitt, and Anthony Mackie worked great together and there were plenty of unexpected cameos throughout to keep things interesting as well. The holiday setting and atmosphere was also rather enjoyable. Overall, despite what I considered to be a few over-the-top moments, the film was consistently funny and even had a great heart to it! That's all that I wanted from this film and that's all that I got! I couldn't have asked for more!"}, {"rating": "8", "text": "If you have ever seen anything with Seth Rogan you already know its about drugs, sex, and saying **** a lot. But it is still a funny and enjoyable movie. Not going to win any oscars but good for a few cheap laughs. Starting to worry that Seth Rogan is going to eventually turn out to be like Adam Sandler where his audience will grow up but he won't But for now get a few cheap laughs and enjoy."}, {"rating": "8", "text": "Not your typical drug-fueled urban fantasy.\r I can't tell if my immense enjoyment of The Night Before comes from a glitch in my SRI meds or if it is actually a great comedy but I laughed all the way through.\r It's the most consistently funny entry in the Seth Rogen oeuvre in more than a few years and is surprisingly mature for the genre.  That's not to say it's not loaded with sex, drugs and vomit ( it has all three) but there are layers of genuine emotion that play out as an almost Dickensian holiday fable.\r If you're looking for some genuine laughs to offset the horror of your family this holiday season, this movie won't disappoint."}, {"rating": "8", "text": "It's The Hangover for the holiday season. A raunchy Christmas movie with that Seth Rogen brand of comedy. Drugs, sex, and magical Christmas weed, The Night Before is stuffed with plenty of R-rated humor. All of it is funny.Nobody is really given a chance to show off their acting skills. A big shame considering Joseph Gordon-Levitt is usually fantastic. Events move at a brisk pace. Yet it still manages to fit in morals of friendship, growing up, and the Christmas spirit in.It's got plenty of laughs and great cameos. Seth Rogen is a laugh riot, playing a character that's high out of his mind throughout most of the movie. The Night Before is a great Christmas alternative if you're looking for more adult humor."}, {"rating": "6", "text": "If you like Seth Rogen movies, then you'll like this one. If you don't, you won't. This was basically just the same movie he always makes with a Christmas theme to it. It was about an hour too long and had about a dozen good chuckles scattered throughout and a couple of really awkward heavy-handed moments. I wasn't upset that I watched this movie, but I can't recommend it to anyone but Rogen fans."}, {"rating": "6", "text": "By now, most cinemagoers should know what to expect from a Seth Rogen vehicle, lewd comedy with plenty of sexual references and dick jokes, pop-culture references, cringeworthy awkward situations, and drugs, lots and lots of drugs.\r So if you’re a fan of the more low-brow elements of Rogen-Goldberg comedy, and in this case director Jonathan Levine too, then you’ll enjoy all the madness involved around this sometimes surprisingly touching tale of evolving but eternal friendship, and the “spirit” of Christmas.\r But if you’re not a fan, or are easily shocked and offended, then there’s probably no need to read on and you should avoid ‘The Night Before’ like the plague.\r Seth Rogen and his ’50/50′ co-star Joseph Gordon-Levitt star alongside Anthony Mackie as three friends who are being pulled apart by careers and family lives, and who are brought closer together by drug-induced Christmas “miracles”, as well as several other theme-appropriate Dickensian constructs like psychedelic mushroom visions of Christmases past.\r ‘The Night Before’ is every inch the unconventional Christmas comedy, complete with touching moments in a morality tale with a happy ending, but it’s also clearly an outrageous and silly irreverent comedy with a fully crammed narrative that’s all over the place.\r Let’s be honest here, ‘The Night Before’ is no comedy classic, it’s not even one of the better Rogen-Goldberg collaborations. But considering their controversial and hugely disappointing previous collaboration in ‘The Interview’, this is certainly not the worst and has more than enough genuine hard belly-laugh humour to be better than most Christmas comedies you’re likely to see anytime soon.\r The Bottom Line…\rLittered with irreverent lewd comedy and drug references, ‘The Night Before’ is unapologetic low-brow Christmas comedy that won’t be to everyone’s taste, but with an outrageous & creative capturing of Dickensian literature and some legit side-splitting humour, it’s surprisingly enjoyable escapism and a good way to spend a couple of mindless holiday hours."}, {"rating": "0", "text": "Do you find refrences to pop culture funny? If so you will love this movie. Ha ha. Set Rogen is on drugs. That's so funny.  Lots of swearing and a general essence of obnoxiousness.  Ha ha. A real festive treat."}, {"rating": "4", "text": "Three buddies (Seth Rogen, Joseph Gordon-Levitt, Anthony Mackie) get together for their annual Christmas Eve debauched adventure in NYC. Sounds like it could be hilarious and there are some laffs. Unfortunately, it's usually just silly and even becomes serious with the warm holiday message. Rogen gets to play the fool  and his seemingly ad-libbed wisecracks provide much of the fun. There are a few cameos that are amusing, primarily because of their presence, as opposed to good gags. While it's energetic and even frantic, there's not enough genuine humor and too much attempted drama to make it worth the eve (or matinee)."}, {"rating": "6", "text": "An uncommon holiday treat, Jonathan Levine's \"The Night Before\" is both raunchy and endearing, nearly overcoming its over-reliance on improv and unscripted humor."}, {"rating": "7", "text": "Jonathan Levine knows his way around comedies with heart in them.  In The Night Before he definitely gets the comedy down, but the heart feels forced at times.  While it is no 50/50 I still really enjoyed this film.  B+"}, {"rating": "7", "text": "If anyone can combine A Christmas Carol and weed, it's Seth Rogen and friends. Any movie that features narration by Tracy Morgan (actually says \"he axed\" at one point) and Michael Shannon as a magical weed dealer  can't be all bed."}, {"rating": "9", "text": "This movie was surprisingly really good. Firstly the performances of this movie was great. There were so many laugh out loud scenes. Sure the movie does not have much substance but what really made me enjoy this movie is the fact that it is about friendship and how it changes when time passes by. There were great cameos in the movie. However, I think the storytelling was out of order and the love story does not sell much.In the end “The Night Before” is a great a Christmas movies to watch with friends."}, {"rating": "8", "text": "Found this movie to be quite funny. Yes, the story is quite predictable towards the end and it lacks a bit in that way, but as I often don't like Seth Rogen's movies that much, this actually was pretty great and not too much with his dumb kind of humor or about weed - even though that is in it too."}, {"rating": "7", "text": "Maybe I'm a sucker for Christmas movies, but I found The Night Before to be enjoyable and worth a watch. I wasn't expecting too much from this Seth Rogen affair but was pleasantly surprised. It has the typical stoner vibe as many of Rogen's films but it doesn't hit you over the head with it. Great performances by all involved and it's totally worth seeing, just keep expectations in line!"}, {"rating": "6", "text": "There were definitely some funny moments but overall it was not as good as some of Seth Rogan's previous movies. However, there is a good chance I will be watching this every Christmas."}, {"rating": "7", "text": "Levine's holiday bro-medy boasts surprising thematic scope - grappling with pre-parental anxiety, celebrity, loneliness, and an overarching fear of growing out of boyhood mischeivety -  that more than make up for its corniness."}, {"rating": "5", "text": "The Night Before. What the latest Christmas tradition leads to. A well-filmed, but completely empty Christmas comedy of jokes in which 2-3 things constantly revolve."}, {"rating": "6", "text": "Funny, but a little underwhelming... Honestly was expecting more, especially with a cast that includes Rogen, Mackie & Gordon-Levitt"}, {"rating": "10", "text": "I love this film, I watch it every Christmas now.It doesn't take itself too seriously and is a lot of fun to watch."}, {"rating": "5", "text": "A dull and predictable stoner flick. The premise seems to be as simple as, give a man a lot of drugs and watch what happens."}], "recommendations": ["elf", "neighbors", "friday", "night_at_the_museum", "sisters", "blended", "bad_santa", "fred_claus", "american_pie", "wanderlust", "american_pie_2", "step_brothers", "date_night", "american_reunion", "christmas_with_the_kranks", "parental_guidance", "old_school", "a_bad_moms_christmas", "ted", "21_jump_street", "just_friends", "meet_the_fockers", "wild_hogs", "yes_man", "bad_trip"]}