{"id": 1388, "title": "The Ring", "starring": ["Naomi Watts", "Martin Henderson"], "runtime": 115, "genre": ["Horror", "Mystery"], "description": "Rachel Keller is a journalist investigating a videotape that may have killed four teenagers. There is an urban legend about this tape: the viewer will die seven days after watching it. Rachel tracks down the video... and watches it. Now she has just seven days to unravel the mystery of the Ring so she can save herself and her son.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/e2t5CKMox7tjv3iD3Ko7NdFa5lJ.jpg", "categories": {"plot": 6.928571428571429, "acting": 6.9411764705882355, "ending": 6.166666666666667, "soundtrack": 5.0, "cinematography": 7.5, "familyFriendly": 4.75, "funny": 4.0, "action": 7.111111111111111}, "reviews": [{"rating": "8", "text": "A pretty good movie when it comes to plot and acting, but what about the scares? Or should I say, what scares? It's not scary whatsoever, it's just an entertaining, well done dissapointment, because I heard so many people say it was TERRIFYING or PEE-WORTHY and it's not even close to any."}, {"rating": "4", "text": "Before you die, you see 'The Ring,' \" as the ads for this American remake of a famous Japanese suspense film tell us. With ads like this, the movie has certainly built up a lot of anticipation. But while impressively made, this impassive and cold feature fails, in a spectacular fashion, to deliver the thrills.\r The film, which opens nationwide today, is about an urban legend that has come to life: whenever a mysterious, unlabeled videotape is run, its unlucky viewer gets a phone call just after seeing it. The voice on the other end of the phone says simply, \"Seven days.\" It's how long the viewer has to live — and the corpse looks like something out of a Francis Bacon daydream.\r When her niece dies after seeing the tape, Rachel (Naomi Watts), a Seattle reporter, decides to investigate the rumors. And that's when \"The Ring\" begins its downward spiral. She watches the freakout videotape, which looks like a director's cut of \"Closer,\" the video that starred the band Nine Inch Nails, complete with suffering animals, a fly crawling across the screen and static-ridden flash cuts. As music-video effluvia goes, this tape is not even as unnerving as the outfits Lenny Kravitz wears to the VH1 fashion awards.\r Much of what follows consists of close-ups of the clues that Rachel, desperate to beat the clock and stay alive, sifts through to solve the mystery. The screen-filling shots of newspaper headlines and photographs chronicling the grisly deaths could be from a different kind of horror movie: \"Night of the Working Dead,\" starring Nancy Drew.\r Initially, Ms. Watts, the versatile star of David Lynch's \"Mulholland Drive,\" does a fine job of communicating Rachel's off-putting toughness. Under the best of circumstances, she scares everyone but her son, Aidan (David Dorfman), and based on the dark circles under his eyes and his solemn, old-man's enunciation, he's got problems of his own. But once it becomes clear that tight-jawed anxiety is surprisingly the only note on her piano, the movie feels numbed. Eventually, the phone calls don't even generate the anxiety of telemarketer hits that come during dinnertime.\r The director, Gore Verbinski, stages the opening with a tribute to \"Scream,\" which itself was a tribute to \"When a Stranger Calls\" — the first scam thriller in which every single scare was in the movie's trailer. Perhaps the most puzzling thing about \"The Ring\" is that it seems to assume that horror-movie audiences have no memory.\r David Dorfman, with his \"Village of the Damned\" haircut and precocious maturity, seems to have studied at the Haley Joel Osment School of Fine Acting. Though there are a few chilling moments — one big scene involving a horse on a ferry is spectacular — everything in \"The Ring\" feels recycled, including the picture's look and tone, which are reminiscent of \"The Blair Witch Project.\" \"Ringu,\" the Japanese original of \"The Ring,\" preceded and probably inspired \"Blair Witch.\" Copies of the director Hideo Nakata's 1997 cult classic have made the underground circuit like the deadly videotape that fills the center of the plot of \"The Ring.\"\r \"Ringu\" felt like an era-defining scare picture: whispers about its imminent remake have been drifting through chat rooms since word of its existence first made it to America. But the real spark came from the \"Closer\" video. And \"Closer,\" the director Mark Romanek's grim, romanticized nightmare, with its well-appointed nihilism — honey dripped over Buñuel — was the perfect integration of visuals and the morose showmanship of the Nails leader Trent Reznor.\r At least the channeling of \"Ringu\" in \"The Ring\" is reverent. Unfortunately, there are other problems. Mr. Verbinski can assemble a movie like a machine, which worked for the scare comedy '`Mouse Hunt.\" But here, the mechanical assembly simply emphasizes how devoid of feeling the film is. One particular scene is just such a hollow set piece: a mentally handicapped young man pushes himself backward on a carousel while yet another crucial nugget of plot information is delivered. \"The Ring\" is there to be admired instead of to creep you out. There's also much huffing and puffing to add a psychological underpinning to the plot.\r \"The Ring\" also rejects the fear-of-girls stain that covered its original. The cinematographer Bojan Bazelli does tone up the bleary-eyed interiors — the movie's color scheme is \"Exorcist\" green and rotting-plaster white — but it doesn't make much difference; rather, it just exaggerates the relentless sameness. The Seattle location must have been chosen for its sunless, drizzly skies; there are so many shots of car windows weeping with rain that theaters should pass out squeegees.\r This seems to be the season for horror movies that are basically teases — offering a promise of a good scare and then running away before delivering. \"The Ring\" is just one more in that cycle."}, {"rating": "0", "text": "All I gotta say is how is this movie got a pg13 rating and not r that’s all you need to know"}, {"rating": "4", "text": "Oh my. I still don't understand why this fascinates people so. I bought this as a special edition DVD after hearing so much about it. And, well. It doesn't really scare. It's got some interesting plot pieces, and it's fine to watch... but it's really an overproduced, over-hyped, and rather awful horror movie. The Village will give more shock value, and the 'psychological horror' is simply not there. You won't have nightmares. You'll barely bat an eyelid. Most of the film is spent expecting something interesting to happen. It does. Maybe twice. Worth a cheap buy, or a late night boredom-killer."}, {"rating": "6", "text": "Though I am not a huge fan of horror movies, I was pleasantly thrilled by this movie. Unlike a lot of movies, The Ring did not focus solely on sex and violence to sell the plot, nor did it rely on sudden jolts or murderers jumping out at the character in order to scare the audience. Instead, most of the horror came from the expectation of something scary, or from the disturbing nature of what was happening; the famous TV-scene was enough to make me avoid my television for a couple of hours. All in all, it was an entertaining movie and piqued my interest in the second one."}, {"rating": "9", "text": "It is scary, it is suspenseful, and it has a great story. The acting was excellent, and you never know how its going to end. It was one of the scariest movies I have seen, although movies don't really scare me that much."}, {"rating": "10", "text": "Excellent movie."}, {"rating": "8", "text": "Come on, what are people looking for? One of the scariest lines I've ever heard/seen. \"Mom you weren't supposed to help her\". I know it's a copied Americanized version but still unique to us. As scary to an adult as a movie can be in my opinion."}, {"rating": "8", "text": "A compelling and interesting movie which has unfortunately been mislabelled as a horror movie. It would be more appropriately dubbed a supernatural mystery."}, {"rating": "8", "text": "First of all I am not a big fan of horror or shock movies, though I'll check one out now and then. I didn't know what to expect with this flick, but it ended up being the first film since the exorcist that had me feeling a steady chill of creepiness coursing through my body the whole time. There were a few \"gotcha\" shock  moments, but they didn't hit that hard. The strength of the film is it's mood/aura.  I have to knock a few points off though because of some minor plot holes and some things not being explained/fleshed out in a way that would have been proper and satisfying for this movie.I also don't get what it was about the TV scene that stuck with so many people. The whole scene in the well is the one I'll never forget. Just gave me such an ultra creepy feeling.Oh and one last note - I really want to impregnate Naomi Watts."}, {"rating": "7", "text": "I had the chance to watch The Ring again over the weekend as I hadnt seen the movie for several years and had fond memories of it when it first came out. The movie holds up fairly well despite that the flickering creepy visuals which on release seemed fresh and original are now very common place in film and television. The tone and the creepy atmosphere are still what the movie does well, its very relieving to watch a horror movie that doesnt rely on violence and gore to get its message out. The acting and characters do their job and the plot holes arent big enough to be too distracting. Overall I would still consider The Ring one of my favourite modern horror movies, still being creepy and intriguing, despite perhaps not standing out of the crowd as much as it once did."}, {"rating": "8", "text": "A great thriller with a great plot, and several scenes with alarms and can best be left to the final scene where Samara is finally seen coming out of television to make just another victim in his gaze. The film manages to leave you \"stuck\" until the final minutes and then you wonder what will happen."}, {"rating": "7", "text": "In my opinion The Ring is one of the better scary movies of all time. I saw this at age 11 and I remember having nightmares for weeks about it. I don't care who you are, this sh*t will creep you out."}, {"rating": "2", "text": "The cast does a decent job but this is such a needless, Americanized remake. It's not scary, Fails to remain even the least bit interesting after the first 1/3 of the movie and the ending is kind of a slap in the face."}, {"rating": "4", "text": "The Ring is too slow with nothing interesting happening for most of the movie. It's a disappointment when comes to being scary and providing any thrills."}, {"rating": "4", "text": "The overall idea of the film is great and should provide for interesting movie watching, but the film is a total bore. Who wants to see a movie where the main character is annoying? Some many questions, so little answers."}, {"rating": "8", "text": "There are far scarier films out there than The Ring, but that does not mean it did not scare me at times. There are some truly terrifying moments to be found in The Ring, but really, where it succeeds is a non-reliance on those scares. Through a truly creepy atmosphere set by director Gore Verbinski and composer Hans Zimmer, The Ring keeps you on edge without having to terrify you. In this way, The Ring is far more thriller than horror film, rather it is a thriller with horror elements. The way it adds to this with a great mystery/detective component as they try to figure out the backstory to the tape is captivating and truly engaging. I know it is a remake, but it still felt very refreshing in that way. Naomi Watts is great in this one, as are David Dorfman and Brian Cox. There may be scarier horror-type films out there, but not many as well crafted and put together as The Ring. What it lacks in scares, it more than makes up for with great direction, music, acting, and a killer story."}, {"rating": "7", "text": "Gore Verbinski made a highly thrilling movie, although there are almost none of the usual shock effects. It's no masterpiece and sometimes there stay gaps in the plot, but all in all, this is is a great psycho thriller with two really good child actors."}, {"rating": "6", "text": "The Ring is a clever script that doesn't quite come through in the clutch. It leaves so many questions unanswered at the end of the film that it is frustrating. However, the entire movie keeps the viewer on the edge of their seat wanting to know what will happen next. There are satisfying moments of suspense, tension, thrill, and fear. The film lacks exposition which hurts the main characters like-ability throughout, but despite the writing flaws Watts and Henderson do a decent job. The cinematography is breathtaking for a horror film and the sound mixing is exceptional. I have not indulged in the second of the series yet, but after this strong showing I will absolutely check it out. The Ring is a a few answers away from being a groundbreaking horror hit, and for die hard horror fans is a must see."}, {"rating": "10", "text": "This is my favorite hour movie of all time,  I have never seen such an impressive horror movie with jump scares, lost changes, sudden changes, and disturbing imagery. This movie truly leaves you with something to think about in the end."}, {"rating": "4", "text": "To describe The Ring, two adjectives leap to mind: spooky and lame. The former refers to the tone and atmosphere, which are about as good as it gets for a ghost story. The latter refers to the storyline, which is about as poorly constructed as can be imagined – a sad amalgamation of irritating contrivances and gaping plot holes that defy even a generous attempt to suspend disbelief. And, while I normally appreciate open-ended motion pictures, The Ring takes things too far by leaving about 75% of its questions unanswered. This isn't an artistic choice; it's screenwriting sloppiness, and it results in a profoundly dissatisfying experience.\r I knew the moment I exited The Ring that I didn't like the movie, but the gloomy atmosphere is so seductive that it took me a while to realize why. The problem lies in the storytelling. The Ring is an incoherent mess, and the more you reflect upon it, the less credible it becomes. (Note: I'm using the word \"credible\" within the context of the horror/ghost story genre.) The movie seems to have been slapped together without concern about whether anything makes sense. The twist ending feels like something grafted on, and it left me with a question about which was more absurd – the revelation discovered by the main character or the manner in which she makes the discovery.\r People who are easily unsettled by ghost stories will be freaked out by The Ring. Director Gore Verbinski has studied the masters and understands exactly what it takes to create the perfect \"boo!\" moment. The loud noise, the sudden movement, the musical stinger – they're all there, and Verbinski employs them with enough skill to apply the \"gotcha!\" to even the most jaded, veteran horror fanatic a time or two. Unfortunately, that's about all this movie has going for it – quick, cheap thrills. The Ring is a remake of a Japanese movie that I have not seen. Fans of the original swear by it, which leads me to believe that it must be a lot better than the American version.\r Naomi Watts, making her follow-up to David Lynch's Mulholland Drive, is suitably appealing as Rachel. (Is it just me, or does Watts resemble a blond version of her friend, Nicole Kidman?) Martin Henderson is fine as her ex-boyfriend and investigative partner. And Brian Cox has a chilling cameo. Unfortunately, the other key player, child actor David Dorfman, is a blank slate. He comes across as a knockoff of Haley Joel Osment in The Sixth Sense – and that's a performance I wasn't terribly excited by in the first place.\r I don't recommend The Ring, but it's the kind of movie that could play well to small groups watching it on TV with all the lights out. At least there's no overload of gore – Verbinski has elected to go the suspense route. Unfortunately, he has such a weak script that his efforts amount to a not-so-triumphant victory of style over substance."}, {"rating": "8", "text": "Fairly decent adaptation of the original one. Well acted, well paced, interesting and convincing. Some truly disturbing scenes, lots of scary stuff, earned jumpscares, suspense, a good musical theme and an ongoing eerie sensation."}, {"rating": "7", "text": "A pretty good horror movie better then The Grudge. It's scary, fighting and I wanted to see there this has going to go................................"}, {"rating": "8", "text": "The American remake that launched 100 more American remakes to varying degrees of quality. The truth is if the movie wasn't so damn good it wouldn't have started such a big trend. That being said its really one of the only ones that adapts it's source material quite successfully. It takes the story of an evil girl whose thrown down a well and haunts a cursed video tape. That if you watch it you get a call and only have 7 days to live. It's truly a nightmarish concept that has an urgency that just works. The original Ringu is superior and a brilliant film that is saturated in Japan's religion and mythology. Director Gore Verbinski (Pirates of the Caribbean) adds a domestic spin to the material that doesn't overdo it and just works. I remember going to see this at a preview show weeks before it came out and people freaked during the finale. In fact one grown man ran out of the theater. It's easy to see why the film was such a word of mouth big hit and deservedly so. From the stylish direction to the star making performance from Naomi Watts (Mulholland Drive) as well as solid work from hunky Martin Henderson (Torque), David Dorfman (Texas Chainsaw Massacre), Amber Tamblyn (Grudge 2) and Brian Cox (X2). Unfortunately it was followed up by an overly mediocre sequel and an awful reboot. Hopefully somewhere down the line they'll be able to continue it all successfully. A direct sequel to the first wouldn't be a bad idea.Budget: $48mDomestic Box Office: $129Worldwide Box Office: $2494.25/5"}, {"rating": "8", "text": "This film tells the story of Rachel, one journalist and single mother who investigates the death of several teenagers who saw the same videotape. According to legend, the video tape kills those who watch it in seven days. During the investigation, however, Rachel will eventually endanger herself and also the people she loves.Directed by Gore Verbinski, this film is perhaps one of the most famous and interesting psychological horror films of the recent years. The cast is led by Naomi Whats, Martin Henderson and David Dorfman, in the role of Rachel, her ex-boyfriend Noah and their son Aidan, a child who has an intelligence higher than normal for his age. Naomi Whats deserves a certain prominence, having got here one of the most memorable performances of her career to date.Adapting for the screen a novel by Koji Suzuki, this film has a very interesting soundtrack, which further deepens the suspense and expectation, that are just right for lovers of this refined kind of terror. A reference movie and worthy of congratulations."}, {"rating": "7", "text": "With competent direction and a chilling atmosphere, \"The Ring\" gets right under your skin and terrifies the crap out of you."}, {"rating": "7", "text": "I'd like to start off by saying that this is one of those movies that I watched purely based on a curiosity factor (I just made that up lol). Its a movie along the same lines as the Blair Witch Project, whereby people talked about it quite alot and it got hyped up, the story sounded intriguing and so you wanted to watch it and decide for yourself whether it was as good as the hype indicated. I was aware that this movie is an American remake of a popular Asian (I think Japanese) movie, similar to movies such as The Grudge which was also originally an Asian movie which became very popular and America took note of this and chose to try and remake it into a movie to suit Western audiences. I have to say that I'm aware that such movies as these, which are often labelled as being horror movies, don't tend to 'go down' too well with me personally but yet that aforementioned 'curiosity factor' tends to get to me in the end and I'll end up watching these movies anyway as the premise interests me enough to see what its all about, so to speak. I remember being particularly dissapointed with The Blair Witch Project, with its ending making me want to shout 'is that it?!' at the TV screen at the time but I'm happy to say that I feel that this movie was slightly better, although I can't say that I was overly keen on the ending.Unlike The Blair Witch Project, The Ring doesn't entirely rely on your mind conjuring up your own images of 'the boogie man' who you somehow know is there but yet cannot see, in this movie said 'boogie man' is actually a young girl with long black hair, whom you can barely see her face and little is known about her for some time into the movie. However, similar to said other movie, this movie doesn't feature a great amount of action scenes, of true horror material I'd say and I would, to an extent, dispute the label it seems to have been given as being a horror movie, instead I'd say its more a sort of a mix of a psychological thriller and even a partial ghost story. There are definitely scenes that will make some people jump and there is indeed a smattering of moderate violence and unsettling images, mainly in the footage on the infamous tape which is shown in the movie, so I wouldn't say that its not at all scary, although I didn't feel scared personally, it was more...unsettling I think is the word. For example, there is one very brief scene in 'the tape' whereby you can see that somebody's finger is about to be impaled on a nail - lovely(!) unsettling and makes you flinch but not really scary as such. It should probably be said that there are other scenes further into the movie which are more likely to make you jump but its mainly spooky and unsettling rather than being at all gory.I found the movie pretty engrossing, although I found myself surprised by the plot to an exent. The story wasn't quite what I expected, with the emphasis being on Rachel trying to identify and trace the locations that appear on 'the tape' thus hoping to unravel the mystery behind its origins, which does, slowly but surely, happen but in a way its a shame as it becomes more human in a sense (does that make sense?) and there aren't too many real 'shock factor' scenes in the middle of the movie, as the mystery unravels, by that point in the movie its more like a crime thriller than it is a horror movie really and I found myself struggling a bit to fully grasp the plot turns, particularly in the final scene, which is rather gimmicky and I felt was a bit of a let down, although I would say that overall this, to me, was a better movie than The Blair Witch Project, I felt it was more entertaining and engrossing overall but it certainly wasn't without its 'quirks' shall I say. To summarise, I'd say that this isn't the worst movie of its type, certainly that I've seen, yet at the same time it has its issues - its engrossing but a little confusing and a bit slow moving, plot wise, mid way through. Some people would probably be a bit disappointed in the lack of scares roughly, again, mid way through the movie but on the other hand, I never felt compelled to switch it off and I felt like even though it has flaws, its still entertaining and somewhat intriguing somehow.I can't deny that I still found it rather engrossing and I suppose entertaining while watching it and I'm sure people who are perhaps more keen on such movies will find a few scenes that will 'creep them out'. I feel that this isn't the worst movie of its type, though its not for me it probably will be enjoyed more by others, so I suppose I'd cautiously recommend it."}, {"rating": "8", "text": "The Ring is one of my favorite horror movie. It is a remake of japanese horror film named RINGU.The introduction to this film is very smart. After few minutes into the film you realize just how mature and suspenseful of a film this really is. The characters are great. Rachael Keller is the perfect journalist. Noah Clay is sort of a comic relief, he's sarcastic and stubborn but is also very smart.Film is very unique in it's style, full of flash backs, creepy imagery, nightmares, mysteries, and hallucinations. It's very bizarre and surreal at times, which isn't very out of place since this is a supernatural horror/thriller.Overall, I would recommend this movie to any one with intelligence and an imagination. It is an amazing horror movie. I loved it and so will you, trust me."}, {"rating": "10", "text": "This is the best movie of all time! I personally can't see what people are moaning about! I was so scared when Samara came out of the T.V. It is the perfect horror movie, and Naomi Watts played the part perfectly. My friends love it, I love it, so it IS the best movie ever made!"}, {"rating": "10", "text": "A haunting and hypnotic show fueled by a flawlessly determined performance from the extraordinarily talented Naomi Watts."}, {"rating": "10", "text": "Scary as hell."}, {"rating": "10", "text": "I consider \"The Ring\" to be a classic now. It's scary, suspenseful, and engaging. The twists and turns of the story keep you guessing even in the slower parts of the film. \"The Ring\" is really more of a mystery with some elements of horror than straight-up horror. There are definitely some very scary scenes such as the opening scene and when Samara comes out of the TV, but the film is really about trying to crack the curse. The fact that the main character, Rachel, only has seven days to break the curse adds an extra level of tension. \"The Ring\" also has great acting from the entire cast, and the cinematography is amazing. This really isn't the sort of movie that resorts to jump scares and excessive gore to scare the audience; it's all about tension and atmosphere. \"The Ring\" is definitely one of the better, if not, the best remake of an Asian horror film. It's really one of the best horror movies of the 2000's."}, {"rating": "10", "text": "I guess this movie got mixed reviews from critics because it's a remake. I saw the American version before the Japanese one, like most Americans. I saw The Ring in theaters when I was 14, and it terrified me to to no end. I lost sleep. I watched it again and it still terrified me. This is the scariest movie I have ever seen. Movies are scarier the younger you are, and they're also scarier in theaters than at home."}, {"rating": "9", "text": "I'm perplexed by all of the negative ratings this movie has received. First, the design of the movie is spot on. It's dreary and rainy and everything seems tinted blue, which gives the film an aura of dread and discomfort throughout. This is good though, because it complements the story really well and so it puts you in the right mood for the film. Next, I found the story to actually be really interesting. It follows Naomi Watts as she does some investigating into the inexplicable deaths of some kids (one of whom she knows), and so you find out the twists and turns of the plot just as she does. While it obviously has supernatural elements, it operates in a realm that is plausible, where the characters make intelligent decisions, and where there aren't any cheap scares. You actually care about the main characters and you feel as curious as they do. I also like how, as opposed to the original, there isn't a lot of unexplained exposition. Rather, Watts actually has to SEARCH to put her story together, and added plot elements I think clear the story up and make it more compelling. In terms of scares, it doesn't have many, but that doesn't mean it isn't a scary movie. Again, the scares come from how the film is. It just feels creepy and chilling, and so instead of multiples scares with breaks of comic relief, it's just one long drawn-out scare. You still see Samara out of the corner of your eye when you're home alone at night, and you still jump when the phone rings. One of my favorite horror movies. Chilling, smart, entertaining, and well made."}, {"rating": "10", "text": "Naomi Watts is great and the movie is incredibly scary."}, {"rating": "10", "text": "It's a real horror thrilling film with actual goosebumps raising on your arms. And it holds a perfectly gripping story- very horrific and violent though. The film is effective on the mind and is visually brilliant through horror and graphic. The tape is very scary as Gore Verbinski has made it. Very gripping and a masterpiece from start to Finish. Now, a normal sensitive person wouldn't watch this movie because its very very scary movie but if you look it by thriller it's very intense and gripping. The tape is very unusual and weird telling the horrific story of Samara Morgan the main focused part of the movie- the villain and the controller of the tape. You wouldn't get the climax and you would with Samara creaking out of the tv that the camera guy is watching."}, {"rating": "6", "text": "The Ring provides its fail share of thrills but fails to provide enough scares to live up to its \"horror\" premise, even with its interesting plot and characters."}, {"rating": "7", "text": "Growing up I was terrified by this movie so I thought I would watch it again cause it was on Netflix. Naomi Watt's is incredible in this,  the film is incredibly light on scares as I would define it as more of a mystery/thriller film than horror. Still, its shot incredibly well and is extremely atmospheric in a way that works and even then its a film that holds up well"}, {"rating": "5", "text": "At the time, I recall an obsession amongst the public. Looking back, it's dated. Largely because of it's VHS nature. The Ring is successful in its thrills, but unfortunately not a Gore Verbinski masterpiece."}, {"rating": "5", "text": "Another horror movie with a weird story and annoying characters, here the son Aidan, who knows everything and say things, the even adults wold never say and the ex husband Noah, who is such a loser."}, {"rating": "6", "text": "The Ring provides its fail share of thrills but fails to provide enough scares to live up to its \"horror\" premise, even with its interesting plot and characters."}, {"rating": "2", "text": "This is possibly the worst movie I have seen in my 13 years of life!. It's interesting but there is also a lot of things missing. I mean the worst part for me was when the horse was killed. What the hell is in the directors mind shooting this scene, I am a strong animal lover, so i hated it. TWO THUMBS DOWN"}, {"rating": "9", "text": "One of the scariest movies of the last few years - if you've got some imagination, that is. The film delightfully misleads you at the beginning, making you think this will be just another generic teeny slasher flick. It becomes something much darker (and better), an intelligent tale about trust, belief and guilt that rightfully centers on Naomi Watts, who delivers a fantastic performance. Gore Verbinski uses a surprisingly light touch and is very economical with his scare tactics. The film does what a good horror film should do: leave a good part of things to the imagination. There are one or two twists that are not quite believable, but on the whole, RING stays true to its formula, which is to provide an intelligent scare for people who truly value the genre."}, {"rating": "1", "text": "okey dokey...first off: the only reason it gets a 1 is cause some of the screen shots were pretty cool, being a black & white photographer and all. But as a movie? This was a complete and utter waste of time...sadly most scarey movies are like this today: not scarey. A little girl who records herself crawling out of a well, and then gives it to somebody and makes funny noises. The only reason I saw it in the theater? A friend of mine was scared to see it. While alot of people were screaming in fear, me and a few other strangers got together and made fun of it. OMG! a little girl with black hair! AH save me! now i cant sleep for Weeks!!!"}, {"rating": "8", "text": "I'd say it's more of a Mystery/suspense than a horror movie. It was interesting finding out what all of the weird stuff was about. Not particularly \"scary\" but the video is freaking creepy."}, {"rating": "8", "text": "It will be difficult to find a modern horror movie quite as scary as this."}, {"rating": "5", "text": "This movie came out when I was about 12 years old and never saw it b/c my older sister said it was too scary. I'm 19 at this time and finally saw the movie. Before I put in my thoughts, I am TERRIFIED of The Grudge. Kayako is by far my biggest fear ever. But a lot of people say this is scarier. When I bought the DVD, I was prepared to be frightened. But honestly, I was wondering if this was the movie they were talking about. I didn't find the movie as scary as The Grudge. It didn't even feel like a horror film, more of a thriller like \"The Sixth Sense.\" It shouldn't be compared to The Grudge, that movie scared me to death. This movie puts me to sleep. It had like 90% dialogue and 10% scare scene. The scene that did make me frightened was the beginning when a teenage girl gets killed. But the scene that did scare me was when Samara crawled out of the TV. But that's all they got? I was wondering if I got the right version, they say this was the scariest movie ever. But I looked it up, and it is the right version. I felt like this was a complete let down, I wanted to be scared **** However, if this is not as scary as people say it is, is it still bad? Possibly....no. The movie did make sense, the characters are likable, and the scenes are perfect. I will give the movie a little credit. But if you didn't see this movie yet and was thinking the same way I was, to be scared **** I would say go see The Grudge, Mirrors, and Insidious if you want to be scared. But still check this movie out if you like The Sixth Sense, you'll like this movie too."}, {"rating": "5", "text": "It is definitely NOT a good horror film. It is really scary for me, to be honest. But when it comes to the technical aspects, it wasn't as good as those classic horror films. Overall, this is just average.............."}, {"rating": "5", "text": "Not that scary.\rJust the last scene, when Samara is coming out of the TV.\rIn conclusion \"The Ring\" is not bad, but there are some moments which didn't make sense at all, and it was not as scary as I expected."}, {"rating": "5", "text": "The Ring feels too lengthy in the solving of the mystery, with not much proper action coming from the girl herself coming out the Telly. It feels a horror story best told by ear, 'you watch a video of this possessed girl and you get a telephone call saying you die 7 days later'. The film as well leaves many plot holes, how did this girl somehow manage to make a video in the first place? Why is it intended to kill whoever watches it 7 days later? Also, did Naomi seriously go into her friend's flat, find his dead body in a chair, then just leave him there and run back to her flat?\rIt's summed up, a fairly average film with too abrupt an ending, I'll admit, it keeps your attention, but otherwise, I went through this film wanting more horror and consistency."}], "recommendations": ["the_conjuring", "it_follows", "insidious_chapter_2", "insidious", "the_grudge", "the_woman_in_black", "scary_stories_to_tell_in_the_dark", "annabelle_creation", "the_conjuring_2", "the_possession", "the_texas_chain_saw_massacre", "sinister_2", "the_descent", "insidious_chapter_3", "annabelle", "vacancy", "dark_skies", "the_boy", "the_babadook", "oculus", "the_grudge_2", "the_witch", "malignant", "the_strangers_prey_at_night", "lights_out"]}