{
  "id": 3258,
  "title": "The Ballad of Buster Scruggs",
  "starring": [
    "Tim Blake Nelson",
    "James Franco"
  ],
  "runtime": 132,
  "genre": [
    "Western",
    "Comedy",
    "Drama"
  ],
  "description": "Vignettes weaving together the stories of six individuals in the old West at the end of the Civil War. Following the tales of a sharp-shooting songster, a wannabe bank robber, two weary traveling performers, a lone gold prospector, a woman traveling the West to an uncertain future, and a motley crew of strangers undertaking a carriage ride.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/voxl654m7p36y8FLu8oQD7dfwwK.jpg",
  "categories": {
    "plot": 6.517241379310345,
    "acting": 6.588235294117647,
    "ending": 7.571428571428571,
    "soundtrack": 5.0,
    "cinematography": 7.666666666666667,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "I have to believe most of the reviews here were written based only on the trailer.The trailer contained every witty, light-hearted moment in the movie. The remaining 95% of it was just boring and intensely depressing. If you enjoy watching awful **** happening to innocent/good people over and over with sad endings (like gruesome murder), you might enjoy this movie.I honestly can't belive anybody would enjoy watching this.The cinematography raises it from 0 to 2."
    },
    {
      "rating": "6",
      "text": "In the episodic films when an episode fails, the audience will be distracted from the main line, get bored and lose the entire film. The Ballad of Buster Scruggs starts with a surreal satire on western folk songs, the first episode has enough action, humor & cinematic vision & content. Near Algodones is fun, but it has no words. Meal Ticket has a decent matter but its long... so long and so complicated for this simple content. All Gold Canyon is like watching a boring documentary about gold prospectors but following a tireless old man has its own perks! The Gal Who Got Rattled is the BEST, Just as simple as it should be. & The Mortal Remains; it's like Coen bros wanted to fill the entire Hateful Eight in its stagecoach sequence!"
    },
    {
      "rating": "6",
      "text": "The short story format of The Ballad of Buster Scruggs ultimately leads to a mixed experience. There are three good, almost great, stories, one story that isn't so great, and two stories that are honestly pretty bad. It was a rollercoaster of a viewing experience, and unfortunately the good parts this film couldn't save it for me."
    },
    {
      "rating": "9",
      "text": "The Ballad of Buster Scruggs is a Western Anthology written and directed by Joel and Ethan Coen, with 6 interesting and unique tales of the Old West. Now before I even watched this, I was excited as hell. One of the main reasons being, that True Grit another western Coen brothers movie, happens to be my personal favourite.We begin with Tim Blake Nelson starring as the cheerful, singing Buster Scruggs riding horseback through the Wild West. This was without a doubt my favourite story of the movie, I found it absolutely hilarious with an incredibly entertaining and satirical character that is Buster Scruggs was just perfect. The story is full of dark comedy and I knew at this moment the Coen Brothers were at it again, and I was in for a treat.The second story 'New Algodones', stars James Franco as a lone cowboy who arrives at an isolated bank on the prairie with Stephen Root as a lone bank teller. Which was my favourite performance of the movie, I thought Root was fantastic.Damn did they change, we move on to a rather grim and much darker tale 'Meal Ticket' starring Liam Neeson as a not so talkative impresario and Henry Melling as a quadruple amputee orator. The pair moving from town to town with the orator performing poetry, books and speeches from the back of their horse-drawn wagon. This one was so impossibly different from the two previous tales.All Gold Canyon (filmed in the beautiful Colorado) is a visually stunning story which is a drastic change from what we just watched in the last story. Tom Waits absolutely smashes it as and old gold prospector trying to hunting for the find of a lifetime. This was quite a long story and isn't very action packed but honestly, I really liked it.Followed by 'The Gal Who Got Ratted', with Zoe Kazan as a young women joining the Oregon Trail and Bill Heck as one of the trail operators. This for me started out a bit slow, but as the story progressed as did my enjoyment.We end with 'The Mortal Remains', 5 very different characters on their rather claustrophobic stagecoach journey. Filled with rich dialogue, and a singing number by a pair of bounty hunters played by Brendan Gleeson and Jonjo O'Neill. Characters trading insults, stories, philosophies and questioning morals.I found the changes in mood and tone between each tale to be rather interesting keeping my pleasantly surprised. And I am certainly all for the Coen Brothers trying more funky stuff like this."
    },
    {
      "rating": "10",
      "text": "Ballad of Buster Scruggs is the Coen brothers through and through.  Blackly funny, genuinely eccentric, featuring excellent actors and incredible cinematography.  What might go unnoticed is that Buster Scruggs contains some of the best short filmmaking in decades.  More than a few of these short films have the richness of storytelling typically only found in feature length films.   I really enjoyed it and will certainly rewatch it.  Congrats to Netflix for making it."
    },
    {
      "rating": "10",
      "text": "It's a historical materialist's take on western fiction, that ties various stories together with a few common themes. Each story could be seen as quips against human nature, each story holds true to their own theme of life lessons (i.e. there will always be someone better, think before you leap, etc . . .) and each story represents a different aspect of the same general setting (in keeping with the materialist approach).I'd wager most of the negative reviews are more of a critique of penny dreadfuls being on the big screen next to tradition style movies, rather than the quality or entertainment value of the piece itself. The biggest downside is that they don't use fluff, and even the breaks with seemingly meaningless scenes, have some apparent connection to the overall collection. All this leaves you with very little time to absorb everything from one story, before the next story starts. There's almost no downtime (in terms of message loaded scenes) with this movie and it's 2 hours long.I recommend watching it at least twice. You also might want to take breaks if you have the luxury."
    },
    {
      "rating": "8",
      "text": "This movie is kind of like the 'Best Of' of Coen Bros films. Everything good about the Coen bros is on display here. Normally I can't stand Netflix original movies and if you agree with me on that, give this one a chance because it's really good. It's not a cohesive plot. It's six stories about the Old West, and while some are better than others, it's all a very enjoyable experience beginning-to-end. Great performances. Great visuals. This is really good."
    },
    {
      "rating": "7",
      "text": "leaping from one character to another..The Ballad Of Buster ScruggsCoen Brothers' western ride on the tell tale narration is much more layered than Leone's grimy cowboy attitude. With a storytelling like such, that is a compilation of various tales, often tends to lose the grip and fails to make you root for the track despite of leaping from one character to another. But this shear passion of Coen Brothers cuts all these rumored hoax of cinema and soars above all with an adaptive and layered script. As always, the storytelling is often brimmed with humoristic tone which is aptly balanced and never shucks away the intensity of the gunpowder.The first act pretty much works like your textbook structure, that shows you the brief description of what is about to come; not to mention it is the funniest bit of all. Franco takes in the second chapter, that gives you a more Eastwood-y feeling like wooden boards creaking, wind howling and gunshots puffing smoke, it characterizes the western world, the best. Neeson's act is the one that haunts you the most, for both the reasons; its beauty and sadism.It has the range to soothe you and give you the goosebumps, that harrowing silent pitch on screen cannot be toned down by even the beautiful live location it wanders through. Gait's sort-of-a-diary-version has the thirst for seeking the truth out, hardwork and patience, combining all this, it is certainly the most glorifying segment of all. Kazan's personal venture is complex to the core where the uncertainty of the trajectory easily helps Coen Brothers to fiddle with your emotions. And the last section of the segment is so bizarrely ingenious that you are left with your head spinning on the edge of the seat.The final act on the cart is more scary than it is funny, you can practically see each step of the structure leaning towards a darker path, no matter how ironical the stories keep getting, and on that note where Coen Brothers are messing with you subconsciously, this is a complete triumph on the western drama. Now, having these many plots and ergo these many characters, each actor gets a stand out moment to impress the viewers with their expressive performance. But the ones that do among this caliber of cast, are Kazan, Gaits, Gleeson and Neeson.Unlike such stories usually does, there is no mutual theme to it, it may feel coequal, but each tale has a rare soul that emits a newer version, a fresher version of itself. The execution is undoubtedly on the mark, and armed with such meticulous script, its grittiness is what's bubbled up by the Coen Brothers. Aforementioned, there are few fluctuations on the nature of the layered segments, it still bodes well to the flow of the movie and never comes across any bumps. The Ballad Of Buster Scruggs is, yes, your typical Coen Brothers adventure that is crafted out with a sensational cast, but personally I'd choose True Grit version vocab of theirs."
    },
    {
      "rating": "5",
      "text": "Disjointed, and constantly throwing you into short vignettes, was jarring.  Can't say I enjoyed most of them, with the exceptions being the gold miner & wagon train, the others were all more like bad jokes than revelatory treatises on the american west.  The standout scene of the entire thing, for me, was Brendan Gleeson's rendition of The Unfortunate Rake, which was riveting for viewer and characters, alike.  It doesn't seem as if the Coen Brothers think Black people even existed in the American west of the 1860's, and that's just wrong on a whole lot of levels.  Not their finest hour."
    },
    {
      "rating": "8",
      "text": "The usual fantastic Coen brother story telling and cinematography you have come to expect in a series of wonderfully crafted mini stories that are all unique to their own tale but hold a similarly depressing undertone.If you are having a rough day its probably not going to be the 2 and half of hours general sadness you will want to put yourself through but its absolutely a great piece of work that deserves to be be seen."
    },
    {
      "rating": "8",
      "text": "I really enjoyed the film. The vignettes are connected through common themes and tone, I really enjoyed all of them. Liam Neeson's performance especially stood out to me, as well as Zoe Kazan's. I'd highly recommend checking it out if you have the opportunity."
    },
    {
      "rating": "9",
      "text": "Much like this film, watching the Coen Brothers movies has been a roller coaster of emotion throughout the years. Some of them are my all-time favorites and others I could barely finish. That isn't a failure on their part. It speaks to their ability to create art that can be enjoyed by a diverse group of people, and this movie will speak to each of those groups in different ways.This film is truly their opus magnum. It has the absurd, awkward and dark comedy that their fans love, but also the deeply dramatic elements. You will go from seeing ridiculously funny and upbeat segments to some of the most depressing things ever filmed. It runs the gamut of every thematic element they have covered in their wide library of films and ties it together in one piece. If I had to guess what audience reactions will be, I would say they will probably focus on the brutally dark elements rather than enjoying the piece as a whole. It's unfortunate if that occurs because this film will walk you through every human emotion masterfully and because of that I feel it transcends simple entertainment. It will leave you evaluating what you just experienced and in the end this is what every filmmaker hopes to accomplish."
    },
    {
      "rating": "6",
      "text": "Aside from the very first story, this felt less like a Coen Brothers movie, and more Tarantino/Guy Ritchie-esque. At least, Richie and Tarantino utilize their talent, the Coens waste the A-listers they have (Liam Neeson says less than ten words in his scene).While it was good of them to make this into a film instead of a TV series, another bad and disposable Netflix series, this isn't their best either. If it had kept the humor, pace, and momentum of the first scene and story, this would've been good and entertaining, but it falls off a steep cliff after that one and never really recovers."
    },
    {
      "rating": "9",
      "text": "This was by far, the best thing that i watched on Netflix this year! It had very funny moments, was sometimes full with gore and also brought my heart to tears, in more than one occasion. (I cried my eyes out in the second to last chapter.)And you actually feel attached to the characters. Extremely good work Netflix."
    },
    {
      "rating": "9",
      "text": "When I heard 'The Ballad of Buster Scruggs' is a film comprised of six short stories about the Wild West, I was a bis skeptical. Simply because no matter how good those six short stories might be (and, mind you, they are) if nothing connects them, they are slightly isolated, therefore pointless to be put together.And by connection, I don't mean a general theme, I mean something that would put these six films into their own capsule. Fortunately, these are the Coen Brothers, the most original, interesting modern filmmakers. And they succeeded in blending their creative writing with a visual beauty, not necessarily surreal, but improbable. For instance, in the first two films, there is a bar and a bank, respectively, in the middle of nowhere. This is not surreal, you can build them wherever you want, but is unlikely. This extends to the characters. Buster Scruggs, the classic cowboy in the first film, often breaks the fourth wall talking to the audience. Then in the next, there is a guy covered in frying pans protecting his bank. \"Pan-shot!\" he screams to the confused bank robber (James Franco).If these first two films are often comedic and caricaturist in their approach, the third one is the most somber. I will not spoil it here, but its bleak. And as we get closer to the last one we start to see that connection which encapsulates all these six stories, and only these six stories! Death. All these films deal in one way or another with death and how present and casual it was in the Wild West. Most characters die quickly, usually with a head-shot and the worries of their killers are more of a spiritual and moral nature than a legal one (best example is the ending of the third film).The best of these films was the last one. It is rich in pointless conversations and philosophies of five people travelling on a stagecoach to a hotel. Yet two of those five are observers. Slowly, through clever and careful writing, the atmosphere becomes grim, even the beyond beautifully picturesque visual tone slightly changes and in the end, they reach their destination, yet again, a lonely hotel in the middle of nowhere having a reception and a staircase fading up."
    },
    {
      "rating": "3",
      "text": "I was excited for this after the Coens' excellent True Grit, but it came as a huge disappointment. These are the problems:- Like a lot of Netflix original content, it looked and felt cheap. It tries to come out strong with a fairly action-packed initial story, but that can't cover for the penny pinching that gradually creeps in, like long stretches that take place in a single location, or long stretches with minimal dialogue (which requires fewer takes to shoot). I wasn't surprised to learn this was initial planned as a TV show, it has a very TV-grade feel to it (though TBH even Netflix's shows look cheap compared to other studios').- It doesn't ever make a good case for why it exists, other than to let the Coens do their usual (and rather tired) black comedy/satire/melodrama shtick. Netflix is clearly hoping that the Coen name and a few A-list actors (who mostly have minor roles with minimal dialogue) will singlehandedly sell the movie, but that's not how this works. If this were a Wes Anderson movie it would be The Darjeeling Limited.- As others have noted, it is slow, dull, and full of the usual cliched, portentous, and sophomoric \"meditations on life and death\" (ugh) typical of postmodern Westerns. Most of the stories coast by on absurdist novelty without emotionally engaging the audience; the one exception is \"The Girl Who Got Rattled\", which is easily the best part of the movie and the only part that actually succeeds at the basics of storytelling.- It's a bit tough to criticize the plot or characters because there almost weren't any. The vignettes are supposed to make you feel amused or somber for a few seconds, then to be forgotten forever as the next one queues up. In that sense I guess it really is a true-blue Netflix product, given how much they promote binge watching of trashy content."
    },
    {
      "rating": "8",
      "text": "I found it a little bit slow during the end, but overall very enjoyable, beautifully shot, and both funny and dark at times."
    },
    {
      "rating": "6",
      "text": "After the disappointing Hail, Caesar! I would say that my expectations for a new Coens film were not that high anymore but both are still very good directors and screenwriters and definitely The Ballad of Buster Scruggs is a more satisfying film but it's also far from being memorable.Although I'm aware that in the first instance it was planned for these stories to be a miniseries, the truth is that it turned out better as a film. The last thing I would expect from the Coens was an anthology and although the final result is satisfactory enough, the narrative quality of all the stories is quite uneven.I think they realized they functioned better as an ensemble than as separate entities in a miniseries with obviously more extensive storytelling processes but that evidently wouldn't have been equally fruitful.They still don't surpass Inside Llewyn Davis but maybe with the Coens that is their process: they deliver a couple of regular films to finish off with an excellent one. They have been doing it since Fargo."
    },
    {
      "rating": "10",
      "text": "I have very low expectation for this movie as for every netflix original non tv series. But this has changed basically from the first seconds of this film. Amazing visuals, fantastics music, black humour and it is so much rewarding that i can't stop thinking about it. Definitely i will watch  this movie more than once, cause discovering this small subtle details will give me s lot of joy in the future. If you like good movies this one is must watch!"
    },
    {
      "rating": "8",
      "text": "\"The Ballad of Buster Scruggs\"It has no shortage of the Coens' idiosyncratic dark humor and quirkiness. Maybe this why this story is what I liked the most among the others. From the opening sequence I got O Brother, Where Art Thou? vibes thanks to the amazing song Cool Water which is performed by Tim Blake Nelson who stars this first segment, and delivering an incredibly energetic performance which is, in my opinion, the best performance of this pleasant anthology film. The visual effects didn't only serve the humorous nature of the story, but also suited the fantastical quality the story has. The moral of the story is what I didn't hundred percent like. Sure, there's a good message here, but it's also a well-worn one. I was about to ignore that as the over-the-top violence, and the hilarious death sequences kept me thoroughly entertained, but it's the ending that made the message feels corny. Not because the ending was poorly executed, but because there was nothing in it to make the message seems fresh, except the gorgeous-looking ending scene.(9/10)\"Near Algodones\"One one hand, this story has the most complex message compared to the rest of the stories. In contrast with its predecessor, the great, profound moral of the story is what made it truly shines, not the visuals, nor the visual humor. The humor comes from the irony in the character arc; the movie subverts the idea of fate not by avoiding it, but rather by giving the audience a space to make their assumptions. As a result, Near Algodones is the segment that is most responsible for linking all the other segments together, and therefore making the entire movie feels consistent. James Franco is as appealing as usual, giving a performance that has the grittiness of his performance in 127 Hours, and the gleefulness he usually brings with his charming on-screen presence.On the other hand, and also in contrast with \"The Ballad of Buster Scruggs\", this segment is utterly soulless and flavorless. Pretty much everything from what I mentioned above I felt that I've appreciated more than enjoyed. The dark humor undoubtedly didn't work as much as it should due to that, but the problem I had with this story is that I didn't find it as entertaining and vivid as it tried to be, or as it easily should have been. Everything should have made the movie engrossing, yet the wishy-washy narrative structure, and the prompt shifts from a scene to another offered a fair amount of glimpses and flashes of glimmer which, at least, I have grasped and sensed behind the colorlessness that prevailed the movie.(8/10)\"Meal Ticket\"This is without a doubt the most underwhelming story of the six; simply, because how much I was invested in the characters, especially Harry Melling's character, the Artist, and how much I was enjoyed with Liam Nesson's presence, yet how achingly disappointing the ending was. After some of the most interesting minutes I had watching the movie, the Coens ended this mostly entertaining story with nothing more than a commentary on the predatory nature of show business that neither offered something new and smart enough to be biting, nor ended the segment in a fulfilling way.The story also suffered from repetition that made me feel that it should have been shorter, but I have to admit that most of the run time was spent in enriching the two main characters, and hence making them more interesting. Alas, all what we knew about the characters didn't pay off at the end.(7/10)\"All Gold Canyon\"Aside from some boring repetitive scenes that stretched the run time without avail, this is the most story that absorbed me. Tom Waits gave a soulful and honest performance that is more than enough to make you root for him until the last second. It's not only the sympathetic protagonist that made it difficult for me to take my eyes out of the screen throughout the entire segment, but it's also the way this Venice Award winning screenplay kept shattering my expectations over and over.(9/10)\"The Gal Who Got Rattled\"Featuring two of the best performances in the entire movie from Zoe Kazan and Bill Heck, this gritty themes tale is decidedly stands out from the rest with its quite complex story, well-developed plot, and endearing characters that managed to make it riveting and thought-provoking all at once. Alas, it feels overlong, and hence boring sometimes. For it has a long build-up that, in a similar way to most of the other segments, has a hugely frustrating end.(7.5/10)\"The Mortal Remains\"This is the only section that I didn't like. Although it has a remarkable Gothic atmosphere, and a Tarantinoesque dialogue, the heavy-handed way of symbolism made this segment somewhat off-putting. But, fortunately, it's the end that was sabotaged the most by the ostentatious use of metaphors. So I was in fact engaged for quite some time due to the smart dialogue, and the top-notch performances.(6/10)Overall Rating: (8/10)"
    },
    {
      "rating": "5",
      "text": "Six short stories, not a comprehenisve story.  It starts off amzingly well but grows ever more stale with each successive story.  Until you are left trying to remember why you were so anxious to see this, and remember that you thought it was a movie, not a collection of unlinked short stories of uneven temperment."
    },
    {
      "rating": "7",
      "text": "The Ballad of Buster Scruggs almost feels more like a meditation on the nature of life and death than an actual movie. However, I do mean that as a compliment. The anthology premise opens more doors to discussion and interpretation on the Coen Brother's latest offering. If you compare Buster Scruggs to the Coen Brothers remake of True Grit, you wouldn't even believe that these movies are made by the same people!Buster Scruggs himself is a delightful opening to the movie you are about to see. He feels more like a Bugs Bunny character than a Coen Brothers creation. His narrative sets the tone for the rest of the movies, and like all of the others stories, it fulfills you and leaves you wanting more.If this sounds like something you would be interested in, definitely check it out!"
    },
    {
      "rating": "1",
      "text": "Netflix’s The Ballad of Buster Scruggs is probably only for Coen Brother completionists. The formal structure organizing these short stories is to be expected, but still feels fresh and innovative. The stories and actors themselves tell genre-busting tales of varying lengths, which in and of itself is a cool challenge to expectations, in the same vein as Brian Azzarello’s 100 Bullets. But not all of the stories are constructed with the same care and skill, leaving the overall effect a somewhat uneven ensemble cast of cameos that deserves to be watched as an afterthought on your laptop after escaping yet another holiday party but not so much on the big screen.I never thought that I would root for an old prospector as he goes through the grueling process of panning for gold, but the objective frame for that story created a hero out of hard work. Magical realism abounds in the opening story of a bard-outlaw, and Zoe Kazan delivers an excellent, muted performance as the film’s only woman protagonist.Image result for ballad of busterThe weaker stories seem self-evidently conscious of their mediocrity and preemptively invite apologetics, but their failings are cliché by now. James Franco (the worst of the Franco brothers–Dave, you are my spirit animal) gives an appropriately creepy performance to a morally intellectually bankrupt story in the second slot. Liam Neeson and Harry Melling (the Dursley boy of HP fame) either tell a twee story about the savagery of the theater and whimsy of public opinion or they impersonate a person with a physical disability and then throw him over a bridge in lieu of an actual ending.If there is a connective tissue to these stories, it seems like it might be the mundanity of evil, but giving directorial side eye to the ethics of your own story is not the same thing as telling a story that challenges those evil outcomes, and I think that’s at the crux of my criticism with some of the endings in this collection, which sounds like a narrow point, I know, but actually has some big implications for the choices that could have been made.Franco, Neeson, and Kazan’s stories all have essentially the same easy outcome and they arrive at that point because the stories paint themselves into a corner, where more interesting, open-ended avenues existed. Why do we need to see the cart at the end with only the chicken in its cage? Why not before? Why the suicide-as-plot when so much of the lead up is about the drama of her decisions, her future, and not that of Billy? Why the vacuous mooning? Why the rushed unfortunate turn? Death is still a viable ending, as “The Ballad” shows in the first story, but it’s not the only way.For those looking for the high water mark of short stories done well on the big screen, check out 2014’s Relatos Salvajes (Wild Tales), but The Ballad of Buster Scruggs went straight to streaming for a reason, and that reasoning is still not an entirely vetted path to success."
    },
    {
      "rating": "5",
      "text": "Well i'm glad this was on Netflix as i would have left the cinema during the third story. It comes out of the gates swinging with the title character and sets up a potentially great movie. Unfortunately things go from great to boring, the cardinal sin of an Anthology movie is lingering on one story for far too long, especially when that story is dull and boring. That 3rd story could have been cut in half and had just the same effect. The only part worth seeing wasn't even shown just a fad to black. It seems like they tried to copy many aspects of western comedy already done by the superior Quentin Tarrantino films. Also good to see american film makers haven't forgotten about the traditional one White man vs dozens of Indians, seems only white people can shoot straight and kill with every bullet yet dozens of Indians all firing at the same time cant hit anything, Pathetic."
    },
    {
      "rating": "8",
      "text": "Filme muito bom com ótimas histórias, na mesma qualodade do filme argentino relatos selvagens ou até maior. Grande atuação por parte de todos atores, fotógrafia são de tirar o queixo e o figurino incrível. Histórias de todos os tipos com aquela pintada de tensão para o que vai acontecer. Minha visão sobre filmes dividos com histórias não é totalmente boa pois não segue o propósito de concentrarmos e entrarmos em somente uma história, é bom de ver mas não tem ligação alguma."
    },
    {
      "rating": "9",
      "text": "This new film on Netflix from the Cohen brothers may not be a new Fargo or Big Lebowski, but it is in the upper echelons of their work.The Ballad of Buster of Buster Scruggs is an anthology of six Western tales. The movie uses the interesting framing device of the tales coming from an old book complete with color plates. In fact, each tale feels sort of like it was written back in the day. (A couple are based on/inspired by actual stories.) The tales are stuffed with the moments of darkness, humor, violence, and well-written dialogue and plot developments the Cohens are known for. Also, the segment All Gold Canyon, which takes place out in the sunny untouched wilderness.Includes a cast of well-known or veteran actors. It's better to be surprised than to tell you who they are.The only major weak point is the second to the last segment The Gal who got Rattled. Though well acted, it runs a bit long and the ending isn't strong enough to justify the length.I highly recommend this to Cohen fans. If you're not into dark films, then this isn't for you."
    },
    {
      "rating": "5",
      "text": "The Ballad of Buster Scruggs starts out as a riveting anothogy film with intense and creative sequences, but then flames out into just an ok experience mixed with dull repetitive endings.  50/100"
    },
    {
      "rating": "10",
      "text": "Buster Scruggs is a speck in the distance of the most spectacular of all the Western Landscapes ... Monument Valley.We hear his uptempo clip clop version of Cool Clear Water.The Coens aren't about that kind of nourishment though.For them it's all about the ideas and basically blowing your mind one way or another.They marry up images into pairs that mysteriously inform one another. Like the way the feet line up at the demise inspections in Busters final shootouts, and the camera notes it and the editor notes it and it is in you brain like a clue to the mystery and that's what it is.They say if they become aware of subtext they put it in the real text. I find this hard to fathom that they don't do subtext.It's their dedication to this mystery I suppose.They turn away from certainties like they've seen a ghost.Death is pretty certain but even on that point they find disparities. They want the mystery, they need the mystery and that's the stock in trade.  In life we are bombarded by the sound of certainty in all it's salesman glory. Check with the most cursory inspection and those realities fall vulnerable.  Yet within the uncertain framework they present you find yourself these little light bulbs that illuminate some point or other.A point that artists are to contribute or out you go into the cold flowing river. Or is it the cruel world that doesn't understand?The Coens have six shorts in this chamber and they have worked like ten prospectors to uncover and manifest the greatest ever shootout with Hollywood's Western Mythology.Let them blow you away into the dust or what you think is anyway."
    },
    {
      "rating": "9",
      "text": "I must confess to being a Coen brothers fan from the outset. This movie may have flaws but it is storytelling at its best. The vignettes are superbly realised due to the stunning cinematography and the ensemble cast.Death stalks the film being the silent witness as humans battle the natural environment and each other. Women are conspicuously silent as well with the exception of the braves but ultimately doomed girl on the Oregon Trail.Characters are bewildered at the things they don't see coming. There are highlights include \"The Girl who got rattled\", \"All Gold Canyon\" and \"Mortal Remains\". There are nods and winks to iconic Westerns such as Stagecoach, Once upon a Time in the West, The Searchers to name but a few.Are we to take lessons about contemporary society form this fine work? Yes. Death as an inevitable fate, uncertain times and hubris.I loved the  the execution of filmic techniques at the same time being disconcerted by the brothers' vision. Maybe the message is that we're all just passion' through."
    },
    {
      "rating": "10",
      "text": "One of the better shows out. A show for a more sophisticated person who enjoys dialogue of a higher intellect. This movie is not comic book screen writing for frontal lobes that are melted. Beautifully done movie and great acting."
    },
    {
      "rating": "8",
      "text": "This is art and this is craft. Not only from the side of Cohen brothers but from everyone of the fantastic actors that bring back dignity and greatness to this art form. Delightful."
    },
    {
      "rating": "8",
      "text": "I happened upon this film, or rather collection of short stories, quite by chance. I can only say having viewed it I feel as if I have seen a masterpiece of story telling; heavy with substance, artfully presented, and compellingly told. Brilliant stuff, the likes of which the filmy industry so seldom produces nowadays."
    },
    {
      "rating": "6",
      "text": "As most have said, Buster Scruggs and The Girl Who Got Rattled are fantastic. I would love to see a full length Buster Scruggs movie about a sharpshooter that's honorable but not a good guy. The Girl Who Got Rattled hits all the right emotional notes. The rest are fine, but predictable. It feels like there was a lot more potential here, but the directors were too busy making something else to give this the full attention it deserved."
    },
    {
      "rating": "6",
      "text": "The first four vignettes are clearly better than the final two, we get both the best and worst of the Coens."
    },
    {
      "rating": "8",
      "text": "TBOBS is a wonderfully filmed and acted series of Western shorts that have hit or miss quality. The film runs long and feels like it despite the changeups throughout. I feel that the film would have been stronger with \"Meal Ticket\" removed, and while I understand why people may like it, it certainly felt like a filler story. For the most part the rest of the film felt highly engaging and quite enjoyable. I particularly liked the title short as well as the continuity of it in the following short, as well as the tragedy of The Gal Who Got Rattled. The closing story titled \"The Mortal Remains\" reminded me much of Hateful Eight in a good way. This is quite a fun film to watch!"
    },
    {
      "rating": "3",
      "text": "The Ballad of Buster Schruggs is an anthology of awful. While the setting and lives of the characters are captivating, the events which unfold are one decidedly and deliberate series of shockingly gory, degenerate, and depraved. While the West certainly wasn't free from its share of hardship, evil, and unfortunate events, the Ballad of Buster Schruggs goes out of its way to compensate for poor storytelling with gut wrenching shock of watching people do terrible things to other people. And that can be the summary of the entire movie: stylized representation of people doing horrible things to other people. What could have been a thought-provoking and unique dive into the lore and lives of the characters of the west is supplanted by writers who seem to have no other means of leaving an impact other than brutal and graphic deaths of characters."
    },
    {
      "rating": "8",
      "text": "The Ballad of Buster Scruggs cheats the viewer bringing a title of one story out of a couple of tails without relation one of each other a la Lovecraft and Poe.Every tail trips in moments of fresh violence breathed of their No Country for Old Men, thematic characteristics of opus as Eastwood's, Tarantino's and Spielberg's, in general with more goals than fails."
    },
    {
      "rating": "8",
      "text": "With consistent tone and quality of writing tying each story, \"The Ballad of Buster Scruggs\" is a rich and engrossing Coen Brothers western film."
    },
    {
      "rating": "7",
      "text": "I found most of the short stories really good, some though for me were a bit boring but overall nice movie."
    },
    {
      "rating": "8",
      "text": "What did I just watch? LOL. This was hilarious and suspenseful. I literally could not stop watching it, even when it was ridiculous and made no sense. I would watch it if you have some time on your hands to kill."
    },
    {
      "rating": "8",
      "text": "What do have in common a singing gunslinger, a bank-robber, a gold-digger and two bounty hunters? They the main characters of first essay in collage of Coen brothers; not all the chapters have same strenght but is a remarkable exercise of western genre."
    },
    {
      "rating": "9",
      "text": "A series of short films that explore some mythical-type characters and stories of the Wild West.  There is some irony here (this is a Coen Brothers flick, after all), and there is also some humor, visual beauty, and fine performances.  Some of these yarns don't exactly have satisfying conclusions, but for the most part this is thoroughly enjoyable."
    },
    {
      "rating": "10",
      "text": "One of the Coens' best films to date, this combines all their talents for original dialogue, fascinating character, and hilariously dark storytelling in one grand satire of the Old West."
    },
    {
      "rating": "0",
      "text": "Generally bad but it does get worse as you watch.At no point do you feel good for watching these stories. It's like taking every key part of all westerns and ruining them.This seems to be an unpopular opinion. I don't know if it's because I've seen actual westerns, whether I've seen good movies or maybe just taste."
    },
    {
      "rating": "8",
      "text": "It's a perfect summation of the Coen Brothers careers as a whole. Quirky, strange, messy, and fun."
    },
    {
      "rating": "4",
      "text": "Alguns contos e personagens são mais interessantes e marcantes que outros. No geral, todos conseguem envolver e ter algo trágico ou frio envolvido."
    },
    {
      "rating": "8",
      "text": "Muy interesante.Excelentemente bien realizada y si pones atención a los detalles, de cada historia se pueden sacar una o dos lecciones de realidad irrebatibles."
    },
    {
      "rating": "8",
      "text": "A badass, emotional, funny and unpredictable movie. I really recommend it. A shame the cart and the theater stories were a little boring, though. \"The Girl that got rattled\" was my favorite. Great acting, storytelling and cinematography"
    },
    {
      "rating": "9",
      "text": "A dark movie, with some great storytelling about humans and their true selves. It was really just beautifully done.  Loved it.  The dialog, the visuals, and the stories.  Totally worth watching."
    },
    {
      "rating": "10",
      "text": "This Movie is one of the best Netflix Originals. If not the best. The Story is very good. Each Ballad has his own theme and moral."
    }
  ]
}