{"id": 4125, "title": "The Midnight Sky", "starring": ["George Clooney", "Felicity Jones"], "runtime": 118, "genre": ["Science Fiction", "Drama"], "description": "A lone scientist in the Arctic races to contact a crew of astronauts returning home to a mysterious global catastrophe.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/51JxCk77ZCqLzbLkrDl9Qho6KUh.jpg", "categories": {"plot": 4.2444444444444445, "acting": 3.9393939393939394, "ending": 5.2272727272727275, "soundtrack": 1.0, "cinematography": 7.0, "familyFriendly": 2.0, "funny": 4.0, "action": 5.4}, "reviews": [{"rating": "4", "text": "30-45 minutes of this should have been left on the editing room floor. It's slow and ponderous with characters that you don't care enough about, a twist you can see a mile off, and a story that just doesn't have enough oomph."}, {"rating": "1", "text": "Does anyone else feel like this one got killed by direction and editing? - There is a balance between implied and spoken exposition.  This movie failed on both counts. The doomsday world scenario and flashbacks needed more spoken explanation. The Arctic/Spaceship needed less. Do we have to have the “lead character walks though and introduces the quirks of the supporting cast” scenes? - Even in 2049, I highly doubt every computer screen looks like a videogame. - Why do you have to perform one function at one computer terminal, and then a different function at a different one? In fact, with super-Alexa, why do you have to use a screen at all?- How have we solved faster-than-light communications? I know it makes for difficult movie making but just make it a plot point instead of OMG SUNSPOT INTERFERNCE or REBOOT TEH COMMMMZZZ. - No way a crew that large just “notices” that they’re off course, especially when they’re out of communication. It would be all hands on deck 24/7.- No way a crew that trained would not know where they were. There are stars out there, for Pete’s sake. - The young Iris plot line seemed super-contrived, and the initial scene with the mother looking for her not-Iris daughter with the pronoun game really felt in retrospect like something they tacked on due to audience response. It was vaguely sixth sense, but in that case, both the protagonist and supporting character are in the same state, so it makes more sense. In this world, his level of interaction with Iris was too physical. Like the peas. The peas. Don’t tell me to give peas a chance. - I’m sure in 2049, nano-carbon technology makes it so you can have swooping gorgeous honeycomb structures with no purpose in a short-haul spaceship. - Also in 2049, you can receive a fatal injury in your spacesuit and not feel pain? I guess?I want to see a re-edited version of this film. I want to like it."}, {"rating": "1", "text": "Oh my God this movie is so bad!The scenario is so bad. All the turnarounds are super predictable and brings no surprise.This movie isn't realistic at all. In the end this movie isn't a good tragedy, it isn't a good sci-fi movie it isn't an ecology movie. This movie is just a waste of time.They try to bring something more with the music, but after one hour of sad melody, the music brings nothing more than despair.Clooney brings nothing here."}, {"rating": "4", "text": "Despite the interesting story that has potential to be a great movie, this production feels very slow and not well planned. It gets really boring quickly - for most of the time nothing exciting happens and watchers are left in confusion. Switches between different timelines and places aren’t marked properly and they seem confusing for the first half of the movie. The good side of the movie surely is the CGI and scenery."}, {"rating": "1", "text": "Terrible, unrealistic, pretentious, storyless movie. Sorry it takes talent to write a real science fiction movie.. check Interstellar a few times and try again.. or not."}, {"rating": "7", "text": "Sure, there are issues with the pacing and the cohesiveness of the story line from artic to space, but what I appreciated most was the emotion of the film. In a short time frame, I was able to connect with the relationships, past, and drives of the characters that led to believable decision-making. The of course, the ending, I did like it. I found it poetic and emotionally gripping. Sure, a bit contrived and far-fetched, but still held me attention until the first credit."}, {"rating": "4", "text": "This movie lost me when Clooney, who is dying of cancer or whatever, falls into a frozen river and doesn't die. Also you can't repopulate a species with two people. Cl"}, {"rating": "7", "text": "I quite liked it, but didn't love it. It's a decent sci-fi drama.It tend to drag on a bit during the last half, and it's padded for time with a bunch of random problems that has little effect on the overall story.The pay-off is also a bit lacking and even slightly awkward. But I'm guessing that's mainly due to budget constraints. They had to stick to the set pieces they had.The strong point, at least to me, was the built-up during the first half. It starts to fizzle a bit after that, and struggles to keep things interesting. But it's worth a watch for the atmosphere alone.Clooney delivers a great performance. So does most of the actors actually. Great CGI, very believable. Beautiful movie!"}, {"rating": "6", "text": "zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz"}, {"rating": "2", "text": "If you liked 'Ad Astra' you'd probably like this, but not as much.  The pacing is glacial.  it's dark, it's depressing.  It's  s l o w.  Reasons to watch: we're hard up for entertainment; it's free on Netflix; some of the visuals are stunning.  I'd almost recommend watching it for the visuals, except that it's agonizingly slow and disappointingly pointless.   If 'Ad Astra' offended you because of its random-plot-tricks-masquerading-as-science, this will offend you more, because at least 'Ad Astra' had some urgency in its pacing.  The dialog dumb, the \"emotions\" forced.  Cut it down to twenty minutes of visuals with some nice music, it would be a beautiful screensaver."}, {"rating": "1", "text": "while sitting down watching this on netflix. i was able to tell what was going to happen step by step. am i psychic? no. they just copied every other movie that tells the same story. nothing original at all. poor acting from a cast you would expect a lot more from. even poorer screen writing. they took a few movies on space and copy & pasted them together to get the midnight sky. i think this is my first movie review on this site or maybe ever. i felt compelled to let someone know, so they don't waste 2 hours of their time. its boring, no action, no drama, no sci-fi cutting edge story. a bland cooker cutter movie churned out by hollywood. its harder and harder to find good movies now. im not sure why."}, {"rating": "3", "text": "Eu torci muito para que a catástrofe acontecesse matando todos os personagens para que o filme acabasse logo. Acredito que não era isso que eles queriam passar com a história."}, {"rating": "4", "text": "(Mauro Lanari)It starts as a sci-fi blockbuster, goes indie by confining itself to a couple of room-sized sets, then morphs into a survival movie and eventually implodes into a claustrophobic bubble even for today's standards of Disney films: while the new Holy Family moves to an extraterrestrial place, with the passing of the minutes the emotion becomes rarefied and frozen, sinking into the air and water of the Arctic or into the void of cosmic space."}, {"rating": "4", "text": "Boring and slow but some of the graphics in the Space scenes are really good. There are some good performances from the actors... But it is a hard watch"}, {"rating": "0", "text": "Calling this Sci-Fi would be a horrible insult. Its cringeworthy.The plot fails on nearly 100% of the scifi points. A huge moon with a biosphere next to Jupiter? Totally. Would have been discovered by Galileo Gallilei..., FAIL. A optical telescope observatory in the arctic? Covered skys, excess water. The worst possible place to build an observatory. A radioastronomy object would have made vague sense. FAIL. The basic idea to not reach the spaceship due to insufficient sender capacity and the need to travel through the wasteland to a weather station instead (that obviously has better deep space capabilities than a dedicated station)? Insane. The size of that thing rivals the Deep Space Network stuff, and thats used to communicate with a 1970s Voyager on the outer rims of the solar system. But a 2049 spaceship with antennas the size of a bus fails to pickup the directed signal?? FAIL. Asteroid belt being a trouble for the spaceship?? FAIL.A two year mission to Jupiter is also quite rapid, but the spaceship looks like it was a crossover between a Bablyon5 destroyer and a 2010 vessel, so might be okay for a torchship style.Thats just the obvious science goofs.Lets talk plot. The ideas are just bland, nothing fresh. The background story is not explained, just some apocalypse with not real details. The characters are boring. Very US focussed characters as well. Global apocalypse but all computer screen displays focus on north america. The plot resolution is also terrible. Just tell the crew to turn back to the new planet. To do what? 10-20 people cannot found a colony, especially not when half the movie echoes \"the colony ship didn't make it\". Kind of hillarious. The first scene when people get evactuated basically tells \"We wanna die at home\" and the main character fights so his daughter may die \"away from home\"...Do not waste your time. Some FX is nicely done, but most videogames have nicer ship designs, thats about all plus points i could see."}, {"rating": "2", "text": "George Clooney directs this maudlin science-fiction drama. Bland acting and a story that has been done too many times. A waste of time."}, {"rating": "3", "text": "It just doesn't mesh at all this movie.It's like seeing what Goerge Clooney has jotted down in his little notebook about directing as he has moved through his career on film and television sets.It felt like all the little pages of his scibblings strung out on a length of sting with gaps inbetween where the glue and finesse should be that creates all the magic cohesion. Caoilinn Springall who played Iris was the star of this movie."}, {"rating": "1", "text": "Overused story telling methods, really uninspired. We were joking that the small girl is imagined and the pregnant woman on the ship is his daughter. So the biggest surprise was that we were actually right on both terms :facepalm:"}, {"rating": "4", "text": "Is mankind really worth saving .?Understated with some ominous overtones . A very decent watch . My only criticism would be that the characters’ personalities and backgrounds could do with more explanation."}, {"rating": "9", "text": "Thoughtful, subtle yet epic, zen pace and vibe, yet engaging. Good performances."}, {"rating": "9", "text": "Great movie...Good plot...Nice special effects...Stunning pictures...Great acting."}, {"rating": "8", "text": "It is not exactly the best of the year but, Clooney knew how to do his best so that as viewers we do not lose interest in the plot, which has a melancholic flavor, more than fiction, although with an ending that leaves us more questions than answers. The cast does their best too, of course."}, {"rating": "2", "text": "Unfortunately, this film was just a vehicle for, yet again, Hollywoods insistance that everyone needs to be lectured from them under the guise of entertainment. Bi-racial couples, check. Simplistic understanding and explanations of complex environmental upheaval, check. Aging white mâle professor, mournful and accepting responsibility on behalf of the entire human races tendency to destroy our eco systems... responsibility accepted on behalf of all white males. Of course I'm reading into the subtext because it appears that THAT is all that's left to read these days. Gone are the days of watching movies for entertainment... no no no we can't have actual stories interfering with Hollywoods supreme role as school marm of the blatantly Obvious."}, {"rating": "2", "text": "Extremely weak story. And what a twist!  Never could have seen that one coming!"}, {"rating": "0", "text": "Omg I thought Netflix bright was the worst movie ever but this is it’s equal nothing happens slow boring waste of time even making this movie.Spoiler alert nothing happens"}, {"rating": "5", "text": "The beginning of the movie was going in the right direction for sure. The first hour of this movie was on point but towards the last 30 minutes of this film, it got a bit bizarre. I know this film was suppose to be based on the novel, but this film felt empty. There was little connection with the astronauts. We had no information on what happened to Earth and where most people went. And the ending was confusing at first glance. Overall, the movie was pretty depressing. Yes, there were a few uplift moments but not enough. There was just not enough connection made throughout the film. It’s not a bad or terrible movie, it just shouldn’t have been rushed."}, {"rating": "7", "text": "It’s clearly trying to be Gravity and The Martian and a dozen other films, but the emotional and adventure aspects of the story outweigh the familiar flaws."}, {"rating": "4", "text": "Not a great movie, there were parts that had solid scifi and were interesting, but the overarching story was a bit staid, and not a happy ending.  There was an attempt made, lol"}, {"rating": "6", "text": "All the ingredients are there but its missing something. I was eager to learn more about what had happened to earth, but in the end I found it disappointing with an ending that reminded me of newsround.  Shuffle the papers and dim the lights."}, {"rating": "9", "text": "Very good one, i wasn’t expecting this to be that good. Everyone should give it a chance"}, {"rating": "10", "text": "George Clooney is amazing in this film. Great story and a great script. Great film!"}, {"rating": "2", "text": "Very disappointing and boring movie. I didn't expect much but there's nothing there. Some nice snow storms and stones in space."}, {"rating": "6", "text": "Yet again, the planet has been devastated by a disaster and George Clooney plays an astronomer who’s holed up at an observation station. When he discovers a space ship coming back from Jupiter, he embarks on a perilous trek thru the tundra (with a young girl) to communicate with the astronauts (led by Felicity Jones and David Oyelowo). The narrative alternates between his journey on Earth and the challenges on their ship. Naturally, there are setbacks for both. Director Clooney has staged the film with wonderful visuals and effective performances, but his dedication to the “drama” leaves too many dull quiet moments. If this 2-hour film had been closer to 90 minutes, it could have been a gripping experience. As it stands, there are compelling sequences and an overall concept that’s interesting, but the sluggish pacing and sometimes strained credibility undermines its flight."}, {"rating": "3", "text": "Bland and boring sci-fi movie with no heart at all. George Clooney and screenwriter Mark L. Smith want us to care about these characters that are not that interesting. Besides, they want to trick the audience with two or three things without mentioning THAT melodramatic twist. Overall, Clooney and Netflix want to dictate how we feel through all the film, especially with the music, dumb flashbacks, and feel-good photography."}, {"rating": "3", "text": "Clooney should spend more time learning how to direct than trying to be a politician.  He obviously has a lot of work to do.   The only thing worse  than the beginning of this movie was the rest of it.  I fell asleep the first attempt then came back determined to finish it.  Wish I had spent my time on anything else."}, {"rating": "2", "text": "So many problems. All the storylines that are supposed to be heart-wrenching are ruined by horrible pacing and the predictability of it all. Lots of liberties are taken with the science that are neither realistic nor explained enough to maintain the suspension of disbelief. For instance, Maya suffers a mortal wound, that breaks skin and bleeds profusely, but not catastrophic decompression from her suit being punctured. K-23 is an Earth-sized, Earth-like moon of Jupiter that took centuries longer than all other Jovian moons to be discovered, and it still is unnamed. The disaster than befalls earth is also never revealed nor are its properties sensical enough for the user to suspend disbelief. Why are the crew not preventing a pregnant woman from carrying out an extremely dangerous spacewalk? Finally, why at the end are the main characters on the space station not completely devastated by the fact that if it's just them and their kid, there's no hope for the survival of humanity on K-23?"}, {"rating": "9", "text": "This is barely a sci-fi movie. It's a movie about human drama. Dram occurring with a single scientist left at an arctic research facility. Drama happening with the crew of a ship returning from an exploratory mission to Jupiter and it's moons. This story moves slowly, but it is a captivating sketch of a man's choices and regrets - Clooney's character. It is also about hope and second chances - the crew on the ship returning to Jupiter. If you're into cerebral movies then you will like this one. Happy New Year."}, {"rating": "3", "text": "a tedious melodramatic and sentimental slog. clooney should stick to acting."}, {"rating": "7", "text": "the movie has its visuals, acting sound and set pretty much nailed. but there's just no story, it tries so hard to tell a story but in the end it feels like only the middle part of a movie. beginning and end are pretty much absent as the start of this story is told in 5min of flashback and the end is not happening."}, {"rating": "7", "text": "Well... I guess it's good enough. It tries to add a lot of drama in moments it doesn't need and the \"plot twist\" in the end is just lame and overall there's nothing you haven't seen before. Also, every single aspect needed more work. The background story is extremely shallow, the explanation about the fate of the earth is barely touched, characters need more context, it has weak dialogs and it feels a bit slow. But, I still enjoyed it. The movie has its moments. Everything that happens in the space station is entertaining. The actors deliver a good job and Clooney really immerses himself in the character.Good camera work, good cgi, colors. It's a very beautiful movie.In the end, it's a sci-fi drama with some action scenes and I found it interesting. If you like space, go for it, it's not remarkable but it's entertaining."}, {"rating": "8", "text": "A scientific base in the Arctic is being evacuated due to a global catastrophe in the mid-21st century. Only the astronomer Augustine Lofthouse (George Clooney) remains, who later discovers a girl who had not been evacuated. In parallel, a manned ship from a planet near Jupiter is returning to Earth, ignorant of the catastrophe that is devastating it.Clooney's new film as a director is a real challenge to the new average taste of the public, which is why it is coming under heavy attack from it. He incurs several \"sins\" that the current average viewer does not forgive: his pace in general is slow (the now much reviled slowness), there are aspects of the plot that he deliberately does not explain (and that in this way become more ominous), his pessimism is evident, he avoids underlines and its end is misunderstood by many. Its conservative and more conventional aspects, which have to do with a certain occasional sentimentality and the central place that it gives to family ties are curiously overlooked.On the other hand, given that Midnight Sky in its own way pays tribute to the science fiction cinema \"with a message\" from before but ultimately privileges, with certain licenses, science fiction (let's not forget that Clooney starred in the Solaris remake) also receives hits criticism, since it does not reach or propose the degree of psychological, metaphysical or existential depth of its models or of Nolan's delusions in vogue abuse, for example.Augustine is the prototype of a brilliant scientist who has been left alone by neglecting his personal ties, in particular, family members, but who will be loyal to his \"mission\" until the end and luckily saves us transcendent monologues with voice-overs about the same.The film combines a survival on Earth drama with a \"spaceship in trouble\" drama, both of which are very well staged and lavish images of great beauty. We observe elegance and deployment in the design and resolution of technological devices (laboratories, consoles, spaceship), which nevertheless avoid overwhelming. The spikes in tension and action on the ship and on Earth are very well resolved and filmed. There is at least one sequence on the ship that will surely remain in science fiction anthologies.Clooney carries on with sobriety and solvency an aged and sick character, well accompanied by the rest of the cast.In short, an elegant and beautiful film, with great production design but that does not intend to overwhelm, which in its own way defies the current average taste of the public, which seeks to balance the science fiction of adventures and entertainment with the introspective, psychological-existential and with a message and that, in general, is successful in the challenge."}, {"rating": "8", "text": "Have you ever heard of the quote \"show me, don't tell me\"? That's what a good movie should do and, despite being based on a novel, that's what \"The Midnight Sky\" does! If possible, try to watch it on a big screen and increase the volume to 11! Seriously, it's visually stunning and it's a shame it didn't come out on the big screen. Initial reviews from both reviewers and critics might have been completely different if it had! Truth be told, \"The Midnight Sky\" is not perfect. I feel this movie would like to be another \"Interstellar\", but it's more like a mixture between \"The Martian\" and \"Gravity\", even though it's far superior to the latter in my opinion. It's a slow burn, the editing can be rough at certain points and it's definitely not great as a whole and the dialogues are so limited. There's not much of a backstory or even a story here! Remember, this is a movie that follows the motto \"show me, don't tell me\" and various aspects are open for interpretation! I actually loved the lack of exposition, the ideas aren't fresh, but the tone and the perspective truly are. Some people might find this process tiring though. Thus, depending on someone's point of view, the characters can either be really interesting and meaningful or underdeveloped. I liked Clooney's direction and acting, I loved the twists and the feeling I got. This movie has heart! Even though \"The Midnight Sky\" is not a film for everyone, I think you should at least give it a try and judge for yourselves."}, {"rating": "1", "text": "As a strong believer in the coming eco disaster and climate change, and a strong non believer in Woke politics, this movie gets it wrong, as Clooney as a character, actor and director always does. Clooney has always been all about the elitist Hollywood way of explaining problems, and loves symbolic empty causes and gestures as he showed with his Darfur campaign in the past. The Midnight Sky is overacted, over dramatized and misses the real point about either actual human solutions to eco problems (stopping cuddling and over population for starters ) and makes a Hollywood drama out of surviving a potential disaster, where as reality will be neither Mad Max nor Clooney drama but just tough real problems like running out of clean water, or resources or dealing with all or tech and techno fixes disasters. Clooney is the true salon-socialist or Hollywood democrat, and less a real progressive then he is truly old Hollywood. Monuments Men was probably an even bigger trainwreck."}, {"rating": "5", "text": "A decent movie that should have focused on the important things a lot more. There were a lot of left out questions in the end. The end itself was good even tho it felt completly differnt from the rest of the Story. Anyway the movie shouldnt have been 120 minutes long. They should have removed those scenes where actors just walk around without doing anything and should have filled them with scenes of story explaination. At the end I ask myself questions such as \"what really happend to the earth?\". The plot felt incomplete and the left out emotions of the movie that were only finally comming through in the last 15 Minutes didnt made it much better."}, {"rating": "1", "text": "Good Lord, this was utterly disappointing. Compelling enough to get to the end, but at the end I resented spending 2 hours on that garbage. Every single thing about it was predictable, and ridiculous. Like, you’re dead from hypothermia dude. Like, you can’t save the human race with incest babies. Like, we can see the space walk disaster coming from 10 miles away...seriously? Etc etc etc. Have some respect for your audience, man. And the music is uninspired, sappy, almost condescending. Ugh. What a shame to use all those resources to tell such a hopeless and stupid story. And then the credits roll over the most monotonous scene in the history of film—of them pressing meaningless buttons presumably what, setting course for the moon-planet where they will have to make their children have sex with each other in order to live more than one generation? Gross. And all of humanity is dead or underground until they starve, certainly including the two idiots who thought they could go down into the apocalyptic hellscape and somehow meet their families. Gag. What a piece of crap premise in every way. Never reading that book!"}, {"rating": "3", "text": "Drama without much substance, hyped up. Beautiful photography, CGI and costumes, passable acting (they frankly look bored) and script full of inconsistencies. Also, very slow pace with overemphasis on pointless exposition and blanks stares. Meh."}, {"rating": "8", "text": "An extremely well-done apocalypse movie wherein the Earth has been rendered uninhabitable possibly by an EMT triggering every nuclear weapon in the world. Clooney plays a terminally-ill scientist refusing evacuation to man an Arctic science station (the poles are the only spots even momentarily out of the spreading radiation clouds) for the purposes of warning returning space missions about the changed conditions on Earth. If you are seeking an action movie or space fights, this film is not for you. Rather, it's a thoughtful film about regret and the changing priorities of both humanity and individuals when everything they've known has been destroyed.  What's important, now?  The story is brilliant, the writing superb, and the resolution very satisfying, but needless to say, not everyone lives happily ever after.  The vision of the writer wasn't clear to me until the last few minutes of the film.  I loved it and watched it twice."}, {"rating": "3", "text": "Quite dull with little payoff. Disasters  thrown in for no good reason other than to stretch it out. It might be good for some but not me."}, {"rating": "4", "text": "This looks like it's SUPPOSED to be a good movie, but my god how dull and vapid it is! It hardly makes an effort to help you care about the two central characters and their journeys. Midway through, I felt like I'd been watching it for 3 hours! By the end, I was actually annoyed. All the emotional beats were OFF, even the score was just.. meh. And that final scene? I wanted to throw the remote at the TV. Clearly, Clooney thought he was making a \"masterpiece\" but the end result is just a huge and ultimately frustrating let down."}, {"rating": "4", "text": "I love a good apocalyptic thriller but this was a complete yawner. Literally nothing happens on a frozen/torched earth (we never really know what caused the apocalypse) or on the space mission to find a habitable moon/planet. A mute girl shows up \"suspiciously\" to give Clooney something to worry about, and the usual tropes of traveling in space are the main source of drama there. (The reveal on that girl in the end I had pegged immediately and I'm really not that clever.)Clooney plays against type as a soft spoken engineer sporting a  full-on Santa beard wth a buzz cut. Felicity Jones is a pregnant astronaut with nothing much to do except worry a lot. The most interesting scene was a dream where she's on a potential habitable moon of Jupiter and the ship leaves without her. Now that would've made for an interesting flick, except it was already done with The Martian."}], "recommendations": ["annihilation", "sunshine", "stowaway", "interstellar", "eo", "snowpiercer", "prometheus", "captive_state", "anon", "chaos_walking", "greenland", "source_code", "arrival", "coherence", "gravity", "mortal_engines", "the_titan", "lucy", "children_of_men", "the_grey", "in_the_heart_of_the_sea", "downsizing", "dunkirk", "contagion", "elysium"]}