{"id": 1782, "title": "The Dark Tower", "starring": ["Idris Elba", "Matthew McConaughey"], "runtime": 95, "genre": ["Fantasy", "Action", "Science Fiction"], "description": "A boy haunted by visions of a parallel world aids its disillusioned guardian in preventing the destruction of the nexus of universes known as the Dark Tower.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/i9GUSgddIqrroubiLsvvMRYyRy0.jpg", "categories": {"plot": 3.3692307692307693, "acting": 4.8, "ending": 3.8, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.285714285714286, "funny": 5.4, "action": 4.653846153846154}, "reviews": [{"rating": "0", "text": "This series is second only to Lord of the Rings in my favorites of all time.  I've read the books many times.  I've dreamed of this story being brought to the big screen for 20 years.  This movie is a **** alternate story set in the Dark Tower Universe. It has next to NOTHING to do with the books.  It's it's own story and it's a crappy one told on a budget with horrible casting, a mushy, utterly banal script and totally standard special effects.  It is literally the worst book adaption brought to film I've ever seen.  Stephen King and all involved... you have forgotten the faces of your fathers.  Shame on you.  Court would have beaten the living **** out of you had you handed him this pile of drek. Tragic.  Mark my words nothing more will be made based on these books.  You've ruined what could have been a 7 year saga bigger than Game of Thrones.  Unforgivable."}, {"rating": "0", "text": "This thing posing as the dark tower manages to turn one of the most epic, insane, heartbreaking, and fun series into boring, tired, drek. Do not see this movie if you read the books, especially if you really loved them."}, {"rating": "2", "text": "Honestly. We waited all this time and had to listen to all the stories about the movie being 'on...then off again.....' for the last 10 yrs and they came out with THIS piece of garbage?Save your money."}, {"rating": "0", "text": "As a huge fan of the book series, this is a very disappointing movie.  Fans wanted the actual Dark Tower series.  Not some stunted alternate version that has nothing at all to do with the series.This has all the signs of the typical Hollywood book-to-movie adaptation disaster.  Take a series with a devoted fanbase.  Slap the name on a generic action movie.  Put in a few references to the books \"for the fans\" and call it good.No thanks.  The Lord of the Rings strayed slightly from the source material, but they did it *RIGHT*!  Nobody wanted a fake Dark Tower movie.  They wanted a series of movies that at least attempted to stay true to the books.There is one other thing I have to say to maker of this travesty.  It has been said before.You have forgotten the face of your father."}, {"rating": "3", "text": "Is this movie an entertaining 95 minutes?  Yes.Good casting choices? Yes, I loved the actors.Does the film have other good qualities...?Not many.  This was one of the worst film adaptations of a novel I've seen.  When you consider how long this adaptation has been a concept, how many attempts have been made, and the effort spent to achieve this in 2017?  I seriously just don't get it.  #CashGrab #AudiencesAreStupid  #JustGetItDone?All right, only 5000 characters I can post.  Let's get this over with:1) Tone & Mood.  Mostly wrong throughout the film.  The books are epic in scale, very dark and brooding.  Post-apocalyptic, lonely, desolate, etc.  While the film occasionally makes you feel that way, mostly it's \"Just Another Action Film\".  Many scenes feel forced.  Many scenes feel totally artificial.  Not sure what the director was looking for, but they failed.2) Story.  The film's title is misleading.  It should have been titled \"Jake's Adventure feat. Roland\".  This film was really all about Jake.  Everyone else is a guest star.3) Roland's motivation for pursuing the Man In Blank is *completely* different than the novels.  It's nonsense.4) Roland is supposedly *not* a Gunslinger anymore due to the above point.  I cannot even begin to describe how much this irks me.5) Roland embraces Jake as a friend too early/easily and divulges personal information.  I'll just blame the 95 minute length for this one.6) Walter cannot harm Roland *directly* with magic.  However, apparently he can harm Roland *indirectly* with magic, by throwing very sharp and fast objects at him.  So while Walter *could* have very easily dispatched the Gunslinger these past dozens of years, or when he killed his father, he didn't...because why not???6) Not sure why Jake needs an evil stepfather when his equally careless and inconsiderate father from the novels would have sufficed.  Unnecessary script change.7) Post-apocalypse villagers apparently still have working generators for inter-dimensional portal technology?  Wow.  Besides blatantly violating the novels, you'd think with such portals and technology at their disposal, they'd have better defenses.  Why not zip over to Earth and steal some firearms?8) No explanation of what Gunslingers actually are.  Audience is left wondering what's the point of them.9) Jake's \"shine\" powers are drastically over-mentioned, over-used, overblown compared to novels.  Besides cross-dimensional spying on people, he can maintain inter-dimensional portals?  Amazing.10) Apparently Jake killed the creepy house demon with his powers?!?  This was not at all obvious during the \"fight\" scene.  Good thing Walter mentioned it later, or I wouldn't have known.11) Roland briefly teaches Jake to use firearms.  Then immediately says Jake doesn't actually need them, because his powers are his mind.  What was the point?12) Random attacks of random things in forest, because we needed some action scenes.  Roland, gunslinger supremo, doesn't hear Jake leave camp and wake up immediately?13) Dark Tower will ultimately be *really* easy to find, since you can just follow the gigantic blue attack-beams made by the Breakers.  Of course, they'll likely use one of the many high-tech portals just lying around everywhere...14) Vampires hide from us the fact they are vampires?  Would have make henchmen scarier. I guess we'll be surprised later.15) Hospital treats Gunslinger for various unusual ailments.  Neither he nor Jake have forms of ID. No police called, no security guards at hospital.  Gunslinger and Jake just stroll out.16) Firearms shop person easily ambushed by man with firearms.17) Inter-dimensional portal in NY kitchen left standing open during latter half of movie?  No FBI/CIA/NSA called?  Chefs just continue cooking and ignoring gaping portal, until Jake and Roland return?  Maybe more of Jake's mysterious mind-portal-control nonsense.18) Jake is awarded title of gunslinger for staying strapped in chair, resisting mind control, and maybe keeping portal open?  Whatever.19) Does Roland reclaim title of gunslinger for himself?  Why?  His motivations were rescuing Jake, with a side-motivation of revenge on Walter?  Yes, rescuing Jake *happened* to have good results for the Tower.  But does Roland ever actually admit he cares about saving it and the universe?20) Roland's father stands in for Cuthbert and Alain?  Seems another unnecessary script change, but fine.21) Besides the occasional comic relief, Roland seems pretty comfy in NY.  Why?  Totally different from novels when he sees it through Eddie.22) Walter is supposed to be unpredictable, kind of crazy, chatty, psycho, never-know-what-he'll-do.  In movie he's a pretty serious villain.Well, that's almost 5000 characters.  So...people of Earth?  Can we acquire some film rights and allow independent filmmakers to redo this someday and do it justice?"}, {"rating": "2", "text": "What a waste of a big series of books. Once more a King filming properly goes off. The trailer shows only a lot of gunfights with very thin action and weak dialogues. Hence, the whole film has not become better. To the abovementioned problem still come many lengths on the negative list."}, {"rating": "5", "text": "A film that can only be described as highly unremarkable. The film is made fine but there is just nothing that excites the audience to want to watch. Idris Elba's Gunslinger could be interesting in a better movie, but Matthew McConaughey is campy in all the worst ways. A lifeless film that should rethink any potential sequels. C"}, {"rating": "5", "text": "I am currently reading the dark tower series (currently on wizard and glass) and if you see this film expecting the glory of the books you will be seriously disappointed. As a stand alone film it can be pretty enjoyable, i enjoyed the three main actors especially the lad who played Jake, McConaughey  was good as Walter as well. The action scenes were pretty solid, watching Roland gun down rooms full of people was epic.  Think this film could have been a lot better it  was substantially longer with more of the lore in it. Also where the beep is Eddie and Susanne? Ultimately this is a film you can watch with enjoyable moments but flawed in many ways. Don't think it deserves a zero,  don't think there are many films out there that deserve a zero."}, {"rating": "6", "text": "Stephen King's best work, gets a watered down adaption. That feels like the director and screenwriter, both never even read the books. Roland (Idris Elba) in the books is obsessed with getting to the Tower. Here he only cares about revenge on the Man in Black (Matthew McConaughey) who killed his father.While Jake's (Tom Taylor) backstory is a bit tampered with too. I am pretty sure in the book, he got to Roland's world by being shoved in front of a car by a mad man. I am sure Jake being obsessed with drawing Roland and his world is from like the 2nd or 3rd book.The books were quite violent and graphic. With a Western like feel to them. There's not much screenwriter Akiva Goldsman got right. The plot is a incoherent mess that doesn't feel like any of the books. While none of the books are close to PG-13.The best things about this movie is the Idris Elba and Tom Taylor chemistry. As well as the humor of when Roland tries hotdogs or Soda for the first time.McConaughey tries hard to play a cold hearted bastard and succeeds on some levels. Maybe because his character does some evil things. I also liked the mind control scenes. Otherwise I think they needed someone like Willem Dafoe who could play evil in his sleep.All in all, Sony and Akiva Goldsman are where this adaption went wrong. As well as being too short. King's prized possession shouldn't be in the hands of the studio that brought us the Ghostbusters reboot and the Emoji movie.While Goldsman hasn't adapted one book well. The screenwriter of Batman & Robin shouldn't be allowed near anything Stephen King. Especially The Dark Tower. Adapting the Dark Tower, proved he shouldn't have been near it.Dark Tower unfortunately is like the Last Airbender where they tried to fit a whole season into one short movie. Except here it was 7 books in one movie. While the planned series sounds like a mess too when apparently it will skip earlier books and go right into book 5 and a in between book King wrote after book 7. Should have exactly started from book 1 with this movie, it's not that hard."}, {"rating": "4", "text": "\"Темная башня\" - скучный фильм. Я не читал книгу Кинга, но даже мне фильм не понравился. Он клешированый, нудный так ещё и пацан вообще играть не умеет. Аж бесит. Что хорошие в фильме так это Эльба и МакКонахи, они брутальные в своих ролях. Многие жаловались что фильм идёт 95 минут. Так и за это короткое время смотреть его становится скучно."}, {"rating": "6", "text": "This is a good movie! Well... Amazing performance by Matthew McConaughey, great visual efects, but there is something in the movie that didn't get to me! The storyline is floppy. Everything is forced. Then the klischee end where the good guy kills the bad guy! Is it overseen like 1000 times! Kind of a dissapointment, but still entertaining!"}, {"rating": "1", "text": "I read the books and after watching the movie and considerable thought, I think this movie is piece of poop that should never have been made.  This should be a series on HBO, Netflix, or Amazon that is true to the source material(well, mostly true to the source material)."}, {"rating": "7", "text": "Based on the bestselling book series by highly acclaimed author Stephen King, The last Gunslinger, Roland(Idris Elba), has been locked in an eternal battle with the Man in Black (Matthew McConaughey), determined to prevent him from toppling the Dark Tower, which hold the universe together. With the fate of the worlds at stake, good and evil will collide in the epic battle as only Roland can defend the Tower from the Man in Black.--I begun watching this with mixed expectation. Was a bit disappointed to see yet film based on 'kids'. That alone makes it hard to take the film seriously. It's a fact there is a limit to how well kids can act compared to full fletched young adult or adult actors/actresses.The ideas and concepts are good. Though not exactly original, with respect to demons eyeing to dominate human world. They still make a good general concept for a good story. However the idea that kids' minds (after being strapped to machines) can be used to destroy the tower, is a really silly concept. I generally like the film as I was watching it. The pacing is alright. Actions are well choreographed. The plots lack depth, and have the problem of being kinda predictable.Characters are all underdeveloped for the most part, except for Roland where the film shows some key aspects of his past. The villain (Man in Black) is pretty cool and ruthless, and have some nice abilities, most notably the ability to command any human to do what he commanded at will, with a simple spoken command. It would be nice if the film delve deeper into his background character and his past.If you like The Mortal Instruments (film), give this a watch.Plot: 3.5/5Characters: 3/5Action: 4/5Worth a watch in cinema: Yes, if you like action and okay with simple plots."}, {"rating": "6", "text": "While Matthew McConaughey and Idris Elba play their roles well, the film is harmed by an array of negative aspects. A story of epic scope such as Stephen King's The Dark Tower requires ambition; clearly severely lacking in what is no more than a 1 hour action flick. The film is rushed, and quite frankly, harmed by a young actor that isn't quite up to it."}, {"rating": "5", "text": "The Dark Tower is an action movie based on the Stephen King book.It tells the story of The Dark Tower,obviously, which is basicaly the protection of all universe aganist the dark forces,and it´s protected by gunsligers, but THE DARK TOWER can be destroyed using the mind of a kid so a bad guy start to capture kid and put in his crazy machine that starts to detroy THE DARK TOWER, and it only left over only one gunsliger, and we got his drama stuff (that is actualy good) and there is this medium kid that have visions about the Dark Tower and the bad Guy so they go on an epic generic story.If you takes all the sobrenatural stuff this is another action movie so if you`re expecting something awesome and inovator unfortunately this isn`t the movie, and it´s really sad beacause it has potential. One of the Highlits of the movie is the villan, Because he got every thing that you expect of a bad guy he is **** and if you are a little sensive you will hate him (If you like Loki you will love him, really) about the heroes the interaction of then are okay and the actor, actualy the all cast is good.The movie ritm is slow and may be boring but the action scenes are really good, actualy there is one scene that for me it`s the second best action scene tha I ever seen (it only don´t superates that one of the Church, on Kingsman)This is a boring movie with great action scenes that keep you at the universe but not at the story."}, {"rating": "0", "text": "While i'm not a fan of the book series I have read the first two and this movie goes out of its way to change everything into something that will have mass appeal rather than a niche movie for fans. It was incredibly miscast, the prime culprits being the Gunslinger and the man in black, the plot was generalized and changed so much from the book nothing made sense at all and it spent way too much time on earth when the book mostly takes place in midworld. This movie was an attempt to cash in on a successful franchise while generalizing the plot to maximize profit from mass appeal."}, {"rating": "2", "text": "He who trusts Sony with his franchise has forgotten the face of his father….A film adaptation of Stephen King’s epic seven book series The Dark Tower has been along time coming. After languishing in development hell for decades with directors, stars and studios coming and going, 2017 has finally seen the story of Roland of Gilead and his existential quest for the mysterious Dark Tower brought to life on the big screen.Except not really….Although I haven’t yet reached the conclusion of the story in its original medium, I know enough to know that this film is for the most part completely divorced from the source material.From the opening text its clear that the filmmakers have decided to simplify and streamline the (admittedly meandering) plot of the books into a more straightforward ‘Macguffin’ plot involving the use of children for evil purposes.From there we get a fairly generic ‘save the world’ story revolving around a young boy from modern day New York (Jake played by Tom Taylor) as he journeys to strange new worlds and meets ‘The Gunslinger’ Roland (Idris Elba) all the while pursued by the sinister agents of The Man in Black (Matthew McConaughey).Making Jake the protagonist of this first attempt to adapt The Dark Tower makes perfect sense. In a complex world of parallel universes, ancient cultures and high fantasy, having a character from ‘our world’ to ask the questions is a tried and tested genre trope (think Neo in The Matrix or any of the Doctor’s companions in Doctor Who).Unfortunately, Jake’s attempts to understand just what the hell is going on are met with vague answers, mountains of exposition and throwaway lines that deserve much more explanation than they are given (did he just say ‘Excalibur’?).For some bizarre reason the filmmakers have decided to try and cram the full story of The Dark Tower, complete with a final confrontation between The Gunslinger and The Man in Black, into one 90 minute film. In a world in which EVERYTHING wants to be a multi-film franchise and The Fast and Furious series has no less than eight entries with a ninth on the way…this choice makes no sense on any level.The film itself doesn’t make a lot of sense either, image if someone tried to edit the entire Harry Potter series into a 90 minute fan film on youtube and then put it out in cinemas — there you have The Dark Tower (2017).One of the most frustrating things about the whole debacle is the casting. Idris Elba is great as Roland, with an unspoken world-weariness coupled with a magnetic screen presence, he is an inspired choice for the part (and another reason I was excited to see the adaptation). Likewise McConaughey brings a detached menace to The Man in Black reminiscent of David Tennant’s Killgrave from Jessica Jones, only this time he has the whole universe at his fingertips. Unfortunately both actors are held back by a thread-bare script with very little in the way of ‘character’ to work with and minimal screen time together.In terms of the plot the stakes couldn’t be higher with the Man in Black seeking to bring about THE END OF THE UNIVERSE by destroying The Dark Tower of the title.This should feel like a big deal, but as the film barrels-on, motivations become less and less clear and the point of the whole thing gets lost in amongst conflicting lore and strange tonal choices. As a comparison, The Lord of Rings: The Fellowship of the Ring did a great job of setting up the potential horror of the world under the rule of Sauron, making it very clear what our heroes were fighting for and setting up their motivations for the next 7 hours of screen time. The Dark Tower instead chooses to make Roland and Jake’s quest to take down the Man in Black far more personal, so much so that by the end, the pair seem fairly apathetic about the whole ‘end of the universe’ thing.More than anything The Dark Tower is a massive wasted opportunity. As a book reader (sort of) it’s hard to know what general audiences with no exposure to the series will make of this cinematic mess but judging from the poor box office it doesn’t look like they thought much. What could have been a epic story spanning over a decade in film or TV has fallen at the first hurdle.While some Stephen King’s fans are understandably angry at the failures of this adaptation I can’t say I feel the same way. I think the negative buzz combined with the short run-time prepared me for the worst. I’m not angry, I’m just disappointed."}, {"rating": "1", "text": "Cliched, weak, uninteresting bland generic scripted \"action movie\", filled with boring senseless stuff because not only did they shave off 95% of the material it was \"inspired\" from, but also, tried to shove up random stuff without no explanation at all (locations, images, characters, behaviors etc). Complete waste of time. People who say this movie is not bad are being too kind."}, {"rating": "3", "text": "I expected better, to start right off the bat.    Much better.    Yet another Stephen King saga set to film with some promise, but manages to come up short.    I submit the original \"Rose Red\" and \"It\" for evidence, two movies that are impossibly long, and twice as dull.    So at least \"The Dark Tower\" spares us the monotony, but even with the prospect of Matthew McConaughey as a sorcerer set to destroy the Universe which is protected by The Tower, the film never bothering to explain how, and the fine actor Idris Elba, fails to grip the imagination.    What matters here is the lack of intensity, emotion, and frightening moments you ought to expect given the premise.    McConaughey does not come across as evil as he is supposed to be, nor do his followers.    For a character supposedly the last great cosmic Gunslinger, Elba does not connect, and that's really the fault of the script.    This movie is disjointed, fails to involve the viewer, and worst of all, comes across as yet one more hack sci-fi/superhero cliche.    King's formulas have run their course, and the lack of fresh approaches to what could have been a good movie in better hands is wasted.    For a film about impending apocalypse, we're left thinking it will be a boring one."}, {"rating": "2", "text": "The Dark Tower sets a new low for how loose and unrecognizable a book adaptation can be and still be presented as such to the audience. I don't know for whom the movie is intended. For the fans of the book series, it will be infuriating as the movie is as far from a good adaptation as possible. For the people unfamiliar with the book, it is just another dull, boring, teen fantasy movie. Truely a shame."}, {"rating": "1", "text": "God awful.  I went in, a fan of the books, with the lowest expectations, knowing what would be on screen would be different, so I'm not nitpicking about small nuance changes, but rather, immense changes that fundamentally change the story, and certainly not for the better.A major shift in character is Roland.  Forget about casting Elba(who did fine,as expected), be more concerned with the night and day difference in the character.  In the books, a recurring theme is that Roland is constantly faced with incredibly difficult, life and death choices to make.  Roland is who he is because of years of his obsession with the tower costing those around him dearly.  In this film, Roland is barely even concerned about the tower at all.  Not only does not have to make tough choices, he doesn't make any at all.  His character guided through the film on a rail.  Jake makes the discoveries, Jake makes the strategy choices.  Its Jake that leads Roland.Speaking of Jake, well, readers will know that Jake pays the ultimate price, not once but twice in the first book alone.  The second time, a result of another one of Roland's tough choices.  The line, \"there are other worlds than these\" is used in promotion of the film, but not used anywhere in the film, and certainly not where it comes from in the book, where it is so pivotal, and causes major change in Roland's character.  All missing.Another key missing element, is the journey!  Every step of the way in the books is an ordeal unto itself.  Here they literally jump from place to place, not really having to earn any of it the way they are forced to in the books.It was nice to see little touches, like the rose graffiti on the wall at the end of the movie, or that Walter's base(?!) is at 19-19.  That they say \"thankee sai\" in the village.  But all is overshadowed by other major elements reduced to line or two, such as the whole concept of \"the world has moved on\" reduced to Roland not knowing what a theme park is.  All of Ka, reduced to Walter's one line \"once more around the wheel my friend.\"Its not just that its different.  Its that it rips the soul from the story and the characters.  It does not resemble the story at all.  If you loved the books, you'll likely be disappointed or upset.  If you never read the books, you'll likely leave wondering what any of that was about, since they do very little explaining for the uninitiated."}, {"rating": "0", "text": "This film was only like the novels because it became a tired mess by the end, and it was similarly, with minimal effort by its writers, abruptly put out of it's misery."}, {"rating": "1", "text": "If you are a fan of the series, please, don't do it to yourself. This is a ham-fisted travesty of an adaptation. This story, this universe, these characters, deserve so much more. Instead we're subjected to a cheap, shameless cash in on the brand recognition of King and the Tower, which lives up to not one bit of potential. What a waste. Genuinely upsetting for a fan, utterly boring for everyone else."}, {"rating": "2", "text": "After watching 1 hour and a half of terribly handled action scenes, I can definitely say that Dark Tower is one of the worst films this year and probably the worst Stephen King adaptation. The very few parts that surprised me about this film is Matthew McConaughey's Man In Black, a surprisingly memorable villain that will give kids nightmares!Idris Elba's Gunslinger is weak, not memorable and just flat out disappointing, the story spans around 5 books or so, the plot is overstuffed and crammed into a complete disaster of a film, a few surprising scenes with good visuals can't save this terrible, boring attempt at recreating a fun book."}, {"rating": "0", "text": "This movie absolutely sucked. They've ruined the Dark Tower and Stephen King is laughing his way to the bank with a check for $10 \"haha, suckers! This'll last me a week!!You have forgotten the face of my ass!\"The author is as much to blame for this as the production, fawning over this movie like it does any of the books justice. It does not. Don't care about the gunslingers skin tone, but the tone of the characters and world are completely replaced with nonsensical fluff.I don't know how anyone (King included) can agree that removing Eddie Dean and Odetta Holmes would be beneficial to the story. They are absolutely essential.Guhhh, so sad how this turned out. Until next time folks, hopefully on a better movie, game, or TV show."}, {"rating": "4", "text": "The Dark Tower looks promising, but that's only because you just saw all of its advertisements and promotions. As a fan of the books, you may not find the fun you end up reading in the books here. As a newcomer of the series, don't start here. There's pretty much reasons why not to, but that'll just defeat the purpose why I should tell you this when you could be reviewing all of this film's advertisements and promotions to find the answer."}, {"rating": "2", "text": "There are a few issues here from the start. 1. This is a VERY LONG book series, that incorporates a bunch of King's characters from other books in certain ways, its basically a homage to himself (which makes sense for King). 2. The books suck, they are all setup with no payoff (again pretty typical for King with of course a few exceptions).  That being said the setup in the first book or two is actually pretty good, but its just set up, and then it turns into a disjointed disaster with King playing himself. 3. This series is wayyyyy too deep to do in a movie let alone 3.  The depth of the characters backstories and how they all change (which is really the only redeeming part of the series - except roland his ending sucks). Thats impossible to do in one movie.  The way to salvage this series was to do a movie basically only about book 1 and END IT THERE.  The problem here is they are using a movie to try and set up a TV show, which after this may not happen anymore who knows. 4. Stephen King is the most overatted author ever.  He does bring up interesting ideas and develops characters well, the problem is after that he doesnt explore the interesting idea and the development is meaningless because the rest of the story sucks and goes off into convoluted territory with no real ending. Or over 1000 pages of repetitive \"love story\" nonsense that was 11/22/63.  Another book that had a pretty good beginning and then completely falls apart and you wonder why the hell you went to the end. IMO one of if not the most over rated book ever."}, {"rating": "0", "text": "To put it quite simply, this is not a dark tower movie. I have read every single book in the series and have been a fan for years. I was so, so disappointed by this movie, and how poorly it resembles the book series. The only way that I could think of to do the Dark Tower any justice via visual media would be to hand it over to HBO or Showtime to create an unrated series that takes several seasons (at least one per book if not more) to tell the story as it should be told, and even then I would expect them to ruin it as pretty much every HBO and Showtime series has a specific \"style\" with specific elements that they add that is not a part of any original work that they adapt. Anyways, tl;dr, if you are a fan of the books, just don't bother."}, {"rating": "5", "text": "I left the Dark Tower series, entertained but longing for something else.  It wasn’t a horrible film, it just felt like a “see once and done” film.  The story felt rushed, the tone inconsistent and the film suffered from too many character arcs to really flesh anyone out. When you attempt to fit an entire book series into one movie, you set yourself up for the above mentioned issues.  I felt the one saving grace was the performances of Idris Elba and Matthew McConaughey, which were both good.In my opinion the film would have done better if it focused on just one of the books instead of trying to encompass the entire series.  I do hear they are making it into a TV series which if done correctly should be able to better capture the thematic elements of the books."}, {"rating": "4", "text": "I wanted to like this movie.   It was a tough pull to swallow when i could not.   I followed Roland's adventures in the books and this did not capture the spirit.   Idris Elba was the one bright spot....hopefully his next role will James Bond."}, {"rating": "0", "text": "Yeah, so I don't know what the writer(s) director(s) were thinking with the Dark Tower series. Instead of just starting from the beginning like they should have, they begin the film focused mostly on Jake. More importantly, the opening sequences makes it appear as if the film (and the Dark Tower) is focused around Jake, which is absurd. While Jake was a major character, his role was never as important as Roland's.It amazes me, really. Fans for a franchise will work hard to propell to popularity and then, hey, let's make a film about this beloved franchise and then just mess it all up. Has Hollywood learned nothing about messing with the source material?King should be ASHAMED he allowed this sad excuse of a movie to have been released. What a waste of time, effort and money. A stain on an otherwise amazing series by Stephen King.  Fans of the books WILL not like the movie. Take the money you were going to use to see this film and use it to wipe your butt next time you have a bowl movement, it's about the same thing."}, {"rating": "6", "text": "Let's be clear here. This is about as shameless as cash grabs come, with Sony clearly trying to profit off of the name of a brand alone, rather than the merits of the world within. With that said, however, this piece just skirts by for me as a movie and a movie alone - not as an adaptation of any kind of source material. Indeed, the solid performances from Jake Taylor, Idris Elba, and Matthew McConaughey help mask all flagrant pacing and macro-structural issues running rampant in this particular work, with the vibrant world and infectious lore ultimately winning me over in the end as well. I just simply wish these particular pieces (the world and lore, that is) were more developed and prolonged overall."}, {"rating": "4", "text": "While the third act of the film picks up in terms of action and pacing, the film that precedes it is a mess of thinly developed characters with questionable motivations, and forgettable action."}, {"rating": "4", "text": "\"The Dark Tower\" could've been the start of an interesting new cinematic franchise, but it's 95-minute runtime is way too short for this source material, leaving it more of a bullet point summarization of Stephen King's series, than the movie with a worthwhile story it should've been."}, {"rating": "6", "text": "Adapting a book as complex as The Dark tower series, into a film, is no easy task, and some things just have to be changed in order of making it work. If this was a stand-alone story without any ties to any books, it would be decent, not perfect, but not bad. Because it's not a bad film, the acting isn't bad though there's a severe lack of depth to the cast, Roland stands out as confused, Jake even more so and Walter just pure evil. It's one dimensional, but it works. But I've also read the books, and was expecting so much more, especially since King had talked so much about not wanting this adapted to film, because he care too much about it. The film basically takes the first book and the last book, makes a mash-up and calls it a day. They've completely skipped a LOT that could have been an epic series of films, and they could easily have made 5  2-hour films out of the series and still made good of it. This film needs to be seen as a stand-alone, forget it has anything to do with \"The dark tower\" book series, read the books, see the film, but forget that they have any connections."}, {"rating": "5", "text": "The last Gunslinger (Idris Elba) is locked in eternal battle with mysterious Man in Black (Matthew McConaughey), determined to prevent him from toppling the Dark Tower, which holds the universe together.Stephen King has released a lot of books already (most of them fiction), and there’s also a big number of screen adaptations of his work. But this is the first fruitful attempt to bring his „Dark Tower“ saga to the cinemas, which has already disappointed and/or made angry a lot of fans and critics.Controversy was to be expected. King himself and many of his admirers find „Dark Tower“ series his crowning achievement and magnum opus, so there was probably never going to be a way to adapt even part of the eight novels into a movie. At least not in a way that would satisfy both constant readers and those who just came to see a sci-fi/action movie alike.The project was in pre-production hell for quite some time and the various parties had several different approaches to make it all happen.I am not sure what was the motivation behind using the script that they finally used, but to call this a „Dark Tower“ adaptation, or even King adaptation, is kind of stretching it.What they did was to take some elements of the whole big DT mythos, including three of the major characters, and then change it whatever the hell way they wanted.I am not against remixing King per se, and some new things are pretty cool to see on the screen at last – concentration camp for „shining“ children“ and the mentioning of Keystone Earth, for example. But the new story, which is replacing King’s stories, is underwhelmingly shallow to say the least.In 94 minutes, there’s no room on any world, story, character and relationships building that King has famous for. Most of the events happen and pass fast, just because it is supposed to happen, not that it develops organically from what has come before.It’s not a satisfying solution, not for King lovers, not on its own.The only good thing I have to say about the screenplay is that you can follow it without having read any of the King’s work. But then again, it also makes the ending too definite and clear-cut which was never the aim of the series.Matthew McConaughey is good too, ruthless and menacing, although they have changed his character in ways that I don’t quite like, making him kind of boring. If the nemesis has lost much of the mystery surrounding him and has become almost unbeatable, it’s quite hard to hold suspense when he’s around.I also like that Idris Elba has gotten another starring part in major project, but it’s far from his more memorable work such as in „The Wire“. We don’t get to know enough of gunslinger to care about him deeply – I would say it’s actually part of the problem with the book series too.Elba gets to shoot a lot and growl some lines (on screen, he’s actually chattier than in books) but I can’t say he comes across as terribly charismatic or memorable. Still, some call him one of the best things in the movie.As a long-time King fan, I am still kind of glad to have seen a „Dark Tower“ movie, and the visual side is enjoyable enough – mostly locations, some of the action scenes feel a bit generic.But this is not the movie we’ve been waiting for. At best, we can call it a piece of fan fiction, in the form of long-waited movie.Oh, almost forgot. As a long-time fan, I have read almost all of King’s many novels and collections, and consider „Dark Tower“ series not among his best work. Especially limp are the last two parts (6 and 7), and „Keyhole“.The movie is not limp, at least, just not enough fleshed out to justify all the hype and waiting."}, {"rating": "5", "text": "The movie is super mediocre. The casting is excellent, but the plot is simplistic and does nothing to set up a reason to watch any future movies of the same franchise since things are seemingly wrapped up by the end of the movie.Spoiler: i didn't notice until my brother pointed it out but, in the last fight scene...how does Roland manage to shoot the second bullet faster than the first one to hit it and change its trajectory? I know he is a badass who can shoot really well, but physics doesnt work that way...even in Mid-world!!"}, {"rating": "0", "text": "This movie was confusing and convoluted for those who had not read the books and a vast disappointment for those who had.  Who in their right mind would squish an eight novel epic into a 95 minute long movie?  Trite is the word..."}, {"rating": "7", "text": "Too many seriously negative reviews. Let me try to explain, I've read all the books, all 8. This movie is in no way even an adaptation of those books. It is pure Hollywood and is why so many loyal King readers feel their years of waiting for the perfect Dark Tower movie have been cheated and crushed. Especially with the success of Harry Potter and Game of Thrones from book to screen. That being said, this movie is not poorly done. For the budget, they do a great job at bringing a wealth of action and scenery as well as a cast that does a very good job at selling what they've been given. I went with 2 people who have never read the books and both said they enjoyed the film and were now intrigued in the books especially if it is better than what they just watched, which they most certainly are. If you have never read the books, give it a try and don't bother with the negative reviews from fanboys. If you have read the books, understand the perfect Dark Tower movie may never get made and thats OK. Even an average one can bring even more into our universe and have people reading such a fascinating story, which in turn may let to more creative minds than these to develop an even better version."}, {"rating": "6", "text": "I've read many of Stephen King's books and have always been disappointed by the movie adaptation.  However, I haven't read THE DARK TOWER so the movie was fresh to me.  I thought it was good but not great. Since I enjoy his stories so much I wanted to see this even after reading many reviews."}, {"rating": "5", "text": "I was actually surprised by how bad the reviews were for this movie. I'm usually pretty good at guessing Metacritic ratings and thought this would be somewhere in the 60s. It kept my and my wife's interest.  I found the action scenes to be reasonably well choreographed and tense, with the exception of the ultimate showdown between the man in black and Roland, which was moderately silly but enjoyable. I read all of the books and thought Idris Alba did a fine job channeling the surly but ultimately sympathetic Roland from the books.  The \"fish out of water\" scenes when Roland was in New York were predictable but well executed. The actor who played Jake was capable and unobjectionable. I read all of the books and had a feeling that it would be very difficult to make them into a movie, unless the producers were committed to at least 9 or 10 movies, which isn't realistic. Nevertheless there were aspects of the lore, which they would have done well to incorporate -- for instance, the floating doors/portals, the idea that all things serve the beam, the actual Crimson King and the field of roses surrounding the tower.  They made the man in black too much of a caricature to take seriously. To echo other complaints, I felt that the plot was far too rushed. This movie should have been closer to three hours and they needed more build up and back story. Roland's motivation for killing the man in black felt flimsy largely as a result of a poorly staged and executed flashback.  The Gunslinger books, for me, are the perfect blend of horror, action, and sci fi. If there's a sequel I'd love for someone with more of an imagination to take a crack at it, like an Aronfsky."}, {"rating": "1", "text": "It would've been more fulfilling to have another 10 years without a movie adaptation of The Dark Tower than having this one is. It is pretty apparent that of all the people who wrote the script and were in charge of casting, not a single one has picked up one of the books.It has nothing to do with The Dark Tower, even if they claim it's set in the same universe. Change the character names and it might actually be good.Get the books or audiobooks instead."}, {"rating": "1", "text": "This film is a travesty. Not only does it completely destroy the characters and story from the books, but to the casual movie-goer it is an incoherent and ill-conceived piece of trash. It's a pathetic attempt."}, {"rating": "8", "text": "I knew nothing about The Dark Tower going into the film.  I thought it was a great movie.  As entertaining as any of the marvel films I've watched over the past 10 summers.  It introduced a exciting universe that I want more of.  Why the bad reviews?  Because Marvel fanboy is less critical than Stephen King fanboy."}, {"rating": "7", "text": "The Dark Tower is nowhere near as bad as the critics and fans are making it out to be. Despite the trailers making this look like a straight up action film with bad dialogue, it is in fact a fantasy story containing acting and directing so good that you will forget the script's sometimes lackluster lines. Good actors can make a bad line disappear, and these actors do just that. It's very loosely based on the books, and is considered a continuation rather than an adaptation.The movie centers around a psychic boy named Jake, a cowboy-knight named Roland, an evil Man In Black named Walter, and a Dark Tower that holds the universe together by keeping monsters out. The Man In Black wishes to destroy the Tower so he can rule a chaotic universe. He needs Jake to destroy the tower. Jake needs to find Roland to save him from the Man In Black. Roland seeks the Man In Black for revenge. Each character pursues another, and around and around they go.The movie does a better job of laying the groundwork than the first book in the series, in many regards. Of course, the first book is notoriously confusing. Just like the first book, 3 of the main characters have been left out. This non-departure from the source material helps to facilitate a digestable entrypoint for newcomers.Idris Elba is wonderful as Roland. Some people argue he does not fit the description of Roland in the book, and they would be right. Roland is described as an ugly Clint Eastwood/Steven King look alike, who appears emaciated and ancient beyond belief. Mr. Elba is none of these things. However, he understands how to convey all the necessary aspects of the character. He is full of grit and grump, beleaguered, yet heroic. His performance has convinced many a skeptic to sing his praises, with good cause.Tom Taylor plays an excellent Jake. He fully embodies the worry of a troubled boy who may be going insane, but also the innocence and excitement of someone finding a portal to another world. Child actors often get a well-deserved bad rap, but Tom Taylor delivers every line perfectly.Matthew Mcconaughey was really and truly awful as The Man In Black despite having come so far as an actor and playing such wonderful roles in the last few years. As an all powerful wizard, he was neither intimidating nor believable, opting for an over-the-top take on the character that just doesn't work. It's understandable why he went that route. The rest of the movie allows for, and even encourages, over-the-top at times. However, that was the greatest weakness of the film, and Mcconaughey's performance is the embodiment of that weakness.The score varied from average to well-above average, rarely grabbing your attention, but always fueling the emotions on screen. The cinematography, particularly of the first two thirds, is some of the best in years. Praise should also be cast on the editing. Contrary to the cut-per-milisecond style that has become ever so popular in modern movies--and especially action scenes--The Dark Tower does not fear lingering on a beautiful scene and letting you soak in it, or staying with a character as we see emotions fully processed through their face and body. It's as if the editor knew that they didn't need to cut haphazardly to instill a false sense of excitement, or to cut away from a less than genuine performance. They trusted the story, visuals, and acting to hold our attention, and that faith was well placed. At least, it was well placed for the first two thirds, before falling into so-so territory by the last third.The movie should also be praised for doing with $60 million what many others fail to do with $120 milliom. I'm looking at you Assassin's Creed. The ambition of this project far surpasses others, despite the budgetary constraints.The humour peppered here and there was phenominal as well. Marvel has the jarring idea lately that they should throw humour into every nook and cranny possible, hoping the 15 good jokes make up for the 15 that fell flat. No such philosophy is necessary here. For the first time in years, I felt like every joke worked. None of it felt forced.Of course, the movie had its problems. The tone should have been dark. It was too over-the-top for its own good. It added the strange element of futuristic technology that was completely absent in the books, and the technology was overdone in the style of bad science fiction. The costuming department seemed to think they were making a new Matrix movie, instead of the dusty cowboy/fantasty it should have been.It wasn't a great movie, but considering the source material is known for being unfilmable, it's a shock they made a coherent movie at all. I have newfound confidence that they can learn from the mistakes of this film and make a truly great second installment. Hopefully they do, so we may meet the other three main characters (yes, Oy the talking dog counts!), hear some ZZ Top backbeat, and maybe even meet Blaine the Train."}, {"rating": "0", "text": "An abomination.This crap just uses a famous series name to get your cash.It has almost nothing to do with the 8 novel series.If the title of the movie was Boring,Generic Tripe-The Movie,nobody would even realise it was 'related' to Stephen Kings work.Stay away."}, {"rating": "7", "text": "Having never read the books I cannot compare this film as harshly as the critics have. To me it was a decent action flick, in which Idris Elba does a good job. It felt more like the prologue for a series of indepth movies, but I still respect the effort."}, {"rating": "5", "text": "The first thing to understand about the film is that it is not an adaption of The Dark Tower in its entirety, or any of the component books in part.  Instead, it is a continuation of the story from the point at which Roland walks out of the Tower in Book 7.  True fans looking for a continuation of the story might be rewarded.  The rest of the world may be left scratching its collective head.Leaving aside the feeling that the best stuff happened before the film starts, the second thing to understand is that any sense of awe and wonder is undercut by the previews.  We’ve seen Roland’s otherworldly (literally) skills, and we’ve seen most of Walter’s magic tricks on Youtube, Apple Trailers, etc.  This is a bad thing – what little chance the movie has for awe, wonder, and suspense is blown since we already know what will happen at crucial moments.  The best example is when Roland blind-shoots Jake’s would-be captor: the scene is filmed to perfection, but we aren’t on the edge of our seats because it is effectively a re-run.  I don’t blame the filmmakers here, but I do blame the preview editors.As for the rest of the film, I’d call it “adequate.”  Jake’s earlier scenes are great, but wasted as the troubled-but-visionary character trope gives way to a straight-forward fantasy quest.  The vistas are magnificent, but give way to village scenes that look straight out of Costner’s Postman.  Walter is evil, but so completely and casually so that we can’t be frightened (and who doesn’t want to destroy a cinematic universe these days? The action is fantastic, but how many other times have we seen someone in a leather duster shoot up a room full of bad guys?  The film resolves, but there are a ton of contrived plot devices which cause the movie to skip anything interesting or character-defining (and let’s not forget that one of Steven King’s greatest skills is character development over long periods).As a final (and positive) note, the cast is fantastic.  Idris Elba is great as always, Matt McConaughey is silky-smooth, Katheryn Winnick (aka Lagertha of Vikings fame) is nearly perfect, and Lucas Hamilton does a great job of balancing Jake’s psychological “troubles” with a sense of awe and understanding of his destiny.  Jackie Earle Haley gives what he has to a throw-away role, as does Claudia Kim.  The only weak link is Fran Kranz, whose screen time leaves him without his usual ability to put an indelible stamp on a character.  He is woefully underused here, but that’s really the only issue I took with the cast. In the end, I think we deserved a multi-season epic covering the actual books, bringing to life a truly unique fantasy multiverse.  I think what we got was something more like a coda: like 1998’s X-Files or Twin Peak’s Fire Walk With Me.  Vaguely interesting, but not really satisfying."}, {"rating": "6", "text": "Saw it last night, it wasnt bad. It was mostly okay. Elba and McConaughey were damn good, McConaughey really brought a scary charm to the role. Other than that, it felt condensed and incompletE. It would've helped the script if the movie had only one writer instead two writing teams amounting to a total of five writers, That would have allowed the script to be more focused and have the really good stuff fleshed out. There was also just a lot of points were stuff was obviously cut out, leading to the movie not taking enough chances and quite a few holes. With King, playing it safe usually hurts an adaptation more than it helps."}, {"rating": "2", "text": "Absolute garbage. Let me set the stage: My wife is a huge fan of the books while I had read the first three and fell out of favor with the series. Going in, we had two completely different schools of thought on what to expect. We BOTH walked out disappointed and annoyed. My wife was annoyed that, even though she understood it was after book 7, they fundamentally changed the structure and the world so much that it, in her words, \"felt like a cheap young adult movie about Jake and not enough about the Roland or Randall Flagg\". For me, I walked out feeling more confused than when I went in because the movie runs at a break neck pace, barely takes time to explain anything, and blows from action scene to action scene. Jake, good. Flashbacks! Roland, good! Man in Black, bad! Cross dimensional conflict, oh no!Idris Elba is literally the only good thing about the movie, a fact on which both of us agreed. It's a shame his talent is wasted on such bad writing, a poorly designed plot, lousy cinematography, and poor CGI. McConaughey was AWFUL, almost a caricature of an actor playing a role. So, so bad. It became quite apparent that this movie was stuck in development hell - to use software terminology - for all 10 years of its supposed creation, especially with a running time as short as made-for-TV movies. If this is the best they can do, no one will mourn when the franchise is left to die. It's just a shame that Idris Elba is still chasing after his own summer blockbuster franchise. Here's hoping he at least gets a fair shake to play Bond after Daniel Craig.After walking out of the theater following this mess I felt less annoyed about spending money to see Valarian the weekend before."}], "recommendations": ["the_golden_compass", "inferno", "the_hunger_games", "the_maze_runner", "percy_jackson_sea_of_monsters", "artemis_fowl", "harry_potter_and_the_goblet_of_fire", "divergent", "the_hobbit_an_unexpected_journey", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "maze_runner_the_scorch_trials", "the_hobbit_the_desolation_of_smaug", "chaos_walking", "the_mortal_instruments_city_of_bones", "the_hunger_games_mockingjay_part_2", "city_of_ember", "death_note_relight_1_visions_of_a_god", "harry_potter_and_the_chamber_of_secrets", "the_giver", "ready_player_one", "watchmen", "eragon", "the_hunger_games_catching_fire", "doctor_sleep", "pet_sematary"]}