{
  "id": 3549,
  "title": "The Danish Girl",
  "starring": [
    "Eddie Redmayne",
    "Alicia Vikander"
  ],
  "runtime": 119,
  "genre": [
    "Drama"
  ],
  "description": "When Gerda Wegener asks her husband Einar to fill in as a portrait model, Einar discovers the person she's meant to be and begins living her life as Lili Elbe. Having realized her true self and with Gerda's love and support, Lili embarks on a groundbreaking journey as a transgender pioneer.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mXZZIacI5FC8thzSC0lgQBQ2uAX.jpg",
  "categories": {
    "plot": 6.781818181818182,
    "acting": 6.923076923076923,
    "ending": 6.0,
    "soundtrack": 7.0,
    "cinematography": 6.714285714285714,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 6.666666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "don't you wish you could paint like that..The Danish GirlThe inner sexuality's origin, creation and wielding of it is covered up in the first act with innocence and suave tone building up the essence of what dreadful events are about to come on the rest of the feature. The Danish Girl contains gripping screenplay, mild natured palpable environment supported by majestic performances and emotions pouring out on the screen. Tom Hooper's vision and the on paper script comes alive in each and every stills of the movie and he deserves all the credit for it. Eddie Redmayne is soothing on screen and offers the most innocent performance whilst performing the boldest scenes proving once again why he is one of the finest talents at the current time and with a perfect supporting cast like Alicia Vikander helping the audience sail smoothly to the shore. The Danish Girl represents sexual phases innocently with brittle forces emerging from each characters allowing the audience live among them resulting into one of the finest art that cinema ever introduced."
    },
    {
      "rating": "5",
      "text": "Tom Hooper seems to be the period piece go-to director for by-the-numbers Oscar films. After the immense success of the little indie that could The King’s Speech gaining massive momentum at TIFF in 2010, going on to win the coveted Best Picture Oscar; then the grand and highly ambitious Les Miserables, Hooper seemed to have crafted a career out of production rich designs, strong performances and historically relevant social issues in his films. With the addition of Eddie Redmayne, fresh off his Oscar winning role in last year’s The Theory of Everything, Hooper’s newest The Danish Girl was expected to come out a clear winner. Sadly, The Danish Girl is a confused, highly theatrical and poorly constructed transparent film with laughable dialogue between its two leads Redmayne and rising star Alicia Vikander.\r The Danish Girl seemed to be a foolproof, sure-fire bet for success; Redmayne was coming off his Oscar win as Stephen Hawkings; the first look photo of the film of Redmayne in drag gained immense buzz online; Hooper finally got a project off the ground after many years of being shelved by studios and various directors; its female lead Alicia Vikander had four major roles in 2015 with nothing but great buzz, and finally, the cast rounded out with the grandly talented Matthias Schoenaerts. Yet, Hooper’s The Danish Girl came across as a forced, highly contrived Oscar wannabe film with pretentious camera tricks, dizzying angles and weak vehicle for any kind of lead up to have Redmayne the first actor to win two back-to-back lead actor Oscars.\r Set in 1926, in what could be described as Hooper’s historically hipster-era in Copenhagen, the film follows Gerda Wegener (Vikander) and Einar Wegener (Redmayne), a very passionate, close-knit painting couple who cherish the high art culture of Copenhagen, including its posh parties, galas and presentations. Along for the ride, is their close friend and confident floozy Oola Paulson (Amber Heard), who motivates the couple to partake in the lavish cultural niche of the country, without much else.\r In a desperate attempt to finish up a recent portrait for her upcoming, impending gallery showcase, Gerda asks her loving and supportive husband Einar, to place the painted dress on, along with some nylons and heals. As Einar caresses and is seduced by the fabrics of the garment, he becomes transfixed, mind, body and soul, with the crazy idea of becoming a woman. As Oola enters the couples apartment, in preparation for another trendy evening gather, jokingly names Einar’s female counterpart Lili. Unbeknownst to them at the time, the origins of Lili would just be the start of Gerda’s and Einar’s life.\r Transgenderism is a huge and highly talked about social issue in many art forms today, especially within the visual medium. With shows like “Transparent”, “Orange is the New Black” and others making waves, it’s no surprise that Hollywood busted out an origin film of one of the first successful transgender stories and operations recorded. Sadly, The Danish Girl, while trying to be trendsetting and a wavelengths type film for the truly difficult realities for many, serves as a laughable and pretentious story of over-dramatic film aesthetics and acting.\r Scorn with painful editing, inauspicious mood-setting scoring and less than hubris camera angles and filing styles, it seems as though Hooper forgot to focus on his characters and their difficult and revolutionary small details. For example, when Gerda tries to persuade Einar to coming to a party with her, which he declines vivacious, she convinces him to come as Lili, for fun and merely as a joke. While Einar’s transformation and changing montage is brief, unlike those cliched high school prom films that has the big transformation of its lead female protagonist as she goes from ugly duckling to beautiful swan, Lili has no big reveal; merely a quick shot of her walking the streets, rushing to the party with Gerda. Hooper takes for granted so much of the importance of Einar to Lili, and focuses on a very muddled and hard to define relationship between a man and a woman; lovers to friends; wife to cousin?\r Danish pastries are famous for being laminated, multilayered and delicate. Unfortunately, the same cannot be said for The Danish Girl. Burnt to a crisp with overacting and some poor make-up and costume choices, the film does offer some saving graces thanks mostly to an astonishing performance by Alicia Vikander and Matthias Schoenaerts, and a very special and one of the rare believable scenes of Redmayne through a looking glass. Vikander, who counterbalances Redmayne’s manic behaviour and inability to vocalize how he feels he is meant to be a woman, Vikander’s gentle touch to Gerda’s character brings true emotions of how any partner and loved one would deal with a very radical decision today, and more so in 1926 Europe."
    },
    {
      "rating": "10",
      "text": "Eddie Redmayne is in another extraordinary film where he goes deeper than we ever seen him in, he shines along with his co-star Alicia Vikander (Ex Machina). This film has a strong message about loving yourself and how love isn't defined by sexual orientation, gender, it's about the soul and the film explains that all well. The film is set in Copenhagen in the mid 1920's, portrait painter Gerda Wegener (Alicia Vikander) asks her husband Einar Wegener (Eddie Redmayne) who is also a painter, but he's a landscape painter who poses in for Gerda's painting as a favor for Gerda while she's waiting for her model to arrive. He dons silk stockings and matching pumps, and he's embarrassed by it, then it slowly returns to a confusing confrontation with his feelings he repressed since childhood. Dressing for a masquerade ball, the delicate placing of his hands and crossing of his legs literally turns him on. Drawn to a double life as Einar and his shy but alluring \"cousin Lili\" he conceals dual personality that nearly drives him to suicide. Director Tom Hooper (The King's Speech) is a true visionary, he does a beautiful job with making Lucinda Coxin's screenplay into real life. Redmayne and Vikander are the best part of this film they make this movie better they helm the film and they play their characters really well. 5 out of 5 stars"
    },
    {
      "rating": "8",
      "text": "it's a beautifully shot film and tells a very emotional story that is backed up well by Eddie Redmayne and Alicia Vikanders's fantastic performances and Tom Hooper's seamless direction. the film has a slight pacing issue at the beginning and some scenes feel tacked on and unnecessary but fortunately it recovers in order to shed light on a serious issue that is still relevant today in a mature and sympathetic way which will touch many people"
    },
    {
      "rating": "7",
      "text": "The strength of this film are the performances, i could hardly look at Eddie Redmayne without stop thinking about Stephen Hawking for his brilliant performance in 'The theory of everything\"; but after his amazing transformation in this film, Hawking disappeared from my memory. See Redmayne as \"Lili\" is a thing from another world, is bright and striking. We cannot forget the incredible Alicia Vikander that was bright.\rAs I said, the strength of this film are the performances, as the story is somewhat loose, feels forced in some situations to create \"a profound drama and moving\" but does not end to convince.\rDoes Redmayne will win the Oscar? No. .. DiCaprio is much better in all aspects ...\r Review en Español:\rLo fuerte de esta película son las actuaciones, me costaba mirar a Eddie Redmayne sin dejar de pensar en Stephen Hawking por su brillante actuación en \"La teoría del todo\"; pero después de su increíble transformación en esta película, Hawking desapareció de mi memoria. Ver a Redmayne como \"Lili\" es cosa de otro mundo, es brillante e impactante. No podemos olvidar a la increíble Alicia Vikander que estuvo brillante.\rComo dije, lo fuerte de esta película son las actuaciones, pues la historia es algo floja, se siente forzada en algunas situaciones para crear \"un drama profundo y conmovedor\" pero no termina por convencer.\r ¿Redmayne volverá a ganar el Oscar?... No... DiCaprio es mucho mejor en todos los aspectos..."
    },
    {
      "rating": "9",
      "text": "This is an important movie to have been made right now.   You could not hear a pin drop in the audience while I watched it tonight in Los Angeles.  Most were \"moved\".   I found it interesting, raw, & beautiful.  Made me sad in the end, just sitting there reflecting on the lives of the people in the movie."
    },
    {
      "rating": "10",
      "text": "Beautifully acted by the 2 leads.  Very poignant movie; Eddie Redmayne and Alicia Vakander delivered a sad but inspiring story given the fact that this happened early last century.  I loved it"
    },
    {
      "rating": "6",
      "text": "While I give The Danish Girl credit for taking on new subject matter, 2 hours of political correctness felt strained. (BTW, I'm gay.) Also, while that subject matter requires courage we don't really learn anything new from this film. It's not really clear why it was made, other than to score those pc points, which it deserves, but it's disappointing there's not much else going on with it.  Shoenaearts, in a small role, is totally buttoned up and who wants to see that?!"
    },
    {
      "rating": "8",
      "text": "Another excellent performance by Redmayne; head and shoulders above the majority of current Hollywood fare, Danish Girl tells an uncomfortable story in a sensitive way. Don't know how it'll play in Boondocks New Mexico though..."
    },
    {
      "rating": "7",
      "text": "WHAT I LIKED: This film is about characters, and the message behind their stories. This focus on their confusion and situations really makes you think and empathise with them - helped by an incredible acting performance from Redmayne\rWHAT I DIDN'T LIKE: Somehow you leave the cinema not quite emotionally satisfied. Sure it makes you think, but the focus truly on 2 characters for 2 solid hours, where little really \"happens,\" means its slightly dragged out. Perhaps that's just me, but by the ending I wasn't particularly emotionally involved\rVERDICT: 'The Danish Girl' proves Redmayne isn't planning on stopping being amazing any time soon - it could just have been a more emotionally engaging story overall."
    },
    {
      "rating": "8",
      "text": "Telling the tale of the world's very first gender-confirmation surgery is certainly no easy task. THE DANISH GIRL, whose production began before Tom Hooper's Oscar-winning THE KING'S SPEECH, is handled delicately but with the bold prowess needed. Eddie Redmayne transforms himself once again - with newcomer Alicia Vikander proving she is the latest of the great actresses of our time."
    },
    {
      "rating": "10",
      "text": "\"The Danish Girl\" focuses on two main subjects: 1) the relationship and bond between husband and wife 2) transgender. Without being overtly political, the movie just gives audience a better understanding of what if feels like when somebody you truly loves is not able to be fully him/herself and ask the difficult question of what to do next. Gerda portrayed by Alicia Vikander (Ex Machina) has to come to term when Einar portrayed by Eddie Redmayne (Theory of Everything, Jupiter Ascending) realize that he is a woman, or as Lili. He undergoes multiple treatments to fix his chemical imbalance and impurity but it just convinces him more that it is not his body. What makes the film great and a standout of the year is the superb and amazing performance by Alicia and Eddie. You feel vulnerable and powerless."
    },
    {
      "rating": "8",
      "text": "It's much better than I thought it would be, actually.  Alicia Vikander is pretty amazing in her role, and Redmayne just nails the lead.  I was happily surprised to see Matthias Schoenaerts as the childhood friend who comes back into Lilly's life.  Sure, it's a little on the nose, but it's a very good movie."
    },
    {
      "rating": "2",
      "text": "The Danish Girl is not only classic Oscar bait, it is a wanna be Oscar bait film. Tom Hopper is officially one of the worst directors today. This stupid, boring, melodramatic trash is all about the actors trying to win an Oscar and a director who doesn't know what he's doing. Eddie Redmayne is hideous in this film as well."
    },
    {
      "rating": "5",
      "text": "Nice try Eddie Redmayne and Tom Hooper. I know for a fact that the two of you wanted a second Oscar so badly, so you made this movie, but this isn't fooling anyone.\r The Danish Girl is about a Danish artist, depicted her husband, Einer, as a female in one of her paintings. As the painting gains attention, Einer begins to transform as well - becoming more and more feminine until Einer becomes Lili Elbe - and becomes the first person to receive a male-to-female sex reassignment surgery. While Gerda is supportive, she comes to realize this change will prove a challenging ordeal to their relationship - even more so when Hans Axgil, an art dealer and old friend of Einer, comes into her life.\r Oscar bait movies like this really makes my skin crawl, because this movie literally ticks off ways of getting that Oscar and it's quite shocking how noticeable it is here. I really liked The King's Speech, I mean it's not for everyone but I thought it was a great movie and I couldn't wait to watch Tom Hooper's next film. Oh Hooper, what happened? I didn't care for Les Misérables and I sure didn't care for this movie. The Danish Girl sadly fails to deliver and everything feels so force. The emotions, the art and the story itself falls completely flat.\r What the hell happened to Tom Hooper? after he won that Oscar he really lost his touch. There's hidden greatness in this movie and Hooper could have easily taken a different path to make this movie great, but he doesn't do that here, but he intend plays it safe and makes everything feel so force with emotions that there's no emotional attachment. There were some well directed scenes in the movie and it is well shot, but I felt like the movie was missing something and that's me actually caring about whats going on. The movie itself wants me to care about whats going on with the characters, but the only one I really cared about or felt bad about is Alicia Vikander character. I miss the old Tom Hooper.\r Now I've got nothing against Eddie Redmayne as I think he's a talented guy, but he seriously needs to pick better roles in the future. He was absolutely awful in Jupiter Ascending and he sure wasn't good here. He's performance in this movie is what I call \"pretentious\" and \"by the books Oscar bait\". The emotions were there but I just didn't feel it and how the execution could have been better. A role like this is not a easy challenge and this must have been tough for Eddie, I mean in recent interviews, he has said that the role has personally changed his way of seeing things with genders and transgender people. He took a risk but it sadly didn't come together as promised. I swear, if Eddie Redmayne gets a second Oscar for this movie, I will be pissed.\r Alicia Vikander was hands down the stand out of this movie. As I said before, I cared for her more than Redmayne character and that's saying a lot. Shes been not-stop impressing me this year and I can't wait to see more of her in future movies. She was brilliant in this movie as I really felt her struggle and her dealing to whats going on in her life is truly heartbreaking. She was without a doubt the best part of this movie and she did an magnificent performance.\r The cinematography was good, the style of the movie was neat, the score was pretty solid and that's really it.\r Overall The Danish Girl isn't a bad movie, but it's not a great one either. This movies purpose of existing is just to win awards and nothing else."
    },
    {
      "rating": "2",
      "text": "'The Danish Girl' is boring, self-indulgent Oscar bait. Alicia Vikander is the only bright spot in this if you ask me. If it wins any Oscars, it'll be because of the subject matter it tackles."
    },
    {
      "rating": "8",
      "text": "Eddie Redmayne & Alicia Vikander play husband/wife painters in Denmark during the early part of the 20th century. He became known as Lily Elbe, one of the first known transgenders to also undergo sexual reassignment surgery. Redmayne is perfect for the role, not only because he makes such a beautiful woman (more so than the real thing: see below), but because he’s such a gifted and brilliantly expressive actor. His delicate nuanced portrayal is exceptionally touching. But this story is about both of them and Vikander also turns in a moving performance. The locations are lovely and the dresses gorgeous, but every plot development takes too long to unfold. Even with the languid pace, this film is a quietly sweet and beautifully tender examination of love and self expression."
    },
    {
      "rating": "5",
      "text": "With 8 new movies opening this week and we wanting to see 6 of them, due to showing schedule and our afternoon plans we decided to see the 11 AM screening of \"The Danish Girl\".\r Very little is known by the public about what a transgender person lives with and goes through. Recently, because of Caitlayn Jenner and recent shows based around transgender people, the public is becoming more aware of the subject. In 1999 Hilary Swank won a Best Actress award for her role in \"Boy Don't Cry\" as a girl who transgendered to a man and  in 2005 Felicity Huffman was nominated for a Best Actress Oscar in \"TransAmerica\" as a man transgendering to a woman.\r Einar Wegener, played by Eddie Redmayne, was one of the first men to transition to a woman, in this case, Lili Elbe, in this based on a true story written about in \"Man Into Woman\" in 1933. Einar is helped, understood and cared for by his wife Gerder, played by Alicia Vikander. In more ways than one she aids Einer become Lili not really understanding what he is going through just as he really doesn't and the doctors he goes to don't.\r Both were well known Danish painters with Einar famous for landscapes while Gerder would become more famous for her paintings of 'Lili'. As a young couple they were very much in love with an active sex life but the more Einar became Lili their relationship in all ways changed.\r Having been married for over 20 years the relationships between Einar, Lili with Gerder and hers with both is sort of given short shift in understanding what happens in cases like this.\r As Redmayne proved last year in his role as Stephen Hawking and as Marius in \"Les Miserables\", winning an Oscar for the former, he can completely immerse himself in a role but here he seems to be all poses and uses scarves as a co-star.\r Alicia Vikander appeared in 6 films this year particularly recieving a lot of attention as artificial intelligence Ava in \"Ex Machina\". Her role here seems underwritten and she is sort of given short shift regarding the feelings she is suppose to be undergoing.\r Amber Heard as a friend of Einer and Gerder and who gives Lili her name, Sebastion Koch as the pioneering doctor, Ben Henrik as Lili's first suitor and Matthias Schoenaerts as a boyhood friend and the first crush of Einar are all good supporting performers though the latter is put in the position of a possible lover for Gerder which doesn't ring true.\r \"The Danish Girl\" is an interesting film but doesn't deliver. There is also the problem of some important--at least they may be important--lines are very soft spoken to the point many people in the audience ask, \"What did they say?\", and it isn't the fault of the theatre's sound."
    },
    {
      "rating": "9",
      "text": "Tom Hooper and Eddie Redmayne (and now Alicia Vikander, too) seem to keep finding ways to knock it out of the park, as they do so well in this sensitive, moving drama about hope, courage and the desire to be oneself. This lavishly produced period piece features superb performances by its two protagonists, backed by excellent production values, gorgeous cinematography and a sweeping soundtrack. The pacing is a bit sluggish in a few spots, but everything else is top shelf across the board. Clearly one of the year's best, but who wouldn't expect that from the creator of films like \"The King's Speech\" and \"Les Miserables,\" not to mention the winner of last year's best actor Oscar?"
    },
    {
      "rating": "6",
      "text": "Academy award-winning director Tom Hooper (The King’s Speech) reunites with his ‘Les Misérables’ alumnus and most recent Oscar-winning actor Eddie Redmayne, to bring us a heavily dramatized version of a real early 20th century story which couldn’t be more timely.\r Redmayne stars as turn-of-the-century Danish painter Einar Wegener whose long transition into Lily Elbe eventually culminated in one of the earliest examples of gender reassignment surgery, the core of the story is the unique love story between Wegener and his wife and fellow artist Gerda Gottlieb, played by Alicia Vikander, who remained remarkably loyal despite inevitably losing the man she married.\r ‘The Danish Girl’ benefits from an interesting and incredibly timely central theme which has become a major social talking point in 2015. Director Tom Hooper manages to effectively apply what is fast becoming his formula of stylish and emotional period-drama treatment which takes advantage of solid performances, impeccable production design and an evocative Alexandre Desplat musical score.\r While ‘The Danish Girl’ is certainly not the first film to deal with issues of transgenderism, it’s quite original in framing it as an issue of personality and gender identity rather than sexuality.\r While transgender people will view themselves as having been born in the wrong body, society may view it as a mental disorder (gender dysphoria), the point of a film like this is to build a bridge of acceptance between the way people view an issue that’s now part of the media landscape… and battle against judgment from both sides by having unsuppressed open discussion.\r ‘The Danish Girl’ is essentially a human story set in a time long ago, yet not that different from today, but it’s told with a narrative naivety which takes plenty of dramatic license and employs a bit too much artistic flair.\r Unsurprisingly when condensing a lifetime into two hours, the story deviates heavily from reality, but ‘The Danish Girl’ is ultimately let down by slick Hollywood sentimentality, despite being a European production, and the sanitizing of a far more painful and tragic story.\r The timing of the film may have been a fortunate coincidence, but the careful sculpting of a narrative that provides just a bit of shock but not enough to alienate the masses, and which pleases awards voters, is not.\r The Bottom Line…\rWhile benefiting from typically evocative sights and sounds which illuminate a historical and yet fascinatingly timely central theme, ‘The Danish Girl’ takes too much dramatic license while sanitizing a true story for public consumption, and only scratches the surface of a complex social issue."
    },
    {
      "rating": "10",
      "text": "An amazing performance by Eddie Redmayne.  It's the  tragic, beautiful, sad and moving love story that left me affected for hours.  Deserving of an Oscar."
    },
    {
      "rating": "5",
      "text": "I don't mind admitting that I found the movie extremely uncomfortable (as a heterosexual male with my girlfriend). Didn't really enjoy it, nor do I feel that I have been enlightened by it (having read about this sort of thing, before)."
    },
    {
      "rating": "3",
      "text": "While I loved The King's Speech, Tom Hooper's The Danish Girl is a dull, predictable, oscar-bait film, obviously jumping on the transgender hype train. Eddie Redmayne just doesn't work for me as an actor, especially playing a transgender woman. It's dull, lacking, and does not do the story justice."
    },
    {
      "rating": "0",
      "text": "It's highly predictable and it's difficult to relate to any of the characters. You know exactly what is going to happen from the beginning but there is such a huge jump from place to place it's difficult to ascertain what purpose arises or reasoning. We're supposed to believe many many mixed things at the same time which don't work together and at times clash.\r It's such a complete muddle to accept and difficult to know what each character wants.\r It's best to be avoided because it is trying to be something merely on the basis of force and that never works."
    },
    {
      "rating": "1",
      "text": "What you see is what you get as \" pretty\" Danish Girl tackles the over exposed provocative subject of 2015 - transsexualism.  After Tangerine, I am Cait and Transparent we are left with Tootsie meets Psycho without the camp. Hooper treats the matter as an affliction like stuttering without adding any new insight. Redmayne pouts and poses- Vilkander pushes and pulls- and Pettigrew peters out of a menage a trios that would have given this film some much needed sizzle."
    },
    {
      "rating": "7",
      "text": "As Oscar-baity as it may be, its impossible to deny the superb talents within this challenging biopic from Tom Hooper. Eddie Redmayne and Alicia Vikander's performances lift this somewhat ploddingly paced thinker to substantive levels of emotional depth. High marks also go to Hooper's trademark use of stylish imagery and framing throughout."
    },
    {
      "rating": "9",
      "text": "Tom Hooper’s highly anticipated ‘The Danish Girl’ was eventually greeted rather indifferently by the sniffy critics who ultimately only seemed to appreciate the lead performances. Hooper seems to have come in for a lot of critical wrath since winning an Oscar for his least enjoyable film, ‘The King’s Speech’, and both his subsequent movies ‘Les Miserables’, and now this seem to have as many detractors as fans. The former group leaves me head scratchingly perplexed at this negativity as both films are beautifully conceived and marvellously acted examples of what cinema is all about. ‘The Danish Girl’ is a fascinating and, despite its two hour length, a concisely told and emotionally complex true story about transgender pioneer Lili Erbe. The film is a gorgeous prestige production from the beautiful locations in Paris and Copenhagen, through its breath taking production and costume designs, right down to the top notch performances of the two leads. Fresh from his Oscar winning success last year in ‘The Theory of Everything’, Eddie Redmayne is again very good. However, it has to be said that he does somewhat over do the coyness of the emerging Lili and, even at this early stage in his career, certain mannerisms and gestures are becoming quite identifiable within his repertoire. It is also unfortunate for him that in both his Oscar winning role and now here he has been somewhat overshadowed by his leading ladies. Felicity Jones stole the show in ‘Theory’ and a revelatory Alicia Vikander almost single handedly rains on his parade here. She runs a gauntlet of emotions and is heartbreakingly compelling. She becomes the film’s focal point and its soul without unbalancing the drama. Hooper’s direction is assured and there is a brevity in the editing to keep the pace interesting without seeming to trivialise or rush the complex and important story being told. If all this isn’t enough to make you squeeze out the odd tear then Alexander Desplat’s beautiful score will complete the task."
    },
    {
      "rating": "7",
      "text": "Yes I do have to admit that this film was and felt very Oscar-baity, but at the same time it's hard to deny the talent that's put together onscreen. Hot off his best actor Oscar victory, Eddie Redmayne does what anyone who just barely won an Oscar would do, which is to find yet another Oscar-baity role. Despite this however, I must admit that his performance in this is much more emotionally driven and moving than his performance in The Theory of Everything was. In fact, if I had any say, I'd have had Michael Keaton (who deserved the Oscar for Birdman MUCH more than Redmayne did last year) win for last year instead of Redmayne and then have Redmayne win for this film instead. Alicia Vikander gives an equally worthy and heartbreaking performance. Overall, the film is made up to look pretty and appealing (mainly to attract Oscars of course), but honestly I found it not quite up to the same level that director Tom Hooper's previous films have been. I also found it to be a bit more melodramatic and dragged out than I would've liked. However, like I said before, Redmayne and Vikander's talents are enough to the make the film at least somewhat worthwhile."
    },
    {
      "rating": "6",
      "text": "The Danish Girl is certainly an interesting film, but I would not call it a perfect one. The story is very intriguing but the whole film is carried by the performances from the leading duo of Eddie Redmayne and Alicia Vikander and both of these stars deserve the Oscar nominations that they have received for this year. I can't say that I am a true fan of Tom Hooper's films. I didn't enjoy The Theory of Everything as much as some other people did although I did think it was a good film. I find that this film has a bit of a similar formula to The Theory of Everything (which of course also had Redmayne in a starring role) and there are points where this is completely obvious. The actors do a good job at playing their roles but there still feels like there is just something missing. The film just feels a little less significant than it should. Despite its performances The Danish Girl will just have to settle for being a \"good\" movie not a great one."
    },
    {
      "rating": "1",
      "text": "OK, WTF?? One of the worst movies of 2015! Chessy dialogue, undeveloped characters, awful direction and especially a painful and forced performance by Eddie Redmayne who proves that his Oscar last year was a total robbery! Not even Vikander's tour de force could save this one from the ashes. Skip this one or simply wait until it comes on normal TV. It's soooooooooooooooooooo bad!"
    },
    {
      "rating": "8",
      "text": "The main subject won't be for everyone as it is still a delicate sensitive subject.\rBut what it does do it does superb without a doubt.\rSome of the best acting and cinematography of the year.\rWith beautiful shot scenes and sublime performance from main actors.\rIf you have a open mind you will enjoy this movie."
    },
    {
      "rating": "10",
      "text": "The Danish Girl portrays beautifully the struggles of the very first trans-gender person. It's an absolute masterpiece. Eddie Redmayne managed to touch my soul and come to understand fully any trans-gender out there. Although i'm not keen on the way Alicia handled Gerda i'm still blown away by her performance. From costumes to scenery everything is marvellous an the aesthetics are on point. Amazing movie."
    },
    {
      "rating": "8",
      "text": "The Danish Girl provides an intense exploration of transgender. REdyeme perfectly captures the struggle of someone torn between two identities at a time when transgender was a not a norm and there was no clear path. While the prevelance of such behavior makes this struggle nto as severe it is still a major and relevant part of our society. The content of this film and Redyeme’s performance make shtis a film worth seeing."
    },
    {
      "rating": "7",
      "text": "the average critics score of 66 is the perfect rating of this movie. I enjoyed watching it, kept me interested. Makes you understand, what it means to be born in a male body while having a female mind. I recommend watching it."
    },
    {
      "rating": "7",
      "text": "The Danish Girl touches a topic that has been arising for decades, but only for the past few years has reached public’s acceptance. Maybe it was the perfect time for release a movie telling the story about transgender, getting people inside the mind of one, experiencing the very little things of life as the protagonist does and becoming part of the changing process. The problems of the film start when the audience only notices small conflicts in the protagonist, even though his mind was already set; he made a decision that cannot be taken overnight, and that struggling is missing, diminishing the credibility of the plot. Here is where Einar’s wife becomes so important, because she represents the “common thought” and in her the struggle is strong enough to split up her life, making she debates between what she wants and what is best for her loved one; this brings back reality to our scenario. The performance of Vikander is awesome transmitting the thing said before, but Redmayne is again superb and really committed to his part. Honorable mention to cinematography and Alexandre Desplat’s soundtrack."
    },
    {
      "rating": "4",
      "text": "Fantastic performances for sure but I am very disappoitned with how many liberties they took when telling this story. Why twist the truth when the real events are so compelling and interesting?Lily didn't just up and die after her first surgery. She actually had 3 and died on the fourth due to an infection, which caused cardiac arrest. She had already long divorced her wife and was already intent on getting married to a man and was using this fourth surgery, a uterus trasplant, in an attempt to have children with him. See that proven history was a heck of a lot better than the ending the film had, Which made everything seem like it was all rainbows and sunshine when it wasn't."
    },
    {
      "rating": "7",
      "text": "An important biopic, but not inspiring.\r Before this film hitting the screens, I remember many experts were expecting it doing well at the Oscars. Now it's got 4 Oscar nods, even though it is very sad the movie is a hit and miss. A slipped away opportunity, had a great storyline, but the outcome was decent. An important historical biopic, at least for a certain section of the audience. I respect that, but it did not impress me as I anticipated.\r From the Academy Award winning director for the movie 'The King's Speech', and the last year's winner for a lead role, Eddie Reddmayne together did not deliver the expected masterpiece. But Alicia Vikander was so good, another brilliant co-female-star display just like Felicity Jones from Eddie's previous movie 'The Theory of Everything'. If I were a jury I would definitely give the supporting actress award to her, that's the result I'm hoping for in the next Sunday.\r The actor did a hard work for the title role, in the many scenes he mastered it, but that's where I slightly disappointed. I felt his character was a little intense, maybe I'm not getting him because I'm straight. The locations, costumes, even the direction and music were good. Both the lead actors kind looks alike, no doubt on the casting, but it only should have been a bit better in exhibiting story.\r Maybe the pace should have been a little quicker as well as some sentimentally appealing scenes would have done good. I desperate to give more marks, but I can't go beyond this. I won't consider it a bad flick, what I meant was a missed opportunity to be a masterpiece. So overall,  it is a good watch.\r 7/10"
    },
    {
      "rating": "10",
      "text": "This film collapses circles and shows that life is not always as simple as we think it might be. An all in performance coupled with a powerful script. This is a must watch for any generation. Touching gripping and unapologetically well acted. An unforgettable performance by Eddie Redmayne."
    },
    {
      "rating": "8",
      "text": "A great and thought-provoking drama with a constant trait of all-knowing human sides like love & obsession. It’s a stunning and stylish story that never ends to impress, with its progressive way of presenting this clear and well done character arc; an arc that makes you feel Lili Elbe’s inner fight against the strong want-to; to be able to love, and to be who we are, and not to hide. It might be a bit controversial, but “The Danish Girl” does stand out with its great and bad aspects. Two are exemplary lightning and very character fitting music; meanwhile mixed editing-quality, misplaced cinematography & some fragments of overacting might be some of the greatest disadvantages of having a such ambitious drama. But the higher purpose of this film overwhelms the downsides by tenfold. It’s the drama we need more of, even though many out there probably will misjudge the whole gender-part.\r Personal rating: 80/100\r\u2028Critical rating: 88/100"
    },
    {
      "rating": "4",
      "text": "Oscar-winning Director Tom Hooper (‘The Kings Speech’) and Oscar-winning Actor Eddie Redmayne (‘The Theory of Everything’) bring us the life of a male Dutch artist who, with the support from his wife, becomes a woman, in the new film ‘The Danish Girl.’\r Based on the book of the same name by David Ebershoff, ‘The Danish Girl’ tells the real life story of Einar Wegener (Redmayne) who never felt right as a man so he decides to transition into a woman, being one of the first known recipients ever of sex reassignment surgery. It was with the support of his wife and fellow painter Gerde Wegener (Alicia Vikander) that gave him the courage and hope that helped him through the transition to live the rest of his life as Lili Elbe. But the film portrays Einar’s transition and Gerde’s acceptance as a dull one, there are no real revelations, nothing exciting about the story, and even Redmayne’s performance is a bit under the radar. It’s Vikander who steals the movie right from under Redmayne’s corset.\r The movie tells us that Einar’s interest in all things Transgender suddenly happened when Gerde asked him to fill in for a female model who didn’t show up for one of her painting sessions. So she asks him to put on a dress so that she can finish the painting. He likes the way it feels, but more importantly he likes the way he looks in it, and this suddenly (a bit too suddenly) awakens Einar’s inner woman. This takes place in 1926 while the couple was living in the liberal land of Copenhagen, though such things were not done, nor not even discussed back then. But with Gerde’s full support, and help, Einar starts dressing up as a woman outside of their house. Things get a bit more complicated when another man, Henrick (Ben Whishaw) takes an interest in Einar, who by this time has started calling himself Lili.\r Gerde is asked to go to Paris so that she can work for a local art dealer, and while her career flourishes, their marriage slowly dissolves. And a childhood friend of Einar’s/Lili’s, Hans (Matthias Schoenaerts) shows up and forms a complex triangle with the couple. And it’s not long before Einar goes ahead with the surgery that will take away his manhood.\r ‘The Danish Girl’ is dull. It’s not a sweeping European love story where love conquers all in the midst of one man’s gender confusion and one woman’s loyalty to such man. Hooper’s direction can’t bring Lucinda Coxon’s boring script to life. Not even the actors can accomplish this. Redmayne is good as Einar/Lili, yet there were times when I thought I was still watching him play Stephen Hawking. It’s his eyes, he blinks them quite a lot in this film, just like the way he did in ‘The Theory of Everything.’  However, ‘The Danish Girl’ is pretty much Vikander’s movie. She’s beautiful and emotional and accepting when the times call for it – it’s just as good a performance as Felicity Jones was as in ‘The Theory of Everything.’ Vikander’s star is on a meteoric rise, having appeared in three films this past year (‘Ex Machina,’ ‘The Man from U.N.C.L.E.’ and ‘Burnt’). She’s currently filming the fifth Bourne Identity film with Matt Damon and Tommy Lee Jones and has two other features coming out in 2016. I was very disappointed that ‘The Danish Girl’ was not as good as I had hoped, perhaps it might be better to read the actual book, and skip the movie."
    },
    {
      "rating": "7",
      "text": "\"The Danish Girl\" was a dramatic story, where a man like Einar Wegner becomes a woman , knowing that there is a woman in a man. Eddie Redmayne 's performance and Alicia Vikander are very outstanding , the story was touching."
    },
    {
      "rating": "10",
      "text": "I'll give thousands points to this film. It was outstanding, gripping, exciting, heartbreaking, full with emotion and drama and my attention has never stopped for a moment. Alicia worthily got her Oscar for her playing, she was amazing."
    },
    {
      "rating": "7",
      "text": "A good movie about transsexuals in the 1930's, when there was no medical knowledge on the topic.  Even better is the acting.  Eddie Redmayne is amazing, starting as a loving husband trying to have a child with his wife, then slowly changing in attitude and physical portrayal to a woman."
    },
    {
      "rating": "5",
      "text": "Alicia Vikander's understated, empathetic tour de force is coupled with Eddie Redmayne's uneven, gangling portrait of a transwoman in a sadly unconvincing performance. He is among the most ambitious and talented actors of his generation, but unlike his unnervingly precise embodiment of Stephen Hawking in \"The Theory of Everything\", his turn as Einar Wegener/Lili Ebe feels largely forced, sans some scenes of painstaking honesty between him and Vikander. The same can be said of the film as a whole. Its technical finery and the relevance of its subject matter notwithstanding, \"The Danish Girl\" dotes on itself too often and is too maudlin to be fully convincing."
    },
    {
      "rating": "7",
      "text": "Ok, you people are seriously running out of ideas... I mean really... \"Oscar bait\"... I love to see it on only one review, but on more than one review is just seriously a lack of originality. Don't get so repetitive, people. Grant some new ideas. That's why you have a brain. Think what you're about to type before actually typing it, but don't think too hard. The Danish Girl is sent from America to Danish to show Danish a good film when they see one."
    },
    {
      "rating": "9",
      "text": "Gostei da mensagem passada, mas o filme peca em ser muito previsível, é emocionante e bonito, em todo momento torcemos para que Lili consiga concluir seu objetivo e quando a mesma consegue isso acaba matando-a, claro que trata-se de uma adaptação mas o roteiro poderia surpreender de alguma forma."
    },
    {
      "rating": "10",
      "text": "I think this is an important film, which have to say something definite. First, this is not a film about sexuality, neither of transgender nor of homosexual at all. Secondly, this is not a film about transformation and therefore not a self-made.\r The film is about the limit of liberalism that is reflected (at least put a question) at context of liberalism. We see a classic drama contradiction between collective (family and those relationships that are formed between people) and individual. These are dialectical forces.\r The film beautifully illustrates how individualism (a legitimate desire to be yourself) destroys yourself through rejection of collective significance. Einar Wegener so rush to their own identity that destroyed a family. Despite the actual death, he dies symbolic because beyond happy family relationships did not exist, as there is no man outside society. It's like leave the village at night winter forest and die there.\r Limit of liberalism - a meaningful limit of individuality. We perhaps the word limit is used here not quite correct. Perhaps quite the contrary liberalism have an aim to break the limitations of individualism, and the film shows how the individual psycho-physical determinism destroys him, because freedom that leads nowhere, not freedom."
    },
    {
      "rating": "5",
      "text": "The actors were fabulous, however the story line is imbalanced in that there are two story to tell here. That of Lili's journey and transformation and his wife's support and acceptance, but the movie barely broached the pain and suffering of her life and the sacrifices she made. Then again, maybe that should be another movie altogether.\r Writers and Hollywood need to know that there are audiences for BOTH stories to be told!"
    },
    {
      "rating": "10",
      "text": "\"The Danish Girl\" is an outstanding work of drama, showing the struggles of a man finding himself to be a woman at heart and the change that he experiences, as a pioneer in the Transgender community, the director has created a raw yet beautiful film that never fails to make an audience smile and cry, the performance by Eddie is absolutely outstanding, interestingly, his character is a more beautiful woman than many that I know. This film is very important for the progressive society, showing the human aspects of such a difficult transformation."
    },
    {
      "rating": "9",
      "text": "Danish Girl is a film about love and gender. It is beautifully combined genre. This true story awakens the society of the existence, the reborn of the third sex. Neither family nor science nor gods can cure it. It is sad that back then that it is considered as a disease that is physically and morally wrong. The perfectionist society in those generations hardly tried to accept it, to accept them for what they are and who they are. However, the hatred still continue until now and maybe in next generations. This explains that no one understands them. It is not sickness. It is not a curse. They are not different. Because like everyone, they are human."
    }
  ]
}