{"id": 2302, "title": "The Great Gatsby", "starring": ["Leonardo DiCaprio", "Tobey Maguire"], "runtime": 143, "genre": ["Drama", "Romance"], "description": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nimh1rrDDLhgpG8XAYoUZXHYwb6.jpg", "categories": {"plot": 6.846153846153846, "acting": 7.1875, "ending": 5.8, "soundtrack": 5.590909090909091, "cinematography": 4.75, "familyFriendly": 4.666666666666667, "funny": 8.5, "action": 6.25}, "reviews": [{"rating": "10", "text": "Saw this when it opened. Had low expectations because of movie critics who obviously grew up in the wrong era. The quality of the book is revived perfectly; It's a period peace, but transcends period with its subtle hints of modern music and style. Every actor was perfectly cast. It's heavy use of Art Deco (my favorite architectural style) fills the screen with beauty that reaches for the heavens, however unattainable they were and still are.\rGatsby looks to the past not with nostalgia, but with regret of what was and what will never be.\r p.s.  I am usually very anti-3d but this movies 3d really pulls you into the grandness of it all."}, {"rating": "6", "text": "This is a film that takes a while to get into the story although the visuals are constant like all of Baz Lurhmann's work.  I do wish there was more character development and the film was a little shorter, but overall a solid effort. B"}, {"rating": "1", "text": "This film adaption of F. Scott Fitzgerald's novel, The Great Gatsby, is about a man in the 1920s trying to win back the woman he loves.  This version is a cartoon with real life actors - everything super brightly colored and sporting more special effects than a Star Wars movie, much of it very fake looking. Gatsby's home when shot from the exterior is so obviously computer generated it's shocking. There's plenty of blue screen (or green screen these days) that is about as obvious as can be, with the lighting on the actor standing in front of the green screen not matching the lighting in the scene projected behind him on the green screen. It might as well be a Godzilla movie from the 60s at those moments. You might wonder why they felt the need for so many effects. The camera whizzes around Long Island over and under elevated tracks in Manhattan, almost all of which (both Manhattan and Long Island) appear computer generated, so much like a computer game I felt like readying my controller to start controlling the main character. It's a miracle that amidst all this crazy visual jazz, that the story's basic outline (because that is all there is here; just a skeleton of the plot) doesn't get lost. That was a feat and for that I give it 1 star out of 10.\r The movie does calm down in that last half hour and become closer to something normal visually, but by then I was tired of watching. Add to this the bizarre use of hip hop and other music not of the period (Jay-Z and Beyonce; that's Jay Z's ego ruining the movie, as he's a producer of this catastrophe) and you get the impression that this was made by an extremely insecure story teller who had no faith in his audience or in his abilities to capture their attention simply by telling story. Maybe he didn't have faith in his actors. Whatever the cause, the director or whoever called the shots, decided that rendering the story well wasn't enough without overstuffing the production with candy colored effects and noise ad nauseam. The result is that, instead of being drawn into the story, you are constantly pushed out by the weird over-the-top distractions. It's like watching a Shakespeare play while someone constantly lights of fireworks in front of the production. What an ordeal! You think it's innocent enough - just spending a couple hours watching a movie - but by the time it's over you feel like you've been in some kind of two hour accident or a small war. You feel damaged. I recommend instead the novel, which is quite beautifully written."}, {"rating": "0", "text": "I'd like to begin by calling The Great Gatsby one of the greatest novels I have ever read. It is beautifully written, very powerful and deep, and just all round ground.\r This is the polar opposite; it is an insult to Fitzgerald, and an insult to cinema. It is awfully directed, contains lousy CGI, has rap and hip hop music as opposed to jazz and just completely misses the mark of the novel. It is a laughable love story as opposed to a tragedy rooted in the idealism and the lack of values of the roaring twenties. Fitzgerald created a deeply personal novel that explored the era, and Luhrman has defecated all over it."}, {"rating": "10", "text": "Really wonderful film with great Leonardo Dicaprio. It is good that today in the world which had lost all morale principles we can see such a film...Moreover there's also a great soundtrack!"}, {"rating": "5", "text": "I've never been a fan of Baz Luhrmann's filmography, and his new Gatsby project is no exception. This is an amazing book, but his adaptation to the screen employs rap music and modern references here and there that do not fit the story at all. Now, I'm not a cinema purist when it comes to adding modern hints in period pieces, but the way Luhrmann does it is too obvious to benefit from subtlety. Also, Carey Mulligan and Isla Fisher should've switched their respective roles as Daisy and Myrtle: the casting choices there were not great. Each woman would've played the other character better, and the movie would've benefitted greatly. As for DiCaprio and Maguire, they played their characters on par with Fitzgerald's writing, and added some character nuances that only great actors can pull off, so bravo to them. If you're a fan of the story, it might be worthwhile to check out the movie, but don't set high expectations."}, {"rating": "9", "text": "\"Will you still love me, when I'm no longer young...\" are the words to the chorus of The Great Gatsby's theme song. That fact of the matter is that I will absolutely still love this film when its no longer young. Sure, some may criticize its lack of subtlety and tender pace that were characteristic of The Great Gatsby novel, but few can deny this film's masterful portrayal of key characters and the orgastic yet sickly vibe of the so-called \"Roaring Twenties.\" Heart-shattering the plot, amazing the visuals, and skilled are the cast in this ambitious interpretation of Fitzgerald's book. Make sure to read the book before seeing The Great Gatsby, as it does speed by some important ideas at the pace of a motion picture."}, {"rating": "3", "text": "Unfortunately, reducing one of the great novels to a shiny self-indulgent music video is the least of its problems. The narration was so annoying and never ending and the performances were bizarre. I could care less about the characters because not one of the them actually felt real. It was a very boring movie. There was obviously a great deal of effort put into this movie, but  Luhrmann is more interested in what you see and hear rather than what you are supposed to think and feel."}, {"rating": "5", "text": "The movie was long, tedious and Jay-Z's music in 1912.  The actors have done their respective roles well but the story was weak. I don't understand \"what is this love about?\""}, {"rating": "10", "text": "Baz Luhrmann really has outdone himself in this film. The cast is beautiful as is the script. The scenes are a visual feast. It is as if Luhrmann reached into Fitzgerald's vision of the 20's, pulled out the heart of it and merged it with what society is today, over nine decades later. Alongside personal strife, we see social inequality, abuse of drugs and alcohol, political and moral corruption, and the failure of financial institutions and their responsibility to people. This film will make you feel that these issues will always be relevant, and that not much changes from generation to generation.\r The achingly romantic and hopeful Gatsby is played impeccably by DiCaprio. He has aged into a beautiful man while still possessing those boyish good looks. The beginning of the film has the viewer itching to see Gatsby and hear him speak, and when he finally appears he holds on and captivates throughout the film. The film may awaken something in you, a memory of when you were crazy in love with a person or in love with an idea for what your life should be. DiCaprio embodies a dream and makes you root for him, even though he is shown to be a liar and a man who is desperately trying to steal another's wife- all that does not matter because we see the gentle child-like frailty in him and identify with it. DiCaprio is an excellent actor and was perfect for the role.\r I must say that I didn't think that Mulligan can pull the role of Daisy, who in my mind was supposed to be a flawless beauty. However, she didn't disappoint. It made Gatsby's love and desire for her even more fascinating- she was beautiful to him and that's all that mattered. Mulligan was able to play the spoiled and dazed rich girl well, while adding an emotional dimension to the character. Tobey Mcguire definitely held his own, and his story line had an interesting deviation from the novel which was enjoyable. All in all I think it is a must see this year for movie buffs."}, {"rating": "9", "text": "Baz Luhrmann’s “The Great Gatsby,” is fairly accurate to the classic novel and keeps most of its themes intact. However, Luhrmann’s own flair adds a new dimension to the story. Visually this film is incredibly stunning. From grand sets to the detailed period dresses, this film is a treat for the eyes. Never once does it not take your breath away from its impressive scenery. Many people might be worried about the updated music, but there is nothing to fear. Jay-Z’s track works incredible well with the film and complements the era in which it is set.\r The direction in this film is impeccable. The cinematography is marvelous and really lets the viewer absorb the sheer artistry that has gone into making this film. Luhrmann keeps a high level of energy throughout the film and the party sequences are choreographed and edited in a way that it makes you feel envious of not being apart of it. Editing in the film is seamless and really keeps the viewer engaged. A common criticism the film receives is that it is more style than substance, however, I must disagree. This modern interpretation doesn’t forget its themes and morals from the classic F. Scott Fitzgerald tale.\r Performances are phenomenal by the entire cast. Carey Mulligan’s Daisy is every bit as careless as one would expect,  but she also manages to show some complexity in her role. Tobey Maguire is a great avatar for us to take on as we enter this film. He is very much the viewer as he sees everything happening, but is ultimately helpless to change anything. The true standouts in the film are Joel Edgerton and Leonardo DiCaprio. Edgerton as Tom Buchanan brings a lot of personality to his character that I thought was absent in the book. He’s a bit more tender and more vulnerable, especially when he finds out his wife’s secret. The true award recognition worthy performance comes from DiCaprio’s Gatsby. He hones on being a respectable, but idealistically insane man. His performance is not only compelling, but also charming and quit hopeful. He truly deserves some recognition come Oscar season.\r Overall, “The Great Gatsby” is a fantastically entertaining and enthralling film. It is horribly underrated as it is filled with awards worthy visuals, sets, costumes, direction, and performances. It is a great time at the movies for anyone that enjoys the classic novel or who haven’t even heard of it. Not only is this film dramatically satisfying, but also quite humorous and a spectacle like no other. I give it 4.5/5, a great adaptation of one of the greatest novels ever written."}, {"rating": "8", "text": "A great story, with great actors, with a amazing director, with good spécial effects !\rWell why give an 8 then ?\rCause i realy dont like RNB music in a Film who the action is in 1930 ...\rExcept this it's a very good film"}, {"rating": "5", "text": "To much party scenes, 3D traveling shots and not enough dialogue and dept in each  character. And every time they seem to be getting to the core of some meaningful revelation, the voice over appears to take you far away from the scene and its climate. I wouldn't call it bad storytelling, but the entire movie seems to slip through your fingers and splash in a thousand colorful 3d-camera movements on to the ground. I had high expectations, and there were only a few moments in which this were matched."}, {"rating": "0", "text": "This is probably the most uninteresting movie. You shouldn't put newer music in a movie that's supposed to take place in 20's, the music threw everything off. Yeah the movie should only be partially like the book but since the book is a really good classic  you guys screwed everything up. Leonardo dicaprio is an amazing actor and is good in this movie but the rest of actors is just a no."}, {"rating": "8", "text": "A surprising emotional scope blended with good  cinematography, a great soundtrack and very stylish direction gives The Great Gatsby a grand overall feel."}, {"rating": "9", "text": "I'm going to make this very simple for you. If you like the book, you'll like the movie. Why? It encompasses everything that makes the novel great. The script basically is the book, from the narration, to the dialogue, the the plot line. The magic of the book is brought to life by Baz Lurhmann's direction, and by the performances. We really get to see this fantastic world the same way we imagined Nick saw it, when we were reading the book. People complain about the style, and how it's too shallow, and goes out of its way to look good, but that's the point. Gatsby's fantastic life was completely shallow, but Nick didn't see that initially. I'm interested in hearing the opinion of someone who liked the book, but didn't like the movie, because I'd like to know what they were expecting. They must've read a different book than I did."}, {"rating": "8", "text": "As a huge fan of DiCaprio, Mulligan, Fitzgerald and Lurhmann, I went in with pretty high expectations. Sure enough, the acting, direction and script are top-notch, if a little too faithful to the source material in letter, while being wildly all over the place in tone, leading to a bloated, overlong production.\r That said, I'd rather take something ambitious over the safe treatment any day: within these 2 1/2 hours, there are moments of incredible power, and the excesses of the time period are well demonstrated through the wicked party scenes. \r Gatsby's parties are the highlight  recalling modern mega-raves or top-notch Vegas clubs with the energy amped to 11, their bombast and spectacle threaten to overwhelm the rest of the film. If only Luhrmann could find a way to ensure that his film's visual dynamism didn't go head-to-head with anything that might be considered subtle... the director's over-abundant style robs the film of is realism: it takes place in a world that's decorated, lit, and shot as if it were an ethereal realm somehow divorced from the everyday, and like its titular character, the film does go above and beyond what's needed to impress. \r Therein lies the film's biggest problem: the weight of Gatsby's ambitions and the non-stop eye-popping visuals coupled with lightning fast editing takes a toll on the flow of the story. For most of the film, Luhrmann doesn't let his scenes attain an organic flow of their own. His camera swivels through the air as if more interested in the set decoration than his own stars, and the edits rarely slow down even during the most intimate sequences.\r Still, the performances are great all across the board. DiCaprio is far and away the standout, Maguire's Carroway is thankfully subtle (although his voice overs get to be a bit much), Carey Mulligan (my waifu) brings a real heart and soul to an underwritten and unlikeable Daisy (an unfortunate result of the film following its source material too slavishly), and Joel Edgerton makes a great Tom Buchanan. Perhaps it's telling of the strength of the source material and cast that the human element shines through despite Luhrmann's excesses."}, {"rating": "7", "text": "So, could Baz Luhrmann, with Jay-Z at his side, deliver a modern adaptation of the the Great American Novel that would be well received by all? I think the answer from the offset was always going to be no. Instead, Luhrmann delivers a visual feast of a film, one that tries to balance Luhrman's big number style with an authenticity to the source material but one that relies too heavily on narration, some cheap visual effects and ends up failing to fully flesh out the key relationship central to the story.\r I don't have any specific problem with Baz Luhrmann's style, I liked his take on Romeo & Juliet and have managed to avoid Moulin Rouge so far. I thought he would be a good match for the glitz, glamour and decadence of the period and I thought this side of the film worked out well. The style factor was never going to be in doubt. The use of music in the film has been the subject of some debate and I'm going to side with the positive. It worked fairly well for me, hip hop goes hand in hand with excess and the modern songs fitted well with the music video style of Gatsby's parties. Lana Del Rey's song Young & Beautiful is mesmerisingly haunting and is the perfect accompaniment for the film's troubled lovers. Having not read the book and therefore not being aware of the literary themes in place this may be an unfair comment, especially if fans of the book appreciated the inclusion, but I felt the direction was slightly heavy handed in places, I certainly felt the references to the all-seeing eyes and green light were more than driven home.\r Leonardo DiCaprio gives a mature, refined performance befitting the great nature of the man. Carey Mulligan is also excellent as Daisy, giving what I call a 'bambi' type performance complete with beautifully innocent doe eyes. She is let down by the direction/narrative, wherever you want to lay the blame, which doesn't do enough to make you understand the passion of Gatsby for the girl, especially given the choices she ultimately makes. Tobey Maguire is suited to the role of Carraway, though his key role in the film as narrator, really limited my enjoyment. The guy always seems to come off so square, disapproving and lame.\r I enjoyed The Great Gatsby but I'm sure it won't suit all tastes."}, {"rating": "9", "text": "This movie was absolutely great, mainly for its screenplay and it staying true to the Gatsby storyline. It was enjoyable all the way through, DiCaprio was amazing as Gatsby, and all of the roles were well played. The music though was stunning and fit the mood, even if it wasn't all Jazz (Black 1920s music). Instead, cleverly they used Hip-hop (Modern day black music). Overall, if you have read, or not read the book, you should absolutely see this."}, {"rating": "6", "text": "The scenery is beautiful, but Maguire becomes annoying fast. The movie jumps around between scenes with no real transitions. Very difficult to stay interested."}, {"rating": "6", "text": "It's first act is certainly aimless and unbearably frantic, but the rest of \"The Great Gatsby\" endures as an emotionally involving and thematically thought-provoking piece."}, {"rating": "10", "text": "I'll admit this is one of my favorite novels of all time. In my opinion it is THE great american novel. I think it encapsulates everything that is America. The excess, the lust for money, the shallowness of keeping up appearances, and people's admiration for those they deem successful.\r I also think that Fitzgerald's novel stands the test of time and is just as relevant today. This movie captures the novel perfectly and hardly deviates from the book which is it's greatest strengths. The performance by DiCaprio as Gatsby is also out of this world. Don't listen to the critics, if you're a fan of the book you'll enjoy this movie."}, {"rating": "5", "text": "The set pieces are great. Exactly what I imagined when I read the book. The acting is pretty solid. But the overuse of CGI (on things as simple as rain on a dock) and heavy music take away from the movie. I don't hate the film, but I didn't like it either. I literally nothing this movie."}, {"rating": "9", "text": "Baz Luhrmann's adaptation of \"The Great Gatsby\" isn't a disaster. Every frame is sincere. Its miscalculations come from a wish to avoid embalming a classic novel in \"respectfulness\"  a worthy goal, in theory. It boasts the third most imaginative use of 3D I've seen recently, after \"U2 3D\" and \"Hugo.\" It's a technological and aesthetic lab that has four or five experiments cooking in each scene. Even when the movie's not working, its style fascinates. That \"not working\" part is a deal breaker, though  and it has little to do with Luhrmann's stylistic gambits, and everything to do with his inability to reconcile them with an urge to play things straight.\rIf you've seen Lurhmann's \"Strictly Ballroom,\" \"Romeo  Juliet\" or \"Moulin Rouge,\" or watched \"Gatsby\" trailers, you know what you're in for: an epic melodrama that fuses old-movie theatrics and subjective filmmaking, period music and modern pop, real sets and unreal landscapes, psychological drama and speeded-up slapstick.\rWe see the book's Prohibition-era settings (East Egg and West Egg, New York City, and the sooty wasteland in between) through the eyes of the narrator, Nick Carraway (Tobey Maguire), who's writing a memoir-confession from an asylum. This framing device is inferred from statements Fitzgerald made in \"The Crack-Up,\" and \"Gatsby\" often refers to itself as a book, so even though it's not part of the source, it's hardly a blasphemous indulgence; still, it's one more buffer between viewer and story in a movie that already has plenty.\rThis busywork might astonish if Lurhmann's heart were in it, but is it? The guests at Gatsby's party are too obviously directed, and there's no sense of escalation in the gatherings; from frame one, they're a Dionysian whirl of booze, lust and hero worship, minus the sense that that things are ebbing and flowing as they would at a real party. The CGI-assisted camera acrobatics feel obligatory. So do the anachronistic soundtrack mash-ups (modern hip-hop layered over ragtime piano, and so on).\rBut in the film's dark second half, \"The Great Gatsby\" half-forgets its mandate to wow us and zeroes in on actors saying lines to one another in rooms. Once that happens, the Luhrmannerisms distract from the film's true heart: the actions and feelings of its characters. Luhrmann didn't set out to make a PBS-style, bare-bones adaptation, but there are times when it feels as though he wants to.\rOnce you get past the movie's opening eruptions of visual excess  hundreds of party guests boozing and hollering and doing the Charleston; CGI cityscapes that visualize 1920s New York by way of Warren Beatty's candy-colored \"Dick Tracy\"; a long expository talk between Gatsby and Nick in a careening computer-buffed roadster that moves as believably as the talking cab in \"Who Framed Roger Rabbit\"  \"The Great Gatsby\" settles into a traditional groove: scene, scene, montage, scene, burst of violence, moment of reflection. The movie wants to be a \"kaleidoscopic carnival,\" to quote a phrase from the book's description of a Jay Gatsby party, but Luhrmann's instincts seem more traditional, even square, and the two impulses cancel each out. Once you've spent time with his cast, you understand why he was torn.\rDiCaprio's Gatsby is the movie's greatest and simplest special effect: an illusion conjured mainly through body language and voice. On the page, the character is so mysterious, so much a projection of the book's narrator, that you'd think he'd be as unplayable onscreen as Kurtz or John Galt; he eluded Alan Ladd and Robert Redford, the role's previous inhabitants. And yet DiCaprio makes him comprehensible and achingly real. The actor's choices drive home the idea that Gatsby is playing the man he wishes he were, and that others need him to be. We see the calculations behind his eyes, but we also believe that he could hide them from the other characters  most of them, anyway.\rDiCaprio's acting evokes Nick's description of the human personality as \"an unbroken series of successful gestures.\" Luhrmann cuts some scenes to make it seem as if the character really is omniscient  as if he can see and hear for miles and read people's thoughts and feelings  and DiCaprio plays these moments with a mix of inscrutability and delight, as if Gatsby knows something we don't, but is too clever to say precisely what. (He could play Superman.) When Gatsby's deceptions are revealed  is an iconic performance  maybe his career best.\rThe rest of the cast is nearly as impressive. Nick Carraway is almost as much of an abstraction as Gatsby  an audience surrogate, with touches of The Nice Guy Betrayed  but Maguire humanizes him, just as DiCaprio does Gatsby."}, {"rating": "10", "text": "Dude! This is the best movie of the summer!! I saw one of the best performances of Leonardo DiCaprio and the rest breaks too! I recommend to all!!"}, {"rating": "10", "text": "Perfection. Brought out every emotion from the book and then some.  It may have left out or rearranged the details, but the heart and the idea of the book remained intact."}, {"rating": "10", "text": "Let us get the obvious out of the way: The Great Gatsby as the inspirational literature piece, is extremely better than this movie. But lets not kid ourselves. This movie was a damn good movie. An AMAZING movie. Upon seeing the trailer for this movie, I had high expectations and couldn't wait to see the movie. Reviews starting filing in and I couldn't understand it. Bad review after bad review. My expectations lowered. As you would expect. The movie starts and it sort of started slow to me and somewhat worried me, but the movie started to get going and I found myself enjoying it thoroughly. By the end, the tragedy, the romance, the broken relationships, the lies, deceit. It was pure emotion. These were truly the life and times of Jay Gatsby. The rise and fall of Jay Gatsby, if you will. It was extraordinary from start to finish. Nothing captivated me like this since Django Unchained last year. I will definitely see this movie again. I highly recommend this movie regardless if you're a fan of the book or haven't read the book at all and enjoy a good movie. Very good."}, {"rating": "9", "text": "I remember watching the trailer for this movie a year ago and expecting it to come out at Christmas. I just don't understand why the movie was delayed 6 months. But now that the movie is here I can personally say it was worth the wait. The Great Gatsby is a very beautiful story and well told through miraculous cinematography, some visuals and fantastic acting. Hands down, Leonardo DiCaprio is the heart and soul of the movie. I mean, he's just such a tremendous actor. It may not be his biggest and best role, but he still gives one hell of a performance (just as usual). There were some even some other great actors such as Joel Edgerton, Carey Mulligan and even Tobey Maguire. I honestly wasn't sure if I would like him in this movie but he actual is really good. But his best role for me will always be in \"Brothers\". The cinematography is definitely one of the things that impressed me the most. Cinematographer Simon Duggan really knows how to not only get great shots, but take you through the world of Jay Gatsby himself. The one thing I really don't understand is this. Why is there a 3-D release for this movie? I mean, it has those good shots, but honestly it doesn't need to be shot in 3-D. That's like making \"The Notebook\" in 3-D. It just doesn't work. But don't let that distract you from watching an (Oscar worthy) type-movie. If your going to go watch it, watch it in 2-D. But overall, it's a beautifully crafted story of drama and romance."}, {"rating": "10", "text": "After seeing this movie a second time, I began to like it even more, ultimately going back a total of 4 times.  In my first viewing, I unfairly underrated this movie and wish to make amends to its creator.  This movie is gorgeous.  Acting of the 3 leading men is impeccable.  DiCaprio brings to life a more deluded version of Gatsby than prior versions.  His depiction felt off at first viewing, but after seeing the movie again it felt perfect.  My apologies Baz Lurhmann.  I think this movie should get all the academy awards except for the actress categories."}, {"rating": "3", "text": "“The Great Gatsby” stars Leonardo DiCaprio, Carey Mulligan, Tobey maguire (he spells it that way), Jason Clark and Joel Edgerton in this remake of F. Scott Fitzgerald’s novel of life and its extravagances in the mid ‘20’s. Unfortunately, not true to the flavor and depth of this great novel, Director and Co-writer Baz Luhrmann gives us a glitzy overdone film with no depth or intensity but, instead, the shallowness of a music video. First, a disclaimer. I am no fan of either Tobey maguire or of Mr. DiCaprio and with these precommitted feelings, it’s difficult to enjoy any vehicle either of them are in, let alone both. Mr. maguire whines his way through this overdone narrative and Mr. DiCaprio continues to look like a teenager trying to play an adult. If he uttered the phrase “old spoaht” one more time in the film, I would’ve thrown my 3D glasses at the screen. Speaking of that, this film has no dimension so the need to try to see it in 3D is useless. I at one point took off the glasses and could not honestly tell the difference. So visually and substantively, the film lacks so much except one thing…..time. This lifeless seemingly never ending film lasts for 2 and  hours and screams for an editor’s splicing machine. The special effects and scenery, as costly as they may have been, seems to be the impetus for the movie’s length since it’s hard to put so much set money on the floor of the editing room. The old “how many times did I look at my watch” test proved accurate for I recall no less than 6. This Gatsy is neither ‘great’ nor ‘good’ and, at best, is mediocre.  As bad as the 1974 version of the film with Robert Redford and Mia Farrow was, this is probably worse. I give the film a rating of 3.The viewers, F. Scott and those interested in good filmmaking deserve better."}, {"rating": "0", "text": "Is it just me or was this the most boring Leo movie ever! No intense moments whatsoever. I really have nothing else to add except that it was way too long and I almost fell asleep in the movie theatre. And 3D is not worth it if there is just going to be 3d snow an rain."}, {"rating": "5", "text": "The new Gatsby tries to center itself on visual masterpiece, costume design, and other technical categories that it forgets to spend time on acting, direction, and greatness making this classic plot go uneven and present possibly the worst performance of Tobey McGuire fairly good career."}, {"rating": "0", "text": "what a great disappointment this movie was. a totally  unrealistic and poorly directed movie  i am a die hard Leonardo fan but this was the worst movie i have seen him in.  my wife and i have watched nearly ten thousand movies together over the years. we have only ever walked out of three movies.  the great Gatsby was the third.\r the camera shot  changes were so fast they hurt the eyes and the whole movie was a cross between a poor melodrama and a  and a badly produced farce.  after enduring one hour and ten  minutes of over stimulation and a care less attitude from the actors, we decided to leave.\r for a movie that promised so much, it delievered very little. even the great Leonardo DiCaprio seemed disinterested in his part. he particularly appeared reluctant to deliever his lines when the included the words old sport."}, {"rating": "8", "text": "Despite lacking depth in some parts, \"The Great Gatsby\" is a excellent piece of artwork that not only stays true and faithful to its original source, but also mixes the creative genius thawed out from the illustrious mind of Baz Luhrmann."}, {"rating": "0", "text": "This is one of the worst movies ever. The director should be arrested for this absolutely insulting adaption of The Great Gatsby. Never was I more convinced to just get up and leave the theater in  the middle of the movie."}, {"rating": "6", "text": "The Great Gatsby is a beautiful novel and while adapted to a film, it became visually beautiful. However, for some mystical reason the visual did not coincide well with the plot or the narrative.  I was hearing the story from the narrator as oppose to seeing it. Close to the end I decided to shut my eyes and hear the story because it was the visuals were frankly redundant although spectacular. The fact that Jay Z executive produced this film is very obvious from when you hear Jay Z's music like you're at his concerts, it got too repetitive for me regardless of the quality of the actual music.  Overall, Great Gatsby was unable to give us a full experience without one sense blinding the other."}, {"rating": "8", "text": "All I can say is that you should never listen to the critics. They are so full of themselves. The best they can do is take someone's hard work and turn it on its head. Leo nails the plight and desperation of Gatsby with such intensity that you can't help but feel for him. I wished to be there for him and to tell him that everything would be all right. I've not read the book and frankly the plot seems very generic. A man from humble beginnings rises through society for the sake of winning the girl he lost several years ago. Yet the book is hailed as 'The Great American Novel.' I don't know why that is, but the movie only shines because of Leo. That man knows the most intimate secrets of playing a character and bringing it to life. Of course one may argue that there was no electronic music and rap in the 1920s, and yet Moulin Rouge! didn't seem to have historical accuracy going against it when it received critical acclaim, as I don't think Nirvana existed in the nineteenth century. Carey Mulligan also deserves a mention."}, {"rating": "4", "text": "It is now apparent that F. Scott Fitzgerald's classic novel The Great Gatsby does not translate well to the big screen. The acting was perfectly fine but the story, as classic as it may be, can simply not be made into a decent major motion picture."}, {"rating": "3", "text": "There is little of redeeming value in this flick. It made me nostalgic for the version with Robert Redford and Mia Farrow and the critics weren't very kind to that one either."}, {"rating": "6", "text": "Visually striking, but a bit slow, and too long. The story did seem to lack depth and felt hollow. The use of modern rap and other asynchronous music in the soundtrack was noticeably off-putting, inappropriate, and killed suspension of disbelief. Better than the earlier versions, but still failed to have significant depth. All glitter and flash makes Gatsby a dull boy."}, {"rating": "8", "text": "Great soundtrack, insane visuals, intense performances, and some good humor to boot. A sick adaptation of Gatsby. It far exceeded my expectations. The critics must be seeing a completely different film than me."}, {"rating": "8", "text": "This movie completely captures the flavor of Fitzgerald's words with the images of Baz Luhrmann.  I did not expect it to be REAL.  I expected it to be romantic and impressionistic and it was.  Strong performance by Leonard Dicaprio.  His acting and the extravagance of the sets were well worth the price of admission to me."}, {"rating": "9", "text": "the great gatsby was a excellent and great movie\rthis is the best adaptation of fitzgerald's novel\rall the cast was excellent especially leonardo dicaprio and tobey maguire"}, {"rating": "10", "text": "Visually stunning, great pace and dramatization.  IMO really gets to the core issues Fitzgerald had in mind.  Makes you think about your own goals in life and what happiness really is."}, {"rating": "10", "text": "Great film, everything about the movie was fascinating..  I was kept on edge until the ending which was a complete shock to me, I keep replaying scenes of the movie in my imagination, it's a very impressive film that was very compelling. I don't think my words are enough to express how great this film is, go watch it and experience the enjoyment for yourself. I am slightly upset by the number of people that didn't like this film, to say this film doesn't meet your standards is a joke."}, {"rating": "9", "text": "As a reader of the F Scott Fitzgerald novel and watcher of the, Robert Redford, film The Great Gatsby I loved the new film. The New film only reinforced my admiration of this timeless story. Green Light"}, {"rating": "8", "text": "I originally thought I wasn't going to enjoy this film because I feared it was going to be all flash with no substance as the special effects and odd choices of music would be the film's dominating elements.  While the film has a lot of flash and style, it still contained the heart of the novel and it was incredibly addicting and enthralling.  Finally, the performances are amazing with Joel Edgerton really being the spotlight stealer in this one!"}, {"rating": "8", "text": "Within the first ten minutes of this movie you know its a Baz Luhrman film. Baz tries to throw a modern spin on a 1920's flick in which he successfully executes. The characters were all over-acted which seems to be on purpose and, considering the setting, was appropriate. Leonardo was the perfect man to play as Mr. Jay Gatsby and he executed flawlessly as always. The casting for all the other characters were also done extremely well. The movie did not stray from the infamous novel which was appreciated."}, {"rating": "7", "text": "This was a very decent movie. It was very well-made in my opinion. I thought that the first third was the best part, I loved the party scenes, they were so beautifully made."}, {"rating": "9", "text": "Exciting and thought-provoking. A talented cast, along with stunning visuals  think Moulin Rouge  capture the imagination and curiosity of its viewers. It kept me well at the edge of my seat,  guessing and second guessing the characters involved. As the story unfolds, \"ooo\"s and \"ahh\"s are likely to escape your lips as it did mine."}], "recommendations": ["youth", "annette", "amadeus", "magnolia", "marie_antoinette", "hugo", "murder_on_the_orient_express", "the_bfg", "cloud_atlas", "perfume_the_story_of_a_murderer", "eternals", "nocturnal_animals", "dune", "the_grand_budapest_hotel", "kingdom_of_heaven", "life_of_pi", "alita_battle_angel", "the_walk", "casablanca", "roma", "bohemian_rhapsody", "the_last_of_the_mohicans", "the_green_knight", "alice_through_the_looking_glass", "the_devil_all_the_time"]}