{"id": 2377, "title": "The World Is Not Enough", "starring": ["Pierce Brosnan", "Sophie Marceau"], "runtime": 128, "genre": ["Adventure", "Action", "Thriller"], "description": "Greed, revenge, world dominance and high-tech terrorism – it's all in a day's work for Bond, who's on a mission to protect a beautiful oil heiress from a notorious terrorist. In a race against time that culminates in a dramatic submarine showdown, Bond works to defuse the international power struggle that has the world's oil supply hanging in the balance.", "releaseYear": "1999", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wCb2msgoZPK01WIqry24M4xsM73.jpg", "categories": {"plot": 5.964285714285714, "acting": 6.666666666666667, "ending": 4.8, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.9411764705882355}, "reviews": [{"rating": "8", "text": "Good character and story development throughout with a dash of good enemy casting."}, {"rating": "7", "text": "The first two Bond movies with Pierce Brosnan are clearly his best, but this movie is still enjoyable. Brosnan is a reasonable good James Bond.\r Unfortunately the story is a bit complex for a Bond movie and the main villain is not very interesting: a man who can't feel pain coz a bullet is stuck in his brain sounds interesting enough, but makes for some dull fight scenes and an unsatisfying death of the bad guy.\r Judy Dench as 'M' is useless as usual and this time she even lets herself being kidnapped. Too bad Bond saves her and she only gets killed off in a later movie.\r Denise Richards is of course not very believable as a nuclear scientist and she's not even half as beautiful as Sophie Marceau is.\r The boat chase scene is very memorable though and easily one of the most spectacular Bond moments ever seen."}, {"rating": "7", "text": "WHAT I LIKED: Like 'Tomorrow never dies,' this film is packed with fun, whilst Brosnan's severe persona balances out any Moore-like cheesiness. In this instance these contrasts feel even less at odds thanks to an all-round improvement on Brosnan's part. It also packs a few good character through-lines and some great action to match; accumilating at the end with a great pay-off and a nice balance between spectacle and stuff to make you care.\rWHAT I DIDN'T LIKE: The plot is just so unneccessary, and as a result it requires a set-up as long and dissengaging as any in the series - and some of it's worst writing too. I'll bet you wont care for much until you're at least one hour in...\rVERDICT: The right balance between the fun of the previous, and the seriousness of 'Goldfinger,' It's just a shame Brosan's penultimate outing didn't have the plot to match."}, {"rating": "8", "text": "The World Is Not Enough is almost as luxurious as previous works. The plot is delicious again, but the locations are a bit worse. But Brosnan is great and a great film for me, which I can recommend."}, {"rating": "5", "text": "The World is not enough is an average Bond flick with usual action and bland plot line, but nothing more to offer. The movie seems tired, and it shows in everything in it."}, {"rating": "8", "text": "For me, the best Bond movies are not the ones that defy the Bond formula, but the ones that embrace it. The World Is Not Enough sticks to what makes Bond, Bond, and it does it all well."}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "6", "text": "The best part of this entry in the Bond series is the excellent theme by Garbage. Unfortunately only the first half of the movie is fun, then when Denise Richards character Dr. Christmas Jones pops up, its all downhill."}, {"rating": "5", "text": "The nineteenth James Bond film, third for Pierce Brosnan as 007, and the only one directed my Michael Apted.When Bond unknowingly retrieves a bomb hidden in a suitcase full of money, and returns it to its wealthy owner Sir Robert King, a construction billionaire whose company is building an eight-hundred-mile-long oil pipeline in Azerbaijan, and is a life long friend of \"M\"'s (Dame Judi Dench), at MI6 headquarters in London, the bomb explodes and kills King and blows a hole in the side of the building. After figuring out that the terrorist Renard (Robert Carlyle) is behind the bombing, Bond is sent to protect King's beautiful daughter Elektra (Sophie Marceau), who had been kidnapped by Renard several years earlier and held for ransom, but at \"M\"'s urging he never received the ransom money, and Elektra claims to have escaped on her own. 007 then finds out that Elektra suffers from Stockholm Syndrome, and is in love with Renard, and has plotted with him to kill her own father, and kidnap and kill \"M\". Then they will steal a nuclear device and plant it on a Russian sub and blow it up destroying three competing Russian oil pipelines, to which Elektra's family pipeline would profit exponentially. So 007 must chase after Elektra and Renard, to stop their plan and rescue \"M\", with the help of nuclear specialist Dr. Christmas Jones (Denise Richards).This is the worst of four Brosnan 007 films. Not that it is his fault, he is great as usual, but what a waste of a potentially great bad guy in Renard. He really isn't in that much of the film, and Elektra comes out actually being the top villain. And let's face it, Denise Richards as a nuclear specialist is a joke, because she is a horrible actress and probably can't even spell the word \"nuclear\" (she's only good to look at). Dame Judi Dench is wonderful as usual, plus we see Desmond Llewelyn's departure as \"Q\", and the introduction of his successor John Cleese as the \"New Q\". A scene that is very ironic, since Desmond Llewelyn died not long after the release of the film. We also see the return of Valentin Dmitrovich Zukovsky (Robbie Coltrane) from \"GoldenEye\". And one last note, Sophie Marceau is one of the most beautiful women to ever be in a James Bond film."}, {"rating": "5", "text": "Brosnan and the story are pretty good but some of the dialogue is deplorable."}, {"rating": "5", "text": "Not particularly satisfying, the one word I would use to describe this film is \"heavy\". The first third is excellent, yet as the darkness of the nuclear desert base comes into play the film changes tone and struggles to generate an inviting aura.I'm not too upset by Denise Richard's performance, she isn't the worst bond girl, i'm more disappointed by just how Sophie Marceau and Robert Carlyle fail to develop a convincing chemistry. Much of the film, especially in the second half, lacks lighting and is just not interesting. We do get a variety of locations, some of them great, but almost half of the film is skippable worthy, especially concerning the side plots with Valentin Zukovsky.Overall it's a very average film, but a fairly poor Bond entry."}, {"rating": "6", "text": "Not a bad movie to be exact, but some boring scenes tend to make me sleep and the plot sometimes do not even follow to the deepen ends of this partially flawed and confusing scenario."}, {"rating": "9", "text": "Pierce Brosnan does a great job at bringing the emotional side of Bond to this picture and the story is inventive and interesting, even if it is at times way over the top, but that is what I want in a movie.  The villains in the film are interesting and the acting is great in this film (except for one Denise Richards, who is sometimes okay, but she has her bad moments).  The action is awesome in this film and the music is perfect.  I really enjoyed this film and the fact that they brought the more emotional side of Bond out."}, {"rating": "5", "text": "It's a very average Bond movie with quite a lot of wasted potential, but yet I still have so much fun with this. I think there's a great relationship between Bond and the female villain. Nice sub-plot with M and I have to give credit to the boat chase in the pre-credits sequence. Though Denise Richards is one of the worst Bond girls, but who cares, it was a hell of alot of fun. Nuff said!"}, {"rating": "10", "text": "THE WORLD IS NOT ENOUGH is one of the best James Bond 007 films ever made, and it's one of my my favourite James Bond films. Spectacular Action Set-Pieces, a Wonderful Plot with Twists and Turns, Two Hot & Sexy Bond Girls, and Pierce Brosnan's Fantastic & Stylish Performance as James Bond make this one of the best James Bond films ever and a visual delight for James Bond fans. THE WORLD IS NOT ENOUGH sticks to what makes Bond, Bond and in doing that it truly embraces the James Bond formula in the best possible manner..."}, {"rating": "5", "text": "Directed by Michael Apted and produced by Barbara Broccoli and Michael G. Wilson, it has script by Bruce Feirstein and Robert Wade and is the nineteenth film in the franchise. In this film, Pierce Brosnan plays 007 alongside Sophie Marceau, in the role of Electra King, Denise Richards, in the role of Christmas Jones, Robbie Coltrane, in the role of Valentin Zukovsky and Robert Carlyle, in the role of Renard. In this film, Desmond Llewelyn made one of his last appearances as Q, alongside his replacement, John Cleese, in the role of R, his assistant.In this film, James Bond will protect the life of Elektra, the young and seductive daughter of an oil tycoon, murdered by the construction of a pipeline in the Caspian Sea. Despite the orders received, Bond will discover that the girl keeps dark secrets from her past, and isn't as angelic and helpless as she seems.Its not the first time that James Bond gives attention to problems related to oil or energy, we already saw something similar in \"The Man With the Golden Gun\". However, its this film that focuses more directly on issues related to oil industry and the control of oil production, either by countries or by certain firms. Sophie Marceau deserves congratulations for her excellent interpretation in this film, where she had a deeply complex character. Indeed, Brosnan's time's movies, despite its serious flaws, gave some of the most remarkable and memorable villains of the franchise. As for Brosnan himself, he continued to make his role unconvincingly or unsurprisingly, warm as a bread without salt. The film is full of errors, paradoxes, continuity failures impossible to disguise and blatant advertising of various sponsors. The machines are also worth mentioning in this film, in particular the helicopter with saws which, in the most striking sequence of the film, chases Bond cutting a BMW and a caviar warehouse as if they were butter. The opening theme of this film is the longest in franchise so far. Sung by Garbage is excellent although its too long."}, {"rating": "10", "text": "A fantastic addition to the James Bond series - easily one of the best ones every made. It's quick, clever, graceful, and ingenious. Pierce Brosnan makes a perfect Bond once again. Sophie Marceau takes a terrific turn as Elektra, the oil heiress that Bond must protect. Robert Carlyle expertly plays the villain Renard. Denise Richards is not entirely believable as nuclear physicist Christmas Jones, but she does her best with the material she is given. Great action sequences help bring the film to excellence."}, {"rating": "7", "text": "Not a bad movie, but compared to Tomorrow Never Dies and Die Another Day, somewhat dissapointing. Tries for a more ambitious story involving old friends and M being some sort of Godmother, but faulty writing and scripting causes a plot that doesn't flow very well and is sometimes hard to follow. The action ain't all that exciting in this installment, although the boat chase and parahawk chase show creativity. Sophie Marceau's gorgeous presence is more than welcome, far outdoing Denise Richards."}, {"rating": "6", "text": "Average acting, good beginning, bad ending, average storyline, average action, average locations, average characters, pretty average in all."}, {"rating": "9", "text": "I am a fan of James Bond, and I have to say I love The World is Not Enough. It mayn't be the best of the Bond films like I consider a film like Goldfinger, but it is easily one of the better Bond films with Pierce Brosnan in the title role. I also think it is incredibly underrated, for as I have said this is really good and second only to GoldenEye as the best of the Brosnan Bonds. I loved that The World is Not Enough was a welcome return to the gritty glamour as seen in From Russia With Love, and that the story is quite hard-hitting as well as suspenseful and thrilling. The stunts are truly spectacular, as is the action which is enough to make your adrenaline pump up, with the opening speedboat chase complimenting it perfectly. The cinematography is effortless and the scenery is splendid, while the music and theme song are certainly memorable. The acting is very well done, Pierce Brosnan is very likable and clearly comfortable as Bond, while Sophie Marceau matches him perfectly and her character Elektra King is for me the best and sexiest Bond girl in ages and Robert Carlyle is perfect as the vicious and chilling villain. And I actually didn't mind Denise Richards that much, admittedly she isn't brilliant, but I certainly didn't hate her, and Judi Dench once again proves what a fine actress she is and even gets to go out into the Middle East battlefield and show off her gadget ingenuity. Overall, this is really underrated and quite an excellent film. 9/10 Bethany Cox"}, {"rating": "3", "text": "Brosnan with his stealy cold looks, is quite a magician, disappearing logics and numbers, he quotes philosophy.The World Is Not EnoughApted acts almost like a robot in here. It is like he was told to make sure that this remains a one big sloppy kiss to commercial cinema. And Michael Apted, the director, with all the professionalism in him makes sure it does. The story revolves around the jungle where a bait is usually used to advance the storyline further, which sounds decent but only upto when the makers keep their vocab subtle and ask for some maturity; they don't. The chase sequence that has always been the major signature asset of this franchise bodes well on terms of pace, we are not even going to point out how absurd it is, just let it be.Also they have always tried to push themselves in pulling out what's impossible practically and project it on screen, and in that very sense, it is an appreciative work. I can see why box office has loved Pierce Brosnan so far, for his films are incredibly fast and light on their feet, it embraces the macho-ism but unfortunately also defines it as not to boo-hoo in front of anyone, that marks it as a real deal. Which is also why many of critics have claimed it be the most sexist and ethically wrong icon to be rooted for.The antagonist is given a lot a weightage but is unable to carry it off, the performance doesn't ooze the warmth it demands. Also in a case like such, our hero, the rooted character that we blindingly bet on, have to come up with something impressive or at least equally awe-gasping for us to make believe that good triumphs over evil. Plus, somehow they have projected Brosnan as a bit Sherlock-ian who is now apparently an overly sung hero in any intense sequence that breathes how belittling everything is and how The World Is Not Enough."}, {"rating": "1", "text": "Oh my god. This movie is terrible. It is so cheesy and is easily Pierce Brosnan's worst 007 outing. Denise Richards is the worst part about it though. I wanted to throw up when I watched this"}, {"rating": "6", "text": "While not the slickest 007 escapade, The World is Not Enough is still an enjoyable entry in the series."}, {"rating": "6", "text": "Brosnan is still good and I liked the story about oil pipelines.But as usual some action scenes are fairy tales. In addition Judi Dench is annoying as usual and get even more time in this movie. Sophie Marceau as Elektra King wasnt convincing in contrast to Denise Richards as Dr. Jones"}, {"rating": "3", "text": "I watched all 25 from Dr.No to Spectre, I would place The World is Not Enough at 20/25.Brosnan was the worst Bond. The World is Not Enough is his worst Bond.I would say Tomorrow Never Dies is actually worse, but in that one, I find an odd fascination with how much I can hate it. Getting drunk and hating on a terrible movie is a form of enjoyment to find.In here, there is nothing. The plot is uninteresting. The villains are VERY uninteresting, and are probably the worst part of the movie. The scenes are uninteresting. The action, which was at least bombastic in Tomorrow, is now just hashed out and extremely synthetic.This movie has the odd distinction, in a franchise full of crazy ideas, poor taste, and nonsensical plots, that still get to be forgiven and enjoyed, to be the one that doesn't have anything \"really\" bad. Instead, it is that low in my list because it just has nothing good. Actors, plot, emotion, action, there is nothing. Just an utterly skippable and pointless movie. The only thing to see is Sophie Marceau, which is still a sight to see, but everything else should be skipped."}, {"rating": "3", "text": "The nineteenth James Bond movie and the end of an era as it is the last appearance of Q played by Desmond Llewelyn. He became a pop culture legend along with James Bond and everyone of us wanted his awesome gadgets or be as smart as him. I want to thank him for everything. John Cleese is introduced here and took over. Good decision for me and Desmond Llewelyn wanted someone to take the mantle as he got old and thought that he could not be forever Q (He will always be Q in our memories;-). The story starts when Sir Robert King a close friend of M is assassinated inside the MI6 headquarter and James Bond gives a great chase after the assassin. Later he is send to protect Elektra King the daughter of Robert King who does not trust the MI6 because of their failing with her father and rescuing her when she was kidnapped. The rest after this intro I wont spoil. This is the strangest movie in the franchise for me. On paper it has an awesome story or good ideas but it never got me hooked. I never felt much immersion and still today I do not know why exactly. It has a great intro, an amazing twist and characters that work. The action scenes are also well done. If I have to explain it I would say it feels like they did a to do list and try to fill the rest up with awesomeness. It is somehow a bit empty. The acting is good for franchise standards. Pierce Brosnan delivers and Sophie Marceau is truly excellent. Renard is an interesting villain but will not be that high in the favorite list. The older movies have the best villains like Scaramanga, Jaws, Goldfinger and Blofeld. Strangely the newer movies often struggle with creating good villains. But back to this review. The action and special effects work well. I see no missteps here. The soundtrack is decent, neither great nor awful. Overall this is my least liked James Bond movie to date. I know “Die Another Day” is considered by many as inferior and worst movie in the franchise. However “Die Another Day” has good ideas and even if there are awful scenes it got more immersion for me."}, {"rating": "2", "text": "Pierce Brosnan’s worst 007 movie. Not even the action scenes can save this one. If you are in need of sleep, this can definitely help you out, as it’s incredibly dry and dull. Pierce was just running through the motions here and seems to be as bored as you most likely would be watching this movie for most of it’s laborious 2 hours and 8 minutes that feel like 3 and a half hours. Do yourself a favor and skip this movie unless you’re wanting to watch every 007 movie at least once."}, {"rating": "8", "text": "Bond (Pierce Brosnan), feeling responsible for the death of a British oil tycoon friend, takes the position as bodyguard to the daughter (Sophie Marceau) of the slain man, while trying to catch his killer."}, {"rating": "8", "text": "It gets a lot of hate, but I truly love this film and think it's actually a teensy bit underrated. I think Brosnan gives his best performance here out of all of his films, he shows so many emotions, from charm, to anger, to remorse. The action is another highlight of the film, especially the opening boat chase, pipe bomb chase, and submarine finale. Elektra King and Renard make for some really interesting villains too. Not quite as dazzling as Goldeneye or TND, but still another worthy Bond entry."}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "5", "text": "This disappoints significantly after raising high expectations. The action scenes in The World is Not Enough suffer greatly from a lack of quality. The opening boat pursuit is Bond at his best, but the subsequent action scenes fall short. The action scenes lacked intensity since they were never built up, and, unexpectedly, they never inspired any excitement (apart from the opening sequence). Regarding the conclusion, I must say that it was monotonous and in no way interesting or dramatic. It's a shame that the movie's conclusion couldn't have been the opening scene."}, {"rating": "5", "text": "What is extremely lacking compared to the other Pierce Brosnan 007 films here is a strong heroine. The movie is decent on its own, but this lack of a strong heroine compared to GoldenEye, especially Tomorrow Never Dies, and even Die Another Day drags down the final score massively."}], "recommendations": ["tomorrow_never_dies", "spectre", "die_another_day", "the_spy_who_loved_me", "casino_royale", "no_time_to_die", "for_your_eyes_only", "goldeneye", "from_russia_with_love", "quantum_of_solace", "thunderball", "diamonds_are_forever", "the_incredible_hulk", "homefront", "the_man_with_the_golden_gun", "octopussy", "daredevil", "true_lies", "mission_impossible_rogue_nation", "spider_man_far_from_home", "the_fugitive", "skyfall", "creed_ii", "you_only_live_twice", "sherlock_holmes_a_game_of_shadows"]}