{
  "id": 2753,
  "title": "The Social Network",
  "starring": [
    "Jesse Eisenberg",
    "Andrew Garfield"
  ],
  "runtime": 121,
  "genre": [
    "Drama"
  ],
  "description": "The tale of a new breed of cultural insurgent: a punk genius who sparked a revolution and changed the face of human interaction for a generation, and perhaps forever.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
  "categories": {
    "plot": 6.866666666666666,
    "acting": 7.36734693877551,
    "ending": 6.25,
    "soundtrack": 7.2,
    "cinematography": 10.0,
    "familyFriendly": 1.0,
    "funny": 7.8,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "\"The Social Network\" was so good I don't even know where to begin. I can't, for the life of me, think of another  film in recent years that's left me so wholeheartedly satisfied by the time the credits started rolling. This is some amazing, amazing stuff we've got here folks: don't miss it for the world."
    },
    {
      "rating": "2",
      "text": "Talk, talk, talk, snarky comment repeat. Socially inept rich kids whining about wanting more money and recognition. Unlikeable characters and absolutely no drama. I spent two hours waiting for the movie to begin and it never did.  Simply an awful movie going exprerience."
    },
    {
      "rating": "5",
      "text": "Just saw this offering in a nearly empty theater in Naples, FL - another sign of the age of the population here. Anyway, the dialog is great - especially the opening scene - BUT  unfortunately... it...continues - and the reason the dialog isn't great after a while is that it GRATES. By the end of the show I was convinced that the hero is nothing better than a high-achieving pain-in-the-Asperger and the great cinematography, directing, acting, realism, etc. was a waste of skills.  It's a movie done in by its protagonist."
    },
    {
      "rating": "10",
      "text": "Let's be straight. This movie should have won best picture. This film is perhaps the most representative film of my generation. We are obsessed with technology, status, materialism, and sex. Fincher's depiction of how Facebook was developed is fascinating. Facebook has come to dominate our way of communicating and looking at the world, and this film, although controversial, beautifully depicts the way in which the website became the monster it is today."
    },
    {
      "rating": "9",
      "text": "The biggest of various achievements on The Social Network is directing. Mr. Fincher's work is unique and revolutionary. The editing, sound mixing, and fine acting made this movie a modern classic."
    },
    {
      "rating": "9",
      "text": "Thanks to Aaron Sorkin's brilliant script, David Fincher's stylish direction and fantastic performances from its young cast, The Social Network is a fascinating, witty and engrossing look at the founding of Facebook. The cast are amazing. Jesse Eisenberg gives a career-best performance as Mark Zuckerberg, while Andrew Garfield, Justin Timberlake and Armie Hammer shine as well. The film also benefits from unique, stylish storytelling, helped by wonderful editing and inspired screenwriting. Who knew you could make such a great film out of the founding of a social media website? Overall, this is a well-crafted, superbly acted film, and one of the best of 2010."
    },
    {
      "rating": "9",
      "text": "Great visuals, quick and witty dialogue, superb acting and a suspenseful soundtrack, all wrapped around David Fincher’s masterful directing, the Social Network serves as a sophisticated film that emphasizes the potential of the script and how the most boring concepts can produce the most interesting substance when made right."
    },
    {
      "rating": "6",
      "text": "I was quite surprised by this. I was expecting the film to be a massive overexagerration and basically free advertising for Facebook, but the pacing, direction and length were perfect. The acting isn't great but the movie is admittedly entertaining to watch. Sure, there are no fillers and it starts immediately with no intro, but there seemed to be something missing. It felt heavily edited and seemed more like a two hour montage than an epic journey. Nevertheless, The Social Network is a worthy film but is definitely overrated."
    },
    {
      "rating": "5",
      "text": "If not for Trent Reznor's music, I would have given this movie 3. I've seen it twice, no wait, I've seen it many times: the first time I did my best to reach the end after one week of seeing 15-minute chunks of the movie, the second time I managed to see the last 30 minutes of it. The only memorable scene that comes to my mind is the Winkelvoss brothers' at the Dean's office. Frankly, I do not understand all the hype for this movie. Eisenberg was good at depicting a selfish and antipathic protagonist, that's true. The music was good. However, the story was so annoying that I think they put Justin Timberlake and party scenes in the second part of the movie on purpose - Facebook was founded and there was nothing more to say, so Fincher had to lighten things up."
    },
    {
      "rating": "6",
      "text": "One of the most important stories of our time to be told. It's told well, for the most part. However, the film is largely bland. The Social Network should not only be exciting but a riveting look at our journey into the future. I didn't get that."
    },
    {
      "rating": "4",
      "text": "The premise of how Facebook was invented is interesting and the performances are good but the film feels long after about and hour and a half due to its pacing. I think I now know why it was only £3 when ii bought it."
    },
    {
      "rating": "4",
      "text": "The story of facebook is apparently riveting enough to into a film, big mistake. The story is told through flashbacks from courtroom tribunals between Zuckerberg and the people he has managed to wrong. This is confusing as it switches from one law suit to another without giving any idea of which came first. Add to this one is abruptly dropped from the film and focus is centered on the other I began to wonder why not focus on one in the first place. One of my biggest problems with the film was Jessie Eisenberg and writer Aaron Sorkins Portrayal of Mark Zuckerberg. As one character puts it \"you're not an  but your trying very hard to be one.\" This is the perfect description of the character, who is completely unlikeable with his rambling monologues and irritating behavior. The rest of the cast too is unbearable and i would struggle to find I a character Iiked. The direction too leaves a lot to be desired as director David Fincher struggles at making one scene different from another as all anyone seems to be doing is sitting at a computer. The film seems to require a degree in computer programing as the character spew technical lingo constantly, helping add to the difficulty following the plot. Add to this a terrible ending and you would think this was the worst film ever, however for some reason the film was one I couldn't stop watching for some reason.\rRating 4 out of 10\rMuch like facebook this film is a waste of time that you can't stop looking at"
    },
    {
      "rating": "9",
      "text": "The Social Network is a brilliant biographical drama. It's based on the true story of Mark Zuckerberg and the creation of Facebook (which you may have heard of), and the tensions which arise amongst the people around him as a result of the site's creation. If you're looking for a historically accurate depiction of Facebook's creation, you may want to look elsewhere. The facts surrounding the creation of Facebook were heavily distorted in order to create a compelling screenplay ('Erica Albright', the girl who inspires Zuckerberg to create Facemash at the beginning of the movie, doesn't even exist in real life). Nevertheless, the distortion of facts can be overlooked in this case, as the screenplay will still keep you hooked from beginning to end. There are no glaring weaknesses in any other area of this movie. Fincher's direction is simply outstanding. The score is fits the movie well.  Almost every character is perfectly cast, including Eisenberg as Zuckerberg, Andrew Garfield as Eduardo Saverin, and even Justin Timberlake as the pretentious Sean Parker. If you're looking for a fully accurate storyline, then The Social Network may not be the movie for you. Even so, I'd still recommend it to anyone who enjoys good movies."
    },
    {
      "rating": "10",
      "text": "David Fincher's \"The Social Network\" is a film that plunges you right into your own self-consciousness without you even realizing it. The film is a technical masterpiece on every level and is so rewatchable that it delightfully seizes your attention from the moment the first scene comes into focus. The \"Social Network\" is a movie that thrives on the beauty of each scene and how they are masterfully edited together to provide a piece of art that fits together like it's the world's most satisfying puzzle. The movie begins with a simple scene between Mark Zuckeberg, played masterfully by Jesse Eisenberg, and his fictional girlfriend Erica Albright, played by Rooney Mara. The beauty of this scene is how naturally it sets the tone for the movie, the motives of the main character, and how the music score is attention demanding as it is in every scene in this movie. This scene shows us that Mark is a man that desires social respect from people over anything else. The opening bar scene between him and Erica displays how he thinks intellectual achievements should lead him to all what he thinks will bring him a most fulfilling life: fame and success. The \"Social Network\" shows how this ideology can lead to us losing our closest friends in the vast and complicated web that the social experience can be. The movie gets its heart from the character Eduardo Savron played by Andrew Garfield. Garfield's emotional portrayal of this character is so gripping and relatable that it now seems like a crime that his performance was not met with an Academy Award for best Supporting Actor. The back and forth dialogue between Eduardo and Mark are some of the best parts of the movie. These scenes not only show the brilliance of the screenplay written by Aaron Sorkin, but also the Oscar level performances given by Eisenberg and Garfield. The performances in this movie don't stop there, though, since both Hammer and Timberlake give very solid performances as the Winklevoss twins and Sean Parker respectively. The Winklevoss twins symbolize the privilege and status the Mark wishes he had while Sean Parker symbolizes the attitude that Mark believes he needs to have to get there. These characters are pivotal to developing Mark's journey for why and how he soon becomes the youngest billionaire in the world. What makes the \"Social Network\" truly special is how it takes such a simple story and turns it into must watch cinema. The score is consistently blood pumping and masterful throughout the entire movie. This fast paced score, combined with the rapid editing and dialogue take a simple story and make it a heart pumping story of the societal pressures of being \"cool\". \"The Social Network\" is David Fincher's first masterpiece and it relies on his direction. The direction he takes with this story combined with the master class technical aspects make this movie one of the best pieces of cinema the 21st century has seen."
    },
    {
      "rating": "10",
      "text": "The movie was brilliant. Just bloody brilliant. Everything was well-made and amazing. I think this is a true masterpiece. Definitely the best movie in 2010."
    },
    {
      "rating": "10",
      "text": "Eduardo Saverin: \"Sorry! My Prada's at the cleaners! Along with my hoodie and my **** you' flip-flops, you pretentious douchebag!\"The Social Network is DEFINITELY the best movie of the year about the substantial growth of the disreputable but well-off website, Facebook. Everything was magnificent, with the well-written screenplay of Sorkin and great direction of Fincher, its simply the best. People did give second opinions about this movie (being about facebook), but the Social Network is the complete opposite of what they thought.This film is set in 2003, about a Harvard sophomore named Mark Zuckerberg (Jesse Eisenberg), that comes up with an idea (while \"intoxicated\"). And creates a website that allows you to rate the hotness of girl in Harvard dorms, which reaches 200,000 views and brings it's attention to the Winklevoss twins. They meet up with Mark and tell their idea of making a social network, using \"Harvard.edu\". Thinking that he can do better, he meets up with his friend, Edwardo Saverin, and decides that they will make the website instead (splitting the share 30/70). when Facebook gets around, Sean Parker (Justin Timberlake), creator of napster, wants to get in with the project, and gets a warm welcome from everyone except Saverin.//I don't want to tell you the whole movie (even though you probably already know), so I think I'll stop there. The Social Network was directed by the one and only, David Fincher (Zodiac, Fight Club, Se7en, and more), and is his absolute best work. The best acting would have to be tied with Jesse Eisenberg and Andrew Garfeild, showing their best support for a movie. I wasn't surprised when I found out that Peter Travers (Rolling Stone) said that this was the best of the year, and it should of won the Grammy, instead of Kings Speech. But it did win the Grammy for best soundtrack by Trent Reznor and Atticus Ross, for film editing by Angus Wall and Kirk Baxter, and for the adapted screenplay (of course) by Andy Sorkin.In the two-disc collectors edition, it shows Fincher's distinctive technique in film making. shooting the first scene for ninety-nine times, David's patient directing tries to make this movie be perfect as possible, and of course, is successful. Fincher and Cronenweth made a great choice using the best High Def quality so far, by RED Digital Cinema. It interests me a lot that almost every known movie coming out recently, is being filmed in RED. I looked it up and most of the products they sell is well-over 20,000 dollars (must be really good). They're using it again while they reunite to work with a new remake of \"The Girl With the Dragon Tattoo\", which I have high hopes for.Andy Sorkin's adapted screenplay is one of the most intelligent and skilled I have seen so far. nonetheless the screenplay being so complex, it must of been complicated for the editors (Angus Wall and Kirk Baxter). But by cutting all the camera angles and showing everybody have their spotlight, they succeed and win an Oscar for their tremendous support. The costume design was nothing special, but is will put into, wearing the same clothing that they wore in real life (not exactly). You can never get enough of The Social Network, watching it the thousandth time still gives me the same satisfaction as the the first time, if not more. You can't miss a second of this movie! if you love this film as much as me, buy the two-disc collectors edition, because who wouldn't love over two hours of special features. Eduardo Saverin: \"You better lawyer up **** because I'm not coming back for 30%, I'm coming back for EVERYTHING.\""
    },
    {
      "rating": "10",
      "text": "The best film of 2010 so far. Sorkin's dialogue is terrific and pretty hilarious, and Fincher directs with such clarity so that we are never confused as to what's going on even as the film jumps in and out of flashbacks, often for comic effect. The ending is surprisingly emotional, and it's easy the Shakespearean style tragedy installed in Eisenberg's Zuckerberg. Eisenberg and Timberlake both deserve Oscar nominations, and it's almost assured that you will hear this film's name multiple times when the award nominations come rolling around in early 2011. Go see this film whether you have a Facebook or not; it's that exciting and terrific."
    },
    {
      "rating": "5",
      "text": "Technically well-made but shallow and unsatisfying. Fincher's flashback storytelling didn't make me feel like I was getting different perspectives and narrative layers. Rather, I felt like I was watching an intervention where everyone else could freely speak except the very person at the centre of the screen. Instead of a balanced, well-rounded portrayal of the facts, the filmmakers dramatised the whiny testimonies of scorned 'victims' to depict a character so contorted and contrived he didn't look like a real human being. Someone as aware of his brilliance as the on-screen Mark Zuckerberg wouldn't feel insecure enough to crave acceptance into a final club. His natural genius would set him apart enough and he wouldn't waste time garnering adulation from less intelligent people to affirm that. The movie depicts the cinematic Mark Zuckerberg being so engrossed in creating revolutionary projects that he pays very little attention to social conventions and appearance. Yet the same acutely logical person wastes a chunk of the movie being envious that his friend Eduardo is more 'popular'. To create a Shakespearean-like tragedy, Aaron Sorkin afflicted the protagonist with various 'fatal flaws' to amplify conflict. Facts were twisted to fit into the salacious story the filmmakers wanted to tell. Real people were twisted to fit into the salacious characters the filmmakers wanted to show. The movie was nowhere as clever as it thought it was and by the end of the first scene you knew exactly what it was trying to say ('social misfit invents new way to socialise'). It's as if the filmmakers started the film with that message and then worked backwards, fitting real life people and events around that theme rather than use the truth.  At its worst, TSN was slanderous non-fiction masquerading as entertainment. At its best, it was entertaining fiction masquerading as fact....Either way for me it didn't live up to its hype."
    },
    {
      "rating": "6",
      "text": "Fincher and Sorkin's take on the creation of Facebook and the man behind it is cold, lean and ruthless in it's depiction of  how narcissism is a driving force for those who achieve the greatest success.  The performances are all strong and the movie never gives in to any cheap story-telling ploys, but ultimately it is easier to admire than to love."
    },
    {
      "rating": "6",
      "text": "This was a very entertaining film and I did not come out regretting I spent my money on the ticket. That being said I think this movie is incredibly overrated. I do not understand what people saw that make them say this is one of the best movies in recent history, I think that might have to do with how bad most of the current movies have been for a few years. I recommend you skip past the hype and go see it with reasonable expectations and in the end you will find yourself enjoying a \"decent\" film."
    },
    {
      "rating": "4",
      "text": "One dimensional, uninteresting characters with no redeeming qualities.  I didn't care what happened to any of them.  I've liked most of David Fincher's movies, but this one lacked heart and depth.  Too much of the movie was spent explaining.  Show me don't tell me."
    },
    {
      "rating": "10",
      "text": "The Social Network brings unforgettable performances, along with its fantastic screenplay, a great entertaining story make for a complete masterpiece. And the one behind it all is David Fincher well done. I give this movie 97%."
    },
    {
      "rating": "5",
      "text": "The social network is an alright movie. The star of the film, Jesse Eisenberg, did great acting on the creator of Facebook. But when I watched the film, the movie was just fast talking. It was like I was watching Gilmore Girls but with smart guys in it. This repetitive fast talking got annoying and sometimes I didn't even know what the main characters were saying. If you're a fan of Facebook, then you will love this movie. But otherwise, just skip this movie and watch something else that Jesse Eisenberg did such as Zombieland or Cursed."
    },
    {
      "rating": "6",
      "text": "I felt that this movie needs an artist's statement: it certainly makes one feel guilty to be a Facebook user, perhaps that was its intent. At any rate, I couldn't shake the feeling that I was being scolded while watching this movie. The delivery was somewhat abrasive, and while it was fascinating to watch the development of the phenomenon at the root of the story, none of the characters interested me at all. Still, a fantastic ending."
    },
    {
      "rating": "1",
      "text": "Not a very amusing movie with alot of fun in it.. Soundtrack is cool. This movie is based on the social network called Facebook... It maybe a true story but i find it dumb.. Going as far as going to book would have maybe been better cause its nothing huge.. its no big famous movie. In fact, its boring. 1/10 since the soundtrack is good."
    },
    {
      "rating": "5",
      "text": "The movies worth watching, and the main actor does a great job being annoying! I guess that is the goal so points to him, but overall not my type of movie. This is a movie you see just so you don`t wonder if your missing out on something."
    },
    {
      "rating": "5",
      "text": "There's some good in it - it shows Ivy League and high tech venture cap in a stylish way that makes them look not so great. Every character sort of sucks - you sort of wish they could all loose. So watch it or don't - it really doesn't matter. Two hours spent on Facebook will probably be more entertaining."
    },
    {
      "rating": "10",
      "text": "完美的传记片，没有任何瑕疵，它从各个方面都是最好的，而且充满了一种酷和科技感，精彩的剧本和台词，故事剧情赞，配乐超级好听，剪辑摄影赞，场景设计赞，艾森伯格演技激赞，本片可以用任何赞美之词来描述。"
    },
    {
      "rating": "5",
      "text": "Maybe not understanding all the programming and math involved in the technical side of the project makes me feel like an idiot? I have no idea what any of equations or algorithms mean, or how to write script.\rMaybe I’m a little jealous because I never got to go to college parties as glamorous as the ones in this film?\rOr maybe the problem is that the subject matter it just so banal that despite the quality of the production, this film is lost on me?\rI have a problem with this film that is so full of maybes. And yet for all its weaknesses, it won three Oscars, albeit one of them was for Baxter and Wall's editing, which is superb. Both editors have worked on numerous Fincher productions.\r None of the actors are convincing at portraying the real people they are supposed represent. Maybe that’s the point? They are attempting to play versions of Zuckerberg and Co. that seem more interesting than the real, live versions.\rI guess I see the reasoning behind this. As activities, creating companies, programming computers, or writing software, no matter how profound, aren’t exactly as riveting as invading Bin Laden’s compound, or smuggling blood diamonds out of Liberia.\rStill, I am no fan of Jesse Eisenberg. His success is baffling to me. He was for a while a Michael Cera impersonation gone wrong, now, whatever he is, he does it well. He sells tons of tickets…but none of them are to me.\rThe best part about this film is that it has Rooney Mara, briefly. Later she becomes Lisbeth in Dragon Tattoo.\r The most interesting thing about this film is simply that it exists and was so successful. Rather, that a production company actually paid David Fincher to try and create a full-on thriller packed with betraying, greedy, snarky little boys either getting their way, or losing millions of dollars. Poor babies.\rEven if in the end Zuckerberg did create something monumental, so what. It's just a monument to a monument. What does any of this represent? How does any of this change the world?\rIt’s not like Facebook has cured any sick people or stopped any wars. It’s arguably even created a recent few (of both)."
    },
    {
      "rating": "10",
      "text": "The Social Network perfectly explains about controversial-but-legendary website Facebook, which has\rforever changed the way of online communication. Handled by perfect pacing, perfect writing by Sorkin, perfect direction by Fincher, perfect performances by Jesse Eisenberg and Andrew Garfield, perfect editing, and a perfect sight of its music score, The Social Network carefully explains about how its website manages to overcome all the controversy that surrounds it, and changed into something big  bigger than its features  and I can't clearly explain how. It also provides a determined connection to its flawed protagonists, who has worked hard to execute this ultimate plan. Yet, also, it comes clear to us, that their flaws would never possibly go away. Instead, they improve that to Facebook's strength and hopes that it will help. That is the film's magic: It makes us believe. The Social Network is one of those movies that you'll be begging to talk about for a long time, and it proves no way to deny that."
    },
    {
      "rating": "10",
      "text": "I know this is really good because I am still mesmerized every time I come across it.  \"I'm just gonna watch this one scene and then I'm going to get back to my life\" and an hour later I'm finishing the movie again.  It immediately draws me in and I can't look away.  I don't care if it's accurate or not, it's entertaining."
    },
    {
      "rating": "10",
      "text": "The Social Network opens with an extremely strong scene that establishes Mark Zuckerburg as a genius and somewhat of an **** while also introducing one of the major components of the movie–crew, or rather the twins that rowed it. We are also introduced to Mark's other lawsuit with his best friend Eduardo when he obsesses over final clubs, one of which Eduardo actually became a member of.\r Mark's potential as a computer geek and as a successful person in general is really shown from the beginning with facesmash and the capability to really shut down Harvard's whole network. He does get hated but also gets found through this website. Women (understandably) are angry with him, yet he comes up with this amazing idea with the help of these twins. I was also particularly struck by his lack of interest with money. He had his own startups in high school, yet he \"didn't sell it, uploaded it for free.\" Seems like someone who's just so enamored by these ideas that nothing on the business side even comes to mind for him. That's Eduardo's place.\r It also doesn't even seem to occur to Mark that he might get in trouble for his actions. Does he even have consequences? Mark Zuckerburg is a very flawed protagonist. The truth is that he's just a real human being and we see the many sides of him and the many sides of the story. I couldn't fully sympathize with Mark because of the way he did act to certain people, yet I would find myself not sure if I was cheering for him or not because I truly understood each argument that the others were making. \"If you guys were the inventors of Facebook, you'd have invented Facebook.\" Very true – Harvard Connection really was not the same thing and there was much gray area involved.\r One thing that bothered me though was the way those two girls were introduced that Mark and Eduaro hooked up with, and Eduardo began dating Christy. But they treated them as if they were intellectually incapable yet they both attended Harvard. I sensed a thread of misogyny throughout that is unfortunately a part of the technology industry. (Again, this is something I would love to try to change in my life.) The movie had really unique ways to introduce new topics in a seamless fashion. One that I noticed the most was how we saw Sean Parker–the founder of Napster–and realized who he was just how that girl did. We really saw Facebook evolve as a company as the movie went on.\r Something that really struck me was how this was a \"once in a generation idea\" which is actually probably true. Facebook has been so revolutionary in my life. I grew up before Facebook and it wasn't until my later years in school that this was really a thing so it's been amazing to see the exponential growth in social media, honestly instigated a lot by the success of this one website. Love it or hate it, it's revolutionary.\r We ultimately see three people screwed out of this company and its fortune, all thanks to Mark Zuckerburg. They receive their settlements and life goes on, but I guess this level of success can't happen without such events as the damages that Mark did to his only real friendship here. \"You're not an **** Mark. You're just trying so hard to be.\" -Marilyn Delpy (Rashida Jones) Now Mark Zuckerburg is the youngest billionaire in the world and no one can say that the things he did in this movie were not worth it for where he's at today, with over 1.4 billion users."
    },
    {
      "rating": "3",
      "text": "Bad acting a bad script turned it off after half an hour absolute bore fest."
    },
    {
      "rating": "10",
      "text": "Great direction and cinematography, with a great screenplay, this film is definitely going to be in the Oscar race. All of the actors are great and despite the somewhat exaggerated party scenes, this movie feels very realistic. Just because it's a movie about Facebook, doesn't mean its corny or aimed only at young people. You should see this film no matter how old you are, even if you don't use Facebook. Overall a 10/10 and the second best movie of the year after Inception."
    },
    {
      "rating": "8",
      "text": "Although the movie starts as where you would expect and end as you would expect, David Fincher's \"The Social Network\" is heart warm and powerful, a perfect combination of Aaron Sorkin's witty script and David Fincher's smart direction. And yes, it is one of Oscar winning movies of the year."
    },
    {
      "rating": "10",
      "text": "This movie was amazing. It's incredibly well acted and written. It gets branded as the socially awkward nerd movie (and being one probably helps) but it's really about all of Gen Y. If you missed it when it was in theaters you need to see it."
    },
    {
      "rating": "9",
      "text": "The accuracy of this film to true events is a matter I have heard being discussed lately but also one I deliberately chose to ignore.  I accepted this film for what it is: verisimilitude, somewhere in between fiction and non-fiction.  What we are left with is a captivating story with substantial characters and engrossing on-screen interrelationships.  A scene which really made in impact on me is the opening scene with Jesse Eisenberg's and Rooney Mara's characters.  Jesse Eisenberg's dialog immediately shows him to be an intelligent but socially inept person perfectly introducing him as a questionable character.  Questionable because throughout the movie I was asking myself: is he arrogant or ignorant?  Is he really the anti-hero or is he easily led, unaware of the emotions of others?  The sequence of events is sometimes non-linear, especially so in the beginning section but I found interpreting the different scenes involved me actively in the movie and was refreshing.This was a movie about a phenomena that has touched every one of us (even those who don't have Facebook know what it is!) and, even though some may debate about whether it really tells the tale, it was a brilliant movie, entertaining and inspiring."
    },
    {
      "rating": "8",
      "text": "I'm not sure whether it was too much hype, or that massive 97 on Metacritic, but this movie simply didn't live up to my expectations.  It was NEARLY as good as Pulp Fiction, or The Hurt Locker, or Shawshank, or other seminal movies that defined the last decade or so. It was a really good story, and it brought me in, but it lacked a little something. At the end of the film, I just wanted \"more.\" Rooney Mara is awesome, and I look forward to seeing her in Dragon Tattoo, and the \"twins\" are hilarious. Timberlake was hyped too much - he was just serviceable. See it, but moderate your expectations, people."
    },
    {
      "rating": "4",
      "text": "Disappointing, given the talent of Aaron Sorkin.   I'm happy to enjoy movies based on the work of a Broadway playwright, even if the effect is one of staginess.  But having your central character remain a cipher is always a dangerous strategy.  Jesse Eisenberg does a great job of trying to fill in the blanks of Mark Zuckerberg, as written, and he deserves high praise.  Of course, Sorkin and Fincher may have been constrained by legal injuctions, so MZ had to be a cardboard character.  A workaround was to create the two best female parts in the story as bookends: the girlfriend in the first scene (who sees into his soul) and the second chair attorney at the deposition (who sees even deeper) in the final scene.  Smart choices, here, Mr. Sorkin.  But the movie ended and I felt the Zuckerberg character had never arrived."
    },
    {
      "rating": "10",
      "text": "Wow! What a film. My favourite since Avatar. Eissenberg is great, and Andrew Garfield is also great as Eduardo. I would recommend it to anyone. A must see!"
    },
    {
      "rating": "10",
      "text": "Top 10 Movies of all time. The movie of how facebook was created. Its a classic. Loved the plot. i loved every thing on here this a very classical movie a one u wont regret"
    },
    {
      "rating": "5",
      "text": "The reviews seem as inflated as Harvard's grade scale itself. I watched the movie and found nothing enlightening or groundbreaking about it. Though, I can see how adults and older reviews may have found it \"amazing\" due to the novelty of the subject (facebook)."
    },
    {
      "rating": "9",
      "text": "The Social Network is not simply a movie, but an experience of eclectic elements of great movie-making. Director Dave Fincher and writer Aaron Sorkin's depiction of the roots of social networking site Facebook is an engrossing film that not only defines the current technology-based generation, but sets film standards of brilliant writing and film structure.Fincher and Sorkin's film tells the fascinating story of Mark Zuckenburg and how he made a small idea into the billion dollar corporation Facebook. The story is shown through flashbacks and flash-forwards, simultaneously addressing the lawsuits made towards Zuckenburg, and the dark and gritty story of the formation of Facebook. While the accusations of Zuckenburg's thievery of intellectual property are in tact, many of the film's details are debatable.The incertitude of Zuckerburg's story is what makes this film works.  Portrayed by Jesse Eisenberg, Mark Zuckerburg's ambiguous character is the film's focus and what makes it so appealing. Is Zuckburg driven by the rejection of his girlfriend (Rooney Mara), or is it superficially the thought of money? The character's innocent and snooty manner is a mystery that establishes this film.  Eisenberg gives the performance of his life as he puts so much depth in the character and raises so many questions.Supporting Eisenberg is Andrew Garfield, who I once again have to give praise.  After seeing a powerful performance from Garfield in Never Let Me Go, his role as Zuckerburg's co-founder really shows his ability to take on diverse roles.  Garfield gives an accurate portrayal of a deceived friend, and the subtlety that he puts into his performance is mesmerizing.What gives the characters this type of depth is Aaron Sorkin's Oscar-worthy screenplay.  I cannot recall a film with this much witty and movie-driving dialogue.  I can not emphasize the film's screenplay brilliance, it really gives the film reality, depth, and entertainment value. Resulting from the script, the plot is fast-paced and addicting; It keeps the audience curious and occupied for the whole movie.  But while the plot and script are almost perfect, there is an absence of a big moment.  The movie is no doubt intense, but there are no moments that standout from the overall film; There is no buildup of emotions in a single scene, something I believe a perfect film should have.The Social Network is a movie that many will look back as a defining 21st century work of art.  Overall, Fincher's film is modern, provocative, and technically flawless. The Oscar race has started, and the writing in The Social Network will be hard to beat."
    },
    {
      "rating": "9",
      "text": "David FIncher is back to being Fincherian after his sappy Benjamin Button (thanks to a Sorkin script, too!).  Any film which opens with The White Stripes am be good."
    },
    {
      "rating": "10",
      "text": "The film's premise as a movie about the world's most popular social networking site can quickly leave many people astray. But it just comes to show that writing about a website, something that hasn't really been done before, can actually become one of the most dramatic, funniest, and intelligent stories ever told. David Fincher takes the rising star Jesse Eisenberg, and the platinum selling artist Justin Timberlake, a team of not well known actors, and an intelligent script. What does this equal? Ultimate Perfection. The script is what drives this film into the best movie of the year, with the cast as a bonus. David Fincher keeps all the drama extremely factual. It takes you on a journey from Facebook's roots, to what it's become today. Mark Zuckerberg is shown as the #1 betraying asset in this film. By the end, it's not clear whether you should feel sorry for Zuckerberg, or forget him and just admire his interactive creation which 500 million people use on a regular basis."
    },
    {
      "rating": "10",
      "text": "The social newtwork is without a doubt the best movie i have ever seen in my whole life. Eisenberg has an oscar winning performance, justin timberlake is fantastic, and the overall movie is by far the best movie of the year"
    },
    {
      "rating": "0",
      "text": "Don't believe the hype. This movie is a dreadful bore with unlikeable characters. Really annoying and pointless movie. Its only rated so high because of the 500 Millions users on Facebook who decided to see it."
    },
    {
      "rating": "5",
      "text": "I didn't really like it. I didn't catch a lot of it. I would have to watch it again. It seemed to business like. But like I said. I would have to watch it again to see if I really liked it 5/10"
    },
    {
      "rating": "1",
      "text": "This movie is a total rubbish, very boring. Honestly, all those reviews must be some scam. It's just as somebody mentioned here: rich kids blablabla on how much more money they want. Bad acting, plot was not interesting at all. Don't waste the money for this."
    },
    {
      "rating": "5",
      "text": "This movie was interesting, but it wasn't even one tenth as good as \"The Town\" was. Sorry, but the 9.0 score is over done in my book (I thought it was an average)."
    }
  ]
}