{"id": 4829, "title": "The Last King of Scotland", "starring": ["Forest Whitaker", "James McAvoy"], "runtime": 123, "genre": ["Drama"], "description": "Young Scottish doctor, Nicholas Garrigan decides it's time for an adventure after he finishes his formal education, so he decides to try his luck in Uganda, and arrives during the downfall of President Obote. General Idi Amin comes to power and asks Garrigan to become his personal doctor.", "releaseYear": "2006", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mTtgpH6UnHUtD8moRJUzfGLOZTj.jpg", "categories": {"plot": 6.705882352941177, "acting": 7.659090909090909, "ending": 9.0, "soundtrack": 6.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 2.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "Highly rewarding drama with terrific performances."}, {"rating": "2", "text": "While Idi Amen degraded to the status of Dictator and maniacal murderer, this movie did little to establish the foundation for his rise to power. Many historically infamous individuals begin humbly and rise to rule, based upon their accurate sense of what their people desire. Idi Amen was such a person. He was a 9-time heavyweight boxing champion and sargeant in the British military, who won the support and sponsorship of the British leadership. Being an African, one can easily conclude that this support was based, to some degree, on an enormous charisma and aptitude. While his political career was rife with abuse and tyrrany, it would have been appropriate to show some of the character he had to exhibit in order to command such broad based support, both from his own people, as well as the British government. Instead, the movie brings us into the latter years of an administration and personality gone off track and tending towards the manic. This may well be true, but no dictator has ruled that has not first been given permission. In addition, the rise of the young Scottish docctor seems utterly inappropriate, given Idi Amen's proven ability to win the favor of nations and people. A person of his considerable and terrible ability would not have been as easily trusting as the Idi Amen characterized in the film. Quite honestly, he had too much personal capital at stake to entrust it to someone with so little wit or wisdom. It is believed his true mentor was a member of the British Secret Service...this makes sense. Finally, the films portrayal of the African woman was utterly disgusting. I absolutely do not believe that women oppressed as they are by their muslim traditions and/or tribal rituals, would be so easily bedded. If this is the case for the average African woman, how much more applicable to the wife of the President, a dictator, a murderer. For if she did not fear him for her own life, she would have certainly feared him for the life of her son. There is no way any reasonable mother would enter so lightly into a situation that had such daunting implications. That this film would ask us to accept such a scenario is a disgrace to every mother of African decent, down to Margaret Garner, who attempted to kill her own children vs. see them sold into slavery. This portryal is a betrayal of the truth. I am disappointed that in 2007, we still have little tolerance for the truth regarding people of color. We are not beasts with passions like unto animals in heat or enraged, but a complex, human creation...sometimes touching the heavens and othertimes at the very gates of hell, but nonetheless human like unto all."}, {"rating": "5", "text": "My main gripe with this film is that the true events it is inspired by are so few and far between that this story may as well have just been a complete work of fiction. I do not dispute that Africa has an ugly history, but I object to the fact that the TRUE history is not shown... so many people base their opinions on world events on movies, so surely it makes sense to allow people to base their opinions on the truth, particularly if a movie is going to claim it is \"based on true events\"? Beyond that, the acting was of a high quality - apart from the accents of the American actors purporting to be African. Personally, I found Blood Diamond more memorable."}, {"rating": "9", "text": "Wonderful performance by Forest....really keeps you on the edge of your seat."}, {"rating": "10", "text": "An outstanding film in every respect. Coming out of this film tonight, I can't think of anyone playing the role of Amin except maybe Yaphet Kotto, but he's probably a little too old for the role. Unbelievable color in this film. It seduces you like the doctor is seduced by the situation, and it horrifies you in a similar way. I haven't had a visceral reaction to a film in quite the same way in a LONG time. Tremendous acting. A film which can't be ignored come Oscar time. On second thought. Screw the Oscars. The Academy couldn't tell acting talent from a hole in the wall. Just see the film."}, {"rating": "10", "text": "Forest Whitaker shows us the performance of a lifetime. He frightenly represents Idi Amin in a way never shown before, his ellegance enlightened, his personality drawn out in its own beauty, and a leader represented well. James McAvoy also brings us a great performance, he is drawn into a power he never asked for and his relationship to Whitaker is that of no other. While this movie is based off facts, it still does not represent history as it could; this is Hollywood so it should be suspected."}, {"rating": "9", "text": "Amazing. Every single performance is superb; Forest Whitaker is electrifying. Tautly directed and edited, and the visuals are gorgeous. A harrowing experience."}, {"rating": "8", "text": "This is Uganda in the 1970s; it was never going to be pretty."}, {"rating": "6", "text": "My initial reaction to this movie was that I hated it. But once I got over the fact that Forest Whitaker is not the main character (despite all evidence in the previews), I decided it was actually a fairly powerful movie with some great acting. Whitaker was brilliant as always, though it was disappointing that he once again was cheated out of being the main character. The main character was a bit too much of a Romeo for my taste, and his quick ascension to \"bosom buddy\" status with a violent dictator was a bit hard to swallow. But the movie did present an interesting journey through McAvoy's character's mental/emotional struggles as he realized what Idi Amin was really all about. Worth seeing, just don't expect it to focus on Whitaker/Amin and you might enjoy it."}, {"rating": "10", "text": "Amazing film."}, {"rating": "8", "text": "Whitaker is great and deserves all the Oscar buzz being generated. The last 30 minutes can be a bit hard to watch and are fairly upsetting."}, {"rating": "10", "text": "A very captivating movie. One of the best I have seen in a long time. Forrest deserves an Oscar."}, {"rating": "9", "text": "Whitaker's performance is simply breathtaking. He doesn't just steal the show...he inhabits the screen and makes every second of his presence felt in a manner which can only be compared to the most powerful of film personas. What makes it all the more amazing is the fact that McAvoy almost matches him shot for shot. Almost...not quite though."}, {"rating": "10", "text": "I recommend this movie in a Double feature with Amazing Grace as a study of the paths that two different lives can take. This is the best movie I have seen in a very long time."}, {"rating": "4", "text": "As stated by others, this is a film about Africa made by white people for white people. The story is about the emotional and personal issues of a white protagonist. Whitaker does a great job with badly written script that has no character development. Besides, none of the true historical tragedies of Uganda are shown. They are touched upon with photos within the 'story' and a factoid before the credits. Just as the movie shows, white people really know how to mess stuff up."}, {"rating": "9", "text": "very unsettling movie mainly due to the excellent and chilling performance of idi amin as the brutal ugandan dictator. He is so good that you forget that this is a movie. It is almost as if youa re watching a documentary about Idi Amin shot with archive footage of Idi Amin."}, {"rating": "8", "text": "It is a movie of historical and fictional interaction that had ben made in a very good way. It does not meet the original novel but touches the life and gives an idea about the great problems of the 3rd world , the brutal dictators."}, {"rating": "4", "text": "Unfortunately, the film reminds me of Blood Diamond. As with that film, the makers of Last King let an seemly interesting story get overshadowed by the 'token' Caucasian protagonist and his story. That the Scottish doctor never historically existed is even more galling. The film teases you with hints at Idi Amin's colorful past and motivation, but never lets Forest Whitaker deviate the character from the cliche of the 'charismatic dictator' . Despite the constraints of the film, Whitaker gives a performance that rightly deserved the Oscar (which he gives in Ghost Dog and practically every other film he's been in). A wasted opportunity. Makes Hotel Rwanda look practically revolutionary."}, {"rating": "10", "text": "Strong (maybe too strong for some), but excellent film. While the characters may be a blend of many acutal people, the truth of the ruthlessness of Amin is not hyped or diminished. He was, as most dictators are, a horrible person who was very willing to kill to silence his detractors. When will we see a movie like this about Castro, Sadam, or Che Guevara?!"}, {"rating": "9", "text": "Forest and McAvoy both give stellar preformances in a brutal and real piece of film. True the film was subjected to some criticism, with all the praise focusing on Forest's brilliant interpretation of the infamous dictator but why did it take until now to recognise his brilliance?? People jumping on the bandwagon this year after ignoring Forest's splendid acting in Bird and Ghost Dog should try in future to recognise an actor's potential long before the critics stir up a whirlwind about a recent performance. The film contains some brilliantly worked scenes and the way the angles constantly vary allow us to look at the life of Idi Amin as both an insider and an outside observer. McAvoy does a fine job of portraying a difficult character but it is Whitaker's hypnotic screen presence as he shows us his ferocity and helplessness simultaneously, that makes the film masterful."}, {"rating": "10", "text": "I think this was a great movie,,, whether it be fact or fiction, it does depict the horror of indi amin's reighn of terror!!"}, {"rating": "3", "text": "If you are actually interested in 1970's Uganda, an infinitely better movie to watch is General Idi Amin Dada, a documentary by Barbet Schroeder. My problem with The Last King of Scotland is not so much having a white protagonist, nor making that protagonist privy, Zelig-like, to every major event during Amin's rule. Rather, its creating a fictitious figure at all, especially one, who, according to the narrative, played such a significant role in the narrated events. Really, see Schroeder's film and see Amin himself. He's much more gripping (and strange and terrifying) than Forrest Whitaker."}, {"rating": "10", "text": "How anyone can give this movie less than an 8 is beyond me. It's gripping and compelling. Forest Whitaker is amazing. It's ashame that cinema like this does not get more exposure in the United States. A true work of art. Go see it period."}, {"rating": "9", "text": "Forest Whitaker was amazing, but McAvoy's perfomance is outstanding as well. A lesser actor would have easily been eaten up by Whitaker's performance. McAvoy's Nicholas stands toe to toe with Whitaker's Amin which makes for a riveting story. I highly recommend this movie. I thought it was excellent!"}, {"rating": "7", "text": "When an actor takes on what is essentially a supporting role and makes such an indelible impression by stamping it with his own unique brilliant take on the material, no matter what else he ever does in his career, he will always be remembered for that single performance. Anthony Hopkins did just that in Silence of the Lambs and went on to win an Oscar for Best Actor and it looks like it'll happen again this year when Forest Whitaker walks away with the Best Actor Oscar for his mesmerizing performance as Idi Amin in The Last King of Scotland! To critique the rest of the movie, which is really about James McAvoy as a doctor who wins the facvor of Amin, is not even needed because the only thing is the astonishing, once in a lifetime performance of Mr. Whitaker, an actor who has been simmering right below the boiling point for many years now and as Idi Amin, he finally explodes!! A 100 years - 100 performances lock!"}, {"rating": "8", "text": "Great performance by Forrest Whitaker. Definitely Oscar worthy. James McAvoy is also very good in a role that makes you hate him and feel sorry for him at the same time."}, {"rating": "6", "text": "A very flawed movie, as other \"user reviews\" have noted here. Not sure if it wants to be a docu-drama, a character study or just more Hollywood drivel. I actually feel badly for McAvoy -- a strong actor thrown into a pretty unsympathetic role; he serves mainly as a plot device, the white do-gooder thrust into another culture, which tests him and finds him very lacking. Saved primarily by Whittaker's strong performance and some excellent scenes & accompanying sountrack. This movie could have been so much more, so much better."}, {"rating": "8", "text": "Forest Whitaker IS Edi Amin....he so deserved the Oscar!!"}, {"rating": "9", "text": "This movie far surpassed what I thought it would be. I came across it on HBO, after not hearing much about it, and settled in to fall asleep. NO SLEEPING HERE. Forest Whitaker and James McAvoy were great! There was loads of drama- sexual scandals, abuse, mass killings, love, COMEDY... it was great. No wonder Ol' Forest took home the Oscar!"}, {"rating": "10", "text": "A masterpiece portraying the dictator Amin's character and his cruel and barbaric regime in Uganda, Africa. Forest Whitaker was incredibly good in this drama and got Oscar."}, {"rating": "7", "text": "The acting was awesome, but the movie could have used a little bit more direction/meaning as a whole."}, {"rating": "10", "text": "This movie blew me away. This a true story, and it really struck a chord with me how this one no-name doctor becomes involved in such an involved scene 10/10 This movie is one of the best of all time"}, {"rating": "8", "text": "Forest Whitaker inhabits the heartless monster of Idi Amin, Uganda"}, {"rating": "9", "text": "The un-until-now-highly-underrated Forrest Whitaker is brilliant in this. As Amin manages to swing from charming and almost jovial to a cold, heartless dictator. Idi Amin is rather underrespresented as far as evil dictators go but this was an unforgettable film. McAvoy makes us care about a rather selfish, materialistic young character. Even if you are unfamiliar with the situation in 70s Uganda this will be a film which stays with you for a long time. Now for a bit of a whinge. I wish people wouldn't suggest it's not a good film because it's told from a white man's point of view, it was Forrest Whitaker who won the Oscar and BAFTA not James McAvoy (although I think he deserved the Best Supporting Actor BAFTA). I do feel the need to point out also that the Last King of Scotland is rated 15, but if you have kids around 15 I wouldn't let them watch it if I were you, there are images of a graphic mutliation and a torture scene."}, {"rating": "10", "text": "An awesome movie, and a true epic. Defintely one to see again, and very informative also. Forest Whitaker is an amazing actor in this movie. 10/10 without a doubt."}, {"rating": "10", "text": "Forget the hype of box office hits. If you want to see superb acting, from a true actor, who takes his role seriously and makes you feel like you are not watching a movie, but a re-enactment; go see Last King of Scotland. This film is for grown folks, who understand the issues and stereotypes surrounding, race, power, politics, and economics. See a good movie this year, I implore you, you will not leave the theatre untouched, can guarantee it."}, {"rating": "9", "text": "Forest Whitaker is amazing, so too James McAvoy. The movie is very involving and unsettling. My only complaint is a few action scenes and graphic shots which I thought unneccesary- the threat and the violence implied through the acting was enough. Nice cinematography."}, {"rating": "8", "text": "McAvoy seems too young to be convincing in this role. But the concept is clever and Whitaker is excellent. Gillian Anderson looks really good in this movie and she played the symbolic voice of reason very well."}, {"rating": "9", "text": "Ya gotta LOVE the chilling performance by Whittaker!"}, {"rating": "10", "text": "Whitaker will be nominated for an Acadamy Award for an incredible portrayal of Edi Amin. A lot of history you might not be totally familiar with and you will enjoy learning about. Not to be seen by those who are squeamish."}, {"rating": "6", "text": "This movie is good, but its not great. I wish there was more focus upon the actual events and genocide occurring in Uganda, rather than upon the relationship between Amin and the Scot. [***SPOILERS***] There were random unnecessary parties and sex scenes which did not add to the picture, but rather detracted from the director's credibility. Also, there was random rock guitar music during some tense moments which was completely off. The best part of this movie was Whitaker"}, {"rating": "10", "text": "Forest Whitaker, uncorking the power that he usually holds in check, gives a chilling, bravura performance as Ugandan tyrant Idi Amin, whose bloody regime slaughtered more than 300,000 people. This intelligent, sometimes gruesome thriller is based on a novel by Giles Foden. The film is phenomenally well directed by Kevin Macdonald and edited by Justine Wright to bring out every bit of scary volatility in the most casual interactions."}, {"rating": "10", "text": "Drawing on a documentary visual style he deftly employed in \"One Day in September\" and \"Touching the Void,\" director Kevin Macdonald uses McAvoy's boyishness to treat Garrigan's apolitical foolishness as yet another damn mess in one African country's hell. The Last King of Scotland is a parable shocking in its truth, jolting in its lack of sentimentality, Shakespearean in its vision of the doctor's catastrophic flaw. Possibly one of the best movies of the last 10 years. A unforgettable Oscar performance."}, {"rating": "9", "text": "Beautifully shot, utterly gripping. Forest Whitaker gives an outstanding performance as the psychotic Amin."}, {"rating": "10", "text": "If not the best preformence by a male actor of all time, close to it. I have never seen an actor invest more in a role or capture the real internal motivations of his character. Brilliant!"}, {"rating": "9", "text": "For me, the most intriguing aspect of \"The Last King of Scotland\" is the tantalizing possibility that Leni Riefenstahl was telling the truth. Even though \"Triumph of the Will\" implicates her as a Nazi sympathizer by what's judiciously omitted from the crowd-inciting speeches; Nicholas(James McAvoy) amazingly has no idea about the Ugandian holocaust. \"The Last King of Scotland\" has an ingenious way of treating McAvoy's relationship with Idi Amin as a pleasant nostalgic trip, because the young doctor was indeed enamored with the vicious, but charismatic dictator. If this adaptation is accurate, the real-life McAvoy must be plagued with some residual affection for Amin. Forrest Whitaker does an awesome job of being genuinely congenial without any undercurrent of menace; to do so would make a contemporary audience wonder why the world wasn't onto Amin's act a lot sooner. This is a powerful, and very smartly photographed film."}, {"rating": "10", "text": "Stunning performances, extremely well shot and great music, for a full tension film that will get you pinned to your seat. Awesome!"}, {"rating": "8", "text": "It's the realistic and totally believable performance of Forest Whitaker that pulls this movie through. The Last King of Scotland brings us to Idi Amin's world and the life changing story of a man that finds his original intentions turned upside down through unforeseen circumstances. This movie is as much fiction as it is a movie that brings awareness to an important time in history."}, {"rating": "9", "text": "This is an unvarnished study of a naive empty vessel of a young man without direction. Fresh out of medical school, he knows only that he doesn't want to live under his father's direction. As a result he finds himself living under the direction of the catastrophically insane. The movie stumbles tentatively from scene to scene, but Whitaker sells it anyway. In the end it will stay with you. Quite an achievement really."}, {"rating": "4", "text": "Whitaker was amazing in this...but the movie overall seems to be just another movie about Africa made for white people. After it was over I found no real point in the film"}], "recommendations": ["12_years_a_slave", "spotlight", "judas_and_the_black_messiah", "hotel_rwanda", "jackie", "the_last_duel", "just_mercy", "the_imitation_game", "hidden_figures", "darkest_hour", "the_hurricane", "12_angry_men", "blood_diamond", "the_reader", "legends_of_the_fall", "the_impossible", "a_beautiful_mind", "the_devil_all_the_time", "only_the_brave", "the_danish_girl", "hacksaw_ridge", "patriots_day", "cold_mountain", "the_master", "american_history_x"]}