{
  "id": 3607,
  "title": "The Woman in Black 2: Angel of Death",
  "starring": [
    "Phoebe Fox",
    "Helen McCrory"
  ],
  "runtime": 98,
  "genre": [
    "Thriller",
    "Horror",
    "Drama"
  ],
  "description": "40 years after the first haunting at Eel Marsh House, a group of children evacuated from WWII London arrive, awakening the house's darkest inhabitant.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9NcUFNCSzw4IFci3OhbX8ZyzoFn.jpg",
  "categories": {
    "plot": 4.5588235294117645,
    "acting": 4.291666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.333333333333333,
    "familyFriendly": 4.75,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It has it's scary and creepy moments, but Woman in Black 2 is a sequel that never gets outside of the box compared to the first movie. The decision making by the characters is poor along with the scripting and pacing. I would not recommend paying to see this movie if you want a really good horror movie. It turned into Insidious 2 in the same way."
    },
    {
      "rating": "3",
      "text": "the woman in Black may be a well shot at times and have some credible acting but it's not scary in any way and it shocking how bad it is in the writing department . the creepy atmosphere that the first managed to achieve is largely gone in favour of Jump Scare after Jump scare and none of them work and often ruin the scenes pacing.  the plot is also incredibly predictable and a lot of time really doesn't make sense but i've come to expect that from horror films now. why would i want enduring characters that i want to see make it when i can have these idiots"
    },
    {
      "rating": "1",
      "text": "The film is NOT scary at all. The story line is shaky and really does not tell much of a back story about the home. The Woman in Black film with Radcliffe was much much better. Watched as people walked out of the theatre. WIsh I would have spent my money elsewhere!"
    },
    {
      "rating": "6",
      "text": "This sequel is not as effective as the original film with Daniel Radcliffe because it sadly lacks a coherent story line. But the actors and acting are convincing, the setting is interesting, the scares and atmosphere work most of the time, and I certainly enjoyed the film.  So if you are a horror film enthusiast like me, I don’t think you will feel that you have wasted your afternoon."
    },
    {
      "rating": "5",
      "text": "A disappointing follow up to a genuinely good and scary horror movie. The plot itself is fairly decent. It fails to establish the necessary connection between Phoebe Fox's \"Eve\" and the orphan \"Edward\" (Oaklee Pendergast), which ends up being crucial to the whole thing, but for the most part it's solidly written.\r The movie also has some fantastic performances. That being said none of them have the presence of Daniel Radcliffe so it falls kind of short. That's really the issue with the movie as a whole. It's beautifully shot and everybody is on board and giving it their best, but everything just fails to live up to the first movie. It's missing it's predecessors atmosphere and presence. It's living in the shadow of a better movie.\r It's also lacking in it's tension and fright. Even the jump scares that you can't see coming fail to elicit a reaction when they occur. I may not have seen it coming (a rarity nowadays), but it still didn't scare me. There's little horror to speak of. At least not the kind that could scare anybody.\r As a result we are left with a sequel that just feels dull when compared to the original. It would still be pretty darn dull without the first movie having taken place, but it's not hard to think that it might have been less so. It's a well put together horror movie. Just one that isn't as effective as the one that came before it. Even the woman in black herself seems to have lost her bite now that we know her story. She's become a rather dull specter who has little presence in her own movie.\r 5.5/10"
    },
    {
      "rating": "7",
      "text": "Set in 1940’s London during the war, the story is told about a of group young children orphans under care are having to seek refuge along with their carer Eve Parkins (Phoebe Fox) and the Head Mistress Jean Hogg (Helen McCrory) in Eel Marsh house which is tired and worn but holds a dark secret.\rFor many of the children their parents are now no longer able to take care of them due to other duties during the war, one of the child’s parents were both killed in an evening of air raids this was boy is called Edward (Oaklee Pendergast) after losing his mum and dad he hasn’t been able to speak to anyone, so he finds it easier to draw and write if he needs to communicate.\r The plot of the film is very good and you warm to the main characters throughout, it has lots of jumpy scares and also a love story plus it has the scare factor, the camera work is also very good by keeping it dark and grainy which means you are trying to see and focus with whats going on screen and then something pops out at you to make you jump which is very good and its a Hammer Horror film so you know they are very good at doing that with their past work.\r The film will play on your mind for hours afterwards, second guessing what you just saw in your room while your at home, so don’t turn out the lights at night as you wont be able to sleep.\rThe audience enjoyed the film with lots of screams and jumping off seats, it is totally a different take to the theatre version of Woman in Black but there is still elements to remember the greatness that a live performance on stage can do and make you scared, bumps in the night and rocking chairs still at the heart of the film.\r Looking forward to buy the movie to watch at home in the dark, but I may go and watch it again before it goes and I suggest you do also.\rFull Review @ItsMuchMore"
    },
    {
      "rating": "4",
      "text": "After the success of the first film a sequel was inevitable, unfortunately this isn't a patch on its predecessor. Set during WWII, Eel Farm house is now a home for refugees, but the woman in black of the title isn't happy and soon makes her prescence felt. Slow moving, and far too reliant on sound effects for its scares thesis a major disappointment"
    },
    {
      "rating": "6",
      "text": "The film has decent horror, although severely lacking in originality. It consists of almost entirely borrowed aspects, not only from the prequel, but many other horror movies from last few years. It's a parade of creepy unsettling woman, a troubled child from Omen who dutifully stares blankly and draws eerie picture, and an equally troubled woman who desperately needs redemption. Aside from a couple moments, it gets too predictable which reduces the tension from its great atmosphere.\r Story follows a group of children in refuge from war led by two women, the circumstance forces them to spend their time in a decrypted mansion. In time of war and set in particularly unsettling village, the movie has good desolate ambiance. Cinematography brings a crisp grayish look, often dark and grim. In a few scenes such as the overlook of the bog or lingering fog on cemetery, the shot alone sets a good tone for scare.\r However, the pace offers little in term of thrill. Sequences are heavily constructed in stiff motion, from flashback, founding of old trinkets and silent traumatic boy Edward, who inexplicably sees some unexplained thing. Characters have little range or depth, in exception of Harry Burnstow (Jeremy Irvine). The protagonist Eve Parkins (Phoebe Fox) is strictly one dimensional. She's too fixated on Edward, despite there are other children who also need her. Their relationship isn't relatable and quite honestly the kid isn't that interesting either.\r Her hobbies include splitting from the group and investigating random area by herself. Practically half of the movie is her wandering off, this is not a recommended act when in war, worse if it's something related to unworldly presence. One character stands out amongst the rest, Harry the pilot. Jeremy Irvine does a fine job to portray the role, which isn't that surprising considering his work in War Horse.\r The movie still has a few of genuine scary moments, the rest are instigated by poorly made jump scare and shock value from the blaring sound. This feels cheap as it could've utilized the visual more rather than using comfortable honking. The Woman in Black: Angel of Death is a movie cobbled with old elements in different dressing."
    },
    {
      "rating": "3",
      "text": "The Womanin Black 2: Angel of Dearh is the textbook example of how a sequel can be so bad it ruins the original. Before I get into what I did not like about this movie, let me tell you what I liked about thr first one; good leas character, good villain, no generic horrror cliches. This movie did not have any of that. All the characfers were flat, the villain, while being the same villain from he original, is terrible, and it has so many stupoid cliches it is not worth watching."
    },
    {
      "rating": "5",
      "text": "Eh, I didn't  hate it. It wasn't anything spectacular but it wasn't anything awful... I couldn't see myself watching it again but it did creep me out at moments and the story was kinda neat. I liked the little bait and switch they did with one of the characters, making you feel one thing and then switch it around... Cool little film."
    },
    {
      "rating": "3",
      "text": "Meh, not worth the price.\rThey could have gone a different route here, but I'm not a movie producer or director.\rMildly upsetting the way the scenes played out, but in the end, a few jump scares and not much else.\rHorror movies should make you fear something, get scared of an idea or a possibility of something. This was more like a B-level horror movie and probably should have been VOD or straight to DVD.\rIn summary, see the original again or see Insidious again - those are great horror movies. This one falls flat at around the 3rd or 4th act. Nothing to see here, move along."
    },
    {
      "rating": "6",
      "text": "It's an okay sequel that falls flat on providing us with more horror we loved in the first place. Woman In Black 2 is well acted and shot. The acting is deep, and emphazing on the half baked plot of the film. Such talent, wasted. The camera angles are brilliant, you don't know where she is hiding, so it's a pee in your pants jumpscare. But the unique ideas are also half baked- the story elements are weak, and broken. Overall, it's an entertaning movie that could have been WAY better and a worthy sequel. But still give it a one time watch, it's not full turd."
    },
    {
      "rating": "4",
      "text": "A script so patched together from every other ghost story made, you quickly start thinking about those films instead: the original \"The Haunting\", \"The Innocents\", even \"The Devil's Backbone\". Slow and simply without any scares, Hammer seem to have decided to try and make films for 13 year old audiences. Nicely shot (when you can see what's in the scene) and well enough played, \"The Woman in Black 2: Angel of Death\" is dull and slow. The goodwill from the first film (although see the original British TV version for a jaw dropping finish) doesn't allow for such lazy writing and filmmaking. Poor."
    },
    {
      "rating": "3",
      "text": "The setting and style is all there, but with very poor lighting, little actual scares and a bland story, The Woman  in Black 2: Angel of Death is a sequel that should have never been. The first movie is great. But if you are looking for more the same, you won't find it here. Skip it."
    },
    {
      "rating": "6",
      "text": "Going to get this out-of-the-way the main protagonists pronounces the woman in black's name wrong she's pronouncing it like Jeanette like  Jeanette  McCurdy when I name is Janet Humphry.  Also the VERY  unnecessary love story subplot in the film...it was very out of place. Just because the main protagonist is female DOESNT mean there MUST BE a love interest. THANK THE TRAILER FIR NOT SPOILING A LOT because scenes in the trailer that looked like a match for the movie were edited so some scenes from the trailer didn't match the movie still leaving surprises.\r Okay personal knit pick aside, I like how it's set during the was but everything is more F'd up in the village after Aurther and his son were killed in the first movie. I do feel as if this sequal was unnecessary I still found it enjoyable. There were some tension building moments but also me some cheap jumpscares. I like how it had a happy ending but it was obviously baited."
    },
    {
      "rating": "2",
      "text": "Apparently Relativity Media has no ideas so they decided to make a sequel that shouldn't happen, i did not see the first one (starring Daniel Radcliffe). I've seen worst! the film has under developed characters (which is not a good thing for a horror flick), the film's purposes is reacting upon jump scares. The only thing good about this film Director Tom Harper's Gothic vision. I get it the actor's try but Jon Croker's script shows minimum details in the film than the other one. It's scary and unoriginal. Phoebe  FOX is a good heroine for the film it's just there is nothing she can do with the script in the way. The film is unlike able and i wanted the children to die in the film! Grade D-"
    },
    {
      "rating": "6",
      "text": "The movie is not really scary and he is pretty boring.The acting is not that bad but the scenario is not really good.There is barely no action and the ending where the little boy is suppose to die is just so disappointing.And the movie has a lot of issues but it is a little bit entertaining.Let's say that the first one was better."
    },
    {
      "rating": "4",
      "text": "If you're gonna put the name of a character in the title, it'd be nice if that character was actually in the movie. I'm still not completely sure if this was actually meant to be a sequel to 2012's The Woman in Black, or if the producers just tacked \"The Woman in Black 2\" in front of the original title to make a quick buck. Nevertheless, I'll still treat this film as a sequel, as it does contain the house from the original movie. Angel of Death takes place 40 years after The Woman in Black and is about a woman who starts an orphanage inside the notorious Eel Marsh House, which is said to be haunted by a ghost. If anything, Angel of Death feels like the second act of the original movie, in which Arthur Kipps is lurking around the creepy old house, stretched to 98 minutes. Even scares that were very unsettling and scary in The Woman in Black are reused in the sequel to a much less powerful effect. While there were a few admittedly creepy scenes, they were ruined by unnecessary jump scares. I'd also like to point out that the woman in black never appears in the movie until the last 15 minutes, and she only makes 3 or 4 appearances as cheap jump shocks. I was hoping that at least the time period in which the movie takes place could possibly save this from being a total disaster since it takes place during World War II. It's the perfect opportunity to tell a compelling story about the tragedies of war while also being an effective ghost story, but the war themes are dropped within the first ten minutes. I think the most shocking thing about Angel of Death is the fact that it's a ghost story that lacks both a ghost and a story. If you're looking for a good, moody, atmospheric haunted house movie, then I suggest 2012's The Woman in Black. Skip Angel of Death."
    },
    {
      "rating": "4",
      "text": "Ok, otra pelicula de \"La dama de negro\" esta vez sin Daniel Radcliffe y sucede 40 años después. Pues bien, La dama de negro 2 es una pelicula predecible, donde ya sabes lo que va a pasar. Con una duración de 1 hora con 30 minutos, la pelicula se siente eterna, pues tiene un desarrollo lento, es decepcionante como ofrece mas de lo mismo y no nos ofrece mas historia sobre la dama de negro. Lo unico que puedo decir a resaltar es la fotografía y la post producción, es impecable, es una mala pelicula pero se \"disfruta\" verla. No supera a su primera parte, mejor espérala en Netflix o en DVD."
    },
    {
      "rating": "0",
      "text": "Creepy.. but ive honestly seen better movies. Its hard to follow. It had its moments of jumps but it was stupid and a waste of money..................."
    },
    {
      "rating": "4",
      "text": "Woman in black was another clise horror movie. In fact Woman in black does some of the mistakes of the first movie. It lacks in many points clise scenes weak story and sometimes i felt that many unnecessary things happend. This movie is not something new it does many mistakes characters are not really that great exept the female protagonist but still her story seems unfinished. In conclusion Woman in Black 2 Angel of Death is a movie that you will be wasting money going to the cinema."
    },
    {
      "rating": "0",
      "text": "i feel like i was expecting to see daniel radcliff in this movie and even though i immediately skipped around I found none of it to be scary or have relation to the prequel...watch babadook instead, its infinitely better i would say.....one  day ill go back and watch the whole thing...until then thank god"
    },
    {
      "rating": "3",
      "text": "The fact that this movie came out in the very beginning of January and now I'm reviewing it, well I tried to escape from January but it followed me...help me.\r The Woman in Black 2: Angel of Death takes place 40 years after the initial haunting of the Eel Marsh House - when WWII threatens, a group of children finds themselves evacuated from London and placed in the house where it doesn't take long for the sinister presence to awaken once more.\r To the people who don't know, I actually liked the first movie..a lot. The fact that the first film had jump scares in it, it still had some creepy and chilling scenes and I remember those more than the jump scares because it was more effective. Now we got the squeal and what a surprise it's got more jump scars and no more of that creepy atmosphere that made the first film watchable, wow horror directors these days have forgotten how to direct horror films.\r Now let's start of with positive things in this movie and yes these actually some good things in the movie, would you believe that: The movie is shot really good as well and the acting in the movie isn't all that bad as I thought. Phoebe Fox did a good performance in this movie, she actually tried in this movie not like some actors or actress out there in these type of horror films that don't give a damn about they movie or they role.\r Now for the bad..get ready: I am just sick and tried of jump scares, I mean they not scary it's just a loud nose that makes us jump because we didn't except it and that's not scary at all. Most of the time it's false jump scares them the freaking kids and after a while the jump scares deflate any attention to the film. F**k Jump Scares.\r The lighting in the movie was hard to see at times, it was like Alien Vs. Predator Requiem were through out the film I couldn't see **** and the Women in Black 2 is the same.\r Overall Woman in Black 2: Angel of Death has some positive things in it with the acting and some of the shots, but the rest completely sucked. There was no need for a squeal, it's just a cash grab squeal that will be forgotten and for good reasons."
    },
    {
      "rating": "4",
      "text": "Kind of okay film I guess, some solid acting, creepy atmosphere, cool visuals and a pretty neat cinematography, but at it's core, the movie lacks in substance. No suspense whatsoever, almost no scary moments and basically nothing really interesting going on. Lots of clichés and jumpscares."
    },
    {
      "rating": "4",
      "text": "It has it's scary and creepy moments, but Woman in Black 2 is a sequel that never gets outside of the box compared to the first movie. The decision making by the characters is poor along with the scripting and pacing. I would not recommend paying to see this movie if you want a really good horror movie. It turned into Insidious 2 in the same way."
    },
    {
      "rating": "6",
      "text": "They've brought her back to milk another movie from the franchise. Watch out for Woman in Black lunchboxes, dolls and baby buggies. Derivative and disappointing of course."
    },
    {
      "rating": "4",
      "text": "Sequels can be one of two things: really great or really terrible. Daniel Radcliffe set a mark in The Woman In Black that would be hard to top for a sequel. The Woman in Black doesn’t earn the gold star for first place, but I would at least give it a bronze medal. Its successor, not so much. Cheap scares and dark corners are all you’re going to find in this film.Set in the time period during WWII, forty years after Daniel Radcliffe’s Arthur Kipps inhabited the house, orphans of the war take refuge in the same house from the first film. The film centers around Eve Parkins, Phoebe Fox, and Jean Hogg, Helen McCrory. The two have taken in children to flee the country during the war. Before boarding the train we get an introduction to Edward, Oaklee Pendergast, an orphan who Eve feels the need to take under her wing. She immediately is protective over him and watches out for him the rest of the film.While on the train to the house which they will turn into an orphanage, we meet a war veteran, Harry, Jeremy Irvine.Arriving at the house, Jean and Eve are stunned at what they’ve been given to take shelter in and turn into an orphanage. The house is old and clearly a safety hazard, but the caretaker assures them that it is the only thing they will find, as it is the only thing available. So, they decide to make the best of it and get the children settled in. Edward seems to be struggling getting along with the other kids, as they pick on him, and Eve starts having weird dreams. Harry shows up at the house, kind of creepy since they just met for the first time on a train ride, and Eve invites him in. They become close.Now, after the first creepy dream and the first kid starts acting weird, you know everything’s about to hit the fan. This movie is no different. Edward becomes ‘obsessed’ with the Woman, and Eve tries to protect him, obviously putting herself at risk. This movie had a lot to live up to, considering its predecessor, and it didn’t quite hit the mark. There were a few scares that made me jump, however most you could see coming a mile away, the predictable scares in every movie, and there were good parts to the film as well, but overall I wasn’t as impressed as I hoped I would be. I give them credit for sticking to the story line from the first movie for the most part, and the ending is satisfying. It just seemed a little bit rushed, and the characters didn’t stand up as well to Radcliffe’s Arthur Kipps. There wasn’t as much to work with in this film, and The Woman wasn’t as well explained, even though if you watched the first one you know the basics. The ending was kind of predictable, I think I called it about halfway through. That could be because it was an easy guess, or because I just watch so many movies I think I’ve figured out all the twists.If you liked the first movie, this one might not stand up to your expectations. Overall, I know this review is short, but I really just don’t have a ton to say about it. It didn’t stick with me like it should have. Luckily, it’s already out on DVD and Netflix so you don’t technically have to pay to see it."
    },
    {
      "rating": "2",
      "text": "Was this film necessary? even that question is unnecessary, The Woman In Black 2: Angel Of Death is nothing more than a blatant attempt to make money, based on the surprise success of the first one but the producers did not understood that the biggest reason to see it was Daniel Radcliffe and he's not on this one.Needless to say, I did not enjoy this enormously unnecessary and almost wasted sequel, beyond its production values, (I can not help admiring those landscapes because I love them) The Woman In Black 2: Angel of Death is all what a sequel shouldn't be, honestly just stay away."
    },
    {
      "rating": "2",
      "text": "Much weaker than the first film.This film is the sequel to another, which was a success and which, in turn, was the remake of a TV movie of the 80's. This time, the house of the swamp is occupied by a group of children from London , in the middle of World War II, in order to protect themselves from the German bombings. They are accompanied by a small group of adults where Eve fits, a young woman with a mysterious past who soon realizes the horror that inhabits that house. It is up to her to protect the children from the dark entity that wants them dead.Personally, I find this film considerably weaker than the first. The script is very simple and underdeveloped. We never really feel the danger of war, and all the action separates from the context of the time, only managing to take advantage of the environment, the scenarios. The war was only a pretext to fill the haunted house of children, coming from nothing, easy prey of the murderous creature that lives there. The characters were also thought of in the worst way. Too cliché, we have an aviator traumatized and frustrated with himself, a loving young woman who is pursued by a complicated past and a skeptical elderly, who only believes in supernatural phenomena when they literally jump in front of her face. The scares are basic, the film fails to create a tense and disturbing environment.Technically, the film clearly displays its low budget: all scenarios are basic, with the main house being emptied of all the decadent and exquisite scenery of the first film. Cinematography is overly dark and this makes the film very boring. There are some details of the film that, too, I misunderstood, such as the emptying of the neighboring village to the marsh house. Did they all die? Was it the creature that killed them? Are they gone? What happened?This movie is bad and can not scare you. It's not a movie that I believe you can see more than once."
    }
  ]
}