{
  "id": 3634,
  "title": "The Usual Suspects",
  "starring": [
    "Gabriel Byrne",
    "Stephen Baldwin"
  ],
  "runtime": 106,
  "genre": [
    "Drama",
    "Crime",
    "Thriller"
  ],
  "description": "Held in an L.A. interrogation room, Verbal Kint attempts to convince the feds that a mythic crime lord, Keyser Soze, not only exists, but was also responsible for drawing him and his four partners into a multi-million dollar heist that ended with an explosion in San Pedro harbor – leaving few survivors. Verbal lures his interrogators with an incredible story of the crime lord's almost supernatural prowess.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bUPmtQzrRhzqYySeiMpv7GurAfm.jpg",
  "categories": {
    "plot": 8.173913043478262,
    "acting": 8.23076923076923,
    "ending": 8.486486486486486,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "\"The Usual Suspects\" has a misleading storyline with limited settings applied throughout the movie. However, it is Brian Singer's clever direction associated with a two-face performance by Kevin Spacey that made the Climax of the movie possible."
    },
    {
      "rating": "10",
      "text": "I really don't know where to start from. It's obviously one of the best films ever made and one of my favorites and it has like the very best twist I have seen in my life and I have seen a lot of films with great twists. The twist is even better than Prestige's one. At the beginning the film is a little overcomplicated but when you start realizing what is happening you will not want to pause that film for any reason. It has action and suspense. It has everything that a film like that should have. It has great actors and an excellent storyline. The whole movie is interesting. I don't know what else to say just watch that movie and you will understand my words... It's a perfect masterpiece!"
    },
    {
      "rating": "10",
      "text": "A true classic, with one of the most brilliant climaxes in the history of film, The Usual Suspects will not fail to make your head spin.  You have everything in this movie.  Solid cast.  Wonderful script. Great camera work.  A true gem.With Kevin Spacey leading the pack in his Academy Award winning performance, the acting in this film is very believable, and powerful.  Your eyes will be glued to the film from the moment it begins, to the moment when your jaw hits the floor, in the end.I would highly recommend this film to anyone and everyone who considers themselves a fan of movies.  This is simply a must-see."
    },
    {
      "rating": "10",
      "text": "This film is just great. Great crime/gangster film but also so much more. Thrills, suspense, good acting, great script and very clever. I do believe that everyone should try and see this film."
    },
    {
      "rating": "10",
      "text": "I'm not that much into cops and robbers and gangster movies, but this one was really good so even I like this one. It is a very well told story with an ending you will not see coming. You definitely should see this movie at least once."
    },
    {
      "rating": "8",
      "text": "Does not waste any time at all. Every minute is utilized to set up suspense and action. And when we reach the climax, everything suddenly becomes ambiguous. You are not sure about what really happened, just about the things that matter the most. Kevin Spacey acts splendidly. The first time I watched it the plot twist at the end made me a fan of the movie. But not so much on the second viewing after a gap of eight years. Frankly, apart from the awesome ending, it wasn't a very great script_ just a nicely plotted crime thriller but not very special. But I truly believe that everyone should watch it at least once, and don't talk about it before doing that because some smart-ass may spoil it for you."
    },
    {
      "rating": "10",
      "text": "One of the most original and surprising films. Kevin Spacey nails his oscar as this enigma Verbal Kint. The ending is one of the biggest shocks in cinema. It takes more than two and two to get the ending. If you don't believe me, then GIVE ME THE F***ING KEYS YOU F***ING C*****KER, MOTHER****A!!!"
    },
    {
      "rating": "10",
      "text": "\"The Usual Suspects\" runs second to \"The Sixth Sense\" for one of those movies you will enjoy watching more the second time. I won't give anything away, but there is not one but two twists you won't see coming. And for that sole purpose is a reason to watch this movie. Also, Kevin Spacey might be another reason."
    },
    {
      "rating": "10",
      "text": "DAMN! This movie was incredibly extraordinarily awesome! Just because of the ending, everyone who hasn't seen this HAS GOT TO see this movie. Everyone'll love it!"
    },
    {
      "rating": "10",
      "text": "the usual suspect is the best mystery movie I ever saw, the plot twist of the film was actually great and so magnificent, I have watching this film for several times and the film was hitting me up with the mind twisting story, I love this film!"
    },
    {
      "rating": "10",
      "text": "The grandaddy of mysteries, the movie at first seems just like all ordinary detective thrillers, only this time its more shocking in entertaining suspense as it involves..... The Usual Suspects\r Featuring an ensemble of supportive performances, particularly Spacey as crippled con-man Verbal Kint, the film is a disturbing and a tour de force modern noir that will keep you grasped for rewatches to see how clearly things soon go out of place, to unravel the mystery of the mythical gangster responsible for a mass shooting spree at a drug deal resulting in the death of Kints' fellow \"Rat Pack.\r The film is very climatic twisted and gory filled with a mixture of violence and the satanic underworld of crime, this film will be one of the most talked about thrillers of the 20th century."
    },
    {
      "rating": "9",
      "text": "Brilliant story and superb acting. Lots of twists. Good production work too."
    },
    {
      "rating": "10",
      "text": "\"Greatest plot twist ever in cinematography\" plus good cast of main characters"
    },
    {
      "rating": "10",
      "text": "One of (or the best) mystery/crime movies I have ever seen. The twists are much crazier than seven, such a satisfying movie. I freaking love this movie. Just don't read any spoilers/etc. Just watch it, it's good."
    },
    {
      "rating": "10",
      "text": "Quite simply one of the best movies ever made. Kevin Spacey puts in a sensational performance and the supporting cast also do a great job of making it believable. One of my all time favourite films, and one of the best films ever."
    },
    {
      "rating": "9",
      "text": "As the movie opens five well known criminals are rounded up and questioned as to their involvement in the hijacking of a truck full of guns. No one cracks and as the men sit together in jail they hatch a plan for an elaborate diamond heist.\r The story is told in the past tense by one of the five men, Verbal Kint, as he sits across from a detective trying to uncover what happened during the attempted heist. This provides a unique twist in that not everything Kint describes is necessarily accurate or true and keeps the viewer constantly guessing as to the true nature of his involvement.\r Featuring a fantastic cast The Usual Suspects features a plethora of interesting and entertaining characters, none more so than Kint himself and by the time the movie reaches its fantastically clever finale most viewers will realise they have just watched a cinematic masterpiece."
    },
    {
      "rating": "10",
      "text": "This movie isn't perfect in every sense, but I do believe it deserves a perfect score. Everything has a low-budget, early Tarantino-esque feel, which is good for two reasons: First, the story and acting have to carry the movie and they do so superbly. Secondly, the aura of simplicity adds to the feel of realism: instead of special effects and sleekness, one gets to feel as if there, with the characters. Without spoiling too much, I can say that this is one of the cleverest movies I've ever seen. So many details add together in subtle ways, allowing the viewer to slowly but surely come to conclusions just seconds before the characters do too. It never feels forced or obvious, yet the director manages to guide us through a mental maze. Apart from Spacey who is sublime, I believe that Byrne and Palminteri both diserve lots of credit, even though Palminteri's character has little depth, the actor plays the role to it's full potential, secretly enabling the story to go the way it goes. Overall, it's not a movie everyone will find fantastic, but if you're into the criminal heroes / messing with your mind kind of thriller, boy, are you in for a ride."
    },
    {
      "rating": "10",
      "text": "With a brilliantly developed plot, excellent performances and provocative imagery, \"The Usual Suspects\" remains an absolutely stunning crime thriller."
    },
    {
      "rating": "10",
      "text": "Bryan Singer provides an outstanding before I went to make superhero films movie that is strongly written and also provides the best Spacey performance ever."
    },
    {
      "rating": "9",
      "text": "The Usual suspects is a smart well scripted. directed and, acted picture that is a classic for a reason. It has a twist ending that completes the movie precisely and the editing leaves nothing to be desired, it explains the storyline in full. Fantastic."
    },
    {
      "rating": "8",
      "text": "Admittedly this movie starts off very slowly. The first 45 min are not very interesting and at times I found myself checking my emails instead of watching the film. However about half way through the movie it starts to get really interesting. Furthermore, the ending is one of the best I've ever seen.\rJust watch it. It's great."
    },
    {
      "rating": "10",
      "text": "Even predicting the end it was such a good view, I enjoyed it at least equally to other unpredictable movie ends, which really makes it a goddamn good shot. Great actors, awesome playing --> \"The Usual Suspects\""
    },
    {
      "rating": "9",
      "text": "A great thrilling movie. Great acting by all with a stand out performance by Kevin Spacey. The action was great in this film was awesome. And the way the stories were really cool and well done. And then the ending came and holy I can honestly say I didn't see that one coming that's all I am going to say so that I don't give anything away."
    },
    {
      "rating": "10",
      "text": "i first saw it 4 or so years ago...I found the movie kinda quirky, got distracted by other family members who were in the room, so I watched it again a few nites later 'cause a few things were kinda hard to pick up on the first time, especially if one doesn't or can't pay attn to exactly what's going on.  saw it again 3 years ago, 2 years ago, 6 months ago and a few months ago.  it's on cable again tonite.    this is a movie that can be seen a few times and can be appreciated over and over.  great storytelling, superb acting and cast, and more movies need to be made with this quality of directing."
    },
    {
      "rating": "10",
      "text": "This is arguably the greatest Mystery/Thriller of all time. The way the twist at the ending puts the whole movie together, and the little piece of the end which throws you off track. It is overall brilliant."
    },
    {
      "rating": "10",
      "text": "I'll be honest. I had a long flight back from London and I came across this movie. I had heard it was good so I tried it out. Holy....crap.... I did not realize that I had stumbled upon one of my favorite movies of all time. The cast was perfect. The story was flawless. It kept me guessing until the final twist, which is up there with Vader being Luke's father. I feel this is a forgotten masterpiece that more needs to be seen more."
    },
    {
      "rating": "10",
      "text": "Usual Suspects is one of the best detective thriller of the 90s. Great story, strong cast (Kevin Spacey played his role perfectly) and crazy ending in the last 15 minutes. The plot twists worked perfectly, I, as a viewer, did not see the tricks in the flesh until the end of the film. Bryan Singer made his best film of his career and went to make numerous X-Mens films."
    },
    {
      "rating": "10",
      "text": "HUUUGE MOVIE>>>> ALL THE OTHER MOVIES.  Great cast, lot of white guys for some reason, don't know what Fender is doing in it or Kobayashi.  Literally can't understand what they are saying. Mystery is HUGE! Wasn't a very good movie to sing along to.  Pay attention, or don't, don't care, still a masssssterpiece.  \"The greatest trick the world ever played, was not showing you this movie\".  Peace!"
    },
    {
      "rating": "10",
      "text": "This movie is brilliant. That's all I can say. (Well, it's not all I can say, but you get the message)"
    },
    {
      "rating": "10",
      "text": "One of the best movies (and ending).Thrills, suspense, good acting, great script and very clever. I believe that everyone should see this movie."
    },
    {
      "rating": "10",
      "text": "What a big, big movie! It's not a popcorn movie, you have to look with watch eyes.It's all there. Do not see who wants to, see who knows how to look!Funny,intriguing,well playing,big screenwriters,director....all indeed! I love it!"
    },
    {
      "rating": "10",
      "text": "Best criminal movie, greatest role of greatest actor (Kevin Spacey) 8th best movie of all time overall (in my opinion)"
    },
    {
      "rating": "10",
      "text": "Love at first sight...I adore this amazing trama. Lot of mysteries, the movie at first seems just like all ordinary detective thrillers, only this time its more shocking in entertaining suspense as it involves..... The Usual Suspects I love it! Definitely"
    },
    {
      "rating": "10",
      "text": "Шикарный фильм, сейчас таких не делают уже, а жаль"
    },
    {
      "rating": "10",
      "text": "It's fantastic from start to finish, and the twist at the end will blow your mind. An American crime classic."
    },
    {
      "rating": "10",
      "text": "This is definitely the best movie I have seen so far with a great ending and that's why I 'm using the name of a character of the film!!! (Keyzer Soze)"
    },
    {
      "rating": "7",
      "text": "I have to agree with ryancarroll88. The twist ending is certainly a shocker but it pretty much flaws the entire film and makes you question if any of it was real. Still a solid movie though and certainly, at least some-what, lives up to the hype around it."
    },
    {
      "rating": "10",
      "text": "The Usual Suspects is a classic crime film that will bring you in and not let you go until the final twisted and unexpected  climax. With the combination of Brian Singer's directing and Kevin Spacey's acting this is truly a great film. Hang on, The Usual Suspects is one hell of a ride."
    },
    {
      "rating": "4",
      "text": "I'm not sure whats so great about this movie. It really didn't hold my attention for what ever reason and I found the plot pretty bland. It annoyed me as it tried to be intelligent and suprising when I didnt really think it was. Clearly a lot of people liked it so I wish I could see what they saw.There is really nothing I 'did not get' in this mvie and I'm wondering where the layers of depth in the plot are."
    },
    {
      "rating": "6",
      "text": "The movie that is best known for its surprise ending, and if it has not been spoiled for you already, it will literally take your breath away. But when the ending of a film falsifies everything you have just watched, as a viewer you have to question the validity of the first 90 minutes of the movie. I dare you to watch this movie more than two times and still have it impact you."
    },
    {
      "rating": "8",
      "text": "this film was fantastic i loved the neonoir affect would highly reccomend watching this film my only negative feedback is the ending the twist in the film was over rated the film was famous because of its ending but the ending wasnt really for me"
    },
    {
      "rating": "6",
      "text": "Great acting from spacey but rough plotting and a mystery that is not very well presented or interesting cannot even be saved by the films twist. Not a very memorable film."
    },
    {
      "rating": "4",
      "text": "An ugly word that often gets unfairly tossed around in film criticism is manipulative. This word seems like sudden death for any movie, and is often used to describe a film that tries to play to the emotions of its audience. A more accurate way of using this term is a film that has little confidence in what it does and simply tries to throw things at the audience, hoping for validity. The Usual Suspects is a great example. While it certainly does paint an interesting picture, the characters are stock, and without interesting play between the players, it over compensates with plot twists and story holes, mixed rather uninspired interrogation scenes. There is little to enjoy in The Usual Suspects other than trying to put together its story, and once you do that you realize it is not even an interesting story, but simply feeds the audience so little, that there is little payoff to learning the surprises."
    },
    {
      "rating": "6",
      "text": "I was very excited to revisit what I considered one of my top 50 or so films after a few years. I have to say it was more than a little disappointing. I do understand why people, including myself, have become so attached to this movie. Spacey's performance is fantastic, the reveal at the end of the film is still exciting and fun, and there are some very memorable, quotable lines. What I forgot about are some of the problems with this film, and they are numerous. First of all for a thriller this movie spends a whole lot of time with nothing going on. While most of the performances are ok, I still have no idea what they were doing with Del Toro's accent. The score is pretty poor. Once the final reveal happens there are countless plot holes that will never be explained. While I still like this movie based on the two strongest aspects of the film, and will probably revisit it again in a few years. I will not recommend this movie as strongly the next time it comes up with someone who has never seen it."
    },
    {
      "rating": "5",
      "text": "I'm not gonna say that this movie is overrated cause that gonna make me look like a hater  which I'm not cause i like Kevin Spacey movies but i actually have couple things i need to criticize.\rfirst of all Stephen Baldwin can't act at all  which is a movie destruction itself cause he took a special part in the movie  Chazz Palminteri is a bad face for this movie and also Gabriel Byrne is not right for the part  so after all that being said i think that there is something wrong with this movie and it could be a lot better than this  after all i think that whoever selected the actors for the parts did an insulting job  and kinda ruined the entire idea."
    },
    {
      "rating": "2",
      "text": "The Usual Suspects is just so usual, that i predicted the end in the beginning. So decent and boring, and i couldn't care less about the characters. But i think you should watch it, because all other people enjoyed it, and it may be just my point of view."
    },
    {
      "rating": "3",
      "text": "Don't really get the point of seeing this kind of entertainment movie, not to mention one that you immediately figured out from the VERY beginning the biggest \"suspense\" that it tries to keep. You learn nothing. What a total waste of time."
    },
    {
      "rating": "5",
      "text": "Of course, the solution to the convolutions of \"The Usual Suspects\" is cleverly devised and chillingly acted by the duplicitous acting wizardry of Kevin Spacey in an iconic two-faced portrayal - its reputation precedes it, as one of the most inspired acts of pulling the rug out from under the feet of the audience in the history of film. If anything, it is this climatic stroke of genius which kills the film. If only the rest of it had been half as good as those last few moments. What comes before that ending is largely forgettable, dull and, by virtue of the ending, obsolete. Of a 108-minute movie, about 8 are worth watching. That is not the signal of a great film - rather one overwhelmed by its own ambitions, with a reach that far exceeds its grasp."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of all time. Kevin Spacey gives an absolutely brilliant performance."
    },
    {
      "rating": "7",
      "text": "Intelligent film. Excellent performances by Kevin Spacey, Chazz Palminteri. Stephen Baldwin surpises with a cool performance. Because of it Is aw many crime thrillers like Man On Fire, Se7en and Fight Club. Only the script has a couple of loose ends. Also leaves some questions unanswered. Even then an intelligent and gritty thriller with a superb ending. McQuarrie is a brilliant writer and Singer a brilliant director."
    }
  ],
  "recommendations": [
    "the_prestige",
    "shutter_island",
    "the_sixth_sense",
    "now_you_see_me",
    "lucky_number_slevin",
    "man_on_a_ledge",
    "gone_girl",
    "the_next_three_days",
    "glass",
    "twelve_monkeys",
    "the_illusionist",
    "split",
    "a_walk_among_the_tombstones",
    "mystic_river",
    "a_perfect_getaway",
    "the_good_liar",
    "the_loft",
    "contraband",
    "rocknrolla",
    "the_departed",
    "the_number_23",
    "breach",
    "looper",
    "the_accountant",
    "changeling"
  ]
}