{
  "id": 1304,
  "title": "The Incredible Hulk",
  "starring": [
    "Edward Norton",
    "Liv Tyler"
  ],
  "runtime": 114,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "Scientist Bruce Banner scours the planet for an antidote to the unbridled force of rage within him: the Hulk. But when the military masterminds who dream of exploiting his powers force him back to civilization, he finds himself coming face to face with a new, deadly foe.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gKzYx79y0AQTL4UAk1cBQJ3nvrm.jpg",
  "categories": {
    "plot": 7.913043478260869,
    "acting": 7.533333333333333,
    "ending": 7.888888888888889,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.166666666666667,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The Incredible Hulk isn't very Incredible.\rEdward Norton gives a good performance but the concept of Hulk itself just seems tired. There is no new outlook on the hero just simply a repeatedly mediocre take on a very one dimensional character. The screenwriters should have tried to be more inventive."
    },
    {
      "rating": "9",
      "text": "Though I'm not a big fan of Edward Norton he does a great job in this movie. It's darker and more emotional and dramatic than most superhero movies and I think that fits in well with the Bruce Banner tragic story. Liv Tyler is as angelic as usual and Tim Roth and William Hurt round out a great cast. The action sequences were done really well and I loved all of the little nods to the Hulk lore like the Lou Ferrigno cameo, the purple pants scene, the Stan Lee cameo, and the name of their old time friend \"Stanley\" being a nod to the creator. The plot also developed really well. The only negative was that the fight sequence at the end with abomination was a little anticlimactic. That fight is being hyped up the entire film and I just didn't think it was that great. Nonetheless, this was an outstanding movie and most people would enjoy it."
    },
    {
      "rating": "7",
      "text": "THE INCREDIBLE HULK helps us believe that the man who is the monster really does fear himself, that he fears not being able to control it. It's a Marvel film: it's fun, humorous, and packed with action. Sit back and watch the Hulk...SMASH!"
    },
    {
      "rating": "7",
      "text": "It can't beat \"Iron Man\", but \"The Incredible Hulk\" is still an intense and action-packed Marvel movie. It has an intelligent script but doesn't have the same intelligent style and craft like \"Iron Man\". Either way, I still recommend you check out this smashing movie."
    },
    {
      "rating": "7",
      "text": "This is the best Hulk we're going to get. Take it or leave it."
    },
    {
      "rating": "9",
      "text": "Colorful, exciting, well acted and visually impressive, The Incredible Hulk is one of my personal favorite Marvel Phase 1 movies. Edward Norton truly shines as does Tim Roth\r9/10"
    },
    {
      "rating": "9",
      "text": "The thrilling, adrenaline rushing reboot that the first Hulk film never was. The Incredible Hulk has the engaging story needed to make this film work, and all the visually appealing action to enthrall Marvel and superhero fans alike."
    },
    {
      "rating": "7",
      "text": "This is a mixed bag, the special effects are good, Edward Norton was good, and it was definatly better than Ang Lee's monstrosity (pun intended), but everything else is just kinda of underwhelming, and it just feels that it is missing something that Iron Man had."
    },
    {
      "rating": "10",
      "text": "L'incredibile Hulk non sarà un film ai livelli di The Avengers o Captain America: The Winter Soldier,ma è comunque un capolavoro fenomenale e soprattutto godibile."
    },
    {
      "rating": "8",
      "text": "Movie was great in my opinion. The hulk looked really good and the acting was just amazing to be honest. Too bad there won't be another one anytime soon.8/10"
    },
    {
      "rating": "10",
      "text": "I went into the theater still skeptical (primarily due to the 2003 version). They needed to do something magic to make up for that and on top of that I didn't expect near the same quality of movie as Iron Man. Walking out of the theater I had an overwhelming sensation that The Incredible Hulk is better then Iron Man. After a nights reflection I stand by that, put simply Hulk > Iron Man [however in not all respects]. While RDJ near perfect role as Tony Stark is marginally better then Edward Norton's Bruce Banner, the Hulk is a far more impressive superhero then Iron Man. The fights in both their scale and frequency blow Iron Man out of the water. For fans of Marvel comics (like myself) the cross-overs just add to the experience. We get two Tony Stark references, subtle references to Captain America, a reference to The Avengers, and a possible set up for the Hulk and Wolverine's encounter at the end. Needless to say Marvel has hit two home runs this summer with movies, if you enjoyed Iron Man, you owe it to yourself to watch this movie, even if only for the 2 min ending featuring Tony Stark."
    },
    {
      "rating": "9",
      "text": "The script is really short but the effects were a lot better, the hulk is a lot smaller which i really liked and the setting changed, Brazil was a nice touch, i really enjoyed it."
    },
    {
      "rating": "9",
      "text": "The Incredible Hulk really surprised me. Sure, it doesn't have as much wit or substance as Iron Man, but the film is what the Hulk should be: fun with good acting, a solid script, awesome action, and an actor that can portray Bruce Banner well. The Incredible Hulk is a great movie, and even better to comic book fans. Overall, forget Ang Lee, this is  a great movie!"
    },
    {
      "rating": "7",
      "text": "A solid effort that delivers what you would expect from a Hulk movie and then a little bit more. Ed Norton is good as Bruce Banner and the action scenes are impressive. It is not the cleverest or the most thrilling superhero movie but it should appeal to fans and non-fans alike."
    },
    {
      "rating": "8",
      "text": "Really enjoyed this, bar a few daft bits & flimsy plot-lines/holes, it holds together well and does both a great job as a film, and a superhero flick. It finds a superb balance in portraying an angry-man-hating Hulk and also a caring, misunderstood one, although it does lacks a bit of needed dialogue in the early stages mind. However it definitely finishes strong with a top notch fight scene and the CGI graphics actually look great, with the end fight scene itself pretty damn cool and not the repetitive borefest which CGI usually spawns. All the scenes involving Hulk throughout are excellent in fact - no \"it's obviously CGI\" moments - and the film also cleverly intertwines into the plot the way that Hulk goes from being a raging monster, to more of a man-monster. If you can ignore the odd daft bit then you've a fine film to enjoy."
    },
    {
      "rating": "8",
      "text": "The Incredible Hulk has much higher action and better development for story. The CGI is great. The acting is really great. This film really adds the incredible in The Incredible Hulk."
    },
    {
      "rating": "9",
      "text": "The Incredible Hulk is the Hulk reboot which fans have been waiting for. As a relevent part of the Marvel Cinematic Universe, Edward Norton plays the role of Bruce Banner very well as you can feel the connection between his depression and his constant attempt to control his emotions. Plot: Bruce Banner is a scientist who along with the American army attempts to re-create the super soldier formula that had transformed Steve Rogers into Captain America. The attempt goes haywire when he becomes so confident in it that he injects himself and becomes the rage filled Incredible Hulk. While hiding out in the favelas of Brazil, he contacts a mysterious source known as Mr. Blue in an attempt to find an antidote toward his unwanted transformation. In the meantime he struggles to control his anger to avoid causing innocent casualties and waking up confused and naked. Meanwhile the General Ross (William Hurt) of the US army attempts to capture Banner in an attempt to use him as a weapon. To do this however he hires an elite soldier Emil Blonsky (Tim Roth) who is ecstatic to capture Banner and will go to extremes in order to do this. Comparison to Hulk: This movie includes much of the same plot but is much more linear and realistic. Instead of unrealistic scenerios, The Incredible Hulk immerses audiences with its top notch CGI the seriousness of its military forces and its incredible ending. Opinion: One of the best superhero movies that really show audiences what Hulk is all about. Anyone who is interested in a realistic live action Hulk should totally view this movie, also anyone interested in the Marvel Cinematic Universe should check this one out."
    },
    {
      "rating": "8",
      "text": "It may not be as well-crafted as its other Marvel: Phase One counterparts, but \"The Incredible Hulk\" effectively rekindles the audience's interest in the plight of Bruce Banner, played by the always excellent Edward Norton."
    },
    {
      "rating": "8",
      "text": "The Incredible Hulk is an enormous improvement, if you compare this film with the previous one, because this one got so much more action, better actors, better CGI and more realistic scenes.\r The story is way better than Hulk (2003), and I never felt boring at any time, compared to the previous movie. The Incredible Hulk is an enormous cool movie and it got a great opening scene, a good story, good music and a fascinating ending, and I really recommend it for anyone!\r The Incredible Hulk gets a 8/10"
    },
    {
      "rating": "8",
      "text": "The Incredible Hulk is a hell of an improvement over Ang Lee's \"Hulk\" from 5 years earlier. Incredible Hulk as a better story, better action sequences, and it captures our attention and holds it. Edward Norton fits right into this movie, as this type of \"quiet-but-deadly\" role is right up his alley."
    },
    {
      "rating": "7",
      "text": "Edward Norton works as the new Bruce Banner. This reboot of the Hulk franchise is far superior to Ang Lee's \"Hulk\", as Ed makes us like the jolly green giant again."
    },
    {
      "rating": "8",
      "text": "Very enjoyable movie. I was actually quite surprised by how amusing the movie turned out to be, because I came in with the idea I wouldn't be watching for to long but it turned out I kept watching for the entire movie."
    },
    {
      "rating": "7",
      "text": "After the terrible Hulk movie before I was happy that this movie was made as the origin story is correct, the acting was better and most importantly the CGI was much better. In my opinion the villain was much better and memorable."
    },
    {
      "rating": "8",
      "text": "This is a good movie.It was more action packed than Ang Lee's one and the choice to cast Edward Norton as Bruce banner was a good idea.The special effects and acting are really good."
    },
    {
      "rating": "8",
      "text": "What could have easily been a mediocre and all-too-familiar origin story turned out a really fulfilling cinematic experience thanks to straight-up good filmmaking. This film is objectively better from a technical standpoint than its predecessor, Iron Man. Cinematography is done artfully and carefully with lots of attention to pleasing compositions and meaningful movement and framing. The locations, environments, lighting, and weather are all used to great effect to give mood to the film's various situations and arcs. The score by Craig Armstrong, one of my favorite film composers, enriched each scene with appropriate energy and emotion. The performances of the main cast were convincing. I really felt the connections between the characters and the emotions of the characters. For a film that's relatively light on story, it really makes up with it with pleasing characters, visuals, and action. The action scenes were thrilling and handled particularly well, much more fun to watch than the action scenes in Iron Man, as these are more carefully planned and coreographed, with some truly surprise moments. I found there were moments of sheer awe and horror in the brutality of The Hulk and his fights with the menacing villains. I was even kind of surprised to see later parts of the film take on the feeling of a monster movie, evoking feelings of Godzilla, Cloverfield, and others of that genre. It worked very well and helped us feel the surrounding characters' fear of the \"monster\" they'd created in Bruce Banner. Great movie. I'd watch it again. It has a few weaknesses, namely every moment involving Mr. Blue, who gave a rather grating performance. There are a few moments that feel rushed, or forced, or cheesy, but all-in-all for such a simple story this film worked really well for me. I'm sad to see Ed Norton didn't keep the role, because I highly prefer him to Mark Ruffalo for this character."
    },
    {
      "rating": "6",
      "text": "A big improvement on the 2003 Ang Lee Hulk film (which wasn't hard tbh), not a amazing film but not a terrible one either. Feels a little bit irrelevant to the MCU but as a solo film it's decent. The action scenes are very fun and most performances are good.Only thing I find a bit weird is the casting choice of Tim Roth as this amazing decorated soldier, it just doesn't fit. He never feels all that intimidating in the entire film until the end (for obvious reasons), that's really my only big gripe with the film"
    },
    {
      "rating": "7",
      "text": "Al principio creía como todos que era una secuela a la somnífera de Ang Lee, pero no, es un reinicio en un estanque más grande, me animé a verla por que en un anuncio de periódico que cierto personaje millonario que le habia visto hace casi mes y medio aparecería en la película, haciendo que estén conectados, algo que no se había hecho antes en películas de este género, sobre la película no me aburre en ningún momento y muchos de los díalogos son breves y hay mucha acción para dar y tomar, el diseño de Hulk, muy realista, fiel al material original, asi como varios cameos buenísimos, sobre todo cierto personaje que he mencionado al principio, Edward Norton hace genial de Bruce Banner, Liv Tyler preciosa y me convence como Betty Ross, William Hurt como el General Ross, clavadísimo, Tim Roth como el antagonista dío más caña tanto antes y después de volverse una abominación de monstruo, y dio mejor pelea que el disque Hombre Absorbente de Ang Lee, sin duda alguna Louis Leterrier ha hecho gran trabajo con este producto, lo bueno es que hubiera muchas referencias a la clásica serie televisiva de los 70's, tanto en el resumido origen del protagonista,que también mezcla el origen del universo Ultimate del mismo personaje, lo único malo de esta experiencia fue verla un sábado repleto de gente con niños, cuando hay cierta escena cachonda con Bruce y Betty"
    },
    {
      "rating": "7",
      "text": "The Incredible Hulk has enjoyable story-telling but an unremarkable plot. The characters are back, with not much to say and Bruce Banner just wanna do what he always do: Kill his green side. This is not a classic for Marvel Universe, but, at least, Hulk's back, continuing with his predecessors, to be a hero and fight vs his real enemy. Fans won't be disappointed at the end."
    },
    {
      "rating": "7",
      "text": "What seemed, in theory, the least-necessary revival of a bigscreen superhero emerges as perfectly solid summer action fare in “The Incredible Hulk.” Revisiting the character Ang Lee and James Schamus put under a psychological microscope in 2003 to mixed results, Marvel, Universal and several of the same producers have repackaged one of their better-known stable stars in a straightforward actioner that delivers the goods with no unnecessary frills or digressions. Happy to give the intended audience what it wants, this loud and quick-moving production will shake loose ample coin in all markets.\r To anyone wondering why the Marvel team would so soon embark on a makeover of the growly green giant after all the angst endured on the previous one, the answer is provided by the final scene, in which the star of the most recent Marvel B.O. smash unexpectedly turns up to ask, “What if I told you we were getting a team together?”\r New film thus marks the first step in the label’s plan to begin shuffling its major characters into films together, a la some of the comicbooks — a scheme that seemingly required the rehabilitation of the Hulk from something that came to be regarded as perhaps too rarefied, not of a piece with the studio’s other cinematic stalwarts.\r Viewed in this utilitarian light, the new film gets its job done. It’s not especially exciting or surprising, lacking the cheek and sheen of “Iron Man” and the opulence and star power of the “Spider-Man” and “X-Men” series. But it’s better than the “Fantastic Four” pictures and “Daredevil” and manages to shift the title character from a hopelessly conflicted Dr. Jekyll and Mr. Hyde to a wannabe good guy.\r It seems that none of these Marvel-based films can begin with anything other than a medical experiment gone madly awry, leaving its subject with a drastically split personality. This one gets it over with pronto, after which scientist Bruce Banner (Edward Norton) hides out anonymously in a Brazilian favela while desperately trying to decontaminate his blood, eliminating the cells that can make him, if sufficiently incensed, turn into a raging, bemuscled, 9-foot screamer with disagreeably antisocial habits.\r Keen to track Bruce down is Army Gen. Thaddeus “Thunderbolt” Ross (a cigar-chomping William Hurt), who oversaw the experiment. He wants to bend the results to military purposes and sends mad-dog soldier Emil Blonsky (Tim Roth) flying down to Rio to snatch the elusive fugitive. Resulting pursuit is a partially parkour-style chase through the pinched passageways and across the roofs of the hillside slums that entertainingly recalls but doesn’t nearly match the flair of the opening sequence of “Casino Royale.” The Hulk makes his first kick-butt appearance in Brazil 23 minutes in, but is only partly seen, and in shadows at that.\r Despite the manpower expended to bring him to heel, Bruce is able to make his way back to Virginia, stopping en route in Mexico to buy a pair of stretchy pants, which he rightly predicts will prove useful down the line. In the intervening six months or so, g.f. Betty (Liv Tyler), old Thunderbolt’s daughter, has taken up with a new guy, but she immediately drops him when her old flame reappears with major issues to deal with.\r First and foremost, her dad wants to extract whatever’s inside him to augment the Pentagon’s arsenal (there’s no discussion of whether or not this super-steroid constitutes a chemical weapon). Second, Blonsky, who admires his adversary as “a whole new level of weird,” can’t wait to attain that level himself. After he volunteers to receive a dose, he’s able to compete with the Hulk up to a point in an explosive battle on a university campus lawn, but he’ll need more juice to have any hope of besting the green one in a street brawl.\r Which is exactly what the showdown consists of. Following an interlude in which the Hulk takes Betty to what looks just like King Kong’s cave, both he and Blonsky enlist the services of an enthusiastic research doctor (Tim Blake Nelson in an amusingly over-the-top turn) to become battle-ready. With Blonsky transformed into a creature fully justified in being called the Abomination, they proceed, ripped and roaring, to lay waste to Harlem; that the finale would seem to be almost entirely a CGI-animated sequence will be noticed but not much minded.\r Norton gives indications of perhaps wanting to go places with the role that remain off-limits this time around (he no doubt would have been happy teaming with Lee), but he’s kept largely on the straight-and-narrow, to decent effect. Tyler is no more or less memorable in the femme lead than Jennifer Connelly was in “Hulk,” while both Roth and Hurt happily underplay by a bit what might have been expected of them in their villainous roles."
    },
    {
      "rating": "7",
      "text": "This film is a massive improvement over Ang Lee's less-than successful attempt to bring this character to the silver screen. This film has gotten some flack for not being as good as one of the best films in the Marvel franchise but it is still a good movie in its own right. One ingenious thing about this film is that since it is a reboot of the previous Hulk film, they put the origin of the character in the opening credits which is something that I hope they do with the new Spider man movies since people are well aware of his origin. Edward Norton gives a compelling performance as both the Hulk and as Bruce Banner. The actor who plays General Ross fits his role perfectly as the no- nonsense military general. The story is what you would expect from the Hulk since it is about him running away from the military while fighting the Abomination played by Tim Roth. The final action scene was once again very entertaining with the protagonist fighting a darker reflection of him self. Unfortunately there are still some problems with this film that holds it back from making a great film instead of a good film. For instance although Tim Roth was an intimating villain his turn to evil wasnt really that convincing. At first it seems that he only wants to fight the Hulk because its his mission but than he turns evil in a snap because of the formula. There was also some buildup to a potential villain (either the Leader or Gargoyle) which never went  anywhere and it will never be explored in any of the other Marvel movies. Betty Ross was also a bland love -interest. She is good at being the emotional support for Bruce Banner but I really didn't care for her safety that much. Despite those glaring problems though it is worth a watch especially for that POV shot when Banner tries to kill himself and later turns into the Hulk to spit out the bullet."
    },
    {
      "rating": "8",
      "text": "Louis Leterrier presents us with a very well-handled, respected version of the Bruce Banner we all know and love. The film is an overall fun experience, however, it suffers from very cringeworthy acting by Liv Tyler, which in turn makes the romance between Bruce Banner and Betty Ross very cringeworthy as well. The viewer cannot help but think the film had much more potential when it's over. The Incredible Hulk, to be quite honest, probably deserves an overall score of a 7, but I myself have always been a fan before being a critic, and The Incredible Hulk delivers just enough for me to not only give the film an overall score of 8, but also purchase the film of Blu-Ray. This underrated film is definitely worth watching in your spare time!"
    },
    {
      "rating": "8",
      "text": "Some better than Ang Lee version with several Easter eggs and winks to TV series of 70s. If it has a defect or two, it´s the hasty start sequence and the short sequence dedicated to villian. For kill 112 minutes with the less of pain."
    },
    {
      "rating": "7",
      "text": "Let’s fast-forward things back in 2008,when Marvel was riding off the heels of Iron Man’s success and the fans’ mind-blowing reaction to the post-credit scene of Nick Fury introducing the Avengers Initiative.After everyone saw Iron Man,everyone didn’t know where the Marvel Universe would go,so hearing the news of another Hulk movie was both great news and terrible news,since we know what happened to the last Hulk movie (also because Hulk is owned by Universal and stuff)…. And that’s where we had “The Incredible Hulk”,a movie that promised us a new version of the Hulk (and a refresher from 2003… Ok,I’ll stop).But if we’re going to see if it’s any good or not 10 years later (kind of astounding how it held up by itself,honestly),let’s see if it still holds up or not.So,the story. To understand the story,technically you’ll have to see the 2003 Hulk movie by Ang Lee (I guess,which if you don’t want to,glad they retell that for the new viewers in the title sequence) to get some explanations of what’s going on in the beginning of the movie (when we’re introduced to Bruce Banner’s life),but,cutting that flaw out,the rest is interesting to look at. We understand why Bruce Banner (played by Edward Norton) is having a troubled life with the military,his love for Betty Ross (played by Liv Tyler) and his anger/excitement issues that lead him to becoming the Hulk,as the title says. Even if in the end,he realizes that no matter what he does,the city still needs him,even if he’ll SMASH his way through everything.Speaking of that,at the same time,in the 3rd act,we’ll get introduced to the villain,Abomination (played by Tim Roth),where I’m kind of mixed. Look,his actions are not really understandable: He’s a Professional Soldier,he gets angry after he got beaten by a kick from Hulk,then he gets crazy and crazy as the movie progresses,him and his creepy CG’d out body (he gets the Super-Soldier serum,so that’ll better explain something…),then he becomes the Abomination just so he can kick Hulk’s butt. It’s not horrible,but it feels like the writers saw a Videogame Rage Compilation and thought “What if the angry player gets his revenge on him,and actually wins?” to just get away with it. Back to Bruce Banner, his relation with Betty is really sweet and Edward Norton plays a “scared,always on the lookout” Bruce Banner expertly.Tim Roth is intimidating as Abomination and Liv Tyler was basically ‘Jennifer Connelly from Hulk 2003’ 2.0,since her lines are told in this weird,coff-y and muted tone,and a scene involving a Taxi Driver driving like if it’s a Car Chase (that was outta nowhere…). That,and the scene where Hulk throws a rock through the storm to defend Betty cracks a laugh for me. Sorry,but it’s just me.Now,for the Special Effects...as of today,they look like the perfect Nintendo Switch videogame,ported by Panic Button. But,for 2008 standards,this felt serviceable. The action was fast and frenetic,and the Motion Capture was nice.And yeah,the score is still another “Marvel Score where you’ll remember the theme and its action cues”,but it’s one of the better ones,being composed by Craig Armstrong (he also composed The Great Gatsby).So in the end,I think The Incredible Hulk is an underrated MCU Movie that fans don’t necessarily have to go see now. Maybe for a fun time. And hey,it being a Universal movie from 2008 was kinda surprising since it has better qualities in it than Cash World Fallen Profit."
    },
    {
      "rating": "7",
      "text": "I enjoyed the action and fighting in this movie. I found some parts boring, and other parts awesome. The CGI wasn't great, which affected the story. Overall it was pretty good."
    },
    {
      "rating": "8",
      "text": "To me, this is an incredibly underrated superhero film. Edward Norton was great as the leading character, Bruce Banner. The action sequences were very entertaining. I guess my main complaint is the villain, Abomination was disappointing. But overall, this is a very entertaining superhero film."
    },
    {
      "rating": "7",
      "text": "The incredible hulk was a good movie but it still had its problems that it gets boring at some parts of the movie and the hulk brings a fun experience but the movie is bit dated as it was made in 08 but the movie is decent"
    },
    {
      "rating": "7",
      "text": "I don't get the hate for this movie. I find it a very entertaining movie that delivers on expectations. Compared to the other movies in the series it is weaker but on its own I find it to be a very solid movie. The score is pretty good in my opinion and the action scenes can be great at points. Like Iron Man, the third act is a tad weaker than the first two but it doesn't completely ruin the movie for me."
    },
    {
      "rating": "7",
      "text": "The Hulk goes into the second round! This time, the broken scientist is played by Edward Norton. The successor of Eric Bana and Lou Ferrigno gives Bruce Banner a certain vulnerability and acts more human than its predecessors. It's just not a parade for Norton. Norton is coming for me completely under-challenged. With this reorientation of the comics Hulk, all the main characters were exchanged. Betty Ross is now played by Liv Tyler. Tyler doesn't really fit into the role. Her charisma comes more naively over and the prehistory with Bruce Banner, one does not look at her. Also General Ross was now taken over by William Hurt. Like his predecessor Sam Elliott, Hurt also has a good screen presence and costs it completely. The main opponent is Emil Blonsky this time and is played by Tim Roth. Although Roth is motivated by his role, and he also sees that he is buckling, he also seems a bit stunted. One could have afforded more freedom for Roth.The director's post took over this time Louis Letterier. Letterier relies more on action and effects than on figure drawings. His predecessor Ang Lee had rather told it as a romantic comic book fairy tale. Although Lee was rather lengthy in his history, Letterier is rather superficial. My favorite scene is when Hulk hits Blunsky for the second time. Blunsky says dry: Is that all? And you can see that in this version a bit: Is that all? Was that all? Conclusion: Better a few effects less to work out the screenplay better!"
    },
    {
      "rating": "7",
      "text": "Underrated movie. in my opinion it's a good movie, edward norton is very good as the hulk, the action sequences are also very good! and it has a solid story!7/10"
    },
    {
      "rating": "7",
      "text": "Not as good of a starter movie as the first Iron Man but it gets the job done. The action is well made and the CG scenes are good looking. The casting roll seems a bit weak at first but you will get used to it. It is of course better than the first Hulk movie released few years prior to this one"
    },
    {
      "rating": "8",
      "text": "The Hulk is one of my favorite characters and I thought this movie was very good. A bit slow in the middle but the finale was well above to great. Sadly, I think the Ang Lee version of Hulk , killed this movie's appeal somewhat at the box office. Production values are high and it follows the source fairly well. Under rated in my opinion."
    },
    {
      "rating": "7",
      "text": "I honestly did not think this movie is as bad as people say it is. I mean sure some of the sriptting wasn't great and maybe the viallin could have been better. But still Edward Norton was not that bad he was pretty good."
    },
    {
      "rating": "7",
      "text": "When I first watched this movie, I honestly didn't like it that much. Mark Ruffalo not being in it also put me off. I thought it was the worst movie from the MCU.  But today I've watched it again and my impressions are more positive than last time. I think it's an OK Hulk movie for 2008. It holds up decently in 2021. Edward Norton did a good job. Tom Roth also plays a fairly decent villain. I've seen worse.And it's just really interesting to think how this and Iron Man kick-started the entire Marvel Cinematic Universe."
    },
    {
      "rating": "3",
      "text": "An extremely uninteresting movie with boring characters, underwhelming action, and a surprising lack of a resonant story. It goes out of its own way for fan service and clichés that fall flat. At least it's atrocious to the point it's funny at times, which is the only saving grace of this... abomination."
    },
    {
      "rating": "4",
      "text": "This movie is honestly bad. The effects are terrible the action scenes are forgettable and the villain while looking cool is again pretty meh, and overall the movie is just kind of below average. The acting is okay overall Edward Norton was okay but Mark Ruffalo is way better."
    },
    {
      "rating": "6",
      "text": "\"Incredible Hulk\" is better than I expected thanks to a powerful performance by Edward Norton, amazing (green) CGI, and a great head start of Marvel studio's \"Avengers\"."
    },
    {
      "rating": "10",
      "text": "The Incredible Hulk is better, bolder and more explosive than Ang Lee's 2003 film. Edward Norton is Bruce Banner a scientist whose experiment fails and he becomes a violent green mutant. This film's special effects are amazing and Norton delivers better acting than Eric Bana in the 2003 movie. The Incredible Hulk has strong emotion, awesome action and breathtaking visual effects. The cameos by Stan Lee and Robert Downey Jr are funny and effective. This film is also a step up for The Avengers. The story is excellent and Liv Tyler rocks. This is one of the best, smashingly great films of the year. Thanks to director- Louis Letterer, the Hulk has more comic based fun and less boring action as Ang Lee's Hulk. Awesome, Epic and Humongous fun- The Incredible Hulk is breathtaking."
    },
    {
      "rating": "10",
      "text": "Wow, I forgett the last horrible hulk film, this is a great example of good superhero film, because Hulk have a great story, and this film is fantastic, the cast is awesome, a great title."
    },
    {
      "rating": "9",
      "text": "The Incredible Hulk is a great movie and an MCU Movie I feel like this is the most underrated MCU movie out there I don't have really any issues this movie is different from the regular MCU movie which I thought was better, to be honest, I like everything about this movie the characters are great Hulk looks amazing my fav he was looked even with the other hulk in the MCU that I really don't like Bruce Banner is amazing the other Bruce Banner I hate I like the couple in this movie with Bruce Banner and Betty I like the whole military thing they have going on the general wants to use it as a weapon and Bruce is not trying to let them have it the only one thing I dislike is Abomination I think he did that for no reason to become that for what to wreck the city nice idea? I did like the end fight I just don't like Abomination in the movie sadly all round an underrated MCU movie I wish we had this hulk and Bruce Banner in the MCU movies sadly we don't still have an underrated movie so I give The Incredible Hulk an A-"
    },
    {
      "rating": "9",
      "text": "Better than the previous garbage movie Hulk, it really stay true to the character and makes for one of Marvel's best super hero movies yet, a must see for fans of the comics."
    }
  ]
}