{
  "id": 37,
  "title": "The Intouchables",
  "starring": [
    "François Cluzet",
    "Omar Sy"
  ],
  "runtime": 113,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/323BP0itpxTsO0skTwdnVmf7YC9.jpg",
  "categories": {
    "plot": 8.121951219512194,
    "acting": 8.653846153846153,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 8.642857142857142,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I don't see how anyone could not like this movie. The acting is good, the story reaches out to you, at times it is genuinely touching, and a moment later you will find yourself laughing in your chair. If you get the chance, see this movie. The great feeling you're left with alone is worth the money.I went to see this film with six or so friends, and while we're usually quite divided on whether a film was good or bad, we all agreed that this is one of the best movies you can go see this year."
    },
    {
      "rating": "10",
      "text": "Amazing movie, although this film is about 2011, I just watched it last week, you can laugh, you can cry, but is inspirer, that kind of movies that change your life. Great music, Omar Sy was very well,  François Cluzet too. I can't understand how anyone couldn't like this film."
    },
    {
      "rating": "9",
      "text": "We need more movies like 'The Intouchables' that touch you, probably make you cry, but for sure make you laugh. Inspiring movie actually, from one side to be more open-minded, not so boring within the limits of normal and on the other side to fight no matter in what situation you are in. Honestly, I cannot see flaws in that charming in this charming dramatic comedy."
    },
    {
      "rating": "9",
      "text": "When  a snapshot in the life of a tetraplegic is the feel good movie of the year for me, I know I have found a gem.  Interestingly enough the main reason for this is the performance of the unknown to me Oman Sy, playing the role of the caretaker, oozing with innocence, charm and energy.   The always excellent François Cluzet managing to express himself without lifting a finger, the solid direction of the two film directors and screenwriters, who based their movie on a true story, only made the whole project one that you'd want to watch again and again."
    },
    {
      "rating": "10",
      "text": "Очень душевный и смешной фильм!\rВ фильме есть хорошая атмосфера,классные шутки над которыми я реально смеялся,как в лучших комедиях Джима Керри,а так же имеется драма,если честно я не рыдал,но осадок на душе после концовки остался.\rОчень советую данный фильм к просмотрю всей семьёй,в нём хоть и есть пара пошленьких шуток,но их немного и они очень смешные!"
    },
    {
      "rating": "10",
      "text": "This movie is an absolute masterpiece. \"Professional\" critics, get over yourselves and watch it again instead of rating boring turds like Civil War and 10 Cloverfield Lane at 100."
    },
    {
      "rating": "10",
      "text": "The reason so many critics didn't like this movie is because it makes fun of being a self important prick and a snob who's willing to pay 11 000 euros for a painting because they see a meaning in it no one else does.\r Honestly can't understand how anyone can't have a smile on their lips and a tear in the corner of the eye after having watched this movie. Absolutely fantastic, heartfelt and funny, and maybe most importantly: It felt real."
    },
    {
      "rating": "10",
      "text": "The interaction between Driss and Philip is light-hearted, thought provoking and meaningful. The story is human and plays on current issues that we are facing with today. I really liked it as it was able to relate to me  to my real life situations and the different ways I can approach them."
    },
    {
      "rating": "10",
      "text": "The best films I have ever seen is «The Untouchables», starring Francois Cluzet and Omar Sy. Film won more than 10 awards around world. The box office is more than $440 million. It is one of the most high-rated film and worldwide total of sold tickets is 50 million.\rThis is the story about rich person Philippe and his servant Driss. Philippe is disabled and cannot do anything without help. Driss is poor emigrant, who is looking for good and easy way to earn money for his huge family. The film sets in Paris and beautiful views of the French capital contribute to show a glorious atmosphere of the narrative and take viewers from the first minute. The excellent acting skills perfectly show emotions and feelings of the characters.\rIt is not so easy to find a kind film for the whole family with deep meaning and morality about real life, not cartoon’s imaginary world. In my opinion, The Untouchables is exactly this type of films. People of all ages will find something interesting and funny for themselves.\rI strongly advise you to go and see the film."
    },
    {
      "rating": "10",
      "text": "best movie ever! fun great story exelent actors\rthank you!\r best   best    best movie  movie  movie  movie   movie    ever   ever  ever   ever   ever"
    },
    {
      "rating": "9",
      "text": "\"The Intouchables\" é um filme magnífico. A atuação de Omar Sy e François Cluzet é fenomenal e a história é genuinamente tocante e engraçada.9/10"
    },
    {
      "rating": "9",
      "text": "\"Intouchables\" is a fantastic movie filled with humour, surprise, depth and character. The incredible music and cinematography help to drive home this unique story that impressed at almost every step."
    },
    {
      "rating": "8",
      "text": "This popular French import (last year's most viewed film) will likely prove a hit here. It's about a rich invalid who hires a black ex-con from the \"hood\" as caretaker. The seemingly incompatible combo turns out to be perfect partnership of support, humor and friendship. Both of the leads are endearing and the story moves with a lively attitude and plenty of laughs. Expect to be charmed, touched and entertained."
    },
    {
      "rating": "10",
      "text": "This is the feel good movie of the year for me. To think that it was based on a true story. There are a few bright spots still on the horizon, it seems. Improbable pairing of the two principals, but it worked."
    },
    {
      "rating": "8",
      "text": "Definitely worth of watching, with a great sense of humor, reality and a little bit of magic! After all Intouchables make me feel as good as main characters in the movie."
    },
    {
      "rating": "10",
      "text": "This movie is great and the actors too the storyline is very good and i hope it became a episode 2 then this is actually the best movie sorry for my bad english im german :D"
    },
    {
      "rating": "10",
      "text": "It's a freakin classic. Great movie, unless you are a jaded cynic. This is probably the first movie I gave a ten. And even though I am kind of a film expert, I based this rating solely on how I felt while watching it."
    },
    {
      "rating": "10",
      "text": "This is a must see!  Everyone I've recommended it to has thoroughly enjoyed it.  Unless you are a total cynic or movie snob that has to have dark twist or inexplicable plot, this is a movie to be enjoyed"
    },
    {
      "rating": "9",
      "text": "Thanks to all strong cast and smooth direction, Intouchables was crowd pleaser. Never stop laughing during the movie, Intouchables was really that good. Although it is super hilarious, the subject is serious."
    },
    {
      "rating": "9",
      "text": "As a friend said, it is the depressing serious films about death and suicide that get the high critical praise. she will no longer seeing anything rated over 70 for fear that it'll be a downer. This one  is delightful, funny, suspenseful ...and slightly fluffy. I'd recommend it to anyone."
    },
    {
      "rating": "6",
      "text": "Intouchables is a peculiar film, because is so different from what we have seen, speaking only about the way that the plot is developed, however the plot itself is not original. This picture treats topics such as humanity and feeling humanized. Philippe is a quadriplegic millionaire and everyone treats him like someone with a condition, until he meets Driss, a black man who had been recently in jail. The thing that captivates the protagonist is that Driss forget about his condition and treats him as an equal; Philippe finally could feel like a real human being.\rAnother interesting thing of the movie is the title Intouchables, referring to Philippe and Driss, because they both are marginalized from the society, the first one have a condition and the other is an ex-convict. All this can be notice in the relation that this both men have with their families. Ones go to the birthday of the millionaire just to see if he is still alive, and the others kicked out Driss from his home.\rDespite the film is very slowly, the humor is great and sophisticated. Plus a mix of classical-disco soundtrack, good direction and unexpected performances, highlighting the one of Omar Sy, this is a pleasant feature, not intouchable at all."
    },
    {
      "rating": "9",
      "text": "Amazing movie! Really funny and really touching. A very well-spend 2 hour trip into the lives of these two interesting men. Omar Sy is really funny, also the second or even third time you're watching the movie and I really enjoyed the camera angles as well. Rightly the most successful French film in years: a must-see movie!"
    },
    {
      "rating": "9",
      "text": "I am uncertain as to what I can find to criticise about this movie. It is a joy from beginning to end. The subtle emotional piano music in the background lends it an emotional edge that only enhances the stunning performances of the two leading actors. The comic timing is wonderful as well as the mix of poignant reality and cruel fate.\rThis is so refreshingly different from the pappy Hollywood stories of brotherhood we see that it genuinely made me think seriously about moving back to Europe. It deserves all the accolades it will receive. Most of all it is a seriously funny movie I laughed and cried."
    },
    {
      "rating": "9",
      "text": "Excellent drama with a little comedy."
    },
    {
      "rating": "8",
      "text": "It is cliche, yes. But it is also an incredibly pleasing, well-acted, often times hilarious, and heartfelt drama. Ludovico Einaudi's contribution to the score is phenomenal."
    },
    {
      "rating": "5",
      "text": "Ok, so I went into this movie not knowing anything about the actors, director, or story so that I could give the movie an unbiased review so YOU could make an educated decision about seeing this film: and here we go. This movie isn't without its charms, believe you me, it will have you giggling one moment and dead silent the next, but its just that. You'll share no huge laughs or be truly concerned for the main characters and the way their lives intertwine. Don't get me wrong, both lead actors play their roles very well, but not enough to draw you truly in to this brief slice of their lives. Some parts of this movie felt like they were thrown in just to fill time and serve no other purpose. I cant give this movie a higher review but it does have its audience: those who need to know their are people out there who have it just a little worse than you do. But you still might not come away with that."
    },
    {
      "rating": "8",
      "text": "For the second week in a row I saw a winner of a movie when I picked to go and see, â"
    },
    {
      "rating": "6",
      "text": "Shredding box office records in Europe, and shedding histrionics to tell a tale of dependence explored by an improbable friendship, 'Intouchables' confirms the enduring appetite filmgoers of all sorts can have for the simplest of stories; ones that aren't fake with bank-breaking void, but full with real shades of humanity. Directed by Eric Toledano and Olivier Nakache, the film revolves around two very different men, each looking for someone or something to mitigate their current situations; circumstances that are far from favorable. The first is a Senegalese immigrant named Driss (Omar Sy) who lives anyway he can. He resides in the crime-ridden projects outside Paris, France, where he commutes by foot, and is in the process of recovering from his stint in prison that's lasted six months. Looking to find a solid line of employment, one that will limit his time off the streets, Driss lands a job as a caregiver to an affluent quadriplegic Phillipe (Francois Cluzet). This premise provides the framework for the evolving relationship of two very different people, joined together by means of business. While the film does make certain of its \"based on a true story\" visage, it, in reality, is far more fictionalized than true (the real-life Driss, for example, was an Arab named Abdel). When asked why the filmmakers opted to make the casting change to include a black aide, they made the case they wanted Omar Sy. That's fine, he is more than qualified; he did beat out Jean Dujardin's role in \"The Artist\" for last years French Cesar Award. However, some of the scenes he's in, feel overly cliche, corny, and forced; think \"Earth, Wind, and Fire.\" Moreover, as a whole, 'Intouchables' also contains a great many plot twists and character developments that seem to come from nowhere at unspecified times. Even more, and vexing of all, is the amount of exaggeration and lingering sense of insincerity that is never quite lifted from the film's intended \"feel-good\" aura; the film tries to offer something so absurdly inconceivable while not explaining how it all could be considered plausible. Instead, one is left to contemplate what might have been if the holey script would have placed more focus on developing the characters, and the situations that surround them. Notwithstanding its continuation of subterfuge, 'Intouchables' is held together by an earnest devotion to humanity, with its writers paying careful attention to delineating stability from adversity, and the persevering will by each man to accept the other, turning what would otherwise be constant cliche into an affecting camaraderie that is brought to form by Sy and Cluzet who possess a surprising chemistry to the screen. Further, while the copious subplots flirt with vapidity, often detailing personal despair, the film remains apt with the frequent gauging and testing of the men's representative comfort levels that the audience can see and feel teetertotter before their very eyes. Ultimately, 'Intouchables' liege disposition to value interpersonal affection over flattering dishonesty solidifies its connection with audience, and almost compensates for its few-too-many moments of self-inflicted abashment. It's the leads who salvage this lightly-intense European-pop-culture-phenomenon. Don't like it...you can blame the French."
    },
    {
      "rating": "8",
      "text": "The film has been officially crowned as the most successful film in French domestic market (Frenchâ"
    },
    {
      "rating": "8",
      "text": "Movies based on true stories are often the best. this is a very emotional story that makes me whine as much as it makes me laugh. When there's only good people you're gonna see a wonderment."
    },
    {
      "rating": "10",
      "text": "A soulful and near-to-perfect French language drama film written and directed by Olivier Nakache and Eric Toledano, The Intouchables is one of the most genuine surprises of this year. I had no idea how great this film would be and I am very, very glad that I had been waiting to watch this for a long time. The excellent incorporation of drama, slight humor, good song selection, delicacy of the intense joyful/saddening moments and those silly jokes are what make this film so great. The direction is so superb at times that even the saddening moments can make you laugh at times with the inclusion of those silly jokes.\rOf course, the review would be incomplete without mentioning the wonderful performances by Omar Sy and Francois Cluzet, that are totally worth appreciating. They are the souls of this film, they generate that fantastic charisma which is enough to keep you interested in the film. The storyline is fresh, as it is also based on a true story and it moves you emotionally and what's best about it that it doesn't deviate from the true purpose of the movie despite the fact that it covers almost every aspect of drama in a single plot. I'm not going to spoil it for you by discussing the plot of the film.\rThis film has done much business on Box Office in France and it may also be the biggest blockbuster because it is that great, people are really loving it. I LOVED IT. It has also been shortlisted in the Best Foreign Language Film category of 85th Academy Awards. This is an honor for a film to be selected out of more than 70 films submitted for Best Foreign Language Film Oscar. Additionally, it is also nominated for Best Foreign Language Film category of 70th Golden Globe Awards. Don't read critics' reviews and take a pass on this one, this movie has much to offer once you are ready to accept it.\rLong story short, The Intouchables is one of my top favorite films of 2012."
    },
    {
      "rating": "10",
      "text": "great movie,this is a must see!!!so positive and great sense of humor,also the storyline is great,i recommend it to everybody,hope they make the episode 2"
    },
    {
      "rating": "9",
      "text": "A very beautiful movie. One of of the best movie it's based on a true story. The actors are good and some times it is funny. I like this movie a lot. This is just an awesome movie."
    },
    {
      "rating": "9",
      "text": "Brilliantly acted, and thoroughly enjoyable film.  It's quite a simple idea, bastardised from a true situation. You can also enjoy the outraged US reviewers, one of whom says that the film will need a big re-write before being unleashed as a US release, because Americans are so much more sophisticated and class-conscious than those simplistic, crass Europeans.  Priceless."
    },
    {
      "rating": "9",
      "text": "The inouchables is the best french movie i've ver seen. It dark humor shines through the cracks made by the drama. The intouchables goes where other comedies do not dare to come and bring the \"really wrong\" humor at perfect moments. The comedy parts would probably get a 10 in my opinion however the drama parts are sometimes a bit sloppy. Furthermore I didn't like the ending, however it stil was acceptable. My compliments go to the two main actors and the writer of those dark jokes, really loved those !"
    },
    {
      "rating": "9",
      "text": "I enjoyed this movie very much, I don't understand the negative reviews given by the critics. Yes perhaps the movie was a bit predictable and unrealistic but overall the story was  touching, funny and made me smile the whole time. It was a nice change from the regular Hollywood slapstick."
    },
    {
      "rating": "8",
      "text": ""
    },
    {
      "rating": "9",
      "text": "No es la primera película que indaga sobre las dificultades de adaptación de la discapacidad a una sociedad donde tendemos a despacharla con una mirada compasiva y sobreprotectora (en los mejores casos). Existen otras muchas donde nos presentan la discapacidad como una fuente de desdicha y frustración, a espaldas de un mundo que sólo ve a un metro del suelo . En Nacido el 4 de Julio, Tom Cruise combatía los fantasmas del Vietnam sentado en una silla de ruedas y en Forrest Gump, Gary Sinise hacía lo propio sumergiéndose en la bebida como única vía de escape a una vida sin piernas. Son historias que muestran el espinoso recorrido a la aceptación de las personas con discapacidad. Pero algo en común tienen todas ellas: que encuentran en la inocencia y en la falta de prejuicios la complicidad necesaria para huir de un entorno donde hallan más obstáculos que comprensión. Intocable es una buena película. Refleja como la discapacidad es mejor entendida desde la inocencia de alguien que vive alejado de los cánones de la corrección y la falsa moral, un joven negro inmigrante de Senegal que vive en los suburbios de Paris, que no ve en la discapacidad una silla de ruedas sino al ser humano que está sentado en ella. Los dos personajes principales tejen a lo largo de toda la película una complicidad que eclipsa las diferencias físicas, culturales y de raza que existen entre ellos. Ambos aprenden el uno del otro como convivir contra la adversidad en sus vidas y fortalecen ese vínculo relativizando los problemas. Subyace el mensaje claro de que la discapacidad debe"
    },
    {
      "rating": "3",
      "text": "A simple story you soon forget. I was surprised over the buzz around this movie, and could not really understand why it got so much credibility. This is a shallow film. Feel good? Not really. Anti intellectual movie, a really simple story about two men in Paris. Things like art, classical music & opera are boring! Drugs, tobacco and soul are good! Come on!"
    },
    {
      "rating": "5",
      "text": "White guilt: the movie. There is something very exploitative about this film, from the music to the casting choices to the plot itself. Obviously Europe loved it, since they have a white guilt complex."
    },
    {
      "rating": "8",
      "text": "Two mens' lives are changed forever once they realize how much they discover about each other's qualities and lifestyles. With 'The Intouchables', a movie based on a true story which focuses on a wealthy man named Philippe (Francois Cluzet) who has been paralyzed from the neck down, and his journey with his friendship with a street man named Driss (Omar Sy). They start out with their different lives where Philippe is looking for carers, but none of them seem to fit Philippe's standards in what he looks for in a carer. Driss decides to apply for being Philippe's carer believing that this could be his fresh start in life. Many of Philippe's friends are concerned given Driss's tough past, but Philippe prefers the not-so-sentimental attitude he brings to his life. \"No pity\" he claims he prefers. We see their relationship grow as they become more fond of each other as time goes on. They also start to get to know each other better, and it seems that their friendship will never be broken. I admired the good nature and cheerful tone that this film brings. It will warm even the most cynical movie-goer, and the performances by the two lead actors are fantastic. It goes without saying that 'The Intouchables' is one of the best movies about friendship."
    },
    {
      "rating": "6",
      "text": "If you have seen enough movies or series you will quickly figure out the only way \"The Intouchables\" can unfold. Surprisingly, it's still very enjoyable to watch it."
    },
    {
      "rating": "8",
      "text": "As a former carer to a quadriplegic worst off than Philippe physically, I can identify with this movie...these situations do occur and ultimately 2 people from different worlds can and do come together like this and often form a bond that can last forever, so I don't really see it as being far fetched at all. As for the way the movie communicated the story, I think it does a great job, sure it may gloss over the realities of such a relationship but I don't see how else this story could have been told...both became better men, and when that happens, the world becomes a better place..."
    },
    {
      "rating": "7",
      "text": "Well, it's no \"Un Coeur en Hiver,\" but this French film is fun and heart-warming. I think most of us can relate to the satisfaction of two people who somehow find in each other exactly what they needed at that point in their lives. Have to say I felt discomfort at times at the minstrel-like role of the African character (perhaps less than some of the pious reviewers). But art and music are enjoyable motifs as the two men learn to appreciate each other  and despite leaving no cliche unturned, the film leaves you happy."
    },
    {
      "rating": "9",
      "text": "Great movie. It made me laugh it made me cry and overall I had a great time watching it. In fact I watched it several times and I suggest you do the same. It is based on a true story which makes the story much more interesting. The chemistry of the main duo is great the actors are amazing and the choice of music is epic...\rPlease do watch it!"
    },
    {
      "rating": "8",
      "text": "A very good movie, feels like the movies filmed back in 90s, nice actors, based on the true story. There is no drama, there is no story twists, but there are some good jokes. And the best thing that the movie is touching."
    },
    {
      "rating": "7",
      "text": "Genial e ao mesmo tempo cheio de falhas porém divertido"
    },
    {
      "rating": "8",
      "text": "Adorable true story about love and friendship! Such a great example of two completely different people being together! This movie deserves to be watched at least once"
    },
    {
      "rating": "9",
      "text": "The Intouchables is an outstanding French movie, one of a few witch makes me cry, the movie is beautiful, shows that sometimes the most simple person is the greatest one, a real axiom for life, just beautiful, one movie that everyones need to see and think long and hard about it."
    },
    {
      "rating": "9",
      "text": "Honest, true and heart-touching, The Intouchables tells the story of an incredible friendship between two persons with very different origins: one is rich yet while the other is poor; one is an invalid while the other is ordinary. Above all, however, what makes this movie worth watching is the way they manage turn from the initial employer-employee relationship to a close friendship, which makes is so strong that everyone may cry after watching the movie. With strong, solid, convincing performances from the two leading actors,  The Intouchables deserves a ten without question."
    }
  ]
}