{
  "id": 349,
  "title": "The Hunger Games: Mockingjay - Part 1",
  "starring": [
    "Jennifer Lawrence",
    "Josh Hutcherson"
  ],
  "runtime": 123,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Thriller"
  ],
  "description": "Katniss Everdeen reluctantly becomes the symbol of a mass rebellion against the autocratic Capitol.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4FAA18ZIja70d1Tu5hr5cj2q1sB.jpg",
  "categories": {
    "plot": 6.369565217391305,
    "acting": 6.065217391304348,
    "ending": 5.153846153846154,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 5.5,
    "funny": 10.0,
    "action": 5.5625
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Three words: Shameless Cash Grab. The movie lacks any real emotional connection with Katniss and company. Once again The Hunger Games expects us to care about a host of underdeveloperd characters (like Liam Hemsworth for example who had about 5 minutes screen time in the previous two outings). The film panders to teenagers full of angst. The film hits a few mildly interesting notes on propaganda and power, however these are drowned out by Katniss listening to her hormones rather than her head. This film is not a '10'. I haven't read the books so I like many others don't care if Mockingjay - Part 1 resonates with those who have"
    },
    {
      "rating": "10",
      "text": "This movie has an wonderful plot and telling the story in the best way. the actors are incredible, like Josh Hutcherson, Liam Hemsworth and the amazing Jennifer Lawrence that, like always, shine as Katniss Everdeen and moves you. They made some changes in the way of telling the story but it still great and In the end of the movie you will think: \"when does release the part 2?\""
    },
    {
      "rating": "5",
      "text": "The movie was okay. I enjoyed Jennifer Lawrence and Philip Seymour Hoffman's performances. The movie was filled with over-extended scenes but I wouldn't consider them boring. Liam Hemsworth`s character has been under-developed the entire series and it continues in Mockingjay. Many other characters are also under-developed and seem to just pop in at random places. Overall I feel like they could've made a 3 hour movie to sum up the series rather than making two but they make more money this way."
    },
    {
      "rating": "4",
      "text": "Fairly tedious, and a bit of a disappointment after Catching Fire. Not much happens. Basically everyone hides down a hole while the facility gets bombed. Yawn. Moderately interesting political sub-plot though, and reasonable performances from Moore and Lawrence. Hoffman's performance mostly consists of eye rolling and implied tension about something or other - presumably this will be revealed in the next movie. Darkly filmed (ie mostly down a hole) and variably directed. Hard not to agree with other's perceptions that the principal focus here is on extending the movie franchise to allow for more extended wallowing in teenage angst."
    },
    {
      "rating": "7",
      "text": "Another exciting addition to the Hunger Games franchise, Mockingjay Pt. 1 makes for an insightful look into propoganda, politics and rebellion. It doesn't matter that this is an introduction to the grand finale, the film uses its time well and is every bit as thrilling."
    },
    {
      "rating": "7",
      "text": "The lack of action and Liam Hemsworth are not helping this movie whatsoever, but this movie as a propaganda film is actually quite intriguing!"
    },
    {
      "rating": "7",
      "text": "Mockingjay: Part 1 is the first instalment of the split in two series finale. The majority would argue that splitting the final instalment of the series into two parts is an unnecessary money spinning gimmick. Whilst the minority would argue that it allows the story to breath. Regardless of whether it's for financial gain or not on the studios part, ultimately as a viewer I want to be entertained and in terms of content I want value for money with any film. But as a standalone film I'm not entirely sure if Mockingjay: Part 1 justifies itself. Considering it's lengthy running time, this so called split down the middle Part 1 doesn't seem to cover much content. But then again this penultimate instalment of the series is telling a very different story to it's predecessors. And although this film does feature integral information, as a viewing experience it does sacrifice action and thrills for politics and character development. Jennifer Lawrence is strong again in the leading role. I wouldn't go as far as saying this is her weakest performance in the role to date, but she doesn't seem to have as much to do this time round. The supporting cast benefits from the lack of set pieces though and the screen time is well balanced between all of returning and new characters. Most notably Liam Hemsworth who has much more involvement and Phillip Seymour Hoffman and Jeffrey Wright's input is more integral. Of the new cast members Julianne Moore and Natalie Dormer in particular are welcome additions. For all the characters we don't see so much of, their screen time will certainly be made up in Part 2. Once again Francis Lawrence's overall direction is impressive and even though the set pieces are limited, for what there is of them they are all enjoyable. Personally what Part 1 archives most though is a greater sense of scale and exploration into the wider country of Panem. Overall I was entertained, interested and there's no doubt that this platform sets up what should be a superior second instalment and an incredible series finale. But as a standalone film this isn't as re-watchable as it's predecessor and it's my least favourite of the series to date."
    },
    {
      "rating": "7",
      "text": "To say Mockingjay Part 1 is bad because it focuses on story more than action I like saying you shouldn't eat lobster because it has a shell. Any franchise is going to have movies where not much happens movie-wise, but plenty happens plot-wise. With a lobster, you first have to crack open its shell to get to the sweet meat, but you know it's worth it in the end. Think of this movie as the shell you had to crack open first to get to Mockingjay Part 2, where a strong, dramatic climax is bound to happen, and it will all be worth it."
    },
    {
      "rating": "4",
      "text": "If you feel like you were left hanging after Catching Fire, then you need to see Mockingjay, but don’t be in any rush. I would give the movie a 4/10, compared to the first two movies  Mockingjay Part I was a disappointment. I was impressed by the acting done by the late Philip Seymour Hoffman, and most of the acting done by Jennifer Lawrence was great, but it didn’t match her performance in the first two films. Hopefully part two will make up for part one.\rTo catch you up, after Katniss (Jennifer Lawrence) was taken up into the aircraft at the end of Catching Fire you learn that there is a plan to spark a rebellion in Panem. Rebel President Alma Coin (Julianne Moore) and Plutarch Heavensbee (Philip Seymour Hoffman) plan to use Katniss as the vehicle to fuel the rebellion. As you learn in Catching Fire, Peeta (Josh Hucherson) has been taken by the Capitol to threaten those who go against them and torture Katniss.\rThe first 45 minutes of the movie are boring and depressing to say the least. I felt like the whole movie was basically the Rebels’ creating propaganda videos to try and rally the troops, and Katniss going through various states of emotion. One second she would be sad the next scared and the next happy. The thing that bothered me the most about the movie was how long it took to reach the climax. You don’t have any feeling of suspense or anticipation until the last fifteen minutes of the movie. The creators also expect us to care about characters like Katniss’ family and Gale (Liam Hemsworth) when they only get like ten minutes on the screen. Also, I believe the whole part one and part two setup they decided to do to the film is a desperate cash grab to try and get people to come spend money to see the ending next year.\rOne thing I thought the movie did a good job of is creating the dystopian/revolution mood. It felt like the whole movie was in dark lighting which set a gloomy atmosphere. Also the settings of many of the scenes took place in areas destroyed or in shambles, giving it the dystopian mood. One more thing I thought was done well was the placement of action scenes spread around the movie, they were all well placed throughout the movie.\rTo conclude, there were things done well such as the settings and mood as well as the acting done by Philip Seymour Hoffman, and most of the acting done by Jennifer Lawrence. Despite the few good things, the movie was still bad. The lack of climatic events during most of the movie, the vapidity, and lack of character development made this movie bad. So in my opinion if you’re planning to go see it, save your money, and wait until it’s on Netflix."
    },
    {
      "rating": "5",
      "text": "This third instalment of THE HUNGER GAMES arrives as appointed, although the money-grubbing manoeuvre to divide the final book into two movies can automatically repel those who are not in the fan-base, and feel disgusted by its rapacious appetite. Actually it is where I belong, unfortunately, Moore is the new addition in the cast, as President Coin, leadership usually is not in her wheelhouse, remember CHILDREN OF MEN (2006, 9/10)? Plus my perfectionist side urges me to continue since I have watched the first two THE HUNGER GAMES (2012, 7/10) and THE  HUNGER GAMES: CATCHING FIRE (2013, 6/10), for better or worse, I will definitely watch the final chapter next year to wrap it up, sorry to fall into the machination of capitalistic greed. However, I will keep a clear mind to next year’s INSURGENT (2015) and MAZE RUNNER: SCORCH TRIALS (2015).\r continue reading my review on my blog, google: cinema omnivore. thanks,"
    },
    {
      "rating": "10",
      "text": "Much like the book, it is a grimly dark turn in the story with fascinating character development and political awareness. The cast is once again phenomenal, and Francis Lawrence continues to excel in accurately capturing this world. The fact this is a Part 1 means less than nothing to me; I loved it."
    },
    {
      "rating": "8",
      "text": "Thjis movie was fantasic. Once again, Jennifer Lawrence and Josh Hutcherson make movie magic in possibly the best in the series so far. It also probably helped that Lorde loanes her voice to the movie."
    },
    {
      "rating": "9",
      "text": "The Hunger Games: Mocking Jay, was very close to a perfect movie. Jennifer Lawrence delivers an emotionally intense, but believable Katniss Everdeen. The Characters portrayed were intelligent and believable. At no point did they make choices that would seem illogical or out of place, simply to drive the plot forward... (with one small exception) like in so many movies these days.\r The movie was genuinely inspiring, and generally unpredictable. Leaving the audience squirming in their seats as they try to anticipate the coming scenes. Certainly I am glad to have never read the books, because knowing how things would have played out would have ruined so much of the suspense and intensity. At no point was I bored, choosing to hold my bladder for the final half our, so as not to miss a moment.\r EXTREME SPOILERS AHEAD, only for those that have already seen the movie:\r My only small gripe, the only thing that makes this movie not completely perfect, (and this is certainly a subjective opinion) is President snow's choice to allow the rescue-team to recover the tributes from the capitol. Sure, one of them had a small chance to kill Katnis, sure she would feel emotional trauma at the pain inflicted on Peta, but I imagine it would have been a lot more effective to execute them, than to give them such a moral boosting victory and allowing them to save more important figure-heads of the rebellion. This decision did not seem as smart, nor as sociopathic as I imagine President Snow to be. I can live with writing this off as President snow being rather demented and therefor somewhat unpredictable, but not without a little reservation."
    },
    {
      "rating": "6",
      "text": "This movie had so much net worth and lots of good effects. As an avid reader of the books, I was disappointed by the over-use of sad atmosphere, as it ruins the effects a bit. It was good, but not as good as it aimed to be."
    },
    {
      "rating": "5",
      "text": "\"The Hunger Games: Mockingjay Part 1\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: For the most part, the cast turns in solid performances. Julianne Moore starts off stiff, but eventually finds her way and does a good job. The late Phillip Seymour Hoffman was excellent, though that is to be expected. Josh Hutcherson and Liam Hemsworth are once again adequate and I had no complaints there. Donald Sutherland, however, was hands down the best part of the film. While his scenes were few and far between, he dominated the screen every time he appeared. He seemed to enjoy playing the villainous President Snow and it shows. The last 30 minutes of the film are solid and somewhat entertaining.\r The Bad: Sadly, the film is slow and boring to the point that it is difficult to watch. Very little of note actually happens for the 1:30 of the movie and I found myself wanting it to hurry up and just end. Jennifer Lawrence did her best with what she had to work with, but spent the bulk of the film sobbing and crying at every turn. You'd think that a strong character like Katniss, who has seen and been through a LOT at this point, would be able to hold it together. I gave the first two films an 8.0 out of 10.0, so this is a massive letdown and I hope that the final film in the series has much more to offer."
    },
    {
      "rating": "4",
      "text": "The final novel in the hunger games series was filled with suspense and political tension.   This movie however, was none of that.  With the film dumbed down significantly to fit the simple mind of today's youth, it delivered very few of the political themes that made the last installment great.  It also suffered from extremely one dimensional characters that made the film an all out \"snooze fest\" that even the star power of Jennifer Lawrence and Woody Harelson  couldn't save."
    },
    {
      "rating": "8",
      "text": "Hunger Games Mockingjay Part 1 is an entertaining movie. Though there was barely any action in the movie and less like a hunger games movie, it was still fun to watch. It is still a huge step down from Catching Fire with a twist."
    },
    {
      "rating": "5",
      "text": "Compared to other parts of the Hunger games this one really lacked something in my opinion. I mean, there weren't that many story parts in the movie and not much happened in my opinion, which would be worth mentioning. I think they just strecthed it out to two parts so that it would make more money (talking about Mockingjay parts). There weren't really much of emotional parts or really anything that interesting happenning which would make this a stand out movie. Not that it was a boring movie, but I think much more was expected from it. What I did like was the soundtrack though :)"
    },
    {
      "rating": "6",
      "text": "The attempt to split the final act into two films is a mistake often seen nowadays and it ends in the same result every time. Whilst on the most part the Hunger Games: Mockingjay Part 1 is an engaging movie, it is a distinct drop in quality in comparison to the two previous films. The film is far too slow paced and fails to capture the audience from start to finish. Despite this, there are redeeming qualities that make this film enjoyable to watch. The exploration of propaganda and the harsh realities of war are at some points demonstrated to perfection. This is not enough to justify the final act being split into two films however."
    },
    {
      "rating": "5",
      "text": "Pretty mediocre, I get this is a set up for the finale, but it was boring, Deathly Hallows part 1 did the splitting of the books better. This just felt like a waste of time."
    },
    {
      "rating": "4",
      "text": "'Mockingjay Part 1' is a reminder that splitting and dragging out a relatively small book into two films, while a great financial scheme for studios, kills the value of its story. Where 'Catching Fire' had those who hadn't read the series, (Me!,) captivated, Part 1 crashes back to reality, and reveals the flaws of the franchise. Katniss, a character you could root for as a strong female protagonist, falls right back into the Hollywood trap of being entirely dependent on a man, and even manages to make her more gullible, naive, and unlikable than she ever was in the first two films. The story's initial premise, as a battle of political ad campaigns, with both sides taking their shots back and forth, is interesting, but falls victim to slow pacing a repetitive story points. While  'Catching Fire' managed to infuse its political commentary into an engaging story, here we are treated to overblown politics with very little engaging action. The supporting cast is a delightful but wasted treat, as former Academy Award winners are pushed into mainly support roles. This includes the late Phillip Seymour Hoffman, a real beam of light in the previous film, whose character serves no real arc in this part of the story. The plot suffers from the two-part problem, as there is no real pay-off or development of the characters, and it ends more abruptly and confusing than its predecessor. The movie grinds to a halt in some areas, with fake-tension scenes that have no real bearing on the overall plot. It comes to a breaking point when Katniss is literally teasing a cat with a flashlight, and suddenly discovers a realization she should have known from near the beginning of the film. Overall, a huge letdown based on what the previous films had set-up.  Instead of leaving the non-book reading viewers wanting more, it leaves us with more of a deep sigh and leaves us wondering why we devoted our time to this series in the first place."
    },
    {
      "rating": "6",
      "text": "Pure BOREDOM this movie is pointless, like Part 1's always are, nothing interesting happens like at all!!!!!! I don't recommend this movie, but the first and second one are pretty good so just watch or rewatch those."
    },
    {
      "rating": "9",
      "text": "The darkness of the film has made the series that much better. Mockingjay Part 1 incorporates some of the best scenes the series has had to offer so far."
    },
    {
      "rating": "7",
      "text": "Though overstuffed with characters that don't do anything, the tense 'The Hunger Games: Mockingjay - Part 1' soars with a realistically provocative political subtext and faithfulness to it's source material."
    },
    {
      "rating": "9",
      "text": "I am shocked to say I loved this movie. In fact I liked it nearly as much as Catching Fire and that movie was great! We have a very well done and very solid build up to what will be an enthralling finale to the Hunger Games saga."
    },
    {
      "rating": "4",
      "text": "This movie confused me. There is a part where she is looking at all the burnt corpses of her compatriots that makes me feel like it is trying to be a gritty war movie. But in the end it was just a girl adventure movie with the obligatory romance, crying scenes, and romance cliche #496 the part where the two lovers don't understand each other. PETA I mean Peeta at one point turns evil only for the reason to justify Catpiss being sad and angry. I am genuinely baffled how popular this movie is not worth my money."
    },
    {
      "rating": "0",
      "text": "What is it with the Hunger Games? Why is it that people everywhere treat it like its Shakespeare? Its just a teen novel based around an illogical Dystopian society.  I haven't read the books, but i have seen the movies, and if the movies are anything like the book then I don't know what to do.\r This whole movie is just this: a commercial for Katnis. Plain and simple. It's for this whole, \"epic revolution\" that is occurring.  But it is so boring; so uninteresting it amazes me at how much people like and praise it.\r My first gripe is that Katnis, or specifically Jennifer Lawrence has one expression throughout the entire movie,( surprising that she won an Oscar). She never smiles, she rarely cries,(only at the end,really), etc. \"But she is experiencing great pain over Peeta!\" Well, Peeta baisically did nothing so I don't know why. Also, Peeta? Just because his parents were bakers doesn't mean he should be named after a type of bread!!!!\r This whole movie is riddled with plot holes that are so easy to spot it's not even funny.\r 1: They bomb a whole district to rubble yet leave one house practically unschathed, (which I assume is Katnis's house or something). Either the Capital bombes have a really bad aim,( which is highly unlikely since a) they levelled the rest of the district and b) this society is technologically advanced).\r 2. They see Katnis land near a hospital but don't bomb the hospital until Katnis has left. They would have saved SO much time and resources if they just killed her there, but then it wouldn't be much of a movie, would it? AND, technically Katnis is the one who killed all those people in the hospital because she only went there for the equivalent of a photoshoot!\r 3. She takes down two bombers with a bow. \"But she was using explosive-tipped tips!\". Well, aren't bombers supposed to be flying at super-sonic speeds or something and fly at a slightly higher altitude? And this world looks pretty small, so why don't they just use missiles? I think this scene is only in the movie is to make up for how boring the rest of the movie is and o make Katnis look awesome, since she is seen as sensitive throughout the rest of the movie,( also, when she took out those bombers, she looked bored like,\" Whatever. I take down bombers down all the time.\")\r 3. Their base is bombed and,(get this), President Snow PUTS A BULLDOZER LOAD OF WHITE ROSES IN THE CRATER OF WHERE A BOMB EXPLODED. Is this supposed to be symbolic, because to me this is kind of stupid. And, how did he know that Katnis would emerge from that one crater? Did he put roses in all the craters? Also,  one of my favorite parts is where they say they are \"fully operational\" even though they have a 40 foot crater in their base. I am no structural engineer but I think a 40 foot crater is going to affect your operations in some shape or form.\r 4. Bunkers have to have bunkers in them.\r 5. This girl risks her life saving a cat. But, if she loved that cat so much why did she leave it behind in the first place?\r 6. Apparently this dam, that is probably bigger than the Hoover Dam, is the only, solitary power source for the Capital. And the most effective way to take out this dam is not to bomb it, risking less human lives. No, you send a mob of people with three crates of explosives running at soldiers gunning them down, making it look like something out of World War Z. And, the security at the dam is ridiculous. there are only a few soldiers with guns. No mines, turrets, nothing. And let me say the \"Hanging Man Tree\" song is played during this scene. Let me just say; that song had no reason to be in this movie. The producers only put it in here so they could have there own \"Frozen\".\r 7. They break in to this building to save Peeta and they knock the guards out with tear gas even though they are wearing helmets.\r 8. Leaves are bulletproof.\r 9. The ending is so anticlimactic. So basically, President Snow had an oppurtunity to shoot down the jet with Peeta on board. So I though, \"This might get interested. What if he had a bomb in him, taking Katnis out when he is close enough to her.\" But no, they just drug Peeta on meth and it makes Katnis,*tear, sniff*, \"sad\".\r A final note; I think President Snow likes Katnis. It might be crazy, but just hear this out:\r 1. He answers her calls,\r2. He sends roses,\r3. It looks like a love-hate relationship, (explaining why he doesn't just take her out),\r4. He is turned on around her.\r I gave this movie a low rating because people need to wake up; to see that pop culture is misleading and just because of \"PEEEEEEEEEEEETTTTTTTTTTTTTTTAAAAAAAAAAAAAAA\" doesn't mean its a good movie. This movie doesn't deserve a 0, but I am compensating for all the biased reviews out there."
    },
    {
      "rating": "8",
      "text": "Okay, here's the thing:  If you loved the mindless \"games\" of people fighting in an artificially created arena (the first 2 movies), you won't like this one as much.  If you thought the actual \"games\" part of the first 2 movies were cheesy (like I did) you might like this one better.  This movie is about the bigger picture and is grittier, tension filled, has lots of strategy involved, addresses how a full-fledged revolution is born and works on a much higher level IMHO.  I thought this was  the best of the 3.  (Did I miss Effie's outrageous outfits?  Of course, but seeing a stripped down Effie who has defected and seeing how she copes living in an underground bunker without her wigs and costumes was actually more satisfying.)"
    },
    {
      "rating": "9",
      "text": "Great story telling and character development - and mostly true to the books, except for some of the strategy related to the raid on the Capital, but the movie version may actually prove better as it sets up some interesting dynamics for the finale.  This movie was a setup for the final movie - those who have not read the books may be impatient."
    },
    {
      "rating": "0",
      "text": "J Lawrence really nailed the \"one expression throughout an entire 2 hour film\" brief. As for the film, well katniss' s obsession with\rPEEEETTTAAAAA ruined it for me. Want to be the mockingjay and save the districts? \"Where's PEEEETTTAAAAA?\" Here's your mum and sister alive and well despite your district being destroyed - \" great... how could you leave PEEEETTTAAAAA.\" We've lost contact with the rescue team, 5 men and your childhood friend are assumed dead... \"Oh PEEEETTTAAAAA,  PEEEETTTAAAAA,  F***IN PEEEETTTAAAAA\""
    },
    {
      "rating": "5",
      "text": "This was not a bad movie, all the hate that its getting is not really basing it on anything other than some childish hatred for things that are popular. That said, though i did not think this was a bad movie, it left me feeling like the whole thing was a little un necessary. Here's why.\r It felt like filler, now i saw the deathly hallows part one which was basically camping simulator with magic, and this movie felt like propaganda simulator with explosions. The start of the movie was to say the least less than stellar, it had no OUMMPH it was boring and i felt like i was watching a bad episode of ER.\r Katniss FIRES ONE ARROW THE ENTIRE GOD DAMN MOVIE! Holy **** sorry i had to get that off my chest. Very few action scenes, with one bloody excellent Tom Clancy like infiltration scene that was, to be honest, pretty damn cool. Those red lights had me .\r The people of Panau or whatever the planet is called seem to be mindless sheep, following the words of some girl theve never met, not thinking for themselves, throwing themselves in front of bullets and bombing the **** out of damns all because they saw something on TV? It seems like the entire world hinges on the words of Katniss and a few other mildly interesting side characters who dont do much but stand in the backround and eyebrow act.\r Jennifer Lawrence is an amazing actress, dont get me wrong, and there were actually a few scenes where i felt goosebumps when she was recording her propoganda speech, but it felt hollow. Nothing really happened to make this seem worthwhile.\r Also Kaitniss bombed a hospital. I dont know if any one else noticed this but when Kaitniss shot down the bomber, she caused it to crash into the hospital quencing any hope of finding survivors.\r Overall i was dissapointed, it needed more action and less talking."
    },
    {
      "rating": "0",
      "text": "This was the most boring movie I have ever seen. My entire family was bored, even the ones who read and loved all the books and have seen the other movies were bored- we were all bored. I was constantly waiting for some epic fight scene with Katniss kicking some major butt but it never happened. The boring scenes went on for what seemed like forever. Then the movie ended with the entire audience saying \"What?! That's it?!\" It was a huge disappointment to say the least."
    },
    {
      "rating": "9",
      "text": "I don't like movies that don't have endings, but I knew it said part 1. I was certainly seeing a lot of comparisons on what we see in the media versus what really happens. Interesting study on how each side manipulates and distorts the media which affects everyone's lives who are involved. Wonder if that's where ISIS got their idea of doing televised atrocities so they can manipulate us. One critic said this was the first Hunger Games movie with meat, and they're right. Lots of thinking to do when watching this movie on how different personalities handle the same situation."
    },
    {
      "rating": "1",
      "text": "This is one of the worst movies I have ever seen. It is clearly just an attempt at raking in more money. I have read all the books and was wondering how they could possibly stretch the last one into two movies. The entire movie is boring and a waste of the audiences time. Scenes are full of unimportant information and stretch on for way too long. As good as the first two movies were, this one just doesn't live up in any way. The only purpose of it is to give people a reason to pay to go see the ending next year. I was expecting much more and even thought they would have ended it a little later into the story.  This movie feels unfinished and will leave you wondering why they spent two hours telling you a half hour story. The pacing of the first two was great, but this time you will yawn guaranteed."
    },
    {
      "rating": "1",
      "text": "Just saw this movie yesterday with my kids.  BORING, BORING, BORING...everyone thought this film was incredibly boring.  It is nowhere near as good as the others in the series.  It was so BORING I felt like standing up in the theater and saying \"This is the most boring movie ever made in the history of mankind.\"  Of course I didn't do that but it was a major snooze.  How long can we sit there and watch all this emo acting?  What a bomb.  I cannot fathom how you can spend all this money making a movie and ending up with such a dreadful bore.  So I thought, okay, it's just me...I'm an adult and maybe this appeals to tweens or something...but no, my 14 year old was stunned at how boring it was. Don't waste your money on this BORE. ZZZZZZZZZZZZ"
    },
    {
      "rating": "3",
      "text": "Dreadfully boring. Almost fell asleep a few times.\r Not before I realized what a waste of my money the movie was, long pauses of droning dialogue and unlikable characters. The few interesting characters are never developed.\r It's an artform really-- 2 hours of my life and I can hardly remember a thing"
    },
    {
      "rating": "4",
      "text": "Disappointing !. It was just bad, I could not feel emotion in the film, Katniss does not pass any emotion, it seemed very artificial, even the rest of the cast shows this difficulty. And sad, even the action scenes can not save the movie, which I thought would improve, fell too much, the movie was disgusting, the drama did not convey feelings and the characters the same thing. Part 1 was a complete disaster."
    },
    {
      "rating": "2",
      "text": "The first film was pretty good. The 2nd slid somewhat off track. This one has completely derailed. All of the excitement of the games is gone. Instead Katniss (Jennifer Lawrence) is holed up in with the rebels. Since she's won her Oscar, they gave her plenty of tear time. She spends most of the movie angry or sad, while the insurgents mold her image to lead the rebellion. The first hint of combat is almost an hour in and less than 2 minutes long. The only other action takes place entirely inside the security of a bunker. This is clearly a setup for the final installment, so it's best to avoid this one completely."
    },
    {
      "rating": "7",
      "text": "Even more dystopian gloominess in this movie - that's what I liked the most in the previous Hunger Games, not the games, but the enslaved society and an upcoming riot. Th be honest not much happens in this part, it just leads to the epic 9I hope) culmination. Still, it was okay to watch, decent acting, nice atmosphere."
    },
    {
      "rating": "8",
      "text": "A different film in the Hunger Games story a film based on political intrigue, and propaganda.  While I found myself missing the games, I also can't wait to see how the story ends.  A-"
    },
    {
      "rating": "4",
      "text": "I liked the first 2 but I can sum this movie up in one word:\"filler\". They could easily have condensed this mercenary mess into the finale but since it seems that most everybody these days is willing to sacrifice quality in place of the almighty dollar the moviegoer ends up the loser."
    },
    {
      "rating": "4",
      "text": "I’ve not read the Harry Potter books, but when I saw the last two films – 7.1 and 7.2 – both were so rich and dense and captivating, as both stories and spectacles, it made sense to me why they made two films out of one book.  Not here.  There is so much nothing happening in The Hunger Games: Mockingjay – Part 1 that the film feels like money-making, fan-exploiting filler.  In the hands of more skilled filmmakers, a tight and tense 20-30 minute introduction in front of Part 2 could do a greater service to the franchise than this 2+ hour chore."
    },
    {
      "rating": "9",
      "text": "Before I watched the movie, I was reading/watching some reviews about Mockingjay Part 1. They complained that Mockingjay should have been one movie instead of two and that makes me a bit worried about my movie experience. Gladly I really enjoyed the movie a lot as a fan of The Hunger Games.\r Sure, it has less action than the previous two movies. I am not quite surprised that some people who didn’t read the books got really bored watching the movie. But I am quite surprised that some book readers got bored watching the movie. They should have known that the first half of the book is more on dialogue than action.\r The movie used its 2 hours and 5 minutes length very well. I was amazed how every detail in the first half of the book was translated to the big screen while also adding new scenes outside Katniss’ point of view in the books. They don’t feel like fillers at all, they felt important to the narrative and that is really good when you add new scenes never featured in the books.\r Though Francis Lawrence did not re-imagine the way he directed Catching Fire in this movie, his direction is amazing in this movie. I love how dedicated he was in directing in this movie, especially the way he directed the propaganda videos for the movie.\r Speaking of propaganda videos, it turned out to be much better than I expected. Some people say it’s really cheesy but that’s the point of a propaganda video, they’re cheesy and one sided. I have seen some North Korean propaganda videos to back this up. I really want to see the propaganda videos in their own full form. I hope it’s one of the extras for the movie when it comes out on home media.\r The cast performances are excellent in this movie. Every actor and actress in this movie did a perfect job portraying their characters. Of course, Jennifer Lawrence did another great job portraying the character that made her a household name. It’s nice to see the new actors in this trilogy like Julianne Moore and Natalie Dormer in this movie. I can’t wait to see more of them in Part 2. Despite his short time appearance, Josh Hutcherson did his best acting ever as Peeta in this movie. He is no longer the pretty boy anymore and he is now a better actor than he was in the first movie. Also, I am glad Effie is in this movie. In the book, she only appears in one or two scenes which is in the near end of the book while the District 13 version of Effie named Fluvia takes her place. Elizabeth Banks played Effie so good that Effie as a character is likable for the fans. So it’s nice to see Effie taking over Fluvia’s role because Fluvia is not very likable compared to Effie.\r The movie ended pretty well to leave us hanging without being anti-climatic. Too bad we have to wait for a year to see the finale.\r I wouldn’t say this movie is better than Catching Fire because of its lack of action scenes but the penultimate chapter of The Hunger Games trilogy is entertaining with its compelling political themes, every book detail featured in the movie that will delight the book readers like me, excellent direction, excellent cast performance and an ending that makes you want more."
    },
    {
      "rating": "0",
      "text": "Boring Boring Boring\rThe last time I wanted to walk of a motion picture was decades ago with the release of SoapDish with Sally Field\rThis film was so slow and underwhelming that I kept waiting for something, anything at all, to happen to liven things up........but.........it.....never......came :(\rDon't waste your time\rReally, I mean it, don't bother with this one\rThe previews shown before this film were more entertaining than this feature presentation\rThe fact that a studio would release this and expect the audience to enjoy it is truly sad"
    },
    {
      "rating": "0",
      "text": "This movie was bad. I haven't read the books, nor will I ever read them if they have anything in common with the movie other than the title. Don't waste your time or money.\r The movie is boring and the logic of the battles and their world is absurd and will bother you. It seems like it was written by a child who was too lazy to even read Sun Tzu. The social commentary is weak at best, and everybody in the movie is so stupid you pretty much want them all to die.\r Can we talk about the names? I couldn't concentrate on the bad dialogue because the names were too distracting. Catnis? Katnips? Catnitz? Peta? PETA?! Pita? Pedo? PanAm?!?! The world is named after Pan American airlines? WTF. Gail? Gale? Named after wind?\r Most of the movie is Catneets crying because she is frustrated about boys and can't journal about it or something, and then one of her guys gets turned into Gollum in the end. Spoiler. That's pretty much the whole thing. Also, some dudes run up a tree because leaves are, apparently, bulletproof.\r There's a cat in the movie. People laughed at the cat. People love cats.\r Catnyss shoots down a plane with an arrow. Also, some guy is promised a Trident by a handicapped version of Q from the bond films. They are at war. Trust me, he doesn't want a Trident. He wants a gun. A large gun. Give him a gun, Q.\r FYI. You can choose between Rebel Leather, Derelicte (throwback), or Marie Antoinette as your costume choice.\r Underground bunkers need underground bunkers in the bunker, apparently.\r Don't ever blow up a hydroelectric dam with your planes or bombs. Send unarmed people with some wooden pallets full of bombs instead. They will die, but hey, its worth the footage.\r People without tongues can't talk, but they sure can whistle!\r How many people total are in this world? About 100K? The districts are the size of a high school.\r Anyway. This thing is bad. Go watch Running Man or Battle Royale and have some fun."
    },
    {
      "rating": "2",
      "text": "Wow, this movie is a sleeper. Honestly bring a pillow. The producers should wear guns as they grab your money.  As I watched people come out of Dumb and Dumber as I walked into Mockingjay I thought why would you waste your money. The real dummys were going into Mockingjay. This film has unbelievably poor characters and the emotions were whipped up in blender and splat onto the screen.  Save your cash will be on netflix in a week or two then you can fall asleep on your bed."
    },
    {
      "rating": "4",
      "text": "This movie was an obvious ploy to get more money out of us. It was largely dull and boring. I was looking at my watch multiple times to see when this garbage would end.  YOu could easily skip this movie.  Nothing happens that  really makes you put any pieces together.  Save your money."
    },
    {
      "rating": "0",
      "text": "After seeing the first and second of those movies, I was not expecting too much of it. But still, they could have at least tried to make something good. Unfortunately they did not. I think maybe 1 hour of the movie is just wasted time-filling boringness. Then some action happens, and boom the movie is already over. Waste of time. They could have put Part 1 and Part 2 into one movie. Or I guess, one could just skip this one and see part 2 directly when it comes out. Nothing missed there."
    },
    {
      "rating": "10",
      "text": "This is one of the best films I have seen, although I am not sure whether it is as good as the other two. I very much liked the way each character is portrayed. Jennifer Lawrence's acting is amazing and so is Woody Harrelson. This film is impacting yet funny where it needs to be. The films have a more and more complex plot as they go on. This is an excellent film, however, I believe the next one will be even better, this film is leading up to the second part (obviously), I think it has managed as well as being marvellously entertained to watch. I would recommend this film, though start at the beginning if you haven't seen the others, the films are highly plot orientated. Which I think is one of their best features."
    },
    {
      "rating": "0",
      "text": "Nothing really important happened in this movie, except the climax. I left the theater with a feeling that I just watched a extended edition of the first act of the movie. If splitting Deathly Hallows and even Breaking Dawn into two parts was ultimately justified, here they didn't even try to make it satisfying."
    }
  ],
  "recommendations": [
    "the_hunger_games_mockingjay_part_2",
    "contagion",
    "maze_runner_the_scorch_trials",
    "limitless",
    "the_maze_runner",
    "next",
    "maze_runner_the_death_cure",
    "avengers_infinity_war",
    "sanctum",
    "the_new_mutants",
    "bird_box",
    "a_quiet_place_part_ii",
    "the_hunger_games",
    "vantage_point",
    "what_happened_to_monday",
    "the_power_of_the_dog",
    "the_grey",
    "x_men_apocalypse",
    "tomb_raider",
    "how_it_ends",
    "the_butterfly_effect",
    "the_tomorrow_war",
    "terminator_genisys",
    "code_8",
    "chaos_walking"
  ]
}