{
  "id": 2815,
  "title": "The Longest Ride",
  "starring": [
    "Scott Eastwood",
    "Britt Robertson"
  ],
  "runtime": 128,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "The lives of a young couple intertwine with a much older man as he reflects back on a lost love while he's trapped in an automobile crash.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qdUVfvPBvT6cetDDM7rn8y2CNZE.jpg",
  "categories": {
    "plot": 6.037037037037037,
    "acting": 5.7727272727272725,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Another inferior and joyless romance by has been critically acclaimed author Nicholas Sparks its always that his crappy scripts are still be sold to hollywood another poorly directed flick with more god awful dialogue ad sucky plot depth"
    },
    {
      "rating": "7",
      "text": "“Love requires sacrifice…always”.\r It’s been a long ride, and after riding the wave of The Notebook for over a decade, Nicholas Sparks can rest assured that the newest cinematic adaptation of one of his infamously familiar romance novels isn’t a complete dud, and that is saying a lot.\r Throughout the year, audience members expect to see certain films on the silver screen; Halloween brings forth a new Paranormal, or Purge; summer brings us a new Marvel action tentpole, while Valentine’s Day usually brings us another Nicholas Sparks romance. Sadly, while many would have loved to see this film on Valentine’s Day instead of the widely popular Fifty Shades of Grey, The Longest Ride was pushed for a release in April, just in time for…spring?\r The unfortunate fate of a Nicholas Sparks romance film is that, most of the times, they never really have to be as bad as they usually are. While The Notebook seems to be the mecca of Sparks’ novels and films with critics and audience members, his track record is usually mediocre at best, with many awful variations. With last year’s The Best of Me, the film brought a whole new low to the Sparks canon, barely making an effort to conceal a slight age difference but obvious physical maturity difference between its two young leads. Thankfully, The Longest Ride casts two vibrant and talented actors to bring their characters and most importantly, chemistry to life.\r While you could guess that every Sparks romance involves two parallel love stories, a dark personal secret, a past and present rendering, a World War II reference, an infamous scene in the rain, and very noticeable slices of Americana, The Longest Ride only fulfills half of the typical Sparks criteria, allowing the film itself to play on a fresher slate than half a dozen of his previously adapted films.\r This time around, we are introduced to the eclectic and cultured Sophia (Britt Robertson), a young and beautiful woman studying in North Carolina on a full scholarship. Chasing her dream of becoming an art curator in the Big Apple, Sophia closes herself off from her large sorority along with any distractions that could come her way, especially when she finds herself blending into the country culture of North Carolina. Forced to accompany her friend Marcia (Melissa Benoist) to a bull-riding competition full of cute cowboys, Sophia agrees to take some time away from studying, seeing that she only has two months left of school before she moves to New York for an internship she’s accepted in a prestigious gallery. While her time at the competition seems filled only with her friends, Sophia is quickly given the attention of all-around American cowboy and competitive bull rider Luke Collins (Scott Eastwood).\r What begins as an innocent night at the local saloon after Luke’s graceful win that places him thirty-sixth in the world, turns into a romantic date with take out food and a perfect scenic background for the two. While Luke exercises every opportunity to be a gentleman, on the ride back home to Sophia’s sorority, Luke and Sophia stumble across a car afire through a guard-rail in a ditch of a side road. While Luke pulls out an unconscious elderly man, Sophia pulls out a box filled with the man’s most prized possessions. Staying with the man overnight at the hospital, Sophia and Ira (Alan Ida) begin a special friendship blossomed from Sophia’s willingness to read Ira his letters back to home, remembering his memories of his deceased wife Ruth (Oona Chaplin). While the similarities of young Ira (Jack Huston) and Ruth’s life beg to make their way into Sophia and Luke’s relationship, the young couple begin to question the route of their lives and the acceptance of whether or not they are meant to be.\r With any good Sparks film, there is always an independent director trying to reinvent them self for a career in the mainstream. Luckily this time around, George Tillman Jr. was the man responsible for directing Sparks latest, and like Lasse Hallstrom, the director at the helm of Safe Haven and Dear John, as well as other very successful light-hearted fares including Chocolat, The Cider House Rules and most recently The Hundred-Foot Journey, Tillman Jr. continues Hallstrom’s tradition of executing successful romance without ever down playing its cliched niche and obvious narrative directions.\r Tillman Jr. does some of the best work with his actors in creating very real yet idealized characters within Sparks’ world. The Longest Ride may be the longest running Sparks adaptation but is also, next to The Notebook, the best casted. Robertson and Eastwood beg for genuine sympathy for their struggles as a new couple without ever being overbearing. Many of their relationship conflicts could easily be understood and accepted by a modern day audience, especially those of the younger demographic."
    },
    {
      "rating": "0",
      "text": "The Longest Ride is another UN-NICHOLAS SPARKS romance, even though it is cascaded as one. Just like The Best Of Me. This movie is just The Best Of Me, with Cowboys, ranches and rodeos. It starts comforting, and girly, with Scott Eastwood's Luke seeing Brit Robinson and falls in love with her. But this romance turns into a bore fest for 2 hours. The director didn't need to stretch the movie that long, just because he can throw in a war sequence. The whole movie is a mess, Eastwood and Robinson are lifeless and the direction is horrible. I think The Longest Ride and The Best Of Me are both on my worst romantic Sparks movies ever made list."
    },
    {
      "rating": "4",
      "text": "\"The Longest Ride\" só seria um bom filme se focasse inteiramente o romance de Ira e Ruth, porque, realmente, foi esse um dos poucos aspetos positivos do filme.4/10"
    },
    {
      "rating": "1",
      "text": "It is boring. A total demonstration of desperation. The film sucks, the only thing I liked about it was Brittany Robertson. That's it.\r This adaptation of Nicholas's Sparks novel is as dumb and lacking of good dialogue and character development as the others. I think that the cast's performances were fake and bad. I think that choosing Birttany Robertson and Scott Eastwood as lead was a mistake.\r I can't believe that Clint Eastwood's son was involved in this garbage and waste of time film.\r To sum up, The Longest Ride lacks of a good score, good dialogue, a good screenplay, a good production design and a good plot. It cannot be catalogued as a romance, sports film or even comedy. It is a total cliche. Completely deserving of a Razzie for Worst Picture, Worst Actress, Worst Actor, Worst Screenplay and Worst Director. It sucked. Collapse"
    },
    {
      "rating": "5",
      "text": "When watching this movie it had a good beginning (and that's kinda of odd since this a Nicholas Spark adaptation). But how many times is Sparks going to use the same formula that he writes books and same films?  despite that Britt Robertson and Scott Eastwood (Clint Eastwood's son which do not know why in this movie.), give some decent performances. So far i was blown away by the storytelling  but here's the problem, the script is convoluted the stereotype girl cliche's just don't film work. Alan Alda performance only makes the film glorious and emotional. Positives:the film keeps the story going which makes the audience impressed and amazed. Number two: girls can cry their **** eyes out and enjoy it. It was boring sometimes. Grade B+"
    },
    {
      "rating": "0",
      "text": "Boring, sappy, and one of, if not the worst, Nicholas Sparks movies. characters are lifeless and pointless, this is an anti-romance. There struggles don't feel important enough to warrant a movie about them there romance feels dry and passionless, more centered around sexual attraction then a deep seeded love for each other- I just didn't buy it."
    },
    {
      "rating": "7",
      "text": "I was born with, raised on and spent the first 20 years of my life living with, and believing, in Hollywood movies. I believed all young male lovers were handsome (and hairless) and all young female lovers were pretty and both had beautiful, usually blue eyes. Their stories consisted of meeting, falling in love, having something come along to break them up and, most important of all, everyone lived happily ever after. I knew all older folks were played by first class character actors and everything took place in beautiful towns, cities, counties, States and countries.\r The difference between films of yesterday and those of today, like “The Longest Ride”, are that in today nude bodies and sex scenes are seen where in the past all were hidden by fireworks, drapes blowing in the wind, shower curtains, all indicating what was taking place and leaving it to the imagination. Oh yes, in the 1930s to the 1950s men’s chests were shaved clean.\r You will either hate or love “The Longest Ride” but you will know what you are seeing before you walk in as Nicholas Sparks books and movies follow a well tread formula. There is nothing new and you know from the moment Luke (Scott Eastwood) sees and hands his black cowboy hat to Sophia (Britt Robertson) what will happen. Here you get two love stories for the price of one because due to circumstances we also get to follow the love story of Ruth (Oona Chaplin) and Ira Levinson (Jack Houston 70 years ago and Alan Alda today) told in old Ira’s memories and letters he wrote every day to his wife.\r Just for the record Scott Eastwood is the son, and in my opinion, better looking than his dad Clint was at the same age, Jack Houston is the grandson of John and Oona is the granddaughter of Charlie and daughter of Geraldine.\r As in most movies logic has to be checked at the door and in this case whether the 1940s or 2000s it seems Black people don’t/didn’t exist in North Carolina and in each case of the couples both males and females are from different worlds but don’t really present a problem unless the plot requires it.\r There are cameos by Gloria Reuben (and, no, I am not contradicting my statement about Black people in North Carolina) and Lolita Davidovich, who are always welcome on the screen.\r The younger actors acquit themselves well though Jack Houston seems lacking personality while Alan Alda walks away with the acting honors. Scenes of the mountains, beaches and lakes of North Carolina are sometimes breathtaking.\r “The Longest Ride”, like Luke’s comfort food of mac ‘n cheese, is a comfort movie of yesterday."
    },
    {
      "rating": "10",
      "text": "It's a nice sappy movie, perfect for those of us who want the fairy tale ending instead of the real life ending we usually get. The parallel love stories didn't seem to match at all until the end when the true love lesson is learned. We did like the love story of the couple in the past better than the couple's story of the present. But whatever, love is love anyway couples have it."
    },
    {
      "rating": "0",
      "text": "Utterly USELESS sappy and slightly racist melodrama:\rt's a great feat, but every Sparks movie is twice as worthless as the one preceding it.\rThis was even more terrible than anything.\rIt fully deserved the bland main characters: a weak and dime a dozen Eastwood, and the ever so cowardly Robertson.\rIn \"Ask me Anything\" she already proved that she can do nude scenes without actually being nude, and here she doubles down on that.\r Utterly USELESS sappy and slightly racist melodrama."
    },
    {
      "rating": "3",
      "text": "Romance chato e fraco, feito para adolescente, uma enorme perda de tempo para se assistir, falta um pouco mais de tempero na história para ficar mais intrigante."
    },
    {
      "rating": "10",
      "text": "The Longest Ride is an astonishing romance-drama movie directed by George Tillman Jr. and the source by the novel with the same name from the famous author Nicholas Spark.\rNow this movie succeeds at everything that most of romance movie fail at.First off it does have a good lesson about life and making the right choice,something that stays with you forever.Also the acting is great especially by Britt Robertson who does such an amazing job here,and her chemistry with Scott Eastwood makes this movie even greater.A true heartfelt romance during the whole movie and I also love the way that the two stories connect and make sense.Ira and Ruth have had a life together and have enjoyed it for many years,and everyone should take notes right out of it because living a life with someone you love is better than anything else.\rI really loved this movie,by far the best romance movie ever in my opinion.Go see it if you haven't yet because it's worth it."
    },
    {
      "rating": "9",
      "text": "Great film, & cast. I try too see a film a week, first time critic. Some of the best of films get unjust rating, this is for sure another one. Scott Eastwood, was the first time I've seen him act, Dad must be proud. Britt Robertson is on the go."
    },
    {
      "rating": "7",
      "text": "As most romantic movies, this is somewhat predictable at a certain point, but still pleasant. For those who enjoy romance and drama, this is a really nice show that will bring you to tears."
    },
    {
      "rating": "7",
      "text": "Would you let your dream go for the sake of love of your life!\r I watched it specially for Scott Eastwood. I did not like his performances in the previous films I had seen, so expected this one to change my perspective and I'm truly happy with it. If you are a romance novel and film fan, then you probably would have heard the name Nicholas Sparks. I haven't read his books, but I surely love almost all the films based on his material. So expected this film to be another romance masterpiece, but it was not, not entirely.\r Yep, it is not a great film, but still a beautiful and enjoyable film. The cast was good, especially I love anything with Britt Roberson. The film had dual layer narration, one being set during the 40s onwards and the other was the present time tale. Both of them were about the young romance and their fight to overcome various issues surrounded their relationship. Kind of original and that's the best quality of this film.\r I think the director did his best who's known for some fine works. The film should have been a lot better, only if it was a bit emotionalised, which is very essential for a theme like this. I thought the final scene was cliche, but after waiting for a few more seconds, I relieved for changing its course in the final minute to conclude decently. The drawback was the length of the narration and the overall slow pace, other than that mostly you won't end up disappointed with this. Recommended!\r 7/10"
    },
    {
      "rating": "7",
      "text": "It's not the best romance movie out there but hey, it's a Nicholas Sparks movie. The movie is very very long and sometimes way too boring , but there is romance which is very important. Definitely better than The Best of Me and is sometimes watchable."
    },
    {
      "rating": "3",
      "text": "The Longest Ride was one of my favourite Nicholas Sparks novels. It was extremely well written, coming together quite nicely at the end, it was a page turner and I was excited for the movie. However, I have never been more disappointed with the execution of a film like I have with this.\r The casting for Luke was spot on, but what they did with his character greatly hurt the charm of his character. That being said the casting for Sophia and her roommate Marcia was horrendous. Sophia was supposed to be a strong, smart character with some fire but Brit Robertson brought this ditzy, flimsy feel to the character that can quite easily turn one off of the character.\r I have always hated the liberties taken with Sparks' novels when they are being turned into films and cutting Brian out of the film completely and that whole subplot between him and Sophia also took away greatly from what made the novel interesting.\r For once, I would like a capable screenwriter to do a Nicholas Sparks novel justice."
    },
    {
      "rating": "8",
      "text": "The Longest Ride came out in 2015 and is one of my favourite movies through the ages.It is a romantic drama and there hasn't been used far- fetched characters. The Film is basically fast- moving and it doesn't leave anyone serious. Special effects are not used, although there are a lot of heartbreaking moments in this film, but it has a very gripping story.The Screenplay is written by Craig Bolotin. He is a screenwriter and film director. He is written and rewritten numerous screenplays for such directors as Ridley Scott and Francis Ford Coppola.The story was quite heart- warming. There were a woman and a man, who fell in love with each other. The Longest Ride centers on the star-crossed  love affair between Luke, a former champion bull rider looking to make a comeback, and Sophia, a college student who is about to embark upon her dream job in New York City's art world.The performance of the actors was great. They were very credulous and the act was good to watch. There were some light- hearted scenes and the work of actors was powerful. The film has a lot of strength sides, because it is gripping and many parts in this movie are frightening.The film in general is beautiful, remaining and lovely, because there is a lot of romance and the film is filmed in wonderful places. The film has a good meaning and I recommend watching it for everyone, because it is memorable."
    },
    {
      "rating": "6",
      "text": "This is a bit cheesy and sentimental but I liked the fact that it has multiple stories within stories (i.e. sub plots). At first it seems like an almost typical rom com/teenage film but I enjoyed hearing the stories from the elderly man that the main characters save from a car accident. I found it particularly nice to see how close the main characters, adolescents, became to the eldery man. It is certainly a somewhat thoughtful film, even if/though it was too sugary sweet for my personal liking - there are certainly some poignant lines of dialogue, in the script.There are, obviously, some morals present (about love and perserverance)- as I hinted, it may feel a bit 'holier than thou' but not horrendously so and for the most part I found it an easy, light-ish watch. Not a bad film. Not brilliant, not bad."
    }
  ],
  "recommendations": [
    "me_before_you",
    "joy",
    "the_fault_in_our_stars",
    "the_terminal",
    "eddie_the_eagle",
    "the_age_of_adaline",
    "me_and_earl_and_the_dying_girl",
    "news_of_the_world",
    "the_intern",
    "the_notebook",
    "the_place_beyond_the_pines",
    "casablanca",
    "the_secret_life_of_walter_mitty",
    "donnie_brasco",
    "about_time",
    "blue_valentine",
    "the_glass_castle",
    "the_second_best_exotic_marigold_hotel",
    "the_spectacular_now",
    "pretty_woman",
    "blue_jasmine",
    "notting_hill",
    "belfast",
    "love_actually",
    "marriage_story"
  ]
}