{"id": 2358, "title": "The Woman in the Window", "starring": ["Amy Adams", "Gary Oldman"], "runtime": 102, "genre": ["Drama", "Crime", "Mystery", "Thriller"], "description": "An agoraphobic woman living alone in New York begins spying on her new neighbors only to witness a disturbing act of violence.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wcrjc1uwQaqoqtqi67Su4VCOYo0.jpg", "categories": {"plot": 4.666666666666667, "acting": 3.8, "ending": 4.071428571428571, "soundtrack": 4.0, "cinematography": 4.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Amy Adams stars as an agoraphobic woman confined to her large New York home. While observing the new neighbors across the street, she sees something disturbing…or does she? Her mental condition compromises her credibility, but there are more issues. Even with the twists, the writing isn’t always effective (penned by Tracy Letts, who also plays a role). While Adams is trying her darndest to draw us into her world, her performance is a bit grating. She has an A-level cast supporting her, including Gary Oldman and Julianne Moore. Director Joe Wright brings his directorial flair with some moments of sly Hitchcock references. There are a few expected twists, but almost no tension to accompany the paranoia. Even though it’s mildly intriguing and the final encounter does have some bite, the whole thing feels a bit off and uneven in tone and execution."}, {"rating": "3", "text": "Amy Adams once again sleepwalks in a performance that's inside of a forgettable movie. All and all there's nothing really impressive about the twists and turns."}, {"rating": "0", "text": "Sehr Langweilig!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "2", "text": "Maybe the worst waste of talent this year. No wonder why this movie got delayed by almost two years. Bland acting, derivative story, and stupid characters make 'The Woman in the Window' a solid contender for the worst film of 2021. Hitchcock must be rolling in his grave."}, {"rating": "1", "text": "C’est l’histoire d’une femme qui ouvre trop de fenêtres dans Windows et tout-à-coup, elle ne sait plus où elle en est… son ordi portab’ tout pourri rame et plante… et elle pête un câble : elle le balance par la fenêtre. Je suis sûr que le film aurait carrément été plus intéressant comme ça…!Cela dit, Amy Adams est une très bonne actrice et porte tout ce mauvais film sur ses épaules dans le rôle de la psy (!) recluse chez elle, accro aux médoc et alcoolique, dépressive et paranoïaque. Et qui fait sa concierge et surveille les voisins d’en face. Comme dans un certain Fenêtre sur cour… Et comme d’habitude, les rideaux n’ont toujours pas été inventés aux Etats-Unis ! dingue, ça…Il se trouve d’ailleurs que c’est globalement à peine moins chiant que le vieux nanar du père Hitchcock avec le falot James Stewart. Ce film est comme son ordi tout pourri : il rame comme un crevard ! Le pire concerne le dernier quart du film qui accumule toutes les invraisemblances et rebondissements foireux qu’il a sous la main ; puis il se termine de façon à la fois ridicule et très convenue. Quelle daube !"}, {"rating": "4", "text": "Everything it copies is badly copied.And what it wants to try outside of it, is predictable to the bone.Those are already very damaging elements, but the fatal blow occurs because of the total lack of suspense, and suspense is what the whole movie is about.I was unable to buy the mystery, and Amy Adams was surprisingly unable to sell it.Completely understandable why it was delayed for so long, and it's completely understandable how it ended up on Netflix.Massive disappointment."}, {"rating": "1", "text": "This is one of those films that has no idea what it wants to be. Right away, from the premise alone, most movie savvy types might say, hey, the plot reminds me of Hitchcock's Rear Window (shut in witnesses a murder in a neighbouring apartment, tries to get involved, etc...). Indeed, it does and agoraphobic Anna's movie viewing shows a brief glimpse of the classic. Otherwise, the cameo bit of Rear Window you witness in this mess is the only real redeeming instance. Otherwise, I spent a lot of time shaking my head. Honestly... and the actors (Adams, Moore, Oldman), all normally superb in other films, find themselves paychequing their way through this one. They give B-movie performances, working with a muddle of a movie script (and based on a book.... so I have to wonder). And the movie indeed feels B quality at times, then schlocky, then momentarily surreal. At one point I found myself wondering: are these people, namely Anna's neighbours, her tenant and the police all acting so strange and stilted because she has been a shut-in watching far too many old-fashioned movies and thus projecting onto the world around her? Could this explain the exaggerated moments of dialogue? Nope. It was just the movie not figuring out itself. And when it does, and you get to the twist and beyond it and find out who the real murderer is, the climax and death scene for the bad guy, and you have to guffaw if not choke back your incredulity. I wonder what happened to this movie. It feels like someone started a fire, tried to put it out with a few drops of water, added more oil, then, added gasoline then gave up and focussed a camera on the flaming pyre figuring, might as well get something out of it. Avoid this one unless you like dumpster flambé."}, {"rating": "1", "text": "Boring, predictable. The story doesn't reel you in or leave much to discover."}, {"rating": "1", "text": "Perhaps the worst thing about this film is the wasted potential. With such an all star cast and some flashy choices of direction and cinematography, the Woman in the Window ends up being like a plastic apple on display at IKEA. It looks good but take a bite and you end up with a bad taste in your mouth.The scriptwriting was odd at best with weird lines being delivered by skilled actors and actresses the best that they could. Pacing was also odd with lulls suddenly bursting into manic frenzy that left me disorientated.This culminates in a final confrontation which is more slapstick rather than the crescendo of a well crafted mystery. Looked like it came out of another movie like Final Destination.Terrible."}, {"rating": "7", "text": "As pulpy thrillers with unreliable narrators go, this was a suspenseful blast (those critics that called it boring,  I would imagine their entertaining would probably give me a heart attack) with a pretty satisfactory reveal at the end (as in it ties up all the loose ends and doesn't leave plot holes unanswered like lot of these thrillers tend to). One thing I did find quite jarring was the final 20 or so min of the the film where it moves from moody set piece to all out horror movie but it certainly kept me on the edge of my seat. Never read the book so I can't compare the two mediums. While there is nothing remarkably new about the story it's telling (it's literally a copy of a copy of a copy of countless other plots in this unreliable narrator genre all meshed into one),  I found it to be well executed and acted (Oldman goes a bit overboard and chews the scenery whenever he's in it and Jennifer Jason Leigh who did \"unhinged\" to perfection in Single White Female barely registers here) and it has a menacing, almost claustrophobic atmosphere to it (which suits the theme of the film perfectly). In other words, this is the perfect Friday night movie to jam to in these covid times."}, {"rating": "3", "text": "The Woman in the Window has a lot of interesting ideas and an stellar cast, but ultimately fails to deliver them on screen."}, {"rating": "0", "text": "Waste of my time!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "5", "text": "Besides the fact it's directed by Joe Wright who's behind the 2005's brilliant adaptation of Jane Austen's masterwork, Pride and Prejudice, and that it stars Amy Adams in the leading role (because she's Amy Adams!), The Woman in the Window has been one of my most anticipated films of the year since knowing that its lead character suffers from agoraphobia, a subject that piqued my interest for the last couple of years. Amy Adams plays the eponymous heroine, Anna. An alcoholic agoraphobic child psychiatrist who when she's not drinking wine and watching movies she quotes word-for-word, she occupies herself by spying on her neighbours, observing their activities as some sort of a abreaction to her incapacitating phobia. This voyeuristic behaviour seems to be endorsed by her own psychiatrist. In his words, \"curiosity is the evidence of a decreased depression pattern,\" a clue that her agoraphobia was resulted from depression. Anna's anxiety disorder doesn't merely confine her to her home, for it also keeps her in a constant fear of finding herself in stressful situations, the thing that makes her very easily startled. She perceives every noise or object coming from outside her house as a source of menace. Her eyes being shown in close-ups from the opening shot and throughout the movie (with one shot including her eye alongside Salvador Dalí's eye curtain from Hitchcock's Spellbound) could be interpreted as a symbol that fittingly ties up with the film's theme of voyeurism. But aside from that, Anna's eyes being always depicted wide-open makes them susceptible to assault from what she fears, which indicates that her constant state of apprehension is her own culprit. And Amy Adams conveys Anna's tumultuous emotions and lack of instability impeccably. Additionally, Bruno Delbonnel's noir-ish visual touches along with an exemplary sound design found their way across the film to express Anna's state of mind audiovisually. Her house is drenched in yellow to represent Anna's paranoia. Sharp, abrupt cuts reflect her nervous and fidgety conduct. Shots of a vertiginous staircase lend a sense of dizziness. The sound of doorknobs as they are twisted to open the door is enough to make Anna's heart skipping a beat and even fainting.Ok, what comes of all that build-up? Or rather, how will all these pieces be combined and brought together into a cohesive whole? Easy. Just take all of these elements, amp them up to 11, put them in a blender and splatter them out! Dutch angles, asymmetrical compositions, extreme close-ups, low and high-contrast lighting (chiaroscuro), and more noir visual elements are copiously and gratuitously thrown on the screen in quick succession. The result is, they all just wind up being confusing and don't add up anything to what've been established earlier. What about the mystery? The movie keeps teetering between portraying Anna as a lunatic (nothing good comes off that save for a shot or two that harken back to the 19-century Gothic literature and the Madwoman trope) and depicting her as a victim to gaslighting (which was subtly foreshadowed earlier, as one of the films Ethan borrowed from Anna was George Cukor's Gaslight). Neither of these routes, however, are given enough delineation to be taken or rather to be torn between. But anyway, the movie quickly abandons the conundrum it was going for in favour of an easy, hackneyed device in a futile attempt to justify that jumbled mess of a second act, which builds towards an early, unearned reveal. But be that as it may, I didn't mind an anti-climactic ending as long as the window's curtain is finally going to be drawn. Much to my dismay, there was still a third act, and boy was it horrendous! The movie that's riddled with references to other noir films — including to Rear Window, of course, to the point I doubted if The Woman in the Window is actually a riff on it — has suddenly become a cheesy b-horror movie. Groovy! The fact that one side character shows up after another without being introduced beforehand didn't bother me. For with each of them, I saw many potential threads. All of which, unfortunately, never successfully weaves anything of interest with Anna. They all end up being mere plot devices without giving them even a fraction of the consideration they were supposedly afforded, and the incredible cast of A-listers can't really save them despite having a couple of moments where they truly shine, mainly Gary Oldman and Julianne Moore. Such a let down!"}, {"rating": "4", "text": "Probably the most disappointing release of 2021 so far. I was really excited to see this because I love the actors and the film looked very interesting. I was only right about the actors. I think Amy Adams did a good job in her role as she usually does but not great. Gary Oldman was very over the top at points but did good and Anthony Mackie was underutilized. Everyone else was fine. Gary Oldman’a kid in the movie was incredibly annoying and I didn’t really like Julianne Moore’s performance. The script is pretty awful at points. A lot of this dialogue is incredibly forced and awkward and doesn’t leave a lot to be interpreted. This film prides itself on trying to make you think but the reveal makes all of that incredibly pointless. The first two acts of the film are pretty dull. It’s a confusing, disjointed mess. The third act is abysmal though. The reveals were awful and the circumstances were terrible and obnoxious. It ruined any semblance of ambiguity the film had which really sucked. I did like some of the shots though. They felt cool and unique along with some of the framing and lighting but it’s fruitless in the overall scope of the story. The music was good but felt poorly used. Some scenes had music that probably shouldn’t and some scenes had music that felt like it belonged at other points in the movie. It’s a disjointed mess of a film that I wouldn’t recommend."}, {"rating": "5", "text": "Despite having a very talented cast, the messy script makes none of them stand out enough in The Woman in the Window."}, {"rating": "10", "text": "Trust me, this movies is very good and the critics are wrong. It took my breath away"}, {"rating": "9", "text": "The woman in the window is a 6 overall but compared to the rest of the Netflix catalog it is certainly a 9."}, {"rating": "10", "text": "This is a surprisingly disturbing thriller. Amy Adams is worthy of all the awards in the world for her performance."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "7", "text": "Any Netflix films are essentially films that used to fill DVD shelves in your local Blockbuster.  This riff on Hitchcock-ian Thriller is essentially a modern retelling of Rear Window.  It is well acted and surprisingly filled with a lot of A-listers.  A pretty good watch especially yet not exactly a theatre going experience."}, {"rating": "8", "text": "Been wanting to see this movie since I first saw the trailer right before the pandemic and have been waiting patiently. I got a little nervous after seeing all the negative/mixed reviews but I definitely wasn't disappointed. I thought the movie was pretty good and really don't see why it's getting all the poor reviews."}, {"rating": "5", "text": "O filme começa a ficar bom quando acontece o primeiro assassinato. Ele tem um som que deixa as situações bem angustiante. O filme não é bom para quem procura um bom filme no final de semana"}, {"rating": "7", "text": "Do not get confused by the critics, this movie is not half-bad. It delivers well the view of the world, and the psychology of a person who suffers from agoraphobia. They definetely overdid it with foreshadowing, and it had a lot of plot holes which is unfortunate, because the script was top-tier."}, {"rating": "7", "text": "It was OK... maybe not a master piece. But I enjoyed it and I did not expect the ending twist..."}, {"rating": "10", "text": "Filme MARAVILHOSO, a crítica pegou ranço em algo que era pra ser assim, Amy digna de Oscar nem é preciso dizer, o filme é dela, o brilho da sua interpretação chegou em mim sem esforço. Ameii demais."}, {"rating": "1", "text": "Tired, unimaginative, and boring movie. The cast of highly regarded artist must be cringing........."}, {"rating": "5", "text": "Pretty awful considering its star-studded cast. Amy Adams is not great as the agoraphobic Anna, who seems to live in the most stressful middle-class neighbourhood in NYC."}, {"rating": "6", "text": "If you’re looking for an Oscar performance, you won’t find it here. But, if you just want an easy suspense movie, this will work. The critics are overbearing. Not everything must be a cinematic masterpiece to be enjoyed."}, {"rating": "6", "text": "This was in a way remake of Hitchcock's movie, but with bit different twists. I did enjoy it, of course at bits it was a bit boring, but I am surprised at many low ratings here."}, {"rating": "6", "text": "The Woman in the Window was supposed to premiere in theaters last year. Like many other movies, it was shuffled around due to COVID and eventually was sold to Netflix. It premiered on the streaming service a couple weeks ago to little promotion and fanfare. I read the book that the film was based on a few years ago, but I remember that novel being a real page-turner, as paperback thrillers go. Let's see how this adaptation turned out.Here, Amy Adams plays Dr. Anna Fox, a child psychologist who suffers from debilitating agoraphobia. While Dr. Fox has been secluded in her large brownstone in New York City, she has become engrossed in monitoring her neighbors including the Russell family, the new neighbors who have moved into the property across the street. Filled with mind-altering medications and consumed by alcohol, coping with the separation from her husband (Anthony Mackie) and her young daughter, Dr. Fox begins to question her own sanity when she sees something through the window that she can't explain. The Woman in the Window devolves into a fairly obvious whodunnit and uses Dr. Fox's psychological fragility as a scapegoat.The Woman in the Window is a paint-by-numbers attempt to imitate Alfred Hitchcock's Rear Window. This movie fits pretty easily into a genre of films where unreliable women attempt to solve a crime they're not sure really exists. In fact, there is a bit of a Lifetime quality to it. However, Joe Wright can be a stylish director; and for the benefit of the audience, The Woman in the Window becomes an exercise in style over substance. Every scene looks great from the design of Dr. Fox's brownstone to the color and photography throughout. There is one completely engrossing sequence mid-film that seems to be the reason the entire film exists. Despite all that, the film does devolve into rote thriller territory because the mystery has to be solved, right? - unfortunately, the filmmakers were unable to find an interesting way to solve it.Although the plot can be kind of silly, as the centerpiece of the action, Amy Adams gives a passionate and heartfelt performance. Adams taps into the confusion, terror and heartbreak of Dr. Fox. She's a sympathetic character when she's not being stupid. In fact, Adam's performance deserves a better movie. The rest of the cast does serviceable work though. Julianne Moore bring infectious energy to a small role. Gary Oldman comes through in a couple scenes to yell and be sinister. Bryan Tyree Henry brings grounded empathy to an otherwise non-descript detective role. No one really is bad, except the kid who plays Ethan Russell. I didn't get what he was doing and that could have derailed the whole thing.The Woman in the Window is a thriller that tries its best to rise above the mediocre material. The director made good choices to add some flourish to the film and the lead performance by Amy Adams is better than the movie deserves. Ultimately, it is an entertaining watch, even though it is not an otherwise special movie. This film is a rainy Sunday afternoon watch with a handful of popcorn."}, {"rating": "6", "text": "Agoraphobic woman is concerned that the father of the family moving in has murdered his wife, replaced her and abused his song but actually, the son is the one who is a murdering psychopath."}, {"rating": "3", "text": "The main thing that got my attention for this movie is the fact that it was mentioned it was about an agoraphobic lady. As someone who has had agoraphobia for almost 14 years since it started, I was excited to see someone else's view and experience with such a thing. The whole agoraphobia thing did not make much sense to me, it seems that it was caused by a tragic event before in her past that wasn't shown till much later in the movie. Even then it didn't really show what let up to having such bad agoraphobia where she was unable to even go to her roof on her own house!? It wasnt even the roof, it was the stairs which were already inside!? Then she is able to open her window and yell out it perfectly fine!!! That made absolutely no sense. There was nothing apart of the movie to show the feeling of what agoraphobia was, it was more of just a plot in there to keep her housebound. The one thing that ruined it (not much of a spoiler) was near the end she was in a situation where she was unable to return to comfort. Lets just say she was bedridden(anyone who watched the movie will understand) She was perfectly fine, no panic at all!? If you are so afraid to even go to the roof of your own house, you will not be fine bedridden unable to return.So much potential to build a movie about something not understood well, yet they didn't even do their research much. She has a lot more mental issues that caused more bigger plot points in the movie and they were not mentioned in the description of the film or even mentioned what they were in the movie."}, {"rating": "5", "text": "The first 50 minutes were great, but the rest of it was totally cliche and wasted."}, {"rating": "4", "text": "One of the most disappointing movies of 2021. Good idea that's ruined by an awful script."}], "recommendations": ["bad_times_at_the_el_royale", "a_simple_favor", "before_i_go_to_sleep", "the_beguiled", "widows", "good_time", "the_machinist", "the_invisible_man", "broken_city", "terminal", "prisoners", "the_raven", "a_history_of_violence", "gone_girl", "reminiscence", "the_snowman", "a_cure_for_wellness", "split", "the_call", "the_little_things", "the_killing_of_a_sacred_deer", "trance", "knives_out", "red_sparrow", "last_night_in_soho"]}