{"id": 399, "title": "The Grey", "starring": ["Liam Neeson", "Dermot Mulroney"], "runtime": 117, "genre": ["Drama", "Thriller", "Action", "Adventure"], "description": "Following a grueling five-week shift at an Alaskan oil refinery, workers led by sharpshooter John Ottway, are flying home for a much-needed vacation. But a brutal storm causes their plane to crash in the frozen wilderness, and only eight men, including Ottway, survive. As they trek southward toward civilization and safety, Ottway and his companions must battle mortal injuries, the icy elements, and a pack of hungry wolves.", "releaseYear": "2012", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/a0Vt3wx8ciKmPt4iXPx9sH4HBVU.jpg", "categories": {"plot": 7.439024390243903, "acting": 7.878048780487805, "ending": 5.1, "soundtrack": 10.0, "cinematography": 8.0, "familyFriendly": 4.0, "funny": 6.666666666666667, "action": 6.0}, "reviews": [{"rating": "10", "text": "Closer examination of this movie seems to indicate that it is an analogy. It is really about man facing his God and his fear of death in a dignified fashion...which is what Liam Nesson does. As proof I offer the 4 line poem the main character's father wrote and posted on his wall. It is repeated several times so you can't miss it...you're not supposed to. It is the last thing Liam Neeson's character thinks of before....well you know. The message is quite clear. Live to fight another day, die with honor, strength, bravery and above all dignity. I think the movie was beautifully done and superbly acted."}, {"rating": "7", "text": "It's a fun, competently shot and directed movie that makes a few missteps. First off, this is a survival movie, but NOT a nature survival movie. The wolves aren't really killing for food or survival, there's a bunch of pompous exposition about them organizing and taunting the survivors and other crap. The wolves don't even bother eating some of the kills, the characters might as well be fighting the hillbillies from Deliverance, this is NOT a nature movie. Second, some really wonky physics towards the end, from improbably jump angles off of clips to improbable getting feet stuck between rocks. Good acting and decent existential statements though, worth the time it took to watch it."}, {"rating": "9", "text": "Loved this movie. It had something for everyone. Action lover? Its got that, and if u love story, and drama, its got abit of that. Unlike 80% of all movies, it is completely unpredictable. Things twist, and happen at random alot.. Also very bloody. Im sure you have heard alot of griping about the end. Forget it. But you have to watch the credits. All those who gripe didnt.... And even then, many werent satisfied with the ending. I was, and just leave an open mind about the ending. Once agian, it was great."}, {"rating": "7", "text": "This movie was fantastic. The actors all portrayed their respective characters quite well, and although a tad bit predictable at times, there were enough surprises and thrills to push you to the edge of your seat and care if the characters lived or died. It was a bit heavy on the existential angst that was sometimes out of place, but overall it just helped develop the characters and give a meaningful back story in between the action packed escape scenes through the tundra. The wolves, though unrealistically vicious, were necessarily so, in order to provide more danger and excitement. Overall, an action-packed thriller with sufficient character development and surprises to keep you interested."}, {"rating": "7", "text": "Intense and sad. A dog gets eaten. Liam Neeson is great, as usual, and, like most movies nowadays, he's in it. Joe Carnahan's best film since \"The A-Team.\""}, {"rating": "7", "text": "The grey is a decently executed survival movie which initially promises the possibility of a masterpiece with early scenes but becomes too uneven along the way.  Like many critics have said, the movie can be very poetic and introspective, and the cinematography is very pretty.  The wolf attacks start out being pretty scary.  They're brutal and fill the film with undeniable tension, but eventually they start being presented in a cleche way.  The attacks become too often, and the wolves themselves are used too much like Hollywood monsters.  This starts to compete with the higher, more artistic sensibilities in the movie instead of enhancing them.  This is also definitely one of the bleakest films I have ever seen, with a nihilistic agenda I absolutely disagree with.  However, Liam Nieson gives a great performance as always, and I can't deny that overall it's a gritty, gripping movie which is way better than most movies that come out in January.  In fact, it might be one of the best January releases ever."}, {"rating": "6", "text": "I appreciate the spare, gritty look and feel of the movie. No, the wolves didn't look 100% realistic with Jurassic Park-style CGI, but it doesn't matter. What's here is certainly convincing enough. The relationships between the men, they way each of them reacts to the crisis, and their journey have a very real texture to them. In some way that I can't specifically articulate, it reminds me a bit of Meek's Cutoff (a film I don't care for), though this film is much more entertaining. The characters are a bit flat, and given the way that some of the dialogue was written, it also reminds me of more off-the-cuff, found-footage films like Blair Witch and Paranormal 3. Which worked for me - it all sounds very natural.  And as Ebert suggests, you have to sit through the credits if you want to see the final shot of the film."}, {"rating": "10", "text": "I know its only a month into the new year, but The Grey is hands down the best movie of 2012 so far and its going to be VERY hard to beat. Liam Neeson needs to be recognized as one of the best actors out there. Absolute powerful performance in a very powerful movie. The Grey will grip you and toss you around for 2 terrifying, gut wrenching, and heart pounding hours. You will love and hate every minute of this movie, it's that powerful. This is the most suspenseful and terrifying movie i have seen in a long time. You will grow to have a major fear of wolves after this movie, I sure did. Plus i just have to say it, it was great to hear Liam Neeson quote \"I'm going to start beating the s**t out of you in about 5 seconds\" Just one of the few comedic relief moments in this amazing film. Go see this movie now, its money well spent. Just a warning, it will create a fear of wolves and potential fear of flying, but don't let that shy you away because this is a VERY good movie. 10/10"}, {"rating": "10", "text": "This is by far the best film I've seen yet in 2012. The Grey is emotionally riveting, terrifying and utterly philosophical. Where a film like \"The Edge\" starring Anthony Hopkins and Alec Baldwin was about man VS. Nature, The Grey is more about man accepting Nature. The performances are terrific and the cinematography makes you feel like you're there. The surround sound and big screen make a difference at the cinema. It's rare films like The Grey make it to the theatre. Do yourself a favour and go see it. Be warned; it's not for the faint of heart. AS WELL, there is an important, albeit very short scene after the credits."}, {"rating": "6", "text": "Although depressing, I never got bored.  Like most survival films, it has the stereotypical cast of characters, especially the annoying one that argues constantly with the others.  They never seem to be the ones that die initially.  The performances are solid, but the run time seems a little long for an intense movie.  For me it doesn't have the repeatability factor - I have no desire to ever see the film again, but it is well made.  The plane crash seems realistic, the weather makes you feel chilly, and the wolves give you goose bumps.  It just seemed like I've seen it all before."}, {"rating": "10", "text": "I have experienced things in life that taught me to never say \"can not be worse than that!\" Because I know that in general a fan of horror movies knows can.Every they see. If you confuse what happens in movies like \"things that never happen to me\", well, you learn.As the gray will open in the cold, the desolation Liam Neeson appears as a man with a dream of life without lies, without illusions.The reasons are not obvious. There is a sniper hired to protect workers against the oil platforms to frequent attacks of wolves, and draw only when fully necessary.He aspects of enough animals to meet their human companions is much dangers.His less admiration, at least in the works. They lose the real world, they deserve to be in the difficult conditions, he chose to be in.On a routine flight to return to the civilization of the plane crashes, literally, in the middle nowhere.The sound editors and technicians have done a fantastic job with this film, you feel so close to everything that is possible without there.Real be representations of accident victims and the cold, cold is a character full own.That would endanger his life.Then, struck with the true primary fear.The most of us have forgotten in our long journey up the food chain. The line between our world and the 911 safety and mental health, and complete the paris are open, not save you, but the world is very thin.He learns the hard way that the plane crashed into the world of the wolf and not to be.Having some knowledge of animals, but not much more than he hastens to live and protect what remains of humanity in this implacable.The survivors try to cope as well as you or I could, and are on whenever terribly strained.The gray is real, raw, scary and so good to be grateful for all aspects of your life.Neeson is at his best when he attacks everything that man and fears of nature, and is a cinematic experience.hydronite.com"}, {"rating": "8", "text": "After a harrowing plane crash a group of men (lead by Liam Neeson) is stranded in the middle of a frozen wasteland. They struggle to survive against extreme weather, physical injuries and a pack of wolves. The action is swift and jarring, without being too graphic. Unlike what you'd expect, the tension actually slows as the film progresses. Too much time is spent creating sympathetic characters, when all we care about is who's next to die and how. Still, it's thoroughly involving and damn suspenseful."}, {"rating": "7", "text": "The Grey is a very well shot, minimalist-written survivalist story where some very good actors face the Alaskan Wilderness and CGI wolves. Joe Carnahan gives the movie an existential edge, where the fierce weather serves as a back drop for some high integrity acting and metaphysical contemplation when a team of Oil Workers survive a plane crash only to face a pack of wolves. Poetic, Romantic, Contemplative - and in most sequences, a lot of fun. The weakest thing in the movie is the wolves."}, {"rating": "10", "text": "It's hard to say something bad about this movie - so well done. From the actors, to the stunt work, it all came together so well. The plot was very well paced and had a great twist. As long as you are wanting a happy ending, this is a must see!"}, {"rating": "9", "text": "Much better than average. This movie is too good for anyone who gives it a low score. Get a clue of what real story, real character is about. If the wolves aren't realistic there's a reason for that, which makes everything more haunting, more freakish, more alive than in a straight action movie.\r I thought Joe Carnahan was onto something when NARC came out, and this reinforces that feeling. He may be a bit full of himself and on the macho side but he's got a movie to be proud of. This is the best Neeson movie since Schindler's List."}, {"rating": "5", "text": "THE CONS Wolves just don't LOOK or behave like that. Period.  The process of suspending my disbelief was continuously interrupted by these wolves on steroids.  Kept waiting to learn they were the progeny of some escaped military experiment. That would have actually been more believable. Please stop maligning our hapless wolves (the REAL ones)! Only Neeson saved this from being a silly fairy tale. I was very highly upset by the abrupt ending.   I mean, we expect to be rewarded for tagging along on a perilous journey with the characters of a suspenseful story in the first place, right?  THE PROS *Great performances. Neeson at his best, as usual. *Awe-inspiring visuals of misty mountain ranges. *Crash seemed horrifically realistic."}, {"rating": "5", "text": "While this movie isn't as bad as I thought it would be, it still wasn't very good. The main problem with the movie is that it was unrealistic and unconvincing. The wolves were made to be much smarter and bloodthirsty than they are in reality, and for some reason they would appear and disappear at random points in the movie. If you've ever seen Frozen, you know what I mean. The random disappearance/appearance lead to more than a couple plot holes as the movie went on. And then there's the fact that a man somehow jumps across a 50 foot gap.... how? The second problem is the editing. While not terrible, throughout the movie there are flashbacks that just don't seem to make sense as to where they're placed. It felt clumsy and pretty awkward. And finally, there's the ending. While it could have been worse, it still is just not good. While cliffhangers can totally be appropriate in some cases, a survival thriller is not one genre it works particularly well for. This is one ending that will more than likely make you frustrated. There are a few positive things about this movie. The acting was fine (much to my surprise), and for the most part the script wasn't bad, minus a few absolutely absurd conversations that happen throughout the film. Think of this one as Poseidon in Alaska, though this one isn't quite as bad as Poseidon. It isn't a great movie. The Grey is a pretty bland, and even laughable at a few parts."}, {"rating": "3", "text": "Boring, tedious, slow, long, inconsistent, gray, and again boring, tedious, slow, long, inconsistent and gray. From Taken, Liam Neeson lost his way in his career"}, {"rating": "3", "text": "Awful!  A Hollywood studio obviously stamped Neeson's name on this one to guarantee covering it's  costs. Glad it was a red box! Unrealistic from start to finish. What a waste of money and resources. No knife edge survival of the fittest drama, just lots of very uninspiring metaphors and cliche melancholy. Come on Liam your better than this. Who are these film critics giving The Grey a 6.6 anyway???"}, {"rating": "8", "text": "This was a very entertaining movie.  One of my favorites so far this year.  Great story, cinematography, and just enough violence to keep your juices flowing..."}, {"rating": "9", "text": "One of the best films of the year! Liam Nesson, in one of his best roles to date, plays a rough, hard-nosed, scrappy, tough, kick-ass and yet subdued role in this film. He is quiet and focused exactly when he needs to be. All the performances are good and the cinematography is awe-inspiring. There is not a dull moment in this film. It exhibits truth and the harsh reality of these men coming to terms with their lives in one of the most harsh climates man has ever seen. The wolves are truly terrifying, and they are certainly an integral part of this story."}, {"rating": "9", "text": "Great movie about survival and how harsh nature really is. The lack of Liam Neeson kicking @$$ and taking names and the lack of over CGIed scenes is extremely refreshing in an industry that has been overrun with thrillers. This is not an action movie like a lot of Liam's recent films. The Grey is a somewhat survival horror movie with a lot of drama. You will be surprised and you will most likely cry at many points in this film. My only complaint about this movie is the fact that the wolves sort of act out of character from what I know about wolves, their habits might seem inconsistent to some survival experts, but that is such a minor complaint it really doesn't matter. Enjoy the film because it's really good."}, {"rating": "1", "text": "Horrible movie with no understanding of how wolves act, how planes crash, how people act, how humans live in sub zero temperatures and possibly the worst sound in the history of recorded sound.  There isn't one redeeming quality to this unless maybe if it was on a screen and provided you with light in a dark room."}, {"rating": "2", "text": "I will give this movie a 2/10 because I'm sure if I think hard enough I could bring to mind worse movies. There simply were no redeeming qualities to this movie. Inconceivable plot where one almost feels that the writer just gave up and went to another scene. This movie was a money making scheme. Built around a decent trailer, the whole plot was a mishmash of nonsense. Anybody who thought this was a good movie is either a philistine or they can suspend their disbelief far beyond anything I'm capable of."}, {"rating": "0", "text": "Thought any Liam Neeson film would be a good action movie!  Very depressing, They all should have been frozen to death with the light clothing they wore in the very cold climate!  If you decide to go and watch all hunted and eaten by giant wolves, be sure you stay to see the secret scene after all the credits roll off the screen.  Seems there could be a sequel after all, since maybe one of them actually survived the ordeal!  It there is a sequel, I will certainly wait for it to hit the dollar movie or the dollar Redbox rental for fear it would be as sorry a movie as this one was! .........  You would think they would be required to provide free popcorn and drinks for all who sit through this movie so you might come close to getting your money's worth!  Sorry Liam!  I've seen you in some good movies but this is certainly not one of them!"}, {"rating": "3", "text": "This movie started out seeming like it could actually take you somewhere. That instantly turned out to not be true. This movie had absolutely not story line or plot, it was just people running away from unrealistic wolves with no real goal in mind besides to keep running. The script for this movie could easy be fit on three pages. Other issues was there was no getting to know characters and the movie had no build but with a terrible ending."}, {"rating": "2", "text": "I don't care that the wolves were unbelievable, but I can see how people might have wanted something more authentic given the \"grounded in reality\" feel from the beginning. I take issue with the time devoted to showing Nesson's poetic, self loathing suicidal inner monologues. I swear there's 20 minutes of the same shot of -him in bed, then starring at the damn suicide note, then starring at a wolf- about 4 times in the movie. The ending is letdown, I'm sure the people making the movie thought it was epic, but he's fighting against wolves, not the English Army."}, {"rating": "0", "text": "Absolutely no credibility...in a movie that was supposed to be realistic. Everyone in the theater left stunned at the abrupt end, but happy it was over. I can't even light my fireplace, yet these arctic plane-wreck victims had ever-ready tiki torches and found perfectly cut wood for \"spears\" at their disposal. One jumped over a river ravine into a tree on the opposite bank to string a line  for the rest to shimmy across. They're in a blizzard, and then the sun's out an all of them are fine. Liam 's drenched in a river and soon after appears dry, let alone not frozen! And, why would they ever leave the plane to walk the vast wilderness of Alaska like needles in a huge haystack. Hunker down boys, build a little hut so those wolves don't get you, pile up the bodies and eat them if need be. Seems more prudent. Remember you had all that jet fuel so easily accessible (another ridiculous moment) at the crash site to help heat, eat and keep those wolves at bay. After all, the wolves were EVERYWHERE in the end. A lot ventured, nothing gained... on the screen and for viewers. PLEASE...just ridiculous in every respect!â"}, {"rating": "3", "text": "When the wolves had a 'personal vendetta' against the survivors i knew this was going to be one of those movies. They should have suspended all belief and make them vampire wolves."}, {"rating": "2", "text": "The Grey was absolutely not entertaining.  Someone owes me two hours of my life back....because this movie sucked.  The only good part was when the guys jumped off the cliff into the trees.  As I'm writing this I feel as though there's something missing.....oh, yea....a good movie....because this just wasn't it."}, {"rating": "0", "text": "Dark and depressing movie with no redemptive value. Focuses on suicide and hopelessness with no answers forthcoming. I have no idea why they made this movie. The folks in the audience where I saw the movie couldn't wait to leave when the movie ended. I never saw an audience clear out so quickly. This movie makes you want to relate to the wolves rather then the trespassing humans who argue and stumble to their grisly deaths. Only good aspect is the nice scenery..."}, {"rating": "5", "text": "Nothwithstanding its attempts to manifest itself atypically from others before it, \"The Grey\" simply relies too heavily on the shallow shoulders of its \"spear-carriers,\" whose only raison d' etre is to dispense egregiously daft and ribald prattling upon barren expressions, while the camera spotlights Neeson and mewls for support. What one experiences is a cinematographic waste of astounding, achromatic transcendental visuals, hampered by the dragging sense of directorial indecisiveness and subpar writing. Aside from Neeson's valiant efforts to egress from his enslaved character, the film enthralls with its surprisingly fresh metaphysical overtones, and adhesive tie-ins toward the latter-half. As a result, \"The Grey\" is a brimmingly stern philosophical survival thriller, laden with sporadic moments of jocosity and adrenaline, yet suppressed with a taste of dissatisfied chagrin."}, {"rating": "0", "text": "This movie had absolutely no redeeming qualities.  I would say the fact that the movie ended would have risen my rating to a 1.  However the ending was so terrible that a point had to be negated.  I debated farting in the theater and walking out, but stuck through to the end only to endure the utter disappointment."}, {"rating": "0", "text": "Extremely disappointed with this movie. Very few times do I feel the urge to write a review. There were a lot of inconsistencies with the plot. Jumping into a tree? COME ON!  A lot of build up in this movie to a weak ending. I was deceived into thinking this was \"Taken\" with wolves. I didn't relate with any of the characters in the movie and was glad as the wolves picked them off one by one. Also I find it hard to believe that a band of rednecks couldn't find any weapons or defend themselves. Even Sarah Palin kills wolves. A movie like this does not make me shed a tear about wolf conservation. A classic survival film with a satisfying ending would be, \" The Edge\". Anthony Hopkins and Alec Baldwin survive and KILL A GRIZZLY! Come on Neeson! The Grey made me want to chokeslam a wolf, but then I thought about how humans bred the wolf to make the chihuahua breed and that made me smile."}, {"rating": "0", "text": "Terrible. How can any filmmaker present this to an audience ? I knew after 15 seconds that this would be a sucker, the initial fight in the bar was so badly acted, you knew it could get only worse. I know nothing about wolves, but I know that wolves ALWAYS attack in packs, so the initial scene where he kills a lone wolf is absolutely ridiculous. The entire plane crash was completely out of this world: how could he just walk away without even a scratch ? In addition, do producers never learn that reflective moments should be used extremely sparse, if at all ? Because they put you asleep..."}, {"rating": "8", "text": "Great survival movie and Liam Neeson gives brilliant performance. Gritty and tough to watch in places but has a great message about what drives people to survive in bad situations. About keeping memories of those we love with us no matter what. However if you don't want to read too much into the movie there are lots of tense scenes to keep you entertained."}, {"rating": "9", "text": "This was an amazing movie!  Every character played their part admirably, and watching them as they struggled together and interacted with each other really made me care for these characters.  Some people may complain about the lack of a plot, but what they're missing is that this movie is about survival - finding a way out of that frozen hell and escaping the wolves.  I cried some serious manly tears at the end.  My only complaint is that the wolves seemed somewhat fake at times, but if you can suspend your disbelief for those short periods, get ready for an amazing ride."}, {"rating": "9", "text": "The Grey is a movie like nothing I've ever seen before.  It's gritty and dark and the movie portrays the overall dismal tone very well through: character conversations, setting, and suspense.  The movie is very well done, with only the blemish being the CGI wolves that seem to feel cheap.  Other than that, the movie is great.  Dialog conveys most of the story, although what is told is short and vague, it manages to give you an overarching background to the characters that is mostly complete.  The movie does a really good job of pulling you in and keeping your interest until the conclusion.  The characters were somewhat stereotypical, but not over-the-top.  The language was controlled and wasn't overdone, and I didn't feel like their was random expletives added for laughs.  The survival aspect was very cool, and Liam Neeson's character is Oscar-worthy.  This movie deserves to be nominated as best movie, best character, and best sound design.  Although, it wouldn't be nominated for best CGI; it wasn't the worst I have seen.  Overall, a great story with spotty CGI and amazing setting.  The setup to the final scene is perfect, and the way the movie ends (maybe will disappoint some), was just perfect in my opinion.  First movie to WOW me in 2012.Story - 8/10CGI - 6/10Action - 9/10Acting - 10/10Setting - 10/10Achieved Realism in environment and believability in story.  9/10 Great Movie"}, {"rating": "10", "text": "Acting: 10- Neeson was at his best. One of the finest performances of his career. Story: 10- I was on the edge the whole movie. This movie is not a Taken. It is a methodical story about humans surviving for nothing other than just to survive. Very deep, dark, and haunting. Cinematography: 10- This movie is well shot. The plane sequence is one of the best. I honestly loved the scenes of the Alaskan wilderness. If you are a movie buff or enjoy Neeson's great acting. This is a movie to see ASAP."}, {"rating": "7", "text": "This movie is the wolf version of Jaws. The wolves were unrealistic which is the biggest flaw in the movie but the film is so tense and feels so powerful that it was worth the watch. The acting was amazing and the cinematography was stellar as well. Overall, get ready for the most intense movie in years."}, {"rating": "8", "text": "From the trailer, this movie puts itself out there as a man vs. beast thriller. However, when watching this movie at least to me, it felt like it was a strict character study of men and the challenges that a man faces not only against something natural, but mainly emotional. Liam Neeson does a fantastic job but I felt like he was trying for his Will Smith \"I am Legend\" moment. I mean you were Qui-Gon Ginn and in Schindler's, a little less acting and more raw emotion would have sufficed. With that being said, the visuals and sets were great. Actions sequences were well done and at points you almost forgot how you were sitting in a theater."}, {"rating": "3", "text": "Easily one of the most depressing films I have seen for a long time .Neeson does what Neeson does best-stoic and heroic - and the Wolves do what they do best .Cinematography is good(not difficult given the landscape).Wolves 1 Neeson 0."}, {"rating": "7", "text": "A lot of potential to be better, but a solid movie overall. Great Performance by Liam Neeson. The plot & dramatic scenes definitely pull at the heart. My only criticism was the movie did seem to drag on a little longer and the unnatural feeling of the wolves, took away from how good this movie could have been."}, {"rating": "10", "text": "Although the story has been told by many movie makers, this rendition is SO superbly filmed and acted, it would stand up to any that went before it. The similarity to most of its predecessors ends, however, at the richness and depth of its dialog. Great effort by the cast and crew!"}, {"rating": "8", "text": "I'm curious why the wolf \"experts\" went to see this movie in the first place. Hadn't they seen the trailer in which Neeson is shown taping a knife and small broken bottles to his hands in preparation for hand-to-paw combat with a wolf? Wasn't that enough of a clue to indicate that, er, it's a movie? You know, the type of mass media where entertainment usually takes precedent over fact? Not for a minute did I believe what I was seeing was an accurate representation of wolf behavior, nor did I leave the theater hating wolves. On the contrary, I left the theater feeling highly entertained, and with a heightened curiosity about natural wolf behavior. Subsequently I learned that although there are recorded incidents of wolves attacking humans, they are negligible. Wolves are naturally shy of humans. But I didn't go to the theater thinking I was about to see a National Geographic special either. Neeson was terrific playing a very sympathetic character trying to deal with the great sadness in his life. The slow unraveling of the truth behind his deep sadness is one of the strengths of the movie. But what I loved best about this movie was the fact that it did not turn out to be the kind of macho guys' movie the trailer led you to believe. There are some very moving scenes in the movie. Neeson helping a victim of the plane crash deal with the inevitable result of his horrific injuries was for me was quite moving. And the plane crash itself was all too realistic. Yeah, it was pretty riveting. And you'll be surprised to learn of the significance of the scene in which Neeson faces off with the wolf. Finally, don't stay for the extra scene you get after the credits roll. That extra scene, which lasts only several-seconds, is an unnecessary smear on a perfectly finished movie canvas."}, {"rating": "8", "text": "A movie where you feel completely entertained the whole time and actually feel for the characters sounds like a pretty good one to me. the landscape shots and tenseness you feel throughout made it worth the price of admission."}, {"rating": "10", "text": "Liam Neeson's Best Movie.... Cinematography is Some of the Best in Any Movie to Date.... Stay to the Very End After the Credits.... for Extra Footage."}, {"rating": "10", "text": "Liam Neeson may be the oldest white actor capable of playing the tough guy without being the old tough guy. Throughout The Grey he does what he can to lead plane crash survivors through the frozen tundra of Alaska, and no one questions his age. Director Joe Carnahan takes the audience into a bleak lifestyle amid the Alaskan pipeline. Ottway (Neeson) makes it through with flashbacks of his wife and a chilling voice over. The crash is shown from within the plane and avoids many of the common theatrics. No one is clearly shown being sucked out. For that matter most of the visual effects cast a less than ideal lighting circumstance, which drives home the motif. Injuries, freezing winds, and a lack of food are enough foes for any survivors, but our heroes are being pursued by wolfs. I'm not suggesting that it's impossible, but the behavior of these creatures puts on quite the show. They've certainly seen Halloween. Credulity is also being pushed to limits when the standards line such as \"who made you the leader\" have to be muttered and one hothead fancies a brawl. Of course Neeson's dominance of the narrative makes him a safe bet, and his buddies a risk. As the film wears on I wanted to buy these blokes more time. Despite how simple the premise I'm sure I could have been entertained for 3 hours. Maybe if the other guys had more spotlight scenes they wouldn't feel so much like Ottway's human shields. The story is simple enough that a big reveal at the end is somehow more effective for the sake that no one was waiting for it. This isn't mystery. What The Grey manages to do with the underexplored is leave the viewer with less question and more statements. The Grey is a man's movie. Fatigue and despair translate with the same forceful impact of the physical blows the survivors endure. It's also a perfect example as to why one should wait for the monk's reward at the end of the credits."}, {"rating": "10", "text": "a very dissapointing story of survival..its dissapointing to the sense that for less than 2 hours of watching it is pointless though good acting for Liam Neeson...depressing movie"}, {"rating": "10", "text": "This movie is brilliant. I want to get that statement out of the way because it is, quite simply, the most succinct way to say it.  This film is intense, poetic, harsh, and gritty. It deals with beautiful themes in a very thoughtful and sensitive way - faith, death, despair, love. I have seen it twice and it moved me even more the second time. The soundtrack underlines the story in a heartfelt and beautiful way - kudos to Marc Streitenfeld.  Liam Neeson's acting is at an all-time high. Most people appreciate the genius behind this man's acting but here he takes it to a new level. Cannot recommend this movie highly enough."}], "recommendations": ["sanctum", "avengers_infinity_war", "no_country_for_old_men", "a_quiet_place_part_ii", "127_hours", "the_shallows", "contagion", "the_hunger_games_mockingjay_part_1", "a_history_of_violence", "hanna", "the_day_after_tomorrow", "brimstone", "sunshine", "gravity", "the_mountain_between_us", "pompeii", "a_quiet_place", "code_8", "dunkirk", "maggie", "x_men_apocalypse", "children_of_men", "under_the_skin", "infinite", "everest"]}