{
  "id": 298,
  "title": "The Town",
  "starring": [
    "Ben Affleck",
    "Jeremy Renner"
  ],
  "runtime": 125,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Doug MacRay is a longtime thief, who, smarter than the rest of his crew, is looking for his chance to exit the game. When a bank job leads to the group kidnapping an attractive branch manager, he takes on the role of monitoring her – but their burgeoning relationship threatens to unveil the identities of Doug and his crew to the FBI Agent who is on their case.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3NIzyXkfylsjflRKSz8Fts3lXzm.jpg",
  "categories": {
    "plot": 6.7560975609756095,
    "acting": 7.245283018867925,
    "ending": 6.833333333333333,
    "soundtrack": 7.0,
    "cinematography": 8.5,
    "familyFriendly": 3.0,
    "funny": 8.0,
    "action": 6.809523809523809
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I often find myself rating a movie against my own expectations.  My expectations were relatively modest for this film, but it greatly surpassed them. I expected great things from Jeremy Renner, and he delivers in a big way. He might be one of the best 2 or 3 actors out there.  Ham is serviceable, but his part isn't written to be an equal partner in an adversarial relationship like McNulty and Stringer Bell are in \"The Wire\". His part is too simplistic, but he plays it well. The only true weakness in the cast (and she's not even that bad) is Blake Lively.  Rebecca Hall is one of my all-time faves, and she delivers here, too.  One of our critics calls this a cross between \"Heat\" and \"The Departed\".  But I felt it was more like a cross between \"Heat\" and \"Good Will Hunting\".  Affleck's character pondering leaving this small corner of Boston is so similar to having to \"go see about a girl\", it's almost like we were back 10 years.  But it's not a real problem with the film. You write what you know. The pace of the film is terrific, and you should be riveted for much of it. (Oh yes, the two fathers are tremendous in small roles.) I won't say more other than it's a very solid film.  Great way to kick off the fall season."
    },
    {
      "rating": "7",
      "text": "\"The Town\" is daring and tense; its a rare gangster movie that is abundant with strong action and appealing force to the audience. Bravo Mr. Affleck, Bravo!!"
    },
    {
      "rating": "10",
      "text": "Wow! What a terrific film. I was incredibly surprised. I was pretty much dragged to the theatre by my brother, and I was very happy that I got to see this. I was sitting on the edge of my seat for half of the movie! It was incredibly suspensful, and even some jokes here and there. and I really liked the ending. i would recommend this film to anyone. go see it!"
    },
    {
      "rating": "8",
      "text": "Finally a thriller that is actually intelligently written, acted out and overall packaged! It is always a fine balancing act to make a film with such thematic be really good and effective. Without unnecessary car chases, violence (all the violence is rather appropriate in the film), \"The Town\" represents what every thriller ought to be. With an impressive cast, led by the excellent Jeremy Renner and Rebeca Hall, as well as director/writer/leading actor Ben Affleck, the acting in the film is excellent. Great ensemble, with Jeremy Renner really standing out as one of the best performances - matching up to his performance in \"The Hurt Locker.\"Overall, the film is somewhat slow, but it definitely keeps you interested. Maybe not as suspenseful as it could have been, but still cleverly written and directed by the surprisingly good Ben Affleck, the film is definitely a must-see of 2010!"
    },
    {
      "rating": "9",
      "text": "This film shows that Ben Affleck has completed his career turnaround and it shows he belongs in the list of elite directors. In The Town, a story of a group of bank robbers, Affleck is able to show us the layouts of Boston, give us some epic action sequences, and some amazing performances from the cast. Affleck, Hall, and Renner show that they are actors with a mission and that mission is an Academy Award. I wouldn't be the least bit surprised if any of them are nominated this year. Hamm is not given enough to work with and can't make his character seem appealing to anyone. Lively was a pleasant surprise and turned out a good role completely away from her Gossip Girl style. While Cooper and Postelwaithe are not n the movie for long, they milk the little time they have to churn out great performances. Overall this film will keep you thoroughly entertained and has enough substance to make a legitimate run at this year's awards."
    },
    {
      "rating": "9",
      "text": "A great second outing for Ben Affleck as a director, The Town is an effective and gripping heist film, with many great performances and strong direction. The film successfully manages the difficult balance between character moments and dynamic action sequences. The performances are across the board solid, the stand out being Jeremy Renner, who I had high hopes for after The Hurt Locker, whose Jem is crass and bold, but Renner makes his brusque attitude understandable in the circumstances he lives in. Rebecca Hall also is amazing as Claire, who is the audience's entry point into the events unfolding. Hopefully this film will allow Affleck to get more work as a director, because he has definitely proven himself a promising one."
    },
    {
      "rating": "10",
      "text": "It takes place in the city of Charlestown, MA, where apparently there are a mass amount of bank and armor car robberies.  Ben Affleck plays Doug MacRay, the leader of a crew which robs said banks and armor cars. In this team includes Jem Coughlin, played by Jeremy Renner (who has a great performance in this movie), and two others (who are pretty much no names in Hollywood), and each of them are just as bad ass as MacRay.  The opening scene has the team robbing a bank, while they wear Grim Reaper-like masks, and we get introduce to our leading lady Claire Keesey, played by Rebecca Hall. The robbers go through this entire bank with precision and grace that it looks almost like an art.  However, the silent alarm is tripped and they end up taking Claire as a hostage, just in case. When the close is clear, they drop her off unharmed and the FBI immediately ask her what she knows.  With the possible risk of her identifying the culprits, MacRay takes it upon himself to check on her and see if shes going to talk, but by doing this leads to an unforeseen relationship between the two. This is the first movie directed by Affleck I've seen (haven't gotten around to Gone Baby Gone), and I'm impressed on his work. People often comment on his acting ability but as for his directing, it's top notch.  The movie has the intense feel of a crime thriller and makes you care a little bit for Affleck's character, who is just trying to get out of the heist game and make a life thats better than this. Not only is Affleck on par with the movie, but the rest of the cast is great as well. Jeremy Renner gives a great performance as Affleck's best friend/partner in crime and Rebecca Hall is a great leading lady.  Even Chris Cooper, who plays Doug's father is good for the short time he has on screen. The camera work could of used slight improvement, because it does the \"shaky camera\" technique, and often gives me a headache.  The other thing I guess i have a problem with is Affleck as the lead. It kinda seems like an ego trip for the director to be also one of the lead stars, but most actors/actresses are starting to direct and put themselves in their own movies, and it works occasionally , and this is one of those times where it does work."
    },
    {
      "rating": "8",
      "text": "The Town is at its best whenever the bad guys are up to no good.  The cast is very fitting indeed with Affleck and Renner as the key \"bad guys\", Hamm as their adversary and the always brilliant Postlethwaite as the don.  Brought me memories of \"Heat\" and  \"Break point\"."
    },
    {
      "rating": "7",
      "text": "Sadly The Town is not as finely executed as the bank robberies it portrays on screen. It does not completely stall, but Affleckâ"
    },
    {
      "rating": "8",
      "text": "Ben Affleck's \"real\" directorial debut definitely lives up to it's unoriginal title and intriguing cast. Never has a movie just felt so normal, so engaging, it leaves the audience to become strays in the theater. The film quickly learns to be intelligent, but simplistic at the exact same time. The action reaches it's peak near the end, because there was a slight lack of it for the rest of it. The interaction between the characters in average dialougue can make you wonder how this movie can be interesting. Well, it works!"
    },
    {
      "rating": "8",
      "text": "I don't like Ben Affleck as an actor. I think he's very overrated and quite bland. As a director thou, he is now 2 for 2. The town was a terrific story based on actually events. The action sequences are phenomenal and the story was pretty solid. The crappy bawston accents did make the dialogue a little difficult to understand but overall, I feel like this was a great film that defiantly lives up to the hype. It worth checking out."
    },
    {
      "rating": "8",
      "text": "Everyone really hit their stride with this career making movie. Affleck reinvented his career and became the next big thing (again) and Renner, who absolutely killed it in this movie, starred in several big films soon after. The Town is one of those movies that you are going to be very satisfied watching, There's no real bad thing I can say about it."
    },
    {
      "rating": "9",
      "text": "A single square mile in Boston called Charlestown contains more bank robbers than any other municipality in America/ And it is here where the setting of one of the best films of 2010 takes place. \"The Town' is a powerful force that explores thoughts deeper than that of most films about organized thieves.We are introduced to four criminals who are about to empty out an innocent bank. Two of them, Doug and James, are given much attention throughout the movie. The other two are, uh, well I believe there hasn't been a successful heist before in movie history that featured less than four guys. So there you go.Because this is just the opening scene, the cops arrive right after the crooks get away, and in movie rules, theyâ"
    },
    {
      "rating": "10",
      "text": "Wow, this movie is an absolute 12!!!  By far the best movie I've seen in 10 years.  It's simply riveting.  Run, don't walk, to see it.  I smell an Oscar!  We are going to see it again."
    },
    {
      "rating": "10",
      "text": "No offense to him as a person but other than Good Will Hunting, i find Ben Afflecks acting to be a joke. Though in this movie which he also directed, he is an intriguing character. I went into the movie thinking a wasted 6.50 on another turd flop of a movie but left with the satisfaction that it is one of the better crime dramas i have seen since  The Departed."
    },
    {
      "rating": "2",
      "text": "Ben Affleck is the badass with the heart of gold, please.  This is just his poor attempt at trying to be Matt Damon in Good Will Hunting or Leo in The Departed.  We get that you love Boston, so do I, but as much as you were trying to be \"authentic\" to gritty Charlestown you cast Gossip Girl as a crackhead townie.  I didn't care about any of the characters nor did I think any of them acted appropriately (Best example is Rebecca Hall's character, wtf is her deal).  The story was lame and uninteresting and the ending was unrealistic and overdramatic.  I think it's just riding on the coat tails of a Boston setting and some good robbery masks."
    },
    {
      "rating": "10",
      "text": "â"
    },
    {
      "rating": "7",
      "text": "Wish I could give them movie a 7.5, but 7 will have to do. This movie had a lot of hype and I think my expectations were too high. It was a solid flick, but not a movie i'll be watching over and over again (i.e., departed). The action was solid, the acting was a little all over the place. Supporting case was probably all better than Ben. He got yolked up for this movie and looked the part, but I just felt like he was pretending to be bad ass instead of just being bad ass. One thing that I found a little lackluster in the film was the tempo of the music. A lot of scenes had little to know soundtrack. It might just be my personal taste, but I love when the music and the action just sync and you're totally lost in the scene. Certain points had it, the last heist (for sure), but for the most part I think Ben went w/ a realistic approach. I recommend this movie, but don't expect the movie of the year, just another solid entertaining action flick."
    },
    {
      "rating": "5",
      "text": "The Town is very much a sappier version of Heat.  That being said, it's not a bad movie.  It just wasn't nearly as good as I was expecting it to be."
    },
    {
      "rating": "7",
      "text": "With two movies under this surprising filmmaker's belt, one commonality stands out; aside from, do we dare say, the auteur's fondness for time-lapse photography(he likes fast clouds), and that is his tendency to uphold the sanctity of motherhood, at the expense of the best interest for the child. Patrick Kenzie, the low-rent gumshoe played by Casey Affleck in \"Gone Baby Gone\", not only sees law and order in terms of black and white, his monochromatic worldview extends to people as well, best exemplified in the penultimate scene where he \"[does] the right thing\" and calls the cops on Jack Doyle(Morgan Freeman), who helped orchestrate the kidnapping of a little girl. Despite his girlfriend's protestations, Patrick insists on reuniting the child with her druggin' and whorin' mother(played by Amy Ryan). How can the detective be this unbending and injudicious, so unseeing of the big picture at hand? How can the protagonist, the hero we're supposed to relate with, let us down so badly? It's blood simple. Provincialism is the cause root of Patrick's blindness; he never left Dorchester, and as a result, the Massachusetts native never attained the proper perspective of its denizens, especially Helene, because he's one of them, a lower-class Bostonian with the same issues about race and social class, the same type blood. Twice, on separate occasions, Helene utters the n-word in Patrick's company without a reprimand, without even flinching. His complacency toward the racial epithet materializes as a real blind spot when it's revealed that the black chief of police keeps a white wife. As a counter to Angela's advisory against pursuing the letter of the law, the primordial Patrick, the hard-scrabbled street kid whom the soft girl tamed in high school, returns with a vengeance, when he asks with some bitterness and wounded pride, \"Why? Because he has money and makes her sandwiches?\" Is Patrick lashing out at Doyle's class, or race? The moviegoer gets the answer in the closing moments of \"Gone Baby Gone\", as the detective sits with the returned girl on the parlour sofa. Only then, after it's too late, over the blare of a cartoon from the electronic babysitter, does the detective practice introspection. Whereas Patrick Kenzie never left Boston, Doug McCrae(Ben Affleck) returns to Charlestown after his professional hockey career goes nowhere. According to Jem(Jeremy Renner), his almost famous friend thinks he's better than the other neighborhood boys-turned-hardened criminals(an accusation that's right on the money), unlike Patrick, who doesn't give up on Helene's potentiality as a mother, which in effect, validates his own self-worth as a bred-and-born townie. While Patrick, arguably, is a closeted bigot, Doug's brand of intolerance seems more rooted in class. Rather than improve the life of the child he fathered with Jem's sister(played by Blake Lively), the disposable girlfriend, the barfly he f****, Doug leaves behind the stolen loot with Claire(Rebecca Hall), the woman he makes loves to, his ticket out of Charlestown(as Angela was Patrick's ticket to liberate himself from the sociological limitations of his own town); he leaves behind a little girl in hell, likewise, with an equally unfit mother."
    },
    {
      "rating": "6",
      "text": "This is a movie full of hits and misses.  Ben Affleck directing is a hit.  Ben Affleck acting is a miss.  I personally feel that Mr. Affleck suffers from the terminal disease of being too-likable-in-a-normal-sort-of-way.  The kind of likeable that I would have over to watch a hockey game.  Not the kind of likeable that I would believe could rob banks and have one of the hostages fall in love with him.  There are other actors out there who suffer from a similar disease of being too good looking to be believable.  Luckily, there are some other very qualified personal who are able to make the most of their characters.  And Affleck allows them the space in order to do it.  The movie clips along at an efficient pace and effectively balances out action and drama.  The action scenes are well executed and get the adrenaline pumping, but I found some of the smaller scenes were handled more clumsily.  This was a disappointment considering Affleck's previous film Gone Baby Gone.  In particular the scene involving Renner, Affleck and Hall sitting at a cafe would have produced it's menacing intentions more effectively using subtlety rather than telegraphed acting and dialogue.  The movie closes out with more hits and misses, but Affleck still shows promise as a budding director."
    },
    {
      "rating": "7",
      "text": "I watched The Town knowing that (a) it starred Ben Affleck; and that (b) it *might* have been directed by the same person. Nothing more.I really enjoyed this Boston bank robbery tale and - as I'm a sucker for a happy ending - I should've loved how it was concluded. The last 15 minutes felt a little tacked on, but it was a good story well directed by Affleck."
    },
    {
      "rating": "7",
      "text": "Don't be fooled by the fact that Affleck is in this - it's actually pretty good! Slightly predictable popcorn film, but with some good performances and a decent script that make it better than most. Worth a punt."
    },
    {
      "rating": "3",
      "text": "Here we have another attractive woman who falls in love with the lame anti-hero as soon as he tells her the time of day. Why don't these women ever have boyfriends? Or even friends? Half way through the movie the FBI figures out the robbers are Ben and co. So they set a plan in motion involving a slut obsessed with Ben that may or may not work. Meanwhile Ben and his posse walk out their front door and rob two more banks. Having someone watch their house I guess is just too much expenses for taxpayers to handle. In between well shot but completely illogical action sequences you'll find this conversation repeated ad infinitum: \"This is what we do. This is the life we chose.\" Sigh...This movie is a joke. Then the ending is a twist of the knife."
    },
    {
      "rating": "7",
      "text": "An above average heist movie that does its job well. Was hoping that this would be an Oscar worthy flick that would grasp me like The Departed and Gone Baby Gone did. While Ben Affleck did a nice job directing and put in a solid acting performance there wasn't enough of an attachment between the viewer and the characters."
    },
    {
      "rating": "5",
      "text": "I was disappointed in this movie.  Resembled Heat with Val Kilmer, but much slower.  I could not get invested with the characters enough to care about them when it was needed the most. I found myself bored by the long pauses between action scenes.  I understood the need for it, but the way it moved was just to slow for me."
    },
    {
      "rating": "4",
      "text": "This movie received a mixed response from me. I expected much more from Ben Affleck's skillful directing. Jeremy Renner, Jon Hamm, & Blake Lively seemed into their respective roles, however Affleck and Rebecca Hall were in their own little worlds. Pretty disappointing, however I liked the intelligent plot and jokes through the movie."
    },
    {
      "rating": "5",
      "text": "Negatives - Lots of cliches, unintimidating bad dudes, cheesy Boston over the top accents, Ben Affleck is in it.Positives - Bank robbery action is good, Chris Cooper rocksWorth seeing but temper your expectations."
    },
    {
      "rating": "9",
      "text": "Who knew that Ben Affleck had such talent -- not only as an actor, but as a director?  Considering how lousy most of this summer's movies were, I'm amazed that this excellent offering has scored only in the mid-70s.  And, am I imagining it, or are most of the 7-or-lower reviews below a bit vague -- lame, even -- in comparison to those that praised the film?  Me, I'm looking forward to Affleck's next project."
    },
    {
      "rating": "8",
      "text": "Set in Charlestown the \"Town\" reminds us of films like \"The Departed and \"Mystic River\", it's paced perfectly and the acting is mesmerizing.Full review : www.dukeandthemovies.com"
    },
    {
      "rating": "5",
      "text": "I watched the DVD having seen only the original trailers and expecting an action/heist film. I got that for about 15 minutes at the beginning and 15 minutes at the end. The rest was a long-winded (2 hours) drama about the developing relationship between three of the characters involved in the robbery at the beginning of the film. If you're looking for an action type flick you might want to pass. If you're an Affleck fan you will get a decent film that will help him climb back up to the top of Hollywood where he one stood alongside Damon."
    },
    {
      "rating": "1",
      "text": "The problem with movies starring Ben Affleck is...Ben Affleck. He ruins every movie he is in because he is so incredibly full of himself, and apparently no director can get that out of him.\rI stopped caring 15 minutes into the movie, when he hooks up with the main witness. How stupid can you be ? She heard his voice, loud and clear, and she even tells him that she could probably identify the robbers by their voices. From that moment on, the audience must simply wonder why she doesn't.\rLong, boring, predictable. Nothing new under the sun. Like a cheap spin-off of The Departed. I just watched because the girl was cute...and give it a one."
    },
    {
      "rating": "2",
      "text": "Despite the decent Boston accents that everyone handles acceptably - despite great character actors Pete Postelwaite and Chris Cooper in tiny underutilized roles - despite the fact that somehow Jeremy Renner managed to snaggle a nomination for Best Supporting (ensuring that he will continue to be typecast as a sociopath ad infinitum,) this is a predictable heist movie with extraneous amounts of foul language and unnecessary violence making up for anything close to character development. By the time the inevitable happens, I couldn't care less who was going to make it out alive."
    },
    {
      "rating": "5",
      "text": "It copies the central theme from the movie Heat and throws a bit of James Bond style chase scenes in it but the overall affect is  weak. Some parts are great but there is some shortcuts taken in the script which can leave the viewer somewhat cheated.  Its an Ok movie but not one to watch a second time."
    },
    {
      "rating": "2",
      "text": "This movie sucked.  Every character was stereotypical - the bank robber with the heart of gold, his buddy the over-the-top f*ckup (worst criminal ever, seriously), the damsel in distress who seemingly has no perception or awareness at all and the FBI guy who gets outsmarted at the end.  I think I wrote this on my lunch break in 7th grade... and then threw it out because I thought it was too cliche.  Cool shootouts and Nun robber masks though, but that was what, 3 minutes out of the whole movie?"
    },
    {
      "rating": "7",
      "text": "It's good"
    },
    {
      "rating": "4",
      "text": "The town is a film to look at in two different ways. It can be your standard action film with average acting and poor story or a film that mixes story and a action brilliantly. I would say the first choice was more accurate."
    },
    {
      "rating": "9",
      "text": "After seeing Gone, Baby, Gone I had some expectations for this film and am happy to report it met or exceeded most of them. This film spends a lot of time in the gray areas where good guys aren't so nice and bad guys aren't so mean (sometimes.) That might sound like the standard anti-hero theme we've seen so much in Goodfellas, Sopranos, etc. but this film still managed to make a couple unexpected turns. Can't ask for much more than that."
    },
    {
      "rating": "7",
      "text": "The Town should've been re-titled \"Boston Heat,\" since it pays heavy tribute (I'm in a good mood, so I'll refrain from using the word rip-off) to Robert De Niro's great heist flick. But all in all, that's not such a bad thing...Let's see if any of this sounds familiar: a crack bank robber/master thief known for his elaborate planning and cautiousness, falls in love with a woman he meets and begins to reconsider \"the life.\" He heads up a close knit team who depend on him to get by, including one hothead/trouble maker he keeps making exceptions for. Hot on his trail is a savvy, dedicated lawman obsessed with bringing him down. The two men come face to face and pretty much issue mutual challenges to best the other. Of course, despite his odd hours and ever-present indications, the woman remains clueless for most of the movie. Ultimately, it all comes down to one final job... one that will put his teammates right and provide enough of a cushion for the man (and hopefully the woman) to start over somewhere. Bullets, blood and vengeance ensue.I thought so.Of course, you could do a lot worse than making a movie that's essentially Heat Lite. Affleck provides some great scenes, including the opening robbery, which moves so fast that you feel like you've been bum rushed right along with the patrons and employees of the bank. And the movie is put on the shoulders of some good actors, including Jeremy Renner (\"The Hurt Locker\") as Affleck's impetuous partner in crime, Chris Cooper as Affleck's incarcerated pop, Titus Welliver (LOST's Man in Black) as one of the local cops, and Pete Postlethwaite as the local boss that complicates things.[Perhaps because he was staying so close to the Heat formula, Affleck felt the need to put a crappy actor in the lawman's role... although instead of Pacino's overacting, he instead uses a wooden Jon Hamm (I don't care what you people say. Mad Men blows and he can't do anything other than hold a smoldering cigarette). Hamm sucks the life out of almost every scene he's in - which is unfortunate, since his screen presence increases as the movie goes on.]What bothered me most about the movie was how silly the core plot is. Even though I never bought De Niro's relationship with Amy Brenneman, at least it was born out of De Niro's growing loneliness and the fact that for all his success, it wasn't worth having if there was no one to share it with (unlike like the rest of his crew, who all had families and/or significant others). Here, Affleck's crew kidnaps one of the bank employees (Rebecca Hall's Claire Keesey) for no real reason whatsoever. While in their keep, the men feel no reason to disguise their voices or talk in whispers (she's blindfolded). And then just as inexplicably, they let her go (despite Renner's character being keen to want to kill/maim/shoot every person who so much as throws him a sideways glance).Afraid that they may have let a key witness go scot-free, Affleck decides to tail her to find out what she knows. They end up meeting in a laundromat and, seemingly within minutes, they fall for one another. It's hard to decide what I couldn't fathom more:- How this chick didn't know it was him (Affleck's 5 minute dissertation on why she shouldn't tell the police about a key piece of evidence and his use of acronyms only a cop or criminal would know might have tipped her off) right from the get go;    - How Affleck's Mr. Cautious Planner could let himself screw up this badly; or- How it could take the Feds so long to put this Encyclopedia Brown-esque mystery together....but that's the critical side of me talking. If you asked me whether or not you should see this movie, I'd tell you yes. Because it's fast paced, it holds your interest and you really do find yourself rooting for Affleck's character in the end. Thumbs up. You won't be disappointed. More reviews at www.deconstructors.com"
    },
    {
      "rating": "7",
      "text": "The gritty feel and good acting saved this for me despite the fact that I did not quite believe the romantic part of the story line. At this point I would watch Jeremy Renner in anything, though -- and Rebecca Hall is remarkably real as well."
    },
    {
      "rating": "8",
      "text": "The Town is an intelligent thriller, with interesting dynamics between the characters, excellent performances across the board and proof that Ben Affleck is a terrific director.  Whilst the plot and heists are not exactly original, the story unfolds at a perfect pace, and the action scenes and acting are beautifully down-played giving the film a real authenticity and genuine emotional core.  Having been impressed with his previous effort, Gone Baby Gone, and marvelling at the terrific trailer, I was not disappointed by Affleck's latest.  He is a truly talented director, alongside his writing and acting skills, which have been seriously underestimated after the Gigli Ben-nifer debacle, and I look forward to his next venture."
    },
    {
      "rating": "10",
      "text": "Great movie. Exceeded my expectations. Ben Affleck is great, I like when him and Damon can use their Boston accents in flims. Jeremy Renner really surprised me. I thought he was better in The Town than he was in The Hurt Locker. I don't care how trashy Blake Lively looked, I would still kiss her face."
    },
    {
      "rating": "8",
      "text": "The Town' runs on a very simple premise, executed particularly well by Ben Affleck, the star and director of this film. Affleck plays Doug MacRay, the leader of a group of bank robbers in a small Boston-area town, and it turns out that they're no amateurs; in fact, they've been doing this for years. It's this small town's underground crime family, an accepted aspect of their culture. Doug decides he wants out of the \"family business\" after falling in love with the hostage from his previous robbery, and this marks the beginning of a dastardly explosive chain of events that lead up to a colossal conclusion. While there are some plotholes here and there, they're barely noticeable since the film moves in a rapid \"Nolan-esque\" pace. Most of the characters in 'The Town' are pretty stereotypical and the story is somewhat clichÃ©, so why did I like it? Probably the same reason everyone else liked it: it's just so much fun! The stereotypical characters don't end up so stereotypical when they're portrayed by an outstanding cast (including Jeremy Renner (Hurt Locker), Blake Lively, Jon Hamm and Chris Cooper), and the story moves by so quickly that we have no time to argue with any implausibilities. It's a genius technique that's being used more and more lately, most notably so by 'The Dark Knight' and 'Inception' director Christopher Nolan. It's easy to get lost in these films if you think too hard, which is why you should only focus on what's simply being presented. It's what films are for, and both Nolan and Affleck demonstrate this superbly. Now here's me thinking too hard, because some things in 'The Town' were indeed confusing. For instance, if these guys have been robbing banks for years, why are they still poor? Where is all of the money going? Why do the banks continue to have poor security? Why are the feds just now catching up? The way these questions are avoided shows a surreal style of realism that is nothing short of spectacular. While these holes are avoided, we're expected to just roll with it, and if you do just that, it's definitely going to be one of the most entertaining films you see this year. The whole \"backing out\" plot is a classic that has been somewhat overused throughout film history, but it is handled well in 'The Town.' Doug represents an inevitable \"flaw\" that always marks the end of an ongoing system, that system being the success of the robberies. When one specimen, in this case Doug, decides to turn against the system, it is a break from the conventional, what critics look for in movies, character development! Affleck plays a believable character going through a mental struggle to obey or betray his \"family traditions, and Renner shines as his brother, a tough guy who sometimes makes ignorant decisions. Honestly though, he's one of the most intimidating film characters I've seen this year. Like I said before, they're mostly stereotypical, but they're acted out very well. I'm a sucker for good heist films, and this one goes down with the newer 'Ocean's Eleven' and 'Dog Day Afternoon' as one of my favorites. It's loud, intense, and action-packed, not to mention some of the coolest robbery sequences I've ever seen in film. If you want something smart and philosophical, this wouldn't be my first recommendation, although I wouldn't say it's not smart. But if you're down for something that never lets go of your attention, then this is a great choice."
    },
    {
      "rating": "10",
      "text": "I read the book and although many scenes in the movie played very different from what happened in the book but I thought they did a fantastic job depicting the characters as Chuck Hogan created them in the book. In addition the film complemented the book in such a great way I think it made the story even better and the alternative ending was great. Although, I would have liked Jemâ"
    },
    {
      "rating": "8",
      "text": "Although many action films have their adversity of progressing the storyline and plot, 'The Town' directed by Ben Affleck shows the perfect storyline and even solid action performances."
    },
    {
      "rating": "9",
      "text": "This is really a good movie. Just see it. (score 9)And I hate Ben. (And his big head/bad acting ) But he earned my respect here, as an actor and a producer. Getting error : Score (9.0) id must be a floating point number."
    },
    {
      "rating": "7",
      "text": "At times stylish, sometimes well-acted, and mostly nicely filmed, \"The Town,\" in the end, left me a bit flat and disappointed.  What was missing?  Well, I don't know for sure.  I think a lack of focus contributed to the sense of incompleteness.  Too many issues, some only partially resolved. Mostly I was entertained and  the grainy, gritty texture of the cinematography lifted my expectations for the underlying story.  But instead of a tight, cohesive beginning-to-end tale of a hardened criminal trying to rise above his circumstances, the storytelling sprawled across the screen in a series of loosely connected scenes and performances that eventually, like Ben Affleck's Doug, just left.  It's a credit to Affleck's somewhat surprising ability as director/actor that this stew stays together at all.  Not a bad picture, at all, but the bones were there to deliver something much, much better."
    },
    {
      "rating": "7",
      "text": "While Ben Affleck has exceeded any expectations I had for him since first seeing him in Mallrats many moons ago, his better-than-average performance in \"The Town\" has been entirely overrated, as has the movie.  I, unfortunately, had my expectations pretty high when I read the hype surrounding this movie.  Unfortunately, they weren't met.  \"The Town\" is certainly a fine film, much better than most fare from Hollywood.  However, the flow of the movie seems elementary with scenes and storyline elements lasting unnecessarily long.  The sudden fade out that end also threw me for a loop.  It was mechanically clumsy, perhaps having more to do with editing than directing, but it was a valiant effort nonetheless.  Being a huge fan of Boston, having just spent a large amount of time there in the last year, it was interesting to be reminded of all the places I had visited.  Also, my baseball pants did a dance when they robbed Fenway.  There was significant dialogue that was so muddied in Boston dialect that it was difficult to follow.  There were also unfinished storylines, inexplicable progressions and some difficulty emotionally attaching to the plight or life of the characters.  Blake Lively was the biggest surprise in the smallest role as Jeremy Renner's sister and Ben Affleck's former lover.  She was in the movie only a little, but had a tremendous impact and showed range I wasn't aware she had."
    },
    {
      "rating": "8",
      "text": "The Town is a great start to the fall movie season. Like Michael Mann did with Los Angeles in Heat, Ben Affleck has made Boston a major player in the cast."
    },
    {
      "rating": "10",
      "text": "I love this movie.  My only criticism is at times the dialogue is so thick and mumbled I could not make out the words.  So when you see it go to a theatre with good audio system!  It could be this was intentional to give the film gritty, natural feel, I don't know.  I was pleasantly surprised the lead of The Hurt Locker had co-starring role.  Don Draper, aka FBI agent, at first I felt was underwhelming, but he delivered by films end too.  This is a great friggin film!  Anyone who says otherwise liked Sex and the City 2."
    }
  ]
}