{
  "id": 644,
  "title": "The A-Team",
  "starring": [
    "Liam Neeson",
    "Sharlto Copley"
  ],
  "runtime": 117,
  "genre": [
    "Thriller",
    "Action",
    "Adventure",
    "Comedy",
    "Crime"
  ],
  "description": "A group of Iraq War veterans goes on the run from U.S. military forces while they try to clear their names after being framed for a crime they didn't commit. Along the way, Col. Hannibal Smith, Capt. H.M. ‘Howling Mad’ Murdock , Sgt. Bosco ‘B.A.’ Baracus, and Lt. Templeton ‘Faceman’ Peck help out various people they encounter.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k3mKy2zYfzqGg9o5JeDyzSEPPHO.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 6.894736842105263,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 6.0,
    "funny": 8.142857142857142,
    "action": 7.3125
  },
  "reviews": [
    {
      "rating": "9",
      "text": "In my opinon, the extravagance and hilarity in this movie outweigh the lack of a subtantial plot, and as such the lack of devotion to carrying through with an overtly complex allows a slick comedic sense to be inserted into the movie. Overall a great \"mans\" adventure that will appeal to a specific demographic. Harshly reviewed by the critics, but nonetheless, a great film."
    },
    {
      "rating": "7",
      "text": "Great! Ridiculously misunderstood by the critics! Has its tongue firmly in its cheek and is carried off with wit and sly self deprecation. If academic depth was what they came looking for, then why did they come here?"
    },
    {
      "rating": "8",
      "text": "Now I can remember as a child sitting with my dad and watching the A-Team and loving it and then watching it again in my late teens on bravo and still enjoying it but realising an action series where only 2 people die in the whole thing is not really that hardcore. This being said this remake had the worrying start of a franchise where every episode they blow up cars but everyone gets out ok and making a flame-thrower out of a butane bottle and a cigar. Now this film is no where near this and is only the A-Team in spirit and this is no bad thing. Take this for what it is a re-branding of the A-Team to modern standards and if you watch it in this frame of mind then it becomes a good, witty action film, there are some one liners in the film which are pure laugh out loud class. There are all the subtle nuances which are from the original series and all the jokes between the characters are still there, but this is by no means and important part so if you've not seen the series it won't hurt you. There are some issues with it if you really want to be critical the portrayal of BA my second favourite character to Dwight Schultz Murdock is a little light, he's great in the action but the philosophy bit gets in the way, in one scene he is quoting Ghandi and then in the next beating down on one of the bad guys. Casting on the whole is very good Liam Neeson is good as usual and seems to be in everything at the moment.So all in all a very enjoyable film worth watching for anyone. Action From Start to Finish and it doesn't let up much apart from where it needs to. 8/10"
    },
    {
      "rating": "6",
      "text": "Was a huge fan of the original series and this movie did not disappoint me. Just don't take it seriously. Explosions and oneliners its what its all about. The decent story surprised me a bit. Just a fun movie without trying to be anything else."
    },
    {
      "rating": "8",
      "text": "The critics have definitely got this one wrong. It's easy to figure out that this movie does not take itself seriously. At all. And in that respect, it is brilliantly executed. It doesn't try to replicate the TV show, but appropriately pays homage to it. Easily an eight out of ten."
    },
    {
      "rating": "8",
      "text": "I am not saying your life will not be complete without watching this one movie but your life will not be complete without watching this movie. Action from the first minute 'til the last with a sprinkling of comedy thrown in.  All the inside jokes from the tv series have been deftly intertwined in a smartly packaged, entertaining showing."
    },
    {
      "rating": "5",
      "text": "The movie \"The A-Team\" is what you would suspect it to be; a movie that packs 3 seasons of the A-team TV series into 119 minutes. As expected, it fails."
    },
    {
      "rating": "10",
      "text": "\"The A-Team , is one action packed thrill ride that never stops , it's Awesome , it never let's up , which make it all the more fun , i loved the acting and the humor was perfect, and the casting spot on!... Love it when a plan comes together\" .. A"
    },
    {
      "rating": "9",
      "text": "A great movie with a solid cast. Had a lot of action sprinkled with a bit of comedy from time to time. Saw it in theaters and wasn't disappointed. I'd recommend watching"
    },
    {
      "rating": "8",
      "text": "Один из самых лучших боевиков что я видел спецэффекты,сюжет,актерская игра да и сами актеры,все на высоте!"
    },
    {
      "rating": "2",
      "text": "Hilarious."
    },
    {
      "rating": "0",
      "text": "Yet another movie that can't figure out if it's action, comedy, or drama and winds up doing none of them well. This was obviously purely a venture for making money from an 80's icon. Unentertaining and and soulless."
    },
    {
      "rating": "8",
      "text": "As fun action movies go, this did its job well."
    },
    {
      "rating": "10",
      "text": "It was fun and action packed im sure my era of fans felt like a kid again watchn it. it was every bit of similarity of the original series."
    },
    {
      "rating": "5",
      "text": "Lots of explosions and dizzying action but too little thought given to story details. Has some laughs."
    },
    {
      "rating": "3",
      "text": "The jerky camera work is maddening, the plot murky, and the movie just too long. The key to enjoying this piece of schlock is to keep one's expectations low."
    },
    {
      "rating": "8",
      "text": "This is similar to the TV series this film is based on. This adaption is yet somewhat better."
    },
    {
      "rating": "3",
      "text": "Not sure which was worse. The movie or the TV show."
    },
    {
      "rating": "9",
      "text": "This movie was AWESOME...with a red highlighted A!!! It was fun, over the top, ridiculous action with great characters that provided a good amount of comedic relief without turning the movie into a parody. Sharlto Copley in particular stands out among the cast proving that District 9 wasn't just a fluke...this guy is someone to watch out for and i hope to see him in MANY more movies in the future. My only real problem was the fact that some action scenes were shot too dark and too close...other than that GREAT movie...NOW GO OUT AND SEE IT FOOS!!!"
    },
    {
      "rating": "10",
      "text": "This is a reasonable movie .... watch it !!....................................................................................................................................................................................."
    },
    {
      "rating": "6",
      "text": "Now I wonder what word could possibly replace the A in A-Team? Amazing? It's a bit too flattering. Adventurous? Hardly. I think the word I'm looking for is adequate. Despite the generous amount of explosions and gun fighting scenes, the film was portrayed in a way that at times became confusing, such as the planning of an attack which was illustrated at the same time. It felt like an anti-climax that we didn't receive the usual build up of plan, action and consequence, but instead skipped the action which is something I thought the A-Team would be packed with.Don't get me wrong, from the very beginning we watch Face (Bradley Cooper) being saved by fellow team mates Hannibal (Liam Neeson) and B.A.Baracus (Quinton \"Rampage\" Jackson), so we are thrown right into a pit of destruction. I think it was a useful idea to introduce the characters slowly one by one, as not everyone is familiar with the 80's TV series the film was based on, and director Joe Carnahan definitely made a fine selection of actors to take up the roles. However, considering the hype made for this film including all those stupid Orange adverts before any film in the cinema, I was thoroughly confused and annoyed midway through at B.A becoming anti-violent and quoting Gandhi. If you were expecting a macho film, think again, Bradley Cooper's torso may say differently but the fact that one character loses the heart to kill anyone is quite deflating.Some of the action was a little unrealistic, particularly the flying tank scene, which in all fairness did land in a lake but really, what are the chances? I know the A-Team have to appear perfect but surely one little hiccup wouldn't have hurt. On the other hand, the closing scenes of the dockyard domino-effect showdown was spectacular to watch, and very cleverly thought out by the big brains of the team, Liam Neeson. I thought Neeson gave a genuinely strong performance, similar to the role in Taken (2008) where he must take initiative, but completely opposite to his solitary role in Love Actually (2003), reflecting his ability as an actor to accept different emotional characters. The additional romantic plot within the film wasn't really needed between Bradley Cooper and Jessica Biel, it just felt too awkward although I guess it makes this supposed action packed blockbuster more appealing to the feminine audience being dragged along by their other halves. On the up side, seeing as I am awarding this film three stars, and this means I neither loved or hated it, there were some worthy comical moments particularly between B.A and Murdock (Sharlto Copley). The action is drawn over several locations, and these were displayed in text so the audience did not lose their footing, something I always appreciate in action films such as The Losers. However, the editing did not always assist the action and I found myself becoming disorientated with it all a bit too often.Unfortunately I have to say, and please don't cringe, this plan didn't quite come together. It was worth the watch, but undoubtedly not predicted the best action film this year, at least by myself anyway"
    },
    {
      "rating": "7",
      "text": "http://tvtastic.wordpress.com/2010/07/09/the-a-team-film-2010/ I need to start off this review by pointing out the film's biggest flaw.  No, it's not the fact that it's another example Hollywood being lazy and rebooting another classic franchise, it's not the fact that Mr. T is nowhere to be seen, it's not even the fact that whole movie is just another in a long line of predictable action flicks.  No, the biggest flaw in this movie is one person:  Jessica Biel.\r The young lady can't act, plain and simple and she's poorly cast in every single film she's in.  Seriously, is the audience truly supposed to believe that she's not only an officer in the U.S. Army but a Special Forces-type who they actually put in charge of things?  Now this wouldn't even be an issue if she were routinely in exceptional films that could withstand her brand of crap or even if she were in truly awful films where should could just blend right into the scenery but she never is.  She's always in these borderline-good films and she's always a freakin' anchor that pushes a decent film into the realm of crap-tastic.  Honestly, the only kind of films that she should be doing are the ones that involve hand-held cameras, minimal dialog and the obligatory pool boy.  The problem she has, though, is that there a thousand other chicks in that particular film industry who look exactly like she does.\r That being said,  fortunately you experience 20 minutes of phenomenal frenetic action before we even see her dopey self so the damage she normally causes is mitigated.  Other than Biel, the only two major flaws in this film are Liam Neeson's inability to pull-off an American accent and of course, the ridiculous \"flying tank\" scene which is oddly reminiscent of the beyond-retarded F-35 jet scene in Live Free or Die Hard and in both cases I recommend fast-forwarding through them or leaving the room and pretending they never happened.\r But, honestly, The A-Team is exactly what you'd expect it to be and surprisingly it doesn't suck because of that.  It's obviously a reboot and it's been modernized for 2010, but the casting was excellent (despite Neeson's accent issues)  and the characters were written very true to their TV counterparts from the 1980's, and in fact (and people are going to hate me for saying this) maybe even a little deeper and a little better.\r The action sequences in this film are fantastic (albeit a little on the unbelievable side at times) the villains are entertaining and there's enough classic A-Team nostalgia thrown in to make even those most skeptical fan appreciate this new take (yes, they do go all MacGyver more than once, just like they did regularly on the show).  I think the main reason all of this works is because Stephen J. Cannell is the top-billed producer and it's obvious he was there to make sure that his baby was taken care of.\r The dialog is clever and decently written and the film moves at a very good pace and I could think of a lot less fun ways to spend 117 minutes.  Is it going to win any Oscars?  No, but it is certainly one of the best action films I have seen this year.  I hate to say this, but the way this film was done, with the deference and reverence shown to the source material is very reminiscent of last year's mega-hit Star Trek and yes,  I would know.  And rest assured, like Star Trek, it was made very clear at the end of this film that this won't be the last time we'll be seeing these beloved characters on the big screen."
    },
    {
      "rating": "5",
      "text": "Before the credits even, Hannibal pulls a gun on B.A. in order to jack his famous van. The guy playing B.A. then spews a cracker barrel line that sets the tone for the rest of the film...\"What is this, opposite day?\". That abysmal line was tapping me on the shoulder for the rest of the film. How on earth did it make it past the first re-write? If they make a movie out of ALF or My Two Dads, I'll know better. Actually if they make ALF I'll watch that S**t"
    },
    {
      "rating": "3",
      "text": "A Film Review by: Sam Fragoso\"The A-Team\"*1/2I don't even know where to start with Joe Carnahan's A-Team. First thing is it's extremely sloppy, it doesn't know what it wants to be, at first it's a tale of four men on a mission next it's a love story between Cooper and Biel. The two don't mix well and it really shows. The sad thing is for the first half of the movie I would of said see it, but honestly the last half really destroyed the whole plot line and it turned this film into a \"formula\" action movie, which is very disappointing. Let me just make this clear, if your one of those people who enjoy cars blowing up and people dying all over the place then you may \"mildly\" like this film. I have nothing against action but there is definitely such a thing as overkill and that's what they do here. I will give props to Neeson and Cooper who did a good job, but the scrip falters half way through and even the talented actors on screen can't save The A-Team, I say skip it."
    },
    {
      "rating": "0",
      "text": "Just awful. I watched this movie on a transatlantic flight, and I was just utterly stunned how bad it was. Easily the worst flick of 2010. Who is responsible for the terrible script ? Who greenlights this crap ?"
    },
    {
      "rating": "7",
      "text": "Criticism of Blackwater mercenaries in the Iraq war (as well as in New Orleans after Katrina), and ideas about a financial crisis come together to form a little conspiracy. Unexpectedly funny. Fast-paced action entertainment."
    },
    {
      "rating": "10",
      "text": "The village voice review is garbage. They apparently did not see the same movie. Worth the watch! Buying as soon as it comes out! A-team was dead on! Good action and Funny! Not alot to follow in it, pretty easy. Excellent movie. Highly advise you watch!"
    },
    {
      "rating": "9",
      "text": "A damn good movie! The prolouge is a little long but overall one kick ass movie!"
    },
    {
      "rating": "1",
      "text": "Beyond bad. This is what films in the 21st century have come to. Just awful."
    },
    {
      "rating": "7",
      "text": "The A-Team is a loud, action-packed movie held together by strong performances from the main cast. It's very funny at times, but some of the story gets lost in its own humor."
    },
    {
      "rating": "9",
      "text": "Loved the movie, it has humour, good actors and most importantly, the movie has a storyline throughout the movie."
    },
    {
      "rating": "9",
      "text": "This movie was down right epic."
    },
    {
      "rating": "9",
      "text": "This movie was totally entertaining from start to finish. It looses a point only for it's very predictable plot. One thing I loved about this movie more than other remakes such as Dukes of Hazard and Starsky and Hutch is that The A-Team felt very faithful to the series that birthed it, while still being entertaining and fun to watch."
    },
    {
      "rating": "10",
      "text": "A blast from start to finish. GO SEE THIS MOVIE!"
    },
    {
      "rating": "10",
      "text": "Awesome is a word use many times in describing a movie and a hate that word, but this movie is AWESOME!"
    },
    {
      "rating": "7",
      "text": "Thoroughly unbelievable, but hilarious. I especially liked Copley's performance."
    },
    {
      "rating": "10",
      "text": "Totally awesome!!"
    },
    {
      "rating": "8",
      "text": "Critics are far too unforgiving. The A-Team is far better than most other summer blockbusters right now because it doesn't take itself too seriously I laughed plenty of times and acknowledge that yes, the action was over the top- just the way it should be."
    },
    {
      "rating": "7",
      "text": "It was one of only a few good movies this summer so far"
    },
    {
      "rating": "10",
      "text": "My entire family LOVED this movie! We will definitely go see it again and buy the dvd. Can not imagine what the critics were thinking that did not like it!"
    },
    {
      "rating": "8",
      "text": "This movie was a blast. It is the type of movie were you turn your mind off at the door and just enjoy the ride. The characters are amazing and really funny. I felt Bradley Cooper and Sharto Copley did a phenomenal job with their respective characters and Liam Neeson was a perfect fit as hannible. Rampage also did a fine job. Anyways, this movie is just a blast, but if you are looking for things that usually make a great movie like an amazing story then you are in the wrong place, because this movie is just made to keep you entertained and it never takes itself to seriously. So I feel it is a must see."
    },
    {
      "rating": "10",
      "text": "Absolutely awesome if a) you loved the original series like i did and/or b) you aren't looking for a deep-thinking movie but true summer popcorn fare instead! one of the few reboots/remakes of an original movie/series that I thought improved upon the old and yet was true to it's heritage and roots. well done!"
    },
    {
      "rating": "8",
      "text": "Just like the TV show only bigger and louder."
    },
    {
      "rating": "9",
      "text": "Way too long, but still awesome."
    },
    {
      "rating": "9",
      "text": "Best non-comic action movie I've seen in a long time, and I'm not even nostalgic about the series."
    },
    {
      "rating": "9",
      "text": "So many of the \"professional reviewers\" say they didn't think there was enough plot or character development...what more do you really need to know?? This movie has so many one-lines my buddies and I have been laughing for days!! HOLLYWOOD!!"
    },
    {
      "rating": "9",
      "text": "I really, really enjoyed this movie. It hit all the right notes and was so absurd that it created a tune all its own."
    },
    {
      "rating": "10",
      "text": "I loved this movie i dont care what the critics say it had all the elements. seriously i am a girl i thought i wouldnt like it but it was so cool =]. it was so funny when mad murdock said ?you smell like gas\" and set him on fire . and when bad attitude baracus took his beanie off and and showed his mohawk i was like yay and hi-fived my friend."
    },
    {
      "rating": "9",
      "text": "I would have given it a 10, but the editing made some of the action scenes a bit too manic. Other reviewers have covered the movie well, so I don't feel like I need to add much more than that. But in a summer that has so far only produced one other decent action flick (Iron Man II), I feel inclined to rate this a 19 more so than 9."
    },
    {
      "rating": "4",
      "text": "The movie attempted to be clever, and failed at it miserably. Bradley Cooper did his very best to shed a little comedic light on this overall very dark movie."
    }
  ],
  "recommendations": [
    "the_losers",
    "guardians_of_the_galaxy",
    "venom_let_there_be_carnage",
    "deadpool_2",
    "the_green_hornet",
    "hancock",
    "kingsman_the_golden_circle",
    "hercules",
    "poseidon",
    "thor_ragnarok",
    "bright",
    "edge_of_tomorrow",
    "deadpool",
    "terminator_genisys",
    "zombieland_double_tap",
    "i_am_number_four",
    "avengers_age_of_ultron",
    "national_treasure_book_of_secrets",
    "bloodshot",
    "eagle_eye",
    "skyscraper",
    "shazam_fury_of_the_gods",
    "furious_7",
    "thor_the_dark_world",
    "the_guardian"
  ]
}