{"id": 2626, "title": "The Bourne Supremacy", "starring": ["Matt Damon", "Franka Potente"], "runtime": 108, "genre": ["Action", "Drama", "Thriller"], "description": "When a CIA operation to purchase classified Russian documents is blown by a rival agent, who then shows up in the sleepy seaside village where Bourne and Marie have been living. The pair run for their lives and Bourne, who promised retaliation should anyone from his former life attempt contact, is forced to once again take up his life as a trained assassin to survive.", "releaseYear": "2004", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/7IYGiDrquvX3q7e9PV6Pejs6b2g.jpg", "categories": {"plot": 7.303030303030303, "acting": 7.551724137931035, "ending": 7.5, "soundtrack": 10.0, "cinematography": 5.384615384615385, "familyFriendly": 6.0, "funny": 5.0, "action": 7.795454545454546}, "reviews": [{"rating": "7", "text": "There is one thing I appreciate about The Bourne movies more then anything else about them. And that is that they exist not only to make money, but to be a good movie. There are a lot of action franchises, such as Pirates of the Caribbean and Sherlock Holmes, that only exist to make money. They can be entertaining, but there's not a lot of thought put into them. The Bourne series tries to be a good movie, and they, for the most part, succeed. Of course, the two films I've seen thus far in the trilogy have not been without flaws. Far from it really. But they are entertaining, at the bare minimum, they have a plot, and well-defined characters. The Bourne Supermacy, like it's predecessor is not perfect, but it's trying. The Bourne Supremacy still contains the key plot elements from the first film: Jason Bourne is trying to learn more about his past, there's a plot to find and kill him, and utter confusion for both parties. The twist is that Bourne is being assumed for a crime he didn't commit (the murder of two agents). Once again, the similarities to the 90's The Fugitive are present, but I've delved into that in my previous review of the first film. In short, The Fugitive does a much better job. The Bourne Supremacy sports believable acting, much like the first. Action movies are famous for laughable dialogue and stiff acting, but The Bourne Supermacy has neither. Matt Damon performs very well for this episode in the Bourne trilogy. The rest of the actors also perform well, but it's pointless to compliment each actor individually. The action is considerably better in this sequel than in the original. Also, there are some very good chase scenes (there were chase scenes in the first, but they were quite dull to be honest), even though some of the automobiles seem a little too indestructible. There's even some well-needed emotion that wasn't present the last time around. The score, however, is less than satisfactory. The percussion is much too loud and overpowering, often annoying. Some of the instrument choices are questionable (including one instrument that we hear twice that resembles the belch of an obese couch potato), and many of the themes feel a little lost. Also, there are some jarring similarities to the superior Pirates of the Caribbean score. Also, the girl we see sleeping with Bourne at the beginning of the film is Marie from the first film. I tell you this, because I would not have recognized her if my companion had not told me so. Her hair is blonde, she looks different (she's wearing more makeup) and she even SOUNDS different. It doesn't make too much of a difference, though, because she dies within twenty minutes of the film's opening. And this brings up a major flaw of this movie: Bourne doesn't have a partner. In one respect, this works better because now Bourne is free to move at his own pace. However, this gives Bourne a little less personality, and it makes certain parts of the film feel a little empty. One scene at the beginning is near a stand with tons and tons of Lays brand potato chips, all the labels facing the screen. It would be hard to believe that there wasn't some sort of pay-off here. Also, there's a completely unnecessary scene that occurs in a club. There are some skimpily dressed women and it just feels so thrown in. This scene was literally added just for male appeal, and it disgusts me that this was thrown in just because guys like to see half-naked women. Really? It's unnecessary and tasteless. I digress. Lastly, The Bourne Supremacy doesn't feel completely connected to the first film. That's not to say it contradicts the first, but I feel confident that someone could watch The Bourne Supermacy with no knowledge of the first film and completely understand what was going on. The Bourne Supremacy is just as good as the original, and maybe just a bit better. There's problems to be sure; irritating score, unnecessary club scene, and the fact that the seeing the first film isn't even necessary for viewing this sequel. But the fantastic cast, great action and chase scenes, and some actual emotion more than make up for it's shortcomings."}, {"rating": "9", "text": "The Bourne Supremacy improves upon its original with great acting, and a good plot. It also follows Paul Greengrass' typical directing style; action, tension and unfortunately, too much shaky cam."}, {"rating": "7", "text": "Parts of the film are good but it never really draws you in the way the first film did. More running and chasing in this film and a lot less hand to hand combat (which made the first film so good imo) in the action sequences. The plot is ok but it doesnt explain much, if anything really. Overall it was an ok film that never reachs the next level that its so close to reaching."}, {"rating": "8", "text": "A rare sequel that actually improves upon the original. The Bourne Supremacy duplicates everything that was right about The Bourne Identity, and improves upon it by making the story easier to follow."}, {"rating": "8", "text": "The second of a great trilogy, Supremacy is just as thrilling and fresh as the first movie and revisits the same kind of storyline, now in different countries."}, {"rating": "7", "text": "The Bourne Supremacy reigns supreme.\rWith the sequel to the amazing spy thriller, The Bourne Supremacy just doesn't quite match the original. An equally great plot with equally great action, but doesn't quite reach the standards of suspense; although still very successful."}, {"rating": "9", "text": "I liked it better than the first one. Since the beginning it develops an adrenaline line of action. Non expected at the beginning, but it only gives it more energy for what´s coming."}, {"rating": "9", "text": "The second of a great trilogy, Supremacy is just as thrilling and fresh as the first movie and revisits the same kind of storyline, now in different countries."}, {"rating": "10", "text": "The Bourne Supremacy is a rip-roaring juggernaut of a movie. It totally outclasses it's predecessor in every conceivable way, ratcheting up both the action sequences and the film's emotional core to thrilling levels. With superb acting, an excellent script and thunderous set-pieces, The Bourne Supremacy should be held as a textbook example of how to do a sequel right."}, {"rating": "2", "text": "Seemed like a great movie. I'm not really sure, because I had to look away through much of it or squint one eye shut to try and stem the nausea that the shaking, frentetic camera views inspired. Who thought this was a good way to film a movie? This artsy-fartsy director should be banned from any future filmmaking. Even the quiet moments in the movie when two people were just talking, the camera was moving and zooming in and out like the cameraman was smoking crack. I was looking forward to this third installment of the Bourne series, but by the end of the film I was looking forward to some Pepto Bismol. Complete waste of time and money, in my opinion."}, {"rating": "10", "text": "The Bourne Supremacy continues the franchise and has great acting and a nice story."}, {"rating": "6", "text": "Man, the movie's still has the same intensity, same action sequences, same stupidity, and the same plot. I wonder if the movie might become something like the James Bond Franchise..."}, {"rating": "5", "text": "I wouldn't take any extremist sides, but overall the story was fairly straightforward (which is a blessing for this kind of genre), and yes, while the camera could indeed induce nausea, it was a very obvious character of the film itself. Natural/ambient light should be the prerequisite for every film made. Unrealistic car chases coupled with insane walk-aways are unforgivable, but tight, choreographed fisticuffs were passable as the real deal. A bit of a quick-ending wrap up made it somewhat hurried, but characters remained true, and almost a bit stereotyped (unbeatable Bourne, bumbling crony, maiden-in-distress, et al.). A solid mediocre rating."}, {"rating": "0", "text": "This movie is absolutely horrible. The first one was great. This one was an insult. Frankly, I'm downright outraged that this one got a better metcritic score, because it is utter garbage. There is very little actual action. 3/4 of the movie is just footage of Matt Damon walking really fast and looking beihind him. Seriously. And when ther actually IS something that SHOULD be interesting, you can't see it because whenever there's a fight, the first thing they do is kick the epileptic camera man in the balls. If you like faked, boring \"suspense,\" see this movie. If you like action movies, or liked the first one, for the love of God stay away from this crap."}, {"rating": "7", "text": "Not as good as Identity, but still thrilling and a worthy follow on. I was hoping for more action, given that it's shorter, but the plot is good enough to keep it interesting."}, {"rating": "3", "text": "The movie had an average plot to it, OK twist, nothing mind-blowing, and acting was OK as well. The problem I have with this movie is the camera. The camera angles changes almost every 3 or less seconds, and the action scenes I just had to look away from, they didn't have any steady shots, and a major problem with holding the camera still. To be honest i almost made me sick of watching."}, {"rating": "9", "text": "Not quite as fresh and intriguing as its predecessor or its sequel, but still a brilliant film which you can watch over and over without getting bored."}, {"rating": "9", "text": "Jason Bourne (Matt Damon) is living in India when he is framed by Russian agent Kirill (Karl Urban) for the theft of millions from the CIA. Kirill begins to pursue Bourne, intending to assassinate him -- but while Bourne and his girlfriend, Marie (Franka Potente), are on the run, a shot meant for him kills her instead. Vowing revenge, Bourne sets out to prove his innocence and bring the culprits to justice, but he has to evade CIA head Pamela Landry (Joan Allen), who is convinced he is guilty. A well-made sequel that delivers the thrills. I'll give The Bourne Supremacy an A-."}, {"rating": "10", "text": "An excellent movie."}, {"rating": "10", "text": "This movie is the perfect sequel to The Bourne Identity and is mandatory for fast-action fans."}, {"rating": "9", "text": "Not as good as Identity, but still pummels Bond into a puddle."}, {"rating": "9", "text": "Pretty darn great! action-packed, good cast, interesting story line, all-around great action film. :-) grade: 9.3"}, {"rating": "6", "text": "Camera action made me sick. It was like the cameraman was trying to rollerblade on gravel and kept falling and turning and jerking. I understand why they did it that way, but it didn't work for me. I'd give it a 9 if not for the \"creative\" camera motion."}, {"rating": "5", "text": "This movie probably could have been much, much better. The camera simply sucked, saying that it made the experience more \"real\" and that it's \"creative\" is a load of crock. All that it does is give me a headache, a stomache ache, and no idea what the hell is going on. Another poor feature of the movie was it's lack of humor. Identity had a perfect balance of humor and action, which fit well with a character slowly uncovering his past and incredible abilities. In this movie, suddenly bourne is a master at what he does. He no longer discovers himself, he no longer makes jokes. He's become a flat character by comparison."}, {"rating": "8", "text": "I frankly don't get how people review movies on this site. I've seen the most preposterous of comments on movies that are straight out excellent. The Bourne Supermacy follows what Bourne said in the first movie. He threatens Treadstone by saying they won't know what's coming until the counter-strike is finished. That promises a fast-paced movie ON THE START. Plot-lines that were VERY obvious seem to be so oblivious to others that they decide to pluck their thought-motor out and call it a day. If some complain about the camera movement, well to them I would answer: \"How would you imagine yourself in a fight?\" ... Exactly. When you're in a fight like Jason gets into, you don't see everything around you. It's a fast-paced blur without conscience. Everything becomes instinct. And this is what this movie is about: Instinct. Instinct of survival. If the movie is too fast for you, try watching it in slow-motion."}, {"rating": "6", "text": "This is the most boring movie of the three where I could have expected something more than that. The action thrill scenes are lesser than the last movie."}, {"rating": "7", "text": "Bourne & girlfriend now living in India, assassin comes after him, tragedy, goes after the CIA to find out what's going on.Not as good sequel to the excellent Bourne Identity which does have it's moments but seems to lack something that the first one had.Decent cast once again adding Joan Allen & Karl Urban to its roster & Brian Cox is the stand-out this time appearing a lot more.Thought it got a bit stupid towards the end too with the silly car chase."}, {"rating": "9", "text": "Altogether more suspenseful, more concise, more intriguing, and more emotional than its predecessor, Bourne Supremacy is a step up from the usual generic thriller and benefits from a stellar performance by Matt Damon."}, {"rating": "9", "text": "Not quite as intriguing as its predecessor or it's sequel, but still amazing. It does feel a bit more drawn out. Overall, however, it's well worth watching over and over."}, {"rating": "8", "text": "Another excellent Bourne film, equal to the first in every way. Highly thrilling and engaging."}, {"rating": "7", "text": "Supremacy is a well-made follow up to Identity in terms of action and suspense; however, its plot lacks in development, and, similar to most sequels, does not fully meet the standards the first film created."}, {"rating": "9", "text": "First off, I would give this a 9.25 out of 10. Action sequence are even better. It's just awesome. Acting is good. Damon delivers again. Story continues, and it's still good. Score is still good. Overall, this is great sequel following the first one that's better in every way."}, {"rating": "7", "text": "Better than the original, The Bourne Supremacy is the rare sequel that takes what the original did well and improves upon it. Matt Damon is still dynamic as the titular Jason Bourne. The action can be a little hectic, which is what holds this one back a bit, as it can be hard to follow during the action sequences. It can also get a little bogged down in the details like all spy flicks, but all the same, this is a very good action spy thriller. Director Paul Greengrass certainly knows what he is doing and knows how to tell a good story. The film is thrilling, the score is good, and the cinematography has moments of absolute brilliance (the shot of Bourne walking to his car in snow covered Russia comes to mind). Overall, The Bourne Supremacy is a good film that manages to entertain in spades even if it does nothing different from other spy films."}, {"rating": "7", "text": "Jason Bourne is a great character and it's great to see him develop over the two movies. As for the action, the shaky-cam many complain about really is as distracting as they say. Overall a very good sequel though."}, {"rating": "6", "text": "[2/4 The Bourne Legacy Marathon]\r The Bourne Supremacy [2004]\r They're not subtle with the shaky cams here. Scene with Bourne targetting Joan Allen with a sniper on the building was a highlight. I have to confess though, these films are well-made, but the Bourne films are just not working for me. It dosen't engage me, despite the quality of it."}, {"rating": "9", "text": "In 2004 film \"The Bourne Supremacy\" is the Paul Greengrass-directed sequel to the acclaimed Doug Liman film \"The Bourne Identity\". The story follows the amnesiac titular character (Damon) as he attempts to find out more about his past as a black ops agent for the CIA. One of the things I noticed first about this film was the film's shift in aesthetics. Though Director Paul Greengrass' use of hand-held cameras has often come under considerable disagreement from some critics and fans, I feel that this aspect of the film really sort of adds to the intensity of a lot of the action and dialogue sequences. While the camerawork may have changed, there are certain things about the film that stayed close to what made the first movie so successful. For one, Matt Damon's performance is once again terrific, and with his portrayal, the audience really gets to see some sides of Jason Bourne that they might not gotten to see in \"Identity\". John Powell's score is really well done, as it uses all of the themes from \"Identity\", but develops upon those themes so that we feel as though we are watching a different chapter in Bourne's life. Tony Gilroy's screenplay contains really compelling and entertaining dialogue and a very interesting adaption of Robert Ludlum's story. The action sequences are spectacular as well, for they once again showcase Jason Bourne's incredible ability to overcome immense odds with the skills he learned in the CIA. All in all, I felt that \"The Bourne Supremacy\" was a worthy installment in the \"Bourne\" franchise that upped the emotion and action to an impressive degree."}, {"rating": "7", "text": "Certainly not as good as the other two in the trilogy, but this is still a really good action thriller in its own right. Great locations and awesome action sequences."}, {"rating": "7", "text": "Supremacy was much better than Identity on many levels. First of all, the plot was significantly deeper, secondly, the characters also had more depth than the first.  There was much more emotion shown in Supremacy's characters and were well acted. The movie ended with all questions answered, which was appreciated, not saying the first one did."}, {"rating": "7", "text": "In my opinion, The Bourne Supremacy is probably the weakest movie of the series. The acting is still good, the story is still interesting and the fight scenes are still well made. It's not a bad movie, it's even really far from that, it's just not on-par with the others."}, {"rating": "3", "text": "Continuation of the history of the our glamorous rambo....Everything is very predictable and boringSo dumb and predictable main villainMost situations the hero resolves with the help of magic and his teleport.... Fairy tail"}, {"rating": "6", "text": "Better than the first movie, but just as forgettable.A similar tempo with similar set pieces.Still feels like Bond's little brother"}, {"rating": "10", "text": "Jason Bourne and Marie lead a serene life in a coastal town in India. The bliss ends suddenly after someone tries to frame Bourne for CIA deal gone wrong. \"Bourne Supremacy\" sets dynamic pace from the beginning. The storyline isn't as original and surprising as in \"Bourne Identity\", but it's a solid spy movie. No exaggeration. When I watch it I feel like I'm watching real, credible spy agency operation.\r The cinematography and fast cuts are a slight disappointment. In some fights and chases the scenes are too short, too jumpy. And I get it, I accept SOME shaky camera work in action sequence. But a calm conversation? Two people talking and I'm almost getting motion sickness, because the cinematographer can't keep a persons face in the frame. Other than that, the film is superb. Easily among my \"top 10 ever\". The casting team did a marvelous job. Matt Damon IS Jason Bourne. I'll always see Ward Abbott when I see Brian Cox. Joan Allen is not my favorite actress, but does very believable performance as Pamela Landy. Karl Urban became one of best cinema villains. His coldness fits the mood of the whole movie. A few years earlier I thought Karl Urban would always be Eomer from \"The Lord of the Rings\". Nope. Karl Urban is Kirill, the cold-blooded FSB hitman. And Marton Csokas, the Munich asset also performs brilliantly.\r I've seen the movie a few times. Maybe five. Every time I rewatch it I'm amazed how good a film can be without over the top CGI effects. Believable weapons, realistic explosions, brilliant hand-to-hand combat (Munich fight is one of best cinema fights EVER) and the Moscow car chase, damn, those cars crashing in the Volga taxi, the cars in the tunnel and the final crash inside the tunnel - WOW. My favorite movie car chase. Ever. There are some slight deficiencies about manual gear handling or survivability of head-on crash in a Volga (rrright), but other than that the chase is excellent.\r The soundtrack is very pleasant. Quite similar to the first movie. The general setting and filming locations provide immersively gloomy atmosphere. Cinematography is quite good if you forget about the shaking. Gripping action sequences and general fast-pace make it a very entertaining film. Highly recommended!"}, {"rating": "9", "text": "The Bourne Supremacy improves upon its original with great acting, and a good plot. It also follows Paul Greengrass' typical directing style; action, tension and unfortunately, too much shaky cam."}, {"rating": "9", "text": "Great movie, good plot, good action, interesting throughout, one of memorable movies from last decades in action genre."}, {"rating": "9", "text": "The rare sequel that improves on the original, The Bourne Supremacy might also be the best movie in the franchise. It has a great emotional arc, and adds more gravitas to the character of Jason Bourne. The action scenes are amazingly done, with a fast-paced plot that's packed with tension. In short, The Bourne Supremacy is a non-stop thrill ride that delivers glorious action and compelling emotional drama."}, {"rating": "8", "text": "If you wish an action movie sequel can live up to expectations, then this is the movie for you. Like it's predecessor, The Bourne Supremacy is able to deliver a fun, exciting, and entertaining movie."}, {"rating": "7", "text": "The Bourne Supremacy is an improvement of the first installment in the Bourne franchise. This 7 feels more like a raised score, but its rounding system makes it look like a 7."}, {"rating": "9", "text": "The Bourne Supremacy is an amazing action movie with great casting, performances, writing, and brilliant sequences. The plot is intriguing throughout and the ending car chase is one of my favourite action sequences ever created. A must watch."}, {"rating": "9", "text": "Jason Bourne is still on the move, now to find who killed his girlfriend and who framed him by murder. This episode has the right amount of thrills with spectacular chase sequences in Goa (India), Naples, Berlin and Moscow. For whom shall stay in home due COVID-19."}, {"rating": "7", "text": "Good continuation of story about Jason Bourne. The plot in difference from the first movie became really more interesting, development of characters is observed here. Though a part of the movie which occurs in Russia raises only a smile. I didn't see such \"cranberry\" long ago."}], "recommendations": ["the_bourne_ultimatum", "mission_impossible", "the_bourne_legacy", "the_bourne_identity", "wrath_of_man", "jason_bourne", "john_wick_chapter_3_parabellum", "mission_impossible_ii", "quantum_of_solace", "mission_impossible_ghost_protocol", "den_of_thieves", "sherlock_holmes_a_game_of_shadows", "john_wick_chapter_2", "upgrade", "haywire", "the_mechanic", "the_equalizer_2", "mission_impossible_rogue_nation", "the_commuter", "run_all_night", "premium_rush", "minority_report", "atomic_blonde", "unstoppable", "21_bridges"]}