{
  "id": 1865,
  "title": "The Accountant",
  "starring": [
    "Ben Affleck",
    "Anna Kendrick"
  ],
  "runtime": 128,
  "genre": [
    "Crime",
    "Thriller",
    "Drama"
  ],
  "description": "As a math savant uncooks the books for a new client, the Treasury Department closes in on his activities and the body count starts to rise.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nztAld019tFjllW7VCJvPFiFkt8.jpg",
  "categories": {
    "plot": 7.755102040816326,
    "acting": 8.1375,
    "ending": 6.785714285714286,
    "soundtrack": 5.0,
    "cinematography": 8.8,
    "familyFriendly": 3.0,
    "funny": 8.285714285714286,
    "action": 8.339622641509434
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Better than expected.   I read the pro reviews before attending, plus I’m not a huge Ben Affleck fan, so I had low expectations going in but, I found “the accountant” to be pretty entertaining.   Not sure why the critics are ripping it so unmercifully, because its way better than the majority of the mid-summer crap than Hollywood churned out (again) this year.   Part of the enjoyment has to do with the sound effects, and the deep and rhythmically powerful report of Affleck’s weapon of choice, which I found to be totally awesome.\r The movie is a little bit John Wick, given the frequency of kill shots to the head, but mostly I found the story line to be reminiscent of a Batman or Marvel Comic book movie plot, without the super-hero costumes or super-hero powers, (though towards the end Affleck’s character does absorb enough explosions and punches to strain the credulity of even novice moviegoers).  The knock on Ben Affleck is that his acting has a bit of an emotionally restricted range to begin with, and thus playing a character with a high-functioning form of Autism is right up his alley, but it works for him in this movie, so who cares.  Anna Kendrick shines, and makes the most out of a somewhat limited role.  Hopefully, we will start to see more movies with her in a lead role."
    },
    {
      "rating": "8",
      "text": "The Accountant has the makings of a franchise. You have a protagonist with a personality disorder, a classic yin and yang between math and violence, a tension between apparently dark means and potentially noble ends, and a lead actor who fits the role extremely well. Think of a modern version of Clint Eastwood as The Man With No Name in the spaghetti westerns of Sergio Leone. True, the story has too much clutter in terms of subplots, but by the time those flaws became apparent, I was hooked on the main character and the puzzle. The primary villain was also quite interesting and well played. Audiences respond to a movie’s entertainment value, while critics, sometimes in a misguided pursuit of professional craft, can miss this fundamental point, and appear to have done so in this case. I suspect the audience ratings will continue to far outpace those of the critics and, in this case, go with the wisdom of the crowd."
    },
    {
      "rating": "7",
      "text": "An action film that starts slow, but builds into a pretty fun time.  The story is told with many flashbacks and while I figured out most of the surprising reveals they all make sense and don't hurt the film.  Overall I was entertained throughout and Affleck outside the bat suit shows he has the action style down pat.  B+"
    },
    {
      "rating": "8",
      "text": "Wolf's family : husband and wife with their two kids visit a school for autistic with the hope that they will find a solution for Christian.\r In present day…Christian Wolf (Ben Affleck) is a already the owner of C.P.A office \"ZZZ Accountant\", one day he helps old couples with tax problems, and he settled it for them, these old couples so happy then offered him their ranch so he can do his hobby : shooting…anytime he want to. Then, comes the offer from LivingRobotics C.E.O and owner Lamar Black (John Lightgow) to get a very close look to all booking, and on the process he get acquainted with this junior accounting staff, Dana Cummings (Anna Kendricks)\r Meanwhile, a soon will be retired Treasury Department agent Raymond King (J.K Simmons) assigns an analyst Marybeth Medina (Cynthia Addai-Robinson) to investigate a mysterious person that always caught by a surveillance camera in several countries along with some international criminals. Medina accept this job reluctantly under King's threat,that he will revealed her dark covered past that will put her in jail for good.\r As the investigations goes, Wolf share his finding on the company 15 years booking with Dana, that something is wrong with the bookings.That now and then there's a leak, and to where did those leakage go? How?And why? But this leakage finding only just bring in Brax a vicious assassin into action.Then, Lamar stop Chris to stop the booking investigation.Chris cannot accept that. He begins to anxious because he must finish his job. Whatever he started must finished perfectly. Withouthis knowledge, a reservation is made on him. Brax and his team will execute them both. But only to find out that The Accountant not just an accountant that really good calculating with numbers of books, but also expert on calculating a person's lifetime. When Chris found out that a contract also made on Dana, he went mad and star a rampage killings.\r This Christian Wolf character is really unique, who once just an autism boy,but then grew up with a career as an accountant, not in a big reputation company but work with high profile most wanted international dangerous criminals. And the screenplay is so clever keep a question (I don't know if other audiences sense this) how the hell a man with end up in a dark career like this, some audiences perhaps begin to question this when viewed Christian Wolf once service in US Army more then 10 years before. Ben Affleck acting – not an Oscar level – but show a maturity from time to time, I admit that for quiet a while it's look like I see a bit shadow of Bruce Wayne from his eye look. He looks so convincing to perform when this character snap for the first time related to his job as an accountant. The emotions he hold between him and Dana, the sudden bumbling when he wave bye to the couple old husband and wives after he save them from being hostage by 2 hit men that sent to kill him (he killed the 2 hit men with cold blood). At this parts looks like I've shown Chris transform from a thorough autism shy bashful accountant into another persona :skillful killer with no remorse.\r Anna Kendrick also a good choice to perform Dana Cummings, a junior accountant staff with warm personality, simple and sincere. She is the first person after so many years that give him a deep impression and make him care much, deep enough to defend her with all his got. He will stop at nothing to keep her alive. I enjoy the chemistry build bit by bit between this 2 characters.\r Other thing that I like so much about this movie is that like I watch several stand alone movies in 1 packet kind like several mini spin off stories inside main story. The family, 2 Treasury Department agents, Christian Wolf and his interaction with Dana, the ruthless assassin Brax. But all goes smooth into one direction, and I said to my self \"Woww..what is going down? And then finally \"What the hell?\"\r I also gave credit to all support cast, J.K Simmons plays character Kings solidly as an uncompromising superior that will do anything to gain his will. Chyntia Addai Robinson also give her good play as a Treasury agent under pressure. And John Berthal already gave very nasty impression since the beginning until his character\r Then I browse about the director, then I struck on movie \"Warrior\" (Joe Edgerton and Tom hardy), I already saw that movie, a very emotion touch sport drama. Gavin O Connor gave a very good piece of work that he combined drama, violence and inter- characters conflict as a wholesale spectacle to us. And he did it again.\r And another thing, since I'm from Indonesia, I really surprise this movie use #PencakSilat and #BahasaIndonesia. When the father train his sons pencaksilat under professional trainer, the trainer suggested to had enough training for that day, but the father insist with a reason that he must know his sons limit and it's the trainer job to find out. And the young Chris said \"Tak apa apa, lanjutkan saja\" (It's alright, keep continues). Then it's just like a moment for young Chris to find himself that day, to overcome his autism to face life.\r My conclusion is this, with all those premises, stand alone stories that the script give, all it takes just one emphatic reason to bring out the action. Kinda cliché but, you don't need any difficult reason for a personality with autism background to defend what he care for. Finally, The Accountant is a calm with effective deadly moves. It's really #GoodWillHuntingMeetJackReacher. Rate : 8/10"
    },
    {
      "rating": "7",
      "text": "Stylish, offbeat, and tense, The Accountant seizes the viewers' attention and grasps it for the rest of its run time with its well crafted action sequences, complex performances, and fantastic direction."
    },
    {
      "rating": "9",
      "text": "Great movie with beautifully written characters and a great plot to back everything up. The actors do a great job and the directing is top notch as well. I couldn't recommend it more if you're craving for an intense yet meaningful action drama."
    },
    {
      "rating": "10",
      "text": "I'm frankly stunned by how critics treat this gem of a movie. What have these people been smoking?? This is a fantastic piece of filmmaking, with many fresh ideas, excellent acting on all parts, and one of the most a wonderful and deeply emotional twists near the end that I've seen in a long time. And for the most part, I never guessed what would happen next, which is not what one can say of most movies these days. How on earth is this movie scoffed at with such disdain by critics? Do yourself a favor, forget the critics, and just enjoy the ride. Implausible premise? Hell yes, but who cared about that in the last 50 thrillers and action flicks that got better ratings, if its wonderfully entertaining? Exactly."
    },
    {
      "rating": "8",
      "text": "I wasn't sure what this movie was about going in. I wasn't sure if Ben Affleck's character was going to be a good guy or a bad guy. After seeing it he is mostly a good guy, but with some pretty dark shades. Overall I really enjoyed the movie. Some people may not like the fact that Affleck's character has Aspergers and a number of psychological traits that are not always consistently written. Still, I liked all of the actors and thought they did a good job with the material."
    },
    {
      "rating": "9",
      "text": "I call this film the perfect Hitman movie, from that you can surmise some of the plot and type of action the viewer will see. Were it differs, is in the great story telling with scenes similar to that of the first part of die hard that give the view a great insite that explains the deep intricacy's of Ben Affleck's character the accountant who is a Autistic Maths genius, a expect soldier and explains his motives well. The film isn't all action however and has sections of levity from the mannerisms of Affleck's characters autism, infact the cinema audience laughed more at this than the last ten comedys that ive seen, so it broke the action and narrative seens up well."
    },
    {
      "rating": "7",
      "text": "A compelling, subtle performance from Ben Affleck is what'll ultimately keep the audience in their seats as they watch \"The Accountant,\" a slightly implausible, plodding thriller with a call-it-from-a-mile-away twist and some general narrative issues plaguing it all throughout. Gavin O'Connor's frenetic action direction also helps sweeten the deal offered by this mostly enjoyable romp through corporate America's darkest, most violent depths."
    },
    {
      "rating": "7",
      "text": "While not quite as good as I was hoping, The Accountant is a fascinating and entertaining character study with some great acting and solid action. It definitely doesn't deserve the negative reviews it's been getting."
    },
    {
      "rating": "7",
      "text": "The Accountant is one of the more interesting character study films I've seen in a good while, at least until it isn't. Ben Affleck's gives it his all in a subdued and nuanced performance which lead to one of his best performances to date. The film has too many subplots, it has too many characters and it does go on too long. However, the good out ways the negatives here and I hope this can become a new franchise in the future."
    },
    {
      "rating": "9",
      "text": "The Accountant is one of the best movies I have ever seen. A thrilling and smart film that keeps you on the edge of your seats. Filled with captivating performances. As well as white dialogue and intense action sequences"
    },
    {
      "rating": "8",
      "text": "Ben Affleck is becoming one of Hollywood's hottest sells. The movies he directs are strong and his recent performances are turning heads, he was the best thing about Batman V Superman after months of scepticism, and with The Accountant he is proving to be able to add depth to a titular action hero. Here he plays the Accountant, an autistic man having grown up learning very violent ways to defend himself from his militaristic father. Whilst un-cooking the books for deadly clientele he uses these skills to good measure until some rather lethal people start to hunt him down. The Accountant starts slow, showing a good 50 minutes of maths and numbers before any plot really kicks in but it is when it does that it really takes hold. This accountant is violent, nasty and emotionless and he makes for a rather interesting protagonist. It isn't the plot that keeps this going it is the backstory of the character. Whilst learning of his past the film hits its peak and when it returns to the main narrative it does derail slightly. This does make it rather messy as there is a lot going on with many expositional accountancy speeches that are confusing as anything, but don't see this for the numbers see it for the action set pieces and Affleck's performance. Other performers aren't given the room like Affleck but Jon Bernthal does also bring weight to his character. Kendrick gets sidelined as the story unfolds and Simmons has played characters like this in his sleep, that's not to say he isn't good here mind. Others are given smaller roles but really it is Affleck's accountant that you are here to watch. Forget about the films many flaws, contrivances and tangled narrative and go switch off for two hours and enjoy a good solid action thriller. It is a lot more fun then it is given credit for."
    },
    {
      "rating": "9",
      "text": "Great movie. Not your usual action movie. Original and well written. Maybe your not your usual hero. It is hard to relate to a character with very little emotional range."
    },
    {
      "rating": "8",
      "text": "The  Accountant is a sometimes confusing but highly entertaining movie. It gives another insight into the hidden mind of the autistic person, and some understanding. I had trouble hearing some of the dialogue, and  piecing the plot together but found it exciting and great entertainment. I recommend it. I would say that movie critics are a jaded lot, and should try making one."
    },
    {
      "rating": "7",
      "text": "If you like a good thriller, this is the sort of film that will entertain and engage you, but do little else. Whilst The Accountant features some great performances and some moderately interesting thrills, it’s also a bit of a let-down when it comes to the overall mystery, which gets more and more convoluted and confused as the film progresses, making it feel a lot more like a slow trudge to the finish than a proper thriller should be.However, this isn’t necessarily a bad film, and the main reason for that is the performances. Above all, Ben Affleck is amazing in the lead role. Playing a genius man with autism, he’s both likable and exciting, but also gives off a brooding and intimidating intensity that makes his character far more interesting, providing the majority of the film’s overall mystery.What’s more is that he suits the wide range of genres in this film very well. His dramatic intensity is second to none, but as he proved with his performance in Batman v Superman, he’s actually a very good action star, and does a great job when the film moves away from its slower, more dialogue-based intrigue.Alongside Affleck, there’s a heap of A-listers in the supporting roles. Whilst not all of them are so impressive (the likes of Anna Kendrick and Cynthia Addai-Robinson aren’t the most engaging to watch), J.K. Simmons is excellent in providing emotional intrigue in a very calm and quiet role, whilst Jon Bernthal and John Lithgow also impress in smaller roles.For the most part, the performances are the best thing about The Accountant. However, I have to say that I really enjoyed everything about the opening act. Promising a cerebral and patient thriller, director Gavin O’Connor does well to set up the various plots that will all eventually come to a head, thanks to a confident and consistently gritty style (in the vein of the TV show Homeland), whilst the screenplay plants a whole host of seeds for future excitement that got me very interested.However, following the captivating first act, the entire film begins to take a dive. O’Connor continues his gritty style well, but the mixing of intense, dialogue-based thrills and big-budget shoot-outs doesn’t really fit all that well, and whilst Ben Affleck manages to bridge the genres well, the rest of the film feels a little stuck in the wilderness with regards to what sort of film it wants to be.The biggest problem, though, is the way the plot becomes so increasingly convoluted and messy as the film goes on. Whilst the plethora of characters and side plots early on gives the promise of various thrills, The Accountant ultimately becomes incredibly inconsistent in its focus and pacing of those stories.In short, we spend far too long focused on one story or other (often up to twenty minutes without seeing any other characters), and the film unfortunately begins to take on an anthology style, ruining the overall story arc’s intensity and mystery. As a result, I was left bewildered as to what was really going on, and as the pacing begins to worsen as the film goes on, it feels like a longer and longer watch, offering little more in terms of intrigue and unpredictability.Overall, whilst I was impressed by many elements of this movie, I was ultimately disappointed. The central performance by Ben Affleck is brilliant, and the entire first act is enthralling, but the way that the story takes such a dive as the film goes on, becoming more and more convoluted, and as a result more and more uninteresting and difficult to follow, was a huge shame to see."
    },
    {
      "rating": "8",
      "text": "Very entertaining.  Typically we can understand where some critics are coming from, but their response to this one had us and the reviewers near us a bit baffled. We think audiences are going to enjoy this a lot more, and many critics got it wrong this time.  The film is a nice blend of drama, action, and thought.  However, it’s written differently than the usual fare, which also lends to some unexpected dialog.  I think the discontinuity here is one of what your expectations are going in. One final note: the probabilities a few professional critics mentioned aren’t as low as they purport.  Talented professionals at the top of any field have a tendency to run into each other eventually.  Go see this film, you’ll have a good time."
    },
    {
      "rating": "9",
      "text": "This movie is absolutely amazing. For the life of me I cannot see why the critics gave it so much hate. The action scenes are great, the script is great, and the characters (particularly Ben Affleck's) are all amazing. Plus, Ben Affleck and Anna Kendrick had amazing chemistry."
    },
    {
      "rating": "8",
      "text": "The Accountant is an interesting and eccentric movie that is well worth seeing. But it is unconventional and has some faults, and perhaps that’s why a lot of critics I trust had a bad day with it and gave it low marks it does not deserve. Ben Affleck and all the other actors are excellent. The problem, I think, lies in the editing. The “childhood” section goes on much too long (I was thinking about what to have for dinner), but the rest of the film moved along in a  hectic “autistic” mode, which helps you make sense of things in a strange way and makes Christian Wolff (Affleck) very sympathetic. If you “go with it,” The Accountant is a very enjoyable film with its own version of a happy ending. I’d like a sequel!"
    },
    {
      "rating": "10",
      "text": "I am 54 and have seen quite a lot of action movies.  There are years in which I saw over 100 in the theater. Once in a while there is a film that seems to have everything going for it, but it comes across flat.  Other films, usually because of the lead actor, are fun to watch even though they really are not good films.  The Accountant is an excellent film because everything about it is good.  The Equalizer was a straightforward gem, not really imaginative, but perfectly executed.  John Wick was top notch with some new elements, and the new elements pushed it above most of the genre.  The Accountant gives us a perfectly crafted protagonist.  We get to know why he is the way he is.  He is created in this film and the process of learning his back ground is not damaging to the movie.  The back story is not senseless or drawn out.  The action is solid and real.  I find overblown action quite entertaining, but this isn't that sort of film.  There is still plenty of action, and frankly, a lot of the film that is not action is so well shot, acted, and edited, that I was completely engaged as if it was one good chase scene after another.\r Why so many bad reviews?  They wanted a different movie.  One professional wanted more action.  Another was left cold by the fact that this film is abnormally complicated for an action movie.  They want Taken or Lethal Weapon.  Frankly I am a bit surprised.  Critics usually watch SO MANY films that they pan decent films because they offer nothing new. They are just like a hundred other films.  Critics often lead us astray by recommending pretty mediocre films that are being recommended because they are telling a story seldom told, or doing it in a new way, not because it is actually an excellent film.  This film should have been right up their alley, but I guess a lot of them were not up to the content, simply wanted to **** or got tricked into thinking the film was going to be something else.  The public seems to have understood what they were going to see and appreciated how it was done.\r I ask myself a question about movies; was that movie as good as that movie could be?  Was it miscast?  Did the actor lack the talent for the role, or was the actor misdirected?  Was the filming or editing distracting or boring? Were there logic mistakes noticed during the film, or nagging after the film?  In the end, was that particular film as good as that particular film could be?  If you go see Die Hard and expect to see The Matrix then you screwed yourself.  It isn't the movies fault if you WANTED it to be something else.  It isn't your fault if the movie failed at what it was trying to do.  If the movie wasn't a story that could be good or great, then the producers made a bad choice.  If it could have been great but was miscast or misdirected then shame on them.  The Accountant is the perfect version of itself.  Ben Affleck is perfect.  The filming and editing is perfect.  The cast in general is good.  The little tricks and reveals of the plot/story are logical.  Some people may be lost by the little tricks and reveals, but that is why there are comic books and there are novels.  Not everyone is suited for everything.  To bad for you that you went to the wrong movie.  Both my wife and I missed a plot point.  When we said \"Oh, that was explained by, or really was, X.\" to each other, we were even happier with the film.  The strings we thought were left untied, were neatly tied off after all.  This is an action movie, not Citizen Kane.  It is not some new adventure like the original Star Wars.  Don't expect to be mesmerized.  See this film expecting to watch a film worthy of your attention."
    },
    {
      "rating": "10",
      "text": "I went into this movie knowing nothing but the name of it, and the metacritic score so I had low expectations. I just picked it semi-randomly because I needed to pass the time that day unexpectedly and I didn't want to get into anything too \"good\" because I might have to leave. Anyway, long story short, this one hit me in the heart. I'm on the autistic spectrum somewhere (very high functioning, also bipolar) and multiple members of my family are autistic including a non verbal first cousin. I spent a lot of this film recognizing moments, habits, and quirks in an action hero that I almost never expected to see. Yeah, a lot of it was \"on the nose\" and some of it was played for laughs... but I think a lot of people forget that many like to laugh at themselves. And also, some may complain it presents autistic people as violent, but that's the same as saying that die hard presents bald men as violent (arguably more true). It's your typical \"no qualms about killing action hero\" type, but this time he's also the numbers guy, not the person he's dragging along. I actually cried at a couple points. Right?\r Anyway, yes, I'm rating this higher than it probably deserves for being a dumb action flick in many other ways, but the plotholes aren't as bad as I expected and better than most, and I want to offset some of the really undeserved critical panning. I liked it!\r There's also another prominent (spoilers!) autistic character and their presentation was great!"
    },
    {
      "rating": "7",
      "text": "After seeing this for myself, I must say that I'm a little surprised at how cold most critics have been towards this film. I ended up enjoying it quite a bit due to its intelligence and compelling stunts and action from Ben Affleck throughout, who gives a solid lead performance. Granted there are a few cliche moments and plot points, but they certainly didn't detract from my overall enjoyment of the film. Overall, it's not the best action film this year, but it does add up to a fun and entertaining enough and worthwhile watch."
    },
    {
      "rating": "7",
      "text": "This, along with Mr. Holmes broke my cycle of bad movies(storks(Tulip was great though),snowden(biased and dull),and Deepwater(Great first half,then downhill)). The sound is great with the boom of the 50.cal. The whole movie, as I thought, is reserved in terms of action compared to Cap America or Independence day. It takes the middle ground. The most reserved action being pretty much anything from A24. Also it's smart with all the money talk. Anna Kendrick is cute and Ben Affleck did a great performance.Although,the long string of revelations,or more, filling in the past, isn't as revealing as it should be. And the ending sequence feels too familiar and happy compared with big name studios. Even though I do see why a writer wants to give troubled characters happiness. Now to see the Girl on The Train."
    },
    {
      "rating": "9",
      "text": "It doesn't entirely reinvent the wheel, and while I could see one of its twists coming from a mile away, it's still a thoroughly fun thriller with both a fascinating lead character and an interesting story."
    },
    {
      "rating": "10",
      "text": "I can't believe the mixed reviews. The performances were perfect - especially with Affleck. This film delivered a wonderful mix of action, thrills, drama, great comedic timing, and, surprisingly, a beautiful portrayal of autism. This film did so much that critics mistook DIVERSE tone for 'uneven' tone. They are different and this film is a great time."
    },
    {
      "rating": "9",
      "text": "Puzzles!! What's really cool in this movie, in my opinion, is that it is kinda challenging to follow, and putting the events together becomes a PUZZLE FOR VIEWERS as well. Beyond that, there are great performances (Ben Afflect is excellent, but all supporting actors do a nice job too - especially John Lithgow ) and awesome Jason Bourne-ish and Liam Neesom-ish action scenes."
    },
    {
      "rating": "7",
      "text": "A well-acted and well-directed film that has great set up. The writing is kind of cliché, though, and the momentary editing is quite choppy. The structural editing is fine even though there is a ton of exposition in one scene of the movie."
    },
    {
      "rating": "10",
      "text": "I knew this would be a good film, but I didn't expect it be the best Affleck performance/action thriller I've seen in years. This film is absolutely genius from the plot to its brutal intense action scene executions.There are several complex layers in the story with some big clever twists and the emotional depth in the acting was astounding as well. After this, Ben Affleck might be the new go to action star. He slaughters his batman role in this as the autistic brilliant savant killer Christian Wolfe. So many new classic films this year."
    },
    {
      "rating": "10",
      "text": "Affleck and O' Connor gratify the viewer into a world of lies, and suspense, and create a movie experience as harrowing and taut as it gets. This one needs a watch."
    },
    {
      "rating": "10",
      "text": "Deliver the Oscar now!\r Best Performance by a Toupee I've seen all year. But once again, it'll be all about the politics when it comes to voting time by the Academy.\r Why do celebrities have to wear toupees? Is it because they're trying to stay young-looking or appeal to the legion of people out there who hate the baldies?\r I think Ben is successful enough that he could make a stand and say, \"Yes, I am bald and a philanderer and a card cheat but I have two Oscars and I am Batman. Listen to me and free us from these bad hairpieces. \"\r That's what I'd do if I was him."
    },
    {
      "rating": "8",
      "text": "For the first 2/3 of this film, it's great. Fun writing, thrilling shootouts and dedicated, charming performances. However then the film quite literally comes to a screeching halt to give us a 20 minute (no hyperbole) exposition scene from JK Simmons on the Accountant's past. I would rather have just seen those things play out in real time instead of narrated over a montage.\r Still, it's an immensely entertaining ride and in a year of disappointing tentpoles, this is both original and one of 2016's best."
    },
    {
      "rating": "10",
      "text": "The best movie we'very seen this year! I don't understand why the critical reviews aren't better.  I've directed 5 movies in my life and acted in 12,albeit not all Blockbusters, but 7 were successful earning over 50M. Ben Affleck was amazing!  Yes it jumped around a lot but the answers were there IF you weren't lazy and paid attention,  even his British computer friend was eventually revealed.  GREAT movie!"
    },
    {
      "rating": "7",
      "text": "Ben Affleck plays a math savant on the Autism spectrum who spends his days as a quiet CPA, but freelances for major criminal organizations and even mortally dispatches some of them. The narrative also involves flashbacks to his father's influence, a sympathetic clerk who arouses his affection (Anna Kendrick) and a government agent who's out to stop him (J.K. Simmons). The premise seems a bit preposterous and it's not really clear how the plot's complex machinations happen. Affleck stays pretty stone faced thru it all, registering as a mysteriously-connected mastermind and a sure-shot action hero. There's enuff complexity in the story to keep it interesting and a few moments of action to add some fun. If you can get past the ludicrousness of the story, you may enjoy watching it all unfold."
    },
    {
      "rating": "5",
      "text": "At the beginning of “The Accountant” we see an autistic boy faced with a jigsaw puzzle and most of the film is a puzzle with the majority of pieces fitting together but with a few missing or not the right size.\r Christian Wolff (Ben Affleck) is the older of two boys brought up by a military, strict father (Robert C. Treveiler) who recognizes the math genius of the older boy and that the younger son (Jon Bernthal) will have to watch over him. The father has the boys trained in the martial arts and weapons to such an extent that Christian is as good as an assassin as he is a mathematician and he wants both boys to know what their limits are. One of the missing pieces is that their mother leaves them with the father never explaining why she left.\r Along the way we meet J.K. Simmons as a Treasury agent who blackmails a member of his team, Cynthia Addai-Robinson, to find out Wolff’s connection to some high connected cartel dealers, Jeffrey Tambor as a prisoner, Anna Kendrick as an accountant who works for Living Robotics where she has uncovered that $70 million is missing and John Lithgow who runs the company brings in Wolff to work with her to find out who took the money. If Wolff was capable of expressing human feelings she would be the one to bring them out in him but he isn’t and she doesn’t except for one surprising gesture.  Jean Smart’s role is one of those ‘if you blink you will miss her’ neither adding or taking away from the film and one of those jigsaw pieces that just don’t fit.\r Christian Wolff is as quick and accurate with all kinds of weapons as Batman is and as sharp with mathematical problems as any genius, whose names he uses for aliases, with numbers can be.  Whether he is shooting/killing a gang of guys or working on 15 years of a company’s books looking for an embezzler he is always socially awkward, stoic, unsmiling, nonexpressive and, unintentionally funny. Ben Affleck does a fine job as a nerd and hero combined.\r Some of the jigsaw fitted pieces at the end didn’t quite explain all that had taken place in the past but then that is what sequels are for and the Director Gavin O’Connor and screenwriter Bill Dubuque might have already have the storyboard ready the “The Account: Adding a Chapter”.\r Though the middle of the film is a typical Hollywood action film the first and last half hours make it interesting enough to hold your attention."
    },
    {
      "rating": "2",
      "text": "I mean, it was entertaining at times, and Ben Affleck is pretty badass, but the movie's plot was so **** confusing and the ending was just ridiculous ."
    },
    {
      "rating": "7",
      "text": "Movie of the year ?  I certainly hope not.  Just another highly advertised film which the public buys into the hype. All in all the story moves at a good cadence & acting is decent. Just bought into the hype and came away disappointed somewhat.  Overall it's worth seeing but is a far cry from a described blockbuster."
    },
    {
      "rating": "10",
      "text": "Excellent movie. It's funny what the bad reviews say. Everything was explained, there were no plot holes (seen several reviews saying that they were too dumb to follow the story). Ben did a very good job in his portrayal of an autistic man. The story plot has a lot of depth, good character development, and the twists are somewhat surprising without being forced. I would have given it an 8.5/10, but seeing how the typical response of flat out stupid people people have once again hurt the true score I'll give it a ten in hopes of balancing it out to its true score."
    },
    {
      "rating": "7",
      "text": "Pretty GOOD action movie. Although it was boring on the first part.\rIt had much tension & action.\rThe acting was solid & overall it was very enjoyable movie."
    },
    {
      "rating": "9",
      "text": "Went to see this last night and must say that both my hubby and I really enjoyed it.  A bit of a modern Robin Hood.  Will gladly go see it again with friends who didn't get to the premier last night."
    },
    {
      "rating": "9",
      "text": "The Accountant\rThis movie was my type of movie. Throughout the movie it keeps you on the edge of your seat just wondering what might or will happen next. The main character Chris Wolfe exemplifies the role of the autistic boy turned super genius accountant for hire. He looks and lives the life of the average American accountant or so people think, when you get deeper into the movie yes he is your regular old accountant that does your taxes and such, but it’s then that you see what he’s really all about. Compared to the previous notions of the movie I thought it was going to be interesting to watch just because the commercials alone start to set the stage for the movie and start to get your excitement built up for the premier.\rSetting:\rThe place or type of surroundings where something is positioned or placed.\r4/4\rThe setting of The Accountant isn’t like many would expect from an action movie, unlike most movies that are located on some mystical beach or a snuggly ski lodge in the swiss alps, this movie takes place in a simple Chicago suburb. contrary to many individuals thoughts this still stages for very interesting setting. At times it feels more like a small utopia, because of the main character “Chris Wolfe” living in his own small world. The movie conveys this suburb as a place where he has all the things he needs but no more. Part of the movie takes place in his Airstream, that can be located in his storage unit. He uses this as a place to get away he has everything needed in this Airstream for basic life. The setting and the way it is used in the movie are very well used. It’s hard to use your normal boring suburb as a good setting, unless you’re a superhero saving the city from the evil, but in this movie it’s conveyed differently more of a safe place for the main character Chris. He has his home that looks just like the average home and makes him feel safe. The setting stays interesting throughout the entire movie and makes you wonder what it took to make this rather boring setting excitement and full of action the entire time.\rSpecial Effects:\rAn illusion for movies and television made by props, camera work, etc.\r3/4\rThroughout the movie the camera work is puzzling yet very good there always seems to be a way that you can film it differently to get a better perspective of what is going on and the camera crew seemed to be really good at trying to make all that work together to get some unique and unusual shots especially anytime there was a fight scene coming. For instance in one of the last fight scenes of the movie the main character had so many shots of what was going on you felt like you were on his shoulder looking at the whole thing from his point of view you could see every small detail. Sometimes the camera work also got confusing though for example in one fight seen you have no idea what is going on or where the main character is, I know that’s the way they wanted this certain scene to be to have a more mysterious scene, but for me personally it wasn’t my favorite way to film this scene.\rExcitement:\ra feeling of great enthusiasm and eagerness.\r3/4\rThis is where this movie excels in my opinion at least for me this movie is always keeping me on my toes the entire time and just keeps you wanting more, wanting to know what is going to happen to this exciting main character that always has everything planned out and is very precise. This story goes into a great back story in many scenes explaining how this character comes to be, also how he functions. The excitement in the movie slow at the beginning but mainly because of all the information you have to learn about what going on and why throughout the for 20-30 minutes you learn about the main character, his life, his business, and the basic problem what’s going on the basic timeline of events. But after that it’s all fast paced moving from scene to scene mainly resolving all the problems that were set up in the first few scenes.\rClimax:\rThe most intense, exciting, or important point of something; a culmination or apex.\r4/4\rThe climax of this movie is very exciting you learn some crucial things about the antagonist and protagonist. The climax come to the point where you think that maybe this isn’t going to be like all the other “hero saves the day” movies that are so common today. This climax is different it comes down to just three characters in the end, the main character and the people who are opposed to him. But what is different is the fact the main character goes through a “hell’ of sorts just trying to get here, he gets beat bashed and broken down just to get here, different from your other common action movies that are more to the point where the main character comes rushing in to the save the day or finish of the bad guy and then the whole deal is resolved. Instead this movie even after the problem is realized and everything is on the table the plot builds and you really get to understand the main character\rSetting 4/4\rSpecial Effe"
    },
    {
      "rating": "6",
      "text": "The Accountant is not that bad actually. The story is pretty good maybe more a family story and inquiry. It has some holes and unresolved mysteries. The actions scenes are pretty good. You can see that Affleck tried something different, and it works better at times then others. He got good actors around him. One of those rare movies that depict and show a sickness in children. If it is true in that sens is for you to judge but the film is watchable and interesting. I would say it's more influence by John Wick then the Bourne movies in terms of actions. I give it a 65%"
    },
    {
      "rating": "10",
      "text": "I found this movie very entertaining and super fun to watch. I went with 2 other people and we all LOVED IT!! I will for sure what this movie many times. I love Ben Affleck, he does an excellent job and is just wonderful to watch on screen. A Must See!!!!"
    },
    {
      "rating": "10",
      "text": "Loved this movie. Mr Affleck did a great job. I so recommend this movie, done well. All the actors did a great job. From the very beginning to the very end I couldn't look away. The writers should win some kind of award, I loved the surprises. I'm not good at reviews, but this is the best movie I've seen this year. Just go see it for yourself."
    },
    {
      "rating": "9",
      "text": "I went to this movie with very little to no expectations of it being good and suffice to say, I was wrong. Led by a stellar performance by Ben Affleck,who brought his A game in this movie. The Accountant is overall a tense, emotionally charged albeit a bit unconventional thriller but its also deeply character driven. I can see where people could be bothered with the pacing and the editing a bit but overall I found the Accountant to be a very fun and entertaining as hell movie."
    },
    {
      "rating": "2",
      "text": "The story is poorly told and the twist at the end is ridiculous. I would much prefer to have my time back, as well as the $5 rental fee. Even if you are a fan of Ben Affleck or a fan of thrillers, give this a pass."
    },
    {
      "rating": "0",
      "text": "What a god-awful mess this movie is. It is so disjointed with so many different subplots that the whole thing\rnever adds up. I sat scratching my head thinking.... 'huh'... 'what did i miss?'  and so on.  If you don't care about plots and storylines.. then sure, go see it. There's action and violence to distract you when you're not sitting in the theatre texting on your iphone.  If you want a movie to entertain and engage you -- THIS IS NOT IT."
    },
    {
      "rating": "10",
      "text": "I wrote a screenplay in 2008, The Cadet, subtitled \"The Serious Prankster\". It was about an autistic young man who is mentored to become a killer. I sent it to Zero Gravity Management. They gave it to Bill Dubeque, who rewrote it, and they released it as The Accountant. This is what they do. They ask for screenplays, read and review them, look for new and unique ideas, and then give it to one of their writers. That is why, even though, they get hundreds, probably thousands, of screenplays they have never released a movie written by anyone outside the industry. They are rip off artists. If you don't believe me simply go to Amazon Studios and search The Serious Prankster. See for yourself."
    },
    {
      "rating": "5",
      "text": "Meh. The premise of this flick seems drawn from a bargain bin comic book (excuse me, I meant so say graphic novel). Some heroes get their powers from a radioactive spider bite, while others get theirs from Asperger's syndrome and martial arts training from a domineering jar head father. In truth though, the over-complicated \"Wolffe\" character (Ben Affleck) is more similar to a tongue-in-cheek hero like the \"The Tick\" than it is Spiderman. Affleck's deadpan performance is the core of the movie. He uses a monotone voice and generally flat affect to create some very dark humor (bang!) and, conveniently, to accidentally charm the cute young character played by Anna Kendrick (also good in her limited role). Setting aside the implausibility of the main character, the trouble with the movie is it is 90% back-story and 10% plot. And that cursory plot (financial intrigue at Lithgow's robot company) is as exciting as a bag of sand. All told, the flick establishes a quirky character and set of colleagues plainly designed to populate a series of sequels. I walked away feeling like I had paid to see Part One of a two part story. And Part 2 threatens to include even more tedious exposition to explain why the character is not only so proficient but also so deplorable. Presumably the plot in Part Two will involve another financial puzzle and include another gee-whiz scene wherein Wolffe solves the mystery with his accounting genius. And probably even more hard sell on the ins and outs of Asperger's syndrome. I can wait."
    },
    {
      "rating": "2",
      "text": "This is one of the worst movies Ben gas ever made, I believe he has lost it. I'm from Dorchester Ma and I could not believe he would have even made this t-v movie. I think he lost it sense he got dump. I know Ben, but sorry pal, your loosing it by making movie that are good for t-V people pay big money to go to the movies, I feel you ripped us all off, Get your act together man you look so depressed"
    }
  ]
}