{
  "id": 3037,
  "title": "The Baytown Outlaws",
  "starring": [
    "Clayne Crawford",
    "Travis Fimmel"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "When three redneck brothers agree to help a woman save her son from an abusive father, they become targets on the run from an odd cast of characters.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oevsox25ZnoUBms45KARDs8epmg.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I created my new metacritic account Just to defend this OUTSTANDING Movie. I absolutely Loved it. Rented it, then went out and bought it the same day and watched it again. I just have to say I Loved it and any Normal person will too."
    },
    {
      "rating": "8",
      "text": "Okay, so you have Billy Bob Thornton in a cowboy kickass action movie. There's blood in The Baytown Outlaws all right! Heeeelllll yah! The film is really good, very simple and has clingy twists so you will be tangled and boggled from your mind. Watch this. Just watch it."
    },
    {
      "rating": "7",
      "text": "One mission, three guys and several obstacles.\r It appears I'm watching quite a lot those scripts that featured on the blacklist films. I understand why the filmmakers hesitated to take up this project. Not that it is a bad one, but the script is not a fresh. It was a decent road-action movie, awesome characters, stunts, but a bit similar to 'The Boondock Saints'. Also a part of 'Dexter' was in it.\r It was so fun to watch, about the three men who take up a job to rescue an innocent boy from the drug lord. The trio think the job is done, but the assassins pursued them for the payback. The rest of the film takes place on the road with some great battles and exchange bullets between the gangs.\r It could be a good flick for a non-action film fans, but if you are an action movie fan then it is a same crap that you might have seen hundreds of times in other flicks. The villains were so weak, but the stunts were not. Especially women assassins were hyped too much and lets us down at the same pace.\r Billy Bob Thornton was in a powerful negative role and he did not appear in any action sequences which is a big disappointment. He just looked like a barking dog, that's all. The reason was, to avoid overlapping with other similar movies. In that case, this film was completely borrowed from different flick and assembled here with a set of new cast and locations. But I enjoyed it, and also not fully satisfied. Very interesting ending, lets wait and see if there is a sequel for it.\r 6½/10"
    }
  ],
  "recommendations": [
    "the_expendables_3",
    "the_transporter_refueled",
    "the_expendables_2",
    "escape_plan",
    "mechanic_resurrection",
    "underworld_awakening",
    "brick_mansions",
    "peppermint",
    "the_expendables",
    "the_mechanic",
    "mission_impossible_iii",
    "xxx_return_of_xander_cage",
    "angel_has_fallen",
    "underworld_rise_of_the_lycans",
    "gone_in_sixty_seconds",
    "underworld",
    "i_am_number_four",
    "hitman_agent_47",
    "nobody",
    "salt",
    "bloodshot",
    "the_fate_of_the_furious",
    "skyscraper",
    "lockout",
    "underworld_blood_wars"
  ]
}