{"id": 4797, "title": "The Assignment", "starring": ["Michelle Rodriguez", "Sigourney Weaver"], "runtime": 95, "genre": ["Action", "Crime", "Thriller"], "description": "Ace assassin Frank Kitchen is double crossed by gangsters and falls into the hands of rogue surgeon known as The Doctor who turns him into a woman. The hitman, now a hitwoman, sets out for revenge, aided by a nurse named Johnnie who also has secrets.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3wx83iGCATiIAyrZHI6AeeNfiAT.jpg", "categories": {"plot": 5.75, "acting": 6.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.5}, "reviews": [{"rating": "6", "text": "The story of how a hitman became hitgirl!Actually, it was a much better film than what I've heard of it. What could you expect from a B movie? This was a much better film for its small budget with a decent cast. The storyline seems okay, but Michelle Rodriguez is the one who made it possible. Yeah, it was like created for her to play the main role and she excelled. The filmmaking was quite compromised when the initial part of her character was played by herself. Because of particularly her height, but decently convinces us with all the rest of the makeovers.The film was about an assassin, who after encountering some wrong men, discovers later that he'd went through gender reassignment surgery. Now raged with anger, he begins his hunt whoever behind it, especially finding the reason for. With a small romance and action sequences, the film comes to an end. Before giving it a try, you must understand that it is not the film you should expect to be a masterpiece. It tried its best to narrate a decent story, as well as you get your entertainment along. So it is not a must see, but still worth a watch.6/10"}, {"rating": "5", "text": "Wasn't bad, it was entertaining and had a ton of action sequences and stunts. Its obviously a budget film and alot of times you can certainly tell but Michelle Rodriguez really does a fabulous job here and looks mostly convincing as when she is playing a man. The plot is your basic run of the mill revenge theme, the villian is uninspiring, partly because Sigourney Weaver is sleep walking through the role and the rest of the people are just meat on a stick to be killed off later. Still if you have Amazon Prime, its definitely worth a watch if you're looking your looking to be entertained.5/10 or a C"}, {"rating": "7", "text": "Michelle Rodriguez is a women in real life and in the movie she play a guy who become a women with the voice of a man (because they keep the man voice), and i found her voice is kinda overpush, so everytime i hear her voice it's pretty hard to really pretend she is a man, but besides that, The Assignment is still delivers some action, alright performance, and interesting story, overall, i still enjoy The Assignment, it's an alright film at is best."}], "recommendations": ["homefront", "parker", "alex_cross", "the_italian_job", "contraband", "run_all_night", "killer_elite", "solace", "a_walk_among_the_tombstones", "collide", "16_blocks", "barely_lethal", "lawless", "the_tourist", "daredevil", "safe_house", "the_amazing_spider_man", "elektra", "street_kings", "jack_reacher", "those_who_wish_me_dead", "fantastic_four", "the_town", "snitch", "the_equalizer"]}