{
  "id": 4785,
  "title": "The Medium",
  "starring": [
    "Marie Powers",
    "Leopoldo Savona"
  ],
  "runtime": 84,
  "genre": [
    "Drama",
    "Music",
    "Horror"
  ],
  "description": "Madame Flora is terrified when she perceives a supernatural presence during one of her fraudulent séances...",
  "releaseYear": "1951",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1J7ixshZTYE7q586ULPzcxczZV6.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.5,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 4.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "overlong and painfully slow, i fell asleep many times.. scary parts are... well, weve seen it million times before"
    },
    {
      "rating": "5",
      "text": "'The Medium' sure touches on the interesting theme of religious beliefs clashing in Thailand, but the excessive use of the common tropes of the mockumentary and the found footage subgenres thwart any attempt of going beyond. Also, the bloated runtime is very harmful to the story. The 2-plus hours feels like 4 after it's finished, and there's a lot of redundancy throughout the film. Because of this, there are moments where director Banjong Pisanthanakun and screenwriter Chantavit Dhanasevi rely solely on shock value, trying to keep you hooked.In the end, what we get is a common mockumentary not that spooky as some people have said. The third act is full-on crazy, but nothing you haven't seen before on things like 'Paranormal Activity' or 'VHS.'"
    },
    {
      "rating": "6",
      "text": "Filme estilo documentário. Nas 2h de duração, mais da metade é uma preparação chata e tediosa. Só no final as coisas realmente acontecem e tentam chocar, mas eu já estava derramado na poltrona do cinema pedindo pra acabar logo."
    },
    {
      "rating": "7",
      "text": "Well.... What a movie. Creeping dread as these characters just did themselves deeper and deeper into what you feel will be their invetiable demise.I just kept thinking to myself... Every movie doesn't have to have a happy ending... Well... I won't give that answer away completely. I will say watch it.Would say my biggest issue with the film is like who's the good guys? Take Blaire witch right? We kinda.... Want them to escape the forest. But, like am I supposed to care about the camera crew, Mink, someone else? I can't really say."
    },
    {
      "rating": "8",
      "text": "The Medium is a Thailand Horror movie taking place in the Isan region of the country and is centred around Shamanism and a family who is going through a possession ordeal. Didn't know anything other than that it is produced and co-written by Na Hong-Jin, a South Korean creative who wrote and directed two great films i.e The Chaser, and The Wailing, the latter of which if you've seen would give you an instant hype boost if one is looking for Horror as it's one of the best Horror films I've seen in recent memory. And thankfully, this movie turned out to be a great fear-inducing creepfest watch.Shot in a found-footage documentary style, the director Banjong Pisanthanakun used that style to its full effect, for the most part, drenching you in the locale and the mythology of shamans, which in it itself was engrossing and kept me hooked from the start and was also necessary since it is a slow burn horror. That style, though, did act as a double-edged sword sometimes as you did have to suspend your disbelief a bit more than usual and also the fact that sometimes the characters would just make questionable or stupid decisions while the filming crew is there with them, but nothing too damning or ruinous.Of course, this movie wouldn't have nearly as much draw and effectiveness if it weren't for its wonderful Thai cast where pretty much everyone gave a good-great performance. Legitimately felt like you're just diving in to their lives and watching them go through this nightmare. Special nod to Narilya Gulmongkolpech who plays Mink, one of the leads who they suspect is possessed. It's her first feature-length film role (from what I can tell) and she was absolutely fantastic and is going places.Now, the movie isn't wholly original when it comes to presenting you the Horror aspects as you'll definitely find cliches and tropes associated with this style of filmmaking but it didn't need to be either as the execution alongside a complete change of the area from usual horror films was enough for full immersion. It also hardly relies on jump scares but instead uses its slow-burn horror and local culture/mythology to slowly sear the experience into your skull. I can think of only one cheap jump scare which I knew was coming and it still got me.Easily one of the best Horror movies of the year and the best found-footage style ones I've seen in recent times. The final 30-minutes or so were just... DAMN! Highly recommended. Just know that, as mentioned above, it is a slow burn, so the pacing isn't fast for a good chunk of the movie but it is of the good kind, the type where tension and intrigue are slowly wound up to a high degree and then is given a proper release in the climax. And if I were to rate it, I'd give it a solid 8/10."
    }
  ],
  "recommendations": [
    "it_follows",
    "the_pyramid",
    "malignant",
    "chernobyl_diaries",
    "host",
    "event_horizon",
    "the_conjuring",
    "the_witch",
    "the_texas_chain_saw_massacre",
    "the_descent",
    "the_blair_witch_project",
    "paranormal_activity",
    "insidious",
    "the_ritual",
    "annabelle",
    "monsters",
    "insidious_chapter_2",
    "the_ring",
    "dark_skies",
    "us",
    "the_strangers_prey_at_night",
    "a_quiet_place_part_ii",
    "signs",
    "antlers",
    "the_conjuring_2"
  ]
}