{
  "id": 3277,
  "title": "The Water Man",
  "starring": [
    "David Oyelowo",
    "Amiah Miller"
  ],
  "runtime": 92,
  "genre": [
    "Adventure"
  ],
  "description": "Hoping to save his sick mother, a boy named Gunner and his friend Jo venture into the remote Wild Horse forest to search for a mythical figure who possesses the secret to immortality. When they go missing, Gunner's father Amos must immerse himself in his son's world to find them.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/krupbFlSTnnKIjpRryrg2CTdeIL.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Well-executed directorial debut for David Oyelowo, that nonetheless feels disjointed when it comes to the adventure and the lack of excitement.It's feels to safe.There are good intentions yes, and I would say people should watch it, but that does not justify what it fails to do better."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)Oprah Winfrey produces David Oyelowo's directorial debut, a mix of drama, family, adventure and 90s fantasy. But a Rob Reiner's inspired magic and imagination are not a common commodity."
    },
    {
      "rating": "7",
      "text": "I know I'm late on this review, but I found a sleepy Sunday afternoon to finally watch, The Water Man. I know you're thinking what is he even talking about. Well, Netflix puts out a lot of content and I'm still in catch up mode. The Water Man is about a boy who \"runs away\" from home hellbent on finding the local lore's boogeyman. The boogeyman has the powers to heal and save his ill mother, but no one knows where to find him. Let's see if this quest can hold water.I'll put it like this, the movie explores the difficulty of a child navigating life and the death of a parent. I mean, talk about a hard concept to grasp for an adult, let alone a child. It's no wonder this kid wanted to run away. Yet, the filmmakers have done pretty well capturing the difficulty of the situation. David Oyelowo, solid actor and as director of this movie, has found a way to depict those emotions on the screen. With that in mind, this movie is quite heartfelt and only amplified by the acting ensemble led by Oyelowo. Oyelowo and Dawson are not the focal points of this movie, but they definitely help the heart of the movie. Think Seven Pounds meets a fantasy quest for the fountain of youth. Led by our young protagonist Gunner Boone, played by Lonnie Chavis, this movie is cute and slightly creepy; and, moreover, the story about the Water Man is really nicely depicted. I'll admit some of the kiddie parts with Chavis and Amiah Miller, as Jo, get a little corny, basic, obvious, and annoying. In fact, they slightly don't fit the more serious portions of the film. It's a strange mix but there are times when they aren't acting like kids and they power through a scene. Either way, a viewer can slog their way through those parts in order to get to the final destination. The ride is quick but still gets you emotionally invested.By now, y'all must know I do love me a teenie-bop movie and this was no different. The Water Man is a heartfelt, adventure buddy streaming film. David Oyelowo did a really solid job directing and acting in this film that made the film actually feel emotional. This flick didn't get much attention on Netflix but viewers can enjoy this film nevertheless. Grab a bowl of popcorn and make your water to the Water Man's House."
    },
    {
      "rating": "6",
      "text": "Es una nueva película familiar en Netflix; la trama es decente y las actuaciones son pasables; David Oyelowo tiene mucho potencial como director de cine."
    }
  ],
  "recommendations": [
    "moonrise_kingdom",
    "where_the_wild_things_are",
    "swiss_army_man",
    "a_monster_calls",
    "captain_fantastic",
    "come_play",
    "promising_young_woman",
    "i_kill_giants",
    "five_feet_apart",
    "eight_below",
    "into_the_wild",
    "the_florida_project",
    "vivarium",
    "the_age_of_adaline",
    "the_road",
    "stand_by_me_doraemon_2",
    "big",
    "endless_love",
    "the_perks_of_being_a_wallflower",
    "colossal",
    "the_hunt",
    "instant_family",
    "nightbooks",
    "the_good_dinosaur",
    "wonder"
  ]
}