{"id": 1806, "title": "The Beguiled", "starring": ["Colin Farrell", "Nicole Kidman"], "runtime": 93, "genre": ["Drama"], "description": "During the Civil War, at a Southern girls’ boarding school, young women take in an injured enemy soldier. As they provide refuge and tend to his wounds, the house is taken over with sexual tension and dangerous rivalries, and taboos are broken in an unexpected turn of events.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uQxfqFAqAvNK5b1wD11b2ycDAVg.jpg", "categories": {"plot": 5.116666666666666, "acting": 5.346938775510204, "ending": 4.916666666666667, "soundtrack": 2.0, "cinematography": 6.5, "familyFriendly": 3.0, "funny": 6.75, "action": 5.714285714285714}, "reviews": [{"rating": "6", "text": "Had much better potential considering the talent assembled onscreen, but this so-called \"thriller\" is bogged down by a rather slow burn of a story, as well as stupid decisions made by some of the characters halfway through the film. I really don't have much else to say on this one other than I feel bad that Colin Farrell, Nicole Kidman, Kirsten Dunst, and Elle Fanning all wasted their time with this wonderfully and often times intriguingly shot, yet overall bore of a film. I really need to stop giving Sofia Coppola the benefit of the doubt every time she makes a new film, because as far as I'm concerned, Lost in Translation is still her only good film to date, but that was nearly fifteen years ago, so..."}, {"rating": "7", "text": "The remake couldn't live up to the expectations of the original. The Beguiled (1971) is honestly brutal and intense while its remake is not."}, {"rating": "2", "text": "A good cast and location cannot save this poorly developed, written and directed yawnfest. Coppola misses the successes of the original and ignores the opportunities to make it better. Kidman's character is too reverent and lacks any sexual tension with Farrell. Elle Fanning's bad girl was softened to the point of indifference. With barely any dialog that shows feelings or builds tensions between the characters, all the original themes of the book are left unfulfilled. Jealousy barely even made an appearance on the screen.A remake must be better than the original to succeed, and her feminist version of a handsome Union soldier being found and nursed to health in a Southern house of 7 frightened yet highly venerable young women near the end of the civil war almost ignores the laws of physical attraction. No sex, barely a flirt, or even a puppy love smile moment, and fear of provocation castrate this movie from start to finish. Skip it, not even worth renting."}, {"rating": "8", "text": "This is an extremely well made film that creates a really engrossing environment with well defined characters.  Won't be for everybody like much of Sofia Coppola's films, but I appreciated it.  A-"}, {"rating": "9", "text": "Absolutely mesmerizing from start to finish... easily Sofia Coppola's best film so far. Terrific performances from a stellar Kidman, a sympathetic Dunst, and an engaging Farrell propel this sophisticated and quietly intense chamber piece."}, {"rating": "2", "text": "Of the 60 plus movies that Nicole Kidman has made I have seen at least 30 and she is always good, many times rising above the material given her to work with. Of the 6 movies Sofia Coppola has made I have seen 3 and have no desire to see any more by her.In “The Beguiled” Kidman once again rises above the material while only Colin Farrell and Kirsten Dunst equal her. Oh yes the plantation, the inside and outside, which is the set of the movie, also rises above the material.Coppola, directing and writing, remade the movie, originally directed by Don Siegel and starring Clint Eastwood and Geraldine Page, eliminating a very interesting aspect from the original, and leaves many questions as to why and what did she think she was bringing to the film? We have seen Southern women and girls in peril during the civil war before in many movies and she brings nothing new to that angle and her two most forceful scenes will have the audience turning their head away and/or closing their eyes.I found “The Beguiled” to be a slow, quite boring movie."}, {"rating": "6", "text": "I saw The Beguiled on BluRay.  It was frustrating because most of the film is drenched in murk, dark and drained of color, even the daytime scenes.  The actors' faces were hard to make out.  Voice performances are good, and the film is worth watching (although not if you need subtitles, which are far too bright).  I appreciated the ambiguity and complexity of the main characters.  Southern Gothic done as French art film."}, {"rating": "2", "text": "A beautifully shot film - but very slow. As much as I like Sofia Coppola's other films (and I really wanted to like this one), this film was a turkey. The entire film takes place in a large southern mansion and most of the film is shot in two rooms -- the bedroom where Colin Farrel is bedridden and the living room. The first 80 minutes is very slow character buildup centered around Kidman, Dunst and Farrell. The film picks up a little and then drifts back down to a mellow conclusion. The lack of a discernible soundtrack adds to the slowness. Great acting from Kidman and Farrell and supporting cast."}, {"rating": "3", "text": "The unexpected arrival of Colin Farrell causes mayhem in school full of “vengeful b****s (his words). That’s the short version but it’s enough to know you should definitely skip this one. It's the American Civil War. Open with a scenic shot of the woods with lots of cricket sound effects. Then you get another scenic shot of a house accompanied by more crickets. Followed by another shot of the house at sunset and from a slightly different angle and you can see where this is going. I’m not faulting the cinematography but it’s so in your face constantly it loses any desired effect.The school of prim and proper ladies run by Nicole Kidman decide to take in a wounded soldier while he recovers. Can they trust him or can he trust them? Right away I was expecting a tense and suspenseful gothic drama instead I got bland, non-engaging and lots of running around the house with flowy nightgowns and candles. All tied together with acting so bad it will make you laugh. Not from Kidman of course, she carries the movie but that’s simply not enough. I’ve never seen the original but I’m willing to bet it’s better than this remake. Not recommended, seriously I wasted my time so there’s no need to waste yours."}, {"rating": "8", "text": "Sophia Coppola’s six feature film, after the under-talked-about VIRGIN SUICIDES, the over-rated LOST IN TRANSLATION, and the not-seen-by-me THE BLING RING, SOMEWHERE, and MARIE ANTOINETTE, is a gripping slow-burn. Updating the Clint Eastwood vehicle (of which I saw once about 15 years ago), Coppola moves the focus from the injured Union soldier (Colin Farrell) to the Southern women left a decaying school who take care of him.  She and DP Philippe LeSourde build a strong sense of atmosphere through shots that feel both claustrophobic and voyeuristic. Many shots are framed through windows, doorways, gates, or with the help of the ancient oak trees that line the South with their looming, oppressing branches and are filled with smoke and visible rays of sunlight. It almost feels like a haunting. By keeping the camera back from the actors, close-ups are rarely used if at all, they create an impressive mise-en-scene that highlights not only the mounting tension but the impressive production and costume designs (perhaps some nominations come the end of the year). Add a minimal score, replaced instead by the constant nature noises of the rural South (I miss the sounds of cicadas in the marshes of my South Carolina days) and the occasional distant cannon blasts, and natural lighting and atmosphere is solidified. This is all in tone with the performances by Nicole Kidman, Kirsten Dunst, Elle Fanning, the aforementioned Colin Farrell, and the other girls at the Seminary are all beautifully understated.  The tension and pacing both grow as the film moves along until it nail-bitingly comes to where it must. It’s haunting and fully recommended. A"}, {"rating": "1", "text": "A little girl from a female finishing school comes across a wounded Union soldier (Collin Farrell) while in the woods picking mushrooms & brings him back to the school for medical help.  There were 2 adult women & 5 young girls at the school & 3 became 'interested' in the soldier - it was not realistic & felt stupid.  The first 3/4 of the film was painfully slow, and boring, with no obvious plot or content to keep our attention .... then a story suddenly developed.  I thought, 'well finally here we go, a story line' - nope, not really!  It could have been really good but fell dead flat.  Nicole Kidman did an ok job, but really not much for her to do with her character & Kristen Dunst's character was simply a frustrated woman with no depth at all. Costuming & scenery was good but the film was mostly dark. The end????  Terrible!  1st thing someone said when the lights came on was \"can we get our money back?\" followed by \"that was horrible!\""}, {"rating": "4", "text": "Beautifully shot and acted, but fails to deliver upon its intriguing and promising premise -- the movie ends just when the most interesting part could have begun, where the characters would go from there. It's basically an extended first and second act, missing a third act. It wasn't unpleasant to watch, but it was very disappointing where it chose to end.  Coppola's scripts in general tend to be wan character studies whose plots peeter out before reaching their logical and/or most interesting conclusion, and this is no exception."}, {"rating": "3", "text": "While the exterior shots were lovely, this movie was exceptionally dull and not very steamy.  There were some amusing moments, but I was glad for it to end.  And those exterior shots that were supposedly in Virginia?  No.  Clearly not Virginia, but southern Louisiana.  The best part by far: cuddling with my guy."}, {"rating": "2", "text": "Given good reviews ahead of time, I was expecting a movie that used both atmosphere and the tensions of war to create maybe a suspenseful borderline psychotic thriller and the trailer seemed to indicate that these little private girl's school deep in the Spanish moss covered Virginia backwoods during the Civil War, 1964 to be exact, was a sinister place with hints of madness blossoming into a real fruit cake of a movie.    I was wrong.    For a movie called \"The Beguiled\", there is nothing particularly beguiling about it.    Colin Farrell plays a wounded Union soldier taken in by the home to heal from his wounds, and the movie drags along to the half way point with no real action, suspense, and very little moving plot.    Only after that point does it begin to show promise, and despite some great possibilities for a truly frightening movie, it falls flat.    We never get past the prissy performance by Nicole Kidman, who shows about as much depth as a kiddie pool.    What is supposed to pass for real sexual frustration and tension barely scratches the surface, and even when Farrell starts getting \"creepy\", unconvincingly at that, the movie just doesn't connect.    We get a lot of praise for Sofia Coppola, but I don't see the greatness that she supposedly possesses.    This is a movie long on expectation, boring in its delivery, and left my wife and I wondering just what the fuss was all about.    It's a dud and that's too bad because in the right director's hands, it could have been special.    Instead it's just another remake of a movie that didn't need remaking in the first place."}, {"rating": "10", "text": "This film is not for everyone. It is subtle and requires attention, but if you can give the film that, the experience is very rewarding. I guess you’d have to say it is a typical Sofia Coppola film such as Lost in Translation and The Bling Ring. Another problem is the misleading trailer. What happens to the wounded soldier at the hands of Nicole Kidman is not as sensational as the trailer implies and has nothing directly to do with castration. Within the immediate events of the film, it makes perfect sense, although what is going on underneath is another matter. The cast is wonderful, especially Colin Farrell, Kidman, and Kirsten Dunst. This is a great film, although I am not sure yet if it is a classic, but certainly Coppola deserved her Best Director award at Cannes."}, {"rating": "5", "text": "Great, yet another 70's remake.  Check out the 1971 Eastwood/Geraldine Page original.  Cannot understand the raves for the new version, the original nailed the theme just fine.  Oh, yeah, this time an over-rated female director who just focuses on re-making other capable director's films."}, {"rating": "0", "text": "This movie just flat out sucks. I wish I could have my hour and a half of life back that I wasted watching this boring, pointless garbage. There isn't that much more to say about it except, stay away, far, far, away."}, {"rating": "2", "text": "While atmospherically on target, this tedious snoozer never engages, leaving viewers waiting for an ending that takes far too long to come, even in an offering with a scant runtime of 94 minutes. Half-baked performances that could have been phoned in, underscored by virtually nonexistent Southern accents, make for a cast of confederate belles who look bored, disinterested, even robotic at times. The sinister, macabre suspense depicted in the preview make the film appear more captivating than it is, a genuine disappointment to be sure. So watch the trailer instead of the theatrical release for this one, and you'll see a better movie."}, {"rating": "6", "text": "This is exactly what you would expect the Sofia Coppola version of this film to be. On the one hand, it could have been an interesting take on the original. That version was a bit campy and overheated, its emotions and intentions written all over each scene. What if those were scaled back and we were left with simmering emotions and gentle backstabbing and mysterious intentions? A story that captures the politeness of the south and the demureness of the times but with this unmistakable sexual tension underlying everything. It could work.But it doesn't, not really. Characters feel half-realized, somehow holding back their emotions results in ciphers whose actions seem to take on even more of a plot-forward agency than before. Specific actions happen seemingly at random, rather than being the result of a perfectly cooked setup that boils over. It's all a bit too laconic and Coppola doesn't find a way (like she has in her other films) to make the undercurrents the main current, the repressions the inevitable explosions. It just feels empty. A fashion show with low-light natural lighting and an occasional misplaced feeling of dread."}, {"rating": "8", "text": "This film takes place at a girls' boarding school in Virginia during the Civil War. When they give refuge to a wounded Union soldier (handsome, seductive Colif Farrell), his presence has a provocative effect on the women (including Nicole Kidman, Kirsten Dunst & Elle Fanning). Although the performances are captivating and the interactions enthralling, it's director Sofia Coppola's delicate direction and cinematographer Phillipe Le Sourd gorgeous images that stand out. The pacing may be too genteel for people without patience and the drama never realizes it's emotional fervor. Still, it's restrained world and the drama that develops is quietly compelling. (There was a lot of moss on those Central Virginia trees, something I've never seen and I've been in VA for 50 years.)"}, {"rating": "7", "text": "It is a remake of a movie originally made in 1971 starring Clint Eastwood.The movie is a drama set up during the Civil War when a wounded Union soldier gets rescued and then imprisoned in Confederates girl boarding school.This remake is directed by Sofia Coppola know for \"Lost in Translation\" and many other movies.The director once again proved that she is a master of her trade, with good casting, great performances across the board (I cannot miss out Nicole Kidman who shines as Miss Martha, the boarding house head-mistress).The movie is stylish, artsy and atmospheric, authentic looking.Overall, very solid film, definitely deserves being seen."}, {"rating": "7", "text": "The lust and the destruction!I neither read the book, nor seen the original film. It was a small slice of the American civil war. But did not focused on the actual war. A fictional drama that followed an injured soldier who sheltered in a girls school was looked after well by the stayed back teachers and students. While he was recovering, fallen in love with one of the women. But everybody else too had a little crush on him since he's the one man around. That causes a bump, following a twist in the tale, all comes to halt.A simple and nice drama. Best picks for the roles. But Kristen Dunst did not sync-in with the rest of the girls. Nice clothings too, a perfect recreation of the mid 19th century. I enjoyed it, good for watching at once, but I bet those who watched both the version would go for the old one. Especially for Clint Eastwood. Though Colin Ferrell was not bad in this. Not the best film from Sofia Coppola compared with her others, definitely not worst either.7/10"}, {"rating": "7", "text": "I've seen all of Sofia Coppola's films and she is very good at not saying whatever it is she may be saying. Since Somewhere, the influence of Antonioni continues and she's willing to hold a shot/scene for longer than most directors nowadays would dare. I have not seen the Don Siegal version so cannot compare it. Colin Farrell looks well-preserved, until.... Everyone else --the distaff members of the cast-- take part in the funny games exactly the way Sofia C wanted them to and the effect is ultimately and purposefully stylishly vague. Love it or leave it, that is the Sofia C brand."}, {"rating": "9", "text": "Coppola has brought a sublime American Gothic story to the screen in this polished and unnerving film. With stunning cinematography and a sparse score, with mostly ambient sound enhancing the tension as the storyline unfolds, this is a careful and subtle exploration of the cloying shadow of the American Civil War for the women left behind during the conflict, as well as a commentary on the deep undercurrent of jealousy and desire that runs beneath a veneer of Southern gentility. The ensemble cast are exceptional and this is a masterful film well worth your time. 9.02/10"}, {"rating": "7", "text": "Over her directing career, Sofia Coppola has won quite a lot of praise, arguably the biggest of which came this year in Cannes where she was announced the best director for „The Beguiled“.It feels a lot like a political decision – after all, it marked the first time in 50 years a woman won the award, and only the second time overall.„The Beguiled“ doesn’t really feel like her best work for many, including me. Most like \"Lost in Translation\", I personally was most deeply touched by „Somewhere“. (I know, such a surprising choice.)But it surely is one of her most crowdpleasing films. Just think of the story and possibilities coming with it. US Civil War, Southern girls’ boarding school. Sheltered young women take in an injured enemy soldier. As they tend to his wounds, the household is fast taken over with sexual tension and rivalries… And all this in rich southern gothic like sauce.Written and directed by Sofia Coppola, „The Beguiled“ is based on Thomas Cullinan novel which has already been brought to screen in 1971, with Clint Eastwood as the male lead. This time, it’s Colin Farrell vs Nicole Kidman, Kirsten Dunst, Elle Fanning and the others. What could go wrong?Well… it is not bad. It’s just too short and underdeveloped to be really really good – you know, Cannes winning director worthy. While I really appreciate films being less than two hours for a change, there’s really too much exciting content here to be contained in only 93 minutes.Thus, the third and final chapter of the story is noticeably weaker than what comes before that. One shouldn’t save time on building atmosphere, characters and relationships when all these are essential to the story.To Coppola’s credit, she’s still a fine director. By which I mean she’s good technical director: everything feels well composed and thoughtful.The movie as a whole also feels somewhat less emotionally distanced and dry than her usual, because she’s playing with different genres and manages to offer delicious mix of southern gothic, drama, subtle black comedy, erotic thriller, even horror. And, of course, you can’t have \"dry and distanced\" in the middle of this lush southern setting.All this is supported by able cast consisting mostly of women, Farrell in the middle of it all is not the most important player.It’s much more intriguing to watch all the women circling around him, nobody usually in the forefront, but almost everybody out there to stake a claim. The acting is mostly about nuances and subtlety, so there’s a lot of enjoyment to be had from just watching and witnessing.I am especially happy for Nicole Kidman doing another good role in a good movie recently (after „Lion“). She’s appeared in so many forgetful and mediocre projects in this century that it’s hard to get excited about her appearing somewhere anymore.The bigger parts also go to Dunst and Fanning, who are playing to their usual strengths, one shy but heartful, the other one kind of dangerous and lustful. All this works, and works well.In a way, Sofia Coppola’s movies are like Jim Jarmusch’s. if you can’t invest yourself in her slow moving stories mostly interested in mood rather action or being easily digestible, you can feel bored or underwhelmed soon.As mentioned above, „The Beguiled“ is somewhat more welcoming than her usual. But as a whole, it feels also uncomplete, or less complete than usual.But I'm, of course, still happy about having seen it, and Coppola continuing to make movies."}, {"rating": "8", "text": "Watch The Beguiled Full Movie - Online Free [ HD ] Streaming http://qn.telemovie.pw/movie/399019/the-beguiled.htmlThe Beguiled () - Colin Farrell American Zoetrope Movie HDGenre : Drama, WesternStars : Colin Farrell, Nicole Kidman, Kirsten Dunst, Elle Fanning, Angourie Rice, Oona LaurenceRelease : 2017-06-23Runtime : 91 min.Movie Synopsis :During the Civil War, at a Southern girls’ boarding school, young women take in an injured enemy soldier. As they provide refuge and tend to his wounds, the house is taken over with sexual tension and dangerous rivalries, and taboos are broken in an unexpected turn of events."}, {"rating": "9", "text": "Visually sumptuous and beautifully understated. Sofia Coppola has directed with assured confidence her best film to date, a remake of the 1971 version starring Clint Eastwood and Geraldine Page. The screenplay quietly bristles with sexual subtext and Nicole Kidman, Kirsten Dunst and Elle Fanning are more than equal to the demands placed upon them by so intelligent a re-imagining, where subtlety is the order of the day. One is left compelled,gripped and exhilarated. Definitely better than the original."}, {"rating": "7", "text": "Great atmosphere, short film (welcome these days) and with a tension that keeps building as events happen. Unexpected outcome for me in the end. Perfectly put together and with a cast that is one of the best of the year, with the always efective Nicole Kidman and also very good pieces by Colin Pharrel and Kristen Dunst. Totally recommendable."}, {"rating": "6", "text": "\"What have you done to me, you vengeful ****'The Beguiled' is underwhelming, but beautiful to look at. Nicole Kidman, Kirsten Dunst, and Colin Farrell are all excellent, as usual.The technical side of things is on a level of masterpiece and the imagery is quite haunting. Sofia Coppola is a strong director, despite slipping recently. This however, this is one slow burn that doesn't amount to much at all. No time was spent on the chaos or conflict. The sexual tension is there, but everything else not so much. The whole thing felt safe.Keep in mind, I think this is good. Wasn't blown away or amazed like anyone else."}, {"rating": "6", "text": "A kind of boring movie, The Beguiled has some great performances, great cinematography and great editing. It's a very well made movie, but there's not much to it, the characters are boring and the story isn't that engaging."}, {"rating": "3", "text": "Really did not care for it.  A lot of \"atmosphere\" ?  I guess. I wanted to get some fresh air the whole time I saw it. Really hard to believe this was from a novel. Seemed like a short story plot with a twist (slow in coming and kind of like Poe's stories). Just not very much of a movie. If this is female empowerment I think Wonder Woman would have been better!"}, {"rating": "2", "text": "\"The Beguiled\" suffers from artsy-fartsy filmmaking techniques that may impress critics but simply distract and annoy normal audience members.  Apparently, the director likes to use natural light.  I spent the entire film struggling to see the actors' faces, which made it pretty challenging for them to convey much in the way of emotion while playing their parts.  The movie plodded along until it mercifully ended.  There were a few moments of high dramatic tension; but, because there really were no characters in the movie about whom I cared enough to be concerned about what might happen to them, even those moments fell flat.  The fascination about this movie and so many others is how out of tune the critics' evaluations are with those of normal movie-goers.  I'm getting to the point at which I am reluctant to see a movie the critics have praised."}, {"rating": "2", "text": "I entered this movie with much anticipation and far too high expectation. The tactical previews and other reviews misled me to imagine a twisting thriller, and per Sophia Copolla-style, I spent the entire movie exciting myself by predicting all of the unfortunate finale possibilities that the plot of the movie provided. I was left completely underwhelmed and disappointed in myself for even expecting anything fulfilling in the first place... This IS 2017 Hollywood - And this director seems comfortable producing an empty pile of recycled plastic garbage and feeding it to the public with a spray coating of 'floral wallpaper aesthetic', throwing leaves on top of it, and hoping nobody is hungry for anything of substance. The acting was mostly inconsistent, although given such a dull script, it must have been a challenge to act emotive and passionate. Nicole Kidman and Kirsten Dunst did well, considering. Went home unsatisfied with this film, and would never suggest anyone pay money to see it. Just watch the trailer, it's the entire film, 'spoiler'!"}, {"rating": "4", "text": "This movie was sooooo slow. Kept waiting for something exciting to happen. The preview is more thrilling than the movie. Wait for it to come to tv. not worth seeing in the theatre."}, {"rating": "6", "text": "Interesting premise and dedicated performances from everyone. Coppolla's The Beguiled is an intriguing film and a rather disturbing one. However, it might not be everyone's cup of tea due to the final product's nature of choosing to be rather quite in contradiction with the uproarious talent on and behind the screen; the film could have opted to be more dimensional, dramatic and more intense."}, {"rating": "7", "text": "Be nice to women and they'll be nice to you, cross them and you will have a huge problem in your hands.That's a lesson well learned in The Beguiled where Sofia Coppola makes the same mistake she made with The Bling Ring and once again directs a film in which she shows her quality as a filmmaker on front of a weak script.The film stands out because with the little things offered by the plot, Coppola manages to give a sustained rhythm but unfortunately you realize very soon that the film will only advance on the repetition of situations and in a certain way that aspect becomes a narrative burden because you discover very soon towards where everything is going and what eventually will unleash the conclusion which in my opinion took many points from the film in general.And you also quickly notice the weakness of the story when it unbelievably limits three actresses like Nicole Kidman, Kirsten Dunst and Elle Fanning and also turns Colin Farrell into a simple man without any sort of character development.It was good but nothing out of the ordininary."}, {"rating": "6", "text": "as much as smaller it gets..The BeguiledThe Beguiled is a character driven drama about an all-girls school that struggles vigorously after a wounded man arrives knocking on the door. Coppola's world in here is brimmed with all the negative emotions i.e. from jealousy to betrayal, and this factors in majorly on latter stages, when an innocently brewd poignancy barges in amidst all the hatred and elevates the tale into a whole new level. Addition to that, the subjective procedure that it follows isn't rudimentary but fresh with a newer structure and with unseen stakes that communicates to a point where the audience wishes to move the puzzles but in the end is inevitable. And this is where Coppola's experience paint in those bright colors that fiddles with viewers' emotions. The credit goes to stellar performances too, that helps express these concept on screen. The background score barely factors in but cinematography and editing is decent enough to make it work. The adaptation is gripping and smart that consumes each characters' perspective in, within 90 minutes of runtime. Farrell's character stands out alone and so does his performance along with Kidman's edgy and darker portrayal whilst Dunst's a bit mellower one. The primary reason why it is scary at times is that it barely offers in any outside help to the characters, the bubble gets evil as much as smaller it gets. Draining down all the possibilities takes most of the time on the screen, in order to reach into a non-feasible narrower last act which is disappointing as much as pathos it is. The emotions iterated in each characters and early humorous acts and gripping tight screenplay are the high points of the feature. The Beguiled is not Coppola's best trick but it certainly is far better than its previous one and progress is always appreciative."}, {"rating": "10", "text": "I enjoyed this movie much.  On the Alfred Hitchcock path,which turns and the public or viewer much decide for themselves who is the guilty party, male or female?  In fact, the movie made me open and account to write a review and think about reading the book.  So yes, this movie is a must see, regardless of any negative review.  The movie invites the audience to decide.  Loved it."}, {"rating": "8", "text": "Brilliant name. Leave to audiences the question to think who are the ones that beguiled? The teachers and the students or the runaway solider?"}, {"rating": "6", "text": "The Beguiled is a rather simple film. It all takes place during the Civil War and most of the story occurs inside and around one mansion that is owned by a southern lady. She runs a school for young women within the mansion and as a result the only occupants of the mansion are women. One of the young women finds an injured Union soldier in the woods. They decide to help heal him instead of handing him over to the Confederate patrol, and things start to get a bit tense as time goes on and he spends more time with the women. This film is well made and well acted, but at the end of the day it is the story that makes it come up short from being a great film, in my opinion. The entire film is setting up a rather specific scenario with the soldier. A decision that he will make that will shape the rest of the film, and honestly, when the time came it was a bit anti-climatic and from there on it was rather obvious the path the story would go down. I was reminded a lot of mother! as I was watching The Beguiled. I do think that this is a better film, but because it seemed like it was over an hour of building up for something that ultimately disappointed me...I couldn't help but think of mother! as the credits rolled.This isn't a bad film, but given a better story I do think it had the potential to be much better."}, {"rating": "5", "text": "Oh, I had great expectations for this one. The beautiful setting, gothic atmosphere and great cast was not enough for me to like Coppola's drama. I just felt numb."}, {"rating": "6", "text": "Beautifully shot and really well directed. The performances are all good, even if Nicole Kidman's southern accent slips into australian way too often.It does, however, feel very emotionally empty. Whatever emotion I was suppose to feel during certain scenes just wasn't there (the most emotion I felt was when Colin Farrell threw Henry the turtle). For a long time it feels like the story is going nowhere, until it takes a turn in the last thirty minutes, and even then it starts to drag.There's also one moment towards the end where one of the characters implies something, and I thought it was pretty smart how they managed to get the idea across in just one line of dialogue, but then the characters just proceed to explain very unambiguously what they're talking about, which was very disappointing.Still, the film is very well made and it definitley has a lot more going for it than againts it, it's just a shame that none of it will really stay with me."}, {"rating": "7", "text": "I found this film to be quite atmospheric and I was intrigued to find out more about the wounded soldier who is taken in (Corporal McBurney, played by Colin Farrell). The film is almost entirely in very dark settings, so its best to watch it with curtains closed, or you may struggle to see all of whats going on, on screen but I thought the script was good and it somehow made it feel more mysterious and atmospheric overall.I liked how the teacher, Miss Martha (played by Nicole Kidman) reacted/responded to the new found occupant of the house, the way she used the situation to make her students reflect on what they may have learnt from the situation and so on. I suppose its partly about trust - trust and secrets. Its an intriguing and atmospheric watch - one that I'd recommend to others."}, {"rating": "1", "text": "Wow, this movie was terrible. The trailer itself spoiled LITERALLY EVERY plot point. Such a boring story where nothing interesting ever happens."}, {"rating": "6", "text": "Okay.The trademark Sofia Coppola production values are there, but some of acting is a letdown as is the story at times."}], "recommendations": ["allied", "the_good_shepherd", "you_were_never_really_here", "a_most_violent_year", "the_rover", "bad_times_at_the_el_royale", "sicario_day_of_the_soldado", "prisoners", "reminiscence", "widows", "the_woman_in_the_window", "beirut", "hugo", "thoroughbreds", "nocturnal_animals", "the_machinist", "the_american", "good_time", "a_history_of_violence", "the_place_beyond_the_pines", "wind_river", "no_country_for_old_men", "the_killing_of_a_sacred_deer", "127_hours", "the_light_between_oceans"]}