{
  "id": 2621,
  "title": "The Little Mermaid",
  "starring": [
    "Halle Bailey",
    "Jonah Hauer-King"
  ],
  "runtime": 0,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy",
    "Romance"
  ],
  "description": "The youngest of King Triton’s daughters, and the most defiant, Ariel longs to find out more about the world beyond the sea, and while visiting the surface, falls for the dashing Prince Eric. With mermaids forbidden to interact with humans, Ariel makes a deal with the evil sea witch, Ursula, which gives her a chance to experience life on land, but ultimately places her life – and her father’s crown – in jeopardy.",
  "releaseYear": "2023",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ym1dxyOk4jFcSl4Q2zmRrA5BEEN.jpg",
  "categories": {
    "plot": 7.571428571428571,
    "acting": 7.75,
    "ending": 7.0,
    "soundtrack": 9.8,
    "cinematography": 8.5,
    "familyFriendly": 6.666666666666667,
    "funny": 9.4,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Yo this movie is TOTAL TRASH. It is sexist, weirdly violent, and lacks any and all character development. The kissing song is weird and creepy. I would never let my kids watch this film. I LOVE Aladdin, Beauty and the Beast, Tangled, etc. but this movie is super cringe. The first 20min were OK but then it just straight up face plants and never recovers. How the hell did this movie get released and wtf are ppl smoking that they consider it \"their favorite.\""
    },
    {
      "rating": "3",
      "text": "A cute little cartoon with a completely different message from the original text.  As I child I read the story.  Sadly children today will think this is the story.  Why don't parents read to their children anymore?  Electronic babysitters are no replacement for parents.  Read to the children."
    },
    {
      "rating": "10",
      "text": "The Little Mermaid is one of my top 5 favorite princess movies, one of my top 10 favorite romance movies, one of my favorite Disney and animated movies, one of my favorite musical movies, and one of my favorite movies of all time. The soundtrack is stupendous especially the songs Part of Your World, Under the Sea, and Poor Unfortunate Souls. The soundtrack is one of my top 10 favorite animated movie soundtracks, one of my top 10 favorite Disney movie soundtracks, and one of my favorite movie soundtracks of all time. The animation was terrifically beautiful. The voice over performances were fantastic especially from Jodi Benson, Samuel E. Wright, and Pat Carroll. An A+ animated movie."
    },
    {
      "rating": "5",
      "text": "Un clásico, de eso no hay duda, pero todo gracias a personajes como Úrsula y Sebastián, porque la sirenita es la princesa Disney mas pelotuda de todos los tiempos."
    },
    {
      "rating": "7",
      "text": "not so little, not so fictitious..The Little Mermaid3 And A Half Out Of 5The Little Mermaid is a Disney Animated feature that focuses on gender equality and the conflicts that it may breed whilst grasping the policy. As always, the animation features are finely detailed and covers up their trajectory of the character with an elaborative plan that is exhilarating and just pure fun to encounter. It is rich on technical aspects like songs, background score, editing and cinematography of the animation that is created with thought-provoking ideas implanted wisely that speaks about the characteristics of its three dimensional characters. The script is gripping and engaging, offering each and every individual character enough range and room to factor in effectively and leave an impression. The writing is strong and smart as it doesn't install humor just to draw in more viewers and instead lets the storyline flow independently which is the primary reason why it can go intense and still be bright, light and breezy. The underwater world depicted in here has gone through various tests and thoughts that is clearly visible on screen and helps lure its younger audience in easily and gets them hooked within first few minutes of the feature. The Little Mermaid is not so little, not so fictitious due to its pragmatic three dimensional character along with a nail-biting plot track that helps keep the audience on the edge of the seat."
    },
    {
      "rating": "6",
      "text": "Great story and characters but l have the feeling this movie is a bit overrated, 88 metascore for this? you have to be kidding."
    },
    {
      "rating": "10",
      "text": "I also recommend the TV series, but not the sequel. I still think that Tarzan is the last great Disney movie, but pretty much everything else after lacks the magic that Disney once had, as far as I'm concerned.(with the exception of the surprisingly good Fantasia 2000, Bambi 2 and Emperor's New Groove) 10 years ago, this was one of my all-time favourites. I remember, every time I went swimming, I felt really inspired to be a mermaid. That's the effect this movie and the TV series had on me. The animation is absolutely gorgeous, especially the underwater scenes, and the storm. The script is intelligent and witty, and everyone involved did a marvellous job putting it across. The songs are fantastic, as always with Alan Menken. In fact, the only score of Alan Menken's I don't like is \"Home on the Range\". My favourites are \"Part of your World\"(my sister is always singing it around the house) and the wonderfully energetic \"Under the Sea\". The characters are probably the most memorable in a Disney movie, especially Ariel, a beautiful and feisty mermaid, with a dream of being a human. She has a beautiful voice also, well we have the talented Jodi Benson to thank for that. Sebastian is so funny here, a he was in the series, but as well as Flounder(another great character)he was ruined in the sequel. Kenneth Mars's Triton is an inspiring father-figure, who reminds me of my grandfather. The best character is without question, Ursula, who scarred me for life after watching her. Likewise with The Evil Manta from the series. Whilst her song is probably the least memorable song of the movie, it still works. Flotsam and Jetsam are also really creepy. Miles better than Ursula's really bland sister Morgana at any rate.To round off, I can't forget Louis the chef. He is so funny here, unlike in the sequel, where the same joke was repeated but badly underplayed. I can't believe some people hate this movie. It is one of Disney's best along with \"Beauty and the Beast\", \"Lion King\", \"Snow White and the Seven Dwarfs\" and \"Sleeping Beauty\". Highly recommended for all ages. 10/10. Bethany Cox"
    },
    {
      "rating": "10",
      "text": "So Disney was continuing making one of his greatest gems like he did with the first Disney classic Snow White and the Seven Dwarfs, Fantasia, Bambi, Cinderella, Lady and the Tramp, 101 Dalmatians and The Jungle Book. That's one of Walt Disney's greatest works. The audiences love his magical gems and magic come to life. Magical story's and animation the whole family to enjoy again and again.This is one of Disney's continued works and the reason I said that is because Walt wanted to feature length films that can grow audiences big, I mean really big! He wanted to make the songs so memorable and so catchy and Alan Menken is the one who made the songs so beautiful, compelling and catchy and it really makes the animation so amazing. The songs Part of your World, Under the Sea and the one that got me excited and gripped is Poor Unfortunate Souls. Ohh, and also the french song which really makes me laugh just like other songs from Disney classics. The characters however are memorable, the disney princesses again continued, they'll be continued after I finish The Little Mermaid. The villain is so brilliant, Ursula has the power of Ariel and these people who she called them like I mentioned before Poor unfortunate souls. Jodi Benson is the main voice of the disney princess Ariel. She wanted to be in the human world but her father forbids her to go out there alone because it's dangerous but found a true love of her life called Eric. Flounder and Sebastian are the side characters with Ariel. The chef is hilarious and Sebastian is scared of him cause he cooks fish and crabs and Sebastian escapes from the chef before he cooks him. Now that's slapstick. The animation continued to be brilliant and fresh just like all animation is.That's all I gotta say about it. I think my remembered Liam and Jacob quoting from it so that's why I doing the next Disney animated feature. Enjoy!"
    },
    {
      "rating": "10",
      "text": "The Movie That Saved DisneyThe Little Mermaid isn’t only special because it was an absolutely amazing film, It’s also because it saved a struggling Disney."
    },
    {
      "rating": "10",
      "text": "This is one of Disney's great animation classics, released at a time when the studio has made some productions of great popular impact and critical acclaim. The story is very much based on a tale by Hans Christian Andersen about the impossible love between a mermaid and a human prince. I don't think the script is really worth mentioning, given that it is widely known, not only by admirers of fairy tales, but even by those who have never seen the film or read Andersen's tales.The film has a good set of actors who provide us with an excellent voice work. Personally, I would like to highlight the contributions of Jodi Benson, Kenneth Mars, Pat Carroll, and Samuel Wright's deep Caribbean accent. Some characters in the film become so popular that they were used not only for merchandising, but also for the Disney theme parks. This is the case of the protagonist, Ariel, one of the most iconic Disney princesses ever. Ursula is often singled out as an excellent villain, and she actually deserves that, but I can't look at her without seeing her as a kind of adaptation of the Bad Witch from “Sleeping Beauty”, with a Mephistophelian touch.The film was beautifully designed, and the animations are of high quality, one of the best the studio did before massively abandoning traditional animation and converting to digital. The colors are vibrant, the film is bright and beautifully edited, it never seems to drag or take longer than necessary. In addition to all this, the film has one of the best soundtracks that Disney has conceived, signed by the master hand of Alan Menken and worthy winner of the Oscar for Best Soundtrack in 1990. Although everyone talks about “Under the Sea”, a mellow, tropical melody that won the Oscar for Best Original Song this year, I honestly prefer “Part of Your World”, but that's my personal taste."
    },
    {
      "rating": "7",
      "text": "La Sirenita a diferencia de otras películas clásicas de Disney no intenta aspirar a mucho. La historia es bastante simple pero funciona, lo mismo con la comedia y las canciones. Lo que si que noto es que la relación entre Ariel y el príncipe es muy forzada, pareciendo mas un enamoramiento a simple vista; no me termino de convencer. Y Ursula yo no la consideraría una de las mejores villanas de Disney como muchos dicen, ya que a diferencia de otros grandes villanos de Disney malvados por tener ansias de poder como Jafar por ejemplo, aparecen en toda la película teniendo la misma relevancia que el protagonista, ademas de tener mucho mas trasfondo en la historia, contrario a Ursula que aparece un poco después de la mitad y no aporta mucho mas a la trama. Quitando eso y muchas otras mejorables es una buena película, todos los elementos que introduce serán simples pero la gran mayoría funcionan. La recomiendo, pero al menos yo no la consideraría de las mejores de Disney."
    },
    {
      "rating": "10",
      "text": "One of the most memorable Disney Classics. .. The Animation,  The Songs , The Soundtrack , The Flashing Lights Everything About This Movie Is Unique"
    },
    {
      "rating": "7",
      "text": "Ariel is a 16-year-old mermaid princess in the kingdom of Atlantica, in the Atlantic Ocean. She is fascinated by the human world above. She ventures out with her best friend Flounder to collect human artifacts in her grotto and often goes to the surface of the ocean to visit Scuttle, a seagull who offers inaccurate knowledge of human culture. She swims back to Atlantica and is watched by two eels named Flotsam and Jetsam under orders from Ursula the sea witch. Ariel ignores the warnings of her father King Triton, the ruler of Atlantica, and Sebastian, a crab who serves as Triton's adviser and court composer, that contact with humans is forbidden.One night, Ariel, Flounder, and an unwilling Sebastian travel to the surface to watch a celebration for Prince Eric's birthday on a ship. Ariel instantly falls in love with Eric. Shortly afterward, a violent storm arrives, which wrecks the ship and tosses Eric overboard. Ariel rescues him and brings him to shore. She sings to him but leaves just as he regains consciousness to avoid being discovered. Fascinated by the memory of her voice, Eric vows to find the girl who saved and sang to him; Ariel vows to find a way to join him in his world. Noticing a change in Ariel's behavior, Triton questions Sebastian and learns of her love for Eric. Triton confronts Ariel in her grotto and destroys the artifacts she collected with his trident. After Triton leaves, Ariel begins weeping. Flotsam and Jetsam convince her to visit Ursula.Ursula makes a deal with Ariel to transform her into a human for three days in exchange for Ariel's voice, which Ursula puts in a nautilus shell. Within these three days, Ariel must receive the \"kiss of true love\" from Eric to remain a human permanently. Otherwise, she will transform back into a mermaid and belong to Ursula. Ariel accepts and is given human legs and taken to the surface by Flounder and Sebastian. Unbeknownst to Ariel, Ursula, who harbors a secret vendetta against King Triton, plans to use her as a bargaining chip and take over the kingdom. Eric finds Ariel on the beach and takes her to his castle, unaware that she is the one who had rescued him earlier. Ariel spends time with Eric, and at the end of the second day, they almost kiss but are thwarted by Flotsam and Jetsam. Angered at Ariel's near success, Ursula disguises herself as a beautiful young woman named Vanessa and appears onshore singing with Ariel's voice. Eric recognizes the song and, in her disguise, Ursula casts a hypnotic enchantment on Eric to make him forget about Ariel and marry Vanessa instead.The next day, Ariel discovers that Eric will be married to Vanessa. Scuttle discovers Vanessa's true identity and informs Ariel, who immediately pursues the wedding barge. While Sebastian informs Triton, Scuttle disrupts the wedding with the help of various sea animals. Through all of the commotion the nautilus shell around Ursula's neck breaks, which restores Ariel's voice back to her and breaks Ursula's enchantment over Eric. Realizing that Ariel is the girl who saved his life, Eric rushes to kiss her, but the sun sets and Ariel transforms back into a mermaid. Ursula then reveals herself and kidnaps Ariel. Triton confronts Ursula and demands Ariel's release. However, the deal is inviolable; Triton makes a new deal to take Ariel's place as Ursula's servant by giving up his trident in order to save his daughter. Ariel is released as Triton transforms into a polyp and loses his authority over Atlantica. Ursula declares herself the new ruler, but before she can use the trident, Ariel confronts Ursula and attacks her, and Eric intervenes with a harpoon and hurts Ursula. Ursula attempts to kill Eric, but Ariel intervenes and causes Ursula to inadvertently kill Flotsam and Jetsam. As Ariel hurries to join Eric, the enraged Ursula uses the trident to grow to a monstrous size. Ariel and Eric reunite on the surface just before Ursula grows past and towers over them. She then gains full control of the entire ocean, creating a storm and bringing sunken ships to the surface. As Ursula is about to destroy Ariel with the trident, Eric steers a wrecked ship and kills Ursula by impaling her with its splintered bowsprit.With Ursula dead, Triton and the other polyps in Ursula's garden revert to their original forms. Realizing that Ariel loves Eric, Triton changes her from a mermaid into a human permanently and approves her marriage to Eric. At the wedding, Ariel and Eric marry on a ship and depart."
    },
    {
      "rating": "7",
      "text": "The Little Mermaid has got a decent animation, some very talented voice actors and a great story to keep you entertained."
    },
    {
      "rating": "6",
      "text": "Only seen this movie twice when I was a kid. It wasn't for me. So my review is not really that helpful I guess."
    },
    {
      "rating": "9",
      "text": "The Little Mermaid is one of my top 5 favorite princess movies, one of my top 10 favorite romance movies, one of my favorite Disney and animated movies, one of my favorite musical movies, and one of my favorite movies of all time. The soundtrack is stupendous especially the songs Pa"
    },
    {
      "rating": "9",
      "text": "Such a great film. The story is beautifully crafted and much more smart than it seems, although it might get predictable in the love aspects. Top quality animation, and characters that some of them aren't perfect, like Ariel and the seagull might be out of place, but this us surely an enjoyable watch."
    },
    {
      "rating": "5",
      "text": "A frankly overrated film, The Little Mermaid is a very cliché Disney flick, even for its time. The main character is a sulky brat who never learns her lesson, and gets undeservingly rewarded for the trouble she causes. Despite this, I do like the film’s soundtrack, and some of the side characters are entertaining."
    },
    {
      "rating": "6",
      "text": "The plot tends to fall onto the trite side for kids' romances, but I suppose it's a film meant more so to be (mostly) lighthearted, fun, and singsongy. No real harm in that for the wee little ones. \u2028It's a return to Disney of old to embark on a 1990's renaissance of the studio's 2D animation, albeit a predictable return."
    },
    {
      "rating": "7",
      "text": "ok but what is that **** shot on the metacritic home page of the little mermaid."
    },
    {
      "rating": "10",
      "text": "I love The Little Mermaid so much! I love mermaids, I relate to Ariel. I've heard how she seems to be autistic and I am to so that's interesting. Just a fanon (fan canon) nothing more."
    }
  ]
}