{
  "id": 369,
  "title": "The Parent Trap",
  "starring": [
    "Lindsay Lohan",
    "Dennis Quaid"
  ],
  "runtime": 128,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "Hallie Parker and Annie James are identical twins separated at a young age because of their parents' divorce. Unknowingly to their parents, the girls are sent to the same summer camp where they meet, discover the truth about themselves, and then plot with each other to switch places.",
  "releaseYear": "1998",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dNqgjqxHIdfsQRQL5XTujNfX9pj.jpg",
  "categories": {
    "plot": 8.5,
    "acting": 7.333333333333333,
    "ending": 7.5,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 8.0,
    "funny": 7.6,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Nancy Meyers' remake of the 60's hit seamlessly intertwines the hysterical and genuinely touching. Aided by a spirited ensemble, The Parent Trap is a 90s classic deserving of a rewatch at any opportunity."
    },
    {
      "rating": "5",
      "text": "Annoying cynical crud. Lohan is excellent, but there is not an honest moment in this film.  Syrupy music, two selfish parents who deprive the twins from knowing each other    I can excuse 8 year olds for enjoying Parent Trap, but anyone older who does, I'm guessing must believe in angels and the Easter Bunny as well."
    },
    {
      "rating": "10",
      "text": "This is a very very good movie. Lindsay lohan is a fantastic actress and she's now been in loads of movies.I'm not surprised."
    },
    {
      "rating": "6",
      "text": "Surprisingly decent remake with Lindsay Lohan doing a good job in the Hayley Mills role. Still not as good as the original, but very entertaining. Very enjoyable."
    },
    {
      "rating": "9",
      "text": "I love this film, it's been a favourite of mine since I was little. Natasha Richardson and Lindsay Lohan are both great in this film."
    },
    {
      "rating": "10",
      "text": "One of my favourite family films:) love it.. lindsay lohan was so great,,pity about the drugs but i still love her! Can't wait for her new album:)"
    },
    {
      "rating": "10",
      "text": "This film is so good."
    },
    {
      "rating": "10",
      "text": "Loved this remake. Cant beat the original but the new one is very enjoyable! I have seen it countless times and I'm 22.  Lindsay was so great as a kid. This being her first film and she took on split roles, I think its impressive. Not of a fan of her later work."
    },
    {
      "rating": "9",
      "text": "Likely Lindsay Lohan's crowning moment, The Parent Trap is one of the finest remakes in history. Memorable on numerous levels, even years later, you'll find yourself craving it."
    },
    {
      "rating": "9",
      "text": "An irresistibly pleasing movie in which its greatest accomplishment is in which laughs are continuous, and smiling is contagious. A truly great cast. Whether or not Lindsay Lohan will regain her career, this will be her greatest achievement."
    },
    {
      "rating": "8",
      "text": "This is a fairly good family flick and one I've seen a few times now growing up and it still has the same effect. Lindsay Lohan in her first major role before she went off the rails as well! I can't compare it to the original having not seen it, but it appears they have done a respectable remake here with a good line-up of actors and characters, with an eventful storyline that goes through quite a few stages (hence being a long film). Overall nothing groundbreaking, but a good film."
    },
    {
      "rating": "8",
      "text": "One of my childhood's most watched movies. I remember renting it from a video store. You should definitely   watch it if you haven't. 8/10 is my score"
    },
    {
      "rating": "7",
      "text": "\"The Parent Trap\" is a gorgeous movie. It's not unusual that familiar movies are good but \"The Parent Trap\" is one of few exceptions. In addition, it's a remake and remakes, seldom, are as good as original. Dennis Quaid and departed Natasha Richardson are great but Lindsay Lohan is best surprise in her presenting."
    },
    {
      "rating": "6",
      "text": "No doubt better then what I expected but still it is too happy and fun loving than it should be. It's a fairy tale that like many other Disney movies is enjoyable to watch. The acting performances are actually very well done. But this movie suffers from a long running time. In the end this movie is above average with a 62.6 out of 100."
    },
    {
      "rating": "5",
      "text": "The original Parent Trap was good, but the remake is only okay. It's not very inspired and doesn't bring anything new to the table. It's just the original with new actors and actresses."
    },
    {
      "rating": "10",
      "text": "I adore this movie! Lindsay Lohan is the perfect actress for both parts, she has the flair to be able give both completely different personalities and you actually do believe you're watching 2 different girls. The storyline is sweet and family orientated, and shows that there is hope in the world."
    },
    {
      "rating": "7",
      "text": "When I first heard there was a remake of the thoroughly enjoyable 1961 original, I wasn't so sure whether I wanted to see it. I did see it however, and I was pleasantly surprised. This film is really cute, touching and funny, with a wonderfully light tone; it isn't as good as the original but it is definitely one of the better remakes out there, and this is coming from someone who has seen her share of some truly awful ones(ie. Psycho and The Wicker Man-at least the latter had some entertainment value for the wrong reasons!).The 1998 film does have its small problems though. If you know the plot of the film already, you may find it formulaic and predictable here, I found it very original in the 1961 film, not so much here. Like the 1961 film, the film is a little too long, and it does play loose with some of London's geography and lifestyles.Flaws aside, what we do have is a light, funny, upbeat and touching film, elevated by a witty and snappy script, adept direction, gorgeous cinematography and scenery, a breezy soundtrack and of course some great acting. Lindsey Lohan had a lot to live up to, considering how outstanding Hayley Mills was, and thanks to some superb make up, she does a really good job in one of her better performances. Just for the record, she has done some good performances such as in this, Freaky Friday and Mean Girls, but she has also been in some mediocre to bad movies especially Get a Clue. Not only is The Parent Trap one of her better movies her dual role performance is one of her better performances too. In terms of supporting performances, Dennis Quaid is great as the father, very cute and funny and actually more at home than Brian Keith was I feel, while the late Natasha Richardson is drop dead gorgeous in this movie.Overall, just a delightful remake of a delightful original. 7/10 Bethany Cox"
    },
    {
      "rating": "7",
      "text": "The Parent Trap works as a remake. Bring in the many traps you can find so the Parent Trap can be trapped in a loophole so we can watch the movie forever!!!! Until lightnings come... and shut off your TV with your DVD/Blu-ray player. Movie's over, folks."
    },
    {
      "rating": "9",
      "text": "Amazing and almost perfect. The story was really good, and had funny actors. The ending was great, it was the best way it could end. It is for sure worth a watch, it is a great movie."
    },
    {
      "rating": "10",
      "text": "I absolutely love this movie! It has a nice story, an incredible soundtrack. Lindsay made a great work in this movie, on of my favorites, btw. Natasha Richardson was beautiful, and made the mom very well. A 90s classic."
    },
    {
      "rating": "10",
      "text": "Me encanto mucho la pelicula es mi infancia y muy simpática la actuación de lindsay lohan te amo"
    },
    {
      "rating": "10",
      "text": "Best Movie Ever !!! Loved Lindsay Lohan and the bond between Hallie and Annie !!!"
    },
    {
      "rating": "8",
      "text": "----------------------------------8.3/10-----------------------------------"
    }
  ]
}