{
  "id": 4756,
  "title": "The Promise",
  "starring": [
    "Oscar Isaac",
    "Charlotte Le Bon"
  ],
  "runtime": 133,
  "genre": [
    "History",
    "Romance",
    "Drama"
  ],
  "description": "Set during the last days of the Ottoman Empire, a love triangle develops between Mikael, a brilliant medical student, the beautiful and sophisticated artist Ana, and Chris, a renowned American journalist based in Paris.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iDWer2VFikupdqDc7d5sxCWZ3gW.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Cheesy, tacky, corny and thoroughly unbelievable (even by fantasy standards). Tse's rant about how Cheung's theft of a bun from him set him down on the road of evil is the most laughably ridiculous piece of crap ever spouted on screen."
    },
    {
      "rating": "1",
      "text": "Note that when it comes to Asian martial arts films, American critics tend to be more lenient because of its novelty, or the assumptions that the incoherent plot lines could be due to \"lost in translation\". So users should review the review and moderate it down a few grades to be objective. Especially so if you are familiar with this genre of film before it caught on with the west."
    },
    {
      "rating": "4",
      "text": "Don't believe the hype. While the story may be of interest to some, it is ultimately too cliche. That said, my biggest problem with this film were the visuals. Some of the effects are fine, but a majority are flat out bad. Consistency in the quality of effects would have made Kevin Thomas' quote about this being \"one of the most beautiful films imaginable\" valid. As it stands, this is not even close to Crouching Tiger, Hero, or Flying Daggers. Wait for video, if you must."
    },
    {
      "rating": "8",
      "text": "Very nice movie, by standarts of asian martial arts-fantasy movie. The plot is not so strong, but it is not the main thing. This movie is about bright fights, gods and legends. Light smooth moves, water and wind. Worth watching, if you like fights as in Crounching Tiger film."
    }
  ]
}