{
  "id": 4103,
  "title": "The Wackness",
  "starring": [
    "Josh Peck",
    "Ben Kingsley"
  ],
  "runtime": 99,
  "genre": [
    "Drama"
  ],
  "description": "Set in New York City in the sweltering summer, The Wackness tells the story of a troubled teenage drug dealer, who trades pot for therapy sessions with a drug-addled psychiatrist. Things get more complicated when he falls for one of his classmates, who just happens to be the doctor's daughter. This is a coming-of-age story about sex, drugs, music and what it takes to be a man.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u6CTOWpM2Se4rpuLfmlZUlBfs8N.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 5.555555555555555,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was my life. I love it! Josh did a great role."
    },
    {
      "rating": "8",
      "text": "Josh Peck delivers a stereotype-busting performance in The Wackness. He shows himself to be an actor versus a child star. Ben Kingsley is awesome as usual."
    },
    {
      "rating": "9",
      "text": "This movie is nearly perfect. Quiet, unassuming, and brilliantly true to itself. Outstanding on every level."
    },
    {
      "rating": "0",
      "text": "Vulgar, crude, dark, not funny and unredeeming; overacted, not funny. Did I say not funny? One dimensional characters stuck in a pointless and bad movie. Women are treated stereotypically and poorly. But, the popcorn was good."
    },
    {
      "rating": "7",
      "text": "Definitely not the parallel to Juno I went into the theater expecting it to be. But it had its moments, especially with the conflict concerning the integrity of an old man and the identity of a directionless teen, and was not a complete waste of time."
    },
    {
      "rating": "6",
      "text": "6 at best and being generous the kid was quite entertaining but ben kinsgley was a bit overdone in the role, my girlfriend loved it though thought ben was stupendous."
    },
    {
      "rating": "7",
      "text": "Not my kind of movie, but after seeing that Josh kid in his Nickolodean show, I was rather surprised at his ability to act. Guess can't judge without really seeing them try. OK movie."
    },
    {
      "rating": "7",
      "text": "The ice cart that Luke Shapiro(Josh Peck) pushes around the borough to facilitate his summer drug operation couldn't be a more conspicuous front. But the ice cart does work as a metaphor for Rudolph Giuliani's gentrification of New York during his seven-year reign as mayor, when the future 9/11 hero and presidential hopeful told all the Central Park hookers and drug dealers to go home like a real-life Travis Bickle. Percy(Method Man) went underground while a new wave of drug pushers ambled through the city undetected. A Tribe Called Quest's \"Can U Kick It?\", which contains a sample of Lou Reed's \"Walk on the Wild Side\", sounds primordial, as if the ghost of Martin Scorsese's New York(\"All the animals come out at night- whores, skunk p******, buggers, queens, dopers, junkies, sick, venal. Someday a real rain will come and wash all this scum off the streets.\") came home to roost and wondered where all the hookers in Central Park went. Even the drug dealers are different. Dr. Squires(Ben Kingsley) remembers a time when \"the man\"(\"I'm waiting for...\") was a popular dude. \"The Wackness\", a mid-nineties period piece, is about an unpopular pot dealer in therapy, who's in love the therapist's daughter, a girl that's way out of his league. \"The Wackness\" is \"The Sopranos\" meets \"Say Anything\", on pot. Pete Tosh was right: \"Doctors smoke it,\" too. Stephanie(Olivia Thirlby) sees things in terms of \"dopeness\" and \"wackness\". The film's dopeness can be attributed to Joshua Peck's natural performance as a shy kid who hides his emasculation behind the swagger and machismo of rap. Thank god he's not into Morrissey, or else Stephanie would never have f****d him. Luke's relationship with the pothead shrink is schematic and overfamiliar, save for the fact that he's a hilariously bad mentor. But there's wackness, too. The film spends an inordinate amount of time on the doctor's marital problems. Sometimes \"The Wackness\" forgets who the main character is. It should be about an ordinary person, not \"Ordinary People\"."
    },
    {
      "rating": "6",
      "text": "The acting is terrific, but it is a rather dreary story. Well written, nicely edited and directed. The characters are well developed. I can't see how on earth this can be classified as a comedy."
    },
    {
      "rating": "4",
      "text": "It was enough to vaguely keep my interest, but just flailed around mostly. If you manage to get through the boring stuff, the end actually lifts it slightly. It's a long uninteresting trip though. Some decent retro editing and lighting and acting is decent for what the actors were given to go off, but overall, another example of an indie film which comes off as slightly pretentious. Shouty intense Josh Peck just reminds me of his Drake & Josh days too unfortunately."
    }
  ],
  "recommendations": [
    "young_adult",
    "you_again",
    "silver_linings_playbook",
    "blow",
    "something_borrowed",
    "cruel_intentions",
    "last_vegas",
    "the_boss",
    "meet_dave",
    "monte_carlo",
    "little_monsters",
    "bride_wars",
    "big",
    "don_jon",
    "the_town",
    "as_good_as_it_gets",
    "morning_glory",
    "the_intern",
    "wanderlust",
    "going_in_style",
    "sky_high",
    "along_came_polly",
    "the_hustle",
    "13_going_on_30",
    "the_holiday"
  ]
}