{"id": 4808, "title": "The X Files: I Want to Believe", "starring": ["David Duchovny", "Gillian Anderson"], "runtime": 104, "genre": ["Drama", "Mystery", "Science Fiction", "Thriller"], "description": "Six years after the events of The X-Files series finale, former FBI agent Doctor Dana Scully is now a staff physician at Our Lady of Sorrows, a Catholic hospital, and treating a boy named Christian who has Sandhoff disease, a terminal brain condition. FBI agent Drummy arrives to ask Scully’s help in locating Fox Mulder, the fugitive former head of the X-Files division, and says they will call off its manhunt for him if he will help investigate the disappearances of several women, including young FBI agent Monica Banan.  Mulder and Scully are called back to duty by the FBI when a former priest claims to be receiving psychic visions pertaining to a kidnapped agent.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/s3x7CZO7gCICKQkA5rSgorkJzYy.jpg", "categories": {"plot": 5.943396226415095, "acting": 7.1, "ending": 5.571428571428571, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.666666666666667, "funny": 5.0, "action": 4.714285714285714}, "reviews": [{"rating": "3", "text": "The television series of The X-Files is now a dvd collectors set in a huge boxset containing series 1-12 or something silly like that, there's at least 10 seasons in all or more. Anyways there's also the 1998 X-Files movie starring Gillian Anderson and David Duchovny which was good.... The X-Files: I Want to Believe see's the return of Mulder (Duchovny) and Scully (Anderson) as FBI agents since their last film made in 1998... However this one is made in 2008 by director Chris Carter and I've only seen The X-Files: I Want to Believe once and to be honest I don't remember the story and became confused whilst watching it what was actually going on. All I remember was a horrible story and horrible film making and a rubbish addition and an insult to The X-Files because this movie was really bad and possibly one of the worst films I've ever seen in my life. Disappointing."}, {"rating": "7", "text": "A movie that falls short of the high expectations one can imagine would be placed on a X-Files movie by its fans, but as a typical crime thriller it is decent enough to earn a 7 or so. The movie would have benefited from a bigger plot line... a governmental conspiracy or something, but instead decided to take a simple black market approach with a tiny bit of religion mixed in. Reading some of the reviews I anticipated a boring love story between Mulder and Scully, but really their relationship was merely probed in an unusual way in that we skip by the awkward tense unexplored romantic relationship in the TV series and skip right to the sex apparently. Yet, I'm still not sure exactly what their relationship was in the movie. Weird."}, {"rating": "7", "text": "I can see everyone's problem with this film. When something carries a cult name like X-Files people expect a certain degree of escapism and adventure as in the first film and this unfortunately hasn't happened here. The film stands quite well individually (if without the X-Files name). Had this been made without the necessary cast and certain personnel this could have easily been passed off as another crime thriller with a couple of character name changes. In short this was a good film not great but but good, even though I missed the little green men"}, {"rating": "10", "text": "I just saw the first showing of this film. It's fantastic. No BS. I was shocked at how well it managed to capture and distill the essence of the show. There are a few plot holes but never mind that. Go see this film... it's refreshing to see a summer movie that leans more on character then FX. I give it 3 thumbs up."}, {"rating": "7", "text": "A fully realized and executed movie - dont read the 'main-stream' reviews. DD & GA were very good in the reprise - very good performances. X-Files fans will NOT be dissappointed. It's to bad this movie so was long in the making - if there is never another X-files movie - this was a fully realized close to the TV series. Well done - all involved!"}, {"rating": "9", "text": "Wow. I don't think these critics saw the same film I did. The one I saw was a suspenseful, restrained and mature slice of these two characters' lives. I do think that the filmmakers made a fans' movie, despite their attempt to make a movie for everyone. But I'm a fan, and I got -- not what I wanted, but something surprising and satisfying."}, {"rating": "9", "text": "I loved it! Above all, it reminded me why I fell in love with this show in the first place. I think I'll start rewatching the series now :)"}, {"rating": "1", "text": "after the first 30minutes the only thing that was keeping my eyes open was the need for eating some popcorn"}, {"rating": "3", "text": "Did not like it! It was cool seeing Mulder & Scully back together again, but the story??? They couldn't pick a better premise then that? Well, at least we will always have the show..."}, {"rating": "6", "text": "It had quite a lot of hype to live upto, and i feel it didnt quite live upto expectations. But sayign that, it was enjoyable, well acted, quite funny at times and quite an unexpected story line. Although in terms of the show, i feel a mising FBI agent was a small reason for the FBI to forgive all his \"sins\" and ask for his help. Help against pending alien invasion might be more appropriate. I'd count it as a slightly better than average episode, but not amongst the classics. But overall.. still worth watching."}, {"rating": "5", "text": "Umm.... they did what with people :o i enjoyed it and it was a nice watch while waiting for step brothers to come on but I can almost promise ill never re watch it, one time was enough."}, {"rating": "0", "text": "In I want to believe the writter need to go back an do rewrite your audience was expecting an Alien of some type not a rehash of Frankinstein. I'm not wasting my money on another Mulder & Scully. The writer needs more excitement."}, {"rating": "1", "text": "As a long time fan of the show, I was incredibly upset and disappointed when I walked out of the theater after seeing this movie. It was like they spent 10 years building up an intricate story arc that finally culminated in the series finale, and the first X-files movie even played into that storyline, but then for some reason many years later they just decided to ignore all of that and make a mediocre 'monster of the week' episode into a full movie. And it wasn't just that the movie didn't tie into the main story arc of the television series with the alien invasion and government conspiracies either, but it was that the movie even ignored the many years of character development and the evolution of Mulder and Scully's personalities in favor of just going back to the original scenario where she is a 'skeptic' and he is a 'believer', even though that isn't the way things were at all when the series left off. I have no idea what they were thinking when they made this movie, but as a fan of the actual series (which this movie clearly had little to no connection to), I wish that X-Files: I Want To Believe had never been made."}, {"rating": "6", "text": "I had high hopes for this film, but this was just an extended episode of X-files, and not a particularly interesting one. I found it very predictable and unimaginative. Still worth seeing."}, {"rating": "9", "text": "I wish Chris Carter had decided to return to the alien invasian storyline, but nonetheless, this film is getting a raw deal from the critics. The plot turns slightly sloppy in the second half, but it's a great character study and the concept of faith in its many forms is central to the film and explored very well. I agree with someone else who said that many of the reviewers have only a passing knowledge of the tv show. If they had done their homework, they'd know that this movie pays tribute to the Mulder Scully relationship -- which was the driving force of the show, anyway. I sincerely hope that the movie brings in enough at the box office for Carter to return for a third movie -- he has been saying that the third one will deal with the alien invasion, and it's a resolution that they fans deserve and that a new generation of fans could really latch onto."}, {"rating": "2", "text": "This movie is so inconsistent,boring and the dialouge between scully and mulder just reeks of boredness."}, {"rating": "6", "text": "A fairly good movie, with a decent cast, but not a very powerful story to go with it. overall its worth the watch."}, {"rating": "2", "text": "How was this an X-File? Rarely have I seen a suspense film with so little suspense or a thriller with so few thrills. But what hurts must is a sci-fi with zero science. It wasn't fun, it wasn't creepy (I take that back, Billy Connelly, the ex-priest was creepy), and the plot makes no sense. --[spoilers]-- What happened to the missing FBI agent? Why is Sculley using Google to learn about a procedure she's performing the next day? What was the point of the chase into the construction site?If the villian had taken Amanda Peet with him, the scene might have made sense. Can anyone explain why Sculley and Mulder had no chemistry? Is it because we see the moment of intimacy so early? It's almost like Chris Carter didn't expect fans of the TV series to watch the movie."}, {"rating": "7", "text": "Only Scully(Gillian Anderson), and Scully alone, can broach the subject of Mulder's sister to the ex-FBI agent. Fearing that Mulder(David Duchovny) may still be feeling the effects of cabin fever, Scully orientates him to the here and now, so when he leaves with the field agents to help locate a missing girl, it doesn't turn into a wild goose chase, conducted on synchronous time. Because Mulder loves Scully, no offense is taken by her implicit suggestion that he possesses an omnipresent mind. And because Scully is probably the most important person in Mulder's life, he lets the obvious go unspoken; that Dana Scully's return to practicing medicine is the act of a tortured soul. Mulder, he knows. He's been there. He's still there. Since \"The X-Files: I Want to Believe\" knows its characters intimately, fans surmise that Dana is seeking the approval of her father, albeit posthmously. In an episode from Season One called \"Beyond the Sea\"(featuring a great performance by Brad Dourif), Scully loses her father, and is aggreived by his unspoken disappointment that her departure from the medical profession in order to join the FBI caused him great consternation. She wants out. She wants to remain in the light. So Mulder goes into the darkness alone, but Scully is his dark light, and Mulder is hers. To quote Michael Corleone in Francis Ford Coppola's \"The Godfather: Part III(I Want to Recast my Daughter's Part)\", \"Just when I thought that I was out, they pull me back in.\" Thankfully, \"The X-Files: I Want to Believe\" is smaller in scale than the first film. Throughout its nine-year run on the Fox network, we saw enough signs of alien life and government conspiracies. Signs of love, that's what longtime fans want."}, {"rating": "9", "text": "Chris Carter did what he knows best, write a good x-files episode. He reminds us that we don't need endless explosions and gun fights to make a good thriller. Overall very enjoyable."}, {"rating": "10", "text": "Great movie. It's didn't assume the audience was stupid. The only thing I thought was stupid was a medical doctor using Google for stem cell research."}, {"rating": "0", "text": "Any way you slice it, this movie is a disaster from top to bottom. The one good part that even the scroogiest of critics point to is Gillian Anderson's performance. Yes, it's fine, but when one is working with such a god-awful script, who cares? The banter is muddled at best, and the plot is a pale imitation of the show's lamest of episodes. But none of that would matter if something -- anything -- worked. Yet it's doesn't. [SPOILER ALERT] Everything, including the chiming of the theme when a picture of George W. Bush is seen outside an FBI conference room (which made me say aloud in the theater, \"Well what the hell did THAT prove?\"), is ham-fisted in a way that makes \"Walker Texas Ranger\" look like first-rate drama. And giving Skinner three lines (the second of which is a repeat of the first) is beyond hokey; why bring Mitch Pileggi back at all if that's all you were going to do? \"I Want To Believe\" doesn't ruin the show's legacy; most of those episodes are still insanely watchable a decade and a half later. But, like the Twin Peaks flick \"Fire Walk With Me,\" though it has the same characters, the writers apparently lost the plot somewhere, and this version is yet another piece that proves \"Star Trek\" was about the only show that was ever able to make the leap from small-screen sci-fi to big-screen action and not totally suck."}, {"rating": "1", "text": "As some user said: It just ruined one of my favourite shows! I havent felt any mystery or thrills or any interest to what went on during the movie. But I expected to the very end that there would be some kind of twist that will turn this simple story about a Russian (I'm russian and they spoke no russian) psyho-doctor. One of the worst movies of the year, unfortunately..."}, {"rating": "6", "text": "My problem with this movie is that it did not involve an x-file. I realize the department was shut down, but that doesn't mean paranormal events have stopped happening. If the story revolved around an x-file that happens to threaten a member of the FBI, that could have pushed it up a notch. I'm okay with the fact that it does not involve aliens, but something extraordinary would've helped. or keep this plot, just don't drop \"X-Files\" into the title of the movie . . . it's misleading. great to see mulder and scully again though!"}, {"rating": "8", "text": "I'm a long-time viewer of the series, and was depressed at seeing the show decline quite a lot after the 1998 film, especially the mythology. The stand-alones never held my interest, except the psychic ones, because I never cared for being scared. The mythology episodes had more to them: there was a depth of complicated, yet sometimes mysterious, relationships between Scully and Mulder and the human conspirators. So, the mythology basically ended brilliantly with Season 6's \"Two Fathers\"/\"One Son\" and Season 7's \"Sein Und Zeit\"/\"Closure\", but the series generally lacked the quality of Seasons 3 and 4, and what really became obvious was that Mulder and Scully's dynamics were stale from Season 6 on; they tried to throw in comedy to give them something new, and there were a few good episodes, which surpassed the over-rated Season 1. However, Season 7 was a total failure, except the afore-mentioned episodes. Though Season 8 added some new dynamics with the introduction of Doggett and a few of the new mythology stories were fun, it wasn't consistent enough, and Doggett often played a more stubborn, working-class Scully. As I wrote in a Season 9 review, \"the characters moved through the dramatic motions in so formulaic a manner, lacking clear motivations, while the stories lacked real plot; scenes and dialogue felt stretched out on purpose. The mythology had become a caricature of itself, employing mystifying dialogue and pointless confrontation to put nothing substantial across, but to serve as ends in themselves.\" So, anything that avoided the formula of Scully and Mulder's dynamics would have been a bonus. How many times would Scully contemplate whether Mulder's quest was hers? How often would Mulder feel guilty about that fact and go off on his own? How often would they suspect Skinner? How often would some physical trauma happen to Scully causing her to feel victimized? How often would the X-Files be closed or Mulder and Scully kicked out of the FBI? More importantly, how often could the themes of faith, trust, and paranoia be used with any freshness? The first film was a failure as a mythology story because it tried to work as a standalone but without all the aspects that made the mythology so effective -- the built-up fascinating characters and their loaded histories with Scully and Mulder and the various theories of what the main characters had seen so far. After the series' best mythology episodes in Season 5's \"Redux II\", \"Patient X\" and \"The Red and the Black\", viewers were greeted with a fairly shallow story. The X-Files was never as much about revelations as about the dramatic interaction of the main characters with the recurring ones like CSM and Krychek, but they were either absent or stripped of any meaningful dialogue. There was also such a self-conscious attempt to dumb things down for excitement purposes: the explosions, the silly bees, the spaceship at the end -- the last of which was never really explained. Granted this film had a pretty lame suspense quotient and misused Callum Keith Rennie, who is magnificent in Battlestar Galactica, and just wasn't very exciting here. Part of this also stemmed from the low key nature of the story. I have to admire how Carter abandoned all the shock and awe of the previous film and shallow copycats like J.J. Abrams, who is just an awful, superficial producer. Mulder and Scully were on the run from the FBI at the end of the series, so to just have them back in with guns and resources would have been pat. The story was trying something new in having them on their own and they had to rely on basic resources like no guns and Google.com. Carter has also often said that real fright comes from the everyday. So, a collision in daylight with a snow-shovelling truck becomes a terrifying abduction. At least that was the idea. I could admire his restraint the same way I did Bryan Singer's attempts to tone down a super hero story in \"Superman Returns\", even though they both failed in some ways. However, for all the lack of thriller action, the movie was really about the relationship between Scully and Mulder, and I was surprised at how fresh the dialogue was and how new the turns in their relationship were, showing how it had grown. Mulder no longer spoke in cheesy stock phrases about how \"the truth is out there\" (something ardent early seasons' fans forget he did a lot in Seasons 1 and 2, when the dialogue was often poor). There was a subtlety to the ever-present themes that rejuvenated them, and my fear they had been tired out was put to rest. Also, Scully was given a dignity she hadn't known in a professional sense before in that she actually kept her job in the end. In addition, there was an attempt at moral complexity in Billy Connelly's character. Finally, the tender moments and the excellent dialogue between Mulder and Scully were wonderful to see, and was really the most important aspect of any X-Files movie I was going to watch. Truthfully, their drama felt more real than the relationship between the two leads in \"Atonement\", although admittedly what made that film great was the outsider sister. Yet, if this had been a film by Anthony Minghella and not The X-Files with lots of superficial critics' stock expectations, it would have gotten better reviews. I'm not saying it's an 'A' film, but what Chris Carter has attempted and succeeded at in the intimate drama and dialogue is quite an accomplishment, especially for a sci fi franchise that built its audience on spooks and scares, and is now not simply using drama as a breather between action scenes like most of Hollywood. 7.5 out of 10"}, {"rating": "2", "text": "Very disappointing. I am so OVER the X-Files now. Chris Carter has totally killed off (not literally) Scully and Muldar with a tired script, lame dialogues and a plot that destroys our enjoyment of what they once were to viewers: instead of fresh, funny and odd, Fox and Dana are now middle aged tired and weird. This was a waste of talent, money and time all the way around."}, {"rating": "10", "text": "Very nice movie, but it feels a bit too much as a stretched episode of the series.Maybe be a bit too slow for the popcorn eaters that hungers for non-stop action."}, {"rating": "7", "text": "Good fun and worth watching for an X-files fan; think of it as a long episode that's well acted and written and you won't be disappointed. Mulder and Scully are still great on screen together."}, {"rating": "9", "text": "Okay... let me tell you something...that x files movie was awesome! I didn't want to take my eyes off of the screen the entire time. I've loved the show ever since I first saw it about three years aqo. Even if you haven't seen the show, you could probably still follow the story line. The whole plot centered around a series of abductions and a so- called- psyhic the FBI was depending on to help them out. Although Mulder and Scully's lives had led them away from their former jobs as FBI agents, they get tangled up in the business of the abductions. Real psyhic? Abducties murdered? Who was responsible? ....well, I'll just let you figure that one out for yourself. If you're a fan of the paranormal, unexplained events, or just plain out murder mysteries, I would strongly recommend this movie. It will surely have you on the edge of your seats! I'm really hoping for a sequel!!"}, {"rating": "0", "text": "By far, the worst movie i've seen all summer. slow. boring. i disliked all of the characters. just plain bad."}, {"rating": "3", "text": "A Pedophile priest that has visions but he misses two important visions"}, {"rating": "3", "text": "All that suspense, secret script and plot lines, just for that!! The story-line pales in comparison to the classic episodes of series' 1-5. The dialogue between Mulder and Scully was dull and there is no chemistry between them. Back in the good old days these characters had fun, but no more. I almost fell asleep and I left the cinema quite depressed. I wanted scary monsters, Scully's scepticism, Mulder's enthusiasm and some characteristic witty repartee. Both Anderson and Duchovny looked tired and bored. As a fan of the show I was very disappointed indeed and I will be trying my best to wipe the memory of the film out of my mind, although I'll never be able to get that 2hrs of my life back."}, {"rating": "8", "text": "I liked this suspenseful film a lot. The script is very good as are the performances of the Scully and Mulder characters. This movie deserves a bigger audience and hope people will take a chance and go see it. I mean just how many times can you see TDK before one becomes bored."}, {"rating": "10", "text": "I love them.... And I'm very happy with the movie."}, {"rating": "9", "text": "A well acted film including the right actors and actresses, followed by a serious thriller plot whilst bringing a new feel to the X-files, justifying the choice for a movie. There are fitting cameos and star performances blended well into a simple yet engaging adult storyline."}, {"rating": "0", "text": "I found more pleasure in counting the little lights running up the isle of the theatre. This movie was gruesome and boring. If Molder and Skully had been killed off in this movie, I think we all would have cheered at the end. If this movie was supposed to make us \"believe\" they were romantically involved, it was more like watching a brother and sister kiss. Sickening and no chemistry between them through out the movie. Keep your money ! ! The story sucks. The most exciting scene was a foot chase for God sake with some hyped up music."}, {"rating": "3", "text": "What a let down. There's nothing X-files in this movie besides Mulder and Scully. Where are the government conspiracies? Where are the sci-fi mysteries? where are the godamn aliens? It's really sad that they released this movie after such a long wait from the fans for a Great X-files come back, they completly missed the mark with this sub-par crime investigation type of movie barely worthy of your average CSI tv show."}, {"rating": "8", "text": "A good movie for X-Files fans... you won't find aliens and conspiracies in it but C.Carter decided to explore and focus on the other great theme of the X-Files TV series, that is the Mulder/Scully relationship. A more complicated and intricated plot would probably have diverted attention from what Chris [Carter] and Frank [Spotnitz] thought had to be the heart of this movie. It's a good old school thriller, surely not as bad as someone is describing it."}, {"rating": "0", "text": "I hesitated seeing this film in the theater, since I was already put off hearing that it's considered a stand alone plot. I waited until last night and rented it. Growing up with the show, by owning and watching every episode countless times and liking the first movie. Even wanting to look like Dana Scully, but have Fox Mulder's \"believe\" drive, I was completely brokenhearted when I watched this piece of garbage, X-Files: I Want To Believe. I didn't see the Scully I knew with short bright red hair. She didn't even have her \"move over. I need answers NOW!\" drive. For the first quarter of the movie, Mulder looks like a mountain man with his beard. Who the HELL are these people? They weren't even in character. Then the movie goes on and on with some perverted weirdo with physic abilities. LAME! No drama. No conspiracy. No X. No nothing. It dragged on so much and was so bad that I kept on fast forwarding the movie. And just when you think something is about to happen to the only person in this movie who is in peril. Scully and Skinner burst in but almost without effort and/or lack of surprise. I lost so much respect that I almost can't watch the X-Files seasons that I own anymore. And they were so good that I was actually afraid to go to bed at night thinking that there's an alien or something in my room. But since I watched this horrible movie, I have to laugh sadly knowing that these two characters will never be idolized by me and my fond memories of watching the show anymore. I want to believe that I never saw this."}, {"rating": "5", "text": "Where was the \"X\"? I thought the X-files was supposed to centre around the paranormal yet that aspect wasn't even a sub-plot. It was a sub-sub plot. As a crime thriller it was an okay film (hence the 5) but it was supposed to be an \"X-files\" film so, in those terms, I'd give it a 1. It was like watching a Rocky film where there were 10 seconds of boxing at the beginning and 10 seconds somewhere in the middle and then everything else was about something completely unrelated. I don't see how any 'real' X-files fan could rate this highly as it just isn't about the paranormal. Okay crime thriller but about as paranormal as the ham sandwich I am about to eat."}, {"rating": "8", "text": "Good movie. Not great, but good and definitely worth watching. I am a long time X-files watcher and I watched it with my girlfriend who has never watched X-files. My girlfriend even liked it. Probably because there were no aliens in it :). You will feel left with some unanswered questions and a not fully explained plot, but a sense that you know where Scully and Mulder are these days and an entertaining murder-mystery."}, {"rating": "7", "text": "Finally a sequel! But like me, a lot has changed in the interim. It didn't feel like a true X-File movie, more like a low budget B-side lost episode of the show. It's all there though: Scully's skepticism, Mulder's poster and seeds, a pedophile with blood seeping eyes. All in all, it is worthy of a viewing (once)."}, {"rating": "8", "text": "An awesome character study. No, the movie wasn't perfect, but as a huge fan of the show, I was just glad to have them back."}, {"rating": "9", "text": "I have no idea what the critics are talking about.... This movie was among the best X-Files plots."}, {"rating": "4", "text": "I give it a 4.5 for all the \"x-phile\" moments it gave us, other than that a 2, And the 2 was for production alone. This was a weak ass CSI episode, not an X File. Chris Carter and D Duchovny, come one, please. You used to be beautiful, now its a f****** joke. Thanks a lot."}, {"rating": "7", "text": "To truly enjoy this movie, ignore the reviews and don't set the bar too high in your mind. Realize that I Want To Believe is simply an extended episode from the television series. Having said that, it was a damn good episode. So nice to see the gang back together."}, {"rating": "8", "text": "The first viewing, because I had followed teh show so well in it's time, had me feeling very odd indeed, agreeing with a number of fans that because it was totally against supposition and expectation, that I did not know how to process it. When I viewed it a second time, a habit from the very detailed series viewing, and as a student of literature and writing at college, I came away witha certain twittering in my heart. The plot of the paranormal phenomene was only a gimmick for exploration into the characters and faith, and how to deal with darkness and life. I think that so many reveviewers of movies and television have been somewhat dumbed down by conspicuous melodramatic, viciously obvious or crass movie fare that subtlety, lack of righteousness, personal doubt and struggle, so much the everyday, are beyond their minds. No one seems to want to think, and that is why people are so negative of this rather beautiful tale. The X Files promotes that life is not an area of duality, black or white, but an entire realm of shades of grey that few of us want to admit, because not having a camp where everyone sits to justify our rather horrible tendencies and behaviors toward one another is scary. Perhaps if there were more people courageous enough to be unique, humble people like Mulder and Scully, and not hide behinde conformity and how intelligence is not good for us, then perhaps they would understand what this type of entertainment is actually trying to do."}, {"rating": "4", "text": "I was a fan of the show but this movie was very weak. The story doesn't have any aliens. It is anti-catholic with molesters as priests and priests who want to deny life saving stem cell treatment. The dialouge us silly and the way they catch the bad guys is dumb."}, {"rating": "4", "text": "It was like a long and not that interesting episode. But it's nice to know how it all ends since there probably won't be another one since this one sucked so much."}, {"rating": "6", "text": "I've been an X-Files fan since its inception. The stories were so intertwined and fascinating. Unfortuntately this film doesn't hold a candle to the tv series or the first movie which was very well done and in keeping with the spirit on the series. What I missed most was the relationship between Mulder and Scully. There was no witty banter, no both of them in the same groove. The story was also quite dark and sinister just for the sake of being dark; not mysterious and clever. If you didn't see Chris Carter's name on the credits you wouldn't think he was the director. It just didn't feel like his story. I'm going out to the video store to rent season one and relive the series in all its glory."}], "recommendations": ["el_camino_a_breaking_bad_movie", "the_craft_legacy", "what_happened_to_monday", "the_many_saints_of_newark", "serenity", "contagion", "terminator_genisys", "maze_runner_the_scorch_trials", "pirates_of_the_caribbean_on_stranger_tides", "source_code", "the_new_mutants", "the_adjustment_bureau", "unfriended_dark_web", "colossal", "the_maze_runner", "predestination", "pirates_of_the_caribbean_dead_men_tell_no_tales", "the_hunger_games_mockingjay_part_1", "inferno", "chaos_walking", "x_men_apocalypse", "spiral_from_the_book_of_saw", "fantastic_beasts_the_secrets_of_dumbledore", "the_purge_election_year", "the_cloverfield_paradox"]}