{
  "id": 1378,
  "title": "The Batman",
  "starring": [
    "Robert Pattinson",
    "Zoë Kravitz"
  ],
  "runtime": 177,
  "genre": [
    "Crime",
    "Mystery",
    "Thriller"
  ],
  "description": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/74xTEgt7R36Fpooo50r9T25onhq.jpg",
  "categories": {
    "plot": 8.17142857142857,
    "acting": 8.5,
    "ending": 8.75,
    "soundtrack": 9.0,
    "cinematography": 8.4,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a nice wefect batman movie. I wouldnt change a thing about it. A different kind of superhero movie that i wish they made more of."
    },
    {
      "rating": "7",
      "text": "The movie was dark, and I mean the lighting. Batman himself was also dark, if I didn't know it was Batman I wouldn't have known if he was someone to root for. I also could've done without the \"their privlaged white males, so who cares\" line by Catwoman. I also felt it was too long, could've cut it back by 30 mins and it would've been more manageable. The villians we're great, penguin was a very nice surprise, and the movie as a whole was good, it's a good start and glad I went to go see it"
    },
    {
      "rating": "8",
      "text": "Фильм классный, зрелище отличное, сюжет интересный, но единственное это полный пофигизм \"Комисара Гордона\". В моменте фильма его лучшего друга убил \"Загадочник\". Да, ему было ему жаль, но через десять минут он берёт и забывает об этом вот же мудак. Сам фильм советую посмотреть."
    },
    {
      "rating": "7",
      "text": "+Great cast+Excellent visual effects / world / soundtrack+Good pacing / editing / production value+Very good plot -Despite being very good, lacks the x factor for greatnessI really enjoyed this. It feels like a great return to the core cheesy whodunnit detective story that birthed the original character. Rawcus moments of bombastically actiony stuff aside, I never thought I'd love to watch a superhero movie where a lead character states 'white previlage' in a given sentence. Can we not even escape life's drama bs without being confronted with it within a make believe comic book world now? That aside I had a lot of fun here."
    },
    {
      "rating": "7",
      "text": "Starting as a blockbuster movie with michael keaton & jack nicholson, Batman was a superhero character with a variety of narratives and stories, but he returned to the beginning again, and although a rather long running time is inconvenient, It’s a good start overall."
    },
    {
      "rating": "8",
      "text": "The Batman has lived up to my expectations. Building on a 100% neo-noir setting, amazing photography and an unforgettable soundtrack, Matt Reeves has created a powerful film with great sequences (Batman intro, church, car chase, Riddler-Batman conversation). Dano, Kravitz and Wright do their best, not envying their predecessors in the roles. Pattinson, for his part, is a very good Batman, although I would have liked to see more of Bruce Wayne, to feel more of his pain (probably Reeves' intention is to show you a Bruce Wayne still reluctant to fully show his \"scars\", maskless).The 3-hour running time flies by, which speaks very well of the script and its pacing, dosing drama, thriller and action. Not to mention the parallels with Zodiac and especially Se7en, both in particular elements of the plot, as in the main themes of the story. My main problem with the film was that I felt that it went from more to less and that, even though I was invested on it, I didn't fully connect with the Falcone//mob plot."
    },
    {
      "rating": "7",
      "text": "If you've watched The Dark Knight trilogy, you've already more or less watched this movie in a much better form. It borrows heavily from the themes and aesthetics of the Nolan films with an extra layer of depression and eyeshadow added for dramatic effect. While Batman assuming more of a detective role is indeed a welcome change, everything else feels like a downgrade from other movies. From dialogues so edgy you could cut yourself on them and a complete lack of saturation in the color palette to an absolutely repulsive version of Bruce Wayne that would be better off as the frontman of a grunge band than a charismatic millionaire moonlighting as a vigilante bat, the movie presents a rather unique, albeit out-of-character, version of the source material. The plot is decent, albeit dragged out, anticlimactic and littered with ham-fisted social justice sentiments. All in all, this movie feels like a great concept that is often tarnished by an eccentric director's vision and will to make it stand out from its predecessors in all the wrong ways. In an attempt to make it different, Matt Reeves forgot to ask himself if it is indeed going to be better. Nonetheless, it's an alright pulp-detective-superhero thingiemajig that you can enjoy as long as you can stay awake all the way to the end."
    },
    {
      "rating": "9",
      "text": "It was far better than I expected. Such a great Gotham atmosphere, Pattinson killed batman role  Film was little bit long but no problem. You should definetly see this moviem"
    },
    {
      "rating": "9",
      "text": "Although the film's runtime could've been cut by about 30 or so minutes and the romantic chemistry between Robert Pattinson's Batman and Zoe Kravitz's Catwoman felt really off, The Batman mostly lives up to the lofty expectations set by fans of the character and The Dark Knight movies that came before. The acting from the heavy majority of the cast is great, especially Pattinson when he's donning the cowl (less so as Bruce Wayne, where he comes off as kinda creepy), Kravitz, Paul Dano, and an unrecognizable Colin Ferrell. The riddles laid by The Riddler are both clever and digestible, the atmosphere around Gotham is very well-done, and the action choreography is fantastic. While it treads some similar ground to other Batman films before it, two things it does exceptionally well are making Batman do actual detective work and giving him a real character arc, something no Batman movie has really done before this one. Finally, in spite of the film's bloated runtime, it's paced really well and the pressure/intensity built up through the direction and score is great as well. While it could've been potentially streamlined a bit, The Batman should satisfy most comic book movie fans, as well as most movie fans so long as you're willing to enjoy the film through its 3 hour runtime."
    },
    {
      "rating": "10",
      "text": "The Batman: Alright I was so hopeful that this movie was going to be good and thank god it lived up to it. Spoilers through out, I’m just going to start with some minor nitpicks it’s got to deal with the length because when the Riddler is caught it could have honestly ended a little bit after that. Other than that it was actually really really good as a Batman movie, not as it standing up to the legacy of the Dark Knight. For the main man Robert Pattinson is actually really awesome, you can tell that even though he was Batman for only 2 years he strikes fear in the criminals and he can kick some serious ass. He also proves that he is very very smart during the crime scenes it’s awesome. Zoe Kravitz as Catwoman was also really really well done she has a heartbreaking backstory. The villains good lord, Riddler played by Paul Dano he was spectacular, he’s not only menacing but he was chaotic and he had some serious issues. Also the Penguin played amazingly by Colin Farrell he disappeared with the makeup on and he is one of the personal highlights. The action scenes are well shot especially the dark hallway scene just gorgeous. Also we are getting a new Joker and I don’t want that to happen it’s too soon because we just got the solo movie hopefully it’s just a cameo. Overall I was very impressed with the movie Matt Reeves did really well Pattinson did great, Kravitz, Dano, Farrell, the action scenes, the music, everything was awesome I highly recommend this movie, just think about it being a Batman movie don’t hold it anywhere near the Dark Knight Level. Ranking Amazing"
    },
    {
      "rating": "10",
      "text": "The new batman we have been waiting for. Film felt more artsy. Cant wait to see the progression in character development in the future series"
    },
    {
      "rating": "10",
      "text": "An Amazing refreshing batman film we have been waiting for. If you go into the theatre comparing it to Christian bales batman you might aswell go home... this batman is original creative and a truly great film."
    },
    {
      "rating": "9",
      "text": "Great movie and entertainment. It was a challenge to watch a 3h movie without playing on my cellphone :)"
    },
    {
      "rating": "9",
      "text": "Film molto caratteristico , non il classico film banale sui super eroi. Effetti sonori e telecamere ne fanno da padrone. Ottimo film anche per chi non è un fan."
    },
    {
      "rating": "9",
      "text": "Everything about batman is perfect , the visuals ,audio , pacing and story, the only thing holding back the batman is Robert Pattinson looking emo everytime Bruce Wayne is in the scene which brings the score down but this movie nails every other actors and Robert Pattinson really nails playing batman but played a weak Bruce Wayne .This movie is not a masterpiece but it really make me feel like batman."
    },
    {
      "rating": "8",
      "text": "its clear this movie has divided opinion as its not your previous batman with shiny gadgets and bat cave. This is a very different experience.The Jury was out for me on pattison however he did just fine, the dark and brooding recluse who operated at night and was clearly angry at the loss of his family isnt something we have seen before, it takes some adjusting to.For people that were bored, they were obviously expecting the usual action throughout rather than this being very story driven and away from the superhero norm.The film could have been shorter yes, personally i had been gripped by the cinematography and the reimagining of the characterNeed to watch again as im sure i missed so much.Dark knight still rules as the best batman movie, this is a good movie and deserves to be watched just have an open mind when watching it"
    },
    {
      "rating": "8",
      "text": "This is the best Batman film in my opinion! the history, the atmosphere and the batmobile. but the excess of details, the lack of Bruce scenes and the huge time of the film was what made me the 8th grade. it's an excellent film, but it's full of details and long lasting!"
    },
    {
      "rating": "8",
      "text": "I will admit I had my doubts about seeing this movie just because of Pattinson. However, after watching the film, I was impressed. Matt Reeves is one of my favorite directors and I'm glad he finally got his chance to deliver a legitimate blockbuster film. But that does not mean that the film is perfect. First off, lets talk about the pros of this film. 1. Pattinson is a great Batman. More so, he is a great Batman that is just starting out as Batman. 2. It shows more of the detective side of Batman that people have come to know and love about Batman. 3. The action is phenomenal. Great cinematography, great sequences, great special and practical effects.4. Paul Dano as The Riddler and Colin Farrell as The Penguin are amazing. 5. The Music and Sound Design for this Batman are top TierAll of these things are great about the Batman movie, but now lets talk about the not so great parts.The Cons:1. Pattinson is not a great Bruce Wayne.2. Catwoman is just ok3. Andy Serkis as Alfred could have been better 4. The pacing is a little off in some parts of the film5. Sequel Baiting"
    },
    {
      "rating": "7",
      "text": "This has been a pretty decent Batman movie which is on the more serious and detective side rather than just fighting with  villains(there are still fights but not that many as the previous movies). The cinematography is just fantastic, there was a lot of care put into the way the scenes were shot (using different angles,lightning, etc). The villain was also pretty alright even if he was a bit of a Saw copy. The cast was for the most part pretty great, was not a big fan of the guy who played Batman but he was still fine. The romance was incredibly forced and was acting not so well which just made me wonder why the hell it was even put there.l The biggest issue for me was the movies length, they could have easily cut at least 40 minutes of the movie and we wouldn't have missed anything. A pretty decent and more serious Batman"
    },
    {
      "rating": "8",
      "text": "Good movie boarding on great id say …best part was the riddler for sure and thought penguin character was cool as well"
    },
    {
      "rating": "8",
      "text": "Solid film.  It's similarly grounded like Nolan's Batman movies but much darker, grittier, and more brutal.  As a big fan of Batman graphic novels, this film felt more like a Batman film than any Batman movie that came before it (not saying it's the best Batman film).  The Batman's character arc was a highlight of the movie for me.  There were several moments in the first two-thirds of the film where I remember thinking \"this is just retreading ideas that I recall from Nolan's The Dark Knight,\" but the ending actually expanded on these ideas in a really refreshing way that I'm surprised Nolan didn't think of himself.  I'm very excited for the inevitable sequel.A controversial take, but not a negative critique is that the cast was simply good.  Not great.  Looking back what previous actors brought to the table, I don't think this cast did anything special.  Michael Keaton, Jack Nicholson, Michelle Pfeifer, Danny Devito, Christian Bale, Michael Caine, Liam Neeson, Cillian Murphy, Gary Oldman, Morgan Freeman, Heath Ledger, Aaron Eckhart, and Tom Hardy were truly memorable and awe inspiring in their total embodiment of their characters.  Although this could change over the course of the sequels, I think that most of the cast of this film don't achieve similar heights.  They are good, but not great.  Pattison really didn't have much to do other than walk, coldly deliver lines, grunt, and fight, but he did it all well.  Wright as Gordon didn't really bring anything new to the table in my opinion, but again his performance was solid.  Serkis as Alfred was completely forgettable and hopefully they give him more to do in the sequels.  Dano, Ferrel, and Kravitz were just short of great.  Dano spent most of the movie behind a mask and I often felt like his sporadic emotional fluctuations when delivering his lines were less frightening and more distracting - reminding me of every other actor whose portrayed the unhinged psychopath this way, pulling me away from the movie.  Ferrel's Penguin has me thinking The Batman is an earlier frontrunner for Best Makeup, but his character was nothing more than a club owning mobster.  Between the makeup and his performance, it could have been \"great\" if he'd have been given more to do.  The best part about Kravitz was the story and fight choreography.  But her actual performance felt like a retread of what's already been done and I didn't really feel any actual chemistry between her and Batman, so their intimate moments felt a bit forced.  Again, definitely not bad and her character's story combined with Arkham style fight choreography elevated her performance above \"good\" but just short of \"great.\"  The only character that I thought was \"great\" is someone I haven't really seen anyone talk about... John Turturro's Carmine Falcone.  Even with only a short amount of screen time, he stole most scenes he was in.  His delivery was subtle, yet intimidating.  He never took off his sunglasses, but you could feel his eyes penetrating each character he gazed at.  I don't think he's getting nearly enough credit for his role in the film.The only valid negative is that this movie was too long.  On that note, I don't know what I'd cut from it cause it really didn't have any filler.  I would love to see a director's cut that potentially cut the movie into 3-4 separate chapters/episodes like Tarantino's Hateful Eight."
    },
    {
      "rating": "10",
      "text": "There is a reason why this movie called THE BATMAN. This is the longest appearance of Batman in a live action movie ever. Bruce Wayne just a side character... Batman in full suite 80% of the movie.Of all the Batman movies... live action and animation... I never felt what is the Bat signal meant for the people of Gotham especially the crooks... Mat Reeves able to shows how the Bat Signal incite fear to the crooks.I also never see Batman doing actual detective works in a movie... this movie have the best Bat detective sequences ever... and his partnership with Jim Gordon is the best iteration I ever witnessed. When the Batman spoke.. \"Thursday October 31st\"... yeaaahhh!!!! I'm a sucker for movie with narrations... right then I knew.... I'm gonna love this movie... and the investigation itself is very interesting... Riddler is crazy AF... all the riddles he left for Batman and Jim to solve are mesmerizing and I'm so invested with the investigation works... 3 hours just flew by.All the cast are amazing... Robert Pattinson are amazing and he really looks great in the suit... The Bat suit itself is menacing... Colin Farrell is the most amazing cast... I still can't recognize him behind the make up... his accent is sublime.  Paul Dano as The Riddler...chilling performance... he is crazy AF... I don't know what kind of Joker Matt Reeves gonna give if there's a sequel to top The Riddler.This is the best Batman movie I've ever watched... if you're a fan of MCU type superheroes movies... I don't know whether you would've like it... but if you are fan of criminal investigation movies like Se7en... this movie is heavily influenced by Se7en.. you definitely gonna love the movie.Highly... highly recommended... 10/10... find the best sounding cinema because you need to hear the introduction of the Bat Mobile... HOLY S#!T!!! Goosebumps... the revving jet engine make the hair on the back of my neck stand up!!!"
    },
    {
      "rating": "10",
      "text": "Absolutely loved it the movie is very dark and gritty always raining no sun to be found here Paul Dano’s riddler really was amazing he is just very terrifying and crazy he made the movie for me as for Patttinson he is very good as Batman and average as Bruce Wayne Colin Ferrell delivered a great performance as the penguin John Turtturo and Zoe Kravitz also did a great job this Batman stands tall"
    },
    {
      "rating": "10",
      "text": "This movie is an absolute masterpiece. It rivals The Dark Knight for best comic movie ever. A real slow burn detective thriller"
    },
    {
      "rating": "10",
      "text": "This movie is a definite must watch i enjoyed every second of it the pacing is amazing the cinematography is through the roof and robert Pattison did an amazing job at being batman"
    },
    {
      "rating": "10",
      "text": "With astonishing cinematography this movie is absolutely brilliant. Of course there is some missing tiny parts like the storytelling aspecially in the ending but for me this minor problems are not enough to make me rate this incredible movie not 10 out of 10."
    },
    {
      "rating": "8",
      "text": "Wicked movie that will bring you nostalgic feelings of The Dark Knight and the grittiness that came with it."
    },
    {
      "rating": "10",
      "text": "Perfect storyline. I love it when its not all about the muscle, and the riddler just awesome."
    },
    {
      "rating": "10",
      "text": "It was amazing. Just watch it. Most complete BATMAN film ever. Even though The Dark Knight is the best Batman Movie ever, it is not necessarily the best BATMAN movie. Just watch it."
    },
    {
      "rating": "9",
      "text": "This was a thrilling experience. It has been a long time since I've seen a movie that really had me on the edge of my seat."
    },
    {
      "rating": "8",
      "text": "Sombrio e com um toque de loucura, the batman é um dos melhores filme do morcego, mas tbm achei o filme longo demais"
    },
    {
      "rating": "7",
      "text": "Clearly the Batman package and overall presentation helped this movie to be better than what it sould have been if it didn't make part of the Batman franchise.Visually it is awesome, partially thanks to long, contemplative and uncluttered shots. Lighting is okay. First flaw to me: the environment is way too dark. I totally get that it constitute a part of the Batman's core but here it is just too much. There are se few scenes shot under the daylight. It so dark that some scenes are hard to understand, because you can't easily visualize the position of objects and characters.Fight scenes are amazing, with some great choregraphies. I enjoyed the fact that Batman takes a lot of punches and bullets, making him seem more vulnerable, more human. Despite that fact, 'The Batman' manages to offer us spectacular scenes.We obviously can complain about Pattinson embodying this Batman, but I enjoyed his role even more since he keeps his mask on for something like 85% on the time. In overall he is quite good at non-acting: he is almost impassive for the total length of the feature. However I think he made a slightly different Batman: more sad, more tired and more beginner. Speaking of this, thumbs up to the new Alfred too ! I was highly skeptical at first glance but his relation with Bruce Wayne is totally different than in the previous movies. I was also positively surprised by Catwoman's role and character, I found her not too sexualized, not too seductive, emotional as I like, and properly introduced in the scenario. The villains are okay, excepting the Riddler which I found to be terrific. Even more, I am deeply satisfied with the evolution of the different characters. I don't have the impression to have watched a pointless regular action movie.I would have wanted more gadgets. For something as iconic as a Batarang, we see him use it once of twice maximum. What the heck ? He uses his grapple (or should I say Bat-grapple ?) way more often ! By extension,  the wealth of Bruce Wayne is nothing more than detail ! While it is supposed to be his very first mean to be a lawkeeper... The Batcave looks like a regular cave as the Batmobile just looks like a boosted, armored and reinforced Jeep.The scenario is quite boring and unoriginal. It sadly accentuate the fact that the movie lasts for more than two hours and a half. I found that the second third of it was the most boring. In overall it is really cyclic: Batman finds a riddle, solves it and goes to the meeting point, where he finds another riddle and so on and so on. He never tries to bypass the Riddler, never tries to do something unplanned. Fortunately the finale is worth it.There are notable inconsistencies. Several allies, including Batman himself, are exposed to close bombing, and they all miraculously survive. Bruce Wayne take an incredible amount of bullets without taking much damage. It seems like he possess a bulletproof and fireproof mask... Quite effective.I was disappointed by the fact that the movie tries to tackle multiple issues he can't really assume, as the death of Bruce's parents, the truth about his father and mother, the conception and origin of the Riddler, Gotham's politics, etc.The soundtrack is great, especially the use of 'Something in the Way' from Nirvana (terrific song by the way). Its presence is so overwhelming and iconic that I can't remember any other song used in the movie !In conclusion, many positive ideas and facts but I can't help to think that without its Batman label, this movie is just okay."
    },
    {
      "rating": "10",
      "text": "The Batman give us a new good Darker verse the casting and story the soundtrack the bat-mobile all was 10/10"
    },
    {
      "rating": "10",
      "text": "The Batman una película que vivio y supero sus expectativas desde sus anuncios, a pesar de ser una película de 3hrs no sientes el tiempo pasar, cada una de sus escenas aporta desarrollo a la trama y ninguna esta forzada o innecesaria, las actuaciones de los actores dan bastante en su punto y que decir de la cinematografia de Matt Reeves, esta película es un filme de superhéroes bastante bien acertado."
    },
    {
      "rating": "9",
      "text": "One of the best batman movies I've ever seen.Dark, mature and exciting, something different from what Marvel has unfortunately accustomed people to believe that it must be a superhero movie. All the characters come out what is necessary and no more, they do what they have to do and do not stow the narrative. the noir elements combined with batman are fabulous and give him that dark touch that the character deserves."
    },
    {
      "rating": "10",
      "text": "At the height of Nolan's. Excellent movie, from start to finish. Masterful Pattinson"
    },
    {
      "rating": "8",
      "text": "Batman went old school with this movie. Even though we didn't need both Catwoman & The Penguin---doing battle against the lunatic Riddler was plenty. I guess thy didn't want to take any chances and wanted to cover all bases in case the world wasn't crazy about Robert Pattinson.  He was fine. The detective story was fine The action and the stunts looked great on the big screen.  The Batman is one super hero I will go see every time there's a new movie."
    },
    {
      "rating": "10",
      "text": "Top 3 Batman movie. Almost feels like a lost Batman the Animated Series episode made into a movie. Batman finally feels like a detective, something missing from previous on-screen iterations."
    },
    {
      "rating": "10",
      "text": "Best Batman I’ve seen to date!! Pattinson delivers an stoic yet some how emotional performance as Batman. Loved the tone and atmosphere of the film!"
    },
    {
      "rating": "10",
      "text": "I simply loved this movie. It’s just such a different style from any other Batman film I’ve seen. Aside from the dark and gritty it has such a melancholy feel. And i’m totally buying into that. The acting was spot on, and I especially love the Riddler and Catwoman. One of the best comic book movies I’ve watched. Really looking forward to the sequel and the HBO Max spin-offs."
    },
    {
      "rating": "10",
      "text": "This movie takes a whole different approach for batman. We can see here clumsy, young Batman, who left the bruce persona after being brought down by everything life.I saw it as if he doesnt want to be bruce, he is scared of it, you can hear it in the conversation with alfred at the hospital or the looks he gives at the mayor's kid. To be the kid, to exposed to be vulnerable again, to be afraid as he was than. This batman is much less gadgety than yhe 2 previous versions of him. He is more rubust and not clean..he is much more a human than a super hero. And the fact that he looses, and yet come of it stronger that what makes  it the most batman story that was shown in live action. This is a batman from the comics as it was supposed to be. Abd yet the movie could be shorter in about 40-45 minutes, i think catwoman axting was not good and also Alfred's. Everyone talk about the riddler i think collin farrel was amazing as fhe penguin. Abd cant wait for his spinnoff series."
    },
    {
      "rating": "10",
      "text": "Cinematography was amazing, story and dialogues were awesome, it's beautiful how story is linked with each and every moment, no extra clips, perfect Acton, perfect storyline, perfect music and perfect direction, a very Good DC movie after a Long time, Loved it"
    },
    {
      "rating": "9",
      "text": "Best Dark Real GOTHAM BATMAN. A MUST SEE!!!If you were expecting The Dark Knight walking intothis movie, then you will for sure be dissapointed. Butif you are expecting just absolute beautiful cinema;then this is the Batman for you.Mathew Reeves is a genius. A genius for following theComics portrayal of The Batman. For the first 10 minof the movie I got a little nervous because it wasn'tthe Batman that I was used to. But after a little bit ofseeing the most Accurate Bruce Wayne and mostaccurate Batman combo, I was surely surely satisfied.Overall, the writing in this movie and cinematographyis just perfect. Perfect perfect perfect. And a hugethanks to Michael Giachino for being the bestcomposer of all time next to James Newton Howardand Hans Zimmer.As for the acting. There could not. And I repeat couldnot have been a better cast. Paul Dani made themovie alone with his preference on the Rider. Justgenius. And if I didn't know before the movie thatColin Ferral was the penguin, I would have neverguessed it. As for Robert Pattinson; bravo my friend.You played the absolute best version of The Batmanthat anyone could ask for. Where as with the otherBatman's, they were seen as two characters (Batmanand Bruce Wayne), your version matched the Comicsof the right balance of Billionaire Playboy and theright balance of dark rich vigilante. And Zoe's actingcan go without saying as the perfect cat woman too.Hot, sexy, straight to the chase, hurt, broken, andFlexible.The movie deserves an 8.6 rating but I’m giving it a nine to boost the rating."
    },
    {
      "rating": "10",
      "text": "The Batman is by far the best comic book movie and it has something that is lacking in other modern Superhero movies. It has actual heart behind it and is well written and does not rely on nostalgia and fan service"
    },
    {
      "rating": "10",
      "text": "Rivals The Dark Knight, masterfully executed. Terrific performances from Pattinson and the supporting cast."
    },
    {
      "rating": "7",
      "text": "The Batman is style over substance. The aesthetic, atmosphere, tone, and score are all great. Fight scenes work really well even though there are too few. Where the movie falters is in it's script, story, and character work. The narrative never really comes together, themes are inconsistent, character backstory and arcs are hamfisted, the romance lacks development, and for a focus on \"realism\" the movie has several unrealistic moments that will make you scratch your head. It's a good start to what I hope will be a new Batman franchise, but this one will underwhelm with it's dragged out pace and flat mysteries."
    },
    {
      "rating": "4",
      "text": "I wanted to like this. They decided to make a movie about Batman, and take out anything fun about the character. His car is cool, but barely shown. Bruce Wayne is not fun. Alfred is not fun. The movie is too long. The Riddler is not a great villian. Catwoman is pretty but they also use her to make racist comments against white people. I love Batman and wanted this to be good!!"
    },
    {
      "rating": "10",
      "text": "Best Batman movie to date. Non-apologetic about its raw and grim nature, definetly a refreshing and interesting take on the franchise. Well done, to all who were behind this film."
    },
    {
      "rating": "10",
      "text": "Gotham City is alive. It’s dark, rainy, grim, a wasteland, and we see the birth of its greatest hope right before our eyes. Robert Pattinson carries this film while having to be emotionally cut off to match the state his character is in. Through his eyes are the gateway to Bruce Wayne’s soul, Through his words are the gateway to the Bat. He is the best Batman, and he’s the best thing about this film. That’s saying a lot.Zoe Kravitz, Paul Dano, Colin Farrell, Andy Serkis, Jeffrey Wright etc… all do phenomenal jobs. It’s meticulously shot, scored, and directed. It’s violent, it’s moody, Nirvana plays, and by the end you feel so hopeful about the future. This is one of the greatest comic book films ever made. It perfectly captures a character and its world and brings it to life. It’s long, but holy cow is it a ride. Incredible job by all involved 5/5"
    },
    {
      "rating": "10",
      "text": "Ich fand den Film sehr gut. Ich hab ihn sofort als er rauskam im Kino geschaut und es nicht bereut. Ich mag den Film sehr und werde ihn mir sicher auf DVD kaufen!"
    }
  ]
}