{
  "id": 4138,
  "title": "The Mothman Prophecies",
  "starring": [
    "Richard Gere",
    "Laura Linney"
  ],
  "runtime": 119,
  "genre": [
    "Drama",
    "Horror",
    "Mystery"
  ],
  "description": "Reporter John Klein is plunged into a world of impossible terror and unthinkable chaos when fate draws him to a sleepy West Virginia town whose residents are being visited by a great winged shape that sows hideous nightmares and fevered visions.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/z2PiOTyjbCOnMHY2QJdq3I4jU44.jpg",
  "categories": {
    "plot": 7.1,
    "acting": 5.8,
    "ending": 4.0,
    "soundtrack": 8.5,
    "cinematography": 7.166666666666667,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I loved this film.\r It has a genuine creepy feel to it accompanied by great music. There are scenes that are very memorable, and years later, I still get goosebumps watching some of them. I really recommend this movie."
    },
    {
      "rating": "7",
      "text": "Very creepy film. It was legitimately scary. Richard Gere did a great job bringing in the Drama of the whole story without taking away the scary aspect. I was glued to the screen. I didnt want it to end."
    },
    {
      "rating": "9",
      "text": "The Mothman Prophecies really delivers when watched in the dark late at night.  The film is really unsettling at times, and it regularly sent chills through my body. The movie effectively uses science and the soundtrack to bolster the supernatural to make it all the more creepy. I can't wait for it to come out on Blu-ray."
    },
    {
      "rating": "7",
      "text": "This film did a brilliant job at creeping me out. It is by no means a jump out of your seat 'Ooo! Loud noise and scary face' sort of horror, but it was the subtlety and  suggestion that made it so unsettling. If you're the sort of person who likes to pick apart films and discredits them for anything not based 100% in reality then sure, there's a fair bit to criticise. It's not totally realistic but at the same time it's not so far-fetched that you disregard it straight away. All in all, I thought this was a pretty solid film, good cast, great story, great execution. Definitely worth a watch in my opinion."
    },
    {
      "rating": "7",
      "text": "Movie does a nice job of creeping you out from start to finish. It gives you an uneasy feeling."
    },
    {
      "rating": "9",
      "text": "This is one of those films I will watch again, and have done so over the years. There is great scary atmosphere throughout, and Gere plays his part really well. In my top ten creepy movies of all time."
    },
    {
      "rating": "7",
      "text": "A melodramatic opening gives way to a series of chilling moments based on the mothman legend. The film is centered around the popular theory that the cryptid was some kind of disaster-prophesying, otherworldly being. The demonological underpinnings are interesting, but man would I have liked to get a good look at the thing. At the end of the day though, the story proved entertaining enough for me to be willing to settle on the movie's cryptic phone calls and obscured shadowy forms instead.I love the film's paranoia inducing camera angles. Each darkly lit scene is framed in such a way as to leave the impression that something is lurking in the shadows just behind the characters heads. The later portion of the film even has a moment or two where you can catch a frightening glimpse if you're paying attention.Overall, this isn't anything all that special though. The writing is a little awkward. The reasoning behind the protagonist getting involved in the supernatural events feels faulty and unnatural for example. However, anyone with an interest in what was going on in the town of Point Pleasant, WV during the '60s should still enjoy the movie regardless. It offers a compelling explanation for events that have gone unexplained for years now and proves to be a decent horror flick in its own right.7.5/10"
    },
    {
      "rating": "1",
      "text": "Boring and chaotic, I watched The Mothman Prophecies till the end just to see if there will be something special at all. And there wasn't. Just for the actor's performances I give a 1."
    },
    {
      "rating": "0",
      "text": "worth the rent for sure.  As an adult, i was creeped out for a while just walking around my dark house.   Let me qualify that by saying that I love scary/horror but they have no residual effect on me.  I might be anxious during the movie but when it's over and the lights are on....nothin' there.  Not so with mothman...at one point a few nights after watching it, i woke up to a red LED on my clock that in my half-sleep mind, i was sure the mothman's eyes were watching me...."
    },
    {
      "rating": "5",
      "text": "Despite it's rather creepy but interesting story, The Mothman Prophecies doesn't have the unsettling feel it so desperately needs. What we are left with is a confusing, boring and badly acted \"horror/thriller\" that doesn't deliver in either thrills nor scares."
    },
    {
      "rating": "1",
      "text": "Film mystico-paranoïde à nette tendance paranormale dans lequel erre Richard Gere qui ne sait plus quoi faire. Nous aussi, devant un tel foutoir ésotérico-hystérique, nous ne savons plus quoi faire : continuer à regarder, chercher une bière, couler un bronze ?Dans le délire à plusieurs de ce petit patelin qui croit aux ovnis pendant les vacances scolaires et aux ectoplasmes et apparitions aux yeux rouges le reste du temps (sauf le dimanche, c'est la messe), qui entendent des voix et parlent à l'esprit omniscient au téléphone, on ne sait plus à quel saint se vouer. Le metteur en scène non plus d'ailleurs qui nous pond une sorte d'épisode X-Files à la caméra stylée pendant que Mulder et Scully sont en RTT.Clairement éculé et mou du genou, le film est une vraie berceuse avant d'aller au plumard. Il peine à maintenir la moindre attention (et ne parlons pas de tension, on va se gausser !) comme... oui, l'un des pires épisodes de la série des zinzins \"I want to believe\". Hélas, aucun proctologue de Roswell à l'horizon pour nous dérider : le film se veut très sérieux parce que c'est sérieux, t'entends ! on ne se moque pas des cons, non, non..."
    },
    {
      "rating": "5",
      "text": "Despite its visuals, director Pellington (Arlington Road) has a big flaw in this film. He tries to make a psychological thriller and the studio sells the movie as a horror film, so ¿what´s the genre of this?. As a horror film is just adequate, creating a supernatural atmosphere that is right and appropriate. As a psichological thriller, the film loses vibe `cause the characters looks too weird. Pellington´s love for symmetry (check all the scenes with a symmetric kind of view) and style, confuses the story and makes the film a little bit oversaturated (too much filters, camera moves and weird camera angles). The Mothman Prophecies loses impact for its accent in to be diferent from the usual films of the genre."
    },
    {
      "rating": "10",
      "text": "A film that respects the audience's intelligence. The unknown is the scariest film. This is one of the best films ever made."
    },
    {
      "rating": "7",
      "text": "Easily maintains a creepy atmosphere due to the fact that it never actually shows the \"Mothman.\" But, at times, I was wondering if any more was going to be explained."
    },
    {
      "rating": "10",
      "text": "An intelligent, creative and creepy exploration of the dream-like world. Music and sound are perfect, so are camera and pacing. A creepy thriller indeed, which I enjoy once or twice a year, usually with an afternoon coffee."
    },
    {
      "rating": "7",
      "text": "The Mothman Prophecies is a good thriller that really surprises. Saspence is quite competent to apply, plus with the place of action writers guessed."
    },
    {
      "rating": "8",
      "text": "I really like this film, where the terror is subtle and the tension builds up very well and remains almost until the end. It is a film that wins in being seen by audiences that do not know well what it is about. The more we read before seeing it, the more we spoil the feeling of tension and mystery that the film wants to build. The film is loosely based on a real accident on the Ohio River in the Sixties, and associates it with a series of appearances by a mysterious creature. Nowadays very forgotten, I think that this film was never truly valued for what it is.The film starts with a couple, John and Mary Klein, happy with the purchase of a new house and with the prospect of a bright future ahead, being separated by tragedy: after a car accident, she discovers a brain tumor and dies, leaving the husband devastated by the pain and feeling that the wife saw something strange just before the accident. The mourning is associated with a series of strange events that take John to the quiet town of Point Pleasant where he quickly discovers that the same thing has been seen there, much to the bewilderment of the local police. He then decides to stay there and investigate the apparitions further.The director, Mark Pellington, is skilled in the way he builds a growing environment of tension and mystery, involving and seductive. There are options that I didn't like very much, such as the bad and poorly developed romantic sub-plot between the protagonist and the sheriff, and also the very slight way in which the accident was addressed, with a change in the date and number of victims and the erroneous statement that the reason for that tragedy has not been determined. Others, however, were very intelligent, such as the fact that the creature never shows itself or clarifies what it may be, or if the protagonist is delusional at times. The division between reality and the dream is very tenuous and this is extraordinarily well-used. The last half hour of the film is a lot less interesting, but since the mystery is never solved and there are many questions that remain unanswered, there is material to endure the film until the end.The cast is not the most interesting aspect of the film, but I think I can say that it fulfilled its role with a lot of professionalism and commitment. Richard Gere is a pleasant protagonist and one who is easy to like, and he gave dignity, seriousness and verisimilitude to the character. Laura Linney was also good and very effective, but she was not able to establish good romantic chemistry with Gere and the romantic interest of the characters never really convinces us. Will Patton is also a good actor, but he hasn't always convinced me, and he seems to be lost in the way he should act.Technically, it is an intelligent film that takes advantage of cinematography to build the atmosphere of suspense and mystery: the camera and film work includes unusual framing perspectives, seen from above, as through the eyes of a bird that hovers over the characters or takes flight above them, and there are many night scenes, in gloomy rooms and misty days. The editing is smart and very good, and the sound effects are truly remarkable, in particular the noises, the strange sounds and the voice distortions. They are simple things, but they don't look bad, and they work wonderfully well. The soundtrack is effective, but discreet."
    },
    {
      "rating": "6",
      "text": "Mysterious thriller film from 2002. It was a nice surprise as I watched the genre without knowing and researching. Although it gets heavy in places, it is still an interesting and intriguing movie. But if you are a horror movie lover, it does not have such scary scenes. It is based on an urban legend.It's about how this urban legend, called the moth man, affects a region. This creature gives numbers to people, and there are deaths with these numbers in them.I thought the movie would go on as the man who fell behind his wife's death. But events changed direction.There is no sex or nudity in the movie."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\"..\".\".\".\".\".\".\".\".\"..\".\".\".\".\".\".\".\"..\".\"\"."
    }
  ]
}