{"id": 1310, "title": "The Mummy Returns", "starring": ["Brendan Fraser", "Rachel Weisz"], "runtime": 130, "genre": ["Adventure", "Action", "Fantasy"], "description": "Rick and Evelyn O’Connell, along with their 8-year-old son Alex, discover the key to the legendary Scorpion King’s might: the fabled Bracelet of Anubis. Unfortunately, a newly resurrected Imhotep has designs on the bracelet as well, and isn’t above kidnapping its new bearer, Alex, to gain control of Anubis’s otherworldly army.", "releaseYear": "2001", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/kdJsW7hcy1lrj7tdMPycTAQPAiR.jpg", "categories": {"plot": 6.266666666666667, "acting": 6.2, "ending": 7.166666666666667, "soundtrack": 6.5, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.166666666666666, "action": 7.857142857142857}, "reviews": [{"rating": "5", "text": "I liked it but the thing about the film is that it has too much action and not enough plot. They sort of took the Michael Bay route where they give you a small amount of plot to satisfy you and they fill the rest of the time with action sequences. It can also be corny at times. It was ok but not as good as the first film."}, {"rating": "7", "text": "----------------------------------7.2/10-----------------------------------"}, {"rating": "4", "text": "\"The Mummy Returns\" returns....This time with terrible acting and a uninspiring plot. Its ultimately your average summer blockbuster."}, {"rating": "7", "text": "The Mummy Returns is a decent sequel that nicely captures the essence of it's great predecessor. That said, Returns doesn't quite make into the same league as The Mummy. A touch too many action scenes, needless plot complications (everyone seems to a reincarnated version of somebody else) and a smattering of dodgy CGI let the side down a little bit. Still, The Mummy Returns remains a very entertaining second outing."}, {"rating": "8", "text": "Compared with the first One, this second part leaves a lot to be desired, the story feels forced but I still consider it a good story"}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "10", "text": "Enjoyable thanks to the humor and the many special effects.Most people compare this sequel to the first movie 'The Mummy', which is a good thing of course, but I haven't seen the first one, so no comparisons from me.So what can I tell you? Well, the movie isn't as bad as I expected. It's all to clear that the director's first thought wasn't about the script but about the many special effects, but i still quite liked the movie. What made this movie work for me was the humor. Normally this kind of movies takes itself much too serious, there is no place for any joke or funny situation at all. In The Mummy Returns this is different.Thanks to the humor, this movie was very enjoyable, but it is of course the many special effects that make this movie what it is. Don't expect anything real: a mummy coming to life, sucking the life out of people, armies of mythological creatures... will of course never exist in reality, but it certainly was nice to see.I guess it is best to qualify this movie as some excellent way to pass some boring hours on a cold and rainy afternoon. It's certainly not an intellectual movie, but I didn't mind about that when watching it. I give it a"}, {"rating": "10", "text": "This movie is better than the first one: there is more action and there are more locations."}, {"rating": "6", "text": "Стандартный сиквел.Смешного юмора как-то маловато, хотя это было главным достоинством первой части. Сюжет довольно посредственный \"У них родился сын, у них опять неприятности, у них опять всё получилось\". Вообщем, можно долго не расписывать, а просто сказать - \"Это один из тех сиквелов, которые хуже оригинала\"."}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "7", "text": "The Mummy Returns is just so darn entertaining! Nearly as good as the first installment, the film takes us on another adventure through Egypt--one that we won't regret."}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "8", "text": "The film dazzles and entertains, but is not nearly as good as the first film.  This film begins to touch on weird things that might have sounded good on paper, but it doesn't translate well to the screen.  The acting is good in this film and the action is entertaining.  Another good installment."}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "6", "text": "And continuing the sequel more entertaining of all time, only this time not as entertaining as its first part."}, {"rating": "10", "text": "La mejor película de todas! no sé por que tiene tan malas criticas si la momia contiene excelentes escenas, alta calidad, muy buena interpretación de personajes,y es completamente iconica para mi generación!"}, {"rating": "6", "text": "not as good as The Mummy, but the decent acting and the visuals were the only saving grace for this sequel."}, {"rating": "7", "text": "While it's not as good as the first movie it's still a good movie, the characters aren't as enjoyable this go around and neither is the plot, but the humor and action is still here, a good movie from beginning to end."}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "9", "text": "Hands-down one of my top five favorite adventure films of all time, \"The Mummy Returns\" takes all the fun from the first movie - action and humor - and launches it off on a far more epic platform as Rick O' Connell and Evie find themselves trying to track down their young son and the reincarnated Imhotep before he can kill the Scorpion King and unleash hell upon the world. Yeah, I know it's all kinda corny and over-the-top, but this movie is just so friggin' entertaining you can't help but love it. Brendan Fraser was the star of the first film for his charm and charisma, and here he delivers more of the same. The chemistry between him and Rachel Weisz is as palpable as ever, the brother is still a good bit of fun, and the son - God, the scenes with the son and Ockna (or whatever his name is) are just hilarious! How can anyone not enjoy this? I never get tired of watching it - \"The Mummy Returns\" is simply awesome."}, {"rating": "6", "text": "The same things  said about Mr. Fraser for the first Mummy move pour over into this one. Again, he can't be taken seriously even if he tries. This movie was a okay sequel to a pretty good first installment, but was nothing special."}, {"rating": "4", "text": "The Mummy Returns is a classic Hollywood sequel. Unfortunately, the plot is secondary and for the most part repeats the original and is also stretched as much as possible. The final part of the film looks better than the main part. A typical sequel that has nothing new."}, {"rating": "6", "text": "Pretty BlandThe Mummy Returns isn’t really that bad, But it’s still very by the numbers as well as The Rock’s awful CGI."}, {"rating": "6", "text": "For me the movie is a 4 out 10 but this hate people give this movie is way too much hate."}, {"rating": "5", "text": "In this movie the mummy will return to wake up, this time in London in the thirties. Rick and Evelyn will have to run against the clock in order to save the world again, and most importantly, to save their son, Alex. This is the sequel of \"The Mummy\", movie of 1999, and has the direction and script by Stephen Sommers and the participation of Brendan Fraser, Rachel Weisz, John Hannah and Arnold Vosloo, added by Patricia Velasquez, Freddie Boath, Dwayne Johnson and Oded Fehr.It's always difficult for a sequel surprising the audience that saw the first film. This film suffers from this difficulty and therefore couldn't surprise the same way as the first one. The script could also have been more interesting: the \"Scorpion King\" story is hardly convincing and sounds like a sort of publicity for the movie with that name which came out the year after. Dwayne Johnson, in turn, played his role perfectly well: this \"pseudo-actor\" is good for any role where he has to punch four times more than talk. The rest of the cast is perfectly fine, particularly Freddie Boath, who was brilliant in his role, and Arnold Vosloo, who gave his character a psychological depth that he hadn't had the opportunity to show in the first film. The soundtrack continued to be good without being exceptional, the special effects and make-up continued to make their role positively but without surprises. The computerization and digital resources surprised me most at the end of the film, which is very well done.This film comes on the trail of a great movie for the family and for almost all ages. I believe that, despite not having been exactly a surprise to the public, this shouldn't be a big sin. It remains a film made with great care and in an intelligent and humorous way. It's a movie for everyone."}, {"rating": "6", "text": "A rehash with an annoying kid in it. I guess we can only handle the story once."}, {"rating": "8", "text": "Entertaining!amazing acting and music visuals were good until the end this movie has really bad cgi at the end even though the movie felt engaging not as great as 1st one but decent ending was amazing where the fight of past kindof take place and love betrayal and clever child entertaining stuff overall decent"}, {"rating": "6", "text": "Oh, I hate mummiesNot as good as the first mummy and why do the green screen backgrounds look like different Serious Sam levels."}, {"rating": "6", "text": "Was never going to beat the first one but it's a good attempt at a sequel ."}, {"rating": "6", "text": "I don't get the negative sentiment. Yes, the sequel is a bit bloated and not quite as elegantly told as its predecessor. But it is every bit as entertaining while retaining the heart and charm of the series."}, {"rating": "3", "text": "Again, I hated the \"good guys\". I so wanted them dead!! The same ole crap with a kid being a total annoying little loser."}, {"rating": "7", "text": "I loved the movie, the action, the good looking men, and the unusal but great women in this movie! I also LOVE The Rock, and can't wait to see him in The Scoprpion King!"}, {"rating": "5", "text": "Has some great entertainment value but like the first film is packed with plot problems."}, {"rating": "5", "text": "Is it a flawed movie? Yes, but it is also a rare case where the cast and their chemistry together makes it a much better movie than it should have been."}, {"rating": "6", "text": "Clearly 'The Mummy Retourns' doesn't lie about being a lame sequel of the first movie. There are several metajokes about it in here. So don't expect the scenario to be different. I had no expectation for it but still got pretty surprised.Special effects seem to be a big deal in this movie. I found they were very good at the beginning but yeah, not far from becoming more and more disgusting as the plot moves on. The more we get to the end, the more we witness surrealistic scenes. And there are numerous false connections. Characters don't stop to fast-travel even when they are in the same room. These facts tend to make me dislike 'The Mummy Returns'.Dialogues remains as dumb and lifeless as in the first opus. Characters spend their time explaining the plot, reminding us who each protagonist is, trying to problematize the movie, emphazing the ridiculous drama of the situation. The kid specially is awful: his presence is the reason to showcase silly situations and lines. The couple Rick + Evelyn is terrible. They tried to make them seem like accomplices but it doesn't match at all. They spend their onscreen time kissing and licking each other. Each and every Evelyn appearance seems to be an occasion to make her look and sound hot and horny. At this point it is pretty lear to me that Sommers had some major fantasies about hot female archaeologists. His movie jus was not the best place to underline it. Evy's brother which I found terrific in the first movie is here one of the silliest and repelling character of all. He is just so one-dimensional, and his jokes always fall apart.I have to admit though that this movie was highly entertaining. There are some fast-paced action scenes, some characters are well developped, and it becomes funny to see until which point were Sommers ready to go in order to surprise the spectator. It however felt endless. Let's watch it as a historical event of our times: it is the very first appearance of Dwayne Johnson in a movie. (At this point he iss still very close to be the most over-paid actor in the industry... Funny to witness him making his debut as CGI poorly-animated scorpion king heh !)"}, {"rating": "8", "text": "This one is my favorite out of the series. It has all the same cast. Plus the same Mummy's from part 1 along with new ones. Pretty sweet movie."}, {"rating": "10", "text": "Wow so many negative ratings but only one negative review (so far). Makes you wonder....Anyhow those who are bashing this movie just because of the CG Scorpion King should think about what happened when movie makers used CG costume in Green lantern. I strongly believe that Stephen Sommers took the correct route. At least we did not get real head hovering in air.This movie is excellent example of show not tell. All the so-called plot holes are totally explainable if you apply simple logic.Plot holes like why Imhotep identifies Evie as Nefartiri this time, while he was unable to do so is totally explainable by the fact that in \"The Mummy\" Imhotep stole the eyes of Mr. Burns who was a person with poor eyesight, but this time round, he was able to procure eyes with perfect eyesight. Then, the rebirth of Anck-Su-Namun is also totally explainable. Meela inherited memories of Anck-Su-Namun, and not her soul. It is similar to sharing beliefs and consciousness with people but being a different person from them. This also explains why Meela abandoned Imhotep in his final moments. Meela wasn't in love with Imhotep but rather she was fascinated with chasing the dream of Immortal Love of Anck-Su-Namun and Imhotep.Anck-Su-Namun soul was now sharing her body with Meela, but her soul was no more than a ghost  which possesses a human host. There is only so much control a ghost can exercise over a hosts body. So, she abandoned Imohotep, when he needed her help the most.Imhotep realized that his true love was long gone. Anck-Su-Namun (who was brave enough commit suicide because of him) had died centuries ago and his era was long gone. He finally glanced at Rick and Evie and realized that in this era the perfect example of true love were Rick and Evie and not Imhotep and Meela. So, he lets go off the ledge.Any more questions?"}], "recommendations": ["shazam_fury_of_the_gods", "night_at_the_museum_battle_of_the_smithsonian", "jack_the_giant_slayer", "incredibles_2", "i_am_number_four", "ghostbusters_ii", "terminator_genisys", "night_at_the_museum_secret_of_the_tomb", "thor_ragnarok", "seventh_son", "penguins_of_madagascar", "real_steel", "pirates_of_the_caribbean_dead_men_tell_no_tales", "transformers_dark_of_the_moon", "pirates_of_the_caribbean_on_stranger_tides", "transformers", "bumblebee", "despicable_me_2", "love_and_monsters", "hercules", "teenage_mutant_ninja_turtles", "race_to_witch_mountain", "hotel_transylvania_2", "mission_impossible_iii", "terminator_3_rise_of_the_machines"]}