{
  "id": 2830,
  "title": "The Crow",
  "starring": [
    "Brandon Lee",
    "Rochelle Davis"
  ],
  "runtime": 102,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "Exactly one year after young rock guitarist Eric Draven and his fiancée are brutally killed by a ruthless gang of criminals, Draven—watched over by a hypnotic crow—returns from the grave to exact revenge.",
  "releaseYear": "1994",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iH5eExSCOv1kxJXH9npPyM0EAJF.jpg",
  "categories": {
    "plot": 7.722222222222222,
    "acting": 7.866666666666666,
    "ending": 7.75,
    "soundtrack": 6.5,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Great comic book film! Very dark and very gritty! It's a shame that a great tragedy resulted from such a great film but at least Brandon Lee leaves us The Crow as his legacy!"
    },
    {
      "rating": "10",
      "text": "A Fabulous soundtrack, super talented sexy martial artist Brandon Lee, and fabulous acting by all made this one of my favorite movies of all time.  The colors & settings reminded me a little of Tim Burtons movies but more real.  One of my top 10 favorite movies of all time!"
    },
    {
      "rating": "10",
      "text": "Infelizmente Brandon Lee não teve tanta estrada e carreira como merecia com sua trágica morte na gravação do filme,que por sinal é excelente. The Crow 1994 \"O Corvo\",é fenomenal sombrio e épico. Brandon Lee está fenomenal com uma atuação tipo Coringa Heath Ledger nos anos 90's.\rMichael Wincott está excelente como o antagonista.Rochelle Davis e Ernie Hudson estão ótimos como a pequena garota e o policial colega do corvo respectivamente.\rÓtimo Filme."
    },
    {
      "rating": "5",
      "text": "Perhaps it took Brandon Lee's unfortunate demise to give this movie the cult reputation it has but the question remains: is it actually deserved? Lee, the main actor, no doubt gives his best and it is really a pity that he died for he shows talent. So one can only dream what could have been.\rCould have been.\rAnd there you have it.\rShould you judge a movie based on might have been? To me it seems more valid to stick to what you got: it is the only thing you can judge.\r So lets take a look at what we got before us.\r The crow is a run-of-the mill revenge story based on a comic. A young couple gets brutally murdered on Devil's Night by a gang of freak arsonists who can not be stopped by the law. Of course not! We all know by now that it requires a special someone to stop them, hence the police is emasculated so we can exclaim: do not expect any help from the law!\rTherefore a crow invokes the spirit of the murdered Draven for reasons unknown with magical powers unknown , but for the fact that we otherwise would not have a movie to begin with. Who needs reasons anyway? We are only explained that sometimes the dead linger because the crow that guides the spirit to the other world might choose not do so. At least not yet. Hence the dead do not go to the place beyond but stay for reasons and purposes unknown, except that in this movie it is apparently for Draven to kill those that killed him and his wife.\r So Draven, after painting his face white with black stripes for reasons unknown, - perhaps just because it looks cool- follows the trail of lesser goons all the way to the end boss. Since Draven is already dead he cannot be killed again, hence the thugs have virtually no way to stop the oncoming doom, but it is amusing to see them try. To make the story at least engaging a black police guy(Ernest Hudson) and a teen girl (Rochelle Davis) run the danger of their wrath and give the story some body.\r Now with a flimsy story one needs something else to make amends.\rThe first thing that springs to mind might be great dialog. Perhaps something akin to Tarantino. One can completely forget about that. There is nothing approaching anything interesting except for the occasional quip.\rNext would be, given it is based on a comic, some unusual imagery. Well, the camera sometimes is put at odd angles in the story, but this isn't used in a consistent manner nor is the lightning or imagery special.Nothing that approaches say Sin City or the Third Man.\rNext on the list would be interesting characters. Needless to say, there are none. The thugs are your usual set of suspects: anti social, rude, crude and nasty. Cattle for the slaughter. The support cast, a honest disgruntled cop and a bratty teen, has been seen before. Then there is Draven himself, a tortured soul and a wronged man killed in the prime of his life who has been given special powers and is left with just one task to accomplish: revenge. Nothing surprising there either.\rOne could of course point to the music which has some great bands performing, but here again there is nothing unexpected. We got the usual set of alternative rock bands here. Great bands no doubt, but a totally unsurprising choice too.\rAt last one would expect some kind of humor in this movie, but this one is as dry as old bones.\r Overall, with a meager story, uninspired dialog, shallow characters, the usual music, no humor and an unremarkable cinematography this movie has mediocre written all over it. It is only saved by the fact that the cast and crew do the best with what they got and the budget allows.In that the movie is no doubt a good effort, but ultimately nothing that left me with an impression of greatness. In a nutshell: nothing spectacular lies within."
    },
    {
      "rating": "10",
      "text": "It looks a little dated. Some of the visual effects are really poor! But it looks gritty which isn’t the best look for impressiveness. It is the only style that this movie could have had and so it looks amazing. It is good to see no computer generated effects. The sound has a subtle mix that can be very active when required. I liked the sound design in general a lot except that the dialogue was a little too quiet (not badly prioritised but overall too quiet). This is a true gothic masterpiece. The story is amazing, the concept is unbelievable, the acting is spot-on and the gothic atmosphere is the star of this classic movie. There is such a tragic story behind the film with is mimicked in the brooding moody and tragic story on-screen. A rare classic movie with a beautiful gothic noir style."
    },
    {
      "rating": "8",
      "text": "The first 20 minutes are a bit underdeveloped(probably because of Brandon Lee's unfortunate death), but the movie immediately picks up its pace with it's great action scenes, beautiful visual style, and Brandon Lee's charming/funny performance. An entertaining and good end to Brandon Lee's career."
    },
    {
      "rating": "8",
      "text": "“The Crow” flies high. For a while rumored to be impossible to complete due to the tragic accidental death of star Brandon Lee eight days before lensing was due to wrap, pic that finally emerges is a seamless, pulsating, dazzlingly visual revenge fantasy that stands as one of the most effective live-actioners ever derived from a comic strip.\r Despite a simplistic script that unfortunately brandishes its cartoon origins rather too obviously, the combo of edgy excitement, stunning design, hot soundtrack and curiosity about Lee will rep an irresistible lure for young audiences in large numbers, giving this very strong commercial wings. As far as Miramax/Dimension is concerned, it’s too bad the film isn’t moving into the marketplace right now, rather than on May 11, since there’s absolutely nothing out there that could compete with it.\r Based on James O’Barr’s bold comic strip, which has generated a considerable following since he started drawing it in the early 1980s, “The Crow” centers on a dark angel who literally rises from the dead to settle matters with the gang of thugs who killed him and his fiancee on the eve of their wedding. Tale is more pungent than poignant, however, in that it’s set in a generic inner city so hellish it makes Gotham City look like the Emerald City.\r Noted Aussie commercial and musicvideo helmer Alex Proyas drenches his debut Yank feature in a claustrophobic, rain-soaked atmosphere that owes more than a little to “Blade Runner.” But the movie still generates a distinctive personality due to its aggressive narrative vigor, agreeable mixture of sweetness and nastiness, and technical mastery.\r Tour de force opening brings the viewer in for a slow landing over a bleak urban landscape blighted by fires on Devil’s Night, Halloween Eve. The Crow, as a girl’s narration informs, transports souls to the land of the dead, but if a crime was so heinous that the soul can’t rest, the Crow can bring it back.\r That’s all the explanation needed for the rebirth, a year later, of Eric Draven (Lee), who, as is shown in brilliant, violent flashes of montage, was murdered by a bunch of drooling hooligans who then raped and mortally injured his bride-to-be. A rock musician by trade, Eric is led, one by one, to his vile assailants by a large crow that flaps above the desolate streets like a mythic bearer of dread tidings.\r Pic’s main problem is an exceedingly straight, A-B-C-D narrative line with no subplots, twists or turns, which even Proyas’ protean direction can’t keep comfortably aloft the entire time. Banter and nasty repartee could also have been sharpened up and made more humorous.\r But film creates one of the most imaginatively rendered, impressively sustained artificial worlds seen on film in some time, and the action is riveting. Vet video production designer Alex McDowell has devised a staggering look for the bombed-out cityscape.\r McDowell, Proyas, ace lenser Dariusz Wolski (“Romeo Is Bleeding”) and costume designer Arianne Phillips have carefully calculated a shadowy, color-drained environment, melding their contributions into a vision worthy of a single visual artist. Special effects, particularly those involving the flying crow, are outstanding.\r But certainly much of the attention here will rightly focus upon Brandon Lee. The 28-year-old son of the late Bruce Lee had not had a very distinguished career up until this, but this role would have made him a performer to reckon with, and perhaps a star. His striking looks, sinuous presence and agile moves lock one’s attention, and the painful irony of his role as a dead man returning from the grave will not go unnoticed.\r Most supporting thesps seem to be competing for the title of meanest, nastiest, scummiest villain. Graeme Revell’s outstandingly moody score is supplemented by more than a dozen edgy rock songs that promise a fine soundtrack.\r A sequel would have seemed like a foregone conclusion. But, so sadly, it would be missing this film’s central presence, Lee. Film is dedicated to him and his fiancee, Eliza."
    },
    {
      "rating": "9",
      "text": "Brandon Lee, slain by a stunt gun during the production of \"The Crow,\" haunts every frame of his final film. The 28-year-old actor's passing suffuses this scenario, about a murdered rock musician whose ghost wreaks vengeance on his killers, with prescient, touching irony: An otherwise respectable pop noir is transformed into something eerie and deeply compelling.\r Adapted from the underground comic book series of the same name, \"Crow\" flutters stylishly through a nighttime world of rain-drenched back streets, vertiginous rooftops and shadowy club rooms. The images are frenetic, violent and composed with cartoonish artfulness. The camera flits from ledge to ledge like a restless Harpy. When it's time for fighting, the songs (by Nine Inch Nails, Rage Against the Machine and others) punch loud, boisterous holes in the soundtrack. And when the story turns mournful -- which is often -- Graeme Revell's electronic, dirgelike score drapes the story in a postmodern pall.\r Against this MTV-style barrage of sound and image, a rather tragic love story unfolds. Lee is Eric Draven, a small-time rock musician who, with his fiancee Shelly (Sofia Shinas), is murdered by a gang of hoodlums on \"Devil's Night,\" the evening before Halloween. Exactly a year later, Draven -- accompanied by an otherworldly crow -- emerges from the grave to take systematic, bloody revenge. His reappearance echoes a legend in which unhappy souls (with a crow in attendance) return to the living to redress their grievances.\r Draven, his face painted in mime-cum-death-mask white, deals each gangster his just deserts. A punk who carries several knives and a thug with a morphine habit find themselves stabbed to death with the tools of their trade -- and so on.\r As Draven works his vengeful way up to the bass-voiced ringleader, Top Dollar (Michael Wincott), he establishes sympathetic links with the detective (Ernie Hudson) assigned to the original massacre and the girl (Rochelle Davis) Draven and Shelly used to take care of.\r The characters, derived from James O'Barr's \"graphic novel,\" are comic-book archetypes, their dialogue (penned by screenwriters David J. Schow and John Shirley) a collection of cartoon-balloon hokum. (\"I think we broke her,\" Top Dollar tells his funereal sister-lover as a naked concubine lies dead between them.) In fact, the whole story, full of messianic images, Gothic steeple finales and music-video poignancies, is decidedly corny.\r But Australian director Alex Proyas keeps the action moving so fast and atmospherically, everything gains dimension. Even the violence (actually toned down from an original NC-17 rating) seems too stylized to take seriously. Whether his motives were profit-oriented, eulogistic, artistic or all three, Proyas has composed the perfect swan song. Finally, there is Lee -- as Draven -- enjoying the last moments of his life in flashback, with a lover he'll never get to marry. The real-life similarities are palpably affecting. But \"Crow,\" in all its arty trashiness and sepulchral reverence, gives Lee's tragedy an oddly comforting epilogue. If he had to die so soon, this movie is the best and most appropriate sendoff Lee could have hoped for."
    },
    {
      "rating": "8",
      "text": "The artistic medium of film is very subjective. Every audience member has a different set of criteria they use to measure their viewing experience. Not everyone shares the same set of criteria. If we did, what a bland and uninspired world this would be.\r What I Personally Liked About \"The Crow\":\rLet's start off by saying that this is a very dark film, both in script and on screen. It's also not afraid of being a dark film. It embraces its midnight black storytelling and chimerical visuals. It makes this film feel like the kind of campfire ghost story a perpetually haunted masochist would tell the other unlucky inhabitants circling the flickering flames. The uncertainty that festers under the visage of each and every character aids in forming those dark ripples we see shimmering across the pool known as our silver screen. From our angst-ridden hero to our villains who currently question their purpose in life, it's nice to see a simple melodramatic revenge flick transformed into a brooding, elegiac guignol. This film also presented an interesting turn of events for villainous performers in the cinematic world. In just two short years, Tony Todd went from being a towering titan of terror (in \"Candyman\") to a third rate henchman while Michael Wincott took three years to go from being a third rate henchman who gets run through by a sword (in \"Robin Hood: Prince of Thieves\") to a masterly crafted top tier evil doer who runs other people through with swords. A specific performance I enjoyed was the one given by Bai Ling. Her ultra reserved characterization stuck with me for a long time after my original viewing of the production. I've since seen her turn in a few lunatic performances (\"Crank: High Voltage\" anyone?) which is shameful considering the real talent she possesses for more conservative dramatic acting. I'm also a big fan of Graeme Revell's disconsolate score filled with pulsating electric guitars, caliginous orchestral string arrangements and mournful vocals.\r What I Personally Disliked About \"The Crow\":\rI really dislike the fact they cut the Skull Cowboy from the film. I was really looking forward to Michael Berryman's appearance and I feel the character could have added an entirely new depth to the movie. I'm also not that big a fan of Rochelle Davis's acting as Sarah. She is only on her game about a third of the time she's on screen. The rest of the time, she looks like she's out of her league and she knows it. Then, of course, there's the fact that Brandon Lee had to die so this movie could live. Okay, so that's a bit too sensational a way of putting it, but his death still helped a phenomenal film reach a wider audience than it probably would have otherwise.\r My Overall Impression of \"The Crow\":\rAll of the right elements are present to create a Stygian classic and, for the most part, those elements succeed beautifully. I find myself drawn back to this film time and time again and that is the mark of a truly great work: to be able to revisit the piece endlessly and still derive pleasure from its pulchritude."
    },
    {
      "rating": "8",
      "text": "A super well made adaptation of the comic books.If you like dark serious action films then this one is a must see.Brandon Lees last performance is great and could have let him to pursue bigger roles if it wasn't for his sudden passing."
    },
    {
      "rating": "0",
      "text": "Great comic book film! Very dark and very gritty! It's a shame that a great tragedy resulted from such a great film but at least Brandon Lee leaves us The Crow as his legacy!"
    },
    {
      "rating": "9",
      "text": "The one thing that sticks out in my mind the most after watching this is how it all could have just been some edgelord's wet dream come to life. Yet, actual emotional maturity was infused into this gothic revenge thriller. Thanks to Brandon Lee's excellent final performance the protagonist's inner turmoil is portrayed in a thoughtful manner. So all of the anger, grief, and general moodiness in the movie never make it come off as the juvenile, emo pandering porn it otherwise could have been.The Crow still looks gorgeous after all these years. Alex Proyas created a version of Detroit that manages to out style even Tim Burton's wonderful take on Gotham City. Batman himself would find it too grim of a place to call home. This can be counted among the few comic book movies that actually look like a series of panels brought to life. Something that is very evident every time there's a bird's eye view given of the city.It's not all gloom and doom however. There is a sense of humor to be found, dark though it may be. Lee brings a certain demented playfulness to the table when coming face to face with those who ripped away his life and love. Delivering memorable exchanges laced with the kind of insanity that only comes from having lost literally everything. It makes things a little more exciting without taking away from the story's solemn edge.This stylish, violent tale about an all black wearing rockstar returning from the dead to avenge his beloved could have been the kind of thing to only find appeal with the self-proclaimed \"tortured souls\" of any high school. Yet even at it's most indulgent there's a real heart and depth to The Crow's melancholy that allows it to connect with a wider, wiser audience. Maybe that's because it speaks to something that we can all understand and in a very well-executed manner. That losing love is simply hell."
    },
    {
      "rating": "7",
      "text": "Memories of \"The Crow\" may forever be marred by the tragic death that occurred during its production, but the impact the film eventually had amongst the populace remains just as much of an unshakable truth. And, though this reviewer feels the movie suffers from several distinctly dated visual elements, a rushed opening act, and some unnecessary camp, it still acts as an unmitigatedly fascinating study of how -- in a way similar to the film's ghostly protagonist -- a seemingly dead production can resurrect itself into something much grander than anyone could have anticipated."
    },
    {
      "rating": "6",
      "text": "Some time ago, I became aware of the existence of this film, but I decided to see it because of its somewhat dark and interesting theme. It turned out to be the movie I saw on my Halloween night, and I'm not exactly sorry. The film is set in a dystopian future, in which the city is dominated by organized crime and the authorities seem incapable of acting and there is a group of thugs that annually set fire to several parts of the city on purpose, in the so-called \"Devil's Night\", just for the pleasure of destroying.In the film, a totally innocent couple are attacked and killed by criminals who break into their home. However, a crow magically in charge of taking Eric's soul to heaven decides to keep it on earth in order to give him time to do what needs to be done: find and punish the killers. It's a simple, direct plot, based on a series of graphic novels that I didn't know about, but it works reasonably well. A particular note, which made this film famous, was the sad death of the main actor, Brandon Lee, as a result of an accident with the film's weapons during a scene in which his character is hit by a bullet.From the cast, it is Brandon Lee who stands out, with a charismatic and committed performance. With this film, the actor achieved the most outstanding role of his career. In addition to him, Michael Wincott also deserves particular commendation due to the dark, grim and cruel portrayal of a crime boss. Sofia Shinas and Jon Polito also show up and do a satisfying job.Technically, the film has several elements of interest, mainly in terms of visuals and special and sound effects. The cinematography is suitably dense, sober and at times gives the scenes a pleasant charge of pessimism and negativity, as if we were inside a nightmare or hallucination. The props and sets help to create the desired atmosphere, gothic and a little threatening, but it is the visual, special and sound effects that deserve the most praise. The film also has good action scenes. The soundtrack, while not memorable, works reasonably well."
    },
    {
      "rating": "0",
      "text": "It succeeds in bringing O’Ban’s comic book vision to life, but there’s little else going"
    }
  ]
}