{
  "id": 4562,
  "title": "The River Wild",
  "starring": [
    "Meryl Streep",
    "David Strathairn"
  ],
  "runtime": 111,
  "genre": [
    "Adventure",
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "While on a family vacation,  rafting expert Gail takes on a pair of armed killers while navigating a spectacularly violent river.",
  "releaseYear": "1994",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mlFa4nZpx5Cxe0K4dhRXpx5LsbJ.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie has a fairly slow start but becomes quite suspenseful. Its a good example of a movie where things go increasingly wrong in a somewhat idyllic setting, as the scenery is quite pretty in parts. The main plus side to this movie is the characters, I'd say - their all quite interesting, having their own quirks and motives. I tried to guess the plot but found there to be a few twists, one or two unexpected. I found the inclusion of the child, Roarke, added to the suspense as often happens having a young child character with their lack of understanding and innocence.This movie has a bit of an old school feel to it, in that its a classic thriller, with loud incidental/classical music (stringed instruments and drums) pieces used to heighten the suspense - some scenes were really quite engrossing, very suspenseful. Also obviously the characterisation and plot are also key staples of this genre, I'd say. There are numerous scenes set at night which also adds to the sinister atmosphere, whereby it can at times be hard to make out everything thats going on and who is where. I found myself quite drawn into this movie after a while, though the pace certainly does take a while to build up (as previously mentioned) but it is really quite engrossing and I found myself 'rooting for the good guys' and on the edge of my seat almost at numerous times. I thought that Gail was well played by Meryl Steep as a very stern, self assured and fast witted woman, often stretched to her limit. Its good to see that the woman isn't completely helpless in such a role, infact in this movie the bad guys are very reliant on her and she tries to use this to her advantage. Also present in the cast are Kevin Bacon as one of the bad guys, plus John C. Reilly (ditto) and Benjamin Bratt, who plays a ranger (Ranger Johnny).The only real downside I felt there was, apart from the pace at the start, was that it was a bit cheesy at one or two points, where the music changes to be a bit too, sentimental is perhaps the word?.Content wise, there are numerous violent scenes, including gunshots and punches, with visibly bloodied faces present. There is some strong language but not much else to offend, from what I recall. This movie carries a 12a rating, which seems fair enough, so it wouldn't be suitable for young children but it should be fine for teenagers and adults to watch.Yes I'd recommend watching this movie as I felt it was a well made thriller movie with some very suspenseful scenes and decent characterisation, as well as a few plot twists. The cast is good and it kept me guessing throughout."
    }
  ],
  "recommendations": [
    "taking_lives",
    "red_sparrow",
    "a_simple_favor",
    "hanna",
    "the_others",
    "blood_ties",
    "run",
    "bad_times_at_the_el_royale",
    "a_walk_among_the_tombstones",
    "a_perfect_getaway",
    "atomic_blonde",
    "i_see_you",
    "broken_city",
    "the_invisible_man",
    "terminal",
    "baby_driver",
    "ready_or_not",
    "big_game",
    "gothika",
    "man_on_a_ledge",
    "street_kings",
    "eli",
    "wrath_of_man",
    "before_i_go_to_sleep",
    "haywire"
  ]
}