{
  "id": 2390,
  "title": "The Fourth Kind",
  "starring": [
    "Milla Jovovich",
    "Will Patton"
  ],
  "runtime": 98,
  "genre": [
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Since the 1960s, a disproportionate number of the population in and around Nome, Alaska, have gone missing. Despite FBI investigations, the disappearances remain a mystery. Dr. Abigail Tyler, a psychologist, may be on the verge of blowing the unsolved cases wide open when, during the course of treating her patients, she finds evidence of alien abductions.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vfnsGUwurUQqlpvArBvUVc9rYXa.jpg",
  "categories": {
    "plot": 2.8,
    "acting": 5.363636363636363,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.4,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Oren Pelli's \"The Fourth Kind\" is not a movie that will scare your guts off, not even till the last moment (like \"Blair Witch Project\" or \"Paranormal Activity\"). Instead it will make you wonder how dumb is the director to direct such idiotic movie."
    },
    {
      "rating": "4",
      "text": "Bottom Line: Two-star alien film fails to impress, rarely thrills.  Admittedly creepy, but also pretty crappy.\r Occasional use of the â"
    },
    {
      "rating": "10",
      "text": "Personally I loved this film, why? Because it is just scary and the scenes from archive are just so real and it kept me on the edge of my seat. Actors played their roles very well and for me this film has got no disadvantages. So I give this film my highest rating."
    },
    {
      "rating": "2",
      "text": "this movie wasn't good at all. it was kind of scary the first time but then i watch it again and it was so stupid. They say this movie based on true events but they dont tell you what events it is based on. No part of this movie is believable. If this movie was real they still didnt do a good job with the story. They was so many missing parts and so many questions.  One of the worst based on true story or true events horror stories ever created.  Don't watch this movie."
    },
    {
      "rating": "1",
      "text": "This film was pretty bad. It was interesting enough for me to look up the actual events. Here is a headline: there aren't any. The whole damn thing is a hoax. The so called people who were abducted were ruled as intoxicated and wandered out into the woods never to be seen again. I'm thinking the director thought we would be stupid enough to believe the \"actual\" footage was real. Here's a headline: the actual footage is fake too. The actress that plays the \"real\" Dr. Tyler during the interviews is a freakn' ACTRESS. She isn't credited but IMDB blew that out of the water. Needless to say, this movie is kaka and I wont be watching anything else from this director."
    },
    {
      "rating": "0",
      "text": "Disappointing to no end. After \"Paranormal Activity\" I watch paranormal movies with new eyes, as for this movie, its terrible. What I hated most about this movie is the fact that the movie is SO bold, it says that the movie consists of ACTUAL FOOTAGE that PROVES THE EXISTENCE OF PARANORMAL ALIENS!! What the hell??? The movie can get violent at times, and its supposed to be real footage, and its rated PG-13!! Are you serious with this s**t? If its real footage, and your going to show the supposed real violent proof, make it rated R! And the people are supposedly real people, they say that they needed to change their names to protect their identities, BUT WE CAN SEE THEIR FACES!! Change their names all you want but we see who they are. I called bulls**t. Yeah, it's pretty terrible. I was looking forward to this movie and I was just DISAPPOINTED. If you like alien movies, don't watch this film, if you like paranormal movies, don't watch this film, if you like sci-fi, don't watch this film, if you like good movies, don't watch this film. Its pretty terrible. I can't recommend this film to ANYONE."
    },
    {
      "rating": "10",
      "text": "La Cuarta Fase (2009)Sinopsis:Desde los años sesenta, un desproporcionado número de personas han sido reportadas como desaparecidas alrededor de Nome, Alaska. A pesar de las investigaciones del FBI, la verdad detrás de estas desapariciones nunca ha sido descubiertas. La psicóloga Abigail Tyler podría estar cerca de resolver estos casos misteriosos, ya que mientras atiende a sus pacientes, ella descubre evidencias de secuestros extraterrestres.Opinión:Esta vez me voy a ahorrar el pseudo análisis mal redactado, porque me he cagado del susto con esta película, no puedo decidir si es buena o mala, pero de que me espantó de la cabeza a los pies es un hecho.Si está basada o no en hechos reales me importa un níspero. ¿Ahora como chucha voy a dormir?"
    },
    {
      "rating": "10",
      "text": "I was so scared! I loved this movie. It had me on the edge of my seat and afterward I felt very unsettled. It had a very creepy feel, and the performances - even the small ones - were fantastic."
    },
    {
      "rating": "8",
      "text": "Terrifying if you go into this cold with no prior knowledge. An average experience if you know of the tricks. We went in cold and really enjoyed it."
    },
    {
      "rating": "10",
      "text": "Milla Jovovich is an Amazing Actress, She can do any Genre she wants. I Loved this movie despite all the bad reviews, and gets us to wonder if Aliens are out there?.?"
    },
    {
      "rating": "4",
      "text": "An owl is \"the most imaginable evil on Earth\" and smells like \"putrid cinnamon\", according to one of Dr. Abigail Tyler's patients, whose description of an alien lifeform sounds so absurd, you start to half-believe that the sleep hypnosis videotapes are indeed real. Truth must be stranger than fiction, the moviegoer thinks, because what screenwriter in his right mind would use an animal so utterly unscary, so closely related to the Harry Potter movies(and books), unless he was forced to, due to the historical record which precludes his own extra-terrestrial inventions. A feral flamingo, perhaps? A penguin, even. Accepting the documentary footage as a non-fiction element, a starting point for Milla Jonovich(as the real-life Dr. Abigail Tyler) and her co-stars to recreate the events seen on video and heard on audio, makes or breaks \"The Fourth Kind\"(a bastardization of the narrative/doc hybrid form used in Shari Springer Berman and Robert Pulcini's \"American Splendor\"), since the moviegoer is made self-aware that his/her suspension of disbelief is a decision that the filmmaker has already predetermined for the audience. Non-compliance with the alien abduction storyline as fact might be beside the point anyway, since the duped and unduped should be equally bored by the sheer hokiness of the archival segments interspersed throughout this relatively glossy docu-drama. Admittedly, the application of an existing academic institution's name in the graphics during a sit-down interview conducted by a writer with the \"real-life\" Dr. Tyler, gives the first-hand account an outward aspect of authenticity, as does the \"name omitted\" device \"The Fourth Kind\" uses during the doctor's sessions with her doomed patients(the same technique to preserve anonymity should have applied whenever the owl gets a mention.), but it all seems so pointless, so laborious, this fabrication, when the film is so lacking in suspense."
    },
    {
      "rating": "1",
      "text": "Hey, it's like this stuff actually happened! No; this movie is obnoxious and spends time trying to prove to you this is real while avoiding a plot build up. I gave it a one for some good CGI effects."
    },
    {
      "rating": "5",
      "text": "The movie is an oddball mixture of genuine scares and inept filmmaking. At points the movie is embarrassingly goofy, but for a few moments there my hair was definitely standing on end. The best bits, I think, are the scenes were the doctor interviews her patients (via hypnosis) and draws out all the things they had tried to forget. Very convincing performances by the actors portraying the patients, for the most part. Jovovich is a competent actress but miscast here, given her spandex-zombie-asskicking background."
    },
    {
      "rating": "8",
      "text": "Horrifying. The first time I watched this film, I felt chills and tingles go down the back of my neck. As a hardcore fan of the Sci-Fi genre, I was completely engrossed with this film. Some scenes are mirrored and occasionally display a dual-frame mode with actors on one frame and the \"real\" victims being hypnotised in the other. The score is eerie and is very befitting of the emotions at hand throughout the film. If you have any interest in extraterrestrials or abduction, this is a fine exhibition into that realm! However, once you realize that the \"real\" footage is all bull, this film becomes less horrifying."
    },
    {
      "rating": "6",
      "text": "This movie comes out at the beginning and out right says that it's real.  Now if you do a little research you learn that it's not so much true.  However if you go into it and just roll with it and let the movie take you it turns into a pretty solid found footage movie.  And the actors in the found the footage did a great job especially the found footage DR.  Overall if you are a fan of found footage you will probably enjoy this movie or if you go in knowing little to nothing about this movie like I did you will have fun with it."
    },
    {
      "rating": "6",
      "text": "Personally, I enjoyed the film. The viewer partial to UFO fiction or interested in the paranormal will get more out of it than the casual viewer will. Fans of Fire In The Sky and Whitley Streiber's book \"Communion\" will love it. Highlights for me are the (fake) \"found footage\" sections which work tremendously well, less is more is used to great effect - similar to The Blair Witch in that regard."
    },
    {
      "rating": "3",
      "text": "It's one thing to imply that a production involving \"found footage\" is real, it's very much another for a movie to explicitly state at the beginning and end that everything in the movie is real, only for you to find out later that it's entirely a work of fiction. This is why Blair Witch worked and The Fourth Wall doesn't. Here we get the usual alien abduction tropes you've seen a million times before, only much worse - with Milla Jovovich as the least convincing psychologist in movie history. Save yourself 90 minutes and watch \"communion\" instead."
    },
    {
      "rating": "1",
      "text": "If aliens exist, for sure, they are insulted with this film.\rCan not scare or make the viewer believe (at least most of them) as they suggest.\rA The Fourth Kind can be horrible, but does not come close of this ****"
    },
    {
      "rating": "5",
      "text": "The whole movie is completely unbelievable. The supposed actual footage is totally fake. You would have to be stupid to believe any of this actually happened. Although it's very insulting to your intelligence, you can't help but get a little creeped out while your watching it."
    },
    {
      "rating": "6",
      "text": "El tema sobre las abducciones probablemente sea de los más difíciles de tratar y plasmar de una manera tan sutil, pero aquí uno termina con varias sugestiones sobre lo que sucede en nuestro universo."
    },
    {
      "rating": "10",
      "text": "Hello from Germany.\r This film is shot class, matching the original materials are very well done.\rOn the whole, the film is well done and prompts the viewer to think.\rMy theory is roughly the same, and I rejoice to such information.\r Dear greetings from Germany"
    },
    {
      "rating": "5",
      "text": "It's always a bit fun when a found footage movie affirms to be real footage and sticks with that claim throughout the film. You get to play along with the filmmakers and hopefully get a satisfying horror flick out of it. Movies like Paranormal Activity and The Blair Witch Project did this well, but some movies are a bit too ardent about their authenticity and come off as silly. The Fourth Kind fits somewhere in the ladder category. In The Fourth Kind, the town of Nome, Alaska is plagued by mysterious disappearances, murders and suicides in the early 2000's. A psychologist, Abbey Taylor, head hypnosis sessions with various patients whose stories seem to have distinct similarities, and Abbey realizes that she might be tormented by the same thing that afflicts her patients. The film mostly mixes found footage with dramatized versions of the footage, sometimes showing the \"real\" and dramatized portions side-by-side. For the most part, it's just aggravating. You'll hear the same dialog from two different actors at the same time on occasion, which begs the question why they didn't either go all-in with the found footage. The found footage scenes are the most intense parts of the films. Not necessarily scary, but they are visceral enough to be memorable. The dramatized scenes are melodramatic and dull. Surprisingly, the movie would have been much better if it was completely found footage. The Fourth Kind has some effective stretches here and there, but it's mostly a half-baked affair."
    },
    {
      "rating": "1",
      "text": "One of the most insulting, misleading and false movie I've ever seen. I never liked the \"base on a true story\" thing that's in every found footage film, but The Fourth Kind pissed me off so much that I couldn't finish it, because the movie sloppily adverse itself as a \"real life story\" of these strange encounters that never happened. The dialogue is laughable, the acting was unconvincing and everything in this movie failed."
    },
    {
      "rating": "7",
      "text": "I have to say I kind of enjoyed this film because yes it is a bit like the X-files, but still, it's an original film, it's well-made in that documentary kind of film, there some truly disturbing moments and mostly, it is genuinely interesting as a whole. Not your average horror flick, I really understand why some people would hate it, but for me, it worked."
    },
    {
      "rating": "2",
      "text": "The technical aspects were brilliant. Creatively some bits are very creepy but it is very fake and unengaging."
    }
  ],
  "recommendations": [
    "the_blair_witch_project",
    "the_pyramid",
    "chernobyl_diaries",
    "monsters",
    "exorcist_the_beginning",
    "event_horizon",
    "the_medium",
    "gamer",
    "sunshine",
    "they_live",
    "sanctum",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "host",
    "world_war_z",
    "pandorum",
    "all_eyez_on_me",
    "paranormal_activity_the_ghost_dimension",
    "unfriended_dark_web",
    "apocalypto",
    "the_cloverfield_paradox",
    "the_matrix_resurrections",
    "color_out_of_space",
    "annihilation",
    "the_conjuring_the_devil_made_me_do_it",
    "a_quiet_place"
  ]
}