{
  "id": 2774,
  "title": "The Mountain Between Us",
  "starring": [
    "Idris Elba",
    "Kate Winslet"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Adventure",
    "Romance"
  ],
  "description": "Stranded on a mountain after a tragic plane crash, two strangers must work together to endure the extreme elements of the remote, snow-covered terrain. When they realize help is not coming, they embark on a perilous journey across hundreds of miles of wilderness, pushing each other to survive and discovering their inner strength.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3XNfYTW4XGscI81nXMSWGsQ8cpu.jpg",
  "categories": {
    "plot": 4.394736842105263,
    "acting": 4.523809523809524,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 2.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "With stunning vistas and cinematography, this had a promising start, with the first act delivering a compelling storyline to become invested in, and a survivalist scenario that feels promisingly insurmountable. And then everything descends into cliched tropes, deviating from any kind of reality, culminating in a final act which is as predictable as it is irritating. Winslet and Elba give solid performances that are sadly hampered by a mediocre script, and ultimately they aren't enough to redeem this sanitised, lacklustre film. 5.31/10"
    },
    {
      "rating": "8",
      "text": "I'm utterly shocked at the reviews I'm seeing on all the big sites - from fans and critics alike. Having read a few, I can only say the issues others seem to have had upon seeing \"The Mountain Between Us\" were, for the most part high points for me. I thought the entire story, the acting, the plot - and especially the pace and arc of the story/characters - were, in a word, perfect. Not a perfect movie, but neither was this a case of \"good for what it is\" movie either (like some of the guilty pleasure movies I've enjoyed for purely escapist value). I found that depth, substance and authenticity pushed \"The Mountain Between Us\" so far beyond the vast majority of pictures with similar descriptions/trailers that it at once satisfies, defies and elevates the so-called survival thriller genre."
    },
    {
      "rating": "7",
      "text": "A touching film, that unites a survival story and a love story. And it's the entangled love story, that make the whole script very interesting and real. If I say it was predictable I wouldn't mean it as a bad thing. Not at all. I don't care if it was predictable, because it was also captivating and I was watching it carefully. And it was interesting to me. The both characters were played brilliantly and that's why the film felt so veritable. Cinematographically, visually 'The moutain between us' is magnificent. And the great thing is that the end was stunning. We all know how hard is to make the end being good and to match the movie. Here we see amazing end, which leaves you without words, with a big smile on the face. The whole love story was authentic for which good directing and good acting play contributed. I really don't get why people expect only drama, bad things happening and sad ending .The things I would recommend is the duration, may be I would have put a little bit more sounds and music, but not much, because that would destroy the authentic sense . I love this movie. It is well done and it did it's job to effect."
    },
    {
      "rating": "6",
      "text": "\"The Mountain Between Us\" is a predictable love story disguised as a survival film, that is nevertheless earnest, absorbing and well acted."
    },
    {
      "rating": "5",
      "text": "So predictable that it hurts, the reason it works a little bit more is because it has two strong leads actors, otherwise this would have been a total disaster."
    },
    {
      "rating": "7",
      "text": "Kate Winslet and Idris Elba play strangers who are stranded in the middle of the snow-covered wilderness after their small plane crashes. The first half features some gripping moments of danger and bleak desperation, but that tension dissipates when their relationship starts to dominate the plot. With lesser actors in the roles, it might have been a sappy disaster, but these 2 have the chops to bring courage and conflict. Even with some predictable twists, this starts promisingly as a riveting survival story. However, the second half can't sustain the tension and loses some of the emotional impact."
    },
    {
      "rating": "4",
      "text": "This film is almost worth watching because of Winslet and Elba, but in the end it is predictable to the point of silliness.  There are a handful of great dramatic moments, and really lovely shots of the snowy Rockies. Stream it, or watch it on a an airplane."
    },
    {
      "rating": "2",
      "text": "Two strangers must work together in order to survive after a plane crash leaves them in the middle of a remote, snow-covered mountain. I wasn't expecting greatness by any means, it's a generic story but so badly executed it's painful to watch. Hard to believe this is Kate Winslet and Idris Elba. I'm still in shock at just how bad they are in The Mountain Between Us. In fact it's hard to believe anything that goes on in this apparent \"survival\" movie.From the opening plane crash onwards you don't believe anything these characters are doing. Nothing they ever say seems natural. Laughable on more than one occasion. But perhaps the most unexpected thing about The Mountain Between Us isn't the dreadful acting and the cringe worthy script. No it's the fact that it features one of the funniest movie plane crash sequences I have ever seen, coming in at a close second after The Mummy. A plane crash shouldn't be funny but somehow The Mountain Between Us achieved that. So bland and unimaginative, no scene has a smooth transition into the next, it quickly cuts again and again to the point where it seems it only takes Idris Elba a couple of minutes to hike up to the top of a mountain and back down again like it was nothing. I'm sorry did I miss something? Maybe I dozed off at some point? But don't worry if you do because Kate Winslet will help you with some plotsplaining. Thanks Kate, you're so considerate to take the time to inform us the audience it's been three days since you've been lost or it's been three weeks etc. Well it's amazing that for three weeks lost in the wilderness Kate and Idris look pretty much the exact same the entire time. Well maintained beard, perfect hair and not a shred of weight loss for people who are supposedly starving. A survival movie? You wouldn't know it. There are people who come home after a weekend at Oxygen looking more haggard than these two. They're never in any real danger so when they're out in these \"dangerous\" situations you're not on the edge of your seat. You're not sitting in suspense, you're bored. And wow did the boredom continue. I did consider walking out, not something I usually do but I definitely considered it. Yet I've watched this much already I have to finish it, so was it worth it? No. I should have left.The Mountain Between Us tried so hard to make me care about these characters. Adding unsurprising details of back story in a desperate attempt to make me understand and care about poor Kate and Idris lost in the wilderness but it failed spectacularly. It's not often you're rooting for the main characters to die in a survival movie but this achieved that no problem. Not recommended, do not waste your time on this absolute rubbish. Better yet watch an episode of Bear Grylls instead."
    },
    {
      "rating": "4",
      "text": "A weird hybrid of survival story and (unrealistic) romance. Neither done very well, not because of the actors who are both excellent. The only thing that made this movie bearable and somewhat interesting was the dog, who deserves to eat hearty chunks of beef for the rest of his life."
    },
    {
      "rating": "0",
      "text": "The story of a sweet, widowed British brain surgeon who ends up having to tolerate a pushy, neurotic American woman photo-journalist through a wilderness survival ordeal that begins as a plane crash. The radical oxytocin bonding that evolves between them, as the outcome of their intense, traumatic 3-week struggle, is then mistaken by both of them to be some form of irresistible 'love', when no man in his un-oxytocin-altered mind could even like such a neurotic b*tch. Whoever wrote, produced and/or directed this utter waste of time should be arrested, forced to pay back the 35 million dollars it cost to make the film and then later invited to study plumbing or some other form of manual labor. Kate Winslet is at her absolute worst. There is ZERO chemistry between these two. Ironically, SHE'S trying to teach HIM the value of following your instincts over logic, when every instinct she has, and that he follows through with and has to rescue her from, ends up being a total disaster, especially for him."
    },
    {
      "rating": "5",
      "text": "Don't rely on anything this movie has got to offer for you. It's quite embarrassing to let people know you're going for a movie that lacks any heartwarming events if you're only in it for those said events. The Mountain Between Us is anything that sends in the score and, whatever it is, one of them includes the huge lack of heartwarming events."
    },
    {
      "rating": "6",
      "text": "“The Mountain Between Us” has all the basics of a Hollywood romance story. The hero and heroine meet ‘cute’ while Kate Winslet and Idris Elba have the chemistry that couple needs. The photography by Mandy Walker of the British Columbia mountains is a standout while Dog, played by two dogs, almost steals the picture from the co-stars.I am a sucker for a love story but when it fails to move you the blame squarely is in the hands of the screenwriters and in this case they are Chris Weitz and J. Mills Goodloe and the director Hany Abu-Assad. While these three throw in a load of calculated missteps and things just seem to happen at the opportune time they are saved by the stars---and the dog.Kate Winslet and Idris Elba make the characters rise above the clichés and, almost, make the movie worth seeing even if they, and they alone, make the lovers believable with both having charm to spare.“The Mountain Between Us” is a basic love story with a twist but even at 105 minutes seems a bit too long and with another cast would have been a complete waste."
    },
    {
      "rating": "9",
      "text": "I find myself totally disagreeing with the critics and with the reader reviews on Metacritic about this movie. I kept waiting for it to bomb, but it never did. And at the showing I attended (which had many more people than I expected – all silent and attentive), someone applauded at the end – too bad I didn’t have the guts to join him/her. No, the film was not perfect, but it was absorbing, partly because Elba and Winslet were completely believable. I didn’t doubt for a minute that they were on the mountain, although I must admit I figured they would get off eventually – and they did keep getting saved from freezing by one thing or another. I would recommend this film, although maybe not to the fan boys at Blade Runner 2049, which I saw the previous day. I must admit I liked The Mountain Between Us a lot better. It certainly was far more believable than Blade Runner 2049 – and I found the original Blade Runner completely believable."
    },
    {
      "rating": "1",
      "text": "Terrible or boring. That is the issue here. Normally they are mutually exclusive. You aren't really bored with a terrible movie....and boring is not terrible its just boring.This movie manages to do both. How exactly I am not sure. A conundrum."
    },
    {
      "rating": "5",
      "text": "The moment I entered the movie theater, I though this movie was based on true events, and I kept thinking that through the entire movie, that was the reasonof why I overlook some things of the movie that they felt exaggerated. But when the credits appeared, I realized that I was wrong, this movie was based on a book, after that, my opinion of the movie was another. Kate Winslet and Idris Elba, they´re both very likeable actors, and that´s the only reason of why we´re interested in what they do on screen, but, if the actors were other people, we would be extremely bored. There are some things that do not make sense, some long scenes and unnecessary scenes. I believe the romance between the two leads though, but again, it was because of the actors. The photography and looks of the movie are great, I felt cold during the movie. In the end, The mountain between us it´s not a remarkable movie, not worthy of your money if you are looking for a good movie, but if you have nothing to do, you can check it out; because overall, it´s not boring."
    },
    {
      "rating": "5",
      "text": "A moving story about survival but completely unreal. We have everything that the viewer needs in a dramatic film and everything that is expected. Unfortunately, this production is bland and very unreal, or at least looks like it. The only good aspect is great photos."
    },
    {
      "rating": "4",
      "text": "Not the worst, but no where near the best for a survival movie.  Excellent acting, decent story, but the directing, MEH.  I've seen better.  I would have rather watched \"The Edge\" for the 3rd time than this."
    },
    {
      "rating": "5",
      "text": "The dog was awesome, otherwise...Massively disappointing movie, the director really messed this up: two great stars, what should have been built in drama (mountains! plane crash! blizzard!) and turned it into essentially a parody of an outdoor adventure/romance. (I couldn't help but snicker around about the 49th time Kate grimaced and dragged her leg across the tundra.) I'm a huge fan of Idris & Kate -- but even their talents couldn't transcend the clunky directing. Long stretches of nothing happening, camera dwelling on a static scene as if it's supposed to mean something. Virtually no thrills in what should have been a gripping tale. Most of the time it seemed as if the director had no clue what to do with the story & gave up, fade to black, everything just hanging there. Because this is my favorite genre (outdoor survival) & two of my favorite actors, I guess I'll give this a five. OTOH, I should give it a 1 because it was such a let down & pretty much a travesty by the time you get to the final cliche."
    },
    {
      "rating": "3",
      "text": "The advertising would suggest that this is a survival thriller. Two strangers having to work together in order to survive after a plane crash and they face epic challenges along the way. At least the trailer would make you think that was what the movie was about. Instead, the movie is actually a badly directed romance disguised as a survival thriller. Both of the main characters fall in love during the journey and it’s all just awkward. The dialogue is pretty bad, there’s odd pauses when Elba and Winslet talk, the pacing is really slow, and the last 20 minutes are completely unnecessary. Not to mention that the story becomes really predictable. It’s all a shame because Idris Elba and Kate Winslet are talented actors. They try their best, but it can’t save this movie. Some action sequences (like the plane crash) and camerawork are well-done, but the predictable story and terrible directing bring it all down. Essentially, this is a big budget Hallmark Channel movie disguised as a survival thriller. If you like those kind of movies, you’ll enjoy this. But as for me, this was a bad movie."
    },
    {
      "rating": "4",
      "text": "This is a deceptive film. It has action, it never seems too unrealistic (except for the bear trap), and it's got romance. The big problem is that the writing makes Kate Winslet completely dependent on Idris Elba to live! The film stumbles because one character isn't played to the height of their intelligence, which isn't interesting to watch. There were many one-liners where I rolled my eyes and groaned. If these re forgivable for you or even entertaining, Mountain Between Us is the movie for you. Not for me: I like it when all the characters are smart."
    },
    {
      "rating": "6",
      "text": "Somewhat bland writing and dialogue takes a promising premise, and makes it progressively predictable and cheesy as it goes on.  The first 15 minutes were interesting, and then a bit more as they struggle, but then it falls into cliche territory, and without excellent writing and dialogue...just becomes OK and rather bland.  Worth seeing if you like survival films though, but, nothing special."
    },
    {
      "rating": "3",
      "text": "Garbage, this movie was garbage. THERE IS A BOOK. There was a story already written! The story is written well and it is highly rated by readers on sites that deal with book ratings. Then someone came along and decided to pervert it. Someone came along and asked themselves: \"how can I take this amazing story and just completely trash it, how I can completely ruin this story so that it resembles the bare amount of the original work.\" What was even the point of buying the story from the author if garbage was all that was going to be created from it? Read the book and skip the movie, there is nothing worthwhile in the movie. What a waste of great acting talent."
    },
    {
      "rating": "6",
      "text": "Maybe if there wouldn't be so many similar movies out there it would have been a great movie, but as simialr themes have been outdone, plus there are many better ones out there, this doesn't really bring anything fresh or that interesting compared to them to the table. The acting is great and the movie is not bad, just that it is not great either."
    },
    {
      "rating": "0",
      "text": "one of the worst romantic movies i ever seen , pathetic , cliche , boring . Totally forgettable"
    },
    {
      "rating": "8",
      "text": "Un film poignant et quelques scènes vraiment sublimes!Un enjeu humain maîtrisé! Le film nous noie dans un océan de neige. Contrastée et belle cette histoire nous emporte dans une course à la survie qui nous emprisonne jusqu'à la fin!Ce film se donne des allures romantiques marquées. Cette évolution va conduire les personnages à faire des choix forts pour la suite de leur vie. Le plus marquant est de voir que les événements n'ont pas seulement changé leurs objectifs de vie, mais tous ce qu'elle était et ce qu'elle est devenue. Un partage en couple exigé pour une belle soirée!Enfant s'abstenir"
    },
    {
      "rating": "4",
      "text": "This movie really felt like it was superficial, and had no real message or movie value to offer. The I think the Idris Elba's and Kate's performance is one of the three thing it's done properly. They delivered the emotions of their characters over to the audience  and it really felt more powerful. The script writing and character writing was as basic as it get's on an adventure movie. The second thing that was really done great where the visuals. Respect for really shooting in practical effects and not blue screen. The pacing issues are aching for attention as the movie unfolds and after the first 15 minutes it becomes painfully repetitive and a chore to watch. The plot was lacking ....everything, or rather anything. It felt so shallow that even at the end it felt that this idea was by far not enough to make a movie on. I have better ideas for movies, which gives you to think about it. The way it was delivered, this simple and shallow plot was delivered in an already seen fashion. Also it was super cheesy and on average the general audience will not be able to take the ending seriously. It's so cliche that it hurts even the actor's performance. The cinematography was the third properly done thing, but sadly the last one. Any other aspect of this movie is just utterly bad.Overall the movie has no message and it can't even be considered action, because there was none. It's movie that was no supposed to be made to a movie, because it was lacking so much plot, and these 3 thing are the elements that save the movie from being a very bad one, and just barely making it pass as a below average one."
    },
    {
      "rating": "1",
      "text": "This was an absolutely shocking movie! I would not recommend you watch this piece of trash."
    },
    {
      "rating": "5",
      "text": "What begins as a promising survival flick turns quickly into a generic romance. There is no chemistry between the main stars and the whole thing feels like a poor man's Gravity. It's visually convincing, but lacks emotions, depth and realism. It drags out and gets repetitive very quickly."
    },
    {
      "rating": "5",
      "text": "This movie was great at the beginning but it turned into another outdoor love story with many cliches and the movie is very unrealistic and is a mediocre lackluster film."
    },
    {
      "rating": "0",
      "text": "Unbelievable story, unbelievably boring. And I just wrote here to get to 75"
    },
    {
      "rating": "0",
      "text": "La peor película que puedes ver un viernes por la noche. Es un despropósito. Más mala que un dolor de muelas"
    },
    {
      "rating": "7",
      "text": "very simple movie nothing innovative but it is good even with a cliché ending that everyone already knew what was going to happen.EVEN BEING THE WAY I TOLD THIS MOVIE, IT STILL GUARANTEES YOU GOOD HOURS OF ENTERTAINMENT"
    }
  ]
}