{
  "id": 799,
  "title": "The Curse of La Llorona",
  "starring": [
    "Linda Cardellini",
    "Raymond Cruz"
  ],
  "runtime": 93,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "A social worker dealing with the disappearance of two children fears for her own family after beginning the investigation.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jhZlXSnFUpNiLAek9EkPrtLEWQI.jpg",
  "categories": {
    "plot": 4.407407407407407,
    "acting": 4.72,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.25,
    "familyFriendly": 3.0,
    "funny": 3.3333333333333335,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "É interessante, um pouco clichê como todo filme de terror mas consegue atingir seu objetivo de trazer momentos de tensão para o público."
    },
    {
      "rating": "0",
      "text": "One of the most soulless, awful, unimaginative piles of garbage I've ever seen. And I've seen a lot. Relies on the same clichéd horror tropes again and again. I've never heard so many creaky doors. It takes the amount of jump scares to a new level too, in fact, that's all there really is. None of the characters behave in a realistic manner either. I had to leave the cinema early. What a waste of money. When you think about all the starving people that could have been fed with the money they spent on this nonsense. Everyone involved should hang their head in shame."
    },
    {
      "rating": "6",
      "text": "It wasn't that bad. Just your run of the mill horror movie with jump scares and a reasonably scary monster. 6 out of 10 for me."
    },
    {
      "rating": "3",
      "text": "\"The Curse of La Llorona\" reduces an interesting folktale into a predictable house invasion horror film. This is disappointing to see, especially coming from the Conjuring Universe. 3.5/10"
    },
    {
      "rating": "2",
      "text": "Not only is this movie predictable, boring, and a color-by-numbers haunted house horror, its weird. This movie revels in its horror, and not in a good way. Its somehow both so checked out and so overly invested. It kind of reminds of The Room in a way. This is a really disappointingly awful entry into The Conjuring Cinematic Universe."
    },
    {
      "rating": "3",
      "text": "Um dos piores filmes de terror que já vi na vida. Um monstro que não dá medo ataca uma família que você simplesmente não consegue se importar. Os jump scare são patéticos e o roteiro é um amontoado de bobagens sem sentido."
    },
    {
      "rating": "3",
      "text": "'A Maldição da Chorona' perdeu a oportunidade de construir um filme coerente sobre a lenda mexicana d'A Chorona, também conhecida como a Mulher que Chora. No século XVII, ela afogou os seus dois filhos depois de perder a normalidade após seu marido a perseguir; desde então, o seu espírito voa em um vestido branco fantasmagórico, matando os filhos de outras mães pobres.Focando na ensolarada Los Angeles de 1973, onde a assistente social Anna Garcia (Linda Cardellini) suspeita de que algo está errado. O problema é que na maioria das vezes, o filme usa pulos de salto imprevisíveis a cada turno e sem falar que havia uma chance para os roteiristas Mikki Daughtry e Tobias Iaconis usarem o curandeiro e as suas poções mágicas para examinar as raízes desta lenda urbana -- ou melhor ainda, dar ao filme uma volta ao princípio da história e como esta maldição influenciou a cultura mexicana. Isso poderia ressoar o público, mas parece não dar efeito. Mas Tony Amendola também aparece como seu personagem de 'Annabelle', Padre Perez no que aparece uma tentativa desesperada do produtor James Wan de fazer A Chorona parte de sua franquia bem sucedida de 'Invocação do Mal'. Ele deve estar brincando."
    },
    {
      "rating": "5",
      "text": "Predictable? Yes. Entertaining, though? Also, yes. Everything about The Curse Of La Llorona screams \"average.\" The acting is good only half the time, the script is good half the time (particularly with the horror thrills), and even the cinematography goes from top-notch one moment to near trash the next."
    },
    {
      "rating": "5",
      "text": "VERY BAD this new installment of The Conjuring Universe. All the cliches of the genre, the weeping woman turns quickly and it breaks bones, that even shows up in the trailer when the child sees her, jump cheap scares and all the same old things that people of today like, like for example everything is silent, suddenly a loud sound and she appears behind you in the shadows. TOTALLY PREDICTABLE. When the girl looks out the door I already knew it was for her doll and voila, that was it. Everything is fortuitous. The stupid shaman that is trying to be funny, the kids behaving so foolish that everyone in the room wanted to punch them, people laughed and they were angry (but that's the script's fault). The other mexican crazy lady that becomes bad and vindictive in order to finish the others, and in the end is redeemed from one moment to another because the plot says. This movie is like a Mexican fast food in the USA that you find in a corner, which is not the REAL FOOD in Mexico. It has good things and I know that there are people who like this kind of cheap fear, and there were some who got scared in the room and even shouted and covered their faces.SPOILER: In the end they kill La Llorona, that's like killing The Bogeyman, totally absurd, that's an urban legend in all Latin America, a folklore, a woman who lost her children and is walking around kidnapping others. You can't kill Baba Yaga."
    },
    {
      "rating": "4",
      "text": "By far the strangest entry in the Conjuring Universe. The only connection it shares with the other films in that world is a brief appearance from Tony Amendola as Father Perez, who you may remember from the first Annabelle. It's a fairly insignificant tie-in however, as outside of that one small reference getting made it largely does its own self-contained thing. So if you're solely interested in watching this to ensure you don't miss out on any aspect of the bigger picture this web of interconnected horror is creating, rest assured this is an inconsequential piece of the puzzle that you won't regret skipping. Not least of all because it's not very good.This could have been a great opportunity to bring a more diverse perspective to theaters due to its use of Latin American folklore and a primarily Hispanic cast. Unfortunately, that potential was squandered by the casting of a white woman in the lead role (showing once again that mainstream Hollywood flat out does not care about women of color) and failure to use the culture in any way to distinguish the movie from your average haunted house flick. So if this was an attempt to bring some representation to cinemas, it's a pretty miserable misstep on that front.Of course it's also not very successful as a horror film either. The titular La Llorona is a particularly loathsome specter as a result of her fondness for drowning children, but Michael Chavez was unable to make her the slightest bit scary. All she ever does is predictably pop out screaming with her arms outstretched, yank people off-screen umpteen times, or simply stand in place and try to look creepy. None of which prove effective at getting the adrenaline going.There's also a weird tonal shift about halfway through. The first portion plays out in a very serious and self-respecting manner. It's not exactly \"good,\" but nowhere near as awful as its reputation would have you believe. When Raymond Cruz's character shows up however, things start to get a bit cheeky. A playful tone creeps its way in and you start noticing the appearance of jokes in what I can only assume was an effort to capture some of the campiness that made The Nun an unexpected blast. It got to the point where I literally turned to the person next to me and asked \"when did this become a comedy?\" The pacing does increase at this point, but just when it looks like it's about to go into high gear it instead abruptly ends as the ghost is defeated in an anticlimactic and unintentionally hilarious manner. It was at this point I realized just how bad and slapped together the whole experience is.This was very clearly just a test run to get Chavez ready to direct the third Conjuring. Because of that it's understandable why Wan and crew were still willing to give him the reigns in spite of how rushed and sloppy this turned out. Unfortunately for us, they missed the fact that nothing he put onscreen was able to raise so much as a single goosebump. La Llorona is a fright-free mess that feels like each of its writers had different visions and instead of coming together split the script duties down the middle, never makes satisfying use of its shared universe ties, and fails to respectfully depict the culture it's borrowing from.4.5/10"
    },
    {
      "rating": "7",
      "text": "If you are a horror fan, this film is more than adequate to hold your interest, I think. It was a bit slow at first, but once it got going, it moved along very well. La Llorona herself was fairly good as “monsters” go, and the cast was very good, including the children. Not great or original, but not terrible either."
    },
    {
      "rating": "3",
      "text": "Lenta, aburrida, predecible, se enfoca mas en los repetitivos screamers que en intentar contar una buena historia."
    },
    {
      "rating": "6",
      "text": "La Llorona, based on the Mexican folktale about a ghost who drowns children, is about a seventies case worker (played by Linda Cardellini) trying to protect her children (played by Roman Christou and Jaynee-Lynn Kinchen) from the titular ghost (played by Marisol Ramirez). Though it picks up in the last act, this movie is rather dull.Beginning exhibition is stilted. Most of the characters aren't interesting, including Cardellini's character and I usually like her work. This is a Conjuring-verse movie. The franchise has done a wonderful job with child characters and actors. Until now. When the horrible stuff starts happening, the kids are just so frustratingly unresponsive to the events around them for a good portion of the film. Only Tony Amendola as a priest has a lively performance and it's a bit part.Movie isn't really scary. Frights are predictable and often uninteresting. La llorona is a very basic ghost character and there isn't much visually interesting about her. I do give credit to whoever worked on her dress. It shifts from white to dirty black really nicely. This is how much I was bored, I was noticing color gradients.There are a few nice shots, but on a whole the cinematography is uninteresting, not to mention the lighting. This is director Michael Chaves' first feature film and it shows. It's not so much a case of being a bad director than an inexperienced one.The reason I'm not giving this a lower rating is that the final act and confrontation with La Llorona is directed a little better and a little fun at times. Raymond Cruz shows up as a healer and he has the only funny lines in the film. His methods to deal with the ghost are kind of interesting including a fun scene involving eggs. There is a transition shot that stands out because it's the best in the film.Overall in the Conjure-verse rankings, I'd put this above Annabelle and below the rest. If you're a franchise completionist, knock yourself out. I wouldn't say there is anything strong enough to deter you. As for everyone else, there are stronger horror films out there."
    },
    {
      "rating": "2",
      "text": "The legend of La Llorona is widely known in Mexico. Believe me I'm Mexican and I listened to it many times when I was a kid and even then it wasn't scary.I suppose this film is an attempt from Warner to connect more with the Latino audience, like what Blumhouse did with Paranormal Activity: The Marked Ones but sincerely 80% of the films in The Conjuring universe are as disposable as they are lousy.This one is no exception and it's understandable. They're easy and cheap to produce. Frankly they studio isn't interested in making a good product. They simply give the audicence their dose of jump scares and that's it.What else can I say? I wasn't expecting anything good and as expected I wasn't surprised with anything that I saw."
    },
    {
      "rating": "10",
      "text": "Best filme are view in minha vida. Love!!!!! BUT IS HORRIBLE ITS APOSTED 20 EUROS IN FILM É IS A POOP"
    },
    {
      "rating": "6",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"
    },
    {
      "rating": "0",
      "text": "Your generic cliched paranormal film. The plot is so shallow it could barely take up 45 minutes of the run time let alone being stretched out for an hour and a half. The \"acting\" is laughably bad and they honestly take this movie way too seriously IMO."
    },
    {
      "rating": "5",
      "text": "To paint by numbers to recommend, even as there are moments that are pretty good. I wish this was a film that took more risks but an interesting tale quickly becomes a standard horror film. Overall a high 5 a C+."
    },
    {
      "rating": "2",
      "text": "probably the worst movie in the 'Conjuring Universe' thus far. Predictable with no genuine scares. The movie seems to trade tension with constant jump scares that fail to spark any fear within the audience."
    },
    {
      "rating": "3",
      "text": "The Curse of La Llorona, or the better titles:La CoronaLa BambaLala LandLa LaundryLonnie LonsLa CarambaLair ownerLow UrineLa YolandaViva La BamLair RondaLa LonnieCredit to YouTube channel CorderyFX for a hilarious video review on this movie - check him out. Anywhere...Why would La Llorona, a Mexican folklore not take place in Mexico, yet the entire movie takes place in Los Angeles? It would be interesting to see a Mexican cast and a Mexican setting for this type of folklore to do the story justice - rather than the repetitive scars we are so use to now."
    },
    {
      "rating": "2",
      "text": "Linda Cardellini's acting is very good but the scares are very weak & not scary at all."
    },
    {
      "rating": "2",
      "text": "Al menos habían uno que otro susto pero prefiero la versión animada porque era más fiel a la historia original y incluso daba más miedo"
    },
    {
      "rating": "6",
      "text": "Stereotypical horror stuff. Kids are unbearably stupid (the door and doll scene, for those who have watched).I refuse to accept that any person is actually as stupid as in these movies. All that being said, horror movies are pretty much a standard formula.Plus sides however: acting was good, Raphael was really good and enjoyable. And some nice jump scares."
    },
    {
      "rating": "4",
      "text": "Pretty BoringConsidering this is set in The Conjuring Universe, I was pretty disappointed in this movie."
    },
    {
      "rating": "2",
      "text": "The most horrifying installment of the Conjuring Universe, oh sorry, my bad, the most horrible one.The Curse Of La LloronaChaves is, I wish I could say, a good adapter. Since, he adapts most of the scenes from the genre itself. The originality objective is left unchecked and the director, Michael Chaves takes the blame for it. The franchise has always bugged me since the beginning. Don't get me wrong, I have been a fan of their mythology, but their flaws is something that draws me into it. They contradict themselves perpetually, their tactics fails and their philosophy lags behind. And yet, they never think of rechecking themselves. I have never seen a film take these many wrong decisions in the first ten minutes, as this one does.Craving for cheap adrenaline shots, the overridden melodrama and irrelevant slow motion takes are clearly off putting. The story searches for horrifying moments or creating jarring impact on the audience, and instead completely forgets to make sense let alone have some rhythm to nod on. Compared to The Nun, it is certainly less animated- which is usually good- but also less scary. The tricks, something you can rely upon the franchise, too is in vacancy in here.The build up of an antic is montage of up close shots of being scared and the execution too loud to catch us by surprise. Even the back story, the flashback, the gist of the film, isn't interesting. The boomerang aspect of the world is probably the best and untouched part of the film, the returning back theme, that Linda Cardellini finds herself in, from her own agency that knocks at her door to finding herself in the same spot that she accused others being at. Speaking of whom, Cardellini is the soul of the film, she whimpers as told and stands up against The Curse Of La Llorona as an improv, hold on to her and you might survive this."
    },
    {
      "rating": "5",
      "text": "E-Value: 5Acting: 7Plot: 4Although marketed as a standalone movie, The Curse of La Llorona is actually the sixth instalment in The Conjuring Universe due to Tony Amendola reprising his role as Father Perez from 2014’s Annabelle and even at one point, mentioned about his experience with the haunted doll. This movie is also a unique instalment because La Llorona, which is an evil entity from Mexican folklore, does not have anything to do with the Warrens at all in real life.Set in the year of 1973, Anna Garcia (Cardellini) is a social worker and a widow with two children, Chris and Samantha, living in Los Angeles. One day while working, she and the social service discover that Patricia Alvarez (Velásquez) locked up her two children in a closet which she claims that she done so to protect them from La Llorona (Ramirez).Patricia’s children are taken from her by the social service while she is sent to jail for alleged child abuse. After her children mysteriously died in a river, Patricia blames Anna for her indirect role in her children’s death and she said La Llorona is responsible for the cause. At first, Anna does not believe until La Llorona set her sight on her next target: Anna’s beloved children.To be honest, this movie is a little bit scary than the first Annabelle movie and 2018’s The Nun. At times, I got freaked out during some of the jump scares. The good thing about this movie is it is a little better than those two movies but still not good enough compared to the first two Conjuring and 2017’s Annabelle: Creation. Michael Chaves has done a good job as director in his directorial debut which kind of makes sense that why James Wan chose him to direct The Conjuring 3. Linda Cardellini’s acting is very good but her character does not have enough development and so does many other characters in the movie.However, the plot of the movie is very underdeveloped. For example, the movie does not explain how Patricia Alvarez and her children were attached by La Llorona. How does a demonic entity from Mexico ended up in Los Angeles? It does not make sense. If Patricia and her children are from Mexico, it would have make sense that they were attached by the demon back in the old country but this is purely my speculation, not to be taken as an official lore. There was no explanation or any backstory at all to improve the plot. The only backstory in the movie is the basic history of La Llorona and that is about it.Since Michael Chaves have been selected to direct The Conjuring 3, he definitely needs to step up his game by having better writers and focus on improving the plot, screenplay, script and character development otherwise that upcoming movie will suffer a sequelitis. Last but not least, this movie would probably be better off as a standalone movie instead of being part of The Conjuring Universe."
    },
    {
      "rating": "4",
      "text": "Whilst the original Conjuring movies have the ability to spook you, this one is directionless and laughable, with the endless creaky doors and Sam actually flying out the front door as your best examples."
    },
    {
      "rating": "2",
      "text": "Jesus Christ this was **** bad I can't remember anything that happened in this"
    },
    {
      "rating": "3",
      "text": "Flat, boring and filled with clichésHonestly I'm surprised with all the good scores in the user reviews. I'm surprised as this was easily one of the worse movies I've ever seen. The acting was subpar, the plot was so incredibly flat and easy to guess beforehand, the dialogue was futile and almost like something a writer threw together in a day or two.If it wasn't for the decent effects, the mostly atmospherical suspense and the children's surprisingly decent acting I'd give this an even lower score. It's that bad. Don't waste your money on this like I did."
    },
    {
      "rating": "5",
      "text": "I cannot consider this as a horror movie. For me it was more like comedy. I gave it a 5 for the story. It is also to be said that you can predict every single jumpscare,but as I said, it is more like comedy, not horror. Overall, it is average."
    },
    {
      "rating": "1",
      "text": "Bad dialogue not scary. Skip this it’s as mediocre as all the other horror films."
    },
    {
      "rating": "6",
      "text": "Spin off της τρομο-μυθολογίας του «Καλέσματος», που σπάει ρεκόρ ρηχότητας διαλόγων, μονότονης πλοκής και μηχανιστικής αναπαραγωγής όλων των φτηνών, πιασάρικων κλισέ του είδους"
    },
    {
      "rating": "6",
      "text": "-I think this is just a movie to hold us over until the new Annabelle comes out, but:The good: semi fresh folk lore type story(only because it’s of a Mexican origin, not many of those), still... not much diff than any other evil spirit lady that takes kids type of movie.There was a verrry quick nod to the Annabelle franchise in the movie...The bad: like I mentioned above, it’s your run of the mill , evil spirit lady in a dress coming for a family/single parents kids. I don’t know how connected this movie is to the Annabelle/conjuring/insidious universe aside from the 5 seconds of showing Annabel and the priest talking about getting help from “the church” (basically referring to the husband and wife team from the conjuring) but I guess we’ll see if they mention this “tale” in the new Annabelle. Don’t know if they can, this was set in the 70s and I THINK the new Annabelle is set in present day, not sure, doesn’t really matter... aaaaanywaay, 95% of all the times La Llorona appears on screen it’s a quick jump scare situation, real quick they never really keep going with the “terror” they had like multiple quick jump scares in a row, instead of just playing it all out. Kinda frustrating, but I guess they had to create as much tension as they could since the story isn’t that unique (most of the movie is cliche anyway)Overall: all the kids were pretty good actors. The adults were standard as well. I saw this movie on a Thursday at 3pm, and this is the exact type of movie you’d watch at that time. It’s, just straight up: a movie that has things you’ve seen before, but this time the characters aren’t white."
    },
    {
      "rating": "4",
      "text": "One question before reviewing the movie: Is “The Curse of La Llorona” part of the Conjuring Universe? Maybe and maybe not, look at Rotten Tomatoes’ List of The Conjuring Universe and “The Curse o La Llorona” wasn’t there but I still think it is because there’s James Wan (as a producer). And guess what, this movie FAILS! And here’re my opinions about it. Initially, the performances are good with Linda Cardellini as Anna Garcia and her two children, Sam and Chris and there’s a woman Patricia played by an actor with the same name. Their acting was the most impressive of the movie. They knew how to scream, how to weep but I wasn’t impressed much with the actor of La Llorona, she should be a lot scarier than how she was in the movie. I like the make-up of La Llorona, a grey face with black tears and yellow eyes, that’s a bit creepy. This movie definitely looks like a James Wan movie. James Wan had some horror masterpieces like Saw, The Conjuring and more. The cinematography, it was okay, how they shot was good, not disturbing or bad at all. I don’t know if they used that much special effects and then I looked at the budget, it’s $9 million, they wasted some.  You know why this movie FAILS? It’s because how I measured the movie in the scare factor, from a scale from 1% to 100%, I would rate this movie 5% scary and that’s the problem with horror movies nowadays, they forgot to make the movie scary, all they did was adding blood here and there, it’s not scary and I wanted to see this in the theatre and then people made stupid decision to rate this R and it’s a waste, just like Hellboy. Even the jumpscares they had were over and over again but none of them worked. The whole movie is totally boring, almost every part of the movie is non-horror. The Conjuring Universe is going to be one of the best horror franchises but all it takes is one substandard spin-off to make you realize just how much craft and care are needed to make these things work right. I really don’t think there’s a reason for this movie to exist. It’s not scary or creepy, it’s just so annoying that I really want to give it a 1 or 0 but nah, good acting, good cinematography as well but still, the movie really FAILS."
    },
    {
      "rating": "3",
      "text": "At the first sequence you immediately understand that's again your soulless typical ghost \"horror\" movie, stupid jumpscare all around and cliché story is all what you'll get in this film. Poorly written and directed, with boring characters and lame technical performances. The original score was just awful as the film, nothing to save here. Do a favor to yourself and stay away from this crap."
    },
    {
      "rating": "7",
      "text": "I Liked it .... maybe not the greatest horror flick ever created ... but still pretty decent ... I have watched tons of horror and sci-fi movies so not all that much surprises me as you learn to expect what's coming next ... this movie had the usual stuff, HOWEVER, the set up was pretty good .... the scene with the Hispanic mother asking the lead actress \"Have your children heard her crying\"  actually gave me goosebumps ... THIS MOVE IS FAR BETTER THAN THE CRITICS ARE SAYING ..... I would give it a least a 6.7 out of 10 ( 5 is borderline I may not watch this to the end, anything less than 5 is don't bother its kinda crappy, 6+ is it's enjoyable and worth checking out... I RECOMEND THIS MOVIE"
    },
    {
      "rating": "6",
      "text": "So I watched this moving thinking \"it will be awesome\" but it was a bit disappointing the acting was a bit bad as well. I did like the storyline though . would not recommend, ONLY to die hard horror film fans."
    },
    {
      "rating": "5",
      "text": "Man könnte diesen Film auch \" Jumpscare- compilation\" nennen. Alle 5 min kommt gefühlt der nächste Jumpscare, woraus resultiert, dass der Film auf 90 min 16! Jumpscares hatte. Zum Vergleich: Ein Conjuring 2 hatte auf 134 min ca. 5-6 Jumpscares und ist einer der besten Horrorfilme. Warum ich trotzdem noch ne 5 gegeben habe? Weil das Monster sehr gut aussieht und die schauspielerischen Leistungen sind okay, sodass der Film genau die Mitte trifft."
    },
    {
      "rating": "6",
      "text": "Add cheap, uncreative scares, with a spirit that only screams and does nothing, along with a story with stupid solutions that come out of nowhere, this is the definition of The Crurse of La Llorona."
    },
    {
      "rating": "0",
      "text": "One of the worst \"horror\" movies I've ever seen. I went into the cinema expecting a regular but funny movie, but ended up bored and even mad of how much I felt scammed by it. Full of jumpscares without any sense, a ghost that has no rules at all, which sometimes it's like a god and can do whatever she pleases, and sometimes it's less powerfull than the people she's trying to... I'm not completely sure what she wants because this movie doesn't even bother to explain you anything, only tries to make you jump over your seat and think: Oh my god what am I watching."
    },
    {
      "rating": "9",
      "text": "NsishsbejwbsbsKippshbsnejensnshsbsnskwksjssnjssbsbjekssjsjshdbbdjdjdjdjsnee"
    },
    {
      "rating": "4",
      "text": "Social worker takes children away from their mother who was protecting them from a ghost trying to drown them so they get drowned and then that mother tries to give the social worker's children to the ghost."
    },
    {
      "rating": "3",
      "text": "I didn't enjoy it. AT ALL. Throughout the movies runtime all I remember doing was joking around with a friend that watched it with me because of how utterly boring the story was. It had weird choices taken by characters, a monster that makes irrational decisions that make no sense whatsoever even if you try to make it make sense, and relies only on the average jump scare to actually try and scare you. I wouldn't recommend watching it if you want to actually be scared but I definitely recommend watching it if you like laughing at movies every once in a while (I certainly enjoy watching Shark Tale every now and again). In conclusion, this feels like a money grab (although it didn't really succeed at this too) since James Wan's involvement make it possible for La Llorona to be part of the Conjuring Universe. Stupid characters, Stupid monster, Cliche... basically disappointing."
    },
    {
      "rating": "0",
      "text": "Worst movie I’ve seen in a long time. Completely unrealistic. Several parts of the movie they leave the kids completely alone knowing this thing is coming after them. Don’t waste your time or money on this garbage."
    },
    {
      "rating": "7",
      "text": "Another solid entry in the Conjuring universe. The characters could have been somewhat better developed but still, it results in a good horror movie."
    },
    {
      "rating": "10",
      "text": "i liked it. I thought it was fun and scary at the same time, one of my favorite."
    },
    {
      "rating": "4",
      "text": "I watched the curse of the weeping woman a Mexican story to keep kids out of the water but I didn't like the movie James wan was better with the conjuring and stuff this piece of s*** movie"
    },
    {
      "rating": "6",
      "text": "Horror movie quite cute and also scary at times as he knows how to make good use of various moments of anxiety. The plot is very simple and impactful although sometimes there are holes or very stupid parts that were sparable. The Llorona is aesthetically done well and scary, it's also cute that it brands people. The role of social workers, on the other hand, is wasted because it leads nowhere and they are useless for the purpose of the plotJoker."
    }
  ]
}