{"id": 2552, "title": "The Lost City of Z", "starring": ["Charlie Hunnam", "Robert Pattinson"], "runtime": 141, "genre": ["Adventure", "Drama", "History"], "description": "A true-life drama in the 1920s, centering on British explorer Col. Percy Fawcett, who discovered evidence of a previously unknown, advanced civilization in the Amazon and disappeared whilst searching for it.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/dgDVkGFltTm1MCoFtlq91r7jwi9.jpg", "categories": {"plot": 6.135135135135135, "acting": 6.7560975609756095, "ending": 7.3, "soundtrack": 7.333333333333333, "cinematography": 6.333333333333333, "familyFriendly": 6.0, "funny": 3.5, "action": 6.333333333333333}, "reviews": [{"rating": "8", "text": "Twenty minutes into “The Lost City of Z” I was thinking of sneaking out and going into the auditorium next door to see “Colossal” but 30 minutes later you couldn’t pay me to give up my seat! Yes it is slow starting but eventually exactly what is happening and what can happen comes over you and peaks when the father and grown son look at each other and say “I love you,” which needed to be said.Basically the story written and directed by James Gray based on the book by David Grann telling the true story of Percy Harrison Fawcett (Charlie Hunnam) a British Major, a career soldier, who believes there is a lost city in the border areas of Bolivia and Brazil, in the Amazon. He leaves his devoted wife (Sienna Miller) and children, one being born while he is in the jungle, without what seem as a second thought and with each trip becomes more addicted to his search.The movie shot in Ireland and Columbia with the former mainly done in English homes and clubs in dark tones while the latter in the jungles brings glorious colors and sights on screen. The times of the early 1900s to the 1920s are brought to real life in production values.Charlie Hunnam, taking over a role originally slated for Benedict Cumberbatch and executive producer Brad Pitt, brings Fawcett to life and leaves a strong impression as the Major, as a soldier, a husband and as a father. Sienna Miller, as the wife, presents a strong woman who seems to want more but accepts her family as her first concern. Their eldest son is played by 3 actors with Tom Holland at the age of 20 who goes off with his father on the last trip and makes a strong impression.Robert Pattinson, almost unrecognizable, is a loyal army comrade giving a solid performance while Angus Macfadyen as a wealthy, obese member of the second trek into the search for the village who almost blows that and future trips.“The Lost City of Z” covers many subjects while taking its time setting up the main premise which will call for patience on the part of the audience member but the payoff is worth it. Be sure to stay for the end credits to find out what happened or didn’t happen.The movie is 2 hours and 20 minutes and could have easily been cut 15 minutes while note should be made of the score by Christopher Spelman which is re-mindful of composers scoring epics in the past."}, {"rating": "10", "text": "A marvellous epic that unexpectedly goes more for an emotional, resonant introspective view of human's psychology than an adventure flick. Its characters are complexely textured and three-dementionalized, and their feelings and desires show us the brightest ambitions and worst dispairs of human race in general. It resonates universally through its characters.The locations are beautiful, as well as the depiction of historical accounts and look and the performances are impeccable."}, {"rating": "8", "text": "It's an old school adventure yarn, and I guess what that means is that it explores remote locations here on Earth before they were ever explored before. Because now they've been explored, so the only way to make a modern day equivalent would be to somehow discover a new place on Earth or something...Anyway, in that sense this is a glorious, gorgeous, deeply transfixing journey that's sometimes best appreciated from a distance. It never quite finds a way to make Percy's madness and desires ours -- we enjoy the journey and appreciate it but we aren't quite transformed by it. But that's best reserved for the bona fide masterpieces and regardless this is still a great work."}, {"rating": "7", "text": "It is a docu-drama about Percy Fawcett, a British explorer of South America, an officer of British Armed Forces. He devoted his life to the quest of a lost civilization in Amazonia in the first quarter of the 20th century.The movie is quite long, more than two hours, and is rather slow to start, later on becomes much more engaging.Other than being a bit too slow at times, I admired it's directing, cinematography and performances.The movie definitely deserves watching."}, {"rating": "9", "text": "Es una película iniciatica, muestra el despertar espiritual del personaje, siempre recto, motivado por su pasión, con gran sabiduria y sin prejuicios para la época, una pelicula que sin duda me sigue dando mensajes aún después de verla. La recomiendo mucho!"}, {"rating": "7", "text": "Some beautiful and hypnotic touches in this but the script and performances from Miller and Hunnam felt fake deep. Pattison was surprisingly great, I could barely recognize him he was so transformed. The score was wonderful. I'd recommend it. Not a masterpiece but it finishes strong."}, {"rating": "7", "text": "He wasn't the first, but came close to let the world know his founds.I don't know what were the people expecting from it, another 'Indian Jones'? Booby traps, man eating ants, ancient alien ship et cetera? Well, I agree it was slow and boring in parts, but most importantly, it was only revealed the true story. Not all the biopics are delightful entertainer. Originally this tale took place for three decades, but what you saw on the screen was merely a highlight. All about the adventures. The personal life was less focused. Especially the final act was honest. Because it is a mystery. So people should appreciate for the effort from the filmmakers.I really enjoyed it. A film like this hard to come by. I mean when a film based on a real person was made a film, people expect the only heroic act, instead of truth. That kind of mindset need to be changed in order to enjoy it. Or else pick the those similar commercial films instead of it. Charlie Hunnam was impressive, probably his film best I've seen so far. He always reminds me Tom Hardy for having a similar facial. There were others in the film, but only he had piloted it.It's weird that it should have been a British film, but Hollywood made it. Above all, the funny thing was they correctly pronounced the Z as Zed. Anyway, that's how the real story was. The jungle scenes were awesome. In many parts it was very suspense like when they had contact with the Amazonia tribes. I was very curious about what would happen. Because all I remember was 'The Green Inferno'. Those who are interested in the history and archaeological expedition, this film would be the right choice, but anticipate reality, not something out of the world.7/10"}, {"rating": "8", "text": "A thoroughly enjoyable, if conventional, film. The acting was excellent, especially Charlie Hunnam and Robert Pattinson (the critics were right – he was almost unrecognizable). Because of the engrossing acting, I wasn’t bored for even a second. Not quite as interesting as Werner Herzog’s Aguirre the Wrath of God, but well worth seeing."}, {"rating": "8", "text": "‘The Lost City of Z’ depicts British explorer Percy Fawcett’s boundless expedition for glory convincingly; with traditional palettes, composed acting of complex characters, and a refreshingly stately pace."}, {"rating": "7", "text": "The story this movie is telling is an exciting one.  However, the movie doesn't really make it exciting.  This is an Indiana Jones kind of story!  The movie tells it in a very matter of fact, mechanical way.  There is some excitement in the quiet, but there nad to have been so much more to this real life tale of exploration in an area few white men had ever been.  I missed that in this movie.  It is very long and repetitive and the war episode could have been left out or shortened greatly.  Loved Charlie Hunnam!  He was perfect as Percy Fawcett.  Sienna Miller is lovely as his tolerant wife.  And I didn't even recognize Robert Pattinson as his companion in exploration!  It is a great story that should be told amd shared.  But, I wish a different director had gotten hold of it and made it the exciting story it should have been!"}, {"rating": "9", "text": "A movie that I had to wait for months to see since our theater didn't show it and does it deliver. This movie was extremely engaging and exciting from start to beginning. The acting from Charlie Hunnam and Robert Pattinson was mesmerizing. The movie also looks fantastic and it reminds me of classic films like Indiana Jones. I can understand why people are split on this, but I have to say this is a Best Picture nominee from me already."}, {"rating": "7", "text": "I after the movie had mixed feelings. On the one hand I expected чтьо it seems Indiana Jones. With another I have received the most realistic travel, with all that it implies from here difficulties. The history is so simple that even you trust in it. But nevertheless in the adventure movie there have to be moments in which there is an action and worry about characters. This action isn't in The Lost City of Z."}, {"rating": "8", "text": "A journey to find a lost city is always about more than finding the city itself. Conquistadors set out to “discover” the Americas and explore the new world for three reasons, “God, gold, and glory”. Facing horrific conditions in the jungle and squaring off with the naturally confused and hesitant natives of the land, the men - for all of their faults - embarked on a journey that changed the course of human history. Yet, being willing to embark on such a journey naturally calls for a man that is willing to get away. One that is willing to leave his homeland and take on such an arduous with the odds being against him ever returning home again. Either disease or conflicts with the natives would prove to be the end for him and others in his party and, as such, is always a journey to find more than a city or explore a civilization. It is a calling for people that are missing something and want to find something in those jungles that is more than a city of gold. What they hope to find is unknown to even them and is one that will undoubtedly forever change their life.Percy Fawcett (Charlie Hunnam) was one such man. Initially sent to Bolivia on behalf of the Royal Geographical Society and British Army in order to end a border dispute between Bolivia and Brazil over where the border actually is between the two, Fawcett quickly becomes obsessed with the Amazonian jungle. In his initial mission to find the source of a river known to the British that holds the key to where the border lies, he stumbles across pottery and a carving in a tree. Around him is nothing but jungle, except for these small trinkets. Upon returning to Britain, he immediately calls for his return to find a lost city he is calling “Zed”. Despite the fact that his wife Nina (Sienna Miller) is pregnant with their second child and his son Jack (soon to be Tom Holland) does not remember him, Percy believes he must go back to the jungle. With the backing of a few investors, he does set out to find this lost city, returning with Corporal Henry Costin (Robert Pattinson), Corporal Arthur Manley), and explorer James Murray (Angus Macfayden). Upon there, illness and a loss of rations prevent them from completing the journey. Finally, years later after spending time in France for World War I, he returns with son Jack to complete his journey for this lost city.However, in spite of its apparent set-up as a film about a man embarking on a life’s journey to find a city and throwing away his family in the process, The Lost City of Z is mostly a character study. Percy Fawcett is a man who has made Major in the British Army at the beginning of the film, but without a medal. He has received some distinctions in the past, but is the only man to have the rank of Major without a medal. Compounded by the fact that his father was a drunk with an infamous reputation that ruined the Fawcett name, Percy first accepts the surveying mission to Bolivia in an effort to restore his name. Calls from Britain for him to return immediately due to adverse conditions on his first trip are met with stubbornness from Percy, who insists on completing the mission given to them nonetheless. Though he loves his wife Nina and loves his children, he is on a search to find himself in this Amazonian jungle. He feels destiny calling him with even a psychic he visits in the trenches of World War I telling him that his soul will never rest until he finds what he is looking for in the jungle. To Percy, this means the lost city. If he just finds the city, he will be okay and will stop hearing the voice in his head to run. However, what he is running to is an illusion. There has been a possible city found there in this century, but it is not what was calling Fawcett. His call what one of self-identity. Who is he? He has no rank. His father was a drunk. All he has is this city and it is the only accomplishment he could ever dream of having that will define his destiny and leave a mark on the world. If he could find this city, he would be remembered and revered for his bravery. If he fails, he is seen as a crazy person who fell for the old “El Dorado” mirage that explorers and conquistadors had fallen prey to throughout time."}, {"rating": "7", "text": "JordanRossReviews: The Lost City of Z – 7/10Rating: PG-13 | Family Friendly: No. 13+ | How to Watch: Streaming“A beautiful film of the life of a brave explorer, with a few debatable changes.”    Percy Fawcett’s story was one I had no prior knowledge of, yet I found inspiring and adventurous as it was told through The Lost City of Z. I can’t remember a film I’ve seen that began with the story of a cartographer, which I thought was an interesting call-to-adventure deep in the Amazonia. A story like this one stirs my explorer’s spirit, but then quickly douses the boy-like fantasy as it reminds how dangerous these explorations could be.    Charlie Hunnam cast as the British explorer was a decision that was questionable to me, although I found out that Benedict Cumberbatch was originally supposed to play the role which would’ve have been much more fitting. I’m not sure if Hunnam is just too American, but his accent seemed a little unnatural. Although at times I thought he really sold the character, there were others when I felt he just wasn’t the best choice for this role. I think he could handle the spirit of the character, but it was more of an issue with his look. Not the worst casting, just not the best. That being said, the casting of the supporting roles were great, and it may have just been me who took a moment to recognize Robert Pattinson as Henry Costin under that thick beard.\tMy favorite aspect of this film was the cinematography from Darius Khondji. Director James Gray made a decision to shoot with 35mm film which I enjoyed immensely. From Cork, Ireland and London, England to the wilds of the Amazonia the scenes were beautiful. Every shot was rich in color and had wonderful contrast. Gray had a vision that he executed with richness and beauty with Khondji. Although the decision to shoot with the 35mm cost the production an additional seven-hundred and fifty thousand dollars and logistical issues I think it was more than worth it in the end.    The largest issue I had with the film was the script. At times and certain scenes I thought the characters motivation and direction was clear, but other times I wasn’t so sure. For example the obsessiveness of Fawcett in finding his lost city seemed under-explained. I wasn’t sure of why he even called it the city of Z until I did my own research. For a man willing to leave his family and life behind he had to have more reason to go back to the dangerous amazon. Historically I found that the story of Fawcett was changed a lot, and Gray focused more on the characters then the actual adventure which gave me even more reason to want a more historically accurate tale.    The scope of the film was huge from the beginning and I think it was inspiring. In the end The Lost City of Z was a beautiful tale of exploration and sacrifice, yet could’ve held truer to the actual events. Even though I didn’t agree with the casting of Charlie Hunnam it was a decent pick when Benedict Cumberbatch had to back out, although I still wish it was a British actor to take the role. The soundtrack was fitting with the amazing photography and the tale of such bravery into the wilds of the jungle rekindled my own sense of adventure. A challenging film to make and one that I’m glad I spent the time to watch. FILM INFO:Genre: Adventure, Biography, Drama, HistoryDirected By: James GrayWritten By: James Gray (Screenplay), David Grann (Book)Release: April 21, 2017Runtime: 2h 21minStudio: Amazon Studios"}, {"rating": "7", "text": "This film its not a masterpiece, but its enternainming adventure and not bad film. Th story is interesting but its a little bit long and slow film. My remarks could be a better film with more naarrative tension."}, {"rating": "10", "text": "A modern masterclass that blends history, fiction and the quest for personal achievement into a delicately crafted 2 and a half hour journey through time."}, {"rating": "6", "text": "Reasonably good adventure film, Hunnam is good though the film is overlong and draggy."}, {"rating": "7", "text": "It's no masterpiece, plenty of good performances around amazing shots and excellent cinematography.  Main issue is the pacing"}, {"rating": "9", "text": "Real fact adventure flick that served as inspiration for characters Alan Quatermain and Indiana Jones. The tireless efforts of Percival Fawcett, explorer and geographer, for finding, perchance, the uncharted last colony of Atlantis. A good choice for a weekend evening."}, {"rating": "7", "text": "This is a very slow starter and a bit overlong but a good spectacle once it gets into it with luscious cinematography and an impressive cast, albeit a tad forgettable."}, {"rating": "7", "text": "The performance is exceptionally and deliberately messy in contrast to the coherent world; what a great match!The Lost City Of ZGray is a beautiful filmmaker. You know that idea of sipping your warm coffee on a rainy Saturday evening and reading a book, that is romanticized in every frame of the film. And if you thought Quentin Tarantino novelizes his films, you have a whole different animal to confront in this incredible journey. Just like a book, this film has a prologue, an epilogue, a first act, a second and a third act. And what keeps a book vocal and engaging are, of course, the dialogues and these narrative decisions of letting these characters take control of the room is what keeps us invested.And this is where the screenwriter and director James Gray scores majestically that delights him and us with little nuanced wins. And in a journey as long as such and character complex as them, you fall in love everytime you are gifted with it. And who'd have thought that what usually is the obligatory part of the storytelling will be crafted as the peak of that act. Which brings me to the next event, something that is already in front of your eyes, but you never capture it.The genre that Gray claims so adorably- yes, adorably- is incomprehensible if even thought of. These are the films that should be commercially successful, you feel that grandeur-ness that is touched by art in every imagery, you'd want such projects to helm charges and not a bunch of Halloween costumes wearers. Not to say that they are not worthy, it is just that you shouldn't be leaving the screen reminiscing that this won't ever make it to the top. The Lost City Of Z is hopefully justified by me in these words, as I too tried to write it like a book, not some rendezvous point in a circle but an end of a line."}, {"rating": "8", "text": "Um belo filme que nos ensina vários aprendizados.A montagem aqui é arriscada. Há passagens de tempo enormes sem muito contextualização, mas aqui funciona bem. Nos sentimos um pouco perdidos, mas nada que estrague a experiencia. Inspirado numa historia real, o filme não peca em aplicar devida profundidade aos seus personagens, que são muito vividos graça aos seus respectivos atores. Robert Pattinson, Sienna Miller, Charlie Hunnam e Tom Holland estão muito bem aqui, e claramente são os destaques.Todo mistério envolvido nos prende o filme todo. Inspirado numa historia real, a impressibilidade reina e a historia toma rumos que nem se quer imaginaríamos - não no quesito de surpresa, mas de rumo mesmo. Assim como o final, que é entregue completamente ao mistério. Todos os temas abordados no filme, como o preconceito da comunidade cientifica, a xenofobia com o podo indígena, toda a ambição de um homem que almeja reconhecimento, a falta que uma figura paterna faz numa família e sua consequência as crianças que pouco entendem do mundo, e até mesmo a emancipação da mulher, que mesmo sendo um tema bem enxergado pelo marido, ainda ficava em torno do fato dela ser sua mulher e mãe dos seus filhos.Enfim, essa é uma aventura que nos faz questionarmos diversos elementos e nos ensina muito a partir dos erros e acertos de um homem."}, {"rating": "9", "text": "Was impressed with the acting all around. Definitely sought out more information regarding if the lost city of Z was ever really found."}, {"rating": "7", "text": "A sweeping biopic that covers the story of Fawcett and his obsession in the search for the lost city.It is overly long and could of been 20 mins or so shorter."}, {"rating": "8", "text": "So far, I have not heard any mainstream commenting anything about this movie, only 1000 people on IMDB comment on it and it sat 10th spot in the box office. I just saw this movie and I was writing my review on Get Out now. But now, I think this is close contender to being my favourite movie of the year so far (My first is Logan) and I hope my review will encourage you all to watch it. It is about British explorer Percy Fawcett (Charlie Hunnam), who journeys into the Amazon at the dawn of the 20th century and discovers evidence of a previously unknown, advanced civilization that may have once inhabited the region. First of all, the cinemograph is absolutely amazing. It sold me from the very first scene. They used a lot wide angled shots and it felt like we are looking every single detail the actors are doing. There were also a lot of long takes, but it is used sparingly and doesn’t feel like draining. There are a lot of movies used long takes, while some works (Creed and Reverent), others feel like it is testing my attention drain (Birdman and Life). This is one is the former. There a lot natural lights and it represented us with best of the Amazon forest which helps to be engaged in its mystery. Speaking of which, I find the music is very haunting, creating a very creepy atmosphere. I think what makes this movie great is the amazing cast. I really loved Charlie Hunnam performance. I am surprised that critics are being so harsh about his performance saying it was uncharismatic. I disagree. Granted there were scenes when he looked bland, but the scene that sold me is when he tried convince the council to fund his expedition. You can tell how passionate he is and putting the doubter in their places, making them look stupid. His performance in that scene excited me. I wasn’t a big fan of Sienna Miller’s acting skills, but she is amazing in this film. She played a woman who has to endure the loneliness of a wife of an explorer and yet she dedicated a life for his cause. She is very sympathetic and is someone you want to root for. The best performance is from Robert Pattinson. I didn’t realize it was him in the film. I am not going to reveal much because I want you to be surprised. All I can say is his performance is good enough to earn him an Oscar. Tom Holland is also good but unfortunately he is not as much as you hoped.  One last note, the emperor from Star Wars is also in this movie. Now that’s awesome. I think it is a great movie, only flaws is that the ending feel abrupt. To me it felt more like a biography for an explorer rather than exploration itself. I highly recommend this movie."}, {"rating": "7", "text": "Tenía muchas ganas de ver por primera vez a Charlie Hunnam en pantalla grande, y efectivamente no me ha defraudado. ¿Y la película? Pues es ahí, donde me dejas más dudas, una película que no puedo a valorarla como un blockbuster, porque, para mí, no lo es.Es una película de aventuras, pero muy oscura, es más adulta y visualmente, tiene un tono a los clásicos. Tiende al cine clásico, en muchas facetas. Aunque se ve de lujo.En cuanto a los personajes, tampoco me quiero extender mucho, es Charlie Hunnam, uno de mis actores favoritos, no hay más que contar, el resto de patrulla, el vampíro de Crepúsculo, para mí sobra totalmente, no aporta nada a la trama. Y el resto de personajes, quitando a la familia de nuestro protagonistas, son unos apáticos que no me dicen nada...En cuanto al guión y demás, me parece una buena película, bien construida y bien montada, aunque para mí le sobra un pelín de metraje al final. Haciendose un poco larga. Los giros y la construcción de personajes están bien llevados.Para acabar, es una buena película, pero le falta algo, le falta alma, está como vacía. Y solo si te gusta Hunnam o el cine de aventuras clásico te va a gustar si no se te va a hacer aburrida. No la puedo valorar como entretenimiento, a si que, un 7."}, {"rating": "4", "text": "Wow, what a disappointment. Also, my wife and I were propelled to see this after all the great reviews. What the heck were they thinking? Did they see a film other than this turgid, slow, boring, plotless, overlong mess?  Two thumb down, way down!"}, {"rating": "10", "text": "It has been a while since I read a book, then followed up watching the movie on the big screen.  I loved the book and enjoyed the true life story of Colonel Percy Fawcett.  What the explorers experienced in the perils of the Amazon were horrific.  The book was very graphic with the descriptions of their encounters especially in the insect form.  The movie as with most going to the big screen from book can't and wasn't able to capture all the details.  Still I found the adaptation to the big screen enjoyable and heard people talking as they exited the movie wondering as to why this movie wasn't getting more press.  I couldn't agree more as I found the movie captavating and was entranced the whole way through, not just because I read the book, but the actors and the story was engaging.  The movie covered more than I imagined on how Percy's family and wife were tormented with his departures into the Amazon and the years they spent without him being a part of the family.  Just glad I got to see the movie as I was agitated that it took so long to get to a local screen.  This movie is worth seeing and recommend that you seek it out, shame on the theaters not showing a movie of this quality!  My only negative was that I wish they would have spent more time shooting in the jungle versus the time he spent at home and on the battlefield in WW1."}, {"rating": "6", "text": "The Lost City of Z deserves a good rating for its cinematography and the fact that it has many spectacular individual moments.. The scenes in the jungle are beautifully shot and fill you with wonder and mystery which I expected coming into this movie. The scene where the explorers stumble onto an opera theater in the middle of the jungle is a great example. Its strange but luring to watch. You're mystified and filled with a feeling of exotic pleasure.The biggest problem however, is that these moments do not come together to fill a cohesive narrative. There's three journeys depicted in the film, which are abruptly interrupted with scenes of British high class people mingling at parties, as well as very underdeveloped scenes of the main character's family. The movie also decided to tackle some WWI action scenes and somehow relate it to the main story, but it all felt very unorganized. One of the WWI scenes shows a fortune teller talking to Fawcett about his destiny to find this lost city while he's with his soldiers in a trench in France. It felt so forced, that I giggled a bit while I was watching it. I mean, he's at war. There's Germans shooting at him. Why do all of his soldiers care about his dumb expedition to the jungle? Go focus on the war...The other BIG reason this movie gets a bump down in rating for me is Charlie Hunnam. Have you seen him in Pacific Rim? He's a horrible actor. He tries to put on his big boy pants for this role, but he's in way over his head. He overacts too much and then loses all subtlety when it matters most. He has this look he always gives.. like this dumb english smirk he does as he thinks \"look I can make good acting faces. See? See me acting like a big boy actor?\" But no one buys it. Robert Pattinson is fine, but doesn't talk all that much. Sienna Miller is pretty good too, nothing to ride home about. The side characters are just there to be side characters, that's it. The jungle scenes do save this movie though, even though each of the three journeys feel rushed and incomplete. If they had made robert pattinson the main character, worked on pacing better, fleshed out the supporting characters more, and made each journey a bit more complete, its a great movie. The ending is unsatisfying, but hey its history. Not much the filmmakers can do about that."}, {"rating": "6", "text": "Hunnam has always came off great as a leader, but he also is compelling as a father in the film's latter stages. Though the acting holds up, the film misses the requisite depth because it tackles so much and doesn't really emphasize anything, let alone emphasizing moments or feelings in relation to one another. The narrative is more a pastiche of vignettes than a cogent tale."}, {"rating": "8", "text": "This is a movie about nature, both human nature, and nature itself.  It is not a fast paced \"action\" movie despite it being about an \"adventurer\".  Once you acknowledge that before hand you can enjoy this film immensely.  Moonlight was the most boring movie I saw last year and it won best picture, this movie was FAR more entertaining.  Definitely the best acting I have seen from Charlie Hunnum and it was well told, and well directed.  (Not perfect- if it were more \"exciting\" I would have given it a 9/10, as its a little long, but works, and is still a solid 8/10 that is going on my favorite movies list.)"}, {"rating": "6", "text": "An English Colonel (Charlie Hunnam) spends much of his life searching for the titular Amazon destination. Although this could have been a tension-filled cinematic adventure, it's rides an even keel with British reserve. Director James Gray never adds much apprehension, even in the most perilous moments. The performances are fine and the history is interesting, but there's not much heft to the drama."}, {"rating": "0", "text": "Whoever edited this movie should never edit a film again. There's too much filler. The needless 10 minute hunting scene in the beginning of the film has absolutely nothing to do with the movie at all. In fact, They time jump ahead a year immediately after it so props on that one.The cast seems barely interested in the stuff they are doing on screen and their performances suffer. The biggest disappointment would be Hunnam. He constantly drops his accent and he really does come off as the odd man out through out the movie, It's pretty hard to watch. There were plenty of times I actually broke out laughing because he was so bad.All in all, Don't watch it. There's not a single redeeming thing about this movie. You are better off putting 2 hours into staring at a wall or watching paint dry. Any of those things would be better than watching this."}, {"rating": "3", "text": "A \"3\" is generous, I think. I can sum this movie up right here: Man ruins his wife's life and squashes her dreams, while chasing his own dream. It's also a lot of white men congratulating each other. Possibly the most boring movie I've ever seen. I never sleep during movies, and actually tried to do so in this one after 1.5 hours. Too effing long."}, {"rating": "4", "text": "I really liked Charlie Hunnam in this movie. He gives a very nice performance. At 2 hrs and 20min,  the movie lacks any real suspense or drama to warrant its hefty length. I found myself alternating between boredom and being relatively engaged. It's not a film that takes you on a journey, rather it's sort of a slice of life, one that's crammed with too much filler and not enough substance. VERY DISAPPOINTED WITH THE CRITICS REVIEW. I feel like they were reviewing a man's life instead of reviewing this work as a film."}, {"rating": "3", "text": "An otherwise interesting film let down by modern hollywood's obsession with political correctness. Acting ok, cinematography ok - overall could have been a lot better. As others have said there might be an ok film in there if at least 45 minutes were cut and it didn't run overlong. A 6 if you like every possible story reflecting PC tropes, 3 otherwise."}, {"rating": "5", "text": "The Lost City of Z; the one place men way back when thought of only as an obscure concept. Uncharted territory will always exist in our world, so who holds the right to claim it? It turns out a whole extra layer of humanity exists in our home called Earth, and it was the achievements of soldier Percy Fawcett who helped us dig deeper. Based on the book by David Grann as well as factual truth, The Lost City of Z aligns remarkable close with real life to tell us about how our past can help us press onward.​Director James Gray (The Immigrant) retells history through the perspectives of whoever influenced the great man’s journeys, including the British council, his three children, and his committed wife. The missus criticizes him for leaving home to explore new worlds, sharing no part of it with them. She wants him to think women have it harder than men, considering the pains of childbirth and house care. Yet she barely knows anything about the true unkind nature of South America’s rainforest, a world ruled by snakes, bats, and starvation.Yes, every character expresses enough inner conflict to keep any man invested along with his wife and son. Although Gray’s feature may just as well best suit male audiences, as the whole family side to the feature gets underused rather poorly; Mr. Fawcett’s three kids hardly have anything to say, let alone any attention. While the oldest, played by Tom Holland (Captain America: Civil War, Lo imposible), delivers a strong treatment, his screen presence offers no justice. He does not give the worst performance ever, but you could still buy into him, unlike the insufferable child who plays the younger pre-teen version of himself.Away from all familiarity, Mr. Fawcett takes on the dangers of the outside world in Brazil’s rainforest. His team goes on the search for a hidden civilization void of previous White folk visitation. They eventually find ancient pottery, only miles away from a native tribe, who quickly become allies. These non-English speakers contribute well to the story, except they receive too little dialogue to leave a true impression on anyone, including the protagonist.In fact, most of the time, these Red-skins are the arrow launching, bloodthirsty savages the British stereotype them as. Their weapon of choice cause unimaginable chaos for these sightseers, including entanglement underwater behind a cloud of blood. It sets all sort of energy upon the screen, guaranteeing an aggressive transportation into the environment, clearly the film’s best moments.Then once the action screeches to a halt, we have the camerawork by cinematographer Darius Khondji (Evita, Se7en) to watch. In fully sincerity, he has created probably the worst efforts of his career—no contrast exists in the already dark and grainy image. He just makes everything green and sunny, even if it means blowing out details in the facial features. Thankfully however, the tremendous eyesore turns slightly merciful three-quarters of the way through the movie. Here, the genre briefly turns into a relatively unimpactful war drama, which still manages to deliver Saving Private Ryan-esque thrills to those testosterone senses.Numerous other traits uplift this average joe of a biopic, such as the believable period costumes and the breathtaking greenery, while others pull it back, such as a forgetful musical score and Robert Pattinson’s acting (progress is being made though). Maybe things could have worked better if Bleecker Street aimed for a hard-R rating, as the Brazilians themselves features all sorts of related red flags: naked overweight women, cannibalism, to name a few. At least nothing appears excessive enough to make any teenagers squirm with immaturity.So now the question remains: “should I bother sitting through a biopic that probably won’t make it past 20 million in the box office?” The Lost City of Z may not be the riskiest motion picture ever made, but it offers precisely what worldwide audiences need while considering the ancestry of ourselves, and how the inadequateness of our self-knowledge points us towards a single reality: we all come from the same soil."}, {"rating": "0", "text": "He DIES!! there I saved you a couple of hours. movie is too long and accomplishes nothing. There's no real conflict or drama. No interesting jungle action. Just a series of false starts that gets derailed by various little stupid incidents. Its just a plodding meaningless movie."}, {"rating": "6", "text": "It's a decent film, just overly long. Jax Teller is particularly good in this one, actually. And it's an interesting story of which I've never heard, so I learned something, which is nice."}, {"rating": "5", "text": "The highlights of The Lost City of Z are that it is entertaining enough to keep you watching it all the way through and its characters are gripping enough to keep you watching as well. However the movie has a couple major flaws. The first of which is the directing is very mediocre  mostly due to the lighting. At many times in what seems to be an attempt to show ambient light the scenes appear yellowish which would be forgivable if it didn't happen again and again. Also the directing never is able to capture the size of the Amazon in a satisfactory way. The second major flaw of the film is it's many blatant historical inaccuracies. The film builds Colonel Percy Fawcett up as this great explorer (which he wasn't) and as a bastion of equality (which he wasn't as well). Normally I can forgive films for some historical inaccuracy so long as it ads to the flow of the film or makes for better story telling but in this case The Lost City of Z puts a man on a pedestal that never should be. He was an abject failure as an explorer that led to the deaths of far to many men that went with him. His \"city of Z\" theory wasn't based firmly in logic as the movie would imply either. To me it's a fatal flaw to make a man into a hero in a film if he was nothing close to the sort."}, {"rating": "2", "text": "Can a movie just be a movie anymore? Do writers and directors feel obliged to have to shoehorn a narrative about contemporary societal issues into every story? It's an interesting story to start with.  Did we need to be hammered over the head with a feminist lecture about equality of the sexes (which I'm all for, by the way)? Tiresome, as if any misogynist was suddenly going to have an epiphany watching this heavy handed schtick anyway.Also the lead actor's diction is painful and he's got the charisma of a wet sock.Also: awful title"}, {"rating": "6", "text": "The number of my score might have been higher if I didn't feel like the movie was stretched out and also I was let down for some of my expectations for how adventurous this movie will be."}, {"rating": "1", "text": "It seems our films are currently plagued with the need to insert politics into them, instead of just telling the story the writers couldn't help themselves by inserting feminism and racism into the films.  Most of the men in the film are depicted as a caricature of boarish racist idiots.  This distracts for showing the film in a realistic way.  The other problem that ruins this film is the mumbling... its hard to enjoy a film when you can't understand what the characters are saying half the time (I actually turned the subtitles on).  The film seems to fail to explain the main characters motivations correctly leaving them paper thin and the film becomes utterly ridiculous when they travel upstream on a river without propulsion... which way do rivers run."}, {"rating": "2", "text": "Overrated. Nothing happens. Poor writing. Way too long. As a viewer you never feel connected to the story. There's no sense of awe or mystery. There's no payoff. It's the Lost City of Zzzzzzz."}, {"rating": "7", "text": "An impressive cast and production value bring the semi biographical screenplay to life. The soundtrack is excellent with decent cinematography. Some odd pacing issues and over used colour grading techniques for my taste aside this was a very entertaining watch."}, {"rating": "6", "text": "I give \"Lost City of Z\" a 6 because, in the end, I would not recommend this film to anyone except a person I did not like very much.  Not that it's bad; it just isn't very entertaining.  Our intrepid explorer sets out to discover the source of a river in \"Amazonia.\"  Call me crazy but traveling upriver by raft seems like a lot more work than hacking a path through the underbrush.  And how exactly do you get closer to the source of a river by traveling downstream, as happens in a couple of scenes?  And virtually nothing is said about how one expects to survive in the jungle for years, except that, at one point, someone shoots a wild hog.And then in the middle of it all, our intrepid explorer, an officer in the British army, goes off to fight in World War One.  Well, you know, it's expected, or so one might say.  But what in the world does it have to do with the actual Lost City of Z?For all that passes by on the screen, very little that seems significant actually occurs.  Our explorer makes not one but several trips into the jungle.  He meets \"indians\".  He records measurements with his surveying gear.  He fights in the war.  His wife sees him off bravely every time he departs and presents him with yet another child upon his return.  And she's there of course to see him arguing with the membership of the Royal Geographic Society over the likelihood of some indigenous people building a great city of gold in the middle of the jungle.Our explorer, you see, is the most open-minded fellow in the group.  For some reason I do not normally think of British army officers from the late Victorian era when the words \"open-minded\" are uttered, or written, but perhaps I'm just biased.The acting is fine.  The visuals are nice.  But ultimately I do not believe that the movie-makers knew very much about jungles or how to survive there or what exactly made this fabled lost city interesting enough to be worth everyone's time.Worse still, the ending is a disappointment.  Try this film if you dare but don't say you weren't warned."}, {"rating": "6", "text": "The story here was pretty decent.  The film seemed to drag at times though.  It felt like a pretty low budget work - borderline cable level documentary / feature film.I'd give it 6/10."}], "recommendations": ["nomadland", "the_book_thief", "everest", "hostiles", "first_man", "unbroken", "the_33", "allied", "the_road", "free_state_of_jones", "the_last_duel", "incendies", "into_the_wild", "jungle", "apocalypse_now", "frantz", "snowden", "the_light_between_oceans", "the_way_back", "donnie_darko", "seven_years_in_tibet", "sin_nombre", "in_the_heart_of_the_sea", "patriots_day", "dark_waters"]}