{
  "id": 15,
  "title": "The Suicide Squad",
  "starring": [
    "Margot Robbie",
    "Idris Elba"
  ],
  "runtime": 132,
  "genre": [
    "Action",
    "Comedy",
    "Adventure"
  ],
  "description": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kb4s0ML0iVZlG6wAKbbs9NAm6X.jpg",
  "categories": {
    "plot": 8.023255813953488,
    "acting": 8.256410256410257,
    "ending": 7.75,
    "soundtrack": 7.5,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 8.04,
    "action": 8.294117647058824
  },
  "reviews": [
    {
      "rating": "10",
      "text": "James Gunn makes his mark in this movie, it is spectacular from start to finish, the action scenes are excellent, the humor is good, and above all, each of the characters stand out, especially Peacemaker, Rat Catcher 2, Harley Quinn, Bloodsport and King Shark.This is a Suicide Squad movie not like that 2016 garbage."
    },
    {
      "rating": "1",
      "text": "This movie is painful to sit through I wouldn't recommend it to anybody.  The action is terrible, the comedy is awkward, If you want a good superhero comedy watch Deadpool.  This movie is also adult and not appropriate for children."
    },
    {
      "rating": "3",
      "text": "Horrible compared to the 2016 film. They should have had Joker in the film. Very slow at times and the fate of some of the characters is questionable."
    },
    {
      "rating": "8",
      "text": "This was a well-made movie and way better than the first suicide squad. The plot was well done, and interesting the part at the end of the US involvement in the project and leading to casualty and peacemaker fight was really well made. James Gunn wrote a great story. THe performance too was amazing. Margot Robbie killed it as HQ and the other characters acting too was great. The casting was spot on. The reworked characters like Rick Flag and others had a good arc than the first one. It was also good to see the movie being cruel and R-rated rather than DC trying to make it Pg-13 allowing the characters to be truly themselves. The last 1-hour fight too was well made. A great movie well done."
    },
    {
      "rating": "7",
      "text": "That Suicide Squad was really more interesting. The story has it's good moments. In particular Harley Quinn was used correctly. More humour and the charisma of Cena/Elba on top of that. The film was a bit long at times. The actions was mostly fine. The music was in tone. The acting was amazing and surely, the most redeeming factor in this movie. I give it 75%. Go see that movie for the actors and how James Gunn got the best out of them."
    },
    {
      "rating": "8",
      "text": "Really cool and entertaining movie really enjoyed the humor in the beginning and the actions scenes were fun. Surprisingly I did not expect much from Ratcatcher 2 but i found her character really well done. For me the star of the movie was obviously Bloodsport and Peacemaker but the way Idris fit in so well between action and comedy showed how good of an actor he is especially with the scene involving him and Viola Davis.Not too sure how some people are complaining about it not having a plot when their mission was explained maybe 3 or 4 times throughout the movie with chapter titles.Id give this movie a 7.5 had some solid action some fun jokes may not work for everybody but it definitely did for me."
    },
    {
      "rating": "10",
      "text": "Fun and enjoyable movie! Loved it! Harley is always the best character. Definitely recommend it."
    },
    {
      "rating": "10",
      "text": "The movie is amazing! Much more better than previous one, funny and crazy. I recommend you to watch it."
    },
    {
      "rating": "8",
      "text": "This Suicide Squad movie actually felt like a movie and not something Frankensteined together by a studio.The movie is darkly humorous, but still serious enough for you to care about the plot and the characters. Even villains unknown to those that might not be familiar who don't read comics, such as myself, were brought alive in an interesting way. Especially Polka Dot Man and Ratcatcher 2 stood out, but all the characters and actors did a great job.Would definitely like another Suicide Squad movie in this vein if James Gunn is behind it, doesn't even have to be this squad. Can just be another squad of anti-heroes and villain protagonist as long as it's half this interesting."
    },
    {
      "rating": "8",
      "text": "I honestly enjoyed it. No woke **** or identity politics? Automatically will be a 7."
    },
    {
      "rating": "10",
      "text": "James Gunn went all out for “The Suicide Squad” as anticipated. It was a joyride for my sis and I. You’ll get really attached to some of the characters in this film. This movie is a must see for comic book/DC fans. Ps. This movie like joker is a movie for certain people. If you don’t like too much violence or a lot of gore this movie may not be for you."
    },
    {
      "rating": "10",
      "text": "an excellent movie, it is full of very crazy moments and crazy scenes.James Gunn has a quirky way of giving his movies personality, I've just enjoyed every moment of this movie."
    },
    {
      "rating": "10",
      "text": "I love this movie, it's perfect in every way and i love all the characters! James Gunn needs to do more dc movies."
    },
    {
      "rating": "10",
      "text": "Very good. Much better than the first. If DC keeps future movies like this one I might actually like them."
    },
    {
      "rating": "7",
      "text": "Um filme muito bom, não é o melhor do DC Cinematic Universe mas está entre os melhores."
    },
    {
      "rating": "10",
      "text": "This movie is sooooooo much fun! I already watched 3 times. Love for Ratcatcher II e King Shark!!!!!!! Harley's scenes are breathtaking!"
    },
    {
      "rating": "8",
      "text": "This was an incredibly fun over the top movie that honors its B-movie heritage."
    },
    {
      "rating": "10",
      "text": "Melhor filme de James GunnTem coração, humor e muita diversãoHá muitos personagens que morrem e deixa uma tristeza muito grande, como o Rick Flag e o Pensador, mas nada que comprometam o quão esse filme é bom"
    },
    {
      "rating": "10",
      "text": "It's amazing. On the top five best comic book movies of all time, no doubt!"
    },
    {
      "rating": "7",
      "text": "While there was a lot in the meandering and excessive plot that was weighing it down, this was a pretty entertaining movie. In the end and after reflecting on it I’d say it does all come together, but I can imagine some viewers feeling like they were put through the paces as even I’m not sure what this movie wanted to be. With it’s very large and excellent cast it felt mostly hindered in the small interactions as there’s something about a James Gunn movie that makes the dialogue feel like dialogue and not coming off as genuine. That’s not always bad with a movie that’s pulled from the pages of a comic and it doesn’t really impede the narrative. You just feel that with the numerous characters so many are under utilized and only on screen as an unnecessary device. That may be because there are so many twists to keep the audience guessing and unaware as to where the story is going, but not everything felt fleshed out. There’s a reoccurring sight gag for a character who describes themself as having mental illness that I just didn’t find funny in the end and I’m still not sure if I’m supposed to. All in all if you have HBO Max and want a dark DC comic movie for a night in, this is pretty good. Just don’t bring the kids. It earned the R rating with constant and gory kills."
    },
    {
      "rating": "8",
      "text": "The 2nd Suicide Squad film really should have been the first, as it perfectly merges humour and action. Although there are far too many ideas, it mostly works as the team does its best to shoot its way out of every scenario."
    },
    {
      "rating": "10",
      "text": "I really loved The Suicide Squad. The Suicide Squad was able to win me over as the best DCEU movie in the first 10 minutes of its run time. The Suicide Squad is unique, not feeling like most superhero flicks before it. Warner Brothers is no longer trying to copy the Marvel Cinematic Universe and it’s working out really well.    The film was able to manage being really dark, without falling into the same traps that the Snyderverse set for itself. The Snyderverse sometimes tries to be extra gritty in an attempt to stand out, but it can sometimes lead to really boring scenes. That’s a comment I make as a Snyderverse fan.    Some other things I liked about the movie were the editing, the cast, and the special effects. I went into the movie without doubts about the quality of the acting and special effects, but I did doubt the editing would be anything to write home about. Thankfully, the movie exceeded all of my expectations in those areas.    I also think that this movie works as a great James Gunn movie. The soundtrack really works well, something you can always look forward to in a Gunn flick. I was worried about the movie possibly using all its jokes in the trailer, but I was dead wrong. The movie is hilarious.    If I had to recommend the movie to anyone, I’d recommend it to comic book fans, people who aren’t turned off by gore, and people who don’t take themselves too seriously."
    },
    {
      "rating": "10",
      "text": "ну что тут сказать, АААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА 10/10 УВЫ"
    },
    {
      "rating": "7",
      "text": "Its a shotgun movie, some of the shots hits and some miss.    Has something for everyone but doubt anyone enjoys everything"
    },
    {
      "rating": "7",
      "text": "After the above average Suicide Squad comes a new one, this time from James Gunn, and I can tell you it's good. In the first few minutes, we're introduced to the characters. They are, in my opinion, better and much more memorable. The best for me is still Harley Quinn, who could not be played by anyone other than the wonderful Margot Robbie. As for the new characters, I quite liked King Shark there. Next up are some excellent action scenes, which are unusually frequent for DC. Aside from being frequent, they are really good and Gunn's hand has made his mark on the CGI here, as Weasel like this reminded me slightly of Rocket from Guardians of the Galaxy. Where else the change in the director's chair was felt is without a doubt the music, which was really great and I devoured some scenes because they were epic, although I would add that there's not much play on any epicness here. In fact, the film throws in one joke after another. If you found 2016's Suicide Squad too \"serious\", then I have good news for you because the darker atmosphere has been replaced with a funnier one. To sum it all up. For me, a good film that has rectified the reputation of Suicide Squad and I wouldn't complain at all if there was a sequel that built on this 2021 Suicide Squad and forgot about the 2016 one. I'm not a hater of the older one. In my opinion, it had a darker atmosphere and smaller doses of jokes that I liked about it. But otherwise, the new Suicide Squad offered us much more and I can recommend it."
    },
    {
      "rating": "7",
      "text": "I had quite some expectations about this movie, and... I was mildly disappointed! What I loved about Gunn' style was funny, wit, irony-fueled dialogues mixed with epicness and wholesomeness; in The Suicide Squad you'll have a just a tiny drop of that. There's a lot of creativity, indeed, and some characters and their actors are wonderful – especially John Cena, who holds probably holds the movie on his own shoulders – but the plot is weak as well as the bond that we manage to create with such characters. A nice movie, but not the small revolution that Guardians was!"
    },
    {
      "rating": "10",
      "text": "It pulled me in emotionally and made me laugh constantly. Each narrative thread satisfies. It pops off the screen. Siskel & Ebert's dead ghost thumbs are sticking straight up for this one."
    },
    {
      "rating": "10",
      "text": "Fanboys are schill attacking this movie.It’s the best f***** movie of 2021 two/thirds of the way in and it isn’t particularly close. People are divided for no reason on the guy who just keeps making great films.10/10 must see, best DCEU film period."
    },
    {
      "rating": "9",
      "text": "James Gunn must really hate birds.John Cena was excellent as Peacemaker.Captain Boomerang deserved better.I have even more reasons to call Harley Quinn my favourite DCEU character.Ratcatcher 2 steals the show.The Suicide Squad is now the best DCEU film IMO.WB execs have FINALLY learned to butt out & just let creatives like James Gunn who love and understand the source material do their thing.Imagine if David Ayer had been given that freedom back in 2016?"
    },
    {
      "rating": "10",
      "text": "The most beautiful film from one of my favorite directors. James shot a great picture. Giving him the opportunity to implement his ideas was a great decision and I am very glad that everything turned out exactly as it turned out. I hope Warner Bros. and then it will give him creative freedom and we will see more films made by the maestro. Applause!"
    },
    {
      "rating": "9",
      "text": "James Gunn back at it again with another hit.Once again Gunn proved himself to be one of the greats when it comes to making superhero/Villain movies. Suicide Squad combines some great light hearted jokes with serious character building and story and tops it all off with a gory joyride of carnage that I would easily recommend to anyone, as long as your not afraid of a bit of blood."
    },
    {
      "rating": "10",
      "text": "holy s**t. I did not expect this film to be this AMAZING. John, Margot, Idris, Daniela, David and Joel...the acting was AMAZING. The gore was on point! wow James Gunn has took DC to a whole new level.  With all honesty, this movie should have NOT been put on stream.  This movie SHOULD ONLY be  for the theaters. Whoever hated this movie has a lack of taste and takes films way too seriously.  This film was done to perfection.  I can not stress this enough this movie is a 10/10 EASILY.  That streaming will cause loss of money due to piracy.  they should NOT have movies like this streaming.  Only theaters!!! DC has figured it out, now they just have to keep the ball rolling!!!"
    },
    {
      "rating": "9",
      "text": "James Gunns Suicide Squad is a zany gore fest that tells a enjoyable story with some of DC most obscure villains as well as some more popular ones such as Harley Quin and Shark king.For me at least the humour landed, the action was mostly good with one scene being the exception and the archs and character development for Polkadot Man, Bloodsport and rat catcher 2 all being satisfying and Silvester Stallones King Shark served as a comedic relief that never felt out of place and the dynamic between characters was particularly good.The film has far more stakes then most movies in the genre with characters dying left and right which makes it all the more enjoyable. It's a good film all around as long as you're okay with a film being a little quirky and crazy."
    },
    {
      "rating": "8",
      "text": "really great movie, was more funny than expected and hope dc can in the future c make more movies like this one"
    },
    {
      "rating": "9",
      "text": "James Gunn is a genius. Finally the Suicide Squad looked exactly what I was expecting it be, countless characters at Gunn's disposal. The plot and story were great, excellent performances from all main characters, and it was nice to see someone bring Waller crumbling down."
    },
    {
      "rating": "10",
      "text": "James Gunn blew my expectations out of the water with this one. Believe the hype, this man knows how to make movies and his take on the DCEU is incredible. Normally, DC movies have a very dry sense of humor, but this movie had me laughing from beginning to start. Loved every freaking character and James knows how to treat them well. Everyone got a spotlight, some very short, and they were all very heartwarming. My favorite was King Shark! Sylvester Stallone who voiced him, really gave him character.Please watch this if you are on the fence. You will not be disappointed!"
    },
    {
      "rating": "7",
      "text": "Worse than the first part. Interesting until the middle. There is only one interesting character, Harley Quinn."
    },
    {
      "rating": "9",
      "text": "The movie is amazing.Pros:1: Great Direction2: Great Visuals (I watched it at IMAX, so maybe that’s why)3: WAY better than the 2016 film (I liked it, but I was more bored with that one)4: FunnyCons:1: Story isn’t anything to write home about2: While I love the majority of the characters, some feel nearly forgettable"
    },
    {
      "rating": "7",
      "text": "You got a telenovela, comedy, satire, action, war, and kaiju film in here. James Gunn's 'The Suicide Squad' is what everyone was expecting five years ago. Sure, there are some dull moments and over-the-top sequences, but the way Gunn makes fun of the superhero genre makes up for it. The best DCEU film since Wonder Woman, in my opinion."
    },
    {
      "rating": "6",
      "text": "I feel ambivalent about this movie. There are definitively pluses and minuses about it: on the plus, the special effects, photography and soundtrack are great, some characters are sufficiently developed, the story makes enough sense. On the minus, the story is a bit messed up, some of the characters could have seen more development (polka dot for example instead of ratcatcher 2), some characters are redundant (Harley, surprisingly), others are \"too much\" and inconsequent (Starro). The movie is okay-ish. Worth a re-view but nothing more. Still lacks the depth of Guardians for instance but still shows a significant potential. A bit long. Some sequences could have been shortened. Still enjoyable to some extent. Oh, and some gore is unnecessary."
    },
    {
      "rating": "10",
      "text": "I tried looking at other peoples reviews for a flaw in this movie. I hate to give out 10's unless they are well deserved. After sleeping and clearing the initial awe of the movie, I was still unable to locate a flaw. Looking at other peoples reviews, their flaws are so goofy. I couldn't agree with anything anyone else was saying on the movie. I highly enjoyed the movie, I do not think one point dragged on for too long, or was too short. The movie was paced perfectly while blending together some great action scenes. There was more humor than normal for a DC movie and it was a welcomed addition. The characters were all likeable. I mean I really can't think of anything I hated or wasn't blown away about. So here I am handing out a 10.... hate to do it but bravo James Gunn."
    },
    {
      "rating": "10",
      "text": "Awesome movie! Just about the right amount of action, drama and comedy!!!!!"
    },
    {
      "rating": "4",
      "text": "This movie is a music video that got too long. A lot of great Scenes that together make no sense. The story is bad. the dialogs are bad, the whole mission in the movie makes no sense, the selected villains make no sense, checkmate makes no sense. Margot Robie is a must see in this movie, Idris Elba is great, special effects great. That is why you watch this movie. Beside this it mixes bad childish jokes that miss the target with glorification of ultra violence. Crap."
    },
    {
      "rating": "5",
      "text": "I would say the only improvement to the first one is that Harley doesnt look like a 2$ hooker anymore."
    },
    {
      "rating": "10",
      "text": "Great Great Great amazing work not for all people"
    },
    {
      "rating": "7",
      "text": "I was solid but nothing spectacular. Never laughed once. It has some good action."
    },
    {
      "rating": "10",
      "text": "It was a really great film a lot surprises, it has good humor and king shark will definitely steal your heart"
    },
    {
      "rating": "10",
      "text": "Awesome movie, much better than other superheroes **** If you love Harley Quinn animated series, you will love this movie also."
    },
    {
      "rating": "9",
      "text": "Well....this movie was insane, I mean really insane, but I thoroughly enjoyed this film. This is more of a comparison than a review, but I will kinda of review it. I'm gonna start with what I think this film did better than David Ayer's Suicide Squad and then say what I think David Ayer's Suicide Squad did better than James Gunn's The Suicide Squad.What I think it did better than David Ayer's film:The Cinematography and the action sequences: By the looks of it the action sequences were done more practically than in Ayer's version, takes were longer and more of the action was visible than Ayer's. The action sequences were beautifully shot, the camera was always following the action so you wouldn't miss much.The Visual Effects & Costume Design: Surprisingly the visual effects in this film was phenomenal, I wasn't expecting it to look as good as it did, especially the CGI character of King Shark, the detail on his skin was mind-blowingly good, he really look real, yes I know he really isn't a regular shark given that he's walking around like a human but that's how good it was to me, plus the big baddie at the end Starro, once you were able to see what it looked like I was stunned at how well it blended in the live action elements, like King Shark the detail on Starro was insanely good. Now the costumes are exactly as I was expecting, when you have characters like Polka Dot Man, TDK, Javelin, and Peacemaker who are some the lesser known DC villain's who you consider C, D, or even lower grade villains of course their costumes are going to be absolutely ridiculous, and they totally are, but they looked amazing, some of them were vibrant with color as given so much detail that they looked awesome. Bloodsport and Harley Quinn's costumes were the standouts for me, I thought Bloodsports mask was freaking awesome, I got a Xenomorph vibe from it which was cool as hell, and Harley's costume felt like it was ripped from the comic pages itself, especially the two tone color scheme.Some of the Lead and \"Some of the\" Supporting Cast: Idris Elba's Bloodsport and John Cena's Peacemaker were real standout among this ridiculously massive and star packed cast, especially how funny the two of them were especially when the two were trying to kill people in a more creative way as a way to prove who's better at killing. Daniela Melchior and David Dastmalchian as Ratcatcher 2 and Polka Dot Man were the emotional core of the film, Gunn really did a great job getting you to really feel for these characters and their backstories. Viola Davis as expected did a fantastic job as Amanda Waller, and Joel Kinnaman as Rick Flag made a HUGE improvement from the previous film, he wasn't as wooden as he was before.Gunn's Signature Style: This film is very reminiscent of Gunn's Style of film from before he did Guardians of the Galaxy, they were screwed up and gory as hell, the fact that Warner Bros let him use that for a comic book movie is actually refreshing in the massive market of comic movies and shows, every now and then you have to change things up to keep it interesting and I'm happy he could let loose with this movie.Now I really didn't like David Ayer's Suicide Squad but I'll admit there are some things I think it did a little better:The Soundtrack: I know it's weird to start this off with that, but to be honest the music in Ayer's version is superior by quite a margin, I listen to a lot it's music still 5 years later, I mean come on, Skrillex, Lil Wayne, Twenty One Pilots, War, CCR, Rolling Stones, Wiz Khalifa, Imagine Dragons, Queen, Eminem! So many artists, it was a little disappointing but I'll admit that a good chunk of the budget for Gunn's version went to that ridiculously massive cast, so this a bit of nit pick.Pacing, The off-putting Animal Cruelty, and Unnecessary Character Deaths: Ok, before I start, the whole Animal Cruelty thing, it's a nitpick also, i just didn't really understand why it needed to in the film, but this is coming from James Gunn's twisted mind, so I guess i should've expected it, but it just a tad too much. Now the pacing was a little slow when  it came to the 2nd act of Gunn's version, but there was a lot of character development that needed to happen, but Ayer's version flowed better in my honest opinion given it was shorter. Finally, them character deaths, when they killed Slipknot in Ayer's version it sucked but it needed to happen, but when Boomerang, Flagg, and Polka Dot Man were killed off, it really didn't make much sense to me, especially Boomerang and Polka Dot Man.Overall, I loved The Suicide Squad, it was an insanely fun and hilarious film packed to the brim with some awesome bloody and gorey action sequences some surprisingly outstanding VFX and a great cast with some awesome on screen chemistry was damn near perfect, but that second act slowed it a tad too much and some of the characters should of have more screen time, but James Gunn delivers it in style."
    },
    {
      "rating": "9",
      "text": "The movie capture perfectly the spirit of the Suicide Squad. Good rhythm and visualy spectacular. Difícilmente se podría haber hecho una película mejor del género y apostando por lo que apuesta."
    }
  ],
  "recommendations": [
    "avengers_age_of_ultron",
    "thor_the_dark_world",
    "hercules",
    "kingsman_the_golden_circle",
    "thor_ragnarok",
    "aquaman",
    "deadpool_2",
    "gemini_man",
    "fantastic_four",
    "rocknrolla",
    "the_a_team",
    "poseidon",
    "thor",
    "nobody",
    "shazam_fury_of_the_gods",
    "the_three_musketeers",
    "the_losers",
    "edge_of_tomorrow",
    "guardians_of_the_galaxy",
    "glass",
    "ant_man_and_the_wasp_quantumania",
    "deadpool",
    "sherlock_holmes_a_game_of_shadows",
    "bloodshot",
    "iron_man_2"
  ]
}