{
  "id": 2766,
  "title": "The Last Samurai",
  "starring": [
    "Tom Cruise",
    "Ken Watanabe"
  ],
  "runtime": 154,
  "genre": [
    "Drama",
    "Action",
    "War"
  ],
  "description": "Nathan Algren is an American hired to instruct the Japanese army in the ways of modern warfare, which finds him learning to respect the samurai and the honorable principles that rule them. Pressed to destroy the samurai's way of life in the name of modernization and open trade, Algren decides to become an ultimate warrior himself and to fight for their right to exist.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lsasOSgYI85EHygtT5SvcxtZVYT.jpg",
  "categories": {
    "plot": 8.8,
    "acting": 8.675675675675675,
    "ending": 9.0,
    "soundtrack": 9.1,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 8.416666666666666
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The movie is uneven. It overwhelmingly gives advantages to Cruise and his Japan Samurais, but it surprisingly does the job smoothly and deftly. In the end, \"The Last Samurai\" is a great movie to watch without thinking."
    },
    {
      "rating": "10",
      "text": "The Last Samurai reminds me of the kind of poetry I used to read in school, well the good poetry. It had the ability to be both profound and silly, uplifting and devestating and it could affect me in the way it toyed with my emotions. The Last Samurai does exactly that as it juxtaposes the blissful serenity of  pre industrial Japan with the horror and devestation brought by the more technologically advanced Americans. The fact that the film follows the viewpoint of an American as he learns the customs of not just the Japanese but the Samurai allows the film to slowly convince the viewer of the beauty of a simple yet disciplined life. The film follows Nathan Algren (Tom Cruise) an American captain charged with training the Japanese army to fight like the more advanced (at least tactically) American forces he belongs to. However Algren is a conflicted character as he is serving a master he loathes (the US army) and because he cannot bring himself to leave, that loathing is only aimed at himself. He has deep regret for his actions as a soldier but also extreme hatred of his superiors and almost everyone around him. Cruise provides one of his best performances as he manages to provide subtle nuances to a character that is already richly written. The film follows Algren though his training of the Japanese army but also his capture and imprisonment by the Samurai leader Katsumoto (Ken Watanabe). Watanabe is the perfect foil for Cruise whose performance is energetic but emotional in comparison to Watanabe who is subdued yet engrossing. Their interaction make the movie as they are written in a way that doesn't preach about why the the Samurai way is much more respectable than that of the ever changing Japan but meerly implies it. The slow establishment of a deep and meaningful friendship (Bromance?) between the two is where the heart and soul of the film lies. Director Edward Zwick sets the right pace for the film as it takes the time to display the beauty of Japan and what the Samurai are trying to hold onto but it also progresses the story at an acceptable tempo so that the viewer doesn't lose interest. The film has a great supporting cast although Billy Connolly seemed a little out of place. Overall the film has a power and emotion unlike many films as it takes its inspiration not just from history but also from nature and the beauty in it. It's a film entirely about redemption and I can think of no better place to do it than the Japanese mountains. Nathan Algren is a lucky man."
    },
    {
      "rating": "8",
      "text": "This story brings some originality to Hollywood, and I think it has been unjustly criticized.  Between the action, the pseudo-history and the character development, The Last Samurai succeeds in taking you away to another world and inspiring you as it does so."
    },
    {
      "rating": "10",
      "text": "My favorite movie of all time, I think it deservers a 10 out of 10.  Now I'm gonna ramble randomly because we are forced to have 150 charachters. Yeah"
    },
    {
      "rating": "10",
      "text": "The critics have totally missed the point here. This film holds key messages that will, if properly understood, have dramatic effects on your own life in a spiritual way. For weeks after watching this movie, which is also very moving, I was spiritually affected. This is not the effect of a poor movie, but a most powerful one."
    },
    {
      "rating": "8",
      "text": "Well this movie isn't as good as some others but doesn't deserve below a 50. The sweet sword action was crazy. The history about it was great. Tom Cruise does a great job playing a Civil War Vet. upgrading the Japanese army to the modern age. The history and action behind it was good. the fights between cannons, guns, and bayonnetes to the armor, sword fighting, and arrows was amazing. I liked this movie, a lot."
    },
    {
      "rating": "8",
      "text": "I thought this was surprisingly good and not entirely violence and bloodshed filled. I liked the interactions with the locals and the, I assume, Asian music played in the background. I thought the performances were pretty decent and indeed I was somewhat surprised to discover Tim Spall playing Simon Graham and also Billy Connolly as Zebulon Gant - an eclectic cast for for a film set in such a foreign land, I imagine you'd agree?.There are some cheesy/cliched aspects to it, no doubt. A number of times Cruise is shown with the typical pensive/deep in thought type look on his face, that or/and the determined expression shows up a lot, which I felt to be a little cliched, or certainly cheesy to say the least.Also, a young child is shown talking to Nathan a number of times - I imagine many a girl/woman/lady thinking they look cute together but I question the credibility/feasibility, of him being able to speak the local mother tongue/dialect fluently for one thing. I'm not a big fan of Tom Cruise, I think its fair to say! still, that and the issues I've raised aside, I will say that the fight sequences are well filmed, with some good martial arts based fighting shown, good choreography and well shot battle scenes. I liked that there is a context shown for these fights/battles, rather than it being one long war/battle film and little else. It did feel somewhat more substantial than, I suppose, I'd expected it to be. Overall it is quite good I'd say, even if your not especially keen on Tom Cruise."
    },
    {
      "rating": "10",
      "text": "This is my favourite movie of all time, gets me crying at multiple moments.There is so much meaning behind everything, so many important moral values being teached here.Seeing Nathan Algren fall in love with the culture & seeing that culture kind-of \"heal his mental wounds\" in return, is so stunningly beautiful.Tom Cruise & Ken Watanabe gave a masterful performance.And the music is in my opinion Hans Zimmer's finest work.The people that are so bothered that a lot of stuff isn't historically accurate, missed the point of the movie completely."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movies of all time, and I don't even like Tom Cruise. I'm not sure why the critics are so far off the users on this one. It is well worth a view, even for a Cruise hater."
    },
    {
      "rating": "10",
      "text": "A profound, beautiful and eloquent film charting the passing of an age. It's beauty and artistry is mostly lost on a population of cynical, soulless, secular critics. Rest assured, this film is a masterpiece, full of magic and power."
    },
    {
      "rating": "8",
      "text": "Tom Cruise isn't my favorite actor, but I think that he does great in this film. This is a very, very well-made movie. The battle scenes are terrific, the score is great, and the acting is superb. Really underrated by critics."
    },
    {
      "rating": "10",
      "text": "Amazing story about a man that comes from a prophecy and merges with the samurai way of life. This movie is a very powerful one and must be watched without prejudice."
    },
    {
      "rating": "9",
      "text": "Tom Cruise plays hardcore role as a hardcore warrior and Edward Zwick gets the job done with very artistic work. In reality, the conflict was between the Samurai and the French Army but as GREAT as it gets, its superbly-written between the Samurai and the British though it would of been perfectly written if the characters weren't that mediocre but the performances are strongly impressive. The Last Samurai is by far, one of Tom Cruise's best."
    },
    {
      "rating": "10",
      "text": "An all time greatest in my book!!! Definitely in my top 5 movies. Go watch it now"
    },
    {
      "rating": "8",
      "text": "To be honest I found this movie the first I've turned on my TV, on the Movie Channel one day. I didn't start from the beginning but I got hooked when I watched it further. The battles in the movie are a gem to watch especially with Hans Zimmer's talents mixed in with them. The last battle with the machine guns almost made my eyes water it was that powerful. Even though it's not historically correct (in other words this is historical fiction) the characters are compelling to watch and the development between Nathan(Cruise) and Katsumoto(Watanabe) are interesting to watch in some ways, and usually when it comes down to movies involving prejudice it does get really old and repetitive pretty quickly but what I haven't seen in movies is the prejudice of beliefs. The conflict to save the old ways of the samurai from the rise of the next century is something we don't usually see in films now a days. It's actually a pretty descent type of prejudice we should see more in movies, battles for beliefs. This movie is also fun to watch because of the samurai culture it shows, made me feel more intrigued to learn more about Japanese culture now.\rBut I digress. So how does the movie turn out? Well I can see why its not the most well known movie (I blame the trailer for that much) but to me this movie is on my favorites list when it comes down to good story telling, an interesting look on old fashioned Japan, the music is beautiful even though at times I do here some of the Pirates of the Caribbean score a little bit, and gives some solid performances and exciting battle scenes. What else can I say but good movie.\rThe final verdict for this movie to me is 4 katanas/5 and for the site I give it an 8."
    },
    {
      "rating": "8",
      "text": "The Last Samurai is a very good movie, but it copied movies like Pocahontas, Ferngully, and Dances with Wolves. Still, great performances by Tom Cruise and Ken Watanabe."
    },
    {
      "rating": "10",
      "text": "A beautifully told story with a focus on a number of emotions and feelings setting apart the honour of the Samurai and the modernization of the country they still longed to protect.\r The film has an abundance of feeling and emotion with brilliant performances from a range of characters on both sides and the stirring soundtrack of Hans Zimmer. I do not understand how critics could give this film such a bad review, the movie is clearly story driven with the plot not being entirely historically accurate. Most critics probably see the box with Cruise as a samurai and just pass it off as him being some random samurai American and tossing it to one side.\r The Last Samurai is very much focused on Katsumoto, one of the last great rebels against the newly modernized ways of Japan, intent on fighting for the emperor and protecting him from such change. Zwick delivers a brilliant story which is paced well across the duration of the film giving the audience a chance to view the conflict from both sides.\r Personally this is one of my favourite films of all time and I say that without really needing to doubt it, any film that sucks you in from the start and provokes and emotional response surely must be doing it's job correctly."
    },
    {
      "rating": "8",
      "text": "Although the storyline is known to the audience, the film still achieved its effect. Thanks to Tom Cruise, The Last Samurai turns to be brilliant and beloved by most of the people, because of it's charm, beautiful details and great directing. It's like the infinite number of war films. They are many of them and many new films continue to be made on the same subject. And regardless of the well known subject, if they are made good, they are successful. I give 8/10, because of it's long runtime."
    },
    {
      "rating": "10",
      "text": "my absolute favorite film!  But of course that's also because I love the samurai setting more than anything.  the story is well told and much love for detail is shown.  but what makes this film so perfect for me personally is the music by hans zimmer, omg just goosebumps."
    },
    {
      "rating": "1",
      "text": "The weeaboo move of the decade, fo sho. Wapanese Scientologist Tom Cruise makes sure to murder Japanese chicks' husband before gettin' with her. Most Honorable movie evar!!!"
    },
    {
      "rating": "3",
      "text": "Visually stunning, particularly in battle, but The Last Samuai never escapes from being a Tom Cruise movie. From the very opening scenes, I never bought Tom Cruise in this role and as the film went on (and on) I was less convinced. And without believing the main protagonist, I never believed the movie. Not to mention the fact that these samurai train all their lives from when they are small boys to be great warriors and over the course of ONE winter, Cruise becomes the best of the bunch, [spoiler omitted]. It's as though the filmakers researched Japanese culture by studying American movies (\"Glory,\" \"Dances with Wolves,\" \"The Matrix,\" etc.) instead of Japanese history. I kept waiting for Katsumoto to ask Tom to take the blue pill."
    },
    {
      "rating": "10",
      "text": "Most underrated movie of all time, if Gladiator is first Last Samurai is definetly the second history movie of all time...love Tom Cruise in this and also Ken Watanbe, THIS MOVIE DESERVES at least 3 or more OSCARS!!!!!"
    },
    {
      "rating": "8",
      "text": "Now, is this the most original film ever? Absolutely not. If you hear that this is an epic action film about samurais with Tom Cruise, you could probably take a very solid guess about what will happen and how it will happen. However, in spite of that, The Last Samurai never fails to entertain for many reasons. For one, director Edward Zwick is underappreciated massively by critics, as he honestly has a ton of talent, especially when it comes to directing films of this type that revolve around their battle sequences. The battle sequences are brilliantly directed, filmed, and choreographed. In addition, the costume design is great and entirely authentic. The interactions between the Emperor, Cruise, and the Samurai, are also all entirely endearing and moving. Tom Cruise and, especially, Ken Watanabe are also fantastic here and truly command the screen. They have great chemistry and really work well together when they share the screen. Finally, it never overdoes it with the action. While this is an action-packed film, it is just as much as about the characters it portrays and the historical elements it tries to factor in as it is about the action. Overall, The Last Samurai is an entertaining love letter to the days where the Samurai reigned supreme in Japan and is a winner in my books."
    },
    {
      "rating": "7",
      "text": "far off the mark in terms of true history, but then again most films are, however none the less there is some great acting in this film, especially from Cruise, and again a well plotted story line that although not true, works"
    },
    {
      "rating": "10",
      "text": "The Last Samurai is one of the most beautiful, spiritual, rousing, epic spectacles you can ever hope to see. It is a masterpiece in every last way a film can be a masterpiece. No film has served as a better ode to the virtues of honor and bravery. This is a movie that will shake your soul."
    },
    {
      "rating": "8",
      "text": "I remember renting this movie from the video store when i was a kid. Superb story and acting! I cant believe that the critics gave so much low scores! If you're still doubting, just look at the user reviews."
    },
    {
      "rating": "8",
      "text": "Really enjoyable movie - watched it back a bit after its release and then watched it again (in class) to help verify the history behind it in relation to what actually happened. I thought the movie was well acted (in general), and was just an enjoyable watch."
    },
    {
      "rating": "10",
      "text": "Epic movie with a beautiful meaning, like \"dances with wolves\". The atmosphere is touching, especially because the japanese culture can be so touching. The music is perfect, the landscapes wow. Great acting by Tom Cruise and Ken Watanabe also.Only the end could be a bit less sentimental and more realistic."
    },
    {
      "rating": "9",
      "text": "The Last Samurai is a stylish, beautifully shot, well-crafted exercise about loyalty and emotional conflict. I have to give it to the film; the transition between the Captain fighting the Japanese and embracing their culture is smooth, and doesn't feel rushed or deliberate. And Cruise is actually pretty good in this one, a wonderful surprise. This is the movie Glory was supposed to be."
    },
    {
      "rating": "0",
      "text": "Preceded by Dances With Wolves which was preceded by Lawrence of Arabia, succeeded by Pathfinder and Avatar, this Mighty Whitey film focuses on Japan for its narcissistic and unrealistic boast of cultural tolerance. Look at Tom Cruise's haircut in the poster. Now google \"chonmage.\" There, now you never have to see this movie."
    },
    {
      "rating": "8",
      "text": "I also don't get the bad critic reviews. This movie doesn't mean to be realistic or historical.It is a beautiful and emotional story with great pictures, amazing music as always by Hans Zimmer and good acting (one of Tom Cruz's best performance in my opinion).Hence, I give it a solid 8."
    },
    {
      "rating": "8",
      "text": "This movie is great. I would definitely recommend it to anyone who is is interested in this culture. In fact, I would recommend it to anyone who just wants to watch a beautiful film. It communicates certain spiritual messages, which either you like or not,but the film is enjoyable either way."
    },
    {
      "rating": "7",
      "text": "I usually feel bad for Tom Cruise during production of this movie. Makes me not want to be an actor.. but I am a critic (everyone is) and I wanted to say.... excellent movie."
    },
    {
      "rating": "8",
      "text": "After viewing The Last Samurai, proves to me that director Edward Zwick had done his research on Japanese history. I thought the design for the movie was done beautifully and was written very well, strong cast, this movie was a thrilling epic ride."
    },
    {
      "rating": "8",
      "text": "Very InterestingThe Last Samurai has a compelling Cruise performance, epic battles, and amazing music from Hans Zimmer."
    },
    {
      "rating": "10",
      "text": "The Last Samurai. Learn the path of a samurai. A film in which, in my opinion, it is perfectly shown who the samurai are. Ken Watanabe who played Katsumoto - discreet, brave and honored, deserves special praise."
    },
    {
      "rating": "9",
      "text": "A clash of changing cultures.This film is set in the late nineteenth century and tells the journey of Nathan Algren, a veteran of the wars against the Native American Indians, to Japan, where he will collaborate in the training of the armies of the Emperor who want to modernize his army in Western patterns. But he will eventually know his opponent, the samurai leader Katsumoto, whom Algren begins to wonder.The opening of the Eastern countries to the West was not easy. China and Japan were two imperial countries with ancient cultures and a special attachment to their traditions, so regarded Westerners with some disdain. What they haven't: advanced military technology. Using the \"diplomacy of the cannon\" and the Opium Wars, the two countries were coerced to trade with western countries (curiously, they already did it, with Portuguese and Dutch, since the seventeenth century, but they refused to open totally to the outside world). When they did it there was a great clash of cultures: if some were displeased, other loved the westerners. This was the case of Emperor Meiji of Japan and this is the historical context in which the film is set.Directed by Edward Zwick (who got here one of the biggest hits of his career to date), the movie features Tom Cruise and Ken Watanabe in lead roles (Algren and Katsumoto, respectively). The two main actors, like the rest of the cast, we can only speak well. Cruise and Watanabe got on well and this was reflected in the way they interact each other. The way both embody the characters was also excellent and we must notice that we're talking about characters with a strong psychological and dramatic load. Katsumoto is an embittered man, considered a traitor by those who only wish to serve in the best way and aware that day will come that he will die without knowing if will be understood. Algren is a man who lives haunted by his own military past, feeling that made mistakes and helped an unjust war against innocent people. Only in Japan he will recover from this depressed state thanks to the bravery and nobility of the samurai. The soundtrack by Hans Zimmer is iconic. The visual and special effects, particularly in combat scenes, are beyond reproach. The costumes were made with all the details and the traditional samurai armor are worthy of special note.For all these positive aspects this film was acclaimed by critics and a successful box office, receiving four nominations for the Oscar (supporting actor, art direction, costume design and sound mixing) and three for the Golden Globes (best dramatic actor, best dramatic supporting actor, best original soundtrack). Its a film that deserves to be seen by all who appreciate the oriental culture, the history or just want to see a good movie."
    },
    {
      "rating": "10",
      "text": "One of the most underrated movies of all time . Tom cruise is great in this samurai epic"
    },
    {
      "rating": "10",
      "text": "I believe this is a powerful movie made even stronger by the amazing soundtrack that draws you into each scene. It is also, in my humble opinion, the best performance of Tom Cruise's career."
    },
    {
      "rating": "10",
      "text": "One of the greatest movies in the history of cinema!9.5/10"
    },
    {
      "rating": "9",
      "text": "The rapport between west and east mentality is well rendered. The slow immersion and understanding of Japanese culture by Cruise is lovely."
    },
    {
      "rating": "9",
      "text": "Critics say that the show is predictable.It is,but that doesn't take away anything from the show, and everything from the pulse raising battles to the subtle,spiritual moments to the silent,stoic romance the develops between Cruise's and Koyuki's characters are beautiful."
    },
    {
      "rating": "10",
      "text": "This was a great movie.  Open up your minds for christ's sakes. It's a movie, meant to entertain. And I was entertained. I wish more movies were like this instead of computer generated flicks of today. Lots of Action, Drama and most of all HONOR."
    },
    {
      "rating": "6",
      "text": "While it certainly is not groundbreaking or original, Edward Zwick's The Last Samurai doesn't succeed in telling a moving story in a well-crafted manner, while the film succeeds in its dull tagline that Zwick was trying to develop. Zwick's target was trying to keep the film as silent as possible. And for its 5th nomination for an Oscar, it should win for horrible producing."
    },
    {
      "rating": "9",
      "text": "Although this movie, as well as almost every other, does not have an original idea, this movie is an astounding display of culture and reality. This movie has been slammed by several critics for Tom Cruise's role. My personal belief is many critics and people do not like Tom Cruise and therefore take it out on the review. While I may not be one of Tom Cruise's fans, his acting was amazing for the part."
    },
    {
      "rating": "10",
      "text": "All the songs matched the scenes in this picture. i enjoyed it very much."
    },
    {
      "rating": "9",
      "text": "I believe that the story that is delivered in this epic has a wide range of emotional connections and sense of Honor, Warrior, Man and Self. This movie transitions a man from inter-conflict as a result of war and shows him transforming to a spiritual understanding that sets his demons free. The result of captivity in learning ones cultural differences and acceptance as a more peaceful one for an individual is moving and irregardless of critical review, makes the film powerful. There are many lessons to learn from this film then and now. It's the best movie of its kind in modern day theatre."
    },
    {
      "rating": "10",
      "text": "they did not have any sort of albino squirrel, YOU GUYS SUCK!!!"
    },
    {
      "rating": "7",
      "text": "Regardless of the wrongful delineation of 'real' Samurai, director Edward Zwick successfully portrays Japanese History in an American view.  Of course, Tom Cruise and Ken Watanabe do a brilliant acting through this movie."
    },
    {
      "rating": "5",
      "text": "Another tired Tom Cruise performance.. or maybe it was the box he was in atm. I guess he did it as well as anyone could for this typically Hollywood \"big\" picture. The other performances saved the movie... Japanese characters were great!Too bad Hollywood makes these unbelievable Superman stories.. instead of a toned down version that would be at least believable."
    }
  ]
}