{"id": 2791, "title": "The Invasion", "starring": ["Nicole Kidman", "Daniel Craig"], "runtime": 99, "genre": ["Science Fiction", "Thriller", "Mystery"], "description": "Washington, D.C. psychologist Carol Bennell and her colleague Dr. Ben Driscoll are the only two people on Earth who are aware of an epidemic running rampant through the city. They discover an alien virus aboard a crashed space shuttle that transforms anyone who comes into contact with it into unfeeling drones while they sleep. Carol realizes her son holds the key to stopping the spread of the plague and she races to find him before it is too late.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/69yA6E7JOKJSfK8JMAOsieCDB8A.jpg", "categories": {"plot": 4.928571428571429, "acting": 5.6, "ending": 5.857142857142857, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.75, "funny": 3.2, "action": 4.666666666666667}, "reviews": [{"rating": "2", "text": "Open up with some potential but can't seem to find any tension for the last 70 minutes. Predictable and boring. Not worth your time."}, {"rating": "0", "text": "A terrible film on all levels."}, {"rating": "0", "text": "Science fiction comedy but unintentionally. A B movie at best. Avoid."}, {"rating": "0", "text": "Cheap message, dorky Craig, usual sterile Kidman and terrible filming, action, suspense and kid plot. One of my top 5 worst movie ever"}, {"rating": "2", "text": "\"Don't go to Sleep.\" \"Don't go Home.\" You will and You'll want to! Pointless remake that has taken away the best elements of the original and replaced them with politcal and philosophical B.S. Just terrible, the worst movie I've seen this year."}, {"rating": "5", "text": "The next generation's remake of an already tired, tired story. The same politics used to make it fresh make it dated."}, {"rating": "8", "text": "Another remake,another deception.Sure the movie has great acting,good action scenes but this series don't need more remakes but Hollywood doesn't seem to understand that.But,the movie in general was actually pretty good."}, {"rating": "2", "text": "It has some tension and potential, but terrible dialogues, predictable scenes, so full of cliches, stupid  speeches. Disappointing overall."}, {"rating": "7", "text": "The invasion has cool effects and a strong performance from Nicole Kidman. People are infected in the\rmovie and they become aliens. Nicole protects her son and herself from the infection. Overall the movie\rIs watchable but unoriginal, grade B."}, {"rating": "10", "text": "Kidman is fantastic, as is Craig. These two have amazing chemistry together!"}, {"rating": "9", "text": "Nothing can compare to the 1956 and 1978 versions, but this one was pretty darn good. Don't stay home because of the critics. Check it out and enjoy the ride."}, {"rating": "9", "text": "I'm going to raise my vote just to counter all the negative votes out there. This movie wasn't that bad! If you go into this movie already comparing it to something else, you already have set a bar that you expect to be met, and really, who are you?Taking the movie on its own merit, it was fine. It was entertaining and never dull. And Nicole Kidman was believable and looked as beautiful as ever."}, {"rating": "6", "text": "Watchable. Nothing brilliant or spectacular. I found it very funny that people barfed to infect others."}, {"rating": "7", "text": "yes, the movie has some flaws. But for the most part of the movie, it does create a scary atmosphere where people are taken over. I'm not a fan of Kidman, But I thought she was great in this movie! I would of liked the ending to be different. But overall a big surprise to a movie that only received a 45 percent average on metacritic."}, {"rating": "10", "text": "This movie simply did not get the promotion it needed! The plots is great and Nicole Kidman is awesome in it!"}, {"rating": "10", "text": "I liked it¡ it is entertaining and keeps your eyes in the screen... good performances."}, {"rating": "10", "text": "Nicole Kidman shines in this movie and so does Craig. Don't believe all the bad hype surrounding this movie cause it's not true! This is the end of the summer blockbuster that will sweep you off your feet!"}, {"rating": "9", "text": "The best summer action movie of the year. It was really good, and the action was top notch, but the 9 comes with the writing, the acting is superb!"}, {"rating": "9", "text": "A good movie, but not a great one. Nicole Kidman is back and more powerful than ever, though I believe she was never gone."}, {"rating": "8", "text": "A very pleasant surprise. Quite scary at times, with an ending almost as unsettling as the famous 1978 one, but in a much more subtle and quiet way. Nicole Kidman makes the whole thing believable. With this one performance, she more than makes up for \"Bewitched\" and \"The Stepford Wives\"."}, {"rating": "10", "text": "Cool movie. Nicole Kidman is good, but the movie belongs to Craig, for his amazing acting. The movie was great, amazing, and the best of the year. It moved quickly and the script was beautifully written."}, {"rating": "10", "text": "Fast paced, A+ action. Ms. Nicole seems to be back and is stealing everything with her. She is great. If you liked the Others you will love this movie!"}, {"rating": "9", "text": "A different thriller movie, Nicole always as the best of the film."}, {"rating": "9", "text": "So it's not the 1978 Donald Sutherland/Veronica Cartwright horror-masterpiece, (which critics hated in 1978, by the way) it's a darned good creepfest. And, hey, it also features Veronica Cartwright! Nicole Kidman is icily proficient as a shrink, and Daniel Craig adds sex appeal as her best friend/would-be boyfriend. The \"tips-of-the-hat\" to the 1978 feature are numerous and admirable...the spore zombies are frightening...the message will resonate with everyone except Republicans. Personally, I think it's one of the better horror films to hit the screen in quite a while. Far superior to the idiotic \"1408\", which the befuddled blowhard critics seemed to love. The family values are a bit heavy-handed, but what film post-1980 has been able to escape the obligatory mother-child bonding? And, yes, a few less car crashes and more moodiness would've been an appreciated... but, I still found it a suspenseful, well-acted, nicely filmed treat. Don't compare it to the Kevin McCarthy original. Don't expect the killer ending of the Sutherland version...just sit back and go for a creepy ride."}, {"rating": "8", "text": "This movie was pretty good. I was surprised that it would be this good. It had good acting awesome action.. the ending was kinda... like made at the last second i think. But it still gets an 8 from me!"}, {"rating": "7", "text": "After the first 20 minutes I thought this will be a lousy and pointless remake, but then it surprised me: the dialogue improved and the characters became more compelling. By the end of the movie I was pleasantly surprised. Kidman was great as Dr. Benell and her plight drew sympathy and had tension. Overall, this remake wasn't as good as the 1956 and 1978 versions, but wasn't as bad as some critics said. Give it a try."}, {"rating": "9", "text": "Okay, just as a point of reference, the Metacritic score for \"The Host,\" the South Korean \"thriller\" released earlier this year, is 85, and the score for \"The Invasion\" is, as of 08/18/07 at 1:23 AM PST, 48. \"The Host\" was a poorly acted, agonizingly boring genre mish-mash that was appreciated in South Korea solely for the fact that it bashed the U.S; pretentious, gullible critics here salivated over it just because it was foreign. If \"The Invasion\" had been Czechoslovakian, it would have received a Metacritic score of 95. But because it's American, and because everyone's decided to start hating on Nicole Kidman, it gets snarky reviews from self-important windbags who wouldn't know a good thriller if it sat on their heads. This latest version of \"Invasion of the Body Snatchers\" lost me slightly only in the car chase near the end, which seemed designed to appease the adolescent male demographic; up to that point, the film was breathtakingly suspenseful, well-paced, brimming with dread, cleverly updated to make it resonate with current political events and sociological trends, and even, at times, poignant. It was also terrifying. Great acting from Veronica Cartwright, Nicole Kidman, Celia Weston, Daniel Craig, Jackson Bond, and others made the terror painfully human."}, {"rating": "8", "text": "I loved this movie, but I'm pre-disposed to enjoying apocalypse-type films. I liked that, in the age of gore-filled horror, Invasion plays with your mind to create suspense."}, {"rating": "3", "text": "This movie's premise is so trite that I figured it would make up for it somehow. Well, the all-star cast didn't do it. So, yeah. It sucked. The structure was terrible. All sorts of build up, then a climax and falling action so short and unsatisfying it leaves you blinking stupidly. It ends on the APPARENT note that the humans are innately flawed and they are doomed as a species. So what, Mr. Director? Do you want us to become infected by an alien virus with vague intentions? Or do you want us to become absolute socialists and shed all human qualities? What saves this movie from a one is a few thrilling scenes, and their ATTEMPT at a philosophical message. I'm glad I didn't pay for this thing."}, {"rating": "6", "text": "Very good movie, kept you on your seat, but nothing scary scary"}, {"rating": "9", "text": "Loved it, but somethings could have played out differently."}, {"rating": "8", "text": "not as bad as everyone says, very good acting from Kidman and Craig, good chemistry. enjoyed the creepy modern touch and comments on society today. Kidman was superb and believable as a doctor and mother who was trying to protect her child. enjoyed seeing veronica cartwright in this remake as she was in 1978 version."}, {"rating": "9", "text": "Reading these \"0\" and \"1\" reviews, I can't help wondering how many were written by disgruntled Scientologists out to smash the former Mrs. Cruise's career... Why else so much Kidman-bashing? It's a great bit of entertainment, this film, with a resonant message. Especially, I'm sure, for Ms. Kidman, who must've felt a little like Dr. Bennell, whom she portrays, during her marriage to Cruise. Pods = Scientologists, perhaps? Trying to save her child from the \"cult\"? Interesting that so many Users call Travolta's mediocre performance in \"Hairspray\" a revelation, but Kidman's is reviled. Conspiracy theory? Or maybe a bit of art immitating life? Anyway, go see this film. It's not as perfect at the 1958 or 1978 versions, but it's a creepy, atmospheric nail-biter that is far superior to the dreck studios have been releasing lately and calling \"horror\". Kidman is excellent and convincing as a psychologist, Craig is a dashing hero, Veronica Cartwright is, as always, jittery-perfect. The nuancd background activities are perhaps the eeriest part of the film, and make the car smash finale forgivable. See it!"}, {"rating": "10", "text": "This film is the latest in the remake series of Jack Finney's The Invasion of the body snatcher's, in my opinion this one is the bests out of all of them, when Invasion of the Body Snatchers came out in 1956 it instantly became a sci-fi horror cult classic marking it's place as one of the greatest sci-fi films of all time. The Invasion does not fall short of brilliance, albeit they change the story around a bit to suit 20st century audiences, they changed how the virus came to earth, in the 1956 version it was pods, in this one it was a space shuttle that was carrying spores that pass form human to human. But the Invasion is not a terrible sci-fi horror film, it amazingly quite well done, considering the talent this film drew( Nicole Kidman, Daniel Craig, Jeffery Wright & Jeremy Northam.) it's a stellar cast for a stellar movie. The Invasion doesn't hurtle trough it's story, it takes it time to explain and tell it trough a mild pace that quickly speeds up as the story progress, this film explores another aspect of an attempt to take over the world, where as most films that takes the same approach begin it with a mass alien invasion of our planet, this film strives from that and approaches a more quieter and less destructive approach to taking over our world it follows a virus that while you sleep takes over your body and controls you, with that said The Invasion is a run for your life, cover your eyes Sci-fi horror film that you can not afford to miss."}, {"rating": "1", "text": "A very poorly done adaptation of the story. The actors are fine, but they can not really do much with this poor script. The movie totally lacking of suspense. There is no paranoia at all. The whole thing has a TV quality to it. The ending is also abrupt and lazy. The director obviously had no idea how to present this material. Not recommended."}, {"rating": "4", "text": "The movie was not good. Though the plot ant the actors were good the result was bad. I expected a big twist and a good ending. Well there was nothing like that. The problem was the lack of suspense and action,too. They easily survived from these creatures. Too bad"}, {"rating": "0", "text": "You know all that vomiting going on there in this movie?? Well say no more."}, {"rating": "1", "text": "One of the most disappointing movies I've seen. The first half of the movie is choppily sequenced, and quite un-entertaining and non-sensical. It gains a little steam later on with some action sequences, but continues to make little sense, before a quick and predictable ending. It pretty much turned into a ridiculous zombie movie which ruined and chance for a different or unusual spin on the end."}, {"rating": "0", "text": "The original Body Snatchers scared the bejeebers out of me and to this day, I can't watch it. This latest version of the Jack Finney novel is an insult that film and anyone with a speck of intelligence. It's not scary, not relevant and not worth your time. It's not good when a movie that tells you not to fall asleep or you'll turn into a monster and you fall asleep in the theater. Not good at all. Like this movie."}, {"rating": "1", "text": "It's not scary, it's not original, the writing's terrible, the acting's worse, and I wanted to kill that little kid myself. This is an hour and a half of people barfing on each other, and not the funny kind of barfing on each other either."}, {"rating": "0", "text": "One of the worst films I've ever seen. I walked out about 2/3 in and got a refund."}, {"rating": "5", "text": "Pretty good remake that's ruined with a contrived, feel good ending."}, {"rating": "0", "text": "Daniel Craig is an actor, a very good one, along with the others, but the movie just didn't come to me, I'm not fond of it, I wasn't very engaged, it just wasn't very good. It actually sucked."}, {"rating": "5", "text": "There's no duplicate body. I miss the duplicate body. What else do I miss? Build-up. \"The Invasion\" cuts to the chase in the first scene(Nicole Kidman needs drugs to stay awake). The latest remake of the fifties sci-fi classic(this is not an improvement on Abel Ferrera's \"Body Snatchers\") moves too quickly, and in doing so, denying newbies the building of tension that was tantamount to making the original 1956(and 1978) versions successful. Directed by Phillip Kaufman, the latter placed Donald Sutherland on his feet when he was pursued by the human replacements. In this version, Nicole Kidman makes her getaway by car. That's not scary. That's an action film. I want to see Dr. Benell(Kidman) with an ax, hacking away at a duplicate body."}, {"rating": "0", "text": "You know that the writer/director/producers don't know what they're doing when, in the opening scene (and again later), the lead character, a psychiatrist, cannot correctly pronounce a drug that she would prescribe routinely (several times a day). She doesn't just mispronounce it, she drops an entire syllable. The pharmaceutical/medical aspect is inaccurate. That aside, the movie is just abysmally written, directed and acted. The film makers main gimmick seems to be the \"spread by vomiting\" scenes. This proves to be tired, lame, and, frankly, lazy on the writer's part. The characters are not sympathetic. Recycling the footage of an actual shuttle disaster is an all too telling of the disaster that this film is."}, {"rating": "4", "text": "Another 'update' of a classic film. ('Update' being critic-ese for 'mangling'.) Writers need to stop rehashing their old ideas with modern effects and start remembering originality, subtlety, and nuance were once valued."}, {"rating": "5", "text": "Great chase scenes, boring dialog, lacklustre performances from Craig and Kidman."}, {"rating": "5", "text": "Most is not that bad, mannn. Just strange beginning and idiot endding."}, {"rating": "5", "text": "This Zombie Tense-Thriller promises to be smart and scary. To say something about society and make us jump in our seats. It falls short of its goals mainly because of the contrast between the two genres the film aims at: An A-grade B-movie. The scary parts aren't scary, and the boring Flaming Car scene could be a classic in the hands of a more imaginative director. The smart parts raise some interesting questions, and the Dinner Party scene is obviously the intellectual highlight of the writers, but these questions get lost in order of giving us a great happy ending we don't get enough from Hollywood nowadays. Nicole Kidman is an intelligent actress with a taste for disappointments. Daniel Craig is wasted as Ben. Everyone else could be anyone else, and we wouldn't the difference. A So-So Movie: So much Potential, So much disappointment."}, {"rating": "4", "text": "While not a truly horrific film, Warner Bros.' remake of the 1956 classic is simply bereft of anything that made the original so good while offering a truly fractured and tonally awkward film in its place. Originally directed by Oliver Hirschbiegel and written by Dave Kajganich, this troubled film was sent back for action movie and twist ending reshoots with director James McTeigue and The Wachowskis writing. This disjointed nature is truly evident as this film offers the occasional look at the paranoia and terror only to then abandon everything over-and-over again in favor of long action sequences.\r The original was great because of the paranoia, the hopelessness, and the isolation inherent in its storyline. Taking place in a small out-of-the-way town, you knew there was no way help would ever arrive. The characters had to piece things together on their own and fight back. The Invasion takes this isolated premise, puts it in Washington DC and in the modern world where we are always connected. Interesting idea to update everything in this regard, but it ruins the aforementioned areas in which the original excelled. This could be okay if there was something offered up to help bolster the film up. Some true horror.\r Luckily, there are a few scenes of panic. The film has interesting action set pieces with a few moments that really get your heart pumping along the way. These may be few and far between while entirely tacked on, but hey, they are there all the same. However, the problem is that these feel weightless. The entire time this one feel incredibly rehashed and \"been there done that\" to the point that nothing feels unique. I get the plot is not original, but it could have brought the original story to the modern day with some new elements while still bringing forth the horror of the original. Yet, this one is like every other political science fiction thriller on the market nowadays.\r The worst way in which it updates it is with immunity and Dr. Ben Driscoll (Daniel Craig) guessing within 30 seconds what illness would have made somebody immune to the invasion. To state it again, the original had this hopelessness and this endless feeling to it, bolstered by the fact that we never see the invasion take any losses. It is undefeated in the original. For The Invasion, however, it is clear the studio determined that modern audiences could not handle such dread or anything nearly as bleak as the original. Rather, we must fight back because \"for better or worse\" we are human. Classic Hollywood. Nothing too dark, only the lightest possible conclusions are acceptable. While the opening is incredibly tense and well handled, the second the immunity is revealed, the film nosedives hard and not just turns into an action movie, but turns into a film unwilling to take chances, which is a terrible thing to be.\r That said, on the positive end, the acting is good. I love Nicole Kidman, Daniel Craig, and Jeffrey Wright. As is expected, the trio do the movie more justice than it truly deserves. The first half is also very well done and shows considerable promise, in regards to delivering on this sense of mystery, dread, and horror, while also not just treading on the same plotline as the original. Though some of the same characters exist, the updates and changed roles are a welcome addition to make this one feel even fresher than just its setting.\r The Invasion is a largely misguided remake that simply misses the essence of the original. It was not action movie. Rather, it was a terrifically executed political film that executed the science fiction part even better. Filled with dread, bleakness, and hopelessness, it underscored this in the way in which the film ended. Though humans were just figuring out what was happening, there was no way to know how to fight back. Here, Nicole Kidman makes breakfast for Daniel Craig and her, now, two sons while they play happy family.\r Also, did anyone get 1984 vibes from this one? Essentially, this one argues that to be human, there must be war, anger, and hatred. Sounds a lot like \"War is peace\" to me, just saying..."}], "recommendations": ["the_conjuring_the_devil_made_me_do_it", "i_am_legend", "insidious_the_last_key", "signs", "what_happened_to_monday", "the_last_witch_hunter", "reminiscence", "the_mist", "ouija_origin_of_evil", "insidious_chapter_3", "repo_men", "the_purge_election_year", "poseidon", "color_out_of_space", "happy_death_day_2u", "riddick", "annabelle_comes_home", "final_destination", "dark_skies", "sinister_2", "insidious_chapter_2", "terminator_genisys", "independence_day_resurgence", "edge_of_tomorrow", "world_war_z"]}