{"id": 2802, "title": "The Wolfman", "starring": ["Benicio del Toro", "Anthony Hopkins"], "runtime": 102, "genre": ["Horror", "History", "Drama", "Thriller"], "description": "Lawrence Talbot, an American man on a visit to Victorian London to make amends with his estranged father, gets bitten by a werewolf and, after a moonlight transformation, leaves him with a savage hunger for flesh.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/cdzkHnXhPbBBBAPLKDXFCy3oHVD.jpg", "categories": {"plot": 5.0, "acting": 4.53125, "ending": 5.833333333333333, "soundtrack": 4.0, "cinematography": 4.75, "familyFriendly": 3.0, "funny": 3.0, "action": 4.0}, "reviews": [{"rating": "7", "text": "\"The Wolfman\" is a great movie with a dark atmosphere spreading across the screen. It's almost a nostalgic movie with superb cinematography. At least I enjoyed it."}, {"rating": "10", "text": "I actually really enjoyed this film, typically I don't like the wolf movies, there always so lame with their fake looking wolfmen. This movie held my interest throughout,the computer graphics helped a lot. It was very gory, and dark, I love the period in which they chose. It had a pretty cool ending too."}, {"rating": "7", "text": "Bryan K. gave it a3: \"In 1941, Universal's monster films was starting to show a wane in popularity. To add a new monster to the cycle they released \"The Wolf Man\" starring Lon Chaney Jr, it was an instant box-office hit and launched Chaney into the Universal monster series by playing the mummy through its 1940 mummy films and the wolf-man in several semi-follow-ups. Nearly seventy years later Universal has released a remake making this the last of the classic monster films to be remade. This is not the first time that Universal has attempted to bring the classic monster cycle into the modern era. Their was the Mummy series (1999-2008) which worked well, but over the films moved away from what made the mummy the mummy. In 2004, their was the film \"Van Helsing\" which attempted to create a tribute to the 1940's monster mashes, but was slow and not as grand as some have said. With all that said we come to the 2010 remake of the Wolf Man and compared to Van Helsing makes the previous film look like a masterpiece of cinema. Without revealing the plot, it seems this film attempted to make a revisionist classic horror film, but failed on so many levels, it's not even funny. The first thing would have to be the acting. Benicio Del Toro, despite being a capable actor suffers from the same problem as Rachel McAdams in \"Sherlock Holmes\" as in his American voice does not fit in with the English countryside surroundings and characters. Despite this he does alright with the role, but seems too monotone in the delivery of his lines. Anthony Hopkins has one of the more troublesome performances in the film. For the first half, he is dull and does not look like he wants to be in the film. For the second half, he changes into the more capable actor that he is, but by this point it was so far into the film that it was too late to make any change. The rest of the cast tries their hardest, but comes off as monotone throughout. This fairly represents the film in general it's just monotone. The plot is straight-forward, the acting is barely passable, the colour palette is dull and uses gray so much in the landscape that it turns the film into an artistic failure. Director Joe Johnston may qualify with this film as the WORST director of the year for his direction is flat and unmoving. The film's main selling point was its ton of bloody gore. Every attack on a person in this film involves mass amounts of blood and guts. It's not too bad and \"gorehounds\" may get a kick out of it, but for a film like this it is not needed and makes the film way too campy. While last year I was a little too easy on \"Land of the Lost\" and \"Year One\" praising them as 10 out of 10 films when they deserved a 7 or 8, \"The Wolf man\" does not get any of that kindness, it is just horrible and qualifies one of the worst remakes in cinematic history. The only saving grace sparing this film from the dreaded Zero is Benicio Del Toro's passable performance as the wolfman.\" this is a very false statement about the movie. The Acting was decent, the gore added to the feel of the movie, which was intended to be a bloodfest with a plot (the plot was O.K., but its a never-ending cycle that will cause the haunting of England Forever). I apologize for quoting a subpar review that begins off-topic, but it needed to be done, for he is a liar. this movie had great kills and an excellent but very short-lived. All in all, I think this movie does not deserve to be treated harshly, but it is not an excellent movie, but rather a good one."}, {"rating": "4", "text": "Too much CGI, not enough scares, and not enough romantic development between Benicio and Blunt. I was disappointed."}, {"rating": "6", "text": "Upon his return to his father's estate a few years after his mother's death, Lawrence Talbot discovers that his brother's body has been found. Then, he learns that a wolf has killed him and searches for it. One night, the wolf attacks him and bites him, which gives him a curse to transform into a wolf man every full moon and goes on a killing rampage. A young woman and a Scotland Yard inspector must find a way to get get rid of the curse once and for all.\r Saw this in theaters the same month it came out last year and now to make my opinion.\r The Wolfman suffers from its thin plot and undeveloped characters, but has good CGI, gave me a few chills, and even Anthony Hopkins was a lot of fun and it's in no doubt a decent remake of a 1940 movie that I've never even watched.\r 6/10"}, {"rating": "2", "text": "Genuinely extremely bored throughout this film, at one point I thought of walking out but, being me, I stayed as I had spent the remainder of my weekend's money on this film. Towards the end, the film picked up and was actually fine but the beginning and middle was too slow and tedious. I actually appreciated this film from an artist's standpoint. The camera-work was really rather good and the visual effects were up to par as well. All in all, I didn't expect a masterpiece and behold, the film was definitely not one."}, {"rating": "3", "text": "neither howls nor bites..The WolfmanThe action sequences seems forcibly installed in here along with the structure that is familiar with rudimentary process that unfortunately seeks for commercial part of the cinema, leaving behind no trace of art or craft to explore in here. The technical aspects like costume design, make-up design and art design is appreciative and finely detailed but lacks better sound department, camera work and choreography for the physical sequences which is essential in such features. The wafer thin script has nothing to offer and instead wastes its time on making it bolder, scarier and horrifying as much as possible which too it adapts a lot from previous installments or remakes of it; there isn't originality or creativity in here. Joe Johnston; the director, needs a lot of work to do especially on executing its vision from paper to screen which is pretty standard. The performance aspect of it is usually saved upon while casting such a huge and promising cast but in here that too is in short for the actors (Benicio Del Toro, Emily Blunt and Anthony Hopkins) aren't given enough range and room to factor in appropriately. The Wolfman neither howls nor bites as it seems like a misguided feature that isn't aware of the vision it wants to project."}, {"rating": "2", "text": "Yikes.  The Wolfman fails in almost every respect, unless you consider being unintentionally hilarious a positive trait.  First off, it's not scary.  Sure, I jumped a couple of times, but I don't consider movies that rely on quiet/loud noise dynamics and things jumping out of the darkness to be truly scary, just annoying.  Second, the story is muddled and doesn't seem to be able to make up its mind on whether it wants to stay true to the original story or do something different.  Third, the special effects are horrendous for a movie that supposedly cost around $150 million to make.  Fourth, and perhaps worst of all, the acting is, across the board, disappointing.  Anthony Hopkins looks like he's waiting for his paycheck to clear, Benicio Del Toro appears to be reading off of cue cards, and although Hugo Weaving appears to be trying, he just not able to overcome a tiresome script.  With the acting credentials of the cast and a blockbuster-sized budget, The Wolfman should have been better than your average horror movie.  Instead, it manages to wallow in the same territory that most dime-a-dozen horror movies occupy, just with a little bit shinier production."}, {"rating": "1", "text": "Avoid this movie. The droll acting by the majority of the cast lets down a decent performance by Hopkins. The story was predictable, the action scenes were few and far between and not memorable in the slightest. For a 90 minute movie, it seemed to drag on for much longer."}, {"rating": "1", "text": "BORING BORING BORING BORING BORING BORING. I turned it off after an hour. it lacked the wolfman action I was hoping for. Benicio Del Toro looked like he was exhausted all the time. There was a few action sequences and they sucked as well, and that's saying something."}, {"rating": "3", "text": "This movie fell flat.  With all the talent on display I was soerly disppointed.  The story was poor.  It felt very gimmicky though the acting had its moments of quality.  I doubt Del Toro and Sir Hopkins will be putting this on the mantlepiece.  Its main value may be to fill your time at 2am on a Friday in late October but not much beyond that."}, {"rating": "5", "text": "I found mostly all the Universal Studios monsters pretty damn ridiculous. Although there are considered classics I never really found them interesting to watch. When I heard they were making a remake of it I was actually kind of excited. There are not really a lot of good werewolf movies out there. In my opinion the best one is An American Werewolf in London. I was very sadly disappointed.  I'm really negative towards remakes I rarely agree with them. I say leave the original alone. My ideal of remakes is that there is not really an artistic tone with them. You'll only remake it for money, just trying to milk the cow. When you are filming a remake you need to understand the things that made the original so good. Then you build your film using the foundation that the original used. Now the foundation of the original Wolf Man movies was the fact that Lon Chaney Jr. use just makeup to scare people now that's freaking feat considering the movie was made in 1941 that's some talent. With some simple makeup he was able to scare a lot of moviegoers. I think that's what the problem is in The Wolf Man of this year.  The film begins with Lawrence Talbot (Benicio Del Torro) a stage actor who gets the news that his brother was killed by a wild animal. He decides to go to help his brother's wife Gwen (Emily Blunt) and his father Sir Talbot (Anthony Hopkins) who is a very strange man and always carries a gun. We learn that Talbot has a dark past with his mother who is dead, that torments him and resents his father. One day trying to investigate what happen at gypsies camp the wild animal attacks and bites Talbot and I'm pretty sure you get the rest of what's going to happen. The movie has a very strong plot and the movie is very well acted. I do want to mention Hugo Weaving who plays a Scotland Yard inspector trying to figure out what's going on with the murders. He does a very good job as well.  The set direction is amazing, the locations are awesome and the cinematography is very good we feel the dread in every corner. The problem with The Wolf Man is the werewolf itself. While the CGI is great it's very excessive and we feel a how you call it a very computer taste in your mouth. The movie feels lifeless and there are so many better horror movies out there with better looking and realistic special effects. If they really want to give homage to the original they should have toned the CGI. As well as the pace is very bad it was really boring and the script lacked scares and actual suspense.  There goes another remake down the drain."}, {"rating": "0", "text": "I fell asleep five times during the first 30 minutes, then woke up when the werewolf attacked, dozed off after that, and turned the entire thing off when the werewolf ended up in a lunatic asylum (!). What an odd twist. The biggest problem with this movie is that the main character is not the least bit likeable. Hence noone cares what happens to him. There are also serious plot holes - like, why would his own father let him murder 6 or 8 people before turning him in ? Doesn't make sense.\rI wonder if there is no procedure in place anymore where they screen these movies to an average audience. Do that, and you will quickly find out what's wrong with this flick."}, {"rating": "2", "text": "Absolute crap, from beginning to end a completely predictable piece of drivel, I needed the toilet half way through this film and that was the most enjoyable experience of that wasted 90 minutes"}, {"rating": "3", "text": "In 1941, Universal's monster films was starting to show a wane in popularity. To add a new monster to the cycle they released \"The Wolf Man\" starring Lon Chaney Jr, it was an instant box-office hit and launched Chaney into the Universal monster series by playing the mummy through its 1940 mummy films and the wolf-man in several semi-follow-ups. Nearly seventy years later Universal has released a remake making this the last of the classic monster films to be remade. This is not the first time that Universal has attempted to bring the classic monster cycle into the modern era. Their was the Mummy series (1999-2008) which worked well, but over the films moved away from what made the mummy the mummy. In 2004, their was the film \"Van Helsing\" which attempted to create a tribute to the 1940's monster mashes, but was slow and not as grand as some have said. With all that said we come to the 2010 remake of the Wolf Man and compared to Van Helsing makes the previous film look like a masterpiece of cinema. Without revealing the plot, it seems this film attempted to make a revisionist classic horror film, but failed on so many levels, it's not even funny. The first thing would have to be the acting. Benicio Del Toro, despite being a capable actor suffers from the same problem as Rachel McAdams in \"Sherlock Holmes\" as in his American voice does not fit in with the English countryside surroundings and characters. Despite this he does alright with the role, but seems too monotone in the delivery of his lines. Anthony Hopkins has one of the more troublesome performances in the film. For the first half, he is dull and does not look like he wants to be in the film. For the second half, he changes into the more capable actor that he is, but by this point it was so far into the film that it was too late to make any change. The rest of the cast tries their hardest, but comes off as monotone throughout. This fairly represents the film in general it's just monotone. The plot is straight-forward, the acting is barely passable, the colour palette is dull and uses gray so much in the landscape that it turns the film into an artistic failure. Director Joe Johnston may qualify with this film as the WORST director of the year for his direction is flat and unmoving. The film's main selling point was its ton of bloody gore. Every attack on a person in this film involves mass amounts of blood and guts. It's not too bad and \"gorehounds\" may get a kick out of it, but for a film like this it is not needed and makes the film way too campy. While last year I was a little too easy on \"Land of the Lost\" and \"Year One\" praising them as 10 out of 10 films when they deserved a 7 or 8, \"The Wolf man\" does not get any of that kindness, it is just horrible and qualifies one of the worst remakes in cinematic history. The only saving grace sparing this film from the dreaded Zero is Benicio Del Toro's passable performance as the wolfman."}, {"rating": "4", "text": "Not good at all."}, {"rating": "0", "text": "Honest to God, this is one of the worst films I have ever seen. It makes The Happening look like Hamlet. I love the original, but this flick doesn't hold a candle to it. The script, editing, acting, even special effects are just awful. The film is only about an hour and half long (give or take), but it's so painful that it feels like you're sitting there for a good 4 hours just wondering when it all will stop. Don't even get me started on that awful cliche' of a script. The whole movie was so awful that myself and a couple of friends (both male) actually contemplated leaving halfway through to go and watch \"Valentine's Day\". Bottom line, Universal needs to quit remaking monster movies and \"The Wolfman\" needs to be put down."}, {"rating": "0", "text": "Wolfman was a good movie. Yeah, if good means really bad and 10 hours long. No but seriously, it made 30 Days of Night look like the Shining. It made Daywalkers look like There will be Blood. It made The Mist look like Lawrence of Arabia. Wolfman was so bad, it managed to make Flatliners look like Gosford Park. I removed myself from the movie and decided to watch Valentine's Day instead. A chippy little flick about love, I was forced to leave that movie as well. Sadly, it just wasn't meant to be."}, {"rating": "3", "text": "The point of a scary movie is to scare you. This one fails - I was never scared even once throughout the film. The film also seemed \"choppy\" to me and didn't flow well. The actors did the best they could with the script given them and the special effects were good (not great though), but overall not very entertaining. You just don't care about anyone or anything in the film. Character development is lacking."}, {"rating": "1", "text": "Suffers from terrible pacing, poor writing, poor action and bad acting. Wasn't tense enough to be thrilling or scary, wasn't campy enough to be funny. Just avoid it, don't even bother with it on TV, a 2 hour nap with dreams of nothing would be more exciting and thrilling"}, {"rating": "0", "text": "I'm pretty open to 'bad' or 'campy' movies, but The Wolfman is just a mess. I thought it might be a cool thriller or at least something I could laugh at and have a good time with. It was neither. I found it to be very slow and very boring even during the 'exciting' attack portions. If you like horror movies, this will be a disappointment. If you like to make fun of 'campy' movies, also a disappointment. I'm not sure who would like this movie."}, {"rating": "0", "text": "Let the Wolfman rest in piece."}, {"rating": "7", "text": "I am much more of a fan of vampire movies and based on that I decided to get this movie. The setting and make up and costumes were amazing. The story was not able to hold my attention and became lagging but near the end the minor action made up for the flaw. It wasn't anything too special but it gets a thumbs up for not being a cheesy monster movie."}, {"rating": "5", "text": "I haven't personally seen the original, but I was only slightly impressed by what I saw. The movie was slow, but this doesn't mean it was flat out boring. The lighting adds effect, but the director depends too much on the lighting to enhance the action. Might I remind you that this was rated R for violence and gore, in which that was fair. In addition to unecessary lighting, all the actors gave a great performance, but everything else was blan. From what was going to happen next, to a dissapointing blan ending, the movie needed another look at before being released. If only one aspect of this film was better, you would most likely see a \"GO\" above this review. Go see it, but don't expect an audience to applaud at the end."}, {"rating": "3", "text": "This movie is somewhat of a turd.   I liked it ok, but it was full of unnecessary gratuitous violence.  Some of us don't need that to enjoy a movie, and this movie would've been fine without it.  It did have beautiful set-pieces and was full of good effects, but it was a little dry."}, {"rating": "7", "text": "Wasn't sure how I felt about the movie in the beginning but it was greatly spooky and wonderful. The art direction was fantastic. Never enjoy these type of movies but this is quite the exception."}, {"rating": "9", "text": "I must say I really enjoyed this movie. Although, it's a typical gothic movie so for someone not very into or interested in the gothic subculture it's probably not the best movie to watch. It has the typical gothic elements. For someone being very interested in the gothic subculture, this movie was brilliant. I loved it."}, {"rating": "7", "text": "We really enjoyed; great, classic type monster movie."}, {"rating": "8", "text": "A very dark story with plenty of jumpy moments, twists and turns, feels old as well as modern for It keeps it's \"over the top\" gore of an old horror but with a interesting captivating story of a modern horror that makes you keep on watching, very well made and cleverly put together Definitely a worthy remake of the original."}, {"rating": "10", "text": "This movie is everything a classic monster/werewolf movie should be like: Gory, bloody, entertaining, dark and fast paced. People will say that it is rushed, but I felt that it was perfect. It had the pace of 'The Dark Knight' and it skipped the already overused parts in werewolf lore (long dialogues and meditation on how to break the werewolf curse etc.) This movie manages to break the monotony of modern horror movies where vampires tend to glitter and where werewolves look like wolves. 'The Wolfman' is an gothic, instant horror classic and will be remembered for it's brutality and homage. I say: Go see it! Critics have panned good movies before. Examples are \"An American Werewolf in London\" (a movie which later turned out to be the greatest werewolf movie of all time), \"Blade Runner\" and \"Once Upon A Time in The West\". They where totally wrong. It's very noticable that this new interpretation of 'The Wolfman' is a movie from HORROR LOVERS to HORROR LOVERS. It's action filled and has with great suspense. Grade: 5/5."}, {"rating": "7", "text": "I enjoyed this movie. I was never bored with it. I thought the part where the Wolfman transforms in the medical hall and runs wild in London was very entertaining. The only parts I didn't like were the abrupt \"jump at you\" segments which there were too many of. The look of the Wolfman was the best I have ever seen, and the transformation was great. I agree with John D.....it was nice to see an old fashioned horror movie with a modern look. The quality of the film was excellent. It had the right look for the time. I really don't understand why others have such a negative take. This is a horror movie about the Wolfman...not Gone with the Wind."}, {"rating": "7", "text": "It was nice to see an old fashioned horror movie with modern effects."}, {"rating": "7", "text": "It was entertaining fluff."}, {"rating": "7", "text": "Loved it! Old school kind of horror, Del Toro is awesome however there is not enough drama it the films seems to run straight to the action cutting out key scenes between actors but hopefully the extended cut DVD should rectify this as it adds about 20mins of footage cut by the studio."}, {"rating": "4", "text": "Where do I start. I went into this movie hoping it would be the first good horror movie of 2010. I was wrong. This movie had barely passable acting at best, which really ruined it off the bat. You need good acting to have a good movie. The plot was sub par in my opinion because there wasn't anything new about it. It was just the same old wolf man flick. The only saving grace for it was the gore. I'm one of those people who likes a substantial amount of gore in a horror movie. And with every death scene, there is blood and guts flying. So the movie wasn't good by any means, but it wasn't terrible. Oh and one more thing. I've heard people talking about how there was an unexpected plot twist that I wont reveal. Am I really the only one who thought it was predictable?"}, {"rating": "4", "text": "Wolfman is one of those movies that isn't supposed to be funny, but is. I would recommend seeing it if you want something that you can make fun of. The dialogue was terrible, the plot was pretty transparent, and the wolf special effects made me laugh. That said, it wasn't ALL bad, just most of it."}, {"rating": "10", "text": "I really can't believe how poorly this movie has been received. To me it bridges the divide between the pulpy golden age of horror movies and the current CGI action movie excess. If you can buy into the casting of Del Toro as Hopkins son in a period picture set in Victorian England then you might just enjoy two pretty good if effortless performances. Excellent pacing. I thought it was pretty baller. So there."}, {"rating": "8", "text": "When i heard about another wolfman/lycan movie, didn't got my attention. But because there was nothing more interesting in the movies the Saturday, i give it a try, and i really like it, never thought the wolfman wold be like the 50´s but no problem for me, and never got bored. Need to try this movie"}, {"rating": "7", "text": "Not nearly as bad as the reviews give it credit for. Despite the accusations of this film being \"boring\", I never got bored with it. The story didn't move along at a real fast pace, but enough where you aren't looking at your watch and wishing something would just happen already. Great atmosphere and eeriness, as you would expect from a period horror film, espeically a werewolf flick. So-so acting for the most part IMO, and very serious. The werewolf looked very cool, although there are times when I wish Hollywood would just do away with the use of CGI, because they never can make the animations look real, like when the werewolf is jumping around from building to building. It just looks fake. Not a spectacular film by any stretch, but certainly watchable and I will probably buy it when it comes out on DVD/BluRay. If cheesy, campy humor splattered with lots of gratuitous gore is what you want in a horror movie, you will be disappointed. But if you want atmosphere, darkness, and still some gore, I think you will find that the Wolfman delivers."}, {"rating": "6", "text": "It might be a little premature for Lawrence(Benicio Del Toro) to be seducing his dead brother's fiance, so blame it on the fog, which looks so romantic over the gray lake, it can't help but put the Shakespearean actor in the right mood to teach Gwen(Emily Blunt) the finer points of rock-skipping. Acting coquettish like any self-respecting Victorian woman in a bustle dress, Gwen flatters the man's cleverness by feigining ignorance on the physics of skipping a stone, a pretense for physical contact, as the wolfman lends a guiding hand to her delivery. While romance enmeshes itself in \"The Wolfman\"(it's a Victorian period piece, after all), the movie doesn't forget that the genre a monster is traditionally affiliated with is horror, so Lawrence does a lot more killing than kissing. Although the sun never shines in \"The Wolfman\", the shadows and fog fail to create an atmosphere of dread, or even a minimum of suspense, despite the unrelenting pall that hangs over everything. But there is blood, not glitter on the monster. All those gratuitous shots of the moon are for the werewolf, not lovers. Unlike that moonbeam Bella, Gwen doesn't love Lawrence past the point of rationality where she'd want to be his wolfwoman. That's how the moviegoer can tell \"The Wolfman\" is more of a guy's movie. It's not \"Twilight\", but the Victorian setting makes this handsomely photographed film seem like a Merchant Ivory production when compared to \"Saw\" and its ilk. That's not a bad thing. Sitting through \"The Wolfman\" is not torture. But the nineteenth century trappings almost renders the blood and gore benign."}, {"rating": "10", "text": "Great horror flick! I really enjoyed seeing a Wolfman in the traditional look of the original film again. The dialogue was no more, no less necessary than the horror classics from the 40's. Building the story line and the characters was done quite well in this movie. I especially enjoyed the amount attention that was paid to fine detail used in the building of the sets. A wonderful atmosphere resulted from this detail. It felt so very much, to me, like a classic Hammer Studio production. I half expected to see Peter Cushing or Christopher Lee make an appearance. If you are a fan of the classic horror films and are able to sit through some dialogue, I would highly recommend this film."}, {"rating": "6", "text": "I give this a 6, very reluctantly, but because I felt it somehow deserved it. It was not \"good\", but it was so without being horribly bad. The only movie I have seen that received a 0 on my scale is \"Zombie Nation\" and if I could give it a - 5 I would, but that isn't how the scale works. 0 is the worst I can possibly imagine and compared to that, Wolfman is a 6, possibly a 5. Oddly enough, I agree with Joe J. on every good and bad movie he mentioned. The Shining, Lawrence of Arabia, and There Will be Blood are some of my favorite movies and if I could give them 20 I would, but again, not how this works. Anthony Hopkins' acting was surprisingly terrible in this movie, and Del Toro's accent was pretty horrid. If you love old fashioned Horror movies that aren't as low brow as some of today's garbage, I recommend this. If you are looking for a meaningful, delightful piece of cinema, I do not recommend this movie."}, {"rating": "7", "text": "Joe Johnston's \"The Wolfman\"  is a film I had been dying to see when I first heard news about it back in the middle of 2009  although there was not much information I had high hopes for this film. After the new year rolled around  I was informed that \"The Wolfman\" would be releasing theatrically on Valentine's day weekend(Who's bright idea was that?) and I also heard that Joe Johnston(director of Jurassic Park III, Rocketeer and October Sky). Would be directing the film naturally Johnston does not have a solid reputation for making high-class filmâ"}, {"rating": "7", "text": "Flawed, but very entertaining horror movie (Never saw the original by the way). I thought the Oscar this movie won for Best Makeup was well deserved."}, {"rating": "5", "text": "When i first saw this movie i felt asleep. This movie was so boring the first time i saw it. The second tome i actually got into the movie and finish it. The story could have been better but still a good movie. This is a good horror movie. even though its not really scary it still scare you on some scene. Alot of gore in this movie."}, {"rating": "6", "text": "When i saw this in theaters i though the real things they had going for it was the quick sound bursts that most scary movies have. But when i saw it at home i was rather unimpressed. This movie almost was meant for theaters because of the surround sound effect but unless you have it at home its worthless. The storyline and the acting was okay but the overall wasn't that great. The graphics were good and the cinematography wasn't to bad either."}, {"rating": "6", "text": "It is about time to bring werewolf back to the screen. With nowadays technologies, THE WOLFMAN is a good vessel to explore how far special effects and make-ups would go. The movie itself already appropriately taken care by former special effects expert, Joe Johnston. Johnston involved on three early STAR WARS trilogy as Special Effect Art Director. His box office movies as a Director are JUMANJI (1995) and JURASSIC PARK III (2001). The movie starred by Benicio Del Toro, Anthony Hopkins, Emily Blunt, and Hugo Weaving. Although Del Toro acted well in thiz flick, I personally think it is very lamentable to use Del Toro on such a movie. Del Toro as we knew was a discreet Actor in serious drama. What are we really waiting on thiz movie is the transformation scene, when Del Toro becomes a werewolf. Rick Baker make-up already supports well. The plots were on customary level. The twist ending did not too surprising. Maybe we could blame Johnston a little bit, bcoz he has not been a good drama Director. If we see thoroughly there are a lot of nuances are similar to Tim Burton SLEEPY HOLLOW (1999). Despite of SLEEPY HOLLOW was happened to be more attractive in some ways. The werewolf had been a great horror icon since Michael Jackson THRILLER video, So It is definitely the time for another moon to rise, to wake up that howling again.\r Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com"}, {"rating": "4", "text": "Has some great cinematography and music and solid acting but also some hilariously stupid scenes that seiously detract."}, {"rating": "0", "text": "This film is simply boring. There's barely any Wolfman, Most of the time is developing this plot that isn't interesting in the slightest. And sadly, They used too much CGI that looked pretty weak rather than practical effects. It's a shame too they had a great cast led by Del Toro and Hopkins that deserved much better."}, {"rating": "5", "text": "A pretty haunting film but also very boring lots of the time. The script seem rushed and seem to miss making a scene a lot more scary then it could have been."}], "recommendations": ["poltergeist", "wrong_turn", "annabelle", "the_thing", "antlers", "the_omen", "clash_of_the_titans", "the_texas_chainsaw_massacre", "jeepers_creepers_3", "i_am_legend", "the_eye", "van_helsing", "the_last_witch_hunter", "malignant", "the_conjuring_the_devil_made_me_do_it", "the_amityville_horror", "underworld", "insidious_chapter_2", "the_haunting_in_connecticut_2_ghosts_of_georgia", "the_possession", "the_invasion", "the_grudge_2", "into_the_storm", "underworld_evolution", "it_follows"]}