{
  "id": 1125,
  "title": "The Lovely Bones",
  "starring": [
    "Saoirse Ronan",
    "Mark Wahlberg"
  ],
  "runtime": 136,
  "genre": [
    "Fantasy",
    "Drama"
  ],
  "description": "After being brutally murdered, 14-year-old Susie Salmon watches from heaven over her grief-stricken family -- and her killer. As she observes their daily lives, she must balance her thirst for revenge with her desire for her family to heal.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sn0iDphRxQ7I6aLd9igIgACITak.jpg",
  "categories": {
    "plot": 5.5588235294117645,
    "acting": 5.815789473684211,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.333333333333333,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Very beautiful and moving film. Love it lots, especially Saoirse Ronan, who is simply the Best."
    },
    {
      "rating": "9",
      "text": "A little slow in parts, but a beautiful crafted film with terrific cinematography. The cast is excellent. Just the right combination of touching and suspenseful."
    },
    {
      "rating": "4",
      "text": "NOTE: I have not read the novel in which this movie is based. In my not-so-humble-opinion, this is Peter Jackson's first misstep as a director and Fran Walsh's first stumble as a writer. This movie was quite a disappointment. The script never gives us a chance to truly get to know these characters and truly feel their grief at the loss of Susie. With the exception of Saoirse Ronan's character, we are presented with a bunch of cookie cutter characters. I did not connect with any of the family members. Their suffering is glossed over. The actors did their best with what little material they were given. Especially Susan Surandon - I'm not even sure why she was in the movie - her character added nothing to the plot. Too much time was spent in Susie's \"world\" as she ran around a CG landscape. The special effects used to show Susie's \"purgatory\" were horrible. They looked very low-budget, as if they were designed for a made-for-TV-movie. I can't believe this came out of the same effects house that did Avatar (Weta). If you truly are curious to watch this film, I would wait for DVD. Or better yet, spend the money on the book, which I hear is excellent."
    },
    {
      "rating": "8",
      "text": "Although I found the script a little weak in places, and the cgi spiritual a little obvious and unnecessary I was still engrossed from start to finish and consider it one of the best entries into Peter Jackson's back catalogue. Watch Heavenly Creatures for reference. These other reviewers don't get the film because they're expected either a typical Hollywood family film or thriller. This film is neither. Its a unique and imaginative fantasy drama. Its subversive and feels like an independent film made with a mega budget. Perhaps the film would have been received more positive if it was marketed in a less Hollywood way. Keep it up pete, you the man."
    },
    {
      "rating": "10",
      "text": "Beautiful portrayal of the abtract and ethereal consequences of tragic loss - an amazingly accurate portrayal of a unique and thought provoking novel."
    },
    {
      "rating": "1",
      "text": "Entirely too long.  Entirely too stupid.  Entirely too boring.  There was less drama in the OJ Simpson trial.  I'll never get this time back.  I would have gladly chopped off one of my own lovely bones to forget I ever saw this movie."
    },
    {
      "rating": "0",
      "text": "A really bad film! the characters had no depth, the scene seemed to go from bad to worse and dragged on and on. Coupled with a lack of realism and what looks like and LSD job, the movie fails to deliver completely.There's instances where you feel drawn in, but then the story just throws you out again, even the end doesn't seem to be a conclusion, just something left cos the director had his pizza delivered. A real hack job of a movie, although I hear the books isn't much better.Something to watch while you're having a lobotomy, cos it'll feel like you've had one after watching this."
    },
    {
      "rating": "2",
      "text": "Whether or not it may be positive or negative, Peter Jackson will be remembered as one most prominent directors of the 21st century - I am not of course discounting his work in 1990's Heavenly Creatures. After directing perhaps an unsurpassed trilogy of Tolkien's Lord Of The Rings, Jackson once again attempts to recreate literature, but now approaches a work that is more contemporary with The Lovely Bones.  But unlike the success in which he recreated the Lord of the Rings to near perfection, Jackson completely misses the mark on this one.The Lovely Bones is a film adaption of Alice Sebold's novel of the same name.  Bones is a story of a teenage girl, Susie Salmon (Saoirse Ronan), who is killed and watches her family from heaven, where she must let go of her past in order to achieve true nirvana. While the movie and the novel seemingly share the same premise, the message of \"letting-go\" that was conveyed in the novel was evidently lost in the film.  Peter Jackson fails to recreate the true essence of the book, only emulating the exterior of Sebold's work.Besides the off-target plot, The Lovely Bones is undoubtedly a mess.  There are so many transitions between Salmon's heaven and the 'real word,' that an attempt at being stylish turns into a muddle of confusion.  The film is a CGI nightmare, as it possesses an endless amount of effects that is incredibly unnecessary. Originally simple in the novel, Salmon's heaven seems as if it comes from a laughable cartoon. Additionally, the film creates an uncanny amount of uncalled for instances of suspense and drama.  While the film does succeed at some points, most of the melodrama employed fails.The only redeemable aspect of the movie is the acting.  Stanley Tucci, who plays the spine-chilling murderer, plays his character in an aptness manner, creating a sense of uneasiness within the audience.  Saoirse Ronan (who played the strange sister in Atonement) does an adequate job in narrating and reprising a role of a common teen.  While Ronan and Tucci excel, Mark Wahlberg performs a less than average job acting as a disgruntled father.  I do not expect much from Wahlberg's acting (does anyone remember The Happening?), so I do not feel the need to expand on my opinion.The Lovely Bones is downright disappointing. People watching the film without any knowledge of the novel will question the thousands of readers who have. Even though the adaptation does recreate some of the novel's finest moments, it really should have stayed on the bookshelf where it belongs."
    },
    {
      "rating": "8",
      "text": "I thought this movie was very moving and beautiful. Ronan and Tucci give incredible performances. The horror of Susie's death drives this movie throughout. You feel sympathy and remorse for her and her family and you want something good to happen for her and in the end it does. This film reminds us all how precious and brief our lives are and the hole we leave for others when we are gone. Jackson did a terrific job."
    },
    {
      "rating": "8",
      "text": "Beautifully rendered vision of the book. Gripping and moving. A pleasure to watch."
    },
    {
      "rating": "9",
      "text": "I did not read the book but this film makes me cry all the way through. I will recommend all parents with teen age daughter to watch this film. I am against all critics and believe Peter Jackson did another master piece after Lord of the Rong and king Koun."
    },
    {
      "rating": "9",
      "text": "Its TOTALLY underrated! Its visually stunning, well acted, well directed, it had an interesting premise and some very intense scenes! It had it's share of suspenseful moments and it's touching moments and that's hard to do that as well as this movie does it. I loved the movie and I believe that it should have gotten the ratings it deserved. And no, I'm not going to say I would recommend it to everyone, because it's not for everyone, my mother refuses to watch it due to its premise of a innocent teen being brutally murdered. It does seem quite upsetting at points and if young kids would watch it, it may cause them nightmares. But it's a good movie"
    },
    {
      "rating": "0",
      "text": "One of the most stupid movies that I've seen. How could such an idea come to someone in the head? The maniac kills a girl and ... then what? Nothing. This film virtually ends. Great!"
    },
    {
      "rating": "5",
      "text": "The Lovely Bones is technically a beautiful film, the acting, music, cinematography and production design are excellent, it could be a emotional film to get swept up in but there lies the problem, there's just too much going on to keep your attention on, is it about the afterlife?,a serial killer?, a crime story? a family drama? It's all of them and more! At on point I was actually reminded of Sally Field in Sybil, which is not what the makers were hoping for I'm sure, but I'll give It a 5 for the artistry and because Saoirse Ronan was so good."
    },
    {
      "rating": "6",
      "text": "Despite it's fragile face-paced story that emotionally repeats what it's trying to say, Peter Jackson's \"The Lovely Bones\" is a well made fantasy movie...at least from a technical viewpoint here."
    },
    {
      "rating": "0",
      "text": "This is the worst movie I have ever seen...ever. About a third of the way through I found myself hoping that it would just end. There is little to no character development and many scenes are drawn out and incoherent. This movie could easily have forty to fifty minutes cut out with no loss in continuity. Save your money and your time. Read the book."
    },
    {
      "rating": "3",
      "text": "I have waited over a year to watch this move, the reason you ask: well after reading and loving the book, I couldnt wait for the movie and with baited breath caught the first trailer for it on tv, it started well enough with Susie salmon declaring she was dead and then the next scene was of a massive ship breaking out of a even bigger glass bottle and trees turning into birgs...WTF...So I gave it a miss!! So after a year of walking past it countless times at the video shop I finally gave it a go...and I wasnt wrong to wait for DVD!! Peter jackson in all his incredibleness (yes that is sarcastic) has fallen into the biggest directors trap (ahem...Steven Spielberg and A.I.) and that is, \"just cause you can do something...DOESNT MEAN YOU SHOULD!!! The whole heaven concept is ridiculous and a simple voiceover would have sufficed and focused more on the real story, that of her family and longings!!This movie could have been magical and fantastical had it trusted our imaginations, as the book did. Mr Jackson has taken out all its magic and force fed us with fantasy scenes that belong more in Disneys fantasia than in a tragic story such as this!!! What kills me is that this movie could have just been so good...oh well, lets wait for the swedish to remake it!!!"
    },
    {
      "rating": "0",
      "text": "Peter Jackson should hang it up big time along with his buddy Speilberg. What was this?? It was stupid trash, that is what it was.Don't waste your time with this trash."
    },
    {
      "rating": "10",
      "text": "People expect this movie to be dark and gloomy, but it is not, is it a happy and moving film. Yes, this movie is sad, but it is a very inspirational film, Saoirse Ronan is an amazing actress, one to watch! :D"
    },
    {
      "rating": "8",
      "text": "It really is quite a beautiful movie. It is rather unique. Acting is great along with the pace. The ending is sad but a spectacle at the same time. I didn't know what to expect from this movie but it certainly pulled through."
    },
    {
      "rating": "7",
      "text": "Peter Jackson  is not as good as he was in the lord of the rings,but this movie has good performances,amazing visuals  and a script that touches the heart."
    },
    {
      "rating": "0",
      "text": "vzdfdffrrgrge"
    },
    {
      "rating": "9",
      "text": "Coming to this long after the critics had mauled it, I was surprised and impressed with how good it is. I haven't read the book, so I can't comment on its fidelity to source material, but Jackson creates hyper-real worlds where saturated seventies garish and the usual unforgiving close-ups he adores somehow endow genre stereotypes with a peculiarly hallucinogenic depth. Oddly, the spacious landscapes of the afterlife somehow feel more real than the suffocating scenes of suburbia and the household, but perhaps that's wishful thinking!I can't help thinking that what was expected was a satisfying moral fable, and the unexpected conclusion will have disappointed those wanting earthly justice rather than just desserts. I wonder if that's why critics like Roger Ebert (\"a deplorable film\") could be so thrown off balance that that they don't even follow the plot (the \"lovely bones\" do not belong to Susie) and obsess about whether the heaven presented is factually accurate! The fact is that the ending is truer to life than Ebert gives it credit.  As a fan of Brian Eno, I guess I'm biased, but I thought the climax of the film, accompanied by his \"The Big Ship\" had more emotional draw than either of the big endings of KK and LOTR.  Tucci was fantastically creepy (though he seemed to have based his style on Dustin Hoffman's tics and murmurs) and anyone who thinks that Jackson shied away from the horror of the murder has just become desensitised by graphic violence, failing to sense the evil in even the most mundane encounters with George Harvey.My only caveat was that some scenes seemed a touch too long, but perhaps brisker editing would have turned it into the thriller that some thought it should have been, and it would have lost the lyrical, elegiac quality that made it so absorbing.Now, back to my Eno collection and 'Small Craft on a Milk Sea.'"
    },
    {
      "rating": "7",
      "text": "42... emm.... what the heck!? Maybe it is not a masterpiece, but it is a very good film and not a movie of 42 score... OMG and films like Breaking Down has more score..."
    },
    {
      "rating": "7",
      "text": "Saoirse Rohnan leads The Lovely Bones to victory with a mind blowing performance, and Peter Jackson doesn't do a good job by differing visual beauty which it has and utter horror where the whole story is, but it is actually a well made film. I give this movie a 72% of a good one."
    },
    {
      "rating": "1",
      "text": "The worst movie ever. It's attempts to be original and creative develop into a spectacular mess. Fans of symbolism and imagery will try to make excuses for the film, but do not be fooled it is pathetic. I know the theater agreed with me because they all starting booing, talking and leaving 34 through the movie. Don't waste your money,your bandwidth heck dont waste a second of your life on this film."
    },
    {
      "rating": "10",
      "text": "A beautifully crafted film that resonates with evil, love, vengeance, and the devastating effects of the death of a child at the hands of a serial killer. The critics who pan this movie must be bereft of sensation. I thought it was mesmerising!"
    },
    {
      "rating": "3",
      "text": "Just awful. So botched by Jackson. Silly at times, ridiculous CGI and poor development of characters. The whole heaven idea and the people there was just laughable and detracted from the movie. Only saving grace for me was Tucci was creepy and obviously the best actor here."
    },
    {
      "rating": "10",
      "text": "It such a beautiful and emotional film that give movie real power, ronan performance was perfect, peter Jackson the greatest director of the decade show he can visualize the perfect heaven and the ugly human world of the killer"
    },
    {
      "rating": "5",
      "text": "Wow, this is the first time I've actively not-enjoyed a film in ages. It was almost refreshing to realise I still have a sense of taste and opinion!"
    },
    {
      "rating": "2",
      "text": "First, the book. I think Alice Sebold is a bold and clever writer, only not good enough to sustain the interest through to the end. The idea of writing from afterlife should be suspenseful and powerful, in which case I think its much debated comparison, Forgiving Ararat by Gita Nazareth, to fare better in terms of quality and the flow of plots. Movie-wise, it deteriorates further. The big ideas that were present in the book, albeit poorly constructed, were altogether absent from the movie. If you only care for the extra effects, then by all means go watch the movie. But if you're after something deeper and more substantial, well... choose another book to read."
    },
    {
      "rating": "4",
      "text": "Disappointing. The initial setup is good, and the cinematography luminous, the acting mostly top-notch, and it seems like it could have been a very interesting look at the way a family responds to a terrible tragedy like a child murder. But apart from a few brief moments I didn't see any of the inner and interpersonal conflict that would come from something like this. Instead Jackson blasted me with his trademark cgi and changed perspectives often enough that I never had a chance to connect to anyone or invest in it. With that emotional backbone missing it came across as a rather campy catch-the-creepy-killer, a very expensive Lifetime movie. It's like Jackson and his other writers were so enthralled by the story they forgot to tell it."
    },
    {
      "rating": "2",
      "text": "Dire, sentimental and very ugly, so much for the great Oscar hope. Only Saoirse Ronan saves this from complete catastrophe."
    },
    {
      "rating": "9",
      "text": "i think that this film was very emotional it adds a lot of drama especially for the kind of story that it is. the cast performed very well and convincing especially Saoirse Ronan. for those who have read the book it adds suspension knowing what is going to happen and knowing the events that are building up in the movie"
    },
    {
      "rating": "5",
      "text": "My opinion is that the film started very good, it kept me tensed and interested but then got in the idea of heaven and how it was described was very bad. First you think that her fathers investigation will lead to the truth, but then somehow she sends him signal from heaven and he starts to suspect him, although it was emotional which i was i gave it 5, the movie needed more scenes like the one when her sister finds the book in the neighbors house"
    },
    {
      "rating": "7",
      "text": "Just when you start to feel sad- BOOM THERES A DOUBLE RAINBOW!!! Sorry I couldnt be helped. But yeah, the contrast between grief and giant rainbows and butterflies is pretty nicely done. I actually enjoyed this movie. I love Mark W's constantly confused-looking face, it warms my heart. There was too much time spent in rainbowland, I agree with most people here, but one thing i disagree with is: Character development. This was decent enough, for the time spent in the real world. The father goes from obsessive ship builder to crazed obsessive maniac daddy from hell, the sister goes from being an extra to an active character (did she have any lines at all??), and the son, went from almost suffocating to a half mentally challenged cild, hooray. I did not like the mothers character. Waah, im portraying the familys grief, and im gonna go abandon my kids... Its not deep, but when you cut out all the rainbows the movie is rather short, and there wasnt much time for them to develop more than this. Definately worth a watch (or a stream) at leat once. Its great for someone like me, who lacks emotional capacity and is easily distracted by bright shiny rainbows ^^."
    },
    {
      "rating": "7",
      "text": "THE LOVELY BONES based on a best-selling novel written by Alice Sebold. The story about a girl named Susie who has been murdered and her vacillation between earth and heaven. If you watched the trailer, the movie offers tremendous images of heaven. But, after I watched it, substantively I did not find surprising element on that description. The heaven images have similarity on what we seen in WHAT DREAMS MAY COME (1998). But in the other hand, I think the movie was successfully delivered the drama in a romantic and beautifully way. The essence of the story is simple, but we can feel clearly sorrow and confusion around the characters. The narration and glimpse of the Susie past in the beginning of film brings us sufficient mood to build sympathy. The Scene was involving Suzie and her boyfriend, Brian (Jack Kebel) is a scene-stealer on thiz movie. Thiz is a recent movie directed by Peter Jackson, one of the greatest Directors in our era (LORD OF THE RINGS Trilogy (2001-2003) and KING KONG (2005)). Susie Salmon played by Saoirse Ronan. Ronan made her promising debut on great drama ATONEMENT in 2007. Mark Wahlberg and Rachel Weisz played as her parents and Susan Sarandon as her grandmother. The villains played convincingly by Stanley Tucci. I think Saoirse Ronan has a potential skill to become a great Actress in the future, even greater than Dakota Fanning.\r Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "8",
      "text": "I wouldn't say I enjoyed The Lovely Bones because saying I enjoyed this film would sound rather disturbing. I would say I found it interesting. The best part in this film for me is the acting. The acting was great. The special effects were good too. The story was okay, a little touching, a little creepy and a little happy. The thing I didn't like about the story was the ending. The film was good and interesting."
    },
    {
      "rating": "5",
      "text": "With Peter Jackson at the helm, and an star cast (including Rachel Weisz and Mark Whalberg) this  was looking promising. The story line stems around the death of a teenage girl, and the journey through the various human experiences of existentialism, love, grief and karma - with the story following various character paths. All good so far; unfortunately all the promise that could be seen 'on paper,' falls short to live up to the all-star cast, with even the talisman that is Jackson at it's helm, it cannot be rescued from a mediocre status; a movie full of an inflated sense of self importance, semi-broken plot lines, which are just barely rescued by the talent at hand.That said, it was certainly not a poor movie by any standards, and still a worthwhile watch - just don't expect to be enlightened, or have an inimitable urge to re-watch 'The Lovely Bones'."
    },
    {
      "rating": "8",
      "text": "I'm not sure why people haven't learned that most movies aren't going to be like the book. A book is meant to be cut in you own imagination and interpretation. That's the beauty of a book.  A director and writer are going to have their own view along with what will score at the box office. Accusing a movie for not being like the book is like accusing a garage band for selling out. Eventually they gotta feed the family. No I wasn't a big fan of the fantasy land but I liked the stark reality of her death. I think it speaks to the harsh realities of our time that you can't let your 14 year-old daughter travel by herself anymore. Yeah Walberg had his usual hushed voice and confused looks but again that's the movie. Picture him more intelligent when you read the book if you like. I haven't read the book but when I do like with The Time Travelers wife I'm going to seperate somewhat."
    },
    {
      "rating": "5",
      "text": "Peter Jackson was from a far than ideal position when making The Lovely Bones. Receiving both audience and critical acclaim for his Lord of the Rings Trilogy, then braving an ambitiously epic remake of his own favourite film King Kong, audiences were expecting something spectacular. In making The Lovely Bones, Jackson has the unenviable task of depicting the afterlife on film. No matter which direction he went in, he was bound to be chastised by somebody. In my humble opinion, not having read the book the film is based on, I feel Jackson has made a film of both numerous successes and failures. All scenes grounded in reality, dealing with Susie Salmon's murder and the aftermath are superb. They are dark, and emotional to the point of heartbreak. You really feel for Susie, a young and optimistic dreamer full of potential, whose life is cut tragically short. Mark Wahlberg also impresses as her father, who is unable to let go of his daughter's memory, and who is driven to investigate her murder himself. Wahlberg once again proves himself to be an extremely competent and versitile actor who deserves far more acclaim than he has thus far received. While these moments are truly memorable, when attention shifts to Susie in limbo, Jackson appears to lose focus. This is a world populated by jarring visuals and half-baked ideas. You despair every time you have to return to this world - it's not only unfocused and ill-defined, the afterlife is really boring! Give us more of Stanly Tucci's creepy child-killer and Susie's family's heartache, we  want no more technicolour philosophical ramblings! Jackson had an almighty challenge to face, and he had a degree of success, but not nearly enough to make a lasting, impressionable film."
    },
    {
      "rating": "8",
      "text": "The Lovely Bones is a frustrating experience but it compels and embraces the imperfection and flaws that it makes. It isn't like your typical drama and its probably one of the few that you'll ever find this decade. The story is an adaption to Alice Sebold's 2002 The Lovely Bones (which is by far the honest and most inspiring novels of our time) but with Peter Jackson (Lord of the Rings Trilogy and King Kong) behind the helm for the big screen. He has his own ways and (if you've seen him direct his other movies) he loves to put in some CGI effects but never full overload. However, I must say that he did make the heaven scenes look all that clichÃ"
    },
    {
      "rating": "8",
      "text": "Great film.  I hadn't read the original novel, but reading the critics reviews of that and a synopsis Peter Jackson, Fran Walsh and Phillipa Boyens did a marvellous job adapting it, not sure whether I would now want to read the book though.  I loved the imagery in the film and how it plays emotionally and that is the key to this, it is magic realism, and if you like that genre both in novels and films this is a must see.I'm surprised at Roger Eberts reaction.  He claims not to have read the book but begins with a fact that changed from novel to film.  There is no rape or suggestion of rape in the film.  The \"heaven\" or rather \"between place\" was I thought well done, it was the young girls memories, places she had been, like being in a dream, and it's seasons changed with her emotional tone.The acting by the way is superb. Tucci as the killer is very creepy, in an understated way.  Mark Wahlberg and Rachel Weitz are convincing in their roles as the grieving parents, and Siarose Ronan as the murdered girl is brilliant and will go very far.I really did find this film moving without being mawkish, and it did everything very well.  It reminded me more of Pan's Labyrinth (again magic realism) than the last heaven based film What Dreams May Come which was frankly awful.  On this one I think the critics were way off the mark."
    },
    {
      "rating": "7",
      "text": "The cast, the soundtrack, the production design, and the cinematography are excellent, but little by little the film is losing its axis, and the viewer's attention,  it's like three movies in one. Anyway as I said before, this film technically is really beautiful, and a girl called Saoirse Ronan is stunning."
    },
    {
      "rating": "6",
      "text": "The Lovely Bones was an award winning novel, turned into a major motion picture in 2009. Peter Jackson signed on to Direct and Steven Spielberg was the Executive Producer, so the budget for this film was massive, but it didn't do so well, leading people to believe it was a bad movie. While it was different from what the readers expected, the film was still better than average. The story is told by Susie Salmon (Saoirse Ronan), a 14 year old girl, who was murdered. Susie introduces us to her family and to her killer in what I saw as a mix between Ghost and What Dreams May Come. The story is extremely strong and very well written, but it isn't without it's problems. For instance, we learn the identity of the murderer almost immediately. There are also huge gaps in the story between when we see Susie in purgatory and when we see her families again. Saorise Ronan plays Susie and continues to amaze me. I honestly haven't been that crazy about most of the films I've seen her in, but she never seizes to amaze me. It really is only a matter of time until she's in the right film and gets national attention. By then, not only will people know her name, but they'll know how to pronounce it too. She is supported by some big names like Stanley Tucci, who at this point in his career has convinced me that he can play just about any role. The Lovely Bones is a great story, but it wasn't done in a way that appeals to mass audiences. The scenes in purgatory were never ending and there are big holes in the story, but the cast is terrific and the story is really good. If you're into films that stray from the norm, you might really enjoy this one."
    },
    {
      "rating": "5",
      "text": "On one hand, you have a film wasting its opportunity to be a beautiful adaptation of a beloved book--and the other, an Oscar-worthy performance from Stanley Tucci."
    },
    {
      "rating": "5",
      "text": "Peter Jackson has finally screwed up. Though not terrible, the movie was a disgrace compared to his other films. The problem with The Lovely Bones was that Mr. Jackson blurs reality and with non reality and the movie loses your interest because of that."
    },
    {
      "rating": "8",
      "text": "Great film actually! It make me think a bout revenge and let think go for greatest good.Beautiful portrayal of the abtract and ethereal consequences of tragic loss - an amazingly accurate portrayal of a unique and thought provoking novel."
    },
    {
      "rating": "6",
      "text": "What else starts sigh is its stunning art direction, surreal scenarios, photography and visual effects. Already in the category plot, she is very badly handled, becoming forced showing that Jackson does not know what he really wants to do or show."
    },
    {
      "rating": "9",
      "text": "The film 'the lovely bones' is really moving as it brings you into the life of the girl and her experiences- you really get to feel what she does. I also loved the supernatural element questioning what happens between life and death and whether you still have a connection with the real world. The film also made you think about how other peoples minds work and what goes on in the minds of psychopaths as well as presenting relationships between the girl and her family after she dies. I would not say it has a great storyline or has lots of action, if that is what you are looking for, but it is great for making you think and is a film that you will definitely remember for the right reasons! The acting is also brilliant"
    }
  ]
}