{"id": 1066, "title": "The Curious Case of Benjamin Button", "starring": ["Brad Pitt", "Cate Blanchett"], "runtime": 166, "genre": ["Drama", "Fantasy", "Romance"], "description": "I was born under unusual circumstances. And so begins The Curious Case of Benjamin Button, adapted from the 1920s story by F. Scott Fitzgerald about a man who is born in his eighties and ages backwards: a man, like any of us, who is unable to stop time. We follow his story, set in New Orleans, from the end of World War I in 1918 into the 21st century, following his journey that is as unusual as any man's life can be. Benjamin Button, is a grand tale of a not-so-ordinary man and the people and places he discovers along the way, the loves he finds, the joys of life and the sadness of death, and what lasts beyond time.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9H2awZmNisMVJGp362Stv0bfUTs.jpg", "categories": {"plot": 5.225806451612903, "acting": 5.72, "ending": 2.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 1.5, "action": 9.0}, "reviews": [{"rating": "8", "text": "A mesmerising and heartwarming film from start to finish. There is no big message perhaps apart from enjoying every moment of life while you can and appreciating it in all it's richness. Go see."}, {"rating": "10", "text": "My best film for 2008. david fincher is genius. cate is wondergul actress."}, {"rating": "10", "text": "Found this film to be extremely touching and very creative. Brad Pitt is superb."}, {"rating": "9", "text": "Extremely well-acted, meticulously designed, beautifully photographed, meaningful and quite moving, a mature film for mature adults...who could ask for anything more?"}, {"rating": "8", "text": "Impressive production - the art direction, make-up, and cinematography are magnificent. Brad Pitt is amazing. The story is fascinating. It did seem it's 2 1/2 hour length, a little cutting would have helped, but overall a top notch film that is outstanding."}, {"rating": "9", "text": "Any movie who can make Brad pit look either really really old, or even more impressive, move young and handsome than he already is has really accomplished something. Whoever did the make up for this movie really knew what they were doing. When old Button really looked nearly bald he did so without any cheesy looking head mask lines or anything. It looked totally realistic. But really the masterpiece of the movie was the story itself. It was very original and thought provoking. It really made me think about my own life and what it means to age and face death. Also the qualities of who we really are inside and not only our outside appearances were really exemplified by this movie. In short this was not simply entertainment but something that could nourish the intellect and soul if one was receptive its wisdoms. If the movie had any faults, and I can only think of two, is that it was way too long especially for this culture of short attention spans, and that it rushed over the younger years. The movie seemed to spend forever in his elder and mid years. Basically the movie was so centric on Brad pit it did not allow the chance for other actors to really shine. Not that I have anything against Brad Pitt who did a wonderful Job in the movie. Brad Pitt is an actor you want to hate because he's too darn good looking and in way too many movies. But honestly is really good at what he does. Despite the few minor flaws this movie is a real gem in a sea of superficial movies meant solely to entertain and then be forgotten for the next distraction. Truly The Curious Case of Benjamin Button was a 1 in a 100 movies you only get to see if you are paying attention."}, {"rating": "8", "text": "This well-done movie makes one think about life through the story and acting -- A very credible, well told story that keeps one engaged throughout. How one could rate this movie a \"0\" or even a \"1\" or \"2\" - is unclear. What the movie lacked in whirlwind 'blow em up and shoot em dead' movies with an excess of obscenity, gratuitous sex and gore --- it more than made up for in an insiteful, absorbing story. Who among us has not said, \"boy, if I only knew then, what I know now\" Or contemplated the cycle of life from a relatively helpless baby --- back to a relatively helpless elderly person? It's difficult to find movies that develop character and a storyline (versus special effects and noise) -- This one is a 'thumbs-up' for good adult entertainment."}, {"rating": "9", "text": "Spectacular story about the journey of a life. To see this movie go though all the different decades was incredible. An emotional movie that has something valuable to share. Just splendid. Also, wonderful directing and art direction."}, {"rating": "10", "text": "Probably Mick LaSalle, from San Francisco Chronicle, wouldn't recognize drama even if it danced in front of him without pants. This is the most dramatic and touching movie ever, full of surprises of a whole life story, with all the emotional events that could and couldn't happen."}, {"rating": "10", "text": "There is nothing I can say about what's wrong with this movie, because there is nothing wrong with this movie. If you have a problem with it, the problem is you!"}, {"rating": "9", "text": "The scene in Grand Central Terminal with the clock that showcased the WWI battle and the fathers only wish to rewind time so that he may see his son again left an impression with me for life. Let it be known that War, for better or worse, will scar the immediate families of the fallen for eternity in ways which those that have not sacrificed will never know. If I was the authority, I would have made sure that the clock would have stayed in place forever."}, {"rating": "10", "text": "Full of reality movie, not only about love, but most of all about the unexpected paths, that life can wildly take. Stunning, powerful, emotional. If you like movies, that give you a lot of hours-after-watch thinking, then this one is for you. I think the normal reaction for this movie is to fall in love with it, every part of it.    To the essence. You will not even feel the fantastic part as such, it feels like something possible and totally normal, to the point of experience empathy. The transformation of Brad Pitt is just unbelievably good, you could justifiedly think, that the old man is part of the cast. Also, Brad Pitt performance is indescribable.. I have no words really. He did a brilliant job!! Brad and Cate Blanchett would gave made great couple, don't you think?Overall perfect details, soundtracks and basically cast performances. Masterpiece!"}, {"rating": "10", "text": "Get ready to cry. This movie deserves more than a 70, proving that the \"critics\" are not always correct."}, {"rating": "10", "text": "Such a Magical movie, with a great cast, and an inspiring and emotional concept. Beautifully crafted, it deserved best picture."}, {"rating": "9", "text": "Crafting a story like this is a feat that is rarely seen in cinema. There is a real chemistry between Pitt and Blanchett and this is coupled by a storyline which gripped me as soon as I had seen the trailer. The story never gets old, much the same as its protagonist."}, {"rating": "9", "text": "Absolutely beautiful! Long but I didn't feel it because I was caught by the story. Scott Fitzgerald was indeed a great author, and I loved the fact that they were able to portray his work in this wonderful movie. Just because a movie is not 'realistic' and is based in fantasy doesn't mean that there are not important issues to be explored. This movie is about inner strength about having the ability to get through life with faith, acknowledging one's limitations yet, fighting to acomplish our goals. It is also about loyalty and courage... and about frustration too, because not everything can be changed since there are things that escape to our hands. It may be over emotional and overly 'optimistic', but it does not diminish its value. It is not a drama, it is not a thriller, it is not a comedy.I wouldn't put it in a specific category...this just IS a wonderful story, written by a great novelist...and brought to be enjoyed in a total different way...the big screen!"}, {"rating": "8", "text": "Very good movie. Cry, your heart will suffer, but not leave wing time to enjoy."}, {"rating": "5", "text": "Benjamin Button is a great mixed bag of a film. Despite it's many problems (length, similarity to Forrest Gump), however, aren't its undoing. The undoing comes in the form of a distinct clash of ideas, inappropriately trying to mesh screenwriter Eric Roth's sentimental and wonderful view of the world with director David Fincher's cold nihilism and rewarding distance from connection. It is these two moods that tear apart Benjamin Button."}, {"rating": "3", "text": "Everybody keeps talking about how this ripped off Forest Gump, which is true, but nobody talks about how it also stole a lot from the notebook (which i didn't really like in the first place) It had good special effects but like an hour of the movie wasn't needed it was way too melodramatic and it was too unoriginal. so many better movies from last year. It will probably win best picture though the academy is due to make a bad pick they've been on a good streak."}, {"rating": "6", "text": "This movie is just too long. I don't have a problem with long movies when there is a justifiable reason for the length..."}, {"rating": "4", "text": "Absurdly long, I was glad it was over. The movie was nothing more of a love story, and had nothing to do with the actual reason to why he was born an old man. Don't waste your time. Too much hype for such a dull movie."}, {"rating": "2", "text": "Boring, trite--with absolutely no character development or insight. Nearly 3 hours of tedium with excellent special effects. But who goes to the movies for merely special effects?"}, {"rating": "1", "text": "The film seemed to have no point other than to show authentic costumes and sets from its various time periods. I felt no connection to the characters during the almost 3 hour running time. Did the story have a point?"}, {"rating": "5", "text": "Can't fault the art direction, cinematography, or the acting, but it's three hours of one depressing scenario after another. if there's anything to take away from it it's that everything is pointless and doomed to misery, not exactly a feel-good movie."}, {"rating": "5", "text": "Held my attention the first third, then began to fall into tepid interest. I could tell it wanted me to care about these great moments, but I just didn't. Also came the epiphany of seeing this before, when it was called \"Forrest Gump\" --- This really affected the rest of the movie for me as I was constantly comparing everything that was happening in Button to Gump (Roth is shameless, for sure). However, the direction, cinematography, VFX and Tilda Swinton were all terrific."}, {"rating": "5", "text": "Benjamin Button went from being elderly to middle-aged in just four years, in this film's hurry to give us a handsome, salable Brad Pitt. That's not the only thing that bothered me about \"The Curious Case...\". Elderly whites did not shake hands with blacks in the 1920s South. Men did not wear shoulder-length hair in the 1930s. Unless he was very psychic, Benjamin could not have known the long list of factors that led up to the Cate Blanchet character being hit by a cab. If the premise is Benjamin aging in reverse and growing mentally sharper each year, why does the film depart from that theme and have Benjamin getting Alzheimer's as a child? When an entire movie is built around a gimmick, I think the gimmick should be given more care than this one was. Some good performances and excellent technology, but unfortunately the movie doesn't live up to the interesting concept."}, {"rating": "3", "text": "It never ended. It was a rehash of Gump. It was flat out boring. IIf you do want to see it wait for it on Netflix. Not worth the ordeal."}, {"rating": "2", "text": "This entire movie is like the ending of \"The return of the King\", multiplied by 1000."}, {"rating": "0", "text": "This was the worst movie I have seen in my life. I am so mad that its getting all the Oscar nominations, because Brad Pitt can't act, and the actor couldn't string together a good story to save his life. What was with the guy getting struck by lighting? Did that have a point? And please do NOT compare it to Forrest Gump, because that was a masterpiece, and Button was garbage."}, {"rating": "4", "text": "Way too long, and wreaking of Forest Gump. Also, Brad seems to have been taking acting lessons from Keanu, because his expression hardly changed throughout the whole film. I say expression, when for the most part he was expressionless, his mug showing nothing more than a slightly confused twinge. Tilda Swinton, as normal, saved the day and acted everyone else off the screen, even though her subplot was of no consequence. A lot has been said about the CGI used during the movie. I didn"}, {"rating": "3", "text": "I agree with Mike la Salle. Long tedious, and without anything memorable. I saw three films the Day I saw button. And I had to be reminded I saw it. Nothing about it was stand out. The title describes it best. Curious. But that's it. otherwise dull, and flaccid. Was happy when it ended."}, {"rating": "2", "text": "Very long and uninteresting. While we observe the character throughout his life, there is exactly one line about how it is for him to live this backward life. Except for a few scenes in this three hour movie, there is little to differentiate this from any other movie about the life of a mostly uninteresting person. Button's character may be uninteresting, but the female lead is just unlikable so the romance narative becomes unbelievable and unable to hold the movie together."}, {"rating": "4", "text": "This move was poorly edited, too long, and boring. There was no chemistry between Bard Pitt and Cate Blanchette. A real disappointment - typical Hollywood schlock."}, {"rating": "3", "text": "i give this movie a 3 on 10, and its only because of the great make-up they made on pitt's face. i thought brad pitt's acting was horrible, as it always is, and the story wasnt intriguing at all. i wasnt captured by the story, because it was like a series of events happening in benjamin's life and him getting younger and younger, nothing more. The movie is only made to make viewers imagine how life would be if the clock was turning the other way, but theres no story behind the idea. Kate blanchett is a great actress, but i didnt think she had much to do with what they gave her."}, {"rating": "3", "text": "If you want to know what it would be like if a man was born old and then grew younger, watch this. However it is a long tedious movie experience with little redeeming qualities, great visually, but the plot lacks certain elements for a good story, such as, characters that make you feel for them."}, {"rating": "3", "text": "Ponderous, boring. BB's reverse aging actually contributes little to the plot, since he has the mind of a young person in the beginning, and of an old person at the end, so what you're left with is just a conventional life story that has no real individuating elements, just a bunch of nearly randomly assembled elements pulled out of the grabbag of movie cliches: overwrought military death scenes already a subject for parody in Tropic Thunder. The everything could have been different montage before the tragic accident. Etc. The only real unique interest in the reverse physical aging plot could have come in the last 20 years of Button's life, and there was a potentially good short movie inside this unfortunately long one. It would have involved B having a continuous relationship with his family. An interesting and courageous movie could have shown him as an experienced man in a child's body, treated like a child in society, eventually not allowed to make his own decisions, interacting with his child in the body of a child, having sex with his aging wife as a teenager until they have to stop--the conflict between desire, repulsion, and social restraint there *could* have been an amazing story. But it wasn't to be. And further it was poorly cast; Pitt and Blanchett have no chemistry and aren't plausible as a couple, and Pitt seems a little too dumb in his affect to play \"simple\" without becoming totally insipid and boring. I didn't like much Forrest Gump much, and in fact thought it's entire value system (Forest's disengagement is purity/Jenny's engagement is corruption) was messed up, but at least in its messed up value system it was an interesting social text. This was just maudlin kitsch."}, {"rating": "0", "text": "I was first afraid to watch this (child) but i turned from afraid to ashamed.i mean its like watching a cocoon turn into a butterfly. the promotion of it is getting younger with age, but i just DO NOT FEEL THAT.(SPOILERS) I MEAN SAILING?(SPOILERS END), come on man,everyone of my family members who went with me agreed that it was too long.my dad even said you could use a DVD of it as a torturing device.if you ask me,i think the director foucused more on the sexual scenes than anything else. i mean come on.but then again,its all me, im sorry if i said somethings that you liked about the movie(not sarcasam).but really, its just too long and meaningless for its own good."}, {"rating": "5", "text": "Another hollywood trying to be deep and profound and moving movie that just doesn't cut it. Pretty tepid, but mildly interesting."}, {"rating": "5", "text": "Despite the seamless CGI work, this film is seriously flawed and bears little resemblance to the F. Scott short story of the same name. Very good acting does not save this overlong film. 'The film version of the 'Time Traveler's Wife', with a similar theme, promises to be better."}, {"rating": "0", "text": "Excruciating. Long. Like Forrest Gump without the humor or wit."}, {"rating": "1", "text": "I really didn't like it, reminded me alot of the notebook (which I hated) and a wannabe Forest Gump. Personally I think the movie had some weak morals, not to get all preachy. I couldn't wait for it to end, because of my girlfriend. It's only enduring quality was wondering what would happen to Mr. Button, although I really didn't care. Pure Cheese."}, {"rating": "0", "text": "I was no longer curious after this movie wasted 2 hours of my life. One of the worst movies I have ever seen."}, {"rating": "2", "text": "Just boring. Exactly like forrest gump, except his travels weren't interesting."}, {"rating": "3", "text": "Everything was exquisite except for the story. Very boring!!"}, {"rating": "4", "text": "Soooo slow ... After 2 hours and 40 minutes, I still couldn't tell you what the actual story was about."}, {"rating": "5", "text": "Brad Pitt seemed to have no way into this role. When he wasn't in his beautiful prime, his Benjamin felt like an empty cipher. The make up on the \"old looking\" Benjamin was distracting; as if a powdery layer was smothering not only the face, but the personality, of Brad Pitt's Benjamin. This was not a movie about a human being, but a movie about an idea. The Ideas were interesting for a time but the lack of truly interesting, felt characters could not keep those ideas alive for two and a half hours."}, {"rating": "5", "text": "Halfway into this movie I turned to my lover and both agreed that this movie was terrific. Unfortunately this is a tale that, in my opinion, cannot be brought to a satisfying conclusion. Nice try, Fincher, but I left the theater troubled and disappointed."}, {"rating": "3", "text": "Way too long and uninteresting. We get no insight from the title character and do not care about either of the leads. We could not wait for this to be over."}, {"rating": "1", "text": "This gets a 1 for Special Effects, a 0 for script, direction and audience-numbing duration. My nephew left after 50 minutes. I envied him for the next long, long 2 hours. Unmitigated codswallop."}, {"rating": "2", "text": "Overlong, self indulgent, cliche ridden dreck. It gets a 2 because the cinematography was good. The acting was soulless, the score generic and overwrought. Everything about this film failed. Absolutely hated it."}], "recommendations": ["the_fault_in_our_stars", "her", "there_will_be_blood", "meet_joe_black", "hereafter", "manchester_by_the_sea", "boyhood", "hugo", "me_before_you", "the_power_of_the_dog", "greenberg", "the_place_beyond_the_pines", "the_good_shepherd", "the_butterfly_effect", "revolutionary_road", "blue_valentine", "into_the_wild", "alice_through_the_looking_glass", "the_mountain_between_us", "seven_pounds", "gone_girl", "the_age_of_adaline", "magnolia", "collateral_beauty", "what_happened_to_monday"]}