{
  "id": 4084,
  "title": "The Wedding Planner",
  "starring": [
    "Jennifer Lopez",
    "Matthew McConaughey"
  ],
  "runtime": 103,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "San Francisco's premiere wedding planner, Mary Fiore is rescued from an accident by the man of her dreams, paediatrician Steve Edison, only to find he is the fiancé of her latest client. As Mary continues making the wedding arrangements, she and Steve are put into a string of uncomfortable situations that force them to face their mutual attraction.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/meq4bLUPcBlOG3Z5YdiWuBMlpO.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This is were Lopez's  rom-com's stop now! you have the guy  lead Matthew Mcconaughey, (great actor!) who tries to play his character very well; but he do good in this film if the script is in the way?\rGrade D"
    },
    {
      "rating": "5",
      "text": "Jennifer Lopez is stunning and perfect in every scene, Matthew McConaughey is a very pleasant presence (although not as charming as after the hair miracle that the actor will experience in a few years). The story is what it is, fake as a plastic flower, and yet it would have been watchable if there was not an imbarassing poor depiction of the Italian maybe-to-be fiancee Massimo: the goofy, insignificant, language-cliché speaking (\"Mangia, mangia\"), and ultimately boring young man cannot even start hoping to share the same room with JLo's character, let aside marring her, therefore this part of the story is far from being believable: it would have worked better if there were some real competition between him and McConaughey's character. 9 for JLo, 5 for the movie."
    }
  ],
  "recommendations": [
    "american_hustle",
    "crazy_heart",
    "the_devil_wears_prada",
    "snow_white_and_the_huntsman",
    "palmer",
    "scent_of_a_woman",
    "a_few_good_men",
    "burnt",
    "the_dilemma",
    "black_mass",
    "meet_joe_black",
    "as_good_as_it_gets",
    "joy",
    "the_king_of_staten_island",
    "the_tourist",
    "elektra",
    "silver_linings_playbook",
    "lawless",
    "lady_bird",
    "the_aviator",
    "the_assignment",
    "cruel_intentions",
    "hustlers",
    "all_the_money_in_the_world",
    "daredevil"
  ]
}