{
  "id": 4794,
  "title": "The Recall",
  "starring": [
    "Wesley Snipes",
    "RJ Mitte"
  ],
  "runtime": 91,
  "genre": [
    "Science Fiction",
    "Horror"
  ],
  "description": "When five friends vacation at a remote lake house, they expect nothing less then a good time, unaware that Earth is under attack by an alien invasion and mass-abductions.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yq2DGzM0kNWtGwkplGAcEEM4eSH.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 0.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "It been long-awaited, but Wesley Snipes is FINALLY BACK! After making his big screen return in the high spectacle action ensemble The Expendables 3, the master martial artist and actor has been rediscovering his rightful way in Hollywood again, appearing on the television series The Player and contributing a very inspiring role in Spike Lee’s very underrated and last feature film Chi-Raq and of course, his newest endeavour, The Recall. In The Recall, Snipes returns to his action and science fiction roots that once made him a household name, delivering on all the action and comedy that he was famously known for. Directed by famed illustrator and production designer Mauro Borrelli, Snipes is once again put under the spot light as a mysterious hunter who was once an astronaut who was abducted by aliens, and has sent the remainder of his time preparing for the next invasion against humanity’s greatest threat.Pitted with some young, rising talent in Jedidiah Goodacre, Laura Bilgeri, Hannah Rose May, Niko Pepaj and of course, RJ Mitte, all playing young, cliched teenagers enjoying a weekend getaway at a cabin belonging to one of the teen’s parents, the group must evade the invasion from the unwelcome guests to save themselves from annihilation with the help of their once threatening hunter ally.While The Recall may not be the most inventive and innovative science fiction film to come out this year, it was particularly interesting to catch because of the incredibly unique format it was presented in; Barco Escape video formatting. If you do not what Barco Escape is, prepare to be amazed! Barco Escape is a panoramic, ultra-wide, three screen format that leverages the power of three DCI Barco projectors and alchemy processing, that boasts up to 120 frames per second. The advantages of this format, aside from providing a compelling and completely unique movie-going experience, is the format’s ability to really immerse the images on screen like never before.Aside from The Recall, other films that have had the opportunity to play in the Barco Escape video format are; The Maze Runner, The Maze Runner: Scotch Trials, 6 Below and Star Trek Beyond."
    },
    {
      "rating": "0",
      "text": "I'm very sorry that there are no ratings below zero on metacritic. This film can not be watched, because this film is stupid, uninteresting and untalented."
    },
    {
      "rating": "1",
      "text": "Ruim pra cacete, perca de tempo ter assistido esse treco, não recomendo e dublagem br tão ruim quanto o filme."
    }
  ],
  "recommendations": [
    "blade_runner",
    "star_trek_first_contact",
    "raiders_of_the_lost_ark",
    "stargate",
    "captain_america_the_winter_soldier",
    "close_encounters_of_the_third_kind",
    "pitch_black",
    "jurassic_park",
    "aliens",
    "the_league_of_extraordinary_gentlemen",
    "1917",
    "apollo_11",
    "apollo_13",
    "the_crow",
    "the_martian",
    "sully",
    "the_lord_of_the_rings_the_fellowship_of_the_ring",
    "u_571",
    "nightcrawler",
    "enemy_of_the_state",
    "independence_day",
    "das_boot",
    "europa_report",
    "crimson_tide",
    "deep_impact"
  ]
}