{"id": 1081, "title": "The Devil Wears Prada", "starring": ["Anne Hathaway", "Meryl Streep"], "runtime": 109, "genre": ["Comedy", "Drama", "Romance"], "description": "Andy moves to New York to work in the fashion industry. Her boss is extremely demanding, cruel and won't let her succeed if she doesn't fit into the high class elegant look of their magazine.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8912AsVuS7Sj915apArUFbv6F9L.jpg", "categories": {"plot": 7.3076923076923075, "acting": 7.52, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.2, "action": 7.0}, "reviews": [{"rating": "2", "text": "Beautifully shot, and a great performance by Streep, but this movie is predictible tripe. And I'm shocked that not a single critic even noticed that Hathaway is playing essentially the same part as her roles in the two \"Princess Diary\" movies."}, {"rating": "6", "text": "The movie is a formulaesque story about a fashion magazine and those who write, edit and supply its pages. Women will no doubt love the fashions, the styles and the clothes but all will probably find it simply OK but not really great. It"}, {"rating": "2", "text": "Wow... what a long dull waste of time. Yes, if you're fan of fashion and/or Paris... you will most likely enjoy this film. If your girlfriend or boyfriend MAKES you go to this film, make sure you are repaid well."}, {"rating": "0", "text": "The obsession on weight in this film is disgusting. While some jokes are funny. Some moments in this movie caused me physical pain, and left me wondering how much I'd offend my friends if I walked out and left them there."}, {"rating": "5", "text": "Silly, is the only word I would use to describe a film that had no point and no plot."}, {"rating": "1", "text": "This movie failed to transcend to people uninterested in fashion, and failed to satisfy the eye-candy requirements of someone interested in fashion. The movie was a bad fashion movie, rather than a good movie that happens to take place in the fashion industry. The movie relied on brandnames to interest me for the whole length of the movie. Needless to say, it didn't work."}, {"rating": "0", "text": "Stupid chick flick about stupid fashion."}, {"rating": "6", "text": "I would describe 'The Devil Wears Prada' as decent movie. Not particularly interesting, but funny, instructive and also Meryl Streep. Streep is reason enough. But the movie is definitely overrated."}, {"rating": "10", "text": "Meryly Streep, perfection."}, {"rating": "6", "text": "Too predictable. I couldn't wait for it to end when it was only about a quarter of the way through the movie."}, {"rating": "3", "text": "There's nothing that worthwhile (or funny) in this vapid film geared to people who watch project runway. It's barely even passes for a movie about fashion with a plot runs predictably to a predictable end."}, {"rating": "8", "text": "A witty movie and great performances!"}, {"rating": "4", "text": "Sara M and Mark C are nicely telling you the truth about this film. NICELY, I say. In the end, it's lame. Love Streep, but not even she could have saved this from what it is."}, {"rating": "7", "text": "The first thing to notice about THE DEVIL WEARS PRADA is that it is precisely what it offers - fashion and its cut-throat business. An adaptation of Lauren Weisberger's 2003 novel, it is neatly directly by David Frankel, which is surprising since most of his work usually comprises of the light-hearted family genre. Frankel does one thing particularly well, he lets Meryl Streep, that iconic of all actors, room to breathe life in her character, Miranda Priestley, the ruthless editor in chief of the Runaway magazine, who has scant respect and patience for people, especially those she considers to be incompetent and unprofessional. I was fascinated with Streep's portrayal, she has something that makes her so powerfully alluring, almost hypnotic-like, and she lives and breathes Miranda every scene, every little nuance. Anne Hathaway is no less powerful as Andrea Sachs, the aspiring small town journalist with some impressive literary credentials, who clearly is a misfit in the Runaway scheme of things. Emily Blunt's Emily Charlton, Miranda's senior assistant, clearly doesn't give Andrea much hope, or even encouragement. Emily Blunt is wonderful as Emily, but I didn't get it - considering how particularly precise and impatient as Miranda is, how could she suffer Emily's British accent and her unconvincing work performance is just beyond me! Stanley Tucci is another actor who rises above his material and truly lends solidity to his roles - I especially enjoyed the final scenes when Miranda deftly puts the new charge of leadership to her rival Jacqueline Follet, and Tucci's Nigel responds as Nigel truly would. His mannerisms and emotion, that he tries subtly to hide and disguise even in the face of such a tumultous storm, is just a sight to behold. \"I know she'll pay me back\" is his response. Just what you'd expect from Nigel. Andrea learns lessons about life, not just in the fashion world, but in her own life. Her personal life takes a hit, her boyfriend cannot believe that she's changing as rapidly as she is, her own two best friends think the fashion world is swallowing her. No doubt, she is Miranda Priestley's assistant, doing a job that 'millions of girls would kill for,\" but Andrea is pleasantly unaware of and even contemptuous of this reality. It is gratifying to see that Hathaway's character is so absolutely unlike Streep's....Andrea's easy-going, carefree lifestyle, her choice of words in the most unpleasant of situations, is the exact opposite of all that Miranda Priestley lives and breathes in. The scene where Miranda talks to Andrea, after Andrea had been witness to Miranda and her husband's fight, Miranda's lines and the pain across her face and her emotions....that is Streep at her finest. A vortex of emotions and intricate, subtle gestures of the face, hands, true inner emotions, Streep portrays them all as easily and as beautifully as anyone has ever done on celluloid. In conclusion, this movie's not particularly boring or dull. It is fast-paced, but has ample show of Streep, Hathaway, and Tucci's characters. I gave it a 7 out of 10, not out of necessity, but because I think it's just good enough for it. And that isn't hurtful at all! I only hope Miranda Priestley doesn't confront me about it!"}, {"rating": "0", "text": "Overrated, terrible, boring. I do not know how this got 'generally favourable reviews' I bet the people reviewed this positive despise shows like White Chicks. Basically if you call this show 'perfect' you are boring and I suggest something worth your term because seeing this film in the Cinema was a waste of my life."}, {"rating": "3", "text": "The film felt like i was watching an ABC show on a wednesday night. A typical chick flick with a little taste of fashion. the movie seem to go way off course in the final 30 minutes. Didn't laugh once in this film. disgraceful."}, {"rating": "9", "text": "A really great, spot-on film about fashion publishing--the world where I reside. Streep was perfectly understated as the thinly disguised Anna Wintour. Stanley Tucci was wonderful, as was Emily Blunt. I also loved Anne Hathaway; I don't understand her negative reviews. As someone who as been in her character's shoes, she was real and honest, not a stereotype. \"The Devil...\" is a perfectly accurate portrait of life at Conde Nast Publications. If it seems absurd--try working there!"}, {"rating": "8", "text": "I was really surprised at how entertaining this movie was. Meryl Streep was wonderful and hilarious and Anne Hathaway is a delight. Ever since her amazing turn in Brokeback Mountain, she's proven her talent."}, {"rating": "9", "text": "I quite enjoyed this film, one of my Top 15 ever. I really liked watching Emily Blunt, and Anne Hathaway was pretty good too. Grenier did really well, but if you watched Entourage once you already knew he'd be amazing. Streep, oh Streep, you take my breath away. Perfect role for her."}, {"rating": "8", "text": "Predictable and unenlightening - but, oh, so much fun!"}, {"rating": "7", "text": "Props to Adrien Grenier for his brilliant acting in the Devil Wears Prada. Meryl Streep and Anne Hathaway also star."}, {"rating": "9", "text": "There's no doubt Streep is perhaps the best actress of the past oh say 3 decades.... But as \"the devil wears Prada\" proves Dark Comedy is Streeps strongest Suit. Simply brilliant here. Hands down the best female performance all year. Easily carried this flick to the top of the summer films with just one performance."}, {"rating": "9", "text": "The best comedy I've seen in a long time. Meryl Streep was wicked as Miranda."}, {"rating": "9", "text": "Going into this film, I was really apprehensive, especially since the trailer was compromised of an extended scene of the movie. I had also heard some negative buzz, but I enjoyed this immensely. It was super funny and didn't get bogged down in drama at the end. I love Stanley Tucci and didn't even recognize him as Nigel. Anne Hathaway who I've never enjoyed that much before, excelled here. Meryl Streep was perfect, as always. If you have an interest, definitely catch this in the theater."}, {"rating": "7", "text": "I went into this movie hoping it was the next great leading role film for Meryl Streep that would bring her an Oscar nomination for Best Actress at next years Oscars, but alas, it turns out her record 14th nod will come in the supporting category as \"The Devil Wears Prada\" is actually Anne Hathaways faintly disguised \"Pricess Diaries 3\" and if it were not for Meryl Streep as the Queen B of Fashion, Miranda Preistley, this would be like a dozen other of the Lindsay Lohan-Hilary Duff teeney bop Saturday matinee movies. But then there's Meryl in yet another tour-de-force role completely unlike any thing from her long career of brilliant performances making you wish from the first time she's off screen that the whole film should be about Miranda and not Andy. I rated this movie a 7, with 6 of them being for Ms. Streep. You do the math. \"That's all\""}, {"rating": "9", "text": "This movie was way better than I expected. I wasn't too sure about seeing it and ended up loving it. Anne Hathaway was great, a big surprise for me cuz I am not a fan. Streep and supporting cast was awesome. Wardrobe and fashion were amazing. This movie was truly entertaining and very witty/funny."}, {"rating": "7", "text": "The movie was amusing, but oddly predictable. I loved Meryl Streep's performance, but Anne Hathaway disappointed me a little bit. The only complaint I have to make is that it seems to follow the same pattern of fashion films. DOwdy girl meets fashion world. Dowdy girl has a make-over. Dowdy girl is glamorous. Glamorous girl begins falling apart. Glamorous gil has a break-through. Glamorous girl gets her life back. It was too...generic."}, {"rating": "6", "text": "Meryl Streep made the movie! Otherwise, it was typical Hollywood summerfare."}, {"rating": "9", "text": "There's one scene where Miranda (Meryl) has a personal setback and Andy witnesses her breakdown. With any other actress, you'd feel as though the filmmakers were just trying to throw in some drama. With Meryl, you really feel her pain, and her anguish at trying to control her handling of it. It's thoroughly believeable and in one short moment thouroughly humanizes her character. This is why she is a great actress, and you must see the performance. The writers deserve kudos for not keeping the supporting characters as a two-dimensional joke. What starts out as funny/bitchy with Emily Blunt's or Stanley Tucci's character gets a chance to develop so that you can really feel for where they are coming from and how they cope. That saves the movie from being yet another tired Hollywood farce to actually having some bones."}, {"rating": "8", "text": "I really enjoyed this movie and couldn't give a damn about fashion. Funny and smart and Meryl is great."}, {"rating": "7", "text": "Our finest actress give another outstanding performance in this sharp and clever, if somewhat over-the-top, comedy. Anne Hathaway deserves far more credit than many of the critics gave her, and Emily Blount and the always dependable Stanley Tucci are excellent in roles that probably would have been stereotypes in the hands of less accomplished performers."}, {"rating": "9", "text": "Just a really fun and respectable flick - with wonderful acting and a sweet story. (Reviewers don't seem to be spending much time on relatively unknown Emily Blunt, but I thought she was as great as the stars!)"}, {"rating": "8", "text": "If you like fashion this is a must. Anne Hathaway and Meryl Streep are a dream team. Go see it!"}, {"rating": "8", "text": "Not a lot of substance to this movie, but what was there was terrifically entertaining. Meryl Streep is at her whispery best with every scathing line she delivers. I don't think you have to love fashion to appreciate the humour here. If you've had a boss that makes you feel like an idiot you can relate to everything that's going on!"}, {"rating": "9", "text": "This is a funny, intelligent movie that is not about fashion, but about what it takes to reach the top in many American industries: brains, ruthlessness, ego, and hard, hard work. One of the best Hollywood movies in ages. Stay away if you love mindless junk."}, {"rating": "10", "text": "not a dull second, wonderful cast and acting."}, {"rating": "10", "text": "This near-perfect summer sleeper (at least it was a sleeper to me) provides a tour de triumphe performance by the one and only Meryl Streep, and good fun, and a few heartbreaks, in between. Sad evening."}, {"rating": "10", "text": "If you love the 'fashion world' -- this is the movie to see. Meryl Streep was the perfect 'Devil Wear Prada - Diva'"}, {"rating": "10", "text": "Simply the best of 2006!"}, {"rating": "7", "text": "A poorly written book becomes an appealing film. I work in magazines and found it at once perceptive, irritating and funny. (Believe it or not, all that backstabbing does go on. And the high heels are true. So is the way the girls are judged by the way they dress. Boys are generally exempt.) Anne Hathaway's character is a complete drip and so is her boyfriend. The film is Streep's and Blunt's. In Emily Blunt, I think we have a screensensation. Watch \"My Summer of Love\" if you don't believe me."}, {"rating": "8", "text": "Entertaining but a bit predictable. A mirror to those who lose their way in trying to succeed. Streep does a perfect job with her role."}, {"rating": "5", "text": "Amusing but essentially lightweight and insubstantial. Nothing wrong with that really - and there are some good performances. But there"}, {"rating": "9", "text": "Its not simply a film about fashion. Its a great film about power, goals in life and about the conflicts that emerge when you have to hurt other interests in order to create a part of the world according to your ideas (Miranda)."}, {"rating": "9", "text": "I had very low expectations for this film, but went to see it because it was my date's choice, and I was pleasantly surprised! Streep was awesome (as usual!), and I was captivated by the film from beginning to end. It's comedy and satire with enough drama to make a thoughtful viewer ask himself/herself a question or two about personal values vs. career development."}, {"rating": "9", "text": "Meryl Streep was incredible as always, Anne Hathaway won my newfound attention, and the comedy was great. This is one of those feel good, high fashion, laugh out loud movies you need to go see now!"}, {"rating": "9", "text": "Don't go to this film in the belief that you are going to see a great story brought to life. You already know the story. This is about Meryl Streep and some of her colleagues. The acting is really fine, the movie is well put together. The story, such as it is, moves right along. This is good entertainment."}, {"rating": "5", "text": "The acting is saved the whole movie. The plot was over all not very dramatic and predictable. I knew what the protagonist was going to do within the first twenty minutes of the movie. Kudos for Streep and Hathaway. Great acting but next time find a better script."}, {"rating": "7", "text": "While reading Lauren Weisberger's semi-autobiographical account of an ambitious, impressionable young would-be journalist laboring for The Boss From Hell, I mentally pictured demon employer Miranda Priestly as not being pictured at all in the inevitable movie version. Like Niles Crane's ultra-high-maintenance first wife Maris on TV's Frasier, Miranda's evil seemed so completely unbridled that any actress, no matter, how good, would seem to merely trivialize it. Then comes Meryl Streep's delicious, stunningly effective minimalist interprestation of a powerhouse who changes lives, fortunes and fashion lines with the merest head nod or eyebrow flicker to show me how gratifying it can be to be wrong every now and then! Streep has compared her approach to much of Clint Eastwood's deceptively soft-spoken but deadly screen persona, but I'd liken it more to Anthony Hopkins' Hannibal Lecter; both the Runway magazine editor and the mass murderer are at their most seemingly placid right before chowing down on your liver! The Silence of the Lambs analogy holds up in more ways than one: both films deal with young professional women in danger of being completely absorbed by the monsters they must deal with in order to move up in their chosen fields, but Anne Hathaway's Andy Sachs is in far greater danger of beeing completely tainted by the encounter than Jodie Foster's neophyte FBI agent Clarice Starling ever was. Unfortunately, Devil (the movie) flinches a bit and compromises Devil (the book) by humanizing Miranda in one scene and having her perform a genuinely decent act in another, but this is still good, glossy fun, also largely due to excellent support by Stanley Tucci and Emily Blunt, the latter pulling off the small miracle of really getting you to care about her character even though she treats Andy with nothing but condescension. Wisely, the movie deemphasizes Andy's virtuous but dull friends from the outside word, knowing that the Runway workplace is really where the action is, but its message is clear: there's definitely something wrong with an employer and work environment that convinces any woman with Anne Hathaway's body that she's \"fat\"! And while it's impossible to imagine the lovely Princess Diaries ingenue as unattractive no matter WHAT she's wearing, it's obvious that Andy is infinitely cuter, more natural looking and a far nicer person in the blue cotton sweater she wears in her opening scenes than the chic designer attire she's later pressured into stockpiling. The Devil Wears Prada asks a lot of pertinent questions about QVC America's willingness to allow itself to be manipulated into burning out its Visa cards year after year by such nasty, manipulative \"style-makers\" as Miranda and her ilk, but one could, to be completely fair, equally question the ethics of Andy's working-girl togs, which most likely were made in Indonesian swaetshops where the children employed there make barely enough per hour to get a Butterfinger bar out of an American vending machine. But then, that's material best left to Wal-Mart: The High Cost of Low Price documentarian Robert Greenwald, not Prada director David Frankel, to deal with!"}, {"rating": "10", "text": "I'm giving this movie a 10, because I haven't seen such an intellegent coming of age movie with a girl in so long. And this is that and a whole lot more. Adrian (from Entrourage) is soo hot, Meryl Streep is astonishing in her role as the fashion goddess of the world, and Anne Hathaway gives an incredible performance in this story about career, love, and the snobby, cutthroat upper class of New York. But for anyone who wants to see a good movie with a lot of style, this is it!"}, {"rating": "10", "text": "Thoroughly enjoyed it. Meryl Streep is wonderful to watch. Even my husband said he enjoyed it."}], "recommendations": ["as_good_as_it_gets", "blue_jasmine", "scent_of_a_woman", "rain_man", "still_alice", "gifted", "marriage_story", "joy", "hustlers", "fatherhood", "the_intern", "what_women_want", "silver_linings_playbook", "american_hustle", "the_edge_of_seventeen", "morning_glory", "leaving_las_vegas", "revolutionary_road", "the_judge", "the_fighter", "lady_bird", "the_danish_girl", "vicky_cristina_barcelona", "the_descendants", "blue_valentine"]}