{
  "id": 2801,
  "title": "The Neon Demon",
  "starring": [
    "Elle Fanning",
    "Karl Glusman"
  ],
  "runtime": 118,
  "genre": [
    "Thriller",
    "Drama",
    "Horror"
  ],
  "description": "When aspiring model Jesse moves to Los Angeles, her youth and vitality are devoured by a group of beauty-obsessed women who will take any means necessary to get what she has.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d93h9dHIez9zRg4ooG6o1ZiQ776.jpg",
  "categories": {
    "plot": 6.714285714285714,
    "acting": 7.4,
    "ending": 7.285714285714286,
    "soundtrack": 7.636363636363637,
    "cinematography": 6.785714285714286,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Avec Nicolas Winding Refn, on ne sait jamais sur quoi on va tomber... parfois, ça peut être génial mais le reste du temps, c'est soit moyen, soit totalement nul à chier. Avec son \"démon du néon\" dont on doit reconnaître au moins la bizarrerie, on ignore ce qu'il a voulu faire et on suppose qu'il ne le savait pas lui-même...Ce \"démon\" n'a pas pour lui cette absurdité absurdement drôle de quelques films de David Lynch, ni une quelconque satire (ou dénonciation ?) du milieu de la mode et de ses petites poupées quasi-anorexiques. Il manque d'ailleurs la cocaïne, étrangement absente de ce petit monde-là et qui aurait pu expliquer ces bizarres comportements...On reste aussi sur sa faim question cul alors que la maquilleuse lesbienne avait aiguisé nos **** mais de toute façon, elles sont trop maigres pour aiguiser quoi que ce soit, trop froides et déshumanisées. Il a au moins su montrer ça, l'inhumanité de ce milieu mais ça ne suffit pas, d'autant qu'on s'emmerde sans discontinuer pendant les deux plombes que dure cette litanie assommée de musique électro, pour noyer le poisson sans doute.Mauvais numéro donc ici, sur toute la ligne pour un film inepte de bout en bout et complètement foireux."
    },
    {
      "rating": "0",
      "text": "Absolute dog **** waste of time. Literally no plot beside JeAlOuSy BaD. Actually pissed off at myself for wasting 2 entire hours of my life on this ****e. Jezus **** christ. The last 15 minutes were kinda going in the direction of \"interesting\", but it kinda came out of nowhere, didnt make ANY sense what so ever, and was all too little too late."
    },
    {
      "rating": "0",
      "text": "This movie is total ****. Nothing in this movie is likable or logical. The acting is flat, the story is atrocious, the movie has the weirdest vibe meshed with awkward forced scenes. This is Refn's worst movie. This movie doesn't deserve to be called a film, this is easily one of the worst films ever. Every second of this movie is pointless."
    },
    {
      "rating": "0",
      "text": "Vile, disgusting and absolutely pointless.It features not much more than cannibalism, necrophilia, flashing lights, try hard overt metaphors and is quite possibly the worst \"modern\" movie I have ever seen.On so many levels this garbage shouldn't even exist and on this basis I will never watch another movie Nicolas Winding Refn is associated with ever again."
    },
    {
      "rating": "0",
      "text": "Pretentious Garbage! There's virtually no plot, a bunch of useless scenes stretched too long, and very wooden acting by Elle Fanning. Yes, it's visually stunning sometimes, but that's not a movie, that's a picture or a painting. I don't know what happened to director NWR after 'Drive' (which I liked), but this guy has no idea what makes a good movie."
    },
    {
      "rating": "0",
      "text": "This is not a movie. This is not a story. That thing despises everything about cinematography and literally **** on it. I can only regard this as a collage of America's next top model shots with 0 brain activity and poor dialogs which are next to non-existent. I wasted 2 hours on this. At least it has some good music. Please watch this thing, because everyone need an excellent example of what 0out of10 in movie business looks like. Because this is 0. Not 1. Not 2. Not 3. Just a plain 0."
    },
    {
      "rating": "0",
      "text": "Don't waste your time and money on this one unless you liked the type of movie where  Keanu was turned into a walrus. I wish I had walked out after being bored to death for the first hour. Only stayed to see how this nonsense would end"
    },
    {
      "rating": "3",
      "text": "Elle Fanning plays a 16-year-old beauty from the Midwest, who shows up in LA to be a model. She discovers a world of insecurity, viciousness and some even weirder stuff. Director Nicolas Winding Refn is known as a dramatic visual stylist, but the design of this film is pretty much all it has to recommend it. Then again, you can watch MTV for 15 minutes and see lots of cool images…without the stupid dialogue and agonizing pace. You've heard the expression, \"You could drive a Mack truck between those pauses\"…in this case, you could drive a whole convoy between most of these lines. The film certainly creates an intriguing world and there are some striking visuals, but as it progresses…so slowly…the pretentious approach loses its edge and the absurd twists just seem silly."
    },
    {
      "rating": "3",
      "text": "It's not anymore a competitive world, but jealousy!\r It started off very well and in the half mark, it completely lost. In the initial part, it looked like a normal film and then I think even the writer does not know what could happen, they just improvised with whatever they had. Writing was totally messed up. When they had the great characters, it becomes nothing in the end. I'm not a fan of this director, and all his films are average, but this one is the worst among them.\r I'm not an art film hater, though I hate wasting scenes without any developments and this one had many like them. If you trim them all out, the overall film is around 45 minutes. The rest of the film was just music, colourful lights, and sometimes totally idle, which definitely drag the viewers to the boredom.\r Whenever there was a scene with the story, like dialogues and developments, I thought it was going well. But then those useless, dialogueless segments turned me off. Especially the conclusion was absolutely crap. Elle was good, like a character made for her. Keanu Reeve was useless, his addition was just a marketing strategy that did not click.\r This is the story of a teen girl aspiring to be a model, but surrounded by the jealousy people because of her fast growth. How it all goes between them and in the fashion world is what the film talks. The film is watchable, but mostly the second half onwards it gets boring. In the end, I don't think anyone would be satisfied completely with their watch, maybe very, very few, but if you consider the majority, this does not deserve to be suggested.\r 3/10"
    },
    {
      "rating": "1",
      "text": "The Neon Demon has one good feature - the camera footage and the soundtrack. Who loves movies by director Nicolas Winding Refn, may not be disappointed, even though I was. But who seeks for a meaningful movie or a smart story or anything that you can identify with, this movie most likely will be disappointing. I decided to watch the neon demon, because the trailer, the colors and the soundtrack drew my attention. The Neon Demon, is different, but that’s not the part which makes the movie watchable.\rAfter Movies like Drive by Winding Refn, I was expecting something at the same level, but the neon demon cannot live up to it.\rThe story is quite plain. Inexperienced underage girl wants to become model and leaves to the big city, facing the model business and is on the way to become successful. I don’t want to spoil the movie or go too deep into the story, but what killed my wish to enjoy this movie is the absolute non-existent story line, the overly long pointless scenes, where absolutely nothing happens…. and of course the “twist” in the last part of this movie.\rThe whole movie is almost a 2 hour long exploitation of Elle Fannings body, her face, her eyes and so on. In multiple scenes I told myself “Ok….. We already got it the other 20 scenes before… -That girl is so special…. But can please something happen?”. I am sorry for everyone who has not seen the movie yet, but nothing will happen… The “twist” is just feeling like a – “Where is this movie going?? – I don’t know – let’s do something gross and “shocking”, but it won’t lead to a conclusion or a point where you as a viewer might feel satisfied…\rOpen, disturbing and provoking scenes, do not make a good movie. For me it is just wanting to “shock” the audience – but sadly in the most plump and clumsy way.\rAll in all nothing convinced me that this movie is a must see. No outstanding performances, nothing.\rAll characters are like stereotypes and feel kind of wooden. The **** the beauty, the slut, the jealous, the criminal, the perfect boyfriend…\rIf you don’t want to waste your time and ask yourself what did I just watch? Make a bow around this movie. If you are that kind of viewer who wants to find a deeper meaning in a total pointless movie, then go for it and call it a piece of art.\rNothing about this movie convinced me\r1/10"
    },
    {
      "rating": "3",
      "text": "more than being a movie it`s art.but not in a way you enjoy it. you feel it and understand the feeling and you get the point wich sound`s that is what director wants but you won`t have a good time watching it."
    },
    {
      "rating": "2",
      "text": "The term 'style over substance' is often overused and/or misunderstood, but I feel like this movie is the absolute epitome of that concept. \"Visually stunning\" is the only possible good thing to say about this film."
    },
    {
      "rating": "6",
      "text": "Nicolas Winding Refn sets up a really engaging premise with strong themes and a great cast.  Unfortunately, The Neon Demon goes way off the rails in its second half.  It still has Refn's signature flare for style, with some absolutely breathtaking visuals, but I was ultimately left feeling empty and disappointed."
    },
    {
      "rating": "5",
      "text": "its okay. it reminded me of classic mean girl films like heathers mixed with 80s italian horror. still just because its visually stunning with a cool soundtrack, the story is clunky, uneven and confusing."
    },
    {
      "rating": "8",
      "text": "It's a complicated film, not by its lack of plot or its critique to beauty, but also complicated for the emotions managed with the cinematography and music. It's a metaphor on what society has become, a society in which beauty it's the only thing. Love it or hate it, it's strong."
    },
    {
      "rating": "8",
      "text": "Whenever I watch a Nicolas Winding Refn film, I can tell it's by him without checking beforehand. His films possess similar qualities, such as flashy cinematography and subtle, mature storytelling, though the quality of this form of storytelling has taken a dip in his most recent films. While Drive (and arguably Bronson) had great visual metaphors that will be picked apart and analysed by film students for decades to come, Only God Forgives lost the subtlety and had the weakness of thinking it's plot was smarter than it really was. So where does The Neon Demon come in? Well it's hard to say exactly how much in the way of subtle storytelling there truly was in the film. I'll be buying the Blu-Ray when it comes out next month and studying the film relentlessly to spot all the foreshadowing and symbolism, but I did notice the shift in colour pallet that occurred in a crucial scene half way through, representing a character's arc. However, aside from all of the details I may have missed, what I mean by it being hard to say, is that the director has not made it clear or not whether many of the events in the film are metaphors or actually the real events of the film. I refer to the ending (don't worry I won't spoil anything) in particular. Refn has consistently spoken about the film's ending in a literal sense. Though I have heard theories that the events mirror parts of classic English literature and that the 'Neon Demon' in the film could be the ruthless city of Los Angeles our main character models in, it could be possibly that we as an audience are supposed to take what happens seriously. Since I saw this film back in July, I have been debating with myself as to whether the film's ending is a stroke of genius or a slip-up in an otherwise impressive film. Admittedly, in my own opinion, art isn't truly art if it doesn't offend some people. The ending to Neon Demon is designed to be shocking and memorable, and it succeeded. It is easily the most memorable ending to a film I've seen all year. But does that make it great? Would it be a better ending if it was more believable and grounded in reality. I'd have to watch it again to decide. Overall, though, great film."
    },
    {
      "rating": "10",
      "text": "The story was interesting, the acting was excellent (Harrington and Reeves being the highlights), the movie was well crafted and entertaining, the cinematography was beautiful and the ending was amazing. The Neon Demon is a true masterpiece and another win by Nicolas Winding Refn."
    },
    {
      "rating": "7",
      "text": "Great movie. It's a Nicolas Winding Refn movie so we all know what that means. You either love it or hate it. He's constantly been accused of all show and no substance. And I have to say even if it isn't his best film it still is very good. Elle Fanning was absolutely fantastic as Jesse. The acting overall was very good. The soundtrack and the presentation was superb as well. I also genuinely enjoyed the story of the film all the way down to the odd/crazy/thrilling end."
    },
    {
      "rating": "8",
      "text": "In regards to films, 2016 has had its ups and downs. Art, of course, is subjective. One person's garbage is another person's gem.\rThe Neon Demon is one of the most unique and visually stunning movies I have ever seen. A drama/thriller/horror movie that is full of surprises. This is one of my GEMS for 2016.\rI am a fan of the director Nicolas Winding Refn from his other movies i am familiar with, Drive and Only God Forgives. Also two films that were candy for the eyes.\r The plot is both simple and, honestly, a bit thin. A young 16-year-old (Jesse) comes to Los Angels to find a career in modeling. She finds a career and so much more that she or anyone could ever expect..\rThe actual story and the actors in it service their parts well. Keanu Reeves and Abbey Lee are more than effective as the, for lack of a better word, villains in the story. Elle Fanning and Jena Malone are standouts as Jesse and Ruby, respectively..The actual story and the actors in it service their parts well.\r The cinematography is some of the best I have ever seen. Natasha Braier fills the screen with rich, stylish, colorful and disturbing images that left me entranced.\r The soundtrack by Cliff Martinez is GREAT.\r The Neon Demon, honestly, is out there. The imagery carries the weight that the plot and characters have trouble carrying. That being said, there more than a few scenes/images that I was pleasantly surprised by and also shocked by. .\rOdd, strange and bit disturbing. But The Neon Demon is well worth a view."
    },
    {
      "rating": "9",
      "text": "The Neon Demon Pros: Great actingGreat writing The last 45 minutes are extremely disturbing in the best way Beautiful  cinematography Great character development Cons: Pointless scenes Keanu Reeves did not really did to me in this movie. The Neon Demon is one of the best films if not the best film of 2016."
    },
    {
      "rating": "8",
      "text": "This is a solid movie delving into superficiality, consumerism, narcissism, desire and yearning ambition. The tight framing used throughout most the film compliment the characters' fragmented, and somewhat stifling situations. Nicolas Winding Refn's ability to create visual sequences that are at once astounding and bewildering is nigh on unrivalled in mainstream cinema."
    },
    {
      "rating": "8",
      "text": "I love Nicolas winding Refn,this film is beautiful and such and experience easily one of his best"
    },
    {
      "rating": "7",
      "text": "The presentation of The Neon Demon is stellar. Most of the story is told visually. It is both a dialogue on beauty and the modeling world. The character journey of Jesse is predictable and feels a bit rushed. There is a moment where half-way through the movie she seems like a completely different character. Dialogue is a bit spotty, but overall I enjoyed the movie."
    },
    {
      "rating": "9",
      "text": "visual masterpiece. wonderful music. its interesting that the opinions are so polar, you either liked it or not. the minimalistic approach is very engaging, the colors, actors and motifs really stick out this way and in helps to encapsule the idea of modelling and beauty in general"
    },
    {
      "rating": "7",
      "text": "I am a big NWR fan, I love Bronson and Drive and I even really like Only God Forgives.  With The Neon Demon I kind of feel the same as the latter.  Some flaws come from the dialogue being mediocre and the feeling that in some cases less would have been more ( the Jena Malone scene).  Also the Keanu Reeves character really isn't needed as his character takes a strange twist.  Overall though this films main ideas and the incredible cinematography, style, and terrific score by Cliff Martinez makes this a fascinating film.  B+"
    },
    {
      "rating": "5",
      "text": "Very good visuals and crisp cinematography. Decent music and sound.\r Mediocre dialogue. Nonexistent plot.\r It's probably worth a shot if you liked Black Swan or are really drawn in by the visuals as I was."
    },
    {
      "rating": "8",
      "text": "Intelligent and beautiful. Art, not entertainment. Four years after watching this film I distinctly remember specific scenes."
    },
    {
      "rating": "9",
      "text": "At first I couldn't work out whether I was watching a masterpiece or the biggest load of pretentious, empty trash I've ever seen. With a notable lack of traditional narrative or plot the Director relies on the subtext or theme to pierce through the veil of aesthetics and make make some kind of sense for us. The theme has something to do with beauty and how others are effected by it and visually the film is so amazing to look at that this compliments the subtext well. For me it's more like a painting with motion than a film and if it can be seen as such then it's easier to enjoy I think. A lot of scenes in the film just don't make any sense and don't add anything to the thread of a narrative that runs through it, but they are striking and do have an effect on you, which is perhaps the purpose. When the film finished I kind of hated it but as time goes on I'm thinking more and more that it's absolutely brilliant. Winding refn is a real visionary and it's great to see such a different film that doesn't conform to Hollywood norms. Disturbing, beautiful and the soundtrack is out of this world."
    },
    {
      "rating": "8",
      "text": "A very disturbing movie with beautiful visuals and amazing soundtrack. When I say disturbing, I mean it, I wanted the movie end sooner while I was watching it, but now I'm dying to see it again.\r The main thing I feel about the Neon Demon after thinking over is that, everything works. The cast selection, every moment and dialogue, color and vibe, and every repulsive scene help to create the hyper-realistic criticism of the perception/obsession of beauty.\r Then again, there is a good chance that this movie is not for you. Checking for the past Refn movies first can give some idea whether you will enjoy the Neon Demon."
    },
    {
      "rating": "7",
      "text": "Oh man! After watching Nicholas Winding Refn's first Psychological Horror film The Neon Demon, it absolutely impressed the heck outta' me! The things that I seen on the Neon Demon was pretty damn mesmerizing and at the same time, it gets pretty grizzly as we dive into the dark horrifying world where modeling and competition gets way deadly for beauty. For some reason, there are things I would like to debunk about how good Refn's latest film was when it comes to the good stuff and the odd factors that affected The Neon Demon differently after watching it!\r Pros:\r+ Main Actors Performances (Fanning, Malone, Reeves)\r+ Cliff Martinez's Electrifying Haunting Score\r+ That Bedazzling Cinematography\r+ The Beautiful Women\r+ The Visuals!!!\r+ Tells The Exact Representation Of How Modeling Is Very Competitive In The Fashion World\r+ Unfolds How DARK This Movie Was Compared To Black Swan\r+ It Perfectly Matches The Film's Neon Harmony\rCons:\r- Certain Scenes Felt Bland and Kinda Dull\r- Most Characters In The Film Are Underdeveloped\r- Lacks Dialogue and Coherence\r- Story Feels Inconsistent To Follow At Times\r The Neon Demon is one of those movies that seem very pretty to look at when it comes its visuals but at the same time, it suffered a huge loss when most details in the story didn't exactly bond as anticipated compared to Drive or Black Swan and lets be honest, it's way better than Only God Forgives right!\r Verdict: 7/10"
    },
    {
      "rating": "10",
      "text": "A brutal masterpiece that can only be understood in the context of supernatural forces overlaying the hyper narcissism. Refn is the greatest visualist working in film today."
    },
    {
      "rating": "9",
      "text": "Absolutely unreal film, not for the simple minded which is where most of its hate comes in alot of the film has quite abit of wow in it very gripping and it dragged me in considering i wasn't expecting alot from it to begin with... highly recommend!"
    },
    {
      "rating": "10",
      "text": "The movie of the year! Absolutely beautiful, brilliant and intelligent. Refn is a master director that is getting better at each film he makes. It is not a easy movie but it is an unforgettable one, Amazing!"
    },
    {
      "rating": "7",
      "text": "Where “Only God Forgives” was all about aesthetic and showing off his style, “The Neon Demon” Comes with a lot more meat and a return to form in my opinion. At times the film is captivating and at times it is jarring but never dull. Refn is an exciting filmmaker, who makes films his way. As an Auteur is does not bend to make his films more accessible to the mainstream."
    },
    {
      "rating": "9",
      "text": "One of Refn's best. If you're a fan of his previous movies you'll love this one. Each frame had me hooked and the music was incredible. There's a few scenes with slightly distracting dumb dialogue, but an amazing film altogether. Definitely not for someone looking for a traditional horror film, or a traditional film as a whole. The horrors in this are not supernatural but more grounded in the real world. The widespread bad reviews of this movie baffle me but I guess it's not for everyone, especially not for anyone expecting a blockbuster. This movie is slow with very long and beautiful shots. It really hit a sweet spot for me as a Refn fan. I highly recommend seeing in a theater setting."
    },
    {
      "rating": "9",
      "text": "Shocking, mesmerizing, well-acted and beautifully shot, The Neon Demon is Nicolas Winding Refn's best movie yet. Allow yourself to be entranced and seduced by this masterpiece."
    },
    {
      "rating": "7",
      "text": "The Neon Demon in Three Words.  Reffin', Windig, and Rugby!  The Neon Demon Stars Elle Fanning. Refn sprinkles his movie with glitter and neon.\r -L Fan"
    },
    {
      "rating": "10",
      "text": "This film operates on so many levels (emotional and intellectual) that I fear many who are afraid to peel the onion of the deeper insinuations of \"Hollywood\" and the acting/modeling industry will only accept it at face value. This is to do The Neon Demon a serious injustice! True it is a horror movie, but not in the traditional sense. The horror comes from the way the story is being told and ultimately where it goes...The mind-bending way in which this film infiltrates your consciousness is no doubt in part due to the absolutely luscious and vivid colors, imagery, and contrasts. Refn is no doubt a student of Kubrick and Lynch as the influences of films like Eyes Wide Shut, The Shining, Mulholland Drive, etc. are quite evident. This is good though as very few visual journey's are so compelling and lingering. Cliff Martinez's score is brilliant and does an amazing job of perpetrating the uncomfortable anticipation and unease of what may be coming next. Refn does a great job of making us wait for the resolution and Elle Fanning gives a performance that is as beautiful as it is disturbing. Perhaps she is only outmatched by the performance of Jena Malone who has seriously raised the bar on how frightening a female character can truly be."
    },
    {
      "rating": "7",
      "text": "Refn through and through. Gorgeous cinematography, wonderful synthy score, heaps of style, macabre imagery, awkward dialogue, and surreal storytelling you might find pretentious. Like Only God Forgives before it, this one will polarize and is not for everyone, but if you're up for a vivid and distinct sensory treat unlike most films you find in a given year, this arthouse flick is one beautiful satire of beauty."
    },
    {
      "rating": "5",
      "text": "The Neon Demon is weird. It has an interesting premise and ending but is definitely not a movie for everyone."
    },
    {
      "rating": "9",
      "text": "Hypnotic.\r Absolutely outstanding. Glam, beauty, some gore etc with amazing visuals and an intense soundtrack that I've had on repeat for days. This movie isn't going to appeal to everyone but I found it amazing. I saw a screening of it pre release and just saw it in the theater last weekend. See it on a big screen. It was outstanding on the big screen at the Hollywood Arclight Dome.\r Abbey Lee scorches this movie and is just as much the star as Elle. Bella was great as well. Well done.\r Going again next week."
    },
    {
      "rating": "6",
      "text": "\"The Neon Demon\" was a beautiful entirely extremely disturbing thriller, totally hardcore, and the role of Elle Fanning was outstanding, Nicolas Winding Refn did an acceptable job, but from start was exciting until the middle of the I felt intermittent film, sometimes the pace increases and other decreases, but ended in the most disturbing way possible, certainly a hardcore film, a half scale."
    },
    {
      "rating": "7",
      "text": "The Neon Demon was an absolute horror fest with it's over the top moments that get your stomach twisting and your heart throbbing. It had similar sequences to Refn's 'Only God Forgives' where you'd experience things that quick-witted people will understand. But here he uses them to make the audience more percipient and I adored it.\r Rating: 7/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"
    },
    {
      "rating": "7",
      "text": "Arrogantly, but perhaps not entirely undeserved, Nicolas Winding Refn stamps his initials all over the opening credits of ‘The Neon Demon, a stylish, flawed and intermittently stunning visual experience that hypnotises even as it frustrates. Refn’s achievement is almost totally due to his precise and immaculate framing of each sequence and, indeed, each shot. Aided no end by knockout cinematography it all adds up to a fascinating watch as well as being a superb exercise in visual story telling. Admittedly as well as being enticing it is also baffling and there are more than a few longueurs (Fanning’s end of show cat walk being the most glaring example) that could have been excised along the way. Also the film has a couple of rather nasty and distasteful scenes within its framework, one of which involves a knife and the other a dead body, which will certainly alienate a few viewers. Refn’s direction is really better than the slight story deserves. Whereas ‘Drive’ employed a visual style to compliment the screenplay, ‘The Neon Demon’ demonstrates the exact reverse. It does, however, have a good and all-consuming final word about the fashion industry which does compliment most of what has gone before and is certainly not anti-climatic.\rTechnically the film is outstanding with kudos especially deserved in the area of costumes, make-up and sound. Cliff Martinez again provides yet another all-encompassing and vital score for a Refn film which contributes 100% to the overall impact"
    },
    {
      "rating": "10",
      "text": "\"I don't want to be like them. They want to be like me.\"\r My God, this was perfect. I was glued to the every frame of this. The visuals are bar none the best of the year and the musical score is heart poundingly beautiful and intense. All the performances were great, especially Elle Fanning as Jesse and Jena Malone as Ruby. This won't be for everyone and frankly after Only God Forgives I wasn't sure anything Refn did after that would be for me, but this fired on all cylinders and is my favorite film of the year so far."
    },
    {
      "rating": "9",
      "text": "Shocking, disturbing, and audacious, The Neon Demon is a neon-drenched behemoth from director Nicolas Winding Refn that is truly a glorious masterpiece. Things really begin to hit the fan in the second half, but even then, the first half is just as equally brilliant. Together, they form a disturbing look at the fashion industry. Undeniably a horror film, The Neon Demon leaves you cool and numb in the wake of its disturbing images of the industry. Refn expertly creates a parallel between the industry and what is portrayed on the screen, eliciting brilliant criticism on the industry and the way in which it destroys young girls, as well as the way in which these girls are victimized and corrupted along the way. Elle Fanning plays the lead role brilliantly, as the innocent, yet decidedly dangerously beautiful Jesse. The dialogue here is terrific, far surpassing many other films from the Danish director. The score from Cliff Martinez is filled with these synthy, creepy vibes that really wrap its tentacles around you and perfectly accent what is on the screen. The cinematography is incredible. From very cool mirror shots to lush looks at Los Angeles, the camera soaks in the neon goodness and is an absolute wonder. I cannot praise The Neon Demon enough. This illuminati-esque, hypnotic, and thoroughly violent and disturbing film from Nicolas Winding Refn could very well be categorized as a masterpiece."
    },
    {
      "rating": "9",
      "text": "Deliciously darkly decadent with any initial sweetness existing in the characters drawn away like a hungry needle giving blood.\rThis visually striking masterpiece glitters it's way onto the screen with shimmering chimerical glimmers of sound and vision that transports the viewer to a place of elation and euphoria seemingly effortlessly ,in the blink of an eye.\rElle Fanning's character is 16 and embarking on a modelling career.\rThis is the height of visual  aesthetic lusciousness and psychological yumminess and it has a soundtrack that gets so far under your veins,that it will become your life support.\r Never has Heidi Klum's well known Project Runway phrase been more apt 'In fashion, one day youre in ,and the next, you're out.' And it is only the male gaze that decides whether someone is 'special'.\r Exploring the impossible man-made, mysognynistic ideas of  what femininity should be and how women and girls have become so obsessed with achieving this utopian ever-shifting image, an idea. In the flutter of Elle Fanning's fittingly doll-like eyes ,we see women talking in fairly high-pitched little girl voices,infantalised , glossed over girls ,all morphing into one gigantic combination of doll parts.Pricked and prodded surgically enhanced ,with the duality of natural beauty and cosmetic beauty ....? but somewhere along the line ,blink ,blink.blink and the lines become blurred. What length will we ,as women ,allow ourselves to go to, to achieve beauty.....This is sisterhood in a toxic ,ruthless ,enthralling stance.\rWith a largely female cast (satisfying the Bechdel test) ,each as equally arresting in their performance as the next,and all are entrancing, in a superhuman powerful kind of way. A huge nod of respect to Elle Fanning, by Jena Malone, Bella Heathcote, Abbey Lee, the core of the cast.\rThe collaborative writing genius of directed by Nicolas Winding Refn, co-written by Mary Laws, Polly Stenham, and genius director Refn, the threesome that have created what in the duration of the movie becomes akin to Frankenstein's monster.\r It's a Freudian ,Lacanian's dream. Woman representing the phallus ,that fallacy dreamt up by the whole Oedipal Scenario, where in attempts to attain the high stakes of this paradox it's every girl for herself and beauty and ugliness spar like you have never seen before. Lustrre and radiance dance together before us in a way that has the sort of addictive imagery of Kubrick and then some. Majestic riches and sparse scenes are reminiscent of a Miles Aldridge post-modern photoshoot. Lies become the truth and the truth becomes a lie, pop will eat itself and heartbreak shatters a cavernous headspace that will leave you bereft.\rA thought provoking , compelling, statuesque monster of a psychological thriller.\rCinematic excellence."
    },
    {
      "rating": "9",
      "text": "Sarah: \"What does it feel like, to walk into a room, and it's like in the middle of winter. You're the sun.\"\r Jesse: \"It's everything\".\r The Neon Demon is a movie experience that I will never forget. From the minute it starts, I was glued to the screen and not once could I look away, even with the long silent moments, I was still hooked. The LA lights are something to drift away too.\r Nicolas Winding Refn can be a love or hate thing with me. I loved \"Drive\" and \"Bronson\". I didn't like \"Valhalla Rising\" and \"Only God Forgives\" that much. He's got talent, I can see that and I know that he wants to make movies that only he wants to see, and not just for others. I think we all can agree that all of he's movies are shot so beautifully and if one of he's movies as the word \"Neon\" in the title, then you better you expect something glorious. Refn shines in The Neon Demon by adding this dream like fairy tale theme to the mix. There was so many times I had a \"Suspiria\" and a Michael Mann vibe to this (with the use of colors and the LA lights). This was such a step up from \"Only God Forgives\".\r And here's why.\r What \"Only God Forgives\" was trying to get across in it's symbolism was too simple that I pretty much got all of it. It got repetitive in terms of the visual imagery that the film constantly presents, but I feel that those scenes didn't have any glue to hold those previous scenes together. It was pretty much all icing but no cake. And while I got what Refn was doing with \"Neon Demon\" in terms of the fashion industry, but I still feel that there's more to it then that. Even through I don't 100% understand all of it, I still felt that I got more out of it than \"OGF\". Is it obvious of what it's getting across? With the fashion industry, yes, but with everything else, no. I think plenty of re-watches might help, as I do want to watch this again.\r Elle Fanning was pretty fantastic as the beautiful but dangerous Jesse. But I thought Jena Malone steals the show, as she was brilliant. Her character dose the most unnerving things that you can't even imagine, but still manages to be attractive. Oh and I can't look at Keanu Reeves the same way again after this. He's good in this but...damn. Refn characters are not from this earth.\r The opening sequence to this movie is just magnificent. It's everything that a movie should do to get you engaged. The staging was on point, the framing was flawless and Cliff Martinez amazing soundtrack blasting in your ears was just icing. It left a massive smile on my face.\r Where do I even begin with the soundtrack in this movie. It's sexy, stylish with a bit of glitter and just pure magic. It's probably one of my favorite soundtracks of this year. Cliff Martinez is just a fantastic composer that always delivers that an excellent 80's vibe in he's music. Even topping his previous work which I didn't expect him to do.\r There's some things in this that I did pick up on that I'm not sure if others have. The cannibalism in the movie is basically another way of looking at the industry of modeling, with models who actually do starve themselves to death just to get the perfect shape. Basically letting your body eat itself, which is cannibalism. I might be over thinking things, but I thought to throw it in there as a cool little thing to bring to the table.\r Everyone in this film sounds so fake and shallow, and that's not even a complaint. Beauty from the outside but shallow and dead from the inside. It's all intentional.\r It's not a perfect film. The story is flat and the dialogue is really bad in a few scenes. It can be quite stupid at times, but I'm glad it doesn't take itself too seriously.\r This isn't for everyone, as I already have seen two sides to this. You either love it or hate it, and I can understand both reasons. Different strokes for different folks.\r Overall rating: The Neon Demon is a disturbing and yet beautiful film that's very hard to recommend to people. While not my favorite of Refn, but it's pretty damn close, like third place. I honestly can see this having a cult following in the future. I really do."
    },
    {
      "rating": "5",
      "text": "I really liked Drive and Only God Forgives, so I was hoping to watch something on that league but no, It looks and sounds fantastic but by the first half, those things also get old. Is not that is unwatchable but is plain boring, filled with cheap symbolism and \"shocking\" but uninteresting things."
    },
    {
      "rating": "6",
      "text": "Surreal and totally unpalatable in my senses. Violence with unconceal artistry provide me into consternation and I really do not know why this spectacle were watching. It was for pretty women which are not pretty in these curly coats or for those flashing lights? Blows boredom."
    }
  ],
  "recommendations": [
    "under_the_skin",
    "the_green_knight",
    "blade_runner_2049",
    "color_out_of_space",
    "mandy",
    "the_fly",
    "hugo",
    "annette",
    "drive",
    "sucker_punch",
    "inception",
    "black_swan",
    "perfume_the_story_of_a_murderer",
    "roma",
    "paprika",
    "you_were_never_really_here",
    "enemy",
    "antichrist",
    "blade_of_the_47_ronin",
    "last_night_in_soho",
    "the_rover",
    "the_killing_of_a_sacred_deer",
    "titane",
    "eyes_wide_shut",
    "2001_a_space_odyssey"
  ]
}