{
  "id": 1507,
  "title": "The Next Three Days",
  "starring": [
    "Russell Crowe",
    "Elizabeth Banks"
  ],
  "runtime": 133,
  "genre": [
    "Romance",
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "A married couple's life is turned upside down when the wife is accused of murdering her boss. Her husband John would spend the next few years trying to get her released, but there's no evidence that negates the evidence against her. When the strain of being separated from her husband and son gets to her, John decides to find a way to break her out.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wBaRZ3aHa7qoYTSY0ONbXrXYk4B.jpg",
  "categories": {
    "plot": 7.25,
    "acting": 6.846153846153846,
    "ending": 5.636363636363637,
    "soundtrack": 7.0,
    "cinematography": 6.0,
    "familyFriendly": 5.666666666666667,
    "funny": 5.5,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I've seen SO many prison break movies and TV shows - I expected this one to be extremely typical. In other words, my expectations were sufficiently such that I actually enjoyed it quite a bit.  For edge-of-your-seat thrills, it's a nice companion piece to Unstoppable. Don't expect a ton of depth, but it's worth seeing."
    },
    {
      "rating": "9",
      "text": "A hugely underrated movie, it has an emotional depth and attention to detail lacking in many movies in its class.  It asks a familiar question:  what is important to you in life?  Then it takes us on a journey of one man's answer and the conviction it delivered.The direction is perfect, and you can really see how that compliments the acting.  Haggis, Banks and Crowe are a fantastic pairing.I'm a little upset this fared so poorly with critics, because it means we may not see more of this magic."
    },
    {
      "rating": "6",
      "text": "The movie was good, especially in the last thirty minutes, where I was at the edge of my seat. However, it seems a bit long and lacks the necessary constant suspense throughout the entire first half. Paul Haggis did a great job with the story though, with unexpected twists & turns, and a nice emotional scene with Brian Dennehy. Plus, he also tied up the loose ends by the end of the film, which left me satisfied. But I didn't leave the theater wanting to watch it again and again."
    },
    {
      "rating": "5",
      "text": "This felt like more of a made-for-television movie to me because just about everything about this was mediocre. The acting was fine, the story was far too preposterous but somewhat interesting, and the direction showed absolutely no flair. There simply isn't anything special about this."
    },
    {
      "rating": "4",
      "text": "Russell Crowe and Elizabeth Banks are a happy and devoted couple, until she's jailed for murder. When it's clear that she'll never be able to prove her innocence, he determines to break her out. Most of the movie is spent with his deliberate planning and setbacks, which is involving, but not particularly exciting. The escape ramps up the rate and generates some mild tension. Ultimately, it's a competent, but unmemorable film."
    },
    {
      "rating": "3",
      "text": "It's all about plans and logistics.  If you love details and preparation methodology laced with tension and a dash of whodunnit, then this movie is for you.  I imagine a limited audience section who would raise their hands to say they would rather see the event planning rather than the event itself.  Unlike most prison break films, this movie shows the reality and consequences of following through on the prison escape fantasy.  Bravo on that.  The act of actually breaking a human being out of jail is not guns blazing, good aim, and luck with traffic patterns.  It must require step by step coordintion, study, and run throughs.  Unfortunately, filming those actions to make them engaging for an audience is not easy and is not accomplished here.  I was very surprised to see at the end that this was written and directed by Paul Haggis (Crash).  But it does explain why a film as uninteresting as this has such a superior cast.  Too bad the material they are working with does not match their abilities.  Liam Neeson shows up for one scene and comes away as the most interesting character in the movie.  While sitting through all of this planning, routine, and even more planning, I noticed a very good soundtrack.  He uses a bunch of Moby songs throughout which is good and one of them is called \"Mistake\".  Is this the director attempting to foreshadow for the musically astute?  I also noticed that the Pittsburgh police department is oddly efficient and display outstanding time management.  Their hunches and ability to acquire mismatched clues are without peer.  Russell Crowe would have done much better against the bumbling Baltimore police department featured in The Wire.  Also, Elizabeth Banks looks goregeous for a woman who spends a significant amount of time behind bars.  I could not recommend this film to anyone I know; no one would thank me for that.  For prison escape fans, go rent the first season of the series Prison Break instead."
    },
    {
      "rating": "3",
      "text": "I'd looked forward to this one, but it turned out to be profoundly disappointing: That was a wrong, wrong role for Russell Crowe, for starters,  and the film was half again as long as it should have been. As for Liam Neeson and Brian Dennehy, advertised as featured: a total of perhaps five on-screen minutes for the two of them combined. Okay, maybe seven."
    },
    {
      "rating": "10",
      "text": "I was pleasantly surprised by this film (and that doesn't happen often).  There was less action than I was expecting, and while it started slow, about halfway through I was leaning forward in suspense.  I had watched \"The Town\" recently (which I also liked), and compare this movie favorably to that film.  The action was low-key, the drama was taut, and I was drawn in and started caring about the characters.  I was actually a bit sad that the film ended without giving me a bit of an epilogue."
    },
    {
      "rating": "3",
      "text": "Russell Crowe can be good in the right movie.  This is not the right movie.  Forget that Mr. Crowe and Elizabeth Banks have exactly zero chemistry together.  Forget that the movie never explains what the mountain of evidence against her is (so we have no idea how he really feels).  Forget that their child is an undeveloped afterthought/appendage.  Forget that the main premise of the movie is completely unrealistic.  What's left?  This is maybe the worst movie Paul Haggis has directed (you can't count the terrible \"Terminator Salvation\", as he was only one of many writers on that POS; and  \"In the Valley of Elah\" which was not good, was not this bad).  Russell Crowe has been a very good actor is some great films (The Insider, Gladiator, A Beautiful Mind, Cinderella Man and 3:10 to Yuma).  But this is not one of them.  It is terribly ironic how a good actor and director can team up for this mess.  Bummer.  I hoped for better."
    },
    {
      "rating": "6",
      "text": "The suspense is strong in most parts and under the directions of Haggis the film is entertaining.  It could have been a really powerful thriller if there was an actor that can act in the lead role (and not just a catchy name) and a plot that was more believable."
    },
    {
      "rating": "3",
      "text": "This movie started out exactly like I wanted it to. It was interesting, suspenseful, and intriguing. But then all of a sudden it just stops. It's as though they had a beginning and and end but the middle was made up as they went along.  I literally thought the movie was coming to and end when I looked at the running time and I was only an hour and 19 minutes into it! I had over an hour left! Some things happened in the movie that will make you dislike the two main characters and wonder why some of the talent that was in this movie even agreed to do it in the first place. And I'm not talking about Russel Crowe.One thing I thought was very odd was the way the guards at the prison acted around the visitors. The visitors were treated as though they were criminals also and were always \"glaring\" at Russell Crowe's character even before he started acting odd when he came to visit. It's a small little nitpick but it just gives you a sense of how the rest of the movie was directed.If you're looking for a suspenseful, exciting movie don't let the trailer fool you, this movie will make you angry you even spent the dollar at \"Redbox\""
    },
    {
      "rating": "10",
      "text": "Great movie, I used to think Rolling Stone magazine was for old people, now I definitely think that.I think the movie is really good cause among it, you do nothing but crapping yourself.."
    },
    {
      "rating": "9",
      "text": "Great movie.  Haggis does a wonderful job at intertwining the intricate plot.  Lots going on...I'm sure it wasn't easy.  Also, if you have any history with the city of Pittsburgh, this movie is a must see.  The views of the city and southwestern PA are beautiful."
    },
    {
      "rating": "10",
      "text": "I had no expectations upon watching this movie, so it could've gone either way for me. But I was pleasantly surprised with the level of emotion, thoughtfulness, and suspense throughout the film. Some elements of the plot are less than believable, but I was willing to buy into them because my affection for the characters made me want to. If I had been expecting an action-driven heist movie, then I might have been disappointed. What I found instead was a complex and thrilling romance, and I liked it."
    },
    {
      "rating": "10",
      "text": "This was an Excellent Movie that should be much higher than it actually is rated. The acting, story, plot, everything was great! The whole everything was very well done and made lots of sense and was good. WATCH THIS MOVIE"
    },
    {
      "rating": "7",
      "text": "A+ for eerie darkness.A+ for the cast.B for the plot.D for diabolical shiveries.So what do you do in the face of danger?  What do you do when your options are low and good enough isn't good enough?  Possible answers exist in this movie about a family whose life takes a turn for the worst when the mother gets charged for murder.  I'm loving the level of darkness and suspense.  Really makes you question life, the good and bad things that happen to you, and how you handle it.  The movie left me feeling mostly satisfied.  Though, still.. felt a little empty.  Like still dealing with the aftermath of how to really take in what I just witnessed.  All-in-all, it is rare for me to not be able to guess the ending, so that's a plus for the movie makers.  I wouldn't mind seeing an alternate ending.  And I would love to see a sequel.  Gain closure and more positivity.  I love the cast.  I cannot think of a single Russell Crowe movie that I do not like, except for maybe Beautiful Mind.  Elizabeth Banks - not her typical role, she did a great job though.  She's one of my favorite actresses.  I also enjoyed seeing Liam Neeson & Olivia Wilde and that d00d Michael from Jericho, and the guy from Ultimate Gift.This movie reminds me of the McStay family (they went missing in California a year or 2 ago).  And all the other people who have to go through tough situations such as this in real life.  I pray that they can all receive the justice they deserve.Now go see a comedy after you watch this movie.  You'll need it."
    },
    {
      "rating": "5",
      "text": "Did she do it? Did Laura Brennan(Elizabeth Banks), wife and mother, bludgeon her boss to death with a fire extinguisher? This woman's innocence or guilt is the meat of \"The Next Three Days\", a thriller that's so preoccupied with her husband's walk on the unseemly side of life, Laura's innocence or guilt becomes beside the point, when compared to showing at what lengths an erudite husband, a college English professor, would go to prove his love. Since Russell Crowe cuts a rather physically imposing figure, the filmmaker doesn't have at his disposal, the option of exploiting the absurdity inherent in an intellectual being forced to remake himself as an action hero. One day, John Brennan is teaching \"Don Quixote\" to a roomful of eager freshman, and before you know it, he's burning down a crystal meth lab and shooting men in cold blood. Although this isn't the first time Crowe finds himself playing an egghead(he was, of course, John Forbes Nash in \"A Beautiful Mind\"), the Aussie actor's thick-set body, angry scowl, and reputation as a brawler(all three factors even more pronounced than it was back in 2001), would make him ill-suited to play the game theory genius had the Ron Howard film been shot today, let alone, a professor at a community college. Crowe is badly miscast; he's neither vulnerable enough(like a Billy Bob Thornton), nor downright prissy enough(like a Patrick Wilson) to walk into a gun store, and ask for a clerk's assistance in locating the spot where the bullets go. The first chance John gets to discharge his firearm(the shakedown of the aforementioned ice house), he looks competent, like a seasoned cop, or criminal. He's a good shot. Not for one second does the moviegoer fear for his safety. Aaron Eckhart(who played an English professor in Neal LaBute's \"Possession\") would remember to look scared. Worst of all, the academic mindset to ask questions is what's missing from this husky brainiac. Rather than bust Laura out of jail, why doesn't John harness all that brain power toward proving his wife's innocence? Because of the professor's reluctance to inquire about the day in question, he never learns about the button that Laura lost after she collided with the real murderer? Most educators, at the very least, would return to the scene of the crime and attempt to reconstruct the sequence of events leading up to the murder, then canvass the immediate vicinity in search of witnesses who might've crossed paths with the sociopathic bag lady. By not doing so, there's the implication that John presumes his wife is guilty, in which plotting her jailbreak becomes, by default, the only option available to this desperate husband. \"The Next Three Days\", however, is as thick-headed as its hero. John never wavers from his belief in Laura's innocence, but the film fails to realize that somebody from the academic arena might have conceivably played amateur sleuth at the outset(since there's some overlap between detective work and scholastic work), and only after failing to turn up any evidence, as a last resort, would an English professor play the vigilante card."
    },
    {
      "rating": "6",
      "text": "this movie was kinda slow in the first half. But in the first half he's planning how to break her out of jail. Some of its really, really, cool but sometimes its really slow. Then it starts to pick up, and it gets really cool sometimes. but do not see it with a group of friends, this is more of a date movie"
    },
    {
      "rating": "5",
      "text": "The Next Three Days offers some thrills and plays out in a very intelligent and interesting way, but towards the end, I think that it tries to over the top in the thrill factor and leaves behind everything that it worked to set up."
    },
    {
      "rating": "9",
      "text": "I understand others opinions but I feel I look past all the negative. I really liked this film. It was unbelievebly gripping, every scene had me rooting for Brennan. The story was good. I liked the characters. Each little scene and detail had a meaning some small some big. But this film brought so much more than action to the table. It showed Desire, Despiration and Love aswell. I thorougly enjoyed this film. Highly reccomend. Worth the Watch"
    },
    {
      "rating": "6",
      "text": "Enjoyable. Suspenseful. Fun. Suspenseful. Long, for sure. But they cram a lot into it. There is a considerable amount of plot plowed into this 2 hr movie. Not too complicated, but the film has you guessing what Russell Crowe's thought of next. I had to pee the whole time, which usually makes me hate the ending of movies, but for this one the action and suspense were enough to keep me wishing for more."
    },
    {
      "rating": "8",
      "text": "This movie was both exciting and kept me interested throughout.  I was constantly trying to solve the puzzles presented and they were all explained before the credits rolled.  Russell Crowe was very believable and everything made sense.  I found this very enjoyable."
    },
    {
      "rating": "3",
      "text": "I watched  Charlie Rose interview Russell Crowe and discuss the movie.  Mr. Crowe maintained that his attraction to this script was as a love story, as opposed to a thriller.   My impression was just the opposite.  It's strictly a thriller and not a very good one at that.   Implausible to the point of exasperation.   Eminently  forgettable."
    },
    {
      "rating": "7",
      "text": "fairly well told prison break movie. it does a great job at surprising you with many plot twists. you never really sure what the jailbreak plan is or if it will succeed. the characters and acting is fairly believable as well."
    },
    {
      "rating": "8",
      "text": "The Next Three Days is a very enjoyable thriller. It features good performances and a crack-a-jack climax. It'll never win any awards or anything but The Next Three Days is superior entertainment."
    },
    {
      "rating": "10",
      "text": "A highly underrated movie; it's been a long time since I cared so much about characters in a movie. To be sure, it's not your standard run-and-gun popcorn flick. This one takes just a little bit of work to get invested, but once you manage to stick yourself in the main character's shoes it's absolutely worth it."
    },
    {
      "rating": "9",
      "text": "9 only because of reality factor. in my opinion its more fantasy movie, but ok, maybe it could be achieved in real life, but with **** load of luck. so...anyhow, great tension movie, excellent story and fine acting..."
    },
    {
      "rating": "6",
      "text": "Besides a great little cameo of liam neeson the movie was a very average Hollywood thriller which lacked a well written script and really wasnt very convincing. If your not looking for depth, this movie is for you. It'll get your heart going. otherwise don't watch it."
    },
    {
      "rating": "7",
      "text": "Lara Brennan (Banks) is convicted of murdering her boss after an altercation at work. Following the failure of her appeal, Lara's husband John Brennan (Crowe), a professor at a community college, becomes obsessed with the idea of breaking her out of jail. I went into watching the movie not know a whole lot about the movie except that I tend to like most thrillers.  This one is kind of long  2 hrs 20 minutes. Its slightly slow for a thriller till the last half hour. Really I thought the entire movie beautifully filmed and constructed except for the slowness.  Of course the plot is not very plausible but what they heck do you expect from a thriller  --there has to be some suspension of belief on the part of the viewer. Haggis is remaking a 2008 French film titled \"Anything for Her,\"   I did not see it  (not out here on DVD yet) .  I think the film is much better than the 50 % assigned to it on Rotten Tomatoes. I read a lot thrillers in book format and this is a completely acceptable thriller on film--but still a TAD slow.  This film did not stay in the theaters long but it did gross $51 mil world wide and then straight to DVD. If you like mystery thriller genre  watch it."
    },
    {
      "rating": "10",
      "text": "Wow! Seamless, totally believable, thrilling, and just beautiful.  Really enjoyed this film and would recommend it to most everyone.  Wish we had more films like it.  I am SO delighted I saw it on the big screen.Moving performances by all three: Russell Crowe, Elizabeth Banks, and Brian Dennehy (who really was a standout).  I was just SURE Dennehy would get an Academy Award nomination for Best Supporting Actor for his performance.  Several critics mentioned it.  I hate it that the Academy only seems to nominate films based on true stories or animated films.  Very little else seems to get any attention from them.  And this was an incredible film.  Great character development, all-but-perfect film edits and direction, and a moving story.  Bravo!!"
    },
    {
      "rating": "7",
      "text": "How far would you go if your wife was wrongfully accused, charged and serving life in prison for a murder she didnâ"
    },
    {
      "rating": "5",
      "text": "I may have seen this one before. I am not really sure. Bits and pieces seemed familiar, but that could just be because the film is so generic. The Next Three Days is thrilling and entertaining, but far too outlandish and typical to be anything but average. This is quite distressing, given that it was directed by Paul Haggis and starred Russell Crowe and Elisabeth Banks. With two good leads and a talented director, it is correct to hope for a better than average and generic film. It can certainly entertain and it is fun to watch the film unfold, so it delivers that entertainment value for sure, but it never aspires to be more than a run-of-the-mill thriller. Even worse, it is shot like an episode of some bad cop show. The Next Three Days may or may not have been a movie I had seen before today. I cannot really remember. Sadly, however, it is so generic that this feeling of deja vu may simply be due to that."
    },
    {
      "rating": "7",
      "text": "If your just looking for an action fast paced movie. This will not b.e a good movie for you. I think this movie was good in it`s own way. Kind of slow at first but I liked the ending and story."
    },
    {
      "rating": "7",
      "text": "No matter how many times you roll your eyes and shout \"There's no way!\" at your television screen, you still end up appreciating Paul Haggis' earnest \"The Next Three Days,\" an appropriate nod to classic man-on-the-run films like \"The Fugitive\" and even \"North By Northwest.\""
    },
    {
      "rating": "8",
      "text": "\"The Next Three Days\" is a surprisingly powerful and emotionally gripping thriller. The performances are all fantastic, especially from the two leads, and the chemistry between the characters and the raw heart put into their moments together gives the gradually-building suspense and action a hefty emotional tension. It's a completely engrossing movie beginning to end, and I thoroughly enjoyed watching every minute of it. Great, great entertainment."
    },
    {
      "rating": "7",
      "text": "It's a stylish thriller of a man's wife who is accused of murder. The beginning of the movie was exciting to watch. Even though it was early into the movie, it really kept you on the edge of your seat. But once the wife does get thrown in jail, the middle part of the movie tends to stretch and get a little boring. Yet once you start getting closer to the big finale of the movie, that's when you know it starts to boost up the story and starts becoming more and more intense in storytelling. But by the finale of the movie just becomes better than expected. As far as acting goes, it's Russell Crowe (John) who steals the show with his great performance (like usual). It was also nice to see Elizabeth Banks (Lara) take on this type of role. She's usually known for being in other comedies with Paul Rudd. But taking the role of a convicted mother was utterly winning to watch. The reason I give it a 7 is mostly because of the slowness of pace during the middle part of the movie. But overall, it's an interesting and stylish thriller."
    },
    {
      "rating": "8",
      "text": "A very good suspenseful, thrilling drama with good performances by the two leads, The Next Three Days is engrossing as well as being a worthy edition to the genre."
    },
    {
      "rating": "8",
      "text": "The Next Three Days is spectacularly underrated - not only does it boast one of Crowe's best performances, but emotionally envelopes you to the point where you feel the characters pain."
    },
    {
      "rating": "6",
      "text": "Surprised elizabeth banks didn't do a sexual bed crawl up to her song in bed...seeing how everything women do moves the camera all over the place...also i'm surprised she didn't want to kill herself anymore....this movie makes me like the director, canada and russel crowe all the more......great choices of moby songs in there........i like the lawyer and how he was from home alone.......i like the taking of the picture for the end.....watching this a second time would be awful......the beginning diner scene doesn't really set up the movie ....i feel like i just wanted them to go camping.....what the hell was the \"you call this coffee\" scene about.......not that i mind because it might make someone out there hate women a little more for once......"
    },
    {
      "rating": "7",
      "text": "Russell Crowe's wife, Elizabeth Banks, gets arrested for a murder she claims not to have committed. After the appeals fail, Russell decides that he's going to break her out himself.\r What follows is a well-paced, taught and tight thriller. One of those old school thrillers that wasn't basically just an action film (although there is a decent amount).\r Both the leads do a great job and the film stays interesting and/or exciting the whole way through. The soundtrack is great, particularly the songs by Moby.\r If I had to pick faults then I think the ending wraps things up too cleanly and the did-she-didn't-she-do-it is under-used in the plot. Also, The Next Three Days themselves cause a minor scheduling bump, and don't really seem significant enough to become titular.\r I would say that this film is a perfect evening thriller, so get the popcorn out and enjoy."
    },
    {
      "rating": "9",
      "text": "Wow, such a good movie. I didn’t expect this one to be good going in. It’s beautifully acted and extremely suspenseful. I want to give it a 10 but I’m not sure if I feel this way because of my low expectations going in."
    },
    {
      "rating": "8",
      "text": "The Metacritic score of 52 is ridiculously low. This film deserves way better."
    }
  ],
  "recommendations": [
    "the_call",
    "man_on_a_ledge",
    "the_little_things",
    "the_accountant",
    "a_walk_among_the_tombstones",
    "prisoners",
    "split",
    "good_time",
    "breach",
    "the_commuter",
    "unstoppable",
    "gone_baby_gone",
    "gone_girl",
    "widows",
    "taken",
    "snitch",
    "man_on_fire",
    "no_escape",
    "the_usual_suspects",
    "uncut_gems",
    "10_cloverfield_lane",
    "the_loft",
    "the_equalizer_2",
    "the_guardian",
    "cold_pursuit"
  ]
}