{
  "id": 3132,
  "title": "The Good Doctor",
  "starring": [
    "Orlando Bloom",
    "Riley Keough"
  ],
  "runtime": 93,
  "genre": [
    "Drama",
    "Thriller",
    "Mystery"
  ],
  "description": "Dr. Martin Blake, who has spent his life looking for respect, meets an 18-year-old patient named Diane, suffering from a kidney infection, and gets a much-needed boost of self-esteem. However, when her health starts improving, Martin fears losing her, so he begins tampering with her treatment, keeping Diane sick and in the hospital right next to him.",
  "releaseYear": "2011",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fJSdqHzpMeCkXMrILYt1SdGN2sL.jpg",
  "categories": {
    "plot": 2.6666666666666665,
    "acting": 5.2,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Every now and then comes along a movie that is just so annoying that you wish you could jump into the screen and sort out one or more of the characters.. this is on of those. The acting is of course good, but the story line leaves a lot to be desired. The way the film randomly goes in one direction to another with various characters coming and going, it feels like the writers had too many ideas, couldn't figure out which way to go with the film and/or a way to bring it all together to finish it. So they resorted to abruptly cutting it short(?), leaving the viewer to ponder the fate of the 'good doctor. We're left with an unresolved mess of a movie. Annoying to say the least."
    },
    {
      "rating": "6",
      "text": "The first half is an 8 the second half is a 5.  I just didn't fully believe that this straight laced doctor would go to such lengths just to see his patient.  Overall I would slightly recommend this film."
    },
    {
      "rating": "9",
      "text": "If you could ever point to a movie that really shows that an actor is actually good, it is the Good Doctor and that actor is Orlando Bloom. Bloom gets sh*t on a lot by critics and audiences for not being \"good.\" I personally have no issue with him and he is great in this role as \"The Good Doctor.\" The movie itself is a great low-key thriller that not everybody will like, but I thought was excellent."
    },
    {
      "rating": "7",
      "text": "Clicked on \"write a review\" by accident; I hope this score doesn't affect the overall score much"
    },
    {
      "rating": "4",
      "text": "This show was awesome, but season 2 is so boring. There is too much drama and not enough medical puzzles. His mentor is about as interesting as watching paint dry. His weird girlfriend from Hersey was not vested enough for anybody to really care. If this show continues like this, I will stop watching the show. Such a shame because last season it was my favorite show on television. Bring back the medical puzzles please."
    },
    {
      "rating": "10",
      "text": "very nice hgdfjhxgkkjghuygjjggggggffhjuggggjkouhggukkhfgujvvggghjjjjjjjjjjfffgjbguhbhhgfgghgghjhghyjuhgtujjuhg"
    },
    {
      "rating": "1",
      "text": "Wow its good and i have nothing to say but to watch this all night. Yeah thats it"
    }
  ]
}