{
  "id": 4858,
  "title": "The Gunman",
  "starring": [
    "Sean Penn",
    "Jasmine Trinca"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Drama",
    "Crime"
  ],
  "description": "Eight years after fleeing the Congo following his assassination of that country's minister of mining, former assassin Jim Terrier is back, suffering from PTSD and digging wells to atone for his violent past. After an attempt is made on his life, Terrier flies to London to find out who wants him dead -- and why. Terrier's search leads him to a reunion with Annie, a woman he once loved, who is now married to an oily businessman with dealings in Africa.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lnUozDnDANTsDYEdsNsHC6b8IiS.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 4.633333333333334,
    "ending": 4.111111111111111,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.678571428571429
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Good production on the vistas and action sequences, but lackluster story and imprecise use of the veteran actors hamper the movie. With credible cast touring different memorable cities, the film is visually engaging for most of the time. It also delivers a couple of devastating action choreography of Bourne level. However, it trudges through bland story of stereotypical espionage and uninteresting romance. While the collective acting prowess is barely able to keep the film interesting, these experienced actors surprisingly don't perform consistently enough to fully maximize their potential.\r Story follows Terrier (Sean Penn), a secret operative who fled an African country after an assassination. Years later this come back to haunt as someone cleans up everyone who are involved of said assassination. Strangely, the thriller invests majority of the content for romance subplot between Terrier and Annie (Jasmine Trinca), the ex-lover who might still harbor feelings. These two don't have a lot of chemistry. Their characters are plain and one-dimensional, a rugged volatile man and his static wooden love interest.\r It also creates needless love triangle plot that offers nothing but awkwardness, audience will know what to expect and still cringe at the execution. Credit to Javier Bardem as Felix, the love adversary of Terrier. He delivers the best performance with his enigmatic yet not-so-charismatic role. His character here might not be supremely likeable nor does he have lengthy appearance, but he's fascinating in every scene he graces. Idris Elba is always engaging, but he only makes brief appearance, even shorter than Bardem.\r The bulk of the film rests on Sean Penn, who is undeniably a good actor and looking physically fit for this role, although he doesn't seem to be comfortable here. This kind of ex-special force gimmick isn't his forte and the way he interacts with Trinca's Annie is rigid. These two just don't mesh together, despite numerous erotic scenes. Penn is looking anguished or tormented while Trinca is all sad and confused all the time. It's just odd, and to make matter worse, their relationship is supposed to be the heart of the film.\r Penn does better with the action. The movie has cool cinematography and choreography. It spans throughout many cities, which are portrayed with decent amount of flamboyant touches for their signature looks. Set pieces transition well, the film moves nicely when it's not encumbered by the banter. Action is produced with significant effort, they are fast and precise, exceptionally thrilling when strikes or bullets landed.\r Unfortunately, the film also overreaches with political undertone. Its message might be more welcomed if it could at least make the audience relate to the core characters. The Gunman offers shooting spree across exotic places aplenty, but with such caliber cast, it could've been more than just an average spy thriller."
    },
    {
      "rating": "4",
      "text": "Sean Penn is on the run after the guys who hired him to assassinate a major figure are out to eliminate him. His plight takes him down too many talky pathways and dull romantic moments. Since it's directed by Pierre Morel (who did the original \"Taken\"), the fight scenes are flashy and violent. There just aren't enough of them. Penn's very fit body (which is shown off plenty) belies his craggy, rough face, which is locked in an intense scowl. A forgettable film."
    },
    {
      "rating": "1",
      "text": "So Sean Penn went to the gym. After a rather nice workout, he took a good look at himself and thought: \"Gee, I'm a ripped, nice and hot mofo! This deserves a treat!\"\r The treat takes the shape of a film that makes \"The November Man\" look good and entertaining. Based on a plot written in a tweet, this movies throws at you everything you already saw before: locations, cars, product placement, twists and turns, filming style...\r First, the writing makes every character so flat and undeveloped that you simply cannot, despite your best efforts, care for anything happening to them. I guess the unlikeability of Penn's character must have struck the writer who afflicted him with a random, improbably and conveniently easily diagnosed health issue that he will use any chance he gets to try and make you care for our gunman.\r Second, the directing doesn't manage to make us forget the very poor writing. Action scenes are scarce and dialogues are boring. The first hour makes it directly to my top ten of longest hours ever. The ending does not make sense one second (Penn is told he will do time in jail after revealing the assassination that triggered the whole story, but miraculously and conveniently finds himself joining his lover (and what a miserable love story) thanks to a timely escape-ex-machina).\r With a team so obviously lazy and not even trying to take their jobs seriously, the marketing people had to grab anything they could to sell us this piece of boredom. Hence the bankable Idris Alba who has his name high up on the poster and credits and appears after 70 minutes of film for a screen time not exceeding 5 minutes in a role that is so thin it would insult a C-list actor.\r How Bardem or Winston accepted the role they got is a mystery grabbing my attention way more than the actual plot.\r So Sean Penn went to the gym, got to expose copiously his ripped upper body and added a fancy producing credit to his name. That's everything positive in The Gunman."
    },
    {
      "rating": "3",
      "text": "Generally interesting concept but poorly done, averagely acted and badly developed plot. Sean Penn is not a convincing muscle tough guy and apparently he only ages by shaving his beard thing... only to be watched if the only other option is being stuck in a lift with a big man suffering terminal flatulence."
    },
    {
      "rating": "3",
      "text": "Sean Penn character is literally not sympathetic enough to make you wanna root for him. Aside from a not so strong script, there's not much in the movie that can save it from disaster."
    },
    {
      "rating": "2",
      "text": "Awful movie.  Sean Penn as love interest to a lovely young lady made me cringe.  He looked like an old fart on steroids, lots of them.  I had to fast forward through love scenes, couldn't stomach them. Story was so ridiculous when he got spells from illness yet took out bad guys like there's no tomorrow.  Snooze between dumpsters and good to go.  Would have played slightly, and I emphasize slightly, more believable if they hadn't thrown in the brain damage.  Ray Winstone and Idris Elba were good;  both should have had a lot more screen time.  Javier Bardem overacted when he was \"drunk and was otherwise still quite bland.   Story very predictable in a lot of parts, clues as to what was coming were really in your face.  Yeesh, what an absolute waste of time."
    },
    {
      "rating": "1",
      "text": "Really terrible, annoying, waste of my time. The plot is so farfetched why would anyone want to assassinate an african cabinet minister everybody knows they have no power at all and eliminating a minister doesn't change anything it's the president who has the final say. I have never been this irritated by a movie from start to finish and the only reason i endured it was i needed to see how much worse it could get. The love storyline is senseless, unnecessary and manipulated to pump up Penn's ego."
    },
    {
      "rating": "4",
      "text": "It's pretty watchable, but it's just so darned generic.  Seems almost entirely purposed as a vehicle for Sean Penn to show off his guns (and pecs).  He's really the best part of the movie, but the entire enterprise is so \"Euro\"... no really pop to any of it.  And the typical cat-and-mouse chase crap at the end is SO routine."
    },
    {
      "rating": "6",
      "text": "It's unfair to say \"The Gunman\" is a bad film. After all, it's expertly shot, scored and edited. The actors authentically portray their characters and Sean Penn, expectedly, is exceptional as Jim Terrier. The plot is credible once we accept that, like most movies, it's a work of fiction. Yet \"The Gunman\" still fails on a thematic level. It's major problem is that it lacks focus. It attempts to provide a character study within the context of a political thriller through the convention of an action film.\r A brief summary is necessary: Jim Terrier works for a private security company that is part of a conspiracy network to assassinate unfriendly political officials in developing countries. So, the company orders Terrier to murder a political official, which he does, and he then flees the country. Several years later Terrier feels remorseful and then tries to redeem himself through honorable non-profit work. Yet, his life is then threatened and he uses his special operations skills to identify and shatter the conspiracy network that is behind it.\r In the process, he confronts a jealous friend and a former girlfriend that still loves him but feels betrayed by his earlier abandonment. Simultaneously, American congressmen and INTERPOL investigate the now esteemed private security company over its alleged past misdeeds. Because by representing the financial interests of its clients, it instigated and compounded the problems that plagued the developing country, in this case the DRC, insofar as resource exploitation, government corruption and civil war are concerned. It's implied that developing countries continue to be exploited by financial interests that rely on private military contractors to resolve their political problems.\r I commend \"The Gunman\" for its ambitions and for presenting a restrained yet suspenseful action thriller. But because it attempts to tackle all of the themes above, it fails in successfully addressing any of them. So, the viewer leaves the theatre apathetic and confused. He asks, what exactly is the point of this movie? And unfortunately, one can't use the excuse that ambiguity is its point and justify it on the principle that its dealing with complex matters.\r In \"The Gunman\", Sean Penn, as lead actor, co-writer and producer, attempted to use the action genre to create a more serious and meaningful film. And yes, it's more interesting, credible and substantive than \"The Equalizer\" or \"John Wick.\" But unfortunately, his attempt failed and the film, if anything, is disappointing."
    },
    {
      "rating": "1",
      "text": "How many times can this same plot be done?  Poorly written, poorly directed badly acted. The Gunman is just another shoot stuff up, blow stuff up, make lots of noise and flames boring movie. Ca someone in Hollywood please make something creative already."
    },
    {
      "rating": "3",
      "text": "Remember that time Matthew Fox was in that Roshamon rip-off set in Spain?  Or that time that they remade The Taking of Pelham 1 2 3 for some reason?  No?  That's a shame, because either is more memorable than this late-career paycheck for Sean Penn.  In a loving ode to both Safe House and the Constant Gardner (that's what they did, right?...intentionally combined the most boring parts of these movies to cinematic test of fortitude for the casual observer), Sean Penn gallops around the world kicking all sorts of bad-guy-butt like only a 54-year-old can do these days.  Somebody done him wrong...and they're about to get theirs once he figures it out.\r The positives - the actors are top-notch (and committed to their roles), the scenery is quite lovely, and the film is not (as I suspected about half-way through) 4 hours long.  The negatives - boring, derivative, falsely preachy, and saddled with the worst dialog I have seen since Attack of the Clones.\r On the bright side, Sean Penn is extra bulked up.  Which made me think...if he can look like that at his age, then I definitely can.  I'm hitting the gym tonight and my wife will thank me for it in a year or so.  So thanks for that, Mr. Penn.  Sorry you had to melt your guns for your new lady, since it looks like you must have really missed them after making this movie."
    },
    {
      "rating": "9",
      "text": "I saw the \"The Gunman\" in a cinema chair. For me it was simply one of the best movies I've seen lately. The story and the suspense held me to the chair until the end of the movie. In the background there is much reality that is unknown in the interests of a large multinational and its ability to achieve its goals. Great movie."
    },
    {
      "rating": "7",
      "text": "If you're looking for a simple enough action movie, this is definitely okey. Seeing Sean Penn in this movie, can probably feel odd to some, I basically don't care. You'll have a couple of ridiculous scenes where Penn seems just to want to show off his body, a few short annoying moments. The plot is predictable if you have some intelligence, but I didn't mind that."
    },
    {
      "rating": "7",
      "text": "When an assassin becomes a target!\r It was not bad, but the same old stuff that we'd seen in so many other films. It was actually based on the book and directed by the 'Taken' filmmaker. An international project, takes place in three different countries, but opens and ends in Congo. It centres on an assassin who had successfully executed a high-profile job in Africa. But a few years later, after giving up those kind of work, all the sudden it comes back to haunt him when some unknown men comes looking for him. So he decides to find who's behind it and why.\r Even though it is a familiar theme, very much enjoyable. But the problem is the hero remains unhurt and somebody else dies for him which so cliché. The acting was good, and obviously that is Sean Penn in the lead. The action sequences were okay, but the pace of the film was the reason for me to sit on-board for over 100 minutes.\r So if you are not expecting a good story and the stunts, it will do okay, particularly for the time pass. Yes, it had a chance to become a better film, but I think it wanted to replicate the book which is a couple of decades old and in the meantime pieces from it was used in the different films, hence this one looked so old. The critics did not like it, but it is much better than they say, as well as not good as some people claim.\r 6.5/10"
    },
    {
      "rating": "1",
      "text": "Sean Penn's grumpy, irritated spy in The Gunman, is by far his most pathetic role yet. After all, Director Pierre Morel takes the helm of this \"spy clearing his name\", seen-it-all-before action thriller. With a great cast, including- Idris Elba, Ray Winstone and Javier Bardem, how could it be THIS bad? Turns out, the lazy writing, tiring plot and so-so characters made the film unbearable if it went on for another hour. But there is a heavy amount of bloody, gleeful and slick action to behold, also it's a well shot movie as well. Javier Bardem's nerdy looking villian doesn't hold up the movie until it's rushed final minutes. Overall, The Gunman is a well shot, but tiring film, that really knows how to fire than entertain."
    },
    {
      "rating": "3",
      "text": "Sean Penn has consistently been one of the best actors in Hollywood for the past twenty years but since he won an Oscar in 2008 for Milk he seemed to cutback on the roles he's been playing and many of these roles were supporting characters. The Gunman is Penn's return to a leading role where he seems to be taking a page out of Liam Neeson's book and looking to become an action star now that he has aged. Pierre Morel, the director of the original Taken film, is the director for the Gunman which had me interested but sadly the film just does hold up. The plot is sub-par and confusing in many places. The action isn't bad but its not going to be making any headlines and the characters are forgettable despite a pretty strong cast. The trailers promised a lot in this film that was almost non existent in the film. Idris Elba was one of the top billed characters in the film despite getting about 2 minutes of screen time in the film. The action is also often replaced with boring and cheesy drama and no one wants to see that."
    },
    {
      "rating": "0",
      "text": "no guns in the movie sean pean takes his shrit off and 2nd worst of the year the the hole movie suck sean pean is not a good actor and also every actor in the movie sucks"
    },
    {
      "rating": "8",
      "text": "This was a great \"action\" movie. Compared to modern actions flicks of today, this one far exceeds the norm. Great production quality really ties together the momentum of the story with a solid performance from Sean. Other actors seem to fall flat when placed juxtaposition with Sean. Either they are making him look really good, or they were just terrible. You decide.\r Personally, I will take this any day to the \"Bourne\" series and the lackluster James Bond Flicks of late."
    },
    {
      "rating": "5",
      "text": "I liked the action parts of the movie, felt like a proper action movie, the actual story felt a bit weird and missing something, and maybe a bit even unreallistic I don't know. Also I did not like that it was unbelievably predictable. Also not sure if Sean Penn is the best guy for action movies, but he was decent here in my opinion unlike others say here."
    },
    {
      "rating": "5",
      "text": "Starring Sean (If Liam Neeson is making money doing this crap then I can to) Penn, Javier Bardem and Idris Elbow. Considering a lot of people seemed to hate this film I find that a little harsh. Even with its predictable story and action sequences it actually manages to pull itself together to make a decent only gonna watch it once action flick. Aside being a tad too long it's watchable and enjoyable in the moment, can't really expect much more from these sort of films. Recommended cause there's nothing else out."
    },
    {
      "rating": "5",
      "text": "Sean Penn joins the ever growing group of ageing actors becoming action heroes in this new effort from the director of Taken. It may want to think it is more upmarket and intelligent than its counterparts, dealing as it does with foreign aid in the Congo, but in the end it's just another shoot-em-up. An eclectic cast including Ray Winstone and Mark Rylance try and bring gravitas to the material but in the end they are fighting a losing battle."
    },
    {
      "rating": "7",
      "text": "If you enjoyed Blood Diamond with Leonardo DiCaprio then you will view this as a milder version. The Gunman was better than expected because it delivered good performances and worthy actionable scenes. It flowed well, surprisingly, Sean Penn is a great action character for his age as well as in great shape."
    },
    {
      "rating": "4",
      "text": "In theory, everything was perfect. An action movie directed by Pierre Morel (the brilliant Taken 1 and the awesome From Paris with Love) and starring Sean Penn, Javier Bardem and Idris Elba.\rIn practice, though, this flick is riddled with problems. The plot is cliche (standard \"the agency ties up loose ends and eliminates the agents\"), the dialogues are oversized and boring, the love line is too forced (even though Jasmine Trinca is gorgeous) and what is beyond me, the action scenes aren't nearly as gripping and tense as in Morel's previous works. The lead actor Sean Penn presents yet another annoyance: he did work out a lot and got quite ripped for this role and, apparently, he is very pleased with himself, as we get to see his naked torso or at least, his flexed biceps approximately every 5 minutes, when he surfs/takes a shower/changes clothes/has sex/etc. This movie's yet another sin is that it wastes all the supporting talent in favour of Sean Penn's body - Bardem's role just doesn't leave him space to act the way he can and Elba's screentime is just criminally short.\rTo sum up, it is watchable, but Morel has dropped the bar significantly, and that's rather disappointing."
    },
    {
      "rating": "2",
      "text": "Almost lost for words but not quite. I heard this movie was trash and thought I'd like to see for myself.The Gunman gets literally EVERYTHING wrong.A garbage story with a try-hard spin wanting to be meaningful and relevant but fell short on both fronts.Penn, ever the Social Justice Warrior, playing against his type as an action hero is just not believable in the role of an assassin. Its a role which have been just as easily portrayed by Dolph Lundgren or even Stephen Segal (circa 1993) or even a straight to DVD Statham vehicle. Bardem is suitably creepy, but brings nothing new or unique to the role, he's just doing Skyfall crossed with The Counselor.Elba, will be grateful his immense talent was not besmirched by more screentime in this horrible film.Overall a completely flawed movie which is utterly forgettable and really shouldn't exist.2 out of 10 for Bardem's sleezyness, Elba's luck for having a small role, and Penn for getting as shredded as he was for his age."
    },
    {
      "rating": "4",
      "text": "An action movie made purely for the brightness of its star who is trying to give his career a new air in a genre that personally does not go for him.Not a total waste, but nothing remarkable either."
    }
  ]
}