{"id": 4586, "title": "The Power of the Dog", "starring": ["Benedict Cumberbatch", "Kirsten Dunst"], "runtime": 128, "genre": ["Western"], "description": "A domineering but charismatic rancher wages a war of intimidation on his brother's new wife and her teen son, until long-hidden secrets come to light.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kEy48iCzGnp0ao1cZbNeWR6yIhC.jpg", "categories": {"plot": 3.1904761904761907, "acting": 3.588235294117647, "ending": 5.071428571428571, "soundtrack": 4.0, "cinematography": 2.4444444444444446, "familyFriendly": 3.0, "funny": 2.0, "action": 0.0}, "reviews": [{"rating": "5", "text": "I wanted to really like this film. I found it boring and without much plot. On a plus note, the acting and scenery were great."}, {"rating": "5", "text": "well this movie isnt really good... yes the actors are very talented and its a very beautiful movie ....but i have seen much better movies"}, {"rating": "0", "text": "i hated this movie!... i was waiting for it to get interesting considering the reviews...it's slow, couldn't connect w/ the characters, didnt give a damn abt Cumberbunch's homosexuality... the acting was \"meh\" at best... sigh... it will win the Academy Award for Everything!... movie, director, writing, acting, location, on and on... i guess im not sophisticated enough... i give it a -0... if u want to c a great film abt the west watch \"First Cow\"... absolutely the best!"}, {"rating": "0", "text": "I'm with Sam Elliott--what a POS! Like so many, this film just drug along, and I kept waiting for it to get better, but, well....that's 2+ hours of my life I'll never get back."}, {"rating": "5", "text": "Easily the most overrated film of the year, and I do consider myself a Campion fan. Loved the Piano and other works, but this film is a predictable tired display of modern PC culture to which professional critics feel obliged to herald, because of it's fleeting importance of subject matter. This film has been made many times within the last few years. It's extremely cookie-cutter and a low point for Campion. As one can see the user reviews are way lower than the obligatory handouts pro-critics have been giving it. That is not a mistake by viewers, and you're not missing anything that these pro critics are seeing.  I also cannot take Cummerbatch as a cowboy.  It just doesn't work for him. A shame too, as Plemons and Dunst truly shined bright. The only two beams of light to be emitted from this bland attempt at Campion staying relevant.  Bummer for sure. And painfully snoozy.  Throw some award noms at Plemons and Dunst, and just walk away, as those two performances are the most redeemable portions of this film."}, {"rating": "5", "text": "I watched a DVD screener so I was bombarded during the opening credits by \"New Zealand Film Commission.\" plugs.  It was almost like a tourism showreel.  We get it, it's not Montana (where the film is set), it's Lord of the Rings again but couldn't you at least wait until the closing credits before breaking the fourth wall?  I found the movie incredibly gloomy for these covid times.  The acting was great, especially Kirsten Dunst, Benedict was perhaps miscast, the music was grating, overdone, and the cinematography was great.  Take away the soundtrack and there seemed to be very little \"there\" there."}, {"rating": "5", "text": "Really intelligent plot. Distorts expectations by a mile, playing on obvious tropes, only in the end to turn it all on its head. Movie of the year!"}, {"rating": "0", "text": "This movie tells you its more important than it is, and the critics believed it.Absolutely nothing happens, just grunting and nodding while the score makes you believe something epic is moments away. Spoiler: It isn't."}, {"rating": "2", "text": "Tries to be subtle but ends up boring and confusing. The entire plot is just hints and subtext, with hardly any dialogue. Music and cinematography make it seem like something tense is brewing, but no plot developments happen until the last 10 minutes. The only female character (though well acted by Dunst) is so undeveloped she is just a wilting flower - we're led to believe she is so weak that her brother in law playing mandolin a bit loudly and not coming to her dinner party was enough to torment her into alcoholism, despite the fact she apparently already survived one husband's suicide and ran her own business just fine. We are given no insight into the inner worlds of any characters and are instead left guessing at the meaning of it all."}, {"rating": "0", "text": "Very very slow and boring.  I kept thinking something was going to happen to make the movie interesting but it didn’t.  Now I’m disappointed two hours later."}, {"rating": "2", "text": "Power of the dog was not Oscar worthy. First of all, its filmed in New Zealand that is very clear, the two brothers are still sleeping in their childhood room, but their mother and father have moved out of the house (why) never explained. The movie moves from the marriage, to being a drunk to her son in medical school in 10 minutes. Phil went to Yale really since he was having an affair with Brono Bill when did he have time to do this? And how did her son know that he would find a cow dead from Anthrax lucky find. There were HUGE holes in the story line, and I could not figure out why this movie would get any nods.  If you want to watch a great western in the early 1900's watch Legend of the Falls so much better."}, {"rating": "0", "text": "I found it to be abusive to animals and stopped watching at 32 minutes when Benedict, the fake vegan, started swatting the horse in the face repeatedly while shouting **** at it. Seeing the fear in that horse's eyes was heartbreaking. I researched the animal abuse, and it is real.  Further along in the movie, I read that Benedict also castrates a bull.  Why is this abuse necessary and tolerated?  I will no longer watch a movie with Benedict Cumberbatch or a movie directed by Jane Campion."}, {"rating": "0", "text": "This movie was really bad from start to finish. I kept waiting for the movie to get better. Don't waste your time."}, {"rating": "3", "text": "This movie is really boring, it tries to generate moments of tension but it doesn't make it, the events doesn't mean anything and the end is anticlimactic as no other"}, {"rating": "6", "text": "I don't really understand the critic love for this movie. The ending seemed so obvious to me; almost ham-fisted in the hints given along the way. It is set at a turtle's pace. There is great cinematography and set design and good acting here, but hardly worth critics falling over themselves to praise it so much."}, {"rating": "0", "text": "Boring is about the best thing that can be said for this movie. It reminded me of the old saying, \"As exciting as watching chrome rust\" or \"watching grass grow.\" The good reviews of this film must have been done by Hollywood elitists who think they know more about what's good than the rest of us. Giving it an Oscar would be a major disservice to moviegoers and the film industry. Much better for everyone to rename the film \"Hair of the Dog\" and just let it go off and be forgotten."}, {"rating": "2", "text": "One of the worst movies I have ever seen… no one acts likes this and it is just bad… you find yourself waiting and waiting for it to get better but it does not it just gets worst…Put it this way, I would rather piss on an electric fence then suffer watching this movie again…"}, {"rating": "1", "text": "This movie seems to be intentionally irritating and the big ending was not that surprising or interesting. It is boring."}, {"rating": "1", "text": "Badly acted, boring, slow, in love with itself.But it’s beautiful to look at."}, {"rating": "0", "text": "Rubbish, worthless junk. Totally boring nothingness. Will be buried and forgotten along with the growing graveyard of Netflix originals in a few weeks. Don't watch."}, {"rating": "6", "text": "Cinematic artistry is indeed inspiring, but, if a film doesn't have a comparably impressive narrative, that celluloid mastery generally all goes for naught. Such is the case with writer-director Jane Campion's latest, a disappointingly underwhelming effort from an ordinarily reliable auteur. The chief problem here is an often-thin, sometimes-obvious, frequently unfocused story (with a script to match), one that's principally an essay on the dangers of toxic masculinity as explored through life on a 1920s Montana cattle ranch. The film seeks to examine this issue through a variety of story threads, most of which are far from fully developed and lack coherent correlation save for the behavior of a somewhat cliched, mostly monodimensional protagonist. To its credit, \"The Power of the Dog\" features gorgeous cinematography, strong character development, a fine period piece production design, a captivating original score, and excellent performances, especially from Benedict Cumberbatch and Kodi Smit-McPhee. Yet, even though these strengths come close in capably covering the material's inherent weaknesses, they're not enough to elevate the film to the level of greatness or to live up to much of the undeserved hype many critics have heaped upon it."}, {"rating": "4", "text": "(Mauro Lanari)Jane Campion gets back to make a film after 12 years: allusive and not suggestive. It is the viewer's task to fill in the gaps in the story, but anyway, while trying to understand the motivations of the protagonists, one realizes that they are not charming enough to be worth it. \"The Power of the Dog\" falls into the traps of that smug aestheticism that has marked a part of the New Zealand director's cinema, so \"it's like 'Brokeback Mountain' but even more boring\"."}, {"rating": "1", "text": "OMG soooo boring. The first two times I tried to watch it I fell asleep. Had to drink a Red Bull on the third attempt just to stay awake. If a movie is just about pretty cinematography we don't need directors. The cinematography is great, and it makes for a good trailer, but there is nothing here. And Benedict Cumberbatch is so miscast. He looks like he only weighs 110lbs soaking wet. Not a very ominous threatening figure at all. The plot drags on like a broken cart being pushed uphill. Jane Campion hasn't directed a good movie since 1993's The Piano. Who keeps hiring her? I have no idea what the Oscars was thinking with all the nominations."}, {"rating": "3", "text": "Power of the yaaaaawn. Nothing happens for a looooooong time. Cumberbatch is totally miscast as a roughneck American. Portentous music telegraphs tension that the film totally lacks. Pass!"}, {"rating": "0", "text": "I had high hopes for this film being that I am somewhat familiar with the director and wanted to see a female take on the western genre. I read the book it’s based on more than twenty years ago but I have to say the film was a disappointment. It all starts with cowboy rancher Phil not taking off his chaps or hat indoors which no self respecting cowboy would do, he wears spurs all day everyday and speaks with a horrible American accent. I could forgive this since Benedict was pretty good but the whole movie is a There Will Be Blood ripoff. From the cinematography to the soundtrack to the shots it seems to be a film students take on the source material who hasn’t found her own  voice. I am appalled at the critical acclaim and the fact that no “professional” critics noticed the similarities with There Will Be Blood. I guess as long as you’re a woman making a gay cowboy movie your lack of originality can be overlooked."}, {"rating": "1", "text": "Look, in short this movie has a queer coded and violent antagonist who is killed by a neurodivergent young adult. Even if you excuse these blatant and outdated tropes, this movies legit sucks. It is not tense, it is boring. The cinematography is ruined by the horrible script and one note acting by Jesse Plemons and Kirsten Dunst (I’m sorry Queen I think you can do better). If you need to rely on queer coded villains in the year 2021 well then you’re just a horrible writer. Get off your Hays code era bs and write some actual drama. This movie was lifeless and dull.  Beyond relying on horrible tropes, this movie just has no inspiration. You want the fall of the Wild West personified? Go play Red Dead Redemption 2. Go read All The Pretty Horses. Go drink half a bottle of Makers and slam your head against a wall. You will gain a greater understanding of the west by doing any of these compared to watching this slow rotting corpse.  Legit 0/10 I will scream about how bad this movie is I cannot believe it is a Metacritic must see."}, {"rating": "4", "text": "im sorry, but i dont understand the critical acclaim of this movie.  it is one of the most boring movies ive ever seen. the actors themselves performed brilliantly, but the story was sleep inducing. i give it a hard pass."}, {"rating": "4", "text": "Despite some impressive visuals the script is just terrible and fractured. At times the score is just confusing and not congruent with scenes."}, {"rating": "4", "text": "I had high expectations going in and was totally disappointed.Nothing happens. I’m all for slow films or those that focus on character development. This felt like such a thin slice of this group’s lives that it wasn’t worth it.It is very pretty to look at, lots of beautiful scenery. You could just Google some landscape shots though"}, {"rating": "1", "text": "Jane Campion is no Christian.  Anyone who knows the first thing about Psalm 22 knows it's a prophecy foretelling Jesus's suffering on the cross. The interpretation in which Cumberbatch is the \"dog\" and Dunst is the \"darling\" is anti-textual nonsense. Also, the movie is boring, passive-aggressive drivel. The whole plot hinges on some nonsense about burning piles of extremely valuable cured animal hides, which no one would ever do.  If you think this is a film about cowboys doing cowboy things, it's not. If you think it's about characters making logical choices based on competing interests, it's not.  If you think it's Jane Campion jumping in a time machine to complain about how awful she thinks our great-grandfathers were, taking whinging pot shots at \"toxic masculinity\" through a post-modern lens but with cowboy hats on, you're right on the money."}, {"rating": "6", "text": "I do not get what the fuss is about. I once heard or read a saying about ambiguity not being profoundness - and this movie is bang-on ambiguous. I can only imagine that it is its ambiguity that's been taken as profoundness.Two brothers - both weird, one's a bully and then stuff happens. All this set in the old west, so the movie is a western - it does not have a reason to be but it is. To its credit, the movie holds your attention and lingers on and on - as if something is going to happen, but nothing especially does and then the movie ends.It definitely has some talent and quality - but for some reason the not-main-actors (i.e. The extras/bit part) were its most interesting bit. The Power of the Dog is a ridiculously unexceptional and unnecessarily abstract movie lacking in anything particularly noteworthy. Again, I do not get what the fuss is about."}, {"rating": "0", "text": "Too bad I chose to watch this mess... satisfaction may have brought the cat back...but in this case..."}, {"rating": "1", "text": "Slow, tedious, boring movie, where the camera lingers on flat earth and the movie lingers on long, long silences between grunts by the actors. As if this weren't bad enough, there is Director Jane Campion's fixation with pianos, ever since she won sone underserved award for her previous film, The Piano. In this film, she has dusty cowboys dragging a grand piano onto the Wyoming deserts for unimaginable reasons. I could only take 45 minutes of this awful film, then turned it off."}, {"rating": "4", "text": "There is tension.  There is suspense.  There is looming doom from start to finish.  But when it's all said and done, there is much to do about nothing.  And I didn't think the performances were all that great, either.  I hope the Academy doesn't reward another one of these overrated, slow-moving art movies."}, {"rating": "4", "text": "One of those movies that feels like something big will happen at any time but never really does. It’s dramatic and does a good job of holding your attention but in the end I looked back and thought much of it was pointless."}, {"rating": "10", "text": "This film just blew me away. Can't stop thinking about it; it's one of those films that you need a repeat reviewing which I think is the greatest praise."}, {"rating": "10", "text": "Stunning. Raw. Complex. Challenging. Heartbreaking. Iconoclastic. Innovative. Reverential. Sensual. I could go on foerver. Favorite movie of the year. Dunst and Cumberbatch are supreme. Jane Campion has done it again"}, {"rating": "2", "text": "I’ve never been less entertained my a movie. The story line is the equivalent to eating cardboard. It’s just nothingness."}, {"rating": "10", "text": "Wow I'm speechless. The Power Of The Dog is a masterpiece!  One of the very best films of the year, I can see not everyone liking it but with patience and paying attention to the details you will freak out at the end. Benedict Cumberbatch’s Best."}, {"rating": "1", "text": "Benedict’s acting is top notch. There’s some really beautiful shots in this movie, but at the end of the end this movie sucks. Like a lot. The “music” which is just a three year old playing the piano really poorly, is really bad and annoying. There’s no real development of the story telling you who is who and what is going on. You’re almost all the way through the movie before you finally see what you think they’ve been trying to tell you only for it to leave you going what the F was that? Save your two hours and thank me later."}, {"rating": "1", "text": "I barely finished watching to the middle. It is one of the most boring movies I've seen in my life."}, {"rating": "3", "text": "This is a dreadful movie.  I couldn't sit through it to the end.Cumberbatch has 2 speeds- getting dirtier (by bathing in mud, for example) and glowering.  That's it.  He's charismatic?  How?Jesse Plemens role could have been played by a store mannequin, that's the level of the character's physicality and emotion.  Kirsten Dunst is ditzy squared but it gets tiring pretty quick.  Her Pee Wee Herman wannabe son is laughable and wouldn't have survived in 1920's Montana for 10 minutes.  If you need a list of a hundred movies released this year, to see ahead of this one, drop a me line and I will send it to you."}, {"rating": "1", "text": "Worst movie I watched all year. I want my 2-hours back. The movie is filmed like an horror movie (constant tension) and yet nothing ever happens. It's absolute garbage."}, {"rating": "4", "text": "Misses the mark for me. While beautifully shot, it tries to be too many things, and fails at all. Phil is not the villain we're led to believe, nor Rose the saint. George is practically absent, as is any kind of weight to any of the characters. Their motivations are entirely mysterious to us and never resolved in any meaningful way. If this is about toxic masculinity, as Cumberbatch recently lectured all us menfolk on, where is it in this film? Is Phil toxic? Or a product of his times? Is Rose noble because she, lost her first husband? Has a gay son? Married George? Or are we seriously supposed to believe that Phil picking on her was the source of all that suffering? In the end, Phil is the only one who tries to make a meaningful connection to Peter.If this is some diatribe against toxic masculinity, the only thing we learn is that Campion has no idea what that is."}, {"rating": "10", "text": "Unnerving stuff. I'm not one for westerns so getting convinced to watch this was a challenge but im so glad i did cause what this western has surpasses those Americana cliché's. A deliciously slowburn masterpiece that confronts masculinity, perception and relationships. Benedict is a powerhouse as the conflicted Phil who's repulsive vulnerability pulls you in whilst leaving you feeling as if you're walking on a tightrope. Fresh of its golden globe win i am satisfied with the choice. Kristen Dunst is a weary mess that unravels like a wilting flower beneath the predatory Phil,truly a sigth to witness. And the final twist ending is an unanswered marvel."}, {"rating": "6", "text": "A boring story. I really can't understand the behavior of the mother, who seems to be making a good wife from the beginning but ends up being a alcoholic."}, {"rating": "5", "text": "While I cant necessarily give this movie a bad review I can in no way shape or form give it a good one. While the actors all seem to do there part and the cinematography is pretty good, The movie is plain and simply boring. By the time I thought the movie was about to go somewhere it was the end of the film. Alot of drama over mediocre problems. This will definitely be a blip in the memory bank."}, {"rating": "7", "text": "I liked it, but I did not love it because it feels like a mix of \"Brokeback Mountain\" with the herd of mammals and \"There Will be Blood\" with identical cinematography, set design, costumes, and a supernatural music score by the selfsame Jonny Greenwood. My thoughts on the amount of art produced in the movie weighed a smidge more than the narrative structure that has a bit of nil, but is able to be accompanied all the way to the end credits."}, {"rating": "0", "text": "One of the most boring movies.  Not a true western.  You can tell it is not Montana.  Not anything I would recommend."}, {"rating": "3", "text": "Really underwhelming, uninteresting story and difficult to empathize with. Lame experience and I don’t understand why it is being acclaimed as excellent."}], "recommendations": ["there_will_be_blood", "the_counselor", "the_american", "sanctum", "the_hateful_eight", "seven_pounds", "next", "fifty_shades_darker", "atonement", "hugo", "the_gambler", "the_mountain_between_us", "tenet", "the_hunger_games_mockingjay_part_1", "tinker_tailor_soldier_spy", "the_curious_case_of_benjamin_button", "inherent_vice", "slumdog_millionaire", "the_twilight_saga_breaking_dawn_part_1", "enemy", "old", "bad_times_at_the_el_royale", "shutter_island", "gone_girl", "the_butterfly_effect"]}