{
  "id": 1026,
  "title": "The SpongeBob SquarePants Movie",
  "starring": [
    "Tom Kenny",
    "Bill Fagerbakke"
  ],
  "runtime": 87,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Fantasy",
    "Adventure",
    "Action"
  ],
  "description": "There's trouble brewing in Bikini Bottom. Someone has stolen King Neptune's crown, and it looks like Mr. Krab, SpongeBob's boss, is the culprit. Though he's just been passed over for the promotion of his dreams, SpongeBob stands by his boss, and along with his best pal Patrick, sets out on a treacherous mission to Shell City to reclaim the crown and save Mr. Krab's life.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1rvzKV1d18EbDVaEd4VDzK3cgnY.jpg",
  "categories": {
    "plot": 8.238095238095237,
    "acting": 8.4,
    "ending": 9.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 8.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The movie felt short and in a hurry but it is a fun enjoyable kid's film.It been I think 11 years and I still remember this film.And the end credits songs are also so memorable whenever they are played It'll be stuck in my head for a day."
    },
    {
      "rating": "8",
      "text": "Very entertainig movie, especially if you're a Spongebob Squarepants fan. While I felt the \"kid becoming an adult\" subplot was kinda flat, it's only a minor issue when you've got many funny scenes, especially the David Hasselhoff scenes!"
    },
    {
      "rating": "10",
      "text": "Im a huge fan of Spongebob, so you could imagine that i had high expectations for this movie. Well, i was not dissapointed!! I love this movie!! I saw it in theaters 5 times!! Great animation, hilarious script, great characters, good plot, and great cast! Gotta love the Hoff!!"
    },
    {
      "rating": "8",
      "text": "I love the tv series and i love the movie!\r I reckon that this movie is fun for kids.\r There are some really funny humor in it which made me laugh quite hard!\r Pretty good"
    },
    {
      "rating": "8",
      "text": "Its not as good as the TV show, but I think that it was time for SpongeBob to make an appearance on the big screen and it was handled beautifully in this movie. Really does justice to one of my favorite shows of all time."
    },
    {
      "rating": "8",
      "text": "Quirky silliness is what made the show so famous. Steven Hillenburg does nothing to settle down as he has put together a laughing riot for all ages. As the goofballs finally hit the big screen, it's a smile on everyone's faces."
    },
    {
      "rating": "7",
      "text": "Filme mediano,mas legal. Cheio de peculiaridades e misturando live-action e animações,fala do Rei que perde sua coroa e Bob e Patrick vão buscar ela,e Plankton destrói a Fenda do Bikini enquanto isso,mas Bob consegue salvar a cidade. É apresentável."
    },
    {
      "rating": "8",
      "text": "This is such a fun animated movie. The story was fresh, the creatures looked awesome, the tone was darker than normal. It is a good animated movie. Also david hasslehoff was weird"
    },
    {
      "rating": "10",
      "text": "Nickeloden Did A Great Job At This When Nickeloden Was Old It Was Great But Now It Is Just Souless Nickeloden Did A Great Job And I Couldn't Love Old Nickeloden More!!"
    },
    {
      "rating": "10",
      "text": "Empfehlung an alle Spongebob fans.Einfauch nur Nostalgisch. Die Story mag zwar hier und da ein bisschen kurz geraten sein, aber für ein Kinderfilm zu verkraften."
    },
    {
      "rating": "9",
      "text": "Ever since the beginning I loved spongebob, but when I heard about this movie I thought they had done a little too much, i thought it would suck, honestly, though I'm obsessed with spongebob.  I asked my parents to let me see it and the story line made me think that it would be bad again.  When I watched it I was shocked by it, it was really good and I loved it.  The original humor and the wide variety of new characters made me love it even more.  I find it to be a great family movie, not just for kids, adults probably would enjoy it too."
    },
    {
      "rating": "8",
      "text": "This is an animated movie that often gets overlooked and forgotten but should be remembered as a modern comedy classic. What is most overlooked, and surprising is the depth and narrative heft of the film. The Spongebob Movie is often hilarious, gleefully silly, and surprisingly deep. It may never get the accreditation it deserves, but the Spongebob Movie is a film that should be re-evaluated, and maybe it would gain recognition as a underlooked animated gem.\r The humor in the Spongebob Movie maybe directed at children, but it would take a joyless person who takes life way too seriously not to find the film funny. The jokes are inventive and come early and often. The film is a perfect manifestation of the TV show in filmic form, without feeling like a bloated episode. It’s also great, because in an age when animated TV Shows have begun to cater more to stoners than children, including the latter, this movie still has an appeal for everybody.\r The film is gleefully silly, which only makes the film that much funnier. Admittedly there are a few moments when the film oversteps the threshold of what is funny, and what is over-the-top, but for the most part the film maintains a fun tone. One of the single greatest strengths of is the villain, Dennis, who’s one of the funniest villains of all time. The sheer stupidity of some characters, matched with the deadpan seriousness of Dennis makes every scene he’s in, even more hilarious.\r Above the humor, The Spongebob Movie is also surprisingly deep, in both character development and the film’s message. While viewers may not think about these things while watching Spongebob, the film has a great message about growing up, and how the world can forget to be silly every once and awhile. The film is actually a really great portrait of today’s society, and how everybody feels the need to grow up so fast instead of embracing their inner child.\rThis is a movie that can get overlooked by adults, because it’s silly and childish, but as a reflection of the society, the film is brilliant. The film is funny, and is a great film to sit back and watch with the family. For the best viewing experience one should embrace their inner child, which isn’t as bad as some would try to make it sound. In the end The Spongebob Movie should be considered a comedy classic, as it’s exponentially funnier than some of the best comedies today."
    },
    {
      "rating": "10",
      "text": "the film literally embodies my childhood. I love everything about the film, so much nostalgia. Nothing is better then on a cold rainy day sitting down and watching a little Spongebob :D"
    },
    {
      "rating": "10",
      "text": "People who say it sucked or is stupid have no sense of humor and are hard to please these days. This movie had some action,even though there couldve been some more with spongebob,humor, and best of alll....david hasselhoff! i dont see why everyone wants to kill spongebob, hes a harmless,nice character that even though mr.krabs dissed him he still wants to help. I recommend seeing this movie, spongebob sometimes isnt as funny in the tv show and i barely laugh at it sometimes, but now when i saw this movie it has funny and clever humor. It wasnt a waste!!!!! it gets you entertained and it had some surprises. People who said this is lame, do not know what fun is..... the surprise ending made me like spongebob more,okay its your opinion. But it was not that pointless, give the writers a break...guys!"
    },
    {
      "rating": "2",
      "text": "I am a big fan of SpongeBob but I'm very disappointed. The film is way too boring...the story is way too predictable... and the voice acting is way too cheesy. The TV series is way better than the movie.........."
    },
    {
      "rating": "10",
      "text": "along with the simpsons movie this is the BESt animated movie ever................................ALONG WITH THE SIMPSONS MOVIE...ALONG..REMEMBER....."
    },
    {
      "rating": "10",
      "text": "Funny, charming, naive and fully entertaining for all generations of yougs."
    },
    {
      "rating": "10",
      "text": "This is such a movie I won't soon forget, so see it and you won't regret. Be true to yourself, please see this film, or you'll just end up like the fool who ripped his pants."
    },
    {
      "rating": "10",
      "text": "Spongebob is a fun loving character who make life seem like a breeze. But plankton finds out that he has one more plan.Wonderful scenes which involve monsters and all types of sea creatures.In the attempt on rescuing the crown from shell city he passes many dangers."
    },
    {
      "rating": "10",
      "text": "I thought it was hilarious. My 4 year old son and I enjoyed it equally. Not everything will be Tolkien or Shakespeare; there's no fault in simple pleasure."
    },
    {
      "rating": "10",
      "text": "A 10, because it is a constant crackup."
    },
    {
      "rating": "9",
      "text": "A great movie! Clever, funny... this marks the first time when Spongebob started to be actually hilarious."
    },
    {
      "rating": "9",
      "text": "You guys are crazy if you gave it below a 8."
    },
    {
      "rating": "7",
      "text": "It was a good movie...i guess but i exspected alot more from spongebob."
    },
    {
      "rating": "10",
      "text": "This is the greatest animated movie ever made, greatest pg movie ever made, and one of if not the greatest film of all time."
    },
    {
      "rating": "5",
      "text": "Don't get me wrong, I love the Spongebob TV series, but this movie is a huge disgrace to TV's most lovable sponge. The plot is awful and pales in comparison to almost every episode of the show. The humor has also lost its comedic charm. I don't know, maybe the movie is just badly made or maybe Mr. Squarepants is just not menat for the big screen. Either way, this movie is disappointing."
    },
    {
      "rating": "9",
      "text": "One of the funniest movies I have ever seen, and also one of the best animated films ever in my opinion."
    },
    {
      "rating": "10",
      "text": "Unforgettable great fun."
    },
    {
      "rating": "10",
      "text": "Spongebob is my favorite show, the movie was like another great episode. So much fun, great humor, hilarious, Spongebob is a great character, I love Patrick, fun story, you couldn't ask for more from this clever movie. You gotta love Spongebob, and this is another example. Awesome."
    },
    {
      "rating": "7",
      "text": "Well I admit, I love the show. But the directors could have done better. Still, it's ok and Spongebob fans & kids should would love this."
    },
    {
      "rating": "10",
      "text": "I love SpongeBob and it's a show that I never get tired of. The movie was funny, had a good story, and it's one that I can watch again and again. I highly recommend it to any SpongeBob fan, or anyone that likes cartoons in general."
    },
    {
      "rating": "10",
      "text": "A Classic movie of 2004 i love this movie i thought animated movies are too babyish, but this one get's the flying **** outta that class for sure. it's very enjoyable for self or family to watch. also has a solid unforgettful storyline."
    },
    {
      "rating": "9",
      "text": "It is incredibly funny. I love the story and the characters especially. Spongebob was already so funny but when I saw this movie, Spongebob pushed the humor to the limit. This movie lives up to the great Nickelodeon tv series that inspired it."
    },
    {
      "rating": "7",
      "text": "wow, a sponge-bob movie, i  honestly expected it to suck, but i was presently surprised to see that it was actually funny, i normally don't like sponge-bob, but this was a strange exception"
    },
    {
      "rating": "5",
      "text": "Ah I remember this! Sure, back then it seemed really funny to me... Now I realize that this is the reason of the downfall of SpongeBob. It's mildly entertaining. But this movie could have been so much better. I mean, it's SpongeBob! Shame. 5/10"
    },
    {
      "rating": "8",
      "text": "A wonderful story line transports viewers into the whimsical world of Spongebob Squarepants; the hero of this brilliant film."
    },
    {
      "rating": "8",
      "text": "I always watched Spongebob even before there was this movie. I enjoyed watching the tv show and I definitely enjoyed watching this movie. The movie is just like watching the tv show. It has those moments that are some-what used in the tv show. But watching it on the big screen was a good change. As far as the  storyline goes, its definitely adventurous. But sometimes the added humor in the storyline is too stupid and unessacary. Yet once the adventure begins, then the fun begins. Overall, it's a great adaptation from the beloved tv show."
    },
    {
      "rating": "8",
      "text": "This movie brings me back good times good times. This movie is really awesome to watch but can get boring if you watch it to much so don't over watch it other than that damn! This was one of my  favorites  as a kid."
    },
    {
      "rating": "7",
      "text": "When it first came out, I loved it, having grown up on Spongebob. After rewatching it a decade later, it wasn;t nearly half as good as the television series was at the time. It is a bit excessive, and incomplete, but is filled with enough hair-brained, slapstick humor that I can't resist laughing. Spongebob fans should enjoy it, whether they like their episodes subtle or silly. It's a good movie."
    },
    {
      "rating": "7",
      "text": "The SpongeBob SquarePants Movie, like all cartoons turned into movies, is a little bit less fulfilling than the show. In this movie, the animators and storyboard people try to add elements of different mediums and extra filling to make the whole pie taste better. Well, in that sense, the movie is half-baked. SpongeBob SquarePants: great cartoon. SpongeBob SquarePants movie: only okay. And adding David Hasselhoff does not make a movie better, people!"
    },
    {
      "rating": "8",
      "text": "Quite the delightful film, \"The SpongeBob SquarePants Movie\" is a wholly entertaining film based on a highly popular cartoon. It's technically sound, it's hilarious, it's got great characterization, and a generous helping of pure early 2000's Nickelodeon fun. You like SpongeBob? Watch this film! You don't like SpongeBob? Well, you might still get a bit of mileage out of this wonderful film."
    },
    {
      "rating": "6",
      "text": "SpongeBob soaks up the laughs.\rBased on the kids television show, The SpongeBob SquarePants movie reaches its target audience with good laughs and a solid adventure."
    },
    {
      "rating": "10",
      "text": "This is THE best animated film based on a TV series. It's everything Spongebob fans could hope for, with wild, zany animation, delightfully cheery voice acting, hilariously disturbing scenes (i.e. Patrick's melting face), and and a wild plot that actually works and builds suspense towards the end, which is rare for animated films. Every character is perfectly characterised; Plankton is evil (even more so in this film, which makes it even better), Patrick is the lovable oaf as characterised in the early seasons, Spongebob is naive and an animated hero who is so fun here that you actually root for him, etc. The film's emotional scene towards the end is probably one of the best scenes in the film, and one in which the theme is made perfectly clear: Even if you're seen in a negative light by others, you can still do wonders when you commit yourself to achieving a goal. The song by Ween called \"Ocean Man\" is a perfect fit for the ending credits; it always fills you with a sense of joy when it starts playing. The Spongebob Squarepants Movie is the perfect ending to the pre-movie episodes, which is what I consider to be the real series. Everything after is a bad fan-fiction. 10/10."
    },
    {
      "rating": "6",
      "text": "The smiling yellow, fry cook sponge in his first ever movie is like the show (Occasionally funny) most of the time. Only in the movie It's combined with adventure and musical and made into a good family film meant to be enjoyed by anyone and everyone."
    },
    {
      "rating": "9",
      "text": "i always love i watch his show everyday and it never gets old well sometimes . i  love this movie but i gonna love the sequel more . the sequel has new secrets and spongebob and patrick are back and they have new  comedy that we have not seen in 2015 yet"
    },
    {
      "rating": "8",
      "text": "A really funny and exciting movie that really captures the deep blue sea. The best part about this movie is about the adventure that Sponge bob and Patrick take to get back King Neptune's crown. A really good movie for the family."
    },
    {
      "rating": "8",
      "text": "HILARIOUS MOVIE! People who aren't big into the show will probably find it too weird and random but fans of the show will most likely like it. At last, we see the result of Plankton getting his tiny hands on the Krabby Patty formula-and the result is worse than merely getting more customers. Spongebob and Patrick are as funny as ever (especially Patrick) and the movie really captures the essence of the show. Funny movie, recommended for Spongebob fans!"
    },
    {
      "rating": "8",
      "text": "This movie is just great.\r Funny characters\rGreat plot\rMemorable dialogue\r Smooth animation\r Awesome songs.\r and just uncanny greatness.\r This movie is just unforgettable."
    },
    {
      "rating": "7",
      "text": "As a SpongeBob movie, is decent. Sometimes the movie is weird, but it has a great animation, good charatcers, funny jokes and probably David Hasselhoff's best cameo. Is a nice movie for those one who grows up with SpongeBob like me. This is a must watch for SpongeBob fans."
    },
    {
      "rating": "8",
      "text": "It really should have been the finally, the movie climaxed everything. Spongebob and Patrick are great characters that can do great things and I really want to be a Goofy Goober."
    }
  ],
  "recommendations": [
    "puss_in_boots_the_last_wish",
    "the_spongebob_movie_sponge_out_of_water",
    "sonic_the_hedgehog",
    "peter_rabbit",
    "megamind",
    "minions_the_rise_of_gru",
    "despicable_me_2",
    "over_the_hedge",
    "sonic_the_hedgehog_2",
    "teen_titans_go_to_the_movies",
    "captain_underpants_the_first_epic_movie",
    "ice_age_the_meltdown",
    "the_big_lebowski",
    "the_lego_movie",
    "hotel_transylvania_2",
    "shazam",
    "the_princess_bride",
    "bedtime_stories",
    "alvin_and_the_chipmunks",
    "barnyard",
    "ghostbusters_afterlife",
    "shaun_the_sheep_movie",
    "paddington",
    "hotel_transylvania",
    "ice_age_dawn_of_the_dinosaurs"
  ]
}