{
  "id": 1792,
  "title": "The Mummy",
  "starring": [
    "Brendan Fraser",
    "Rachel Weisz"
  ],
  "runtime": 124,
  "genre": [
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "description": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
  "categories": {
    "plot": 8.4,
    "acting": 8.8,
    "ending": 9.5,
    "soundtrack": 9.333333333333334,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.909090909090908,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie is AMAZING!!!! It is very fast paced with a lot of action, comedy & pretty decent special effects too! It is very entertaining & extremely enjoyable."
    },
    {
      "rating": "10",
      "text": "This was an amazing film. With a mixture of indiana jones, humor, horror, great storyline, great setting, music, and superb acting from Brendan Fraser, Rachel Weisz, John Hannah and Arnold Vosloo, you have got a great summer horror-adventure film."
    },
    {
      "rating": "10",
      "text": "Fantastic entertainment with great visuals, a creative, witty and inventive script that does not rely entirely on cliche to get through to audiences, amazing acting by all the cast, great costumes, beautiful locations in from the Middle East and a grand style about the film.  A great, great film."
    },
    {
      "rating": "10",
      "text": "the best movie i've ever seen , my childhood was great bcz of this wonderful movie , no words can describe it , it's the best .... Suspence , comedy , fun , excitement , horror , great cast , very nice music all in one movie"
    },
    {
      "rating": "10",
      "text": "Looking back on this film I'm not sure why it didn't have a better reception.  Perhaps it was meant to be darker.  Perhaps critics who had seen 1932's the Mummy were disappointed in the direction of the film.  I'm not quite sure.  I find that many of the complaints from critics were actually the high notes for this movie for me.  It terrified me in the theaters as a young child, in my teens I watched it multiple times with various friends, now I watch it at least twice a year and quote it constantly.  It's a part of my life and one of the best adventure films every made."
    },
    {
      "rating": "10",
      "text": "Amazing movie, very fun and characters are fantastic! Imhotep a very good mummy and Brendan Fraser is unforgettable."
    },
    {
      "rating": "10",
      "text": "The Mummy is an exhilarating action adventure with tons of action, horror, comedy & a dash of romance."
    },
    {
      "rating": "10",
      "text": "A masterpiece of my generation. Excellent star-cast, decent story and finally it gives great homage to all mummy-themed classics which came before it."
    },
    {
      "rating": "10",
      "text": "The Last Great Adventure FilmDon't get me wrong, we have had lots of great movies since '99, but I really feel that this is the last one where it was just 10 for 10 great. And it was a great way to end the 90's, which I still believe to be one of the best movie decades; we knew how to make great movies and we knew how to make great trailers for those great movies--not just rapidly flashing scenes with drums and clashing and building violins, but REAL trailers edited to perfection with great music.\"The Mummy\" just packs it all; from Adventure to Horror to Fantasy to Drama to Comedy, and in my humble opinion, it succeeds superbly in all five genres. It is just such a FUN movie! The sites (and sights), the sound design, the CGI (while I won't say it's perfect), and, of course, Jerry Goldsmith's masterpiece of a score which can take Alan Silvestri's for \"The Mummy Returns\" to the cleaners any day of the week.While \"The Mummy\" was a blockbuster, it is sadly one of those unappreciated movies. Shortly after its release is when movies began to take a turn for the worse and become darker, and for what ever crackbutt reason, darker is what the American Audience wants. Audiences just want movies where everyone dies (a lot of the time including the hero(es)), the music is heavily synthesized, and the plot is simplistic.\"The Mummy\" is an epic adventure from beginning to end. And I can only hope that our movies return to this movie-type some day soon. While I do like \"The Mummy Returns\", it was a little too silly for me. And \"Tomb of the Dragon Emperor\"? No comment. The first one just captures the fun-ness that movies are SUPPOSED to be; a movie that grabs you out of your world so you almost feel as if you're IN the movie (he said, at the risk of sounding either cheezy or loony), very much in the tradition of \"Jurassic Park\" and its sequel.It's just truly a classic, and will hopefully remain so long enough to see a day when it is appreciated again."
    },
    {
      "rating": "10",
      "text": "One of the best movies I've ever seen! I could watch it thousand of times and I would never get bored."
    },
    {
      "rating": "9",
      "text": "The Mummy is the most famous adventure film about Egypt and exactly the most iconic role for Brendan Fraser. The first part of the trilogy is obviously the best, it's the most recent idea. And the cast did not pick up bad. One of the best adventure films of the 90s."
    },
    {
      "rating": "10",
      "text": "Once again the critics are completly wrong. Brendan Fraser is one of best actio adventure lead, I just love him."
    },
    {
      "rating": "9",
      "text": "Classic!Amazing adventurous ride!great acting and screenplay kept me engaging till the end score was good visuals were okish fights was good humour was good amazing story really entertaining to watch!"
    },
    {
      "rating": "10",
      "text": "Brendan Fraser nearly died during a scene where his character is hanged. Rachel Weisz remembered, \"He stopped breathing and had to be resuscitated.\""
    },
    {
      "rating": "10",
      "text": "hiugyffguyfyfguguihugtdrdt.................@#$%÷×+=_*&^(《》¤•°⊙☆▪○●□■♤♡◇♧《》¡¿{}[]●□■▪○⊙°•☆¤□¡¿》《"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙````````````````````````~```~~``````````````````````````"
    },
    {
      "rating": "10",
      "text": "+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×+×××+×+×+×+×++&!&!&!&!&!&!&!!!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!&!"
    },
    {
      "rating": "9",
      "text": "Nice action movie to watch in the evening. Looks very easy. A mixture of horror, action and comedy."
    },
    {
      "rating": "9",
      "text": "One of the best movies ever!This movie is so awesome! A great plot, awesome action, and Rachel Weisz make this movie totally cool! Rachel Weisz is super hot as Evy, a librarian who awakens Imhotep, the mummy, and then has to stop him. She is captured by Imhotep in order to be sacrificed to bring his love back. Now it's up to Rick O'Connell, played by Brendan Fraser, to rescue her. With tons of action and a totally cool plot, this movie is a great edition to any movie collection. Fraser is awesome as O'Connell, who knows something is alive under the sand of Hamunaptra, City of The Dead, and then he has to stop the evil from spreading. He is a funny action hero, and he does his best work in this movie. Rachel Weisz does a super job. John Hannah plays her brother Johnathon, who is some of the comedic support. Kevin J. O'Connor is also awesome as Beni, a little weasel in league with Imhotep. He is very funny. All in all, this movie is great and is one of my favorites!"
    },
    {
      "rating": "9",
      "text": "This movie is the first of three and the best in the series, it has a great plot, enjoyable character, and drama and humor, a movie I would recommend seeing."
    },
    {
      "rating": "10",
      "text": "Pure cinema gold! Dumb fun and excellent acting, cinematography, and special effects! The very fact that they switched the genre from horror to adventure, was possibly the best decision ever made!"
    },
    {
      "rating": "10",
      "text": "THE PERFECT SUNDAY MOVIE! Brendan Fraiser at his absolute finest! Smoke a blunt, wait for mommas Sunday dinner and get this movie rolling. Perfection."
    },
    {
      "rating": "10",
      "text": "I loved this movie, I have always enjoyed studying ancient Egypt (along with anything else ancient) ao this was my cup of tea."
    },
    {
      "rating": "9",
      "text": "[9/10]Pros:1.Fast paced with lot of action.2.Good Egyptian-flavored plot and special effects.3.Some creepy mummy moments and a lot of humor-filled dialogues.Cons:1.That villain mummy is very much powerful, but does not know at all how to use his power effectively.With all his power he could not even restrict a few gunmen!!!"
    },
    {
      "rating": "8",
      "text": "its like Indiana Jones except it doesn't have Harrison Ford in hit. my opinion: very entertaining."
    },
    {
      "rating": "5",
      "text": "Is quite fun at times but the script is too dumb and the plot full of holes."
    },
    {
      "rating": "7",
      "text": "I've never liked Brendan Fraser as an actor in any movie, and this is no exception. The movie was actually pretty good, with a good story and okay script, but Fraser is marginal at best. There's something about him that makes it so that I can't take him seriously in any movie. The stupid, bad comedies he's done (Furry Vengeance, I'm looking at you) have damaged his reputation. The Mummy is a pretty serious movie, but I can't take Fraser seriously in it. He could play a businessman in a Wall Street thriller and I would still think that at any time he's going to resort to slapstick humor somehow."
    },
    {
      "rating": "4",
      "text": "Oh my god, what a bad \"indiana Jones wanna be\". Actually some of it was ok but i hated the \"good guys\". I have never wanted the \"bad\" guys to win more then this movie. With all that power, why didnt the mummy just kick some serious butt at the end? who knows."
    },
    {
      "rating": "7",
      "text": "\"The Mummy\" is a movie trying hard to be like the Indiana Jones franchise but turns out to be better than the average summer blockbuster."
    },
    {
      "rating": "8",
      "text": "A great movie that reminds me of 'Indiana Jones' fantasy this time."
    },
    {
      "rating": "8",
      "text": "Easily one of the most likeable/enjoyable movies you will ever see. It's really hard to say anything bad about it. Good action, Solid acting, Fraser and Weisz work wonders together. Just a really good movie."
    },
    {
      "rating": "7",
      "text": "I know that time has not been kind to this movie and critics really ripped it to pieces, but I remember watching it on opening night and I enjoyed it immensely. Sure, it's far from perfect, but it knows that and embraces its own goofiness.\r The visuals (at the time) were fantastic. Acting: so-so. Story: corny but full of adventure and action cliches, to the point that I think it is mocking itself.\r Overall:\rThe Mummy is a fun movie not meant to be taken seriously. Flawed, but enjoyable."
    },
    {
      "rating": "8",
      "text": "This isn't one of the best movies, but I enjoyed watching it. My only issue with the film is that it tries to be funny even though it isn't. Everything else is great."
    },
    {
      "rating": "8",
      "text": "Лучше всего в этом фильме выполнен элемент комедии. Диалоги смешные, порой остроумные, а это не даёт заскучать и неплохо веселит. Сцены боёв выглядят весьма комично и эпично, наверняка создатели вдохновлялись Индианой Джонсом. Элемент фильма, который потерял всё интересное со временем - это ужасы. Пугают старыми проверенными способами, присутствуют хоррор-клише, да и Мумия не выглядит так же устрашающе, как это было лет 10 назад.Итог: Отличный фильм боевик-комедия, который теперь нету смысла смотреть как ужасы, только если повеселится от забавных диалогов или посмотреть на неплохой экшен."
    },
    {
      "rating": "7",
      "text": "Its a good movie. The cast is fine, solid action, and it was interesting. The film has that \"It\" factor (cant really describe why its so good, it just is) and I enjoyed watching it."
    },
    {
      "rating": "8",
      "text": "'The Mummy' has the jokes, the action, and the chills along with the sneaky little educational references here and there that serve a refreshing mummy film ****"
    },
    {
      "rating": "8",
      "text": "The Mummy is a classic adventure movie. The ancient Egyptian curse theme is compelling and the film is well paced. The cast is likable and there are more than enough decent action scenes to entertain. The Mummy is a superior blockbuster for the whole family."
    },
    {
      "rating": "7",
      "text": "Better than you would think, this movie delivers a good, if predictable time. Weisz shines as a star and delivers a movie saving performace. Good Character development and good acting take what was likely to be a dull, average, forgettable movie and turn it into a solidly entertaining work."
    },
    {
      "rating": "8",
      "text": "i think then this remake is very good, maybe the fault of this movie is the parts of the comedy, but the special effects and some acting are so good . the story is strong and the music is ok, 120 minutes of god action"
    },
    {
      "rating": "7",
      "text": "The Mummy rises above many of the Indiana Jones films to provide fascinating and entertaining adventures through Ancient and Modern-day Egypt. Rachel Weisz is brilliant in an early-career role as an Egyptian historian and researcher."
    },
    {
      "rating": "6",
      "text": "The movie is kind of movie when you have nothing else to do. It satisfies the feeling of needing to do something but leaves your mind 2 minutes after it is over."
    },
    {
      "rating": "8",
      "text": "An exceptionally thrilling adventure stocked full of action and laughs. One of the few widely known movies to showcase the eastern part of the world in such a lively entertaining way."
    },
    {
      "rating": "7",
      "text": "Rachel Weisz is so hot in this.  Yes this kind of a cheesier Indiana Jones, but the effects really show up.  Rachel Weisz is all sexy and funny.  Good pacing and along with a decent story make this a satisfying b movie.  I have the blu ray and it looks great."
    },
    {
      "rating": "7",
      "text": "I can say nothing for the acting, directing, writing, or anything for that matter. What I can say is that I enjoyed it. I still can't figure out why, but I enjoyed it."
    },
    {
      "rating": "7",
      "text": "I really like the mummy movies and maybe that's just because I'm fascinated with Ancient Egypt but whatever. This movie is a great adventure/action film. Disregard the whole thing where people are comparing this to Indiana Jones, I don't like to compare movies when I watch them unless they're a parody. To me these movies have their own identity and this movie is just great, go see it."
    },
    {
      "rating": "8",
      "text": "Nowadays is very hard to find a good adventure movie like this. This is one of the first scary movies i watched as a kid. My score for \"The mummy\" is 8/10"
    },
    {
      "rating": "8",
      "text": "This movie lives from the great visual effects and the story starts interesting, but gets worse later. The big problem of the movie is their stupid humour scenes."
    },
    {
      "rating": "8",
      "text": "This movie came out so long ago, that I had forgotten how much fun it actually is. The acting is great, the action scenes were well made, the story was interesting and the movie was a lot of fun. Despite the dated CGI effects and the failed comedy moments, it's still a pretty good movie."
    },
    {
      "rating": "8",
      "text": "''Indiana Jones'' style movie with remarkable cast assemble, an unforgettable score and great action-adventure story makes you wanna watch the movie over and over again."
    }
  ]
}