{"id": 328, "title": "The Proposal", "starring": ["Sandra Bullock", "Ryan Reynolds"], "runtime": 108, "genre": ["Comedy", "Romance", "Drama"], "description": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aYlnDia7ldvqFUst1O5S8LZeM2S.jpg", "categories": {"plot": 6.5, "acting": 6.8, "ending": 5.625, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.068965517241379, "action": 5.0}, "reviews": [{"rating": "6", "text": "\"The Proposal\" is total rubbish; it creates its own problems by connecting them to the plot. But nevertheless, if you like Ryan Reynolds getting his butt owned by Sandra Bullock, by all means, go ahead and enjoy..."}, {"rating": "2", "text": "Silly, Predictable crap. Seen it a thousand times even though the stars have chemistry that doesn't even benefit the movie. Although Betty White gives a hilarious performance. I give this movie 25%."}, {"rating": "8", "text": "The Proposal made me laugh all the way through the movie. The movie also kept me on my toes throughout and I was interested the whole way through. The movie also had Sandra Bullock, Ryan Reynolds, and Betty White in it. I love all three of these people and are hilarious when they are put together into a film. If you want to watch a funny movie that will make you laugh throughout I would recommend The Proposal!"}, {"rating": "5", "text": "This movie wasn't that good! I didn't like Sandra Bullock's role in the movie,she does the same s*** in her previous bad films. The only coolest character in the movie is Ryan Reynolds and Betty White as the funny grandma,that's it! They shouldn't put Betty White as the funny grandma instead wathcing this crap of rom-com film with these two stupid couples! But to be fair,this movie turns people into watching this movie into guity-pleasure. But come one,it's just a stupid rom-com film and I don't think wasnt too great!"}, {"rating": "10", "text": "Sorry but it's beyond me how some of you losers can rate this movie so low. I was gonna give it a 9 but now I'm gonna give it a 10 just to piss you haters off. This was a damn good film. Bullock and Reynolds play off each other great and it was an all around fun and enjoyable movie. Very much worth watching"}, {"rating": "3", "text": "Alrightly funny at times but had a terrible plot. I feel like I've seen this exact same thing before in countless other romantic comedies. I like the cast and they had some funny jokes but a lot of it made me just role my eyes. Not a very good movie and don't recommend it."}, {"rating": "6", "text": "I think Sandra Bullocks performance was okay.But everybody loves Sandra Bullock. Ryan's performance was okay 2.But you got 2 give Betty Whites performance was brilliant ever hands down.Everybody who was in this movie was okay."}, {"rating": "6", "text": "The comedy was good, but the romance wasn't developed enough. I didn't believe it at the end when Andrew said he went from loathing to loving in three days. Yeah Right!"}, {"rating": "8", "text": "I hate girl movies but this was pretty dang funny.....SHe was a riot and what a nude seen,,,she gets an A for working out....The whole cast was hysterical."}, {"rating": "9", "text": "Margaret Tate's Soul - conciliates to friendship, Appearance - attracts, Mind - provokes respect. Conclusion: Her Spirit"}, {"rating": "6", "text": "Well , it took me a while to see it, my mom recomened it , and well it was kind of slow, it was entertaining but i really expected a little more."}, {"rating": "8", "text": "I don"}, {"rating": "9", "text": "Hilarious harmless fun."}, {"rating": "10", "text": "This is what we want from hollywood. An entertaining comedy not their political views on things promoted by movies. Critics are a waste of time as well. Critics by and large are in the business of promoting their name recognition and have nothing in common with fly over American values."}, {"rating": "10", "text": "Loved this film, laughed all the way through it. FANTASTIC!!"}, {"rating": "10", "text": "Loved this movie. Well-directed, well-acted. Every scene was a gem that made me laugh."}, {"rating": "10", "text": "My husband and I really loved this movie. It was funny and a joy to watch. Did not remind me of another movie when I was watching it. Usually if the critics don't like a movie,,,,,,I do. One that I could watch over many times."}, {"rating": "9", "text": "This Movie was alot better than the Hangover which is WAY OVER RATED. I Hate to say it but this movie sucked me in, yes it is a bit predictable but the two leads are great...Ryan Reynolds especially. I laughed and at one point nearly teared up. So ignore the critics go see it if you want a nice, funny and well acted film."}, {"rating": "8", "text": "I'm usually not the biggest fan of romance movies, but The Proposal definitely was one of the best. Admitted, there were some areas that could have had better acting involved, overall it was interestingly funny."}, {"rating": "8", "text": "I went with a friend. it was much better than I thought it would be. The ending was the best."}, {"rating": "6", "text": "The Proposal starring Ryan Reynolds and Sandra Bullock is a laugh out loud romantic comedy. In this love story Margaret (Sandra Bullock) plays a tough bad ass boss of Andrew (Ryan Reynolds). When Margaret discovered that she was getting deported because she didn't fill out all of the papers that made go to the U.S,A. (She was originally from Canada). So she tells everyone that she is going to marry Andrew because he was originated from the United States. Andrew refused but Margaret made an offer he couldn't refuse. Now you are probably wondering what would of happened if she didn't make this big fat lie. Well, your question is that she would have to go back to Canada for one year to fill out the rest of the paperwork. When I was watching this movie I felt like Bullock and Reynolds had a very good connection they played very well with each other they brought a huge sparkle to the movie. The ending in the movie was not what I hoped for you knew the ending ever since you saw the first ten minutes. Although it made me laugh and I had a great time watching so I give it a 6."}, {"rating": "9", "text": "I Love it!!! It's so funny, entertaining... the chemical energy between the incredible Sandra Bullock and Ryan Reynolds are amazing and their acting was good... It's almost perfect."}, {"rating": "2", "text": "I wasted one of my very few opportunities to take in a movie in the theater by agreeing to sit through this film. I never sensed the chemistry between the lead actors and the final scenes which accompanied the credits actually made the movie much worse for me. They should have been left on the cutting floor!"}, {"rating": "8", "text": "The movie was surprisingly good for looking like a \"chick flik\". The comedy was as great, but the plot seemed like you could see everything coming."}, {"rating": "5", "text": "Had some really funny moments, but that's it. Incredibly stupid plot, stupendously unbelievable, cookie cutter rom com."}, {"rating": "7", "text": "I liked this movie even though at times it seemed a bit slow developing the story. There was enough humor to keep it light and fun, my kind of movie. It was worth the money spent."}, {"rating": "3", "text": "I can't believe that on any universe he would want to be with her. Of course a better written script could have saved that but then it would have been five, You have to be brain dead to like this movie."}, {"rating": "10", "text": "Very fast and refreshing, not like some slow dull romantic comedies I have seen. The chemistry is strong. One of the best. Love it!!!"}, {"rating": "7", "text": "Funny and smart, both are perfect for each other."}, {"rating": "0", "text": "Abysmal film-making, terribly chemistry. This film in an insult to any honorable sense of humor."}, {"rating": "4", "text": "[***SELF-POLICING SPOILER ALERT***] Struggling writers shouldn't detest \"The Testing of Luther Albright\" because its author is fabulously wealthy and well-connected, they should detest MacKenzie Bezos because her 2005 debut was a literary triumph. In \"The Proposal\", Margaret Tate(Sandra Bullock), a Miranda Preistly-like book editor, evokes the double standard about female bosses in this sort of \"The Devil Reads Don DeLillo\", when \"it\"(as she's described by her employees) torments her assistant Andrew Paxton(Ryan Reynolds), and the staff this workaholic oversees at a New York publishing house. But Andrew isn't unformed as Andy Sachs(Anne Hathaway) was in the film based on Lauren Weisenberg's chick-lit sensation: he's not just an aspiring writer; he's also the son of a small town scion who puts Margaret in her place when the narrative moves to Alaska. Where once their relationship was symbiotic(she gets her work permit; he gets perks), now Margaret loses all her agency and gets reduced into another hopeless romantic; a woman who needs a man to help her attain true happiness. Surrounded by philistines, Margaret's intellectual elitism(she's never played a video game; she's never seen YouTube) is neutralized, since brains can't begin to compete with monetary wealth in our post-literate world. At a strip bar, the tables are turned, in a key scene, when the local Alaskans(the groom's family) whom Margaret can barely tolerate, allows a male stripper to have his way with her. She's humiliated. Books have no cultural currency in Andrew's neck of the woods. That's why he left Alaska, in spite of the family fortune. He sacrificed a lot to follow his muse. That's why it's hard to believe the happy ending after Andrew discovers the truth about his unpublished novel. It's hard to root for careerism."}, {"rating": "8", "text": "I'd really come close to giving this movie an 8.5, but there are a few things that keep it from being a 9. If creepy male strippers bother you, there's about 3 minutes of the show you should just close your eyes or look away. It's somewhat cliche but honestly, what romantic comedy isn't? You know from the get-go the guy's going to get the girl, somehow, someway, the fun in the experience is seeing how it happens, and the two main actors deliver this experience perfectly, and the comedy is great. It could have used a little bit more of a reason as to how things changed for the two of them, but it looks like it's going to be the only chick flick that isn't going to be rated R this summer, and the only one so far, so if you're looking for a good chick flick this summer, this is it! (unless you can get her to watch transformers or star trek ;-)...all in all a solid movie!"}, {"rating": "9", "text": "This movie had everyone in the theater laughing... They do great with each other... Definitely a chick flick even guys can stand! =)"}, {"rating": "8", "text": "WOW. I'm a guy, and I really don't like that many Romantic Comedies, mainly because the romance is always cheesy and overdone. This movie however, despite having a very weak plot, was absolutely hilarious at many moments, and was careful to avoid oh so many cliches. Seriously, every time the movie started droning on or falling into mediocrity, there was suddenly some unexpected twist or event that just made the theater crack up laughing. Also, the chemistry between the two was a great mix of puppy love and humor, thus the relationship never got old. Good stuff, I would recommend seeing it"}, {"rating": "6", "text": "I"}, {"rating": "9", "text": "Sure it was predictable but so what. Good acting, good timing, The boy got the girl. What could be better."}, {"rating": "10", "text": "Extremely funny, and not overly sappy, like some romantic comedies can be. Great performances from Sandra Bullock and Ryan Reynolds as well."}, {"rating": "8", "text": "Very enjoyable. Recycled plot perhaps, but a lot of fun and quite a few laughs. Bullock and Reynolds make a surprisingly effective couple, and the script is very clever."}, {"rating": "5", "text": "My girlfriend liked the movie. I enjoyed her positive reaction, because she's a lot more fun when she's happy. However, I did not really like the movie. My main enjoyment of the movie was congratulating myself every time I correctly guessed a plot twist -- which happened a lot. I like Sandra Bullock a lot, but I sure don't care much for her choice of material."}, {"rating": "9", "text": "Surprisingly good from something that I had expected not to like. Sandra Bullock still has good comedy timing."}, {"rating": "10", "text": "Funny."}, {"rating": "3", "text": "Neither romantic or Funny! Isn't Sandra a little old for this one...I was rooting for the ex girlfriend in Alaska, and yes, it was predictable, plodding, and stupid, but I was astonished at how unsympathetic Sandra was as the canadian bitch and how ineffective...and she got a nom for this one? Can't win them all, but this sucked."}, {"rating": "1", "text": "Bad Plot, not funny, those who say it are havn't seen any good funny films. It bored me to death. I wis it could be a little funny to maybe keep me enetertained as many of these bad movies do, but it failed even that. The Proposa was a failure, well, neve mind, the teens in this world who dont watch good movies will love this!"}, {"rating": "4", "text": "Had couple of funny moments, which is the least expected from any comedy film. Other than that, it was more or less boring and very predictable. Not one of the worst comedies, just a disappointingly below average one."}, {"rating": "10", "text": "Love it, they are so good together, and Betty White is great!!"}, {"rating": "7", "text": "The Proposal covers almost about every cliche in the Romantic Comedy genre, but see the thing is Bullock and Reynolds make it work."}, {"rating": "9", "text": "Loved it. Betty White was charming. More laughs than I expected."}, {"rating": "8", "text": "The movie was great, took the wife to see it and i was surprised that i enjoyed the movie also, its not perfect but it looks like everyone else in the theater enjoyed it also, lots of laughs."}, {"rating": "8", "text": "I heard one reviewer on the radio call it \"utterly predictable\" and \"an appalling waste of talent.\" He's right on the first count, but then isn't that what romantic comedies are supposed to be? As to the second, the film was very well cast. Bullock exhibits her top-notch talent, like always, and Reynolds was an unexpected but very good addition. While the plot was boilerplate and there definitely could have been more character development, the movie was funny, adorable, and generally a good time for the family. It was also (mostly) not too crass or crude, which is increasingly rare from Hollywood. Definitely worth the cost of a ticket."}, {"rating": "8", "text": "I haven't seen it yet, I just want to ask Chad WTF he's talking about?? How about a review that's actually helpful and readable? If you're going to be an advance scout, cater to the masses not your fellow elitists."}], "recommendations": ["just_go_with_it", "27_dresses", "friends_with_benefits", "what_happens_in_vegas", "no_strings_attached", "the_break_up", "trainwreck", "tammy", "forgetting_sarah_marshall", "this_means_war", "just_friends", "50_first_dates", "my_spy", "second_act", "zack_and_miri_make_a_porno", "that_awkward_moment", "good_luck_chuck", "sex_drive", "bad_teacher", "the_wedding_ringer", "identity_thief", "little_fockers", "the_wrong_missy", "hubie_halloween", "couples_retreat"]}