{"id": 1331, "title": "The Ten Commandments", "starring": ["Charlton Heston", "Yul Brynner"], "runtime": 220, "genre": ["Drama", "History"], "description": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.", "releaseYear": "1956", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg", "categories": {"plot": 5.0, "acting": 3.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "1", "text": "I'm sorry if this is offensive to religious people but why do religious movies always turn out to be a load of Bollox???"}, {"rating": "2", "text": "As is typical for most Protestant productions, or ay religious production, is that they eyes are too big for the stomach. While this film would do quite well in the bin next to the typical Disney rip offs that come to DVD, in a movie theatre you see that the there were two things missing from this production: A budget worthy of a 3D Animation effort and a director that could direct their voice actors to their characters. As long as the Christian community sees fit to produce home video that does not challenge the mind, eye and senses and continues to put out sub-standard, decade old feeling movies, then their intentions will constantly fall. I firmly believe that God can use anything to His glory, but it says a lot for the Christian film industry and their lack of effort, talent and budget."}, {"rating": "5", "text": "just watched some clips of it. some of them aren't memorable. so, i'm just gonna say: its not terrible, but not that good. the animation was kind of cheesy and the plot was screwed, but the acting wasn't so bad and the visuals were nice.\r Rating: 58%"}], "recommendations": ["the_matrix_resurrections", "the_emoji_movie", "the_last_airbender", "gods_of_egypt", "redemption_day", "jeepers_creepers_3", "gamer", "songbird", "independence_day_resurgence", "the_day_the_earth_stood_still", "all_eyez_on_me", "pinocchio", "pacific_rim_uprising", "day_of_the_dead_bloodline", "book_of_shadows_blair_witch_2", "the_cloverfield_paradox", "facing_the_giants", "norm_of_the_north", "doctor_strange_in_the_multiverse_of_madness", "dolittle", "see_no_evil", "dragonball_evolution", "the_host", "uglydolls", "the_darkest_minds"]}