{
  "id": 1551,
  "title": "The BFG",
  "starring": [
    "Mark Rylance",
    "Ruby Barnhill"
  ],
  "runtime": 117,
  "genre": [
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "The BFG is no ordinary bone-crunching giant. He is far too nice and jumbly. It's lucky for Sophie that he is. Had she been carried off in the middle of the night by the Bloodbottler, or any of the other giants—rather than the BFG—she would have soon become breakfast. When Sophie hears that the giants are flush-bunking off to England to swollomp a few nice little chiddlers, she decides she must stop them once and for all. And the BFG is going to help her!",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vssXmCrfCiARkQ0512oG0wjh2h9.jpg",
  "categories": {
    "plot": 6.521739130434782,
    "acting": 6.67741935483871,
    "ending": 6.142857142857143,
    "soundtrack": 9.0,
    "cinematography": 7.0,
    "familyFriendly": 6.2,
    "funny": 4.454545454545454,
    "action": 5.8
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Although filled with many touching moments, Spielberg's Roald Dahl adaptation falls short of expectations. There is a lot to see here and Mark Rylance is absolutley stunning, but the thin plot, the heavy CGI and the disastrous ending overshadow what could be a cinematic landmark. For viewers who want to see something different, The BFG is a open ended ticket through fantasyland. That comes with a great caution."
    },
    {
      "rating": "3",
      "text": "Pretty underwhelming movie. Wasn't completely terrible, but it was extremely cliché and boring.\rThe first half is so boring that I almost fell asleep. The ending wasn't that good either.\r Visuals were nice, and the characters were charming, but the movie fell flat in my opinion."
    },
    {
      "rating": "3",
      "text": "Very powerful message - Very poorly delivered. An amazing book with poor execution.  If I hadn't have read the book I may been very lost throughout the movie."
    },
    {
      "rating": "4",
      "text": "When you hear the name Spielberg as the director of this movie, you might think it's a good or \"ok\" movie at best. Sadly, not in this case. This film has awesome CGI animation, really good actress, but boring & flat plot. Really childish & long conversations that make you sleep. Therefore, not recommended."
    },
    {
      "rating": "2",
      "text": "Save your money! We walked out of this boring mess of a movie. Our kids were bored by it. The couple next to us wanted to leave but didn't have the courage. The BFG is devoid of heart or story. There is no set up as to why anyone would care about this orphan Sophie. There is no goal. The giant has some nice CGI eyes, but there is nothing mind-blowing here and in fact many of the scenes of Sophie in his hand are downright shocking in how poor the quality is. Herky-jerky. Shakey, They even sped up one scene. Hard to believe this is the latest technology! In the end, there is just no story. Zero. No reason to care whatsoever. You're just watching them walk through this very uninteresting world. By the way, I think this young actress was a poor choice. She's not endearing or empathetic or even a particularly good actress, so maybe this movie never stood a chance as soon as she was cast."
    },
    {
      "rating": "5",
      "text": "The BFG is quite charming and lovable in its visual, cast and the overall aesthetic complement. The audience could directly feel that this movie is great for children, just like Dahl's original story. However, Spielberg failed to maintain the balance between adolescent and childish; it's a bore for adults who wanted a decent Spielberg /Disney film."
    },
    {
      "rating": "0",
      "text": "The BFG is a Boring Film Giant. Walden Media makes safe Christian fare so Dahl's trademark darkness has been scrubbed from this movie so as not to offend. The result is an emotionless and pointless journey. Even the attempts at humor couldn't rouse the sold-out audience to laughter. My family of six chuckled just once."
    },
    {
      "rating": "3",
      "text": "I personally tried to like this movie, but there are many things wrong about it.\r1) The humor is terrible and makes no sense\r2) The plot line was confusing\r3) The movie had many Unnecessary parts\rI highly don't recommend it"
    },
    {
      "rating": "8",
      "text": "Roald Dahl is known for the wildly successful story of Charlie and the Chocolate Factory and the equally successful (but less well known) Matilda, but the fact is that Dahl was vastly displeased with the version featuring Gene Wilder as Willy Wonka and not really happy with how Matilda turned out either. Well, I think it’s safe to say that he would not have nearly as much trouble with this surprisingly faithful adaptation to his other best seller, The BFG.\r The BFG actually follows the story of the original novel very closely. There are a few additions that don’t do much to improve the story, but it does pad out the film without it causing any harm either. Most of the scenes and dialog in this movie are lifted directly from the book and transferred well onto the screen.\r Speaking of being on the screen, all the characters are spot-on perfection in their looks. All the giants look great, the BFG looks great, Sophie looks great, they even managed to get the look of the Queen of England to be a good blend of Roald Dahl’s original drawing and the actual Queen Elizabeth. Sophie’s personality was altered a little bit to be more of a strong-willed protagonist, and the BFG himself is actually well acted in both voice and animation. The villains are kind of one dimensional, but the film is following the classic portrayal of Giants and they’re actually given plenty of screen time to even this out.\r There are nitpicky things that could have been improved. The story dragged at several places and moved a little slow, but went too fast at the parts that I would have loved to see more. The CGI for the giants isn’t the best, and it’s most noticeable in the climax of the film, but it’s at least passable and it managed to capture the look and imagination that came from the original story. The humor is rather lacking, though to be fair a lot of the jokes are directly from the book. Last but not least, the 3D is woefully underutilized. Being in a world of Giants meant that the people behind the 3D and CGI work could have had a field day of making the world seem, well, gigantic to the eyes of the viewer. But save for a few key scenes, they went with very average cinematography and staging so the 3D was a total waste of money.\r This movie is not a groundbreaking masterpiece, but it was never intended to be one. It was described as a whimsical adventure full of fantasy and wonder, displaying a world of imagination and heart that only the combined talents of Roald Dahl and Stephen Spielberg could have given us. And it delivers exactly that. It could have been a little better, but it could have been far, far worse. I can see this movie quickly becoming a cult classic right next to the original Chocolate Factory film and Matilda"
    },
    {
      "rating": "5",
      "text": "The BFG is a decisively middling effort from directorial legend Steven Spielberg. Packed with breathtaking special effects and good performances from its leads, Ruby Barnhill and Mark Rylance, The BFG is a splendor-filled film that just falls flat. The film has Spielberg's trademark childlike wonder blended with more adult themes and plot elements. The special effects, again, are phenomenal. When it comes to the dreamcatching sequence, I get the sense that it will not be topped for a bit when it comes to sheer beauty. Unfortunately, the film's plot simply falls flat. Once the queen comes into play, things really take a turn for the worse. However, before that, things are not much better. The film completely lacks a sense of adventure (awful for an adventure film) and has no sense of stakes or danger. It tries to create some, but things constantly are threatened but the film never comes near following through on them, which begins to be aggravating. The BFG simply does not work. It is an odd blend of things expected in a children's film (the lack of stakes being one), yet the darker elements that make it decidedly too scary for many kids. Tragically, The BFG just does not work."
    },
    {
      "rating": "3",
      "text": "I had no real intention of seeing this and read no reviews but happened to hear Michael Medved's 4 star review on the radio.  He was ecstatic about it!  This is coming from not only a typical worthless critic not to be trusted, but a former film critic pretending he still is one.  He compared it to \"E.T.\" (10 rating for me) and said, \"You'll love it!\" meaning I guess anyone.  Well pretty much everyone did love \"E.T.\" because it was a brilliant modern day sci-fi fairy tale told as a story that fit contemporary times.  Though that movie has dated a bit, it's still a classic for all ages, eight to eighty.  This one on the other hand is a true fairy tale (as Steven himself claims), and is closer to his all time career low point \"Hook\" (2 rating).  It will only be entertaining for the very young I'd say.  Not only did I not love it as promised by Mr. Medved but found it an incredible bore!  This is despite the high production value effects and Spielberg's signature craft and visual artistry along with the usual wonderful John Williams score (though sorry to say it sounds like I've heard it a hundred times before) all of which were put to much better use in previous Spielberg efforts.\rThe Spielberg brand is better suited not adapting other brands.  He's too gifted as an original artist."
    },
    {
      "rating": "6",
      "text": "Steven Spielberg's rendition of the BFG makes for a sweet film, but lacks in driving home the all important themes set out by Roald Dahl. The way the movie is shot makes for some engaging sequences and moments, but the heavy use on CGI can be off-putting at times. Overall, the story is touching at times, but falls slightly short in delivering the big moments."
    },
    {
      "rating": "6",
      "text": "“The BFG” es una linda adaptación del libro homónimo de Roald Dahl, es una aventura de fantasía con grandes efectos especiales y una cuasi perfecta animación por computadoras.\rLa narrativa es un poco lenta pero es bien acompañada visualmente en conjunto con la banda sonora, haciendo que el material sea más fácil de procesar.\rÉsta propuesta de Disney y Spielberg es muy atractiva, tiene un leguaje particular por lo que mi recomendación es verla en su idioma nativo y con una buena calidad de imagen."
    },
    {
      "rating": "2",
      "text": "The opening twenty minutes are far too creepy, sinister and scary for a PG movie. This really should have been a 12 or 12A. Both my kids (5 and 8) were too terrified to stick it out waiting for something fun to happen."
    },
    {
      "rating": "0",
      "text": "BFG is drolly and has nothing to offer clearly Spielberg has enter the end of his career. This marks another low for Spielberg. It is to childish for summer clearly should have been a December release."
    },
    {
      "rating": "0",
      "text": "100% pure garbage movie. The jokes are horrible and made me cringe. The plot goes absolutely nowhere and makes no sense. The emotional moments completely fall flat and also make me cringe. The movie itself doesn't even know what it wants to be. It's horrible."
    },
    {
      "rating": "10",
      "text": "It's already not the end of 2016, yet this (in my opinion) is the best film everyone could see of this year. The story was actually clever, like I didn't even knew it was based on the book named the same thing, especially if it's coming from Steven Spielberg, a great director and filmmaker. The characters are all lovable (especially all the dumb giants you're randomly seeing), the visual effects feels stereoscopic, but that's not all. It's surely Disney, but it feels like it could be distributed by any film studio other than Disney. The best part about this is that it was released on my birthday. You could say.It's already not the end of 2016, yet this (in my opinion) is the best film everyone could see of this year. The story was actually clever, like I didn't even knew it was based on the book named the same thing, especially if it's coming from Steven Spielberg, a great director and filmmaker. The characters are all lovable (especially all the dumb giants you're randomly seeing), the visual effects feels stereoscopic, but that's not all. It's surely Disney, but it feels like it could be distributed by any film studio other than Disney. The best part about this is that it was released on my birthday. You could say... best birthday gift ever, right? Don't listen to those scrubs who think movies like Warcraft and Hardcore Henry could make the front page. This is instantly going to make to the front page. It's only recommended to those with no fear of giants, otherwise good luck with this film... best birthday gift ever, right? Don't listen to those scrubs who think movies like Warcraft and Hardcore Henry could make the front page. This is instantly going to make to the front page. It's only recommended to those with no fear of giants, otherwise good luck with this film."
    },
    {
      "rating": "6",
      "text": "\"The BFG\" stays true to it's source material. It is also well shot, well intentioned, well acted, and funny. However, the pacing is wildly uneven and flat in places."
    },
    {
      "rating": "10",
      "text": "Watching it again, I'm struck with how much visual poetry there is.  Sadly the failure of Cloud Atlas, Jupiter Rising and Valerian tells me the savvy Cultural Creative audience which supported art-ful movies in the 1980s-1990s, has not existed since about 2005 or 2010.  Secondly I'm struck again at how BFG conveys a spiritual message--undoubtedly unintentionally.  The Big Friendly Giant is about as good a metaphor as you are going to get thru a family-friendly movie about \"God is my Partner.\"  Indeed, it's a short step from  \"Big Friendly Giant\" to \"Big Friendly God.\"  I don't accept this is frivolous speculation, a crucial scene is right before the final giant battle-capture, where Sophie and BFG acknowledge each other's individuality, each other's uniqueness and honor each other's choices.  What more would you want from a Big Friendly God?"
    },
    {
      "rating": "10",
      "text": "Wow, another gem perhaps too heartfelt and subtle in its pleasures for critics and audiences. I agree with the user reviewer suggesting this as the best movie if 2016 so far.  What none of the critics here mention is this is a movie about honor, honoring the different in another, honoring your own ability to \"stretch\" beyond your previous comfort zone, honoring the new and unexpected in the world and in your self.\r Now, if I pitched that to a studio, do you think the movie would be green-lit?  Probably not.  Still this I think are the highpoints of the film, entirely in keeping with what the critics did like about this.\r Not a spiritual film in any sense, it still demonstrates many positive, uplifting values.  that's why I give it a ten.\r It's a techno miracle for sure, likely to win the oscar for SFX.  However as Harvey Weinstein says, the best special effect is actors showing you human emotions in a way you can connect with.  The two leads do this way beyond any other film this year so far.\r I hear critics harping on plot points when teh real pleasures of this film are heartfelt human values, chief among them, valuing and honoring another being."
    },
    {
      "rating": "7",
      "text": "It's not one of Spielberg's best, but The BFG is a charming and whimsical tale with great performances, gorgeous visuals, and likeable characters. It makes me sad that this is bombing at the box office."
    },
    {
      "rating": "4",
      "text": "Steven Spielberg, to me, is one of the greatest filmmakers of our time...a man who has become the benchmark in both the summer blockbusters and Oscar-worthy pictures. To me, there was very little he could do wrong, I loved his recent efforts such as 'Lincoln' (2012) and 'Bridge of Spies' (2015), and when I heard that he was going back to making summer movies, I couldn't wait.\r Admittedly, when I heard that a long established, Oscar-winning filmmaker like Spielberg was going to be adapting Roald Dahl's \"The BFG\", I was taken back, why would someone as powerful (now) as Spielberg be adapting such a children's classic novel that would have been at better hands from a more younger filmmaker? But, I started to think more on a positive note, the combination of Spielberg + Roald Dahl + Disney and even screenwriter, the late Melissa Mathison (who wrote the classic \"E.T.\"), this is a combination that could not fail.\r I am underwhelmed, 'The BFG' is a missed opportunity more than anything else, a movie so caught up within its magic, that it forgets to make us (the audience) invested in its story or the characters.\r The movie focuses on a little orphan girl named Sophie (Ruby Barnhill), who, after looking out her window one night, sees a mysterious giant whom she later calls \"The BFG\" (a very convincing Mark Rylance) and this giant takes her away to his hometown, known as \"Giant Country\". This is where the first disappointment comes in, as Giant Country does not look all that fascinating as it should have, but the movie does have the look of \"Harry Potter\" meets \"The Hobbit\", the aesthetic matches some of Spielberg's best talents when it comes to fantasy, but there is no deeper look, nor is there any awe of the world famous Giant Country.\r The Giant and Sophie swap some secrets and life stories with one another, the giant tells Sophie about the other giants in the town, most of whom actually eat little humans. He tries to keep her away from the evil Fleshlumpeater (Jemiane Clement) who is very vocal about wanting to eat humans. The Giant also tells Sophie about how he manages to capture dreams in jars, and how they come in the form of these mysterious floating glows in various colors. He can bring the best dreams to those who need it, and he can collect more and keep the nightmares to those who are not so worthy.\r The problems with this movie is that, for a movie that is only supposed to be 1 hour and 57 minutes long, it actually feels longer than it should. There were times where I grew restless, and the movie ponders along showing us nothing but amazing shots of whatever it is the giant presents to Sophie. There is nothing of interest going on for a long time to catch out attention. I can also confirm that the children at my theater were also fidgeting a lot, to the point where the parent accompanying them had to take them outside for a few minutes due to their boredom, and they came back just to see the last half-hour of the film.\r The way that this movie jumps from \"A\" to \"B\" seemed very abrupt, the little girl and the giant just cook up some idea to get to Buckingham Palace, and they get there and all of a sudden, the movie ends within half an hour. For the first two acts, it pondered and plodded for so long, that the movie had to end as quickly as possible to prevent the movie's run time from getting longer.\r Overall, 'The BFG' is a charming fantasy adventure, but there is a lack of thrill and excitement, no sense of wonder and no dark moments. It's just charming, but not the kind of film that will one day become a classic. For a Spielberg project, he has done better."
    },
    {
      "rating": "8",
      "text": "I liked this movie. Mostly because its pretty contemplative, is pleasing and symbolic and finally figures a way in which CGE can be used to humanized the story and find clever ways to tell it, it feels like a dream, a kid's dream. Is not the usual kids summer movie, it nos \"hype\", is melancholic but sweet, positive but a bit sour, is a story about clumsy giant and a loner girl. I agree with the critics, is a step forward and a movie to remember. I would definitely not bring my 11 yo cousin to it, he would be too old to enjoyed and too young to appreciated."
    },
    {
      "rating": "7",
      "text": "This is a charming but poorly paced film. The script is filled with the splendiferous **** of the novel, which does make it somewhat difficult to follow initially, and there are some delightfully beautiful cinematic moments that almost make seeing this in 3D worthwhile, but there's not much else here. The children in the cinema were delighted with the third act, which is what saves this film, but the laboured build up and stuttering storyline made it initially disappointing. The performances are good but not brilliant, hampered by the heavy reliance on CGI which resulted in some unfocused moments. A nice film, but not a splendiferous one. 7.02/10"
    },
    {
      "rating": "9",
      "text": "\"The BFG\" Is A Colossal Adaptation Worthy of Disney\r \"The BFG\" brings back to film industry to Steven Spielberg with a genuine work aimed at adults and infants that covets to has the same impact than the previous classics of the director, nevertheless, his film does not capture such pleasures.\r The central axis of the film is Sophie (newcomer Ruby Barnhill), an orphan of 11 years old suffers child insomnia, her disorder makes she believes in \"the witching hour\", moment in which children of all the world are kidnapped by unidentified creatures. Sophie is kidnapped by the BFG (Rylance), who takes her to his home, which is beyond of Great Britain, beyond of mountain chains, more beyond of cloudscape. The apparent giant lives there, in a rustic house under a crag, however, he coexists with nine giants more, which belong to different alimentary prototypes, but, they concur with one special ideal: humiliate tremendously to the oldest and smallest of their countrymen. The BFG is the most diminutive (based on height) of his kind, nevertheless, has the heart more sensitive than others of his class; eating rotten and nasty vegetables and preparing his sleepy potions the giant spends his days, even so, Sophie has different plans in mind.\r The film is full of significant elements cared for thoroughly, it is in charge of each small visual and aural detail, it is in charge of each small sentimental detail. Friendship, nostalgia, pragmatism, temperance, dreaming and fighting are aspirations transmitted from beginning to end, thanks to the detailed atmosphere engendered by Spielberg and his crew.\r The first collaboration between Walt Disney Pictures and Amblin Entertainment (Spielberg's company) guarantees comfortable and suggestive expectations. Based on the British literature of Roald Dahl, \"The BFG\" is an adventure reflectively intimate and fascinating. Melissa Mathison (\"ET\") adapted wonderfully the pages of Dahl creating a trip completely familiar and faithful. Mark Rylance (2016 Oscar Winner for Actor in a Supporting Role for \"Bridge of Spies\") portrays a marginalized giant who lives with encapsulated dreams and rotten vegetables in a country where equality is under the ground. His signing up was imminent after he won gold at the Oscars Awards, and although, this was a dissimilar character to the of his statuette, the veteran actor interprets it with great lucidity and professionalism that a nomination would not be coincidental the next year. Rylance sustains the film, his unique vocabulary and his aspects captured with CGI costumes adorn and venerate the complexity of the original storytelling, creating an eminent interpretation. Barnhill is beginner in the profession, she did not get the impact of Jacob Tremblay in \"Room\" film, since she was not the typical girl that asks for everything and conveyed femininity, she is a leader, an orphan who knows distinguish between reality and unreality, nevertheless, she is left to hypnotize by the imaginary fantasies of the tale Dahl.\r Whatever is the project that Spielberg takes to the big screen will have colossal greediness, Why?. As one of the best directors of the century, Steven Allan Spielberg captivated us with works worthy of carry his name, stories that are changed in classic instant and that have helped to forge the childhood of hundreds of people, who has not seen at least one of his films; this man is a cinematic god, a perpetual director, screenwriter, editor, producer and designer that guarantees monumental successes until the end of his days. For these and thousands of reasons do not leave of surprise us his last invention, which not manages to get that gleaming shine of his golden years, Yes, it is an excellent movie in all the parameters, but with Spielberg the word \"excellent\" not is impassable.\r Assiduously, the film takes advantage of his majesty and inventive, Spielberg knows how to handle to the perfection his elements, the dreams tree or the escape of London leverage the splendor visual impregnated by colors, reflections, and lights. The ambitions were excessive and although \"The BFG\" tried to be \"E.T.\" for the new generations would be Utopian; we are in an age where children are more mature and developed than any adult mind, there are not already girls who believed in fairies or children who wished to have an alien friend, those times have already passed and BFG receives a hard blow with reality. Spielberg demonstrates that still has strength and imagination in his films; \"The BFG\" survives by its own merits and is not necessary to compare it with a classic, an independent and well developed product that transforms the darkness of the original story for children into an adventure full of dreams, colors and expectations that  preserve the hard-work of Rylance and Spielberg, and of course, the debut of Ruby Barnhill."
    },
    {
      "rating": "7",
      "text": "Its just good thats all. At the beginning it was kinda boring and meh. But it picked up the pace in the good factor and became a good story instead of a boring one."
    },
    {
      "rating": "6",
      "text": "Steven Spielberg’s The BFG is one of the most visually beautiful movies I have seen in a long time. Seriously it’s a very pretty movie. As for the rest of it, I guess you could say Spielberg has set the bar very high and this doesn’t quite reach the standard. Great performances from all, particularly Ruby Barnhill, and topped off with another terrific score from John Williams. Recommended."
    },
    {
      "rating": "8",
      "text": "This is one of Spielberg's weakest feature in my opinion, which just means that this is not an amazing movie. It is a very good one though and if I didn't know Spielberg can do better I would say it's a great movie. So don't go into the movie theater with incredibly high expectations just because of the director, specially if you are an adult (unless you have young kids or a used to interact with kids, I think that then you might have a greater ability to get in the mood for this movie than I do). This is a very nice movie for kids and I am sure that if I were something like 8 I would have loved it! I am almost two decades older than that and I could enjoy it and have a great time anyway. The cinematography, the design, and the soundtrack are of the highest quality you can find these days. So if you are thinking about watching it the movie theater but you're not sure if it is worthy, be sure it is. You won't be frustrated with this movie, but you won't see Spielberg doing a timeless piece as he usually does, that's all and, in the end of the day, who cares? The man already made history as a director/film maker anyway."
    },
    {
      "rating": "4",
      "text": "Steven Spielberg sin duda alguna tiene varias películas memorables que se convirtieron instantáneamente en clásicos; pero The BFG no es una de esas películas."
    },
    {
      "rating": "7",
      "text": "A well intended effort from director Steven Spielberg, The BFG uses Mark Rylance's committed performance as fuel to deliver an adventure story that many say is \"too faithful\" to the book and lacks in depth and humor. Many, however, will marvel at the beautiful special effects and stellar acting."
    },
    {
      "rating": "7",
      "text": "Good movie but I just think the jokes and the acting is really mediocre. Everything else ranges from okay to good but this movie ain't the best movie of the year."
    },
    {
      "rating": "5",
      "text": "Solid CGI and good acting does not necessarily make for a good film. In fact in Spielberg's 'The BFG' these are the only two elements that lift this film from being utter drivel. This story is supposed to be heartwarming, caring and loving. The story of an orphan wanting to find love and comfort only to be taken by a giant, however in this version only the latter part of that actually happens. There is no depth or development to the lead character's relationship so by the time the upbeat, happy moments take place you can't help but not really care. The lack of real villains also doesn't help. We have the bad giants but they barely seem threatening or hold little motivation. They appear to want to eat the little girl but in comparison that is like me and nine friends fighting over a Twix! Mark Rylance does put in a solid performance but newcomer Ruby Barnhill makes Sophie annoying. This may be down to her inexperience in front of the camera or Spielberg's lack of direction. Despite the heavy CGI and motion capture this feels like Spielberg's most lethargic film in a long time. The emphasis has gone mainly into the visuals rather than telling a beautiful tale. The visuals at times do look stunning but it all becomes meaningless when there is no depth. It was actually the daftest part of the movie where I found myself more engaged and that is when I knew this movie just didn't do it for me. This doesn't know ultimately what it's trying to do and for someone I know who adored the original book and movie, this was a real disappointment."
    },
    {
      "rating": "10",
      "text": "A very good film of Steven Spielberg, an excellent director who has given us great moments in film history. Mark Rylance and Ruby Barnhill are fantastic, great performance, good music of John Williams, and wonderful story."
    },
    {
      "rating": "6",
      "text": "The BFG, or Big Friendly Giant's greatest achievement is the visual effects. The details are amazing and the majority of scenes are simply beautiful. Mark Rylance's vocal performance is calm and soothing, giving the BFG his titular name. The little girl Sophie also performs quite well. Steven Spielberg's direction gives the BFG an old fashioned feel and conveys warmth. This easily is the most heartwarming film so far this year and I left the theatre with a smile on my face. However, despite the cuteness and great effects, there's sadly not much else. The simple story is fine, but the film is overlong. The pacing is too slow and several scenes go on for far too long. For comparison, Willa Wonka and the Chocolate Factory; another film based from a Roald Dahl book; was 1 hour 29 minutes. This is a full 2 hours. Had the BFG been 30 minutes shorter, had faster pacing, and more action; it would had been perfect. But as is, the BFG is a beautiful, simple, and cute movie; although overlong, boring in places, and lacking much action."
    },
    {
      "rating": "3",
      "text": "I found this to be a very boring movie. I've heard it been marketed as this generation's E.T., the return of Spielberg's magic, but for me that magic got lost in between fart jokes and cartoonish giant CGI bullies. The only admirable aspect of this movie is the beauty of some scenes (specially the one on the Tree of Dreams) which combined with the score made up some great cinematic moments.\rIf you are a big fan of the book or just want to watch everything Spielberg related go on and watch it, you might like it. It seems also very effective for kids, the ones on my theatre loved it. But as for me, this movie did nothing."
    },
    {
      "rating": "4",
      "text": "This is my opinion, so don't hate me for this: This is a dull and boring remake that is pointless and doesn't capture the greatness like the original does. It is a decent movie as a stand alone film though."
    },
    {
      "rating": "7",
      "text": "After watching the preview for The BFG in theaters, I didn't have a desire to see it because the preview didn't grab me.  After discovering it is directed by Spielberg I decided to watch it.  Glad I did.  Loved the first half of the film.  The second half, which gets really silly, not as much.  As always, Spielberg gets a first class performance from a child actor (Ruby Barnhill) and a terrific performance from Mark Rylance as the giant.  If you have a great subwoofer and want to show it off, this is the film for you.  When the girl first meets the giant his footsteps and movements will make your entire house shake!  Overall I really enjoyed the film."
    },
    {
      "rating": "5",
      "text": "Strong visually but the story plods along without excitement or wit. Disappointing."
    },
    {
      "rating": "6",
      "text": "This live-action adaptation of Roald Dahl's classic children's novel exists in a manner similar to that of the titular character at hand. It's sweet and wholesome, yet characteristically oddball and strange. And for the \"BFG\" film in particular, these more peculiar elements tend to come about in the latter half of things, where a very unpredictable narrative left turn ultimately leaves the audience uttering, \". . .huh?\" The confusion, on the part of this audience member at least, lasts only a little while, however, with the film's charm and visual splendor eventually lulling you back into the typical Spielbergian state of genuine entertainment. It's not one of his better told stories -- namely due to the idiosyncratic stylings of Dahl doing him in, methinks -- but it still looks and feels good."
    },
    {
      "rating": "6",
      "text": "Little Sophie's giant adventure.I did not dislike it, but I thought it was not creative enough. I had seen the British animation and this one retained the same story. Of course, which was originally from the book, but nothing new other than a decent computer graphics. I liked the performance of the little girl who had played the Sophie. She was the only live character until the final stage where more joins her. So she was wonderful along with Mark Rylance's CGI role.Straight to the point, the adventure begins right away. Sophie, the ten year old orphan girl was snatched by a giant named BFG after she witnessed him wandering on the street through her dorm room window on one midnight. Fearing she might expose the giant's existence, so he had to take her with him to his country. Then there they become very close, but a new threat arises when the other giants suspect of a human's existence in their enclosure. So fighting them, followed by a permanent solution to menace caused by them is what narrated in the rest.It was like Peter Jackson's 'The Lovely Bones' for Steven Spielberg, I mean the films that did not work for them. I anticipated a major surge in this by the family film specialist Spielber. Because I usually love his film, tell me who won't. From children to adults, his films targets all ages. But if you had seen the old version, then you will lose half the interest. That's definitely won't be the same for the kids, they will love it. There's no harm for watching it once, so go for it.6/10"
    },
    {
      "rating": "7",
      "text": "The BFG has a big magical feel, but while I appreciated that typical Spielberg touch it didn't all hit for me.  Not to say the film isn't good it just lacks some of wonder and adventure that I was looking for. Overall it's just solid.  B"
    },
    {
      "rating": "7",
      "text": "The BFG was an enjoyable film, but did not live up to the hype nor quality expected of Spielberg.  The film did have its moments of magic and wonder, but also had long periods that were flat and rather dry. It also failed to draw my son in even though he was surely the target audience range."
    },
    {
      "rating": "3",
      "text": "I understand that i am not yhe demographic for this but god this was painful to watch. Whilst a whimsical and fantastical world is created here it is filled with virtually no plot or key scenes and nothing ever really happens in it. The finale is a joke. Film is also filled with flatulance jokes and is just dull all the way through. The scene with the queen was awful to watch.\r 3/10"
    },
    {
      "rating": "8",
      "text": "Dhal's classic childrens novel finally gets the hollywood treatment in Spielberg's enchanting 2016 take on BFG. Having not read this story since a was a child, I was immediately captivated by the way some of the key moments from the story (from my 25 year old memory of reading the book the opening scenes of sophie opening her window with the long curtains) were realized in full hollywood style. The cast is exceptional with Mark Rylance and Ruby Barnhill delivering memorable performances. I had a lot of fun watching this movie and highly recommend it if you enjoy the pure escapism of the fantasy adventure genre."
    },
    {
      "rating": "9",
      "text": "as an adaptation of the book it feels a bit padded given the short length of source material and it suffers from a bit of an anticlimax but this was a really nice, charming family film. Mark Rylance gives a great motion capture performance and it's clear between this and Tintin that Spielberg is a master of directing motion capture. the environments look  great, the story is well told and it's really funny. I'm not a fan of the term one for the whole family since i believe it rarely  works out however in this case i think it applies because it has a lot of universal appeal"
    },
    {
      "rating": "6",
      "text": "\"The BFG\" is decent at best. Which is a real shame, because it's directed by the greatest and the most iconic film makers of all time. You'd expect more from Spielberg after last year \"Bridge of Spies\". Coming to think of it, I can't believe Spielberg directed this. Even with all the bright colors and the bizarre adventures, I still felt I was missing something.But I don't hate the movie. It dose have it's magical and sweet moments that separates it from being a miss fire. Ruby Barnhill as Sophie was pretty good and it proves that there are good kids actors out there. But the saving grace of the movie is Mark Rylance (as the BFG) who really made this movie watchable. Rylance captures the lovable, fun, and joyful giant from Roald Dahl's book. The film itself is technically well done and it's not boring, but quite enjoyable."
    },
    {
      "rating": "7",
      "text": "Movie was good. The performances by Mark Rylance and Ruby Barnhill were absolutely great. Spielberg always seems to get really good child actors. The CGI was unbelievably impressive. The movie at parts was a bit slow but you never get bored. The movie was a bit odd near the end too. Maybe it's just me .This isn't one of Spielberg's bests but it's still good."
    },
    {
      "rating": "4",
      "text": "I'd say this is more of a children's film than a family film.  The jokes were a lot of body humor, and the plot was very simplistic.  The high point for me was the actor who played the BFG himself, who was lovely.  I wish they had emphasized his personal story a bit more, but I guess they thought that would have been too dark for children."
    },
    {
      "rating": "6",
      "text": "A rather strange story about giants who live amongst us, this one giving us dreams that he collects in Giant Land.  Maybe he's the Sandman.  From that premise, we flesh out a story with even bigger, mean, giants and the BFG's relationship with an orphan girl."
    },
    {
      "rating": "9",
      "text": "Spielberg perfectly captures the magical story of The BFG in the best Dahl film adaption for ages, as Mark Rylance brings the friendly giant to life in the most charming, emotionally satisfying and universally appealing film of 2016."
    }
  ]
}