{
  "id": 2842,
  "title": "The Hurt Locker",
  "starring": [
    "Jeremy Renner",
    "Anthony Mackie"
  ],
  "runtime": 131,
  "genre": [
    "Drama",
    "Thriller",
    "War"
  ],
  "description": "During the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/m2duGsKjBOl3BB8uFOTnRUzdEhg.jpg",
  "categories": {
    "plot": 4.620689655172414,
    "acting": 4.714285714285714,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 5.25,
    "familyFriendly": 2.6,
    "funny": 1.0,
    "action": 5.777777777777778
  },
  "reviews": [
    {
      "rating": "0",
      "text": "this is the worst movie about iraq. its totally inaccurate. it maks EOD out to be some sort of Special Forces and they're NOT. the things they do in this awful movie are not what the do over here."
    },
    {
      "rating": "10",
      "text": "Great movie! Unlike other war movies about recent conflicts such as Jarhead, this movie is actually entertaining, with some of the best tension filled scenes you will see. And the performance by Jeremy Renner in the lead role is fantastic. I understand that many parts of the movie are \"unrealistic\", as many people have complained about, but 100% of fictional movies are unrealistic. They have spice up aspects of life to make the film entertaining. I don't believe they mean any disrespect to those in uniform. They're merely trying to make the movie entertaining for the audience. But I understand this is a sensitive subject."
    },
    {
      "rating": "3",
      "text": "This movie is not only blatantly inaccurate for a war movie, for a work of fiction it is still scripted and directed very poorly. How this movie became hyped by the press is beyond my understanding."
    },
    {
      "rating": "0",
      "text": "This movie came out while i was in Afghanistan hunting IEDs. This hero filled war porn does not reflect what we did and makes a mockery of the teams of men who worked as professional, cohesive units to do this very difficult job that the cowboy protagonist does all my himself while in a constant state of rebellion and with total neglect for the intricacies of army teamwork.  My mother saw this film it put all sorts of new dread into her for my safety. That pissed me off too. Clearly I'm biased and maybe if I were a civilian I might like this sort of film but from this Vet's perspective Hurker Locker gets two raging thumbs down."
    },
    {
      "rating": "3",
      "text": "This is a documentary masquerading as a movie. Critics may see a subtle narrative here but this is simply one staged, violent episode after another. WHY OH WHY DID THIS WIN BEST PICTURE???? Is this Hollywood at its anti-war self yet again?"
    },
    {
      "rating": "3",
      "text": "Movie looks good but is so unrealistic, but it shows why fake wrestling is so huge no brain drama."
    },
    {
      "rating": "0",
      "text": "I wanted to walk out, but stayed for my sister. I was shocked by the total lack of realism and the way EOD was portrayed. It made a mockery of the infantry guys. They don't hide!!! Makes me sick that this is getting such high marks. There are too many holes and unheard of procedures to list. Where was the consultant?? Total Hollywood movie. Many better out there."
    },
    {
      "rating": "8",
      "text": "As a character study, the film does a pretty decent job at exploring the psychological impact of war. Following a three man EOD team, there's no plot in the traditional sense, but we see how the group dynamics unfold and the eventual revealing of all their own hurts that were previously locked away. For example, William James' addiction to danger and inability to enjoy civilian life, and Sanborn's fear of dying unloved with no family to remember him by. This helps add a layer of complexity that subverts the idea of the unfazed and glorified soldier. This isn't anything new, but I thought it was an interesting character portrayal nonetheless. The film's erratic cinematography and effective use of sound also do a good job at heightening the tension and paranoia during particular scenes.\r As a realistic portrayal of war however, I say this is where things start to fall apart. I understand that there have to be some constraints in order to get the right atmosphere and drama, but the movie frames itself as one that is supposedly realistic and ends up failing this on many fronts, mainly the ridiculous military conduct of certain characters that even average moviegoers with no army experience will recognize immediately. This somewhat detracts from the authenticity and validity of whatever message the film was trying to establish."
    },
    {
      "rating": "2",
      "text": "I dont know WHAT have everyone found in this movie.Absolutely NO realism , horrible stroy about the stupid war done by American politiciand only for their own joy.Even the soldiers of US army laugh at it. You can call me stupid or something but i think - the only reason this film has got the Oscar - is because the women.You know what i am talking about.P.S I didnt want to hurt anyones feeling with my report - sorry if i did."
    },
    {
      "rating": "0",
      "text": "Please for anyone watching this move it is not at all accurate.  EOD rarely disarms bombs as it is too dangerous.  NCO's don't punch superiors in the face, you certainly would never find a SFC getting hammered drunk or sneaking off the fob by himself to interrogate someone, it is simply false.  These are huge falsehoods that completely turn the move into 100% fiction beyond the fact that the war in Iraq actually happened.  These would be the kinds of stories you would hear from an EOD private who was in the Green Zone for 12 months.  Anyone else who ever set foot in the middle east can tell you what a complete load of BS this movie really is.\r People may think that even an inaccurate war movie is better than none but that is simply not the case.  This movie is an insult to everyone who spent even one second in Iraq and I am still amazed that it actually won an Oscar.  That is just a travesty."
    },
    {
      "rating": "0",
      "text": "As a Soldier, I had high hopes for this film. I'd heard great things, and couldn't wait to check it out. I was utterly disappointed - I heard over and over again that this movie captured what it's \"really like over there.\" All it proved is that no one in Hollywood has a clue. Still."
    },
    {
      "rating": "0",
      "text": "all my EOD friends thing this movie is the best comedy scifi they've ever seen. complete garbage, oscar winning my ass. I know people complain that it's a movie not a documentry, but come on you have to stick to reality at least a little bit. the scene where he pulls all those heavy artillary pieces out of the ground by the det cord and blasting caps... come on was he superman? each one of those wieghs at least 50 pounds. This movie was \"based\" off of a soldiers EOD experience, if he had done half of what he said he did in the movie he'd still be jail. this is just another movie made to get an Oscar, nothing more"
    },
    {
      "rating": "3",
      "text": "Its a downward spiral with overated movies. Inception,Monsters. I cant help but think its the pitch and the hype that does it when the Emperor has no clothes. Lets say its 'Eagerly awaited, theirs 'Oscar Buzz' before it even comes out and without paying attention that the 'Buzz' is coming from the people who market the movie.  I dont care who your are and how much you say you like this, I say your lying to yourself as its slow paced and boring (odd for a explosives movie) yet I argue with a mass of people who are eager for the new McMsg burger because someone on tv told them to."
    },
    {
      "rating": "10",
      "text": "Easily the best movie made about the Iraq War, and one of the most memorable war movies I've seen in general. The director, Kathryn Bigelow, charges almost every scene with suspense and tension, producing action sequences more exhilarating and gripping than most high-budget blockbusters. Also, wtf with people complaining about the movie's real-life credibility? It's not like \"Apocalypse Now\" represented the Vietnam War as it was, it just tried to be a great movie, which it was and \"The Hurt Locker\" is the same."
    },
    {
      "rating": "1",
      "text": "This is an excellent example of the politics of movie making. It's been said that this movie will demonstrate how the war in Iraq is remembered. This upsets me due to the lack of realism. Most noticeably, the fact that three soldiers do not run into the darkness alone to chase something that they may have seen. Nor did we risk soldiers to defuse bombs past the first months. Further, it's a rip off of the Lethal Weapon prototype. Unstable white guy paired with veteran black guy and they have over the top adventure. But the real insult? From the accounts of multiple vets, I have been told that District 9 was more realistic as far as reminding them of combat situations."
    },
    {
      "rating": "5",
      "text": "Overrated movie, with unrealistic characters and no real story.  Too much stupid Bravado and machismo.  I am reviewing this because Zero Dark Thirty is out and while Katherine Bigelow is sexy, she only got to be a director, because she was married To James Cameron. Nepotism.  I have no interest in seeing more fictional US military drama.  I'll pass.  Hurt locker was not that good."
    },
    {
      "rating": "10",
      "text": "To all of you military types complaining that this movie wasn't realistic enough, it's not a documentary. It's a work of fiction. Period. The Hurt Locker isn't concerned with the nuts and bolts of making every tiny detail as 100% accurate as possible. If you want that, watch the Military Channel, or better yet go re-enlist and get shipped back over there if want an \"authentic\" experience. This is the first war movie in ages that paints its soldiers as real, complex people instead of cartoons or psychos, and all you can do is complain? Sheesh. Luckily, for the rest of us, this film will do just fine, because the enlightened viewer will realize that The Hurt Locker isn't about the details, but the big picture. It's a document of what a war like this means and how it affects the participants on both sides. It's neither pro-war nor anti-war, but instead just shows the ways things are without pronouncing judgment on its characters or their actions. It's also a showcase for some of the most impressive action and suspense set pieces to grace the cinema in a very long time. Hard, sharp, and honest, The Hurt Locker is one of the year's very best films. THAT'S the reality."
    },
    {
      "rating": "8",
      "text": "A great film but you have to be in the right mood to watch it. Not worth an Oscar by any stretch. However there should be more film like this...ones where you need at least half a functioning brain to enjoy."
    },
    {
      "rating": "1",
      "text": "This film was garbage. I couldn't help laughing during the dramatic chase scene at the end of the movie, the tense sniper battle in the desert, the vigilante soldier's escape from his FOB, and the crazy soldiers drinking whiskey in their room. All four of these scenes were unrealistic. A British merc is unable to use a .50 cal sniper rifle to kill an insurgent sniper who is 350 meters away? Want to know how to kill an insurgent at 350 meters away? Pick-up your M-4 and use your scope to shoot him. I had trouble watching this film because it was so unrealistic and boring. I hope people don't consider The Hurt Locker to be THE Iraq War movie. If you want to see a good movie about the war, watch Generation Kill."
    },
    {
      "rating": "4",
      "text": "This movie works only because it appears so real, it's the source of the suspense, the action, the atmosphere, characters, plot... etc. This is also why it fails. While it may be more accurate than many other war movies, this one was built on realism. However an informed viewer will note that the movie does not portray well the soldiers' lives and the Iraq war. Many bomb squad members said so themselves, including the ones that were interviewed by the movie makers. All the portrayed military operations are inaccurate. This movie is a lie. However can it still be viewed as a regular war action movie? I'm afraid not. Without the sense of reality the movie loses all interest. To conclude, not only does this movie fail at what it sells for, which is a close enough portrayal of wartime, it also fails as an action movie. The only praise I can give is the amazing work achieved by the actors. You will enjoy this movie though if you do not know much about the Iraq war, like most Americans unfortunately."
    },
    {
      "rating": "4",
      "text": "This is a movie about bombs. Lots of bombs. Desert bombs.\r The End.\r That's pretty much it. Oh sure, a few other things happened. You wanna hear about 'em? OK. I'll provide you with a little more, oh faithful reader.\r I'm still not sure what the title The Hurt Locker refers to. It's not about well-secured first aid kits, nor is it about gymnasium facilities for actors William, John, or even Mary Beth.\r This celluloid endeavor was directed by Kathryn Bigelow; the deft hand behind such legendary screen classics as Point Break and Blue Steel. It stars Jeremy Renner as Staff Sergeant William James, an expert at diffusing bombs. Joining him on the Explosivity Disposaling Unit are Sergeant JT Sanborn (Anthony Mackie), and Owen Eldrige (Brian Geraghty)\r Renner has been nominated for an Academy Award for his performance. I'm not sure why this is. The supporting performances  most notably Mackie's  were, in my opinion, superior. All Renner did was act \"cool\". Oh, so \"cool\". Desert \"cool\". But if looking \"cool\" is the only criterion used for award recognition, then David Caruso should be nominated for a Nobel Prize.\r The film centers mostly on the antics of Sergeant James. James loves dismantling things that can blow you into a zillion pieces. He'd rather do that than live a peaceful life in a nice home with his beautiful wife. We're shown some of his domestic life, but the movie doesn't show the good stuff. No. Instead we see him cleaning out the eavestrough of his house.\r Now I've cleaned out a few roof gutters in my time, but the one depicted here has to be the gunkiest gutter in the history of home maintenance. And he's cleaning it out with his bare hand!!! C'mon, use a scoop, or a trowel, or a toy shovel, a stick, a shoe, anything. I'd rather diffuse bombs in Iraq than have to clean out that gutter in that fashion.\r Another scene worth mentioning shows the guys  after getting a little snockered  engaging in an activity where good judgment and mental acuity would be a distinct disadvantage. The \"game\" involves taking turns hitting each other as hard as possible in the stomach. My wife, while watching this powerful and touching scene, turned to me and asked, \"Why do men do those kind of things?\"\r You know, we men just have to chuckle when women ask us such questions. It was obvious to me, but I patiently explained it to her that this was a gesture of endearment. Women hug. Men try to smash the bejabers out of each other. It's their way of saying, \"You're OK in my book.\" And nothing says it better than a ruptured spleen.\r A word of warning here to those prone to seasickness: the camerawork in this film is of that hand-held style that so many directors are wont to use these days. I suppose they feel it gives their movies that gritty, realistic, documentary look  which is ironic, since documentary filmmakers rarely use the technique anymore. Besides, if it's supposed to look realistic, then why don't I see the real world that way through my eyes? Although if I did, I'd be making an appointment  and pronto  with an ophthalmologist or a brain surgeon.\r If you have a tough time watching this film due to that camera style, then avoid The Bourne Ultimatum at all costs. You would not survive. Its visuals are worse than any bone-jarring experience you could imagine\r I once took a ride on a gigantically tall roller coaster. Its peak disappeared into the clouds. It was called the Red Ripper, or the Brown Streak, or the Green Puker  something like that. Anyway, all I know is that I was smiling after that ride. I wasn't smiling after The Bourne Ultimatum.\r In closing, I should say that even though I had some reservations about renting the DVD of The Hurt Locker, I was able to take something positive from it  a lesson.\r The lesson learned is, pay attention to your reservations."
    },
    {
      "rating": "0",
      "text": "the worst movie I've seen.... is not about war.... is about American idea of hero... Its boring and don't have argument ... I can't understand how this movie won an oscar"
    },
    {
      "rating": "5",
      "text": "Entertaining, yet not anywhere near to reality. You wouldn't go off base by yourself without your gear. You wouldn't do half of the things they they did in this movie.\r And action movie this is, an accurate one it is not. The portrayal of pstd was abysmal at best, and they way they wrote it off was sickening."
    },
    {
      "rating": "8",
      "text": "Personally, I don't feel that \"The Hurt Locker\" deserved all those Oscar awards and that it's slightly overrated but I don't deny that it's a really damn good film. It's tense, complex, violent and action-packed. The story is well planned and written and the acting is fabulous."
    },
    {
      "rating": "2",
      "text": "This piece of crap won Academy Awards? What a sad state of affairs the film industry is in."
    },
    {
      "rating": "1",
      "text": "I have completed 2 tours in Iraq and Afghanistan with the US ARMY. This was by far the worst movie I have ever seen. Nothing in this movie is the way things are done over there. Nobody drives around by themselves! Nobody leaves their FOB by themselves to \"investigate\" somebody. EOD does not even come out at night. They wait until the next day to use the robot to blow up the IED. They hardly ever, ever make \"the walk\" as the movie so ridiculously put it. Anyway, do not think this movie is the way it is. This movie is complete make believe!!!"
    },
    {
      "rating": "2",
      "text": "this movie is a disgrace to the armed forces and has debased the Academy Awards by winning the Oscar for best movie. If you like cowboy movies, you'll recognise the characters but feel let down by pretty much everything else."
    },
    {
      "rating": "1",
      "text": "An awful movie ! how this is up for 9 oscars ill never know, poor storyline, many errors in the film, such as a guy being able to pick up a barrett 50cal and with less than 5 shot be totally comfortable with a weapon like that!! utter rubbish even fully trained snipers very rarely get there hands on a Barrett and to be able to pick off a moving target with a headshot at what looked to be upwards of 800m is near on impossible for the world best let alone a bomb disposal guy who had just picked it up with no idea how the weapon is zeroed in !!!!! utter rubbish!!!! best War film in Years ??? give me a break!!!"
    },
    {
      "rating": "7",
      "text": "The movie's quiet tension adds realism to the movie, making it one of the true modern war films. However, the film's noticeably lethargic pace will make you bored. In the end, \"The Hurt Locker\" is just a decent movie that presents real life situations in modern warfare; no more, no less."
    },
    {
      "rating": "1",
      "text": "Anybody who has been over to Iraq will laugh at this movie. It's a joke. It's almost as if the creators of this movie didn't get any professional military input at all. Whats frustrating for me, as well as everybody else who has been there and done that, is that they sold this movie and advertised it as the \"real deal\" and how this is a good example of \"what things are really like over there\". There are so many innaccuracies in this movie, some downright lies, that it was hard for me to watch and take it seriously. From that viewpoint, this was absolutely the worst movie of the year. It could have been a decent movie had they not made it out to be this realistic war drama about life in Iraq."
    },
    {
      "rating": "1",
      "text": "I am so glad some of our men and women in the armed forces are speaking up about the inaccuracies in this film. I didn't like this film for other reasons, but know that I have read their comments here, I am angry, appalled and embarrassed. Bigelow didn't claim this film is realistic, but she sure seemed to try to pass it off as such, and the critics and others ate it right up. I truely am embarrassed that this film is getting the \"special treatment\" from critics that should know better. Sad."
    },
    {
      "rating": "3",
      "text": "I realize I'm way in the minority on not liking this movie. Like Jarhead, this is another movie that portrays most in the military as pychos or malcontents. Is it too hard to have a more balanced view? Yes, there are some of these types in the military, but the majority are great Americans. On a side note, anyone in the military will just shake their heads at quite a few implausible situations."
    },
    {
      "rating": "0",
      "text": "That people are giving this movie a ten, and that it won an Oscar shows just how desperately out of touch Americans are. Gross inaccuracies aside, and this movie is riven with them, the fact that this director had so much going for her in terms of the innate interest stories like this generate, and the timeliness of its release, and she blew it so completely, is very telling. It tells of incompetence,  and indifference to the people she pretends to care for and about. If she really cared, then the amateur to the stark errors she makes in this movie would have been removed, and she would have gotten at least some things right. Otherwise you're just out to make a name for yourself, and f*** you for that."
    },
    {
      "rating": "0",
      "text": "I realize this review is coming a little late but I see the same director is now birthing another one of her 'realistic' films about war  (Zero Dark Thirty).  I love hard hitting action films as much as I HATE political propaganda and that is what the Hurt Locker is.  I was completely bored with the \"crazy-American-cowboy standing-alone -against-all-the-whimps\" theme.  Maybe this film director/writer should  join up and see what a real war feels like."
    },
    {
      "rating": "10",
      "text": "I am a Marine combat veteran and I rate this movie as the most realistic war movie I've ever seen. It really captures the intensity and the individuality of combat and the changes it causes in all of its participants. Movies like Full Metal Jacket and Apoclypse Now and even Saving Private Ryan are cartoons - Hollywood director's fantasies of what war and conflict are. Most war movies are laden false events and dramatic devices and political \"messages\" but Hurt Locker embraces the realities of war and the people in them. This is a movie I'll keep for my children and grandchildren to show when they ask me what war was like."
    },
    {
      "rating": "3",
      "text": "12th greatest film of all time? Give me a break!! Absurdly overrated, notably by American critics. The characters are unrealistic and are insulting to the highly trained extremely well disciplined soldiers that risk their lives detecting and disposing of IED every day. The sniper section is unrealistic, with a headshot on a moving target at some considerable distance. There is no plot - this film is just a sequence of set pieces. The film has no emotional centre and lacks character development - you feel nothing for the characters at the end. The score is unmemorable. The acting average. It does have good ideas, but on the whole it is poorly executed. 9 oscars was a vote in support of the war effort, not in support of the quality of this film. Downright poor."
    },
    {
      "rating": "0",
      "text": "I am still deployed and this is truly the worst war movie I have ever watched. Without even acknolwedging how far from the truth the tactics are and lack of security in every scene, EOD is falsely portrayed as some sort of special forces unit. I have sat on many IED's and regardless of the fact that units are not allowed to travel outside of a 3 vehicle or 4 vehicle security concept, EOD is not comprised of 3 enlisted defusing bombs. The robot is always extensively used and more importantly EOD personnel are never foolish enough to handle ready to go large ordnance to diffuse it. Every time we found an IED from 155 shells to mortar rounds, they were always blown in place. The few times an IED was taken was when it was fully dismembered by a disrupting detonation. I watched a little over half of this movie before turning it off as it was too painful and ridiculous to watch."
    },
    {
      "rating": "2",
      "text": "One of the more over-praised movies in recent memory - really just another hyperkinetic mess from Kathryn Bigelow (one of the more over-praised directors working today). The main character is a cliche, the \"loose-cannon\" action hero, only in this case there is no explanation for his risk taking. Jeremy Renner plays the character with his typical lack of range or subtlety. The only interesting actor is Ralph Fiennes as the leader of a band of mercenaries, but he's only on screen for a few minutes. Altogether a waste of time."
    },
    {
      "rating": "3",
      "text": "\"The Hurt Locker\" is, at times, very gritty and gripping entertainment. Clearly, it caught the imagination of the Hollywood Limousine Liberal reviewing establishment, who gave it very high marks and ceded it a number of significant awards.  But how good is the movie?  Not really that good.  In particular, the movie presents a very destructive and inaccurate portrayal of what soldiers are really like.  Nobody as reckless and irresponsible as the main character would last ten minutes in a special weapons unit of any kind, let alone one involved in demolition work. The fact that so many Hollywood reviewers accepted such a ridiculously inaccurate portrayal establishes that this kind of portrayal is currently Politically Correct. It is what Hollywood wants to believe soldiers are really like. A true work of art worthy of a best picture award would find the incredible drama present in the lives of our soldiers' *as they truly live them*.  Besides being inaccurate, the movie is also, in places, simply distasteful.  In constructing my final rating, I penalized it on that score."
    },
    {
      "rating": "8",
      "text": "A very, very good \" Iraq war\" movie. I liked it, but still the critics are pissing themselves too much it seems. The ratings for this movie are so great everywhere that my expectations were too high. I liked the fact that this film did not tried to get into politics also."
    },
    {
      "rating": "0",
      "text": "Terrible garbage. Not worth watching. The director should go back to film school and actually learn how to film a movie. Do not waste your time. There is a reason this film did not get wide release. It is utter garbage."
    },
    {
      "rating": "3",
      "text": "Considering the reviews, I was thoroughly disappointed. It simply failed to engage me. It felt like a horrible waste of 2 hours. At this point, I can only hope the critics don't waste any more energy promoting this one during awards season."
    },
    {
      "rating": "9",
      "text": "When Sergeant James takes over a highly trained bomb disposal team stationed in Iraq, he surprises his team with his reckless and dangerous methods. As the battle continues all around them the team attempt to curb their new leader before his actions have serious consequences for everyone.\r With explosives everywhere and every civilian a potential enemy The Hurt Locker brilliantly portrays the intense nature of working and living in war torn territory. The movie is about far more than just men blowing things up however and as the movie unfolds we learn about the motivations of each of the men involved giving us a fascinating insight into their world.\r With brilliant performances all round The Hurt Locker is one of the best war movies ever made."
    },
    {
      "rating": "6",
      "text": "This is a great set up for what could be a killer war movie. But it isnâ"
    },
    {
      "rating": "9",
      "text": "I liked it. I thought the movie was original (which is rare these days) and well worth the watch. The acting was good, the movie was suspensful. The one flaw with it is that the climax wasnt satisfying. The entire film built up to this point that just totally let me down, Even to the point where it was a bit predictable. Still, It was a good film and worth the watch.\r IMO - Definently more worthy than Avatar to win the oscar for best picture."
    },
    {
      "rating": "8",
      "text": "The Hurter Locker might not be the best movie of the year but it certainly deserves more recongnition. A movie with such intense scenes and perfect editing that combines the drug of war within and on the ground."
    },
    {
      "rating": "1",
      "text": "I cannot deny that 'The Hurt Locker' has a very specific power that does, in a way, attract people to it. It is a very boldly done war film about all the individual consequences of a war, something that has not been a standard topic of the genre. Yet, I was bitterly disappointed by it all, as it proved to be a disgustingly blatant work of American propaganda, whereby their political aggression is presented as a burden to those that willingly participated it. Who the f**k cares about what the war did to someone who, under the pretext of 'liberalization and democracy', behaved like a bloody dictator? I was utterly disappointed by all the awards the movie gained and I must say that the critical universal acclaim somehow escapes me, as I don't see any relevant acclaim that should be attributed to the movie. It is slow, effectively boring and dull, one-sided and biased and it actually borders some propaganda work, but without the chauvinistic subtext. But, yes, the glorification of the American Soldier (just to make it clear - America is not the problem here, it is the glorification of a phenomenon that should be condemned and I would say the exact same things if the film was about Congo, Cambodia, Britain or Guatemala) is there and it is absolutely sickening (I actually fell asleep for 20 minutes and when I woke up I concluded that I haven't missed a thing - enough said).\r I detested Jeremy Renner after seeing the movie and I was glad he lost the Oscar that year. In time, my opinion of him did improve, but the role was disastrous. It wasn't bad, quite the contrary, but the character itself, his portrayal and all of that combined with the movie itself was dreadful.\r So, 'The Hurt Locker', albeit a well designed war film, offers little to nothing of the potential it has, becoming thus a propaganda work and the glorification of a war-raging policy that should be forgotten within the history books and not glorified on screen."
    },
    {
      "rating": "5",
      "text": "Bottom line on the hurt locker is that it s OK, but clearly did not deserve the Oscar In 5 or 10 years, nobody will be talking about the Hurt Locker. The story was not especially original. The cinematography will not be referenced in other movies, and the film won't be parodied by cartoon shows as cultural icon. It was totally forgettable. IMO inglorious bastards should have won."
    },
    {
      "rating": "1",
      "text": "I'm with RW on this one. I thought this was a dumb, empty movie and haven't found a single review that points out what I've missed other than it was some kind of adrenaline rush. \"It was so real, man.\" What kind of ivory tower institution do you people come from? This movie is disrespectful to American soldiers and Iraqi civilians alike. It's just another lame Hollywood vision of reality that allows people to pat themselves on the back for saying absolutely nothing. I don't know. It's an empty movie with bad dialogue and ridiculous, two-dimensional characters."
    },
    {
      "rating": "0",
      "text": "Disjointed, unrealistic, slow, dull, and pathetic are all word that should be on the cover of this movie. It had the potential to be good if it had dived into story a bit more and chosen what it wanted to be about. Did it want to be about the relationship between the team or with the little kid? The difficulty of being in Iraq or the struggle of returning home? It touched all of those but left you wanting more. There was a lot of deep in thought staring when not easily clipping the wires of bombs. I could rant all day about how much I was disappointed but I'll just stop abruptly like the entire movie."
    }
  ],
  "recommendations": [
    "lone_survivor",
    "jarhead",
    "american_sniper",
    "green_zone",
    "zero_dark_thirty",
    "12_strong",
    "13_hours_the_secret_soldiers_of_benghazi",
    "united_93",
    "red_tails",
    "lord_of_war",
    "the_kingdom",
    "apocalypto",
    "equilibrium",
    "dunkirk",
    "the_1517_to_paris",
    "valkyrie",
    "midway",
    "antebellum",
    "the_forever_purge",
    "fury",
    "the_purge_election_year",
    "greyhound",
    "the_outpost",
    "apocalypse_now",
    "children_of_men"
  ]
}