{
  "id": 4632,
  "title": "The Whole Nine Yards",
  "starring": [
    "Matthew Perry",
    "Bruce Willis"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "After a mobster agrees to cooperate with an FBI investigation in order to stay out of prison, he's relocated by the authorities to a life of suburban anonymity as part of a witness protection program. It's not long before a couple of his new neighbours figure out his true identity and come knocking to see if he'd be up for one more hit—suburban style.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r4FvRHW1J9FAOnCYchZ7QanQ04e.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It is a great movie that I have now watched several times. I would recommend this movie to any of my friends any time. It will keep you watching with a twist aery corner."
    },
    {
      "rating": "10",
      "text": "Matthew Perry steal the show and Bruce Willis delliver the goods as usual in this very fun, and funny, comedy that was way too underrated in its day. Still a gem, and still a lot of fun. Check it out."
    },
    {
      "rating": "10",
      "text": "Love this movie!! Old but still funny as the first time i watched it and everybody that says this movie is bad  must be very fun person to hang out with"
    },
    {
      "rating": "9",
      "text": "Bruce Willis tried to contact Matthew Perry to get him to take part in the film while, unbeknownst to him, Perry was on vacation. After a few weeks of trying to get hold of him, Willis left the famous line, \"I will chop off your legs, set fire to your house, and watch you drag...\" on Perry's answer machine. They thought it was so funny that they included it on the film."
    },
    {
      "rating": "9",
      "text": "At the start of the hit scene, an insert shot shows correct lock picking technique. Two tools are required: the pick for setting the locking pins to their unlocked shear line, and the torque wrench to hold the picked pins in place while turning the cylinder."
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧•••••••••••••••••"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@;@;@;@;@;@;@;@;@!@:@:@:@:@@:@:@:@:@:@:@:@:@"
    },
    {
      "rating": "9",
      "text": "Revealing Mistakes When they place Agent Hanson in Oz's dentist chair, Oz turns the agents head to the right. You see the actor's eyes roll as his head turns."
    },
    {
      "rating": "9",
      "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"+×÷=+×÷=+×÷=+×÷=+×÷........"
    },
    {
      "rating": "8",
      "text": "Really cool and unbelievably funny movie! Bruce Willis with an amazing performance, Matthew Perry with one of the best of his career and such a nice plot! What makes it so good: It's just different to other gangster comedies."
    },
    {
      "rating": "9",
      "text": "The whole nine yards phrase is from the 13th century, it is a bolt of fabric or 9 yards..when a monk would be walking up to purchase a monks habit, the tailor would say \"Here comes the whole nine yards.\" As , it took 9 yards of fabric to create the monks habit, hence the term, the whole nine yards. That's one explanation. Others include the use of cloth for saris, kilts, and burial shrouds. Another uses it in the sense of cubic yards of concrete, and another from the length of a machine gun belt from a British Vickers machine gun. But no use has been traced to any time before about 1850."
    },
    {
      "rating": "9",
      "text": "========================================================,,,,,,,,,,,,,,,,,,,,,,,,,,"
    },
    {
      "rating": "9",
      "text": "------------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"
    },
    {
      "rating": "3",
      "text": "This is a comedy that´s not funny, enjoyable or, at least, entertaining. That´s the reason why, \"The Whole Nine Yards\" is just a movie that tries to copy all the forced cliches of the Mob genre. If that´s the intention of director Lynn (to make a farce or a parody of the genre), the result is mediocre. As a comedy, this movie sucks. Contains all the pathetic cliches of the mobsters comedy, and, worst of all, doesn´t provoke any laugh or any smile; all looks tired, forced, with the kind of Matthew Perry comedy (slapstick and a lot of stupidity) and a really annoying accent from Roxanna Arquette. \"The Whole Nine Yards\" worth just for the macabre humor (Amanda Peet steals the show), but as a whole is just a few inches."
    },
    {
      "rating": "8",
      "text": "Very hilarious movie with a lot crime in it. A regular everyday guy who is a scardy cluts moves into his new big house. It just so happens that he lives next door to a hit man who he tries to befriend."
    },
    {
      "rating": "9",
      "text": ",,,,,,,,,,,,,,,..............@#$%^&*().,?!;:\"+×÷=_€▪○●□■☆⊙°•¤♤《》♡◇¡¿♧[]{}▪~~~~▪▪°"
    }
  ]
}