{"id": 4603, "title": "The Clovehitch Killer", "starring": ["Dylan McDermott", "Charlie Plummer"], "runtime": 109, "genre": ["Drama", "Mystery", "Crime"], "description": "A picture-perfect family is torn apart after Tyler finds a cache of disturbing images in his father's possession. He begins to suspect that the man he trusts most in the world may be responsible for the murder of 13 women ten years prior.", "releaseYear": "2018", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/6NmsbUJqnopbnLun2E4KvtVNj8T.jpg", "categories": {"plot": 4.909090909090909, "acting": 3.625, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.8181818181818183, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This movie is pretty well made, with solid acting and a decent, hard-hitting plot. It's very humorous in parts too and could almost be a black comedy. Best line comes when the kids father confronts him about his son breaking into his underground burial site and discovering a stash of his victim's belongings - 'son, now going in there was just plain disrespectful.' So torturing and murdering people isn't? There's something very funny about this kid discovering his Bible Belt father is a murdering psychopath and trying to act normal around him. Son, let's go camping, just me and you? Nooooooo. Even better as you're not sure if his father knows he's found him out. Ok so its all going along nicely, with tense scene after tense scene, but the film gets let down by the ending. Instead of call the police when he's caught his dad in the act he decides to stage his dad's suicide, to save his families embarrassment...come on...firstly, he never would have pulled that off without the cops catching on, and secondly, the little bas!*rd deny's all the victims families the chance to find out who killed their loved ones. I thought he's supposed to be a good kid. But the final great joke comes when his wife implies that her husband killed himself because he couldn't get hard for her anymore. Earlier in the film there's a scene where he fails to perform, obviously because she's not bound and gagged. She comforts him after he tells her 'I'm just getting old.' So funny that she thinks he blew his brains out over that, thanks to her son and his staged murder. This really is an entertaining film."}, {"rating": "9", "text": "Really good movie, one of the best for me this year. It´s a different kind of thriller and you should watch."}, {"rating": "9", "text": "It looks simple. It does not exactly abide by the conventional rules of suspense. It lets the cat of the plot out of the bag early on. But, hey, it is a different kind of thriller with a psychological edge. The difference is, we know what happened, but we do not see what happened until later, when the plot makes a loop back to the event by taking us backwards through time from a different point of view. And that is the suspense we get. The narrative is certainly not a cliche, and that's what makes it different."}, {"rating": "6", "text": "Not a bad movie, not a really good one either. The acting is passable, the story pretty standard even with the religious and romantic elements thrown into the mix. It all leads up to a somewhat improbable and at best mediocre ending though, and that's what's keeping it out of the green for me."}, {"rating": "5", "text": "This movie is basically Zodiac but with teen romance, more religion, and the good guys win. Also, just watch Zodiac, it's better. Aside from this, this serves as an interesting film, to a degree. It is obvious that the movie is trying to make some comments on the brainwashing of religion and the tendencies for those to lead to the **** of children and women. However, this is done very mediocrely and could be cut without being a detriment to the quality of the movie.\tThe cinematography is fairly mediocre and forgettable. The acting is overplayed and cliche.  Charlie Plummer, the lead from Lean on Pete, is passable in this and it certainly isn't his worst role. Nothing about the movie is all that offensive, but nothing is that unique or stand out. If you are thinking of watching this, be wary."}, {"rating": "7", "text": "Το The Clovehitch Killer είναι μια απλή ταινία, βραδείας καύσεως, σε κάποια σημεία της οποίας εναλλάσσεται η οπτική γωνία του πρωταγωνιστικού προσώπου, αλλά πέρα από αυτό το τέχνασμα, αφηγείται μια απλή, λιτή ιστορία αναδεικνύοντάς την πέρα από κάθε προσδοκία σε ό,τι αφορά τα τεχνικά μέρη.Μια ιστορία, ικανή να σε ρουφήξει στον κόσμο της από τα πρώτα κιόλας πλάνα, σε σημείο που να ξεχάσεις τη λιτότητά της.Το βασικό μειονέκτημα που εντόπισα, έχει να κάνει με το είδος της. Όταν λέμε «ψυχολογικό θρίλερ», περιμένουμε συνήθως να  δούμε κάποιες σκηνές με σασπένς. Δεν υπάρχει όμως πολύ σασπένς στο συγκεκριμένο έργο.Ωστόσο πρόκειται για μια άρτια δουλειά, πάνω σε μια ιδέα που δεν εντυπωσιάζει εκ πρώτης όψεως. Από αυτή την άποψη, πετυχαίνει τον στόχο της."}, {"rating": "1", "text": "Horrible ending, dumb ass kids, weird flashback, and dragged on movie way longer then necessary."}, {"rating": "2", "text": "Boring. The movie removes any tension that you would have right at the start - there's no questions about who the killer is. It basically outright tells you from the first 5 minutes. You could argue that it creates some kind of tension knowing who the killer is from the start, but they remove that with boring uninteresting characters. The lead child has a very monotone performance and shows zero character or interesting traits about him. I can't even name one thing the kid is interested in, that's because they don't give him any unique traits. The other child lead is much better, she at least has some depth and shows signs of being a real human being. The reason these characters fail for me is they have nothing to relate to. They aren't characters. They are cardboard cutouts of people. The father character is probably the most uninteresting killer I've seen in a long time. He's not even fun with the way he kills people. I feel like this is a very stereotype version of a serial killer. He ties people up because of sexual needs and kills them. This son character is so dumb it's frustrating. When confronted with the truth by his father, and he basically outright tells the child that he's a serial killer, the kid says \"burn the evidence or turn yourself in\". And what do they do? They burn the evidence. The ending is just bad. Very unsatisfying. The child wants to defend his father for whatever reason, despite the numerous killings he's done with tons of evidence to support it. He instead protects his father by killing him in a way to where the police won't have any suspicions that the father was the Clovehitch killer. Don't waste your time on this one."}, {"rating": "9", "text": "Be forewarned - this is more a coming of age type movie than it is a mystery/serial killer suspense flick. Looking at the movie in that context you’re able to forgive a lot of the clumsy and early give aways as to who the killer is.It’s more a story about accepting what you cannot believe and taking on incredible responsibility.This movie is awesome. Heartily recommend."}], "recommendations": ["knock_at_the_cabin", "the_purge", "colombiana", "law_abiding_citizen", "the_purge_anarchy", "case_39", "the_voyeurs", "i_spit_on_your_grave", "come_play", "i_see_you", "identity", "unhinged", "brightburn", "robocop_2", "cold_pursuit", "eden_lake", "i_spit_on_your_grave_2", "how_it_ends", "sas_red_notice", "no_escape", "would_you_rather", "carriers", "awake", "orphan", "the_unforgivable"]}