{
  "id": 3302,
  "title": "The Courier",
  "starring": [
    "Benedict Cumberbatch",
    "Merab Ninidze"
  ],
  "runtime": 112,
  "genre": [
    "Thriller",
    "History",
    "Drama",
    "Action"
  ],
  "description": "Cold War spy Greville Wynne and his Russian source try to put an end to the Cuban Missile Crisis.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zFIjKtZrzhmc7HecdFXXjsLR2Ig.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.0,
    "ending": 5.0,
    "soundtrack": 3.0,
    "cinematography": 3.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Surely, a crazed monkey savaged the footage because what is with the cinematography in this movie? It has this unpleasant nervousness about it as it goes from wide shots to extreme close ups and changed angles in matter of seconds. Who films this way? That is something you do to spice up your action scenes or to create tension, not as your modus operandi. This reminds me of that shaky-cam rage that became the fashion some time back so everything was shot that way, even if it was just some guy taking a leak.It gets even worse when boring parts are spiced up with music that is totally inappropriate. Instead of ditching superfluous scenes they just add hyped music to it. Why? Because you ran out of footage?Oh and you know this is going to be bad when, after the opening scene that has Oldman mumble some lines in a church, the movie needs to tell you that the next scene is set in London, the United Kingdom. It was the first and the last laugh. What is next? Berlin, the capital of Germany in Europe? Tokyo, capital of Japan in Asia on planet Earth in the Milky Way? Is the audience supposed to be that stupid?Oh and it has this super frail actress who goes mano a mano with men twice her bulk and a head taller. Can't she not just be smart? Or nimble? Or skilled? And Gary Oldman is in this too. He looks like Jeff 'the Dude' from the Big Lebowski, but mumbles his lines as if he is checked out or wasted. He is doing a Freeman here. I gave this a few points because the cast(except Oldman) does their best, especially the lead. It is not their fault that the rest sucks(and you too, Oldman)."
    },
    {
      "rating": "0",
      "text": "Oh putain, l'indigence de ce nanar, ça troue le cul ! on dirait qu'on se prend toute une plaquette de suppositoires à la queue-leu-leu, en file indienne, les uns après les autres... avec la plaquette. Pourtant, on espérait quelque chose... rien de mirobolant mais quoi... Olga en cuir sur une grosse moto, enfin quoi, ça donne envie quoi !Sauf que... \"non mais allo quoi !\" comme dirait l'autre ispice di counnasse, allo le putain de film, il est passé où ?!... non, inutile de répondre, le comique troupier a ses limites ! et qu'est-ce que Gary le vieil homme est venu faire dans cette galère qui prend l'eau de toutes parts ? je sais bien, un vieux, faut que ça mange mais quand même. Pauvre vieux.Quel navet effrayant en tout cas... on dirait un sale téléfilm boulotté par deux huitièmes jours un lundi férié ! oui, ça craint !"
    },
    {
      "rating": "2",
      "text": "Holy **** that was awful.Films like this make feel bad about Gary Oldman and the lousy scripts he has to accept to make a living."
    },
    {
      "rating": "4",
      "text": "Flat characters, chunky lines, and a simple plot could be excused but The Courier is boring at times and stretched for most of the rest. It fails to meet even the rather manageable minimum requirements for simple action movies."
    }
  ]
}