{
  "id": 4039,
  "title": "The English Patient",
  "starring": [
    "Ralph Fiennes",
    "Juliette Binoche"
  ],
  "runtime": 162,
  "genre": [
    "Drama",
    "Romance",
    "War"
  ],
  "description": "In the 1930s, Count Almásy is a Hungarian map maker employed by the Royal Geographical Society to chart the vast expanses of the Sahara Desert along with several other prominent explorers. As World War II unfolds, Almásy enters into a world of love, betrayal, and politics.",
  "releaseYear": "1996",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8eHHqMg8qEYtVw8LQLygsHXSR2q.jpg",
  "categories": {
    "plot": 6.714285714285714,
    "acting": 8.0,
    "ending": 8.428571428571429,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great film! Real emotions, real life! Heroes were on the top! Music brilliantly selected!"
    },
    {
      "rating": "8",
      "text": "Really, reviewers? Can't you identify a great film when you've watched it? 'The English Patient' won 9 Oscar and everyone (or at least 7 of them) are merited. The screen adaption of this criticly praised book (I haven't read) is very good directed, has a simply fantastic score, magnificient cinematography and highly talented actors. I admit that it could've been shorter and the love story gets too kitschy partly, however it's the best movie of 1996 and totally touching!"
    },
    {
      "rating": "7",
      "text": "and you never want to talk..The English PatientFew high pitched dramatic sequences are shot so beautifully that it is almost impossible not to be moved by it but ticking for around 160 minutes the build of the scrutiny is chewed off way too much before it even hits the screen. Anthony Minghella's adaptation isn't smart enough to match its brilliant execution skills that helps connect the dots no matter how much time it consumes. Ralph Fiennes is brilliant in his portrayal and is supported thoroughly by a great supporting cast like Juliette Binoche, Willem Dafoe and Colin Firth. The English Patient is a character driven feature where it goes boldly to a dark place and still somehow manages to keep it beautiful and filled with hope where the key lies onto its moving performance."
    },
    {
      "rating": "10",
      "text": "Achingly beautiful. Fiennes is perfect in this movie. I did enjoy the book earlier, but I like the movie more. I have never seen a movie that so amply reflects the book and does justice to the literal counterpart."
    },
    {
      "rating": "9",
      "text": "What a marvelous movie is this one! It touches your heart, it moves you!. The photography is spectacular, and the performances were great. This is classic, and I wish we had more movies as deep as this one is...I think it is about time for me to watch it again. Not a 10, but a 9 for sure! I highly recommend it."
    },
    {
      "rating": "7",
      "text": "Don't let the Seinfeld episode convince you otherwise; The English Patient is nowhere near as bad as Elaine says. Instead, it is actually quite good. It is quite long, but it never becomes boring and plus, the visuals are so stunningly beautiful throughout, there is no way for you to possibly become bored anyways. Wondrously crafted and bold in scope, The English Patient may not be truly brilliant, but director Anthony Minghella certainly did a fantastic job. However, I will say I never found this one too romantic. People gush about how romantic it is, but it is simply about two scumbags who wind up having sex with one another. Maybe I am just jaded and have extra hatred for cheaters, but anyways. Ralph Fiennes is fantastic, as are Juliette Binoche, Willem Dafoe, Kristin Scott Thomas, Naveen Andrews, and Colin Firth. Though I did not find the love story to be charming or romantic, the story told by Fiennes' character is still incredibly moving and full of human drama. The romantic part of the film, to me, would be aimed at the desert, which is beautifully captured at both its best and its worst. A captivating World War II romantic drama, The English Patient is quite long and could stand to be shorter, nor it is particularly impactful, but it remains a beautiful film that does not deserve the negative impression I had going in."
    },
    {
      "rating": "9",
      "text": "Good. As it’s hard to find true love in real world, so it’s nice to be moved by an ideal one in a film. Your assumed friends may suspect you, and your supposed enemy might respect you, that’s why Almásy is delayed in rescuing his ankle-injured lover, and why the vengeful Caravaggio gives up revenge after knowing all these. A traitor is not a traitor when he himself is betrayed by some peremptory authority, and when such betrayal is necessitated by great love."
    },
    {
      "rating": "8",
      "text": "Although at times, the melodrama was a bit too much for me, \"The English Patient\" still had a gut-wrenching and tragic ending that made the film memorable for me. Also, the scenery is breathtaking."
    },
    {
      "rating": "10",
      "text": "I really dont get why people dislike this movie so much, and why it (rightfully) won so many Oscars. The English Patient is a sweeping epic that is complex, moving, and very powerful. It's breathtakingly shot, and the score astonishing. Juliette Binoche, Ralph Fiennes and Kristen Scott Thomas give emotional, powerful performances on top of everything that is so great about this film.\rIt has a non-linear structure which is perfect for a longer film like this because it sucks you into it more and keeps you focused on the edge of your seat.\rThe script is perfect, the costume design is beautiful, the production design is believable, the cinematography is top notch, the editing is flawless, and this grade A, all star ensemble cast is one of the best you'll see in years.\r Dont believe the haters, watch '''The English Patient'', it's an absolute masterpiece."
    },
    {
      "rating": "8",
      "text": "The plot feels slow for moments but is well compensated with the story of intrigue, romance and betrayal, elements that look well balanced. Nice performances of Binoche, Fiennes and Defoe."
    },
    {
      "rating": "10",
      "text": "The fine movie, with excellent actors. The magnificent history which is beautifully given Ralph Fiennes acting. Excellent course of screenwriters, end of history, only beginning. The movie about true love in which deytsvitelno you believes despite a wild desert, war and separations."
    },
    {
      "rating": "7",
      "text": "\"The English Patient\" has long been transformed into one of the most classic films of romantic cinema, but it seems that the public has had little appreciation or patience for romantic movies, particularly if they are very long and slow. Based on a novel by Michael Ondaatje (which I have), its located in Italy at the end of World War II, telling the story of a military nurse being in a ruined house to assist an aviator who was terribly injured in a plane crash. So, this movie was intended for a public that wants to follow the story, savor all moments, follow the emotions of the characters. The script makes a good adaptation of the book. Scenarios and costumes have been thought through to detail and the period elements have been well recreated and are historically suitable. Visually, the film is excellent: great cinematography, with Italian and North African landscapes dazzling the audience. Ralph Fiennes was excellent in the lead role, achieving one of the most remarkable works of his career. Juliette Binoche was not as surprising as him, but she was well in her role. To be fair, the only problem in this film is the overly slow pace, making it overly sentimental in some scenes. I understand the idea and the intention behind, but everything has its limits and even honey can make you sick."
    },
    {
      "rating": "3",
      "text": "Stylish film about the beauty of extreme self-centered melodrama. Hated it from the early scene where the heroine walks into a minefield to retrieve a memento of a dead friend. If she wants to blow herself up, go ahead, but she had no right to endanger the other two men trying to clear the mines. From there, it goes on to justify helping the Nazis if you're melancholy enough."
    },
    {
      "rating": "3",
      "text": "Do you realyy believe that the Allies having to take care of a badly burned man in NorthAfrica found best to send him to Italy in the hands of a field hospital. The story is an accumulation of illogical developments that were totally unnecessary to portray a destructive passion that was big by itself. I give a 3 in recognition of cinematographer work."
    },
    {
      "rating": "7",
      "text": "Sure, The English Patient is one of the best movies I've ever seen. However, the Oscars are just plain s**t. How come the Academy chose a 3-hour-long passionate love story and win a Best Picture Oscar? I skipped on the final ending of the Oscars in 1997 and I was so pissed. There's a reason why Joel and Ethan Cohen were not too pleased with the stunning news because Fargo should've won the goddamn Oscar in the first place. I believe it's one the most embarrassing Best Picture winners and some people agree with me that The English Patient is completely overrated. Shame on You, AMPAS!"
    },
    {
      "rating": "2",
      "text": "A grand movie that put me to sleep. Too long and boring to keep my attention. Some good parts, but just not interesting enough. I just wish I never would have picked it up in the store to rent."
    },
    {
      "rating": "5",
      "text": "It's breathtaking. Breathtakingly boring."
    },
    {
      "rating": "1",
      "text": "ça vaut un coup d'oeil limité pour les acteurs (Ralph, Kristin et et Willem... moins pour Binoche la moche qui fait toc), un coup d'oeil limité dans le temps (genre un petit quart d'heure) ou bien à intervalles plus ou moins réguliers (quelques minutes toutes les demi-heures) parce que sinon on se fait chier comme un rat mort.L'histoire n'est pourtant pas si mal malgré l'enrobage romantico-gnangnan très poussé mais que voulez-vous, plus de deux plombes et demi, ça va pas le faire. Le réalisateur Anthony Minghella est coutumier du fait : il délivre régulièrement des films longs et soporifiques, quel que soit le sujet. Cet abruti veut vous faire pioncer et il faut reconnaître qu'il a un don pour ça !"
    },
    {
      "rating": "0",
      "text": "Nothing to offer, overated, long and boring."
    },
    {
      "rating": "1",
      "text": "My co-workers raved about this movie and when it first became available on VHS, I rented it. I watched the whole thing and I think it is way overrated. This was no love story that I could relate to in any way. I'm really glad I didn't pay theater prices to see this."
    },
    {
      "rating": "10",
      "text": "Ok it may be slow but the gradual build up rewards you with an amazing climax of emotion and raw passion. It is help by some great performances"
    },
    {
      "rating": "10",
      "text": "I think that the people who rated this low must be either mad or deluding themselves because this is an amazing film. All the way through it provokes emotion, and the end is powerful."
    },
    {
      "rating": "1",
      "text": "There are very few movies worthy of a zero rating but this comes close. Seinfeld was right about this one."
    },
    {
      "rating": "10",
      "text": "Yes, the movie is slow, but it's so beautiful that with some patience youc an really enjoy it. The performances are outstanding (you'll see what I mean in the last 30 minutes of it), specially from Mr. Fiennes. There's not much to be said about this that hasn't been said before, so I'll just recommend it. If you wanna see a big love traditional epic, I don't think there are many options better than this one."
    },
    {
      "rating": "9",
      "text": "One of the best films ever made, based on one of the best books ever written."
    },
    {
      "rating": "10",
      "text": "In the epic style of David Lean, Anthony Minghella has crafted a wonderful and engrossing film from Ondaatje's poetic novel."
    },
    {
      "rating": "10",
      "text": "This movie was an example of the purest form of story-telling: a kind of pingpong between periods and people involves in the story. It was brilliant to have a burned up man, barely alive reminiscing and offering bits and pieces of his past...superb."
    },
    {
      "rating": "10",
      "text": "This film is nothing short of mesmeric. Beautifully written, superbly acted, heart-rending and simply transcendental, it is unquestionably the best film I have ever seen."
    },
    {
      "rating": "7",
      "text": "The film is a classic epic with a story that is engaging but not terribly compelling."
    },
    {
      "rating": "9",
      "text": "It's a spectacular movie. The performances, the screenplay, production, cinematography is beautiful, direction and the soundtrack is great than Fargo (1996). I don't understand how people forget that movie and it is true that the movie won 9 Oscars including Best Picture and Best Director. The truth is that this movie is a jewel of the 90's and a masterpiece of the seventh art. The movie is amazing so there is beauty in the lines, the soundtrack and the cinematography, a masterpiece that will never be forgotten."
    }
  ],
  "recommendations": [
    "casablanca",
    "amadeus",
    "the_last_of_the_mohicans",
    "youth",
    "gladiator",
    "the_assassination_of_jesse_james_by_the_coward_robert_ford",
    "the_great_gatsby",
    "whiplash",
    "spencer",
    "carol",
    "phantom_thread",
    "magnolia",
    "once_upon_a_time_in_america",
    "a_star_is_born",
    "anna_karenina",
    "a_beautiful_mind",
    "the_aviator",
    "amores_perros",
    "kingdom_of_heaven",
    "the_dig",
    "the_master",
    "the_grand_budapest_hotel",
    "belfast",
    "cinderella_man",
    "life_of_pi"
  ]
}