{
  "id": 4804,
  "title": "The Marine",
  "starring": [
    "John Cena",
    "Kelly Carlson"
  ],
  "runtime": 92,
  "genre": [
    "Action"
  ],
  "description": "A group of diamond thieves on the run kidnap the wife of a recently discharged marine who goes on a chase through the South Carolinian wilderness to retrieve her.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pONyvBJwHNg5CWu7mtsv4qaq75C.jpg",
  "categories": {
    "plot": 3.6666666666666665,
    "acting": 3.272727272727273,
    "ending": 3.1666666666666665,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 2.8,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The Marine has its problems, a lot of them doing with the acting and its sometimes weird comedic timing, but for the most part it's an entertaining action movie which know well enough not to take itself seriously. I mean, it could be a whole lot worse."
    },
    {
      "rating": "9",
      "text": "A surprisingly awesome movie."
    },
    {
      "rating": "8",
      "text": "Semper Fi!"
    },
    {
      "rating": "8",
      "text": "I was very, very surprised. The movie wasn't horrible by any means, wasn't good either. It was just a pure action flick. Many parts were stupid, and cheesy. Otherwise a good action flick."
    },
    {
      "rating": "8",
      "text": "A nice action/fight movie with absolutely no story plot. Worth watching when your in the mood for watching just alot of beatings."
    },
    {
      "rating": "7",
      "text": "Hour and a half to kill.? Don't want to think? Want some explosions and a few chuckles? Perfect movie for those reasons alone."
    },
    {
      "rating": "10",
      "text": "The best action movie in a long time!"
    },
    {
      "rating": "8",
      "text": "A simple explosive action movie. No confusing storyline to hinder the action, and enough \"action-movie\" humour. To boot, the wife is the hottest bit of crumpet I've seen on the big screen for a while. Yummy! :D"
    },
    {
      "rating": "10",
      "text": "Great movie! It had a All-Star cast!"
    },
    {
      "rating": "10",
      "text": "The best action movie since Triple X."
    },
    {
      "rating": "0",
      "text": "Poor Mr. Patrick. You were the T-1000 15 years ago. Then you were Agent Dogget 5 years ago. Now you're in this steaming pile of trash. Congratulations, your career has finished heading downhill and is officially over. I watched this movie for free and still feel ripped off. Just absolutely retarded movie, from beginniing to end with the only redeeming quality being that it is so bad, you might enjoy making fun of it. It just angers me so much that people actually gave this movie a decent review and gave me hope. How dare you? P.S. Did anyone else notice the cop car's tires get shot out one second and somehow repair themselves the next?"
    },
    {
      "rating": "0",
      "text": "Drop a steaming pile of dump on a plate and watch it for two hours, because it will be more entertaining that \"The Marine.\" John Cena is a horrible, pathetic actor and he makes a mockery of the Marine Corps with his less than tactical fighting skills. F' this movie, it sucks."
    },
    {
      "rating": "0",
      "text": "Simply the worst movie I can remember seeing. Its not even worth a buck at a dollar movie theater!"
    },
    {
      "rating": "0",
      "text": "YUK!"
    },
    {
      "rating": "2",
      "text": "I went in with really low expectations but still left upset. I expect action movies to at least be fun but when they start to get repetitive, it ruins the whole movie. [***SPOILERS***] Three buildings blow up with Cena in them or jumping out of them. The only real plus is the couple of chuckles in the film and the car chase sequence. Even if your a Cena fan, stay away!"
    },
    {
      "rating": "0",
      "text": "VERY BAD MOVIE. From the first 10min. to the end it was stupid. The guy takes 100 men out by himself...how retarded is that. Tries to make the Marines look like they are AMAZING. They are just men, not robots. If he was a robot then I would say OK that was good. But he isn't. STUPID MOVIE...half way my friends and I had to stop watching it."
    },
    {
      "rating": "0",
      "text": "Worst movie ever! It's even worse than a Van Damme direct-to-video flick. There's no surprise in this movie. Everything in this movie has been done better before."
    },
    {
      "rating": "2",
      "text": "I entered the theater thinking I was going to see a good old-fashioned action flick about the marines; and i didn't expect the plot to be well-written. The plot was exactly how I thought it would be, however, the action, can hardly be called so. There was nothing good about the movie: the action was terrible, Cena's acting is horrible, and to top it all off, the protagonist was fired in te first 5 minutes of the movie... so the movie wasn't even about a marine."
    },
    {
      "rating": "2",
      "text": "I'm not a John Cena fan, but I will give him credit that he's definitely not a bad actor. The cast was pretty good too, I love Patrick Stewart's character. But the downside is the movie itself and the plot. I was lousy, cliche, and no brainer. It doesn't bring up the excitement or the fun of it like many action movies do. You can just expect what's gonna happen in a second. The final fight scene was too short, actually all of them are. I do like some of the action scenes, but 1 problem was there was too many explosion scenes. Seriously, I think there was like 7 or 8 of them. I saw this in theaters when I was 14 and was a big John Cena and I liked this movie. Now at the age of 19, and a big movie guy from watching Die Hard, Rambo, Speed, Demolition Man, Terminator, Lethal Weapon, Commando, Robocop, etc. I find this poorly made and putted on the back of the line from many other action films I had fun watching."
    },
    {
      "rating": "8",
      "text": "This is a great movie I feel a lot of people will enjoy, it mixes humor and action, has an enjoyable plot, all in all if your looking for a good action movie to watch look no further."
    },
    {
      "rating": "7",
      "text": "The Marine is a film, strangely, not so much about a United States marine, but about a diamond thief and his cronies, and the crazy hijinks they get up to. Pursuing them is an ex-marine, John Triton, an action hero lifted straight from a Steven Seagal film and thrown head-first into this one. Though Cena has a better physique for beating up criminals, is young enough to perform his scenes without a stand-in, is audible in his line delivery, and is believable in his role; he just doesn't have any of the Seagal charm. Cena is lifeless and unbackable - which is a shame - because the film itself (for the most part) is a lot of good-natured Transporter-style theatrics and 1980s worship. The film can be hella goofy; there are several moments where the dialogue is a little questionable, and there are a few instances of awkward self-awareness - but it can all be put aside considering the entertainment value. If you go into this with the right mindset, it is unlikely you will be disappointed. Lots of things explode (including Cena himself, more than once), and it is often a riot when they do. While this is all fine and dandy, there needs to be even more action. In about the middle of the film there is a noticeable slump; like holding a long piece of rope at both ends at a short distance. The action sequences need not be written or directed any better, they just need to be more frequent. Watching Cena be driven through explosive barrels, wooden huts and plated steel sheds is absolutely hysterical - especially when he comes out of it feeling perfectly fine, but the sad truth is that he doesn't do a whole lot of hurting others; in fact, the only death I can remember being directly from his actions is the final boss' (played by the T-1000, Robert Patrick). Stick The Marine on if you ever feel the need to wallow in action movie nostalgia, or if you have a penchant for things that are so bad they're good."
    },
    {
      "rating": "10",
      "text": "Really awesome action film!!! Patrick is the best, Cena is awesome!!! Best film of WWE Studios, better than See No Evil or Condemned. Hope to see it again!!!"
    },
    {
      "rating": "5",
      "text": "Loud, boisterous and devoid of brains. The Marine for what it is, is a decently entertaining action movie. The only thing it had going for it was it wasn't as bad as it could have been."
    },
    {
      "rating": "3",
      "text": "This is very much an action film, featuring plenty of explosions and fights. However, that aside there is the ocassional amusing scene too, so it does have an element of comedy in it. The dialogue is  (as may be expected) fairly macho in tone and there is a definite element of predictability present with various cliches used but I did feel it was relatively easy to watch and somewhat entertaining nevertheless. Its a bit hard to say what themes are covered, as I usually include in film reviews - the plot is a little bit thin and nothing very obvious stands out but I guess you could say it includes vengence.The music was a bit sleazy in parts - in some scenes, it resembled the formula of a James Bond film or some such similar spy franchise, with there being the token love interest, characters trying to keep information on the 'down low' (aka communicating quite quietly, actively looking like their hoping not to be seen etc.), that sort of thing. I felt the incident music/muzack was, if anything, a little too loud on ocassion, to the extent that I felt it was in danger of entering the 'overkill zone' (apologies for the action film related pun).I didn't feel like this film kept me guessing much at all - if anything, I could pretty easily guess what would happen next, as some moments were shown in a slowed down sort of a way, with minutes passing by quite slowly, presumably to add to the sense of tension and possibly mystery or worry for the viewer, although, as I say, I didn't feel especially worried(!). I have seen a fair number of action films but I'd easily say this is among the more dud ones - its not the worst but its certainly not among the best.I found myself thinking that the film could almost pass as one made for TV, so I think its fair to say that the budget didn't appear to be spectactular. The special effects weren't awful as such, nor were they mind-blowing but somewhere inbetween. I think it was perhaps more the lack of a properly developed plot and the sheer predictability and presence of cliches that made me lose interest in it after half an hour or so. Cast wise, this film stars John Cena as the marine in question. Cena is a WWF wrestler and this is one of his first acting roles I believe. Other wrestlers have made decent actors in recent years, such as Dwayne 'The Rock' Johnson, who has appeared in both action and comedy films. I can't really say that Cena made a particularly big impact in this film - his acting seemed slightly blank if anything. His character is pretty basic and I didn't feel he brought a lot to the role, other than obviously seeming visually quite  muscle-bound. Also present in the film is Robert Patrick, who plays a character called Rome, although I didn't remember a great deal about his performance. Anthony Ray Parker plays Morgan, an African American who takes offence to some of the dialogue in accusing others of being racist (not in those precise words but effectively meaning the same thing). Finally, Kelly Carlson plays the main female lead role, as Kate Triton. There is one other female character shown in various scenes, Angela (played by Abigail Bianca) and the two of them try to prove their the better one - fascinating stuff(!) (and of course what do (some, not all, I hasten to add) guys like more than watching women trying to out-do one another(?!)).Content wise, the film features some mild nudity (nothing especially graphic is shown), some moderate violence, mostly in the form of gunfights and also fist fights. Fire is used as a weapon at one point and strong language is used at times but otherwise there's little likely to offend, that is on the basis that the majority of the film being rather weak doesn't offend you, of course!. The film carries a 15 rating to reflect said content.It felt like it was a half hearted film, one that hadn't taken long to be thought of and rushed through the various stages (pre-production, production, post-production). I certainly wouldn't bother to go out of your way to watch it, unless there's literally nothing else on TV and your bored with nothing better to do.The dialogue had me tittering away ocassionally but I fear that wasn't intentional. I'm honestly not sure what else I can add, other than perhaps teen boys may enjoy this a little more than I did, primarily if they haven't seen a raft of similar films and don't mind (or moreso don't recognise) a steady flow of cliches, mild sexism and the like.One thing I should perhaps say in its favour, is that although I got rather bored and felt distracted from it after the first twenty minutes to half an hour or so, I did still keep watching and the ending was fairly ok. I felt that overall it was certainly an easy watch and there are scenes in it which are relatively entertaining, it just wasn't exactly a memorable film to me and it certainly isn't something I'd ever plan to bother watching again."
    }
  ],
  "recommendations": [
    "the_expendables",
    "the_expendables_3",
    "bloodshot",
    "6_underground",
    "xxx_return_of_xander_cage",
    "lockout",
    "furious_7",
    "transporter_3",
    "the_expendables_2",
    "salt",
    "contraband",
    "the_tax_collector",
    "gemini_man",
    "the_a_team",
    "kingsman_the_golden_circle",
    "polar",
    "sabotage",
    "hercules",
    "the_mechanic",
    "underworld_evolution",
    "crank",
    "mission_impossible_iii",
    "transporter_2",
    "the_transporter_refueled",
    "vantage_point"
  ]
}