{
  "id": 1606,
  "title": "The American",
  "starring": [
    "George Clooney",
    "Violante Placido"
  ],
  "runtime": 104,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Dispatched to a small Italian town to await further orders, assassin Jack embarks on a double life that may be more relaxing than is good for him.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5OEOsRaBsSxD0qBtAhus0iKDzr.jpg",
  "categories": {
    "plot": 5.7894736842105265,
    "acting": 6.242424242424242,
    "ending": 3.125,
    "soundtrack": 5.0,
    "cinematography": 6.555555555555555,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 6.0625
  },
  "reviews": [
    {
      "rating": "1",
      "text": "This movie was so slow moving i closed my eyes for a few times and never missed a beat.   i'd recommend waiting to see it at home when you can speed through it.  imagine stretching the action of the 2 minute preview for 100 minutes and thats what you are in for....its a great nap movie"
    },
    {
      "rating": "0",
      "text": "This film was painful to watch in every aspect.  First movie I've ever thought of walking out on, but I kept hoping it would improve.   All the dark, brooding, dull angst....Uggh!  Story line was so predictable."
    },
    {
      "rating": "2",
      "text": "Nonstop glum performance by George Clooney without any lightness or humor. Riddled with cliches like the whore with the heart of gold and remarkably heavy-handed symbolism. The audience I was with was ahead of the film, unfortunately. Just a drag from the five minute mark onward."
    },
    {
      "rating": "2",
      "text": "Not even halfway through the movie I already hated its guts. The American shows no respect for its film genre, its star, and its premise. Director Anton Corbijin should stick to his short documentaries instead of trying to direct an action thriller. Most of the time the camera is up in Clooney's face, and although his performance is quiet but dangerous, it doesn't make up for all the faults in this film. There were basically no dialogue and when there was, it lacks focus and was all over the place. Spending almost 20 minutes following Clooney around town without doing anything, The American is one of the worst thriller of 2010. Clooney's performance shows promise but the film failed on all other aspects and will/could not be made up by just George Clooney. RazzieBuzz: Worst Director, Worst Screenplay, these are both unlikely because critics liked the film but I put them there just to show how mad I am that George Clooney got involved in this."
    },
    {
      "rating": "9",
      "text": "Really enjoyed this.  The cinematography was outstanding, Clooney did a fantastic job acting, and the story kept me interested, wondering what would happen next to him and everyone involved."
    },
    {
      "rating": "7",
      "text": "Those who were expecting something action packed might be a bit disappointed, but if you're willing to sacrifice high octane action for slow building tension you might find \"The American\" to be intriguing and interesting enough to sit through."
    },
    {
      "rating": "1",
      "text": "This film is a snore.  It takes forever to get going, but it never gets going.  The best and only good clips are in the trailer.  Just Clooney (he was a producer of this drivel) and a bunch of no name Italians.  The two women, on the other hand, are hot!"
    },
    {
      "rating": "2",
      "text": "I hated this movie, but let me start with what I did like about it: the muff shot!\r I mean come on, with todayâ"
    },
    {
      "rating": "1",
      "text": "This movie was so dreary we left before it was halfway done, so I can't really comment on the whole thing except to say I rarely leave movies I have paid to see.  It reminded me of \"Constant Gardener\".  An espionage movie but so **** that it was painful.  Just couldn't do it.  Unless you love long shots looking at George Clooney (driving, looking at his coffee cup, walking, thinking, etc.) I'd say SKIP IT!  See Machete instead.  It is PURE entertainment, now THAT was an awesome movie!"
    },
    {
      "rating": "1",
      "text": "Not a thriller, which is what I was expecting from the previews.  Plot moved so slowly that I fell asleep mid-way through.  I didn't not find that the movie created much tension mainly because the ending was predictable and story line had huge holes.  If you love watching silent films of the Italian landscape and viewing George Clooney's abs, then go see the movie.  Otherwise, save your $10."
    },
    {
      "rating": "2",
      "text": "The director spent most of the time zooming in on Clooney's face and not nearly enough time making it a good film. It stunk and was a waste of money. Very little plot, salacious sex to, I guess, make the film a bit more tittilating. a dumb plot and little dialogue all combined to make this a disaster"
    },
    {
      "rating": "2",
      "text": "I love George Clooney and I love assassins. So this movie is a canâ"
    },
    {
      "rating": "1",
      "text": "George IS superb BUT this film is not. its just a long bland empty waste, predictable and uninspired.The poster for the film is better, I'd rather stare at that for the running time of this pretentious drivel.Still love George though."
    },
    {
      "rating": "2",
      "text": "Just boring as hell. The American fails to convince us not only that George Clooney is a cold blooded killer, but that this film needed to exist. It is an exercise in tedium from beginning to end. The photography, which should have been the highlight of the film, all things being equal, but was shot in such poor gray flat light, that even that possible escape from this prison sentence of a movie is shut to us. I didn't care about any of the characters, and the revelation that comes at the end is so obvious, that if you haven't seen it coming by 15 minutes into the movie, then you probably gave it a ten. The problem clearly is the pacing. I love slow deliberate plots, 2001 comes to mind. Kubrick understood he could whatever the **** he wanted in a movie, so long as it was interesting, and/or advanced the plot of the movie. The American on the other hand is about 30 minutes of plot, and another hour or so of foot dragging, mind numbing, care exhausting, I don't even care to finish this review I'm so god damn bored by this movie."
    },
    {
      "rating": "9",
      "text": "Was very surprised that I came away actually loving this movie.  This movie almost make me forget that Clooney ruined Batman (head bobble).  I like movies that just tell a story without dumbing it down and adding narration or stupid lines to help explain what is going on.  The film focuses on details instead.  No subtitles no easy translation, but you still understand and feel what is going on.  It's really not all that complicated anyways.  The film is shot beautifully.  Maybe it's best when Clooney is given a film with as few lines as this.  Scenes with his new \"friends\" add depth. Even  in the most serene and beautiful places danger is lurking."
    },
    {
      "rating": "8",
      "text": "There's an unintended irony in The American's title, an irony that sweetly describes this movie's charm.When you think of an American movie these days, you think of a noisy spectacle, entertainment over character, explosions over story. But despite its title, The American is the antithesis of the big Hollywood spectacular. It's a quiet, contemplative film, lyrical in its grey, damp beauty and solemn in its business.The American is to be enjoyed for how it tells a story, not for the story itself, because the tale is familiar. It's the one about an aging hitman. Need I say more? Yet Dutch director Anton Corbijn finds new touches for his old story. His setting is the Italian medieval town of Castel del Monte, in the Apennine mountains of Italy. It's a postcard setting, crowded tile rooftops hugging each other up a hillside, narrow twisting cobblestone roads zig-zagging up between the old buildings. The cinematography is beautiful. But the light is rarely the golden, the colors rarely those of the  picture postcard. Instead it's mostly drizzly, dark, dank and slightly worn. The town's a character every bit as much as George Clooney, who plays the title role with a restraint that matches the weather and the lighting. He's a paid assassin and it's all become too much for this paranoid, deeply introverted loner. Clooney goes the distance without ever cracking a smile. It might have been a dangerously low-energy, one-note performance. But instead it plays as a man who earned a good living by staying under a rain cloud but who finally dares to hope that maybe he's entitled to a little sunshine as well. As I said, the story's a familiar one and the ending's morality is straight out of the Hays code from the 1930's. For my taste, the utterly conventional conclusion is perhaps the film's weakest point. But its strengths overcome that solitary weakness. It has a subdued style, an elegance and beauty not typically associated with movies about assassins. Nor, for that matter, with movies about Americans."
    },
    {
      "rating": "2",
      "text": "This movie was just plain terrible! It was pointless and watching it, was like watching paint dry. Clooney hardly speaks, everything was predictable, nothing made sense or was explained. It was just a complete waste of time. The one interesting thing I did want to mention is that throughout the movie, director Anton Corbijn shows everything done so methodically and wants to be as realistic as possible, however Clooney is seen driving on the left side of the car and on the right side of the road in Europe. Like the movie, even the setting has a huge hole in it. Honestly guys, don't even waste your time on this one."
    },
    {
      "rating": "0",
      "text": "I love Italy. I love George Clooney. I hated this picture. It really stunk. I am sure George will admit - perhaps already - that this was an absolute PHEWWWW of a movie. Who is George? Jack? Eduardo? Who is he working for? Why? We never get told the answers to these most basic questions. Why is he being targeted in Sweden? Why does he kill his girlfriend? We never get told the answers to these important moments. Who is Pavel? Who does he work for? Why is he trying to double cross George/ Jack/ Eduardo? We never understand any of the answers to these important questions. Over and over and over the movie fails to entertain, to grip, to explain, to enrapture, to do anything except elicit either sleep (in my wife's case) or a big fat \"meh\" in my case. George looks good. Italy looks good. I cared less for both of them after this pitiful, execrable, appallingly directed, inanely written, drastically awful, insanely stupid movie."
    },
    {
      "rating": "3",
      "text": "A self-consciously pretentious artsy-craftsy flick. Sometimes less really is less, and this is such a case. Excruciatingly boring. One wonders why Clooney would subject himself to such a miserable script."
    },
    {
      "rating": "6",
      "text": "Hmm. Yeah I dunno, man. My expectations were certainly disappointed. Maybe it'll age like wine, but right now it's not even wine. It's like a desperate swig of Scope."
    },
    {
      "rating": "7",
      "text": "\"The American\" is quite and poetic, like those old japanese samurai movies. The movie shoots the core of what its trying to say, giving a appeal to the heart rather than eye candy visuals. In the end, the audience who are more mature would definitely watch this."
    },
    {
      "rating": "2",
      "text": "Worst movie of the year! Boring! I dozed off once, folks ahead of us dozed off three times! A twisting, mountain road and 15 ways to shoot the same small streets: that's the best they could muster!!?? Eye candy for Cloony fans, other wise a waste of time and money!"
    },
    {
      "rating": "0",
      "text": "this is bad, very bad. it is slow, very slow.  worst movie i've seen all year.  as much as i adore george clooney, i think he tried to come up with a reason to film in italy where he lives.  there was maybe 10 minutes of story stretched to fill close to 2 hours, and zero action.  lots of pretty camera shots of the terrain, and lots of clooney doing push ups and putting guns together.  they tried to create tension like they did in the sopranos ending ie tony waiting to get killed (same as george looking over his shoulder the entire movie).  very heavy handed symbolism at the end with the butterfly.  waste of $11 and not even worth it as an airplane movie."
    },
    {
      "rating": "6",
      "text": "I heard a couple of meatheads walking out of the theater on Oahu say, \"I didn't get it.... George Clooney officially ruined his reputation with this one.\"  Huh??  What's not to get?  It's not a bad movie by any stretch, but is has much more deliberate pacing than the trailer would suggest.  This was not meant to be another Bourne movie. If you're a fan of a show like Rubicon, you'll love it.  The actresses in this film are spectacular.  (Not sure it's them or the parts - or the direction - but are great opposite George.)"
    },
    {
      "rating": "10",
      "text": "This is a wonderfully executed example of an intelligent and thought provoking character study. Once again, George Clooney is a class act with the guts to choose a great project that, sadly, most people will be too over-stimulated by today's mindless movies to truly appreciate. The film is highly engaging. Riveting, in fact, if you're not looking for the typical shoot 'em up action picture. If you're willing to get under the skin of The American, and really feel this guy's harsh reality, it's even shocking, not to mention heart-breaking, at times, and certainly a more realistic look at the life of an assassin than anything that's come out in a long time. Congrats to all involved in the making of the wonderful picture. Great job!!!"
    },
    {
      "rating": "9",
      "text": "It takes one to know one; spies in a quiet Italian village, spies who can only be up to no good, and loud. The American recognizes the lady in shades as being from his tribe, and converges toward their rendezvous point, a cafe, with the purchase he just made from the cheese vendor. Jack carries with him a wedge of real cheese, not Cheese Whiz or Kraft singles, while his filmic limner, George Clooney, carries a real movie, a homage to, perhaps, the French New Wave, not cheesy action flicks or films in general from the post-MTV generation. Coming off the heels of Jim Jarmusch's \"The Limits of Control\", the moviegoer half-expects Jack to exchange matchboxes with the shady lady, but no, \"The American\" has a reverence for movie lore; it's not out to deconstruct the spy movie, rather, the filmmaker wants to slow the damn thing down. Mathilde(Thekla Reuten) simply gives Jack his next mission, his instructions, very old school, like something out of a Jean-Pierre Melville flick, or Fred Zinneman's \"The Day of the Jackal\", made so by the film's caterpillar-esque pacing and existential anti-hero. Moviegoers who pooh-poohed \"The Limits of Control\", in all likelihood, didn't know what Jarmusch(the most European of all contemporary American filmmakers) was deconstructing. \"The American\" knows. After all, wall-to-wall action doesn't ensue after Jack's briefing, instead the film goes into hibernation, a cocoon of deliberation and incremental suspense, before the chaos* begins, which is put forth into motion when Jack and Mathilde spot a rare butterfly during their \"picnic\". At its most self-reflexive, this ironically-titled film(in reference to its form and content, and historical context) offers a veiled critique of contemporary major studio films, as the Catholic priest(Paolo Bonicelli) doubles as an in-frame predictor of audience receptivity(some of whom will be bored by its retro tropes), when he criticizes Jack for making a guidebook on Italian architecture, even though the American possesses no sense of history(read: today's moviegoers watch films in isolation from the breadth of bygone eras and movements). Americans \"live in the present\" the priest offers, thus \"The American\" will seem tedious to them; the very same \"tedium\" which Jarmusch archly satirizes, this filmmaker celebrates as a narratorial elixir for the fast cars, fast women, and fast-vanishing ability of an audience to get lost in a story well-told. (*chaos theory- the butterfly effect)"
    },
    {
      "rating": "6",
      "text": "Essentially a vehicle to showcase George Clooney (who is r-e-a-l-l-y getting long in the tooth) and the Abruzzo region of Italy.  Clooney still has enough panash to make it bearable and the Abruzzo region, even in winter, is spectacular, but the story is tired and has holes in it big enough to fly a 747 through."
    },
    {
      "rating": "5",
      "text": "What did every one want? It was beautiful. You knew what was going to happen? The book I'm sure played out the conflicted character bit better than the film portrayed it, and so the film is weak there, but the rest works. Slow? Fast? Not enough going on? It was what it was, and because it was \"different\" I'm glad. Don't particularly care for Clooney, but unless a guy like this does this kind of thing, you won't see films like this in the theatre, and most folks would be glad of that, but I won't. I like throwbacks, homages, and a bit of do \"different's\". And over all it was fine. No, probably won't see it again, but then again, most films these days I won't. Can't usually, films don't get shown again in theatres much. Demise of life, that."
    },
    {
      "rating": "9",
      "text": "I think I might have been one of only two or three people in the theater who liked this movie... and I really liked it. To me this mystery thriller was about the assasin's (George Cloony)  failed escape from hell. There was a strong moral element to this film, personified by a wonderful early morning  scene in a park where an elderly Italian priest confesses to Cloony, and describes hell as a place where there is no love. That is the assassin's awful life. Although smooth and suave on the outside, and a guy who attracts beautiful women, Cloony's dark, haunted character is wracked by inner turmoil. I think the director is saying how utterly awful it must be to live like that - constantly in fear and without true friendship, trust and love.  This film unfolds slowly, but it is a beaut. For adults only."
    },
    {
      "rating": "0",
      "text": "Anyone who pretends to like this incredibly boring movie are akin to the villagers in the emperors new clothes. There are zero redeming qualities about this movie, except for perhaps the very end because I did not make it that far."
    },
    {
      "rating": "0",
      "text": "AWFUL. I know that when it comes to critiquing anything, if you give media an extreme rating like a 10 or 0, you'd better have good reason, otherwise you didn't take the time to think through the pros and cons.Sadly, I couldn't find anything i liked about this movie. Not ONE. George Clooney's appearance in this movie made hardly and difference. His acting was dry, emotionless, and just plain boring. All I could think about was: \"Oh. Look, it's Clooney\" through the entire abomination. He in no way delivered any kind of character of his own. Aside from this, the storyline itself was atrocious. Being based off a book doesn't make a movie good. Nor does it make it bad...it's how the book is interpreted is what really makes the movie. If anyone were to use a book with this sort of slow, serious plot (no, I have not read the book myself, only heard reviews) with vivid language and intense literary depth to make a movie, they'd better make it beautiful. This is not the case with The American.The trailers decided to play the movie off as if it were some action-packed shoot-em-up with George Clooney, with guns blazing and epic cutscenes that were sadly the ONLY bits of action through the entire film. The only thing I personally would applaud is the cinematography. But alas, this is completely ruined with the stale acting, poor dialogue, unnecessary scenes, limited character connection and development, little-to-none thrills and awful kick-in-the-crotch bad ending."
    },
    {
      "rating": "9",
      "text": "Brilliant and Beautiful.  See this movie if you are looking for a thoughtful meditation on the psyche of an assassin who no longer has the desire to work as one.  This is the story of a soul seeking something other than what he has, but he does not know what it is he is looking for or how to get it.  Rather than this being a violent and dull-witted or depressingly repentant movie, though, it is full of life and even hope.  There is action in the movie, but the action serves a purpose.  Thus, it is not an \"action-packed thriller\" (like the ad would have the viewer believe), as much as it is a portrait of a human being seeking transformation of a sort - if not of the religious variety, certainly of the spiritual.The cinematography was excellent - beautiful natural images, very striking bits of composition in various room and street scenes, and a wonderful use of color.  The storyline was somewhat canned, but the acting was very solid and some of the dialogue was exceptional in its deceptive simplicity.  I will keep thinking about this one for some time."
    },
    {
      "rating": "0",
      "text": "Excruciatingly boring...it is really hard not to fall asleep after about 15 minutes. Has nobody ever told the inexperienced director that the first and most important thing about moviemaking is change of pace ? The guy is a photographer from the weird side, I wonder how he got the money and the cast to make this film. In addition, looking at the depressed and distressed face of George Clooney for the full length of the film, without one inch of emotion, lifeless, bloodless, come on, get something out of this guy, you paid him to act for you.\rI actually lost sympathy for Clooney's character after 2 minutes, when he shot that woman in the back, for no apparent reason. It was disgusting, what exactly did she do to him ?\rMoviemakers should be just normal, average people, people you can relate to. Not weirdos..."
    },
    {
      "rating": "1",
      "text": "I joined Metacritic just to post a review of this godawful piece of junk. The worst movie I've seen this year. Excruciatingly slow (unless you like to watch Clooney do pushups and screw gun parts together). I was on the verge of walking out, but stayed almost in disbelief that nothing ever happened (except something you expect from the very beginning). I am amazed that Clooney would bankroll and star in such a stinker. Violante Placido (co-star) was nice to watch as were the austere mountain scenes of the Abruzzi region in central Italy. Save your money and spare yourself the agony of sitting through this."
    },
    {
      "rating": "5",
      "text": "Having read some reviews before viewing the movie and was prepared to enjoy the unfolding story......George Clooney had his character down pat.....the other actors filled the spaces to keep the plot moving.   If it was not for Violante Placido who played a prostituite who exuded so much character, brought some life into the mainly drab story....."
    },
    {
      "rating": "10",
      "text": "The American was not made for an American.  It's a work of art.  If you watch this movie expecting the Bourne Identity you'll be sorely disappointed, but if you have an open mind you'll realize the depth of the story, its characters, and its symbolism."
    },
    {
      "rating": "10",
      "text": "One of my least favorite movies of all time.  Walked out after an hour and a quarter.  Didn't care what happened to any of the characters.  Hope they all died in the end.  T and A, oh so ho hum and of no interest to me. Certainly didn't save this tedious film.  Clooney should keep his shirt on.  George, I loved ya, but no more."
    },
    {
      "rating": "10",
      "text": "I too specifically joined metacritic so I could put in my two cents worth on this film. Unlike the other reviewer I really did enjoy it., but I want to rant about a specific point. How hard must it be to find a competent firearms consultant these days? This was a movie about a gun for Pete's sake! 1) It was NOT an M14 as stated.  It does not have a \"rate of fire\" This was not a machinegun. It only fires one round per pull of the trigger. 2) Why in the world would they have seen fit to include the velocity of the round if they were going to get it wrong by a factor of ten? They claimed it had the velocity of a Daisy BB gun. 3) They reinforced the notion that movie style \"silencers\" are real while drawing a false distinction between them and the correct identification as a sound suppressor, and then proceeded to dub in the Hollywood magic sound of a silencer. I realize the average movie go'er doesn't give a flip about any of this stuff but for those of us that like movies like this specifically because we get a kick out of guns is it asking too much spend a buck on some competent technical advice. If you'll take it I'd give you my advice for free Mr. Corbijn."
    },
    {
      "rating": "9",
      "text": "In The American, George Clooney plays an assassin on a mission in Italy. With the intensity of Jason Bourne, he delivers an artful, exacting performance. This film is a fascinating addition to Clooney's work, but don't expect the dark humor he's known for in The Men Who Stare at Goats or O Brother, Where Art Thou? He's dashing but dead serious. There's no Daniel Ocean here.\r The American is an arty film adapted from the novel A Very Private Gentleman. Its scenes and close-ups are beautifully composed, like paintings. Cinematographer Martin Ruhe venerates the beauty and culture of Italy even as Jack (aka Edward Butterfly) carries out his dirty, murderous mission.\r But Butterfly's preparation is anything but dirty. Over a month he builds a gun and silencer with Zen-like discipline and concentration. With very little dialogue, Clooney keeps viewers fascinated with fastidious rituals (push-ups, chin-ups and daily coffee at a cafe).\r Violante Placido (the daughter of Simoneta Stefanelli, the actress who played Al Pacino's Sicilian wife in The Godfather), delivers a classy performance as Clara, a prostitute who becomes Edward's love interest. It is Placido who brings zest for life to the film. Her bedroom scenes with Clooney arouse and thrill. Yet the uneasy feeling that Butterfly can trust no one persists. Finally The American is about the meaning of one man's life. Paolo Bonacelli as Father Benedetto is the catalyst who gets Edward thinking about what he does and why he does it. When Edward calls his boss Pavel (Johan Leysen) to announce that this is going to be his last mission, it comes as no surprise.\r The American will appeal to seekers of a deep, thoughtful experience.  It is a meditative character study that some - but not all - Clooney fans will enjoy. There is a quiet elegance to this film. Dutch director Anton Corbijn crafted it with great attention to detail.\r The American has not won wide critical acclaim. But it is the kind of film that a box office superstar like George Clooney can choose to make."
    },
    {
      "rating": "10",
      "text": "this film is like cilantro.\rpeople either love it or hate it.\ri loved it.\r the above review was rejected by metacritic because it wasn't 150 characters long !"
    },
    {
      "rating": "8",
      "text": "The movie's character is a hitman of extreme solitude, but by the end of the movie, the character becomes a little bit more human by falling in love.  The suspense created within the movie leaves the viewer wondering what is about to happen next.  The plot was not as strong.  Probably because the director didn't have enough time to really open up everyone's character like the author of the book did.  George Clooney's did a really good job displaying the different facets and emotions of the character's personality.  In addition, the movie's European style of filming enhance the viewing experience because its different from traditonal filming.  By the end of the movie, I was kind of wondering what just happened, but looking back, I like this movie because it is so different.  There is also dramatic irony that will have the viewer pondering for hours when the movie is over!  See it for yourself."
    },
    {
      "rating": "6",
      "text": "Very suspenseful in parts and exquisitely slow moving in other parts with the camera stuck on Clooney doing exercises and other things, sometimes unexplainably. Clooney didn't have a lot of lines to learn.his charm doesn't show, not even a sparkle in the eye.   Lots of gratuitous violence and sex. Beautiful photography of the land. Despite the title, the film seems more a foreign film."
    },
    {
      "rating": "6",
      "text": "\"The American\" is certainly not a thriller in the action-oriented sense.  Oh, it's about spies and hit men and such and occasionally there's some shooting and killing and so on.  Certainly there are beautiful people to see and luscious scenery for them to be seen in.  But  I think this is really a meditation about what might be important in life, in the context of the main character being an aging assassin.  Unfortunately, if that's the case, it's a superficial meditation at best.  As I watched this movie I often thought of Terrence Malick's \"The Thin Red Line,\" a similar exercise in self-reflection albeit about war instead of espionage.  Certainly DeNiro's \"The Good Shepherd\" was more successful, in my mind, in contemplating the spy life.  Here, Clooney's portrayal of Jack, like the character himself, just seems worn out.  In the end, we are not surprised at all by the movie's resolution nor, I think, do we much care."
    },
    {
      "rating": "6",
      "text": "I didn't like its gloomy feeling. It was too much of an artsy film. I like its minimalist approach on a supposed-to-be action assassin film but the whole film was too quiet. Even the guns they use have silencers in it.Still a great performance from George Clooney, though."
    },
    {
      "rating": "10",
      "text": "Unfortunately, all of the people declaring this film to be boring make up the majority of the world we live in. Thankfully, not every movie is Armageddon, and some of us can enjoy a story without non-stop explosions and endless chase secenes. Clooney proves he is one of, if not the best, actors working today. Beautifully shot and thoughtfully paced, this is the kind of movie that used to get made more often, before focus groups took over the process. Thank you for this gem."
    },
    {
      "rating": "7",
      "text": "Based on Martin Booth's novel \"A Very Private Gentleman,\" this american production feels more like a European art-house film.  The lead role fits Clooney like a glove and with a costar to-fall-in-love-with Violante Placido, both in characters who are by default lonely due to their choice of profession, they bring emotional depth and substance to a carefully patiently crafted thriller."
    },
    {
      "rating": "10",
      "text": "This movie requires an attention span. It's a character study, not just another run-of-the-mill action movie, and if you know George Clooney, than you should come to expect a little more smarts in his films and observant writing, not just cheap effects. This is a terrific movie for a more mature audience."
    },
    {
      "rating": "7",
      "text": "Beautiful to look at, but holy crap, is it slow-moving. I'm ok with films with deliberate pacing, but this was far too tedious to watch. Clooney gives a subdued but effective performance, and Anton Corbijn is clearly a talented director, but the pacing prevents it from being a great film."
    },
    {
      "rating": "8",
      "text": "A Film Review By: Sam Fragoso\"The American\"***1/2George Clooney star's in Anton Corbijn's new action thriller \"The American\"ReviewThe film revolves around an older man, possibly a spy, and definitely a craftsman of some sort. We never really find out what he is, but we do know that he is dangerous and he is being hunted.Now people are comparing this film as the \"Eat, Pray, Love\" for George Clooney. I don't think so, yes Clooney is in every scene, but this is certainly not a travelogue of Europe and on top of that the supporting cast around him is the reason why this film works so well.However I think \"The American\" is an acquired taste and certainly not for everyone. I mean there is ten minute stretches without any dialogue and most of the film is without action, which is all-fine by me.The crowd I saw this film with was certainly not happy; they were bored, confused and angry that objects weren't blowing up. I however enjoyed every minute of it; it's beautifully shot in the Swiss Alps, Rome and a small little town in Italy.\"The American\" has beautiful cinematography through out, Clooney gives a great performance and though sometimes the characters seem to be to remote for us to care about \"The American\" is a good film and for my money one of the years best."
    },
    {
      "rating": "10",
      "text": "Brilliant movie that had me at edge of my seat the whole time. It's not just another boring action movie. Only intelligent people will enjoy this masterpiece."
    }
  ]
}