{
  "id": 4004,
  "title": "The Old Guard",
  "starring": [
    "Charlize Theron",
    "KiKi Layne"
  ],
  "runtime": 125,
  "genre": [
    "Action",
    "Fantasy"
  ],
  "description": "Four undying warriors who've secretly protected humanity for centuries become targeted for their mysterious powers just as they discover a new immortal.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cjr4NWURcVN3gW5FlHeabgBHLrY.jpg",
  "categories": {
    "plot": 3.7,
    "acting": 3.6470588235294117,
    "ending": 4.75,
    "soundtrack": 2.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.85
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Oh geez where to start.  It’s hard for meTo pin point what’s really wrong with this movie because it should have worked but after some real long thought I realized I was putting more effort than the filmmakers.Cast was fine, in fact it was better then this movie deserved but the dialog was bad. Almost like it was written by someone who thinks “yeah this sounds cool”.   At points the one liners where so bad I half expected the music cue from csi Miami to kick in.It’s just kinda bland in terms of cinematography.  The sets were serviceable, and the plot was... meh. Between the average action and bland characters and just horrible dialogue I just realized life was too short and turned it off."
    },
    {
      "rating": "0",
      "text": "woke virtue signalling drivel. Two gay immortal guys even kill a load of soldiers for making a gay joke as though the point is if you make a gay joke you deserve to die! They also happen to be a gay crusader and a gay Muslim lmao. We got strong women, women of colour! We got lgbtq! All white men in this movie are bad (except for the gay guy obviously)"
    },
    {
      "rating": "4",
      "text": "Unnecessarily woke. Too bad, acting was good and story could have been a solid one."
    },
    {
      "rating": "1",
      "text": "Wasting time reviewing this bland marketing-driven piece of \"entertainment\"ladden with all the woke clichés in the book is almost as bad as watching it. People who consider this moview good are either 13 year olds or haven't evolved passed this age (i.e. 70% of the population).1 point for setting a scene in Goussainville, the coolest town in the Paris region."
    },
    {
      "rating": "0",
      "text": "Terrible movie.............. waste of time............... sjw........... feminists"
    },
    {
      "rating": "5",
      "text": "Not even Charlize Theron can save this movie from shame. The Old Guard is filled in SJW agenda and has an unecessary gay kiss. Unfortunately this kind of thing is becoming commonplace in Netflix productions."
    },
    {
      "rating": "6",
      "text": "A typical Netflix movie, it starts out with a promising story, but that story is then plagued with SJW themes and elements that feel forced and come across in the film as either unauthentic or outright manipulative. The acting is generally good, and Charlize Theron carries most of the weight in this regard. The new immortal introduced early in the film is acted poorly and written horribly, and is thus generally unlikable. While much of the story is a bore fest, overall the movie is OK, and did a good job leaving itself wide open for a sequel by bringing in an intriguing character right at the end that had only been alluded to earlier in the film. 6/10"
    },
    {
      "rating": "0",
      "text": "Political propaganda wrapped into a movie. Typical Netflix. Stick with Highlander if you want a real movie."
    },
    {
      "rating": "2",
      "text": "Not a bad scenario. Very poor performance, lesbians, gays. I don't need this trash."
    },
    {
      "rating": "4",
      "text": "The movie wasn’t actually all that bad but the actress they picked to play the young black girl who was discovering her immortality was a HORRIBLE actress and is why I rated this movie at a 6. Had they picked someone who genuinely deserved the part and didn’t just get it because of diversity standards this movie would have been a lot better. Not any re watch value in my opinion."
    },
    {
      "rating": "6",
      "text": "Welcome back Streamers! This weekend I've chosen continue my quest to guard your eyes and time from middling movie quality. This is why I had to watch The Old Guard. The movie starring Charlize Theron debuted on Netflix this Friday. If you follow our IG page, you saw the trailer, but I've included it below as well. The Old Guard is a movie about a group of \"immortal\" mercenaries that are trying to avoid detection while completing their missions. I know you're intrigued. Sci-fi, action, and Charlize! I'll go ahead and sign you up. But let's see what we got.How many times can we watch an A-Team type of movie? Now, this A-Team can't die. How many times can we watch John Wick-esque violence? Actually, it is just that exactly what you think will happen happens. The trailer says it all. Okay, sure, we can watch this A-Team movie again. We love a rag-tag team completing missions. And yes, we can watch someone kick butt like John Wick all day long. That's what America is built on, violence! You're right! This cast works well together, except the newbie to the crew, KiKi Layne as Nile, added doesn't quite fit the vibe of the others. But I'm sure she will if they decide to do a sequel. *WINK* The problem becomes we've seen this movie before. Action sequences while good are the same as Underworld, Atomic Blonde, John Wick, etc. Those titles actually are a perfect mixture to describe this movie. Don't we deserve more! Then there's the storyline that is extra basic. Has creativity really been this lost even in the sci-fi genre? This just feels like a sad money grab.Ok, I'm going to lay into this one. Allow me some rope. Charlize, what are you doing?! I understand you're picking the same type of roles to play because you're BA... I get it... BUT YOU LITERALLY PLAYED THIS ROLE BEFORE. This movie is just your character in Hancock-you mixed with Bloodshot. I was going to say Wonder Woman mixed with Bloodshot, but then I remembered \"oh wait this is exactly what Charlize did before except she wasn't a housewife.\" Shoot, this might as well be that same character after her husband and stepson died and now she's on a rampage for a couple of centuries. I'm just saying, Charlize, I love ya in a action film, but you can take a break from playing this role for a little bit. You've got more in you than just fighting, getting beat up, killing people, and crying. You were still enjoyable in your monotone BA role. Don't even get me started on you, Chiwetel Ejiofor. Get that check, my guy, but also DO BETTER!Nevertheless, The Old Guard is what you thought it would be. Entertaining action that is sprinkled in between long drawn out predictable storyline sequences. You can keep this on in the background on a Sunday afternoon but otherwise, just stream this if you're bored. A handful of popcorn will be enough to get you through."
    },
    {
      "rating": "1",
      "text": "Boring. Politically correct rubbish again with all the correct boxes ticked, but no attention to making an interesting and entertaining film. Same sex relationships, girl power, all the required racial profiles included etc. The movie is unecessarily violent and seemed disjointed."
    },
    {
      "rating": "2",
      "text": "The boring old guard. Sorry, but this movie is another from Netflix that in addition to not being original is totally forgettable"
    },
    {
      "rating": "0",
      "text": "Terrible movie, The black girl is a terrible actress.The story is boring, the music has no place in it and feels weird. Worst performance of Charlize Theron also but she still performs way better than the rest."
    },
    {
      "rating": "2",
      "text": "This is woke on steriods and Netflix just keeps on giving!That's too bad because the concept of the story is actually cool and entertaining. But all the the PC stuff felt forced and pulls you out of the story. Also, the pop music they use in this film is out of place and down right ridiculous.Being a woman myself, I'm a big fan of strong female characters, like Ripley in the Alien series and Sarah Connor in T2, just to name a couple. Unfortunately, Charlize Theron was not able to pull it off with her forced tomboyish IDGAF behavior. It just wasn't believable. But kudos to her, she did the best with what she was given.Oh and I do take note what Netflix and the director of this film tried to villainize. But I'm not surprised anymore in 2020."
    },
    {
      "rating": "3",
      "text": "The Old Guard, which could also be named \"Old plot conveniences, New wokeness.\" A Bunch of immortals go into combat zones without useful gear, and are efficient because of plot armor. Walking through deserts without water or a mask in case of a sandstorm? No problem for these blank slates!The CIA is after them to extract hormones so that a cosmetics company can sell immortal juice. Then a fifth jelly fish human becomes immortal, and joins this band of uncharismatic catwalk models. For some reason the US Army has full female squads that have a serious lack of testosterone, but add just enough of that 'Let a woman do a man's job' expression, only to **** it up even worse.Characters can teleport across continents, and have a compass in their brains. Next to that, the \"bad guys\" are also telepathic as they are able to track a bunch of ghosts with no explanation. And if you are a side character, you are useless and just their to comment on how cool the main characters are. So juvenile. Conversations are hollow, with no believable weight behind them. It's like these people have major insecuritie issues, and need constant acknowledging that they are \"good.\" It reminds me so much of Gemini Man. I hate Gemini Man. Question: Why, if they are immortal, do they keep doing things that get them killed? For a bunch of deadly warriors, they aren't very good at staying alive without convenient immortality. They don't question the higher reason behind their immortality, but instead just kill. What a waste. This movie is the definition of contrived, feminist and lazily written fan fiction. It's just entertaining enough that it will keep you interested in seeing where it ends, but it will make you roll your eyes the entire time. It's a terrible movie. I give it a 3/10."
    },
    {
      "rating": "4",
      "text": "Incredibly cliche storyline and bad script.  Awful acting by the drug company owner and the young girl immortal.   Just a lazy overall effort.   Do better hollywood.  Also, how does Charlize Theron end up in this mediocre movie?  Talk about a waste of talent."
    },
    {
      "rating": "1",
      "text": "I´ve seen bad movies, but this was a surprise! The script was wore than I thought it would be, the dialogue is horrendous, sloppy, the plot is predictable, the music is terrible, the only passable thing was actually the acting and the sound design..."
    },
    {
      "rating": "4",
      "text": "A waste of a good concept. I was expecting something like the manga \"AJIN\", but this is just an action movie where good guys revive. They dont exploit the inmortality aspect at all and the actions scenes are just poor.  One scene, when they are fighting they way out of the lab is full of errors, corpses moving or different guns..."
    },
    {
      "rating": "0",
      "text": "Интересно, целое женское подразделение в боевых действиях участвует, что вообще то запрещено в США, но в рядах частной армии женщин нет. Мужчины либо злые, жалкие и предатели, но если геи и негры, то положительные герои. В одних ситуациях они умирают и воскресают в других не умирают. Драки, перестрелки полная дурь. Сюжет говно, как и в целом весь фильм. Смотрел из-за Шарлиз :)"
    },
    {
      "rating": "3",
      "text": "Фильм можно охарактеризовать одним словом: скучно :(. Кроме того, что Шарлиз Терон затащили в каст и научили неплохо махать руками и топором, а также разбрасывать мужиков в стороны, похвастать нечем. Большую часть фильма все ходят с минами на лице, как будто хотят чтобы их быстрее убили..."
    },
    {
      "rating": "2",
      "text": "You could easily replace Charlize Theron with Steven Segal and the quality of this movie would stay the same. That should tell you just how lame it is. It's worse than bad, it's boring."
    },
    {
      "rating": "3",
      "text": "Todo potencial do filme é ofuscado pela clara decisão de girar tudo em torno do resultado, e não trabalhar na premissa de forma geral. Muito comum por parte da Netflix, diga-se de passagem.Imortalidade é um tema rico, carregado de ideias desde grandiosidade a melancolia depressiva. Dito isso, sabemos que a abordagem aqui poderia acontecer de diversas formas. Porém, ao invés de trabalhar temas do gênero, o filme resolve entregar o que a maior parte do publico quer ver e tenta ser vago de toda forma possível, para que qualquer um possa entender o que está se passando na tela.Primeiro de tudo, os temas abordados não são ruins, mas a forma como eles são apresentados - de maneira vaga e com uma seriedade ilusória - é o que mais me irrita. A obra aborda homossexualidade, emancipação, representatividade negra, melancolia, loucura, solidão etc; e se eu não conhecesse a netflix, diria que os três primeiros temas ditos acima só tem um espaço na obra pra agradar o publico em geral. Não há impacto na trama quanto ao relacionamento de Joe e Nicky; A emancipação da protagonista, Andy, soa forçada e militante, visto que seu desenvolvimento é nulo e nunca fica claro o porque ela é a BOSS - me desculpem, mas umas cenas de ação e o fato de que ela é a mais velha não me convencem. Inclusive, aquela cena onde os personagens explicam o sonho da Nile, quanto ao passado da Andy, é uma forma terrível e conveniente de desenvolvimento. [Não que a obra tenha alguma verossimilhança. A suspensão da descrença não funciona pois ora a obra se leva a serio demais, ora ela é padrão Netflix]. O Plot relacionado ao Sebastiam é tão mal feito que eu me pergunto: se não acontecesse, faria diferença? E também me leva ao questionamento: quem é mais ingenuo, este personagem ou James Copley, que realmente acreditava numa \"mafia farmacêutica\" [isso soa tão idiota...]. Já o vilão é um estereotipo podre da... industria farmacêutica? da ciência? da loucura humana? Não sei. Parece que a obra não quer ofender ninguém e se perde na caracterização do mesmo.O filme tenta meramente abordar melancolia, falta de crença e outros temas relacionados. Mas os diálogos são pobres e limitados. O mesmo acontece quando tentam pôr um peso aos personagens - no que se diz respeito a idade deles. Outra coisa que me incomodou foi o \"fan service\" de citar o Brasil. Isso só prova mais uma vez que cinema autoral na netflix está longe de acontecer em diversas obras. São paulo está longe de ser relevante, mas \"vamos mencionar, assim o publico brasileiro fica contente pelos 2s de atenção.\"As cenas de luta são bem coreografadas. Porém, senti falta de um melhor trabalho com a cenografia quanto as coreografias. A cinematografia não é muito clara e não passa muito bem a geografia do local. A trilha sonora é peculiar. Não sei muito bem se essa adição de musicas pop funcionam numa obra cinematográfica cujo tema é meramente sombrio.Por fim, a Netflix escolhe mais uma vez seguir a formula magica do dinheiro, se distanciando cada vez mais do cinema autoral, e tirando a oportunidade de obras que realmente tenham o que dizer e saibam como o fazer."
    },
    {
      "rating": "3",
      "text": "The beginning is actually really cool & enjoyable. I like the concept, but it gets old very quickly. This movie is packed with so many tired & overused cliches it's unbearable. The plot is so dry & predictable I had to stop & take a break from the movie. No disrespect to Kiki Layne, but please make sure your lead actor is actually at that caliber before hiring them to carry a movie. I don't know, it very well might have just been the rudimentary dialogue  & Kiki is actually a phenomenal actor. It is honestly hard to tell. The ADR is sloppy & the music is too on the nose. It's easy to tell that the music was chosen specifically because it featured words that described what was happening in the movie, not because the songs actually fit the tone of the moment. If I could give one piece of advice to the creators of this film it would be this, \"Show, don't tell\". By this I mean that you do not need a character verbally explaining or commenting on every single action. There are plenty scenarios that can visually explain things without a character saying \"empty?\" Or repeating another character's statement as a question. Also, the whole thing at the end of a movie where \"the mentor repeating a phrase to the new kid that they said earlier to hint the kid in on the plan\" thing is not only played out, but it made no sense here either. It was a poor call back, & it strategically made no sense. It worked though, because... you know... they're the heroes. Netflix, I'm not mad... I'm just disappointed."
    },
    {
      "rating": "3",
      "text": "Good acting by great actors and a few new ideas about a \"superheroes\" movie even though they don't have superpowers. I love the diversity in the cast and even in the characters.I am also all for giving a chance to the directo. However, I can't believe the reviews I am reading from \"reputable\" movie critics. This movie has a lot of holes in a very conventional script. Some ideas are taking from other movies -i.e. \"The Immortals\" everyone?-. Also, some of the lines are just there to give you background stories, not because the plot requires it or the character should be saying that. Another thing that I found very, very poor is the action sequences and the editing. I just couldn't believe what my eyes were seeing considering the actors in it. A very weak, average movie that tries to set up a franchise with nothing to actually feel like it deserves it.Don't believe the great reviews that you are reading from prestigious newspapers. I honestly think they are praising this movie for different reasons not for the quality of the film."
    },
    {
      "rating": "2",
      "text": "Just nonsense absolute... I won't be able to look at Charlize Theron the same way for accepting this role. The future of cinema looks bleak."
    },
    {
      "rating": "3",
      "text": "kinda entertaining, bad plot, bad writing, bad directing. you already know everything there is to know about this movie. if you find yourself with too much time and need to shut off your brain, you can watch this in about half an hour"
    },
    {
      "rating": "2",
      "text": "My gawd a crappy highlander ripoff served in the skin of Netflix leftist agenda. Boring uninteresting bland and inoffensive. Just watch the older highlander movies or series instead. Youll thank yourself later."
    },
    {
      "rating": "6",
      "text": "Wow, big pharma sure is thrilling... And sadistic. And psychotic. Maybe just a tad too \"on-the-nose\" for the \"evil mastermind\". Come on - he's supposed to be a CEO for a successful pharmaceutical company. He comes across as a complete lunatic.The first half of the movie builds up some interesting plot lines to explore. But when it ends it has barely scratched the surface of any of it. It skips merrily along without daring to go dig deeper. And ultimately that kind of ruins the movie as a whole. There's almost no pay-off. It feels like the movie itself doesn't even know the answers.But it hints strongly at a sequel, so maybe they just decided to not reveal any of it in the first one. Kind of silly if you ask me.It was entertaining enough. But the characters often strayed too much from what I could bring myself to believe they'd ever do or how they'd react to the situations they are in. And the amount of \"I can't tell you that right now, so I'll just do something stupid to avoid answering\" was off the charts.Yeah, so not a bad movie. It just doesn't do much with the potential it has for something better or more interesting."
    },
    {
      "rating": "6",
      "text": "It's a decent adventure, if somewhat predictable. Since it's an action movie I kind of expect that. It's not going to grip you and make you think, but it's entertaining. As a review of an action movie I'd probably give it an additional point. It's definitely set up for a sequel. My 12-year-old daughter thought it was great, so take that for what it's worth."
    },
    {
      "rating": "3",
      "text": "I have to start by saying I did not read the comics.Also, being a highlander fan, I thought the immortality theme could go either way. But I enjoyed it, the way it was presented was done in a smart way, making you understand these characters were intended to have some depth. But then it all started to feel like a cliché. Super predictable. The betrayals and twists. The greedy villain with millions in the bank, a mercenary army for hire and zero depth to his character (we needed another one of these right?). The music used was dreadful (low quality EDM really?) and didn't match any scenes. The fight sequences with blades or blunt weapons felt far fetched but I have to say Charlize did look cool holding her axe. The dialogue was also very weak at certain points.As positives, some acting was good, and you do feel curious about the history and power of the characters. I really liked the relationship between Nick and Joe, and would have loved to see some flashbacks to its start back in the crusades. Felt curious about the character in the flashback, that is dying with Andy and Quynh next to him, but there was no explanation for this moment. I felt like he knew more information about the immortality powers and had been around even before Andy, nonetheless we are left wondering.Maybe it will be mentioned in the sequel?Will still give it a rating of 3 since it has some enjoyable moments and I would watch a sequel, regardless of the various moments that made me cringe."
    },
    {
      "rating": "3",
      "text": "You have a movie where the main characters are centuries old warriors, with experience that makes them the world's most elite special ops team; on top of that they also cannot die. Okay, I guess they must be up against something serious.....vampires, demons, terminator-style robots? No....basically it's them against Martin Shkreli, the PharmaBro.I have no idea how a writer and director can take a talented cast and huge budget and still turn in something so unimaginative, derivative and boring. At the beginning I thought to myself, \"How cool would it be if this was a stealth Highlander reboot\" and they'd completely hidden it from people until release. Unfortunately not. It's apparently based on a graphic novel and has none of the heart, drama or uniqueness of the earlier movie. Overpowered main characters kills waves of faceless drones in a story that seems like it would work as a pilot for a tv series (where you would hope the seasonal arc would introduce antagonists of actual weight) but as a movie It is a by-the-numbers as they come."
    },
    {
      "rating": "5",
      "text": "Not sure how this movie is getting good reviews - mediocre production value, mediocre acting. Really nothing great."
    },
    {
      "rating": "0",
      "text": "J'ai vu l'affiche et l'affiche est bien jolie, surtout parce que Charlize Theron est dessus et que si elle n'est pas une actrice faramineuse, son charme est toujours bel et bien présent, sans compter qu'elle ne voit pas le temps passer : toujours aussi belle ! d'ailleurs je me demandais quelle version je préfère et après avoir cogité pendant des heures ici et là sur le trône, de loin en loin et de temps en temps, je crois que je me suis enfin décidé...Je dois dire que cette espèce de film m'a aidé également (à me décider) histoire aussi de passer le temps, car cette daube Netflix dure deux plombes entières à mourir d'ennui ! alors à l'issue ou plutôt à l'arrêt de cet étron Netflix (un de plus dans la collection \"N\") j'ai choisi quelle version de Charlize je préfère : c'est la version brune !Cela étant dit (et décidé) il faut bien parler du film, de cette espèce de \"film\", de ce grand vide de téléfilm de deux heures qui brasse des brassées de rien mais surtout de merde pendant deux heures complètes ! ça tient quelque part de l'exploit, car meubler à ce point aussi longtemps avec \"rien\", on en revient pas... l'action (assez mal faite) est pourtant présente parfois mais c'est comme si il ne se passait... rien. Un prodige, vous dis-je !Du coup, pour moi qui n'ai pas vu les \"Twilight\" (pas assez de courage...) je me demande si Old Guard est aussi pathétique que la saga Harlequin des vampires niaiseux ou si c'est plutôt le contraire : faudra-t-il une photo à l'arrivée pour les départager ?Bon donc, j'aimerais quand même parler de cette production, de cette énième déjection Netflix plus en détail mais je n'ai pas trouvé dans ce \"machin\" assez de matière pour en parler. Il vaut mieux se torcher le cul avec, que ça serve au moins à quelque chose !"
    },
    {
      "rating": "2",
      "text": "Awful. Bad acting, bad script, appalling dialogue and cheese. And the worst thing about it was the music."
    },
    {
      "rating": "4",
      "text": "Good idea, good actor casting, awesome Charlize Theron.But so badly storyline... So sadly, i really waiting this movie"
    },
    {
      "rating": "2",
      "text": "Plain trash. No logical plot, pictures are boring, acting could be better. But political correct :-)"
    },
    {
      "rating": "5",
      "text": "One of the few movies who actually gives backstory to its side character with decent action sequences. But for real what's with the music choices?!?! A film which is bland in most of its scenes suddenly plays Silence by Khalid x Marshmello. It's just a bad film experience."
    },
    {
      "rating": "5",
      "text": "Let's be honest here. Charlize Theron is good but she can't carry this one. There are way better movies about immortals. You won't find any interesting characters, stories or ideas here, only some cliche plot and ok(ish) action scenes. I don't see this becoming franchise like they hoping for."
    },
    {
      "rating": "1",
      "text": "This movie is another to remind me that they really will make anything these days, seems they just greenlight everything nowadays and not just that but throw money at it aswell. Netflix seem to like to cast a large net hoping that one or two catch on. The problem with this is the market just becomes saturated in mediocrity. Such a boring film which had nothing to say for itself despite having Charlize Theron as the lead. A dull film with no message or meaning but no action or entertainment either like so many others i've seen recently. It can't of looked any better on paper when they looked at the script. The standard within the movie industry really has dropped considerably over the last couple of years."
    },
    {
      "rating": "2",
      "text": "This movie has it all: bad acting, poor directing and predictable and forgettable story. Waste of time. This movie is good... if you want to yawn and fall asleep."
    },
    {
      "rating": "1",
      "text": "If you haven’t seen “The Old Guard” on Netflix, you simply must. The amount of anti-capitalist, diversity and inclusion heroism is breathtaking.  So it starts off as a standard issue shoot em up “John Wick”  type action movie. An hour later you’re entangled in the love story of interracial, warrior lesbians. You’re witness to a totally plot irrelevant, interracial, homosexual man on man kiss, preluded by a love poem.  You witness the brave actions of an entirely minority, female, Marine combat platoon in action. Those things are all over Afghanistan these days, from what I hear . And finally, it’s topped off with the incredibly gory, graphic, and extremely satisfying death of the irredeemably evil, white, cisgender male capitalist who runs a pharmaceutical company... for profit!  So good. A must see. Not a Marxist propaganda film at all."
    },
    {
      "rating": "3",
      "text": "Dumb action fantasy film where all the fantasy tropes don't serve any purpose and the action is okay tier with a super bad script and story. Some fight scenes are okay."
    },
    {
      "rating": "4",
      "text": "Very predictable and boring, tonnes of cliche..., you'll forget it next day"
    },
    {
      "rating": "0",
      "text": "Stupid and naive movie with awful soundtrack, but first of all it’s just boring"
    },
    {
      "rating": "2",
      "text": "I wish The Old Guard would just STAY dead! There's a scene towards the middle of the film where a young immortal woman is trapped in a steel box and thrown to the depths of the ocean where she drowns, comes back to life, only to drown again for 500 years.That is what watching this Netflix movie feels like - 2 stars."
    },
    {
      "rating": "3",
      "text": "Flat uninspiring characters. Boring story. Some good action which does not justify a ticket."
    },
    {
      "rating": "6",
      "text": "Solid popcorn movie.KiKi Layne's acting is so far below her co-stars that it makes every scene cringeworthy. She is such an undeveloped actor with less than half as many credits as any of her co-stars, she was way out of her league. Charlize Theron's stunt acting was amazing and left her co-stars in the dust. Every actor's fight scenes were hyper-cut besides Charlize. This left me excitedly waiting for her fights."
    },
    {
      "rating": "3",
      "text": "Now mind you, I am crazily mad about Charlize Theron, So any movie that she does, ad s an extra star or two for me. That being said, why do they keep on trying to put her in these action hero-based movies? Trying to make a woman that weighs 90 lb soaking wet doesn't work. Okay plot line, but it just becomes a little bit too woke after a while!"
    },
    {
      "rating": "3",
      "text": "Sounds track is bad, story line is cliche action is ok and annoyingly woke like all Netflix movies"
    }
  ],
  "recommendations": [
    "jumper",
    "shadow_in_the_cloud",
    "suicide_squad",
    "jolt",
    "battleship",
    "teenage_mutant_ninja_turtles",
    "infinite",
    "the_tax_collector",
    "max_steel",
    "the_new_mutants",
    "men_in_black_international",
    "xxx_return_of_xander_cage",
    "lockout",
    "bloodshot",
    "wonder_woman_1984",
    "mile_22",
    "transformers_the_last_knight",
    "poseidon",
    "the_twilight_saga_eclipse",
    "hitman_agent_47",
    "i_am_number_four",
    "wild_card",
    "doctor_strange_in_the_multiverse_of_madness",
    "sabotage",
    "next"
  ]
}