{"id": 3885, "title": "The Eye", "starring": ["Jessica Alba", "Alessandro Nivola"], "runtime": 98, "genre": ["Drama", "Horror", "Thriller"], "description": "Violinist Sydney Wells was accidentally blinded by her sister Helen when she was five years old. She submits to a cornea transplantation, and while recovering from the operation, she realizes that she is seeing dead people.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9N3znJ8sHH2EQjARCrUpxMj3hWd.jpg", "categories": {"plot": 4.25, "acting": 3.4285714285714284, "ending": 4.625, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 5.0, "funny": 5.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "They did a great job on close-up pre action \"jump\" shots. A great way to catch attention. For the writers of this movie, mad props. 10 out of 10."}, {"rating": "4", "text": "Lot of \"been here done that\" feel. Some jumps in there for sure, and from what I could get from the audience the elevator scene was the creepiest. The movie has a slow build, starts to confuse you, then throws Sydney into survival mode while her \"friends\" do the cliched horror movie \"there's nothing wrong, it must be you\". There could of been some devious twists near the end of the movie, but instead they take the safe route. Alba/Sydney would of made a great villain in the end because the sugar and spice Sydney never really changes as a character. Love the death escort guys...evil looking grim reapers that no one has ever reported from real near death experiences, but at least they're creepy. Rent it, unless you enjoy sitting around annoying teenage kids. One last thing movie makers: please put an end to ghost kids and their echoy sounding voices. I truly have had my fill of the ghost kids and think \"cheap\" instead of \"creep\"."}, {"rating": "10", "text": "Why are critics always pretentious arses? It was scary and entertaining, cant ask for much more in a horror film."}, {"rating": "10", "text": "This was one of the better movies that I have seen all year. Even though most people did not care for it, it was phenomenal. I especially liked the first person camera view because it was more lifelike. Most people did not like it because it was different, different than the average camera shot. There is so much creativity put behind this movie that it is unbelievable. Yes, the camera is shaky but that is what makes the movie much more believable. After watching through what appeared to me as the video camera I found myself more into the movie. As if I was really there and I had the tendency to flinch and jump once in a while. Overall it was a great movie. It was a little short but I am Legend and Rambo are too. This is like the Blair Witch project mixed with Godzilla. Only recommend seeing though if you enjoy sci-fi movies and movies like Godzilla."}, {"rating": "4", "text": "it was ok, less then avg. The beginning was cool but it just went downhill from there. If you've seen The Ring movies, then this is pretty much the same thing. You can almost place $million bets on the exact times of big stunners. I would rent it. Bottom line: Rent this movie, don't waste 9.95 for the movie ticket + $40 popcorn Its kinda like the whole Japanese movie conversions have been sucked down to their last drop of sweet nectar, and this is the aftermath."}, {"rating": "2", "text": "Terrible remake and goes to show that some films which make good ghost stories are better off seen in the original format. Hopefully Hollywood will spares us remakes of The Eye 2 and Eye Infinity."}, {"rating": "3", "text": "It's basically the same as the original but is a thousand times more exaggerated. The original is more natural to make you believe more in the story, since the remake makes it all far-fetched, unrealistic. It's decent, but only for a change, the original is better. Hopefully we've got the beautiful Jessica Alba collaborating with the look of the film. The story is interesting and plausible, has some good scenes of shock, although not being many and not giving so afraid and the performances are reasonable. Jessica Alba played fairly better than I expected."}, {"rating": "1", "text": "What even is this movie? The script goes everywhere, the acting is all over exaggerated, and the characters are bland at best and silly at worst. There were one or two good scares, which prevent the movie from getting a \"0\" but man is this one bad. Jessica Alba is ok, I guess, but this is really, really bad."}, {"rating": "1", "text": "Dull, insipid, horrendous, pathetic Hollywood remade (AGAIN) of very good Asian Horror movie. Avoid unless you have a taste for the naff."}, {"rating": "5", "text": "Not bad! Maybe I had low expectations."}, {"rating": "0", "text": "This had to quite honestly the worst movie I have ever seen. The Chinese version of this film is awesome. But this movie was so overly horrible. They are shooting the Camera on Jessica's ass in so many angles. It's really pathetic. In a scene she is getting into a vehicle and the camera is on her ass. Honestly, what a horrid movie."}, {"rating": "1", "text": "Pure crap, we've seen it all before."}, {"rating": "5", "text": "Hmm, well, its a horror film starring Ms Alba, what do you expect?"}, {"rating": "9", "text": "Anything with Jessica Alba is amazing in my opinion. She could take a crap on a movie and its good."}, {"rating": "5", "text": "There's no reason why Sydney(Jessica Alba) should be blurry. A disciplined filmmaker would understand that only the violinist's POV shots have an intellectual basis for being out of focus. \"The Eye\" is out of focus, but so, too, was Oxide & Danny Pang's \"Gin Gwai\"(the original 2002 Hong Kong/Singapore production), in elucidating with clarity as to how the recovering patient could be the caretaker of the donor's visual field. Sydney received the woman's corneas, not her brain. How the heck do eyes(taken out of context from its neurological system) remember the past and predict the future? Although the film's science tends to be on the myopic side, \"The Eye\" isn't lazy in creating sympathy for Sydney, who seems genuinely oblivious to her glamour. She's not modest; she's a naif, in her understanding of how men are. After a lifetime in the dark, everything(and everyone) is beautiful to Sydney. During their jaunt across the Mexican border, Sydney never asks Dr. Faulkner(Alessandro Nivola) if her actual face(the face she's unaware of) is the motivating factor for his sudden eagerness to help track down the donor. Sydney attributes Dr. Faulkner's change of heart due to his waning skepticism towards supernatural occurences. Thanks to a \"Rescue from Gilligan's Island\"-like ending, Sydney never learns how to be vain. The friends we meet at her \"welcome home\" party are a collection of voices to Sydney, not faces. Because \"The Eye\" borrows its climax from a bad 1978 made-for-television movie, Sydney never learns the cold-blooded art of social climbing."}, {"rating": "4", "text": "Not completely terrible, but there wasn't very much to like!"}, {"rating": "3", "text": "\"The major problem is the death of a horror film: It's startling, but not particularly scary,\" writes The Onion's Tasha Robinson. Well, it's a PG-13 film, Ms. Robinson; that should be your clue."}, {"rating": "2", "text": "Just a bad copy of a average movie... Hollywood stop doing this kind of things."}, {"rating": "5", "text": "I was never convinced with the story, therefore I never found the movie compelling, and it should have been. Jessica Alba tries, and I commend her for her effort, but the story just never gels. Nice try but no go."}, {"rating": "3", "text": "One of the worst movies ever done... They kind of missed the whole point of the original material."}, {"rating": "1", "text": "It is a dull movie based on a dull written script. The only good part was Jessica Alba, or should I say \"parts\"."}, {"rating": "8", "text": "Great movie , huge twist at the end, and just the idea of the movie is messed up."}, {"rating": "2", "text": "Not scary, a few \"spooks\", but not horror-film-genre-worthy. Had no plot, or a very poor one at that. Nivola, the \"counsler\", is the worst actor i've seen in a long time. Wth, Is he fresh out of summer camp acting school? The ending was pretty much irrelevant to the plot, Alba was a pure disappointment, and the sorry never not lacked, because it never built a plot! GLAD I WATCHED IT ONLINE FREE!!"}, {"rating": "3", "text": "Predictable at every turn. The ending was weak. I'm sure the meat of the story was lost somewhere in the editing session."}, {"rating": "7", "text": "To be expected, the most effective fright scenes take place at night, when Alba's character is alone in her apartment. However, the film deserves kudos for including more than one scary moment in broad daylight with people around her. Yes, many are easy jump scares, but in others, it is the tense buildup that makes it so fun to watch. However, the third act of the film, despite a visually impressive climax, is rather weak, full of slow and uninteresting explanation. Even so, this is a pretty solid PG-13 horror, and manages to retain the eeriness of the original."}, {"rating": "10", "text": "It was Okay, same Level like Gothika, nothing New but for sure no complete time waste, light Horror Moviewith a Sexy Jessica Alba to stay Tuned and an satisfied Ending."}, {"rating": "5", "text": "Not as bad as it could be. But its not nearly as good as could be either."}, {"rating": "7", "text": "With the exception of Jessica Alba being annoying (it seemed to me she was more focused on looking pretty than acting) and a laughable stunt at the end to try and tack on a greater meaning to the film, it was compelling and quite frightening at times."}, {"rating": "8", "text": "It's actually not a bad remake at all. The acting was not bad, the movie was entertaining and the movie was well made. If it wasn't fort he original japanese movie, this movie would definitely not have that bad of a reputation."}, {"rating": "4", "text": "\"The Eye\" was very frightening , very boring , because we were left blind bored , but I have more to say in the movie for understand , except for Jessica Alba."}, {"rating": "6", "text": "Blind woman who gets an eye transplant starting seeing deaths before/after they happen so travels to Mexico to find out about her eye donor with her terrible doctor."}, {"rating": "8", "text": "lionsgate has every weird movie but this one was nice even with a really stupid story"}], "recommendations": ["slender_man", "ghost_rider_spirit_of_vengeance", "the_curse_of_la_llorona", "dead_silence", "annabelle", "the_possession", "malignant", "ouija", "the_grudge_2", "the_bye_bye_man", "chernobyl_diaries", "devil", "house_at_the_end_of_the_street", "dark_skies", "the_grudge", "into_the_storm", "shut_in", "the_haunting_in_connecticut_2_ghosts_of_georgia", "insidious_chapter_2", "book_of_shadows_blair_witch_2", "insidious", "the_mist", "the_possession_of_hannah_grace", "hereditary", "the_amityville_horror"]}