{
  "id": 4856,
  "title": "The Other Lamb",
  "starring": [
    "Raffey Cassidy",
    "Michiel Huisman"
  ],
  "runtime": 97,
  "genre": [
    "Horror",
    "Drama",
    "Thriller"
  ],
  "description": "For her entire life, the cult she was born into has been all that teenage Selah has known. Along with a band of similarly cloistered young women she lives seemingly unstuck in time, cut off from modern society in a remote forest commune presided over by a man called Shepherd, a controlling, messiah-like figure with a frightening dark side. But when her insular world is rocked by a series of nightmarish visions and disturbing revelations, Selah begins to question everything about her existence—including her allegiance to the increasingly dangerous Shepherd.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/ynPJkpmWNi4rnDUb0PuzDnJj5JI.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 4.5,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This movie shouldn’t be considered part of the horror genre and holds very little suspense through out. What little suspense that does hold until the end just boringly flickers away like a candle wick that’s been burning way too long. A candle wick that was hardly lit to begin with. Just flat out boring. A misogynistic  abusive villain that’s easy to hate, a dark atmosphere, and a pretty solid lead actress are just wasted by slow moving, dull scenes and in your face abstract symbolism that never really peaks. Snooze fest."
    },
    {
      "rating": "5",
      "text": "A recurring problem in artsy horror films that I'd already mentioned previously and that unfortunately manifests itself again in this film is that some filmmakers are disguising simple stories in packaging that look great and although I must admit the presentation will always matter, when you look beyond the visuals, you will notice all the other important elements missing.Honestly, The Other Lamb didn't seem like a bad film but it was kinda irrelevant.It's not like it's saying something new about cults and the blind submission into which the people involved usually fall, because you really know that that is always bad for everyone: Women, men and the children who unfortunately are born into that reality.A clear but necessary problem for the story being told is the evident dissent of the main character played by Raffey Cassidy and that is that despite not knowing anything from the outside the world, her rebellious attitude doesn't imply anything more complex than what appears and the film never delves into something more meaningful nor gives a more essential dimension to the rest of the women involved.And as I said it's there when the general weakness of the film is revealed and although it tries to continue attracting you with its visual beauty, it's more than evident that this is only a pretentious element to try to give a more enigmatic and profound aura to something that doesn't really have it."
    },
    {
      "rating": "6",
      "text": "Creepy cult leader makes his group of women really far, kills his wives, promotes his daughters into wives and every time he uses the word, \"grace\", he is really referring to his penis."
    }
  ]
}