{
  "id": 1601,
  "title": "The Hot Chick",
  "starring": [
    "Rob Schneider",
    "Rachel McAdams"
  ],
  "runtime": 104,
  "genre": [
    "Comedy",
    "Fantasy"
  ],
  "description": "Not only is Jessica Spencer the most popular girl in school -- she is also the meanest. But things change for the attractive teen when a freak accident involving a cursed pair of earrings and a chance encounter at a gas station causes her to switch bodies with Clive, a sleazy crook. Jessica, in the form of the repulsive Clive, struggles to adjust to this radical alteration and sets out to get her own body back before the upcoming prom.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lnnGE4TKa05t20SZ2batuAhXCp4.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.75,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.944444444444445,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "You're gonna laugh out laud with Rob Schneider if you choose to watch this movie! I highly recommend it to any positive human being and to those who want to watch something that will make them laugh!"
    },
    {
      "rating": "8",
      "text": "Haven't laughed so hard in a while. So much fun. Definitely in my top 5 best comedy movies."
    },
    {
      "rating": "7",
      "text": "The Hot Chick is a pretty stupid film if you look closely but there was something about it that made it enjoyable. Hilarious mindless crap that isn't that bad."
    },
    {
      "rating": "7",
      "text": "The movie was completely demented, but I laughed a lot. Simple story with a lot of crazy characters that just seemed to work. The movie is what it is. Stupid, but pretty damn funny."
    },
    {
      "rating": "7",
      "text": "I love this movie! it's super funny and the parts are Perfect!! I don't get the negitives on this movie???!?!?!? I love it! Watch it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "This is a surprisingly funny movie. The acting is not very good and the plot is ridiculously stupid, but the movie doesn't take itself seriously and even laughs at other popular early 2000's teen movies. While the movie is not for everyone, it's still a solid comedy."
    },
    {
      "rating": "10",
      "text": "Have you seen the movie “The Hot Chick”? Because I did and it is one of my favorite movies. In the movie, two characters switched bodies by ancient curse earrings. A young teenager named Jessica stole ancient earrings in a store that has a curse where if each person has one earring they will switch bodies. Jessica and Clive both had the earrings on. Jessica and a man who is a criminal named Clive swap bodies in the movie.They had no idea until they woke up the next morning. They were confused, shocked, and scared. The main character in this movie is basically Clive in Jessica’s body the whole time. I feel like Rob Schneider the actor did a good job acting the role of Jessica’s character.  Rob had to act like a girly girl the whole movie. Also, Jessica in Clive’s body was trying to tell April that she’s Jessica but April wouldn’t believe her. April thought it was just an old crazy man trying to kidnap her. Then, Jessica’s friends were trying to find Jessica to take the curse away and to get Jessica’s body back. Jessica’s boyfriend Billy was depressed because he felt like Jessica stopped loving him and he also missed her. Jessica in Clive’s body was trying to tell him that he is Jessica but Billy wouldn’t believe it. I think Billy also thought he was an old crazy man and doesn’t know what he’s talking about. But in the whole movie Billy thought he was crazy. I like this movie because there were really funny scenes. My favorite part is the pillow fight, because they were hitting each other aggressively and getting hurt and it was entertaining to watch. The lessons I learned from this movie is be kind and don’t judge others or you will get bad karma like what happened to Jessica and Clive. I think others will learn the same lessons like mine. The type of group of people that would like this movie is teenagers and LGBT communities. I would recommend it to them to watch it, because you can relate to it and it has a lot of funny parts. I would not recommend it to adults or kids. For example, kids will find it weird and not funny because they won’t understand. For adults they would find it really immature.  The MPAA of the movie is PG-13. If I remake this movie I would name it “The Bad Karma” because I feel like it makes sense. This movie is really good because you can watch it for fun or with your friends. I give this movie 5 stars for only certain people."
    },
    {
      "rating": "10",
      "text": "This is one of the most hilarious comedies of all time. Simply the best film in Rob Schneider's movie career. I loved it! It was extremely hilarious!Definitely a must-see comedy!"
    },
    {
      "rating": "2",
      "text": "Besides a few minor laughs spread through out the movie, It was pretty stupid. So stupid that I can not recommend this to anyone. Really disapointing imo."
    },
    {
      "rating": "4",
      "text": "There are so many things wrong with this movie. First off the plot was horrible. A male criminal switches bodies with a female high school student. This is a movie for high school and college kids with very low attention spans. There where only a couple parts that where funny everything else seemed like it was trying to hard. The girls in this movie are popular just like in all teen movies, but this is no Easy A or Mean Girls. So please stop making these types of movies Rob Schneider and stick to doing cameos in Adam Sandler movies. ."
    },
    {
      "rating": "1",
      "text": "Dreadful."
    },
    {
      "rating": "1",
      "text": "Oh it was soooooooooooo baaaaaaad. I can't even... ugh... don't watch it. It is a good waste of 2hrs of unfunny ironic sayings coming from Rob Schneider."
    },
    {
      "rating": "6",
      "text": "I mean, on a Wednesday night, it's worth the rental. Rachel McAdams is too good of an actress for these kinds of b-movies. There are a few good funny scenes for sure though (that is why I gave it a 6) but overall it's very incoherent and too stupid at times."
    },
    {
      "rating": "10",
      "text": "My Family and I absolutely love this Rob Schneider Movie.This concept is ingenious and funny as H...If people can't see the humor in a move like this, they must have a very sad dull life.This is an absolutely must-see Comedy.Watch it with an open mind, and a smile"
    },
    {
      "rating": "8",
      "text": "This is my favorite Rob Schneider movie. I know that's not saying much but I just happen to love this in. Even though I know it's kinda awful. It centers on a young woman played by Rachel McAdams ( Notebook) who steals a set of cursed earrings and ends up switching bodies with a petty criminal. When she awakes as Schneider she reaches out to her disbelieving best friend played by a hilarious Anna Farris (Scary Movie) and they try and discover how to solve it with a group of misfits all the while dodging her hot boyfriend played by a smoking Matthew Lawrence. It's hilarious and overly silly and although most of the humor is in bad taste this is one of those rare times that it just works.Budget: $34MBox Office: $54.6M8/10"
    },
    {
      "rating": "10",
      "text": "One of the most funniest movies I ever seen. Rob Schneider knows how to play those funny unique roles."
    },
    {
      "rating": "2",
      "text": "Come on, Rob Schinder is at it again yet with another disappointing performance"
    }
  ]
}