{
  "id": 4828,
  "title": "The Place Beyond the Pines",
  "starring": [
    "Ryan Gosling",
    "Eva Mendes"
  ],
  "runtime": 140,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "A motorcycle stunt rider considers committing a crime in order to provide for his wife and child, an act that puts him on a collision course with a cop-turned-politician.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d5YPKAHJYmfGBaDMGV6xE8wfsoa.jpg",
  "categories": {
    "plot": 7.703125,
    "acting": 7.636363636363637,
    "ending": 7.555555555555555,
    "soundtrack": 9.0,
    "cinematography": 8.875,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 7.714285714285714
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This hard-to-remember title is actually the native tribe's name for Schenectady, which is where the movie takes place…in 3 parts. First, motorcycle stunt rider (Ryan Gosling) decides to stay in the town where he's fathered a child (with Eva Mendes). His turn to crime segues into part 2, when a good cop (Bradley Cooper) faces corruption on the force. Part 3 takes place 15 years later. Director Derek Cianfrance LOVES Gosling (they did the self-indulgent \"Blue Valentine\" together). He lingers on his face in extreme closeups, while Gosling broods and emotes. The rest of the cast is also strong, but it's the complex, compelling script that involves (except the contrived clincher near the end). This is a relentless downer, but a completely absorbing experience."
    },
    {
      "rating": "8",
      "text": "You will either walk out of this movie being incredibly thankful for the life that you have, or you will see the world as completely messed up and pointless. This is not a happy movie. It makes Blue Valentine look like Singin' in the Rain. The script is fascinating, but it reveals truths about some aspects of life that are hard to even mention, let alone sit through two and a half hours of, during a movie. The cast is overall very strong, especially Dane Dehaan, who deserves an Oscar nomination for his performance. This is a very frustrating movie, probably because it is so realistic. It is absolutely my favorite movie of the year so far, and another resounding success on the director's part."
    },
    {
      "rating": "9",
      "text": "We initially meet Luke as he walks towards his day job as a stunt bike driver, suiting up with his back to the camera is Ryan Gosling as the heavily tattooed man, wearing tattered clothes and constantly smoking cigarettes, I was immediately reminded of Mickey Rourke walking from his day job as a butcher in 'The Wrestler' as he hears the crowd around him, Luke has a unique talent as one of the bike riders, but his world changes when a former flame, Romina (Eva Mendes) comes back into his life, he is inadvertently met with the news of having a son. We realise the effect that news of such a multitude can hold, Luke changes his whole way of life in the hope of spending more time with his son, he runs into a friendly mechanic called Robin, he sees the talent in Luke but also sees it for a much more law-breaking sense. Luke and Robin soon embark on various bank robberies, initially to make more money to support Lukes family, but he ends up enjoying the adrenaline rush that comes with the territory. Robin is played by Ben Mendelsohn, who has really taken a career leap after is limited but effective appearance in The Dark Knight Rises, through his actions, we see the dangerous man that Luke is, he adores his son but not many others, brought to meaning by a strong performance as Gosling who is continuing to climb the ranks as one of the most sought after leads in Hollywood. But we also have a bigger picture, as an unprepared Luke runs into the law in the form of young cop Avery, played by Bradley Cooper,who takes the reins as the film begins to shift focus onto his character in fluid and well documented fashion, the cleverest part of this transition is the scenes that bare resemblances to earlier scenes involving Gosling, director Derek Cianfrance has did this to show the similarities of two men at opposite ends of the law, dealing with corruption, love and struggles in a marital relationship. We he quite a scope of film which opens up various side plots and also has a few time jumps which addresses characters and their ongoing life. A very calculated and edgy story keeps this film interesting as it always keeps is guessing with little given away to what the outcome is going to be, it builds at a slow pace to give its more pivotal scenes that added sense of urgency, as Luke bikes along the road it's like we're on the bike with him, candid and thrilling. We also have a small but memorable appearance from Ray Liotta, capitalising on grief while also being corrupt. The film finds its strength in its ability to piece everything together like a puzzle as the film moves forward, Dane DeHaan continues his hot streak in films with an almost show-stealing performance as the grown up son of Luke, while also starting a dysfunctional friendship with AJ (Emory Cohen), the son of Avery. This is a fascinating piece that has various plots that all fit together, strong performances round off a dramatic and clever story that never gives too much away, a scene that DeHaan and Cooper share outlines everything we know from the film, Coopers character asks if his son is alright, to which DeHaan replies \"This isn't about your f*****g son\" but we immediately realise the film has everything to do with these children, a subtle yet powerful approach to a simplistic telling."
    },
    {
      "rating": "7",
      "text": "Though it feels like the director is looking for something more than it already is, Place Beyond The Pines provides great performances including a stepping stone performance for Eva Mendes."
    },
    {
      "rating": "8",
      "text": "This film as the title suggests is about what happens after we die and the legacy we leave behind, particularly the actions of Ryan Goslings character. The film is well acted through out with stand out performances by Gosling and Bradley Coopers characters and the Robin character. The film is split into 3 parts with clear story lines in the first 2 and a convoluted 3rd act. The action is well done in this film and it really feels like your in the scene with the use of slight shaking camera and fixed camera angles making the action more immersing. My biggest problem with the film was the 3rd act which features the two most annoying characters in the film and the worst story line of the film. Also i felt that certain characters didn't have complete story arcs.\rRating 8 out of 10\rA great film ending on a bit of a bum note"
    },
    {
      "rating": "9",
      "text": "This movie hit all the right notes for me. Visually, it's beautiful. The cinematography is incredibly well done, every shot is done just right. The soundtrack was perfect and really fit the subtle dark undertones this movie gives off.  As for the acting, every major character in the movie is portrayed superbly well and full of emotion. Ryan Gosling and Bradley Cooper stand out to me as the two major actors who really nailed their roles in this movie, but Dane DeHaan also gives a very convincing and powerful performance. The story, without spoiling anything, can only be described as emotionally gripping. My only complaint with this film is that the third act was a bit too long. This is a very minor issue however, it gave me time to really soak in the entire movie and appreciate the final moments of this great film."
    },
    {
      "rating": "4",
      "text": "Disappointed with the disjointed nature of the movie at times. I was wishing for it to just get to the point of its obvious need to connect some important message between the death of the father, his murderer and the evolution of the orphaned son. I love Gosling in general but I was to eager for the movie to end---anywhere!"
    },
    {
      "rating": "7",
      "text": "A very peculiar production by Derek Cianfrance, The Place Beyond the Pines, it tells a story in three separate parts. The first part of this movie is about a lost and confused man with a job in a traveling carnival trying to provide for his child by robbing banks. The second part of the story tells the story of a cop transitioning into a politician after dealings with dirty cops. The third part of The Place Beyond the Pines explains the fall out 15 years later when the first 2 character's sons meet each other. There are obvious stains in Cianfrance's creation but The Place Beyond the Pines is by far one of the most daring and brilliant films to be released so far this year."
    },
    {
      "rating": "9",
      "text": "The place beyond the pines is not just a Mohawk denomination for a little town (Schenectady), but is the name of a little-big masterpiece. I totally loved the plot that runs really good and let pass two hour and half like no other recent movie. I loved the acting of Ryan Gosling and Bradley Cooper. So emotionally, so deep and when \"Luke Glanton\" starts to be a bank robber, your adrenaline stars to flow like him in the movie as well as for \"Avery Cross\" and his peripeteias.\r Derek Cianfrance is one of the \"new\" cinema's promises and I feel like he'll be back soon with another masterpiece, his job on this movie is just fantastic.\r My vote is 9/10."
    },
    {
      "rating": "8",
      "text": "The Place Beyond the Pines is an underrated masterpiece. The story is complex, real to life, and extremely well written. The potential of this movie to impact lives is great, even in spite of some peculiar directing choices. If you love Ryan Gosling, please watch this one. This is one of his best performances."
    },
    {
      "rating": "5",
      "text": "The Place Beyond the Pines rushes out to a fast beginning giving the audience so much but by half way through, becomes a slow and drawn out film that loses its intensity it once had."
    },
    {
      "rating": "10",
      "text": "Easily the best of 2013 so far. This movie had so much emotion with the soundtrack, characters, and symbolism. Where Django Unchained had me at the edge of my seat with excitment and laughter, PBP hit me right in the heart and soul."
    },
    {
      "rating": "5",
      "text": "This can only be described as  major disappointment. The story trajectory is sound, but the whole thing is so slow and drawn out that any real involvement with the characters just doesn't happen. Also, unlike many critics I was more interested in the segments involving Bradley Cooper and the two sons than I was in the Ryan Gosling section, despite this actor's obvious magnetism. It's a shame because there are some wonderful nuances and subtleties throughout  which just made me yearn for the film it might have been."
    },
    {
      "rating": "5",
      "text": "'The Place Beyond the Pines' rushes through it numerous sections and fails to incorporate the plausibility and emotional depth required to make it the authentically gritty drama it desperately wants to be. Dane DaHaan is the only redeeming feature in a film which is too clichéd to be taken seriously and too drawn out to be entertaining."
    },
    {
      "rating": "7",
      "text": "I would have given it a higher rating if it were not for the facts that a) it goes on for waaaay toooooo long, b) Ryan Gosling, as brilliant as he is in this film, is basically playing the same character as in Drive, c) I was confused as to what the meaning of the film was  please don't tell me it's the sins of the fathers pass onto their sons! d) Eva Mendes, doing a fine job, yet appeared like a miscasting to me. Those points aside, all the actors in the film did a mighty fine job  with both Bradley Cooper and Ryan Gosling being outstanding. They gave depth to their characters and made them real; both were flawed yet relatable and believable. The first two parts feel like this is a film about choices and how they can affect not only your life, but those around you. The last part, regarding the lead characters' children, although beautifully acted, lacks insight and therefore goes a bit off the rails for me. Nonetheless, this is a film I would recommend."
    },
    {
      "rating": "3",
      "text": "Very good acting, slow tedious development of the drama. Three different episodes poorly laced together. I'd rather seen them as three individual stories. No cinematic innovation in three very predictable outcomes.\rIt's a bland production."
    },
    {
      "rating": "3",
      "text": "The story is so melodramatic that this movie is a failure, despite its technical and stunt strengths.  It is a failure despite one's suspicions that the melodrama is deliberate.  It's a failure despite reuniting the Cianfrance/Gosling team from Blue Valentine.\rYou will probably like this movie if you like to look at Gosling and Cooper for 2 hours.  You will probably like this movie if you thought that Haggis' Crash was a good movie and not a ham-fisted melodrama.  Anyone else should really stay away, despite the PR/marketing hype that it's an artful indie movie."
    },
    {
      "rating": "5",
      "text": "Ryan gosling part is great and in first hour movie flow's nicely.But in the kids scene movie start to suck.Seems like 3 different parts are merged and it won't fit in and damaging the flow. overall acting is near perfection."
    },
    {
      "rating": "10",
      "text": "Breathtaking cinematography. Beautiful and compelling. Incredible first act, story overlaid onto a town like Schenectady which is as much a character in the way it affects the players."
    },
    {
      "rating": "9",
      "text": "The best movie I've seen so far in 2013.  The first two parts of this film are fantastic led by great performances by Ryan Gosling and Bradley Cooper.  The third part while good does lack compared to the first two, but the first two are so good it still deserves a ten."
    },
    {
      "rating": "10",
      "text": "This movie is amazing. I feel like Cianfrance knows me, my parents and my family the way he weaves characters together. Blue Valentine already hit close to home and this is Cianfrance doing his thing on a bigger scale. He is a master behind the camera and he has an amazing team in front of the camera. I'm sure this movie will have many haters for its unwieldy structure, but I love this movie and I know others will stand up for it as well. Derek Cianfrance, please keep making movies, because they really do it for me like no other movies do."
    },
    {
      "rating": "9",
      "text": "One of the best films i have seen in 2013 so far. The story is fantastic, and Bradley Cooper is brilliant! Also the movie has a great twist. Also one of the better father and son movies."
    },
    {
      "rating": "6",
      "text": "It's certainly a movie worth seeing, and I'm a big fan of Derek Cianfrance (especially the fantastic Blue Valentine), but this movie gets long and unwieldy after about a third of the way in.  It was unfortunate that more of the lead characters couldn't interact through more of the film.  What I will say is that the mood, the music, and the visuals are outstanding, so even if it gets a little meandering toward the middle and the end (and you get the dreaded \"10 years later\"), it's something that should be experienced."
    },
    {
      "rating": "10",
      "text": "This is a riveting movie.  Although long, it moves at warp speed.  Beautifully filmed, judiciously edited, and acted impeccably, it is as urgent and moving a film as I have ever seen.  I was not a fan of either Bradley Cooper and Ryan Gosling or Eva Mendes--that has changed.  It is the supporting players, however, who steal the film.  It's a tough minded, morally complex, greatly moving fillm."
    },
    {
      "rating": "10",
      "text": "Garsh, I loved this movie. Reminded me of A History of Violence, another great movie. I will see almost any movie that has Ray Liotta or Ed Harris in it.\r In both films, the sons almost steal the movie from their fathers..."
    },
    {
      "rating": "2",
      "text": "If you loved Ryan Gosling in Drive then you should leave this one. The guy starts growing a serious vagina about 20 minutes into the film and ruins everything. Loving that woman and her kid in Drive was fine. He was emotional and intense without saying a word. In this film he starts talking about wanting to see the look in his baby's eyes as he eats ice cream for the first time. I switched it off at that point. Also, why the hell would anyone decide to start robbing banks to support a baby they've only just found out they've got? Yeah good idea, risk getting yourself banged up for a few years, good parenting."
    },
    {
      "rating": "2",
      "text": "You have to be kidding.  The movie doesn't end, and so predictable, that it's almost laughable.  Who writes this stuff?  Great actors with two movies rolled into one.  Both terrible."
    },
    {
      "rating": "9",
      "text": "I was eagerly awaiting for this film to come out with expectations that it would be special.  And even though I was not disappointed by the end result, I am still a little annoyed as this could have been a masterpiece.\rA poetic film defined by  its velvety cinematography, a  brilliant soundtrack and a beautifully woven layered storyline.  The casting is absolutely superb (apart from Emory Cohen who is indifferent and in someways one of the few flaws of the otherwise perfect film) starting with the the mesmerizing Gosling, the on-form Cooper, the unexpectedly brilliant Mendes, the always harrowing Liotta, the consistently cool Mednelsohn and the up and coming intense DeHaan.\rA Greek like tragedy appears to have 3 distinct acts, the first of which is heavenly, the second near spotless (a tad longer than it should have been) and a third only let down by the uneven performance of Cohen, which leaves you guessing whether it is a chance to find redemption or to restart the cycle all over again."
    },
    {
      "rating": "1",
      "text": "A true independent art film. It does have a good start (but that is almost a whole other movie in itself) and a good ending (another movie) but the middle hour is unwatchable at times because of the overly dramatic art film tone... \"I am a serious film shots\". I couldn't believe how many people kept getting up in the middle to go to the restroom because things were so slow. Very unusual. There is a solid 90 minutes in a 140 minute film. You got the feeling that there was either pressure to keep some scenes of the A list actors in (so as not to offend them for having actually shot them) or the director's (student film ego) wouldn't allow it to be cut. Either way, if interested, rent the DVD so you can fast forward and see the good scenes and skip over over the top drama. You can come into the film 40 minutes late and it would probably be better. The middle wouldn't be so boring because you would be pieceing things together."
    },
    {
      "rating": "9",
      "text": "The best movie of 2013 so far. good drama, action, acting, and direction.  Strong story about life's lessons.  Long movie but it moves along smoothly."
    },
    {
      "rating": "9",
      "text": "Not enough praise can be given to a film like this. It boasts a great cast, beautiful cinematography and a raw, haunting and provoking score. But what makes it truly stand out is the bold, never timid, screenplay. One of the more engrossing cinematic experiences I've ever had."
    },
    {
      "rating": "9",
      "text": "Easily the very best movie of 2013 thus far. And one of my favorite movies. It was just excellent. The setting of the movie really made it all. Small town New York. It really captured the meaning of Sins of the Father. And how they can carry generation to generation. It was just perfect execution on both sides. This was a movie that was totally unpredictable. I would have never seen the direction of Luke go the way it went. It was a thrill ride to watch from start to finish. It was a lot better than Cianfrance's Blue Valentine, and I loved that movie. Dear Derek Cianfrance, Please continue to make movies. If The Place Beyond The Pines budget was indeed $15 Million, I can't imagine what you could do with a $40 Million budget. Signed, Clay Merritt\r Excellent movie, I highly recommend it."
    },
    {
      "rating": "9",
      "text": "The first really good movie I've seen this year. Sucks that it takes until mid-April for a crime-thriller-drama this good to finally hit theaters. ...Beyond The Pines was refreshing, I did not know exactly where the story was going, and although the run time is over two hours long, it paces itself well. Nice to see a movie starring some big \"names\" share the screen without one or the other taking over the picture for the sake of their celebrity. Just a good story, well acted and crafted. This movie has put Derek Cianfrance in my list of filmmakers to watch out for."
    },
    {
      "rating": "8",
      "text": "\"The Place Beyond the Pines\" is a highly ambitious melodrama, delivered on an epic scale involving multiple characters that boasts an engrossing cinematic atmosphere, with an impassioned emphasis on humanistic elements. Director Derek Cianfrance has crafted a sweeping three-act story with considerable skill that follows a chronological structure where each narrative rarely intersects.  It has the scope and depth of a novel, and puts its trust in the audience to have the patience.\r The first story, and unquestionably the strongest, is about Luke (Ryan Gosling), a stunt-bike rider who learns that he has a son by one of his ex-lovers, Romina (Eva Mendes). Ready to man up, he decides to swap his life riding the \"Cage of Death\" at local fairs to spend time with his new-found family. Problem is, Luke doesn't have the money. It doesn't take much for his new boss and drinking pal Robin (Ben Mendelsohn), to convince him that they are better off robbing banks, while utilizing Luke’s motorcycle skills to evade police. But soon Luke gets greedy, and a robbery goes terribly wrong. In a split second, the focus completely shifts to a seemingly mild-minded street cop named Avery Cross (Bradley Cooper), who has his own agenda and story  and yet his life and Luke’s become inevitably entwined.\r The second story follows Avery, and the mood and tone of his narrative is distinctly different from Luke’s. However, his inner turmoil is equally compelling however for different reasons. Avery also has a son AJ (Emory Cohen), but his eventual political aspirations keep him from being a caring and attentive father. Both of these men feel guilty for their failures as fathers and sons, and they both try to correct mistakes with worse ones, setting in motion unintended consequences for the next generation.\r Both of these stories culminate into a 15 year fast-forward when the audience then sees how Luke and Avery’s characters have impacted their own children. What's so fascinating about the structure of the film is how the story is not about any one individual character, but collectively how these characters have either been impacted by their father, and/or how they impacted their own son. The narrative uniquely strips away identifying a main character of \"Beyond the Pines.\" Instead, it is the father and son dynamic fleshed out that acts as the central theme to the film.\r Mike Patton’s beautiful score and Sean Bobbitt’s mix of claustrophobic, extended shots creates an ambience of a grand spectacle spanning generations, yet selecting only a handful of individuals who we get to know very well, and how their lives intersect. In regards to storytelling alone, \"Beyond the Pines\" is a formidable endeavor. Unfortunately, due to its ambitious, unconventional approach, it weakens the connected narrative in the third act. Nonetheless, it's impossible to deny its overall overpowering cumulative effect."
    },
    {
      "rating": "9",
      "text": "Amazing film. After 2010s Blue Valentine, Derek Cianfrance again partners with Ryan Gosling on a film about the workings of the family unit, but this time he focuses on fathers in particular. The film is split into three interrelated storylines, each one so well done and excellently developed that we almost get 3 (great) films at once. At a lengthy 2hrs. 20 minutes, The Place Beyond Pines packs a powerful punch thanks the involving story, perfect performances from the cast, and the flawless direction from Cianfrance. He was somehow able to catch every actor at their absolute best and most realistic moment on camera; the performances are all stunning. Ryan Gosling, Bradley Cooper, and Dane Dehaan are electric, and Eva Mendes, Rose Bryne, Ray Liotta, Ben Mendelsohn round out a stunning supporting cast. Though I felt the film was a bit heavily plotted at times (a bit like Blue Valentine was as well, actually), overall the film remains grounded. I fell for every bit of it. Thought provoking, unpredictable, and wholly original, The Place Beyond the Pines is one of the best films of the year."
    },
    {
      "rating": "9",
      "text": "One of the more emotional films I have seen. A great film with Great cinematography and a beautiful soundtrack. Gosling's performance and Mendehlson;s were the most impressive of the film. Towards the end it starts to get a little shaky but overall I was very happy with it. A crime film about fathers and the legacy's they leave for there kids. Go see this film."
    },
    {
      "rating": "0",
      "text": "I read through the positive user reviews of this movie, and it made me think I watched a different movie, than the one they viewed. The way the go into detail about the positives, makes me think they are part of the production crew.  I was bored out of my mind watching this. I kept checking my phone countless times, to look at the clock.\rI want the last two hours of my life back!!"
    },
    {
      "rating": "10",
      "text": "It's original, fresh and so lavishing that you will cry at the end. The Place Beyond The Pines is a elegant cinematic masterpiece by Derek Cinafrence who has made great films like Blue Valentine. The film has very good thrilling sequences of lore and dramatic sequences of love. The film has great pace and movie quality. The Place Beyond The Pines is epic."
    },
    {
      "rating": "8",
      "text": "This movie was very disappointing to me. I went into it knowing almost nothing about the plot or characters except that Ryan Gosling played a character somewhat similar to that of Drive, an edgy, sometimes soft-spoken man, but full of intensity and anger bordering on rage at other times, (Drive is in my top 3 movies of all time list). The first \"act\" of this movie was absolutely phenomenal, but I can't help but feel somewhat annoyed that all of the main characters never mingled and interacted with each other like a big-name cast usually does. For me, the climax of this movie was less than an hour into a 2 1/2 hour venture, and I still find myself wondering how the director possibly thought the rest of the film could live up to Gosling's performance. The character portrayal and acting in this movie is absolutely top-notch and it should be watching for just that reason alone, but the story telling brought it down a little short of landing near my all-time favorites list. If the director had somehow copied the intensity and real, raw emotion of the first hour and transplanted it into the remainder of the film, it might have been talked about as all time time great, not just one of the best of the year."
    },
    {
      "rating": "9",
      "text": "This movie was like none I've seen in a while. It captures how a single exchange with a human being can alter our life forever, the impact one person can have on our life. It captures how life comes full circle and does it in such an original way. It's like watching 3 films in one. Brilliant. Brilliant. Brilliant."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite 2013 films. Very unique and creative, takes very huge risks, and nails it. The acting choices are great, the direction, the music, the cinematography, the writing, and the perfect incorporation of the butterfly effect and karma makes this movie amazing. Also, I don't know if anyone noticed, but there were a lot of allusions to Star Wars in this movie. Watch it, and you will understand."
    },
    {
      "rating": "2",
      "text": "great acting but the story is crap filled and boring its like three short stories and not a full film boring and a waste of time, couple hours people wont get back"
    },
    {
      "rating": "9",
      "text": "I just adored this film. It bolsters great performances by the lead actors and a fantastically layered script which is filled with the underlying theme of how our decisions effect our families and other people in the world. This film is gritty, smart, and just all around fantastic. One of this years under appreciated gems."
    },
    {
      "rating": "7",
      "text": "awh i LOVE it And i HAte it, at the same time the first half of the movie is so gooood.but the second half for me was so questionable. i didnt know what i was watchin anymore. what a waste."
    },
    {
      "rating": "8",
      "text": "For a change we have a movie that wends in ways least expected and it comes in 3 parts. If you've seen the promo it's about part 1. This may be a tad long for the younger generation but it has a retro feel to it that us older folk like. It has an hors d'oeuvre of different actors, all enjoying their cameos to the hilt, and the steady, delectable presence of Eva Mendes, in a toned down mode. Let's just say that the sins and virtues of the fathers get carried down to the sons, in different guises."
    },
    {
      "rating": "8",
      "text": "If the first  third of the movie could have been compressed to 15 minutes and the whole story told in two halves,  this would have been a better movie. Maybe the director felt that he owed Gosling screen time, performing a character he had already done in \"Drive.\" The overlong first part does pay off, however: the last two parts of movie compelling viewing. And I hate to say this--but the actor Emory Cohen reminiscent of young Brando."
    },
    {
      "rating": "9",
      "text": "This is a great movie. The plot is interesting, the characters are interesting, the cinematography is interesting... THE WHOLE THING IS JUST INTERESTING!"
    },
    {
      "rating": "6",
      "text": "A Place Beyond the Pines is nothing if not interesting, with it's three-act protagonist switching structure and time spanning plot. That said, none of the acts really attain much depth and certain aspects (such as Ray Liota) are not given the time they deserve. As a result A Place Beyond the Pines often feels shallow where it should have depth."
    },
    {
      "rating": "8",
      "text": "Metacritic really should have a way to delete reviews​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​."
    },
    {
      "rating": "5",
      "text": "Film with good performances and heady themes but the various threads are not satisfyingly resolved."
    }
  ]
}