{"id": 1126, "title": "The Night House", "starring": ["Rebecca Hall", "Sarah Goldberg"], "runtime": 107, "genre": ["Drama", "Horror", "Mystery", "Thriller"], "description": "Reeling from the unexpected death of her husband, Beth is left alone in the lakeside home he built for her. Soon she begins to uncover her recently deceased husband's disturbing secrets.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/rqs2CXpc4d5FzeP1EZCYItAVo81.jpg", "categories": {"plot": 6.6, "acting": 7.25, "ending": 6.7, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "It seemed to me that it was a tremendous shame that what this film was building, fell apart with such a weak conclusion.It's atmospheric, clearly depressing, and has an intriguing enough mystery to be interested about it, to see where it goes, yet the payoff at the end of the mystery seems undercooked, and The Night House is just competent. Nothing more."}, {"rating": "7", "text": "The acting is great but the storyline is just a little boring/predictable at times. Focuses on the real horrors of life such as death, depression, mental illness and most importantly the unknowns of what happens after life. Had the potential to be great but still a solid horror movie."}, {"rating": "4", "text": "(Mauro Lanari)Rebecca Hall produces herself and spends 107 minutes with thriller, mystery and a minimum of horror just to reveal to us that, after death, \"there's nothing\"."}, {"rating": "5", "text": "While the acting,  concept and premise is good, the execution at the end is off . Also, the positives do not outweigh the cringiness I felt when the film tries to justify the husband's becoming a serial killer out of the duty to protect his wife."}, {"rating": "8", "text": "I agree towards the end the movie does seem to lose focus and leave the audience a little unsatisfied. But everything building up to the final act is great. Some memorable scenes and great use of grief and loss. Its for sure worth buying a ticket for."}, {"rating": "3", "text": "With the exception of Candyman (I’ll review next week), most horror films these days involve some sort of evil spirit that’s haunting or possessing the protagonist (as opposed to homicidal maniacs). This film seemed to be setting its sights higher, but fell flat. Rebecca Hall plays a woman whose husband committed suicide. The film begins as she returns to their lakeside home, but then come the hallucinations. It’s peppered with typical mild jump scares and creepy specters, but is never scary or even tense. The revelations are never fully explored and to make matters even more unfulfilling, the ending is completely useless and confusing."}, {"rating": "8", "text": "A meaningful metaphor for depression, suicidal thoughts, and coping with loss. You may be disappointed by this one if you take it at face value, without trying trying to interpret it. The horror is meaningful because of the symbolism and the acting drives it home."}, {"rating": "7", "text": "The first acceptable horror movie I've seen this year.Finally some quality in this genre."}, {"rating": "6", "text": "Rebecca Hall is great (as usual) but the narrative gets very muddled as it goes, resulting in an ending that leaves more questions than answered."}, {"rating": "8", "text": "Meditative horror movie that actually has some substance. Stays with you afterwards."}, {"rating": "8", "text": "I didn’t go into this with high expectations but I was very impressed with what I saw. This is the kind of horror I wish we would get more of. Some effective and creative jumpscares with interesting stories, characters and a lot of unsettling themes. This film deals with issues like suicide, depression, and mental illness and I think it makes use of them very efficiently to make you feel sympathetic and scared at the same time. There is a lot of ambiguity about what the monster is but in the end it’s nothing and I don’t mean there is nothing there but it deals with the idea that nothing is something. It sounds confusing but it makes sense with the film. I’ve never been a big fan of jumpscares but I think it’s super effective most of the time here. Most crappy horror film jumpscares get you for a second but you forget about them after they happened and this didn’t happen here. The scares stuck with me long after I saw them. David Bruckner’s directoral style helps give the film a sense if uneasiness and I think it works brilliantly for this story. Rebecca Hall gave a career best here. Her performance is pretty fantastic at points and her character is the best part of the movie. She feels relatable while having a fun personality that feels realistic. The film’s use of color and lighting at points also helps this uneasy atmosphere and the cinematography was super effective at some of these scares. I would highly recommend checking this out. It’s one of the more unique and interesting horror films I have seen in a while."}, {"rating": "7", "text": "Pretty interesting overall, I do wish some things were more elaborated on, there are a few pretty interesting readings of what the threat of the movie is. Interesting and creative visuals and setpieces, Rebecca Hall is really good in this as well"}, {"rating": "9", "text": "The first and the second act are very simply for a Psychological Thriller but directed and development in a very good way, and the third act has a lot of revelations that change the way of the movie and it gets bigger. The suspense scenes are great, at first they're involved in a lot of high sounds to get scared, but at the end the use of silence gets the best scenes of the film. The acting of Rebecca Hall is very good and the script is a little confuse but round and deep."}, {"rating": "5", "text": "This slow paced mystery/horror shows an interesting concept and had a decent production value and the casting is good. However the pacing in direction and editing are such that it failed to build tension to truly cash in on the 'scares'. Also I took issue with the main character. Ultimately she just came across as an unlikeable drunk narcissist I was stuck with for the duration of the outing. I feel if she had been written differently I might have felt more towards her when the scares came along. There are many better examples of how this kind of film can be done."}, {"rating": "7", "text": "\"The Night House\" is a very atmospheric horror film that is built entirely on how a recently widowed woman deals with her grief."}, {"rating": "9", "text": "A horror film that pays attention to the formation of the characters. The build-up starts slowly but you soon get the hang of it. Besides the constant tension, there are also jump scares without exaggerated elements from the horror genre. All in all, a well-executed film with great actors and a timeline that slowly but surely makes you understand the story."}, {"rating": "8", "text": "Woman whose husband recently committed suicide, survived a near death experience when she was younger, investigates his death and finds out that the \"nothing\" after death came back for her and her husband tried to protect her by serial killing a load of other women who looked like her."}, {"rating": "7", "text": "Effective enough to recommend to friends.  The story did just enough to keep my interest.  Lots of tension/atmospheric scares, only a few jump scare - which is what I prefer."}, {"rating": "8", "text": "Much scarier than most mainstream horror movies. A couple sequences literally made my hair stand on end! An intriguing plot with a conclusion I did not expect. Check it out in theaters, great to see with a crowd."}, {"rating": "7", "text": "Great movie. It's absolutely not scary but interesting. The main characters are interesting. Beautiful picture. There is not much to say, I just advise you to watch it."}, {"rating": "6", "text": "It’s engaging enough but isn’t fully fleshed out and falls apart a bit in the third act. Some of the scenes with the ghost were down right silly and distracting. Definitely watchable though"}, {"rating": "8", "text": "Tense, atmospheric and smart. The Night House is a well-made thriller with an astounding performance by Rebecca Hall."}, {"rating": "8", "text": "\"There's nothing there\" \"I know\"Probably one of the best final lines in a horror film ever."}, {"rating": "5", "text": "The Night House\" directed by David Bruckner, falls short in delivering a compelling story despite the strong performance of lead actress, Rebecca Hall. The plot is hard to follow and the supporting cast fails to impress. The film can be divided into two halves, where the first half presents a typical haunted house story, and the second half takes a darker, more twisted and psychological turn, but ultimately becomes too unclear and convoluted. While Hall does her best to portray the emotional turmoil of her character, it's not enough to save the film. In the realm of supernatural thrillers, \"The Night House\" fails to stand out and there are better options available.______________________The Night House\", dirigida por David Bruckner, se queda corta en la entrega de una historia convincente a pesar de la gran actuación de la actriz principal, Rebecca Hall. La trama es difícil de seguir y el elenco secundario no logra impresionar. La película se puede dividir en dos mitades, donde la primera mitad presenta la típica historia de una casa embrujada, y la segunda mitad toma un giro más oscuro, más retorcido y psicológico, pero finalmente se vuelve demasiado confuso y enrevesado. Si bien Hall hace todo lo posible para retratar la confusión emocional de su personaje, no es suficiente para salvar la película En el ámbito de los thrillers sobrenaturales, \"The Night House\" no se destaca y hay mejores opciones disponibles."}], "recommendations": ["the_lodge", "the_mothman_prophecies", "lights_out", "winchester", "the_others", "the_rental", "the_autopsy_of_jane_doe", "oculus", "the_invisible_man", "gothika", "what_lies_beneath", "the_woman_in_black", "annabelle_creation", "the_forest", "his_house", "ouija_origin_of_evil", "the_howling", "the_conjuring", "insidious_chapter_3", "the_ritual", "the_skeleton_key", "mirrors", "us", "the_conjuring_2", "scary_stories_to_tell_in_the_dark"]}