{
  "id": 831,
  "title": "The Matrix",
  "starring": [
    "Keanu Reeves",
    "Laurence Fishburne"
  ],
  "runtime": 136,
  "genre": [
    "Action",
    "Science Fiction"
  ],
  "description": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f89U3ADr1oiB1s9GkdPOEpXUk5H.jpg",
  "categories": {
    "plot": 9.470588235294118,
    "acting": 9.363636363636363,
    "ending": 9.0,
    "soundtrack": 9.25,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 9.5,
    "action": 9.566666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An excellent movie with tons of special effects, fight scenes, etc., and the best thing is that they are all done perfectly. A really good film with an interesting story behind it. YOU'LL ENJOY IT."
    },
    {
      "rating": "9",
      "text": "Yes, the movie has flaws. But who cares? \"The Matrix\" is a astonishing movie that is for-your-eyes only. The film has top notch (slo-mo was first introduced by this movie) CGI as well as a well rounded plot. It gives you more than you can ask for from a 1990's action film."
    },
    {
      "rating": "8",
      "text": "What a concept! Although the movie is well executed, it is not exceptional. It makes for an entertaining ride."
    },
    {
      "rating": "10",
      "text": "The greatest action movie of all time, my favorite movie, its so perceptive so mind boggling you will watch it more than once to then fall more in love with the matrix a world without borders or boundaries. I love this movie."
    },
    {
      "rating": "10",
      "text": "It's perfect, isn't it? The combat is stylish, it has effort put into it. Lots of guns, lots of fighting, all in its own unique style of kung fu meeting gunplay."
    },
    {
      "rating": "10",
      "text": "The Matrix is without a doubt one of the best movies ever made. Period. I will explain though. Most people have an issue with the movie for one of two reasons: the special effects and the plot. First, I'm not a huge martial arts guy, so I'm definitely nowhere close to being an expert on this, but the action scenes were pretty awesome. The combination of slick and fast hand-to-hand with a load of guns thrown in...awesome. The music to the fights completed the experience. The second issue most people have with the Matrix is something I am quite familiar with: the plot. The plot of the Matrix is fantastic. That is because of two things: One, it is a fresh idea. The Matrix's plot is not a clone of anything. And two, the plot is incredibly deep, having multiple levels for every part in it. The agents, Neo being freed, the idea of the Matrix itself, all great. If you don't like sci-fi, then that's fine. You probably won't like this movie. You definitely won't like the sequels. But don't knock them for being \"stupid\" or \"moronic.\" Because they simply aren't. And on a last note, the acting is exactly suited to this movie. The people in this movie act exactly how their characters should. Keanu Reeves was cast BECAUSE he acts the way he does on camera. It was perfect for the part. Hugo Weaving is SUPPOSED to be dry and humorless. Keep in mind the context of the characters when you judge acting. If you have any complaints, I'll be willing to defend the greatness of this movie. A 10 out of 10."
    },
    {
      "rating": "10",
      "text": "When I first saw this movie when I was twelve I didn't think much of it, I thought it had a confusing story and a mindless plot that was supported and only succeeded by out of this world slow motion stunts. Boy was I naive or what!? Now seeing it again after all these years I could see that I was not ready back then to handle a movie of this complexity and strange coherent means of story telling. But now I fully respect and love this movie for what it is and for what it always will be, mindbogglingly, mind blowing, out of this world fun. When the Matrix was released in 1999 this was the film to go see people were busting out of the theater's and telling anyone they can to go see this movie. It was the \"It\" movie of the year and it gained the title justly. This film mapped out new territory in action and ushered in a whole new generation of action & Sci-Fi thrillers and video games as well(Max Payne comes to mind) it is one of the biggest and most beloved film of the 90's and has one of the biggest fan base out there. This movie unique and I mean unique story and style has such and impact on you when you first see it you'll want to see it the minute it's over and some more after that and after that and you'll want to see it a million times it's just that good. The Matrix put's a Gothic and dark spin on the dystopia and apocalyptic themes that have become very common in Sci-Fi films, this film does it one better it takes those overly used themes and creates a completely original and unique world around which everything we Believe is a lie. It has a great monolithic tone to it that makes it a masterpiece by any standards and it creates a great aftershock in which few films can actually do these days. It purposes that machines while enslave humanity and use us as a battery source to power there vasts armies of machines around the world. But that's what makes it so great to watch it gives you a sense of hope and a sense of justice that you just feel all the way to your bones. This movie has given the fellow movie goer what they've always wanted and always searched for in a film, great action, a smart story and plot, acting you can live with and put them all together and what do you got? The Matrix! This movie will stick with long after it's over and even after tour old you'll still remember one movie that rocked your world like none other. All in all this film delivers great any day entertainment that is like Laurence Fishburn said, \" Unfortunately no one can be told what the Matrix is you have to see it for yourself.\" And trust me once you do you won't ever look at Sci-Fi or other movies the same way again. This movie delivers."
    },
    {
      "rating": "10",
      "text": "Awesome action, awesome acting, awesome plot, awesome everything!"
    },
    {
      "rating": "10",
      "text": "It is an epic. Classic. Great philosphy."
    },
    {
      "rating": "10",
      "text": "I thought the matrix was brilliant the god of Sci-Fi."
    },
    {
      "rating": "10",
      "text": "Great movie, a definite heartwarming, classic."
    },
    {
      "rating": "9",
      "text": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion"
    },
    {
      "rating": "10",
      "text": "The Matrix helps you thinking about the question \"What is reality?\". This is an epistemological question: is the world we see around us the real world itself or merely an internal perceptual copy of that world generated by neural processes in our brain."
    },
    {
      "rating": "9",
      "text": "A man's life has changed arguably for the better after finding out about the world he lives in and discovering that he is more than just an everyday man who works at a dead end job. 'The Matrix' is an expansive, dazzling and sometimes philosophical science-fiction thriller that develops its worlds and characters with discovery as opposed to long exposition explained by characters.\r The movie follows the life of a man named Thomas Anderson (Keanu Reeves) who gets mysterious conversations from the people of \"The Real World\", he often gets phone calls from a man named Morpheus (Laurence Fishburne) who tells him that the world he is currently living in is a fake and that it's just an illusion.\r Thomas, reluctantly, follows everything Morpheus tells him to do, and runs into the hands of an evil Agent Smith (Hugo Weaving) who tries to convince Thomas otherwise.\r Morpheus then tells him to meet the other crew which involves a woman named Trinity (Carrie-Anne Moss) who also tells him that the current world he is living in is fake and is often referred to as \"The Matrix\". When Thomas enters the real world, and finally \"wakes up\" and sees that the world he was living in really was fake, he needs questions to be answered, and Morpheus provides him with that as well as training him to handle himself for whenever he enters the Matrix.\r The film, directed by the Wachowskis, is stunning to look at, filled with fantastic fight choreography, and good character development, even if some of the exposition feels a bit heavy-handed.\r Like George Lucas' 'Star Wars' (1977), it is original, groundbreaking and filled with great storytelling with characters who become iconic, and some innovative action scenes. If you love Sci-Fi... this might be something you're looking for."
    },
    {
      "rating": "9",
      "text": "There's no sophomore jinx for the Wachowski Brothers. Andy and Larry, a pair of obviously talented film makers, have returned to theaters with The Matrix, a science fiction thriller that is every bit the match of their debut effort, Bound, for tension, excitement, and intelligence. In an era when movie scripts (especially those pigeonholed into the science fiction genre) are becoming increasingly more stupid and special effects reliant, the Wachowskis prove that style and substance do not have to be mutually exclusive.\r I loved The Matrix, and only a few minor contrivances associated with the climax caused the film to miss a four-star rating. The movie is kinetic, atmospheric, visually stunning, and mind-bending. It toys with the boundaries between reality and fantasy in unique and interesting ways. In its approach and content, it reminded me of last year's vastly underrated Dark City. There's also a synergy with two movies due to be released within the next month: David Cronenberg's eXistenZ and Alejandro Amenabar's Open Your Eyes. The Matrix is undeniably science fiction, but, unlike most pictures claiming that association, it never falls into the boring, expected patterns of space battles and laser gun shoot-outs. Instead, it ventures into territory that, while not virgin, is sufficiently interesting to provide an involving, invigorating backdrop.\r lthough the film frequently toys with the blurred line between grim reality and computer-generated fantasy, it rarely leaves the viewer completely confused (except, perhaps, at the very beginning). The Wachowskis have carefully structured the story in such a way that the audience is capable of following the action and understanding what's going on even when all of the secrets have not been revealed. Nevertheless, because The Matrix is intelligent, it will defeat those unwilling to invest some intellectual participation. The payoff is worth the effort.\r Stylistically, The Matrix is much like Bound. Both films are visually stunning, with images painstakingly constructed and action sequences choreographed to excite the eye and quicken the pulse. The Wachowskis use a varied pallette that includes shadows, slow motion, quick cuts, and offbeat humor to paint a unique portrait. Like in Dark City, theirs is a grim world, where darkness and gloom seemingly always hold sway. Everything from the set design to the costumes (lots of black, lots of sunglasses) is intended to contribute to an overall look. When it comes to shoot-outs, the Wachowskis show that John Woo isn't the only director capable of doing interesting things with familiar devices. The shots of Keanu Reeves streaking down a hall with guns blazing all around him and the air thick with shattered bits of concrete is only one of many snapshots that lingers in the mind's eye long after they have vanished from the screen. The special effects, which are not as numerous as those in many science fiction pieces, are flawless.\r Keanu Reeves is not generally regarded as a strong actor, but, given the right part - one that doesn't demand much subtlety or emoting - he can be effective. His role as Neo fits the criteria. The Matrix needs a leading man who can look good, act cool, and not stumble over his dialogue, and Reeves is three for three. It's easily his best work since Speed, where the same kinds of demands were made of him. For more nuanced performances, the Wachowskis rely on the rest of the cast: the always excellent Laurence Fishburne, brilliant character actor Joe Pantoliano (who appeared in Bound), and Carrie-Anne Moss, who looks great in black leather. Aussie Hugo Weaving (Proof) brings the perfect mix of dry wit and menace to his role as the head Man in Black.\r The Matrix offers a little something for everyone. The die-hard science fiction fan will discover a plot that mixes and matches both new and old conventions of the genre in a compelling fashion. Action aficionados will find that there's no shortage of electric excitement, whether it's in the form of hand-to-hand kung fu-type fights or shoot-outs with seemingly limitless ammunition. There's also betrayal, a little romance, some humor, and a moral dilemma or two, all wrapped into a well-produced package. As I stated earlier, the way in which the Wachowskis choose to resolve everything seems slightly contrived, but, in the overall scheme of things, that's a small price to pay for one of the most enjoyable science fiction thrillers to reach the screen in months."
    },
    {
      "rating": "9",
      "text": "An incredible fiction film. Very interesting the philosophical aspects a film that marked the 90s"
    },
    {
      "rating": "9",
      "text": "The movie gets me through the holidays. Makes me feel like it's a new movie every single time. Excellent special effect (iconic, in fact) and is the best example of \"thinking outside of the box\" with regard to movies."
    },
    {
      "rating": "9",
      "text": "The Matrix is a movie classic. This is a rather timeless film, mainly due to its effects, which look absolutely breathtaking, and at the same time it is a film from the 90s. The story is excellent and contains several legendary scenes. The action scenes are also excellent and the soundtrack doesn't even need to be explained how masterful it is. This is a MUST-SEE movie."
    },
    {
      "rating": "9",
      "text": "The Matrix is a heart pounding, shocking, stylistic action film that somehow successfully combines Plato's Cave allegory with the peak of late 1990s cool."
    },
    {
      "rating": "10",
      "text": "The most visually stunning, psychologically astonishing, groundbreaking film the world has ever seen. It combines elements of philosophy, martial arts, and wonder to make a perfectly balanced and thrilling movie. Plus, it has a real cast of actors, including Keanu Reeves as Neo, Lawrence Fishburne as Morpheus, and Carrie-Ann Moss as Trinity. Even if you're not into kung fu fight scenes, this movie will still satisfy you with its wonder and philosophical elements. Some movies go overboard with special effects and fight scenes, but this one does not. It has a perfect balance of fight scenes and philosophical things. Note: You have to see this movie a few times before you really understand everything that is being said."
    },
    {
      "rating": "10",
      "text": "Movie was great. Effects, Storyline, Scripts."
    },
    {
      "rating": "10",
      "text": "The movie is excellent! I did not even pay attention to the special effects, It is the concept that really rocks! Extremely mind blowing! This is the best movie I ever saw!"
    },
    {
      "rating": "10",
      "text": "Oh my god this film is brilliant. It has blown my mind. Thank you god for giving me the Matrix!"
    },
    {
      "rating": "10",
      "text": "Omg OMG exelent as both bill and teds just not as funny specilfx are brill and agent smith dude i need thst suit a spex they r great."
    },
    {
      "rating": "9",
      "text": "Nothing like this has really been made before. A combination of theology, philosophy, kungfu and cyberworld."
    },
    {
      "rating": "10",
      "text": "'The Matrix' is a revolution in the sci-fi genre. It's simply amazing!!!"
    },
    {
      "rating": "10",
      "text": "Easily in top 20 greatest movies of all time.Action packed from start to finish."
    },
    {
      "rating": "10",
      "text": "The most undoubtedly cool movie in a very long time. An absolute pity about the sequels. Sigh."
    },
    {
      "rating": "9",
      "text": "A fantastic film that is as creative as science-fiction films get. A great take on the \"What if\" question, and although the action is a bit over the top, it's supposed to be and it doesn't go too far. Makes you think and combines good use of colour, atmosphere and truly believable fear from some of the characters to make on of the best sci-fi films ever. Go buy it. It's just a shame the sequels were so bad."
    },
    {
      "rating": "10",
      "text": "Best movie Ive ever seen besides Braveheart. The fight scenes were amazing. Loved the rotating camera and slow motion effects. The story line was really good. Anyone that does not give this movie a ten obviously has bad taste in movies or just didn't really understand the movie!."
    },
    {
      "rating": "10",
      "text": "WOW! The special effects were amazing and the stunts in the movie were really cool and fun to watch."
    },
    {
      "rating": "10",
      "text": "Although difficult to understand at times, this action packed masterpiece brought together brilliant action sequences and fantastic filming to bring you a really great film."
    },
    {
      "rating": "9",
      "text": "This was billed as the action movie of the millennium. And it really was hard to argue with that. One of the best movies ever and the best sci-fi movie ever. With stunning set pieces and fight scenes, its a must see. A shame the third film was such drivel."
    },
    {
      "rating": "10",
      "text": "Its funny how some people give this movie a low rating. I don't think they fully understand the concept of a simulated reality. There are many actual scientific hypothesis regarding the subject, many of which seem extremely logical and involve Quantum Computers trying to calculate every possible combination and outcome of everything. Another considers the progression of technology and computer systems, and how they are already running complex simulations to help us decide the best course of action in many situations and where resources should be allocated. The matrix falls under the category of \"Brain-computer interface\" or \"direct neural interface\" and correlates directly with Neuroprosthetics which is an actual area of neuroscience. This is the first film to consider technologies impact on primitive culture, and the behavior which could result from direct technological integration into semi-intelligent organic life."
    },
    {
      "rating": "10",
      "text": "Gobsmacked all the way! This is a mile marker movie in the cinema time line. The cinematography is ground breaking and impressive - evidenced by how much it has been imitated. It is a movie for both Joe Six-pack and the philosopher at the same time. Joe S. will be satisfied with the Kung-Fu action and gun fighting expolosions, while the philosopher will scratch their chin with a new perspective on Descartes' Mind-Body problem. The kissy-kissy scene between Neo and Trinity is a bit hokey ... but I survived it and still left the theater slack-jawed. The next two movies in the trilogy do not follow this one very well. In fact, I think the trilogy is still incomplete. I am waiting for the next two...proper follow-ups."
    },
    {
      "rating": "10",
      "text": "Phenomenal don't believe any of the ratings under a 7, they're simply trying to keep you from being unplugged."
    },
    {
      "rating": "9",
      "text": "Great movie, one of my favorites. The ideas introduced in this movie were fascinating."
    },
    {
      "rating": "9",
      "text": "It's been nearly 20 years since The Matrix originally premiered, and it's tapping in and understanding of digital technology and culture from 1999 has aged so well. Though there are some sequences that look just a bit dated with the use of earlier CGI, this film still holds its own because the emphasis for SVFX at the time this was made was put on practical effects and NOT CGI. The final, climactic third act looks absolutely stunning still! This is a very layered story and world, and each time I have watched it I've gotten more and more out of it. There's a perfect relationship between the themes of fate and destiny + the existence of free will; Neo does not become, \"The One,\" until HE chooses to do remarkable things in desperate times. He does not become, \"The One,\" until Trinity chooses to express her love for him. He does not become, \"The One\" until he chooses to believe in himself."
    },
    {
      "rating": "9",
      "text": "When it comes to \"The Matrix\", believe all the good things people say about it because they're all true. This film is a win, a jackpot and you will not regret watching this, I promise."
    },
    {
      "rating": "9",
      "text": "Classic movie that is still as relevant and bad-ass as it was the day it came out. Perfect movie for Keanu Reeves acting style, and Carrie-Anne Moss was the hottest, baddest thing on film."
    },
    {
      "rating": "9",
      "text": "This was an amazing movie. The story is mind-blowing and presented in a very unique almost comic book style way with great cinematography. The writing could use a little work, but the philosophy and metaphors are spot on and suck in the viewer to the movie's universe. The visual effects pushed the industry limits at the time and still hold up to today's standards. I'd recommend this to everyone who enjoys movies, its a movie that can stand as a base line in comparing other sci fi movies."
    },
    {
      "rating": "9",
      "text": "Not only this movie is a kind of a solid element among the classics of sci-fi genre and considered a must-see for a lot of reasons, what I can agree with is that this movie is to make you think, even when it's been a whole while after you seen it; this will stay in your head. It is the topic, the idea, yeah, I call it philosophy behind THE MATRIX. That one thought everything we call our \"reality\" could for real be fake, nothing more than a simulation being projected into our heads is at the same time insanely fascinating and extraordinary frightening.It's a thesis already know to modern science and in the Matrix it's very well expressed, wrapped into an interesting fassade, which is obscure enough to make it exiting and clear enough to not get you lost in confusion. It's exciting, overwhelming and keeps you hooked until the ending. Also the visual effects, the music and certain scenarios are characteristic and will ever be associated with what The Matrix is. The only reason for me not rating it all 10 points is that as a movie itself, when leaving the message and the idea behind it aside for a second, this was nothing to blow me off. There was nothing very much not being seen among elsewhere within the genre and the plot development isn't any special either. So as I said, if you are into philosophy, this is one of the movies to watch. For a genre enthusiast The Matrix is a solid expereince, which is worth watching, but probably not very astonishing."
    },
    {
      "rating": "9",
      "text": "Truly a genre defining film. Exhilarating action, mind bending plot and amazing sfx. If you have ever played Deus Ex before watching this movie (like I did), you'll definitely get some of its vibes from it."
    },
    {
      "rating": "9",
      "text": "The whachowsky´s sister are two absolute masterminds of cinema. Can´t wait to watch all their films?"
    },
    {
      "rating": "9",
      "text": "those that say the plot is stupid are the ones that either didnt understand it or trying to make their promotion by it. Only the idea residing beneath this movie is even makes it worth experiencing it for"
    },
    {
      "rating": "9",
      "text": "The Matrix is a movie classic. This is a rather timeless film, mainly due to its effects, which look absolutely breathtaking, and at the same time it is a film from the 90s. The story is excellent and contains several legendary scenes. The action scenes are also excellent and the soundtrack doesn't even need to be explained how masterful he is. This is just a MUST-SEE movie."
    },
    {
      "rating": "10",
      "text": "A Dazzling start Of a Wonderful Franchise The Actions are Amazing And Music Is Amazing"
    },
    {
      "rating": "9",
      "text": "This film is the start of one of the greatest movie trilogy of all time, and the special effects make this movie awesome. (Along with Hugo Weaving as Agent Smith.)"
    },
    {
      "rating": "10",
      "text": "Very good film. The plot is great. And the action scenes are very epic. So yeah."
    },
    {
      "rating": "10",
      "text": "Watching this in 2021 for a 1999 the special effects still impress me, and the cast and plot is the state of art"
    }
  ],
  "recommendations": [
    "blade_runner_2049",
    "they_live",
    "mortal_engines",
    "upgrade",
    "equilibrium",
    "inception",
    "stargate",
    "the_matrix_reloaded",
    "avatar",
    "arrival",
    "jupiter_ascending",
    "hardcore_henry",
    "the_great_wall",
    "robocop",
    "the_matrix_revolutions",
    "master_and_commander_the_far_side_of_the_world",
    "the_13th_warrior",
    "moon",
    "minority_report",
    "oblivion",
    "battle_los_angeles",
    "europa_report",
    "the_terminator",
    "sunshine",
    "conan_the_barbarian"
  ]
}