{"id": 4021, "title": "The Score", "starring": ["Robert De Niro", "Edward Norton"], "runtime": 124, "genre": ["Action", "Crime", "Thriller", "Mystery"], "description": "An aging thief hopes to retire and live off his ill-gotten wealth when a young kid convinces him into doing one last heist.", "releaseYear": "2001", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/fsb4m9XW59mei8GKznvI3lLzcfp.jpg", "categories": {"plot": 6.2, "acting": 5.8125, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "8", "text": "Good movie, good story, great cast! I like well acted and thought out heist movies. They are so much better than the Oceans 11 type of movie."}, {"rating": "8", "text": "Robert De Niro was reportedly the victim of several practical jokes pulled by Marlon Brando during filming, including a remote controlled electronic whoopee cushion."}, {"rating": "8", "text": "::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::"}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$÷%÷÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%"}, {"rating": "8", "text": "The Score is a perfectly good heist movie with fine performances from DeNiro and Norton. It isn't a classic, but it's good in itself, on its own terms. The characters as well as the setup keep the story entertaining, and a couple of twists and turns churn out a fulfilling ending with some actual payoffs."}, {"rating": "9", "text": "His story accompanied by great performances by De Niro and Norton, makes the film interesting and exciting to be in the best style Mission impossible."}, {"rating": "6", "text": "In what was widely considered to be a passing of the torch, three generations of Hollywood superstars, joined forces for a thriller known as The Score. I found this to be a very strange film, as it features both moments of high intensity and moments that are painfully slow. Robert De Niro stars as Nick Wells, the best safe cracker you could find, but as he's getting older and seeking more stability in his life. Considering retirement, Wells is asked to be part of one last big score, that will have him, and his fence, set for life. Wells reluctantly agrees, before finding out there is a catch, he'll be working with his possible replacement, an arrogant and cocky young man, who could wind up getting them all caught. As far as acting goes, you may never see a better trio of leading men, De Niro, Marlon Brando, and especially Edward Norton were absolutely terrific in their roles. The film however doesn't really take off until the crime actually begins. For over an hour they are in the planning stage, painstakingly going over every detail, and it really is as bad as it sounds, in fact, I almost turned it off, until the wheels were set in motion. From that point, the film really is terrific, with an ending that will leave your jaw on the floor! I was very happy with the last forty minutes of the film, and all three actors were fantastic, but so much of this film moves at a snails pact that I really couldn't give it a higher rating. This is a two hour film, that could have easily been shortened to an hour and a half, without losing any of it's integrity. All the detailed plans and unnecessary back and fourth make the first hour of this film painful, but if you can stick with it, the second hour is certainly worth it."}, {"rating": "7", "text": "Overall, it's a good film. De Niro, Norton, and Brando, deliver great performances as usual in a film that is successful in getting you to root for the bad guys."}, {"rating": "6", "text": "The superb cast and production value elevate the otherwise average screenplay. Nonetheless it's a fun journey along to its predictable end."}, {"rating": "4", "text": "I am so disappointed, I was expecting to watch an amazing film especially with stars like Robert De Niro & Edward Norton, but honestly I felt bored.If you watched many heist movies, you can expect that there is a twist at end, and The Score is same as most of heist movies that you can expect it.I like Ed. Norton performance in Brian character, but i think it wasn't professional to make Ed use Jack character outside his work area !! It was a big heist and if anyone from his work saw him outside as a normal person, the heist will fail!! I think there are some missing parts in the story."}, {"rating": "5", "text": "may not sore perpetually..The ScoreThe Score is a plot driven crime thriller about a heist that bonds in two major players of this game, one is about to retire and one is much younger in this chase. It gets few sequences correctly and even though the incongruent and loud background score tugs out the heat from the soul, the effort is always plausible. Addition to that, what it does get right, are the steps of the structure that it takes, it is sensible and is calculative to all the possibilities, hence that allows it to dig deep and get into a detailed analysis of a simple heist. Now just like the mission projected in feature, another problem bounces back for the makers, amidst all these carefully formed husky material, there lies very thin crisp for it to offer the cinematic experience to the viewers. As mentioned earlier, the background score isn't impressive, the cinematography isn't creative and neither is something extraordinary in its editing; it's a mediocrity lane. De Niro's act is more reserved and buried under the hatch of the so called experience for it to be expressive enough and on the other side Norton gets quite a wide range to fill it in and he does it convincingly. Oz's execution might be old school but it works, if it's ought to be slow then let it be slow since the script is gripping enough to keep the audience invested in it. The narration is lucrative and adaptive with surprisingly not of vivid nature that costs the makers a great deal in its latter stages. The actual mission that undergoes various variations is what makes it stand alone than your usual crime genre. The Score may not sore perpetually but its pragmatic dose of thrills that it keeps hitting on our face makes it a challenging score if not the winning one."}, {"rating": "5", "text": "Regular in its kind, it counts on good actors who did not always shine.In this film, a professional thief almost to retire decides to accept one last millionaire work: to rob a real scepter that was smuggled and is hidden in the Customs of Montreal, Canada. The plan was the idea of ​​a newbie, who infiltrated the place as a mentally handicapped employee, and who promises to make things easier. But things will sour as the rivalry between the two and the egos dispute threatens to undermine the plan.We've seen things like that before. There are plenty of movies about assaults and the world of professional crime. The film is regular and complies with what is required to operate under these premises. However, there are some minor flaws. For example, the scepter issue. Royal scepters are rare, they generally belong to countries and their royalties. They are not easy objects to steal, and if this happens, it is a matter of much international investigation, besides being difficult objects to sell later. It would be easy for the customs officials to notice, through a phone call to the police, what they had in their hands, and the discovery of such a piece would soon be front page news. This makes it unlikely that the whole gang effort will focus on stealing such a piece. It is simply unbelievable.This is Marlon Brando's latest film. But if you are not an absolute fan of the actor or know beforehand that he participates, you will not even think about it and the presence of this mythical actor will go completely unnoticed, as he makes a relatively minor character and does not perform a remarkable performance. The same could be said of Robert de Niro, who plays the main character but lacking brilliance or greater merit. Edward Norton is, in my opinion, the actor who knew the most. You can say it's politically incorrect, and I can even agree, but he was brilliant at the scenes where he pretended to suffer from cerebral palsy. He is a versatile actor, able to do very well a wide range of characters, and surprised a lot here."}, {"rating": "6", "text": "Getting by mainly on its cast and occasionally fizzy energy, Frank Oz's \"The Score\" is a light-weight caper that mildly appeals, though it never stands out. Revolving around a safe-cracker who is roped in to doing one last heist before he retires, the film has a few good twists and turns but is, ultimately, nothing too far above an average viewing experience.Be it a gunfighter, gangster, or thief, the tale of the career criminal making one last score before hanging it all up is a recognizable narrative route. \"The Score\" offers nothing out of the ordinary in terms of that route, but it is solidly imagined. Full of the requisite twists and backstabbings, the plot is compelling if nothing too original.Oz's cast is the film's strongest ingredient with Robert De Niro, Edward Norton, and Marlon Brando filling the marquee. All are in good form for their various career stages and help to drive the film's energy. Oz keeps things light, but ensures that enough danger and peril drive the well-assembled production.\"The Score\" is a completely watchable and well-cast piece of work. It is just not apt to stick in anybody's memory too long after seeing it. Still, it is a perfectly competent heist drama with a respectable amount of low-key charms."}, {"rating": "8", "text": ",,,,,,,,,,,,,,,,,,,,.........@#$%^&*().,?!;:\"+×÷=€_▪○●□■•¤°⊙☆《》♤♡◇♧¡¿[]{}▪●■•°•°°°°"}, {"rating": "8", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "8", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."}, {"rating": "6", "text": "Ein Starbesetzer Heist Movie mit Robert de Niro, Edword Norton die die Hauptrollen spielen. Als kleine Rollen ist Marlon Brando in seinem letzten Film zu sehen. Zum Cast alle spielen super, aber ich Brando gab es leider nicht of zu sehen. Wenn er zu sehen war, war es super. Den Plot fine ich ok, aber nichts besonders. Der Film ist ok, es gab viele Entscheidungen von Charakteren, vor allem von Edward Nortons Charakter die niemand begehen würde. Der Film zieht sich und wird langweilig. Der Film ist leider sehr vorhersehbar, weshalb es für mich keine Überraschungen gab. Es gab Charaktere die überflussig waren und auch hätten gestrichen werden können.6/10"}], "recommendations": ["spy_game", "casino", "money_monster", "triple_9", "all_the_money_in_the_world", "body_of_lies", "motherless_brooklyn", "the_untouchables", "no_sudden_move", "a_most_wanted_man", "insomnia", "widows", "heat", "enemy_of_the_state", "state_of_play", "wall_street", "breach", "the_fugitive", "sicario", "hell_or_high_water", "catch_me_if_you_can", "primal_fear", "arbitrage", "inside_man", "the_infiltrator"]}