{
  "id": 606,
  "title": "The Secret Life of Pets 2",
  "starring": [
    "Patton Oswalt",
    "Kevin Hart"
  ],
  "runtime": 86,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Max the terrier must cope with some major life changes when his owner gets married and has a baby. When the family takes a trip to the countryside, nervous Max has numerous run-ins with canine-intolerant cows, hostile foxes and a scary turkey. Luckily for Max, he soon catches a break when he meets Rooster, a gruff farm dog who tries to cure the lovable pooch of his neuroses.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tFC5uFGmmbLu3QqrtoMAvw7RtM4.jpg",
  "categories": {
    "plot": 6.282051282051282,
    "acting": 7.25,
    "ending": 5.857142857142857,
    "soundtrack": 7.5,
    "cinematography": 9.0,
    "familyFriendly": 6.6,
    "funny": 5.9,
    "action": 7.75
  },
  "reviews": [
    {
      "rating": "0",
      "text": "It was boring, uninspired, unfunny, and slow. I'll  be honest, I didn't care for the first movie very much but I decided I would give this one a chance. I hadn't been feeling well I guess, only reason I could assume anyone under the age of three would want to see this. I did not laugh once but the kids around me also didn't laugh. It felt as if love and joy had left the room leaving us with nothing. I can believe every child left that film and atheist because it's clearly a sign that God has given up on us"
    },
    {
      "rating": "4",
      "text": "Well executed, but the script lacks cohesion. The first movie had a good script , this second one are 3 stories that blend in an artificial way. The history with Max is the best one and could have been a good script if it was focused in that area, but then they had to artificially add the other stories to be able to include more animals.It is worth watching if you have kids ( like myself ) but avoid to go alone."
    },
    {
      "rating": "5",
      "text": "Illumination's three way split storylines don't work. In this movie I found myself getting so bored, what made these characters work was being together and without that I just was not satisfied. Tiffany Haddish's voice work is super good but she barely had enough time to shine, I felt the same way with Chloe a recurring character. Overall I think the way the 3 storylines tied together was lousy and rushed. Good characters took the backseat to lousy ones like Kevin Hart's Snowball. At least Harrison Ford did good."
    },
    {
      "rating": "5",
      "text": "The first movie was a bit better in terms of humor. This time around the story divides itself into splits subplots. Somehow it breaks the action and rhythm of the movie. And the humor is a bit conventional. I give it 50%. As an adult I couldn't finish this movie. Maybe kids would love it more."
    },
    {
      "rating": "4",
      "text": "If you skip this i wouldn't blame you. This movie is very mediocre. You wouldn't be missing much if you skip this movie."
    },
    {
      "rating": "7",
      "text": "This movie was alright, in my opinion. The script wasn't as good as the first movie, but the animation is really fun to look at. The characters are ok, but the script kind of brings them down. It's not a great movie, but it's still enjoyable.Story: 5/10Animation: 9/10Characters: 6/107/10"
    },
    {
      "rating": "8",
      "text": "‘The Secret Life of Pets 2’ is one giant furball of fun! It’s definitely better than the original and it kept me locked in on the screen with funny jokes, great animation, as always, and a star-studded cast. Yet another great asset to Illumination!"
    },
    {
      "rating": "5",
      "text": "I understand this movie is all about the pets, but damn were those parents irresponsible as heck."
    },
    {
      "rating": "5",
      "text": "Its passable as a sequel and watchable but its pretty uninspired and derivative, its a sequel-by-numbers and nothing you havent seen before. Nice entertainment for the kids, but pretty average."
    },
    {
      "rating": "7",
      "text": "A simple, cute kids movie with rambunctious comedy and a little bit of sentimentality thrown in for good measure. It checks every box when it comes to wholesome family entertainment and is even a slight improvement over its predecessor. The plot is more original (the first was a riff on Toy Story) and it's nowhere near as dark or violent since the action is delivered in a more slapstick manner.I've seen a lot of criticism directed at the story being comprised of three separate threads, but personally I didn't find that to be an issue as it allowed for a wider variety of humorous scenarios to unfold while giving memorable side-characters like Gidget and Snowball something to do without having to shoehorn them into Max's adventure. I also feel they all came together nicely in the end.The animation is absolutely gorgeous. Very bright and colorful. The pets themselves are of course adorable. I really liked how, minus the talking part, they all felt like real animals as a lot of their behavior is true to life even when played up for laughs or action. The voice acting is top-notch and has the added bonus of Patton Oswalt proving to be a better fit for Max than Louis C.K. did.What's holding this back though is that it really is a movie just for the kids. Despite its best efforts there isn't enough depth to really grab adults in the same way a Pixar flick would. That's not to say parents might not still enjoy it for its silly sense of humor, but at the end of the day is simply a joke machine and not much else. Yet, it does take a step in the right direction as far as tone goes which has me more excited for a potential future for this franchise than the first one ever did."
    },
    {
      "rating": "5",
      "text": "Pretty lame excuse for a film, very mildly entertaining but extremely derivative."
    },
    {
      "rating": "5",
      "text": "This follow-up to the 2016 mega-success finds director Chris Renaud  ditching the more traditional -- and admittedly familiar -- narrative stylings of the predecessor in favor of a more vignette-centric approach. Sort of. Narratively speaking, this movie is confused, to say least. Instead of focusing on one throughline for the entirety of the film's running time, we focus on one for the majority of act one, three in act two, and then back to one in the final act. It's an odd, scattershot way of framing whatever this movie's trying to say, ultimately muddling the experience down to a dramatically bare slog at times. The animation is great, sure, but beyond that? Not much remains."
    },
    {
      "rating": "7",
      "text": "Saw first one, didn't go in this with some crazy expectations, i mean it is family movie. if you like kids you will enjoy it, this is not a movie like going for masterpiece or magnificient plot or something. Just fun movie for family."
    },
    {
      "rating": "4",
      "text": "Boring for adults. Maybe good for kids. The \"teaching\" behind it is that you grow up and instead of shielding from dangers of the world, you embrace it. Good but executed in a weird 3-part mini-stories that 1) tells you circus is bad, 2) makes you think you need to outsmart \"other kind\" by becoming them 3) you need to grow up by listening to adults.Also why the villain sounds like Gru?"
    },
    {
      "rating": "5",
      "text": "Huge DisappointmentWhile The Secret Life Of Pets 2 still has a great cast (Hart and Ford in particular) and some funny moments here and there, It’s plot structure and writing are a complete and utter mess. The Max plot is actually well written and should have been the only plot of the film, The Snowball plot was eh, The Gidget plot however was badly written and completely pointless. Plus, Where’s the romance between Max and Gidget that was established at the end of the first film? This sequel seems to completely ignore that. Though 65% of the humor is decent and the Max plot was interesting, The Secret Life Of Pets 2 is a massive disappointment."
    },
    {
      "rating": "10",
      "text": "I loved the original and I loved this one even more. The animation was just as terrific as it was in the first one. I loved how there was more action in this one. The voice over performances were outstanding especially from Harrison Ford, Tiffany Haddish, Kevin Hart, Patton Oswalt, Dana Carvey, Eric Stonestreet, Jenny Slate, Nick Kroll, Lake Bell, and Sean Giambrone. This is one of my top 10 favorite animated movies of 2019, one of my favorite movie of 2019, one of my favorite animated movies of all time, and one of my favorite movie of all time overall. A+ animated movie."
    },
    {
      "rating": "9",
      "text": "From the same creators of \"Despicable Me\", this film is the first sequel to be made by Illumination Studios outside of that same franchise. And in fact, it was predictable that it would appear as the first \"Pets\" was a notable success.The film takes up the characters we already know: this time, Max and Duke have to adapt to their owner's little son. Max took a long time to do it but ends up so fond of the child that he becomes overprotective and always afraid for him. When the family is going to a season in the countryside, he has the opportunity to face his newly acquired fears. Meanwhile, Snowball's life as a pet is perfect, with the white rabbit creating superhero illusions thanks to the plays with his child owner. The illusion, however, give him the chance to rescue a young white tiger who suffered abuse at the hands of a circus. Therefore, as you can see, the film has several plots that run in parallel, with a predominance of the plot of Snowball and the tiger, Hu. I believe that this was the biggest problem of the film, in that it relegates two central characters of the previous film (Max and Duke) to a highly secondary plan, besides making the film more complicated to understand for the younger ones.Moreover, the film brings little major news. One thing that was corrected was the number of characters having an active part in the plot. The previous film had a multitude of characters acting in a group. Here, Mel disappears and Pops, Sweet Pea and Buddy appear only in cameo. Cloe, Reginald and Gidget remain present, but only as a \"support team\" for the other characters. It is clear that Gidget's romantic daydreams about Max never developed also. The tiger, Hu, was very well designed and looks more like a very big cat, for being so docile. The most drastic change is Snowball, who became a heroic figure when he was the great villain of the previous film, where he even had a certain psychopathic personality. The transformation, however, was easy to predict for those who saw the end of the first film. Back in excellent shape are also the voice actors from the first film, with the exception of Louis C.K., who stepped down after a sex scandal and was replaced by Patton Oswalt. The film also has the additions of Tiffany Haddish and Harrison Ford, in his first voice work. Again, dialogues and jokes are still well thought out, but making you smile rather than laugh.Technically, it is a film where it was difficult to demand better. The CGI and the quality of the animations are impeccable, with the animals drawn in their details, magnificent colors and light, movement and action at the right times and guaranteed doses of cuteness. The pace is good, and I never felt it dragged. The soundtrack is still signed by Alexandre Desplat, but it was not as close to my ear as the one in the first film, being too similar to many others that circulated there.Although not as good or as well done as the first, this film is an honorable sequel that knows how to live up to the existing material and the expectations of the public."
    },
    {
      "rating": "7",
      "text": "Um bom entreterimento, mas ele é muito infantil, mas é divertido pra quem goatou do primeiro vale a pena"
    },
    {
      "rating": "6",
      "text": "As much as I liked and enjoyed the film, I can't help but feel that it could've been so much better. For one, the film's story at the beginning feels very centered around Max, but later on the story gets split up into three. And then near the end of the movie, all three of them join back together again. I would've preferred for a story centered around Max's character and then have a few supporting characters to fill in for that one story, something I think The Queen's Corgi might be able to achieve once I watch that. As it stands, The Secret Life of Pets 2 is an above average film with a lot of lost potential."
    },
    {
      "rating": "6",
      "text": "The First Secret Life of Pets had been a Toy Story Movie…with pets and I’m not satisfied with that but how the story went like was fine and I actually wasn’t disappointed. And this year, we have the sequel. Yeah, that’s right, there’re more new characters and also new bad guys coming. The sequel was a bit disappointing to me. This time, Max started to be different. The original voice of Max changed to another actor and when I hear the different voice, I found it laughably bad for example:    “Rooster: Are you afraid?    Max: No, No I’m Not!”I could see the difference and it’s negative. The other casts acted like pets as well: they did little talking, especially Kevin Hart, most of his screentime, he kept screaming like a bunny trying to be Captain Snowball. He went like: ‘YAAAAAAAA!’ but he still kept the humor we all wanted. When it got the vet scene, the other animals went like chaos, especially the hamster in the wheel and the grey cat with green eyes.  Moreover, many characters in here which were kinda main in the first movie and now they just switched roles like Gidget, she was one of the main characters in 2016 but in here, she played a minor role. She didn’t even have that much screentime and all she did was just being a catdog. Let’s talk about Indiana Jones playing the Rooster. Ford did good at that role but the problem is that he also didn’t have enough screentime and there’s one scene that I felt they had to make the dog say goodbye to Max and Duke before they leave the farm. That scene was carelessly handled. Duke was also the ones who switched role to minor and so was Pops. He taught young dogs how to be…dogs. These characters switched their roles in a horrible way and I was disappointed. The villains here didn’t have enough screentime either. We had the first movie to be like Toy Story and now The Secret Life of Pets 2 looked like Toy Story 2 with an adventure outside their owner’s house and Stinky Pete looked like the Circus guy which was a bad guy. Most of the scenes are literally boring and they had a slight piece of entertainment in here. Most of the scenes here had the kinds of rap or pop music which didn’t match them, not even a sound just like the first trailer, they had this “Walk it Out” song which I felt really annoyed and I thought the first trailer was horrible. They also had this bad idea to turn Katie and her husband’s child named Liam to be a dog. He wanted to dig, to pee and various things Max and Duke could do.  I really think these people could do better than just switching roles without knowing the result, screaming all the time. If I was in this movie, I would say “If y’all want to get Crazy, we can get Crazy!”. Everyone’s acting like chaos is in New York and the humans did not know it (well some did). This is also one of the disappointing sequels I saw this year.Ratings: 5.9/10"
    },
    {
      "rating": "8",
      "text": "The Movie is really fun, though it kind of fell apart at the end. Sad that this is way better than Toy Story 4."
    },
    {
      "rating": "9",
      "text": "Go character development and a really interesting story for the whole family."
    },
    {
      "rating": "6",
      "text": "It has too many storylines, making the movie a bit disjointed. Could've created 1 nice awesome storyline instead of splitting into 3 parallel stories. But overall, it's hilarious.. especially snowball"
    },
    {
      "rating": "0",
      "text": "It sucked..I loved the original movie watched it 1000 times!! This movie though, was trash.. to many things going on all at once and all ending to quickly. And where the f is the hawk personally was my favorite character. Just trash!!!"
    },
    {
      "rating": "6",
      "text": "This is one of those movie where \"you get what you pay for.\" If you know what I mean.Also hearing \"Panda\" in this movie, even though sung by Kevin Hart felt like a war flashback. I forgot about that song, thanks for reminding me."
    },
    {
      "rating": "6",
      "text": "Pets 2 is good enough, even with the thin plots and alright humor.My Score: 63"
    },
    {
      "rating": "3",
      "text": "Три сюжетные линии ТРИ нормальные фильмы не берутся за столько сюжетов а тут и говорить нечем одну они все ки потеряли и объединились только 2 вобщем тут прям нолоновские амбиции, ружья весят на стене но то что они висели и выстрелили я понял только после просмотр, везде это иииииии ааааааа ура детей развлеч может и получится но поле 3 лет уже не смешно только в конце экшончик как и в перво но все остальное время чуть не умер со скуки несоветуюй части"
    },
    {
      "rating": "5",
      "text": "The plot was wery boring, bad that there were no adventures and the main villain."
    }
  ],
  "recommendations": [
    "incredibles_2",
    "the_lego_movie_2_the_second_part",
    "turbo",
    "the_secret_life_of_pets",
    "hotel_transylvania_2",
    "despicable_me_3",
    "penguins_of_madagascar",
    "bumblebee",
    "rio_2",
    "despicable_me_2",
    "hotel_transylvania_3_summer_vacation",
    "frozen_ii",
    "shazam_fury_of_the_gods",
    "spies_in_disguise",
    "minions",
    "next_gen",
    "the_tale_of_despereaux",
    "the_croods",
    "pirates_of_the_caribbean_on_stranger_tides",
    "megamind",
    "pan",
    "bolt",
    "rise_of_the_guardians",
    "ice_age_the_meltdown",
    "storks"
  ]
}