{
  "id": 2897,
  "title": "The Foreigner",
  "starring": [
    "Pierce Brosnan",
    "Jackie Chan"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Quan is a humble London businessman whose long-buried past erupts in a revenge-fueled vendetta when the only person left for him to love – his teenage daughter – dies in an Irish Republican Army car bombing. His relentless search to find the terrorists leads to a cat-and-mouse conflict with a British government official whose own past may hold the clues to the identities of the elusive killers.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rwM4hzrmc5HiWfQD9ls9DL4QgGl.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.5,
    "ending": 7.625,
    "soundtrack": 8.5,
    "cinematography": 4.333333333333333,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.183098591549296
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Foreigner - very serious movie, well scripted, directed and all the cast in it performed dutifully well. It'll keep your interest to the end. The story has a progression that's absorbing, it's mesmerizing and continues to get better all the way to the climax. The makeup, sound mixing, action choreography, and acting performances are all top-notch. Jackie Chan perhaps gives his career-best performances, both physically and emotionally. He just does the things that makes you feel good about his character. Best political action-thriller and best Jackie movie in many years."
    },
    {
      "rating": "9",
      "text": "I loved this film. It was fast paced, well acted throughout and I watched it in one go, which is rare for me when streaming nowadays.  Chan showed a completely different side and made me wish he had done more serious roles and hope he does more in the future. Recommended."
    },
    {
      "rating": "9",
      "text": "Very well built political action triller (cudos to the director Martin Campbell for that \"very well built\" part). Jackie Chan and Pierce Brosnan are giving (probably) the best performances of their careers. The action scenes are raw, brutal, not something, that you might expect from your average comedy-style Jackie Chan movie.I was an equally huge fan of both Jackie and Pierce and I've got two at a price of one, so I'm not dissapointed, but don't come to this movie expecting a \"Taken\" with Jackie Chan, or you will be dissapointed!"
    },
    {
      "rating": "8",
      "text": "Not much Chan martial arts wackiness, here, and the killer smile is nowhere to be seen - but he's as effective as he's ever been; each blow (and there ARE quite a bit) counts, and you really care for him and his motivation. Brosnan is great as the suit with a shady past (and present?). Just a great thriller/actioner of the kind they don't really make anymore."
    },
    {
      "rating": "9",
      "text": "Wasn’t sure about this movie but definitely enjoyed it ALOT has great characters, has a realistic and touching story, good acting, good fight scenes, great filming. One of the movies that hit an all around great movie for me, Chan played it great and the ending was perfect. I enjoyed how the story played out and how the characters interacted, lots of great parts make it be a fantastic movie"
    },
    {
      "rating": "8",
      "text": "7.9/10  A very solid revenge action drama with some signature Jackie Chan excitement. Some absolutely mind blowing sequences of Chan flourishing as well as a good performance by Brosnan."
    },
    {
      "rating": "8",
      "text": "Although I would have hesitated to go to this film had I known it was about the IRA (again), I don’t regret seeing it at all. The cast is excellent, including Jackie Chan in a non-stereotypical Jackie Chan role. Likewise, Pierce Brosnan was able to play something other than a James Bond hero type – something with more depth and character. The plot was suspenseful and moved along briskly, and thanks to the skills of the British actors, every character had a personality and was not a stereotype. I also enjoyed seeing how the British combat terrorism."
    },
    {
      "rating": "7",
      "text": "By the numbers revenge action thriller starring Brosnan and Chan. It's a well produced film that takes its plot seriously, adding an IRA bomb plot flavour into the mix. Campbell's kinetic action scenes at times reminded me of casino royale. Overall The Foreigner is 'that' style of revenge action thriller that I have seen so many times you know exactly what you're getting... this is the films greatest strength and weakness."
    },
    {
      "rating": "7",
      "text": "Great movie, action, thrills and Jackie Chan's skilled acting plus martial arts skills. Also I thought Brosnan was really good in this one too and the story is actually quite interesting and not predictable all the time, which is good."
    },
    {
      "rating": "9",
      "text": "Drastically underrated movie. Chan's performance is perfect and well accompanied by Pearce Brosnan. The story has been seen in many other movies before but the novel the movie is based off pre-dates most of those movies.The movie differs in parts from the book but I feel the differences were needed. It's a shame Jackie Chan doesn't play more serious roles like this as he nailed this one."
    },
    {
      "rating": "7",
      "text": "Jackie Chan is excellent in this movie. He pulls off a very dramatic performance and despite being older now, he can still do impressive action stunts. This isn’t really an action movie, but all the fight scenes are exciting and well-done. Brosnan also does a good job here playing an emotionally conflicted character. The directing is solid, and while some technical aspects (like the sound) could’ve been better, it’s fine enough. Overall, The Foreigner is a very solid movie. It’s more of a political thriller than a straight-up action movie, but it still does a good job with an intriguing story and well-done action scenes. In addition, both actors do a great job in their respective roles. It’s also nice to see that Chan can still do the things that made famous in the first place. The Foreigner is nothing spectacular and the story can get too convoluted in areas, but in the end, it’s a solid thriller."
    },
    {
      "rating": "8",
      "text": "Jackie Chan has acting chops. I didn't even know that until this movie. He is so good at showing the torment of a Father who has lost his wife and three children in heart wrenching ways. The action pieces featuring his unique brand of fighter are even better as a realistically older/experience ex-special forces beating the opponents while getting quite hurt himself.Pierce Brosnan was quite good as a Irish freedom fighter/terrorist turned politician. The thriller portion isn't the best I've seen, but it was quite engaging and the wife and I really felt pleased with the ending and the movie as a whole."
    },
    {
      "rating": "8",
      "text": "This movie felt like it was a perfect fresh story out of a great action movie studio. The actors did a marvelous performance on delivering their character's insights. Every single on of them even in the supporting roles. Cinematography, amazing. The script was great, and definitely had that Irish vibe they where going for. The visuals where great as well, and very practical, so everything looked crisp, clean and realistic. Sound effects where very realistic as well and matched the action scenes. The plot was amazingly fresh and honestly never seen before. (At least for me) It was also delivered in a great fashion which wasn't repetitive cliche, or cheesy at all. And it reflected on little problems that characters had through out the main story development. Which made it even more complex and entertaining. Overall it's a very good movie, and respect for Chan making his own stunts again at his age, and all the actors and directors, and also the writer. Who said the English can't make a good movie?"
    },
    {
      "rating": "8",
      "text": "The best Jackie Chan movie I have ever seen.The trailer lies a bit. It gets the basics right. Jackie Chan plays a father who lost his daughter in a bombing and who wants the names of the people responsible. Pierce Brosnan is the Irish governmental member whom he goes after.However, the trailer is misleading in how it portrays the movie itself. The trailer relies on Jackie's known acrobatics, insinuating its another \"John Wick\" style action movie. It is not that at all, it is closer to a spy thriller.There is a lot more drama, emotion and realism in the movie. People get hurt, the fight choreography seems more realistic and grounded. What you see in the trailer is the only real Hong Kong action you get. The movie does a fairly good job following Jackie Chan, but it also focuses a lot on the IRA, Pierce Brosnan and the UK police. Definitely has more of that spy feeling, with political manipulation and intimidation.The good: Jackie Chan does great in this drama, and Pierce Brosnan is the most interesting I have seen him in a decade. The story is tight and keeps moving forward.The bad: The view of the IRA is a little black and white for me, not really portraying why they fight, but just that they are killers. They do mention \"the Troubles\" but then again this is probably how western media portrays other groups that are believed to be resistance fighters/heroes to one side, and terrorists to the other.I am glad I saw this, and I hope they stay true to the story and don't make it a \"franchise\". Some stories are better off being told once."
    },
    {
      "rating": "10",
      "text": "Jesus... this was... this was awesome... I'll never look at Jackie Chan the same again... & Brosnan, as usually, delivers another great performance... I was truly blown away... hoping this Jackie Chan is who we see going forward."
    },
    {
      "rating": "10",
      "text": "I'm a big Chan Fan, watched almost all of his movies. Most folks from the west aren't familiar with his more serious roles in China or how brutal some of his early movies were, so it was refreshing to see him portraying a man who lost everything. The movie itself has good pacing, pulse pounding soundtrack that harkens to 80's action films, decent action (not enough), and well-played performances. BUT the movie lacks in main character time. It starts off well by helping the audience get emotionally invested into Jackie's character but the second half devotes most time to unraveling conspiracy. Brosnan ends up carrying this movie leaving Jackie to feel more like a spectre or vengeful spirit almost. The movie satisfies but just barely. I would have been happier with more rage, more action, and definitely more Jackie."
    },
    {
      "rating": "9",
      "text": "Just go to any Jackie Chan movie folks. Watch his organic action sequences. Watch how he uses common objects in a natural way. Watch him experience pain when he falls and gets hit. Jackie is a legend. Enjoy."
    },
    {
      "rating": "7",
      "text": "Seeing Jackie Chan in action once again in The Foreigner really packs a punch for this movie. It’s fantastic seeing Mr. Chan himself kicking ass in this gritty R rated action flick directed by Casino Royale’s Martin Campbell. The choreography, cinematography, direction, and performances of this film really added some nice flare to this film, but at the same time, it had a huge flaw that dragged me too much that I actually have difficulties seeing this movie and it has to do with the story. For those who saw Jason Bourne, you’ll understand me. The setup of this story is too simple to predict. Overall, The Foreigner is worth checking out, and to be honest, it’s pretty rad that Jackie Chan is still pulling more tricks on his sleeve for this gritty film and it's even better than Jason Bourne. (And a Rush Hour 4 must happen!!)"
    },
    {
      "rating": "8",
      "text": "A real action movie which delivers to go along with a reasonable story line.  Probably would have rated this a tad higher but some escape scenes were a bit too far-fetched. Passed the grade of keeping the audience captivated .... even as this film has been out for awhile"
    },
    {
      "rating": "6",
      "text": "I'll start with this, if you are going into this movie to see Jackie Chan, you'll be quite a bit disappointed. Chan may have been in the previews, but this is really Pierce Brosnan's movie. Not to say that is a bad thing because Brosnan gives an superb performance. The story isn't bad albeit a bit cliche. When Jackie does have his moments, he shines very well and his cat and mouse with Brosnan is very well done. However, there is not enough of it. The movie goes from desperate father seeking revenge to a huge conspiracy plan that almost leaves Chan in no man's land. Imagine if Taken suddenly turned into Sicario, yet it was still Taken. Now despite that, this is not a bad movie. The real issue that I have is, I wanted less international conspiracy and more Jackie Chan. He was the selling point of the movie. I came to see a 63 year old Chan kick *** and take names. That didn't happen as much as I would have wanted in this movie. Pretty much all the action you see in the previews are his action scenes. You would think a broken father with nothing left to lose and a spec ops background would be the perfect recipe for a movie of him tearing through opponents. But its really an afterthought here. This isn't a bad movie, just wasn't what I expected. TL;DR Less international black ops terrorism story, more Chan please."
    },
    {
      "rating": "7",
      "text": "The Foreigner was a good action and suspense movie. All tied up into a political conflict and personal tragedies. It surely wasn't a typical J. Chan, but it was really fun to see him in a more dramatic context with more acting skills demanded of him. The actors were pretty solids. The action was more smart then throwing punches and kicks. Maybe the political side will bore some peoples, but it makes the drama of the movie so much more plausible. The morale is also very variable depending on the point of view. I give it a 70%."
    },
    {
      "rating": "6",
      "text": "I have seen just a few Jackie Chan's movies lately, the last one wasn't reallt a disaster, ''Railroad Tigers'', nothing from other world but it had more enthusiasm than his last failures, nevertheless I fervently believed that his better times already had passed and perhaps it was time to accept the retirement, at least from the action genre but I must be honest, if he does not do that, then what does he has left?The Foreigner has nothing new, nothing fresh or relatively flashy and yet is as functional as its elements allow it be. Chan and Pierce Bronan show a more solid commitment than usual and although this is an action thriller saturated with cliches and its mistakes is not really a disappointment with all its letters.You will not have any epiphany after seeing it, I doubt you'll remember it after a few days, however I give it credit for being better than I expected because at this point they don't even try anymore."
    },
    {
      "rating": "7",
      "text": "The Foreigner is a great movie that Blade Runner 2049 can't stand it! I have no idea why this movie is so great! It is also kind of boring, but it's entertaining that people will cringe!"
    },
    {
      "rating": "5",
      "text": "Honestly expected a lot more from this. It's not the Jackie Chan action movie it was marketed as, it's quite talky, there's action but it's all spaced out and doesn't last too long, and Pierce Brosnan has more screen-time than Chan does. Jackie Chan kills it and he makes it worth watching but otherwise it's just meh"
    },
    {
      "rating": "5",
      "text": "The Foreigner's attempt to grab audience's attention is, if you are very experienced with movies, very unmissable at high rates. Ironically, the movie's tagline is \"Never push a good man too far\" yet the film attempts to push the audience too far into a most likely film that has trouble reminding itself where to go when the film advances to the end. On the other hand, inexperienced people may find this very fun to watch and I accept that, but, with many issues the film gave during midway, I find it very exhausted to know who would literally put a heart onto this film."
    },
    {
      "rating": "3",
      "text": "Very long and boring, this political thriller that was marketed as an action movie has fallen flat with stale story-telling and forgettable characters. Jackie Chan was advertised as the main character in this film but has only received short screen time with his performance. At max he had all the action sequences but has little to no dialogue which included \"Give me the names!\" or \"You will tell me the names.\" I was deceived and I want my money back haha."
    },
    {
      "rating": "6",
      "text": "Don’t expect Jackie Chan’s impish smile and affable personality cause this is a dramatic departure for the action star (he even cries…twice). He plays an immigrant to London, whose his daughter is killed in a terrorist bombing. He sets out to find and punish the people responsible. Pierce Brosnan is on hand to complicate the plot. He plays an Irish liaison to the British government whose own interests provide most of the complications (and a bit of confusion). Meanwhile, Chan uses his martial arts skills to exact revenge. It’s fun to watch these occasional scenes, but there’s much more personal interaction (meaning talk) than action."
    },
    {
      "rating": "1",
      "text": "How it escapes people that every person of colour in the movie is a good guy and virtually every white person a bad guy is beyond me. Pretty much the inverse of modern terrorism in Europe. These things are intentional and in an environment where globalists are desperate to destroy White majorities in the world just stands out as a poor, & very political choice. 1 star."
    },
    {
      "rating": "3",
      "text": "Jackie Chan can't save \"The Foreigner\" from being a mess. The action is big but soulless, the plot stupid, and the political espionage angle is scattershot."
    },
    {
      "rating": "6",
      "text": "The P.H. Metric 61/100The Foreigner rings out in the same way a nostalgia flick does, let us take something that was more cutesy and lovable and make it gritty, then get applauded for the dark tones of something that is almost the same as the cutesy original version.Directing:  5/10Now the marketing is going to sell you on this is the director that made that gritty reboot to the Bond series (pattern?), but this is also a director that has averaged borderline ok to pure trash for almost every film he has made for the last 18 years, so if they are going to tout the good, remember the bad as well. The Foreigner is plain, nothing special, nothing amazing, average work from an increasingly average director. The camera work reeks of status quo and scenes as well as their shots play like the project was being rushed and not given any true forethought.Acting: 5/10Brosnan and Chan acting powerhouses, they are not, but Chan is cast in a similar light as Jet Li in Danny the Dog, do not let him say much and get him to look brooding, but in terms of acting there is very little to display. Brosnan has to carry 90% of the acting in the film and while he makes a go of it, his talent is not quite there to be able to pull it off. Aside from these two, a series of increasingly wooden people try to make their arguments heard, but are nearly pointless in the cause.Cinematography: 7/10Tattersall's cinematography is above average but not his best work to date and the fight scenes were shot in a such away that it felt like you could see Chan get dragged by the invisible rope every time he did a double drop kick.Editing 7/10Catanzaro finally gets to step from out of the world of television and edit her first real film, (Smoking Aces 2 does not count) it was not a horrible first outing and with a couple steps into tightening up the pace of certain shots and phasing out some action that causes the quality of the film to go down, she could see her star rise higher.Score: 7/10The sound crew did not let the film down and those pulsing tones, are felt hard and they are felt fast. One or two miscues drops the score a bit but overall decent job.Visual Effects: 6/10I feel mean giving the visual department such a low score, I know they can only provide what is scripted and asked of them and in this case I am sure they could have provided more if they were pushed, but the effects felting underwhelming.Writing: 3/10\"OK did we make our protagonist sympathetic?\"\"Not really.\"\"But it is Jackie Chan, did we at least make it seem like the system was screwing him over?\"\"Not really, we gave him a stalkerish vibe and showed no ineptness by the police or the Counter terrorism people.\"\"Great, did we at least make it cohesive with plot-holes.\"\"Well we turned all 500 plot-holes into one big plot-hole.\"\"Perfect, sounds like we can knock off early.\"Production Design: 7/10Production design was probably the highest ranking factor in the film and good on them, but that generally should never be the case.Costume Design 7/10Very limited, for a good portion of the film every one is dressed in black and there happens to be a couple of issues with Jackie's outfit.Make-up/Hairstyle 7/10Limited, though the work on Jackie was well-done, though the question of what is natural and what is not does pop up, but still decent job."
    },
    {
      "rating": "8",
      "text": "Part political thriller and part gritty action drama, this was a more subtle and complex experience than I was expecting. Chan's performance is superb, and the compelling storyline combined with the excellent action sequences make for a polished film. A considered and well crafted film well worth your time. 8.22/10"
    },
    {
      "rating": "5",
      "text": "It's quite disappointing how little of the actual foreigner i saw. To be honest i mainly went to this to see Jackie Chan back in action, and see how he would be in a serious movie and for the most part i actually liked it. The the movie got TOO political and ran away from the title, where the movie is about British and northern irish politics with Jackie Chans character stuck in the middle and it was too confusing and disappointing at the end"
    },
    {
      "rating": "3",
      "text": "Short description: Asian Taken. This movie is a slow and tiring experience ."
    },
    {
      "rating": "4",
      "text": "it's the chinaman..The ForeignerIts the cat and mouse chase that hooks you off the movie but the lead actors charm and screen presence is what pulls you back in. some tricks and dreadful actions are shown with a great conviction which keeps you rooting for it till the end even though it has a raw script."
    },
    {
      "rating": "9",
      "text": "an excellent way to bring Hollywood style Jackie Chan to the US audiences. While it may not top most of the films Jackie Chan has made in the last 10 years in China, it is an excellent launching platform and audience / financial success which greenlit numerous films Jackie is currently filming, in pre-production, or films in post-production (including films which previously would have launched around the world but not in the USA... like his numerous back to back years of shattering the box-office records since 2011-2016 each release. Now we will get Journey To China 2 in the USA, Project X could have ended up with an international release but not the USA similiar to the FANTASTIC \"Dragon Blade\" although John Cena and Jackie Chan's Iraq Epic will be coming to US Theaters, While Namiya a very touching and well written, directed and shot Drama film did not reach the states from the IMDB of what is in the pipeline (9 films currently) it is easy to say \"8 of these are just about a lock for major US distribution!).That in its own right is a WIN for not only Jackie Chan fans but fans of proper Martial Arts Cinema or Hong Kong Cinema.  The Foreigner is a very well built and thrilling political action movie, small details may pass the average viewer leaving them missing out on key moments of understanding - along with the IRA being the focus of the film, many younger viewers may not have any knowledge of the brutality of terrorist attacks which had occurred in the United Kingdom as discussed in the film. (This may be one reason the Asian release uses a different abbreviation, which to be quite honest I am unsure of what exactly the terrorist organization in the Asian/Indian releases are referencing.)If you love Jackie Chan, go see this movie. Period. If you have not been keeping an eye on Chans amazing films over the past 10 years outside of Hollywood and are noting how he looks \"OLD\" in the film, this was mainly due to the added make-up and grey to Jackies Hair. While he is indeed in his 60's do not let that fool you, he still fights, and does his stunts with grace in his other films that have come out lately although in The Foreigner it was stated by Martin Campbell that he wanted Jackie to become the character as an older beaten up and battered Vietnam Vet who had been captured and tortured as a POW. This is the reason for the choreography displaying a bit of limp movement and slower fight coregraphy which as the film progresses you note Quan (Chan) becoming more 'youthful' in his tactics and movement as he becomes closer to achieving what he set out to accomplish. By the end of the film the final bout, while it is not the sort of fight we'd see in another film of his from the same year (Railroad tigers for example, Kung Fu Yoga) it is still excellent - Don't worry US audiences, Chan still has it and will be putting it on display in some of the upcoming films to be excited about.The Foreigner is a near flawless movie - I have given it a 91/100 as the lead Jackie Chan and co-lead Pearce Brosnan both with possibly the best dramatic performances of each career while never allowing the film to enter into any lack of momentum, it does not drag despite the longer running time than most Hollywood Chan Films it keeps the viewer engaged with intricate details that unravel the story and has enough twists and plot points that you do not see coming that warrants a second watch to fully process everything.After that second watch it becomes a classic dramatic political thriller to turn on whenever with whomever. It's just a wonderful film from start to finish."
    },
    {
      "rating": "6",
      "text": "Reasonably entertaining action-thriller with good acting but ridiculous plot."
    },
    {
      "rating": "6",
      "text": "This is a real performance-driven film and my hat is off to Brosnan for killing it in the lead role. Chan does a great supporting job and both guys got a much-needed boost by playing against their typecast role. While the story is good, I am pretty disappointed with the action scenes, Especially the knife fight in the woods. That fight was a lot more comedic than serious and was pretty disappointing to me. All in all, It is a good movie and well worth seeing."
    },
    {
      "rating": "7",
      "text": "A thrilling political triller with lots of genius battle scenes, whose greatest advantage is the choreography of Jackie Chan as well as his personal involvement. This extraordinary project is not only a greatly filmed action movie and an interesting look at terrorism in the British Isles."
    },
    {
      "rating": "7",
      "text": "While it's not the most original action movie out there and it is quite predictable at times, Jackie Chan is still great, the soundtrack was surprisingly good, the action sequences were very well made, the movie was entertaining and the ending was satisfying. If you're looking for a grim action flick with well choreographed action scenes, you will undoubtedly enjoy this one."
    },
    {
      "rating": "6",
      "text": "I was sort of bored because the plot was sort of predictable, I wanted to see a Jackie Chan movie here or maybe a gritty rambo like film with Jackie Chan, but thats not what the movie is it's sort of the same flavor as the movie the November man which also has pierce Brosnan in it I would have better liked this movie if Brosnan joined Jackie Chan or something, because it is hard to see Brosnan play a good villain opposite Jackie Chan."
    },
    {
      "rating": "7",
      "text": "O Estrangeiro, filme em que me deparo novamente com jackie Chan no papel principal, acaba por ser um filme em que o enredo flui de forma correcta e prende o espectador ao ecra. Não sendo obviamente uma obra prima acaba por nos entreter e dar-nos um bom serão no que toca a filme de ação e drama."
    },
    {
      "rating": "6",
      "text": "A humble businessman (Jackie Chan) seeks justice when his daughter is killed in an act of terrorism. A conflict ensues with a government official (Pierce Brosnan) whose past may hold clues to the killers' identities.What would you like to see less: yet another spy / government / secret ops action or yet another action movie which has a geriatric leading man because they don’t want to retire just because of the old age.Well, in this case, you get both. But „The Foreigner“ has a secret weapon – Jackie Chan. Yes, he’s 63 now but Asians age well and he can still kick it, seemingly effortlessly.It’s not mostly just clever editing, body doubles and special effects too, Chan’s proud to be able to do the physical stuff himself, just like he has always done.The amount of ass-kicking has dried out a bit – the first fight only occurs about 45 minutes into the near two hour movie – but you’re still gonna have fun watching Chan doing the brawl.For variety’s sake, there’s also a hefty amount of explosions, shooting, and political intrigue, because you can’t have shady government thriller without it.Ex-Bond Pierce Brosnan as the nemesis is not bad either although he sounds like a lecturing schoolteacher most of the time, which makes the result feel cheesier than it has to.But this is still a Jackie Chan movie, so some cheese factor is expected, starting with the fact that most of the events wander somewhere in the nowhereland between believable and ridonculous.Then again, the dialogue and the motivation of characters stay on the serious side, which compensates for some of leap of faith the viewer has to take to enjoy all this. This is a not often seen kind of action movie where the dialogue sounds actually pretty good too.Much is happening, too, even considering the 114 minute length which honestly seems too long for this kind of entertainment.There are political and personal intrigues, a bunch of secondary characters doing something or other, surprises and even a bizarre but cool Rambo style section in the woods.Oh, and the rumors about Chan showing his acting skills here are true. Despite the importance of kicking ass, this is a rather complex role dealing with irreparable loss, regrets and getting old.I recall that Arnold Schwarzenegger’s latest screen role could be summarized with the very same words, but his performance isn’t half this moving, and the movie („Aftermath“, 2017) kind turned out to be a stinker as well. Sorry, Ahnuld!Ultimately, I rather enjoyed my time with Jackie Chan who does not try to conquer the West anymore and thus rarely appears in our cinemas.„The Foreigner“ will not leave a burning and lasting impression but there’s lot to like about it, even if it would benefit from being 20 minutes shorter. There’s so much going on that some of it will feel a big half-baked retrospectively. Or maybe there's just too little of Jackie Chan for a Jackie Chan movie.By the way, the director Martin Campbell was the first to offer us Pierce Brosnan as James Bond in 1995 („Goldeneye“), plus „Casino Royale“ which is my favorite 007 movie of all time.He did the two Zorros with Antonio Banderas as well – not to mention 2010’s „Edge of Darkness“ which didn’t turn out to be much of a comeback for Mel Gibson after all. And then there’s „Green Lantern“, of which the less said the better…"
    },
    {
      "rating": "8",
      "text": "Jackie Chan, Pierce Brosnan scénario digne d'un taken! Très bon menu à consommer avec modération !THE FOREIGNER est un bon film sur la manipulation gouvernementale et l'enjeu politique d'un seul homme dans un contexte d'attentat.Des scènes d'actions bien chorégraphiées, mais un peux courte.Une histoire avec une petite longueur surtout au milieu. Une fin satisfaisante.Des musiques oubliablesMais un enjeu digne des grands! Dommages que le budget n'est pas suivi seulement cela reste du vu et revueIl est toujours intéressant de revoir avec d'autre acteur..Enfant s'abstenir"
    },
    {
      "rating": "9",
      "text": "There are some weak  points in antagonist behavior - I disagree that IRA is so dumb as it is portrait, but I guess this is some kind of a standard for \"bad\" guys in action movies. Overall very solid script and great acting of them all. Was very unusual to see Jackie with serious face, though. I enjoyed this movie a lot.P.S.low critics rating is expected for me. Never trust it."
    },
    {
      "rating": "8",
      "text": "Quan is a humble London businessman whose long-buried past erupts in a revenge-fueled vendetta when the only person left for him to love -- his teenage daughter -- dies in a senseless act of politically motivated terrorism. His relentless search to find the terrorists leads to a cat-and-mouse conflict with a British government official whose own past may hold the clues to the identities of the elusive killers. The Foreigner adheres strictly to action thriller formula, but benefits from committed -- and out of character -- performances from its talented veteran stars. I'll give The Foreigner a B+."
    },
    {
      "rating": "7",
      "text": "I strongly believe it was the best Jackie Chan's performance he has ever done! In this film, Chan proved that he is an actor too except from a fighter or stunt. He is old and that is what he seemed to be in the movie. He is not fighting \"perfectly\" anymore and that seems to be more realistic.Pierce Brosnan was also very good in his role. But female white characters of the movie were freaking annoying, they slept with men that didn't like only to get imformation.. what a shame! we have a special word for them in my homeland. Nevermind, the movie was a bit violent but it had a lot of action and the acting of the main actors was spectacular."
    },
    {
      "rating": "8",
      "text": "Most Jackie Chan's movies are action comedy but this one is the complete opposite, action thriller and drama. I am not complaining though in fact I like it."
    },
    {
      "rating": "7",
      "text": "The critics really dogged this movie out, however, after giving it a watch the movie wasn't that bad.  In fact, it was decent, the story and the acting were really good, and the only down point was the pacing and mood.  This movie is an action thriller at heart that uses more of a slow-burn stylistic approach that sometimes works against what makes that genre work.  Other than that one issue it was definitely worth watching."
    },
    {
      "rating": "7",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    },
    {
      "rating": "10",
      "text": "never watched Jackie Chan films that much but i think its his first serious film"
    }
  ]
}