{
  "id": 134,
  "title": "The Ice Road",
  "starring": [
    "Liam Neeson",
    "Marcus Thomas"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "After a remote diamond mine collapses in far northern Canada, an ice road driver must lead an impossible rescue mission over a frozen ocean to save the trapped miners.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pj6UQPrtmC0snzPeU1HUhGWTgz6.jpg",
  "categories": {
    "plot": 4.571428571428571,
    "acting": 3.2857142857142856,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.8,
    "funny": 5.0,
    "action": 6.578947368421052
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Liam Neeson and the Movies. Now he's trying quieter films, and they're still no better. Because that's another boring movie in his career.Maybe he should let it be."
    },
    {
      "rating": "8",
      "text": "The question is, does the viewer want an exciting Liam Neeson action thriller or not? The other question is, have we ever seen such a movie set on the ice roads near the Arctic Circle? Neeson does deliver a particular set of skills, in this case dangerous big-rig driving, and has to fight for his life along the way, together with his Iraq-vet brother and a drop-dead gorgeous Cherokee girl. Only the coda is predictable, but the action isn't, and it goes beyond mere hand-to-hand combat."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "7",
      "text": "If you love Liam Neeson movies, you'll love this too! Don't fall prey to the bad reviews! It's an entertaining  nail biter with lots of action and adventure, twists and turns you don't see coming and a nice change to see cold and ice after this super hot 100 degree weather!  Definitely recommend!. :-)"
    },
    {
      "rating": "5",
      "text": "Liam Neeson is back on the action road…literally. This time, he’s one of several drivers who are tasked with transporting equipment to save trapped miners in Upper Canada. The route is literally ice and the perils are numerous. Even though the rivers are relatively straight, the road continually curves with calamities and challenges that only a superhuman hero can solve. Most of them involve manipulating the trucks in various ways (a clear promo for the Kenworth brand). The project has a cheesy made-for-TV feel with underdeveloped characters, sad attempts at emotional connection and increasingly implausible logic. Even though some of the feats are unfeasible, the execution is rarely impressive, plus the insistent score continually attempts to ramp up the tension. Overall, this is a middling action adventure."
    },
    {
      "rating": "3",
      "text": "Was it good? No.But was it at least entertaining? Also no. The VFX are rough even by straight to streaming standards…"
    },
    {
      "rating": "3",
      "text": "So, when is Liam Neeson retiring from action movies? He said he would a while ago.The movie itself, very predictable and stupid, not the best kind of stupid for these types of movies. The visual effects looked so awful and unconvincing I questioned if I was watching a Sci Fi channel movie. The directing wasn’t anything notable and the writing was so horrendous, ridiculous situations and none of it was believable. I had a hard time finishing this one.I can't believe that both Liam Neeson and Laurence Fishburne agreed to be in this.'The Ice Road' is cold and boring."
    },
    {
      "rating": "6",
      "text": "I liked it. Maybe the plot itself was kinda stretch as did not make sence fully, but I did find it a good and exciting action movie. Of course Neeson lately is in many, but I still found it enjoyable"
    },
    {
      "rating": "5",
      "text": "This wasn’t a great movie , this wasn’t a bad movie. Ice Road was a ok movie. The plot and story was simple and the action was well…. You can only do so much on ice. The only question is why Morpheus , oh I mean Laurence Fishbourne    agree to be in a movie for five minutes."
    },
    {
      "rating": "3",
      "text": "It felt like the film took the easy way out for what little character development it had. Liam has largely been the same nice guy in a few films so they just kind of leaned on that for this film. Early in the film, within about 90 seconds, we meet the brother, find out he's mentally challenged, he gets picked on, Liam's character saves him...again. There's a Mice & Men moment when we're shown the brother's pet mouse, er..., I mean rat, and he luckily doesn't squeeze him to death. It all happened so fast it felt odd and I suspect it's only because of Liam's past that you could set up the main characters so quickly. Next, there's Mr. Goldenrod. A name choice that baffled me because I used to work for a large studio and know about script paper colors. It was just weird to me.Then there's a throwback to a scene right out of Forrest Gump when he fixes the 'ain't got no gas' lawnmower and later reassembles his weapon faster than anyone else. In Ice Road, it is a different kind of motor the brother fixes. That's enough. It wasn't a very good film and as other armchair critics have said, it seems strange both Liam N. and Samuel L. Jackson said yes to this. (Lawrence Fishburn. Just seeing if you're paying attention this far down)."
    },
    {
      "rating": "1",
      "text": "I usually like Liam Neesons movies, but this had to be one of his worst.  First of all its woke, second of all the effects are horrible, and third Lawrence Fishburne is barely in it.  Just bad all around, acting to plot, effects, what a waste on big budget talent..."
    },
    {
      "rating": "4",
      "text": "Over the years, Liam Nesson has shown that when it comes to the action genre, he won't turn down a script.Or at least that's what I want to believe since it's quite clear that producers continues to offer him films that hardly differ from each other, and he continues to star in them.He's a solid element because he knows how to sell them, but as a viewer I no longer get anything remotely noteworthy from these kinds of productions.If you want a basic but bland entertainment alternative for this weekend, this may be one of your options."
    },
    {
      "rating": "6",
      "text": "THE ICE ROAD never tries to be more than what it is, a by the numbers disaster/race-against-time thriller, and the flick succeeds because of this. Liam Neeson is there with his unstoppable screen power and he helps gloss over the movie's rough edges. Can never go wrong with Liam Neeson."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)For a long time Neeson was a versatile actor, then he too got caught up in roles exclusively of invincible action hero \"paved with predictability\", here imprisoned in \"a script that wants him epigone of the inevitable Dom Toretto, ... between Native Americans and former veterans suffering from post-hydraulic stress\" (Alessio Baronci), and where also Fishburne literally drowns."
    },
    {
      "rating": "2",
      "text": "Poor acting, poor plot, auwful graphics, predictable. You don't need a spoiler alert, it sucks!"
    },
    {
      "rating": "7",
      "text": "A surprisingly exciting film with a broad build-up to the end of the story. Unfortunately you cannot escape the well-known man to man fight scenes that seem to never end, but this did not detract from the whole. Other than Liam and his brother, the characters weren't memorable and it remains an action movie like so many."
    },
    {
      "rating": "1",
      "text": "Это пожалуй худший фильм с Лиамом и Лоуренсом. Я на протяжении всего фильма ловил фейспалмы, логики в действиях героев нет, в репликах нет. Весь фильм бессмыслица. Голивуд, делай пожалуйста хорошее кино, тяже умеешь…"
    },
    {
      "rating": "10",
      "text": "Great action - best Netflix film I’ve seen this year!  Throwback to the action films of the 90s, just a lot of fun!"
    },
    {
      "rating": "6",
      "text": "Better than I expected. Was it great? No, but I was entertained definitely entertained!"
    },
    {
      "rating": "0",
      "text": "**** movie. makes no sense, poor writing with circumstances that seem forced and unnatural."
    },
    {
      "rating": "1",
      "text": "You don't normally expect Liam Neeson making bad films. The script is poor, acting from supporting casts pretty wooden. The ending punch so half hearted it was not even worth filming. I was hoping it will spring into life and kept watching.... BUT sadly not to be. I had expectations but its I have spent I can't have back."
    },
    {
      "rating": "7",
      "text": "The Ice Road is good if you don’t expect a typical Liam Neeson performance. It won’t be anyone’s favorite action film, but I wouldn’t throw it in the trash pile."
    }
  ]
}