{"id": 2134, "title": "The Double", "starring": ["Richard Gere", "Topher Grace"], "runtime": 98, "genre": ["Action", "Drama", "Crime"], "description": "The mysterious murder of a US senator bearing the distinctive trademark of the legendary Soviet assassin 'Cassius', forces retired CIA operative, Paul Shepherson to team with rookie FBI agent, Ben Geary  to solve the crime. Having spent his career chasing Cassius, Shepherdson is convinced his nemesis is long dead, but is pushed to take on the case by his former supervisor, Tom Highland. Geary, who wrote his Master's thesis on Shepherdson's pursuit of the Soviet killer, is certain that Cassius has resurfaced.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/t4W10sjJSDAWRUDn2Kb8DQKxiZv.jpg", "categories": {"plot": 4.0, "acting": 4.5, "ending": 4.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.5, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "8", "text": "I may have seen some things coming in the story, but it was nonetheless interesting to watch things play out.\r Watch this movie here for free http://www.watchfree.to/watch-29ae09-The-Double-movie-online-free-putlocker.html"}, {"rating": "6", "text": "First off, all the performances were very good; I only wish the same could be said for the script. The plot wanders about; giving away very key information far too early (IMO) and taking all the mystery out of it for me. Yes, there is a twist at the end, but by that time I’m just pissed off with it. It’s well shot with most of the action taking place in and around Washington DC. It was nice to see Martin Sheen as CIA director Tom Highland; it was kinda odd seeing him in Washington & not being the President. Over all, a film that failed to live up to expectations; I know which direction I would have taken it in and that would have been a much better story.\r SteelMonster’s verdict: NOT RECOMMENDED\r My score: 5.7/10"}, {"rating": "5", "text": "The Double has some fun cat & mouse spy action. Beyond that, there's not too much to say. The movie suffers from being a bit generic but it's a decent night's entertainment."}, {"rating": "3", "text": "Talk about jumping the shark! \"The Double\" gives away a plot twist in the first twenty minutes of the movie! What a rookie mistake. Although that sort of move might actually pay off for its creativity in better movies, \"The Double\" doesn't pay off at all. Richard Gere and Martin Sheen give good performances, but Topher Grace tries way to hard. He tries to give his character more depth and gravitas but he fails miserably. \"The Double\" can try to be all it wants but the truth is that it's a hollow spy thriller with good intentions but bad execution."}, {"rating": "6", "text": "To be honest, this movie is not exactly a movie that I can watch over and over again. However, it is fairly enjoyable in my opinion. Also the weapon Cassius uses...I want that :)"}], "recommendations": ["man_on_a_ledge", "contraband", "the_commuter", "21_bridges", "escape_plan", "seeking_justice", "den_of_thieves", "mission_impossible_iii", "the_next_three_days", "jack_reacher", "unlocked", "the_bank_job", "reasonable_doubt", "nobody", "a_walk_among_the_tombstones", "taken_2", "hancock", "taken_3", "the_mechanic", "orphan_first_kill", "safe_house", "the_taking_of_pelham_1_2_3", "the_loft", "16_blocks", "the_call"]}