{"id": 4503, "title": "The Island", "starring": ["Ewan McGregor", "Scarlett Johansson"], "runtime": 136, "genre": ["Action", "Thriller", "Science Fiction", "Adventure"], "description": "In 2019, Lincoln Six-Echo is a resident of a seemingly \"Utopian\" but contained facility. Like all of the inhabitants of this carefully-controlled environment, Lincoln hopes to be chosen to go to The Island — reportedly the last uncontaminated location on the planet. But Lincoln soon discovers that everything about his existence is a lie.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/n4HyHxnKCJG8SbqeLEK1nU5JbIR.jpg", "categories": {"plot": 9.88888888888889, "acting": 9.909090909090908, "ending": 10.0, "soundtrack": 10.0, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 10.0, "action": 9.933333333333334}, "reviews": [{"rating": "9", "text": "One of the best science fiction movies I've seen in my life. Good performances and a spectacular argument."}, {"rating": "10", "text": "Obra-Prima de Michael Bay o gênio mais subestimado da história do cinema!!!! pelos críticos e pelo público imbecil!!!! Vale mencionar que são os americanos imbecis!!!!!!. Agora deixar eu respirar um pouco,The Island é um dos melhores filmes de ficção científica de ação de todos os tempos!!!,Com atuações impecáveis de Scarlett Johansson,Ewan McGregor,Sean Bean,Steve Buscemi,Michael Clarke Duncan e Djimon Hounsou com cenas de ação impressionantes,além disso no final se mostra um filme bem emocionante."}, {"rating": "10", "text": "I believe this is the first 10 i've given a movie. i liked it enough to purchase a DVD copy of it. Bay is known for his action and he certainly delivers here. This is a very unique plot line that has not been explored before. Scarlett Johansson is the most beautiful i've ever seen her in a film, Sean Bean is as intense and excellent as ever. Keeps you on the edge of your seat throughout, definitely in my top 10 of all time."}, {"rating": "10", "text": "Awesome...Camera, plot, acters...everything is working together. Final product is perfect."}, {"rating": "10", "text": "I really enjoyed this film. Ewan McGregor and Scarlett Johannson were both great, as was Steve Buscemi. Truly a new favorite. It has a bit of sci fi, romance, and humor built into it. A must see!"}, {"rating": "10", "text": "The Island is a science fiction masterpiece. The acting by Ewan and Scarlett is outstanding. The action sequences are dazzling and the cinematography is impressive. The plot is also convoluted and mysterious if you go into the movie knowing nothing anything about the storyline."}, {"rating": "10", "text": "Astonishing ! --------------------------------------------------------------"}, {"rating": "10", "text": "The opening landscapes were filmed off New Zealand while the boat scenes were shot near Italy."}, {"rating": "9", "text": "The story is hard and very interesting, imagine contamination = Corona. Also the world of the island is  well done, not only the city, but also the institute. Only the 2nd part is not so thrilling like the beginning. Anyway this is the best Michael Bay movie in my view."}, {"rating": "10", "text": "Incredible movie. It's one of those rare, rare movies which actually grabs your attention and keeps you as engaged with the plot as you would be if you were in the shoes of the character throughout the entire length of the movie. It isn't a masterpiece, and it's not going to transport you to different dimensions or produce some life-altering experiences, but it's a very engaging movie, and if you, like me, feel like you have already exhausted the list of all good sci-fi movies, this is going to feel like a breath of fresh air."}, {"rating": "10", "text": "A classic, one of the best action movies of 2005. The Island has epic action, acting and a brilliant storyline. Mesh all these elements together and you have an amazing film."}, {"rating": "10", "text": "A 45-minute preview of the film was shown to the press at the Cannes Film Festival."}, {"rating": "10", "text": "________________________________________________________________________________________________________________"}, {"rating": "10", "text": "The buttons used to open doors in the living quarters are actually Griffin PowerMate USB Volume Controls, used normally for Mac computers to adjust volume."}, {"rating": "10", "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!,.!,.!,.!.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,."}, {"rating": "9", "text": "A strong Action/Sci-Fi with two solid leads and an interesting concept that will hold your attention."}, {"rating": "10", "text": "In one scene in the movie, a Bugatti Veyron is seen driving down a street in the background. Currently the Bugatti is sold for 1.25 million dollars, and only about fifty are made yearly."}, {"rating": "10", "text": "At around one hour and thirteen minutes. The black and white commercial featuring Sarah Jordan wasn't shot specifically for the movie; it is an actual commercial starring Scarlett Johansson."}, {"rating": "10", "text": "Michael Bay drove behind a flatbed truck carrying train wheels on the highway leaving Palmdale, and, noticing how dangerous it looked, was inspired to create a destructive chase scene involving one."}, {"rating": "10", "text": "One of the camera cars is nicknamed the \"Bay buster\" for obvious reasons, The car can \"crash into vehicles at 60 to 70 miles per hour without getting cameramen killed or hurt"}, {"rating": "10", "text": "`~|{}[]▪○●□■♤♡◇♧☆⊙°•¤《》¡¿`~|{}[]▪○●□■♤♡◇♧☆⊙°•¤《¡》¿-\":;!?,.)*(&^%$#@+×÷=/_●"}, {"rating": "10", "text": "Michael Bay expressed disappointment with the climatic fight between Lincoln and Merrick, saying that he had originally planned a much more elaborate set piece, but their budget was running low, and the action had to be improvised on sets that weren't easy to stage stunts on."}, {"rating": "10", "text": "&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&÷&,,,,,,,......\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";\";()()()()()"}, {"rating": "10", "text": "One Of The Best Action Sci-FI Movies Of All TimeThis just goes to show you that the critics wouldn't know a good movie if it bit them. I understand that this movie didn't do well at the box office, and I believe it when they say that it is because of a really bad marketing campaign, because this movie is totally riveting. This is what good entertainment is all about. Everything about this flick is first rate, from the cast (LOVE Scarlett Johansson) to the writing to the incredible cinematography and absolute killer special effects to...you name it. How a movie THIS good went unnoticed is truly beyond me. DO yourself a favor, sit back with a big tub of popcorn and get ready to bliss out."}, {"rating": "10", "text": "♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "10", "text": "¤¡¤¡¤¡¤¡¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "10", "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:÷:_____________________________♡◇♡◇♡◇♡◇♡◇♡"}, {"rating": "10", "text": "Best futuristic movie ever made.Definitely one of the best movies I've ever seen, perhaps the best!! The story is great, it starts with a very weird setting where you understand absolutely nothing of where it takes place and what's going on and then everything comes clear and the adventure begins. All the mechanisms invented in this movie are outstanding, exactly as it could be if this future would ever come true and it under lights a very dark aspect of human nature, in this sense it's very realistic. The action is great, absolutely the best I've ever seen, the picture, video and audio are perfect, it's I think the best production ever made, perfect in everything!! The performances of the actors are high class indeed, I don't know how Ewan Mcgregor being from Scotland can imitate so well the American accent, Scarlett Johansson very good looking and definitely up to the role she's been assigned, Sean Bean always great as the bad guy and Djimon Hounsou came quite well as the cool guy(definitely his part!!). Not a film to miss, if you never saw it I highly advise you to watch it, even if you wouldn't like it that much it has a moral that in my opinion has to be transmitted to everyone. Of course it is very exaggerated and a series of events like these would never happen in real life, but like I always say, if you don't see things like these in movies, where else would you!!??"}, {"rating": "10", "text": "Amazing Movie, It has action, love, humor, and conspiracy all mixed into one. Definitely a good one."}, {"rating": "10", "text": "Michael Bay met Djimon Hounsou years prior when Bay was a music video director with Propaganda Films and Hounsou was a model with Omar's Modeling Agency which was located across the street. The model wanted to be an actor so Bay told him to work on his accent."}, {"rating": "10", "text": "Michael Bay recalled the scene where Lincoln Six Echo and Tom Lincoln fight, as long and tedious to shoot, since it took half an hour to change Ewan McGregor's clothes between each shot so he could play both characters.The black yacht in the dreams of Lincoln Six Echo, shown later in the film (the Renovatio) is the Wallypower 118 super yacht. The boat is built almost entirely out of carbon fiber, Kevlar, and glass with a teak-deck. The boat features three Vericor TF50 gas turbines, providing a total power output is 16,800 horsepower (12,500 kW)."}, {"rating": "10", "text": "Character ErrorAbout 1:22:45, during part of a long vehicular (and helicopter) chase scene, one of Laurant's team helicopter pilots says \"gotta bail out; police choppers inbound.\" In fact, not one single police helicopter shows up at all, from that point on."}, {"rating": "10", "text": "ffsrghhgfggg............,,,,,,,,,..@#+×÷=€£_)(()&*^%$#'\":;;!!?,,▪○●□■☆⊙°•¤《》¡¿♤♡◇♧●■●■▪•{}"}, {"rating": "10", "text": "▪○●□■☆⊙°•¤▪○●□■☆⊙°°¤☆⊙°•¤▪○●□■☆⊙°•¤▪○●□■☆⊙°•¤☆⊙°•¤☆⊙°•¤☆⊙°•¤☆⊙°•¤☆⊙°•¤..................."}, {"rating": "10", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:::::::::::::::::::::::::::\";\";\";\";\";\";\";\";\";\";\";\";\";;\";"}, {"rating": "10", "text": "++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "10", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡"}, {"rating": "10", "text": "□□□□□□□□□□□□□□□□□□□□■■■■■■■■■■■■■■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡"}, {"rating": "10", "text": "Awesome movie...nuff said."}, {"rating": "10", "text": "It was a great movie, with a creative Idea about cloning , beside my special love to scarlet!!!"}, {"rating": "10", "text": "A highly enjoyable Sci-Fi-Action Flick !!!!I really enjoyed this movie. I saw it in a sold-out theater full of movie goers and heard all positive remarks from everyone afterward. People applauded at the end and there were plenty of gasps, laughs, and just all around positive reactions throughout the movie. I think the audience reaction during and after a movie speaks volumes. It also received equal enthusiasm from both the men and women in the audience. I thought the story was very interesting and I liked that it focused so much on the feelings of the characters. But it also was a great action movie with amazing special effects, suspense, humor, a little bit of romance, bad guys and good guys, and yet still a general theme that gives us all something to think about. (The issue of cloning). I enjoyed all of the acting by a very diverse cast. Ewan McGregor shines once again, this time doubly so in his dual roles as a clone and his original. I felt this movie got you involved with the main characters on a personal level and keeps you pulling for them all the way. One or two of the action scenes may be a bit incredible, but I think that if you go in to a movie like this wanting strictly reality, you're missing the point of just sitting back and losing yourself in a bit of emotional fun for a while. I give it my highest rating for a fun movie!"}, {"rating": "10", "text": "Very intense action/romance/mystery/thriller/conspiracy flick from Michael Bay. Michael Bay's best movies are The Rock, Bad Boys, Armageddon and The Island, out of the cluster of his cinematic repertoire.I was really surprised at how much I laughed during this film. Make no mistake, there are some very intense and troubling parts of this film, but there is also a lot of good-natured humor in it. Ewan McGregor plays the perfect \"innocent\", too, which is where much of the comedy comes from.If you like to see things go *boom*, this film will give you the most \"bang for your buck\" that I've ever seen. I was afraid it would be too similar to Logan's Run or the Matrix to be interesting, but it was really a very well written, directed and acted sci-fi action movie. You'll love it !!!!"}, {"rating": "9", "text": "Ostrov je fenomenální akční thriller. Myšlenky, akce, herectví a zvraty jsou odborně navrženy režisérem Michaelem Bayem. Michael do tohoto filmu vložil své plné srdce, stejně jako herecké obsazení bylo oslnivé. Jeden z 10 nejlepších filmů roku 2005, který nebyl uveden na trh a měl být úspěšnější na domácím trhu, devět z deseti."}, {"rating": "10", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷*÷"}, {"rating": "10", "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%+÷+@#$%@%$#@*+÷*+÷÷+*÷+%$#@%$#@%$#@%$#@%$#@%$#%$#@%$#@%$#@%$#@*÷"}, {"rating": "10", "text": "Ahead of its time, THE 2020 movie.  The best movie about 2020 with the most bland un-helpful title ever.If you dislike Michael Bay films, this is before he went wild and destruction-crazy with too much money to spend.  This is the more restrained, more story-driven Michael Bay. If you, like me in 2020, believe a normal year of flu was blown up into a pandemic scare and flawed then criminally prolonged shutdown of the economy.  This has every feature you would want in a fable where the sheeple wake up and do become pro-active about taking power back into their own lives.  The waking-up sheeple are aided and supported by a Black Lives Matter villain who becomes their supporter.  I saw it in 2005, loved it.  Watched it again in Oct 2020.  Ten times more more timely and relevant now than in 2005.  Top drawer acting, directing and special effects.  Alex Kurtzman, the current head of Star Trek on CBS, was one of the writers.  This is another of his excellent earlier efforts. You will see many well-known actors at their peak or early roles here, a welcome sight.  This has one of the most fun, car destruction derby  scenes ever made.  Yes, this is the one where the roll heavy rail train wheels off the back of a truck into on-coming bad-guy traffic.  Classic and rarely if ever excelled. Q:  Why did it only make its production cost back in 2005?A:  I think its was too far ahead of its time.  It's also a long movie with a slow build-up to much third act action.  I think what was learned from scripts like this was to start off with some action even if you have to go back and slow down to build up to the climax."}, {"rating": "10", "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@@;@;@;@;@;@;@;@;@:@:@:@:@:@:@:@:@:@:@:@:@@:"}, {"rating": "10", "text": "●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■■■■\",\",\",\",\",\",\",\",\",\",\",\".\".+,+,@,+,÷,#,#,#,=,,$,$,=,....."}, {"rating": "10", "text": ",,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,%%%%%%%%%%%%%%%%%%%%%"}], "recommendations": ["edge_of_tomorrow", "top_gun_maverick", "mad_max_fury_road", "top_gun", "unstoppable", "brick_mansions", "transformers_dark_of_the_moon", "skyscraper", "the_terminator", "transformers", "angel_has_fallen", "poseidon", "san_andreas", "gemini_man", "avengers_age_of_ultron", "the_magnificent_seven", "blackhat", "armageddon", "the_bourne_ultimatum", "the_guardian", "bloodshot", "jaws", "thor_ragnarok", "into_the_storm", "infinite"]}