{
  "id": 1256,
  "title": "The Hills Have Eyes",
  "starring": [
    "Aaron Stanford",
    "Kathleen Quinlan"
  ],
  "runtime": 107,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Based on Wes Craven's 1977 suspenseful cult classic, The Hills Have Eyes is the story of a family road trip that goes terrifyingly awry when the travelers become stranded in a government atomic zone. Miles from nowhere, the Carter family soon realizes the seemingly uninhabited wasteland is actually the breeding ground of a blood-thirsty mutant family...and they are the prey.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qj4C2c96T1n3YnYxFG5l5bSTKbM.jpg",
  "categories": {
    "plot": 6.3,
    "acting": 6.583333333333333,
    "ending": 8.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 1.5,
    "action": 3.8333333333333335
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I wish I could give this a higher vote than 10. My favorite movie ever. Rape scene not needed? What the hell? The Carter family didn't need to be attacked by the mutants, but they were. That's what Lizard wanted to do, and though emotional, it was awesomely done. You really feel like you know the characters before they kill them. It wasn't TRYING to do anything, I don't think. It wasn't shying away from the horror of what it would really be like to be attacked unawares by such vicious creatures. This was the most intelligently, well done movie I know of, and I loved it with a passion! Aja, I wish you would direct THe Hills Have Eyes 3 and continue the plot with Bobby, Doug, Brenda, Katheryne, and Beast."
    },
    {
      "rating": "8",
      "text": "Good acting by a solid cast, It kept you interested in it from start to finish, and it was good. A lot better then the original film. I really enjoyed this."
    },
    {
      "rating": "8",
      "text": "Does a good job at making you feel sorry for the victims and glad that the bad guys gets it in the end. Overall a pretty thrilling piece of work but it's for people with a very strong stomach."
    },
    {
      "rating": "8",
      "text": "This film is, at times, absolutely brutal and entirely un-enjoyable. But at other times it is dripping with an atmosphere of pure dread, fear, and creepiness that will make you shiver. The suspense and intensity of the scares is as high as possible; prepare yourself for repulsion and a cranked up heartbeat. I've never really gasped to a movie; I'm a guy, and a hardcore horror fan, but I couldn't help it at times.\r Despite the buckets of disgust and horror, though, the great cinematography, combined with that, make this a horror film to be remembered. Brutal, gross, creepy, and intense, it's almost not a movie, but an experience. True Horrror."
    },
    {
      "rating": "7",
      "text": "Another insanely fun and gory film from Alex Aja. It started out kinda slow in the first half with really only one big attack scene in the travel trailer. The second half was much more thrilling, and I love how the Doug fought back against the mutants. Two minor problems though: I wish there would have been a bit more explaining for Ruby, and I would have liked to known a bit more about the mutant that used the walkie-talkie to coordinate attacks."
    },
    {
      "rating": "4",
      "text": "Tedious, predictable and not an ounce of originality. Maybe obvious comments for a remake, but the fact that it was helmed by Alexandre (High Tension) Aja raised my expectations considerably. What a shame he quite obviously caved into film-company expectations and just chucked out a standard mall horror. If I see another film that has a 'reveal all' from a wall covered in newspaper clippings, I will throw myself under a train, I swear. Occasionally bloody, but the completely one-dimensional characterisation and extremely dodgy political message are what really shock."
    },
    {
      "rating": "7",
      "text": "I actually really liked this movie. Had quite a few good kills, Kept you interested through out, and overall it was simply a good horror movie. I would recommend it."
    },
    {
      "rating": "7",
      "text": "Horror Director, Alexandre Aja, directs a fairly decent horror film, which is rare for films that genre today. I remember seeing this film when I was 13  and really liking it a lot, so watching it again and seeing how I felt was fun. Aja directing is really fast paced that keeps you wanting to watch the entire film. This is great for the audiences that watch films for entertainment. Aja likes to use gore a lot in his films, so you know going into The Hills Have Eyes that there will be a lot of gore. The violence in this film is realistic and enjoyable if you"
    },
    {
      "rating": "6",
      "text": "Equally amusing and scary \"The Hills have eyes\" creates enough suspense and horror to give of the feeling of being in a really bad situation. And I mean REALLY bad. I liked the film, and thought it deserved a decent rating."
    },
    {
      "rating": "6",
      "text": "In addition to making a vast improvement on the pathetic original, it's also clear that the filmmakers carefully studied The Big Book Of Horror Movie Clichés, and followed it to the letter. Nonetheless, the thick tension, the fabulous prosthetics and the gleeful gore galore make it a pretty entertaining ride, and an above average horror flick."
    },
    {
      "rating": "6",
      "text": "The movie was good. It wasn't the same as Wes Craven's film. But Aja really did a good job. The acting was decent which is why I rated this a 6. There was some parts I personally thought was fake especially Brenda's rape scene and one crying scene. As for Bobby, he really was great. I believed that all his parts were well acted. and believable. Especially at the scene seeing his father getting burned alive. **** kill those **** Nice!! The make-up was outstanding especially for Lizard and Ruby. But the only thing that was disappointing to me was that in the 1977 version, Ruby was a normal human being. Then the re-make showed her as all deformed which I thought was stupid. Other than that, Lizard was badass!! But damn, that make-up was just done well. I mean, it was done very well!!"
    },
    {
      "rating": "4",
      "text": "Although I saw the original 'The Hills Have Eyes\", I don't really remember all that much about it. I wish I could say the same about this slow moving, extremely violent and bloody remake which just isn't that great."
    },
    {
      "rating": "6",
      "text": "Wow this was a gore fest, in a good way of course.\rIt doesn't shy away from showing you some disturbing violence, and makes you face the horrors that are the murders and the murderers themselves.\rThe bad decisions made by some characters made it painful to watch at some parts but besides that, this is by far one of the best slasher movies I've ever seen.\rWatch it if you like a whole lot of blood, and don't shy away from some top notch brutality."
    },
    {
      "rating": "10",
      "text": "Good remake! This movie makes scary my family, the suspense and gore is very cool"
    },
    {
      "rating": "10",
      "text": "Why didn't the critics like it? Film so well done and I still think it's better than the originals of the 70's"
    },
    {
      "rating": "6",
      "text": "If you compare this to the original Hills Have Eyes there are some differences but I have to say I enjoyed it. It really wasn't a Horror movie but it was pretty good. Usually remakes sucks pretty bad but this wasn't a BAD remake."
    },
    {
      "rating": "8",
      "text": "Wes Craven's 1977 original is a cult classic for good reason. It may have just been a toned-down, southern-fried version of his directorial debut The Last House on the Left, but it was a nasty, brutal film for the time with a creative setting and villains. This remake tops it in every way though, which is remarkable given how few changes were made to the script. The events are largely the exact same ones as before. Only portrayed in a harsher, more sickening manner with better acting and pacing. There's a more action-packed third act, it really hammers home a nuclear testing angle to instill the violence with a political message, and a much improved ending. That's really all that's different. Which, as someone who appreciates the original, but felt it was missing a little extra oomph, wasn't a problem for me personally.This is how you do a remake. It takes a flawed, yet respected movie and irons out a lot of its faults (sans things like the slow beginning and dumb characters), while imbuing the horror with an increased level of savagery and a lesser sense of silliness that it arguably always should have had. This isn't for the squeamish as it's definitely a product of the post-Saw, \"torture porn\" era of the mid-to-late 2000s where gore and depravity were matching the heights seen during the exploitation cinema craze of the '70s and '80s. If you have the stomach for it however, this is one of the best redneck cannibal nightmares you can find this side of House of 1000 Corpses.8.7/10"
    },
    {
      "rating": "6",
      "text": "'The Hills Have Eyes' begins with a fresh, strong and horrifying start, but as the film hits the last third it feels like everything you've seen before and with a bit of cheesiness in there. As mentioned the start is strong acting and truly horrifying for a horror film, but blood and needless gore replace where there could have been more dramatic humanity and thrills. Worth a watch for its start, but a bit disappointing towards the end."
    },
    {
      "rating": "6",
      "text": "It's nothing groundbreaking, never think of leaving your comfort zone, everything is shown here you've probably seen in another place, but who cares? It's fun."
    },
    {
      "rating": "8",
      "text": "The first half of the movie without being boring is smooth but the second half where everybody dies and where the girl gets her breast milk sucked up is just pure genius.Alexandre Aja achieved here a great movie."
    },
    {
      "rating": "7",
      "text": "I was a pretty big fan of Wes Craven's The Hills Have Eyes and this is a remake that actually gives the original a run for its money. The first thing that this movie got right was getting Craven involved again which also happened with the remake of Last House on the Left. I'd say that the acting is above average. This film does have a few good jump scares but for the most part it relies on he terror of the scenario that the characters are placed in, the second act was really intense and it was probably the best part of the film. There are points where it gets a little gruesome but I just couldn't take my eyes off. The ending doesn't hold up after the intensity starts to tamper off but if you are a hard core horror junkie then you will likely enjoy this movie."
    },
    {
      "rating": "4",
      "text": "As a real easy-to-scare person I would recommend watching this in the night. I have watched it in daylight and it didn't really affect me and I'm from the people, that scream and holds a friend's hand in anticipation of a jump scare. But this time - nothing. There were brutality, a lot of blood and killing. It felt somehow more like comedy, than horror or thriller. Nothing special or something I would recommend. I guess after this movie I won't take advice from weird strangers."
    },
    {
      "rating": "2",
      "text": "There's one thing a horror movie should never be -- boring. Even in this new age of meaty, blood-soaked torture-porn, horror films are able to maintain audiences' interests by either being legitimately interesting, or being brainless fun (pun very much intended). The Hills Have Eyes, however, is as dull and pointless as the protagonist's baseball bat. Scenes drag on for far too long, and the cast are completely incapable of making you care for their characters' safety. Yet, unlike better horror movies, the most annoying characters aren't even given the satisfaction of a gory death. Avoid this like a lumbering mutant redneck."
    },
    {
      "rating": "0",
      "text": "Let me put it this way...they should take a grand tally of all who enjoyed this movie, tell them they won a trip to an isolated tropical island deep in the south pacific, fly them all there and then us normal people can test nuclear weapons on. How do you sit at the round table doing a read through or brain storm and say, \"yeah so in this scene where Mutant A is holding a gun to the babies head while he sucks milk out of the mothers boob all while his other mutant buddy rapes the same mothers 14 year old daughter should be **** awesome and then we'll burn the father/husband alive\" and think that that's ok? A: How do you even think of that to write it, and B: how do you ever think that will make a good movie? I followed God and walked out of this movie, and the whole world should follow. The fact they had the audacity or delusion to make a sequel is beyond baffling."
    },
    {
      "rating": "0",
      "text": "Crap that is. Do not watch this unless You have the mental capability of a child. Serious, mature people can not take this movie seriously. Gross, slasher with no brains."
    },
    {
      "rating": "5",
      "text": "The Hills Have Eyes is lacking only in delivery. It needs a twist, a catch, something to captivate the audience and leave them satisfied at the end. Instead, it just ends."
    },
    {
      "rating": "2",
      "text": "I thought the movie was pretty decent, until the last minute where the director decides to screw you over and laugh in your face. Was going to watch the second, and then was told it was not relevant to the first one. Disappointed"
    },
    {
      "rating": "4",
      "text": "A movie with very few scary and a lot disgusting scenes! There were so many unnecessary scenes! Like the one where a zombie steals mom's body and eats it! That's not scary, that's disgusting! The rape scene as well! I think if we ignore some of the negatives, this is actually a good horror movie but with very few scary scenes!"
    },
    {
      "rating": "5",
      "text": "I've got mix feelings on this one, but I'll give Alexandre Aja credit for delivering a remake that offers something different, which is making it as nasty as possible. I really did feel sorry for this family. Not for the faint of heart that's for sure.Side note: This is totally random, but I wish Nicolas Cage starred as the main lead, because imagine the bathroom scene from 'Mandy' was in this right after the mutant attack on the family - the intensity would be too much."
    },
    {
      "rating": "0",
      "text": "This is an atrocious piece of filmmaking. Rape and extreme violence for the sake of cheap thrills with no deeper message at the core. Do not watch this garbage, you'll never get back the time you spend on it."
    },
    {
      "rating": "5",
      "text": "Extremely violent film that updates the intensity and gore from the original and actually works...on being intense and gory, but that's pretty much it. Gore thirsty fans will be pleased."
    },
    {
      "rating": "5",
      "text": "The Hills Have Eyes is lacking only in delivery. It needs a twist, a catch, something to captivate the audience and leave them satisfied at the end. Instead, it just ends."
    },
    {
      "rating": "8",
      "text": "This film is brutal. The violence and the rape scene are far from enjoyable. My girlfiriend and me (she chose to see this, by the way, i thought it looked bad) walked out feeling absolutely appauled, which is exactly what we were supposed to feel. I can't honestly say I like this film but dear God is it good. More remakes like this please Mr Hollywood."
    },
    {
      "rating": "6",
      "text": "This movie was very interesting. I enjoyed the suspense and the freaks."
    },
    {
      "rating": "1",
      "text": "This was by far the worst movie i have ever seen in my life. It was very disturbing. I would not suggest to anyone to EVER see this movie. It should have not even been put in theaters."
    },
    {
      "rating": "7",
      "text": "I went in not expecting much and came out a lot more satisfied than one would imagine. One thing Aja gets right is the desert atmosphere, the scenery makes the film all the bit better. I myself have interest in nuclear testing and such so I might have came to like more than the next person. But everyone should apreciate things such as the test village in which the mutants live, a picturesque 50s suburbian environment in a desolated desert. All in all it's one of the better horror movies I've seen lately. Also the kills are shocking and satisfying."
    },
    {
      "rating": "7",
      "text": "It is a true horror movie in that it makes you feel uncomfortable with what your seeing. Its quite gruesome and sickening so it really does well. However, its easy to get bored with the same scene-set in the dessert and the casting wasn't too great."
    },
    {
      "rating": "8",
      "text": "Compelling on its own terms,\"The Hills Have Eyes\" scares the living hell out of the audience by its violent cinemetography and dark and realistic direction taken by Aja's point of view. A freightning film throughout."
    },
    {
      "rating": "8",
      "text": "I've seen virtually every horror movie ever made and am a strong critic of the field -- so I hope you can trust what I have to say and expect credibility. H.H.E. makes Devil's Rejects look like an afternoon get together for tea in the rectory of your local church. The gore is absolutely brutal. I found myself doing something I haven't done in the the movie theatre in many years -- shifting uncomfortably from the brutality and closing the fingers of my hand into a fist while wincing at the expression of pain on the screen. I found myself looking around the theatre thinking to myself \"95% of the the guys who blindly brought girlfriends or wives to this movie are going to pay a HEAVY price on the drive home!\" I am absolutely shocked that, here in Canada anyway, all you needed to do to see this movie is be accompanied by something over the age of 18. NOBODY under 18 should be allowed to see this much violence.  Our rating system is ridiculous."
    },
    {
      "rating": "9",
      "text": "I went to see the HIlls Have Eyes with one of my friends the day after it came out, and I loved it. I know alot people DON'T like it because it was so brutal and disturbing, well yes, it is disturbing.. but you really have to remember that it is a horror movie, and if you know anything about the original, then you wouldnt be so surprised about how much gore and blood they've shown. It's quite understandable that people would squirm and be uncomfortable, but before you go see a movie, perhaps you should research it and find out what you're going to be seeing. On another note, I thought this was a great movie, because they didn't hold anything back from you and you leave the theater feeling so shocked that you can't believe what you just saw! The actors are wonderful, in only about two hours they bring so much to their character that you believe they're real people, the make up artists had a heck of a job to do and they did it excellently! I mean, if you watch a movie, and all you get out of it is how horribly bloody it was, you're not really seeing it for what it really is, are you? You should try to appreciate how much time and effort so many people have put into it, and you might see it in a different light. All in all, I was thoroughly impressed with the movie and would see it again any day, just not in the company of parents."
    },
    {
      "rating": "2",
      "text": "I just couldn't resist the trailer on TV, seeing people running out of the cinema and vomiting. I thought this might be worth the while. So I brought some friends and went into the cinema... Now I have to mention how that movie didn't live up to my expectations . Sure, there were some gory scenes but I would've prefered more shocking moments instead of 45 minutes boredom before some slaughter scenes, which, in my opinion, weren't scary at all. Just gory. I have to admit that the rape scene was sick, also not scary though, just incredibly sick. I am really sorry that I seen that movie because of that scene but I won't have a hard time forgetting it. There are MUCH, as in much better and in many others, and more thrilling movies of that kind that I would recommend over this one. As another person said here: The movie is also easily predictable. Save your money. Good example for what a good trailer can do, though."
    },
    {
      "rating": "2",
      "text": "This has got to be one of if not the most disturbing film i have ever seen. There was nothing interesting in the entire film, scenes of rape, and suicide make you want to throw up rather than entertain you. I would have to say that the trailer really fooled many people including myself. And furthermore, if you honestly liked this film and gave this film a good rating, there is something TERRIBLY wrong with you."
    },
    {
      "rating": "1",
      "text": "this movie is sick, sick, sick! i almost barfed in the middle of the theater. thank god is was a dollar movie. its funny that the dvd is including graphic scenes not shown in theaters..but what can possibly be more graphic than the original. i can't imagine what they can think of thats worse than what i saw. The level of fright was based on gore and not real triller suspense."
    },
    {
      "rating": "10",
      "text": "GREAT MOVIE! Alexandre Aya is one of most talented young directors. His previous movie \"Haute Tension\" was also brilliant. this movie is a MUST SEE for all horror fans"
    },
    {
      "rating": "0",
      "text": "awful, just awful - the horror genre is truly dead - gore and over the top violence does NOT equate to a quality horror flick - anyone can throw together a mindless slasher, which is all this flick amounts to - been there, done that to DEATH already - horror is more about mood and suspense, not shock value and the constant threat of hack and slash gore laden nonsense at every turn - some of the scariest flicks in history were also some of the most bloodless films"
    },
    {
      "rating": "1",
      "text": "for the most part this was lame. the plot was lame, and the so called scary parts were simply gorey fight scenes that anyone could have thought of. it was rather disappointing."
    },
    {
      "rating": "6",
      "text": "This was an ok horror remake, I liked the story line better in the original but the graphics was much better in the remake ( story line almost follows the original but not as good )."
    },
    {
      "rating": "7",
      "text": "For the most part that i saw it wasnt really scary u just felt sorr for the ppl getting tortured and crap but it seemed like it had a lot of action. on of the best horror movies i saw next to the saw movies."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie. Probably one of the best horror movies I have ever seen. Great plot, and the gore and intensity level is just over the top. The ending was kind of confusing, but it was still good, knowing there are more out there. The number 2 doesn't look as good though."
    },
    {
      "rating": "1",
      "text": "I honestly think this movie was horrible. This most definitely goes on my list for one of the worst movies I've seen. When watching this film it just seemed that everything happened so fast and that not many things were explained in detail. Also the acting wasn't all that great and the movie was also very predictable, I actually sat there and knew what was going to happen next. I was expecting a very scary and very gruesome movie and what did I get out of it? Nothing. The previews before the movie were better. Now a days horror movies that are coming out are just not like they used to be."
    }
  ]
}