{
  "id": 4624,
  "title": "The Adjustment Bureau",
  "starring": [
    "Matt Damon",
    "Emily Blunt"
  ],
  "runtime": 106,
  "genre": [
    "Science Fiction",
    "Thriller",
    "Romance"
  ],
  "description": "A man glimpses the future Fate has planned for him – and chooses to fight for his own destiny. Battling the powerful Adjustment Bureau across, under and through the streets of New York, he risks his destined greatness to be with the only woman he's ever loved.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A4wKf04g4DCVAWC67uPGozIJPGw.jpg",
  "categories": {
    "plot": 5.826086956521739,
    "acting": 6.7368421052631575,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 6.25,
    "action": 7.125
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A fun, breezy genre hybrid. Parts sci-fi, romance, and thriller, The Adjustment Bureau has a light tone and does not appear to aspire to challenge its more complex sci-fi counterparts."
    },
    {
      "rating": "7",
      "text": "Picture your life as perfect as anyone could have ever imagined. You have a great high-ranking job you have subordinates that think the world of you everything is going perfectly   your life could never have been better if someone had planned it yourself. What if someone had planned everything in your life right down to the T; What if what you are meant to do is part of some higher plan to shape the course of coming events to avoid a disaster or to change the flow of history? What would you do if you knew that a group of mysterious men who monitor the whole world are trying to keep order and peace has nudged everything you have ever worked for in your entire life in the right direction? Would you try to change your destiny? Or can your destiny really be altered at all? Can your fate be predetermined to have an outcome that benefits the whole world or would you fight back to change their plan to create your own destiny, to create your own fate to create your destiny not controlled by a higher authority. Would you fight for that? Would you fight for your freedom, fight for youâ"
    },
    {
      "rating": "10",
      "text": "One of the best movies of the year. Let me explain why.  The Adjustment Bureau starts with a local Election taking place in New York city. In which the main character, played by Damon, is being praised. Later on he meets a women he finds amazing. Throughout the movie these two fight some unknown to possibly find their love.What makes the Adjustment great first is the acting of  Damon and Emily Blunt. They have amazing chemistry some of the best in a while. And from a social perspective this movie is awesome because it is about desperate true love unlike a lot of popular movies now like Blue Valentine etc. which are about confused love or off the beaten path love. If you like a desperate love story mixed with mystery and a little bit of sci-fi this if for you.The next thing that makes this movie great is that it has a lot of interesting messages. On top of that the cinematography reminds me of an Abrams Fringe episode (men with black hats). Which was a quirky little thing that made me like this even more.Go see this if you're not a bitter old love hater. Or if you want to see a good sci fi or a good love story."
    },
    {
      "rating": "8",
      "text": "Other people have said the romance between the two was poor, but I personally saw it quite a bit. Perhaps these people don't know what real chemistry is and only have other movies to base this opinion on? Honestly, it's really hard to to see it.Other than that, I understand the ending does fall somewhat flat, but it's a decent movie none-the-less.  We actually saw it in theater on the release day and found it to be entertaining. There are plot holes if you dig too deep into the \"how\", but if you sit back and take a ride, it will be an enjoyable one."
    },
    {
      "rating": "9",
      "text": "While it is not for everybody, The Adjustment Bureau is the biggest surprise of the year thanks to its excellent story, an A plus cast, and some awesome drama that pushes the story along satisfyingly. The ending is also fantastic."
    },
    {
      "rating": "8",
      "text": "The movie asks the question, â"
    },
    {
      "rating": "10",
      "text": "In Hirozaku Kore-eda's \"Wandafuru Raifu\", the recently dead get to make a movie that recounts their happiest moment which will play in an endless loop for all of eternity. Heaven is a short film. But before the person makes it to this celluloidal after life, the subject must sit through pre-production meetings conducted by angels, who look about as ordinary as Harry(Anthony Mackie) does, as well as the other fedora-ed men in \"The Adjustment Bureau\". The interview process, in which the vignettes are collected for the subsequent shootings, are held at a sort of way station, a decrepit-looking building that resembles a social services institution, the anti-thesis of the usual iconography associated with heaven. Heaven has an indie aesthetic. Angels with harps, the pearly gates, clouds- those overused tropes are too Hollywood. \"Wandafuru Raifu\", in its eccentric depiction of the hereafter, stood apart from the usual religious genre fare with the truly radical idea that our creator is actually an omnipotent studio head. Heaven is art, seemingly without any ties to organized religion. The same heaven-as-bureaucracy angle is also prevalent in \"The Adjustment Bureau\", where heaven has an annex on Earth which looks conspicuously like an insurance company building. When David Norris(Matt Damon) discovers that the world is being micro-managed by \"case workers\"(read: angels), then defies their grand plans for him by his insistence on pursuing Elise(Emily Blunt), a woman he was supposed to meet just once, the men in hats \"kick\" the case \"upstairs\". The \"chairman\"(read: God) send down an archangel-type named Thompson(Terrence Stamp), who informs the senator hopeful that free-will doesn't exist, only the appearance of it. The men who work for the Adjustment Bureau function as architects of predestination. In the Kore-eda film, free will, likewise, turns out to be an illusion, as well, since the movie that the people are collaborating with god on requires a script. A script suggests that everything is written out ahead of time, a collection of life experiences that has a beginning, a middle, and an end. For David, his happiest memory(were he an interviewee in \"Wandafuru Raifu\") may very well be the moment he says, \"I love you,\" to Elise on the rooftop, kissing his muse as if it was for the last time, so he kisses her hard, while the bureaucrats approach the couple with the intent of \"resetting\" their mental faculties. Prior to being trapped on the terrace overlooking New York City, the fleeting lovers, in a sense, make their own movie, as they ingress into new locales with each turn of the knob, like editors, surveying the city in the blink of an eye. Their whirlwind jaunt through the urban landscape can be construed as a metaphor for how love has its own velocity when you're with the one you love. Whipping through Yankee Stadium, Times Square, and Ellis Island, time seems to move too fast. Time just slips away. Time passes you by. If David and Elise kiss each other deeply enough, the future amnesiacs hope that perhaps some vestige of their affinity for each other will survive. Maybe they'll find each other, similar to how Joel Barish(Jim Carrey) and Clementine Kruczynski(Kate Winslet) think they're meeting for the first time on that train to Montauk at the outset of Michel Gondry's \"Eternal Sunshine of the Spotless Mind\". Lucky for the politician and the dancer, but unlucky for the fortunes of the film, their undying love never gets tested, because \"the chairman\" is a Judeo-Christian figure, whereas in the Gondry film, traces of Buddhism can be detected in the way the victimized Lacuna customers are able to recognize each other, which subtly suggests reincarnation, a concept commonly associated with eastern religions. The ending to \"The Adjustment Bureau\", in what is otherwise an entertaining mish-mash of reasonably sophisticated sci-fi and high romance, is sort of a cheat(or maybe not). God is perfect, right? Hypothetically, when does God ever change his mind? In Carl Reiner's \"Oh, God\", George Burns, playing our heavenly father, admits to making the pits in avocados too big, but he lets the imperfection remain as is. After forty years of presiding over earth under a working predestination model, now the chairman wants to give free will one more try? C'mon, now. The last time people were entrusted with free will, as previously stated earlier in the film by Thompson, the Cuban Missile Crisis occurred, bringing the world to the brink of nuclear war. What if God didn't issue this edict? When Harry is summoned to the Chairman's chambers, what if the angel staged a coup, and took over the reigns of power? Maybe the Salon writer is right. Maybe Harry is the devil."
    },
    {
      "rating": "6",
      "text": "\"The Adjustment Bureau\" barely stays alive from its cliched script and its fragile plot. However, it is only the chemistry between Ms. Blunt and Mr. Damon that increases the value of the movie."
    },
    {
      "rating": "10",
      "text": "It was basically a modern-day \"It's a Wonderful Life\". The basic concept of \"ripple effects\" is something I always think of in the daily routine of life. (Doing or not doing certain things that have the potential to change the outcome of events in the near or distant future.)In the end, it makes one become very aware of the weather and who's wearing headgear and who isn't."
    },
    {
      "rating": "7",
      "text": "Certainly better than the reviews led me to believe it would be. I really enjoyed the first 3 quarters of the film greatly, but it breaks too many rules and wraps up with too nice a bow on it.  Something about the film reminded me of The Truman Show, but this one suffers by comparison. That was a great film.  So yes, this sounds like a negative review, but it's not.  A bunch of interesting themes,  Blunt, Damon, Stamp and Anthony Mackie (Hurt Locker) are terrific. The guys in the Devo-inspired black jackets and helmets who run handle the abductions are funny as hell.  But it's entertaining, and that's what matters."
    },
    {
      "rating": "8",
      "text": "This movie will surprise the hell out of you. Don't let anyone tell you about the plot. Actually, don't even watch the trailer! The movie starts out a little bit unpromising, but gets better and better and better. I cannot remember the last time I was that amazed by a movie. Highly recommended. Watch it!"
    },
    {
      "rating": "10",
      "text": "Definitely a great film. It was extremely thought-provoking, & quite complex. A movie like \"Inception\", not by plot, but by the fact that you really must pay attention in order to see what's going on. Very entertaining & interesting, as well as unpredictable."
    },
    {
      "rating": "4",
      "text": "Rango was sold out so I had to settle. I was most gravely disappointed. The chase scenes were mediocre, the romance cliched, but the pitiful absence of philosophic acuity lost my interest. In fact, I fell asleep for fifteen minutes.This is not to say that many will not enjoy this film. If you just want a fun thriller with a feel-good moral at the end and a resolution that will make you ponder fate and free will on the drive home from the cinema, then by all means, check it out.The lead roles are played well. In fact, everyone except Mackie, who I suppose could use his assumed persona as an excuse for his inability to convey anything registering on the spectrum of emotions. However, since the others in his same \"line of work\" appear to possess a full palette, he sticks out like a sore thumb.On the other hand, Damon is acting \"better\" then he ever did in Bourne Ultimatum. The first thirty minutes are magisterial. Once the character is \"developed,\" though, the action takes over, and the film's quality goes steadily downhill. Damon's values, ambitions and personality are completely eroded by the overwhelming love interest. Apparently the best part of the movie simply serves ironically as a foil to draw attention to all the differences (read: shortcomings) of what comes afterward.If the writer had the courage to make a drama and not a thriller catering to the public's flickering interest in the question of personal destiny, this might have made some Best of 2011 lists. As it is, it will be forgotten by the end of the month."
    },
    {
      "rating": "7",
      "text": "Actually a good date movie, it can be a lot of fun....if you ease off the need to delve into the possibilities more thoroughly.....a must DVD rent....optional for movie goers...it did miss the mark...but I have a feeling this movie could have lasted 4 hrs to curb some of the needs of some viewers....it was thin on premise and execution but honestly it is worth seeing. You decide if you got the doe for a  good date night movie or red box."
    },
    {
      "rating": "3",
      "text": "The Adjustment Bureau is just a trashy, forgettable film. What was the point of any of the things that happened? No deep or challenging thoughts are presented, and a somewhat ok idea is just mangled and handled in the laziest way possible. Avoid this one, unless you have a taste for hammy overacting and a cheap laugh at this film's expense."
    },
    {
      "rating": "5",
      "text": "Boring, boring, boring. Although Matt Damon and Emily Blunt are great actors, I didn't find any chemistry between them. The plot was not interesting and the action was not satisfying."
    },
    {
      "rating": "0",
      "text": "There was nothing memorable of it.It didn't have any effects at all,worst script and dialog I've ever heard and critics say it's a love story???The \"love\" which was going on in the movie was laughable because it was so synthetic.One of the worst movies I have seen this year so far."
    },
    {
      "rating": "1",
      "text": "The Adj. Bureau IS TRYING TO KEEP ME FROM WRITING THIS!  I thought the original plot line was intriguing but found out implementing a story line and putting things into action,, obviously is a trip down an old rabbit hole. The ripple effect for me, is spending good money for something I couldn't eat, wear or take home. BASIC movie PREMISE; A bunch of  inept goons, with \"bad\" hats walk amongst us, with our life \"plan\" monitoring our actions and adjust it according to the \"Chairman\". They are not \"angels\" but sort of reference to angels, but not really....and the \"Chairman\" is not God, but sort, but not really.  WT heck.  Is Hollywood so religiously sterile it cant use the word God except in profanity?  Secret doors and out of date I-pads to help them along the way. God forbid you fall in love, oops sorry \"Chairman\" forbid you fall in love and it doesn't meet with the approval of the \"Chairman\".. I thought the whole purpose of life was to love. So the \"Chairman\" in all his wisdom couldn't put together a better plan than goons in hats?  AND, apparently Matt D. is the only person on earth that \"uncovered\" this destiny monitoring system.  Convoluted, contrived, naive' are the only good things to say. Its an insult to any person with a gram of mental intelligence, to present an all knowing power running a \"destiny\" department with bureaucratic incompetence comparable to our current government officials.  At least our representatives aren't walking around with bad hats yet!"
    },
    {
      "rating": "5",
      "text": "Matt Damon plays a New York politican who's star is rising...until he falls in love. Then, this group of men in hats sets out to \"adjust\" his life. What starts out promisingly (and with lots of real-life cameos) gets more and more talky with less and less suspense or action. Basically, it turns into a stupid episode of \"Twilight Zone.\" On the positive side, the chemistry between Damon and Emily Blount makes for a strong romantic core. A real letdown."
    },
    {
      "rating": "0",
      "text": "An absolutely terrible movie which tries to take itself seriously, but involves magic hats and other idiocies. In case you are wondering - yes, I did like Minority Report and yes, I do generally like Matt Damon.\r The Adjustment Bureau has gotten surprisingly positive reviews, which has forced me to blacklist more than a few critics whose opinion I formerly trusted. This movie is so bad that recommending this movie is simply inexcusable. Peter Travers of Rolling Stone, you have moved up another spot on my trusted critic list!"
    },
    {
      "rating": "0",
      "text": "One of the worst movies I've seen in a while.  It's a good that I used a free movie pass on this movie, because I wouldn't pay to see it.  It had really bad dialog, with a horrible ending.  It starts out with potential in my opinion, then immediately drops all meaning half way through the film and turns out to be one of the worst love movie ever.  Don't be fooled this movie is really bad."
    },
    {
      "rating": "0",
      "text": "This is the second worst movie I have ever seen (the first is The Blair Witch Project). I fell asleep for the last half an hour. I can't believe I paid to see something so idiotic. I can't believe Matt Damon signed up for that  joke of a movie."
    },
    {
      "rating": "6",
      "text": "Blunt and Damon are good, but they can't float this sinker. Dick's work really needs to kept on the page, and in the 50's, as it hasn't translated well to the screen. They should have called this \"Guys in Fedoras\" or \"We're no Angels.\" If this is all God (aka the Chairman) can get up to then we're in a sorry state, and I guess that was the point......and they don't have enough man power?"
    },
    {
      "rating": "6",
      "text": "This movie I had great hopes for in terms of being blown away but they made the adjustment bureau seem as if they were God or something of that sort which was probably the intention. I understand that the government may control people through numerous ways but this is well documented. If they had used the idea in a more real way than fantasy I would have enjoyed the movie as much as the bourne movie's."
    },
    {
      "rating": "5",
      "text": "Great premise poor execution. Contrary to the commercial that says its more thought provoking than Inception I found it two dimensional and not thought provoking at all. I also found it lacking in plot. I wanted it to be good but it was mediocre at best."
    },
    {
      "rating": "7",
      "text": "For me, this movie was a throwback to simple fantasy films of yesteryear.  It isn't meant to be a deep, complex movie like The Matrix or Inception.  It is simply a romantic comedy fantasy.  The film would not work if there were no chemistry between the two leads, but that is not a problem.  Matt Damon and Emily Blunt have great chemistry together, and I was rooting for them to be together the entire film.  I thought the film was fun, and unlike some of the other people reviewing this film I was never bored."
    },
    {
      "rating": "1",
      "text": "Started out great, but went downhill about halfway through. Matt Damon is over-cast for this role. Let's for one moment assume that you would really know that everything you and others do is manipulated by some higher power, how could you function ? You couldn't. The only way for anyone to live is by not knowing what even the next second brings."
    },
    {
      "rating": "8",
      "text": "Review for Adjustment Bureau\t\t\rOn Saturday March 5, 2011 I decided to do a double movie day and see two promising blockbusters.  The first on my list was the adjustment bureau, a drama I thought would be a mixture of the matrix, inceptions, and a little bit of titanic drama.  In a sense that is what it is, but favored more of the romantic tale than anything else.  The movie opens up with an intro to Matt Damonâ"
    },
    {
      "rating": "10",
      "text": "The beauty of Science Fiction is the ability to tell a story, any story, outside of our reality and make it work.  So a love story wrapped in the intrigue of a thriller with some good old fashioned \"what if' thrown in is just perfect for me.  Not sure what movies the critics were watching, but from my seat in the theater, what was thrown up there on the screen was 100% quality writtng, directing and acting.  Better than Inception, by far."
    },
    {
      "rating": "10",
      "text": "''''The Adjustment Bureau\" has both too little action and too little romance. In the ending, which is way too long, Matt Damon, has to wear and Adjustment Bureau hat, to go through doors. Why he has to go through doors, except to try to escape The Adjustment Bureau, is not clear and takes way too long. Going through these doors reminded me of \"Inception,\" where the actors go to different levels, in dreams. In \"The Adjustment Bureau,\" it is also confusing and time-wasting. I was expecting a better movie, considering Matt Damon's acting skills, but I was disappointed."
    },
    {
      "rating": "6",
      "text": "An ok film.  I went to see it because I really like Emily Blunt.  She did not disappoint.  However I did not like the story or the philosophy behind it.  That was what really let it down.  I believe strongly in free will and this movie seems to be saying that we don't have that much of it?"
    },
    {
      "rating": "7",
      "text": "more of a love story than a complex \"inception like\" thriller, but still satisfying overall and features great performances by both Matt Damon and Emily Blunt. Their chemistry alone fills the holes the convoluted plot digs as the movie progresses."
    },
    {
      "rating": "3",
      "text": "I didnt like the matrix, thought the ending of source code was lame but i would watch either of them again than having to endure the adjustment bureau once more. The start of the movie is great and i had such high hopes but then the movie tries to gain its strength on a love relationship which was never fully developed. Without the leading actor the movie would have gone straight to DVD."
    },
    {
      "rating": "6",
      "text": "An enjoyable film but I thought it had been either over-edited or there was something missing. It was like some of the story threads had been left to dry and not explored. Shame, because instead of being a great film it was average which was a shame because the lead actors were fine, just a script which needed to be tweaked and tended too by the \"Adjustment Bureau.\" With what seems like Hollywood's campaign to remake just about everything perhaps this fim will be remade better one day and explore the subject deeper."
    },
    {
      "rating": "10",
      "text": "The fallacies and philosphy by \"worldly men\" concerning free will (1 Cor 3:19). Thou it is fictitious, this movie relates the relationship between mankind and angels, in order to capture the minds of people and mislead those who do not read the bible. God does not force an individual to accept either destiny, and in that sense he allows to every intelligent creature the exercise of free will. It is not denied by predestinarians that men are free moral agents, yet their own teachings certainly deny it. Free will is a blessing for man and makes him human, rather than a ROBOT. Thou it is just a movie, be careful if your spiritual minded (Eph 4:14; Rev 12:9-12)"
    },
    {
      "rating": "8",
      "text": "The Adjustment Bureau Is A Very Good Film. It Was Interesting And Was Enjoyable To Watch. I Like Matt Damon As An Actor And He Did A Great Performance In This Film. I Must Say For George Nolfi To Direct His First Film He Did A Pretty Good Job. I Would Give This Film A High Matinee!"
    },
    {
      "rating": "0",
      "text": "Not a movie, more like a terd, with huge hollywood names slapped on it, flushed out to the sea of loving fans, who will all say how great it was to their friends.. Just like I got douped. Concept = City of Angels meets, Matrix meets, What dreams May Come with Robin Williams..(in my opinion the other worst movie ever made)"
    },
    {
      "rating": "5",
      "text": "the adjustment bureau is one of the worst ideas for a movie that i had to sit through.\ri don't understand why anyone thought that the story would actually work as a Hollywood movie.\ri mean i have nothing negative to say about Matt Damon cause he's a good actor however i watched an interview he did were he actually was convinced about the story because he met his wife like that.\rso i think it's an insult to people's minds that they didn't just make a movie about this story but actually trying to convince people that this is really what's going on in the world.\rand also if you gonna choose someone to play a role of an angel please don't choose a black man to do it at least make him look like gandalf and don't ruin people's childhood."
    },
    {
      "rating": "4",
      "text": "Kind of a lame movie. I didn't like the story behind the bureau itself, and everything just seemed a little convoluted.  See it once, just to get it out of your system, but no need to buy it or anything. Disappointing for a Matt Damon movie."
    },
    {
      "rating": "7",
      "text": "Entertaining, moderately thought provoking, relatively enjoyable, but I would only watch it once.  The film was good, but nothing special.  Entertainment for all ages."
    },
    {
      "rating": "8",
      "text": "Not a bad film, just not a great film.  The casting was pretty good.  I never read the Philip K Dick short story, but it is more a fantasy tale than sci-fi.Silly premise, but fun, and as many irrational religionists as there are on the planet, it will surely find an audience.  I would really love to put on a hat, open the doorknob a certain way, and find something different on the other side of a door, don't you know."
    },
    {
      "rating": "5",
      "text": "While the Bureau itself garners enough mystery to fill an entire movie, we are instead treated to an uninteresting love story between Matt Damon and Emily Blunt. The tone shifts randomly at times, and some scene choices bring the story to a complete halt. The pacing is uneven throughout the movie, further diluting the already generic romance plot. A good way to summarize this movie is to take a really intriguing idea, and to complete a script of it by the end of the day, whether or not you're satisfied. Collapse"
    },
    {
      "rating": "7",
      "text": "It is a romantic fantasy...and if by now you are not tired of being pissed off by being lured into the theatre for something else (big bucks movie co's gotta do some weird s to get you in), then you'll enjoy this romantic fantasy. Don't look or worry too much. Enjoy!"
    },
    {
      "rating": "9",
      "text": "i loved this movie.. it leaves you with so many thoughts an the pace is nice throughout.  the acting in wonderful.. free will vs destiny explored in a fresh and engaging way.. along with a believable love story. good stuff"
    },
    {
      "rating": "5",
      "text": "This is definitely a \"wait for redbox/netflix\" film. The themes are so strong and glaring that it's almost comical; I found my self smiling in amusement at moments that were clearly meant to be somber."
    },
    {
      "rating": "7",
      "text": "Not the most memorable movie Ive seen, but i like this genre.  The thing this movie lacked was a twist at the end.  It was pretty much straight forward (revealing the meaning halfway through), I think they could have suspended the movie longer than they did.  All-In-All, a decent flick."
    },
    {
      "rating": "8",
      "text": "Absolutely loved this film. Very much similar to Inception but with added romance. Damon just looks and smiles like a Senator so this was a role made for him, whilst Blunt really blew me away in this with her impactful acting and deep character. I wanted to give this a 5 but the only thing which brought it down was a bit of the hammy acting by John Slattery (which was disappointing considering his strength in Mad Men). Another strong performance comes from Anthony Mackie. If you like a film which makes you think a bit, then this is a must watch"
    },
    {
      "rating": "8",
      "text": "A very pleasant way to spend a rainy Sunday afternoon.  The easy chemistry between Matt Damon and Emily Blunt and the somewhat cheesy but thought provoking idea that maybe there is such a thing as fate make this a very enjoyable movie.  Kind of fun to think that the folks \"upstairs\" are not so perfect after all, though I might think that serious church goers might be turned off a bit.  The movie has the right balance of tension, humor and emotion.   Add in elements from the Matrix and The Princess Bride (\"true love\") and you get one fine movie.  I saw this with my wife and she also gives it two big thumbs up."
    },
    {
      "rating": "5",
      "text": "Before I watched this movie, I had zero expectations for it, as it looked pretty desperate in the trailers. However, I found it fairly enjoyable, with it being easy to watch with good performances by Matt Damon and Emily Blunt. Despite me liking most of it, the movie was lacking in most departments as well. The whole idea of the Adjustment Bureau seemed cheesy to me before, and after the movie it seemed basically as cheesy. There was some poor acting by some characters and the script seemed horrible in some parts as well. Probably the worst part of the movie was the ending, without giving away too much. I recommend this movie as a movie night pick, but not much more than that."
    },
    {
      "rating": "6",
      "text": "Philosophical popcorn that doesn't disrespect Philip K. Dick's story...too much. I enjoyed it but won't remember it except to say, \"that one movie where Matt Damon goes through doors.\""
    }
  ],
  "recommendations": [
    "downsizing",
    "limitless",
    "colossal",
    "the_butterfly_effect",
    "paper_towns",
    "tomorrowland",
    "code_8",
    "pay_it_forward",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "hereafter",
    "chaos_walking",
    "the_craft_legacy",
    "lucy",
    "chappie",
    "vivarium",
    "elysium",
    "the_vow",
    "her",
    "contagion",
    "predestination",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "nerve",
    "soul_surfer",
    "vanilla_sky",
    "x_men_apocalypse"
  ]
}