{
  "id": 1351,
  "title": "The Transporter Refueled",
  "starring": [
    "Ed Skrein",
    "Ray Stevenson"
  ],
  "runtime": 95,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "The fast-paced action movie is again set in the criminal underworld in France, where Frank Martin is known as The Transporter, because he is the best driver and mercenary money can buy. In this installment, he meets Anna and they attempt to take down a group of ruthless Russian human traffickers who also have kidnapped Frank’s father.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/71kaQfdrMy0LHSeLRADsvlDGCgb.jpg",
  "categories": {
    "plot": 4.066666666666666,
    "acting": 3.8823529411764706,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 3.4,
    "familyFriendly": 5.4,
    "funny": 4.0,
    "action": 4.387096774193548
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Comparing to Jason Statham's Transporter series it looks bad. If this movie had another tittle instead of Transporter Refueled suggesting it as a reboot of the Jason Statham;s transporter movies then this movie would have received much better reviews. I like the new actor in overall but the way this movie was filmed out, the poor director job, the emotionless and doll-like acting. The shallow plot. The cliche twists in the scenario and the cheese dialogues, not even to mention the corny monologues of the characters introspection during the movie... The film seems like it is focusing on a social/political dram from a bunch of ex-sluts who want to take revenge on a mafia house more than the actual deal, a person who is MEANT TO TRANSPORT SOMETHING FROM POINT A TO POINT B AND GETS IN TROUBLE ACCIDENTALLY. Instead this time the protagonist chooses to get in trouble to save his father who guess what? His father sets the plot but initially all of these crap backfires and makes things worse with the mafia houses killing each other. The movie introduces a lot of shallow and forgettable unworthy to mention characters and it is hard to follow the movie plot since everyone plays an important role but dies initially. Watch at your house not at the cinema. Plus rend it do not buy it."
    },
    {
      "rating": "2",
      "text": "Transporter: Refueled is directed by Camille Delamarre and is written by Adam Cooper. It stars Ed Skrien, Ray Stevens, Loan Chabanol, Gabriella Wright, and Tatiana Pajkovic.\r This movie revolves around a mercenary for hire, Frank Jr.(Ed Skrien), Who takes up a job to help three femme fatals in their highly planned robbery. The effect of this is Frank's father(Ray Stevens) is kidnapped and now Frank must find a way to get him back.\r There isn't a whole lot positive to say about this movie it was mediocre and tame compared to the original trilogy. With that said Ed Skrien does inject just enough energy into this lifeless project to keep it rolling. In my opinion the Transporter films never had much energy to begin with, its all style. Yet they are some of my favorite guilty pleasure action flicks. Why so? Statham. Call him what you will he makes any action garbage fest watchable. Therefore this movie was doomed to begin with.\r The writing is pretty bad but from the writer of Exodus, its not that surprising. Filled with clichés galore the whole affair is unwatchable on an intellectual level. The direction is filled with sped up, shaky action sequences that make it horrendous to look at. The acting is so middling that its hard to care about the fate's of anyone. Finally the villain is so cookie cutter its strange they weren't in on framing Roger Rabbit.\r All and all this was a rather terrible movie and I pray to God that it doesn't make enough movie for a sequel. Transporter:Refueled gets a D or a 2/10. No Refueling Needed, Compaction Mandatory"
    },
    {
      "rating": "4",
      "text": "You know it's a bad sign when Jason Statham himself says no to another Transporter movie, and it was the best decision he ever made.\r Transporter Refueled is about the technology and how it's upgraded but the rules are the same: never change the deal, no names and never open the package. Frank is the most highly-skilled transporter on the market - and when Anna and her three stunning sidekicks hire him, he finds the deal turned sour when he finds out they have kidnapped his father in order for him to take down a Russian human-trafficking ring. But Frank will stop at nothing to get his father back - no matter who stands in his way.\r Transporter Refueled was a movie that I was totally unaware off, because I literally never knew they made another one, and I just found out about it just a few weeks before the films release. I originally was going to skip this one just like some of the movies that been release recently, but then I quickly realize that I was behind on a lot of the recent releases and I'm not just talking about actions movie but decent ones. So I thought \"What the heck\", and went to see Transporter Refueled with an open mind. Seriously, how bad can it be? well... it was pretty bad but I didn't really hate it as I thought I would.\r Let me just start off with the positives first: This movie so bad that it's kind of hilarious to watch. I was never bored watching the movie just because of the action scenes, and just the overall movie itself that was so laughably bad that it was pretty entertaining. Ed Skerin didn't do a terrible job in the role as I thought he was going to be, but Jason Statham owed that role and that's not going to change. And that's it for positives.\r Now for the bad: Now the Transporter movies dose have it's stupid and ridiculous moments, and the movies are aware of this and so is this one, but this movie takes that to the next level. The movie at times wants you take some scenes seriously and it absolutely dose not work at all, and it doesn't even work as it was set up so poorly.\r All the characters in the movie came off bald and just there for the sake of it (The actors I mean).\r The editing in this movie is the basic quick cut action scenes we've seen before in previous movies that have no clue how to film it's action. Why can't we just have a good action scene without all this messy cut and paste editing we see a lot in action movies today. Transporter 3 had some awful actions scenes but after seeing this movie I think the third films looks pretty good right now.\r Overall Transporter Refueled is a terrible, terrible movie. But I'm also surprised that I didn't hate this movie as I thought I would. If you watch this movie as a comedy it actually would work, Because this movie is filled with: cartoonist dialogue, crappy quick cut editing, and lifeless characters. But keep in mind that this movie could have been much worse and I'm pretty glad it never went full bad."
    },
    {
      "rating": "1",
      "text": "Transporter Refueled is horrible the plot is convoluted, the dialogue is  poorly written and the acting is sub par not to mention most not all of the stunt choreography is just terrible only thing positive i can say is the cinematography was impressive but even if you  film a piece of **** with good lighting and camera work its still a piece of ****"
    },
    {
      "rating": "2",
      "text": "I feel sorry for everyone who worked on this film.  It's feels like an unintentional Sharknado. From really poor acting to the trivial plot....From saving prostitutes as a noble cause to jumping from JetSki's to car windows...It is just bad.\r The real good actors in the film were the car Audi S8 and the hero's dad."
    },
    {
      "rating": "3",
      "text": "This game has a terrible plot , nice nudes to draw attention, some impossible car action , some fighting scenes it is all.It is a waste of time and money."
    },
    {
      "rating": "5",
      "text": "The 'Transporter' Series didn't need to be rebooted; skip this one if you want.  But if you like most action movies then give it a try.\r The 'Transporter' series never was a huge success to begin with, and the last installment was only a few years ago. But EuropaCorp and Relativity Media couldn't be bothered to give Statham $11 million dollars to return to the role. So REBOOT!\r 1) Keep it PG-13 for it to be accessible to teens. 2) Put 'From the producers of the Taken trilogy' in the ads for it to have some credibility. 3) Put some half-naked chicks for the audience to appreciate!\r 'Refueled' isn't creative, original, or particularly clever. The story isn't special, the acting adequate, and the action decent but not breathtaking (enough to have something interesting for the trailers). But 'Refueled' is filled with action, so if you forget about logic and just watch it as 'action-porn' than it's all right. At least it doesnt take itself too seriously.\r I'm a teenager, and apparently people my age eat this stuff right up. But it wasn't very engaging. I've seen too many by-the-numbers action movies, and seeing one more didn't help my opinion of Hollywood. I don't mean to be overly critical or cynical, but how hard can it be to try something else than what's worked before? (But I guess you could say that if it ain't broken, don't fix it.)\r I didn't have very high expectations for this movie, so I'm not surprised by how I feel about it. If you like action movies, then watch 'Refueled'. It's not complete trash. (More like something recyclable.) It works as mindless popcorn-entertainment. But if you just want something to watch on the weekend, see what else is in theaters. (Maybe some blockbuster sequel?)\r This movie reminds me of other reboots, like 'Fantastic Four' and 'Hitman: Agent 47'. And of unnecessary/ underwhelming sequels like 'Taken 3'.\r I have reviewed 43 movies (on Metacritic and IMDb), some recent ones, including: Mission Impossible: Rogue Nation, Minions (Despicable Me spin- off), Avengers: Age of Ultron, Fast and Furious 7, The Divergent Series: Insurgent, Taken 3, and more. I also review TV shows."
    },
    {
      "rating": "0",
      "text": "The best thing about Refueled was the Audi. Man, was that Audi stylish. The rest of the movie? Well, to simply put it, boring, rubbish and first rate crap. There is really nothing \"Refueled\" about this whole monstrosity, it's just like your uncle's old truck, decorated from the outside but smelly and crappy from the inside. The Transporter films were always injections of fun, and Jason Statham was actually a good action hero. Ed Skirin has one goal, save his dad while protecting prostitues and jumping Audis off of airplane ramps. And he MESSED IT UP. First of all, the action scenes were terrible, absolutely terrible, the DBOX viewing was tiring and aching, with no \"jolt\" to it. There is way too much damn talking, so DBOX is a bad idea anyways. Cars are hitting each other with almost pillow-fighting impact and Skirin is ultimately, unlikable. He just didn't HAVE IT. They could have revived the series with a better option than this guy or just killed the series immediately. No punch, no power, boring storyline, awful acting and much much more destroys The Transporter Refueled for mainstream moviegoers. Avoid."
    },
    {
      "rating": "8",
      "text": "The body of critics really missed the boat on this one.  I HATED the third Transporter because it was a tedious, joyless experience.  This Transporter was a hell of a lot of fun. I was never bored, and was often jumping out of my seat during the action sequences.  The lead character is solid, and his father is a great complement. More importantly, the 4 lades - who are the core of the film - are spectacular.  Obviously, they're eye-candy, but not in an exploitive way - they're extremely smart, strong, and cunning.  If you want to have FUN (especially this time of year), check it out."
    },
    {
      "rating": "8",
      "text": "I actually did enjoy this movie. The critics were off on this one. The only thing I didn't like was that there was less car action and more combat, which being a transporter movie is not what I was expecting. However, still very fun and good (but not the best) acting. If you give Fast and Furious 7 a good review but give this a bad one, you need to re-evaluate your life."
    },
    {
      "rating": "7",
      "text": "Hi I think the professional reviews here are misleading and not telling truth as we know it.  A \"good movie\" these days, especially an action movie for an international market is one that makes money.  Period.  Full stop.\r So all we can really do is evaluate this one in terms of competence.  Is it over all competent enuf to make money?  I can't find the budget.  It made $72 million; I'm guessing it made money.  This means the script, producer and director are competent.  Ed Skrein is more than adequate as are the rest of the actors and stuntmen, always a plus in Luc Besson films.\r What stands out as not competent is the stunt choreography.  Transporter 1, 2 especially are famous for their elaborately conceived and rehearsed fight scenes, some of the best ever done.  The blocking-rehearsals for the fight scenes in the first Transporter used to be on Youtube and may be on the DVD.  Very creative, everyone totally dedicated and camera moves worked out with much thought.\r Here, the land fights especially are the weakest part of the whole effort.   You can see the actors giving it their all; you can see the  many good and original stunt ideas someone came up with, usually a group effort, but little attention is paid to camera moves.  So there is no \"ballet\" at all.  Nor is there quite the focus and intensity of Fury Road fight scenes.\r Add to this there is no character develpment by design in this franchise and the overall effect, here in the US is of a movie made in the 1990s. Given all this we can understand why a mostly very competent film received such low scores here in the USA."
    },
    {
      "rating": "8",
      "text": "While the Transporter Refueled might be messy, cliched, and all over the place; it was actually quite fun for me to watch another Transporter film. The plot did get sillier and sillier as the film went on, but the action sequences were done pretty well. Overall, it's basically watching a crazy, sexy action film that may or may not be good for you. (76/100)"
    },
    {
      "rating": "8",
      "text": "Not so great movie because Jason Statham is not in the film.  If you are a fan of Transporter, this movie is worth the watch.\r Check the movie here: http://www.watchfree.to/watch-2a3d21-The-Transporter-Refueled-movie-online-free-putlocker.html"
    },
    {
      "rating": "5",
      "text": "Ed Skrein has taken the wheel from Jason Statham as the titular driver. The current assignment steers away from car stunts to an elaborate heist with 4 hot women. Skrein is model-chiseled handsome with English composure (which makes him feel more like James Bond), but he has a charisma that works. The chases are fast with lots of flying crashes. The fights are hectic with plenty of punches and bullets. Even so, it never travels down any new roads, which makes is more a threadbare retread than a refueling."
    },
    {
      "rating": "5",
      "text": "Seems fresher though Skrein is no Statham and the premise isn't good enough to carry the film."
    },
    {
      "rating": "1",
      "text": "Ed Skrein gives it his all and I am not saying he's bad but when you are following up the guy who pretty much made his career off this franchise, It's tough to top. He just doesn't have that sort of every day joe feel that Statham had, He looks far too model like and it's tough to even remotely see him as a bad ass.\r Now as for the film, The plot is really typical and the action just doesn't have that quality that it did with Statham as the lead. All in all, It's a reboot/remake that played it far too safe. There's nothing original about it, There's no defining moment. It features nothing that would make me want to see another one. I think it will more than like go the Bourne route - They tried to start the franchise with a new lead and it didn't work so the next film will more than likely feature Statham again as lead is there is a next Transporter."
    },
    {
      "rating": "4",
      "text": "It's a women's revenge movie, definitely not a 'Transporter'.\r There are hundreds of reasons to say it did not look like a fourth film in the 'Transporter' series. One such was the cast, especially the title role that replaced Jason Statham and the rest as well not very convincing. The stunts were just good, but sometimes it was annoying. The overall movie is even worse than the 'Agent 47'.\r From now on, this franchise will downgrade if they fail to bring back Statham. Recently plenty of franchise rebooted than ever, so I thought the fever hit for this one as well. But no, it is simply a next installment and worst part in the series from a far distance.\r I'm not against bringing a bunch of fresh faces and crew on board, but the structured planning was not good. The storytelling and especially it is missing the originality, the stylish tone that set by Mr Statham. That's how everyone remembers this franchise. All I wanted was to upgrade to a higher level by carrying the original legacy.\r I think, 'Transporter' is a trilogy. The following ones are simply the B films from the tier-two filmmakers to experiment with their skill under the limited budget. The announcement of the cast and crew for the next film will reveal whether it climb back to its glory or keep falling. But for now, to the 'Transporter' fans, it is done.\r 4/10"
    },
    {
      "rating": "4",
      "text": "Another Transporter film is not exactly a film most people wanted, especially when Jason Statham is not in the Transporter role and The Transporter Refueled is essentially just as disappointing as you'd expect. Ed Skrein is okay is the Transporter but he's nothing special. Ray Stevenson who played his father was actually the more interesting character though and that brings the film down because the main hero is not really your focal point. The story is a little congested which is probably because the storylines are being stretched fairly thin in this franchise. The rest of the cast is fine as well. There is really nothing revolutionary going down in the acting department and the villain is a little underdeveloped and boring. Still I can't help but get a little bit of enjoyment in this movie. The action was pretty decent at some points despite being very over the top several times it was at least entertaining. It is your typical \"shut your brain off\" action film its not good, but I'm sure there are plenty of people that will have fun with it."
    },
    {
      "rating": "1",
      "text": "A terrible movie that apparently went down well in China, so they are financing 2 more! The action sequences are mildly diverting but their determination to avoid showing blood rendered them rather like the \"A-Team\". The English hip hop singer in the leading role should return to his day job, he's certainly no Jason Statham."
    },
    {
      "rating": "3",
      "text": "Transporteur l'héritageUne déception, mais bon...Une histoire avant les événements du 1 ce qui est un peux bizarre au vu du titre.Un acteur principal (interprété par Ed Skrein qui joue plutôt mal...) loin du niveau de statham ... et complètement effacer par rapport au personnage de son père (interprété par Ray Stevenson) qui sort les répliques les plus drôles du film... D'énorme incohérence dans l'action. Oui, car voyer vous en FRANCE nous autour d'un rond-point on met 4 bouches d'incendie.... le transporteur les casses toutes, mais sa BM n'est pas rayer. Alors MR les Partenaires il va falloir comprendre que personne ne croit que vos voitures ne se rayent pas, car dans Ce Film Médiocre les Voitures sont toute atteinte du cheat code \"Invincibiliter\" de plus on nous montre la marque toute les 10s en actions... mais sérieux ce film est une méga PUB d'1H30 qui LOBOTOMISE le cerveau au BM !!!! IMPOSSIBLEBref un film français qui rejoint rapidement le placard comme beaucoup sauf \"AntiGang\" LOL.PS: BM et AUDI pareil..."
    }
  ]
}