{
  "id": 4822,
  "title": "The Second Best Exotic Marigold Hotel",
  "starring": [
    "Dev Patel",
    "Judi Dench"
  ],
  "runtime": 122,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "As the Best Exotic Marigold Hotel has only a single remaining vacancy - posing a rooming predicament for two fresh arrivals - Sonny pursues his expansionist dream of opening a second hotel.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j4PARl3gDpv2K45YAv0tgocLW5K.jpg",
  "categories": {
    "plot": 5.705882352941177,
    "acting": 5.628571428571429,
    "ending": 6.75,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 6.125,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The gang's all back with less comedy and more romance. Dev Patel's charming innocent has turned neurotic, but almost all of the rest, including Maggie Smith, Judi Dench, Billy Nighy and whippersnapper Richard Gere, are bound for amorous entanglements. There's a big wedding that adds some festivity, but otherwise it's a parade of predictable interactions. It's slower and less charming than the original with storylines that aren't as original."
    },
    {
      "rating": "1",
      "text": "Big disappointment.  A stupid sequal.  The Dev Patel character was beyond appointing.  He was totally annoying.  Couldn't;t wait for the movie to end.  Acting was good but dialogue was not nearly as clever as the first picture."
    },
    {
      "rating": "4",
      "text": "When The Best Exotic Marigold Hotel was slotted to be released on the same weekend as Marvel’s new powerhouse film franchise The Avengers, no one thought that Fox Searchlight Pictures’ counter-programming colourful indie would perform the way it did. Adding veteran and polished masterclass actors Judi Dench, Bill Nighy, Maggie Smith and Tom Wilkinson, the original film surpassed all expectations by grossing well over $130 million at the worldwide box office, alas, allowing for the possibility of a sequel and this review.\r Three years later, Dench, Nighy, Smith and rising young star Dev Patel are back for The Second Best Exotic Marigold Hotel in all its foreign glory. Spicy, ill-tempered, and relishing in the highly played escapist appeal of its audience, Second proves that although second servings are always a popular portion, it doesn’t mean they always go down as well as the first.\r The Second Best Exotic Marigold Hotel is a forced, highly improbable sequel with outrageous plot points, a highly glorified dose of glitter, glam and colourful sari’s that could have been left untainted with its original film.\r Jumbling too many sub-plots and not focusing on the greatest issue at hand, Sonny (Patel) – the highly unlikely successful proprietor of the Best Exotic Marigold Hotel – is forced to find ways of expanding his fruitful hotel chain for the elderly and beautiful once the occupancy of his first building has reached capacity. With the help of his trusted and self-loathing business partner Muriel Donnelly (Smith), the two embark to the United States to meet with a successful hotel chain and it’s CEO Ty Burley (David Straitharin). With the warning of an investigator coming to the hotel to judge investment potential and the craziness of the wedding between Sonny and his beautiful bride Sunaina (Tina Desai) looming overhead, Sonny along with the hotels patrons must juggle the arrival of a potential rival and childhood friend of Sonny and Sunaina, Kushal (Shazad Latif), a potentially love-seeking investigator Guy Chambers (Richard Gere), a tuk tuk hit man, and ambitious dreams of the first hotel’s customers.\r Some of the best scenes of the Second are the scenes that do not intend to be funny at all and the ones that are most emerged into the thick of beautiful Indian culture. A scene involving a newly promoted Evelyn Greenslade (Dench) and her trusted fabrics consultant, scenes between the hopeless romantic Mr.Chambers and Sonny’s mother Mama G (Lillete Dubey), as well as some awkward historical dictating between Douglas Ainslie and a young Indian boy are easily among the most charming scenes in the film – the ones that bring you back and offer a reminder of the original film’s charm.\r Dev Patel, who is making a great impression in Hollywood following a very affecting and fantastic turn as Jamal in Slumdog Millionaire, as well as an amazing supporting turn in HBO’s The Newsroom, is enjoying immense success in 2015, relishing the release of not only one film this week, but also his sci-fi project with District 9 director Neill Blomkamp Chappie. The latter is in fact by far the better of the two performances. In The Second Best Exotic Marigold Hotel, Patel plays into so many Westernized Indian stereotypes that were tastefully fought off in his feature film debut. Patel’s fast talking, highly irrational, clutter brained Sonny is a departure from Patel’s talents. Hopefully, audiences will see the potential of his talent in the underrated Chappie.\r Inconsiderate to conflict and adding too much to the characters and the simple plot that could have been developed better in the writing room, Ol Parker should have focused more on the main issues surrounding the hotel and its faithful customers, as opposed to preposterous hits along with returning characters we have no time and patience for.\r While The Second Best Exotic Marigold Hotel shares in its love for the beautiful and under-utilized Indian landscape, the main view centring each and every frame of the film is the story we care the least about. One of the best qualities of The Second Best Exotic Marigold Hotel is its ability to take special moments and make them goofy, depriving all the light-hearted love that so graciously held together the first film. Sadly, it looks like this might be the last time we check into the Best Exotic Marigold Hotel. Unless of course, it makes money. I say, leave this latest unnecessary sequel for a bored night in with some room service."
    },
    {
      "rating": "2",
      "text": "One complaint: 1 or 2 people in a movie are shown to be in love. Fine, but why aren't we given any reason? We are just left to assume oh yes, so and so is falling for so and so?\r Richard Gere meets the Hotel sons mom. They have zero interaction except for a rude exchange. Next thing you know Gere is pining for the woman! That is it...we are shown 1 rude interaction, 1 line spoken, next thing he has a crush!!\r The whole movie is like that. Sorry but this is getting ridiculous...at least some character development please. Just a tidbit at least."
    },
    {
      "rating": "10",
      "text": "The Second Best Exotic Marigold Hotel is more joyous, fresh and funnier than the first one. Dev Patel, who is also starring in the monstrous robot drama- Chappie, gives a great performance. This film is a refreshing reboot from the aging senior comedies, but TSBEMH gives a new look at a whole new meaning at a whole new genre."
    },
    {
      "rating": "7",
      "text": "Overall the Second Best Exotic Marigold Hotel is a film that can best be described as OK.  Let’s face the fact that it was never going to outdo its first film, but it definitely gives it a valiant attempt. the films strongest asset is the cast even if a few feel wasted and i still think this feels like a tourist board version of India ignoring quite a few of the issues affecting India today. but the charaters are what make this movie as flawed as it sometimes gets theseare enjoyable. Would I describe this film as good?  Probably Yes, I would say it was good, it just wasn’t as good as I wanted it to be!!  What propels the film up is it’s cast and decent performances, I just think it could have been slightly better written. I think, given a bit more time and a few changes to the script , this film could have been great.  I will say, however, if you enjoyed the first film maybe you should go and see it at the cinema.  I would personally recommend you wait for it to come out on DVD though, especially considering that I would rather this film not  be a box office success and encourage the idea of making a third film.  Seriously, stop here!!"
    },
    {
      "rating": "10",
      "text": "What a wonderful way to show us Indian culture! I love the bunch of older characters imparting their wisdom on the younger characters as they try to extend their finances into a comfortable retirement and last phase of their lives. Maybe the movie won't win awards, but it's a joy to watch!"
    },
    {
      "rating": "10",
      "text": "The original “Marigold Hotel” was a funny, charming, and perilous adventure that brought together a band of displaced senior citizens hoping to make a life in a ramshackle hotel in India.   The sequel, “The Second Exotic Marigold Hotel” is less perilous perhaps, but equally delicious in it’s finely crafted script, lush locations and delightful performances by a cast of seasoned actors.  This film presumes you know the basics of the original (best to see the first one first.)\r In this one, hotel owner Sonny (Dev Patel) plans to expand with the help of Mrs. Donnely (Maggie Smith) and a U.S. investor.    Sonny believes new guest (Richard Gere) has been sent to check things out.    Most of the hotel guests have started new jobs—Douglas (Bill Nighy) is giving tours,  Evelyn (Judi Dench) is a buyer for a fabric broker.    But of course they all end each day in the twinkling glow of the “Marigold”.\r Sequels are frequently a weak continuation of the original, but this sequel  doesn’t disappoint.  The dialogue is intelligent and genuinely witty enough to make you laugh out loud.   The tapestry of life in Jaipur, India is depicted as less threatening and more colorful than in the first film, making “The Second Exotic Marigold Hotel” a treat to watch as  romance seems to be bubbling up in every corner.\r While Richard Gere may seem an unlikely add-on to this crew of aging hotel guests, you’ll savor every moment Bill Nighy, Maggie Smith and Judi Dench are onscreen.   The film has depth that may be lost on younger viewers, as it drops the occasional poetic nugget of wisdom meant for those who have traveled a bit further in life.\r It’s like going to your favorite restaurant.   You’ll love what’s on the menu,  you’ll enjoy every bite, and you’ll leave happy."
    },
    {
      "rating": "10",
      "text": "Overall the Second Best Exotic Marigold Hotel is a film that can best be described as OK. Let’s face the fact that it was never going to outdo its first film,\r http://bit.ly/1BGVmuH\r but it definitely gives it a valiant attempt. the films strongest asset is the cast even if a few feel wasted and i still think this feels like a tourist board version of India ignoring quite a few of the issues affecting India today. but the charaters are what make this movie as flawed as it sometimes gets theseare enjoyable. Would I describe this film as good? Probably Yes, I would say it was good, it just wasn’t as good as I wanted it to be!! What propels the film up is it’s cast and decent performances, I just think it could have been slightly better written. I think, given a bit more time and a few changes to the script , this film could have been great. I will say, however, if you enjoyed the first film maybe you should go and see it at the cinema. I would personally recommend you wait for it to come out on DVD though, especially considering that I would rather this film not be a box office success and encourage the idea of making a third film. Seriously, stop here!!"
    },
    {
      "rating": "1",
      "text": "One of the worst movies I have ever seen. The plot is simple, slow and boring, the attempted comedy falls totally flat, and the movie overall doesnt make you care one bit about any of the characters. A waste of Richard Gere's talent."
    },
    {
      "rating": "6",
      "text": "The Dev Patel character became an annoying sitcom character in this sequel to the first Marigold Hotel movie.  I like him as an actor but the writers made his character so incredibly annoying it was hard to watch.  Maggie Smith and Judi Dench were great as usual and pretty much saved the film for me.  That, and the scenery and Indian Culture were the saving graces.  Certainly not a great film, but there were enough chuckles to make it a passable time at the movies.  Barely."
    },
    {
      "rating": "7",
      "text": "If it ain't broke, don't fix it! The old adage proves true for this second instalment of the geriatric dramedy that showcases the best in ageing British talent. The whole cast is back as Sunny plans to expand with a second hotel and has an undercover hotel inspector to deal with. Occasionally bordering on farce, its hard to dislike any film that has Dames Dench and Smith trading witty barbs, with the added bonus of silver fox Richard here thrown in. There may be a third instalment - but they'll need to be quick!"
    },
    {
      "rating": "5",
      "text": "This has major tedium, lameness and self-indulgence. Acting might be fine but film is a dud."
    },
    {
      "rating": "5",
      "text": "Visiting “The 2nd Best Exotic Marigold Hotel’ is like spending time with old, emphasis on old, friends who can be annoying and irritating but are fun to be around.\rThe star power shines brightly and it is sheer fun just to see the banter between the two Dames Dench and Smith, who can be cutting to each other but with an underlying tenderness. It is fun to watch Bill Nighy fumble, stammer and stutter in his pursuit of Dench. Along with Ronald Pickup, Diana Hardcastle, Celia Imrie, Tasmin Greig, Penelope Wilton it is always a joy to watch the world of British actors enjoying every word they say as if it is for the ages.\r Though not quite in the Dench and Smith age range the American actors Richard Gere and David Strathairn seem to battling for the ‘silver fox’ title though Dench could give them a run for the title hair wise.\r Dev Patel, as the young and very enthusiastic owner of the original Marigold Hotel, and engaged to Tina Desai, is looking to expand and add a second exotic Marigold hotel and isn’t above using his mother Lillete Dubey as a pawn, thrusting her into Richard Gere’s arms to help the expansion plans.\r Both on screen and in real life Maggie Smith is 19 days older than Judi Dench and is not above using it to win a point or two. Watching these two Dames you hope they will be around a few more decades to entertain us but then the whole cast, the whole picture has only one job here and that is to entertain us and that they do.\r Director John Madden, as he did in the first film, keeps the actors and the action moving, getting out of the way of the actors so the audience can enjoy them as much as he seems to. Ol Parker, the screenwriter, hands one liners to the actors that he knows will get a smile if for no other reason than the way they will deliver them and that they do.\r Taking advantage of Jaipur, India, and the customs of the Indian people, the wedding that takes place provides an easy happy ending and an excellent Bollywood number.\r Like most sequels “The Second Best Exotic Marigold Hotel” doesn’t have the surprise element of the first but familiarity with the characters, plus the addition of Richard Gere, make up for not having that element of surprise.  Add to the satisfaction of seeing superb British actors enjoying themselves, and who actually let you know they are, plus the enthusiasm and chemistry in their scenes will put a big smile on your face."
    },
    {
      "rating": "5",
      "text": "I second TV Jerry's review, which was right on.  I greatly enjoyed the original \"Marigold Hotel\", but was disappointed at this sequel.  The Dev Patel character was way overdone, and as others noted, he was actually annoying."
    },
    {
      "rating": "5",
      "text": "Certainly operating with material that is far below what this cast deserves and relying far too much on the age of the characters for comedy (lol they are old and about to die!), The Second Best Exotic Marigold Hotel is nonetheless a pleasant return to India. Putting the recently amended Stanton-Walsh-Nighy rule to the absolute test, The Second Best Exotic Marigold Hotel gives Nighy very little to do over the course of its two hour runtime, yet he nonetheless steals the show. Is there anything this senior British charmer could not make passable? The fact that he is 67 years old and looks ten years older is truly tragic. God clearly needs to give him the same immortality that he has given Harry Dean Stanton (that man has looked 92 since he was 50). Setting Maggie Smith up to be killed also serves as a reminder of both her and Judi Dench's mortality, which is tragically coming up upon us. Killing Maggie Smith, however, is the death nail in this, right? There can be no The Third Best Exotic Marigold Hotel unless Nighy just takes over running the hotel, right?Less funny than the first installment, watching the interplay between these British screen legends, this time joined by Richard Gere who, shockingly, plays against type as a charming middle aged man that makes middle aged women's ovaries explode (yes there is a line dedicated to this). Really stepping out of your comfort zone, eh Richard? David Straithairn also joins the cast in a small role and, as always, his performance serves as a reminder that, for some reason, he continues to be only able to get bit parts. Aside from Good Night, and Good Luck, when has Straithairn ever been able to really scoop up a majority of the film's running time? Frustratingly limited to what feels akin to a cameo role here, Straithairn nonetheless makes the most of it due to the rapport he builds with Smith in the two scenes in which he appears. For their parts, Smith and Dench once again turn in strong performances and further suggest that this is a film that could have been a classic, but is instead a largely fun, care-free, and rather funny film for your grandparents to watch and recommend to you.On that grandparents note, The Second Best Exotic Marigold Hotel dedicates much of its time to the romance angle, especially that between Nighy and Dench's characters. Operating on the theme that, just because one is old, it does not mean they need to stop living their life, the film's often rather powerful even if its will they or won't they romance between two people allegedly near death is a bit odd. Can these two old folks just get it on already or will the film make us wait for the sequel: The Best Afterlife Marigold Hotel? That said, with all of the reminiscing and looking ahead, the film does manage to be a rather powerful look at how age is not to be seen as a restraint to living one's life to the fullest. If anything, it is the reason to jump unabashed into the night and taking chances because, hey, it is all ending soon anyways.A fun and light film, The Second Best Exotic Marigold Hotel has an excellently charming cast once again, it is a bit spottier with humor than its predecessor, and shows that these tires do have some wear on the tread. That said, as a return to the world of these characters - mainly the actors - is a welcome one with director John Madden able to make this one of those films that seem to defy logic and conventional rating systems. Instead, it is cliche, typical, and wholly unremarkable, but winds up leaving a goofy smile on your face after watching due to the joy expressed on the screen and the tears shed along the way. Though not an unforgettable cinematic classic, The Second Best Exotic Marigold Hotel is a great film to use when wanting to pull the rug out from under your parents or grandparents and beat them to the punch when it comes to recommending this movie."
    },
    {
      "rating": "7",
      "text": "Though it does get muddled in the amount of characters this film is beautiful story with the moral that you cannot control life but rather embrace what you are given. A great message for us all."
    },
    {
      "rating": "7",
      "text": "The first movie is, by far, better than this second, and that's a risk of making a sequel. It was not a bad movie, though, and it is entertaining enough."
    },
    {
      "rating": "7",
      "text": "An enjoyable sequel that effectively does what a sequel should do -- continue the story without resorting to rehashing material from the original. While the film does suffer from a few relentlessly silly plotlines and some blatant overacting, the picture also introduces some interesting new twists and features a standout performance by Maggie Smith. Even though this may not be the best sequel ever made, it does a capable, entertaining and thoughtful job of presenting the next chapter in the lives of a coterie of colorful characters."
    },
    {
      "rating": "7",
      "text": "Well, I didn't see the first one but I assume that it was just as charming as this one. It's really hard to criticize a film like this, populated by all these great, mature actors. 'Nuff said."
    },
    {
      "rating": "2",
      "text": "A truly terrible sequel to an excellent film. Awful acting and an obvious plot together with irrelevant boring subplots. Avoid this crap and watch the first one instead"
    },
    {
      "rating": "9",
      "text": "It is rare that a sequel is as good if not better than the original. With a cast like this one, it is not surprising that it is true for this movie franchise. Let's hope they make a third."
    },
    {
      "rating": "6",
      "text": "Am I the only one who noticed that the \"Hotel Inspector\" plot was lifted from a Faulty Towers episode?  John Cleese and Connie Booth should have received credit as co-writers.  A pleasant enough sequel, but I don't think I'll pay to see Marigold Hotel 3."
    },
    {
      "rating": "7",
      "text": "It is interesting to know more Indian culture in this movie in the Western world perspective. It was quite different from the Bollywood movies.\rFirst of all, I did not watch the first movie so I did not know the background whatsoever. I did quite enjoy the movie. I was shocked to see how naive and childish Sonny with his character. I would be surprised if it is common in India.\rThere are a few couples in the movies and each of them have their stories which make it a little bit hard to follow because several stories being presented consecutively and I feel like each story could expand a more. I know it is a long movie but I still feel something is missing in the story.\rThere is some funny bits in the movie which is quite enjoyable.\rI would recommend to watch this movie..."
    },
    {
      "rating": "6",
      "text": "I was disappointed having looked forward to the second film. The first was so sensitive dealing with the ageing occupants of the hotel and their individual circumstances. The second mainly used the talents of these superb actors to back up a ludicrous relationship between the lunatic owner and his girlfriend - with bits of bollywood thrown in. I would not recommend it."
    },
    {
      "rating": "7",
      "text": "This is a gentle comedy drama film with themes including camaraderie and entrepreneurship. It is obviously a sequel to the Best Exotic Marigold Hotel and it features quite a few of the same characters from the original film. It features some quite pretty indian landscapes and a number of sub-plots, some of which are more interesting than others. I felt it was quite watchable and entertaining, although not exactly major laugh out loud style funny, it was certainly relatively amusing. I think there is something funny, in an observational comedy sort of a way, about seeing British people who are quite entrenched in their ways, having to adapt to unfamiliar surroundings, which applies to this film in as much as Muriel is dragged long, with young entrepreneur Sonny, to the US to try to get financial support from businesses. Lets say she is less than impressed with what she sees there.Its quite light hearted (for the most part) and I enjoyed seeing how the characters various relationships had adjusted and the changes that had taken place since the first film (the sequel is set roughly a few months after the end of the first film). The film features, of course, mainly eastern music, Indian including Bhangra music and the like, which definitely does re-inforce the 'exotic' aspect of the films title.I liked the steely determinism showed by some of the characters - there's something re-assuring about that. Some of the male characters get in a bit of a flap and I enjoyed it, from the point of view that its not necessarily all that often that the husbands find themselves in a tizzy, while the wives (or partners) carry on, headstrong and happy. Whether its a film that appeals more to women, compared to men, I'm not entirely sure - I wouldn't say its utterly a feminist type of a film, that would probably be a case of over-analysing it a bit but I certainly enjoyed it enough in any case. Men aren't exclusively depicted as idiots, so it didn't bother me too much.Cast wise, the film features a couple of new characters, namely Richard Gere as Guy Chambers and Tamsin Greig as Lavinia Beech. I enjoyed their scenes, although they don't feature in as much of the film as you may, perhaps, hope - most of the film features the original cast, including Maggie Smith as Muriel Donnelly, Judi Dench as Evelyn Greenslade and Bill Nighy as Douglas Ainslie. All give decent, solid performances.There are some subtitles present, during scenes involving trade deals, although it doesn't make up the majority of the film, so it shouldn't be too much of an issue. It is also a bit sentimental, perhaps a little too sweet (as in saccharine sweet) for some peoples taste near the end. Content wise, there is little present which is likely to offend or upset people. There is no real strong language or violence present, although one or two minor crude references perhaps but it certainly didn't seem at all frightening or graphic. Due to this, it carries a PG rating - I think it makes for a pretty decent family film, although it may not particularly interest very young viewers due to it being mainly character and dialogue driven, not featuring much in the way of CGI/large scale visual effects.The film has the feel of a Sunday evening TV show - think of shows like 'Wild at Heart' and 'The Good Karma Hospital'. There are no major plot twists that make it too depressing or upsetting a watch and it definitely has that slight uplifting feel common in such Sunday evening viewing, only it features some high profile cast members. It is quite a symbolic film, with some poignant dialogue, much like the first film was/is and I liked that.Yes I'd recommend this film, if you enjoyed the first one then the chances are, you'd enjoy this follow up. Its quite light hearted, amusing at times and not too depressing or upsetting, plus it features some good cinematography. Its probably not quite as funny as the original film but its still a decent watch."
    }
  ],
  "recommendations": [
    "morning_glory",
    "the_best_exotic_marigold_hotel",
    "eddie_the_eagle",
    "the_terminal",
    "paddington_2",
    "the_intern",
    "a_hologram_for_the_king",
    "chef",
    "news_of_the_world",
    "me_and_earl_and_the_dying_girl",
    "the_upside",
    "downton_abbey",
    "hustlers",
    "burnt",
    "moonrise_kingdom",
    "black_widow",
    "true_grit",
    "suburbicon",
    "victor_frankenstein",
    "logan_lucky",
    "lawless",
    "widows",
    "the_longest_ride",
    "hell_or_high_water",
    "groundhog_day"
  ]
}