{"id": 612, "title": "The Kissing Booth", "starring": ["Joey King", "Joel Courtney"], "runtime": 105, "genre": ["Romance", "Comedy"], "description": "When teenager Elle's first kiss leads to a forbidden romance with the hottest boy in high school, she risks her relationship with her best friend.", "releaseYear": "2018", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/7Dktk2ST6aL8h9Oe5rpk903VLhx.jpg", "categories": {"plot": 4.5, "acting": 3.3333333333333335, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 6.5, "action": 5.0}, "reviews": [{"rating": "1", "text": "This movie is one of the most atrocious movies I've seen. This has a horrible plot, yet no starting point, it's literally jumbled up as of right now. I really only like the characters, but the acting is just too much. This movie is really overrated and the script & plot is just messed up. Would NOT watch this movie again."}, {"rating": "2", "text": "The hole movie makes me put my had under the sand, the story is so easy to guess what comes next, there a nearly no funny moments, and when the movie ends you are like, so really i watched this **** movie, with a **** script, and weird actor for this ending. Its just a really forgettable high school movie..."}, {"rating": "6", "text": "\"The Kissing Booth\" é um filme bem cliché, mas devemos admitir que a história do \"meu melhor amigo vs. irmão do meu melhor amigo\" é bastante engraçada.6/10"}, {"rating": "0", "text": "Una de las películas más pedorras de Netflix, trama estúpida y ridícula de principio a fin."}, {"rating": "10", "text": "good movie hot wemen xxoo -hemry i love he bir tts mmmmmmmmmmm i luv juicy very much pls meet me bby kiss kiss luv u"}, {"rating": "7", "text": "It's undercut a bit by the \"oh boo hoo, the problems of extremely rich white kids in LA\" factor and some of the clunky voice-overs, but Kissing Booth manages to win the audience over as a charming and fun romcom that doesn't dumb it down to much for it's audience.  Authentic and worth your time."}, {"rating": "7", "text": "Not too bad of a movie. If you like teen romance it's pretty good. The story was decent. The acting could have been a little bit better though. Overall I'd watch it again."}, {"rating": "4", "text": "It has it's moments, Joey King and Jacob Elordi have great chemistry. It's your typical high school rom-com"}, {"rating": "0", "text": "Esto es una mierda, esto es una mierda me cago en esta porqueria hojala se muera ese hijo de puta"}, {"rating": "1", "text": "The fact that this movie almost exclusively comprised of cliches and poor writing isn't the worst part. That would be how it seems to normalize sexual assault and even tries to romanticize abuse. It's worrying that this was meant for teenaged girls, and even more worrying that it was considered successful enough to get a sequel."}, {"rating": "3", "text": "Otra pelicula con un millon de cliches que ya hemos visto en mil películas mas"}, {"rating": "0", "text": "Just really bad. The protagonist gets sexually assaulted and goes on a date with the guy who assaulted her"}, {"rating": "0", "text": "Really bad movie with terrible characters, plot, messages, and overall writing. The sequel is even worse. I do not recommend it at all."}, {"rating": "1", "text": "Um clichê nada interessante e esquecível. O melhor amigo da protagonista é cafona e parece querer controlar a vida dela a todo instante. O filme em si é bem raso."}, {"rating": "10", "text": "Cvhhhvvxxdxxfgggccucfggg❤️hhvcxccfvhjf. G g f cxxfxxfxf cfcgcgvhvhbhgfddz, sz"}, {"rating": "8", "text": "I believe the director Vince Marcello was able to include a meaningful message within the film that resonated to its intended audience as Elle has a decision to make; listen to her best friend, or listen to her heart. This movie is a stereotypical romantic comedy through and through. However, many ofthe film’s critics believe that it is distasteful and inappropriate. One of the film’s critics, TessCagle of The Daily Dot condemns the film due to “its troubling treatment of the female body”. Inone scene Elle is smacked on the butt and is punished just as much as her harasser. This movie isregressive in the fashion in which they treat situations such as this. When Elle gets the unwantedslap on the butt, she is told that she was “asking for it” by wearing a skirt. For this section of thefilm, I agree with Cagle, and I was disappointed that the film would joke about sexualharassment. However, it did bring to light many real life situations that occur in high school.While it can be seen as disappointing, it should be taken as a learning experience. Parents thatwatch this movie will learn of the troubling situations that happen in high school. They shoulduse it to teach their sons to respect women and to teach their daughters to not stand for unfairtreatment from the school. Additionally, it shows members of society that sexual harassment isstill a prevalent issue in high schools. Parents should see this film to understand situations thattheir children may face. This movie deserves credit for bringing to light this issue instead ofignoring.Cagle also claims that the movie’s “unrealistic representation of high school hinders itsability to accomplish anything meaningful” and I disagree with this statement. Therepresentation of high school is very accurate. When this film first came out, I was still in highschool and I found that many of the scenes that took place in the film were relatable. I foundmyself laughing along to many of the awkward scenes that truly happen in high school, whetherthat be walking into the wrong locker room or awkward confrontations. As a result, highschoolers and those looking for the nostalgia from high school would highly enjoy this movie.Additionally, it showed me that I was not alone in some of the things that I had to go throughsuch as being ignored by a best friend. This movie is reassuring to watch as a high schooler as itproves that everything will work out in the end. This film also sends a meaningful message thatgives people another reason to watch.This film set the theme of making your own choices despite peer pressure. Elle ispressured and controlled by pretty much everyone in the film, from Lee’s rule of not dating hisbrother to her classmates shaming her for dating Noah. I believe that these older critics do notunderstand how much peer pressure can influence a high school student. Elle ultimately makesthe decisions to date Noah because it makes her happy. Elle being able to break away from peerpressure is an important message. She goes against the desires of her best friend and otheropinionated peers and chooses to do what makes her happy. The message that is sent across isthat personal decisions should be made for your happiness despite the thoughts others isimportant for high schoolers to hear. As a result, this movie provides insight to high schoolersthat feel overwhelmed with pressure.The Kissing Booth is a great movie and is more than just a romantic comedy with a happyending. The film allows parents to see the reality of high school. It gives parents a window intothe reality of what high school is like and will allow them to understand their children more.Additionally, it gives students some insight as to how to respond when they are faced with somuch peer pressure. Cagle believes that, “teen flicks usually make adults cringe—and this one isespecially unwatchable”. However, the intended audience is high school students, so it makessense for adults to cringe when watching this film. From the outside, they do not understand theculture and reality of high school. Therefore, this movie is more understood and enjoyable to theyounger population. I know I learned how to deal with peer pressure better as a result of the film.The Kissing Booth is a must-watch for high schoolers looking to gain self-confidence in theirown decisions. This movie sends an important message to high schoolers: in spite of peerpressure and the desire to fit in, making your own decisions, will lead to self happiness."}], "recommendations": ["freedom_writers", "booksmart", "moxie", "tall_girl", "the_miseducation_of_cameron_post", "the_perks_of_being_a_wallflower", "wonder", "boyhood", "college", "fist_fight", "sky_high", "captain_fantastic", "young_adult", "instant_family", "bad_moms", "superbad", "you_again", "the_duff", "the_lobster", "never_back_down", "the_spectacular_now", "project_x", "courageous", "mean_girls", "3_idiots"]}