{
  "id": 3261,
  "title": "The Spectacular Now",
  "starring": [
    "Miles Teller",
    "Shailene Woodley"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Sutter, a popular party animal, unexpectedly meets the introverted Aimee after waking up on a stranger's lawn. As Sutter deals with the problems in his life and Aimee plans for her future beyond school, an unexpected romance blossoms between them.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sTEhMxrL6dCOHB9lzY879kiIfIv.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.388888888888889,
    "ending": 6.875,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Spectacular Now is everything its name implies. Miles Teller does a fine job playing a smooth-talking popular high school senior who relishes only on the \"now\", but I think that it was Sheilene Woodley's amazing performance that did it for me. You can see the hurt inside of these two generally happy people and you witness the vices of the lead character that emanates to the most important people in his life. Definitely one of the summer's best films."
    },
    {
      "rating": "10",
      "text": "What a Great Movie.  It is about young people learning some of the hard truths in life.  It is a movie that is hard to forget.  The acting is superb.  The movie is realistic of life of high schoolers.  Wonderful film."
    },
    {
      "rating": "9",
      "text": "Some of the best acting I have seen in a movie in a long, long time--definitely the best acting I have seen this year. The writing is good, but Miles Teller and Shailene Woodley (particularly Woodley) are so astounding that the characters lift the movie out of what could have been just-another-high-school-movie obscurity. By the end of the film, I was sobbing out of sheer love for these kids, sad to see them go and nostalgic for lovers and friends in high school and college that I recognized. And I'm not exaggerating--I really felt like I knew these people, which is an incredible feat considering I only knew them for only 90 minutes. They are not archetypes. They are not caricatures. These are real high school seniors.\r This movie is truly beautiful. It's a great start to Oscar bid season, and let's just say that I'd have to see MANY more earth-shaking performances from women this year in order to be convinced that Shailene Woodley (at the very least) did not deserve a nod. When I found out that she was also starring in the film adaptation of John Green's The Fault in Our Stars, I jumped for joy. After seeing The Spectacular Now, I was convinced that she was the only actress who could do justice to the role of Hazel.\r Teller, Woodley, and Ponsoldt (director) are all going places, that's for sure. Or at least they better be."
    },
    {
      "rating": "8",
      "text": "A star-making turn for leads Miles Teller (Footloose) and Shailene Woodley (The Descendants) is a refreshingly simple take on the complexities and moving parts of the transition into \"the real world\" and all of its heartbreaks, disappointments, and surprises. While most will comment on Woodley's incredible realism  possibly more attractive without makeup than with  this film is Miles Teller's. He's got the screen presence of somewhere between Joseph Gordon-Levitt and Shia Laboeuf. With fantastic supporting roles from Jennifer Jason-Leigh, Mary Elizabeth Winstead, and Coach Taylor (Friday Night Lights' Kyle Chandler) as a drunk. Its an honest take from the perspective of a high-school partier faced with bleak future and the questions he has to answer before he can grow up. All themes prevalent in a John Hughes film  which is the last filmmaker to accurately depict adolescence with the humor, pain and power of \"The Spectacular Now. Like your first love, this is one that will linger on you."
    },
    {
      "rating": "10",
      "text": "A very convincing realistic take on highschool romance.  I watch a ton of movies, and this movie is original in a similar vein to 500 days of summer.   Atypical focus on the weight that first loves are. The directing, writing, and acting triggered memories of my own early romance."
    },
    {
      "rating": "4",
      "text": "There is absolutely nothing to this movie. It stays flat the entire time. In order to like this film you have to have sympathy for the main character and I didn't because the performance was mediocre. The one thing that pretty much destroyed this movie was that car scene that was extremely unintentionally funny when it shouldn't have been."
    },
    {
      "rating": "9",
      "text": "Shockingly realistic with a cast you grow to love. Brings to bear more substance and depth to characters usually marginalized by their age and circumstance. Beautifully shot."
    },
    {
      "rating": "10",
      "text": "The Spectacular Now is amazing! By far my favorite movie of the year. Great acting all around the board, but there is somewhat of a somber mood throughout. Still, go see it."
    },
    {
      "rating": "8",
      "text": "This is a fantastic look at a teenager who acts like he's in control of his life but underneath he's dealing with issues he can't control.  My one issue with this film is all the drinking I mean every bar serves him without asking a question.  A-"
    },
    {
      "rating": "8",
      "text": "This movie made me flash my whole love life in front of my eyes. Not a fan of the romantic genre, but this movie just did it for me. I like the message of this movie and the realistic take on 'it's what's on the inside that counts'. If you liked 500 days of summer you'll probably like this, they have similarities and probably the best romantic movies of the last 5 years\r Just my opinion"
    },
    {
      "rating": "2",
      "text": "The leading actress was so exceptional in Descendants plus overall reviews for this movie were very good, we had high hopes going in. There was pretty good character development but it starts out with the stereotypical troubled teens/romance type plot we've all seen a million times so naturally we expected there must be some new twist to make this good.  Sadly the unusual or creative twist never came so we thought well then it must have an incredible ending, yet there too we were very disappointed. There's nothing new or interesting here folks so I recommend you stay away and save your money."
    },
    {
      "rating": "5",
      "text": "Do any of these critics have children??? The fact that virtually none of them seem alarmed at the continual, casual teen alcohol use in this movie is ... alarming. The 18-year-old protagonist (who could pass for 14) freely imbibes at parties, bars and clubs, supplementing that with slugs from his personal flask, often just before driving or even while at the wheel. Hey, I know it's not an after-school special. But I found this disturbing, not to mention the almost complete lack of consequences as the intelligent, articulate, supposedly popular (though he has only one friend?) alcoholic boy goes along his merry way. All that said -- extremely nice acting by both of the leads, who do look like real teenagers."
    },
    {
      "rating": "10",
      "text": "This movie is a bit outside my typical range of films I go out and watch but it was suggested to me by a friend. I won't go too into it but the two leads played incredibly. It was as touching as can be and it was surprisingly real. I finished watching the movie and was left with emotions running high for hours after. I honestly kind of want to see it again already. It was that good. Surprised it doesn't have a higher score. One of my favorite movies of 2013."
    },
    {
      "rating": "4",
      "text": "The Spectacular Now is everything but appealing, with the last 20 minutes being a drag. From the script to the acting, it doesn't give you anything to hate but also provides nothing to draw you in."
    },
    {
      "rating": "7",
      "text": "Most romantic comedies exaggerate every single aspect of relationships, to please the collective unconscious who flock to see them despite 99% of them being total  The Spectacular Now does not. It's a very realistic and down to earth representation of two teenage lovers and how they struggle to stay together. No gunfights, no car chases, no murderers and no giant mutant squids. It's very simple and straightforward but also very sweet and charming. I was always interested despite nothing grand or particularly exciting happening, which isn't an easy thing to do. In some places it lagged and my attention was lost, but I was immersed again a few minutes later. Some major events felt slightly forced (but still true to life) and put me off even if they were significant to the movie. Coming from a rom-com loather, who thinks 90% of chick flicks should be erased from history, it was pretty darn good. Not uproariously funny or very exciting but always emotional and interesting. Worth a watch even if you're not a fan of the genre like me."
    },
    {
      "rating": "7",
      "text": "Not to go into too much detail, “The Spectacular Now” was a sweet little treat from indie director James Ponsoldt. Though not so much a directorial showcase, screenwriters Scott Neustadter and Michael H. Weber who penned the highly appreciated “(500) Days of Summer”; do admirable work here. The film’s simple structure hides a heavy story about a popular high school senior and his romance with a ‘less’ popular girl, his interest in finding his estranged father and his struggles with alcoholism. Most of importantly, all these issues faced by our main character Sutter Keely, begs him into reassessing his core philosophy of spontaneity. Such a simple, yet solid film was anchored by Miles Teller and Shailene Woodley (as his love interest); whose chemistry felt absolutely genuine."
    },
    {
      "rating": "8",
      "text": "All of the cast (especially the leads) give top-notch performances in the sensitive, emotional, adroit and undoubtedly spectacular \"The Spectacular Now\"."
    },
    {
      "rating": "10",
      "text": "A film that opens your eyes to the world of love, showing that nothing comes from nothing and that everything will go one way. beautiful beautiful  wild"
    },
    {
      "rating": "8",
      "text": "Many people will compare this to Say Anything, but The Spectacular Now is unique and touching, it's such a smooth portrayal of the tragic and \"fun\" parts of the \"teenage days\". Nice Performances by Teller, Woodley and Larson"
    },
    {
      "rating": "7",
      "text": "Although the film carefully dodges some YA bildungsroman cliches and is bolstered by such compelling performances from its leads, I couldn't help but feel that the story that's left is somewhat underwhelming. At the end I couldn't help asking myself \"Oh... that's it?\""
    },
    {
      "rating": "10",
      "text": "A star-making turn for leads Miles Teller (Footloose) and Shailene Woodley (The Descendants) is a refreshingly simple take on the complexities and moving parts of the transition into \"the real world\" and all of its heartbreaks, disappointments, and surprises. While most will comment on Woodley's incredible realism possibly more attractive without makeup than with this film is Miles Teller's. He's got the screen presence of somewhere between Joseph Gordon-Levitt and Shia Laboeuf. With fantastic supporting roles from Jennifer Jason-Leigh, Mary Elizabeth Winstead, and Coach Taylor (Friday Night Lights' Kyle Chandler) as a drunk. Its an honest take from the perspective of a high-school partier faced with bleak future and the questions he has to answer before he can grow up. All themes prevalent in a John Hughes film which is the last filmmaker to accurately depict adolescence with the humor, pain and power of \"The Spectacular Now. Like your first love, this is one that will linger on you."
    },
    {
      "rating": "7",
      "text": "The Spectacular Now is essentially A24's take on Good Will Hunting. While Good Will Hunting is a better film in my opinion, The Spectacular Now truly brings some new ideas and problems to the table. The portrayal of alcoholism and a kid with a drinking problem who ends up becoming a townie differs enough from other coming of age stories in the same vein to make The Spectacular Now a compelling watch.  Miles Teller and Shailene Woodley are incredible scene partners with great chemistry, and their personal struggles will tug at heartstrings. This is a really good movie in it's own right, and it's the movie that put A24 on the map. It's definitely worth checking out, and it is a must-see for fans of A24."
    },
    {
      "rating": "0",
      "text": "500 Days of Summer is a legendary film , This is boring and nothing new common story with ordinary acting and dialogues.Critic writers may have seen different movie or sold out .Script is poorly garbadge and theirs nothing really to watch.Music also primative."
    },
    {
      "rating": "6",
      "text": "I've read a lot of reviews praising this movie, but I myself don't see what the fuss is about as it seems quite ordinary in every sense and there is nothing special about it. There must be something better to watch and I hope you find it."
    },
    {
      "rating": "6",
      "text": "A good movie but not a great one.  Sympathetic characters, great acting and a good story to tell.  The last 3rd of the movie wanders and the ending seems pasted on like many American movies.  Ultimately worth a watch."
    },
    {
      "rating": "8",
      "text": "ONLY WORD I CAN SAY ABOUT THIS FILM IS THAT I LOVE IT VERY VERY MUCH BY MY HEART..!!!! WONDERFUL  ACTING BY BOTH LEADING ACTOR N ACTRESS..!! i love it,realy touch my heart-i giving 9 out of 10"
    },
    {
      "rating": "6",
      "text": "Miles Tanner (\"21 & Over\") has solidified his screen cred as an actor to watch with this nuanced and charismatic performance as a  high school senior with issues. Shailene Woodley proves that \"The Descendents\" wasn't a fluke with her beautifully subtle and real portrayal of the awkward girl he befriends. While they create a memorable screen duo, the script is a bit slight. In an attempt to underplay the dramatic potential, it lacks much dynamic. Most of the first hour is spent creating their romance, followed by some predictable, yet mild complications. This is all dialogue and character, but the performances of these two young actors is the reason to see the film."
    },
    {
      "rating": "0",
      "text": "The spectacular now was one of the worst movies I have ever watched! the acting and story line was awful and i dont understand those who are giving this movie a 10/10 seriously it was the worst movie ever made! please someone tell me why they think it was a good movie? cause I have no reasons anyone would think it was good"
    },
    {
      "rating": "8",
      "text": "James Ponsoldt's core strength in this film are the characters and the actors who bring it to life. Miles Teller and Shailene Woodley create two people who are trying to find their place in the world. Miles drinks himself to a stupor everyday, in order to avoid dealing with the fact that his dad left, and that he's afraid of being alone once his high school days are over (his micro-universe). Aimee on the other hand is smothered by a family life, that doesn't allow her to dream. In a way, they both end up being a catalyst for each other's lives. This web of relationships is captured in a naturalistic way by the director, who captures a slice of every day life, showcasing the dreams and expectations of the young and the sadness and some disillusionment of the older generation. The two lead actors are fantastic, as is the always great Jennifer Jason Leigh and the underrated Mary Elizabeth Winstead. A very good film worth watching!"
    },
    {
      "rating": "9",
      "text": "Falling in love with this film is made easy by the spectacular Shailene Woodley, a film so captivating that you're not quite ready to let these characters go when the credits start rolling in."
    },
    {
      "rating": "5",
      "text": "I loved (500) Days Of Summer, one of my favorite movies. This movie left me wanting a lot more. I never connected with the characters, felt the \"daddy issues\" have already been done too many times, and how does a kid stay drunk that often (oftentimes while driving). The acting wasn't bad, but I just couldn't wait for the movie to end so I could leave the theater."
    },
    {
      "rating": "9",
      "text": "If you like high school romance films, this is about as good as they get. Miles Tiller and Sheilene Woodley's acting combined with how great the story is will leave you with the buzz feeling you get for hours after you watch a movie that moves you."
    },
    {
      "rating": "9",
      "text": "I honestly loved this one. Coming of age stories are nothing new, but this one feels entirely fresh and authentic. Watching this film felt like watching the actual lives of some small town teens and the things they go through in their lives. Miles Teller is great, as are Shailene Woodley and Brie Larson. As I said, everything here felt authentic and that was in large part thanks to their acting. They all played the roles of high school seniors heading into the rest of their lives very well. The direction is also great and feels very focused. The film is certainly of a slower nature, but so much is happening in the development of these characters and their relationships with one another that it never gets boring. In addition, the relationships between them, the setting, and the cinematography, all contribute to an overall beauty to the film. As a whole, this one is great and easy to watch. Based on what I have seen, it is definitely one of my favorite films from 2013."
    },
    {
      "rating": "6",
      "text": "It's a very charming and excellently acted film, but ends up being too fairytale-like. Aimee, especially, is just perfect in every way and her character really tested my suspension of disbelief. I would have rated The Spectacular Now higher but my final impression was substantially soured by a terrible, didactic ending in which Sutter summarizes the whole story."
    },
    {
      "rating": "9",
      "text": "A teen romance of some distinction. Smart, well acted, moving and very funny. Miles Teller and Shailene Woodley give remarkably fresh performances helped no end by an intelligent screenplay. Teller is utterly charming and Woodley is believably vulnerable (so different from her Descendants turn). At the start of the film I did have some difficulty in catching all the dialogue and at first I wasn't sure if it was down to the actors' delivery or just due to appalling sound. It actually must be the former as once I got used to the performers dialect the problem disappeared. The film is basically about life growing up and all the pleasures and pain that entails. The film's tonal changes are perfectly handled (including one absolutely shocker of a moment that had me literally gasping as it was so unexpected) and the end result is surprising and richly rewarding. It's also great to see Jennifer Jason Leigh back on screen albeit in a thankless mother role. I must say that I went to this film with no expectations and I knew absolutely nothing whatsoever about it. Well, it certainly lives up to its title's adjective as it is spectacular indeed!"
    },
    {
      "rating": "8",
      "text": "Surprisingly, it turned out to be a nice movie, kind of reminded me 'A Walk to Remember'. Yes, it was a romantic tale set in a similar fashion along with a subplot like family issues resolved in a meaningful story. An incredible cast, especially the combination of lead two worked awesomely. These two rising stars showed their worth by giving wonderful performances.\r The movie portrays an unexpected relationship between a charming, popular, but a careless high school boy and an intelligent girl geek. They are totally opposite in character, but shares similar family difficulties and that makes them to hang out. As the times goes on, the relationship thickens with a strong connection. The school nears the end and the future plans are what stands between them tearing apart. How they react to it and what should be done is what brings the movie's conclusion.\r This novel based movie was at its best. A teenager movie that can work even for the adults. A boy who lives in ordinary 'nows' and a girl who plan for a spectacular 'future', together it became a 'spectacular now'. A teen movie with a new perspective and filled with the respectable contents. You can't get a better movie than this where most of similar themes are poured with unbearable commercial elements. This movie deserves a sequel, at least that is what I thought and want."
    },
    {
      "rating": "7",
      "text": "Drinking and Driving is legal nowadays. This movie surprised me, coming in knowing the actor who was going to be in it I had average expectations but he was terrific. They could not have picked a better actress to play Aimee and she played the role beautifully. You actually become really attached to the characters which made this movie much more emotional than I ever though it could possibly be. The worst part of the movie was the two terrible actor/actress who played each others friends, just no need for them. Final rating is 68.9 out of 100."
    },
    {
      "rating": "6",
      "text": "Some terrific acting here, but the script is pretty weak. Both leads are masters in their field; true up and comers in the industry. The connection was their, but the story didn't rise to the occasion."
    },
    {
      "rating": "9",
      "text": "Don't make the mistake of thinking this is some \"coming of age movie\" for teens.  It isn't.\rThis is a grown up movie that I imagine would not appeal to the typical teen/young adult American  demographic.   The characters are complex, the performances outstanding and the story pretty serious and tragic.  This movie is for people who can look back on the foolishness of their childhood.   For those who compare it  to 500 Days Of Summer or Say Anything were simply out of their depth here.\rThe script never hand feeds you the fact that these kids are growing up in a extraordinarily difficult situation and  not really coping with it well.   It's a mature movie for mature people.   And it's excellent."
    },
    {
      "rating": "9",
      "text": "The name of this film is fitting as it truly was a spectacular film. This is a great movie that is wonderfully acted by Miles Teller, Sheilene Woodley, among others. Not since, \"The Perks of being a Wallflower\" have I seen a film about high schoolers dealing with the hardships of life and just be so close to home and realistic. All in all, this is a wonderful film."
    },
    {
      "rating": "10",
      "text": "I LOVE THIS MOVIE!!!! This made it in my top 3 movies of 2013. This movie has no explosions or gunshots so watch it by yourself or with your boyfriend/girlfriend not with your manly buddies. Watch and you won't regret!"
    },
    {
      "rating": "10",
      "text": "the film captures  the sparkling and electrifying  teen romance in this  modern generation, with heartfelt chemistry that a footlose partyer  Miles Teller has with a nice heartwarming girl Shailene Woodley. Based of the young adult book by: Tim Tharp (which i can't wait to read!), and written by the writers  of \"500 days of summer\" the films has it magic. It is emotion and intense film. Grade A"
    },
    {
      "rating": "8",
      "text": "The Spectacular Now was a pretty good movie for a romance (I'm not usually a fan of romance. I probably only liked it because it wasn't ridiculously long like Twilight and its sequels)."
    },
    {
      "rating": "9",
      "text": "The Spectacular Now doesn't shy away from sex or alcohol, but deals with those subjects in a very electrifyingly realistic way. And with all honesty, the movie shows what teenagers do these days."
    },
    {
      "rating": "10",
      "text": "The Spectacular Now turned out to be one of my favorite movies that I've seen. As a high school student, I couldn't help but think about my own journey. The movie felt very genuine and refreshing. It is perfectly directed, including a stunning and bittersweet screenplay. The performances are so great you won't even mind hearing the word \"awesome\" a good 500 times.\r It is simply the best coming-of-age film/teen drama out there."
    },
    {
      "rating": "10",
      "text": "The film The Spectacular Now directed by James Ponsoldt is a Drama, Romantic Comedy mix. One main actor named Miles Teller plays the high school senior named Sutter  who in high school is thought of as the class clown or just a joke is stuck in the high school vibe and wants to stay in the \"now\" and not think about his future. Sutter is an alcoholic and really cant go a few hours without a drink. A day that Sutter and his girfriend break up, he drinks a lot and then crashes on the lawn of a high school girl named Amy. She is a normal girl that doesnt really stick out and with him crashing on her lawn it allows him to talk the way he never talks to anyone at school or at parties. He helps her on the paper route she does to help her mom and that allows him in his mind sort of speak give her that boyfriend experience. By him doing the paper route with her, he helps her and helps him self because he is down about himself without really showing it. The directors made the movie have a realistic relationship between Amy and Sutter. The movie has a lot of stages that effect the realtionship between them. The movie slowly progresses into the relationship and when you watch it, you see that the relationship they have is like the real world. As the relationship progresses on, Amy realizes that she is falling for Sutter but since Sutter is stuck in the mind set he has always been in, he doesnt realize he is in love with her too. Sutter has a divorced family and never talks to or sees his dad. His mom was \"protecting\" him from him but Sutter met him with Amy and went to the bar but his father wouldnt take the time to chat and hangout with his son. His dad went out with this girl in the bar and told Sutter and Amy to meet him back at his place. They waited at his place and went back to the bar after a few hours of waiting, they saw him drinking and hanging out with his friends. Sutter still drinking his whisky went into a deep state and started fighting with Amy. They faught driving down the road and almost got hit. Sutter told Amy that he wasnt good for her and told her to get out of his car. Amy crying and saying sorry to him got hit by a truck driving down the road. They parked on the side of the road with Amy's door facing the road, being hit, she got a broke arm and Sutter realized what he had done. Amy got into college in Philly and stood up to her mom on letting her go. Sutter still in his drinking mind set, didnt go say bye to Amy when she was leaving to Philly and that made her upset but she insisted for the bus to wait so she could say bye to Sutter. After she left, Sutter went to the bar and was saying he had to let her go and he was freeing her. This guy sitting next to him said he was a king and got Sutter even more drunk. At the end Sutter drove home and hit the mailbox. He was telling his mom that she never loved him and that he is just like his father. She hugged him and said he has the biggest heart and loves everyone. At the end after Amy has been in college for a bit Sutter suprises her at the school. They look at each other and still have that connection between each other."
    },
    {
      "rating": "9",
      "text": "The Spectacular Now is one of the best teen films I have ever seen. This film was written by the same two people who wrote 500 Days of Summer and much like that movie The Spectacular Now avoids the film clichés. This film really captures the life of teenagers and young love and I found myself making a lot of connections with it. Miles Teller was amazing as the popular high school senior who lives in the moment and I loved Sheilene Woodley as the cute good heart girl. The two had great chemistry and my eyes were glued to the screen the whole time the two were there together. Both main characters were so likeable and you want nothing more than to see them succeed. That's what makes this film so enjoyable."
    },
    {
      "rating": "8",
      "text": "All of the cast (especially the leads) give top-notch performances in the sensitive, emotional, adroit and undoubtedly spectacular \"The Spectacular Now\"."
    },
    {
      "rating": "10",
      "text": "5/5★ I usually watch teen films with a cynical eye for a few reasons but for the purpose of discussing The Spectacular Now I will mention only two.\rFirst off, its hard to enjoy a film when I'm distracted by the fact that the cast usually looks nothing like most teens I meet, and in fact are usually in their mid 20's and even early 30's (Glee, Grease, 90210) with rare exceptions (Freaks and Geeks, at least part of the cast in John Hughes films.) The Spectacular Now features a cast in their 20's but actually look their movie ages, which leads me to my second point: Appearance.\rIts not unthinkable that a teen should be as attractive, put together and pimple free as so many of these teen oriented films and shows would have you believe but still, most teens don't have stylists and makeup artists polishing their look, so yeah, Gossip Girl and its ilk feel inauthentic to the average teenage experience because of something as basic as looks. Shailene Woodley's bare, makeup-less face is not the only refreshing thing in this coming of age film that has great acting, writing and casting (Bubbles! Coach! Saul!). Most noteworthy of all, the film avoids the clichés usually associated with the genre and is an intelligent study of youth standing on the precipice of adulthood, hesitating to move forward, something most teens can relate to.\rVerdict: Watch."
    },
    {
      "rating": "9",
      "text": "Wonderful film. The only reason it does not get 10 is that the screenplay does not have the capacity. Miles Teller was really excellent, adding wit and drama; but Shailene Woodley's charisma and honesty made this a very personal film, one which carries a message and a memory. We may all perceive this film differently, but a message will be carried by all; a feat few films achieve.\r Watch this film; simply to feel if nothing else."
    }
  ]
}