{
  "id": 4505,
  "title": "The Hurricane",
  "starring": [
    "Denzel Washington",
    "Vicellous Reon Shannon"
  ],
  "runtime": 146,
  "genre": [
    "Drama"
  ],
  "description": "The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eOzbt7KsqTC8gcjJMxcQnr89cxJ.jpg",
  "categories": {
    "plot": 6.384615384615385,
    "acting": 5.625,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Bit overlong and slow but Washington is excellent and the film has some strong moments."
    },
    {
      "rating": "10",
      "text": "It is very inspiring and i thought it was awesome."
    },
    {
      "rating": "4",
      "text": "Denzel once again gives us a towering performance in a film that seems to have the right idea but its execution is utterly shot down because of the side story or should i say stories that develop. The film has some powerful moments but also so bland and relentlessness moments that seem to leave the viewer wondering why wasn't this film any better??"
    },
    {
      "rating": "2",
      "text": "The powerful acting by Denzel is cheapened (indeed, rendered worthless and pointless or worse) by a movie that so quickly deserts fact and omits big chunks of reality. To say that it is bogus and manipulative is NOT an overstatement. I have done some research into the case and Carter's life and personality. One should consider why the Canadians depicted in this fiction no longer speak to or associate with Rubin. If this movie were \"balanced\" and told the WHOLE (\"real\") story it could be a mini-series several hours long --- and be a whole lot more interesting. Denzel deserves a 10+ for his performance, and is the only reason for this \"2\"; otherwise it is a total \"0\" for being manipulative, dishonest, incomplete, and opportunistic. It corrodes our natural good nature. I have an interracial family, have worked with and been formally commended by the Urban League, and have bonded with African-American tenants of mine who are underprivileged and given them lots of helping hands. So, put that into the formula before you think I am dissing this movie out of racism."
    },
    {
      "rating": "10",
      "text": "i love films based on true storys and this is a great and inspiring film . a story of a boxer the hurricane played by denzel washington who does a fantastic job as usual portaying this charicter . its about racisism and a fram up of his charicter committing a robbery and murder and getting wrongfully imprisoned and him writing a book from prison that a young kid who is trying to find his way through life picks up and inspires him to try and do some thing to help washingtons charicter prove his innocense . the movie is paced well and story wonderfully told ."
    },
    {
      "rating": "8",
      "text": "Overall, this one is a very good film featuring a stellar performance from Denzel Washington, as expected. This one is an interesting mix of genres, all of which are used very well. In addition, the film is just very inspirational. At times, it can teeter to being a bit too cheesy, but the most part, everything here is clicking. This one is very moving at times and Washington does a great job playing the sympathetic character and really makes you feel horrible for the situation he found himself in. Now, the film does not appear to be an overly accurate portrayal of facts, but as it is a film, that is too be expected. The only thing that really stuck out that bothered me was there were some things that were odd, namely connections between events that were never made. There are not many of these, but they are crucial enough to be worth mentioning. In spite of that, however, The Hurricane is a very well made and brilliantly acted film that will undoubtedly move you."
    },
    {
      "rating": "8",
      "text": "I have no idea whether The Hurricane was guilty or not (in real life the story was different than presented in the movie), but Mr. Denzel made his \"character\" in the movie lively and sympathetic with his outstanding performance. Overall the story is good and rather staightforward, driven by Mr. Denzel Washington's powerful performance. Worth a look."
    },
    {
      "rating": "9",
      "text": "This is a great movie. Denzel Washington released several classic movies around the time this one came out. Remember the Titans came out a year later. I don't think anyone could have played Hurricane Carter better than Denzel. He's the perfect choice. I already knew the jist of the Rubin Carter's story before I watched the film adaptation but it was nice to get a visual of what it is like to be falsely imprisoned."
    },
    {
      "rating": "8",
      "text": "to, że taka historia mogła wydarzyć się na prawdę mówi wiele o kraju w którym żyję i dodam na marginesie, że nie są to słowa pochlebne."
    },
    {
      "rating": "5",
      "text": "This film is very largely based on the biography of Rubin \"The Hurricane\" Carter, a famous boxer who, during the 1960s, became one of the best names in the middleweight championship, and a serious contender for the world title. Imprisoned for a crime he did not commit and unjustly condemned, he spent decades defending his innocence, yet unable to prove it. The case was well known, and its innocence was defended by people like Bob Dylan, whose song \"Hurricane\" is virtually a leitmotif here.The movie is good, but not as good as I expected. Cinema is full of films in which survival in the prison environment is addressed, with exhaustive references to the inhumanity and anguish felt by those in prison. So far, the film doesn't bring us anything new. The big difference is being a true story, based on a real person, and a book he wrote. Around this story, the idea also develops that the whole life of \"Hurricane\" Carter becomes a symbol of the struggle for black rights and the fight against racism. I'm not sure if that was the case, or if the film is making use of the material at a time when it looks good, and it's politically correct, to approach these themes from this perspective. And from this perspective, the legal battle for Carter's release assumes itself as a crusade of Good against Evil, which is, at the very least, a reductive and simplistic view of things.Denzel Washington is a safe bet for the lead role, although it seems to me perhaps a little awkward for the character: the actor is taller and stronger than the character, and that's something the movie just can't disguise. However, once we get over that, the actor largely compensates us with impeccable work, an enormous dramatic performance, full of depth and commitment. Vicellous Shannon is not far behind and also does an excellent job, although the character is much more accessible. Everything else is much weaker: on the one hand, Dan Hedaya seems to want to embody as much racial hatred as possible, on the other hand, the trio of Liev Schreiber, Deborah Unger and John Hannah try to do just the opposite, emphasizing the racial polarization of the movie: there are no middle, there are good guys and bad guys.Technically, the film has exceptional cinematography and good visual effects, but gives the story and script all the space it needs to shine, without any hindrances or hindrances. It has good sets and costumes, as well as good dialogue and a pleasant rhythm. The soundtrack makes good use of Bob Dylan's song leitmotif, but no longer features anything noteworthy."
    }
  ]
}