{
  "id": 762,
  "title": "The Rental",
  "starring": [
    "Dan Stevens",
    "Alison Brie"
  ],
  "runtime": 88,
  "genre": [
    "Horror"
  ],
  "description": "Two couples on an oceanside getaway grow suspicious that the host of their seemingly perfect rental house may be spying on them. Before long, what should have been a celebratory weekend trip turns into something far more sinister.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3ynPnBXQVT2Y0s19fDIPlWKUlxH.jpg",
  "categories": {
    "plot": 6.571428571428571,
    "acting": 6.75,
    "ending": 5.285714285714286,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Disappointing, and you might feel like you wasted your time. The first two thirds are good. Good character development, effective dialing up of the creep factor. But it's all totally wasted by a wasted final act, once the violence starts. If you aren't picky, give it a shot. Otherwise, you can do much much better."
    },
    {
      "rating": "6",
      "text": "It’s got a fun and tense atmosphere; just isn’t as smart or fresh as it thinks it is."
    },
    {
      "rating": "5",
      "text": "This is the directorial debut of Dave Franco, and stars his real-life wife Alison Brie ('Community', Netflix's 'GLOW'), along with Dan Stevens ('Beauty and the Beast') as a married couple who, along with the husband's younger brother and his girlfriend, decide to get away for the weekend in a cliffside rental home. But things soon start to turn suspicious around them as they sense that someone might be watching them. The film and its cast and premise intrigued me, and the first half of the film started off promising enough, building up a tense and rather eerie tone and atmosphere. However, much to my dismay, the film never really picked up or went anywhere interesting in the second half, as it began to seemingly lose its sense of direction. To cap it all off, the final 10 mins or so were far too vague and left too many unanswered questions, making the film an its ordeal simply feel random and pointless. Overall, the film showed potential to begin with, but the whole thing was pretty much ruined by an underwhelming and increasingly predictable second half that lacks any true thrills, as well as an ending that leaves no motives or explanations to speak of, making it very difficult for me to care about everything that preceded it."
    },
    {
      "rating": "4",
      "text": "This story was a great disappointment. Moderately written characters that sometimes filled superfluous scenes with dialogues that didn't matter. This resulted in a very long build-up to the core of the story. When the tension came, I hoped for more depth from the dangerous person in this story. That did not happen. At the end the film felt like an empty shell."
    },
    {
      "rating": "6",
      "text": "A good entry into directing for Dave Franco. Solid cast, gripping plot line. Genre-normal horror/thriller."
    },
    {
      "rating": "5",
      "text": "The Rental marca el punto de partida para Dave Franco dirigiendo y coescribiendo este largometraje que ofrece una premisa sencilla pero interesante.Dos parejas se van a pasar unos días de relajo a una casa de veraneo y pronto descubrirán que están siendo observados.La película tiene un ritmo bastante tranquilo en gran medida pero no al extremo de sentirse aburrido, ya para cuando empiezan los problemas es donde parece por fin arrancar la historia, pero se siente forzado e incompleto, nunca se llega a saber quien es el susodicho mirón y creo que es lo de menos.Para ser la primera película de Dave estuvo aceptable, pero no pasa por encima de la media porque según a mi juicio hay diversas faltas y fallas, se intenta dar contexto a los personajes, pero en mayor parte dando detalles que son irrelevantes y no ayudan a levantar sus personalidades y erráticas decisiones, sinceramente la única que para mí hizo un trabajo decente fue Allison Brie, que lamentablemente me hubiese gustado un destino mejor para ella.En pocas palabras mala construcción de personajes, un guión poco pulido y un forzado y apresurado tercer acto. Pero al menos entretiene bastante."
    },
    {
      "rating": "0",
      "text": "This movie made no sense and was extremely boring until the last ten minutes and your left with who was that and why did he do any of this."
    },
    {
      "rating": "10",
      "text": "Loved the movie.Marking Dave Franco's directorial debut, this sharp, engrossing horror-thriller gets by with no supernatural elements, relying entirely on scarily believable human behavior and intrusive technology. Working from a screenplay co-written by Franco, Joe Swanberg, and Mike Demski, Franco creates tension right away in The Rental with his human tableaus. Even the (sometimes dark) humor is designed to throw things off-balance. The very first shot shows Charlie and Mina leaning together over a computer monitor in such a familiar, comfortable way that we may immediately assume that they're a couple.Everything in the movie is staged in a way that creates tension and dislocation, from Taylor's underlying racism and his sly way of deflecting it to Michelle being out-of-step with the other three. Michelle is the only one interested in going on a hike, and she takes ecstasy alone on Saturday night, becoming a kind of quirky comic relief and also a catalyst for more disaster. Brie and Franco are married in real life, and he's given her a rich role here that plays to her talents. Plus, Franco manages to comment on technology in a way that's subtle and not overbearing. He doesn't go easy on his characters, and he finds an ending that clicks into place with a true shudder. In essence, The Rental is a must-see thriller, both smart and unsettling."
    },
    {
      "rating": "2",
      "text": "O filme é entediante. Estou aproveitando a quarentena pra tirar minhas próprias conclusões sobre os filme de terror, já que eles são mto mal avaliados em geral. Esse filme é um daqueles que merece uma nota baixíssima. Não prende a atenção, não tem um bom enredo. E o pior.. NÃO ASSUSTA!"
    },
    {
      "rating": "10",
      "text": "Just an all around good thriller. Not as predictable as you would think. Enough character development and individual story lines to ensure you remain engaged through out the duration of the movie. Good ****"
    },
    {
      "rating": "9",
      "text": "Two couples spend a casual weekend at a beautiful rental by the ocean. When the caretaker comes off as creepy, it begins a tense ride with an atypical ending. Even as the characters and their relationships are being established, there are signs that something sinister is impending. When it comes to pass, we're treated to a suspenseful thrill ride of tension and scares. The most impressive part: The first-time director is actor Dave Franco (little brother of multi-hyphenate James). He has a strong sense of effective storytelling and even manages to make the genre's typical tropes work to his advantage."
    },
    {
      "rating": "4",
      "text": "Dave Franco seems to build towards something more valuable; unfortunately, the last act is very lame and nonsensical. The motive he and writer Joe Swanberg is unsatisfactory."
    },
    {
      "rating": "6",
      "text": "This is a different horror film than we’re used to seeing. It’s an independent, short, and simple horror/thriller. I might call it mumblegore since it relies on naturalistic acting of 20/30-year olds and a low budget. It follows a pair of couples staying in a rental house, when they realize something strange and creepy is happening. The film has some things I appreciate like characters blatantly calling out racist characters’ microaggressions and a plot that subverts expectations. However, the film is weak in its motivations and the sense of emptiness it carries. There’s not much going on and some plot decisions are strange and frustrating, in a sense that it ruins parts of the movie. Overall, my favorite part of the film was probably how interesting the montage scene is."
    },
    {
      "rating": "4",
      "text": "The Rental 2020 ★★Watched Jul 27, 2020Luis_989’s review published on Letterboxd:45/100Not all films should make sense. I mean, I'd expect a little consistency, but the sense sometimes tends to slip away.Something like this occurs with The Rental.A film that initially looks like a couples drama but ends up becoming a horror story.In principle it might sound interesting but even considering the short length, The Rental is a story where only things happen because they must happen and then they end abruptly.Zero story development and one-dimensional shallow characters. A recurring note in horror films of this kind.There's sufficient talent in Franco's craftsmanship, and it's going to be interesting to see if he can grow as a filmmaker if he decides to continue doing it, but he needs to make a better narrative management and most of all he'll need better scripts, because when the viewer doesn't care about the characters, nor the poor motives, nor the killer, well, there's very little left to hold on to. Is it a failure? Yes. There's nothing worth remembering in this film, except that it's Dave Franco's filmmaking debut. The rest is as ordinary as it sounds."
    },
    {
      "rating": "5",
      "text": "A shallow echo of all the little edgy thrillers since the 90ies. Alison Brie`s performance is gorgeous."
    },
    {
      "rating": "5",
      "text": "A 2020 horror film based on a deserted holiday home. It turned out to be a mediocre film with all the clichés of a similar style. Of course, stereotypes are relevant again. These include crashing into a tree, catching everyone off guard one by one, the strange landlord, etc. As for the subject; two couples, in which men are brothers to each other, rent a forest house. The goal is to smoke marijuana together and drink. Then the older man gets into the shower with the woman, who is also his business partner and his brother's girlfriend. A day later, they see the camera installed in the shower head. Now we understand that this secret will be revealed.And we have a strange killer. Who keeps rented houses, connects cameras to them, watches them from near the house, and then kills those who rent the house.It is not clear what the man's purpose is.The film can not rise above the mediocre. The characters are all repulsive. There are no sexual elements, except for the lovemaking scene in the shower."
    },
    {
      "rating": "6",
      "text": "فیلمی که تا میانه خوب پیش میرود ولی از جایی به بعد، وقتی راز اصلی برملا میشود، حدس زدن پایان فیلم لو میرود و تصمیم کارگردان برای پایان شخصیتهایش را میشود حدس زد. با این وجود کارگردانی اثر عاری از خلاقیت نیست. کاش حوادث منجر به پایان اینقدر چیده شده، نبود."
    },
    {
      "rating": "2",
      "text": "I just....hmmm. Yeah, this wasn't for me. In my opinion, it didn't have a clear direction. It begins as a drama, a very uninteresting one at that then remembers it's suppose to be a thriller, in the last half. But it's far too late. I was also uncomfortable what they did with the Mina, especially at the opening. So unnecessary."
    },
    {
      "rating": "9",
      "text": "I really don't understand what most of these people are talking about. Once again it seems that neckbeards and basement dweller virgins are negative bombing something the Franco brothers, do out of envy.The movie begins with two couples on a retreat, the characters are genuine, in the sense that we all know people like this (if you have ever had college friends). The movie goes on threough their common and expected issues between couples and friends before it takes several twists and turns that leave you wondering where is this really going to go.After the troubles with the landlord we are left uncertain to his involvement in everything that's happening, and that's when we see the real antagonist, a serial killer who kills, if for nothing else, out of pleasure. This guy is no nonsense, he doesn't play with his victims nor does he take 30 mins to track them down (looking at you Jason Vorhees) and the best part is that, unlike every single other slasher and scary movie, this guy doesn't get killed by some random teens.We later see that this is a regular activity, his MO is shown to us throughout the credits while he takes on other victims.Being filmed, mugged, killed or just be subjected to any kind of danger is something that is always in the back of our minds when we go to a hotel or to an airbnb, Dave takes this fear and shows us the worst csse scenario.My only criticisms are first, that there are some scenes that feel too much like fillers, I feel that there could've been a bit more character development and second, some of the suspense sounds were a bit too much for me, it made it feel cheesy."
    },
    {
      "rating": "5",
      "text": "Two couples rent a place, there's some cheating, it's caught on a hidden camera and then, the guy who's spying on them turns out to be a serial killer for some reason."
    },
    {
      "rating": "6",
      "text": "A decent horror / thriller movie with flaws. Most of the cast did a good job, while I see the part with the killer as the weakest. It just feels incomplete. I would call this a movie worth to watch, but not worth to watch again."
    },
    {
      "rating": "4",
      "text": "Predictable, cliched horror film that adds nothing new to the genre. There is nothing terribly wrong with the film, but it also has very little going for it.It doesn't interest me enough to write a proper review.In a word: forgettable."
    }
  ],
  "recommendations": [
    "the_autopsy_of_jane_doe",
    "i_see_you",
    "the_beach_house",
    "the_invisible_man",
    "identity",
    "the_night_house",
    "alone",
    "the_forest",
    "gothika",
    "the_call",
    "winchester",
    "the_skeleton_key",
    "cold_pursuit",
    "the_mothman_prophecies",
    "the_lodge",
    "oculus",
    "a_cure_for_wellness",
    "run",
    "lights_out",
    "before_i_go_to_sleep",
    "the_howling",
    "escape_room",
    "brimstone",
    "bad_times_at_the_el_royale",
    "the_little_things"
  ]
}