{"id": 4753, "title": "The Trust", "starring": ["Nicolas Cage", "Elijah Wood"], "runtime": 93, "genre": ["Crime", "Thriller"], "description": "A pair of cops investigating a drug invasion stumble upon a mysterious bank vault.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/q0bjJiN7CzW0qbNajGPYIRF83qr.jpg", "categories": {"plot": 5.75, "acting": 4.6, "ending": 6.4, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "2", "text": "There are certain actors and actresses whom I will watch in anything they release, Nicholas Cage is one of those actors. Even in the worst movies, he always gives a strong performance and I enjoy watching him work, but even the Academy Award winning actor couldn't save The Trust. Cage plays Stone, a lifelong cop still on the bottom of the pecking order. Luckily for him, he's paired with the much younger Waters (Elijah Wood), another cop with few aspirations. Together they don't make up a team of elite crime fighters, so on their off hours, they're small time criminals, and as it turns out they're not great at that either. One day while investigating a case, they notice a safe in the evidence room and decide to bust it open, what's inside leads them into a mess of police corruption. For starters, this movie doesn't make sense! Everyone talks in riddles, it's impossible to know who is on what side, and most important of all, what's the point? If these guys are corrupt cops, why do they care so much when they discover that they aren't the only ones? They're losers who don't care about anything, until they find out there are other bad cops, then all of a sudden they are Starsky and Hutch? I love the cast, but between the riddles, the constant twists, and the strange dialogue this film was just a mess, and pretty much unwatchable."}, {"rating": "1", "text": "Thriller about two dirty cops (Nicolas Cage, Elijah Wood) who pull off a heist. Dark, weird, and in serious need of suspense... but does not outright suck. A good thing for a movie starring Cage these days.Still, even at its meagre 91 minutes, it feels longer, because of the slowness and nothing really elevating the general lethargic feeling. Some of the critics like at least some of it, mentioning dark humor, smartness and oddball charm. Me, I'd compare it to mediocre student project."}, {"rating": "5", "text": "About trusting a prankster for a risky job.\r It was so much better than I anticipated, but the end ruined my party. It was the right time I saw it, because I haven't seen any heist films recently. It was not like any genuine heist theme, but still I kind of enjoyed it for being a slightly different, especially the first two acts. It is about the two cops, actually they're part of the police department, but from a different division. When they discover a huge illegal money belonging to a cartel gang after going through the police file, they plan to hit it and disappear forever. But as the title indicates, the trust is what lacks between them. In the third act, the pace picks up rapidly and brings a twist in the tale before the credits begin to roll.\r Two wonderful main characters with a decent story, but I don't know about the cast. I kind of felt there was a vast age gap between them, like an old man teaming up with a teenager. Obviously worst chemistry, but that's the point, if you understand the title very well. Both the characters were completely opposite, like one was a very confident person, but a prankster and the other guy were a hopeless, but serious about everything. Just like a wolf and a sheep together planning to rob a farmer. When it was going good, like I said the conclusion spoilt the overall product. Other than that it is an okay film.\r 5/10"}, {"rating": "5", "text": "Cage and Wood both give solid performances but the film is all over the place.  From scene to scene you're not sure what's going on or if it makes sense for the characters.  C+"}, {"rating": "7", "text": "In this cop thriller Elijah Wood and Nicolas Cage are really trying their best but, with a scenario less than original, a predictable story and the wooden acting by the rest of the cast, they can't save that movie completely.The Trust is just another cop drama/thriller with an entertaining last half hour and a boring first hour that people will soon forget."}, {"rating": "6", "text": "An okay movie, the plot was lacking, Nicholas Cage can be such a good actor - I don't know why he takes on these dumb roles, the ending had a twist but unsatisfying."}, {"rating": "10", "text": "Solid heist movie with a unique twist at the end. Good performances from both leads, a return to form for Nic Cage and Elijah Wood as the sort of disillusioned stoner that you've always imagined he's like in real life. The cinematography gets interesting in the last third (heist part) of the film. Definitely worth a rental, don't know if I'd buy the Blu-Ray."}], "recommendations": ["the_little_things", "out_of_time", "the_town", "those_who_wish_me_dead", "man_on_a_ledge", "snitch", "safe_house", "the_call", "the_taking_of_pelham_1_2_3", "killer_elite", "parker", "unhinged", "good_people", "the_commuter", "the_next_three_days", "the_loft", "cellular", "a_walk_among_the_tombstones", "the_frozen_ground", "live_by_night", "honest_thief", "3_days_to_kill", "contraband", "reasonable_doubt", "21"]}