{"id": 530, "title": "The Hangover Part III", "starring": ["Bradley Cooper", "Ed Helms"], "runtime": 100, "genre": ["Comedy"], "description": "This time, there's no wedding. No bachelor party. What could go wrong, right? But when the Wolfpack hits the road, all bets are off.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/vtxuPWkdllLNLVyGjKYa267ntuH.jpg", "categories": {"plot": 4.033333333333333, "acting": 3.5, "ending": 5.290322580645161, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.927536231884058, "action": 3.5}, "reviews": [{"rating": "3", "text": "Uggh...not a good movie.  Never got the negative reviews from Hangover II as I still found it funny despite it being a \"Remix\" to the first Hangover.  This one has a brand new plot, not recycled, however it is just not funny.  Found a few laughs but overall it is easily the worst of the trilogy."}, {"rating": "3", "text": "\"What should have been a finale instead felt like a waste. The Hangover Part III, dares to try something new and actually falls flat, with no motivation, no interests, and more importantly, no comedy. it's a lukewarm finale to our beloved wolf-pack.\" ..D+"}, {"rating": "3", "text": "The joke has irrevocably worn out.  This time around, they even forgot to make a comedy but instead they went for a thriller that has a couple of jokes (all of which you can see by watching the trailer)."}, {"rating": "1", "text": "This movie wipes out all humor from the first two movies. By the time it ends you've come to the conclusion that Alan is a certified mental patient who should be locked away and that Chow is really an evil murdering, criminal.  Even the \"jokes\" remind us that Stu could have AIDS but never cared enough to get tested and that Alan's selfishness led to his Father's death. Its a morbid film with very, very few laughs."}, {"rating": "2", "text": "A disapoitment. You just get the feeling that the filmmakers really had no idea, what to do with the third movie. Two or three scenes were funny and that was it."}, {"rating": "3", "text": "I don't know what I expected after the worse-than-the-first-movie sequel and all the trailers to this one. Perhaps, funny jokes, more screen time devoted to Doug (Justin Bartha), and less to Zach Unpronounceablakis and the Chinese moron... Of course, all of that was quite silly of me, the series dropped the bar even lower. In fact, this isn't even a comedy any more, but an action/adventure movie with some humorous moments. The opinion of this movie is basically based on your opinion of Zach Whateverakis and his character. If you, for some awkward reason, liked him in the previous parts, this movie may very well entertain you. If you didn't, like me, and hate his utter bloody stupidity, then you'll be mostly bored with this movie. It's watchable, but I wouldn't recommend spending your hard-earned money on it."}, {"rating": "1", "text": "Before I watched this people told me \"It's better than the second anyway.\" So there was born my expectation of a slightly mediocre film as the second to me, was just, a stocky attempt at rehashing the first...no more, no less... However. This was not better than the second. Not by a long shot."}, {"rating": "4", "text": "Comedy approach to Ocean's Eleven, so horrible they used well-written characters to  themselves up so bad as if you're watching a new Family Guy episode. However, there is value in watching Alan grow and become a man."}, {"rating": "5", "text": "The wolfpack still doesn't have the same feel as the first Hangover, but its main goal was to show it could revive itself from Hangover Part II and it totally did. Sure it might not have been very funny, but it added a weird psycho dark twist to the series. The critics are haters, Part III was bad but not that bad."}, {"rating": "3", "text": "Not very funny at all. Really its not. It just tries to be but the steam on this train ended about halfway through number 2. Watch it and try laugh and enjoy it."}, {"rating": "5", "text": "DO NOT leave The Hangover Part III when the credits start to roll.  You’ll miss one of the funniest scenes in the whole movie.  I work at a movie theater, and after every single showing of the movie I watch as impatient audience members rush for the exits only to miss the movie’s ridiculous stinger scene.  Hold your pee for two more minutes (You don’t even have to wait until the credits are completely over, as the scene comes in after only about 30 seconds of credits).\r Unfortunately, for those who do make haste for the exit doors (and I can’t say I blame you for doing so) The Hangover Part III  will be remembered for being…well…forgettable.  It’s not a bad movie.  It just isn’t a very funny one.\r Read More    http://www.recomedia.net/filmtv/the-hangover-part-iii-review/"}, {"rating": "3", "text": "The wolfpack returns for the last couple of drinks of the final trilogy of The Hangover, Part III. After the disappointment of The Hangover, Part II that the sequel wasn't that great for the audience, now there's another disappointment that the third film is getting less that wasn't that funny or even entertaining. The story is about Alan (Galifianakis) is moving away from his father's death and his three friends Phil (Cooper), Stu (Helms), and Doug (Bartha) are planning to take Alan to intervention at Arizona. Little to know that the drug dealers including Marshall (Goodman) wants revenge for the Wolfpack because Mr. Chow (Jeong) is escape from prison at Thailand and steals the gold from his men. Three men are chasing the most annoying stereotypical character at Mexico and they think will agree to work with Mr. Chow's plan. Three men are returning back to Las Vegas and do same rehash over again like the first one including Stu's old wife, Caesar's Hotel, and more that came from. The characters are awkwardly unfunny and Alan turns into a stupid selfish person since the last movie that he did all over again to make huge mistakes. The Hangover,"}, {"rating": "5", "text": "Zach Galifianakis is the focus of this final installment in the decreasingly funny series. His over-the-top behavior has the other Wolfpack members taking him off to rehab…until John Goodman appears and sends them on a quest to find Mr. Chow. Instead of the \"how did we get here?\" scenario that fueled the first two, this one comes off as a mediocre heist. While there are amusing moments (thx mostly to Zach), the whole enterprise lacks the outrageous originality of the others."}, {"rating": "8", "text": "the second hangover felt old and unoriginal and the third feels even\rmore so but it still made me laugh more than most comedies out there.\rThere were lots of memorable hilarious moments even though they were\rtreading on the same common ground. Zack galifikanisiicis delivers the one liners and Chow is back with a big part and made me laugh quite a few times. Sure it feels the same and we all want more but as far as comedies go the point is to make you laugh and this movie achieves that more than most other comedies and for that I feel its a success. The ending actually makes you wonder what a fourth movie would be like with the addition of a new character."}, {"rating": "3", "text": "In \"The Hangover III,\" the mystery comes from a reinvented formula; there is no wedding or missing groomsman. No actual hangover to speak of, and a lack of scenarios fueled by alcohol from which to recover. Instead, the film is produced as more of a caper than a comedy. Despite not being 'good' movie: a litany of crude humor that becomes repetitive that falls flat for a majority of the film, the third act does provide a few moments of genuine charm and appeal. And yes, this is a real stretch, but I'm trying.\r The latest misadventures by the antisocial man-child Alan (Zach Galifianakis) cause buddies Phil (Bradley Cooper), Stu (Ed Helms), and Doug (Justin Bartha) to stage an intervention. But on their way to hand deliver Alan to a mental health clinic in Arizona, they experience an intervention of their own. The group is captured by crime kingpin Marshall (John Goodman), who needs their help in tracking down the fugitive Mr. Chow (Ken Jeong). Mr. Chow stole $21 million in gold bricks from Marshall, and pressing the \"Wolfpack\" into service may be the only means of recovery. In the meantime, he'll hold Doug for safekeeping.\r \"The Hangover III\" is the most sentimental, (hence the finale), and yet the darkest of the franchise where the eccentricity doesn't always work as well as it should. To it's credit, there are some escapades and plot twists along the way (from Tijuana to Vegas), and it's never out right boring, all set to a bizarre soundtrack that incorporates Hanson, Danzig, and Schubert.\r You get the feeling director Todd Philips would rather be making a straight-up action movie, as opposed to creating a string of comedic episodes. The onscreen disaffection of Bradley Cooper and Ed Helms reeks of paychecks already spent, leaving Zack Galifianakis to fill the void with material that works better around the margins. Ken Jeong reprises his role as a lunatic criminal with the bare minimum of effort. He appears more animated in the Bud Light commercials when compared to this outing. The post-credits epilogue does provide a truly twisted array of images, a fitting send-off for a series recognized as being the highest-grossing R-rated comedies of all time. This is in fact the end  and it is what it is. We've had some good laughs. Let's part amicably."}, {"rating": "4", "text": "so the Hangover trilogy closes with \"The Hangover Part III\". i loved the first \"Hangover\" movie, it was hilarious! \"Part II\" was okay, but it wasn't as good as the first movie and it was just a rehash of the first one. so now, in 2013 they gave us \"The Hangover Part III\" where Alan's the main character this time. and Phil, Stu and Doug are taking him to get some help cause he's turning into an **** now, then they run into a gangster played by John Goodman who takes Doug and he's like \"Find me Chow or Doug's dead!\" and that's premise of \"The Hangover Part III\". what i liked about this movie, it's that they had the balls to take a different direction with this one, instead of rehashing it (like the second movie did). but, you'd think they'd put in better jokes to make it funnier, right? unfortunately, it's not really funny this time. it just feels like a dark heist movie of just them trying to find Chow. sure, it does have jokes and i did chuckle a few times in the movie, but the problem is that the jokes in this one fall completely flat and it's not really funny anymore. also, Alan used to be the lovable idiot in the first 2 movies, but in this one, he's a complete **** i get that they were trying to have a subplot of Alan growing as a person, but when you change his character for a different subplot in the movie, that doesn't fit and now Alan's an unlikable douche bag. and Chow used to be my favorite character in the first 2 movies. he was a hilarious Asian baddie that always had me dying in laughter (especially in the first movie). but the problem is that here he's an idiot like Alan and he's not really that funny anymore. and they kept hammering in the fact that Chow's outta his mind. okay, we get it! Chow's crazy, we get it! please, stop shoving that down our throats! as a whole, \"The Hangover Part III\" was a let down cause i was actually expecting a improvement over \"Part II\". but apparently, it's not. and i gotta say, i laughed more in the second movie than i did here."}, {"rating": "2", "text": "If you love these actors looking at each other not entertaining  or doing anything you may like this film. But if you expect an exciting or funny film, you will be extremely disappointed. Yes this does tie up the trilogy but in the worst way possible."}, {"rating": "4", "text": "If you are looking for a movie which just makes you laugh & has no storyline then this is the perfect movie for you. However when you consider the 1st and even the 2nd Hangover movies in comparison to this movie then it is awful.\r It has tried too much to relate to the first movie which if it was done correctly would work very well. However it has not been done correctly. I would recommend watching this film, but more than once would be pointless."}, {"rating": "2", "text": "Woah! Pump the brakes Todd Phillips! Yes, \"The Hangover\" was funny. That doesn't constitute making that same movie over and over again. The jokes have now been over done, and I don't know if I'll ever be able to re-watch the original without being reminded of the garbage that followed. Even \"Due Date\" felt like a carbon copy of \"The Hangover\". Try some originality my friend. Definitely #skipit"}, {"rating": "3", "text": "This movie is a disgrace to the franchise as there simply is no Hangover I thought that there would be  another wedding for the fat guy as in the end he gets married anyways"}, {"rating": "0", "text": "Wow, I thought being a Friday night, I would sit down with my two kids, 9 and 12, and watch hangover 3, we saw the first two and thought they were funny.  Who in their right mind thinks it's funny that a giraffe loses it head on the freeway.  It just goes to show how sick society has become, especially in the U.S.A, where so much violence is except-able, that this can be classed as comedy.\rWith no encouragement from me, my two kids did not want to continue watching the movie and I don't blame them.  If there is a fourth hangover, I will not buy it and I hope I'm not the only one who feels this way."}, {"rating": "2", "text": "People try to tell me that \"Hangover III\" is a good one  guess what. It isn't. Odie Henderson wrote that it's more like \"Alain's Eleven\" and that actually nails it. Besides of that fact, it has nothing to do with a \"Hangover\"-movie at all."}, {"rating": "10", "text": "I think its fun to watch.Really a great movie to watch.Alan doing a great job.excellent to watch ...i think todd doing great and should be proud of himself."}, {"rating": "10", "text": "This was an absolutely amazing film, I couldn't stop laughing throughout. Full of many hilarious and awesome scenes. Definitely watch it, as well as the first 2 movies."}, {"rating": "0", "text": "Biggest disappointment I have seen lately, the title does not even fit the movie. The plot of the hangover movie is usually the guys gets drunk and have to find a missing person they have lost. This is nothing like it, the title of this movie shouldn't even be hangover it should be manhunt, because that is what the movie is about.. The movie is about the guys chasing down Chow to pay a debt to some criminal in order to save Dough. The movie was not remotely funny, it was just awkward and cheap."}, {"rating": "3", "text": "Very boring. At least The Hangover Part II had laughs despite the fact it was a carbon copy of the first. This film may have had 3-4 laughs at best. Of course the best ones was anything featuring Megan McCarthy. The characters don't even seem like themselves after the first two movies which could be a result of the actors not wanting to be involved with the movie which showed on the screen. The plot was half way decent I will give it that, but as soon as the gang heads to Las Vegas it becomes aware that the film makers did not feel comfortable diverting from the formula too much so they headed to a familiar location. Avoid like the plague!"}, {"rating": "5", "text": "Not a terrible movie, but it is a comedy that's not funny.  I liked the main characters and the story played more like an action heist movie then a comedy.  My main problems with the film are it is a Hangover movie and no one is Hungover and Chow gets annoying, he needs to be used in smaller doses."}, {"rating": "3", "text": "I liked Part 2 enough. At least it was decently funny. This 3rd film is just a lazy heist film more than a comedy, and just doesn't have any of the heart, fun or laughs that embodied the first film. I can't stop you from seeing it, but please wait for DVD."}, {"rating": "3", "text": "It’s the final Hangover to deal with for the Wolfpack, four years after the original film was a surprise major hit at the box office hit making its stars household names in the process the team have reunited to finish what they started. The second film was met with mix reviews, some claiming the film was just the same recycled plot and jokes from the first one and many giving the film rave reviews clearly happy to have more of the same from the WolfPack. Director Todd Phillips has been insistent that this final entry in the trilogy will be different and not another rehash of the first film again. Has he lived up to his promise or is it just the same film for the second time?\r Well yes, to give its film its credit the film does deviate from the tested narrative that has been used in the previous two instalments adopting a crime narrative in which Stu (Ed Helms), Phil (Bradley Cooper) and Alan (Zach Galifanakis) have to track down the infamous Mr Chow (Ken Jeong) in order to rescue Doug (Justin Bartha) from a crime lord called Marshall (John Goodman). This plot inevitably sends the group to Las Vegas, whilst tying up all the loose ends that you didn’t even remember from the previous films, such as who Alan bought the drugs from in the original (From Marshall). Most of these tying up loose ends are very unnecessary and feel as if they were just added to tie the film back the original in order for them to have some reason to return to Vegas.\r Given the new premise you would think that the film would capitalise on this and take the series to a interesting and hopefully hilarious finale, they sadly do not. The humour is still the same gross out OTT humour as in the first two instalments, possibly a tiny bit more restrained but they more than make up for that in the final post credit scene (more on that later). John Goodman who even in a film as bad as it could be would still be entertaining is great in his minor role as Marshall is criminally underused and you beg for him to have more screen time then he actually does, criminally underused.\rThe films main problem is the increased role given to Ken Jeong as Leslie Chow, he was fine in the first film as he was only on screen for a grand total of 10 minutes and his wacky/camp persona was tolerable. In the second he had a greater role and became irritating very quickly, however in this he has equal billing with the rest of the cast and is intolerable including, It’s the same joke’s over and over again (including the classic small penis gem from the second film) and even though Jeong looks as if hes enjoying himself it just seems this film is just a tester for a Chow spin off.\r Where as in the first and second film the cast seemed to be having fun and at least enjoying themselves, in this film it’s clear that no one cares about their performance and is there simply because they are contractually obliged to be in this film. The performances are all phoned in especially Bradley Cooper who looks as if he’s on autopilot for the film, hoping that doing this won’t damage his Oscar chances in the future.\rThe film ends on a climatic note at Alan’s wedding and it seems that the series has reached its conclusion, but then comes a post credit scene that makes the entire film incredibly pointless, A scene plays in which all three members of the Wolfpack wake up after Alan’s wedding in a destroyed room, including the monkey from the second film, Stu with breast implants and a naked Mr Chow who alleged sent them a drugged wedding cake. This is terrible for the simple reason that this is the final film in this series and this ending just contradicts the whole film in order to make two or three cheap gags that have been made consistently throughout the previous two films.\r In conclusion, Hangover Three attempts to try something new but turns into a bit of a mess recycling jokes and clichés from the first two films, the cast are gliding through this film waiting for it to finally end and they can move onto new projects. This will probably be the last time we see the Wolfpack (until a horrendous remake in 10 years time) and it has to go down as a missed opportunity for the franchise."}, {"rating": "4", "text": "There are a few laughs in the film, and it's great to see these actors together again, but the entire affair is just flat and lacks forward momentum.   The first Hangover is a modern comedy great, along with Wedding Crashers, Bridesmaids and Old School.  It's very tough to make comedy sequels that work, though.  Even the credits sequence wasn't all that funny  but stay for it and see for yourself!"}, {"rating": "3", "text": "I think we all were going to see Hangover 3. No matter how good or awful it turned out to be. And thus it was created. Hopefully it stop here. Anyone expecting the comedy of the original will be sorely disappointed. The director it seems to have realized his big mistake in basically re-shooting the hangover in Bangkok and calling it a sequel. Though props go to the drug dealing monkey.\r The result is something that meanders between being a heist film and a gross out comedy. They do a good job of making the characters more human after hangover part 2. As other have said Zach Galifianakis really dominates the wolfpack in this one. Both in terms of being central to the story and screen time. Also Ken Jeong who is elevated from bit character to full on bad guy or good guy depending how you look at it.\rDue to a back story of events that barely make sense an over-serious John Goodman kidnaps Doug (no. really?) thus kicking events off. Unlike hangover 1 and 2 they aren't even drugged this time and it is unclear what past sins they have committed to deserve such punishment. Especially Doug. Poor guy gets so little screen-time for being such a big part of the plot. It could have been an interesting direction if he came along for one of their crazy adventures. He could have been the \"straight\" guy horrified by the things the wolfpack has become used to.\r There are laughs to be had though. And at least one pair of boobs to be seen. Though FYI you have to wait for the credits and you will regret it. Overall a low end comedy still sitting in the shadow of a much better original."}, {"rating": "7", "text": "Better than the second, but doesn't live up to the first (though anything like that will be incredibly difficult to recreate). If you like any of The Hangover movies, you'll certainly enjoy this one. The tone definitely takes a turn, and becomes more darker and awkward with Zach Galifianakis (Alan) and Ken Jeong (Chow) leading the crew. Make sure to stay after the credits too, just a few seconds after the film's end lies the funniest moment that had my jaw dropped for a moment. The cast is all really solid, and I really was intrigued as the plot went on. There is a little bit of drag and the comedy comes to me as small laughs rather than huge gags or hilarious one liners. The critics definitely aren't fans of this film, but to me, I left the theater feeling pleased. It's a solid end to The Hangover series and Wolf Pack, and much much better than went I left after viewing it's predecessor; Hangover Part II."}, {"rating": "5", "text": "Let me start off by saying this. The first one was hilarious. The second one is lame and unoriginal. This one was not as good as I thought it would be. I honestly expected this one to be better. But sadly it's just bland. It's not even a \"Hangover movie.\" It's a rescue movie done with a dentist a school teacher and a complete idiot that we all know and love. The characters are the same, except for Alan. He literally becomes a complete butt-hole in this movie. He's not a retard with idiotic charm, he's a straight up butt-hole. I mean he was funny, but his new perception just made not like him the way he usually is. It is weird how no one in this movie gets hung-over. I mean seriously. It's a Hangover movie for God's sake. But the one thing I absolutely loved most in this movie is the giraffe scene. Oh my God, I laughed so hard at that scene. If your going to go see it, just watch the giraffe scene. But overall, there were definitely laughs for sure, but it's really not the same old stuff that you'd want to see."}, {"rating": "7", "text": "THE HANGOVER III\rThe Hangover III  was directed by Todd Phillips (The Hangover) and stars Zack Galifianakis (The Campaign), Bradley Cooper (Silver Linings Playbook), Ed Helms (The Office), and Ken Jeong (Community).\r In this reportedly final installment of the Hangover trilogy, the Wolfpack has an intervention for Alan (Galifianakis) after he causes a horrific accident and shuts down a major freeway. They set out on a road trip to a rehabilitation center in Arizona, but their journey is interrupted by an angry gangster known as Marshall, played by John Goodman (The Big Lebowski).  Marshall has tracked the Wolfpack's old nemesis, Mr. Chow (Jeong), back to Alan. Marshall forces the Wolfpack to find Chow in order to retrieve millions of dollars of gold that Chow has stolen from him.\r Thankfully, the makers of this film did not rehash the first Hangover like they did in the sequel. It has a unique storyline and ties in pretty well with the other two films in the series. It starts out with some big laughs, but fails to cause the riotous laughter throughout the movie like the original.\r Zack Galifianakis and Ken Jeong are the main focus of the story and are responsible for nearly all of the humor in the film. There is one scene where Galifianakis and Melissa McCarthy (Bridesmaids) experience love at first sight and it results in one of the best scenes of the movie.  Ed Helms and Bradley Cooper's characters, while along for the ride, seem almost non-existent in this film.\r I did find myself laughing throughout many parts of the movie, but at other times I became bored with the story. By then end, I was slightly disappointed. I couldn't be too disappointed compared to how bad I thought the second Hangover was. This one is far better than the second, but not near as good as the first.\r If you do venture out to see this movie, make sure to wait for the scene during the credits. It is undoubtedly the funniest part of the movie.\r You will probably think this film is okay if you liked the first Hangover, but if you liked the second one, you will love it.\r My Grade for this film: B-\r To view a breakdown of my grades, go to: facebook.com/CriticWes\rTo view my movie blog, go to: http://www.mix93.com/pages/16393587.php?"}, {"rating": "10", "text": "Better than The Hangover part II but not as good as the original. My real grade for this movie is 9.5. If you really like The Hangover franchise you should really see this movie."}, {"rating": "4", "text": "The first 40 minutes are terrible and only gets slightly better by actually becoming an action film. It carries a darker more serious tone that doesn't have the pay off as the first film but succeeds in being better than the second, if you call that an accomplishment."}, {"rating": "8", "text": "As long as you don't take anything too seriously in this movie you will have a good time. All of the movies are great but it is still stupid comedy and if you are expecting some spark of genius from a hangover movie then yes you will be disappointed. Saying that, I'm glad I went. It is hard not to laugh at the groups crazy adventures and hangover 3 was a fitting end to the story."}, {"rating": "9", "text": "If you liked the previous two you'll love this one.It definitely has  a unique spin from the previous too.And just when you think it over at the end just wait a bit your in for a surprise!"}, {"rating": "3", "text": "The movie tries to take a different direction from the previous, but it only makes it unfunny, silly and really boring. Still, it's nice to see Galifianakis."}, {"rating": "8", "text": "Not nearly as good as the first one, but certainly funny!"}, {"rating": "9", "text": "Despite the critics, this is a very good way to end the wolfpack trilogy; especially the after credits scene. I hope you enjoy it the way i did. Bye!!"}, {"rating": "10", "text": "A hilarious end to the trilogy, far exceeding the second installment. Nothing can top the original, but this comes pretty close. I was very pleasantly surprised by this given how negative some of the reviews are. I highly recommend seeing it- it will certainly be well worth your money."}, {"rating": "9", "text": "Glad to see the producers take a different approach on this one. I felt hangover 1 and 2 were good but since 2 was so closely delivered as 1 that people over looked it. Hangover 3 was hilarious! I was laughing the whole movie. Galifianakis (Alan) and Jeong (Chow) kept you surprised by their adult humor. Also nice twist at the end you didn't ever think would happen coming into the movie."}, {"rating": "10", "text": "Zach Galifianakis  just awesome\r Wolfpack is Back\rDEFINITELY WORTH YOUR MONEY\rI'm very pleased that they are now back in Vegas\rHad something more than my expectation\rShouldn't be over"}, {"rating": "10", "text": "IGNORE THE REVIEWS. The movie is hilarious. I saw it in a packed cinema and everyone was laughing throughout! It is a different, darker approach to the trilogy and it works! Its the perfect balance of sinister/hilarious. The Hangover is usually centered around Stu but now it's Alan's movie and the change pays off. DEFINITELY WORTH YOUR MONEY, THIS METACRITIC SCORE IS AN ABOMINATION!!"}, {"rating": "8", "text": "Not as funny as one. But still better than two. This was a good end to a good trilogy. Pacing was kinda slow at times and they still showed to much in the previews. But not enough to where all the jokes were told. Only real complaint is no ending pictures."}, {"rating": "10", "text": "The wolf back is back and even better than before. I'm very pleased that they are now back in Vegas. This was really good and I am very happy about it"}, {"rating": "9", "text": "IGNOR THE REVIEWS.This movie does not deserve a 1,2 or a 3 it deserves a 9,8 or a 7.The hangover part 3 is better then the hangover part 2 absolutly.I think people hate on it beause there is no hangover till the very end for me it is good beacuse it adds a good change to the trilogy.this movie foccues on mr.Chow and Alan.This story is funny and you will have so many laughs while you watch the film.I DO NOT GET WHY THE CRITICS HATE THIS MOVIE!!!!!!!.THIS MOVIE DESEVES A 7 LIKE THE FIRST ONE NOT 33 LIKE THE LAST AIRBENDER THE MOVIE GOT 22 BUT THAT MOVIE WAS AN ABOMINATION AND PURE  BUT THIS MOVIE IS ADICTIVE FUNNY AND  SILLY.I DO NOT GET YOU CRITICS NO MORE YOU GIVE THE CHERNOBYL DIARIES A 32 AND THAT MOVIE IS JUST PURE EXTREME  AND GIVE THIS MOVIE A 30 THAN YOU ARE JUST STUPID.TODAYS CRITICS DO NOT HAVE LOVE TO FUNNY MOVIES OR EAVEN GAMES HOW CAN YOU GIVE SAINTS ROW 2 A 72 AND SAINTS ROW 3 A 84 YOU JUST  IT UP SO HARD THAT I WILL NOT LISTEN TO YOU NO MORE I AM IN RAGE MODE NOW!!!!HOW CAN YOU HATE THIS MOVIE HOW I DO NOT GET IT?????????\r TIS MOVIE IS WORTH YOUR MONEY GO AND SEE THIS MOVIE IGNORE THE RETARD CRITICS AND GO SEE IT YOU WONT REGREAT IT I GUARANTEE"}, {"rating": "9", "text": "this epic conclusion to awesome franchise. i dont agree with crtic there just being trolls. this movie awesome. chow and allen are better than ever just buy it"}, {"rating": "6", "text": "Overall, the movie was quite a bit amateur and childish, but it's still funny and quite a fun movie experience. The plot was a bit weird and there was too much unfunny Chao, unfortunately. Don't get me wrong though, this movie is still worth your time."}], "recommendations": ["the_hangover_part_ii", "ted_2", "venom_let_there_be_carnage", "night_at_the_museum_battle_of_the_smithsonian", "identity_thief", "anchorman_2_the_legend_continues", "baywatch", "22_jump_street", "little_fockers", "a_million_ways_to_die_in_the_west", "this_is_the_end", "tusk", "21_jump_street", "dinner_for_schmucks", "zombieland_double_tap", "30_minutes_or_less", "entourage", "rush_hour_3", "zoolander_2", "deadpool_2", "the_happytime_murders", "thor_love_and_thunder", "horrible_bosses_2", "neighbors_2_sorority_rising", "coming_2_america"]}