{"id": 2017, "title": "The Iceman", "starring": ["Michael Shannon", "Winona Ryder"], "runtime": 105, "genre": ["Thriller", "Crime", "Drama"], "description": "The true story of Richard Kuklinski, the notorious contract killer and family man.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/56KPE9tPYh2WBdnUMq9EIOwEXGQ.jpg", "categories": {"plot": 6.733333333333333, "acting": 7.090909090909091, "ending": 6.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "10", "text": "There was a subtle development of a character I couldn't imagine possible with a figure like Richard Kuklinski.  the performances were uniformally excellent.  The writing and directing were especially strong.  Kudos to Michael Shannon...if he's not nominated for an oscar, there's no justice."}, {"rating": "10", "text": "WOW!  I really liked this film (that's why I gave it a 10 out of 10!).  The gritty story is interesting as can be thanks to the outrageous true story of Richard Kuklinski, the famed contract killer, but the real heart of the film is the amazing performances from the entire cast.  While it's awesome to see David Schwimmer do a role he's never done before (and do it well), Ray Liotta play the same character he always plays (but do it well) and see Chris Evans--Captain America himself--play a killer in an ice cream truck, the best part is watching Michael Shannon once again prove that he is one of the best actors of this generation.  He's no stranger to intensity but the level he brought to this film is enough to warrant my score!"}, {"rating": "9", "text": "Its essentially The Iceman Tapes - The Movie. But its well done and this michael shannon bloke is well cast. Be sure to search kuklinksy on youtube after you've watched"}, {"rating": "4", "text": "Beyond a disappointment.  Shannon is a major talent, but he had a very flawed script to work with. There is zero empathy for the lead character. You could care less if he cares about his family, he's such a ridiculous psychopath and not clever enough to be interesting.. And the script, it sets up Ray Liotta's character as the antagonist and the narrative makes you want a climax between him and shannon, but you never get it, instead you get melodrama asking us to try and feel sorry for a psychopath who killed over a hundred people.... Skip it."}, {"rating": "2", "text": "So UPSET!! I have been dying for this movie to finally come out after I read the book some years ago. this movie was such a let down. left so much out and the stuff that was in was not even true or close to it. terribly disappointed. nothing like the book at all! will never understand why directors change from the book so much! decarlo should be turning in his grave for this disservice to him! I really wish that I did not see this movie at all! they even tried to make you feel sorry for the \"Pollock!\" I mean he was never sorry for anything he did, hence the name ICEMAN! grant it, maybe not everything that was in the book was true, but damn if they only followed half of the book it would have been a great movie! this movie seemed rushed, they skipped over so much and left out even more! if you read the book and you enjoyed the book, DO NOT go and see this movie then!!! you will be so disappointed as I am! what a crying shame!"}, {"rating": "8", "text": "The Iceman does a good job of exploring Richard \" The Iceman\" Kuklinski, although there's some spotty storytelling, but this works and it's all thanks to its lead.Micheal Shannon embodies one of the most ruthless killers in history and he does it convincingly, he just takes over the screen and demands full attention, his presence in menacing and dark, Shannon always had that mysterious psychopathic feel to him and he just hits all the marks here, I would have loved if he was backed by say a better plot but he made this film work just fine."}, {"rating": "7", "text": "Between 1964 and 1986, Richard Kuklinski killed as many as 250 people for the mafia. His cold, callous style and willingness to do anything, earned him the nickname, The Iceman. In 1992, The Iceman granted HBO an exclusive interview, where he talked about his life and described his crimes, the way someone would describe their job. This film is the dramatization of Kuklinski's story, based entirely on what he said during his interview. Boardwalk Empire's Michael Shannon stars as Kuklinski and was absolutely the perfect choice to play him. Some actors, even ones like Shannon,  seem to be destine to play certain characters, it's how they make a name for themselves. Shannon is often knocked for being too cold and emotionless in his other roles, so he was essentially the perfect choice to play the Iceman. Shannon is paired with Winona Ryder and all these years later, she still manages to annoy the hell out of me. I really don't get what people see in her. The cast of this film is rounded out by some terrific cameos, by the likes of Ray Liotta, James Franco, and David Schwimmer, all of whom are terrific and add to the mystique of this film. I really did enjoy this film, but it is confusing and somewhat slow at times, slower than you wouldn't expect a film about a mafia hit-man to be. This films throws so many names at you and jumps from scene to scene and time to time so quickly, that it is a little difficult to keep track of who's who. Other than that, the performances are terrific and it's amazing how they were able to piece together a film from a simple interview, definitely worth checking out."}, {"rating": "4", "text": "I agree that it's rather disappointing. The acting is fine  Shannon was great as the lead and his supporting cast is good as well. But the story is just god awful, It's a near 2 hour film and yet there is no sense of fulfillment what so ever. It doesn't go anywhere and that is the real killer of this movie. I mean it's watchable but that's about it."}, {"rating": "5", "text": "Going in, I was completely unfamiliar with the story of Richard Kuklinski. The Iceman outlines a predictable mafioso who hides his wrongdoing from his family. Aside from an awkward performance from David Schwimmer, The Iceman features a somewhat memorable portrayal of Kuklinski from Michael Shannon."}, {"rating": "8", "text": "It's lovely to go see a film where I know nothing about it. Such was the case with the Ice Man  a wonderful, brooding film which never panders to the audience. You get to judge whether Kuklinski really loved his family and did all the killings so he could support them or if he was simple always going to be a killer.\r Michael Shannon is fantastic in the lead role  incredibly intense when required, his final scene showing the more vunerable side to a man who seemed to reveal in his image as an ice cold killer. He's backed up with some good, under-stated performances from a solid supporting cast. Chris Evans in particular makes good work of his role as a fellow hitman.\r Feeling very much similar to some of the more nihilistic crime movies of the 70's, The Iceman was a great surprise. Not to everyones taste, but engaging to the end."}, {"rating": "7", "text": "Overall, it is hard to not characterize this one as a minor disappointment. I wanted to love this one so much, but just cannot. I mean, Michael Shannon absolutely kills (heh) it in the lead role and the rest of the cast is full of big names and great performances from Winona Ryder, Ray Liotta, Chris Evans, and David Schwimmer. It had all of the elements that should make this one great, but beyond the acting, it was very underwhelming. The film felt very ambitious, but in the ambition, it very much fell short. The script is eh at best and the film, as a whole feels very, very brief. The story is very interesting and, as I just said, the performances were great, but the film feels better suited for a television series than a movie. There is a lot of depth here, but the film just sort of covers the surface and fails to properly develop all of Kuklinski's relationships. As a film, it is nothing more than ok with great performances. If this were a television series (with a better script), it could have made for some fantastic television."}, {"rating": "7", "text": "Good entertaining movie.  Ray Liotta's performance as a gangster was spot on as usual.  Also like Winona  Ryder's performance was great as well.  Not the depth of a Goodfellows but still well worth watching."}, {"rating": "9", "text": "The low score yet again leaves me little faith in professional reviewers.  Excellent performances all the way around.  Wynona Ryder can still act and the ice cream killer may be Chris Evans best work.  Not perfect but close to depicting the dual life that the iceman somehow pulled off for so long.  I actually saw the documentary years ago and it is almost as entertaining as the actual interview with Kuklinski.  Highly recommended."}, {"rating": "7", "text": "Director Ariel Vromen brings the sordid, grisly, and grotesque details of hitman Richard Kuklinski's life to the big screen in \"The Iceman,\" a chiller that's as much a mob movie as it is a deeply unsettling study of a truly disturbed mind. But does it go deep enough into the titular man behind the stone cold face? Sure, Michael Shannon's performance is appropriately stoic and, given the actor's propensity for using such traits to his benefit, this makes him worth the watch alone. But I would have liked to see a bit more effort trained towards the \"why\" rather than the \"how.\" Indeed, this is an entertaining watch, but also a tad safe as well."}, {"rating": "6", "text": "\"The Iceman\" is an unremarkable, yet competent biopic of its title character, Richard Kuklinski, providing only a limited insight into what made him one of the most prolific hit men in history. Claiming to have pulled off over one hundred hits to his name, Richard Kuklinski was a legendary mafia contract killer known for his intimidating stature, and his cold-hearted, nonchalant approach to his craft. \"The Iceman,\" based on a true story, is a fairly standard biopic that is only exalted beyond mediocrity by an imposing performance from Michael Shannon. Shannon's commanding performance is clearly the centerpiece of the movie, as he effortlessly exudes a cold-hearted confidence as a genuine, psychopathic hitman.\r Richard Leonard \"The Iceman\" Kuklinski was a Polish-American contract killer who worked his way up the chain of command, eventually landing a position as a hit man for the Gambino crime family. The 6'5\", 300 pound \"Iceman\" claimed to have murdered over 100, or possibly 250 men (his recollections varied) between 1948 and 1986. Amidst all the murderous mayhem, Kuklinski found the time to marry and have two daughters as well, while successfully keeping his job as hit man a secret from them. Set primarily in the 1970s New Jersey, the film unfolds via episodic segments, chronicling Kuklinski's early beginnings editing porn movies and the marriage to his wife Deborah (Winona Ryder), to being recruited by the Gambino family by mob boss Roy Demeo (Ray Liotta), and finally his inevitable capture and conviction.\r Kuklinski was an impenetrable individual, and Shannon is first-rate in a suitably complex performance. Shannon bounces back and forth between family man and maniacal murderer with a sinister ease. Kuklinski exhibits an array of methods utilized to complete the task at hand, along with his trademark, freezing his victims for months before disposing of the bodies.\r An unusual collection for a supporting cast does a fine job overall. Chris Evans plays Robert, or Mr. Freezy, a cold-hearted killer who drives an ice cream truck who also works for the mob. James Franco plays Marty, a prospective hit. David Schwimmer plays Josh, Roy's right-hand man, and Stephen Dorff plays Richard's estranged, imprisoned brother Joey. Shannon does his best with the limited material, and Ryder gives a good performance as Richie's oblivious wife.\r Regrettably, a thin, all too familiar script of standard mob stories that span over decades undermines all efforts. The movie never offers anything new that hasn't been seen before, and the finale just kind of happens without much of a buildup. Unfortunately, besides seeing just how many era-appropriate hairstyles and beards its characters can model in one movie, this telling of Richard's story seems to care more about the body count above all else."}, {"rating": "5", "text": "Despite a good performance from Michael Shannon in the title role, and some entertaining scenes here and there, THE ICEMAN isn't really worth a recommendation. It's completely underdeveloped, a 2h 30min film screaming to get out of its 1h 45min run time, all topped off with uninspired, cliche crime dialogue."}, {"rating": "7", "text": "A pretty good movie. Acting was really good but everyone which kept me into the movie. It did get a bit slow at times. It was cool that this is a true story and after watching it I wanted to research more about it as I found it really interesting."}, {"rating": "6", "text": "Michael Shannon does what he does best in this and bring great intensity, but he can't save this movie with it's half baked, disjointed story."}], "recommendations": ["black_mass", "all_the_money_in_the_world", "the_fugitive", "primal_fear", "arbitrage", "insomnia", "the_judge", "a_few_good_men", "catch_me_if_you_can", "breach", "state_of_play", "steve_jobs", "from_hell", "american_hustle", "the_lincoln_lawyer", "donnie_brasco", "casino", "wall_street", "as_good_as_it_gets", "mystic_river", "king_richard", "ghost", "daredevil", "legend", "lawless"]}