{
  "id": 3046,
  "title": "The Day the Earth Stood Still",
  "starring": [
    "Keanu Reeves",
    "Jennifer Connelly"
  ],
  "runtime": 104,
  "genre": [
    "Drama",
    "Science Fiction",
    "Thriller"
  ],
  "description": "A representative of an alien race that went through drastic evolution to survive its own climate change, Klaatu comes to Earth to assess whether humanity can prevent the environmental damage they have inflicted on their own planet. When barred from speaking to the United Nations, he decides humankind shall be exterminated so the planet can survive.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mrw9NShY6I2FgXwk8Ge437pn08N.jpg",
  "categories": {
    "plot": 1.6470588235294117,
    "acting": 1.8823529411764706,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 1.0,
    "familyFriendly": 2.0,
    "funny": 6.4,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This was quite a bit better than i had expected. Thematically updated for the world's current parlous state. Keanu Reeves is well cast as Klaatu. Maybe not the classic of the 1951 original but still watchable."
    },
    {
      "rating": "1",
      "text": "The beginning of the movie seemed to be going somewhere but honestly this movie was terrible. What were the people making this movie thinking honestly? They have known what people would think of this film. Just terrible. Even worst than War of the Worlds. Don't waste your time seeing this."
    },
    {
      "rating": "2",
      "text": "Terrible movie. I give it a 2 for Jennifer Connelly and Keanu Reeves who did their best with the horrible script and some decent cgi. I thought Jaden Smith was acting bad and more importantly..annoying and distracting as hell. He might be cute for comedies with his funny hair but he can't do dramatic scenes with subjects like losing a parent. There a lots of better child actors out there. His character was useless and distracting for the movie. But that is also the fault of the screen writer and the director. Ever heard of pacing?? And also ever heard of the audience sympathizing for at least one of the characters?? Avoid if you can. Dumb remake with unsympathetic characters including a very irritating Jaden Smith."
    },
    {
      "rating": "1",
      "text": "I really don't get how you can 100 million dollars on a movie and then have a complete idiot write the script. Why,o why, would you greet our first interstellar visitor with a bullet and \"enhanced interrogation\" techniques?"
    },
    {
      "rating": "2",
      "text": "Boring movie. If they had edited down to a 30 minute short it might have been exciting."
    },
    {
      "rating": "3",
      "text": "The only thing I really appreciated were the special effects. But Keanu Reeves simply can't act. The end is so bad, I really didn't like it. Plus, there's absolutely nothing to say about the story, it' quite boring."
    },
    {
      "rating": "2",
      "text": "One of the five worst (not worse) films of 2008. Pathetically dreadful. Only character of interest was John Cleese.There needs to be a movie remake committee somewhere that can stop a green light on this crap!"
    },
    {
      "rating": "1",
      "text": "A one for special effects, now the real part of the movie review, im a fan of the 1951, and keanu is good in sci-fi, BUT jenifers staring & wonder at this great alien & his robot is not enough to say this has epic action, just the opposite. They Fail miserably in the movie is with GORT, simply they dont stop him like in the original or really even try too, He only stares and has less screen time then Darth Maul did! enuff said!"
    },
    {
      "rating": "4",
      "text": "I went there expecting to see a action/sci-fi war of the worlds type film when it turned out to be boring,unfrilling and average Iv'e only seen it once and never agian."
    },
    {
      "rating": "1",
      "text": "Awful is an understatement. There was no suspense, a poorly written script, and no character development. Even when they had the opportunity to do something out of this world the director missed the opportunity as he seemed to color his picture by the numbers. How can you take a classic and turn it into this garbage. Avoid."
    },
    {
      "rating": "4",
      "text": "For a movie about the destruction of the world it sure was boring. At the beginning upon first arrival there was a curiosity as to the plot, but after that the movie progressed at a lackadaisical pace (Note: I never saw the original so for those who did and know the story line you might be bored from the get-go). The special effects were pretty boring and there weren't that many considering this is an 'end of the world' flick. Honestly, if you want to be more entertained go back and watch Independence Day or even War of the Worlds. They both blow this one out of the water with better special effects, cooler aliens, a grander scale, and a movie worthy of worldwide annihilation. P.S. Only thing I liked about this movie was the old school robot, but he barely got any screen time."
    },
    {
      "rating": "0",
      "text": "Dreadful film that is slow moving without any character development. With just a little imagination it could have been so much more. An embarrassment to share the same title as the 1951 classic. Keanu Reeves sleepwalks through his role. Terribly disappointing."
    },
    {
      "rating": "0",
      "text": "Pretty lame flick without any suspense. It was so bad I started laughing at some of the dialog. Keanu Reeves is a joke. Who makes these things? Idiots?"
    },
    {
      "rating": "1",
      "text": "One of the worse movies I've ever seen. The movie totally betways the intended story line. More time is spent discussing the live of the main femail character and her inter-racial son than the story line. The movie fails to caputre your interest, the acting was extremely bad. I urge you to never see this movie."
    },
    {
      "rating": "4",
      "text": "Ouch! This movie is barely worth renting. The movie itself was very far from its former self from 1951. It lacked key phrases that the original did. Might I add that dialog and the basic plot are really the only thing you need to copy when remaking an older movie. 4/10 and I'm being generous."
    },
    {
      "rating": "1",
      "text": "This is possible the worst movie ever made. It was worse than The Day After Tomorrow and the Core put together. The script is terrible, the best actor is the large sentinel thing and worst of all, nothing happens! The worst bits of hollywood mega \"event\" movies distilled into one big mess. Rubbish"
    },
    {
      "rating": "0",
      "text": "Lame. No sane investor could ever sanction the money they spent to make this ridiculous film unless they wanted to go broke. No bailout for this crapola."
    },
    {
      "rating": "0",
      "text": "Basically, this movie is about Global Warming. With a terrible subject as it's foundation, and horrid story poorly draped over it, this movie had no chance. The CG even looked bad."
    },
    {
      "rating": "0",
      "text": "What have we become? To even call this movie by the same name as the black and white classic is an insult. For those of you who liked or even loved this movie I would suggest that you rent the original and then you will understand how terrible a movie this is. You need to check your brains in at the door as there is nothing suspenseful or interesting. Keanu Reeves must have a death wish because this is as bad as it gets. Horrible flick."
    },
    {
      "rating": "0",
      "text": "To those of you who are taken in with the childlike computer generated special effects who don't know any better, I suggest you watch the black and white 1951 original classic. Then you'll understand what a good movie truly is. This remake is total garbage not worthy of being mentioned in the same breath with the original."
    },
    {
      "rating": "1",
      "text": "See what happens if you don't listen to me? That was me Al as GORT. I had as big a part as I did as VP. Yeah the movie makes no sense and after about a half hour in you realize you have been taken. Those diamond mosquito's are now on the endangered list. LOL"
    },
    {
      "rating": "0",
      "text": "One of the worse ever seen..."
    },
    {
      "rating": "0",
      "text": "One of the worst sci-fis of all time. Story doesn't make sense, terrible dialogue and bad acting. Jaden Smith can't be cast in another movie. That is nepotism. Boy CANNOT act!!!!!! He ruins every movie he's in."
    },
    {
      "rating": "4",
      "text": "Boring. Other than one brief scene with one of the characters being snatched up by a helicopter, I found this movie to duller than dishwater. Very disappointed."
    },
    {
      "rating": "2",
      "text": "Cannot believe how bad this is. The interrelationship between the robot and Klatu never explained? The day everything stood still?? The famous line we all ran around saying to each other as kids? eeves was well cast -- a part requiring no acting fits him ever so well. A massive demonstration of Hollywood bungling. Special effects do not a movie make. I need to rewatch the original to purge any memory of this from my mind."
    },
    {
      "rating": "0",
      "text": "The begging quesion is Keanu Reeves alive. More importantly does anyone care? This may be one of the worst most boring movies of the year. A definite contender for a Razzberry."
    },
    {
      "rating": "3",
      "text": "It was ok until the anti-climatic ending when the world is lift with a bunch of dead metal bugs and no power."
    },
    {
      "rating": "4",
      "text": "Bland remake left me wanting to go home and rewatch the original. Save yourself the time and buy the Blu-ray instead."
    },
    {
      "rating": "4",
      "text": "not bad at all, but I wouldn't call it \"amusing or exciting\". Instead it was a bit boring."
    },
    {
      "rating": "4",
      "text": "Tries to be new, tries to pay homage to the old...fails at both. Acting is fine. Keanu doing his best Bill Pullman as an emotionless alien. The script is just weak, no drama. The music...forgettable. Another \"Why did they remake this?\""
    },
    {
      "rating": "0",
      "text": "The plot makes no sense, the script is illogical and the acting is poor. The kid adds nothing to the story or the mood of the movie. What's particularly sad is that the film makers didn't seem to get the idea of the original, fabulous, movie from the 50's. There's a reason that the original is a kind of cultural icon--it works on many levels, it's entertaining. With virtually no special effects beyond those implied by the story, the power involved was clear. In this new version, Keanu seems sometimes to have extraordinary powers, sometimes not. He never seems either smart or wise."
    },
    {
      "rating": "0",
      "text": "Walked out! Terrible acting. Played-out storyline."
    },
    {
      "rating": "1",
      "text": "Keanu Reeves was going for a terrible Arnold Swartssnagger (spelled wrong srry) theme with his acting. You couldn't tell if he wasn't trying to act or if he was trying to hard."
    },
    {
      "rating": "4",
      "text": "Could've been good or at least entertaining. Pacing was bad. Script was bad. And the direction would've been better under someone closer to a Spielberg. The sid estory and the kid was annoying and out of place. Poorly executed overall."
    },
    {
      "rating": "3",
      "text": "Sad sad remake of a great movie. Lame updating, and the messege get conveluted. The filmmakers took one of the greatest robots of classic scifi and completely screwed it up. Sad sad movie."
    },
    {
      "rating": "0",
      "text": "What happened? seriously... did the original make sense? cos this one didn't... from what i could understand it appeared that aliens came to earth to kill everyone then halfway through decided to take pity on humans and left the planet, leaving us without any form of technology as punishment or something. a 40/100 is definitely more than it deserves."
    },
    {
      "rating": "3",
      "text": "The plot is flawed. and acting is so rigid that any emotion is lost. keanu reeves proves yet once again that unless he has a shades on he is terrible."
    },
    {
      "rating": "2",
      "text": "Predictable and pushing a green agenda."
    },
    {
      "rating": "1",
      "text": "Thank you Keanu Reeves and thank you 20th century fox for ruining a classic."
    },
    {
      "rating": "4",
      "text": "The Day the Earth Stood Still based on the old classic, shows that whatever you do you can never make a remake that is better then the original. But the one thing in this movie that really surprised me is that they didn't say one swear in the entire film. It's a miracle in every PG-13 movie there has to be at least one swear in this there were none. Also another thing about this film that I didn't like was the over the top plot. That was the only thing that really bothered me. The acting was alright the special effects were fascinating, I thought it was pretty unpredictable so overall it was a nice rent it movie. Sure some parts were weird but it still had it's cool clever scenes. I feel like this movie would of been better of not being made because Scott Derrickson wasted his money making this remake it just wasn't worth it."
    },
    {
      "rating": "2",
      "text": "Exemplifies all that is wrong with Hollywood films: an unnecessary remake, an overwrought script, and a director too enamored with special effects for their own sake. Utterly lacking in every department. Charmless."
    },
    {
      "rating": "1",
      "text": "One of the worst movies ever. Nevertheless, not the worst."
    },
    {
      "rating": "2",
      "text": "Politically correct non-sense!"
    },
    {
      "rating": "2",
      "text": "Another failed attempt at making a remake of a fantastic classic. I can see where they were going when they got Keanu Reeves to play klatuu. He's your perfect stone faced actor with one expression and he did this part well. But this movie failed hard to bring back the classic 1951 film by the same name. This movie for one was rushed and that got me angry. NOT a good movie and do not recommend it."
    },
    {
      "rating": "5",
      "text": "Ok to watch once, but not something I'd ever watch a second time. Never saw the original, but still knew exactly where the movie was going."
    },
    {
      "rating": "10",
      "text": "My girlfriend and I saw the movie last night (12/19). Everyone was laughing so hard throughout the show, including us, we had tears in our eyes. We both loved the movie and plan on seeing it again -- and we never do that. Jim Carey -- thank you! I needed the laughter and gave it to us in a wonderful new style. Great acting! And the take off used in the seminar was great too. I've attended Tony Robbins for years and others and it was a little over board but not by much when it came to the emotions. Right on! I encourage everyone to see this movie if you want to laugh hard and have a great time."
    },
    {
      "rating": "8",
      "text": "This movie is ONLY rated badly because it dared to take the name of the 1951 gem of the same name. Other than two minor points, that is ALL it has in common with it. IF YOU view the movie WITHOUT reference to the older one, it's actually a pretty good movie."
    },
    {
      "rating": "4",
      "text": "What starts out with great action turns into a schmaltzy tale for the \"green\" set. Preachy. Good special effects."
    },
    {
      "rating": "10",
      "text": "Excellent film. I loved every bit of it."
    },
    {
      "rating": "1",
      "text": "Keanu sucks. the movie goes no where and will 's boy is the only halfway decent spotlight in this tragedy of a remake."
    }
  ]
}