{
  "id": 1594,
  "title": "The Titan",
  "starring": [
    "Sam Worthington",
    "Taylor Schilling"
  ],
  "runtime": 97,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "On a bleak future Earth, a soldier endures a radical genetic transformation to save humanity. But his wife fears he's becoming more creature than man.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qRmQazyIBZR4pQIk9VruiZul0Au.jpg",
  "categories": {
    "plot": 2.8666666666666667,
    "acting": 3.3333333333333335,
    "ending": 2.75,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Look everybody, he is changing!Oh, he's changed now.The end.What did I just watch?"
    },
    {
      "rating": "2",
      "text": "What the heck just happened? This movie started out pretty good. Then it ended. So, they send him to Titan. I'm excited, then I realize....what the heck is this guy going to eat? Drink? How many years will he be there before other Ugmo's join him? This movie had SO much potential. Poor writing. Events that made no sense. This movie is a mess. There are a few decent actors, but their efforts could not salvage this wreck. I kept waiting and waiting for the story to continue and develop, then the rug was pulled from under me and it ended suddenly. It took forever to get the movie going and then when it did, it ended. I was shocked. I thought maybe the streaming skipped? I pressed rewind...nope, I didn't miss anything. I threw my hands up in the air and yelled, \"seriously?!\" The movie was over with so many unanswered questions. I'll repeat what I started with....what the heck happened?"
    },
    {
      "rating": "4",
      "text": "The Titan movie story it is that the world is collapsing due to lack of resources due to wars, chemical problems and related stuff. There is this place that resides in a military location, and some soldiers are staying there with their families. The idea is to evacuate the world to Titan, a moon of Saturn, but there the situations aren't like in Earth, the human would need to change several aspects to survive there, due to oxygen levels and numerous different condition. Then the movie shows what is needed to do, how the training is and the consequences of those and the relationship between those that gonna go to Titan and their families.The beginning of the movie isn't the most pleasant to watch, it is slow and push it transmite sometimes, but i didn't found it bad at all. I liked how they showed that were training, and how the bodies would be treated, like 300 vacines per weak, it already does give some idea of how difficulty it is, the sequences in the water was good, it did transpired well what was happening at the beginning. Also showing that some people couldn't support and may die during the training.What make this not be good, are those poor decisions that they made in the script, this tries to be a sci-fi and it happens in the year of 2048, and even with that some characters transit inside of a military base and can go to wathever place they want to, infiltrating into some confidencial rooms and read wathever they want without any problem, it simply gives the most simply excuses that way the character is able to do that. The role 3rd act, for me, was a big mess, like the character is decided to do a thing since the beginning and at the end happen some stuff that doesn't make sense at all. A lot of things, that should make, doesn't make sense at all, like the security, the story is about saving human race and doesn't seem that it is happening at all and even when they show something that they like because should help to save the race it doesn't seem to help in literally anything, some temperament stuff that doesn't make sense neither, when they trie to explain things it's very ridiculous at some times.One good thing about it is the make up, it is perfect, also as the cgi, when those two are combined wathever they try to pass it is gave to us perfectly.The acting is ok, Sam Worthington can deliver what the script allows him to, they should have showed him reacting to the changes that is happening to his body. Taylor Schilling is by far one of the best things of the movie, she can pass the idea of indignation and wrath, she also doens't have much to work with, but it is at least very functional. Tom Wilkinson also did a good job, even that what his characters plans is doesn't get any clear during the movie, you can tell that his voice work was very good.The cinematography isn't any special, it does show shades of blue all the time, referring to water wich is something big and important in the movie.Until the 3rd act the movie does work partially, it kind of get you curious and of what gonna happen to character c or d, and it goes showing it slow and part by part, wich is not a problem. They show the problem with the relationship between the principal couple, and you bought it.This movie isn't very good at all, i liked a few things in it, but the hole script was a mess, and for a sci-fi movie this is just self sabotage."
    },
    {
      "rating": "0",
      "text": "Netflix is crap. This so-called movie is nothing more than literally watching paint dry...watching a human change, for the sake of changing and he changes....then movie over.The end.What did I just watch?"
    },
    {
      "rating": "3",
      "text": "Who was responsible for this?  This is not science fiction, not even acceptable fantasy.  It is illogical, inconsistent and avoids common sense whenever possible.  Taylor Schilling is very good (and my rating of 3 is due to her performance), so if you could focus on her (it is her movie) and ignore the rest, it is watchable.  With a few plot changes, it might have worked:  Earth's surface is now uninhabitable due to runaway greenhouse effect.  The survivors live in sea floor cities which are threatened by increasing earthquake activity.  In desperation, they try to genetically modify themselves using Orca DNA.  This plot change would permit an optimistic ending as opposed to a nonsensical one.  Netflix has also given us Bright, with Will Smith, a fantasy film with as much violence as possible.  Again, good actors, production value, but I could not get through it."
    },
    {
      "rating": "0",
      "text": "The movie takes itself very seriously. It pretends to be a meaningful contribution to the thinking man's sci-fi genre. However it fails in every possible way thinkable. The science behind the plot is as robust as the flat earth theory. I think the film even tries to be metaphoric in some way, but it ends up embarrassing itself. The movie appears to be a boring extended version of the trailer. Absolutely tragic. Poor Sam Worthington. He will regret this always."
    },
    {
      "rating": "1",
      "text": "This movie SUCKS and is WEIRD. The idea is earth is dying so they want to force evolution so they can live on Titan and breath the air and survive the temperatures. Throughout the movie the main character gets treatments (and surgeries) to withstand cold, hold his breath underwater, and see in the dark. Then halfway through the movie the \"last treatment\" takes place and he all of a sudden just TURNS INTO A **** ALIEN who can't speak or communicate with his wife. It is HORRIFIC! And the worst part is, he goes home with his family afterwards!!! How could you take a monster home with you and just pretend everything is normal?? Also how is ONE surgically altered and dna altered human on Titan offer hope for humanity? He needed surgery and millions of dollars to transform, and there's only one of him on Titan so he can't reproduce anyways. And also, why modify a human to survive on Titan? Just modify him to survive on earth! Make him able to withstand the CO2 increase and increased temperature."
    },
    {
      "rating": "4",
      "text": "Sam Worthington had like four lines in this film. When you treat the main character as a supporting character, this is what happens. It's hard to review The Titan because I can't remember much about it, even only hours after watching this movie."
    },
    {
      "rating": "8",
      "text": "One of the best small budget sci fi films I have seen in recent memory. The premise is where it shines. While it does flounder (pun intended) with some of the dialogue and delivery, it does not diminish the thought provoking ride along the way.Certainly does NOT deserve the negative disdain it has gotten here."
    },
    {
      "rating": "4",
      "text": "I want to give this movie. A higher score, but it had so many holes. It could have been much better. I didn’t know it was low budget movie, maybe that’s why they didn’t use many CG. 1. Good concept, it could have been a great movie2. Horrible ending, just poor3. They didn’t use Sam. W enough, he’s a great actor, should have given him more scenes or narration or something.....ended more. Him and less o the wife.4. Wish they concentrated on slowly changing and morning the characters, instead Sam.W goes under one operation and suddenly comes out looking like an Alien! Not believable Someone needs to take the concept and redo it with more CG and different ending"
    },
    {
      "rating": "3",
      "text": "A somewhat interesting premise is marred by poor writing, illogical concepts and an extremely predictable ending. I struggle to think of anything in the movie worthy of compliment apart from a small amount of action.Simply put, this movie is just boring. Do not watch it."
    },
    {
      "rating": "1",
      "text": "I was interested to watch this movie. The premises were interesting; modifying the human race in order to populate Saturn's moon Titan.However the movie lacks everywhere.I cannot understand why the story is told through the eyes of the main character's partner, when you have a very interesting main character and you intend to tell a scifi story.Anyway, this flick tics all the feminist boxes. If you are into flicks that support a feminist agenda you may enjoy The titan, if you enjoy scifi you may want to pass this film"
    },
    {
      "rating": "8",
      "text": "I thought this movie was excellent. I don't know why it has such low ratings. Great sci fi movie. Sam Worthington gives a touching performance."
    }
  ],
  "recommendations": [
    "stowaway",
    "eo",
    "contagion",
    "greenland",
    "how_it_ends",
    "children_of_men",
    "the_midnight_sky",
    "code_8",
    "snowpiercer",
    "the_tomorrow_war",
    "prometheus",
    "after_earth",
    "sanctum",
    "jurassic_world_fallen_kingdom",
    "vivarium",
    "the_purge_anarchy",
    "elysium",
    "the_purge",
    "noah",
    "lucy",
    "the_hunger_games_mockingjay_part_1",
    "the_day_after_tomorrow",
    "chaos_walking",
    "downsizing",
    "divergent"
  ]
}