{"id": 3882, "title": "The 13th Warrior", "starring": ["Antonio Banderas", "Diane Venora"], "runtime": 102, "genre": ["Adventure", "History", "Action"], "description": "A Muslim ambassador exiled from his homeland, Ahmad ibn Fadlan finds himself in the company of Vikings. While the behavior of the Norsemen initially offends ibn Fadlan, the more cultured outsider grows to respect the tough, if uncouth, warriors. During their travels together, ibn Fadlan and the Vikings get word of an evil presence closing in, and they must fight the frightening and formidable force, which was previously thought to exist only in legend.", "releaseYear": "1999", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ip5FmurIOdOyI1wFY2nXVMze3lC.jpg", "categories": {"plot": 8.0, "acting": 8.25, "ending": 10.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 10.0, "action": 7.555555555555555}, "reviews": [{"rating": "10", "text": "The Firewyrm! This is just a fun movie to watch, don't take it that seriously. I loved the interactions and the characters and even thought Antonio did a great job! I love the critic score, those stuffy elitists said this move was horrible, but in reality it is what we love to call a Hidden GEM! Buy a bottle of mead and track down a copy of this movie, zone out for a bit with some friends as this is a great party movie."}, {"rating": "7", "text": "I like Viking..............................................................."}, {"rating": "10", "text": "I simply cannot understand why people dislike this Movie so much!To Me it's one of the best Movies of all time.from beginning to end it had nice drama,awesome action and some small bits of comedy at times that never seem out of place.Antonio Banderas  and the entire cast are fantastic and to myself is perfectly acted.I really love the setting of the Movie and the plot are well crafted and executed to perfection.Without revealing Spoilers that's about all I can say.However,it still boggles my mind why people hate this Movie so much!It's really,really good and should be considered one of the best Movies of all time and I simply cannot comprehend why people hate on this Movie.I guess it shows you that the majority of people in life have absolutely no idea what they're talking about."}, {"rating": "6", "text": "The 13th Warrior is a nice little flick about Norsemen badassery. They clang swords, best man and beast and drink mead 'till vallhalla come. Not much to say beyond that except I thought it was fun."}, {"rating": "6", "text": "Not a bad little action movie, not high art but entertaining. Antonio Benderas from back when he was kinda cool. I think the smarest thing was that they don't drag the movie on and on, a quick, nice little action esk movie can be nice from time to time."}, {"rating": "10", "text": "This is one of the top movies of all time. It's greatness is not measured in a single viewing but in multiple viewings. It is one of the few movies I watch over and over again, each time with more pleasure. Most movies do not inspire repeated viewings, but this one does. I've checked all my friends and they all have a copy of this movie and all feel the same way. Although upon first viewing you may indeed think it is a 7 out of 10, you will find this movie sticks with you and quickly grows on you making it that rare 10 out of 10.\rWatch it. I don't give spoilers you can find them on the net if you really want them.\rI mean it watch it.\rstop reading and go rent, buy, borough or steal it.... don't steal it... it's Christmas, so be good!"}, {"rating": "5", "text": "Does anyone realize this is a complete rip from Seven Samuri? or does your filmogly even compute that?"}, {"rating": "10", "text": "This movie was butchered by the Disney editors- a shame. There's just barely enough continuity in the story line to keep it afloat. Nevertheless, we enjoyed it immensely. Yeah, you'll have to 'suspend belief' for a while and extrapolate a little to make up for the editing. Ahmad ibn Fadlan meets the Seven Samurai, or another \"Dirty Dozen\" that includes a 'fish out of water'.Originally, this was a 2+ hour movie. Hopefully, someday the original version with come out on DVD or BR. A long-shot pipe dream considering Disney owns the rights and it lost money in its' theatrical release."}, {"rating": "4", "text": "This movie is a bit contradictory to me. It's a movie worth seeing if we just want pure entertainment, but it does not have enough quality for us to think of it as a really good movie. The action centers on the participation of an Arab ambassador in a Nordic military expedition, sent to protect an isolated village that was being attacked by some sort of evil creature. And the weaknesses of the plot begin to appear before us: what would motivate an Arab sultan to want to maintain diplomatic ties with the tribal peoples of Northern Europe? They could never help in case of war because they are too far away, and commercial relations were impracticable at that time because of the enormous distance between them. It seems the idea did not come from the script, but from a novel in which the film is based, but it does not matter. It's still hard to swallow. Another point that drew my attention in the negative is the portrayal of the Norse as an illiterate people who needed an Arab to write their own story. The writer certainly forgot that the Norse are the inventors of a particularly well known writing system, the runic alphabet. Even for an age where teaching was rare, it is believable that Beowulf, as a prince, had at least some notions about this writing system, thus not needing a foreigner to \"draw sounds\" for him.The strong point of the film is the combat scenes. They were thought out in detail and deserved the attention of the technical team. The idea of ​​\"bearsmen\" is also good, but it is difficult for me to believe that the Norse, warlike as they prove to be, believed in that story of the creature of fire. There is a huge contradiction latent in that: if the Norse are bellicose and bragging, why would they flee from an army with torches thinking it is a hellish serpent? In the first attack it is quite evident that they are men, not frightening creatures out of our worst nightmares. There's no sense in really believing that.António Banderas is literally the man of the movie. He appears, he shines, he makes a good participation. Omar Shariff also deserves an honorable mention for his fleeting appearance. He's an old-timer, with excellent diction and he is perfectly at ease in the role. The sets and costumes are good, they make the audience feel truly Northern Europe and the Viking environment. It's a shame that the script has not been reviewed and improved, as this would have made this film substantially more positive."}, {"rating": "6", "text": "This Crichton adaptation is nothing more than an expensive piece of mediocrity. Battles that should've been exciting are poorly edited and lit, meaning they're not all that fun to begin with. There's little, if any, thematic coherence. They've taken a lavish budget and made something ordinary and unexciting out of it. Skip this and get gladiator. If you wanna watch this, don't expect anything special."}, {"rating": "9", "text": "Beautifully filmed yet gruesome. For action/ adventure you don't get much better. Based on the Anglo-Saxon epic, Beowulf, it lives up to the expectation of heroism and tragedy. Weakness in fleshing out the characters is compensated by tearing flesh."}, {"rating": "10", "text": "The most unexpectedly audacious, exhilarating, wildly creative adventure thriller I've seen in ages. the movie is very good, dont mind the critic, anyone who likes action, comeday and vikings there is just no better film"}, {"rating": "9", "text": "Let me put my bias right at the front: when people ask what my favorite movie is, I say \"pffbt, I have no favorites. If pressed, I say \"The 13th Warrior.\"• Tremendously unique protagonist: an Arab, Muslim Poet, whose brains and creativity help in his evolution into becoming a warrior.• An authentically Nordic cast: actors who convey the culture with palpable sincerity.• A D&D-style tale of Nordic Viking warriors and their exploits: the formation of the party and their quest.• Gritty and bloody, this movie treads between action and horror in places.If you play video games, you might very quickly draw parallels between this and The Elder Scrolls V: Skyrim (for good reason, as one of the lead protagonists in this film also voices one of the lead characters in that game: Vladimir Kulich as Ulfric Stormcloak, and here as Buliwyf). You might also find a comfortable familiarity with the scenery, the characters, in personality, apparel and weaponry.There is no literal magic within the movie, only the myths that are dispelled upon further discovery. This movie is gritty and fairly realistic in a way that's somewhat refreshing; though we have confidence in the plot-armor of our main character, we learn the other 12 warriors may not have that kind of safety.The movie starts slow, ramps sharply up in the middle, and slows down towards the end, potentially creating more questions than answers as they learn more about their antagonistic foes. In the end, the villains are defeated, and victory is assured, but not without unfortunate sacrifice.For its cinematography, unique characters rarely seen on the Hollywood screen, its retelling of a classic myth, and its dedication to preserving the medieval tenacity of Nordic Warrior adventures, I give the film a 9/10. It's a subject that I love and enjoy, and this movie did a spectacular job in giving me what I wanted.If you have similar interests, hopefully you'll enjoy it too! If not, this movie probably won't be anything special."}, {"rating": "10", "text": "There seem to be very diverse opinions on this. It is probably hard to tell what the original was like since it went through a messy re-shoot and re-edit process. What was finally shown has some superb scenes and some very atmospheric settings; the opening scenes in particular are first rate. Perhaps as a result of having too many cooks, the second half does become a bit scrappy, but there's enough even there. I'm giving it a high rating because, despite what happens towards the end, the best scenes throughout are superior to anything in just about any other period action movie I have seen."}, {"rating": "9", "text": "A simple story about courage facing the unknown. Its one of those films that didn't hit big on cinema but I love it every time seeing it. A unusual film for Antonio Banderas but great anyway. Great action sequences and a mistery that isn't amazing but satisfying."}, {"rating": "8", "text": "Critics are completely out of touch on this one. Great characters and a wonderful, action lacked story. You really care about the characters and love watching them grow to respect each other's cultures. Can't explain why a \"journalist\" can't grasp that."}], "recommendations": ["tomorrowland", "blade_of_the_47_ronin", "equilibrium", "chappie", "beowulf", "mortal_engines", "inception", "9", "cloud_atlas", "sucker_punch", "jupiter_ascending", "super_8", "fight_club", "king_arthur_legend_of_the_sword", "what_happened_to_monday", "avengers_age_of_ultron", "the_hunger_games_catching_fire", "the_darkest_minds", "the_5th_wave", "ready_player_one", "bumblebee", "dredd", "arrival", "chaos_walking", "okja"]}