{
  "id": 302,
  "title": "The Kissing Booth 3",
  "starring": [
    "Joey King",
    "Joel Courtney"
  ],
  "runtime": 112,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "It’s the summer before Elle heads to college, and she has a secret decision to make. Elle has been accepted into Harvard, where boyfriend Noah is matriculating, and also Berkeley, where her BFF Lee is headed and has to decide if she should stay or not.",
  "releaseYear": "2021",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/c7xcqnMDVQ5v1hJBm3AZ5YikNe6.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 3.0,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 7.333333333333333,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Peor que las anteriores, las cuales de por sí son horribles, dejen de hacer tanta basura..."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "2",
      "text": "The second was awful, so why not close in misery with the third one?To sell a romantic comedy you need charm, fun, and above all interesting or at least entertaining characters, not just a bland overload of cheap sweetening.But obviously that's not what consumers are looking for, and I call them consumers because that's what they are.And I say this, because it was them who made the inconsequential original film successful, and that's how we got this dumb trilogy.But thankfully it's the end. That's the silver lining."
    },
    {
      "rating": "10",
      "text": "I love this bitter sweet sequel!!!!!I think this was probably the best of the 3 films from a deep point of view. If you are looking for the classic happily ever after straight line then you'll probably hate it.I give it a complete 5 star because i can totally relate with the feeling here. Yes Elle and Noah said they would fight for each other, but i guess fighting for another person may mean letting them go and hope that fate brings you back again when the time is right. I love how much Noah is better able to contain his anger especially with Marco.I must admit i really was happy that Elle got to do her own thing cos common!! She really had been trying to make everyone but herself happy!! If She had gone to Boston with Noah, I think She would have come to regret it in a way and believe me, Lee would never have let her forget it, and If She went to Berkley, She would have missed Noah too much, caused more Drama thereby killing her friendship with Lee.I especially loved that they met after 6 years (Even though they all still looked exactly the same to me) and you can just tell that they would get back together and i especially used my imagination to get the happily ever after my romantic heart was secretly looking for.It was a bitter sweet film for me, a perfect way to end a series that held me from the start.P. S All the other sub plots were cool also, Elle's Dad, Chole's parents etc..all just showed that Life happens and you either go with the flow, fight against it or Learn its curves and bends and just Surf with it!"
    },
    {
      "rating": "10",
      "text": "I love this bitter sweet sequel!!!!!I think this was probably the best of the 3 films from a deep point of view. If you are looking for the classic happily ever after straight line then you'll probably hate it.I give it a complete 5 star because i can totally relate with the feeling here. Yes Elle and Noah said they would fight for each other, but i guess fighting for another person may mean letting them go and hope that fate brings you back again when the time is right. I love how much Noah is better able to contain his anger especially with Marco.I must admit i really was happy that Elle got to do her own thing cos common!! She really had been trying to make everyone but herself happy!! If She had gone to Boston with Noah, I think She would have come to regret it in a way and believe me, Lee would never have let her forget it, and If She went to Berkley, She would have missed Noah too much, caused more Drama thereby killing her friendship with Lee.I especially loved that they met after 6 years (Even though they all still looked exactly the same to me) and you can just tell that they would get back together and i especially used my imagination to get the happily ever after my romantic heart was secretly looking for.It was a bitter sweet film for me, a perfect way to end a series that held me from the start.P. S All the other sub plots were cool also, Elle's Dad, Chole's parents etc..all just showed that Life happens and you either go with the flow, fight against it or Learn its curves and bends and just Surf with it!"
    },
    {
      "rating": "0",
      "text": "Imagínate que estas pellículas te gusten de forma no irónica, hay que tener la mollera sumida XDDDD"
    },
    {
      "rating": "2",
      "text": "The Kissing Booth 3 concludes the saga. It's the same as the other 2, full of cliches and desperate situations, at least it has the best ending, in my opinion, of the trilogy."
    },
    {
      "rating": "3",
      "text": "Honestly this movie wasn’t downright awful, but it surely wasn’t good. It honestly had a waste of a plot… almost a hyped up repeat of the second installment. The acting is okay…it can seem fake sometimes when the actors hype it up WAY too much. But that’s a problem with the whole trilogy. There should have been a better ending. For example, the time jump should have included more…. like at least establishing Elle and Noah do end up together. We definitely deserved a better ending to this trilogy then what we got."
    }
  ]
}