{"id": 1762, "title": "The Unborn", "starring": ["Odette Annable", "Cam Gigandet"], "runtime": 87, "genre": ["Horror", "Thriller", "Mystery"], "description": "A young woman fights the spirit that is slowly taking possession of her.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6SUuLwyk9wFKZDYsgdSahYs7HEf.jpg", "categories": {"plot": 4.833333333333333, "acting": 4.0, "ending": 5.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.5}, "reviews": [{"rating": "5", "text": "The simulacrum created in the film is not bad. The exposition of the film tries to confuse audience or make the story looks more complicated, but at the end of the film it shows a poor resolution without proper linkage to the start."}, {"rating": "1", "text": "DId you know that most of the time, the titles alone either make the movie appear to be \"Good\" or \"Horrible.\" Well, the Unborn, no surpise, is not the biggest bomb of all time, but i think a Razzie should be in favor of this poorly recieved, awful downright stupid movie. Wny? Well, i don't know, horror movies, some of them today, are so meaningless it seems, {i love Tim Burton's Sweeney Todd} and this is like a sequel to the Exorcist. Only, this time, it wasn't scary in the effects, and people just got bored watching it. For one thing, having a dead \"baby\" brother haunt you, is so unrealistic, and if it's horror, isn't it suppose to scare us? It's more likely to scare us to NOT see these low budget sleepers, with that said, don't waste your time."}, {"rating": "9", "text": "I'm really astound by the negative reception of this movie. I found it one of the most solid and meaningful horror pictures of the decade. Yes, you've heard me - meaningful. It's one of the few movies that shows the actual folklore vision of the world. Not the standard western, judeo-christian civilization, XX/XXI century view, but the actual beliefs of our ancestors, who had their good reasons to be afraid of the darkness. \"Dybuk\" is a important part of lore and almost nothing in the movie contradicts that lore. There were things behind the veil of reality that people believed, that made Nazis pale in comparison. They were murderers, soulless sadists and monsters, yes, but yet - they were mundane. The one thing that bugged me about \"The Unborn\" was the exorcism scene. It felt like someone imposed on the director to make an action scene... Apart from that, there's not a single thing about the whole movie that would contradict the folklore or the beliefs of the spiritualists. It's so strange, that movies based on a bit more exotic folklore - like Japanese for instance - are far more acclaimed than the movie based on Jewish lore."}, {"rating": "2", "text": "With an unbelievable (yes, granted, it is a horror film) and painfully redundant plot, and a main actress that was clearly cast through the audition of a nude shower scene and the will to parade around in underwear, the Unborn misses the desired irony of an audience scrambling to leave out of thrilling fear and instead herds them out with profound boredom and predictability. It's saving grace, or perhaps that which will save it from deeper layers of movie hell are the various horrific creatures which do thrill, however any remotely redeeming part is already revealed in the exceptional trailer."}, {"rating": "2", "text": "Just another horrible horror flick with little to like. Avoid!!!"}, {"rating": "8", "text": "Jumped a few times in this movie. The women looks alot like Megan fox. And I actually enjoyed this film.\r Watch it online for free: https://www.primewire.ag/watch-31-The-Unborn-online-free"}, {"rating": "4", "text": "The Unborn is a dreadfully unimaginative and dull jump-scare horror that looks great but has zero substance. It’s not that it's a badly made film, it’s just creatively empty with nothing notable. It’s a very pretty film with pretty people and pretty images that actually become distracting making it hard to focus or engage with the characters and the film. You stop caring what happens and idly ride it out. Maybe that was the idea as the film itself is devoid of any real depth so looking pretty and some boring jumpscares are all that it has. It utilises every unimaginative trope of the exorcism and ghost genre. The direction is unimaginative and sometimes misguided. I think that if the casting of the lead actress was different then it could have been much more engaging, it’s not that she’s a bad actress, it’s just that she is not right for the role. It’s a challenging role that if she had been better cast would have carried the film. I really didn’t like the ending either, it wasn’t a complete story."}, {"rating": "1", "text": "I would like to note that i went to This movie with low expections and was very dissipointed. this movie seams to be a direct ripoff of the grudges scare tactics. essentially this is the most generic of generic horror flicks. I sincerely hope that michel bay does better on friday the 13 his next horror outing."}, {"rating": "0", "text": "I didn't care about the brunette or the token black character. I don't even remember if I caught their names. The dialogue set the movie up for 15 year old boys. The brunettes father was in the first part of the movie and then mysteriously disappeared. The movie has some Yiddish folklore and customs that were handled horribly. A Yiddish woman recited the modei ani in english for some reason. A rabbi is not wearing his kippah in synagogue. There was a Hebrew/Arabic/elvish? book, though the book was designed to read left to right, even though semetic languages are read right to left. Why Gary Oldman!?! Why?! you are Commissioner Gordon! Bad movie. Epic Fail!"}, {"rating": "1", "text": "The title is misleading. \"The Unborn\" plays like a Mel Brooks parody of William Friedkin's \"The Exorcist\". It's not some revenge film about a fetus with an axe to grind as the title suggests. So be prepared. Akin to Bryan Singer's \"The X-Men\", the filmmaker uses Auschwitz as the setting for an inappropriate, and downright bizarre foray into science fiction. So be prepared for the portrayal of Josef Mengele's experiments on children, while a concentration camp survivor tells the origin story of Casey's demon. Talk about your dialectical quagmires, in the same film where the heroine is haunted, but finds the time to look hot in her underwear while being haunted, there are dead Jewish children on slabs in the morgue. A Dybbuk reanimates the holocaust survivor's twin brother, as if this gathering of twins slated for death didn't already have enough on their plates: dye in the eyes, vivisection, castration, and now, a murderous Hebrew spirit named Jambi. \"The Unborn\" is offensive in this respect: for Casey's grandmother Sofi(Jane Alexander), the surviving twin, her testimony about the war discloses an entity native to her heritage as haunting her more than the Germans. The Auschwitz experience becomes somewhat trivialized, made idiosyncratic by this alternate history. Juxtaposed against the paranormal, Mengele, and the Nazis, are almost beside the point. Casey(Odette Yustman), by all appearances, is a gentile at the outset of \"The Unborn\", but during the course of the film, she gets in touch with her past, while the past literally touches her. She's touched by a dybbuk."}, {"rating": "8", "text": "LOVED IT!! Scared me senseless and that is exactly what it is meant to do. If you love a good horror and something to jump into the person's lap next to you in the theater, this is perfect!"}, {"rating": "1", "text": "O Que eu posso dizer? o filme é de terror não assusta!! nem serve como terror psicológico gênero da \"A Orfã\",também não tem ação,o motivo de eu dar 1 e não 0 é somente pelas boas atuações de Odette Yustman e também pela parte que ela mostra a bunda,E as boas atuações de Gary Oldman e Cam Gigandet também"}, {"rating": "7", "text": "The critics are pretty arch but, at the same time, the movie is not perfect either.The acting is not that good,the story is cliché like the characters and the CGI is not that good but,it's  surprisingly,not that bad."}, {"rating": "3", "text": "You'll have a couple of jump, goosebumps and spooky moments here and there sure, but the movie is mostly a dumb mess without any redeeming quality to it, bad dialogue and bad acting for the most part."}, {"rating": "8", "text": "Girl is being haunted by her evil, unborn twin brother and ends up getting some of her friends killed but defeats it using some anti-demon, Jewish stuff."}], "recommendations": ["the_curse_of_la_llorona", "splice", "mama", "the_grudge", "case_39", "the_possession", "dark_skies", "the_green_inferno", "i_spit_on_your_grave_2", "sinister_2", "the_grudge_2", "the_conjuring_the_devil_made_me_do_it", "scary_stories_to_tell_in_the_dark", "ouija_origin_of_evil", "priest", "chernobyl_diaries", "brahms_the_boy_ii", "brightburn", "the_woman_in_black_2_angel_of_death", "the_remaining", "annabelle", "the_eye", "leatherface", "exorcist_the_beginning", "red_riding_hood"]}