{
  "id": 4124,
  "title": "The Men Who Stare at Goats",
  "starring": [
    "George Clooney",
    "Ewan McGregor"
  ],
  "runtime": 94,
  "genre": [
    "Comedy",
    "War"
  ],
  "description": "A reporter in Iraq might just have the story of a lifetime when he meets Lyn Cassady, a guy who claims to be a former member of the U.S. Army's New Earth Army, a unit that employs paranormal powers in their missions.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5boJKypPQmgABssbKOk2RvsCnSv.jpg",
  "categories": {
    "plot": 6.75,
    "acting": 6.916666666666667,
    "ending": 6.125,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.428571428571429,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "First of all, I must say I was nearly forced to go inside the cinema to watch the movie. But after watching it, I accept that it was a really nice film: fresh, not slow(but not as fast as I would have liked), really funny, and with a few moments that everybody in the cinema laughed really loud. It is worth watching it, so I recommend it to everybody. A must-see film if you wanna enjoy a really nice time!"
    },
    {
      "rating": "8",
      "text": "Seeing Doctor Parnassas(hope it was right), I left from cinema thinking that the movie had everything right - acting, story and the purpose but it failed with very important thing - entertainment. This movie dosen`t have great story or some other things but it doesn't fail with entertainment. You get great emotional feeling and can always enjoy film with your friends. For me it had great message and wasn't disappointed."
    },
    {
      "rating": "8",
      "text": "My husband and I loved this. It's completely wacky, yet based on a period of time when the US military seriously investigated paranormal approaches to war. Great performances that leave you wondering, \"Are they crazy? Am I?\""
    },
    {
      "rating": "9",
      "text": "What a fun and wacky ride! The cast was exceptional. If you have a good sense of humor and appreciate the absurd, you should enjoy this movie as much as we did."
    },
    {
      "rating": "7",
      "text": "Apparently based more in fact than you might believe, this movie is by turns satirical, amusing and poignant. An original indie with a great cast. Clooney and Bridges do not disappoint"
    },
    {
      "rating": "8",
      "text": "I really don't understand why people hated this movie. It's hysterical! Clever, dry and flat-out nonsensical. Fantastic cast and extremely entertaining."
    },
    {
      "rating": "7",
      "text": "although it takes a while to get going it has a great deal of comedy to it. not to mention it makes the military seem like its not to bad even though of course it is; idk if this is a good thing. but still george clooney is hilarious and i only wish there could have been more of him. i like the way that there is no lead female whos only there because she ranks high on the hotness scale, that was a huge relief. I also like how this movie talked about backwards lyrics as well people being tortured by music ; so few people are aware of what the government is really up too. tho bombarding the president with psychotronic generators wouldn't make sense because he is the government and the illuminati would just go in and shut it down assuming its not them who owns it(which is impossible if you ask me). this movie is a must see for anyone interested psychic powers or the government."
    },
    {
      "rating": "5",
      "text": "The New Earth Army manual is all theory; it's never put into practice. If it did, then maybe this anti-war satire would get out of first gear. \"The Men Who Stare At Goats\" wastes a golden opportunity to expound on the famous \"Dr. Strangelove\" line: \"Gentleman, you can't fight in here! This is the War Room,\" which was delivered by Peter Sellers(as the president) in the 1964 Stanley Kubrick classic. There's no payoff to Bill Django's conceit that such countercultural ideals of his could accomodate the millitary's predilection for sanctioned violence. In the hands of a more daring filmmaker, one who was willing to rewrite war history(ala Quentin Tarantino), all that \"hippie crap\"(what Larry Hooper, played by Kevin Spacey, Django's teachings) would be a lot more potent as satire if the special unit's peace and love played a part(positive or negative) in the outcome of our country's skirmishes. The New Ageism that defines the psy-ops program is funny, but one-note in its presentation, because the New Earth Army soldiers never use their special training in a real world situation. The movie is much too preoccupied with the power struggle between Django and Hooper. Lyn Cassady(George Clooney) needs a more dynamic mission than the one the film gives him. \"The Men Who Stare at Goats\" could have explored the idea of a peace movement as being more than symbolic. For example, a soldier, not some hippie chick at an anti-war demonstration, could stick a flower in the barrel of a gun. But Cassady and Bob(Ewan McGregor) are nowhere near the war. The film needs a second gear. Django needs a venue for his \"hippie crap\"."
    },
    {
      "rating": "2",
      "text": "Incredibly bad, stupid and... boring film."
    },
    {
      "rating": "5",
      "text": "It's strange, because as dull as this movie got, at times...it really captures something. It captures this spirit and a sense of time and place. I don't know, I can't really explain it, but it kind of gives off a sense of whimsy, especially as Boston's More than a Feeling plays on the soundtrack. It's a really interesting film. That said, it's a comedy...without the laughs. At best the movie wins a few slight chuckles, but it's not really laugh out loud funny, ever. And it's not serious or dramatic either, so what is it? Really, REALLY weird. By the end it just totally goes off the rails...which would be good, if the movie was funny. Without being funny, it sinks into a pretty tedious story that takes forever to get....really, what was that ending?"
    },
    {
      "rating": "3",
      "text": "Inaccurate, sloppy account of army remote viewing program."
    },
    {
      "rating": "2",
      "text": "Great cast, nice premise. Absolutely deprived of any \"necessity\" to the plat. Just lurches from on idiotic scene to another with no drive and only minuscule connection. Idiotic in the sense that it was plotted by an idiot or more likely a committee of idiots."
    },
    {
      "rating": "0",
      "text": "HORRIBLE. When the only \"joke\" is casting Ewan Mcgregor as a wanabe 'jedi', get it?! Bloody hell, what a waste of time. Here in Australia it still hasn't had a theatrical release! Tell you something??"
    },
    {
      "rating": "4",
      "text": "I was looking forward to this, due to clooney, etc. but it was so disappointing I stopped watching at 38 minutes. It's just dumb. I didn't laugh once, just a rather dull, unfunny movie."
    },
    {
      "rating": "2",
      "text": "A complete waste of a stellar cast. At no point does the director come close to making a watchable movie. This is easily Ewan McGregor's worst performance of his career, and that takes into account the abortions that were the Star Wars prequels. Don't waste your time."
    },
    {
      "rating": "0",
      "text": "I love farcical comedies. Anything Cohen Brothers / Wes Anderson. This was absolutely horrible. I smirked once all movie. There is no build-up to anything, no point to anything. Aside from one 15 second goat-stare-down scene, the rest of the movie's jokes and sight-gags were flat."
    },
    {
      "rating": "3",
      "text": "There may be a funny moment or two, but in its absurdity, there's nothing to hold on to."
    },
    {
      "rating": "2",
      "text": "Interesting idea, but the writers left all humor out of the script."
    },
    {
      "rating": "1",
      "text": "Not worth seeing. Story is so poorly told it is hard to follow."
    },
    {
      "rating": "2",
      "text": "Run, don't walk from this movie! I haven't walked out of a movie in years, but this was unbearable. Great cast but awful story. Don't waste your money."
    },
    {
      "rating": "0",
      "text": "Oh, my God! This movie is so bad that I thought I was in the seventh circle of hell. Would it ever end? Would it ever generate even the smallest iota of a plot? what was George Clooney thinking? Avoid like the plague!"
    },
    {
      "rating": "5",
      "text": "Some funny moments but not enough. Even suspending disbelief is not quite enough to make it happen for me."
    },
    {
      "rating": "0",
      "text": "Did not get this movie at all. Totally boring! Waste of money and time."
    },
    {
      "rating": "1",
      "text": "Not the worst movie I've seen but it certainly ranks up there (or down there, as the case may be). All the funny stuff was shown in the commercials so that left nothing to see at the theatre. $30 later and my husband wouldn't let me ask for my money back. Stay away from this one."
    },
    {
      "rating": "0",
      "text": "An absolute piece of trash that Clooney, Spacey, etal. should be ashamed to have been party to it."
    },
    {
      "rating": "4",
      "text": "What I saw was one long steady fast paced unrelenting one-premise stream of goofiness that in the final analysis just isn"
    },
    {
      "rating": "4",
      "text": "Boring, Painful, and about as funny as a Jerry Bruckheimer action movie. I felt as if the movie would never end. The only funny part of the whole movie was the LSD dosing, and it could have been a lot more funny. I would have rather seen Twilight, which my girlfriend was begging me to do, at least I would have gotten pussy for seeing her movie instead of mine."
    },
    {
      "rating": "4",
      "text": "The cast and premise are great, but the scriptwriting falls flat.  It should have been much funnier, but it was well acted and had some good moments.  You can't help feeling that the talent was largely wated."
    },
    {
      "rating": "8",
      "text": "The \"mixed\" reviews don't understand what war or longing for normality really is. When you are in war everything is funny or you die. Nothing in this movie is true, so be it. You will never be able to understand what really is going on. I believe this what every Soldier, Sailor, Marine, Airman, and Coastie wants to feel. Disconnected and whole. Take from it what you will."
    },
    {
      "rating": "8",
      "text": "As someone who actually did a great deal of research into remote viewing/psyops/MK Ultra and such, this movie was right up my alley. The pacing and visual style of the film remind me a bit of Burn After Reading. As far as performances go, none of the movies stars are at their best. Mediocre performances aside, this is a very entertaining movie. At times comical, at times intriguing. If you have no interest in the subject of remote viewing you will most likely be bored to tears."
    },
    {
      "rating": "10",
      "text": "Most ppl won't (don't, from the comments) \"get\" this movie. From Bridge's perspective, Lebowski 2. And Clooney plays a wacko as well as almost anyone. Lots of snide reeferences. Desert scenes were shot at White Sands, NM and NMMI in Roswell stands in for Fort Bragg. Aliens, Roswell, 1st atomic bomb, Werner von Braun etc...seems like appropriate synergies to me. Walked out of it into a Santa Fe mall...and the film knocked me off-kilter enough that maybe, just maybe, I could've walked through a wall."
    },
    {
      "rating": "10",
      "text": "I had a great time with this movie!"
    },
    {
      "rating": "10",
      "text": "It was hilarious!"
    },
    {
      "rating": "10",
      "text": "This was a great film. You WILL laugh."
    },
    {
      "rating": "9",
      "text": "Don't try to take it seriously. It was very adult and funny. I don't think kids will \"get\" it. As antiwar movies go, it was quite good."
    },
    {
      "rating": "8",
      "text": "I went to see the film with a group of friends, expecting to be moderately entertained by another average, yet kind-of-fullfilling comedy starring the always spectacular George Clooney and several other main cast members that draw you into the film. I was suprised to find that, while at times it was slightly hard to follow, I enjoyed the film. I genuinely enjoyed the film."
    },
    {
      "rating": "10",
      "text": "Great movie, but too much cake."
    },
    {
      "rating": "6",
      "text": "Not A Great piece of entertainment but not bad either."
    },
    {
      "rating": "7",
      "text": "Now that I know the Coens are behind this film I understand it better."
    },
    {
      "rating": "8",
      "text": "I liked it and was touched by this story about beliefs, like winning a war with love instead of violence, the movie made â"
    },
    {
      "rating": "5",
      "text": "Reasonably entertaining with good performances but the ending is a stuff-up."
    },
    {
      "rating": "6",
      "text": "The critics may have been a touch harsh here, but generally, I cannot fault them too hard here, as this one is pretty middling as an overall film. Pretty funny at times, The Men Who Stare at Goats manages to be a satire that takes itself a touch too seriously and goes a little too deep into the \"bad weird\" territory for me, in that it goes weird, but is not funny in doing so, just weird. At those moments, this one is off-putting. However, luckily, the moments where it is some quality satire and quite funny outnumber them. Also in the \"pro\" corner for this one is the great cast. I really liked George Clooney and Ewan McGregor here. Jeff Bridges and Kevin Spacey were not quite as good, but still turned in assured performances here. Ultimately, the moments where this one struggles mightily is when it takes itself too seriously and thinks it is being truly profound. As I said, these moments are not many when compared to the strong scenes, but those strong scenes are also short of being great. Overall, this one is an above average film that hits \"pretty good\" territory at moments, but is largely middle of the road."
    },
    {
      "rating": "8",
      "text": "A quirky and funny satire with a great cast full of actors really giving it their all."
    },
    {
      "rating": "9",
      "text": "A little gem, as crazy as poignant!! You enjoy every minute !! Ewan McGregor and George Clooney give us a fantastic duo, full of surprises, emotion and, mostly, laughs... A good reflection on the importance given to our faith. I love this parallel between the wacky humour's side, and the serious side, at the end of the movie... Yes, after all, we all need Jedi Knights !!"
    },
    {
      "rating": "4",
      "text": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
    },
    {
      "rating": "8",
      "text": "Overall, this is a very good movie with great, Coen brothers like style and writing, that knows not to take itself too seriously.  However, I wish some worked with Ewan Mcgreggor a little more on his American accent for his voice-over parts"
    },
    {
      "rating": "7",
      "text": "This is very much a bizarre movie, with some intriguing characters, or zany might be a better description. This is a movie which you have to concentrate on, to try to follow or you'll be pretty lost but its pretty 'out there' and so is quite confusing by nature anyway - its quite surreal and has a hippy type undertone to it, with the plot about trying to develop ways of being deadly without being physically aggressive, so alternative peaceful violence I suppose, if such a term is even logical(?!).George Clooney seemed in his element in this movie, with him once again portraying a quite off the wall character, with that sparkle in his eye, the knowing look that he knows exactly what he's talking about, even though its all a bit random or over the top. He certainly comes across as very self assured and quirky, a character you feel intrigued to learn more about and see what the truth is behind their supposed 'paranormal abilities'. The script is quite good, in that throughout I felt interested to find out what was going to happen, some of the dialogue seemed quite clever, even if I couldn't always put my finger on precisely why. There's an absurdity to it thats quite amusing, take the example of one scenes involving soldiers in full camoflague uniform all basically dancing very loosely, moving about in exaggerated, jerky movements, as if rather drunk - its bizarre but somehow a good bit of fun, I suppose.Some of the dialogue is really quite (you guessed it) baffling but its also quite amusing and has a parody feel to it, such as government, military officials in a formal setting discussing supposed discoveries of other governments finding out things other governments had done and the response being which was this, I dont remember this and (but of course!) they say ah we didn't, we just wanted them to think we knew they knew that we did such and such...yes, its all a bit confusing but there's something clever and amusing about it none the less. Some of the scenes are alot more basic than others, such as Bob and Lyn sat in the desert, flipping coins. The movie is filmed, and narrated at points, in a way in which it comes across like a factual documentary, which also adds to the parody and comedy elements, I feel.The use of the term 'Jedi' (as in people being 'Jedi trainers' and talk of 'the way of the Jedi') said in a matter of fact fashion made this seem quite amusing, as if genuine soldiers could be trained in the way of the Jedi! it made me chuckle when I'd hear reference to that.To me, this movie felt like it had an element of folklore about it, or more as far as the plot is concerned, I suppose. Its like an urban legend or something like that. Its certainly quite imaginative and the characters kept me interested throughout, due to their offbeat nature. I remember thinking that this is the kind of story that perhaps a younger person would write - its based on the novel by Jon Ronson but I wouldn't know how old he was when he wrote it(!), it just has a sort of a childlike quality to it somehow, a naivety perhaps.Its quite funny and very offbeat but there's also somewhat of a sinister undertone to it - as already mentioned, paranoia is something I picked up on. Of course its not to be taken too seriously but it may make you think perhaps and I felt it was good for being a slightly different movie - if I had to name similar movies or similar types of movies, I'd probably suggest comparing it with perhaps movies such as Burn After Reading and the Coen brothers movies in general, perhaps - that or I Heart Huckabees, which also comes to mind.Content wise, there's little in the way of violence or strong language, from what I remember but it does contain drug references (which is perhaps not much of a surprise). I imagine most young kids would struggle to understand it but then most adults would find it pretty strange too, so that doesn't necessarily say much. It certainly won't appeal to everyone but for what it is, a quirky, zany movie with some funny moments and one or two interesting themes, its decent and certainly quite watchable, as I found it quite intriguing, if not perhaps a bit too 'out there'. I'd like to end this section by saying that I thought the ending was quite telling, it ends on an interesting plot twist, which I quite liked. I also liked the use of one or two 70s (I think their from the 70s anyway, either the 70s or the 80s) American power ballads, which added energy and a youthfulness to the movie at those points. Other than that, I'm not sure if there's anything much else I can say - suffice to say, its one of those movies that you have to see yourself, to decide what to make of it - some people may switch off fairly early on and think its a bit too much and others may get really into it and find it very entertaining, amusing and enjoyable - you have to see it for yourself and come to your own conclusions but this review obviously covers my personal thoughts on it."
    },
    {
      "rating": "5",
      "text": "The Men Who Stare at Goats has a great cast, but the mixture of sheer absurdity and narrative incoherence make it a less memorable satire about the army."
    }
  ],
  "recommendations": [
    "burn_after_reading",
    "thor_love_and_thunder",
    "barbershop_the_next_cut",
    "the_cobbler",
    "iron_sky",
    "the_happytime_murders",
    "the_war_with_grandpa",
    "war_dogs",
    "v_for_vendetta",
    "the_hangover_part_ii",
    "guardians_of_the_galaxy",
    "tusk",
    "the_a_team",
    "minions",
    "this_is_the_end",
    "ted_2",
    "what_men_want",
    "deadpool_2",
    "a_million_ways_to_die_in_the_west",
    "baywatch",
    "chappie",
    "jexi",
    "pineapple_express",
    "kingsman_the_golden_circle",
    "guns_akimbo"
  ]
}