{"id": 4142, "title": "The Last Temptation of Christ", "starring": ["Willem Dafoe", "Harvey Keitel"], "runtime": 164, "genre": ["Drama"], "description": "Jesus, a humble Judean carpenter beginning to see that he is the son of God, is drawn into revolutionary action against the Roman occupiers by Judas -- despite his protestations that love, not violence, is the path to salvation. The burden of being the savior of mankind torments Jesus throughout his life, leading him to doubt.", "releaseYear": "1988", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/yt2To3jwUW2EuJJO93aYOselfrE.jpg", "categories": {"plot": 8.25, "acting": 7.75, "ending": 9.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 10.0}, "reviews": [{"rating": "5", "text": "This film was good until Jesus got married then I said screw it. Being a christian and all I have to say I'm really displeased with Scorsese on this one. Maybe next time."}, {"rating": "5", "text": "Good acting but I didn't really like it...at times was a bit pointless and I think they were exploiting what could have been-or not- for they are not real basis, his relationship with Magdalene, so cliche! Quite honestly, not a movie I enjoyed, and couldn't finish watching. Yet, I understand that many love it. It has an artistic value for sure, but the storyline didn't interest me."}, {"rating": "9", "text": "This movie shows a lot of vision, has passionate and believable actors, and makes you think. It might need to be watched twice to fully appreciate. I would actually like to see Scorsese redo this one today, but that won't happen."}, {"rating": "0", "text": "This and 'Gangs of New York' are the two films Scorsese spent the most time preparing for, and they're his worst films by a country mile. 'Last Temptation' is one of the worst movies I'll ever see, shot with indescribable ineptitude and adorned with wretchingly awful music, relentlessly laughable acting and, obviously, heaps upon heaps of torture porn'. The last half hour is an incoherent disaster. Bill Murray once said, 'Religion is the worst enemy of mankind.' Yes, and that goes double for film-makers."}, {"rating": "8", "text": "Great movie. Probably the best \"Jesus film\" I've ever seen. Despite it not being totally according to the Gospels, I feel that it, ironically, portrays Jesus as the revolutionary and troubled man that he was. (Or I believe him to have been!) Whether or not you are a Christian, you should see this film. When it came out, apparently it was a HUGE controversy as well. That in and of itself makes it sort of a historical experience. My one complaint is that at times the acting felt really off and strained and that was disappointing. Really darkened a lot of scenes. Willem Dafoe pretty much knocks the ball out of the park as Jesus though. Solid stuff."}, {"rating": "0", "text": "One of the great directors forgets every last thing he ever learned about how to shoot a movie in 'The Last Temptation of Christ', one of the stupidest and worst-looking films you'll ever see (or, to be sure, hear). Religion really does squander the intellect. Scorsese and Schrader also neglect, of course, to include the episodes of the quasihistorical Nazarene's ministry involving his racism, support of slavery or assertion that the world was just about to end. This movie is a mortal sin, but Scorsese more than atoned for it a decade later by making 'Bringing Out the Dead'."}, {"rating": "10", "text": "Very nice movie. Brilliant acting, narrative and story. Martin Scorcese knows what he does. The best Jesus film ive seen in my opinion. The more I watch Scorceses films, the more I like and respects him."}, {"rating": "8", "text": "The Last Temptation of Christ is an awkward film for me. I think it is a brilliant depiction of the battle between the spirit and flesh that takes place within believers, as alluded to in the opening quote of the film. Thus, the film is very good. It accomplishes this goal with precise skill thanks to Martin Scorsese's skill as a director and Willem Dafoe as an actor. Together they craft this image of a man tortured by the feeling that God wants something from him that he does not want to give. Rather, he wants to be a normal human man, but eventually, he realizes he truly just wants God. For this, The Last Temptation of Christ is brilliant. Where it becomes awkward for me is that this is a film about Jesus Christ. I do not know if this is a great depiction of Jesus in this sense. All that makes him a great depiction of humanity makes him a bad divine depiction. Thus, I am divided in this sense, much like Jesus is often believed to be. From a technical standpoint though, the portrayal and dedication to such is fantastic. Scorsese crafts this really human Jesus who really has the same temptations as everyone else (\"Son of Man\") and really makes the character's religious struggles incredibly relatable. While watching the film, I was incredibly mixed as I watched the film, especially with the odd dream sequences for the temptations and odd depictions of the divine, but when I saw what the film was going for at the end, I gained an appreciation for it that lacked while I watched it. Thus, I really liked The Last Temptation of Christ. It is not a film you can watch pieces of. as without the full picture, you will be lost. Scorsese's direction is masterful as always and Willem Dafoe is phenomenal as Jesus. Overall, the film is a brilliant technical work and phenomenal character study."}, {"rating": "8", "text": "The Last Temptation of Christ is one of my favourite Martin Scorsese films. The acting is terrific and Willem Dafoe delivers a great performance. Thumbs up for this classic."}, {"rating": "9", "text": "Whatever your religion or opinion on the controversial subject matter ,   this is a breathless cinematic experience and one of Scorsese's best . I'm Muslim and the ideas presented here are away far of what I believe who Jesus is *(FOR MUSLIMS he is only a human prophet  not a God .In addition to that , he wasn't crucified and I fully believe in that )... But this is not a documentary or research . It's fiction to explore challenging ideas for Christians and the conflict of god and human within one person.Scorsese is great and you can clearly see his passion about the Christ , but he doesn't want to show a simple biopic about the Christ rather than explore his conflicted mystery that Christians take for granted ."}, {"rating": "10", "text": "One more thing I want to say about this movie. I felt that the Jews  were portrayed positively in this film, compared to other portrayals of Jesus's life, including the Gospels of Matt, Mark, Luke & John. I respect the Gospels, but I've always noticed a clear bias towards Jews in them (excluding Jesus's followers of course). In this film, when Jesus comes into the temple and challenges the priest in charge, the priest has a reasonable defence for the presence of money changers in the temple and when Jesus yells out \"God is not an Israelite!\" even his disciples think he went too far and escort him out of the temple. Though I feel Jesus is portrayed as being ultimately right, the Jews are not portrayed as being totally in the wrong. For that matter, neither are the Romans. I like Jesus's conversation with Pontius Pilate (played by David Bowie) which becomes almost a heart to heart debate at one point.\r The film doesn't really have definitive \"bad guys\" as such. There is \"Satan\" who tests Jesus in the desert and then while on the cross, but you could argue that \"Satan\" is testing Jesus on God's behalf as per the Book of Job. You could say the only true villain in this film is the dark side of human nature which Willem Dafoe's Jesus teaches is mankind's biggest enemy."}, {"rating": "10", "text": "I'm particularly fond of this movie because it tells a story through music & images as it does through dialogue. I also want to highlight the fact that costumes, sets etc are historically believable however all actors conspicuously use their normal accents. At first, it might seem jarring to see Harvey Keitel talking to \"Jesus\". But I'm glad Scorsese decided not to direct his actors to affect silly \"ancient\" accents which end up sounding like inexperienced high school actors attempting Shakespeare.\rDavid Bowie as Pontius Pilate. His understated sense of superiority towards Jesus is perfectly acted. The whole scene fully deserves its iconic status.\rFinally a few words on the controversial nature of this film. As a secularist, I admit that I can happily watch this tale without any concern for anything biblical, orthodoxy or historical. As a cinema person, I can keep it as simple as, \"Cool, Willem Dafoe is a bad ass Jesus!\"\rLast Temptation is a compelling period piece with almost action flick undertones that oddly creates the charm for me.\rFinally, this is a bold departure from Scorsese's typical fare. I respect him for that."}, {"rating": "9", "text": "The most controversial but misunderstood opus of Scorsese, showing Jesus Christ in quite different way at usual. Reluctant about his mission as The Messiah, spreading the Gospel and hesitating about his self-sacrifice, and what if get a second chance -without knowing- from The Enemy. For watch with no prejudice. (Try to spot David Bowie in short feature)"}, {"rating": "8", "text": "The film portrays Jesus as a human tempted to follow a normal life, and who struggles with faith. It explains Jesus's choices based on human feelings: fear & hope. Very provocative film. I was upset for the most part of the viewing - because it voluntarily doesn't follow the gospels - but the movie makes you think and reflect about what is faith. The ending was an excellent surprise for me, and I will do a second viewing for sure."}, {"rating": "9", "text": "The Last Temptation of Christ is an intimate portrait of Jesus, who is the son of God, yet fully a human man. This movie expertly takes the audience along with Jesus on his journey to figure out for what purpose was he sent to earth."}, {"rating": "7", "text": "This film, even if I don't go mad for this genre, is perhaps one of the most original films among those that see Jesus as the protagonist. It is original, fearless, direct and blasphemous to the right point. And Willem Dafoe, as usual, is great here."}], "recommendations": ["silence", "the_case_for_christ", "the_passion_of_the_christ", "the_shack", "son_of_god", "the_young_messiah", "risen", "exodus_gods_and_kings", "overcomer", "war_room", "a_clockwork_orange", "machine_gun_preacher", "i_still_believe", "dogville", "the_reader", "heaven_is_for_real", "crash", "alexander", "the_tree_of_life", "snowden", "the_fountain", "american_history_x", "just_mercy", "contact", "12_years_a_slave"]}