{"id": 2777, "title": "The Family", "starring": ["Robert De Niro", "Michelle Pfeiffer"], "runtime": 111, "genre": ["Crime", "Comedy", "Action"], "description": "The Manzoni family, a notorious mafia clan, is relocated to Normandy, France under the witness protection program, where fitting in soon becomes challenging as their old habits die hard.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3ER4u7T951pMv60hL5bUN6WsAMV.jpg", "categories": {"plot": 5.764705882352941, "acting": 5.25, "ending": 5.181818181818182, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.829787234042553, "action": 6.5}, "reviews": [{"rating": "7", "text": "The Family was a good movie and honestly, delivered about as good as it possibly could. There was plenty of humor, some great wit and \"mob\" dialogue, and the acting was fantastic. Honestly, De Niro was the least impressive role in the film. I loved how they featured the children a bit more and showed how their lives have been affected by the whole ordeal. That being said, the plot wasn't overly original or exciting so the ceiling for a film like this is relatively low. The only thing I felt the movie did wrong was how the family's location was discovered. To me, the entire conflict of the movie hinging on such a ridiculously coincidental happenstance was lazy writing and, while you get over it during the conclusion, it was still rather unfortunate that the went in that direction. Overall though, it's a solid film that never bores."}, {"rating": "5", "text": "Luc Besson has no sense of genre or tone.  Film noir finds humor in amorality, in contradictions, in hypocrisy--not in  sadistic violence.  And comic strip satire can't build suspense which the last half hour of the film tries to create.  The result is a train wreck of a movie  despite good performances especially by Michelle Pfeiffer."}, {"rating": "6", "text": "A fairly mediocre film that is just good enough for a mild recommendation.  Robert De Niro in a gangster movie no question it's over done but at least he knows the terrain.  B-"}, {"rating": "4", "text": "4/10 is a fair score, because i think some people will like it and some not, but for me it was a very decent movie! Good acting, poor story and decent action brings me to this final score."}, {"rating": "6", "text": "The Family is not such a bad film actually. I enjoyed the film as it had that black humor that I've never seen in a film and it has all the time many funny moments. The whole family  even the dog) were a good presence in the film and the characters were built in such way that everyone had something different. Really liked the shooting scene. It reminded me a bit of Kick-ass. There is only one problem in that film. The story has some gaps such as why did they move in Normandie? That is not explained in the film. All in all, if you forget about that problem the family is interesting and humorous black comedy with lots of fun and with a really good Robert De niro and Michelle Pfeiffer"}, {"rating": "6", "text": "Good mafia movie with a lot of dark humor. Seems more like it should have been two movies or at least a continuation of some made for tv series. @ramblingmango"}, {"rating": "1", "text": "This movie doesn't even deserve a score, I couldn't even get passed the first hour without losing my temper at how stupid this movie is. Firstly, having lived in France as a British student for the last 3 years, I have to say that the portrayal of France and French people is abysmal, I don't expect realism, but I at least expect respect toward the things that make France such a wonderful place. Firstly, you'll meet maybe 1-in-10 people who even speak a TINY BIT of English, this movie blows it out of proportion, I appreciate them speaking English as the film is aimed at English speaking audiences, but it also sadly pointed out how dumb the dialogue was. Also, French food is absolutely wonderful and for the most part, isn't much different from the food available in the US and Britain, in fact, almost ALL stores sell British foods, Not at one point have I not been able to get something I've been looking for in some way or another. This movie goes out of it's way to insult French foods, I find it disgusting how they even have the audacity to do that. Next is the portrayal of French people themselves, this films portrays them as being rude, intruding and selfish, NONE of which is factual, the French, especially in the rural areas are the kindest people you will ever meet and they love having guests in their country, obviously, you will meet the odd bigot who dislikes you for being foreign, but this film knocks it out of the ball park in that regard. Now that I've covered that. Lets look at the movie itself, the acting for the most part is okay, But the kids can't act, not at one point did I find their roles believable.\r At the end of the day, all I see in this movie, is a family full of  moving to a town full of bigots and watch the main character randomly kill people he dislikes and watch everyone else do insanely stupid things for absolutely no reason. Not at one point did I even smile through the small amount of this movie that I watched.\r The problem lies in the direction, this film tried to be comedy, but there is NOTHING funny about the situation, Why are films like The Iceman and Goodfellas so great? Because they are dark, brutal and serious. If this film took the correct direction, it could have been a dark and brutal gangster film, but it decided to go with the quirky comic approach to a situation only madman would find funny.\r It's a shame because De Niro's acting is superb as always, shame everything else about the movie lacks any sense or logic. Maybe one day Il give the film the benefit of the doubt and watch it with a few friends, but I honestly couldn't see the film getting any better."}, {"rating": "4", "text": "Everyone in this movie is unnecessarily violent. I'm not even going all Jim Carrey preachy here but the main characters beat up innocent civilians for no good reason at least a dozen times with tennis rackets and baseball bats. And when the mafia style shootout starts, it's over in 10 minutes. Every scene just was paced poorly and overall this was a hugely wasted opportunity, especially considering the cast."}, {"rating": "6", "text": "I was expecting a raucous mobster comedy reminiscent of \"Analyze This\" but It just wasn't that funny.  In fact I think I was about the only person in the theater laughing... and not very often. In spite of his brilliant career DeNiro has become typecast and Tommy Lee Jones' dry wit was completely stifled. It further lost its comedic identity when it swung abruptly in the other direction to wrap up as a \"too serious\" dramatic action flick.    I didn't hate it and It did serve up a couple laugh out loud moments but as so often happens, it failed to deliver the goods that  the trailer was selling. I guess you could say forgettaboutit, I already have."}, {"rating": "8", "text": "Subtle humor is sparsely accessible  to cheap slapstick comedy fans, kitsch-ish monster/dragon/vampire lovers, so thank you Mr. Besson for raising the bar. Brilliant casting/acting helped as well. Snobbish critics, please feel free to smirk your nose."}, {"rating": "4", "text": "De Niro and Pfeiffer may give it their all, but \"The Family\" ultimately succumbs to the burden of its own ridiculousness and fairly unlikable characters."}, {"rating": "5", "text": "While there's some good acting, it's still not enough to hold this \"dark mob comedy together. Overall, it's a forgettable mob movie. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."}, {"rating": "8", "text": "Great performance by Robert De Niro and Michelle Pfeiffer and one of the best comedy of the year  I don't understand the critical bashing  RogerEbert.com gave it 3/4 and that's enough for me"}, {"rating": "10", "text": "It would seem a lot of people just don't \"get\" this film. It's not quite as loud & stupid as most of the big comedy movies in recent years and I think the fans of those movies are the same people that don't understand this one. Anyway, I loved it and would watch it again. The family members were very enjoyable and I would actually like to see a sequel. The only part of the movie I didn't like (spoiler incoming immediately) is when the daughter tried to kill herself over the math teacher. 1st of all she talked and acted like a female who has already experienced sex, a lot of sex. Yet it is revealed that the math teacher was her 1st.... and then she wants to kill herself because he didn't fall madly in love with her after hooking up one time? Um, ok then. But besides that I have no complaints."}, {"rating": "0", "text": "My review is going to be very short because this movie doesn't deserve a lot of analysis. This movie was billed as a dark comedy, there is a lot of darkness via the extreme violence and not a chuckle in the whole movie. As far as I was concerned I never smiled, giggled and certainly never laughed. How can you laugh at gratuitous violence to undeserving innocent people. It was so predictable that it held no surprises whatsoever. Don't waste your money. After 10 minutes I wanted to ask for a refund, but my friend had fallen asleep and I did not want to wake him up and tell him we were leaving. So I sat through the whole stinking thing. Basically this movie was not funny at all. Unless you were a ten-year old. And the movie is way too violent for a 10 year old. The theater was fairly crowded but the people were not laughing. This film is pure pornography. Not sexual pornography but violence pornography. If I'm going to watch pornography it's going to have babes with big boobs and guys with big   well you know!\rBasically A Diarrhea of Violence"}, {"rating": "8", "text": "I don't know what to exactly \"say\" about this movie. The acting was top-notch throughout the entirety of the film, and there were some great moments. What genre of movie does The Family happen to fall under? There's no real way to nail it down as it can be serious at moments while completely unbelievable and funny at others. Few sub-plots throughout The Family could have and should have not been included. Worth a watch if you're fond of Robert De Niro."}, {"rating": "3", "text": "While having a solid cast, Luc Beson delivered one of the worst picture in his career! Humor in it was written for 12 year old boys, plot is boring and predictable. De Niro never before played such a hollow character! This movie is waste of time"}, {"rating": "6", "text": "A New York mob family in witness protection (headed by Robert De Niro & Michelle Pfeiffer) moves into a small French village, but their old habits die hard (literally). When they're crossed, all four of them are prone to violence, which provides much of the film's dark humor. Director Luc Besson (\"Taken\" 1& 2 and \"Transporter\" 1, 2, 3) knows how to stage action, which pops in regularly. The comedy generates more smirks that laughs, but the enjoyable performances and assured direction combine to create a slight, but fun entertainment."}, {"rating": "6", "text": "Though being sold as a comedy “The Family” didn’t get a single laugh, smile or giggle from the audience with the over the top violence and even at points when it is trying to be a spoof or parody or satire the sadistic beatings and various scenes with hammers, bats, heated grills cut off any smile you might have.\r Michelle Pfeiffer, as beautiful as ever, is funny just with a look from a scene shown in the coming attractions and even not considered a stretch for Robert De Niro he has a few joyous moments ‘debating’ “GoodFellas”. Playing husband and wife they are in a witness protection program with their children played by Dianna Agron, who certainly can pass for Pfeiffer’s daughter and while John D’Leo bares no resemblance to any of the other three he does come off as a chip off the old block of his gangster father.\r Tommy Lee Jones adds some weight to the film just with his presence but has a role that he can only walk through. Many of the supporting players as police or FBI agents and gangsters all look, and act, their roles believably.\r I think the enjoyment of this films comes from the director Luc Besson, who also had a hand in the screenplay with Michael Caleo, and executive producer Martin Scorsese who have been in this territory before and don’t take themselves seriously.\r “The Family” is much better than expected which is always a good surprise when going to the movies."}, {"rating": "6", "text": "This flavor will mostly appeal to older audiences leaving younger people bored and wondering. All actors reprising old characters. Tommy Lee Jones as head of an FBI division, De Niro a mobster, and Pheiffer as married to a mob, wow what a stretch. Either way it does make for a charming 2 hours you will spend in the theater since a movie like this is easy breezy for these skilled Hollywood elite. and the kids will keep it somewhat fresh enough to pass for new material."}, {"rating": "6", "text": "Overall, The Family was an o.k. movie. The acting was good and no one really felt out of place. However, the pacing was medium and it was more of a dark comedy as opposed to an action film. Also, It is just hard to believe the FBI would relocate an entire family to another country not Canada and everyone in France speaking English and not French."}, {"rating": "7", "text": "The Family doesn’t represent Besson at his best, but here the filmmaker once again proves that he is a storyteller who knows how to produce European pop-art cinema that is far more delightful (and, in many ways, more intelligent) than you might expect, based on the film’s sitcom-style description. There are certainly worse ways to spend two hours at the theater than by watching De Niro play an old Mobster in a self-reflexive action/comedy (emphasis on the comedy) made by an eccentric French autuer."}, {"rating": "7", "text": "The first half is mediocre but the second one is better. The film doesn't have the usual stupid jokes, each character is given his/her own subplot, the performances are good and the ending is satisfying. Moreover Dianna Agron is gorgeous.\rargonautis.eu"}, {"rating": "5", "text": "An unbelievably slow paced movie. There are moments of humor or violence thrown to give this movie a pulse every now and then, but ultimately this is a very dull and lifeless film. The film is at's best when it is focusing on humor. The violence just comes off as sadistic and cruel. John D'leo steals the show. He, Dianna Agron, and the plots surrounding them end up being the best parts of the movie, making the parents (Pfieffer and De Niro) uninteresting. They do not save the movie from ultimately being boring however, and Agron's story ends up turning into just another broken heart story.\r Overall I found this movie to be a boring waste of time. There's not enough humor and much it's violence ends up coming off as unnecessary. There are some interesting bits here and there, but overall the film is lifeless and uninteresting. My recommendation is that you just pass this film by. It falls short in just about every area leaving the film to be stuck in some sort of limbo of mediocrity. I thought this mob family would be more interesting."}, {"rating": "6", "text": "Nice passtime, the scenario isn't that full proof, for instance whose body is in the family car trunk at the very beginning of the movie? A bit more, the end scene of catching up the mob who  follows the family was so naive for a bunch of such professionals who easily killed policemen at the police and fire stations. Great acting from the family, Roberto De Niro, Michelle Pfeiffer, Dianna Agron, and John D'Leo, also from FBI Tommy Lee Johns. Mixed comedy and violence, controlled smiles and tensions, exchanged American and French mocking. A low cost movie that didn't pretend much is worth seeing."}, {"rating": "5", "text": "A gangland family go into witness protection in France as their enemies try and track them down in this new thriller from Luc Besson. It has its moments but you do get the feeling the cast are going through the motions, and when DeNiro sits down to watch Goodfellas at a local film club you get the feeling this has jumped the shark. Everyone involved can certainly do better, and Besson is a world away from the highest of Nikita and Leon."}, {"rating": "6", "text": "Although it's lacking in story, depth, comedy and action, The Family is still a charming film great actors, a few memorable scenes & quotes and an interesting premise. As an action film, it's a bit of a failure. As a comedy, it doesn't contain enough funny scenes. As a package, it's a decent film - not for its creativity or quality but for its overall entertainment value."}, {"rating": "6", "text": "Getting into the Witness Protection Program was the easy part, staying there is what's hard, in the latest Luc Besson comedy, The Family. With huge star power and a well known Director, this film had all the makings of a classic, unfortunately it has some major plot holes and lacks direction. One moment it seems like you're watching a comedy, that is about to break out, but then in the blink of an eye it's a drama, addressing difficult issues. The big tagline is that the Manzoni family is in hiding, and can't seem to behave themselves, but it's a lot more than that. The FBI has decided to place this Italian, Brooklyn mob family in the south of France. Even if their behavior wasn't outlandish, how is a Brooklyn family supposed to fit into a small village in France? They would naturally stand out like a sore thumb. Besides the obvious plot holes, other things are left out of the equation, the most glaring being the back story behind the families joining the program. While the story is all over the place, the film does feature a truly all-star cast and trust me, they help. If this wasn't De Niro, Jones, and Pheiffer, the film would have completely fallen apart and failed to hold my interest. The fact is that these are some the best actors in the world and they all do a tremendous job of keeping the audiences attention. There isn't much of a story here and it's nowhere near as funny as it was advertised to be, but big names and great performances fill seats in the theaters and that should have been this films hook. I'm not sure if the Family was a drama or some kind of dark comedy that I just didn't get, but aside from the terrific performances from an all-star cast, I was highly disappointed by this film."}, {"rating": "6", "text": "The movie holds together with Luc Besson's style of directing, even with all its stereotypes. It has its moments of being funny with violence but eventually simply becomes a little ridiculous to fully enjoy."}, {"rating": "2", "text": "An awful film all the way through. It is never entertaining, funny, or creative. The script is so thin and weak I can't imagine why anybody would be associated with it besides cashing a check."}, {"rating": "3", "text": "This movie is not horrible, but it is certainly not very good. First off, it is not very funny and as a comedy, that is a major negative. On top of that, the plot is weird. It constantly just shifts between things that make no sense upon further examination. It is not confusing at all, but some of the things that were included (most of the things that were included) served little-to-no purpose. In addition, the ending is horrible and leaves you scratching your head, wondering why they thought it would work well. Luckily, the acting is solid and the movie itself is still relatively fun and enjoyable. It is far from being a good film, but if you need something to watch, you could certainly do far worse, but do not expect The Godfather."}, {"rating": "7", "text": "It was the story of an American family who are living under the witness protection in somewhere southern France. This is not an ordinary family where love and care are given the first preferences. They are also funny at a time for their atrocity against the annoying people. Watching it makes you feel good for the moment but it won't last for long. Call it a better commercial movie to enjoy our 2 hours with it.\r Blake is a given fake family name for a family who are under witness protection. This trouble making small family with four members finds hard living alongside their new neighbors. They frequently move around different places with different names. One of those is where this movie takes place. And as usual it ends with what we saw on the opening. That makes us to think a sequel is in a due to clarify the remaining doubts.\r This is not what we expected from the writer, director of hit movies like 'Leon: The Professional' and 'The Fifth Element'. He made many good movies as well average ones and this movie comes under okay type comedy-thriller. It had a good pair of actors, De Niro and Michelle Pfeiffer. But the movie did not deeply explains all the characters that involved in the story. In halfway of the movie you will come to know there's nothing secret behind what opening sequences that created a puzzle of series mysteries."}, {"rating": "7", "text": "Yet another black comedy from Luc Besson. But in contrast to some of his earlier movies, this is actually good. Not overwhelmingly good, but definitely entertaining.\rRobert De Niro returns to the crime genre in style alongside Michelle Pfeiffer in two brilliant performances, however their two children give the best performances in the whole movie. Regrettably I don't know either of the actors names off the top of my head because both of them are reasonably unknown, but they both deserve to be in more stuff (especially John D'Leo as the boy). Every now and again Tommy Lee Jones pops up too. The plot makes sense and holds up, even in the overblown final act. And the action, again even if the overblown final act, is exciting and will keep viewers only watching for explosions entertained.\rMuch like most of the other comedies I have watched in my entire life, the main problem is that I didn't laugh much. It's either that this is an unsuccessful black comedy or that I'm an unhappy pedantic  who rarely ever smiles, but I did laugh a below average amount of times. Sure I was almost in hysterics at the very clever joke about De Niro being able to express any emotion just by saying  and the two agents who are constantly listening in to the families every word have some hilarious conversations. But most of the other jokes only got a smirk or a weak smile out of me.\rHowever, that does not stop The Family from being a hugely enjoyable black comedy, which delivers excitement and thrills (but fails to satisfy the audience by way of jokes) without forgetting emotion and story arcs. To my surprise I thoroughly enjoyed The Family, and strongly recommend it."}, {"rating": "6", "text": "Suffering from uneven tones and characters that lack any real development, “The Family” is a slight disappointment.  The story is simple but something that could have been easily entertaining; however, the film can’t decide if it wants to be a dark comedy or a crime thriller and the way it jumps back and forth makes the film feel grating at points.  Additionally, despite the fact there are some great performances in the film, the characters really don’t have much depth or get much development as the film progresses.  However, the film has some amusing moments and Robert De Niro and Tommy Lee Jones are great together in it, so it has some merits…just not much beyond watching it once."}, {"rating": "4", "text": "The Family starts off as an off-kilter, dark comedy with a promising storyline and some nice views of Normandy. However, the filmmakers waste the rest of the film with violence that doesn't let up, horrible plot points, and an unfulfilling ending; the movie sinks deeper and deeper every minute. DeNiro's character is just so sadistic and unforgivingly violent with no regard for human life whatsoever. If you give him back the wrong change at the grocery store, he'll practically smash your head on the counter, and his character is anything but likable. The kids are smart and resourceful, but their talents get wasted on gunfights and unnecessary bloodshed. Michelle Pfeifer is really the only person in the movie with any shred of morals. Tommy Lee Jones just smirks and scowls as usual, not really adding anything more to his character. Though, I can say that I enjoyed the little Goodfellas in-joke for DeNiro. It was a nice touch to an otherwise brutal movie. Watch \"The Family\" on a Friday night if you dare, but do not pay full price for it, whatever you do."}, {"rating": "8", "text": "THE FAMILY is a very entertaining comedy thriller about a former mob boss and his family who just can’t seem to control their sinful, criminal, violent urges. The movie is very well done by all concerned, including talented French writer and director Luc Besson, but the foul language and immorality are over-the-top, or excessive"}, {"rating": "6", "text": "Owen McKenna Rio Rancho, NM. I was told the movie was very funny. It did not meet my expectations. I admit I laughed a few times. I still think Di Nero is a great actor, just not one of his best roles."}, {"rating": "6", "text": "Ok, it wasn´t anymore that I expected. It´s a good black humor movie, although it´s almost everything supported in the violence. DeNiro plays a really good role. Very good casting."}, {"rating": "5", "text": "The Family comically presents the struggle of a small mafia family and their attempt to lead an honest life. When the notorious Manzoni's arrive in Normandy (France), now hiding under the witness protection program after having snitched on Don Luchese, the seemingly charming clan struggle to settle down in their quiet new life away from the mob, often resorting to their 'old ways' when faced with nuisances. This leads to some quickly escalated violent scenes, which are decently entertaining, for those who can appreciate the dark humor. In between it all, there is also plenty of cultural clashes, namely American and French, which are often dealt with in the same spirit. Despite its moments of comical triumph, the film never really takes you anywhere and the nature of the characters seems quite unclear, as the sentimental and more serious scenes are mixed up within the dark comedy. The overall good performances from the cast carry you till the finish, but they leave you with a mob flick that you will soon forget."}, {"rating": "1", "text": "This was a not a so much of a dark comedy as it was a bad joke.  At my most generous I could liken it to a want to be Pulp fiction without the commitment,plot, acting, humor , and realism .  Overall it was thrown together and poorly acted. Save your time"}, {"rating": "4", "text": "\"The Family\" 10 Scale Rating: 4.0 (Bad) ...\r The Good: The first half is decent as the fish out of water cliche actually works. DeNiro, Jones, D'Leo, Agron, and Pfeiffer are all game as the film is amusing and interesting early on.\r The Bad: Then the tone dramatically shifts to a very dark and action packed film. I don't mind genre switching when done right, but this was poorly done. It was so jarring that it takes away from the film and causes it to lose all of it's charm."}, {"rating": "6", "text": "This was so over the top. Everything that happened was insane. How does any of that happen in real life. How are the local authorities not involved?!? Jesus... Smh"}, {"rating": "9", "text": "Luc Besson is famous for his action dramas and what we have here is the portrait of a Mafia family in a mixture of dark comedy that presents one with a question.  How does a family live in 'witness protection'?  On the run, looking over your shoulder day to day, changing names and moving around with no true friends you can trust.  We get a feel for that in 'The Family'.  Sure there are a lot of one-liners spreckled throughout the film peppered with bits of action to keep the plot moving along. The tension between all the characters kept the film interesting and yes, the story is simple but perks up like a French souffle. The movie is shot very well and the transitions had just enough of a creative touch to let you know the editor is quite talented.  It's clear Besson was having a bit of lite hearted fun ... and why not ... dark, sarcastic humor it was and if you were bored with this film you should stick to 'slap-stick' comedy."}], "recommendations": ["keeping_up_with_the_joneses", "blockers", "american_ultra", "the_cobbler", "logan_lucky", "burn_after_reading", "ready_or_not", "barbershop_the_next_cut", "seven_psychopaths", "the_five_year_engagement", "the_nice_guys", "the_gentlemen", "the_spy_who_dumped_me", "pineapple_express", "tag", "instant_family", "i_feel_pretty", "neighbors", "identity_thief", "war_dogs", "the_happytime_murders", "the_wolf_of_snow_hollow", "the_men_who_stare_at_goats", "johnny_english_strikes_again", "mortdecai"]}