{
  "id": 3567,
  "title": "The Ritual",
  "starring": [
    "Rafe Spall",
    "Arsher Ali"
  ],
  "runtime": 94,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "A group of college friends reunite for a trip to the forest, but encounter a menacing presence in the woods that's stalking them.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hHuJqzby593lmYmw1SzT0XYy99t.jpg",
  "categories": {
    "plot": 7.333333333333333,
    "acting": 7.5,
    "ending": 7.0,
    "soundtrack": 6.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Diffenitely worth a watch. Great and dark atmosphere and an interesting plot. The acting and the script were also great but i disliked the ending and i think the main villian was not appopriate for this story."
    },
    {
      "rating": "8",
      "text": "As a fan of non-horror films, I would try my best to review this one. First, impressing choice of  music and sounds and combining them with silence. This created great scary scenes, that determine a horror movie. Second, the dialogues were realistic and that contributed to the emotional and cognitive intensified effect of immersion in film. Plus perfect acting and interesting story with hidden meaning. So I guess The Ritual could be a little bit boring for real horror fans, who have watched a lot. But I'm very impressed by this film and I recommend it!"
    },
    {
      "rating": "8",
      "text": "An overall good film. There's more character development than in your typical horror movie. The viewer can easily feel the tension in the atmosphere and between the characters. Some plot elements could have been developped a bit more but it was a good entertaiment, I recommend it."
    },
    {
      "rating": "6",
      "text": "While the cinematography was good and the acting performances were decent enough, they couldn't save the movie from being a cliché, predictable and even boring at times disappointment. If you like horror movies set in the woods with loud noises and quite a few jump scares, you will probably enjoy this one, if not, you'd be better off with something else."
    },
    {
      "rating": "9",
      "text": "Just watched this after Kojima tweeted about it. I had previously decided against watching it after reading reviews. After having watched it, I am quite annoyed with how low scores this movie gets from the pro reviewers. The tension this movie establishes is beyond what I've seen in a long time.It is absolutely fantastically put together. It reveals just enough throughout to keep you curious about the whole thing. The acting is top-notch, especially in the scenes where the group is falling apart from sheer psychological pressure.And the effects, oh boy, is it well done! And there's a twist to the story that I'm not sure people will get unless they think the whole situation through. And it's a nasty realization when you do.This movie surpassed my expectations on pretty much all levels."
    },
    {
      "rating": "9",
      "text": "this is essentially the best horror movie I've ever seen and i cant believe the critics are being such cucks. its a giant moose god that stays in the woods and makes you see things from your past whenever its around and if your not the main character you get skewered by a tree branch. its absolutely perfect and worth a watch every Halloween. I missed the scene where they first arrive at the first cabin but I doubt that would change how good this film is. My only wishes are that it wasn't longer and that the leads yelling didn't sound so much like Howard Deans."
    },
    {
      "rating": "7",
      "text": "A fantastic horror film with a lot of terrifying sequences and great acting. This movie is a better version of The Blair Witch Project. The creature design is mind-boggling, it's so impressive. The monster is truly unnerving and I'm so happy I didn't get to see it till the end of the film."
    },
    {
      "rating": "8",
      "text": "Very underrated mystery/horror movie with truly dark and dense atmosphere that grabs your attention and dont let go up to the very end. Plus very unique monster idea and design."
    },
    {
      "rating": "8",
      "text": "Since its inception, I’ve typically dreaded scrolling through the horror options found on Netflix. The service has always been littered with straight to video garbage and lackluster sequels, although recently the service’s original programming has become my go to for a horror fix. Releasing 1922, The Babysitter, and now The Ritual directly to their service has made access to Netflix more important to me than ever before.The Ritual starts out with our protagonists planning a group vacation while at a local bar. After throwing around some ideas and nothing being set in stone, the group heads to the local liquor store where one of the group members is violently mugged, resulting in his death. Fast forward 6 months and our group of characters are hiking through Sweden, which was the late friend’s suggestion. While the characters are not horribly written nor are the performances poor, they are simply interchangeable, with only occasional bits of personality shining through.Early into their trip one of the friends suffers a minor injury; both his friends and the viewer will likely question whether or not he’s faking it. When one of the men notices a shortcut through a dense patch of forest area, they debate on whether they want to stick to the path or continue through parts unknown. Very soon after the group enters the heavy foliage, things start to get weird.I’m not sure about most people, but I can wholeheartedly say that seeing an eviscerated deer hanging from about 10 feet in the air, still dripping blood would probably have me running back out of the woods as fast as my feet could carry me, almost as if my head was on fire. Does this affect our group? Not in the slightest. While there are a few comments about how it could have been a bear or hunters, it really doesn’t feel plausible and makes our heroes look a bit dumb, but they proceed anyway.After a brutal storm begins they seek shelter in an abandoned cabin, which houses a strange human-esque shaped shrine in the upper floor. This is when things really pick up; characters will wake up inexplicably outside of the cabin, found naked worshiping the shrine in their sleep, hallucinating or suffering strange unexplained wounds. From here on out, it’s clear that something is out in the woods and it does not like them one bit. At this point in the film, the tension finally picks up and the horror they are facing really sets in.I am a huge fan of movies that are so confident in their visual effects that they show the creature or monsters up close in full light without the need to use smart camera angles, but can also respect when the director chooses to hide a more impressive creature to build tension; The Ritual has the best of both worlds. Early into the film you will occasionally get a glimpse of the creature, but it’s not until the last fifteen to twenty minutes of the film you really get to see it in all of its glory. One scene, which features a blazing fire behind it, really highlights the creature and will likely haunt you for days, which says something considering you only see its silhouette at this point.Up until I actually saw the being, I felt that the movie was going to head down a B movie route, lacking the budget for the grotesque thing that we actually ended up with. The monster would be best described as a moving Rorschach test, since anyone you ask will likely have a different description of it. For me, it appeared to be a mummified horse, with a spider-like head made of corpses. Regardless of how you look at it, the thing is one of the best designed movie monsters in years.While the acting isn’t outright bad, I did have to watch the movie with closed captioning due to the actors’ British accents being extremely thick. Coupled with their unique slang, some of the more verbal scenes are a bit hard to follow. It may have been the difficulty I experienced following the conversations, but I found these areas to be a bit dull compared other scenes. When the film picks up, it rarely slows down. The fact that you do not see the creature in more than brief glimpses throughout the midpoint of the film, as well as the occasional flash or flicker of something moving in the foliage around the lost hikers, you’re bound to be on the edge of your seat.While The Ritual is nothing we haven’t seen before, it does offer a solid horror experience at no additional cost than the standard Netflix fee. It’s far from perfect, but the creature alone makes this one worth giving a view."
    },
    {
      "rating": "6",
      "text": "I mean this is better than most of the other Netflix originals. It's not original or even scary but the third act definitely had a pay off."
    },
    {
      "rating": "8",
      "text": "The great movie for Netflix's horror side. This is a psychologists horror that has a good suspense and a fascinating plot with psychedelic and religious parts"
    },
    {
      "rating": "10",
      "text": "I think this was a very innovative movie as far as antagonist design and plot go, as I was sucked in right until the very end. The acting was great, the backstory behind the antagonist made sense, and the overarching struggle between the main character and his past and present dilemmas were all connected well without exposing too much and giving away crucial details. This definitely helped to keep the audience guessing. Overall, I recommend this movie wholeheartedly. Ps- My girlfriend was so spooked I couldn't even get her to finish the movie, if that's any indication that it is in fact scary haha."
    },
    {
      "rating": "10",
      "text": "In my opinion this movie is really good. He felt like his best friends death was his fault. He hallucinates the moment he died and thinks about how he could have helped. As the movie goes on the scenes get weirder \"scarier\". I actually feel bad for Luke because at the end of the movie, all his friends are dead. I also liked the way they put the Jötunn in the movie and the way that made it look. When Dom was about to die and he was seeing a woman in front of him but they zoom out and its the Jötunn I thought that was cool. There was some gore and blood and I think it fit this movie well. So ill give this a 10/10 :))"
    },
    {
      "rating": "7",
      "text": "There's something more convincing in the British vocalisation compared to the usual American accent. It feel much more real, coupled with the fact that these are older blokes as opposed to the teen fodder that usually gets offed in American productions. Setting a haunted forest premise in picturesque Sweden is such a good idea it seems absurd that this is not done more often. After all, those fairy tales that have terrified children for generations have their roots in European forests, so it is fitting that this works so well.It is tense, terrifying, and truly beautiful, offering the barest of hints to begin with and developing further as the tale progresses. A must see."
    },
    {
      "rating": "8",
      "text": "This is a horror with a bit more of character than what I expected. It has a lot of great ideas, a great monster and much more realistic characters than your usual dumb teenager. Forests can always creep me out and this one uses the forest's creepy potential to its fullest potential. The moments I was truly amazed were few and mostly towards the end, but it was still a good experience all the way through. This is a movie made by people who know what they're doing."
    },
    {
      "rating": "3",
      "text": "They should've stayed at home drinking tea.You can see the effort they spent with the CGI for a budget movie. If only they had remembered that the plot is part of the movie too. So boring, so goofy, so poor..."
    },
    {
      "rating": "10",
      "text": "Just had to write a review for this film as I really couldn’t fault it. One of the best horror-thrillers I’ve seen in a LONG time. Some might say the beginning or premise is clichéd but the story has quite a few genre twists that will keep you guessing. Great acting, suspense, adventure, intrigue and chills. At times it very much reminded me of a Guillermo del Toro film! Netflix scored well acquiring this one. Watch it."
    },
    {
      "rating": "9",
      "text": "This was masterfully done. As with all horror films, If you don't like horror films you should give it a miss and certainly refrain from reviewing it.  Everything here was meticulously crafted.  The attention to detail, sound scape, visual effects, performances, story, pacing and even the script were all first rate.  Very few budget horror films are able to pull this off.  It's probably the best in what Ill consider it's genre (scary forest movies). People will compare it to other movies in it's niche because it's easy for them to do so.  Fine. Neat. Its like blair witch in the same sense that star trek is like star wars.  For me it was a better depiction of Lovecraft-style helplessness than I've ever seen. It also featured probably the best creature design and execution I've seen since Alien. Finally it managed to change out its rythm and rules set like modern masterpiece horror films such as \"martyrs\" were able to do. Like martyrs, this film will be wildly underrated.  It will also likely be lost for many in the ocean of content coming out.  I hope the creators receive the praise they deserve.  I'm very glad I saw it. If you like lovecraft, horror, mud or monsters I highly recommend this. The critics are wrong again."
    },
    {
      "rating": "8",
      "text": "One of the most surprising horror movies to come out in a long time. The basic premise (some may call it simplistic and cliché) actually serves it very well, because it quickly veers into a territory that has never really been explored in horror films before. It's been explored, but never without this level of success. The Ritual has a firm grip on atmospherics and a very competent cast elevate this film with a lot of internal conflict and palpable dread. It's beautifully shot and briskly paced, with plenty to go in terms of phychological anguish and physical revulsion. Some nasty twists elevate this into a tale of pure Lovecraftian terror, that which is quite cosmic and unspeakable. It just gets rid of the tentacles and replaces that by ancient Nordic pagan deities worship mayhem.Netflix originals are incredibly hit or miss, but in the horror department, this is clearly a hit. It's part The Descent, part The Void, part The VVitch, part Deliverance. It just works, and the movie's self awareness certainly works in its favor. However, if you find the unknown more terrifying that what you can see, you may be disappointed once the movie chooses to make it's big reveal."
    },
    {
      "rating": "9",
      "text": "This was probably the most surprising creatively original horror I've seen in years. I thought the trailer looked promising enough but never expected this story to absolutely enthrall me like it did. From the beginning your attention is captured with a very brutally somber intro that plays a deep role into the overall tale. You're then immersed into a magnificently scenic, yet eerie mountain forest setting where the atmosphere is incredibly effective. I cannot say enough about the beautiful imagery and camerawork throughout. As everything unravels it becomes an outstandingly creepy and suspenseful turn of events unlike anything you've seen before. They executed the big reveals towards the final frightening half hour brilliantly and thats where this horror film rises above so many with its extremely unnervingly bizarre conclusion that you will never see coming. The creature design was insanely crafted and refreshing, and will stay in your mind forever as one of the best concepts put on screen. Rafe Spell's performance was utterly intense, and you really feel for his character after certain events. Overall I'd rate this an 8.7/10 and would HIGHLY recommend it to any watcher. I really wish this received a theatrical release around the world but you can now add it to the many great netflix original films that keep surprising everyone."
    },
    {
      "rating": "8",
      "text": "This was a film well worth watching. It's story sucks you in even before the bizarre twists and turns ramp up the creep factor. Beautifuly shot with a gorgeous panorama. It seems a lot of horror movies disappoint. This one does not."
    },
    {
      "rating": "9",
      "text": "A modern blair witch, without the shaking camera but with one big-bad forest nightmare. A beautiful horror movie with a great story, acting and cinematography. It'll keep me from hiking in forests, for many years to come."
    },
    {
      "rating": "6",
      "text": "Lads don’t go on typical lads holiday and lads quickly regret not going on typical lads holiday. No they don’t go to Vegas, they go hiking in Sweden in memory of their deceased friend (insert generic lad name here) but when the bunch of mates decide to take a shortcut through the scary woods in order to get back to the pub sooner things don’t quite go according to plan. Oh sure take a shortcut through the creepy woods sure why not mate. What could go wrong mate? Well we’ve all seen The Blair Witch Project so a lot could go wrong mate. Perhaps it’s a little unfair to compare it to The Blair Witch Project but honestly you can’t help it.Are they being followed? Hunted? If so just what is it that’s hunting them? A ghost? A monster? A giant tree perhaps? If you want to find out then you better go see it for yourself. The first hour or so is scary enough, atmospheric to say the least. But the last half hour…not so much. At some point it just starts to get silly and I couldn’t help but think the book is probably a lot better than this. Nothing special mate, enjoyable in the moment and instantly forgettable. Recommended for all you horror fans."
    },
    {
      "rating": "3",
      "text": "VERY stupid. The only good things are Swedish landscapes (duh!!) and actor Robert James-Collier because he's handsome. Otherwise, even the elsewhere good Arsher Ali  has nothing to say, simply because the script is so dull.Really. The \"twist\" which should have made this story different from all the other forest-horrors is under developed and thus idiot. The main protagonist, annoying/irritating from the beginning and then in end, transformed in a sort of Bruce Willis, even worst. WTF?Imagery-wise, some of the props (Pagan statues) inside the cabin were pretty good. Sadly, the monster wasn't."
    },
    {
      "rating": "6",
      "text": "All the construction of suspense and mystery does not show anything new or original but at least it's quite functional, it really immerses you. The problem is that comes the point in the last stretch where the film gets lost after the mistery gets revealed and also with that ending that almost completely derails the entire film."
    },
    {
      "rating": "1",
      "text": "I was hoping it will give us some reasonable explanation in the end, but that not happened."
    },
    {
      "rating": "4",
      "text": "IL  Grido (The Cry) is a bleak Italian drama of a young de facto husband and father (Aldo, played by Steve Cochran), trying unsuccessfully, to overcome his grief at his relationship falling apart. Beautiful Alida Valli plays his ‘partner’ (Irma) who has taken up with another man. She’s unsure if she’s making the right decision but as she’s done this sort of thing before, it appears maybe she has an unstable mental condition. In fact, this picture tends to paint a rather unflattering picture of womanhood. Aldo takes to the road looking for work with his young daughter in tow. Most of the women he comes across are either loose or uncommitted to a lasting relationship. One of the only stable women is Elvia convincingly played by Betsy Blair (Mrs Gene Kelly) She’s an old girlfriend of Aldo’s who’s still hopeful of rekindling the relationship – unfortunately for both, Aldo is unable to get over the loss of Irma and following a drunken flirtation by Elvia’s sister, played by beautiful Gabriella Pallotta, he decides it’s best to move on. The locations are as dismal as the story situations and there appear to be some minor continuity problems but, it’s the rather ambiguous ending that seems to be more ‘tacked on’ as a means to an end - relying on tragedy elements to make it memorable.  This received some Awards but these look to be more from an industry trying to ‘sell’ the picture - than for art’s sake. It’s always a curious watch and director of Photography Gianni Di Venanzo (8 1/2) gives it a class look. The music score by prolific composer Giovanni Fusco (The Confession) is rather unusual with a nice piano soliloquy giving some haunting quality - all performances are generally good but the story and settings may not please a big audience. At least it’s more approachable than director Antonioni’s later pretentious efforts and the DVD Mastering offers a good transfer – subtitles are also OK."
    },
    {
      "rating": "5",
      "text": "It was nice to see a group of jittery 40 something British idiots wandering around the woods being offed one at a time, as opposed to the usual group of jittery 20 something American idiots suffering the same fate. Apart from that, nothing much to see here.It’s all been done before, sometimes better and sometimes worse. The wee beasty doing the offing wouldn’t scare your grandmother, and neither would the witchy mumbo-jumbo that supported its existence.The main character had a bit of a back story, but it didn’t make me care about him. As for his hapless mates, every time one of them died it was a relief – fewer expletive laden panic attacks to bear.So, bad but not terrible, instantly forgettable ‘horror’ nonsense."
    },
    {
      "rating": "5",
      "text": "Have you ever watched a horror movie?  Congratulations, you have seen The Ritual.  Its a completely fine movie, really, there isn't anything really wrong with it.  It's just that it follows the formula so closely that I was watching it and honestly wondered if I had already seen it before."
    },
    {
      "rating": "5",
      "text": "No me pareció tan buena como esperaba, tiene un ritmo demasiado plano y el grupo de personajes principales tienen el encanto y carisma de una cortina de baño, tan solo el protagonista estuvo muy bien hecho, el haber sido cauteloso, prudente e inteligente le valió el pase a la merecida supervivencia y es todo lo que hay."
    },
    {
      "rating": "4",
      "text": "The first 40-45 minutes of the movie was just a bunch of yelling, bickering and babbling back and forth between the characters. After that, a typical and predictable story line slowly unfolded while still managing to continue it's rather \"slow\" ascent to a very weak climax. I'll never know how (or why) this picture received so many positive reviews. I guess we've learned to lower our standards since there's nothing under the sun that hasn't been done, and THE RITUAL is a classic example of that. There was nothing shocking or special about this film whatsoever!"
    },
    {
      "rating": "6",
      "text": "”The Ritual” aproveita-se de elementos já aplicados noutros filmes. Apesar disso, o filme possui uma atmosfera bem explorada durante a primeira hora. Os atores são bons e a fotografia é deslumbrante.6/10"
    },
    {
      "rating": "7",
      "text": "This is a somewhat creepy film, with a (very slight) feel of the Blair Witch Project about it, although it doesn't feature the home made recording feel to it but its certainly about a bunch of people getting somewhat lost in a forest, with symbols found and so on. There's a lot of swearing, which is hardly surprising but I suppose it did feel a bit...obvious is perhaps the best term? a bunch of guys turning on each other. It's hardly greatly original. However, it is a bit sinister in tone at times and its certainly watchable. One last point - If you don't like screaming/shouting/squealing, then this may not be the ideal watch for you. Most of it was a bit so-so but there were a few suitably chilling moments which made the whole film somewhat good and worth a watch in my opinion, hence my rating and yes, I'd just about recommend it."
    },
    {
      "rating": "1",
      "text": "Такого говна я давно не смотрел. Здесь главный антагонист это ОЛЕНЬ МОНСТР. Здесь вас ничего не испугает и вы будете иногда ловить испанский стыд. Не ведитесь на высокую оценку пользователей, фильм плохой на 4,но я поставлю еденицу, чтобы снизить общую оценку сильнее, так как этот фильм не заслуживает  такой высокой оценки"
    },
    {
      "rating": "8",
      "text": "From an unfortunate event to a peaceful hike to a downright brutal hunt. This movie had a slow build but it was completely worth it as it went on to its end. The gore is pretty brutal and this movie actually makes you feel for what is happening between these 4 friends. The cinematography is beautiful and it kept me hooked the whole way through. Lessons I learned from this movie;1. Don’t hike deep in the mountains, especially if there is a forest involved 2. Punch a creepy old forest lady in the face3. Yell"
    },
    {
      "rating": "9",
      "text": "Group of friends go hiking in Sweden in memory of a dead friend, get lost in the forest and then start getting picked off by some sort of Norse animal god thing that's being worshipped by a cult."
    }
  ],
  "recommendations": [
    "scary_stories_to_tell_in_the_dark",
    "antlers",
    "annabelle_creation",
    "it_follows",
    "the_witch",
    "ouija_origin_of_evil",
    "the_woman_in_black",
    "the_descent",
    "dark_skies",
    "annabelle_comes_home",
    "the_boy",
    "mirrors",
    "the_conjuring",
    "chernobyl_diaries",
    "the_forest",
    "color_out_of_space",
    "the_lodge",
    "lights_out",
    "the_conjuring_the_devil_made_me_do_it",
    "the_strangers_prey_at_night",
    "a_cure_for_wellness",
    "oculus",
    "insidious_chapter_3",
    "the_invisible_man",
    "the_ring"
  ]
}