{
  "id": 1807,
  "title": "The Emoji Movie",
  "starring": [
    "T.J. Miller",
    "James Corden"
  ],
  "runtime": 86,
  "genre": [
    "Animation",
    "Family",
    "Comedy"
  ],
  "description": "Gene, a multi-expressional emoji, sets out on a journey to become a normal emoji.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/f5pF4OYzh4wb1dYL2ARQNdqUsEZ.jpg",
  "categories": {
    "plot": 0.5789473684210527,
    "acting": 1.0666666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 0.875,
    "funny": 0.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "The fact that, as a species, we have created a movie dedicated solely to tiny pictures you can send to other people to express emotions is honestly confusing and horrifying at the same time. Why does this movie need to exist? The idea wasn't even well executed. It's chock full of cliches and moments that are hard to watch. If it weren't for the fake reviews by people who obviously hated/didn't watch this movie the score would most likely be below 1."
    },
    {
      "rating": "1",
      "text": "What The Emoji Movie gives us is literally and actually predictable from the start. It lacks everything creative and everything that makes a movie successful. The Emoji Movie asks for your money so bad they had to literally do the impossible. New low for the year and possibly for the rest of this decade if there aren't as many cringeworthy movies in the near future. The crew behind this embarrassment that you call a movie will probably regret working on this a few years later when it comes to that time. If you give this movie your money, you should feel ashamed of yourself."
    },
    {
      "rating": "0",
      "text": "I saw this movie in a free screening and I'm glad I did - I would never spend my money on a trash like this. I went in with barely any expectations. I thought the animation/voice acting might turn out descent. Guess what. It did not. Every single thing about this movie is horrible. It's just a poorly made, unfunny, ugly cash grab and on par with trash like Fifty Shades. I never thought an animated kids movie could be so bad - especially one with T. J. Miller - but it is."
    },
    {
      "rating": "0",
      "text": "They cancelled The Popeye's movie for this disgusting crap. What were they thinking? Hide your kids from this terrible movie, and have them watch something else."
    },
    {
      "rating": "0",
      "text": "Everyday we stray further from God’s light. This film is nothing short of a waste of Earth's resources. All traces of the Emoji Movie should be collected onto a rocket and fired into space in the shortest path to the Sun."
    },
    {
      "rating": "0",
      "text": "This movie is a total trash, seriously... What a waste of time for the producers to actually work on this bad movie. This is all of my review to be honest..."
    },
    {
      "rating": "0",
      "text": "this blcokbuster is shiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiit"
    },
    {
      "rating": "0",
      "text": "The Emoji Movie is poop. Go watch Dunkirk, Atomic Blonde, Spider Man Homecoming, and War for the Planet of the Apes instead. Don't support this nasty garbage."
    },
    {
      "rating": "0",
      "text": "The Emoji Movie is a shameful, artless vehicle for product placement and deserves all the 0/10s it can get. It's a grotesque mixture of four much better movies: Wreck-it-Ralph, The Lego Movie, The Angry Birds Movie, and Inside Out. Just add in a pinch of lowbrow Minions-style kiddie humour and you have a diabolical atrocity that is the worst animated film since Foodfight."
    },
    {
      "rating": "10",
      "text": "The Emoji Movie is the best movie ever made. I cannot believe that one film could sum up all our lives, but it does. The film is terrible, bland, short, and boring, just like ourselves. Never would I have thought that a movie would make me reflect on my incredibly useless life, but The Emoji Movie did. The Emoji Movie shows us that we're all just trapped in our own world, we're useless, and we should only have one sole purpose. The film is too good for all our puny human brains to process, and it even made Kim Jong Un cry. If you don't like the film, it is because you don't understand the sheer beauty and perfection that the film delivers. Go clean up your dirty minds and keep watching it until you understand it. This film is an international treasure and should be shown to everyone."
    },
    {
      "rating": "2",
      "text": "An Inside Out rip off without the charm or story. The story fails in almost every way. The idea of creating a story on the Meh Emoji and the failure for him to make that face tells you all you need to know. D-"
    },
    {
      "rating": "0",
      "text": "Well, that was horrible. This is among the worst film of the year. It is boring, predictable and unfunny. The characters are poorly developed and the film seems more interested in jumping from one application to the next(product placement 101) than telling an original, compelling story."
    },
    {
      "rating": "0",
      "text": "This Is A Movie. THIS BECAME A MOVIE! WHO HAD AN IDEA ABOUT LITTLE FACES THAT PEOPLE USE ON ARE FRICKIN PHONE BECAME A FRICKIN MOVIEthe animation looks nice BUT EVERYTHING ELSE IS HORRIBLEHERE IS A SPOILERNOTHING HAPPENS THAT IS INTERESTING........ CHARTERERS SUCK STORY SUCKS EVERYTHING IN THIS MOVIE SUCKS.....GOD NATION"
    },
    {
      "rating": "0",
      "text": "A bunch of old people tried to appeal to millennials and created this abomination of a movie. Fun to watch ironically with the boys and laugh at the horrific attempts at humor though. I don`t even see kids enjoying this garbage."
    },
    {
      "rating": "1",
      "text": "The biggest joke of the year 2017. Tragic humor, incomprehensible message and idiotic dialogue. Emoticons will disappear like any fashion, and making a movie for a young audience without knowing their slang and style of being is a failure."
    },
    {
      "rating": "0",
      "text": "Let me just say this right now, The Emoji Movie is A DUMPSTER FIRE OF A FILM THAT I NEVER WANT TO SEE EVER AGAIN, and if I ever find any parents that took their kids to see that film, I am going to say that how they turn out is your fault now!!!The Emoji Movie is not a movie, it’s an advert.  I am not even kidding, the plot, if you can call it that is interrupted constantly for adverts for products such as Drop Box, Twitter, YouTube and even the Just Dance game.  I am not even joking, for no reason, the plot is interrupted for an advert for a mobile version of Just Dance.  Everyone in this movie is terrible, they are all giving awful performances, including smug performances from Anna Faris, T J Miller, especially James Corden, who seems to be in every terrible animated film I am watching at the minute, playing the exact same role every time and in this film, he is incredibly annoying.  The jokes are never funny, the animation is obnoxious and there is no real message to it whatsoever.  Kind of ironic considering it’s a movie about emoji’s.  This is one of the most cynical things I have ever seen aimed at children and the fact that this film is aimed at children is the most disgusting part of it.  The film also has no original idea whatsoever, ripping off other more successful family films constantly, especially Inside Out, Wreck it Ralph and Toy Story, doing it in a way that required no effort at all.  You will want to slap some dignity into Patrick Stewart for playing the pooper emoji and I would like to point out the opening credits say Sir Patrick Stewart, Robbie Collins summed it up better in saying the opening credits might as well have said “yes, we have ruined this man’s career”.  Everything about it is everything I despise about cinema:  no effort, product based placement throughout the Wazoo, no originality, mugging actors constantly giving off the impression that they know what they are in is terrible but they don’t care as they got an easy pay check and an attitude of “that’s good enough for them”, which cinema should never have!!  Before you say anything, the opposite is just as bad, I hate films that go “if you don’t get it you are obviously an idiot”.  So don’t accuse me of being elitist for my opinions on this film.  It’s just crap and anything in the comments section for this review that have any emoji’s in are getting deleted instantly.  I am sick of them now and if I ever see a copy of this film, I am going to set it on fire.  I HATED THIS MOVIE!!!"
    },
    {
      "rating": "1",
      "text": "\"The Emoji Movie\" is maybe one of the most perplexing pieces of media I have ever borne witness to. I feel strange saying this, but this movie was written... incorrectly. I have never before felt this way about a film, but this movie was written wrong. The worst part isn't even the fact that the main characters are representations of things as characterless as a coat rack, it's the fact that the film doesn't know what it wants to be. This movie has a bizarre tendency of making overly cynical jokes, yet presenting them in such a way that children are guaranteed to take the wrong message. For example, the phrase \"Words are lame, use an emoji\" are presented at a certain point to the user of the phone where the eponymous emojis reside, yet this phrase is not balanced in any way by a differing perspective, a sarcastic glance, or any similar method of showing that it was a joke. This happens multiple times throughout the film. It is also worth noting that pretty much every line spoken by the \"Jailbreak\" character seems to be there just so they can consolidate the female gender into a marketing tactic like they did with \"Ghostbusters\". Thankfully, it doesn't work at all, and just makes a few scenes a lot more awkward than they would have been normally. I recall actually pausing the movie when she said the line \"You know men are always taking credit for things that women come up with\" after the main character figured out what her reasoning was and confirmed that he knew what she was talking about, not at all taking any credit for what she was saying.In terms of the rest of the movie, I feel bad for anyone who paid to sit through 2 hours of advertisements for dropbox. I almost didn't expect it to be as bad as it is. For a film which prominently shows spam emails as a recurring joke, it sure does present a lot of its own spam. Another pause moment happened when the main characters escaped from a villain by going into dropbox, to which the girl replied \"It's illegal malware, and this app is secure!\". I believe I could feel my brain slowly melting out of my ears when that statement was made.While I didn't enjoy this movie, it is kind of a shame that it had to be this way. A lot of people probably didn't like this movie solely because it was essentially a drawn-out advertisement for smartphone downloads. The problem is, there is another movie that is essentially one big advertisement for products, yet it's one of the best animated films I've ever seen! If the people making \"The Emoji Movie\" had taken any inspiration from \"The Lego Movie\", we could have had a potentially amazing film! It is especially depressing since the animation in this film is as good as it could be, being wonderfully stylized and moving beautifully. All in all, \"The Emoji Movie\" is maybe one of the most depressing pieces of cinema I've ever seen. In terms of recommendations, if you are a person who likes to tear films apart, I would recommend watching this film once and never again. To everyone else, avoid this film like the black plague. It's bad for you and terrible for your kids."
    },
    {
      "rating": "0",
      "text": "This movie is the worst. Everything in this movie: Bad scripting. Bad acting. Bad modeling. Bad trailer. Terrible color textures. The characters are rubbish. The scenes are rubbish, and the whole movie is rubbish. Everything in this movie was complete trash."
    },
    {
      "rating": "0",
      "text": "bad, awful, mediocre, cliché, unfunny, waste of time, predictable, disgusting, horrible, terrible, unoriginal plot, cringeworthy and shameless are the words that describe the best this huge pile of trash called a movie"
    },
    {
      "rating": "2",
      "text": "Sony Pictures really outdid themselves with this terrible film. The Emoji Movie was exactly what I thought it would be from when I saw the trailer, an incredibly ridiculous abomination that filled me with anger. It doesn't deserve any praise at all, it lacks what I think every film should have: a soul. The animation of the Emoji Movie may be decent enough, but that won't win me over. I've officially lost hope for Sony Pictures, this is NOT their finest work. I thought Chicken Little was my least favourite film, but The Emoji Movie can easily take that spot. -Pippoa"
    },
    {
      "rating": "0",
      "text": "I honestly can't believe that Sony would make an entire film based on tiny images used in our text messages. Does it make people regret watching it? Three guesses. Not even Gene himself on the cover can keep a smile on himself. It's boring to the extreme, the jokes aren't funny, and this entire film's existence is something nobody would ask for. Don't even get me started on how much this film seems like a mash up commercial! In conclusion, don't even think about watching this film, unless if you want to see how bad it really is, and to lower the rating of this movie even more, which in that case, I'd be fine with."
    },
    {
      "rating": "0",
      "text": "The worst movie I ever seen, i have seen a lot of bad movies, but this is absolutely the worst!"
    },
    {
      "rating": "1",
      "text": "Blessed with the high-quality animation and a cute, hip concept that could have made it a hit with the kids. But it doesn't have a soul. T.J. Miller is not leading man material. Not even when it's just his voice trying to carry the show. The whole cast sounds so generic I was genuinely shocked to find out that it wasn't comprised solely of D-listers. What was Patrick Stewart thinking?!It starts off simple enough. A boring Wreck-It-Ralph rip-off that really has nothing going on. It's kind of smug in a \"haha, look at me! I'm poking fun at how teenagers keep their heads buried in their phones!\" sort of way. Self-satisfied with the fact that it even exists in the first place. It's bad, but not torture. Not then. But oh boy does it take a turn. It happens about the time Candy Crush shows up. That's right ladies and gentlemen, there's a lot of app-related product placement. Watching the little emojis play Candy Crush is just as fun as watching a real life person play Candy Crush. Not fun at all. But it doesn't stop there. We get to watch the little tumors play with other apps as well. Oh boy!It's got more than just phone games though. We'll witness these poor excuses for characters visit Dropbox, YouTube, Spotify, and a few others. Now, this could have been a cute thing, but the implementation isn't clever or inventive. Nothing in The Emoji Movie is. The stale quest about being true to who you are is not only devoid of originality, but heart as well. Every emoji and phone creature thingy is a bland stereotype meant to carry the almost non-existent plot forward. Things get weird when it tries to preach feminism and has weird symbolism on things like divorce. It never manages to actually say anything about them, but you can tell they're there. Because, you know, I'm sure that didn't go over the heads of the 6 year olds in the audience out there. The ones that were scarred for life by their first truly abysmal movie.What tiny bit of imagination it does have is only present on the surface level and is meant to cover up a rotten core created by a group of morally bankrupt individuals that created this film to exploit children in order to prey on the wallets of their unsuspecting parents who didn't know any better. The Emoji Movie is a humorless romp through cellphone land that is devoid of joy and personality. Don't watch it and certainly don't let it near your kids. That would be child abuse in my book. I'm sure there are judges who would agree."
    },
    {
      "rating": "0",
      "text": "There was a slight glimmer of hope in the first 15 minutes that this wouldn't be as bad as everyone said it was.Boy howdy, was I wrong.This was painful...just absolutely painful.Don't even think about watching it.Don't make the same mistakes I did.I'll never understand happiness ever again."
    },
    {
      "rating": "0",
      "text": "Be respectful with your kids and pass this one. They will be thankful now and the years to come."
    },
    {
      "rating": "1",
      "text": "I saw this in theaters. I don't know why I do this to myself. This film in unfunny and bad in every single possible way. At least the people who wasted their time animating it got paid."
    },
    {
      "rating": "1",
      "text": "It's time to stop!It's time to stop, okay!No more!Where the **** are your parents?!Who are your parents!?I'm going to call child protective services!It's time to stop!My score: 5% (out of 100)"
    },
    {
      "rating": "0",
      "text": "The most lamest film ever this movie tries to be like micheal bay films with advertisement but at least no EXPLOSIONS basically this movie is boring, characters are weak, the plot rips-off \"Inside out\" and \"Wreck it Ralph\" (which are superior films). The idea of an Emoji movie is terrible in my opinion."
    },
    {
      "rating": "0",
      "text": "I don't even need to explain why this is bad, just look at the pictures, it's god awful in every single way, there is NOTHING even close to enjoyable in this movie."
    },
    {
      "rating": "1",
      "text": "The story really doesn't have any logic! It messed with story!!! There is no logic! But its new idea about phone world beside it's not complete world."
    },
    {
      "rating": "1",
      "text": "The Emoji Movie was a thing that should've never happened... but it did. And it's every bit as bad as you'd expect. Even with some half-decent animation, a good cast and maybe 1 or 2 chuckles, The Emoji Movie is far too lazy, poorly-written, cynical, unimaginative, and boring to recommend to anyone but the youngest moviegoers. There is little to no heart, charm, wit, or even a good moral and all we have left are super-cheap jokes, bland characters, head-slapping pop-culture references, tissue-thin story, and some of the most absurd product placement you'll ever see in a film. There's no reason for family films to be this eager in pandering to the lowest-common denominator.Every frame melts with corporate cynicism at its worst. Leaves no impact but to feel dead inside. Stay away. 1.5/10"
    },
    {
      "rating": "0",
      "text": "One word Aful!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0",
      "text": "Where do I even start with this movie. It's awful in almost every single category. It has cringe-worthy acting, boring plot, bad characters and bad directing. Movies like this make me question what movies from this generation are turning into.Score 0/10Total Failure"
    },
    {
      "rating": "0",
      "text": "The Emoji Movie is one of those rare movies that has the perfect balance of cringe and sheer stupidity to make me want to put a gun in my mouth. Thanks Emoji Movie!"
    },
    {
      "rating": "0",
      "text": "First of all , what in the holy mother of god is this disaster?It's so bad that I think it will get the award of worst movie of all time."
    },
    {
      "rating": "0",
      "text": "Easily the worst movie of this year. Easily one of the worst movies ever made. Possibly the worst movie ever made. Boring, bland, pandering, already outdated the moment it released... There is nothing good about this movie."
    },
    {
      "rating": "0",
      "text": "Trash trash trash trash. I can’t believe that people made this. Everything is a product placement. This movie is the worst thing made by the film industry"
    },
    {
      "rating": "0",
      "text": "Really, Sony? This is what you thought as an idea for a movie? A movie about emojis? Why, just why? I'm going to give it an F."
    },
    {
      "rating": "0",
      "text": "God is dead and you will know it after seeing this movie.God is dead and you will know it after seeing this movie."
    },
    {
      "rating": "0",
      "text": "Plot: The Film Focuses On An Emoji Named Gene Who Is The “Meh” Emoji (T.J. Miller) Who Has Other Emotions Besides “Meh”. The Film Takes Place In Textopia Which Is Essentially The Environment For The Emoji Characters. The Emoji’s Must Stick To Their One Emotions And Cannot Feel Any Other Emotion. Eager To Fit In With Society With The Other Emojis, Gene Recruits The Help Of Best Friend Hi-5 (James Corden) And The Code Hacker Emoji Jailbreak (Anna Farris). Together, They Go On A Mission Through The Apps On The Phone To Find The Code That Will Fix Gene. But When A Greater Threat Threatens The Phone, The Fate Of All Emojis Depends On These Three Unlikely Friends Who Must Save Their Environment Before Tt's Deleted Forever. Not Gonna Lie, I Wasn’t That Interested In This Film In The First Place. This Movie Is Utter Garbage And Just A Cheap Cash In At The Soul Sake Of Selling A God Damn Product.Acting/Characters: The Acting Is Terrible, And The Characters Suck And You Just Don’t Care About. The Main Characters Are Annoying And I Just Them To **** Die Already. The Villain Is Non Threating And Comes Off As Annoying. Patrick Stewart Plays The **** Emoji Which Is A Completely Waste Of Talent Nuff Said There. Not Even Him Could Save This Thing.Writing/Pacing: The Writing Is Just Utter **** The Humor Is Lazy, The Jokes Are Cringe-Enducingly Terrible. This Pacing Is Way Too **** Long. It Is Only An Hour 26 Minutes And Feels Like It’s Going On Forever And My God It Is So Boring! I Realize It’s A Kids, But It Doesn’t Have To Insult My **** Intelligence. The Jokes Are So Mindless And So **** Stupid. It’s Just LAZY! LAZY LAZY LAZY!!!!! There Is No Reason For This Movie To Exist. The Plot Is Just Stupid And Goes No Where. There Is Barely Any Time And Effort Put Into To It. NONE Of The Jokes Are **** Clever At All. It’s Generic And Overall The Writing Is Just Terrible. The Film Ends With You Guessed? Yep. A **** Dance Sequence. The Idea That Drop Box Is An Important Plot Point In This **** Movie Is Stupid. The Mindless App References Were Tedious. It May Have Tried To Be Clever But It Failed MISERABLY!!!!Animation: Animation Is Garbage. It’s Flashing And It’s So **** Bright It Makes My Eyes Wanna Bleed. That’s How **** Bad It Is. Trust Me It’s That Painful.Overall Opinion: This Movie Is Utter Garbage And Just A Cheap Cash In At The Soul Sake Of Selling A God Damn Product. It’s Boring And Lazy With Terrible Writing, Terrible Humor, Bad Acting, And Overall Is A Film That SHOULD NOT HAVE Existed.Grade: F."
    },
    {
      "rating": "1",
      "text": "The Emoji movie gave us some spicy memes and a lot of broken dreams. In other words, this movie is f*cking awful, and the only redeeming thing is the memes."
    },
    {
      "rating": "1",
      "text": "you already know how bad this is. nothing good about this except maybe the animation."
    },
    {
      "rating": "1",
      "text": "Right off the bat, the movie is overwhelmingly cringy, and one of the most feel-bad movies ever. This movie is entirely product placement with poor lines and even worse actors. The production of the movie is years and years they'll never get back."
    },
    {
      "rating": "0",
      "text": "What can I say it's perfect. God haa blessed us with this movie and we are not worthy."
    },
    {
      "rating": "10",
      "text": "cool its soooooo amazing  have created a movie dedicated solely to tiny pictures you can send to other people to express emotions is honestly confusing and horrifying at the same time. Why does this movie need to exist? The idea wasn't"
    },
    {
      "rating": "0",
      "text": "All evidence points to this animated film being contrived as a money-making scheme. \"Hey, we can create a cheap CGI movie and make companies pay for the celeb voices in advance by inserting their brands in the film!\" The result is worse than crass, it's abominably bad. It's so bad that the film has been stuck in production limbo for a decade and it hasn't aged well. The CGI, the story and the one-liners (oh God, the one-liners...) all bear the mark of genuine and profound incompetence, a complete lack of even the most most rudimentary story-telling skills.What passes for a narrative revolves around supermarket brands coming to life at night. Rex Dogtective (yeah, go ahead and try to laugh at that one), voiced by Charlie Sheen, mourns his lost love but must soon save his supermarket city from the evil, impersonal Brand X. With the help of ... ah, who cares?Foodfight! will bore, offend and anger you at the same time, such is its unprecedented badness. Please don't watch it."
    },
    {
      "rating": "0",
      "text": "One of the worst movies that I have ever seen. Luckily, I didn't pay to watch the movie. If you want to watch a good movie, go watch Shrek, Shrek 2, Shrek The Third, Shrek Forever After, or the Bee Movie."
    },
    {
      "rating": "0",
      "text": "This was an absolute dumpster fire of a film and I'd rather stick forks in my eyes than watch it again. None of the characters have any redeeming qualities and the movie makes no attempt at making you like them. The story was bland and recyclable to the point where I felt nothing when they were in danger. They cancelled the Popeye movie for this."
    },
    {
      "rating": "0",
      "text": "This movie made me seriously ill. Every time i close my eyes, all i can see it that godforsaken yellow emoji staring into my soul. I feel physical pain every time i think about this hellspawn that is put before my eyes. If North Korea decides to nuke us, i wouldn't even be mad. Just please, remove the film from existence. I need immediate medical attention."
    },
    {
      "rating": "1",
      "text": "This is a complete failure.Is not it possible to create a normal movie these days?what the **** is this what the **** is this what the **** is this what the **** is this what the **** is this what the **** is this what the **** is this"
    }
  ]
}