{
  "id": 4283,
  "title": "The Quick and the Dead",
  "starring": [
    "Sharon Stone",
    "Gene Hackman"
  ],
  "runtime": 107,
  "genre": [
    "Western",
    "Action",
    "Thriller"
  ],
  "description": "A mysterious woman comes to compete in a quick-draw elimination tournament, in a town taken over by a notorious gunman.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jhEmrXJpP6F3cqwyLjvgBgxxxFA.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.625,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "qqwweerrttyyuuiiooppllkkjjhhggffddssaammnnbbvvccxxzzmmnnbbvvccxxzzaassddffgghhjjkkllooppiiuuyyttrreewwqqodmdkmmo"
    },
    {
      "rating": "8",
      "text": "This movie is a non-stop compendium of every western cliche, with a generous helping of Clint-Eastwood's-feminist-sister-as-gunslinger. The show misses no opportunity to sacrifice logic and relevance for entertainment value. It has no business working, but entertainment is never about content, only the way the content is treated, and as entertainment this movie borders on being a masterpiece. It's just plain good old fashioned story telling. If you want to look deeper, fine. Stone's character has hints of Hamlet trying to muster up the courage to bring his fathers murderer to justice. But overall the good characters are redeemed after being bad, and the bad are bad beyond belief. This show was a no-brainer put-down for professional movie critics who make a living trying to sound intelligent. But there's a reason this movie has become a staple of cable TV. It's the basics: plot, script, screenplay, elements that appeal to all tastes, and editing - all coordinated to make for a presentation as digestible as jello. The content is stupid, over the top, unoriginal and disposable, but I would rather see garbage turned into entertainment than entertainment turned into garbage. And there's nothing wrong with cliches, only how they're used. Here they're used in a context where they work. So kick back with a six pack and enjoy top grade movie making without bogging down in cognitive thinking."
    },
    {
      "rating": "8",
      "text": "●●●●●●●●●●●●●●●●●●■■■■■■■■■■■■■■■■\",\",\",\",\",\",\",\",\",\",\",\",\",\",+,+,@,+,+,+,÷,÷,=,=,=\".:.:.:"
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;;:;:;:;:;:;:;:;:;:;:;::;:;:;:;"
    },
    {
      "rating": "8",
      "text": "-----------------------------¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "The Quick and the Dead was directed by Sam Raimi who made many films such as Spider-Man, Drag Me to Hell and The Evil Dead just to name a few... 1995 for me was a golden age of movies when great films were coming out such as Desperado, Species, Assassins, Casino.....The golden era has soon passed and nowadays the standard has dropped considerably although you still get the odd decent flick I think most films are just plain crap. In 1995 another gem dropped and it's called THE QUICK AND THE DEAD and it's a kind of western, romance thriller starring an allstar cast such as Leonardo DiCaprio, Sharon Stone, Gene Hackman, Russell Crowe, Lance Henriksen, Gary Sinise.... Sharon Stone plays some gunslinger or cowgirl or gunfighter who enters a competition involving shooting each other by drawing guns on each other. Gene Hackman plays someone named Herod who I think is boss of the whole town or at least he acts like he's in charge of everything but Herod killed Sharon Stone's father when she was little or something and her father was a Marshall. She enters the gunfight competition to kill Herod (Gene Hackman) to avenge her father's death and that's basically the story which is pretty simple. Usually I hate western type films like these but The Quick and the Dead is a great film with thought and consideration put into the film along with great performances by Sharon Stone and Gene Hackman and some violence and nudity that basically makes this a great film. A bonus for the film is that it never gets boring."
    },
    {
      "rating": "7",
      "text": "Good solid cinematic foundations that are let down by patchy direction. The film feels like it deserves better but the script, the acting and the narrative all interweave like a sweater knitted by your Gran. Not made with any nod to fashion and something that would have looked odd at any point in history. Though a sweater is a sweater and it will keep you warm but that depends on the fabric. 65/100"
    },
    {
      "rating": "7",
      "text": "This isn't the best western around, certainly. But people who say this is a bad film have something wrong with them. It isn't a bad film, but it isn't a particularly good film either. The acting isn't astonishing, with actors such as Richard Gere delivering the only really good performances. Sharon Stone's never really been all that  good of an actress anyway (Casino, no matter how good it is, is no indication of the rest of her career), and in what seems a trend of his early roles, Leonardo DiCaprio isn't that good in this film either. However, it is rather interesting, both when it comes to the plot, the sets and the characters. This is a good film to watch if you want to catch some western on a Sunday night, but I don't recommend going out of your way to see it."
    },
    {
      "rating": "7",
      "text": "A really cool western movie with great action sequences that really bring out the cowboy in all of us and the cast does a really solid job its a shame that the character development is lacking though"
    },
    {
      "rating": "7",
      "text": "Hommage à bien des westerns qui se déroulent à OK Corral et/ou au bout d'une corde (de la vengeance vengeresse), Mort ou Vif est surtout un pastiche souvent rigolard du genre, un genre à part entière qui a longtemps sévi il y a des décennies et rarement brillé à dire vrai... même si on a toujours vu de non moins rares exceptions ici ou là...Sam Raimi a donc emprunté quelques vieux codes et autres vieux tics et les a tournés à son avantage... Cette galerie de personnages constitue ainsi à elle seule une véritable satire pince-sans-rire des lieux communs et des stéréotypes usés jusqu'à la corde et simplement dépoussiérés... Avec Gene Hackman en tête, sadique, cynique, cruel et sardonique, soit le genre de méchant qu'on apprécie immédiatement !Dans le rôle du petit con qui lui va comme un gant, Di Caprio fait des étincelles et quant à la belle et rebelle Sharon Stone en Calamity Jane improvisée, on ne se lasse pas de l'admirer. On peut regretter que son personnage demeure un peu trop veule voire chialeux sur les bords, car Sharon n'est jamais aussi convaincante qu'en blonde vénéneuse et ça, Verhoeven l'a bien compris en son temps.Elle sert donc (un peu) de repos impromptu du guerrier pour un Russell Crow encore débutant qui fait trop le bellâtre reconverti à la dernière minute et accessoirement le prêtre (!) tueur à l'insu de sa benoîte ignorance. Le scénario, globalement, ne casse pas trois pattes à un canard mais c'est surtout la fin qui se laisse nettement aller...Néanmoins, voilà un western qui reste assurément très détendu et nous fait ricaner de ses clins d'oeil et autres galéjades... y compris jusque dans le prétendu drame (cf la gamine et son père, allusion hilarante à un certain vieux western très connu...). Enfin, la mise en scène plutôt inventive se révèle en outre assez efficace pour éviter toute impression de répétition."
    }
  ]
}