{
  "id": 2310,
  "title": "The Mist",
  "starring": [
    "Thomas Jane",
    "Laurie Holden"
  ],
  "runtime": 126,
  "genre": [
    "Horror",
    "Science Fiction",
    "Thriller"
  ],
  "description": "After a violent storm, a dense cloud of mist envelops a small Maine town, trapping artist David Drayton and his five-year-old son in a local grocery store with other people. They soon discover that the mist conceals deadly horrors that threaten their lives, and worse, their sanity.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1CvJ6diBACKPVGOpcWuY4XPQdqX.jpg",
  "categories": {
    "plot": 6.138888888888889,
    "acting": 6.2439024390243905,
    "ending": 5.769230769230769,
    "soundtrack": 3.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 3.6666666666666665,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "0",
      "text": "127 minutes long? This film is a joke. Truly a steaming pile."
    },
    {
      "rating": "10",
      "text": "Excellent. I had no idea this was the same director of the Shawshank Redemption, and the Green Mile. I almost avoided renting this DVD because it was 'a rental store exclusive' which to my mind seemed to impute box office or critical failure. Had it not been a Stephen King book adaptation, starred Thomas Jane, and been lauded by Richard Roeper, and Pete Hammond - I would not have given it a second glance due to it's lack of critical acclaim. I can only conclude that the lack of critical acclaim is due in no small measure to its indictment of religion as a form of mental calcification. Why else? The acting was sterling. The monsters no less than macabre. The story singular with only a slight nod to the Silent Hill series. Why this film is important: It shines an caustic light onto the religious bias of an overwhelming number of film critics. I now know which film critics to avoid in the future when researching how to spend my last 350,640 hours."
    },
    {
      "rating": "6",
      "text": "Overall, very disappointing film.... probably because I had such high expectations for it. It's primary 'saving grace' is the ending. Unexpected and bleak and powerful. Those who hate the ending should just stay in their own sugar-coated disneyland of typical hollywood outcomes."
    },
    {
      "rating": "9",
      "text": "The low reviews kept me away from this film in theaters, but once I rented it, I was surprised by how good the movie is. It's entertaining and scarier than any other shit out there right now. It's a really good Stephen King adaptation and the acting strong. The ending is a little turn off, but the rest of the film make up for it. Watch the film >>>> It's f**king good."
    },
    {
      "rating": "5",
      "text": "The first half was terrific! One of the most tense movies to come along in years! The, the more we saw of the creatures, the less scary and more stupid the movie became. I wish Darabont continued with the tone he established in the first half, instead of going effects crazy. 'Dreamcatcher' was better than this, because that movie didn't take itself seriously...it knew it was a B grade monster movie. 'The Mist' tries to have its cake and eat it too. Now I haven't seen all adaptations, but this is the worst adaptation of a King novel yet. The biggest disappointment of 2007."
    },
    {
      "rating": "5",
      "text": "Solid story line (believable as far as monster movies go)Silly ending based on the character of the father of the kid.His survival instinct would not allow him to do what he did prematurely."
    },
    {
      "rating": "5",
      "text": "Really bad. The director tried to instillate some social psychology (how humans behave in a life or death situation) into a fantastic/horror movie. The idea was good, but was very poorly implemented. Unsubtle close-ups and would-be realistic shaky camera, stereotyped characters, laughable lines, predictable events (apart for the end), and the usual overflow of disgusting scenes traditionally seen in mediocre horror movies. Even a non-hollywoodian and original end cannot make a poor movie better. Stay away from it."
    },
    {
      "rating": "8",
      "text": "A great adaptation of a great short story."
    },
    {
      "rating": "5",
      "text": "I wonder if this would have seen the inside of a cinema were it not for Darabont's success with Green Mile and Shawshank. From the cheap production and second rate cast to the poor CGI, this film feels 'made for TV' right the way through. Good TV, (like watching a sci-fi/horror two hour special) but tv nonetheless."
    },
    {
      "rating": "4",
      "text": "It started off quite well, and built up a great chilling atmosphere. A feeling of dread and horror. Then it all went downhill from there. Bad special effects aside, the acting was atrocious - at the end the way the main character is shouting is just plain unbelievable and silly. But the most frustrating thing to watch was the bad decisions the characters kept making over and over again. I know with movies like this, you have to suspend beliefs for a while, but the things they did was just unrealistic. The idea and the theme of the movie was good, but I just don't think it was executed the right way. A shame though, it could've been a great movie."
    },
    {
      "rating": "3",
      "text": "This was a horrible cliche-riddled crap film. the ending did not fit."
    },
    {
      "rating": "5",
      "text": "Charmingly ridiculous. Sometimes just plain ridiculous. And the rest of the time outright terrible."
    },
    {
      "rating": "5",
      "text": "Marcia Gay Harden's character is one of the most annoying characters i've ever seen in a movie and she needed to take an exit MUCH earlier. Some parts of this movie were laugh out loud terrible. Some parts were just creepy. The special effects were also laugh out loud bad. It's a rare case of a completely average movie with a pretty good ending (even if it was terribly depressing)."
    },
    {
      "rating": "4",
      "text": "The movie was good for a while but it grew increasingly ridiculous and the ending was so far from what any real person with sense would do. If you are a fan of quitters watch this awful movie."
    },
    {
      "rating": "10",
      "text": "Steven King at his best,. I truly enjoyed this movie, excellent!"
    },
    {
      "rating": "5",
      "text": "It is tough to get a handle on this one.  The reviews indicate that the main problems were the varied acting and poor CG.  I felt like the CG, while not great, is passable and not distracting, but the acting at times does tend to pull you out of the scene.  Sometimes you are frustrated or relieved, sometimes you're disconnected from the intended reaction.  All-in-all I would say this is a good movie if you're looking for a fish tank to watch, but I wouldn't expect to be sucked into the drama or horror."
    },
    {
      "rating": "10",
      "text": "Once again i was almost fooled by the critics, the movie was brilliant. its actually very hardcore, not in a violent sense, although it is quite graphic. for a modern horror movie im surprised how little it makes you jump, this was a good thing, it didnt need cheap scare tactics to totally creep you out, it does it through the people in the mall and how they react to the situation. the movie really was great, scary, fun, intense, suspenseful, really just a great horror flick. the Ending, by far, is one of the most powerful pieces of cinema ive seen, ever."
    },
    {
      "rating": "10",
      "text": "I disagree with many critics and evidently many viewers in that I think this film was an excellent character drama, and a very good film overall. The characters were solid, the acting was great in most cases, it built up a lot of suspense and character development, and it avoided a lot of tropes and cliche's, with a pretty brutal ultimatum.It wasn't a typical horror movie, or even a very good horror movie, by any means. The enemies are rarely seen, in several cases passive, and scare moments don't last very long. However, in almost every other respect I'd say the film is a great success. Most characters actually have interesting opinions and beliefs, and don't follow genre cliche's (when they do, it's with depth and subtlety).  A small example is the seeming jobsworth store department manager, I forget his name, who has a goofy appearance, is stumpy, and has glasses. In EVERY other horror movie he would be comic/ sicko relief, and would be killed by the main character or somesuch after he pervs on the love interest or some crap. However, he turns out to be a good guy, one of the best in the film, and is likeable and has a lot of story/plot input. The generic psycho antagonist seems one-dimensional and cliche, but is acted with extreme finesse- when she finally starts driving people to violence (which is inevitable), you can actually see that she is shocked at what is going on, but keeps at it out of fear and wavering momentum. The whole thing is about why people do these things- basically fear and how people deal with it.The story is basic and doesn't reveal much about what is going on, but that's not necessary, as it's mostly about the characters' survival and relationships, yet it still does a good job of setting up an ecology and background for the strange creatures the players encounter. The film's not much of a horror, but as a thriller and a character piece- I'd say hit it up like a whack-a-mole."
    },
    {
      "rating": "8",
      "text": "\"The Mist\" doesn't really reach the heights of other classic masterpieces director Frank Darabont has directed before, but the movie does show his traditional style of excellence through solid film editing, stellar acting, and, despite what others have to say, a pretty good story with a creative ending different from its original source material."
    },
    {
      "rating": "0",
      "text": "Some tension - interesting effects - many annoying performances - ridiculous plot contrivances - many boring sections - a terrible movie - one of the worst ever that I've seen"
    },
    {
      "rating": "0",
      "text": "Okay. what the heck is this? Seriously, probably the worst movie I've ever seen. There's a pointless story, the acting (esp. that fundamental cult thing) is just silly. At the beginning you could think it will be a great movie, but with time progressing it goes straight down. The characters are so single-sided with dialogs everyone could write. It's full of cliches and the effects aren't good, either. Though, the end is the worst part of this ridiculous movie  so predictable and just.... wrong. I can't really find words that fit. I don't even know why this exists. It shouldn't, Don't watch it."
    },
    {
      "rating": "8",
      "text": "The mis-categorizing of The Mist as a horror movie was unfortunate. The building sense of hopelessness along with Marcia Gay Harden's award deserving role as Mrs. Carmody creates a movie that is worth your attention."
    },
    {
      "rating": "8",
      "text": "the premise is interesting, and the effects range from being really good to really cheesy,  but the film is very suspenseful, this is a lot better than your average monster movie. The ending is terrible though."
    },
    {
      "rating": "0",
      "text": "One of the black list of worst of all time. Dont make sense any thing.\rThe plot? A drama, yes a drama, not a action/SciFi, just a drama that try artificially puts some people together and show the \"society problems\". Like religion, guilty, fear..."
    },
    {
      "rating": "3",
      "text": "This movie is not good. The plot, rather than having you on the edge of your seat, will have you slumped down in it, drinking that sweet, sweet Pepsi-Cola you bought at the grocery store where you picked up this movie. The acting is nothing special. The soundtrack is boring. The movie relies on blood and jumpscares too much to say, \"It was so spooky!\" but rather, \"Eh, it startled me a couple times.\" It isn't a 0 because it isn't awful. It's just bad. It's mediocre at best, and not worth any amount you pay for the disc or on Amazon or anywhere. As for the ending, instead of making us go like, \"OH. EM. JEEEEEEEEEE!\" we ended up chuckling at that excuse for a sad ending. Basically, don't watch it. It isn't worth two or three hours."
    },
    {
      "rating": "0",
      "text": "This movie had it's moments and could have been a pretty good movie if not for the absolute horrific ending. I have 2 young sons and this upset me to my core! The dumbest outcome I have ever seen in a movie."
    },
    {
      "rating": "5",
      "text": "Not weighty enough to be the intellectual film Darabont wants it to be, not scary enough to be the horror film it should be. (And as ever, the monsters just aren't scary...)"
    },
    {
      "rating": "4",
      "text": "Do yourself a favour: skip to the end. The Mist features one-dimensional characterisations, hammy effects and dialogue unrealistic enough to be laughable. The final 15 minutes are maaaybe work watching. Its just a shame the same can't be said for the 111 dirge-like minutes that preceed it."
    },
    {
      "rating": "5",
      "text": "Ridiculous acting, Thomas Jane can't act. Only the biggest monster was well done, the others were quite ridiculous. The other bizarre thing was the plot trying to separate minds and opinions with religious, scientifics and rationalists beliefs. I'm not a religious at all and I'm a rationalist, but I was quite shocked by the semi-hidden insults made to both opinions and beliefs. The good points: it was entertaining and despite the hidden insults towards both \"camps\" it was really interesting to see how human race reacts in front of an event like this. The worst is that it would be very probable."
    },
    {
      "rating": "5",
      "text": "It would have been a 7 or 8 but that ending pissed me off.it was not original at all, i think I've seen and read that ending about a million times and it just makes people angry at this movie after watching it(it really was not needed, it was just plain horrible and disturbing and it made me mad at the \"writer\" of that ending). other than that, it was ok."
    },
    {
      "rating": "9",
      "text": "A depressing and visceral cautionary tale about the monsters that hide inside us all. The acting ranged from wholly believable to flat-out cheesy, but it was trivial by the end. Speaking of endings...holy crap. I think I've made my point."
    },
    {
      "rating": "1",
      "text": "It was pretty terrible and a rather generic film up until the very end, Literally the last scene of the film. Acting was below average and I expected far better, The story wasnt interesting, and the ending was just so stupid but its a hilariously stupid ending (if you have a sick sense of humor like me). Its a rather trashy film if you ask me."
    },
    {
      "rating": "3",
      "text": "I didn't see the first 10 minutes of the movie, but I feel like it didn't matter so much. I was also under the influence of alcohol when watching, which i thought would make it better...but it didn't. The acting is ho-hum, and every single horror-movie cliche you can think of is in this movie. Oh, and the special effects are bad. I will admit that I don't know much about the horror genre, but I feel like there can be so much better than this drivel."
    },
    {
      "rating": "3",
      "text": "Would of given it a couple of points more , if it wasn't the cheap trick of an ending , I do not need sugar sweetened , but 5 going out like that, unbelievable bunch of losers, the rest average b grade, not even funny, dialogue written by a 13 year old, but suppose that's Mr King, read him at that age. Don't mind my team losing as long as they play- bunch of losers"
    },
    {
      "rating": "9",
      "text": "Strangely, one of my favorite films of all time, although I understand that people don't like it. I'm not a fanboy, or a hater, so I won't bag out people who dislike this film, likewise i don't expect to be knocked just because I really enjoyed this. I liked the pace, the premise, and the cheesy acting and effects. Even though it felt a bit B grade I felt this added to the experience for me. I saw this in cinemas and remember walking with a big smile on my face. If you're a fan of post-apocalyptic, sci-fi and horror you should get a kick out of this, if you're a Dark Tower fan then maybe even moreso (as their are a few nods to the series in this film). To me this film captures the dire reality of such an event quite well by pitting a small group of people together who must learn to fight off a common threat. It deals with the microcosm of society and how certain people can influence the masses. There is a real feeling of dread and despair that is portrayed in the film. The characters are survivors but we know that not all of them will make it through to the end, we know that their situation is a dangerous one and the film keeps you on your toes.All in all, I really liked it and always mention this to friends as being one of my faves of all time, they always laugh, heh, but that's life. Don't be deterred by bad reviews, its just one of those movies, some love it, some hate it, you might really like it."
    },
    {
      "rating": "9",
      "text": "When I first watched the first 15 minutes of this film, I was thinking to myself, \"Man, this movie is kinda unoriginal.\" I was wrong. When the mist starts rolling in, the film keeps you hooked until the ending. The characters are well put together, and although the acting isn't perfect, it's still very solid. What I enjoyed the most about this movie is that it doesn't rely on cheap tactics to make you scared. It's suspenseful, gory, and thrilling. This movie also gets credit for having one of the most depressing endings in film history."
    },
    {
      "rating": "10",
      "text": "The beauty of a good horror movie is when the actual threat itself becomes insignificant in comparison to the ills that manifest from the very people that are trying to escape it. This very story telling mechanic is what The Mist does in magnificent fashion. If you watch this movie with the right head on your shoulders, respecting the situation the central characters are in at any given moment, then the end scene will rip your very soul clean in half. I know the end differs from the short story originally penned by King, but the author himself has ok'd the revised ending with much applause (there is actually a sit down chat with King and Darabont on the disc where this is seen and heard). One point I will make that really needs to be listened to is the viewing of this film in Black & White. I myself have never seen the colour version as the director himself (there is a 'forward' at the start of the B&W presentation on Blu-ray by Darabont) has stated that the B&W is the native viewing experience... and i certainly agree with that. The Mist is a mini masterpiece that got reviewed at the time by the wrong people and therefore has not reached the audience it deserves. The fans will continue to spread the word and keep the films legacy alive through word of mouth and passion for what this reviewer truely believes is one of the best horror movies of all time"
    },
    {
      "rating": "8",
      "text": "A truly terrifying movie. It's nice to watch a horror movie that's not obsessed with throwing gore and cheap tricks scares at you. I have heard countless complaints about the ending, which to my surprise, was not nearly as bad as everyone had made it out to be."
    },
    {
      "rating": "9",
      "text": "I definitely enjoyed the movie. It was better than what I expected, yet, I know it was not brilliant. It works in its genre, although there was room for improvement. I think it is not easy to describe the feelings that this movie inspires to me; but I know this is a movie that I would recommend to those who enjoy horror films where violence and gore are justified. The story is interesting and it takes a while for the mistery to be unfolded. Although some may have already thought where the answer was, the way it was done in the movie, is to be applauded. Good performances and good cast. It had an interesting perspective, that made me reflect-again- in how dangerous religious fanatism can be to the world ( be aware I mean, fanatism, for there is nothing wrong with religion itself) and how easy to manipulate are human beings under certain conditions. Great ending, although sad. Overall, a good movie but i am disappointed to se the low score, especially considering how many good reviews it got...I wonder if the metacritic system is working for I don't see it changing much days after some comments are post..strange indeed. Something that they should ckeck...for it is not only the percentage, but the number of 'positive' doesn't add after my friends or I write a review...!"
    },
    {
      "rating": "10",
      "text": "As always Frank Darabont makes a great job    ."
    },
    {
      "rating": "7",
      "text": "The Mist is truly a mixed bag. The beginning is quite weak. Though as hectic as it should be as the townsfolk try to piece together what is happening, the acting really holds it back. However, once we get into the swing of things, the acting remains negligible but the increased tension and edge of your seat moments of terror are worth it. Though far from being a truly horrifying film, the film manages to be incredibly intense and thrilling and, thanks to the camerawork, chaotic and somewhat claustrophobic. However, what truly sets the film apart from practically anything I have ever watched is the ending. Oh my God what an incredible ending. The book ending sounds nice, but holy cow this blows it out of the water. The film up to that sequence is solid, but far from being near extraordinary. The ending transcends the rest of the film and truly elevates the preceding ~two hours. Wow. Overall, The Mist is a good science fiction horror film with a killer ending that will stick with you for a while."
    },
    {
      "rating": "8",
      "text": "This is, by far, the greatest work of Stephen King. The thought of using something rather common, like mist, makes it seem like anything can happen now. Every time I see mist, I think it will turn into a horror story. I am also VERY impressed with the special effects. A little too impressed...actually."
    },
    {
      "rating": "8",
      "text": "I loved this film! The Mist follows a group of townspeople trapped in a grocery store as a mysterious mist blows into town, bringing with it a variety of unfamiliar creatures. The trapped townspeople are played perfectly by a great cast; Thomas Jane is good as the main character, and Marcia Gay Harden is chillingly brilliant as the disturbed Christian. She steals every scene she's in and delivers multiple monologues that rank among her best performances. The cast had a surprisingly great script to work with; sharp dialogue and well-written conversations make this film extremely realistic. There were a few stupid decisions and characters scattered throughout, but that doesn't hold back the film much. Also, the CGI could have been a little better. With it's strong cast, memorable monologues, and solid script, The Mist builds perfectly to an ending that's unforgettable. Devastating, infuriating, but perfect."
    },
    {
      "rating": "7",
      "text": "Really solid horror/suspense movie.  Thomas Jane is prettty damn good here.  Yeah, some of the acting is a bit wooden, but i you're a fan of The Walking Dead or TV/movies of the type that make you examine human nature, you'll enjoy this one.  A solid 7/10.\rFor those complaining about the ending, I believe Stephen King himself said he wished he had thought of this particular way to end the story."
    },
    {
      "rating": "9",
      "text": "This film is precisely the kind that is destined to be under rated. I came to view it out of an unusual impulse toward gratuitous monster mashing gore. But The Mist is far more substantial than anything the average horror fan is going to be prepared for. The film is an allegory for the for the human condition at its most grim. And as such within the genre, it is not just as good as  horror gets, it is correct. And I use the word 'correct' here in the most laudatory sense that a person could use it while aghast and weeping."
    },
    {
      "rating": "8",
      "text": "This is one of the best Stephen King's adaptation I have seen.The acting is good,the special effects are well made and the movie is intense.The end is surprising but extremely good and raise the movie even higher."
    },
    {
      "rating": "9",
      "text": "The Mist is painfully real considering it is a very unreal story. Frank Darabont converts another Stephen King story into an exceptional film, much like he did with the Shawshank Redemption and The Green Mile. This film felt like Dawn of the Dead in a supermarket at first but it begins to break its own new ground. The characters were very good for a horror movie and the acting was great. The best part about The Mist is that it is not afraid to cross the line. I was very disturbed on several occasions in this film and a great horror film should make you uncomfortable. I sure was. I was horrified."
    },
    {
      "rating": "0",
      "text": "Totally terrible movie with very bad characters ! Im very disappointed .. I like the story but the movie was so far its a waste of your time ! Its not entertaining lots of stuff happening ..I would rather watch the Harry Potter marathon than watching this trash !"
    },
    {
      "rating": "10",
      "text": "Great movie    ."
    },
    {
      "rating": "0",
      "text": "Total trash. All the characters reacted in an unbelievable manner given the situation. The conflict between them was forcefully shoved down the viewers throat on top of being formulaic and cliche. The social interactions were laughable. One second people are rational, the next they give up all hope. One second they dont believe in anything, the next they are all religious zealots. There is nothing good about this movie. It does not illicit any sort of emotion of any kind and I am not sure it should be called horror."
    }
  ]
}