{"id": 4079, "title": "The Omen", "starring": ["Gregory Peck", "Lee Remick"], "runtime": 111, "genre": ["Horror", "Thriller"], "description": "Immediately after their miscarriage, the US diplomat Robert Thorn adopts the newborn Damien without the knowledge of his wife. Yet what he doesn’t know is that their new son is the son of the devil.", "releaseYear": "1976", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/p0LcWxOIoBx0MEZMn8tFcrvDXR1.jpg", "categories": {"plot": 6.0, "acting": 5.375, "ending": 7.0, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.0, "action": 8.0}, "reviews": [{"rating": "3", "text": "Just like Gus Van Sant 1998 remake of Psycho, it's unnecessary to remake something if you are just going to do it shot-by-shot. The remake adds nothing remarkable and improves nothing from the original. They just recreated the 1976 version, but made it boring and overly cliched. Director John Moore is such a hack."}, {"rating": "8", "text": "This was an amazing movie with many memorable moments. The thrill of this movie was warranted especially since one of the few horror movies I enjoyed representing the devil and all things dark."}, {"rating": "3", "text": "Stick with the original. This remake is scene for scene but not as scary or well acted. Hollywood: DONT REMAKE A MOVIE UNLESS YOUR GOING TO IMPROVE IT! 3/10"}, {"rating": "4", "text": "the movie has no story..The vatican is misrepresented.the scary bits are not very scary to be truthful.the photographer in the film is having a unique behaviour,.morover a disappointment"}, {"rating": "2", "text": "Una cosa es hacer un remake y otra muy distinta es hacer exactamente la misma película sin aportar ni un solo grano de arena, esto último es el caso de esta película, lo único que no copiaron ni intentaron hacer fue capturar el terror y la magia de La Profecía original siendo aburrida e insípida."}, {"rating": "0", "text": "Absolute trash of a movie. Go see something uplifting instead!"}, {"rating": "7", "text": "A good remake, but please dont try to substitute Prague for London when it comes to film locations."}, {"rating": "6", "text": "Was a bit scary but most of it was extremely predictable."}, {"rating": "4", "text": "For sure, the dog is less scary than the original. He's not bulky enough to be satan's pet. The key scenes might be better staged and photographed, but like the second trilogy of \"Star Wars\" films, new and improved isn't necessarily better. If you never saw the original with Gregory Peck and Lee Remick, you'll probably enjoy \"The Omen\". This new version feels a little off from the get-go. Since the film already knows that Damien is the devil's offspring, the montage of the boy's infancy is probably accompanied with the wrong music. Where is that foreboding sense that Damien isn't quite right, which Katherine(Julia Stiles) indicates later in the film."}, {"rating": "10", "text": "I thought it was a faithful adaption prehaps a bit too slick, but well done."}, {"rating": "10", "text": "Far better than the original; may have problems at the box-office, with all the critics ganging up against it because it's a FOX made movie. But it has depth and a very anti-establishment political tone to it which is very un-FOX like."}, {"rating": "4", "text": "A completely uninteresting remake. There were some serious parts that could be taken seriously. Outside of the that though, expect to laugh a few times."}, {"rating": "10", "text": "I've seen the earlier movie, and while this one is nothing really new, it was tighter, snappier and as good as the original. Loved every moment!"}, {"rating": "8", "text": "This gets an 8 comfortably, being probably the best horror released this year, and the most surprising hit. The acting is strong on all accounts (even Damien himself has perfected a demonic scowl) and special mention goes to the male members of the cast, who provide an intriguing dynamic. The film is genuinely suspenseful, and the \"jumpy\" bits will literally make you jump out of your seat, handled like they should be in every film. The deaths each have a Final Destination-esque grewsomeness, and the dream sequences, if confusing and irrelevant, are disturbing and fit perfectly. It's fast-paced too, and the ending will catch many off guard...perfect for the release date of 06/06/06. It could have been improved with a good soundtrack, but an outstanding must-see all the same."}, {"rating": "3", "text": "The movie was nothing compared to the original. The fact that mics showed up in the movie completely lost the scare and made me realize that it was only a movie which disabled me from getting wrapped up in it."}, {"rating": "2", "text": "Cynicall remake bringing nothing new whatsoever to the film."}, {"rating": "4", "text": "If you want to see the Omen, get the original version with Gregory Peck on DVD. While this version isn"}, {"rating": "4", "text": "Hard to see why this remake was made."}, {"rating": "0", "text": "Far and wide the single worst movie I have ever seen in my entire life. I would give it a negative score if I could for using 9/11 footage to make a false point of the Book of Revelations predicting the future when, in fact, it tells of the past. Worthless pile of crap plotted to entertain masses of teenagers. Awful special effects--everything about the original far surpasses this rotten, festering 2-hour piece of garbage."}, {"rating": "7", "text": "Exciting, scary, and interesting, if somewhat slow in places. As usual, the critics only focus on how much \"better\" it is than the original, or how much it has changed."}, {"rating": "4", "text": "A pale and silly remake of the 1976 original, with extremely dumb scares (those awful nightmares). It doesn't even have the \"guilty pleasure\" feeling of Gus Van Sant's \"Psycho\"."}, {"rating": "6", "text": "On one hand it is bundled into a series of flaws that show up from time to time and make this a hollow release. They can be found in the directing, story telling and mostly in acting. I truly expected more from a Tony award winner like Liev Schreiber while Julia Stiles did give slightly more then the others (it made a difference). The little boy was good at times but behaved like an autist for the rest of it. The original little guy was evil incarnated! The fact a lot of this was filmed in the Czech Republic (you realize that at the end of the movie) made it much worse. Less authenticity and any will to use the Armageddon topic to the fullest is obvious here. Yes, there are brilliant momements of horror in split seconds where you can get a heart attack but there is a lack of perpetual evil here - where the plot gives you shivers throughout. That's what the old Omen did which was the best movie in the genre, aside from the Exorcist of course. But there is also something new and hip about this release which makes it worth seeing."}, {"rating": "2", "text": "Awful ... I never seen the original but friends say its alot better. I thought the acting was terrible and the whole film was very very slow. Lots of silence and stupid predictable scare moments...."}, {"rating": "9", "text": "Really enjoyable and probably a better film than the original. I have been a fan of the director for a while and his choice of actors over stars was a wise one. The death scenes are really cool and the new music is also quite good . Worth a watch if you like horror and depite what others say its my fav movie of the year so far."}, {"rating": "0", "text": "flat out horrible...and i mean that in every way possible...this movie is so bad a three year old could find himself laughing. It is nothing put pure trash and cinimatic garbage. The acting is so bad, the lot is so silly and the irector is so clueless of how to achive scares, that this movie falls flat out terrible."}, {"rating": "4", "text": "A hilarious film that had me laughing all the way through. Whoever's idea it was to cast this kid as Damien should be fired. There is one moment when the kid is wearing the mask from Jim Carrey's 1994 film The Mask that will have you in stitches."}, {"rating": "1", "text": "It was as if someone decided to take a Camera and film paint drying. Then they decided to call it \"The Omen\""}, {"rating": "6", "text": "Along with monsoons and sunburn, one inevitable by-product of summer (at least lately) has been a pile of Unnecessary Remakes of box office hits and pop-culture milestones from the 1970s, including in the last two years Willy Wonka and the Chocolate Factory, The Longest Yard, The Bad News Bears and Poseidon, with Tim Burton's candy-covered remake of the first being the only one of the bunch that had any reason to exist and the only one that didn't absolutely suck. (Don't be too surprised if, in the next couple years, you're treated to Vince Vaughn and Jack Black taking another whack at the Faber College homecoming parade, Jet Li as a half-Asian, half-Native American martial arts expert kicking redneck ass for peace and justice, and/or Keanu Reeves running down futuristic streets yelling, \"Hey! Soylent Green is people, dude!\") Surprisingly, this scene-for-scene retread of 1976's effective horror smash about a childless ambassador and his wife who unwittingly adopt the son of Satan, isn't all that bad...at least not any time the two lead actors aren't on screen. A big part of what made Richard Donner's original work as well as it did was the sheer class of its two stars, with Gregory Peck's steely solidness and Lee Remick's lovely, fragile vulnerability agdding tremendous tension and poignancy to the ultimate good-vs.-evil struggle: Atticus Finch himself debating over whether to kill ANY child, however satanic...how heartwrenching is THAT? [***SPOILERS***] Here, Liev Schreiber's single facial expression battles for screen time with his mercilessly unyielding monotone, while Julia Stiles is hopelessly amateurish. The complete ineptitude of these two pivotal performances has the unfortunate effect of drawing undue attention to the Hell-sized holes in David Seltzer's concept and script: for example, even though Robert Thorn isn't a beliver, he IS a politician, so wouldn't he have taken his son to church sometime before age 5 (if only for show and possible photo ops) and discovered something was amiss a lot earlier? (For that matter, wouldn't we have gotten a far more interesting film all around this time if Thorn had been rewritten as a typically RUTHLESS politician reaping his just desserts, rather than being recycled as a stolid goody-goody?) It both helps and hurts this remake that supporting players David Thewlis, Peter Postlethwaite (both hopefully doing this so they can afford the lower paychecks offered by doing films by Mike Leigh and Jim Sheridan) and Mia Farrow are such effective scene-stealers, with Amy Hunt as little Damien's fragile, doomed first nanny providing an object lesson in how to make a bit role truly unforgettable. Director John Moore does his best work yet (though considering that his previous films were the forgettable war movie Behind Enemy Lines and the totally uncalled for 1960s remake Flight of the Phoenix, that isn't saying a hell of a lot); he works hard at creating intelligent suspense and building momentum out of a series of foregone conclusions and frequently succeeds, giving us a couple of very effective claw-the-ceiling moments and at least one great gory bit that suggests that the Devil has been boning up on his viewing of Final Destination videos. By the way, does it strike anyone as a bit curious that while the religious community got all hot under the collar about the movie version of The Da Vinci Code, which could at least get Christians to engage in honest discussions about the particulars of their faith, if they can stay awake during the non-Ian McKellen portions of the film--while this film, which states that Satan can do just as good a job of protecting his son as God did His, only this time God stands idly by and lets the chips fall, debuts (on 6-6-06, no less!) without a chirp of protest. Are there some skewed values and priorities at work here or what?"}, {"rating": "7", "text": "It's actually pretty good...really scary, unlike most of the horror crap we get these days."}, {"rating": "7", "text": "An effectively eerie reimagining with a more modernized perspective on the story. It delivered and entertained throughout with an engaging pace and solid performances from Schrieber and Stiles. The atmosphere and scares were executed well and honestly i believe this is quite an underrated and an overly hated horror remake. Like many of the other remakes of late that are overly hated by horror purists this one deserves more credit. I don't know fans cant accept new takes on classics."}, {"rating": "5", "text": "Unfortunately this movie came out at a time when horror remakes were simply exact remakes of the original. This didn't work for Psycho and it doesn't work for The Omen. My only real positive is Mia Farrow, who excellently plays Mrs. Baylock, but overall the wheel is not reinvented."}, {"rating": "5", "text": "So initially when I first saw this movie I absolutely hated it. But after revisiting it I just think its overly mediocre. Its pretty much a shot for remake it's just less all around. Usually a redo takes the original and goes overboard with it. But director John Moore (Max Payne) takes a muted approach making most things have less impact. Most of the performances are good sexy Liev Schreiber (Scream), and the always dependable Julia Stiles (Save the last dance) are solid and Mia Farrow (Rosemary's Baby) is fun as the nanny. The only one whose lackluster is Damien himself, he's just pouty and annoying. Most of the death pieces are just okay except the awesome priest kill. The movie is completely unnecessary but its marginally entertaining, just forgettable.Budget: $25mDomestic Box Office: $55mWorldwide Box Office: $120m2.5/5"}, {"rating": "6", "text": "I don't know where they find this little boy, but he is scary as hell. Movie it's not in other hand, and story is not something that will take your breath."}, {"rating": "5", "text": "Well-cast remake of an ambassador adopting the antichrist when his own child died during labour but then, he has to kill him once he starts doing devil-ish things."}], "recommendations": ["poltergeist", "the_texas_chainsaw_massacre", "the_wolfman", "the_invasion", "the_thing", "scream_3", "carrie", "the_amityville_horror", "the_conjuring_the_devil_made_me_do_it", "halloween_iii_season_of_the_witch", "scream_4", "halloween_the_curse_of_michael_myers", "sinister_2", "the_last_house_on_the_left", "the_curse_of_la_llorona", "halloween_ii", "wrong_turn", "the_grudge_2", "scream_2", "insidious_chapter_2", "insidious_chapter_3", "the_ring_two", "the_texas_chainsaw_massacre_the_beginning", "vacancy", "ouija_origin_of_evil"]}