{
  "id": 2109,
  "title": "The League of Extraordinary Gentlemen",
  "starring": [
    "Sean Connery",
    "Naseeruddin Shah"
  ],
  "runtime": 110,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "To prevent a world war from breaking out, famous characters from Victorian literature band together to do battle against a cunning villain.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kdAuVFP63XXxnb983ry2pLCKd9S.jpg",
  "categories": {
    "plot": 5.695652173913044,
    "acting": 6.142857142857143,
    "ending": 4.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.0,
    "action": 4.785714285714286
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Sporadically entertaining with only somewhat passable performances, and an almost comprehensible story."
    },
    {
      "rating": "10",
      "text": "This movie sucks."
    },
    {
      "rating": "3",
      "text": "This presentation is riveting in that one must see what audaciously warped device is forced upon the preceding one. High marks for creativity, but the fact that this cobbled assemblage presumes to work is the only extraordinary thing about it."
    },
    {
      "rating": "9",
      "text": "Peta Wilson gave a amazing performance as mina harker and her outfit was da bomb! this movie is action packed and you are glued to your seat."
    },
    {
      "rating": "10",
      "text": "One of the most awesome movies you could ever see. Everytime it's on, I like to watch it. Why the hell would these critics be so harsh?"
    },
    {
      "rating": "0",
      "text": "This is definitely the only Sean Connery movie that I ever wanted to walk out on. I couldn't because I was with someone on a first date. She liked it. I never saw her again, in large part because she like it. I hated this movie. It was torture."
    },
    {
      "rating": "8",
      "text": "If your looking for a unique action movie than this is for you, the plot is admittedly extremely simple, but this movie packs a punch in the action department with cool characters with unique powers, and some awesome special effects, all in all if you can put up with the simple plot and some bad acting from time to time this is a great action movie that will have you drooling over some of the super cool over the top moments."
    },
    {
      "rating": "3",
      "text": "The League is far less than ordinary.\rA very spontaneous and unexplained film with no apparent reasoning by any of its characters or their actions. Decent acting, fair action scenes, but loses itself in its own confusion."
    },
    {
      "rating": "4",
      "text": "Alan Moore, the genius comic-book writer behind Watchmen, From Hell, and many other titles, has written deeper, more rewarding books than his League Of Extraordinary Gentlemen series, but it may be his single best idea. Shackling together creations from virtually every author who put a stamp on the public imagination of the 19th century, Moore created a proto-superhero team out of such characters as Captain Nemo, The Invisible Man, Mina Harker from Dracula, Allan Quatermain, Dr. Jekyll, and, of course, Mr. Hyde. Without sacrificing the rip-roaring adventures, Moore captured how each hero and villain served to exemplify the anxieties of their age. Addicted and spent, Quatermain looked like the idea of a noble empire on the verge of collapse, while Mr. Hyde was a peek at what lay just beneath the surface of Victorian propriety. Much of that gets lost in this big-screen adaptation, but the script, by veteran comics writer James Dale Robinson, keeps enough of it to make League a cut above standard summer action fare for the first hour or so. Sean Connery leads the league as a spry, cranky Quatermain, enlisted with some reluctance on the eve of the 20th century to stop an evil mastermind from starting a world war by pitting one European nation against another. For a while, the film cleverly pits one century against the next, suggesting that one of the great contributions of the forthcoming technological advancement would be to unleash brutality that the logistics of musket and cannon warfare had previously kept in check. The cleverness of the concept, joined to production design by David Cronenberg vet Carol Spier, keeps League moving for a while, making it all the more disappointing when the problems kick in. Connery and imposing Bollywood vet Naseeruddin Shah (as Nemo) aside, a league of less-than-extraordinary actors fills out the cast, with Shane West particularly grating as token American Tom Sawyer and Stuart Townsend none too beguiling as indestructible fop Dorian Gray. As the film progresses, all its characters' internal conflicts get flattened in the interest of traditional heroics, and even those could be better. Blade director Stephen Norrington, who quarreled with Connery throughout the shoot, doesn't know how to film an action scene that doesn't devolve into chaos: One long, explosion-filled chase through the canals of Venice almost needs footnotes, and the climax drags on so long that all the talk about the upcoming turning of the century seems in danger of becoming irrelevant. League begins as a smart variation on the summer blockbuster, then loses its nerve in a second half sure to satisfy neither cheap-thrill-seekers nor fans of neglected literary oddities. What's a Mr. Hyde rededicated to doing good deeds, except a less-than-incredible hulk?"
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie. It's not fantastic, but it's not terrible. Decent effects, ok acting, and good ol' fashion explosions make it worth a look, maybe even a rental, or, maybe SOMEday, worth considering a purchase."
    },
    {
      "rating": "0",
      "text": "You know that feeling where you want to chew your own fist off with embarrassment? Yeah... The dialogue *alone* is that bad but them then there's the holes in the plot... holes big enough to drive a bus through. If your I.Q. is higher than the metascore this is one to avoid."
    },
    {
      "rating": "0",
      "text": "\"It's a Winchester. Modified, American Style.\" \"'Bomb' voyage!\" \"The sound of treachery!\" \"To that end, I set my wolf among you sheep.\" -- \"Growl.\" Thanks again, Hollywood."
    },
    {
      "rating": "0",
      "text": "This was simply the most boring movie I've ever watched. It tries to cover up the boring parts with shiny effects. I wasn't fooled. It really sucks....ass.."
    },
    {
      "rating": "5",
      "text": "Vaguely entertaining action-fantasy elevated by the presence of Connery but otherwise fairly lame."
    },
    {
      "rating": "7",
      "text": "This movie stands out in the action genre was fairly entertaining to watch. Characters were a lot of fun but the plot overall was typical and the film suffers for it. The setting for the different acts all looked great as did the characters themselves. Nemo's ship and a lot of the architecture in the movie was accompanied the style of the movie very well. Historically, it was a unique fictional take on the end of an era and the introduction of hulking new forms of industrialism in the form of weapons and machinery but taken to an extreme level. This over exaggeration of new age industrial weaponry complemented the film's supernatural plot and made for good action. Despite its issues, this movie was enjoyable and is definitely worth watching for its one of a kind appeal."
    },
    {
      "rating": "6",
      "text": "When I was a kid this was honesty one of my favorite movies. When I look back at it now with a more critical eye I can defiantly see it's flaws. Yeah it has a silly simplistic plot but most action movies do. It's unique in who it chooses as heroes and who it chooses as the villain. That's what makes this a fun movie. Who hasn't wanted to see what would happen if the classic horror book characters (Invisible man, Dorian Grey, Dr. Jekyll/ Mr. Hyde) got together and made an X-Men like team. This movie satisfies this curiosity. No it's not a gem. It's not great but it's fun to watch and I enjoy it. Would I say that this movie is \"good\" per say. Well, maybe not but it's extremely entertaining, has a unique mix of characters and if you like the action movie genre you should enjoy this movie."
    },
    {
      "rating": "0",
      "text": "Easily one of the worst movies I have ever seen, The League of Extraordinary Gentlemen casually yet brutally violates its source material on an unimaginable degree, replacing the incredible atmosphere and amazing steampunk elements of the graphic novel with a slew of poorly developed characters and an incoherent plot. Clearly aware of the shortcomings of the story, the producers make a painful attempt to cover it up with stupid, boring, and gratuitous fight scenes that add nothing to the movie and came close to putting me to sleep. Plot and action alike are so poorly done that I spent the last 30 minutes of the movie in intense intellectual agony."
    },
    {
      "rating": "6",
      "text": "“The League of Extraordinary Gentlemen” has interesting set designs and some fun practical effects.   Sometimes it is even hard to tell whether the effect is CG or practical.  It is fun to realize that each character is from literature, but there is a severe lack of good dialogue, so the whole thing mostly comes across as a wasted opportunity.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."
    },
    {
      "rating": "4",
      "text": "Other than Sean Connery's reliving presence, this film is far from extraordinary, it's indifferently acted, and has a script that's bent on randomness rather than coordination."
    },
    {
      "rating": "10",
      "text": "I cannot belive the reviews for this movie. I agree that is not for an Oscar but 30?. The movie offers a lot of entertainment and curious characters and has a lot of sci-fi elements. I know many people that likes a lot."
    },
    {
      "rating": "5",
      "text": "It is an O.K movie with a good cast of characters (Neither good or bad performance). If you knew the source material than the movie is crippled beyond recognition. All the creativity from the source material is gone. For the movie as it is is pretty average in everything and worth watching but not remembering."
    },
    {
      "rating": "7",
      "text": "I sincerely don't understand the bad reputation of this movie, I found it good pulpy fun. Yes it didn't win any Oscars, but it's fun nonetheless"
    },
    {
      "rating": "2",
      "text": "Some years after this thing came out, I saw it on TV. And even then, as young as I was, I couldn't believe how laughably bad this movie was. I don't even know how to put it into words. It's an interesting watch, that's for sure. I'm not sure whether to recommend it or not. It's so awesomely horrible."
    },
    {
      "rating": "4",
      "text": "The listless movie adaptation of \"The League of Extraordinary Gentlemen\" has the sweat stains of wasted energy; it's dreary, yet frantic. The film is inspired by Alan Moore's comics of the same name, an imaginative and grisly take on Victorian heroes.\r Convened to battle a world-threatening evil, the league is a group of tough, forgotten or ignored British loners brought together at the behest of the queen to stop this encroaching danger. In the director Stephen Norrington's film, it's a plot engineered by a villain known as the Fantom to sink Venice, and, yes, eventually conquer the world.\r To foil this plot, the British Secret Service agent Sanderson Reed (Tom Goodman-Hill), working under the auspices of the agency head M (Richard Roxburgh), is determined to bring the league of misfit adventurers together. The first summoned is Allan Quatermain (Sean Connery), the legendary hunter and explorer who, though well past his prime, is still capable of some world-beating moves himself.\r Quatermain serves as president of these immortals, a number that eventually includes the pirate Captain Nemo (Neseeruddin Shah) and an invisible man, Rodney Skinner (Tony Curran, using his voice wickedly well). As the plot thickens, others link up, like Mina Harker (Peta Wilson), a victim of Dracula who now uses blood-sucking prowess for good. She helps, um, seduce to the cause the dandyish Dorian Gray (Stuart Townsend), whose portrait makes him invulnerable in addition to being impervious to aging — a witty turn that Oscar Wilde apparently had no interest in. The noble, rambunctious and innocent Tom Sawyer (Shane West), now an adult operative for the United States Secret Service, tosses his Stetson in.\r Eventually the league tracks down its final inductee, Mr. Hyde (Jason Flemyng), who stalks the streets of Paris after fleeing London. Wearing him down until he becomes the docile Dr. Jekyll, the league members browbeat him into joining. Aboard Captain Nemo's magnificent blade of a submarine, the Nautilus, the team sets out on its mission to find the Fantom and end his perfidy. Between bouts of bickering and possible treachery, the league must try to combat the Fantom's futuristic inventions — like tanks and flame-throwers — with valor, daring and some of Nemo's own engineering marvels.\r The film's screenplay by James Dale Robinson — who toiled in comic books for some time himself — takes pains to get the spirit of Mr. Moore's tale right. It's a formidable task, bringing the comics' dank, coruscating vision to the screen — an abiding interest of the producer Don Murphy. Mr. Murphy was also responsible for a previous Moore adaptation, \"From Hell\" featuring another Victorian misfit, Jack the Ripper. Mr. Moore's melancholic and apocalyptic stories have a dour, murderous humor drizzling through the depressive clouds. No one in comics is his equal at conjuring the end of the world, and in his stories — from \"The Watchmen\" and \"V for Vendetta\" through \"League\" — the world is awash in brutality and ugliness, deserving of doom. Mr. Moore's pleasure comes in serving up Old Testament balance.\r The league of his comics falls into two piles. One group consists of victims, like the haunted, doddering Quatermain, who battles an opium habit and fears that he's too old to do much good, and Mina, whose past with vampires is only alluded to (and who leads the group with her cool British common sense and an implied death wish stemming from her reputation as a fallen woman). Or else, they're sly, amoral psychopaths, like the invisible man, who's introduced raping young women at a girls' school, and Hyde, a calculating man-beast who remembers every slight done to him or his alter ego. The vengeance he finally takes on the invisible man is horrific, a fate that will never make it from the page to the screen. No one is going to follow that story to the letter in making a big-budget action movie.\r But Mr. Moore's \"League\" is a meditation on ambiguity, something large-scale-action spectacles have shied away from since \"The Empire Strikes Back\" which came so long ago it now actually feels like a legend from Victorian England.\r Despite the intentions to be reverent, Mr. Norrington, who did a ruthlessly elegant job directing \"Blade\" is bound and gagged by the need of \"League\" to be quick and glib. Somehow, you sense that Fox would be happier calling this picture \"The Justice League of Extraordinary Gentlemen.\" As it stands, the movie is neither gentle nor extraordinary. \"El-Sada El-Rigal\" may be a better movie than other Connery fantasy-action films like \"The Avengers\" but then again a glass of muddy water looks good to someone just coming in from the desert."
    },
    {
      "rating": "7",
      "text": "Bonkers over the top action/superhero fun. I got a soft spot for this one for sure."
    },
    {
      "rating": "6",
      "text": "don't wander off..The League Of Extraordinary GentlemenIt definitely is low on logic and a gripping plot but it is high on entertainment which can easily pass on as one of the guilty pleasures section."
    },
    {
      "rating": "10",
      "text": "This movie aged very well. The idea of gathering history most well known literature fictional characters and bring them to life in a single movie is extraordinary indeed, if not, geniusly done. The special effects blended well and gave it an immersive, almost old school like style movie watching experience, which elevated this to an instant classic!"
    },
    {
      "rating": "8",
      "text": "if you ignore it's source material, the movie itself is pretty decent actually"
    },
    {
      "rating": "2",
      "text": "“If you can't do it with one bullet, don't do it at all.”"
    }
  ],
  "recommendations": [
    "hellboy",
    "total_recall",
    "stargate",
    "hellboy_ii_the_golden_army",
    "captain_america_the_winter_soldier",
    "the_scorpion_king",
    "robocop",
    "armageddon",
    "conan_the_barbarian",
    "the_legend_of_zorro",
    "thor",
    "iron_man",
    "fantastic_four_rise_of_the_silver_surfer",
    "the_magnificent_seven",
    "the_great_wall",
    "ant_man_and_the_wasp_quantumania",
    "indiana_jones_and_the_temple_of_doom",
    "mission_impossible_rogue_nation",
    "twister",
    "men_in_black_ii",
    "reign_of_fire",
    "rampage",
    "hulk",
    "the_running_man",
    "elysium"
  ]
}