{"id": 4880, "title": "The Secret Garden", "starring": ["Kate Maberly", "Heydon Prowse"], "runtime": 102, "genre": ["Drama", "Family", "Fantasy"], "description": "A young British girl born and reared in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's castle. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' boys, she begins restoring the garden, and eventually discovers some other secrets of the manor.", "releaseYear": "1993", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/xvTK4KSFeHNl1QVzjYgOtHL2QYS.jpg", "categories": {"plot": 5.0, "acting": 10.0, "ending": 5.0, "soundtrack": 10.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Some people complained the makers changed the message of the book. They didn't, or I don't think so anyway. If that was the case, that was the only thing they changed. The script is focused and the direction masterful. The book in my opinion is one of the most enchanting children's books ever written. The film is equally enchanting, and the director manages to spoof a spirited performance from the lovely Kate Maberly. Haydn Prowse was great as Colin, and John Lynch is suitably melancholy as the uncle. Stealing the show, however, was Maggie Smith as Mrs Medlock, the truly beastly housekeeper. The film itself looks beautiful thanks to the stunning cinematography, and I loved the Gothic darkness tone retained from the book. Another mention is the haunting and poignant music score, that makes me cry. What does work best of all is its simplicity though. I thoroughly recommend this and Little Princess, 10/10 Bethany Cox"}, {"rating": "8", "text": "Based on Frances Hodgson Burnett book, this is good example about still is possible adapt classics opus that appreciate kids and grownups. It is faithfully to original and the whole cast makes it work as well."}], "recommendations": ["to_kill_a_mockingbird", "little_women", "finding_neverland", "charlie_and_the_chocolate_factory", "fallen", "the_english_patient", "the_great_gatsby", "cinderella", "a_christmas_carol", "the_addams_family", "the_count_of_monte_cristo", "sleepy_hollow", "the_electrical_life_of_louis_wain", "harry_potter_and_the_prisoner_of_azkaban", "amadeus", "edward_scissorhands", "once_upon_a_time_in_america", "chocolat", "murder_on_the_orient_express", "doctor_sleep", "anna_karenina", "wonder_wheel", "the_french_dispatch", "the_lovely_bones", "big_fish"]}