{
  "id": 2578,
  "title": "The Judge",
  "starring": [
    "Robert Downey Jr.",
    "Robert Duvall"
  ],
  "runtime": 141,
  "genre": [
    "Drama"
  ],
  "description": "A successful lawyer returns to his hometown for his mother's funeral only to discover that his estranged father, the town's judge, is suspected of murder.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tefUxj4Gg9hgQNgfEYd7kJQrIlD.jpg",
  "categories": {
    "plot": 6.3559322033898304,
    "acting": 6.516666666666667,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 7.5,
    "familyFriendly": 3.0,
    "funny": 5.666666666666667,
    "action": 7.142857142857143
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Judge is a departure from Robert Downey Jr as he has been potraying Iron Man for the past several years and hasn't done much of anything else that was significant. This movie displays a great performance from him and it seems to me as if he is almost playing Iron Man again at the first of the movie but it morphs into so much more than that before. Robert Duvall was great in The Judge as well. This movie really triggered my emotions and I think it could very well be the best movie I've seen this year and its certainly worth watching."
    },
    {
      "rating": "9",
      "text": "Would it shock you to learn that the professionals critics got it all wrong?  I saw The Judge today with a packed theater as it was sold out.  Robert Downey Jr. and Rober Duvall were absolutely brilliant as they played themselves basically.  The supporting cast was outstanding.  You sat on the edge of your seat listening to the back and forth barbs as you soon realizes that both father and son are hard asses and if you look in the mirror you would see the other.  The story was very sentimental in which the father becomes the son and the son the father.  It's a very good movie that theater audiences will see as word of mouth will spread."
    },
    {
      "rating": "7",
      "text": "Very touching, yet uncomfortable at the same time, because I could simply relate to the movie so much. The movie may have appropriated some cliches, but the overall theme of the movie was just enticing. Also, the actors have shown just an amazing acting in the movie."
    },
    {
      "rating": "7",
      "text": "Entertaining absorbing movie despite the 15 minutes slow start. Professional acting from the judge Robert Duvall and his three sons Robert Downey, Vincent D'Onofrio, and Jeremy Strong. Melodramatic movie about an evading son Robert Downey who became a good lawyer despite his far from ethical life, and his father Robert Duvall who has a judgement derailed by his love for his evading son. The storyline revolves about the family fate deeply hurt by, Robert Downey, the son who flew away from family and probable love. The family reunites again when the mother dies and the father is accused of hit and run killing. The past is revived, and the humanly true feelings are uncovered. An acting game that is not to be missed, the movie isn't though a box office magnet."
    },
    {
      "rating": "10",
      "text": "I don't understand how a movie can be criticized because it doesn't turn out in a certain way. We enjoyed this movie, with the many subplots (that's probably where the criticism comes from). It has excellent acting from all. I did wonder why it was never explained what the youngest son mental problems were about. I especially enjoyed Downey's character's quickness with figuring the legal angles. All in all, it was a story about a family's love, despite their many differences and faults which clash. Good scenery too!"
    },
    {
      "rating": "10",
      "text": "Beat my expectation. Looking at the poster itself seemed like a boring movie but the surprisingly weak plot-twist (SPOILER) like the girl he made out is his daughter, turns out to be his niece and later on his own daughter having similarities to her was interesting and funny. They approached the audience well, its a movie about a man who had father issues and addressed it well. You cant be coming into this movie thinking its going to be Iron Man 3 and having to be a movie about attorneys, they had to make it somewhat interesting for the audience. Good movie to see with a friend or brother and sister!"
    },
    {
      "rating": "10",
      "text": "Read the book years ago.  Loved the performances in this movie.  Robert Downey Jr. and Robert Duvall play the parts to a T.  Billy Bob Thornton didn't do a bad job - better than I would expect for the role he was playing.  Highly recommend it!"
    },
    {
      "rating": "7",
      "text": "In an ideal Metacritic world I would give this film a 6.5.……almost single-handedly Robert Downey Jr.   nearly pulls it off and brings the huge disabled cruise ship that is “The Judge“ to safe harbor….Downey creates a character that is so intriguing and somehow “new” that the film almost succeeds in holding our interest very much in spite of its unwieldy and all-over-the-map script and direction.……My feeling is that the film is worth seeing almost exclusively because of the opportunity to watch Downey and Robert Duvall “do their stuff”; each provides a sort of master classes in acting…..\r However, the film as a whole suffers SO badly from its impulse to go madly in all directions that it begins to feel more like a television mini-series crammed into a feature film format than an actual successful drama. Both the director and the script writer lack a sense of the those crucial boundaries that any film genre needs to accommodate and “The Judge” loses its way as indulges in far too many (almost whimsical) dramatic angles and possibilities i.e,….is this a psychological family drama ? a courtroom drama ? a film noir? a thriller? a coming-of-age story?……worst of all when the film begins to lose its way and grow quite muddled, the solution choice appears to be to pile on EVEN MORE plot developments…and this is  what eventually very nearly “sinks” it (despite Downey and Duvall’s very strong performances)…\r ……a good example of a film that succeeds in being a legal/courtroom drama AND a psychological thriller is the George Clooney film “Michael Clayton”- a really remarkable achievement and one of the best American films I have seen in decades ….and another example is the more modest achievement of the Matt Damon film “The Rainmaker” of several years back….both these films respect the limitations of the film genre they’re working in while at the same time cautiously stretching the material to add new dimensions …… “The Judge” tries  hard to do this but fails; it is an interesting failure, however, and hopefully the director will one day learn to reign in his overly ambitious narrative impulses……\r …....another criticism I have is that the dialogue in the film is frequently frankly unbelievable and over-the-top witty and clever ….many of these characters would have to be geniuses or near-geniuses to come up with the things they come out with and  Downey’s character especially often comes across as a sort of combination of Sherlock Holmes, James Bond and Zorro ! In fact dangerously close to the superhero Downey has now played in THREE “Iron Man” films !.... It's not be a stretch I think to suggest that at this point in his career Downey needs to watch out for  Iron Man Damage !…..\r My final criticism of this film is is its lack of any clear FOCUS. In fact, at times it feels more like a dream the director is having than an actual  movie and the narrative line all but disappears in a muddled and undisciplined phantasmagoria and this is really too bad because there is in fact a lot to like here; hence my ideal 6.5 rating."
    },
    {
      "rating": "7",
      "text": "John Grisham, the former lawyer turned novelist, has become known for his action packed, courtroom conspiracies. These films are always full of twists and unlikely heroes, but in his latest film, The Judge, Grisham takes a step back. The lawyers he creates have always been young and smart, but inexperienced and in over their heads, this time, it's just the opposite. Hank Palmer (Robert Downey Jr.) has left his small town upbringing behind and has become one of the biggest criminal defense attorneys in the country. Law has always been in his family, as his father, Joseph (Robert Duvall) has been a judge in that small town for nearly fifty years. Hank is home for a rare visit, when he starts to notice his father is deteriorating, but does little about it. One night, The Judge goes out to the store and hits someone with his car, his son contends, it was a simple accident, but the district attorney thinks it's something more, due to the Judge's former connection with the victim. Despite them never seeing eye to eye, and despite the Judge's stubbornness, he sees no choice but to let his big shot son defend him. Both actors in this film are terrific, few are as good as Robert Duvall, but the chemistry in this film is a bit of a problem. Robert Duvall is always this humble soft spoken guy, that pulls at the heart strings, but Robert Downey Jr. has a personality that's bigger than life itself. While Duvall was amazing, Downey Jr. always seemed to overpower him in their scenes together. The combination made for a few good laughs, but overall, Downey's personality overshadows the empathy the crowd had for Duvall. The bottom line, The Judge may not be John Grisham's most thrilling work, but it does pose some interesting questions of law and explores the necessity of a father/son relationship, even when the two parties don't really get along."
    },
    {
      "rating": "7",
      "text": "“The Judge” is a 2 hour and 20 minute film, half family drama and half courtroom drama, at least 20 minutes too long. The acting, particularly by Robert Downey Jr. and Robert Duvall elevate this film above all the clichés that you know are coming.\r On the verge of divorce, after finding his wife has cheated on him, and his mother having died, Chicago lawyer Hank (Downey Jr.) returns to his small hometown in Indiana where his father (Duvall) has been a judge for 38 years and sober for 28. Hank’s older brother Glen (Vincent D’Onofrio) had been a promising baseball player is now a married man with children who works in a tire store and a younger brother, Dale, (Jeremy Strong) who, due to mental disabilities, constantly has a camera in his hand recording everything.\r In spite of two or three twists and turns there are all the familiar scenarios including a high school girlfriend Sam (Vera Farmiga) who has a fatherless daughter who was born 9 months after Hank left town, a hyper young waitress Carla (Leighton Meester), who comes on to Hank along with a only in Hollywood storyline that makes for Hank to take on the defense of the judge who is accused of murder. This brings in a country bumpkin lawyer, Dax Shepard, which makes it necessary to be helped by Hank, along with slick opposing prosecuting lawyer, Dwight (Billy Bob Thornton) is holding a grudge against Hank. There is a completely unnecessary story involving Hank’s far too precocious daughter Lauren (Emma Trembay) showing that both the judge and her father have a soft side.\r Both Downey Jr. and Duvall bring their A game to the movie, especially in a scene that could have been a complete turn off, and Farmiga lights up the screen in her scenes with Downey Jr. Billy Bob Thornton brings gravitas to the film with another one of his fine performances and is getting better looking every year as he grows older.\r The direction by David Dobkin, along with the screenplay by Nick Schenk and Bill Dubuque, follow a course we have seen many times before brought to a higher level by the acting. The director of photography Janusz Kaminski, brings a Hollywood image of small town perfection to the film with everything green and shining. There is a breathtaking scene looking out from a restaurant that is shown twice."
    },
    {
      "rating": "7",
      "text": "A really entertaining movie with great actors and an interesting plot twist. I really liked the fact that the end is not what you would expect from a movie but instead it shows a more \"realistic\" point of view. The actors are all amazing especially RDJ and Duvall. The soundtrack fits the movie perfectly and is really moving. You should definitely check it out. 7/10"
    },
    {
      "rating": "7",
      "text": "A very family-centered film, decent film although it depends on who you ask.\rRDJ is great in this role, a different type of character than he normally plays. Robert Duvall great as well. Smaller roles for others, mostly forgettable. Story is cliche and predictable, except for final scene.\rIn summary, worth a rent if you want a good simple movie without explosions. Wait for it on Redbox or Netflix."
    },
    {
      "rating": "6",
      "text": "While there was originally some Oscar potential for this court-room drama, it sadly failed to be a contender. To start, the direction of this film felt lost from time to time. Maybe someone else like, preferable anyone else (except for Michael Bay or M. Night Shamaylan). Also, the film stretches certain scenes that come off as unnecessary. But despite its flaws, Robert Duvall is the saving grace of this film. His character holds the movie together and is the true character that we come to truly know and love. Robert Downey Jr. is good in the role, but I wish this movie could have been something more, but overall, it's just an enjoyable for the main purpose of Robert Duvall and the court case scenes primarily. I give this a B-!"
    },
    {
      "rating": "7",
      "text": "Oscar season is here and I saw this movie because Robert Duvall is nominated for best supporting actor.  Duvall, now 84, has appeared in dozens of movies, but no blockbuster hits since the 1970’s - 1980’s.  Robert Downey Jr. has the lead role.  I find that both actors can be either really interesting or really tedious.  As a result I wasn’t expecting too much, and was pleasantly surprised to find that the movie is much more watchable than the reviews would indicate.  Duval plays an aging small town judge with high standards and an impeccable record, who may have committed a murder.  Robert Downey Jr. plays the prodigal son, who left town many years ago with a chip on his shoulder and has become a talented and cynical lawyer who defends wealthy sleaze balls.  The story is more about the redemption of their relationship and finding their humanity for each other, than it is a courtroom drama. (It’s certainly less dramatic than something like, say “The Client.”)  It a feel good movie, and a worthy rental, but Given Edward Norton’s performance in Birdman, I think it’s doubtful that Duvall will win."
    },
    {
      "rating": "7",
      "text": "Juega mucho con los sentimientos y está llena de pequeños detalles que la hacen una buena película. Puede que en algún momento se haga pesada/larga, pero no aburre."
    },
    {
      "rating": "8",
      "text": "Really handsome actors and exciting plot. I like the movie and I hope to watch it by my Aurora blu-ray player. I always like this kind of movie which makes me excited to continue watching it."
    },
    {
      "rating": "10",
      "text": "Fabulous movie! Excellent cast! Great direction. The reality of the story is gripping, often painful, and allows for brilliant interaction between Robert Downey, Jr and Robert Duvall. Although Vera Farmiga's screen  time is minimal, she makes the most of it  and shines. Jeremy Strong is worthy of a nomination for his spot on portrayal of his mentally flawed character. All in all a great movie experience.  This is a film to add  to one's collection of  classic drama."
    },
    {
      "rating": "10",
      "text": "Very gripping and deep in the sense of father/son interaction. The whole cast was great, Duvall and Downey especially. Kudos, this was the best movie I have seen in a while."
    },
    {
      "rating": "7",
      "text": "I decided to pass this movie in the time of rating because the perfomance of Robert Downey Jr. is always amazing, and gets to save the picture. But the movie contains a lot of failures at the time of look like a film which opts for the Oscar."
    },
    {
      "rating": "7",
      "text": "Touching story about a father and a son who can't be near each other without fighting but fate bring them together. Their story is quite well developed on screen and Duvall and Downer Jr give amazing performances. Thorton also appears as a potential antagonist but he proves to be a very kind man in the end and it fit well on the script. The main problems in The Judge are the unnecessary roles of Farmiga and Meester and their weird story with Hank Palmer's family, which doesn't end clear, and the ending. It was very weak comparing to the rest of the story."
    },
    {
      "rating": "6",
      "text": "Very watchable, interesting plot but a bit too long. Downey is great, Duvall acts well as a horrible control freak. I didn't like the other characters at all. The film eloquently demonstrates just how dysfunctional America has become."
    },
    {
      "rating": "7",
      "text": "Watching Robert Downey Jr. in a not Ironman rol is quite good, watching him exploit all his acting abbilities as portrayed as they are in this movie. He is an incredible actor, as also is Robert Duvall, and both of them show that in the film. The plot is quite good, an attorney goes back to his home town for his mother's funeral just to find out that his father is accused of murder, and now he shall represent him at the court. It's a very emotive family drama, being also mixed with some nice court scenes. Though, the movie can get boring at some parts, and some another ones you are going to feel that they are not necessary for the plot, and there are also going to be some incredible coincidences, but the film itself is entertaining.\rReal score: 6.7"
    },
    {
      "rating": "7",
      "text": "I will say I personally loved the movie. But that is largely in part because I love movies about law. As a movie it has great acting, and a great story. However it never really surprises you with anything, as the case goes along with no real large twists or turns and the verdict is what everyone thought it would be. It is very emotional and in my opinion worth the watch."
    },
    {
      "rating": "9",
      "text": "I had no intention of seeing this movie and only went because my wife wanted to go. I went to the 10:40 showing and was expecting pass out at some point since I had been up since 6am that morning.\r The movie actually turned out being really good. It wasn't perfect, but it had the perfect mix of comedy and drama with a star studded cast."
    },
    {
      "rating": "6",
      "text": "Robert Downey Jr. chews up a role that's customized for his overblown, confident style. He plays a big-city lawyer who returns to his small hometown and the very strained relationship with his father (Robert Duvall), a judge in more ways than one. When the judge is accused of murder, his son swoops to his defense. While much of Downey's grandstanding is enjoyable and Duvall's performance is exceptional, this screenplay is chocked full of cliches and an overabundance of mean-spirited interactions. There is a relatively solid court case at the center, but the excessive length and obvious attempts to create a compelling drama weigh on the final verdict."
    },
    {
      "rating": "8",
      "text": "Encumbered by a trailer that doesn't do it justice and critics reviews that keep using the term 'mawkish' as if it's going out of fashion, 'The Judge' turns out to be a much better film than expected. Anchored by two powerful performances Its hefty running time just flies by. I concede that at times it seems in danger of toppling into paint by number TV movie of the week territory, but to its credit this doesn't actually happen. The two Roberts, Downey jnr and Duval, play off against each other perfectly, even if for me Downey Jnr has the edge. He never puts a facial expression wrong and I believed his character totally.\rA bathroom scene between the pair starts off shockingly but, with perfectly judged precision, becomes lighter as the scene progresses. The delicacy of the playing here makes these moments a highlight.\rThe supporting cast don't really have a lot to do but are all more than adequate and the screenplay to its credit does offer up a fair share of surprising plot twists.\rOn the negative side the score single handedly threatens to derail the whole thing as it is far too syrupy. Indeed, this is where the mush is coming from, not the story or the actors. Also, the coda in the boat comes on like 'On Golden Pond'. All that's missing is Katharine Hepburn and the loons!"
    },
    {
      "rating": "8",
      "text": "Incredibly clichéd and deliberating the pulling of heartstrings a little too frequently, The Judge is far from fantastic – but its consistently charming tone and some powerful performances overshadows these detrimental elements."
    },
    {
      "rating": "6",
      "text": "Robert Downey Junior is good in this film but not nearly as good as he could've been if he had a better director showing him the way. It's a sweet film that meanders a little bit too much for its own good. I certainly wouldn't recommend it, but I enjoyed it and I'm glad that I saw it. It may be hangs on for about 15 minutes too long but I can forgive that sin."
    },
    {
      "rating": "7",
      "text": "\"The Judge\" stars Robert Downey, Jr. and Robert Duvall in a film co-written by David Dobkin (who also directed), David Seidler and Bill Dubuque. With a supporting cast of notable performers including Billy Bob Thornton, Vera Farmiga and Vincent D'Onofrio, this is nothing more than a vehicle for Messrs. Duvall and Downey who find themselves enmeshed in an unconvincing story filled with subplots which keep popping up in an often disruptive manner.\rThe film is approximately 2 and ½ hours long and, with that span of time, should have offered the viewers more than the one outstanding performance by Mr. Duvall (who could recite the alphabet and make it sound like eloquent prose). The bottom line, however, is that this talented cast of actors deserved something better to display their talents. For that reason, the writers and director  will have to place themselves at the mercy of the court of viewing opinion and, plead guilty as charged. I give the film a 7.5 rating."
    },
    {
      "rating": "3",
      "text": "I saw this at TIFF and I've had a month to process. The bad reviews by the critics really do say it all and the good reviews highlight how the meta critic system can be flawed.  Rex reed gave this move 4 stars so it gets 100 here, that doesn't seem right.   I don't believe for a second that anyone honestly feels this is a perfect movie.\r Its far from being a terrible movie but its got more cliches per square inch than anything I've ever seen.  Writing a character that is described as \"big city lawyer\" should be up there with villains twirling their long mustaches to show they are evil in this day and age.  it also has an industrial heart string pulling machine in it because they try for everything.  Here are some of the things that the film makers hope you can identify with:\r Strained relationship with a parent\rCancer\rDead mom\rFunerals!\rSmall town living\rRegrets from being an out of control teen\r None of it really matters because its star power that drives this ship and for the past month I've been hearing and reading people basically going nuts for RDJ.  OMG I love RDJ, he is the best... why is Ironman in court? its Tony Stark goes to Washington I'm totally going to watch it. Please don't get me wrong, he is awesome as Tony Stark/Iron Man.\r Maybe I don't watch enough \"big\" movies and I'm holding it to an unrealistic standard but it just keeps going through my head that so much money and effort when into making everything look great but in the end its such an uninspired forgettable movie.  Its like you are in France and go the the best cafe expecting the best coffee and crescent of your life but you get a coke with a twinkie.  Its Coke made with real sugar and they put it in a glass and the twinkie on a plate but that doesn't change what it is.\r I think the movie is going to do alright in theaters and very well as burned DVDs for grandparents"
    },
    {
      "rating": "5",
      "text": "'The Judge' wasn't much of the big deal. It was entertaining and had a really great supporting performance given by Robert Duvall, I'll give it that, but it isn't really an experience and it can sometimes become forgetful."
    },
    {
      "rating": "4",
      "text": "Meh.\r Unlikable people doing unpleasant things. They're all miserable, dried up husks of people who have fffed up their lives so completely that nothing at all will ever make it better.\r The actors play these parts well but you really just don't care what happens to them."
    },
    {
      "rating": "3",
      "text": "I think Richard Roeper of the Chicago Sun Times gave the most accurate review. To me as an average moviegoer it seemed as if this was two movies, sandwiched together to make a one big and a bit too long one. One could have been the family stuff, school boyfriend girlfriend relationship, uncertain children, a big brother's broken career, the accident that caused it, and the final resolve...and the second movie about the judge who was a harsh father, very strict as far as the laws go, but now has a severe illness not told to anyone, and on the top of all that, is now accused of murder, and needs his alienated son (or any lawyer, for that matter) to defend him properly.\r The acting is great, and one cannot say anything negative about Duvall and Robert Downey Jr. who delivered great performances as is expected from these two veterans. The movie is filmed in Massachusetts and not the fictional Southern Indiana redneck town of Carlinsville which does not even exist. Although there is actually a Carlinsville, Illinois, which is just about as charming as its fictitious twin in Indiana. One thing I can assure you, there is no owner/waitress in any diner in Carlinsville (fictitious or real) that looks anything like gorgeous Vera Farminga and her daughter in the movie...I swear by it...!\r Save your money and watch the movie when it comes out in the Red Box for a dollar a night....and enjoy the popcorn!"
    },
    {
      "rating": "2",
      "text": "This film sets high expectations that it just couldn't deliver, with an all star cast put to waste. The Judge craves critic's attention, and they don't seem to be buying it.."
    },
    {
      "rating": "0",
      "text": "Awful awful awful awful worst movie I've ever **** seen god damn gay as **** I'm just typing more characters to fulfill the 150 character quota but 4real The Judge sucks so much Jesus God."
    },
    {
      "rating": "6",
      "text": "Despite the critics’ complaints about clichés, The Judge keeps the action moving and manages to entertain. It was an Oscar-nomination vehicle for Robert Duvall in the title role, who roared through the script so that even his clichéd lines sounded like originals when spoken by such a legendary actor. However, the film was a disappointment for Robert Downey, Jr. in the role of the sharp, city-slicker lawyer, Hank Palmer. Downey has told the press that he covets an Oscar, and this was the first attempt  from the ma & pa production company with the unlikely name “Team Downey” to get him a nomination.\r Although Downey has his moments, there is still more than a hint of the Iron Man persona lurking underneath the attorney's expensive suit and designer sunglasses. Downey is still magnificent to behold with his intensity and his sensitive dark eyes as he deals with a father who is so stubborn that he is self-destructive. And his character's  questionable ethics as a brilliant lawyer who can get anyone to walk suits his problematic personality. (He is his usual hyperactive self in the film, which is written into the script when his ex-girlfriend says he talks continuously “like vomit.”) When accused of only defending the guilty, Downey’s best line is, “Innocent people can’t afford me.”\r A surprisingly effective performance pops up in the form of Billy Bob Thornton, who plays Dwight Dickham, a steely lawyer with an ax to grind, and even when he sees his enemy defeated and broken down in tears, his sense of humanity, which arises only for a moment, is quickly suppressed. There are some philosophical thoughts about the nature of justice buried in the script, but many weak areas prevail. Hank Palmer has two brothers. The older brother (Vincent D’Onofrio) seems to bear no relation to him; the younger brother (Jeremy Strong) is autistic but the autistic personality is not consistently portrayed.\r Much to my amusement, Downey has a few love scenes in this film, and he actually has a scene with an onscreen wife. Of course, the only reason he appeared with a wife was to make it clear that they hated each other and were definitely getting a divorce. His love scene with the young bartender (Leighton Meester) shows them kissing only briefly, and it’s a long shot. The more complicated kissing scenes with his hometown ex-girlfriend (Vera Farmiga) look a little stiff and uncomfortable. So I had to smile when Farmiga remarked in an interview that producer Susan Downey was on the set the whole time, and that Farmiga kept looking over to Mrs. Downey for approval because, after all, Susan Downey kisses her husband all the time. So that explains the robotic moves. Farmiga is a great actress; it’s hard to make her look wooden.\r I suspect that if Robert Downey wants an Oscar nomination, he should issue an edict announcing that the producer isn’t allowed on the set."
    },
    {
      "rating": "7",
      "text": "Robert Downey Jr. almost singlehandedly lifts this movie into the worth seeing category. Robert Duvall also does a great job in this movie. The story is a bit cliché and at times overly slow but it is told well enough to make this movie well worth watching."
    },
    {
      "rating": "1",
      "text": "This is a great movie to drink too. If you're decently **** you forget the plot holes, contrivances, and cliches.\r Actually, its the only way to make this movie watchable since you can view it as an unintentional comedy and idiotic **** like incest subplots become funny."
    },
    {
      "rating": "9",
      "text": "I really liked this movie. Sure, it has its flaws but the performances by the amazing cast are too good. Not to mention the fact that the film resonated with me very strongly because of how much I could relate to a big chunk of what was going on as well as the characters themselves. Plus it's nice to see RDJ play someone else other than Tony Stark again, though the character he portrays does admittedly have shades of Stark in him."
    },
    {
      "rating": "5",
      "text": "The Judge's main flaw is the overabundance of clichéd characters, from the title role itself to that of Billy Bob Thornton, Also, trying to establish moral high-ground and raise questions of legality, specifically the case when something \"feels\" just but the law says it isn't. Well, at the end of the film, those issues remain unaddressed, and while everybody loves an open ending, this is not the case. It could be the multitude of sub-stories (relationships with the brothers, with the ex girlfriend, with the ex wife, with the daughter) that make The Judge seem generally unfinished, despite the 2-hour duration.\r Robert Downey Jr's comedy sure is entertaining, but I wonder if it was appropriate most times, given the seriousness of the topic. Robert Duvall's character is one we've seen dozens of times (stone-cold father trying to prepare his son for the hardships of life), therefore it doesn't leave much room for acting. It feels like the rest of the cast, in spite of the tiny screen-time, did a better job than the leads.\r I'd also like to point out the annoying soundtrack choices."
    },
    {
      "rating": "10",
      "text": "It is definitely the movie for the male part, because no one better can understand son and father relationship. Simply amazing with the right amount of humors and emotios."
    },
    {
      "rating": "6",
      "text": "This film confounds me.  On one hand the performances of Duvall and Downey are great and their scenes together are fantastic.  On the other hand there are multiple sub plots that are just pointless and makes the film about 30 minutes to long.  The performances alone get this film a recommendation. B"
    },
    {
      "rating": "1",
      "text": "I could not believe how bad this movie was. Stereotypes, cliches, and corniness galore: overly demanding authoritarian dad, slick city lawyer returns to small town, sympathetic mentally disabled son, star athlete son whose career was cut short by tragedy.  And worst of all, a goofy, small town lawyer who's so nervous he throws up every day before court.  So we're to believe that after sitting on the bench for 40 years, this is the best a county judge could get to defend himself on a murder charge?   Such an insult to Duvall, Downey and co. The only believable characters/performances were Vera Farmiga and Billy Bob Thornton in supporting roles.  The Duvall best actor nomination was obviously a lifetime achievement nod: he's a great actor, but this was his worst performance I've seen."
    },
    {
      "rating": "7",
      "text": "The Judge is a powerful and emotional movie, way more than I expected. Duvall is brilliant, and the movie's themes of reputation and abandonment really come through in a couple crucial scenes. But don't let that deter you from seeing it: those crucial scenes are what make the whole movie worth watching. Other than that, all that's left are the usual separated couple with a young daughter, cocky lawyer, honest and tough father, family drama, and rekindling with an old flame. The \"small town\" setting is the right choice for this movie, and it does its best to incorporate everything else."
    },
    {
      "rating": "2",
      "text": "As the story drags on, the story starts to fray despite the strong characters present.  Rookie writer twist and mini-stories placed in the story show that this is a movie where the screen writers and directors were searching for anything they could to keep the momentum going.  Pass on it."
    },
    {
      "rating": "7",
      "text": "Robert Duvall‬ is outstanding and so is Robert Downey Jr.\r Little outbursts and disagreements of the duo have been executed brilliantly and framed exceptionally well by ‪Dobkin‬. The bit where Duvall rushes up in high squall carrying a temper whilst Downey follows for war is one of the most dramatic scenes that shows how puny nature is against human commotion! Humour is strewn in the movie and when you have Downey with the bat, it always makes home runs.\r Drenched with drama the movie has an apt theme that runs around the convicted irony - the Judge who isn't willing to let his guard down and who hates his middle son Downey for so many irreparable reasons that he can't just give in. Whilst Downey, the forlorn child who never returned to his parents owing to the long born and bred abomination he burnt in, tries to save him from the clouded murder of a foul-mouthed obnoxious hill-billy.\r The score is apt and the screenplay is intense. Loved how Dobkin carried it all. The amount of focus he put in, in every frame is worth commending. A must watch for Downey's wit lovers and also for dramaholics."
    },
    {
      "rating": "5",
      "text": "A heart-warming, cliche bucket which to be honest is in parts humorous but for the most part it fails to hook the film goer into actually caring about the characters. It hits almost every cliche on the head from big city lawyer goes home to a small town to a father and son fishing on the lake with a whole sandwich of other cringy/yet surprisingly forgivable sequences, mostly due to RDJ's black tie humour.\r My biggest complaint has to be the court case. The story behind it and build up kind of felt like someone letting the air out of a deflating balloon in a cactus farm."
    },
    {
      "rating": "4",
      "text": "The movie starts really boring, at least for 20-30 minutes. I couldn't see how it can even start to entertain me, and at the same time I was also annoyed with the sub-par acting. I was relieved not to continue watching this movie after about 40 minutes into it."
    },
    {
      "rating": "8",
      "text": "I realized that some newspapers such as The New York Times were very critical of this film, but I believe that this film is the best acting Robert Duvall has done since \"Apocalypse Now.\"  His wild tough as nails performance may well be an Oscar contender.  Robert Downey Jr. is the big city lawyer/prodigal son who returns home.  His tough, often sarcastic and arrogant legal arguments are compelling, yet he has a softer, sentimental side.  The local color of rural Indiana adds so much beauty and small town feel to this drama, as does the Bon Iver song, \"Holocene,\" which is used in the beginning and end of the film.  The resolution of the family feud is not what one would expect, yet the end is poignant and heartfelt, yielding a very American story that is brawling, yet full of sentiment and heartfelt family stories we can all identify."
    },
    {
      "rating": "5",
      "text": "The Judge benefits most from an excellent leading performance by Robert Downey Jr. and great supporting work by the great Robert Duvall. While The Judge is beautifully filmed, the film overall lacks some needed substance not to mention the 2 1/2 hour runtime, this is just way long."
    }
  ],
  "recommendations": [
    "the_town",
    "brothers",
    "gone_baby_gone",
    "silver_linings_playbook",
    "arbitrage",
    "all_the_money_in_the_world",
    "the_lincoln_lawyer",
    "donnie_brasco",
    "black_mass",
    "american_hustle",
    "joy",
    "the_fighter",
    "widows",
    "the_intern",
    "fracture",
    "as_good_as_it_gets",
    "fences",
    "rain_man",
    "steve_jobs",
    "the_descendants",
    "the_iceman",
    "knives_out",
    "blue_jasmine",
    "gifted",
    "the_terminal"
  ]
}