{
  "id": 3073,
  "title": "The Mask of Zorro",
  "starring": [
    "Antonio Banderas",
    "Anthony Hopkins"
  ],
  "runtime": 136,
  "genre": [
    "Action",
    "Adventure"
  ],
  "description": "It has been twenty years since Don Diego de la Vega fought Spanish oppression in Alta California as the legendary romantic hero, Zorro. Having escaped from prison he transforms troubled bandit Alejandro into his successor, in order to foil the plans of the tyrannical Don Rafael Montero who robbed him of his freedom, his wife and his precious daughter.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/QBxafkXiqUadYWsVZGhi8qyPT6.jpg",
  "categories": {
    "plot": 8.88888888888889,
    "acting": 8.666666666666666,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Antonio Banderas for the win!"
    },
    {
      "rating": "10",
      "text": "In this film, the legend of Zorro, a Mexican masked hero who fights for justice against oppressive Spaniards, comes to life. And the film is excellent in all aspects. Here, the story of the film is intertwined with political intrigues involving the independence of the Republic of California and the American desire to expand from coast to coast.The story is interesting and gives us good moments of romance and adventure. The time when everything happens is interesting and shows the decline of the Spanish Empire and the expansion of the USA. It is a historical time that allows for excellent costumes and scenery, and it was very well portrayed, almost as a compliment to Hispanic culture. Of course, there are certain things that didn't go so well and the historical details of the sets and costumes can be the subject of some debate.António Banderas gained fame and projection, in good part, with this film. Besides being a handsome man, he showed talent and did a good job as an actor. Good moments of action, good sword fights and a certain rebellious boldness characterize his character and the actor was able to meet what was asked of him. Another very evident and very well accomplished thing was the intense chemistry with Catherine Zeta-Jones, with whom he acted and made a romantic pair. She, in turn, was also very well here, exuding sensuality and personality. Next to them, Anthony Hopkins, always impeccable. Stuart Wilson and Matt Letscher are good at villain roles and do their job very well here.In addition to the very good scenarios and costumes, the film has good cinematography, good colors, an elegant light, good fights, good action and a permanent sense of adventure help this film to become pleasant and even memorable. In fact, it was one of the best adventure films of the nineties."
    },
    {
      "rating": "8",
      "text": "A swashbuckler that works on its own terms. A little overlong in the middle act, though. The action's good, but it seems to be the lighthearted swashbuckling kind as opposed to the usual blood, viscerallity, and high body count. Rich people seem to be a common choice of villain in recent movies of late."
    },
    {
      "rating": "10",
      "text": "This a very very cool movie is great."
    },
    {
      "rating": "10",
      "text": "higuguguihjhjhjbtdrssawetyipplmmjbhvgcdsqetthjjhdrghimbhzxcvbnmmklknhbffsasgrewqtyuioomsksmosmsksmdkdmdkmlmlmslh"
    },
    {
      "rating": "10",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "10",
      "text": "This movie is phenomenal and definitely one of the most underrated movies of all-time.  The plot is great, everything flows wonderfully from scene to scene and it gives you that feel of a real authentic movie.  The action is fantastic as well, I mean who doesn't love sword-fighting especially when its done this good.  I thought characters were also well mapped out and you really do care what happens to them."
    },
    {
      "rating": "8",
      "text": "Martin Campbell was on another planet when it came to directing 90's action movies. When talking about the best ones of the era, I'm honestly stunned this one isn't mentioned more often than it is. \"The Mask Of Zorro\" is satisfying, effortless fun, filled with stunning, brilliantly realized set pieces, charismatic performances from Hopkins and Banderas and a terrific score from James Horner. This is your textbook example of a movie taking a formula, applying it and adding just as many flourishes as it needs to in order to fool the audience. An aging adventurer looking to usher a young pupil into assuming his mantle of heroism is no new thing. Secondary elements like the villain's evil scheme, the choreography or the set and costume design allow enough room for the filmmaker to leave his unique stamp on a kind of story. With \"The Mask Of Zorro,\" not only does Campbell deliver an indelible spin on the \"passing of the torch\" narrative, but a sub-genre I never thought I'd ever say we could use more of — swashbucklers."
    },
    {
      "rating": "7",
      "text": "Right from its grand and bombastic opening logos, you get the distinct feeling when starting \"The Mask of Zorro\" that you're in for a ride  and considering this is an action picture from Martin Campbell, it doesn't disappoint. This is a highly entertaining and well-made movie with a script and characters as clean and beautiful as the direction and practical effects. It's big, it's exciting, it's explosive and it's very memorable."
    },
    {
      "rating": "8",
      "text": "Fueled with slick dialogue and a script that benefits greatly from the charismatic leads of Antonio Banderas and Anthony Hopkins, The Mask of Zorro is a spectacular swashbuckling tale with an endless knack to entertain."
    },
    {
      "rating": "8",
      "text": "The Mask of Zorro will be a great classic someday. The Zorro films have always been inspiring and original, and that's what makes them special and unique. This film, like a great scotch, will get better with age."
    },
    {
      "rating": "7",
      "text": "More than any other movie this summer, The Mask Of Zorro represents a triumph of corporate anxiety, a desperate attempt to revive the old swashbuckler genre for today's audiences by throwing in every action/adventure standby (anachronistic dialogue, kid-friendly pain humor, the obligatory love duet during the closing credits) short of a sport-utility vehicle. Why else would it need two Zorros? But there's no use pretending that the films of Douglas Fairbanks and Tyrone Power were any less formulaic, and The Mask Of Zorro is disarming for the same reasons, coasting on the charisma of its stars and a few exciting action setpieces. Anthony Hopkins plays the original masked hero, protecting California peasants from an oppressive Spanish governor (Stuart Wilson) in the early 1800s. Not so easily thwarted, his nemesis exacts his revenge, murdering Zorro's wife, throwing him in prison, and raising his baby daughter—who will grow to be the almost comically beautiful Catherine Zeta-Jones—as his own. Too old by the time he finally escapes, Hopkins recruits an eager protégé, the ideally cast Antonio Banderas, to set things right. Both Zorros are obviously having a good time, with Hopkins enunciating beautifully (he makes a meal out of \"Esperanza\") and Banderas marveling at himself as he pulls off his many schemes and guises. Journeyman director Martin Campbell, whose previous credits include GoldenEye, doesn't really have a style of his own, but he knows how to deliver on a franchise. Attractively mounted, unpretentious, and always engaging, The Mask Of Zorro may benefit from lowering standards, but compared to murky, incoherent efforts like The Man In The Iron Mask and Robin Hood: Prince Of Thieves, it delivers the goods."
    },
    {
      "rating": "8",
      "text": "''The Mask of Zorro'' extends a tempting invitation: travel back to the days when swashbuckling was serious business, when boyish adventure films still had their innocence, when the bravado of thrilling stunt work was all a movie needed in the way of special effects. With a wealth of charismatic Zorros (two), a smashing heroine and a dauntless love of adventure, this is hot-weather escapism so earnestly retrograde that it seems new.\r Directed by Martin Campbell, who gives it the same gaudy Bondian brio he brought to ''Goldeneye,'' this Zorro features heroic derring-do from three men. First and most distinguished is Don Diego de la Vega, a k a Zorro Senior, played by a marvelously game Anthony Hopkins with unexpectedly elegant panache. Then there is his jokey, hot-blooded protege, the role that Antonio Banderas was obviously born to play.\r And behind the scenes there's Robert Anderson, sword master to the stars for 45 years (he worked with Errol Flynn), who has choreographed the film's many sword fights with spectacular flamboyance. If Mr. Anderson's style looks familiar, that may be because it was he who matched light-sabers with Luke Skywalker while dressed in a Darth Vader suit.\r There are ''Star Wars'' overtones to the story here, too, since ''The Mask of Zorro'' draws on the relationship between mentor and hero-in-training with the same debt to Joseph Campbell's mythic motifs. None too seriously, you understand -- just well enough to keep the film's castanets clicking. This format requires an early tragedy, and that happens when Zorro Senior loses his raven-haired wife and baby daughter to the evil Don Rafael Montero (Stuart Wilson), an early-19th-century Spanish governor of Alta California. There's something irresistibly quaint about the moment when Zorro and his wife, while sharing a tender moment at home, suddenly find themselves surrounded by a dozen sword-clanking soldiers who somehow crept noiselessly into the house.\r Though the dashing Don Diego has donned the Zorro mask to fight Spanish oppression (see assorted Zorro reruns on the late show for further details), circumstances now demand that he vanish for 20 years. He turns up again in the midst of a scraggly, unwashed crowd who can be described only as wretches in this context. Meanwhile, no less scraggly is a hapless thief named Alejandro Murrieta (Mr. Banderas) who has his own reasons for hating Don Rafael.\r It also happens that when Alejandro was a young boy, in the film's first big swashbuckling scene, he helped to save Don Diego's life. Later, when they meet as adults and Don Diego does him a good turn, Alejandro asks, ''Why are you so eager to help me?'' Don Diego replies, ''Because, long ago, you did the same for me.'' (The dialogue all sounds like that.) From here, it's not long before these two begin their Zorro lessons. Clowning merrily without jeopardizing his smolder quotient, Mr. Banderas is shaped most endearingly into a protege worthy of mask, steed, mission and the works.\r Gracing ''The Mask of Zorro'' with a beauty inevitably described as ''beyond compare'' is the stunning Catherine Zeta-Jones. She plays Elena, Don Diego's long-lost and predictably raven-haired daughter, and she does it so showstoppingly that the film's appeal extends well beyond boyish action-adventure.\r Enchantingly paired with Mr. Banderas for a scorching tango, a hearty duel, a scene in a confessional that has him impersonating a priest and other such vintage-style encounters, Ms. Zeta-Jones makes her first major film role one to remember. It's worth noting that her bold, alluring Elena is one of numerous strong movie heroines (Jennifer Lopez in ''Out of Sight,'' Cameron Diaz in ''There's Something About Mary,'' Rene Russo in ''Lethal Weapon 4,'' the animated Mulan) on screen this summer.\r Though its major sets and vistas have their blatant artificiality, there's nothing phony about the vigorous, sometimes jokey physical exertions on which ''The Mask of Zorro'' thrives. The wild bravado on horseback is on a par with dueling scenes. And as for the double who jumps spread-legged onto his saddle from a substantial height, well, he's a hero, too.\r The costume designer Graciela Mazon, who had been warming up Mr. Banderas for Zorro duty in ''From Dusk Till Dawn'' and ''Desperado,'' lives up to the occasion with all the boots and corsets and flamenco chic that the material warrants. James Horner's atmospheric score frequently summons the memory of ''Malaguena,'' giving the film all the beguiling hokum it needs."
    },
    {
      "rating": "10",
      "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "7",
      "text": "Oddly the moment I heard Banderas' soothing tones again I kept picturing puss in boots:) While not really a surprising or challenging watch, the cinematography is great and the fight choreography is above average considering the over saturated genre category this film fits into. Mask of Zorro is still fun to watch in 2020 with all the usual tropes of the swashbuckling genre to be enjoyed... Looks tasty in 4k uhd with a nice use of WCG although the new clarity makes the stuntmen stand out even more than on DVD lol."
    },
    {
      "rating": "4",
      "text": "It didn't aged well.It is one of those movie that facilitate sleep.Edulcorated action movies.... watered down combat, comic book-like dialogues, slow, predictable and long."
    },
    {
      "rating": "8",
      "text": "'The Mask of Zorro': The Cunning Fox Is Back!\r \"The Mask of Zorro\" extends a tempting invitation: travel back to the days when swashbuckling was serious business, when boyish adventure films still had their innocence, when the bravado of thrilling stunt work was all a movie needed in the way of special effects. With a wealth of charismatic Zorros (two), a smashing heroine and a dauntless love of adventure, this is hot-weather escapism so earnestly retrograde that it seems new.\r Directed by Martin Campbell, who gives it the same gaudy Bondian brio he brought to \"Goldeneye,\" this Zorro features heroic derring-do from three men. First and most distinguished is Don Diego de la Vega, a k a Zorro Senior, played by a marvelously game Anthony Hopkins with unexpectedly elegant panache. Then there is his jokey, hot-blooded protege, the role that Antonio Banderas was obviously born to play.\r And behind the scenes there's Robert Anderson, sword master to the stars for 45 years (he worked with Errol Flynn), who has choreographed the film's many sword fights with spectacular flamboyance. If Anderson's style looks familiar, that may be because it was he who matched light-sabers with Luke Skywalker while dressed in a Darth Vader suit.\r There are \"Star Wars\" overtones to the story here, too, since \"The Mask of Zorro\" draws on the relationship between mentor and hero-in-training with the same debt to Joseph Campbell's mythic motifs. None too seriously, you understand -- just well enough to keep the film's castanets clicking. This format requires an early tragedy, and that happens when Zorro Senior loses his raven-haired wife and baby daughter to the evil Don Rafael Montero (Stuart Wilson), an early-19th-century Spanish governor of Alta California. There's something irresistibly quaint about the moment when Zorro and his wife, while sharing a tender moment at home, suddenly find themselves surrounded by a dozen sword-clanking soldiers who somehow crept noiselessly into the house.\r Though the dashing Don Diego has donned the Zorro mask to fight Spanish oppression (see assorted Zorro reruns on the late show for further details), circumstances now demand that he vanish for 20 years. He turns up again in the midst of a scraggly, unwashed crowd who can be described only as wretches in this context. Meanwhile, no less scraggly is a hapless thief named Alejandro Murieta (Banderas) who has his own grisly reasons for hating Don Rafael.\r It also happens that when Alejandro was a young boy, in the film's first big swashbuckling scene, he helped to save Don Diego's life. Later, when they meet as adults and Don Diego does him a good turn, Alejandro asks, \"Why are you so eager to help me?\" Don Diego replies, \"Because, long ago, you did the same for me.\" (The dialogue all sounds like that.) From here, it's not long before these two begin their Zorro lessons. Clowning merrily without jeopardizing his smolder quotient, Banderas is shaped most endearingly into a protege worthy of mask, steed, mission and the works.\r Gracing \"The Mask of Zorro\" with a beauty inevitably described as \"beyond compare\" is the stunning Catherine Zeta-Jones. She plays Elena, Don Diego's long-lost and predictably raven-haired daughter, and she does it so showstoppingly that the film's appeal extends well beyond boyish action-adventure.\r Enchantingly paired with Banderas for a scorching tango, a hearty duel, a scene in a confessional that has him impersonating a priest and other such vintage-style encounters, Ms. Zeta-Jones makes her first major film role one to remember. It's worth noting that her bold, alluring Elena is one of numerous strong movie heroines (Jennifer Lopez in \"Out of Sight,\" Cameron Diaz in \"There's Something About Mary,\" Rene Russo in \"Lethal Weapon 4,\" the animated Mulan) on screen this summer.\r Though its major sets and vistas have their blatant artificiality, there's nothing phony about the vigorous, sometimes jokey physical exertions on which \"The Mask of Zorro\" thrives. The wild bravado on horseback is on a par with dueling scenes. And as for the double who jumps spread-legged onto his saddle from a substantial height, well, he's a hero, too.\r The costume designer Graciela Mazon, who had been warming up Banderas for Zorro duty in \"From Dusk Till Dawn\" and \"Desperado,\" lives up to the occasion with all the boots and corsets and flamenco chic that the material warrants. James Horner's atmospheric score frequently summons the memory of \"Malaguena,\" giving the film all the beguiling hokum it needs."
    },
    {
      "rating": "7",
      "text": "When this came out I really had no interesting in seeing it. Boy was I wrong because this movie is a hell of a good time. The movie is a reboot of the classic series but updated with some big budget effects and one hell of a cast. Both Anthony Hopkins and sexy Antonio Banderas are in top form but Catharine Zeta Jones is the real scene stealer. She plays the feisty love interest of the title character and steals every scene she's in. The movie is overly entertaining with some stunning action setpieces especially towards the finale but the best scene is when Zorro goes up against her it's playful, funny and sexy. All in all it plays like a family adventure and although it can feel a bit long in places its an impressive experience.7.5/10"
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"
    }
  ],
  "recommendations": [
    "from_russia_with_love",
    "for_your_eyes_only",
    "octopussy",
    "the_crow",
    "entrapment",
    "goldeneye",
    "road_to_perdition",
    "the_legend_of_zorro",
    "tomorrow_never_dies",
    "the_world_is_not_enough",
    "the_rock",
    "unforgiven",
    "hellboy_ii_the_golden_army",
    "the_spy_who_loved_me",
    "butch_cassidy_and_the_sundance_kid",
    "hellboy",
    "the_hunt_for_red_october",
    "king_arthur",
    "captain_america_the_winter_soldier",
    "conan_the_barbarian",
    "rocky_iii",
    "shanghai_noon",
    "the_eagle",
    "enemy_of_the_state",
    "robin_hood_prince_of_thieves"
  ]
}