{"id": 2843, "title": "The Book of Henry", "starring": ["Naomi Watts", "Jaeden Martell"], "runtime": 105, "genre": ["Drama", "Crime", "Thriller"], "description": "Susan, a single mother of two, works as a waitress in a small town. Her son, Henry, is an 11-year-old genius who not only manages the family finances but acts as emotional support for his mother and younger brother. When Henry discovers that the girl next door has a terrible secret, he implores Susan to take matters into her own hands.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/suLFg4UjvM5BoDipg2Wu3gZ802T.jpg", "categories": {"plot": 6.428571428571429, "acting": 7.0, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "2", "text": "Wow, I'm speechless.This is the dumbest **** I've ever seen. Pretty insulting this tries to be unpredictable and original, but backfiring so badly it takes talent falling this low. Never seen anything like it and not in a positive light.I mean...WTF!"}, {"rating": "2", "text": "I like fiction, I like science fiction, magical realism and fantasy movies. But fake realism could be the worst thing to happen to a movie. And this one outshines and excels in that."}, {"rating": "1", "text": "A DISASTER.I was excited by the concept. The fact that tons of critics were kind of offended by it MADE ME MORE EXCITED.And then I saw this CRAP.The execution of this idea was INSANE. Just BAD. At everything. Some scenes are filmed like this was a lowest common denominator Spielberg kind of movie. WHO MADE THAT DECISION?"}, {"rating": "4", "text": "I needed to see the film that left Colin Trevorrow jobless in Star Wars, no doubt the simplicity of this film affected him and is not like he also did something memorable in Jurassic World.A very poor script that neither the cast can rescue, certainly it's very boring and very unsatisfying."}, {"rating": "0", "text": "One of the most abysmal, manipulative, muddle, misguided, disgusting piece of dwindled garbage of all time. Spun together with uneven, terrible atmosphere, and plastic, toy performances, The Book of Henry is truly terrible."}, {"rating": "0", "text": "I can barely comprehend what I just saw.  This may be one of the single biggest misfires I've ever seen.  Everything about this film is poorly done, from start to finish.  I was speechless leaving this film. I recommend everyone see this for amusement, it is something to behold.  Colin Trevorrow, Naomi Watts, Sarah Silverman, Dean Norris what were you thinking.  On shock value I would give this an A+, but for film quality this may be the worst film I see all year.  F"}, {"rating": "4", "text": "This film started with a rating of 7, but as the plot progressed, it dwindled down to the current 4. The story starts with promise: Naomi Watts plays a single mom to 2 boys, one of whom has a precocious intellect. The 2 young actors make the movie: Jaeden Lieberher (\"St. Vincent\") and Jacob Tremblay (\"Room\") both turn in impressively deep and touching performances. Once the family's warm, spunky relationship is established, the unpleasant activities next door cast gloom over their happiness. After an unfortunate twist, the plot deteriorates into an implausible scheme with gaping gaps in the logic. Ultimately, what started as a compelling drama fails with a wimpy ending."}, {"rating": "0", "text": "As incoherent and ill advised as the most amateurish of curiosities, but executed with a standard modicum of professional production values and the banal, saccharine tone of a slightly quirky laundry detergent commercial, thus eliminating any trace elements of \"curiosity\" from the equation. Just miserable to watch; hardly even worth it for the ability to tell unbelieving friends what you just saw."}, {"rating": "10", "text": "I am so glad the level of hatred spewed by the critics on this movie did not deter me from watching it. It was amazing. So beautiful and thoughtful and put me through all emotions while it unfolded. It is so well done and I am not sure I understand why critics want it to fail so badly. It's the kind of movie that stays with you. People around me were so touched by it as well, we all enjoyed it very much. Don't let the haters prevent you from seeing this one of a kind treasure."}, {"rating": "7", "text": "I just had to see a film described in one place as 'demented'.But even as a cynical 60 year old faced with what turns out to be an emotionally manipulative piece of work, I don't get the critical and public hate for The Book of Henry.Yes, it's nonsense and the plot doesn't bear close scrutiny.  Neither do most films.  But it's a decent piece of entertainment.  I'm bemused by the savage reviews that will stop most people watching this even when it turns up free on TV, but I'm probably too stupid to understand why superior intellects consider this a cinematic disaster.Watch it, make your own mind up."}, {"rating": "8", "text": "The moving story of incredible motherly love and brilliant boy. Heroes have to deal with adversities of live. Well played, kept tense to the very end and additionally has great shots."}, {"rating": "10", "text": "Very smart movie - but not as smart as Henry! This movie had me guessing every step of the way, but Henry was always one step ahead.A must watch for momboys and their moms."}, {"rating": "10", "text": "Filme muito bom, o meio me deixou um pouco assustado e confuso, mas a cena no hospital em que o Henry morre foi fantástica, muito comovente e realista."}, {"rating": "1", "text": "Director Colin Trevorrow apparently has a knack for sacrificing plot or believability in order to achieve high impact scenes, regardless of whether they strain credulity past the breaking point. There was literally not a single character in Book of Henry who acted in a realistic manner. Everyone was either a savant or an oddball. THANK GOD Disney fired him from directing the next Star Wars!"}, {"rating": "10", "text": "The story absolutely touched my heart and I loved it. I don't really get why it got such negative critique as it was amazing in my opinion. I am thankful for those people who didn't really like it but still took the positive side of it into consideration before rating. I guess it does depend on a person's personality and their perspective. Through my perspective i absolutely loved the movie. The concept and feels and the emotional content left me with tears at parts. There were some issues but most movies also do. Overall this movie really focused on the emotion and concept through the story. The transaction could have been better but overall I honestly don't understand why its getting so much hate. I hope people focus on the emotional content more and don't rate it straight zero and try to actually take in the positive aspects!"}, {"rating": "10", "text": "This is one of the best movies I have ever seen.I will NOT discuss how this story unfolds.Our main protagonist, Henry, is an 11 year old genius. He is almost too smart to be believed but, being rather smart myself, I have spent lots of time around smart people, even when I was growing up, and I can tell you from first hand experience that there are kids like Henry out there. Sadly they are rare.Our second protagonist, Henry's mother, cares deeply about her two sons. She is a single mother, and that's relevant to the plot. We are never told how she came to be a single mother, but that is unimportant.Being such a good mother she has imbued Henry and his younger brother with a sense of decency and responsibility, and Henry uses his genius in his own unique ways. It's a delight to watch. When I was his age I did a number of the same things, but clearly he is way beyond where I was at 11 years old.The story takes off when we find out that Henry has figured out, correctly, that the girl next door, a classmate of his, is being abused by her step father, and Henry sets out to stop it.Henry is driven by a powerful sense of injustice about what is happening to the girl, something I understand well. I know this because I was a severely abused child myself. My own mother was \"less than ideal\", but there were other adults in my childhood who were there for me so my life has turned out well in spite of my mother.But because of my background I know the rage at betrayal which Henry feels, and I know his determination to set things right. As the story unfolds we see his determination to end the girl's abuse, and the story beautifully lays out for us the reasons why it goes in the direction it does.This is an intelligent, carefully crafted, nearly flawless story. I urge you to go see it. For me it is one of the best movies ever."}, {"rating": "7", "text": "This was an interesting film - I liked seeing things from the childs perspective. Certainly at the start of the film there's no real clue as to the darker tone it'll take. It did feel like there were a few plots, or sub-plots, present in the one film and I did find myself a little unsure about when certain things had happened, which were clearly implied but then I admit I was a little distracted while watching it.It felt, to me, like a somewhat/relatively original watch (not entirely original but somewhat original), given the form and viewpoint that its taken from. I enjoyed watching the brothers get along together and I thought the cast did well. I suppose I'd have liked to have seen a bit more in terms of what Henry saw the apparently suspicious neighbour doing. I couldn't not feel empathy towards Henry's mother, given the circumstances and I certainly felt frustrated at how she treated her sons suspicions at first. Its an interesting, somewhat thought provoking watch, not one suitable for young children given the themes, although it does appear to be a family film at first, with the children of the family seeming relatively innocent and childlike, except for the clearly mature intelligence of the titular character Henry but the tone becomes decidedly darker after a while. I'd recommend this film on the proviso that its an emotional and potentially upsetting watch at times, as it deals with abuse."}], "recommendations": ["her", "the_fault_in_our_stars", "the_hunt", "me_before_you", "the_book_thief", "the_giver", "the_butterfly_effect", "babel", "all_the_bright_places", "the_curious_case_of_benjamin_button", "elle", "closer", "perfume_the_story_of_a_murderer", "the_lobster", "manchester_by_the_sea", "the_florida_project", "the_road", "heaven_is_for_real", "fifty_shades_darker", "hereafter", "boyhood", "mother", "into_the_wild", "lost_in_translation", "miracles_from_heaven"]}