{"id": 3041, "title": "The 40 Year Old Virgin", "starring": ["Steve Carell", "Catherine Keener"], "runtime": 116, "genre": ["Comedy", "Romance"], "description": "Andy Stitzer has a pleasant life with a nice apartment and a job stamping invoices at an electronics store. But at age 40, there's one thing Andy hasn't done, and it's really bothering his sex-obsessed male co-workers: Andy is still a virgin. Determined to help Andy get laid, the guys make it their mission to de-virginize him. But it all seems hopeless until Andy meets small business owner Trish, a single mom.", "releaseYear": "2005", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mVeoqL37gzhMXQVpONi9DGOQ3tZ.jpg", "categories": {"plot": 6.384615384615385, "acting": 6.818181818181818, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.771428571428571, "action": 9.0}, "reviews": [{"rating": "5", "text": "Solid movie with some laughs, but not really much more. It's all about his virginaty and that's funny for some time but does not last until the end of the movie... Steve Carrell did a good job. I think without him this movie would be even more boring by time. Co-Cast was good as well only the storyline was to weak to stand the 90 minutes."}, {"rating": "9", "text": "Underneath what would seem to some to be another raunchy Apatow comedy about 3 friends helping their 40 year old buddy lose his virginity, there is a film about good things happening to those who wait and not to \"put the **** on a pedestal\""}, {"rating": "7", "text": "Steve Carell has made huge compromise with this hilarious wax scene, deserves applause.  Because it was one take, there were five cameras shooting the scene and it's funny how even the cast members were laughing outside the script. Very entertaining comedy overall."}, {"rating": "10", "text": "The funniest movie in two years! Steve Carell is the new Steve Martin. He can just stand in place and cause one to chuckle. Though the male friends in this movie appear as adult adolescents, there is enough truth in their characters to reveal the sorry socialization process through which American men must pass. Sex is the most important issue in our lives because many, if not most of us were raised to believe this falllacy. As an American male I easily identified with Carell's character, If we were all gut-level honest we would admit that we desire genuine love more than anything. However, his male friends/counselors allow us to see the ridiculous perceptiions that would make being a forty year old virgin the most dispicable state in which a man can find himself. My spouse laughed as heartily as myself because she recognized that very truth pulsating from these exaggerated characters. This film is more than a comedy about a man finally trying \"to get some.\" It is a disarming film that allows American males to laugh at our sad condition."}, {"rating": "8", "text": "The movie skillfully depicts the only thing that is on a man's mind, from birth to death. I can see that women find that offensive. As a matter of fact, if women could be men just for one day, they would be shocked. That is how dull the average man's life is."}, {"rating": "1", "text": "One laugh. Nuff said. (and that one was the already well-rehearsed chest waxing scene, which we'd all seen in trailers for month preceding) My expectations were admittedly high, and this sad flick dashed them to pieces. I could barely sit through it."}, {"rating": "3", "text": "I laughed once."}, {"rating": "0", "text": "Mind you, I am far from a prude but I thought this movie was in very bad taste, offensive to both sexes, dull most of the way through. I don't know people who use that kind of language or who are totally sex driven. I am extremely concerned that so many people raved about it. Where is our society going? What kind of person would write such trash?"}, {"rating": "4", "text": "Sophomoric, 8th grade sexual humor. A movie made for sexual babies."}, {"rating": "4", "text": "This film, which had a great theme and amazing potentially was extremely dissapointing. The vulgarity was sickening and made me feel uncomfortable it was so bad at points. The only light in the dark was Steve Carell, in all his glory. He was excellent and I only wish the rest of the movie was as energentic as he was. My only other complaint was that the movie dragged on FOREVER!!! How many times were they going to delay the inevitable ending????"}, {"rating": "4", "text": "The movie deserves a 1, but felt a higher 'fake' score would draw more attention. This is a movie for immature teens - but its overall subject theme and gutter-level humor make it inappropriate for any age group. The fact that critics provided any positive reviews is alarming to the point that where I've always taken reviews as a guidleine at best - any critic who didn't despise this film has lost all credibility. Not to mention the fact that our society could possilbe enjoy this crap."}, {"rating": "2", "text": "I feel the need to be the lone, non-prudish voice to say that I felt this movie to be a total stinker. Rankness, that's fine, stupid humor, OK; I can even go along with a movie that looks like it was shot for the most part in a warehouse; but a lead character who switches from nebbish innocence to foul-mouthed smart-ass just to serve the joke of the moment undercuts character and wipes out the whole thing for me. Didn't it bother all the people who thought this movie was so sweet to have a scene where a strange man enters a young woman's bathroom while she's in the bathtub, and lasiviously remove his shirt in a way that could only portend to her (slutty or not) the beginning of a rape?"}, {"rating": "0", "text": "What a disgusting movie! If this is what our young adults enjoy and think is funny, our country is in more trouble than I thought."}, {"rating": "10", "text": "Totally tasteless, fal-out-of-your-chair-laughing humor from start to finish."}, {"rating": "3", "text": "I could not, for the life of me, understand how anyone thought this movie was even average, much less ABOVE average. The \"jokes\" were stale, the characters uninteresting and unfunny, and this one-trick pony shot its wad way too early."}, {"rating": "10", "text": "Definitely one of the funniest comedies i've seen in a long time! Strongly recommended. A fun date movie too!"}, {"rating": "6", "text": "Judd Apatows comedy  is worth watching this one is okay . Steve carell is a gay **** thats a fact . and his role was sad in this film but Apatow's comedy is something to enjoy . Grade C+"}, {"rating": "10", "text": "My best friend and I (both women) went to see this last night. Let me tell you the theatre was rolling in laughter. Some parts had me crying from laughing so hard. It just really had us all laughing in the theatre. I am taking my husband next week!"}, {"rating": "10", "text": "Funniest movie in years!!! If you like raunchy, but sweet comedy get out of your seat and go see this movie!!"}, {"rating": "9", "text": "Alessandra... Learn to take a joke... Sorry to say, but guys DO talk like this when they get together. You"}, {"rating": "8", "text": "I haven't had as many down to the bone laughs as I got in this movie in many years. Some extremely funny stuff and I loved the parody of The Exorcist. I found Andy's love interest to not be a very good actress and as the end of the movie shifts over to their relationship, it loses pacing. The first half is a 10 however."}, {"rating": "10", "text": "I almost s... myself from laughing so hard!"}, {"rating": "10", "text": "Funny!!!!"}, {"rating": "7", "text": "I rented this thinking that I would be laughing my butt off. It was funny but not Laugh out loud funny. Was I Dissapointed? Maybe Little. But I think this one was Alot funnier then \"Wedding Crashers.\""}, {"rating": "10", "text": "A must have in anyones DVD collection that likes comedy. I was shocked on how funny this movie was. I would not pass this one up at all."}, {"rating": "6", "text": "Worth a rental on a Saturday afternoon. Good fun. Not as good as Something About Mary or The Wedding Singer but in that vien - except cruder."}, {"rating": "10", "text": "It is a very nice movie."}, {"rating": "8", "text": "Hoot hoot hoot hoot hoot."}, {"rating": "6", "text": "While generally humorous, the humor was brought down several notches by the never-ceasing vulgarity. It really didn't need so many F* words to be successful."}, {"rating": "8", "text": "One of the years most funniest films, Steve Carrell reveals himself capable of being the next Jim Carrey, and capable enough of choosing the right script, nailed by the right director."}, {"rating": "8", "text": "Very funny, had some very funny scenes."}, {"rating": "9", "text": "One of the funniest movies that I have seen in a long time. It's a clever, smart sex comedy which contains plausible characters and situations that are real . I think its much funnier and better written than Wedding Crashers."}, {"rating": "9", "text": "If Sheila would have stuck around, she would have noticed that though the film is crude, it turns beautiful somewhere in the middle, and both the moral message and the tone of the movie are spectacularly sweeter than you can think from the \"American Pie\"-ish previews."}, {"rating": "10", "text": "Best film every......and it has also given me the confidence to go out with a girl now as i am aslo a 40 year old virgin."}, {"rating": "8", "text": "Top-notch character study."}, {"rating": "9", "text": "Steve Carrell has the best comic timing. I loved the characters. Good flick!"}, {"rating": "9", "text": "Best comedy of the year!"}, {"rating": "1", "text": "DISGUSTING. It is sad that people can accept a movie like this as humor. Where have people's morals gone? This movie sent so many horrible messages to young people (& i'm only 24!)"}, {"rating": "10", "text": "I laughed from beginning to end. If you gave this movie anything less than a seven you are a dull, lifeless being destined for a life of fear and paranoia."}, {"rating": "10", "text": "Absolutely hilarious. Haven't laughed this much at a movie in a long time. I thought Ebert's review was right on the mark - you ended up being engaged by and caring for Steve Carell's (who was a surprisingly good actor) character."}, {"rating": "7", "text": "A solid laugh, this movie was maybe even worth seeing twice in the theater. But I'm still not sure whether that the very funny parts make it a great movie, or whether it is just a relief to find something of quality in the otherwise bleak offerings of Summer 2005."}, {"rating": "10", "text": "Absolutely hilarious."}, {"rating": "5", "text": "I found this movie extremely funny from a guy's point of view. My date wanted to walk out and thus the five rating. This is the opposite of a chick flick in that guys will love it and women hate it. My advice is for the guys go by yourself or with your buddies. We can relate as this is a guy thing, but women will be repulsed even though it is a sweet comedy. Great music."}, {"rating": "9", "text": "Okay, what have we learned from this summer's box office returns? If your movie involves Batman, Darth Vader or penguins, it'll make money; if it's another big, loud, expensive action movie from a director who's known for big, loud expensive action movies, it won't. Best of all, and especially after years of hypocritical, offensive PG-13 fodder like Meet the Fockers, the summer of '05 brought with it the return of the honest, R-rated film comedy! It's also extremely interesting to note that while so many female-oriented romcoms, such as Must Love Dogs, The Wedding Date and Little Black Book are rather mean-spirited celebrations of human behavior at its self-centered worst, both Wedding Crashers and The 40-Year-Old Virgin--raunchcoms aimed at a primarily male audience--are genuinely goodhearted, sweet-natured and truly romantic at the core. (Perhaps this is why so many women are flocking to them, too.) Steve Carell, who was memorable in supporting roles in Anchorman and Bruce Almighty, has a bottled-up, Rain Man-like quality that suits him perfectly for the role of Andy, the title character who has missed many sexual opportunities, doesn't feel he'll get any more, and channels his abundant excess energies into video games, comic books and action-figure collecting. (Can you say \"sublimation\", kids?) It's a real tribute to Carell's and director Judd Apatow's script that, even though it deals in every stereotypical notion of this type of character possible (the only element missing is a fanaticism for either Star Wars or Star Trek, and I'm sure that's only because Lucasfilm and Paramount probably, and perhaps wisely, denied the rights), it also makes Andy refreshingly three-dimensional, appealing and tremendously sympathetic. In fact, the movie's generosity extends to ALL the major characters; it has a lot of fun with Andy's workplace pals, his horny supervisor and numerous potential hookups, but never takes cheap shots at them the way certain comedies revel in doing. (Yes, Rob Schneider, I'm talking to you.) In fact, a major thematic truth in this movie is that everyone in it has, like Andy, been seriously injured in the game of love; Apatow puts Lionel Richie's \"Hello\" and Asia's \"Heat of the Moment\" to great use, but could have just as appropriately added REM's \"Everybody Hurts\" to the soundtrack. Whoever thought of casting Catherine Keener as Trish, the around-the-block free spirit who could complete Andy emotionally as well as sexually, is a genius. I've always admired Keener's witheringly sarcastic persona in movies like Being John Malkovich, but this change of pace role looks great on her; the woman's smile could've lit up all of New York City during the 1965 blackout. The Greek chorus of Andy's coworkers (Paul Rudd, Seth Rogen, Romany Malco) is terrific too: endeavoring to \"fix\" their new friend, they provide the perfect working illustration of \"the blind leading the blind\"; Andy may be totally ignorant as to the mysteries of a woman's body, but these guys are equally clueless as to her mind and heart. Lest I mislead you into thinking that a mainstream movie with this much intelligence and insight can't possibly be funny too, let me assure you that Virgin grabs you from the first, unforgettable early-morning visual gag, breaks into ramming speed (so to speak) during Rogen's monologue about what he did in Mexico over the weekend, and absolutely never slows down. And Apatow's enthusiasm for loading the fringes of his film with wonderful, peripheral characters and situations (Andy's upstairs neighbors, a lovely bit in Trish's store involving a customer and a pair of disco boots) guarantees The 40-Year-Old Virgin to be one of those experiences that you, like Andy, will enjoy even more the second time!"}, {"rating": "2", "text": "Absolute crap. Writers must have taken 10 minutes to write this plot. Lets see how many times we can use the F-word. Disappointing."}, {"rating": "6", "text": "This movie is ridiculous. But it is so funny and shows a tad bit of charm, that you cant help but feel a certain emotion for this film."}, {"rating": "0", "text": "This is one of the worst films I have ever seen...any positive comedic value you get from this movie has more to do with your intellectual level and bad taste."}, {"rating": "9", "text": "It´s a bizzare movie, and i love bizzare."}, {"rating": "9", "text": "this movie was awsome and very funny it kept you laughing and enjoying every minute yes i would say its not for everyone because there are some vulgar statements but I liked it and so did my family i never thought it was going to be as good as it was but i was wrong i love the movie."}, {"rating": "9", "text": "The 40 Year Old Virgin is utterly laugh out loud hilarious. Filled with some very clever comedy and a great main character, The 40 Year Old Virgin is the comedy to beat all comedies."}], "recommendations": ["knocked_up", "bridesmaids", "hall_pass", "superbad", "the_ugly_truth", "neighbors", "step_brothers", "the_change_up", "good_boys", "funny_people", "ted", "trainwreck", "a_million_ways_to_die_in_the_west", "wild_hogs", "dinner_for_schmucks", "sisters", "girls_trip", "grown_ups", "the_hangover", "forgetting_sarah_marshall", "what_happens_in_vegas", "this_is_the_end", "american_pie", "just_friends", "ted_2"]}