{
  "id": 4386,
  "title": "The Forest",
  "starring": [
    "Natalie Dormer",
    "Eoin Macken"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "Set in the Aokigahara Forest, a real-life place in Japan where people go to end their lives. Against this backdrop, a young American woman comes in search of her twin sister, who has mysteriously disappeared.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1TohqCqMbaiuRLJPrPW0vnQP3lE.jpg",
  "categories": {
    "plot": 3.9318181818181817,
    "acting": 3.861111111111111,
    "ending": 3.9565217391304346,
    "soundtrack": 5.0,
    "cinematography": 3.5,
    "familyFriendly": 2.3333333333333335,
    "funny": 5.0,
    "action": 4.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Yet another horror movie completely underdone by an absurdly unsatisfying conclusion. Crafty camerawork and plot devices might mislead you into thinking things are headed in the right direction, but don't let this January movie fool you. The inconsistent pacing and insulting twists in the third act will ultimately leave you begging for your money back. Hopefully this director will lend his keen eye to a more worthy project, or at least anything that isn't a sequel to this."
    },
    {
      "rating": "4",
      "text": "Japan's Aokigahara \"Suicide Forest\" by itself is a creepy and gruesome place because of its reputation as one of the most notorious suicide spots in the world as well as its historic association with demons in Japanese mythology. Its inherently scary atmosphere is perfect for a good horror movie, but The Forest mostly squanders its promise by degrading it to a hot spot for cheap jump scares. The Forest stars Game of Thrones star Natalie Dormer in a dual role as twins Jess and Sara. Jess has disappeared into the forest, and Sara travels to Japan to go into the forest to look for her, unaware of the demons that lurk in the forest. The film has a pretty interesting premise and could have worked if executed correctly. 2014's As Above, So Below took an intrinsically creepy setting, the Paris catacombs, and used an unsettling atmosphere and good scares to make one of the better horror films of that year. The Forest does not use its setting to its advantage. Any atmosphere created by the forest is frittered away by a dull jump scare. Despite all the loud noises and sudden shocks, the scares are just boring. That could have been helped by a good story, but once Sara actually reaches the forest, the plot just sort of stops. The last half of the movie is just her running through the forest while demons pop out from behind the trees. It's not until the end that the plot decides to move forward any more, but by the time the big twist happens, you don't really care. The Forest has a committed performance from Natalie Dormer and glimmers of an interesting movie but mostly wastes them on predictable jump scares and a bland story."
    },
    {
      "rating": "5",
      "text": "Hanging on the verge of mediocrity, \"The Forest\" is a resident of old horror spectacle.\r Aokigahara, otherwise known as Suicide Forest, literally writes its own stories. It's a place where people go to end their lives, a real life horror vista which has haunted many documentaries and videos. As creepy as the setting is, The Forest is still trapped on archaic horror gimmicks. It doesn't mean it has no merit, few of its moments are quite delightful, yet it spends most of the time wandering across predictable set-ups and mundane scares.\r Sara (Natalie Dormer) goes to Japan to find her missing twin sister Jess (also Natalie Dormer). The search leads her to Aokigahara, the infamous forest. Unfazed by this revelation, Sara is still determined to search for her, almost stubbornly so. Natalie Dormer of Game of Thrones’ fame is definitely a draw as this is a different genre than her other works. She does put in the effort, her strong motivation persists although the character is stuck on typical scream queen stereotype.\r It's insane how many times her character randomly strolls to dark corners or investigates weird occurrence alone even though ample warnings have been given. These are actions common sense would dictate as unwise, especially on a place called Suicide Forest, yet she performs them blindly anyway. It's pretty over saturated that the excuse of her being in trance because hypnotic forest made her do it is not sufficient anymore.\r There are some good moments that are chilling and well presented, it even occasionally ventures to psychological perspective of the ordeal. However, the movie usually returns to average scares of oriental horror such as vague ominous warning or lost girl in peculiar outfit. It's a rigid showcase of horror, one that's been used since the days of Ju-On and arguably even before that.\r While the draw of exotic location and appealing lead actress might interest visitors, they would only find basic horror in The Forest."
    },
    {
      "rating": "4",
      "text": "A fairly well made film that while unassuming really fails to deliver on anything new or exciting in the horror genre.  Well not an absolute waste of time it's not worth much.  C-"
    },
    {
      "rating": "4",
      "text": "Despite the interesting location and solid performance by Natilie Dormer in a dual role. The Forest is your basic 21st century horror movie sh*t. No risks were taken, literally, who thought it would be a good idea to make a movie set in the suicide forest PG-13? Aside from that, The story hits the same beats as a typical supernatural horror film released after 2010, As well as a disappointing script from David S. Goyer the writer of The Dark Knight trilogy."
    },
    {
      "rating": "3",
      "text": "The ending to this movie will make you want to ask for your money back. Theres my review.\r Also of note\r -was not scary\r-Jump scare extravaganza\r-the amazing cardboard actors\r-a story that had potential, especially the setting, but was driven into the ground by not trying to do anything unique that we have not seen one hundred times before in every other horror film."
    },
    {
      "rating": "3",
      "text": "Natalie Dormer does good and there are some good suspense moments, but overall everything else falls flat. Just another horror film in January that's not good"
    },
    {
      "rating": "4",
      "text": "A horror movie about a woman traveling to Japan's Suicide Forest to search for her twin sister. Starring Natalie Dormer and a bunch of other actors you won't recognise from anything. Now with the words Japan and Suicide Forest you'd expect a very creepy, suspenseful and terrifying movie right? All the right ingredients yes? Well you'd be wrong, very wrong. Starts off well, gets in its cheap jump scares wherever possible but slowly and surely descends into a chaotic mess that so many of these movies falls victim to. Not really recommended but I feel compelled to tell you that The Blair Witch Project will give you more laughs."
    },
    {
      "rating": "4",
      "text": "'The Forest' is a movie that simply doesn't live up to it's rather interesting setting and premise. The plot revolves around a young woman called 'Sara' (played by Natalie Dormer) who goes in search of her twin sister 'Jessie' who has recently gone missing in the Japanese forest of 'Aokigahara', otherwise known as Suicide Forest. The film clearly wants to be a psychological thriller, however with it's consistently poor dialog coupled with numerous narrative shortcuts (including a very half baked sub plot concerning the twins parents) the film doesn't reach a level of depth in narrative or (more importantly) character development in order to provide a true sense of psychological intrigue. 'The Forest' is a movie that sits in an unsatisfying place where you can see exactly what they wanted to do but just under delivered."
    },
    {
      "rating": "6",
      "text": "The Forest will most likely be forgotten in a matter of days due to its classic horror movie cliches,  but for the most part it was an solid, semi scary psychological thriller."
    },
    {
      "rating": "0",
      "text": "The Forest is a soulless abomination capable of absolutely nothing. The plot twists are hackneyed, the performances lifeless, and the writing awful. The ending is offensive. After sitting through the painful running time, it ends with zero closure and a particularly insulting jump scare. Don't watch this."
    },
    {
      "rating": "10",
      "text": "This movie was SCARY. The trailer looked scary, and the movie made me never wanna go into the woods ever again. One of my favorite horror films of all time. Don't get why the critics don't like it, but then again, like hate everything that's good"
    },
    {
      "rating": "10",
      "text": "I loved this movie but I can understand low rating.  This movie was more about mental scary not horror scary.  Most of the critics that viewed this movie with low rating just didn't have the mental capacity to understand this movie.  So  if you love  a good mental scary movie when will probably enjoy this one."
    },
    {
      "rating": "10",
      "text": "I really loved this movie! First of all my real rating would've been 8 but I want this movie to get the love it deserves. So off we go!\r The trailer was really **** but the movie turned out to be great. Actually the first half started really bad and boring for me. Yes the story was intriguing but i really thought that I was ready to agree with the critics. Then it started to grab me with the psychological horror as the movie starts to mess with your mind. There are some jump scares and yes they are mostly predictable but some of them still managed to scare the crap out of me even though I was prepared for it. The ending twist was really good in my opinion. As in overall the last 30 minutes just nailed me to my seat."
    },
    {
      "rating": "3",
      "text": "Well folks, this film was a painful reminder that it's January. This is the worst movie of 2016. I'm not saying this because the kids in front of me checking snapchat, instagram and even mocking the Japanese people talking in the film. I just genuinely hated the movie. Aside from Natalie Dormer's performance and and a few cool scenes. There isn't any point in watching this movie. The acting was annoying especially since the actors don't work well with each other each other at all except for Natalie Dormer and Taylor Kinney. Their back and forth was at least watchable but for everyone else. I just wanted them to die! I was hoping the suicide demons would be like “Hey, come over here!” The actions and choices the characters made were unrealistic and clearly only made to keep the movie moving because if these characters were thinking logically the movie would've been like 10 minutes long and how awesome would it have been if this was a short film. The director has made many shorts in the past and the movies plot was stretched out to such an extent so I think making this a short would've been the better choice. There is a difference with having a formula that causes you to hit a part in the plot that would be deemed predictable once or twice. That's perfectly fine but having such a fully loaded agenda with nothing but cliches and annoyingly obvious jumpscares ruling the movie doesn't add anything good! It just takes away the audience and annoys everyone in the auditorium. In the end, The Forest was an obnoxious film with annoyingly obvious plot devices. The cinematography was good and there were some cool scenes but everything else made me cringe. Not a good start to 2016. I'm giving this one a 3.5/10."
    },
    {
      "rating": "8",
      "text": "I really liked this one. I have known about the \"suicide forest\" for many years after researching it and was excited to see a horror movie based off of it. They stayed true to the legend and many ways and some parts were pretty chilling. The only reason I did not give this a 10 was because I felt it had one too many jump scares. I feel there needs to be an even balance between jump scares and actually scary moments to make a perfect horror movie. Overall, though, I loved it and would definitely recommend it."
    },
    {
      "rating": "4",
      "text": "Like many I was pulled in by the potentially awesome setting of Aokigahara (the \"Suicide Forest\") and it's lead actress Natalie Dormer (Hunger Games, Game of Thrones). I really wish I hadn't been. \"The Forest\" manages to miss out any potential creepiness it's setting could have brought. All potential is squandered in what is just a really boring horror movie.\r The big emphasis here is less on horror and more on telling a story. There are some interesting ideas floating around here and there, but the director doesn't know how to deliver them. What we get is a film that majorly consists of Dormer walking around Japan and eventually Aokigahara. There's a lot of talking going on while this is happening. It's just hard to care about it thanks to the subpar acting coming from everyone involved. Dormer looked just as bored with the material as I was.\r When the movie does finally get around to trying to scare us it falls even shorter. We get a few glimpses of some ghosts or \"Yūrei,\" but director Jason Zada is unable to make them scary. Mostly because all they do is just stand there. The rest of the attempts at horror consist of snapping branches and whispering voices. Wow. How terrifying.\r I respect it's attempts to be a more psychological horror experience. It tries hard to be deeper than the average scary flick and Zada does try to capitalize on the creepiness of the setting. Unfortunately the movie just fails at both. The end results are a boring, poorly acted, unfrightening experience. One better left forgotten despite the talent in it's lead and setting."
    },
    {
      "rating": "9",
      "text": "I enjoyed this film, and I don’t understand why it got such terrible reviews. One of my fellow user reviewers was absolutely right (after giving it a 10) – it is “mental scary” and not “horror scary.” What I would say is that it is psychological horror (that is, something like Hitchcock’s Psycho – the horror is Norman’s mind) instead of “place-based” horror such in Insidious. In some great horror films like The Haunting of Hill House, both types of horror appear – one of the characters is deranged but the house is also haunted. In The Forest, I thought the situation was interesting, the actors, especially Natalie Dormer (who seemed to get a good review no matter how much a professional critic hated the film), the locale was fresh and interesting, and the pace and direction was very good. To me the reviews of this film are another example of critics disdaining the horror genre simply because they don’t understand it."
    },
    {
      "rating": "8",
      "text": "The movie is actually better than what the trailer shows.It was entertaining at best and the acting was actually good.The premise was interesting and the movie was well written.Sure,a lot of the decisions the characters takes are frustrating but still. I would not recommend this movie but you should still give it a chance."
    },
    {
      "rating": "4",
      "text": "I bet Natalie Dormer gave all the trees wood﻿.\r The Forest is about the Aokigahara Forest in Japan is quiet, serene and large - and also a popular location to commit suicide. After her sister disappears amidst this forest, Sara goes to find her - not knowing the horror that awaits.\r \"The Forest\" isn't anything that special of a horror movie, as it ticks off all the horror tropes in horror films today. It's amazing how Hollywood can go this far and take an actual place like Aokigahara Forest where people actually do comment suicide into a lousy horror film, I mean it's like making a horror movie about the people who jumped off the Golden Gate Bridge or the Twin Towers, and what I'm saying may not seem too offensive, but just thinking about it and those who took their own lives, it's pretty embarrassing that Hollywood could do this for a quick buck.\r The movie isn't scary, it's stupid, flat and forgettable. Natalie Dormer was decent in the movie, but that's really it."
    },
    {
      "rating": "3",
      "text": "i really wanted this movie to be good but its not in fact its not even worth watching if you miss this film youre not gonna be missing much the story is bland the characters are dull especially the main character even the plot twist was disappointing i went into this movie blind and even i knew their was gonna be some time up plot twist at the end. the whole suicide forest angle is awesome i love it and i hope other directors dont shy away from this due to the forest. one thing i did like was the psychological approach the director try to take it was one of the only things that kept me interstesd. this movie mainly uses a couple of jump scares but does it poorly."
    },
    {
      "rating": "3",
      "text": "PG-13 horror? Give me a **** break.\r**** complete **** If you ever want to feel scammed, just watch this, the acting? Absurd. The plot? Trash. The characters? Bland. Every singgle actor performed horribly, Natalie Dormer was decent, although not as good as they say. Not much else to say, but I wish I had gotten my money back.\rFinal Verdict:\rAvoid, unless you like Natalie Dormer and are intrested in terrible horror films, if you're a fan of \"good\" horror films, I recommend you save your cash."
    },
    {
      "rating": "1",
      "text": "This movie was so boring and not scary at all. I would have to say one of the worst movies I have ever seen."
    },
    {
      "rating": "10",
      "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"
    },
    {
      "rating": "4",
      "text": "It's pretty average. It's amazing how complacent and content it is to not even try anything remotely new or unique. It just goes about its business in as rote a way as possible.The Forest, The Sea of Trees, Aokigahara Forest deserved better from films this year."
    },
    {
      "rating": "1",
      "text": "Horrible movie, can't believe it rated as high as it did.  The story is hard to follow at the beginning and jumps around.  The storyline is predictable and not that interesting.  Acting is marginal.  In fact, the actors in the movie perform as B movie caliber - kind of reminds me of a bad 50's horror movie.  Their are the 'required' scenes that make your heart pound harder as you anticipate something scary jumping out or appearing out of nowhere - the typical shock scene. The ending it predictable - just think how 90% of these type's of movies end (that's all I'll say).  I vote a waste of time."
    },
    {
      "rating": "3",
      "text": "I praise the creepy atmosphere and setting of the suicide forest. Everything else = your typically boring, cliched, predictable and, above all else, not-scary modern day horror film."
    },
    {
      "rating": "5",
      "text": "While a definite thriller, this movie wasn't as expected, and was quite underwhelming. From beginning to end, it is horror, which isn't really a good thing. The movie both starts and ends with a horror scene, as is the middle of the movie, leading to me getting sick of repetition throughout. Additionally, the ending may have been a twist, but it was quite dull. It didn't really become a \"sum\" to the movie. And I get that not all movies have a happy ending, but this one didn't even really have much of an ending at all for that matter. I understand cliffhangers and the whole bit, but it seemed as if something else was supposed to happen, having the ending leave me with the reaction of, \"That's it? There's not any more?\". I completely understand why the movie got a 34/100 (at the time of this review). Most of the horror scenes were, in fact, shown in the trailer, so most of the movie was expected as it progressed. Additionally, this movie followed the stereotype of a typical horror film. The protagonist faces encounters with ghosts and creepy girls, as she makes the obvious wrong decisions throughout, while making each movement of her muscles slow and steady. Not to mention, the action of this movie didn't really start until the last 20-25 minutes of the film. Overall, I would not see this movie again. It was just too slow to start off, and everything was pretty much expected, and the ending was pure nothing."
    },
    {
      "rating": "6",
      "text": "I don't have any complaints about this, It was more of a creepy feeling rather than a jumpscare type of horror film. There's really not much to say about this because the movie isn't so bad, it's interesting and creepy. 'The Forest' is just what we need to start 2016 in the Horror Genre. It's not perfect but it's a good time."
    },
    {
      "rating": "4",
      "text": "The Forest is well-acted and has a creepy enough atmosphere, but it's not nearly enough to make up for the confused plot and complete lack of scares. The director sure knows how to build tension, but The Forest is all build up and no pay offs."
    },
    {
      "rating": "6",
      "text": "This was a decent effort from first-time director Jason Zada. The premise and setting are intriguing, and for the most part this is used to an advantage. There are suspenseful and tension-filled scenes to be found and the atmosphere of the forest is quite creepy. The first act is fairly slow, but I did find myself invested in the story. Natalie Dormer is good and I was interested in her character and motivations. The rest of the cast are fine, but you don't really care about them. In overall, the setup is solid, and as well is the atmosphere, but unfortunately as the movie goes on the story starts to lose itself, and by the third act you don't care anymore, and what started as a mostly interesting and investing story with a creepy atmosphere and suspenseful scenes, eventually becomes a repetitive and predictable galore of questionable character decisions, clichés and jumpscares and ends on a dry note. Although the third act is very underwhelming, there are suspenseful and tension-filled scenes to be found in the movie and the first hour is mostly effective. The Forest is better than most January horror films, and if you walk into the cinema with low expectations you will propably enjoy what it has to offer."
    },
    {
      "rating": "2",
      "text": "Ouch, not even Jason Zada or the rest of the cast and crew can save this dumb, predictable, and so 'not' scary cliché from overlapping our nice and innocent forests by making another dumb horror taking place in the forest."
    },
    {
      "rating": "3",
      "text": "The Suicide Forest. Sounds intriguing right? After hearing the plot to this movie I was instantly drawn into this possibly great horror/thriller film. Despite this very interesting plot I walked into the theater with very low expectations.\r That mindset proved helpful from the second the movie began. Not only was the opening scene shaky but my friend sat in old ketchup. I could tell this movie was doomed. Let me go into more detail about the film. The main character Sara must venture to Japan in hopes of finding her twin sister Jess who mysteriously disappeared in the \"Suicide Forest\". With the help of a local guide and another mysterious traveler, Sara and her new friends endeavor into the forest. To the movies benefit the Suicide Forest does in fact exist which gave it a very eerie and realistic feel. After endless jump scares which only had an impact because of the booming sound in the theater, I realized I had wasted my money.\r Now I realize the movie was not all about jump scares and more of a psychological fear but it was extremely predictable. At times the movie honestly felt like a Scream movie when the main character makes the obviously poor decision to do exactly what everyone warns her not to do. As an avid movie goer I don't usually regret a ticket purchase, this was certainly a first.\r Overall this movie had great potential. I do give credit to the actors for doing their best with poor directing choices. This movie was definitely not for me, and I doubt it was for many people. It's always disappointing to have a movie with such potential just rot away in the box office. Personally I hope someone tries this again, but with a much more interesting style. The average movie fan may be scared because of the jump scares, but I do not recommend this to the avid movie goer."
    },
    {
      "rating": "6",
      "text": "After seeing the trailers for 'The Forest' and then reading some critic reviews as well as checking Rotten Tomatoes scores, I had written this movie off as one that I might check out on home video. My expectations were pretty low, which can actually be a good thing: if the movie sucks, I'm prepared, but if it's good it'd be a pleasant surprise.\r The film starts out with the main character of Sara (Natalie Dormer) searching for her identical twin sister, Jess, who has gone missing in the Aokigahara Forest in Japan where she currently lives. The forest, nicknamed the \"suicide forest\", is a palce where Japanese residents go to commit suicide, leaving their bodies for park rangers to find (yes, this is actually a real thing).\r Seeking a guide to take her into the forest, Sara enlists the help of Aiden (Taylor Kinney), a reporter\rwriting for an Australian news outlet. Aiden resides in Tokyo and is fluent in Japanese and knows a guide to aid Sara. With the help of her two new allies in Aiden and Michi, they explore the forest until they come across Jess's tent. Intent on finding her sister, Sara refuses to leave and return in the morning, not heeding all of the warnings locals have given her about the strange happenings of what goes on in the forest. People are haunted by spirits of the dead, causing them great paranoia and hallucinations and ultimately causing their suicides.\r Sara and Aiden stay the night, but Sara's ghostly visitors lead her away from camp and start to wreak havoc on her psyche. Becoming evermore paranoid, Sara begins to distrust Aiden, believing that he knew Jess and had a part to play in her disappearance.\r Sara eventually escapes from Aiden and continues her search for Jess, encountering more spirits and losing her sanity in the process. After falling into an underground cave and more paranormal experiences, Aiden rescues Sara and they happen upon an abandoned ranger station Aiden had found, piquing Sara's distrust of Aiden even more. After a struggle, Sara winds up stabbing and killing Aiden. As Sara is traveling through the forest, she sees Jess and goes after her, but Jess is equally as paranoid and runs off.\r The backstory of Sara and Jess goes into the death of their parents, initially told to be a drunk driving accident, but we are shown that their father killed their mother and himself. Jess saw their bodies but Sara didn't, which caused Jess's troubled upbringing and multiple suicide attempts.\r In a scene where Sara thinks her father is trying to kill her, she pries his hand off of her arm with a knife. Jess manages to escape the forest and finds the help of authorities that have been searching for her, including Sara's boyfriend Rob. Sara is revealed to actually have slit her own wrist when trying to escape the illusion of her father, and is then pulled into the ground by multiple arms coming our of the earth. As Jess and the authorities postpone their search for the night, Michi looks back into the forest one last time and sees the ghastly apparition of a now deceased Sara.\r While this movie wasn't all that scary, the tension ran high throughout and the constant paranoia made for an uneasy watching experience. Because my expectations were so low for this film, I wound up enjoying it more than I thought I would.\r My rating: 6 out of 10"
    },
    {
      "rating": "2",
      "text": "This movie had a good premise, but sadly failed to deliver it properly. It had the opportunity to explore more on the psychological and mental horror aspect, but decided it was best to do cheap and predictable jumpscares instead. Most of the scary and \"in your face\" elements didn't really blend well with the movie and were clearly just stitched to the script. The ending didn't make a lot of sense, and seems like it was just thrown there to end the movie sooner, which i can't really say i was sad about, since i couldn't take any more minutes of this crap fest."
    },
    {
      "rating": "4",
      "text": "A forest where people end their lives, and a blonde (Dormer) is entering it to find her twin sister. Yep! Sounds interesting, and as a matter of fact, this movie is set within the real suicide forest of Japan, where many souls are coming back angrily.It did not use the forest properly as a background, and really had nothing to do with the storyline. But you can see the director's effort to pull off a clichéd horror flick. This movie delivers plenty tension-building moments, but as it sets up for a resolution, it ends up to cheap jumpscares which are really, at most times, irritating and annoying. The acting is nothing really special, but Dormer's character has a lot of depth, and that is the strongest part of this movie.VERDICT: Within the whole realm of things, the forest wasn't explored the way it should have been. There are plenty of cheap jumpscares that would annoy you, but the director's first effort is still a nice try."
    },
    {
      "rating": "3",
      "text": "An interesting premise is put to waste by too many jump scares and a muddled plot"
    },
    {
      "rating": "9",
      "text": "Not too bad movie, at least you can watch it. I'd recommended it. The visual isn't dark and also the location is not too spooky. But my question is, Is the forest really at Aokigahara?? Why not record the movie at the real Aokigahara forest?!"
    },
    {
      "rating": "2",
      "text": "Terrible film. Rely on random jumpscare to try to spook the viewer, a lot of scenes are just random spooky dreams that have no meaning and add nothing to the film, the beautiful setting is wasted and the characters are all idiot. Some people think that this is a \"psychological\" horror while the characters in it have zero psychological development and just act in random ways only because they need to advance the plot. The film is not even consistent in its own rules, at the beginning of the film they say that if you are sad the forest will make you sadder and you'll be so sad you'll kill yourself but the main character gets tricked into suicide. And also the scene where she died it's **** stupid. She gets grabbed by a zombie and to free herself she decided to cut her wrist.Normally I would give this 4/10 but I have to balance people that gave this a 10"
    },
    {
      "rating": "5",
      "text": "This movie could of been a lot better than it was. The decision to kill Jess and have Sara escape really didn’t do it for me. I would of liked if they both escaped, both died or if Aiden actually was the villain and ended up trying to or killed Jess. Some scenes looked beautifully shot, mainly of The Forest. Had to doc a point for the Dad’s makeup because holy hell it looked awful. All in all, not a horrible film but not a great one."
    },
    {
      "rating": "7",
      "text": "Twin goes to Aokigahara forest to find her missing sister, realises her father murdered her mother years ago and then dies whilst her sister leaves the forest."
    }
  ]
}