{
  "id": 1778,
  "title": "The Intern",
  "starring": [
    "Robert De Niro",
    "Anne Hathaway"
  ],
  "runtime": 121,
  "genre": [
    "Comedy"
  ],
  "description": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg",
  "categories": {
    "plot": 6.346153846153846,
    "acting": 6.634615384615385,
    "ending": 6.9,
    "soundtrack": 1.0,
    "cinematography": 4.0,
    "familyFriendly": 6.0,
    "funny": 6.115384615384615,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "If you've seen the trailer you'd expect a cute comedy about a retired man (Robert De Niro) who becomes the intern for the overloaded exec of an online fashion site (Anne Hathaway). It does start in that direction and there are some mildly charming moments. About half way thru, it careens resolutely toward chick flick territory, as the focus moves from the office to the challenges of her marriage. Even with writer/director Nancy Meyer's upbeat style, the film takes a somber tone and serious pace that drags it down. De Niro has never been blander and Hathaway is OK, while the supporting characters lack any spice. Meyers' messages about women in the workplace and dull determination to focus on the marriage takes a potentially amusing movie into tedious trite territory."
    },
    {
      "rating": "8",
      "text": "A film that differentiates the young and old generation.\r I would definitely say it is the director's best film. I have liked her other films, but this is a lot different from them. I mean it was well written screenplay with much better understood the contemporary world than just focusing on the relationships as usual. So the addition of digital world stuffs made all the difference and I completely enjoyed it. Don't think it would be another 'The Internship' as I initially thought, but slightly it is and much better everyway.\r You are going to agree with me that the film's posters or the trailers were not very impressive as what the actual film did to grab our full attention. The two hours films are always a concern to me, but when a film like this runs for that long, I can even sit for another half an hour. Anyway, with this story and its runtime, the pace was incredible. When there's something interesting is going on, we forget to focus on the flaws and enjoy our time, which is what I exactly did in here.\r This is not a comedy where you're going to laugh openly loud, it is a comedy in the sense of the set of characters the film has. I mean, the story is about the digital business and most of them who are into the computers are considered as geeks. So theirs world is nothing, but just hooked to their works and forgetting the actual world around them. Even for the someone in the next room, they tweet. For them to remind only they've changed, not the physical world and that's where our main character who is old and wise influence the younger generation people.\r So the actors were undoubtedly the best thing apart from the direction and the story. The 73 years old Robert De Niro still impressing with his extraordinary character display. I don't know whoever was in mind when it was written, but this role perfectly fits none other than him. And then there's Anne Hathaway on the opposite side who equaled with De Niro with her part.\r From the narration point of view, it started with DeNiro's, but quickly around in the middle it took a circle to cover others as well. And then comes from the professional to the personal life topic when it was developed and brought a small family who were affected by the workaholic mother. So if you enter it expecting a comedy, probably you won't disappoint with what it delivers against your wish which is a heartwarming drama with some emotional moments. Surely recommended, especially the youngsters who're addicted to the digital world!\r 8/10"
    },
    {
      "rating": "8",
      "text": "Not to confuse with 2013 Fox's The Internship, this similar type of drama without a ship behind feels more promising, funny but not ridiculous and thoughtful which one could have expected through its poster. The story delivers something fresh, a creative idea of senior citizen internship program to present the cross-generation relationship, events that are commonly occur in daily working life and how important is the experience of the elderly to inspire the younger generation. The film moves in a smooth pace, filled with nice musics and inspiring scores, along with a gentle spirit that attracts audiences to spend time following the amusing characters for about 120 minutes but a little bit upset by the rushing second half and too unrealistic perfection on its ending. However, the warm, charming and charismatic chemistry between De Niro and Hathaway is the sweetest and most beautiful part of the film to enjoy which makes us believe that we can manage well both career and family life."
    },
    {
      "rating": "9",
      "text": "Nice film. Experience never gets old--truly said. This film also gives audience an idea about how the industry, especially a start up company runs. Personally, I loved this movie and Anne Hathaway ;)"
    },
    {
      "rating": "8",
      "text": "It's not a BAD movie! but it's also not the best movie you've seen in your life and will make you cry your eyes out. It's a film that tries to teach you a lesson about life, while displaying great performances and overall, it's satisfying! The film starts out really great, but eventually starts to get slower and slower and eventually gets boring at times. It is an emotional film at times, but it won't impact you for days. (80/100)"
    },
    {
      "rating": "8",
      "text": "I have to say, I have not felt this squishy since Nancy Meyers Father Of The Bride. Funny, warm and such great heart leads this film to a praise. It is like a Romantic Comedy without the romance and smoosh! I am not a fan of watching and listening to kissing sounds and over done formulaic in romantic comedies or any other film (Unless it’s about sex such as shades).\rI am happy to announce the star here really is De Niro. The man can put on a singlet and make you feel under dressed. His smooth charm works here as he brings all his life stories and experiences to a new young age of online finances and shopping and the modern day Ebayer. With just his Briefcase, glasses and a Handkerchief in his pocket.  Showing the young talent to not only be fast on their feet but to slow down and take it all in once in a while. It’s ok to have your face on a screen all day for work and not have to feel ashamed because you’re a parent working multiple jobs. You do what you do and you do it to the best of your ability. Life will get in the way, but it won’t leave you behind if even it all out.\rAnne Hathaway is gorgeous as usual. Her smile melts my insides. Hathaway plays Jules Ostin a woman who has built her own online clothing business from the ground up. She works ridiculous hours and some of her colleagues decide it to be best to bring in some help for her and offer some older generations to show them how it’s done. She really makes the working Mum role seem so natural. I think these scenes were directed beautifully. Her fulltime job is so insanely busy we don’t even know she has a Husband and a child until at least 20 minutes into the film. This is not misdirection. It is there to really show you how busy her life is and it works. One scene I loved included a birthday party with school mum’s doing what school mum’s can do (looking down on you for not being an at home Mum) De Niro gets involved and well, it is just great to watch.\rOne of the biggest stand outs for me here is Jules Husband played by Anders Holm. He absolutely smashes the at home Dad role fantastically. He reverses the movie Male roles of so many films gone by and flips it on its head and slams it right down into modern day. Yes there are full time stay at home Dad’s and no not all of them are dole bludging, video game loving lazy butts. He looks after their daughter mostly 24/7 and puts his own career into the trash so that his wife can really shine at what she does best. A lot more plays into this later and I will not spoil it. I believed the ending was just. Many will not. Our mistakes are what makes us stronger in most cases.\rThe rest of the younger cast in this are all awesome. Each character is given a little screen time and just enough to make us care. Andrew Rannells (Tv’s Girls) has the same role he seems to have in all his shows and films. But it still works here and I love him.\rI will wrap this up by saying try not to miss this. If you love a good hearted drama/comedy. This one will not disappoint. It doesn’t change the film making form in any leaps and bounds as most blockbusters of the year try to. But it leaves you feeling like it accomplished something. It also left me feeling like Robert De Niro is a true veteran of the class and a fine form, even in his later years. If this was to be his last film, it would have been a damn fine send off."
    },
    {
      "rating": "8",
      "text": "There are so many stories in this movie: old retired widower doesn't know what to do with the rest of his life; young entrepreneur who is neglecting her family while building her start up business (isn't that usually the guy's problem,)  the other young interns and workers who don't really know much about life, and somehow they are intertwined perfectly.  You'd think that would be easy, but I've seen a lot of movies that can't pull it off.  Anne Hathaway is such a good actress and this role gives her a lot of range.  DeNiro, I don't know, maybe he was miscast, maybe Robin Williams would have been better but...."
    },
    {
      "rating": "3",
      "text": "Handles its male characters about as well as a Michael Bay film handles its females. Apparently the modern male is a cheating, unkempt, chauvinistic, ill mannered, and immature manchild with no good role models while the fantastically flawless 'classic male' of 'the good old days' in De Niro is free of any of the massive prejudices of his time. Comparatively, the women of the film come out smelling like roses.\r Beyond that the film is a mixed bag. Decently produced and tries to be charming, but the laughs are never notable and the messages often come off smug and preachy. I do think Hathaway did a decent job but it's contrasted by De Niro's extremely bland performance. All in all an interesting premise and opportunity fairly squandered."
    },
    {
      "rating": "10",
      "text": "It's a great film which will genuinely make you happy. I can't believe the critics rated this so low. Ignore them and watch it. Robert De Niro and Anne Hathaway are at their best."
    },
    {
      "rating": "8",
      "text": "\"The Intern\" stars Robert DiNero and Ann Hathaway in this charming film written and directed by Nancy Myers. As with so many of her prior films, Ms. Myers focuses upon the empowered woman of talent and achievement and the problems faced by those in her gender. :Baby Boom\", :It’s Complicated\" and \"Something's Got to Give\" are just a few examples Although Ms. Hathaway does not yet equal the caliber or experience of a Diane Keaton or Meryl Streep, she gives a convincing performance as a successful woman in a man’s world. Mr. DiNero gives a warm and sensitive performance as an intern hired by Ms. Hathaway’s firm who, but for his age and retirement status, would be sought after as a vital addition to any enterprise. The film touches upon and engages in many issues including the value of senior citizens with experience versus their younger counterparts and, as so many employers have been finding out, offer a different and deeper dimension to the jobs they fill. I give the film an 8 and suggest that recent and former members of the work force will appreciate the messages it sends,"
    },
    {
      "rating": "3",
      "text": "This was listed as a comedy but I didn't laugh once. In addition, the movie is very very slow. Jules is way to unorganized to run a successful startup."
    },
    {
      "rating": "8",
      "text": "As to expect from Meyers, a kind and sweet comedy with charismatic characters and a touching story. Hathaway and De Niro make a great team on screen and teach us about friendship, family, love and work, along with the rest of the cast.  The script is generally well developed and the final result is a crowd-pleaser that will earn the audience's love right away."
    },
    {
      "rating": "8",
      "text": "I went in feeling a little bit unsure whether I would like it. I wanted to like it because I love Nancy Meyers. I didn't love It's Complicated, though. Surprisingly, I thoroughly enjoyed this film. I even left feeling satisfied. Robert De Niro was as charming as ever. Anne Hathway did a great job playing a conflicted, unlikeable woman without making her likeable. That is, many actresses make their characters likeable because they feel they must be, which is not true. It's an interesting premise, which Meyers turns into an intelligent plot. The only thing I didn't like about this film was that De Niro's character was a perfect human being. He's flawless, which doesn't seem real. Otherwise, it made me laugh plenty and even tear up in a scene. It's very moving and charming."
    },
    {
      "rating": "0",
      "text": "Typical Holiday movie scamming people out of money.  Worst story I've ever encountered, bad acting, ugggggggh.  Do yourself a favor and skip this film"
    },
    {
      "rating": "0",
      "text": "From the beginning to end, The Intern has you bored out of your mind. Robert DeNiro and Anne Hathaway can't even save how awful the script and movie is. Both have extremely disappointing performances, and The Intern is Nancy Meyers at her worst."
    },
    {
      "rating": "8",
      "text": "Pros:\rRobert De Niro is great in this movie!\rAs an IT guy, watching the older people trying to use technology was funny.\rStory is pretty good.\r Cons:\rThe end of the movie seems rushed and comes out of no where.\rI'm not too happy with Jules decision at the end of the movie. (not spoiling it)\rSome scenes seemed unnecessary and like they were just trying to fill up the two hours."
    },
    {
      "rating": "3",
      "text": "The most generic film ever made. Robert DeNiro is fine. Anne Hathaway is fine. The film feels an hour too long, the jokes don't work at all and the drama feels forced. Still, I didn't hate it."
    },
    {
      "rating": "9",
      "text": "Great movie, lots of fun. The movie is just really enjoyable. Loved it. The story is good, and so is the acting. It's one of those movies that leaves you feeling really good after it is over."
    },
    {
      "rating": "7",
      "text": "It's a good, solid feel-good flick, and DeNiro is excellent in it.  It's largely what you'd expect from a Nancy Myers movie - not a ton at stake, but a touch more \"dangerous\" in terms of themes it covers.  Hathaway is at her straightest here, but she works.  And the supporting comedy \"bros\" absolutely serve their purpose.  Definitely worth your time."
    },
    {
      "rating": "5",
      "text": "An adorable movie that has a side effect of making you stupid if your views and knowledge of relationship and business become based on this movie.  CEO is needed to replace a founder if the founder is a poor leader and decision maker.  Getting COO and/or setting up a network of VP is how to \"share the load.\"  Also when a cheating wife is caught, she is supposed to say \"it's because you're never home to satisfy my needs,\" not \"my 'hood is injured and confused\" lmao.  Like how big explosions get you high score with some people, corny bs gets you high score with some other people."
    },
    {
      "rating": "7",
      "text": "Admittedly, based on the trailer, I had very low expectations for THE INTERN. Nevertheless, it's hard to turn down a Nancy Meyers flick. The film starts off in regular fashion - and proves to take turns and make new, insightful looks at relationships and the world today. Anne Hathaway and Robert De Niro are oddly and surprisingly very compatible - making a very meaningful dramedy through the eyes of one of the greatest female directors today."
    },
    {
      "rating": "6",
      "text": "This movie is a solid C- in my book, good enough to slide by BUT just barley. Now I'm normally pretty generous with my scoring so this is on the lower side for me.  I have to tell you this movie made me really feel uncomfortable as a man, as has been noted the entire thing smacks of this retro-sexist vibe, that only seems to expand and become more visible as the movie progresses. For me by the end is was so apparent and in my face that I had a hard time focusing on the movies charming parts of which there are many."
    },
    {
      "rating": "3",
      "text": "De Niro is effortlessly excellent as ever but the film is too long and uninteresting. Hathaway plays her role like the script was penned by a Vanity Fair intern. Only watch if you have 2 hours to completely waste."
    },
    {
      "rating": "6",
      "text": "\"The Intern \" was a very good movie , but a little out of energy , I liked the performances of Robert De Niro and Anne Hathaway was filled with little emotion but made ​​me laugh."
    },
    {
      "rating": "5",
      "text": "Movie Review - The Intern - Stores Nothing Great - if you have nothing to do this Weekend then it's a good option to go for.\rhttp://www.bollywoodgupshup.net/movie-review-the-intern/"
    },
    {
      "rating": "1",
      "text": "Just saw this movie a week ago on netflix and was disappointed. From the unfunny student film script to the **** camera angles and cliche music this is horrible. How could people give this a score higher than a 1 or 2? This movie is still bad if you are drunk."
    },
    {
      "rating": "10",
      "text": "The Intern. Beautiful and fashionable. What can be said about this film? This is a very kind and beautiful movie. Stunning Robert De Niro and Anne Hathaway. Two hours passed quickly because you are immersed in this film with your head and you want this story not to end."
    },
    {
      "rating": "3",
      "text": "Soppy, entirely a teen-dream story with lots of nice lovely caring people..... totally New York? Well no, not really."
    },
    {
      "rating": "4",
      "text": "The opening monologue was very good and rang true, nicely presenting an important issue -- how to cope with retirement and the passing of one's spouse.   But the rest of the movie unfortunately didn't live up to it, imo.   I was hoping for more, something deeper and more realistic perhaps.  I was disappointed."
    },
    {
      "rating": "7",
      "text": "I wasn't expecting much from The Intern. Like most older actors, the work isn't quite what it once was for Robert De Niro. He's fared better than most actors who have also entered their later years, and the man is still delivering dedicated performances, but his recent string of movies have received middle-of-the-road reviews or been outright critically panned, minus a few exceptions. The Intern stands among of his more fondly recognized works of the past few years, but the professional reception has still been rather lukewarm. I thought that was because it was just going to be another schmaltzy \"old people still got it\" comedy lacking in any original jokes and in desperate need of some actual emotional depth as the trailers made it seem. Imagine my surprise when it turned out to be a pretty thoughtful movie that takes an interesting look at the challenges of modern day life for two different generations and won me over with it's warm-heartedness.Nancy Meyers takes the time to make us familiar with the workplace of it's online fashion startup. We get to know the supporting characters and grow to love them just as much as the two leads. Hathaway and De Niro are incredible. Their chemistry is sublime and each allows their character a great deal of emotional depth and nuance. Meyers has a way with dialog and character interactions that makes it a lot of fun to just watch everyone get together and talk whether it be in groups or one-on-one conversations. Watching the core friendship bloom in the face of difficulties is both sweet and charming. It carries the movie forward even when it feels like nothing is really going on story-wise. The events going on in the background of the company feel somewhat inconsequential as they are easily dismissed and overcome in favor or placing the urgency and attention on seemingly trivial problems. Hathaway's character is on the search for a CEO to help her manage her company better, but The Intern is less interested in telling us about that and would rather have us focus on her OCD about a cluttered desk instead. At least the troubles in everyone's personal lives aren't treated the same way. That's where the real drama and growth occurs.The Intern can be a pretty funny movie. Perhaps a little unevenly so though. It's better with smaller, quirkier interactions providing the majority of the laughs. It's bigger gags like an amusing midday heist and oddly raunchy massage sequences feel like they belong in a different movie. It's as if Meyers shoehorned these in so that this generation's style of comedy could give The Intern broader appeal. Understandable, but perhaps a little misguided.I grew to love the characters here and got caught up in their personal affairs. I was also in awe of De Niro and Hathaway who really give incredible performances. Their almost familial bond is not something I would have originally expected. The way it tackles modern day issues and delivers a genuinely intelligent, non-preachy feministic message is admirable. The small scale does allow for some inconsistencies across the board such as the humor, but also makes it possible for viewers to get more personally involved with everything happening. Something that's also made easy by just how likable everybody onscreen is. 7.5/10"
    },
    {
      "rating": "7",
      "text": "A movie that pays tribute to the elderly in these days where goods are accorded to the youngsters only. A 70 years retiree Robert De Niro (Ben) starts a new life as an intern in an Internet based company owned by Anne Hathaway (Jules). Ben successfully overcomes cold welcome by everyone in the company and works hard to be everybody's friend and helper specially for Jules. Simplistic movie as scenario, directing and acting, though entertaining and absorbing. Two joyful hours with old traditions that prove that normal ethical life cannot go without recognizing and respecting them."
    },
    {
      "rating": "5",
      "text": "Anne Hathaway glows in “The Intern” whether she is leading 200+ employees of a company she founded or getting drunk and throwing up into a dumpster or crying when she has been betrayed or any of the many emotions she experiences in this 2 hour movie. On the other hand it is time Robert De Niro gave up broad comedies as he is only repeating every movement and mugging face he has made since “Analyze This”, “Meet The Parents” and “Meet The Frockers”. He has made many comedies throughout his career but for the past decade and a half it seems he wants to be Jerry Lewis!\r For a comedy “The Intern” is only mildly amusing with the funniest scene having nothing to do with advancing the plot but a ’breaking and entering’ mission, which was written, and directed, by Nancy Meyers who has had success with previous films dealing with whether a woman can ‘have it all’. Most of the film was made in Brooklyn showing the New York borough as green and sparkling and having an empty parking spot for any in the cast of the film.\r The various supporting characters from Anders Holm as Hathaway’s stay at home husband and dad to their very precocious daughter JoJo Kushner to Rene Russo as a love interest for De Niro--whew! No, not Hathaway! Among young employees in Hathaway’s company Peter Vack, Andrew Rannells, Nat Wolff along with Linda Lavin, Zack Pearlman and Christina Holtan and others do what they can with the material given them.\r “The Intern” is a pleasant movie but drags in spots and touches on subjects without following through such as Hathaway’s relationship with her mother.\r Oh yes I don’t ever remember seeing so many pillows on beds, decorative or utilitarian, whether in a home or a hotel!"
    },
    {
      "rating": "6",
      "text": "Soooo cheesy. It really plays on that Big Bang Theory stereotype that smart people have no basic social skills. The cure for that issue is super grandpa Robert De Niro who can do everything including cleaning a messy desk the office just throws their crap on.. If De Niro's character wasn't there, one character would forever look like a bum and another would always be in the friend zone. Why does his character do it? Well, as stated in the beginning he became an intern because he is bored with retirement, which means this movie has no real plot so the climax resides on the female's lead to stop being so indecisive.  But if you can tolerate the old people jokes, then this movie becomes a feel good emotional drama about what it means to live and learn."
    },
    {
      "rating": "6",
      "text": "\"The  Intern\"  is  surprisingly  charming,  but  one  note  and  sluggish.  Two  good  performances  make  this  pretty  forgettable  story  into  an  okay  watch."
    },
    {
      "rating": "2",
      "text": "Wow. DeNiro is wonderful but the whole scrip spews forth wannabe women cliches. DeNiro is condescending dealt with in the early scenes with ageist claptrap. You can’t do spoilers for this film as the plot is so obvious from the start. Yes, it’s hilarious but for all the wrong reasons."
    },
    {
      "rating": "7",
      "text": "All of Nancy Meyers films are light fluffy with bright colors and a pleasant almost corny score but in this case it really works.  Throughout this film you can't help it not to have a smile on your face.  B+"
    },
    {
      "rating": "7",
      "text": "\"The Intern\" is a feel-good comedy that works thanks to the strengths of its leads as well as its charming story."
    },
    {
      "rating": "6",
      "text": "Heartfelt drama about an elderly man journey back to a full time work position. The cast is fantastic. I found the constant musical score to be distracting from any potential dramatic moments and the overall tone and dialogue seemed unrealistic. Still if you've got a couple hours and don't mind watching something so wholely inoffensive to the point of being an inert gas then this is for you."
    },
    {
      "rating": "6",
      "text": "The Intern is simply a feel good movie. It exists solely to put a smile on the viewers face. Nancy Myers is generally an optimistic film maker and this movie is no different. Anne Hathaway and Robert De Niro are not the most likely pairing in a film but it works, the chemistry is there. Hathaway and De Niro aren't giving the performances of their careers by any stretch but they are simply great actors who are undeniably likeable. The Intern is a film with very little conflict which is a downside. Robert De Niro's character is essentially flawless. He really can do no wrong, but on the other side that how you manage to adore him even more. I wouldn't consider the film to be clichéd but it is a little predictable and not the most original work in the world. Its too long as well but its still hard not to be in a good mood when the movie is over and that is why I can still recommend watching it."
    },
    {
      "rating": "4",
      "text": "Prime example of a 2 hour movie that has no business being longer than 90 minutes!  Bob is good as usual and Anne Hathaway is annoyingly serviceable.  The problem is the writer/director is self indulgently unaware of how grating her shallow, simplistic, over-sentimentality wears on an audience!  She no doubt has a knack for high concepts, but we can get that from the trailer alone and spare ourselves from sitting through the whole bloated feature which has NO jokes that aren't already in the trailer and shorter and better that way!"
    },
    {
      "rating": "5",
      "text": "A feel-good piece of fluff that wastes the talents of Robert De Niro. Okay for family night at the movies, but I'll bet that your 12 year old heads for bed after 60 minutes. That is, after mom and dad are snoring by 45 minutes."
    },
    {
      "rating": "6",
      "text": "I think this is a very interesting item to make a movie about.\rBut I must say the subject has not been worked out to satisfaction.\rIt leaves you behind with much disappointment.\rMust be said, that this movie is totally carried\rby the big shoulders of Robert De Niro\rwho only performs'good', nothing more.\rA better idea would have been, to take any funny actor,\rand make a great comedy about this subject.\rAn idea for another director.\r'Ben' the intern says he fills his life only with ordinary things.\rHe shows how 90 % of the people are led and governed by 10 % leaders/decision makers.\rThese people would be lost in their lives, without a leader, a person to tell them\rwhat to do, in the first place their wives, = that is the situation of 'Ben' also.\rThat's the storyline, the rest is fill in,  with clichés !\rIt is true, the film is really searching for it's end and ends in the most ordinary fashion,\rin the middle of the story = 'at the end all was well and fine'. Stop,\rRidiculous."
    },
    {
      "rating": "7",
      "text": "A woman at my local public library described \"The Intern\" as \"cute,\" and I think that sums it up.  One might be led to assume, based on the marketing, that this is a film about the Robert Deniro character providing sage advice and brilliant insights based on his many decades of business experience.  It is not.  The film is about making new friends.  Deniro's character makes lots of new friends.  And he's there for them, ready with a smile, a handkerchief, a shoulder to cry on.  Don't be fooled into thinking that he's holding back on the sage advice until some critical moment arrives and disaster waves a menacing hand.  He's not holding back.  The critical moment never arrives.  Things just amble along to a very quiet finale and then we all go to the park to practice tai chi.\r I don't think the filmmakers know a lot about geeks, any kind of geeks, because I've met a few and they're not all adorable teddy bears, but, hey, It's not a bad movie.  Deniro will drag you along.  Just don't expect fireworks."
    },
    {
      "rating": "6",
      "text": "Can't dispute the overall rating for this film. Robert De Niro plays a likeable character but the storyline drug on a little too much.  It had its cute moments enough to keep the audience somewhat attentive but there were also some boring lulls. Overall  ......  So-So"
    },
    {
      "rating": "7",
      "text": "The movie is good. It tells you the importance of old people. Sometimes, people do not respect old people but we need to know they have more life experience than we do. And one day, we will be old too."
    },
    {
      "rating": "5",
      "text": "De Niro and Hathaway suit the roles of there characters perfectly in The Intern, which makes this film worth watching. But, the fact that the actual main plot of the is quite similar to other films, makes it a bit boring to watch is some parts. I also found that there was way too much adverting, every where you looked, Apple, Apple, Samsung, Apple, HP. The film isn't bad but it is not fantastic either."
    },
    {
      "rating": "1",
      "text": "Robert De Niro teaches boys how to become men by giving them lessons on work place apparel (aka always wear a suit), organization (aka desks never look like they're actually being used, but rather preserved for a tour of scholars to marvel at the immaculate symmetry) and by revealing to them that real men carry handkerchiefs so they can offer it to the crying ladies.\r Asides from that De Niro serves as Anne Hathaway's father, friend, life coach, therapist, zen master and all in all manly man swag master shoulder to lean on. So much so that they spend a night in bed together wearing bath robes while Hathaway cries. I'm not kidding, it actually happens.\r Also the script writer gets to vicariously vent through Anne Hathaway's character by going on a rant about how men these days all look like children with all the video games, t-shirts and neck beards. Everybody knows real men wear suits, drink vodka martinis and introduces themselves by saying their last names first.\r Oh, and after cheating on Hathaway her husband wins her back with part of his little speech including this line,\r \"It's a confusing world out there, and who I am got messed up for a minute.\"\r Don't yah just hate when in this confusing world you find yourself sleeping with your wife one minute and then with another woman the next? I think we can all relate to that. See, any affair can be smoothed over just by reminding your significant other that the world is confusing. For example, 'I don't know what happened honey! One minute we were making love, the next minute I was f$*#ing your best friend... Please take me back I was confused!'"
    },
    {
      "rating": "4",
      "text": "I loved the opening scene of this movie, and I loved how it wrapped up, but I am not sure what the hell happened in the middle.  The Intern has De Niro trying and succeeding in this role, but fails to take advantage by putting dopey jokes and ridiculously obvious plot starters in his way."
    },
    {
      "rating": "9",
      "text": "A beautifully written story of friendship and self belief; The Intern brought both laughter and tears whilst carrying me along on a heartwarming journey, expertly portrayed through the outstanding chemistry and performance of Anne Hathaway and Robert De Niro. When the screen faded to black, I was left with a sombre feeling and a swollen heart. This is not one to miss if you like a touching, feel good movie."
    },
    {
      "rating": "5",
      "text": "The always emotional Anne Hathaway plays a boss who tries to hides her weaknesses. De Niro plays wise old man. No surprises, just gentle emotional exercise through slight tugs at your heart-strings. Parts give the impression of having been written to provoke very mild amusement. I didn't laugh, but I did stay awake all the way through, despite quite a big dinner."
    }
  ]
}