{"id": 780, "title": "The Purge: Anarchy", "starring": ["Frank Grillo", "Carmen Ejogo"], "runtime": 104, "genre": ["Horror", "Thriller"], "description": "One night per year, the government sanctions a 12-hour period in which citizens can commit any crime they wish -- including murder -- without fear of punishment or imprisonment. Leo, a sergeant who lost his son, plans a vigilante mission of revenge during the mayhem. However, instead of a death-dealing avenger, he becomes the unexpected protector of four innocent strangers who desperately need his help if they are to survive the night.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/f2HD5iVhJWWv72QVWThUKk09zYy.jpg", "categories": {"plot": 4.085106382978723, "acting": 3.7096774193548385, "ending": 3.857142857142857, "soundtrack": 5.0, "cinematography": 4.666666666666667, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "I thought the first one was better: at least the idea was new, and there was much more tension. This one is just an action-packed thriller, with the occasional jump scares, with less believable supporting characters and a tendency to simplify politics and... racial stereotypes. Not extremely ghastly, but still definitely not worth spending the money. Maybe the time, if you get what I mean."}, {"rating": "2", "text": "I have problems sleeping at night, but I was out cold for about 5 minutes during this movie.  I can't say the whole film is predictable, because I expected twists or surprises.  There was maybe half of one.  Characters are boring, the violence is boring, the plot and setting (2023 looks like now) are boring, the ending is unsatisfying, and the bad guys are boring (HOW CAN THE BADGUYS BE BORING IN A MOVIE LIKE THIS?!).  Go watch the new Mad Max trailer for 2 hours instead."}, {"rating": "2", "text": "A plot that took on the perplexity of a universe where \"the purge\" exists was a vast improvement from what was essentially just a home invasion in the first movie. The positives pretty much stop there. Poor acting, screen writing and what seemed like poor direction in what the producers wanted The Purge: Anarchy to be once again ruined the potential of the purge concept.\r This is not a movie I would recommend anyone to see as the studio producing the movie skimped on everything besides the cinematography in what was an obvious ploy to create profits, not quality entertainment."}, {"rating": "2", "text": "*SPOILERS INCLUDED* I went to go see this movie with my friends and while they all thought it was a great movie me and my boy Saucy Johnson thought otherwise.  First off, the sound effects set on the movie were way too high... At one point a gun was placed on the counter and it sounded like a real gun went off in the theater.  It was unbearably loud.  I had to cover my ears during some gun scenes.  Oh and forget it... As soon as I saw a turret i knew my ears were abouta bleed.  Even covering my ears it sounded loud.  Second, the movie was extremely racist.  So what ALL wealthy families are white and  EVERYONE in the government is white??  Nah not a chance, even if its a majority white at least have the indecency to add a few other races so it doesn't seem like you are trying to be racist.  Adding onto racism, everyone in the NFFA  is black.....  Couldn't just add one white guy!?  The dialogue was poorly made.  They made Liz \"the girl with blonde hair\" such a typical dumb ****  Seriously who wears high heels on the day of the purge.  Also acting like such a **** when the Sergeant saved her and then wanted to continue without them.  She was screaming on top of her lungs to not leave them.  Like are you serious?! The guy saves you and wants to do something and you're going to act mad selfish and scream... attracting purgers...  Not to mention the scene in the end when the sergeant got shot and Eva and Cali(mother and daughter) ran out of the CAR to go to him and yell to the guy if he had a CAR!  YOU JUST CAME OUT OF A CAR WHY THE HELL YOU ASKING IF HE HAS A CAR IF THERE IS ONE 20 FEET AWAY!  The ONLY thing that was good in this movie was the Sergeant cause he was a badass, the rest of the actors/actresses were trash.  Awful movie, racist, the END."}, {"rating": "5", "text": "Has some decent visuals and ideas but is mostly pretty stupid and uninspired."}, {"rating": "6", "text": "The first PURGE was that rare conceptual film that could actually contain a plot through to the end. THE PURGE:ANARCHY is even better! Exciting filmmaking with a super cast but best of all, THE PURGE: ANARCHY is real B-movie complete with overt political message that will kind of touch your heart and piss you off. A winner!"}, {"rating": "5", "text": "The sequel that no one wanted (but personally i thought purge needed one), Has came back with an idiotic characters who make dumb choices en order to  survive the purge. The first purge was actually entertaining also suspenseful it's just the characters were retarts classic ones in a horror movie that is the problem with\r\" The Purge \" it's James DeMonaco's script  that needs a few touches also his skills as a writer/ director. The cast is bad ass including Frank Grillo. Grade B-"}, {"rating": "6", "text": "Rarely happens that sequel is better than the predecessor. Story is better, fantastic choice of actors and their good performance made this movie better than it should be.."}, {"rating": "2", "text": "Anarchy fails to deliver on almost all levels. The tension failed to come to fruition, the direction was poor and the acting almost unbearable to watch. What's more, the filmmaker know this. I didn't even know about the films existence until two weeks before it's release because of its terrible promotion. It's clear to me that the Purge: Anarchy is merely an attempt at scraping together the funds to tide the producers and the cast over. I don't anticipate a sequel, and if a third film is made, I doubt it shall come back from this shameful performance."}, {"rating": "6", "text": "I was glad to hear that The Purge was getting a sequel when I saw the trailer, I found that the first movie had so much potential but it really didn't reach it. However much like the previous film The Purge Anarchy had a great trailer that brought people into the theatre to watch it that allowed it to make huge amounts of money without spending much on a budget. I didn't really care for the cast through most of the movie. I would've liked to have seen more from Michael K. Williams who played a relatively minor role in the film. However the film continued to keep me guessing and the last ten minutes were really what made the movie for me. I'm expecting a third Purge film and I'd like to see more improvement because the sky is the limit with this idea."}, {"rating": "3", "text": "Why was this lousy, ultra low budget, vile, sadistic, formulaic, boring as hell little thriller released in 2:35 widescreen?  Because the producers and distributors are jackasses that either don't know what they're doing or erroneously think that with 16x9 TV having taken over, the cinema screen needs to go wider across the board?  Or is it because the jackass filmmakers delusionally think they are David Lean?  It's not even photographed well, particularly a scene with a flashlight in a tunnel where the blue flares hitting the lens look so out of place as to be animated in or something?  Fire that color grader!  And director and DP take yourself back to film school and get an education where you learn what is acceptable and what is just your childish indulgences!\rThe fact is a junky little movie like this lives on video after a short life in theaters, and all that letterbox does is lose screen real estate for the flick on today's TV's.  The desired wide effect does nothing to make the movie any bigger or more legitimate.  It's not fooling anybody.  If epic modern movies like \"Avatar\" or \"Noah\" play huge in 1:85 flat, then why in hell would this genre garbage warrant being wide?"}, {"rating": "2", "text": "Its no different than any of the other horror movies. it was a disappointment. The acting in it was poor, and it felt almost as if the movie was rushed."}, {"rating": "1", "text": "Wow...did no one get what this movie is about? The \"New Founding Fathers\" grant everyone the \"right\" to kill people for 12 hours out of the year....for \"population\" control. They run around with fully automatic weapons killing each other and screaming about how its \"their right\" granted to them by the government.\r Get it? Its basically an anti-2nd amendment movie. Only a libtard thinks that rights are granted by the government. Your right to self defense is an inalienable right just like the right of life liberty and the pursuit of happiness. They can not be granted...they can only be taken away. They are protected by the constitution...not granted by the constitution.\r You all totally missed the point of this movie...all this \"the concept was what if all crime was legal for a day\" nonsense...only crime being committed was murder and 99% of the time it was done with firearms."}, {"rating": "4", "text": "This movie looks good and it's well acted, but the narrative is all over the place and the convoluted direction certainly doesn't help make it make any sense. The \"Purge\" movies just aren't that good, but as long as people keep going to see them, then we're just going to be stuck with them and probably annually just like the purge in the movies. Ugh..."}, {"rating": "2", "text": "This is a fan favorite for many but I see so many issues in this movie that it makes my stomach turn. It's story is bleek. Overall I just hate this installment and I have many reasons for hating it."}, {"rating": "5", "text": "Anarchy is mostly on par with the first Purge film, but in a strange way. Some things are done worse, and somethings are improved on. We actually get to see the real Purge on the streets in this movie, which is a breath of fresh air. It's not the best sequel, but it's not the worst one either."}, {"rating": "3", "text": "The Purge: Anarchy is better then the first movie that's not saying much. The first 20 minutes  before the purge I thought was great but then it starts to be the first movie again but with it outside."}, {"rating": "3", "text": "J'ai pas vu le premier mais sur le papîer ma foi, ça promet : dans la belle Amérique, une purge annuelle est organisée afin de canaliser les mauvais instincts et vilains penchants pour le meurtre et la violence. Ainsi, pendant une nuit, la populace peut assassiner son voisin en toute impunité. C'est un franc succès au pays des armes à feu et sûrement sponsorisé par la NRA...Voilà donc qui devrait plaire aux anarchistes, surtout qu'un groupe dissident anti-purge descend aussi dans la rue pour purger les organisateurs purgeurs, c'est-à-dire l'Etat en somme. De toute façon, tout le monde va se purger dans la joie, la colère et la mauvaise humeur.Le film hésite et s'éparpille dans son discours moralisateur sur la violence endémique américaine et surfe sur une vague certaine du gauchisme \"antifa\"  avec une gaucherie non moins certaine d'ailleurs. Tout cela est décidément bien maladroit mais reste assez drôle de temps à autre, le temps de la découverte. On aurait aimé tout de même plus de satire ou d'ironie, car ce navet se prend drôlement au sérieux !On ne s'ennuie pas trop en tout cas, il est donc dommage de constater une réalisation si désagréable avec caméra à l'épaule de Parkinson et montage un peu trop nerveux. On constate également la guimauve syndicale à la fin qui achève de décrédibiliser un film dans l'ensemble bien trop bancal pour convaincre... même en tant que simple divertissement."}, {"rating": "1", "text": "To paraphrase the famous quote: Why so stupid?The supposed philosophy behind this movie is so retarded. Like in 2023 there isn't going to be a shred of morality in society, or a concept of good and evil, right and wrong and people will miss half a brain and will call killing random people a holiday. The creators of this film even wrap this up in a pseudo-religious smoke screen. The blame is as always on the rich, especially the white rich. Lets fight for socialist ideals by blaming the rich for all the problems in society and in the process making millions of dollars.The characters make as many irrational choices as possible. That couple of idiots in the process of separation don't have anything better to do an hour before the purge than to discuss if they should tell the sister of soon-to-be ex-boyfriend about the separation. Another couple of idiots is the mother and daughter faced with an invasion of their home during the purge and remembering that the gun - their only weapon - is in the kitchen. When they are saved by vengeful guy, the daughter doesn't have anything important to do than lecturing this guy about how it is wrong to purge. Maybe it's better to keep the mouth shut and be thankful that you are not dead and hope he can protect you until morning. The vengeful guy who in the middle of the fight take off the vest and gives it to that same daughter thereby reducing the chances for all of them to survive - he is another idiot. He is the most trained, there is a certainty that in the gunfight he will be on the frontline...and therefore quite probable to catch some bullets. It would be better to catch them in the vest. If he gets killed or wounded...what chances do they have? And so on....It's sad..."}, {"rating": "3", "text": "A squeal that doesn't even try. Remember last year with the first Purge movie and I really didn't like it, but this movie is nothing different. This movie is still filled with stupid characters that make stupid choices throw out the film. They is this one scene in this movie where these homeless people are hiding underground trying to get away from this horrible event and they are hiding in complete darkness and nobody can't see them. but these people with flamethrowers come underground chasing are main characters not seeing the homeless people, and then the homeless people got up from there hiding places, and started running in past them for no reason at all. Overall this movie is nothing much as a violent train wreck."}, {"rating": "3", "text": "Instead of just being exactly what it is (a normal horror/slasher film), this movie decided to had small amount of very heavy handed political messaging; just like the first one. Even if you take that away, this movie was extremely predictable. I was literally saying what is going to happen next right before it should have happened as if the writers had a 'how to make a slasher movie' handbook they felt they had to stick to. I'm sure they will make another one, because they definitely have enough to go off of to continue this seemingly forever in the way Saw did."}, {"rating": "1", "text": "The concept: one night a year, all crimes are allowed. This time, instead of one family's home being invaded, the action takes to the streets, where our protagonists are on the run. The premise is improbable enough, but this plot extends it to simply stupid: the characters are lame and the situations are absurd. Worse of all, the violent acts are dull and unoriginal. Many of the potentially best kills are dispatched off-camera or in a blur. There's nothing about this sequel that vaguely resembles the gripping original."}, {"rating": "5", "text": "Not nearly as unnerving or interesting as the first film. The politics are mundane. Casting the white folks as the wealthy purgers (and the stupid couple breaking down and stranded in the city) is ignorant.  Casting the masked street gang as all young black males is equally as ignorant.  It's slightly thrilling, but SO much more could have been done with the concept."}, {"rating": "5", "text": "While this is definitely an improvement over the last Purge movie, The Purge: Anarchy plays it safe. This idea could be expanded so much more with the right director and cast, but the movie settles for less than it's worth. Obviously, a third installment will be made, and hopefully it will be even better. But, the one plus in this movie is that the story is better, and it's more watchable than the last one."}, {"rating": "0", "text": "I watched this with an open mind, as I had no prior knowledge whatsoever. The concept, or plot was quite under thought. As the events came to be, it became more and more like a bad B horror movie. A husband that walks away from a son, wife and daughter in a life and death situation. Yeah, that would happen. The worse part, and most difficult to believe (even in a fantasy), was when common neighbors turn to cold blooded murderers just because the opportunity presented itself. This was BY FAR, the worse box office movie that I have ever seen. I disliked it so much that I became a member to warn the world not to waste 2 hours of their lives. It was written to appeal to 4th graders, and with all the violence and sickness in our world, this was the last pile of garbage that anyone needed to spread. This is coming from a 44 year old adult, whom of which loves a great action flick, and has no problem with violence if it is part of the story line. Sorry to tell you all....this was the most pathetic excuse for a movie that I have ever seen. respectfully, casho"}, {"rating": "3", "text": "I went into The Purge: Anarchy expecting mindless entertainment, nothing deep or Oscar worthy. I really liked the first Purge movie. I think the concept is very interesting. However, this one felt like they tried way too hard to make a deeper meaning and emotional connection. Firstly, the characters in this movie are AWFUL. I really, really disliked all of them. They aren't bad people, but they are very fake people. They try to seem sympathetic and take some moral high-road, but it just comes off as staged. I was really hoping about 20 minutes into the film that everyone would die. The \"twist\" to the movie is that the government is now killing people during the purge because citizens aren't doing a good enough job at controlling the population. Why a government would want population control was never elaborated on. Maybe they wanted to decrease their tax base?It's really obvious that this is what is going on from very early on. However, the makers of this movie think their audience is completely stupid and continually threw out \"hints\" about the twist and then in the very end let the government guy have a whole monologue explaining his devious plans. I actually laughed because I was like- DUH! Jeez. I am actually writing this review to try and get the attention of the people who are going to make The Purge 3. Dear whoever you are: if you want to have character development or a story about a specific character stick to one and don't try to give us equal half-stories about 20 of the characters. Also, no one thinks this should be a horror film. Inserting random scenes to make people jump is super lame. Stick to the good thing about this series and that is the premise and the crazy ways people think of to kill one another."}, {"rating": "3", "text": "Cinematography is cool at times. Other than that I didn't feel a slightest emotional attachment to main characters. They were just dull and irritating thanks to idiotic script and dialogs."}, {"rating": "0", "text": "THIS MOVIE IS UTTERLY DISGRACEFUL and EVIL. I really think that movies like this should be BANNED. The concept undermines law and order and damages society. It implies that there are many (racially/sexually-motivated) suppressed haters in society, waiting desperately for a chance to be free to kill, which is untrue. The rich and well-educated are often very good people in society e.g. the Queen, Richard Branson etc. who would no doubt strongly condemn any such concept and behaviour. The police and law-enforcers are made to look two-faced, which is disgusting. The police devote their lives to justice and do not deserve this sort of portrayal. They should make movies that teach people to be allies in society and make people proud to be allies in society. This movie will make good people angry and may gave them a tension headache!\r The movie is unrealsitic and is, therefore, not scary. The pathetic scriptwriter makes a weak attempt to make it realistic by saying it is 2023 and an annual purging law has been passed (!) How stupid and gullible do the scriptwriters think we are? It is set in the USA - a great multi-cultural country with extremely strong ethics and a strong commitment to improve laws and increase punishment for law-breakers!\r I am a fan of original movies - and the only point 'in favour' of this movie is that I have not seen a movie like this before. I did not see the first movie. However, if they want to make movies like this, the ending must be total destruction of any 'government' who passed the purging 'law' in the first place. The purging should have been totally replaced by stronger law and order and much better justice when laws are broken. If the ending would have been something like that, I would have been happier. However, perhaps the producer wants to make a sequel and make lots of money?\r Overall, I cannot recommend that people watch this movie."}, {"rating": "3", "text": "What if all crime was legal once a year? What would you do? How you would you do it? you can quote \"cleanse your soul\". Does murdering really solve anything? These were the questions asked in James DeMonaco's engaging (sometimes thrilling) escapade \"The Purge\" a little film that took the box office by storm. Now, over a year later, it's beginning to feel like \"The Purge\" is becoming an annual gathering.\rCashing in on the low budget .. and hopefully turning this franchise into the next \"Saw\" or \"Paranormal Activity\"). While I can say that the angle on the subject matter changes a tad, and the perspective as whole has transpired into something that, hypothetically, could work at some point. The problem with \"The Purge: Anarchy\" is there is little suspense, too many characters, and dumb cliches that I thought we had outgrown by now.\r Where the original Purge lacked, \"Anarchy\" kind of makes up for (and not by much). The problem with the first Purge was that it didn't know how to categorize itself. Rather showing how else the world purges, it instead focused on one families night of survival (and stupidity). After about the half hour mark, the intriguing premise turned into a home invasion thriller reminiscent of such better made films like \"The Strangers\" and \"You're Next\". Not to mention the only actual crime that film capitalized on was murder. In \"The Purge: Anarchy\" we are not caught up in one family's life, but three. Which evidently becomes tiresome after awhile,It should say something that I didn't really care much to even know there names.\r The film opens with an annual announcement commencing the annual purge, and to thank our founding fathers. We first meet a waitress Eva (Carmen Ejogo) who is desperately trying to make ends meet for her daughter, and sick father. Living in the projects. Next we meet the bitter couple of Shane (Zach Gilford) and Liz (Kiele Sanchez), whom are going through the process of a separation. As fate would have it, there car breaks down on a freeway hours before the purge commences (the trailer presumes the car just dies, however, a gang of thugs wearing crazy porcelain masks.. cuts the gas line). Then lastly we meet the classic father out for revenge, Leo Barns (Frank Grillo) for the death of his son, over a year ago by a drunk driver. You wouldn't ever think these three unlikely groups would ever cross paths in such a huge city, but they do. Leo inadvertently saves Eva and her daughter, and thus become entrapped within the confines of the purge..and now must struggle to indeed \"survive the night\".\r First off, \"The Purge: Anarchy\" started with promise and I had some decent expectations. It looked as though the film would be more manageable, and open than the previous entry. Mainly because were getting into the city, and we are going to see how others purge. Does this happen? not really. Instead of taking a more character driven perspective, the film lags and settles for the same ole political mumbo-jumbo that we don't care about. Adding in some mindless subplot about an army militia, whose sole purpose is to end the Purge. Hence the name \"Anarchy\".\r On the performance side of things, nothing truly stood out to me. The only character, if any, that I actually felt connected with was Leo Barnes aching father figure type role, played here by Frank Grillo. His motives for the purge were actually understandable, plain ole fashion revenge. At least he had some purpose. While others were just relentless, and killed others for no apparent reason. Aside from him, everyone else was just basic or average when it comes to the standards of horror fare. (If you can call this a horror flick).\r I can respect the direction that James DeMonaco takes the film in, rather focusing on just one purge, it tries to introduce several purge's going on at once. The film's conclusion takes elements that made films like \"Hostel\" famous. Which is the more exciting aspect that the film has to offer. DeMonaco needs to write stronger characters, a heroine of sorts..that an audience can root for. Instead of introducing us to five people that make us feel nothing.\r At least with the first Purge, they knew what to do with their characters. There was a certain creepiness that Rhys Wakefield brought to the first purge, playing the smart-ivy league schoolboy with a thirst for killing. . While this time, no character brought chills to my spine. Even the creepy rip-off masks from \"Your Next\" didn't send a shiver, nor a goosebump. I wanted to be engaged, enticed, and enthralled ...and I got neither. Which is truly sad considering how much effort went into making this film. Which, you could obviously tell the budget was a bit bigger and this shows in the action set pieces, which are very well shot. The film ends with \"364 days until the next annual purge\" so another sequel is almost a forgone conclusion.\r Ask anyone that I know, and they will tell you I'm sucker for a bad horror/slasher flick. \"The Purge: Anarchy\" is too messy and can't pick up the pieces from it's interesting and original premise. Instead focusing on the events that actually occur, rather than characters I want to understand and get to know. Perhaps some flashbacks with Leo and his child before he was killed. Maybe if we knew the hardships that Liz and Shane had to go through, we as an audience could somehow relate. But no, we're settled for mindless violence that means nothing. I found enjoyment in the first thirty minutes (roughly). But then much like the original, it takes us away to something much more elusive than it needs to be. I still have hopes for what this franchise can accomplish, because in all honestly the premise is too intriguing. For now, If you're looking for a much better horror tale, stay in and rent \"Your Next\" or \"The Cabin In The Woods\". You will be glad you did.\r D\r By: Nate Adams\r Directed By: James DeMonaco\rRated: R\rRelease Date: July 18th 2014\rStudio: Universal Pictures\rRuntime: 100 Mins\r Thanks For Stopping By ®"}, {"rating": "7", "text": "Okay guys, come on. It wasn't that bad. In fact, it was quite enjoyable. I mean, it wasn't the best movie this summer. By ANY stretch of the imagination, but it was, in my opinion, a good movie. Very disturbing, but a delectable treat."}, {"rating": "0", "text": "Sitting in the theater,and lost interest before the first hour was over. The  problem with this movie is that the objective is to not get purged, and these idiot characters are gallivanting up and down the streets of NYC. Whaaaa?..seriously? Their sitting ducks. Targets. The writer could have at least had them in a place other than right in the  middle of NYC. This movie is just silly."}, {"rating": "8", "text": "After the housebound claustrophobia of the first instalment this second film takes the terror into the wider arena of the streets. At its core this is a morally reprehensible and despicable premise pandering to the baser instincts of human nature, which we can only hope remains a filmic fantasy. As a movie, fans of the horror and thriller genres will be in their element. Directed with cold efficiency, atmospherically photographed and grippingly edited the film makes many social political statements along the way. Surprisingly the story strands come together fairly well and generally make for credible viewing. However, a scene in which the protagonists take sanctuary in a house of a friend strikes a definite false note and is risible in its ridiculousness.\rThe gulf between rich and poor is a prominent theme as is the corruption of governments and politicians. Also, one sequence takes us directly into 'Hostel' territory. There are a couple of jumpy moments along the way and if the film ever so slightly out stays its welcome it still has a satisfying ending of suitably ironic redemption."}, {"rating": "8", "text": "Now let me start off my saying that I am probably one of the only people who enjoyed the first Purge movie. I thought it was an original concept and even though it was a home invasion thriller it had many twists and turns that kept me on the edge of my seat! The Purge: Anarchy takes everything that I liked about the first film and makes it even better! If you're looking for a good edge of your seat thriller this summer, you'll definitely want to catch this one in theaters! You'll be glad you did!"}, {"rating": "1", "text": "Crap movie, its a lot like the first except it take place outside! so yeah its a bit more entertaining but nonetheless its not very good. we have a group of 5 characters who are all boring except the lead guy and none of them die so its pointless?!..... i mean its not like we care about them lol. the premise of these movies has potential but they still ruin it!! the next one will be even worst and its all downhill from there! (look at Saw and Paranormal Activity)"}, {"rating": "5", "text": "The purge anarchy is a different improvement from the first one given the premise its given  , it may deliver its thrills that were better than the first but it still lacks emotional power and it lacks in other aspects as well ..just a movie that's more for entertaining purposes."}, {"rating": "8", "text": "With It's amusing acting from It's brilliant (and unique cast) and a story that actually brings \"The Purge\" to a greater height, The Purge: Anarchy finds James DeMonaco creating a sequel that succeeds as a definite improvement over the original."}, {"rating": "1", "text": "It may seem like all i write are bad reviews, but I feel good movies speak for themselves but people NEED to be warned about awful ones - LOL. That being said, this sequel is god-awful.  I really enjoyed the first Purge movie but out of the 5 \"lead\" characters, I was rooting for four of them to get their heads blown off so I didn't have to listen to the drivel they were spouting throughout the movie.  WAY to much is going on in this flick. There is the 5 main characters \"fighting\" to survive, the government conspiracy, and the underclass rebellion.  The rebellion story is so unnecessary and I knew that ultimately they would save the day for our characters. boring and predictable.  Why do these characters feel it is necessary to try to talk about moral issues as they are \"slinking\" through the streets trying to \"survive\".  Even tho the one enjoyable lead (the guy who was out to actually do some Purging) tells them to shut up repeatedly they blabber on endlessly trying to convince him to be a good guy making a lot of noise along the way giving away their location repeatedly to the bad guys.  The teen age daughter was SOOOO annoying.  Really disappointed in this sequel.  Hokey, bad dialogue, bad confusing plot.  But the worse sin overall was it was really really BORING"}, {"rating": "7", "text": "Definitely a better picture in comparison with the first Purge movie! It has an ok characters, an interesting plot with well done ending! Its flaws aren't substantial enough to bring it down"}, {"rating": "5", "text": "\"The Purge: Anarchy\" 10 Scale Rating: 5.0 (Mediocre) ...\r The Good: Frank Grillo carries the film and is the only character worth watching. His story is actually somewhat interesting and he's a complete badass. Aside from him, there are a few poignant scenes that were well done and provided solid social commentary. The decision to show what happens during the yearly Purge at the street level, was a good idea. The ending was decent enough though, and it was clearly a better film than the first.\r The Bad: While showing the Purge in the streets as opposed to the home invasion of the first film was a good idea, it degenerates into pretty standard fare pretty quickly. Aside from the few aforementioned scenes, there is nothing that we haven't already seen several times before in better films. With the exception of Grillo's character, I didn't care about anyone else as they were one-dimensional and uninteresting. It really didn't matter to me who lived and who died. Lastly, as our group of survivors went from one safe place to another, strange and outlandish things seemed to always happen. This got old pretty early."}, {"rating": "0", "text": "Worst movie EVER. boring and unrealistic it is true big screen crap. very stupid concept with even stupider execution. Feels like the twilight of “What if?” scenarios."}, {"rating": "8", "text": "“Just remember all the good the purge does.”\r Some purge for money, some purge for revenge, and some just purge for the fun of it. Whatever it is one is purging for, one can’t help but be drawn to this crazy and maniacally satisfying cinematic story concept.\r Stock brokers hang from the front doors of banks, people are killed for being caught cheating on their spouses, and those with repressed feelings are all questioned as to why they are out on the one night of the year where all crime, including murder, is legal in 2023 America.\r The Purge: Anarchy is story-telling brilliance. Outdoing its predecessor in narrative, character building and spectacle, the sequel reveals the many questions audience members were thinking during The Purge. Such questions include; what happens to people who are caught outside unwillingly on the streets on the scariest ‘holiday’ in America, what happens to the people who cannot afford to protect themselves the same way the rich can, and just how far are good people willing to go for vengeance?\r Unlike the original Purge, director/writer James DeMonaco decides to do what every good director would have done with a story idea like this, and that is multiple-character narratives that eventually intersect.\r As the evening is coming to an end and the 12 Hour Purge period begins, the world that DeMonaco created does not seem as far away from our own as we are introduced to an array of different relatable characters. Single-mother Eva (Carmen Ejogo) and her daughter Cali (Zoë Soul) along with her ailing father Rico (John Beasley) are a hard working family. Eva, who works as a waitress at a local diner in the projects of Los Angeles, asks her boss for a raise on the eve of the Sixth Annual Purge that will help with her father’s piling medical bills. Denied, Eva makes her way back home to lock-down her little apartment with very little means of security. Meanwhile, on the other side of town, Shane (Zach Gilford) and Liz (Kiele Sanchez) are having their own problems in their relationship, as well as being following by a gang of anxious masked maniacs who follow them upon learning that their car is stalled on the side of the road due to ‘accidental’ mechanical problems. Both pairs of people, unprepared and scared of participating in the purge, try to survive the night on their own, until they luckily stumble across the Sergeant (Frank Grillo), a man who is justifying his night by killing the man who took his son away from him.\r Hours before the annual commencement, people flood the streets, searching for last minute ‘protection’ from their partners, their bosses, their disgruntled family members or friends and say goodbye with the words, “stay safe”. They treat the purge as a holiday; some as a patriotic day of cleansing, others as a religious right of passage. Some call it “releasing the beast”, others refer to it as “enjoying the cleanse”, but one thing becomes clear, it reminds us of the crazy times of the year where people are uninterested in your feelings or concerns, a time that could be compared to the holidays, where the ‘dog-eat-dog’ attitude of people becomes ever more apparent. Purging could easily be compared to practically every holiday we experience where people are animals on the road and on the streets, but perfectly behaved citizens in their homes and within the walls of church halls and religious centres and perfectly adequate images in social settings.\r I believe DeMonaco has crafted a story idea and made a film that is a lot deeper and more complex than people would like to admit. After all, the film is a free-for-all excuse to have people watch just exactly what people are thinking of doing to others that hurt them, without ever getting their hands dirty. Anarchy really goes with the idea of what people would actually do if that little thought in their head of killing their boss, could actually be materialized in the real world, without any consequences.\r In addition, Anarchy shows the very faint hints of social, racial and economic inequality that is plaguing DeMonaco’s America of the future. Unemployment is less than 5% and poverty is at 1%, and the purge is to thank for this tremendous social statistic, yet, the rich hide and buy their way to an American tradition of cleaning through their heavily-secured houses while the poor help deliver homeless people, hostages found on the street and ‘martyrs’ who offer up their bodies as a bloddy canvas for rich families while their next of kin receive momentous amounts of money. In any direction you put it, the ones who suffer the most are the poor and lower class, and Anarchy spends most of its time showing this obvious and super disturbing truth of an American society whose idea of ‘cleansing’ is no different than the idea Adolf Hitler had in the 1930′s."}, {"rating": "6", "text": "Definitely better than the first film as it isn't restricted to just a single house for the setting. However, that's the only real improvement this sequel offers. While the bigger setting did allow for more entertainment than the first film, there weren't very many new elements introduced. Sure they tried to throw in some new interesting scenarios here and there, but none of them were particularly memorable. As for the cast, Frank Grillo delivered a rather solid lead performance. The only annoying and unlikable protagonist in this one was Zoe Soul's character. Overall, it managed to entertain while it lasted and easily outdid its predecessor, but it wasn't exactly a game-changer if you know what I mean."}, {"rating": "7", "text": "Muy entretenida pelicula. con accion, sangre , gritos  de todo un poco. una pelicula quepodras disfrutar con palomas solo el final si le faltaba o esperaba mas."}, {"rating": "7", "text": "A major improvement on the first purge movie where it is way better, interesting and very intense. Despite also some predictable plot twists all the way through, it deserves credits."}, {"rating": "9", "text": "A hybrid of violent thrill and political message, Anarchy is a refreshingly intelligent horror movie. By drawing the action onto the streets and through a range of environs, the sequel covers most of the wasted potential of its predecessor.  Though a horror, Anarchy avoids tacky, dull torture porn and instead relies upon its multitude of creative villains, superb slow-motion camera pans, tense atmosphere and sudden shocks to make the audience jump.\rThe film’s political message is thinly-veiled: references to the (new) Founding Fathers, love of guns, religion and the connection between these abound. On the streets villains brazenly “open carry” while the ultimate villains hunt their “purges” in the safety of their mansions.\rRealism does take second place in favour of grotesque caricatures of American gun culture, but this is hardly grounds for criticism of a horror film.\rThe film does have its problems: there is the odd cringe-worthy forced line and there are some noticeable loose-ends, but these do little to upset the film’s neat balance between entertaining thrill and intelligent parody."}, {"rating": "10", "text": "If I could sum this movie up into one word it would be \"Phenomenal\"!!!!! I just finished watching it and I will first say that I loved the first movie a lot but the sequel kicked everything into gear 100% more then the original. The story was better it focused on five individuals coming together to survive the night and being centered on Frank Grillo as \"Sergeant\". The action was Top-Notch with Tons and Tons of violence which I absolutely love. I must add that them taking the movie to the streets did it wonders and I don't ever jump in movies but there were one or two jump scares. The acting was very good but obviously the star was Frank Grillo who kicked Ass in acting and just being Awesome. I will say overall that this is a must see movie especially if you liked or loved the original then go see it Immediately and you will not be disappointed I promise you that. The best horror/thriller movie I have seen in a long long while."}, {"rating": "8", "text": "This movie was much better than the first. I don't understand why its getting as much hate as it is. Don't get me wrong, The Purge: Anarchy is far from amazing but it deserves more credit. This is what the original Purge should have been like. If you liked the concept in the first but hated the movie, I recommend seeing this."}, {"rating": "7", "text": "The Purge: Anarchy may not be amazing, but it's a huge step up from the first movie. The Purge: Anarchy focuses on 5 characters. The first two are a couple named Shane and Liz who are driving to one of their sister's house in Los Angeles to wait out the Purge when their car is sabotaged and breaks down in the downtown area.  Meanwhile, police sergeant Leo Barnes goes out into the streets to get revenge on the man who killed his son. The last two are a mother and daughter, Eva and Cali, who are rescued by Leo after a group of men breaks into their house and attempts to kidnap them. The five people meet up and attempt to survive the night together. The concept of this movie is great, meanwhile the movie itself doesn't execute it as well as it should. The plot is pretty interesting including a lot more thrill than the first movie. The people purging are more exciting and although it doesn't give a lasting scare, this movie still does have some good jump scares. If you liked the first Purge movie or thought it was okay you will enjoy this movie. Don't expect too much, but the concept and the plot of this movie are very interesting to watch."}, {"rating": "7", "text": "Thank god, this film, unlike the first atrocity, captures what the purge actually is and keeps you ready. Although at times there are so obvious moments most of the film keeps you second guessing until the final moment. I hope to see a third film similar to this and not like the first one. 7/10, Better than the original, intense, more story driven and epic."}, {"rating": "8", "text": "Honestly I'm just sick of dusty hating every movie. Everytime I like a movie he posts screenshots of metacritic scores and tries to demean me for liking it. If Chris likes it then it's a good movie."}], "recommendations": ["the_purge", "28_weeks_later", "the_forever_purge", "the_purge_election_year", "escape_room", "contagion", "greenland", "children_of_men", "sas_red_notice", "unfriended_dark_web", "brightburn", "how_it_ends", "vivarium", "the_first_purge", "knock_at_the_cabin", "limitless", "code_8", "paranormal_activity_the_marked_ones", "repo_men", "unfriended", "assault_on_wall_street", "olympus_has_fallen", "colossal", "eden_lake", "downsizing"]}