{
  "id": 2780,
  "title": "The Muppets",
  "starring": [
    "Jason Segel",
    "Amy Adams"
  ],
  "runtime": 103,
  "genre": [
    "Comedy",
    "Music"
  ],
  "description": "When Kermit the Frog and the Muppets learn that their beloved theater is slated for demolition, a sympathetic human, Gary, and his puppet brother, Walter, swoop in to help the gang put on a show and raise the $10 million they need to save the day.",
  "releaseYear": "2011",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rsNbxonO8gtylIXwiv7JeqwJ4Kb.jpg",
  "categories": {
    "plot": 8.789473684210526,
    "acting": 9.2,
    "ending": 8.8,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 9.025,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "As musicals tend to be, it was cheesy and over-the-top, so if you're not into that, maybe you wouldn't like this movie.  I, however, am a big fan of both the muppets and cheesy musicals, so I LOVED it.  We were smiling and laughing the whole time.  I think this movie is great for kids and adults alike.  We just went last night, and I already want to see it again.  I will definitely be purchasing the DVD.  The plot is fairly similar to the first Muppet Movie, but I found that to be a good thing, because it was as if it was paying homage to it.  The new songs are pretty corny, but fun and enjoyable (and will get stuck in your head), and it was really nice that songs from the Muppet Show were used.  I would highly recommend going to see this movie...especially if you've ever been a muppet fan."
    },
    {
      "rating": "8",
      "text": "As somebody who enjoys Root Canal surgery more than an episode of Glee, the dancing and cavorting was a bit sugary. But who cares? The Muppets are back! And not 'back' like they were in the late 90s (Muppets from Space), this time it's actually polished, and funny. Really funny.\r If you enjoyed the Muppet Show in your youth, see it."
    },
    {
      "rating": "9",
      "text": "As a fan of the Muppets since seeing reruns of The Muppet Show, I have been wondering when the Muppets would return with a movie that could actually be seen in theaters instead of the odd assortment of straight to dvd releases. My worries were put to rest when Kermit the frog appears and the 4th wall breaking jokes began. It is a fun and harmless movie with an interesting ending. It definitely ranks up high in what the Muppets have done. The cameos are great, as well the writing. I hope that this is not the final movie for the Muppets anytime soon."
    },
    {
      "rating": "10",
      "text": "Being born in 1995, i missed out on a few things, The Super Nintendo,the Golden years of The Simpsons and The Muppets. I was a huge fan of The Muppets when I was younger even though there glory days were over. I used to rent out old tapes of the the Muppet show constantly and I would watch any of The Muppet movies whenever I could. So when I heard The Muppets are coming back and Jason Segal is writing and starring in it I was litterally blown away. If this review seems biased I'm sorry.They'res grat acting all round from both humans and Muppets. the jokes are fresher than ever and the celeb cameos are hilarious. Kids will love the muppets and the childish humour and adults will be covered from head to toe in Nostalgia and celebrity cameos, this movie is for everyone."
    },
    {
      "rating": "10",
      "text": "While I've always like the Muppets, the three movies I've seen them in before (Muppet Christmas Carol, Muppet Treasure Island, and the Muppet Wizard of Oz) didn't really feel memorable. This movie however, gives the Muppets a much needed revival, and I'm proud to say, I was very satisfied! Great songs, lots of laughs!"
    },
    {
      "rating": "8",
      "text": "I had a great time along with all the other folks in the audience reliving their youth through the magic of the Muppets.  The story isn't Citizen Kane, but it's all heart, and that's what matters most with The Muppets.  Thanks Jason Siegel for bringing these guys back into the pop culture zeitgeist.  The Muppets is for the kid in all of us.  Another afternoon of splendid entertainment."
    },
    {
      "rating": "9",
      "text": "Good job. I was shock . This movie was really good. I love this movie now. I didn't expect this movie to be good at all. I was expecting some crappy movie. One of the best movies of the year. Best muppet movie. A great kids and family movie. A movie that every one will enjoy."
    },
    {
      "rating": "9",
      "text": "Believe it or not,, this is one of the best movies of the year. The simplistic plot works so well, even though you've seen it in dozens of other movies. What makes this movie work so well is the humor and the character development. Yes, character development for puppets. They do feel like real people with real emotions, not just fuzzy little animals. Whatever your age, whether you grew up with the Muppets or not, you will love this movie."
    },
    {
      "rating": "8",
      "text": "No, it is not Sunday morning. But it is time to play the music, it is time to light the lights. Here they are! Kermit and the whole gang are back! The Muppets are carrying one last show to raise money. In order to maintain their studio before the evil oil tycoon shatters it down. There is only one problem. Have they been forgotten? With the real world reflects just like the story in thiz movie, since the very first stage of movie-making process, thiz movie was way underrated. People keep asking, did thiz movie will actually work? Anyway, look how well the movie is doing now. The Stars sparkle all over the place. The famous frog Kermit, Miss Piggy, Fozzie Bear, Gonzo, Scooter, Animal and other members of The Muppets, can bring the hilarious atmosphere instantly, including the new introduced character, Walter. Jason Segel proves out to be surprisingly talented with his energetic singing and dancing. ENCHANTED (2007) princess Amy Adams is a brilliant choice for her role, she is an unarguable Disney princess figure in human form. The bad guy looks cynical and funny at the same time, played very very well by Chris Cooper. Not to mention, it is featuring endless Celebrity Guests such as Jack Black, Emily Blunt, Zach Galifianakis, Whoopi Goldberg, Selena Gomez, Ken Jeong, Sarah Silverman, Neil Patrick Harris, John Krasinski and even Dave Grohl from FOO FIGHTERS. James Bobin made his directorial debut through thiz movie. The songs are part of thiz musical extravaganza. The singles like LIFE A HAPPY SONG, ME PARTY or MAN OR MUPPET are one of the best moments. The ending scene is effective (Spoiler Alert!). When is told that they have finally got the appreciation and applause from millions of people outside the studio. It is simply to say, we could have happy tears along. It is not just about the Muppets anymore. But it is also about every one of us who have grown up with these guys. Whether we realize it or not, in that very moment, we had a sort of feeling, it was like we looked back the years we had been through and we suddenly realized how much we had already changed. The innocent world that we once had is exist. The Creator Jim Henson must be proud of what they have done. Thanks, guys. Thanks for bringing us the third greatest gift of all, which is the laughter! When they do, they have got the whole wide world in the palm of their hand.Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "8",
      "text": "The Muppets is cheerful and sweet. Classic and it's about nostalgia! As new generation of Muppets, we could still the heratwarming atmosphere. Kermit and the gang and also the human itself deliver a very good performance, humanist."
    },
    {
      "rating": "6",
      "text": "Nice entertaining movie, easy scenario, no much events, quick songs, muppets are the main actors. If you need a relaxation that keeps you away from too much thinking, this movie is the best. It is convenient for all ages, somewhat boring if somebody is expecting more than pass time."
    },
    {
      "rating": "9",
      "text": "This movie has possibly made me the happiest I've ever been walking out of a movie theater. It's funny, heart warming, and plays off of well established cliches beautifully. This is a pitch-perfect movie, both a love letter to the Muppets and their fans, as well as a very funny movie in its own right with a load of in-jokes and self references that are surprisingly funny, considering I usually find that kind of stuff annoying in many movies. Easily one of my favorite movies of the year."
    },
    {
      "rating": "9",
      "text": "I loved this movie!  It had my g/f and I laughing throughout.  A typical plot with a not so typical ending which put me in my cynical place!    Some funny moments in between the HILARIOUS moments.  I loved the muppets as a kid and always wanted to be a muppeteer, so seeing the love that Walter had, as well as the obvious appreciation that Jason Siegel has for the muppets, it was truly the first Muppet movie worthy a Jim Henson name since his passing.  A great movie with the significant other, or with the kids."
    },
    {
      "rating": "10",
      "text": "I have no idea how its humanly possible to write a bad review for this movie. I love the Muppets. This movie was fun, inspiring, filled with great messages, and it is absolutely hilarious. Jason Segel did a more than amazing job writing and starring in this film. He did the classic Muppets justice in this new, hilarious entry into the Muppets excellent line of movies. You must see this movie whether your a muppet fan like me or no. You will be rolling on the floor laughing, i promise. One of my favorite movies of 2011. 10/10 without a doubt"
    },
    {
      "rating": "10",
      "text": "The Muppets are a part of America's richest history. They will always be loved by millions and be cherished for a long time, and I am glad they came back after those long muppetless years, and with such power too. This movie is probably actually my favorite muppet movie ever. The muppet charm we all love was deeply felt and greater than ever. Not only was Jason Segal and Amy Adams amazing additions to the gang but Walter (the cute 3-foot tall brown haired die hard muppet fan) was also a charming little muppet that was added to the gang. But as always, Kermit, Animal, Fozzie, and the rest of the gang really played a big part in the making of the joyful feeling that only the muppets can give. Awesome storyline also gave this movie its delightful mood. The way it fits it's awesome guest stars including Jack Black, Whoopi Goldberg, and Zach Galifianakis. The way it fits all the gut busting jokes that adults can even laugh too, and hard. Sweet musical numbers and even a little drama make this movie great. This will go down as mine and a lot of other peoples favorites for along long long long long long time. It's time to play the music. It's time to light the lights. It's time to bring the muppets back, and make the world bright."
    },
    {
      "rating": "8",
      "text": "You can't help but smile during this entire movie. The humor is really light and cute, it's something for the whole family."
    },
    {
      "rating": "9",
      "text": "A good spirited film, with a lot of heart. Perfect for the little ones. Though it's also clever and witty, and I think adults will thoroughly enjoy it as well. Adorable."
    },
    {
      "rating": "9",
      "text": "If you are extremely familiar with the original Muppet's show from the late 70s-80s, then you are going to adore the latest Muppet film. The Muppets contains familiar flashbacks and moments we remember from Kermit and the gang, including a cast of celebrity cameos, and the witty comedy that we always loved from the Muppets.This movie was really funny and also had a lot of heart, which left me happy after the film was over. Is it the best Muppet film? Close, but not really. A tie between A Muppet's Christmas Carol and Muppet's Treasure Island will always be the superior films from the Muppets. I do admit that some sequences got a little too campy (though it didn't lasted too long) and the beginning of the film was too fast paced with it's storytelling. Other than those minor critiques, The Muppets is a must watched film for witty audiences and Muppet fans alike. You will not be disappointed!"
    },
    {
      "rating": "10",
      "text": "I can not tell you all how much I love this movie. The Muppets are back, and almost better then before. I was laughing every minute. It had so many good homages to the original movies, like the first big Muppet movie \"The Muppet Movie\" when they accidentally ditch the big brown Muppet at the car sale. It also has many good popular culture references, and fresh new jokes. Anyone who's ever seen a Muppet movie needs to see this. Even if you didn't even know who the Muppets were before this, you still need to see it."
    },
    {
      "rating": "8",
      "text": "The Muppets may not be the big thing that they were in the 80's, but this sequel / reboot is one of 2011's most charming movie! Surprising turn by Jason Segel in writing and acting on what is essentially a kid's film. Amy Adams is her usual, great self.  Chris Cooper is surprisingly good as the evil oil baron ('maniacal laugh'). Best of all, The Muppets are great!!"
    },
    {
      "rating": "10",
      "text": "This was a sweet and brilliant movie. It had all the old school Muppet charm teamed with some great new characters and great new music. It put a smile on my face from the first frame to the last."
    },
    {
      "rating": "10",
      "text": "This was a GREAT movie. We laughed through the entire thing. For me the nostalgic appeal was a big part of what made it so great, but my kids (10 and 13) loved it just as much as I did. Definitely one of the best movies I've seen this year."
    },
    {
      "rating": "8",
      "text": "The muppets has been off the radar for so long that most has forgotten that they are the funniest gang to be around with. This reboot has reminded us that the Muppets are still fun. The plot of the movie is as simple as it comes, but this is where the muppets are playing at their strengths. The muppets are weirdos give them something simple and they run with it.  This movie has the exact right tone, and its one of the most fun movies I've watched in a long time. The muppets are mostly useless and that's what's great about them, you just have a blast watching them fail in their \"talents\" in the most charming of ways. Although the cameos are nothing compared to those of the original show, they are still additions which add on to the fun on screen."
    },
    {
      "rating": "9",
      "text": "We tend to look at the past as something better than it really was. But we know how remakes usually end up like. This isn't a remake though. I love the retro feel, and the quick-fire jokes (Ted Conference attending, google employee Scooter). Although it seems this is why we have ADD. Some of the jokes toward the end of the movie were just going by too quick. Sure it was hectic for the Muppets, but it shouldn't be for us.This is one time we can say something was better than the original. With Kermit asking for President Carter, and the Ms. Piggy disco sound, It seemed the movie didn't take itself too seriously with the self-deprecating humor and all. It seemed they were trying to say t\"yes we are out of touch!\" I was too young to remember growing up with the TV show, but old enough to remember the cartoons, and the re-runs. I've been waiting for this movie, and it didn't disappoint."
    },
    {
      "rating": "10",
      "text": "What a beautiful piece of heartwarming artwork!  I cried and I love when a movie makes me cry.  I was engrossed the whole time.  I'm so happy that there are artists out there capable of creating this kind entertainment."
    },
    {
      "rating": "10",
      "text": "This movie had me leaving the theater with a giant smile on my face...mission accomplished. I loved every moment, it's classic Muppets humor with a modern twist. They do hardcore Muppets fans a solid with this film, and they don't disappoint non-hardcore fans. great for kids and great for adults!"
    },
    {
      "rating": "9",
      "text": "I don't say this too often about any movie, but this is one of the few where if you do not enjoy it, you simply have no soul. \"The Muppets\" has to be one of the happiest movies I have ever seen. The musical numbers are brilliantly written and every one of them has this infectious energy that never fails to put a huge grin on your face. The movie also has its fair share of laughs. I particularly enjoyed all of the 80s references to \"The Blues Brothers\" and \"Indiana Jones.\" There's maybe one area in the middle where the simplistic story starts to drag it down a bit, but then Amy Adams and Miss Piggy sing an hysterical duet that brings the movie back up, and from there, \"The Muppets\" sails into magical bliss. I'm recommending this to anyone who likes to feel happy. If you're soulless and only enjoy movies that make you feel depressed or angry, stay far away."
    },
    {
      "rating": "8",
      "text": "This is a fun movie for all ages. Songs like \"Life's a Happy Song\", \"Picture in my Head\", and \"Muppet or Man\" are all fun and catchy songs. (They can be nominated for the Oscar song category.) Chris Cooper seems to be having fun playing an evil character in a family movie. Jason Siegel and Amy Adams are both perfect in their roles. The muppets are cute. I thought it was interesting that I saw this movie in an afternoon on Thursday and there were about 6 people in the showing. None were children."
    },
    {
      "rating": "8",
      "text": "Has Jason Segel succeeded in creating a classic Muppet film for a new generation or is â"
    },
    {
      "rating": "6",
      "text": "The reboot of the muppetsâ"
    },
    {
      "rating": "10",
      "text": "Loved it from start to finish. Exceeded all expectations and was impossible to leave the cinema without a smile on my face. Still singing the songs and laughing at the jokes months after I watched it."
    },
    {
      "rating": "7",
      "text": "Decently entertaining flick. While I do not think this is a straight out kids film, it does tend to be for the fantasy driven audience (there are some musical parts, dancing, and singing). Jason Segel does an admirable job in The Muppets and made it enjoyable for even adults with his humor. Cute movie and highly entertaining."
    },
    {
      "rating": "9",
      "text": "Somehow Jason Segal and company find a way to cram all of the old Muppets nostalgia in there, pack in more cameos than you will even remotely realize, and somehow find time to fit new material in there.  The story is solid, the musical numbers are excellent, and the jokes fall perfectly in line with old Muppet affairs.  A great movie for a family to enjoy."
    },
    {
      "rating": "7",
      "text": "before i watched this movie, i heard about how fun it is. And ofcourse, I totally agree about what people said. Thanks to my moviefriend for recommended this :*"
    },
    {
      "rating": "10",
      "text": "Well, I have to give him credit; Jason Segel has managed to capture the sweet, gentle, charming, but ironic tone of the Muppets.   For at fan like me who grew up, first with Sesame Street and later loved The Muppet Show this was a trip down sentimental movie lane.  And it has the Rainbow connection, to quote Kermit YAAAAAYYYYYY!!!For full review go to:  http://badmovielover.blogspot.com/2011/11/muppets-or-man-i-miss-jim-hensen.html"
    },
    {
      "rating": "7",
      "text": "This is a fantastic homage to the spirit of The Muppets which gave me and countless others so much joy growing up. It's 100% cheesy, musical, family entertainment but even though I usually give such films a wide berth I was happy to sit through this movie and I'll do it again when it comes to blu-ray. It's hard to fit every old Muppet sketch into the restrictive 90 minute time slot so I understand why some old favourites get little to no proper screen time, but I'm glad they at least used some old jokes to jog the nostalgic memories of us grown-up fans while still dedicating sufficient screen time to the new story to make this worthwhile for a new generation of kids who might have no existing attachment to the franchise."
    },
    {
      "rating": "10",
      "text": "It is the Muppets. Itsâ"
    },
    {
      "rating": "10",
      "text": "It's been twelve years since the Muppets have been featured on the big screen, and with their last adventure (Muppets From Space) resulting in commercial failure, many have questioned whether the characters should be given another shot. I'm pleased to report that the answer to that question is a resounding \"yes.\"Â"
    },
    {
      "rating": "8",
      "text": "the movie was pretty good. i laughed about 100 times. as always the songs were really good. i laved Man or a Muppet. i loved Amy Adam and Jason Segal. they did great."
    },
    {
      "rating": "9",
      "text": "I love this movie. It was much more funny than I expected, and I expected it to be pretty funny. Fans of the old show should be very satisfied, and children should be, too. The only thing I did not like was the parts where they sang. I don't like musicals. However, some of the songs were decent and catchy, and there was a lot of humor, both visual and lyrical, within them. I think this is the perfect movie for the whole family."
    },
    {
      "rating": "10",
      "text": "I expected to like this movie, I did not expect to LOVE it.  But I did!  You can't help forget that the Muppets are being controlled by people, and are not real.  The puppetry is just spectacular.  Amy Adams was adorable as always, and Jason Segel was great as well.  Cameos for days too, I won't bother mentioning all of them.  Great movie!"
    },
    {
      "rating": "7",
      "text": "I was curious why this movie got all those positive reviews and this high imdb score. As it turns out this film is not too bad as they poke fun at their own modern day unpopularity and they mock the formulatic nature of their own film story. It's a very happy-happy feel good movie and there is some singing and dancing but it's rather fitting for a muppets movie and it's well done. So I can recommend this movie if you've seen the muppet show as a child and want to rediscover cudely legends like Miss Piggy, Animal, Camilla the Chicken, The Swedish Chef and Gonzo."
    },
    {
      "rating": "8",
      "text": "While you have to constantly remind yourself that this movie is meant for children, The Muppets is cute and funny, with plenty of one-liners and wit from Jason Segel's smart script."
    },
    {
      "rating": "10",
      "text": "After years away from the big stage, Kermit the Frog and friends are back with \"The Muppets,\" a wonderful return to form for the classic franchise. It's funny, it's well-acted, it's heartwarming, it's wonderfully-written, and most importantly, it's a lot of fun. What more could you ask for out of \"The Muppets?\" Whether you're a longtime Muppets fan or a newcomer to the series, \"The Muppets\" is a fantastic film that you can go wrong with. Go watch it now!"
    },
    {
      "rating": "8",
      "text": "The Muppets was an unexpected return to form for one of the most long lasting children's programs and film franchises. The Muppets introduced themselves once again to a younger audience. The story kept it simple but the story was very well written. Jason Segel co-wrote the script and starred in the film but I never felt like he was trying to steal the spotlight from the real star, Kermit the Frog. Kermit is once again a character that everyone loves and the same goes for his fellow Muppets. There are even a few new additions to the group that make their presence felt. The Muppets is a funny children's film that is guaranteed to impress old fans and fans from a new generation."
    },
    {
      "rating": "10",
      "text": "The Muppets is colorful, funny and has great music for give terrific entertainment for any kind of audience. It also has unofrgettable story-telling and breathtaking characters. This is not a classic, but Disney made a great election in take this film in the company. The Muppets are back on TV!!"
    },
    {
      "rating": "10",
      "text": "The Muppets is extremely heartwarming and funny, charming and just innocent. It features lovable performances from the whole cast with some great musical numbers. I give this movie 99%."
    },
    {
      "rating": "9",
      "text": "This movie made me laugh so hard. If you grew up with The Muppets you will love this movie if you never seen the muppets you wont really get the humor. It has funny jokes and hilarious songs. I almost peed my pants with the Im a Man or a Muppet song.The only thing I have to criticize was at the ending( no spoilers) Selena Gomez is in it a brief and I was like NO NO NO GO AWAY she should of honestly not been in the movie like keep older actors. Other then that this was one of my favorite movies this year TBH."
    },
    {
      "rating": "10",
      "text": "This movie is exactly what it sets out to be.  It's fun, carefree and has a great message about family, perseverance, and has some really touching moments between pieces of felt.  I felt a little silly tearing up at one point because it's a Muppet movie but it did a great job of bringing the Muppets into a new century.  It reminded me of a Pixar movie in that it is just so pure in what it seeks out to do and has such a simple message but it's executed so well.The only issue I had with the movie is that they break the fourth wall a couple too many times for my taste.  It's a small gripe but seem like it happened too many times."
    },
    {
      "rating": "8",
      "text": "Before I watched this movie, I was expecting something like \"The Smurfs\" or \"Garfield\" you know, movies that I can mock and throw in 3's and 4's into my reviews. \"The Muppets\" are pretty much in the same structure with both humans and muppets on screen with a cheesy 1950's musical look. But the core of the movie, where like \"Toy Story 3\" the muppets realized they aren't the star anymore, is actually entertaining with plausible laughs and recalls sad memories of the old age muppet shows."
    }
  ]
}