{"id": 2053, "title": "The Mauritanian", "starring": ["Tahar Rahim", "Jodie Foster"], "runtime": 129, "genre": ["Drama", "Thriller"], "description": "The true story of the Mauritanian Mohamedou Ould Slahi, who was held at the U.S military's Guantanamo Bay detention center without charges for over a decade and sought help from a defense attorney for his release.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/lIADEa6oH74uUapjsPbNRzxus8M.jpg", "categories": {"plot": 7.823529411764706, "acting": 8.05, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.0}, "reviews": [{"rating": "7", "text": "Well, this is a pretty formulaic film, but very effective nonetheless. Director Kevin Macdonald stands up for Mohamedou Ould Slahi's terrible experience with a movie that doesn't fear walking into dark territory. Of course, Tahar Rahim is the best part of it. His interpretation of the stoic man deserves an Academy Award nomination."}, {"rating": "10", "text": "As real and humanizing as it gets despite how many people would not dare to face the facts."}, {"rating": "8", "text": "Desde \"The Silence of the Lambs\" não tem como não se arrepiar quando vemos Jodie Foster caminhando por corredores de uma prisão. Em \"The Mauritanian\" vemos ela com o mesmo fogo nos olhos, mas, diferente do clássico supracitado, aqui temos alguns deslizes oriundos de escolhas da direção. Algo que um Tahar Rahim fantástico te fará esquecer rapidamente."}, {"rating": "7", "text": "This meticulously detailed account of the erroneous 14-year Gitmo incarceration of Mohamedou  Ould Slahi, who was falsely accused of being the chief recruiter for the 9/11 terrorist attacks, exposes the sloppy, exasperating investigative tactics of a government more concerned with convicting someone than serving justice and finding the truth. Director Kevin Macdonald's thorough treatment of the subject clearly reflects his scrupulous proficiency as a predominantly documentarian filmmaker, exposing the cruelty of officially sanctioned interrogation atrocities and recognizing the efforts of both government and legal crusaders who fought to bring them to light. As noble as that intent is, and as infuriating as the film's reprehensible revelations are, however, \"The Mauritanian\" is a little too \"clinical\" and a bit overlong, periodically becoming mired in excessive legal wrangling that waters down the emotional impact of the narrative. Some judicious editing and a less conventional approach to the material would have strengthened this offering, making its story and insights more compelling. To its credit, the film does make its point, and its superb performances by Tahar Rahim and Jodie Foster are worthy of all their accolades, including two deserved Golden Globe nominations. However, for all its precision and concern for detail, the picture fails to evoke the kind of rapt engagement from viewers that material like this should strive for. A credible attempt for sure, but one that, with some retooling, could have been better."}, {"rating": "10", "text": "I didn't know anything about the story and suddenly I bought the ticket.  I have seen a lot film and in my opinion it's the best film in 2020 and 2021 till now ! I just shocked by this true story and performance of Tahar Rahim.  I can't stop thinking about it , it had some problems but it had so much more great points that made me ignore little problems!"}, {"rating": "8", "text": "I was able to qualify for an advance screening of this important film.  The true story of a man who was unfairly incarcerated in Guantanamo for circumstantial evidence then coerced into a confession is tightly written.  The acting is superb, including the amazing Tahar Rahim in the leading role.  The only warning:  Some parts of the film are very difficult to watch, but necessary to tell the story.  This film really does tell a story that must be told."}, {"rating": "10", "text": "Wonderful and eye_opening film,  just cant believe that is a true story.  !!!"}, {"rating": "8", "text": "This provocative film is based on \"Guantánamo Diary\" by Mohamedou Ould Slahi. In reaction to 9/11, he was whisked away from his home and imprisoned in Gitmo without any charges. Jodie Foster plays the attorney who volunteers to argue the habeas corpus case against the military prosecutor (Benedict Cumberbatch). Tahar Rahim is cast in the role of Slahi and his creation is warm, sympathetic and resilient. Foster is compelling with calm determination, while Cumberbatch (with a gravelly voice and Southern accent) handles his stance with conviction. Considering that most of this narrative involves lots of research sequences and brief interactions with Slahi, it could have been dull and dry. With the excellent performances and Kevin Macdonald’s steady direction, the drama quietly gains momentum until the gripping final scenes. The inevitable sense of outrage is tempered by Rahim’s inspiring portrayal."}, {"rating": "0", "text": "Another garbage Hollywood movie. While these criminals are awaiting trial, they get fed, given a bed, let out of their cell everyday to play soccer, and materials to pray with. Meanwhile, Americans and other people around the world were being beheaded or burnt alive by the Taliban. But oops, this movie forgot to show you that part. They do mention 9-11, but they dont remind you of how horrible that day was with video or remind you of how many lives were lost. Oops again. They make you try to feel sorry for this guy, who has connections with the Taliban and Bin Laden. Sorry, but I do not feel sorry for him in the least.And Jodie Foster plays a lawyer that has been defending anti American criminals her whole career. What?? Why would she ever play a part like this? I have lost complete respect for her as an actress and will never watch another movie of hers again. Whoever thought this movie was a good idea should go join Bin Laden. So unless you hate America, the military, freedom, democracy, etc...you should skip this Hollywood garbage of a movie."}, {"rating": "4", "text": "Great acting, well filmed, but I have a hard time with the plot? Are we supposed to feel sorry for a man who definitely had ties to Al Qaeda? Who received a phone call directly from Bin Laden's phone? I absolutely agree that what he went through was unjust, and America needs to do better job, however it was no more unjust than what happened to the innocent victims better. The blame here belongs to Al Qaeda and bin Laden. This is what happens when you fly planes into buildings in one of the most powerful nations in the world; injustice. 911 is to blame for what happened to this man."}, {"rating": "2", "text": "(Mauro Lanari)Why should a director who debuted in 2006 with \"The Last King of Scotland\" be interested in Guantanamo in 2021, after the films of his other colleagues on the same subject, from \"Camp X-Ray\" (Sattler 2014) to the recent \"The Report\" (Burns 2019)? I have the impression that Macdonald wanted to move from denouncing human civilisation to prison movie as its cinematographic emblem, ultimately this would be the deepest meaning of such a genre, but he proves too little incisive both in the metaphor and in the transposition of the true story."}, {"rating": "8", "text": "Peace be unto you, Streamers! This weekend some new movies are coming at you that we've heard a lot of buzz about. I was able to catch an early screening of one I didn't know much about, The Mauritanian. Tahar Rahim and Jodie Foster were recently nominated for Golden Globes for their performances in this film, so there must be something here, right? Here's how I see it.A brief synopsis goes something like this: from the best-selling memoir \"Guantánamo Diary\" by Mohamedou Ould Slahi. The Mauritanian tells the harrowing account of Slahi, who spent years imprisoned at Guantanamo Bay without being charged, fighting for his freedom from captivity with the help of a dogged defense attorney, Nancy Hollander, and her associate, Teri Duncan. Slahi was accused, but never charged, of participating in the orchestration of the attack on the United Stated on September 11, 2001. Slahi and his attorneys have to fight the United States Government in order to uncover the truth about his imprisonment and eventually for his release, meeting multiple roadblocks and seemingly insurmountable odds.Kevin Macdonald directs what is ultimately a standard legal drama with only the added bonus that this film is based on a true story. The movie hits all of the beats of one of those legal dramas including an emotional courtroom speech. It's not too cliched, but it gets close. Macdonald uses flashbacks and Slahi's own words to depict his account of how he ended up at Guantanamo, which are the parts that focus squarely on Tahar Rahim as Slahi. These are the most emotional and engrossing parts. The other half of the movie takes place in the present day as Hollander, as played by Jodie Foster, navigates the complicated system that has held Slahi without charges for year. These parts are less interesting because from the outset of the movie the innocence of Slahi is assumed and all sympathies are with him. The United States Government is essentially our big bad villain in this story. That's fine for the hindsight of 2020/2021, but there must have been more moral conflicts at the time when these events actually occurred. Nevertheless, what Slahi endured was devastating and embarrassing for the world's leading democracy.On the performance front, Tahar Rahim is great in this film. I understand why the Golden Globes nominated him in the Best Actor race. He projects such sincerity and warmth. He also depicts the endurance and perseverance that must have been necessary for Slahi. I haven't seen Rahim in anything before, but he's one to look out for. Jodie Foster is also good as Slahi's lawyer. Foster has a competence and steeliness that this attorney would have needed. It must have been difficult walking into Guantanamo to defend an accused terrorist and Foster show the steadfast spirit of the woman who took this on. Even though the legal parts were less interesting to me, it does not take away from Foster's very good work throughout the film.The Mauritanian is a good movie. While one half of it is more interesting than the other, the interesting half is very much worthwhile and the less interesting half isn't dreadfully boring. On balance, I say it is worth a bowl of popcorn. Please be warned that some of The Mauritanian is not for the feint of heart."}, {"rating": "10", "text": "Such an amazing film with powerfull cast !! Its a sad story but at the end you will get a lot good vibes and inspiring feeling , i loved all characters and their acting and i felt all actors feelings , if you love this kind of film you shouldnt miss it ."}, {"rating": "10", "text": "Top movies in the world"}, {"rating": "6", "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."}, {"rating": "6", "text": "While the story needed to be told and I support them shining light on such events, the movie itself felt boring at times. I mean it had very great moments too, but such movies, to make them more widely popular and not only for people already interested in such topic, then it lacks something"}, {"rating": "9", "text": "This movie is abut the inconvenient truth we all should watch, acting is top notch and story telling is very good.  Its portrays how in hind-sight things look differently and how people get caught up in the moment and don't stop to think about their actions. Watching Reminded me of a documentary I seen, where the guards and interrogators at gitmo were interview years later; these individuals were jar-heads at best but never the less their sins were hunting them and will continue for the rest of their lives. Its a story of a herd mentality turned into mob rule enacted by the government."}, {"rating": "5", "text": "There is a great feeling of detachment between the story that is supposed to humanize its lead subject, and how this film is more interested in building its narrative as a thriller that seeks to manipulate the facts.The main actors, especially Jodie Foster, Tahar Rahim and Benedict Cumberbatch manage to keep you connected with the story, because otherwise there's very little that does justice to the true story from which this film draws its plot."}, {"rating": "9", "text": "Incredible Movie with splendid acting performance and storytelling One of the best biography movie I have ever seen"}, {"rating": "9", "text": "Amazing story, super sad and amazingly acted . Crazy what the American government got away with at Guantanamo Bay. I think all the low scores for this movie probably come from Bush supporters/ Stupid people although at the end it said  Obama continued some of it :("}, {"rating": "7", "text": "Jodie Foster & Benedict Cumberbatch do yeomans work trying to figure out if THr Rahim's character had ANYTHING to do with 9/11. I understand our government/military wanting to go the extra mile to extract the truth, but I was ultimately disappointed just to see how far we would go to get a false confession out of prisoner not explicitly charged with a crime."}, {"rating": "10", "text": "This movie just shows you the critics are politically motivated. Their rating is not objective, not even slightly. You can't watch this movie and honestly say it's bad.The movie is very well made. Watch it and be the judge."}, {"rating": "7", "text": "I will never forgive 9/11, but I can't believe that it was done in a law-abiding country. Jodi Foster is still amazing."}], "recommendations": ["just_mercy", "spotlight", "snowden", "patriots_day", "richard_jewell", "the_post", "the_imitation_game", "dark_waters", "judas_and_the_black_messiah", "the_reader", "race", "the_last_king_of_scotland", "hidden_figures", "12_years_a_slave", "free_state_of_jones", "zero_dark_thirty", "hotel_rwanda", "valkyrie", "dallas_buyers_club", "13_hours_the_secret_soldiers_of_benghazi", "munich", "darkest_hour", "miss_sloane", "the_hunt", "the_white_tiger"]}