{
  "id": 809,
  "title": "The Wolf of Snow Hollow",
  "starring": [
    "Jim Cummings",
    "Riki Lindhome"
  ],
  "runtime": 84,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A stressed-out police officer struggles not to give in to the paranoia that grips his small mountain town as bodies turn up after each full moon.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nXeTSXR5ryFwxrlpmD9hhXJTAuc.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.2727272727272725,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.916666666666667,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Only two years ago in 2018, writer/director Jim Cummings arrived on the scene with his blackly comic drama Thunder Road that done very well on the festival circuit and heralded a new voice for independent film. And the hype was real. It was a fantastic piece of work that finished in my personal top ten of that year. You could then say that I had high hopes for his next endeavour and I’m happy to confirm that The Wolf of Snow Hollow is on a par and cements Cummings as a filmmaker to watch. This time around, he shifts his attentions to genre horror but still manages to retain the humour that made Thunder Road so impressive. Cummings has a real knack for balancing tones and, once again, taking the lead role, proves he’s got the acting chops to flesh out his complex characters. This has, for obvious reasons, been likened to An American Werewolf in London, but that’s only in its premise and ability to entertain which is slightly unfair on Cummings’ work here. He’s a talent all his own. Huge fan of Thunder Road. Huge fan of The Wolf of Snow Hollow and a huge fan of Jim Cummings. Writing, directing, acting... it would seem that he has it all."
    },
    {
      "rating": "8",
      "text": "I was interested in this because I had heard that the Director’s, Jim Cummings, first and only other film, Thunder Road, was really good. After watching this film, I’m very excited to see where this Director goes in the future. The Wolf of Snow Hollow is a surprisingly funny and emotional film that is able to mix its horror elements, dramatic elements, and comedic elements almost perfectly together. I never felt as if a scene was undercut by a comedic line or anything else. Some of the jokes may not have been super funny but a lot of them definitely got a laugh out of me. The horror elements weren’t drop dead terrifying but they had a lot of tension and build up that made those scary moments effective and the dramatic elements hit really hard at points. Mainly with Robert Forster’s character but I think that’s because he passed away this time last year so it does feel a little somber. All of the performances here are great especially Forster and Jim Cummings. Each of their characters are mesmerizing and so fun to watch interact with everyone else. The script, also written by Jim Cummings, is great too and makes it easier for those elements to hit. On a technical level, the film has great editing, cinematography, and music. There are issues with pacing at points but it isn’t too major and the occasional unfunny joke or weak element doesn’t take away from the experience too much. If you are a fan of unique horror films or want a funny comedy horror film, then go check this out when you can."
    },
    {
      "rating": "8",
      "text": "I love this genre: the shoestring-budget rookie-director unknown-actors horror-comedy that doesn't take itself seriously, but none the less has some surprising writing and impressive acting. The lead guy is such a mess and still you can't wait for more of his on-screen time."
    },
    {
      "rating": "0",
      "text": "I'm pretty sure anyone saying anything positive about this film was on the crew or acted in the film.  It is just awful.  Someone gave cash to a Double Major in Cinema/Gender Studies and told them to run wild with it.  Possibly this was a grant funded film, cause it is hard to believe anyone would invest a dime into this trash.Every other line is a talking point straight out of the Intersectionalist's Playbook.  They basically skimmed Twitter and Tumblr and copied and pasted a lot of their favorite lines.  There is no such thing as subtlety in Hollywood anymore, but this film even does that a disservice.  Save your cash.  Watch literally anything else."
    },
    {
      "rating": "6",
      "text": "Quite the interesting experience of a movie and one I was not expecting. If you came to this movie blind, expecting a horror/thriller, you are also likely not going to get what you expect. The Wolf of Snow Hollow is a well directed and edited mystery, with fantastic sound, abounding misdirects, and a slew of dislikable characters.From the opening sequence to the final few minutes, almost every interaction is well presented as hints to solving the mystery that ultimately fall flat. Suspicious characters, the main character having incredible hearing, social dominance interactions; all ways of making you think the Wolf is the sheriff or his son or the lead lady, but it all leads nowhere and sputters out in an unknown villain. This movie comes across as a whodunit, but it most certainly is now.The messaging that is present throughout the movie, and I now find is even in the trailer, is extremely heavy handed. Humans are the real monsters created from anger, drinking, drugs, sex, abusive relationships, nepotism and some more subtle jabs at hidden ones like sexism. It's constantly there until the very end and even plays at undermining any kind of good value the characters may have. Alongside this is a presentation of the lack of understanding of the common people with respect to the difficulty and issues of police work that again leads to nothing but making the entire town seem like terrible people.Ultimately, I enjoyed this movie on a technical level, the story until about half way through, and the characters almost never. I doubt I will watch it again."
    },
    {
      "rating": "7",
      "text": "I'm just going to say it: We need more werewolf movies. And that's not a spoiler. One of the intriguing aspects of the movie is whether the werewolf is real or not.And \"The Wolf of Snow Hollow\" is one odd duck of a movie. It weaves deadpan humor with real-like family drama and genre horror -- a feat that isn't easy to do and tough to review as an armchair critic.Was the opening of this review a non-sequitur? That's exactly how many scenes of the movie leave you -- are those jarring tonal shifts or crafty blending of story/genre? Bottom line is that to rate this fairly, it deserves a re-watch.What really makes the movie work is writer/director/star Jim Cummings' likeability and sheer passion that permeates much of the film (although his huge canines are damn distracting and suspicious given that it could be a werewolf movie!)."
    },
    {
      "rating": "7",
      "text": "This move has a bit of an identity crisis throughout. Sometimes it's a horror movie. Sometimes it's a comedy. And sometimes it's pure crime drama. This works for some movies, undoubtedly, but for the movies that does this well they don't usually switch between these styles again and again throughout - they mix it. This movie keeps changing style, and it doesn't work all that well. And it makes the acting seem rather silly at times.Apart from that, it has some interesting stuff going on. I guess I kind of guessed what was going on due to how the scenes where the crimes take place were presented. But it never completely gave it up, which kept me pondering right up until the end - even though I did end up guessing correctly.The end, though, does fall a bit flat. But I still enjoyed watching it as a whole."
    },
    {
      "rating": "7",
      "text": "Some interesting twists and amusing deadpan quips. Despite only being 85 minutes it is a bit overstuffed, but there is enough here to make it a fun addition to the Halloween/Christmas genre"
    },
    {
      "rating": "6",
      "text": "This is the ideal classic movie for a weekend.It won't be memorable at all, but it will give you enough entertainment to pass the time.Also, considering that it doesn't take long, the film itself acknowledges its weaknesses and doesn't extend what it shouldn't.The biggest problem I found was its poor balance between mystery and comedy.It was certainly black humor, but for humor, especially black humor, you need a good timing and equilibrium, and this movie was not successful in that regard.Nothing special, nor did I expect it, but as light entertainment it delivered."
    },
    {
      "rating": "8",
      "text": "Wolf-man flicks, we've seen them all, but I was happily surprised by this. I loved the fresh pacing and black humor. Great scripting. And funny. This guy's got talent."
    },
    {
      "rating": "3",
      "text": "The acting, directing and production of this movie are all pretty poor. Come in expecting a low quality B movie and you may not be as disappointed as I was."
    },
    {
      "rating": "7",
      "text": "Alcoholic sheriff investigates a series of murders in a small town committed by a werewolf but doesn't bother investigating the local taxidermist who has a lot of werewolf stuff on his walls."
    },
    {
      "rating": "8",
      "text": "Really funny and engaging story. Jim Cummings proves to me that he is a Director worth checking out."
    }
  ]
}