{
  "id": 4118,
  "title": "The Room",
  "starring": [
    "Tommy Wiseau",
    "Juliette Danielle"
  ],
  "runtime": 99,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Johnny is a successful banker with great respect for and dedication to the people in his life, especially his future wife Lisa. The happy-go-lucky guy sees his world being torn apart when his friends begin to betray him one-by-one.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9QscHN4pXj6Ja1k7e1ZT4vWDGnr.jpg",
  "categories": {
    "plot": 3.5172413793103448,
    "acting": 2.775,
    "ending": 3.25,
    "soundtrack": 4.666666666666667,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 3.2,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This film is a misunderstood masterpiece. Yes its badly written, directed, acted, dubbed and every other aspect of film making. But its so entertaining because of this, especially with a group of friends. Its much, much, much funnier than most comedy films today."
    },
    {
      "rating": "1",
      "text": "I don't know what so say. This is by far the best/worst movie I've ever seen. The acting and dialogue is atrocious....the characters: you don't give a **** about them! And the plot is so cliché but so messily convoluted that it pisses me off to no extent. From this comes comedy, unwanted comedy that had me in stitches which is why I cannot give this film no admiration for just how appalling it really is. Cult status: Achieved but at the cost of the human race. This exists for some reason and we've all just come to peace with it."
    },
    {
      "rating": "0",
      "text": "This movie is the absolute masterpiece of terribleness and hilarity and complete **** which of course means that it's a complete blast to watch! The acting, the script, the directing, everything about this movie is so weird and out of place that it's impossible to take seriously. It's obvious why this movie has become such a cult hit. There's a fantastic book called The Disaster Artist (now also a movie) which tells about the making of this... \"thing\" and also about the friendship between the director, Tommy Wiseau, and the actor who plays Mark, Greg Sestero. I highly recommend it and I also recommend watching this movie just so you can say that you've seen The Room, you'll love it."
    },
    {
      "rating": "0",
      "text": "When it comes to filmmaking, there are specific rules...it's not just about picking up a camera, hiring some people off the street to be your actors, and then writing whatever story you want to tell...\r ...This is where Tommy Wiseau's cult masterpiece 'The Room' comes in, a movie that essentially doesn't know how to be a movie. It is written, produced, directed by and starring Tommy Wiseau as a banker named Johnny.\r Johnny lives a sort-of happy life in San Francisco, he is engaged to his \"future wife\" named Lisa (Juliette Danielle), I use the term \"future wife\" because that's what this movie is saying. The first problem with their chemistry is pretty much everything, they do not look like a couple...if you saw the two of them walking down the street, the last thing you would ever think is them being madly in love. Wiseau looks way too old for her.\r The first half-an-hour of this movie is four different sex scenes...these scenes drive the movie nowhere, they just put the movie to a dead standstill. The sex scenes are not at all steamy in the slightest...they are actually quite hard to watch.\r Later we discover that Lisa is having some extra on the side, she calls Johnny's best friend Mark (Greg Sestero), and it turns out that she seduces him and they have sex...on the swirly staircase...that is a very interesting location since the bedrooms are only a few steps up the stairs, and that the front door is beside the staircase, so it's a surprise that none of them get caught. That was close.\r There are so many subplots added to the movie that also lead it nowhere, we hear about Lisa's mother Claudette (Carolyn Minnott) having breast cancer, we never hear about this later on in the movie...we even see Claudette in later scenes of the movie and her health doesn't seem to have deteriorated. There is one pointless scene where we see the young character named Denny (Philip Haldiman) getting into some trouble with a big thug named Chris R (Dan Janjigian)...this scene is over before it even begins. And, of course, who can forget the football scenes...\r ...this is really where the film (can I even say it's a \"film\"?) starts to get dragged down by pointless padding. There is this one scene where we see the main characters; Johnny, Mark, Denny and a psychologist named Peter (Kyle Vogt) dressed up in tuxedos, so you think it's finally the wedding day of Johnny and Lisa. Nope! Wrong, they end up going outside, and toss around the football about three times (yes, I counted), and then Peter trips and falls over, and they decide to go back inside the house. What was the point of this scene? If you took this scene out, it would not affect the movie, but then again, it wouldn't improve much either.\r Later on in the movie, Johnny decides to record phone calls as he begins to grow suspicious that Lisa is hiding something. This is sort-of important later.\r We cut to Johnny's birthday party and all of his friends are there...apart from Peter, if you've read Greg Sestero's book \"The Disaster Artist\", you'll know why. Mark and Lisa decide to feel each other up again... during the party!!! And surprise! They're caught, by a random character who we do not know, nor does the screenplay allow us to get into detail about him, he's just some guy that finds out about Mark and Lisa's affair behind Johnny's back.\r Johnny does find out about this affair, and is very angry about it. The thing is; Wiseau tries to position his audience to make us care and feel sorry for him...I don't care...nor do I feel sorry for him. His acting is so over-the-top sometimes, and laughable, you are fully aware that you are watching the film.\r But the worst performance by far is from actress Robyn Paris, who plays Lisa's best friend, Michelle. I know a lot of people say Wiseau's acting is bad, but her acting makes Tommy Wiseau look like Daniel Day-Lewis. Seriously, she is bad.\r The dialogue here is atrocious, too. \"I did not hit her, it's not true, it's bulls**t, I did not hit her, I did NOT\" *throws bottle in anger and notices Mark* \"Oh hi, Mark\". Or try...\"No, I cannot talk about that now, anyway, how's your sex life?\" Who asks like that?! Better yet, there's that famous \"You're tearing me apart, Lisa\".\r 'The Room' is the worst film ever made, period. It drags, there is a lot of padding, there are stories and characters that are introduced, but then are removed abruptly...and the story is generic and uninspired. God knows what was going through Tommy Wiseau's head when he was making this. Although, it is enjoyable, I am rating this a rare 0/10 simply because it is a film that is bad in every level...but on an entertaining level, it does get a 10/10...for all the wrong reasons.\r You're tearing me apart, Tommy Wiseau."
    },
    {
      "rating": "2",
      "text": "\"The Room\" was a bad movie, for which reason, it has become a cult movie where you disrespect the cinema. Tommy Wiseau had a worse job, as an actor and all those things, and including the other actors, the narrative is incoherent and very badly written, but to contradict what was said, I liked it."
    },
    {
      "rating": "0",
      "text": "This movie shouldn't exist. It creates a rip in the space-time continuum of filmmaking. Because of this, it cannot be rated either. There is no rating score anywhere in the world for \"The Room\", if someone was to actually give it a number out of ten, it would be \"∞\"."
    },
    {
      "rating": "2",
      "text": "I did not like this movie, its **** I did not like it, I did not. Oh hi metacritic. Hey gameguardian21, havent you got that feeling that this movies so bad, its kind of enjoyable. No."
    },
    {
      "rating": "0",
      "text": "This is easily the worst 'thing' that I've ever sat through. Me and 7 of my friends were having a movie night yesterday and my friend Stephen brought this with him, claiming \"I don't know what this is and apparently no one on the planet does so we should watch it.\" There was me, Stephan, Mason and Shane who are all male and Anna, Katie, Zoe and Gina who are female (I'm saying this just so I can establish and go into more detail about one of our reactions later) and all of us had different reactions to what we were seeing. Me, Mason Anna and Katie were looking on in confusion throughout the whole thing, Stephen and Shane were laughing uncontrollably, Gina was offended and Zoe fell asleep.\r There was just so much stuff wrong in this thing that I repeatedly asked the question \"why was this made? What possessed Tommy Wiseau to make this? Did he intentionally make this bad? Did he make this to\rsettle debt? Did he actually think he could become a memorable film director?\" I can only answer one of those questions, he became a memorable film director/producer/writer/actor but for the wrong reasons.\r Where do I start? The acting is some of the worst caught on camera. I was in an amateur theatre production by Queen's hall arts called Minor's Strike and I would like to emphasize, it was an amateur production and all of our acting was praised in the performance and I was 13 at the time. These actors, who are around their 30s/40s are acting worse than we did and we were amateurs and hadn't taken acting\rschool at the time. Tommy Wiseau is easily the worst though. He is the worst actor and this film and what goes well with a bad actor you might ask? Badly written dialogue for this bad actor to spout out.\r \"We have a new client at the bank we make a lot of money, anyway how is your sex life\" This is an actual piece of dialogue that was delivered by Tommy Wiseau, imagine that an 8 year old French boy is saying this line and you will get Tommy Wiseau's whole performance.\r There are also these really uncomfortable sex scene moments which is what Gina was offended by. I know that we're in an age where the ESRB raters are awfully sceptical about letting certain age demographics\rwatch certain movies and usually controversy is applauded by audience and that's why Harvester and Hatred got as much attention as they did but this thing in The Room, these sex scenes which is applauded by possibly the horn word (not allowed to say it because of Metacritic's rules) teenage boy demographic, these sort of scenes are just plain awkward for people to sit through. Also, there is about 5 of these\runcomfortable sex scenes in this film, each lasting about 5 mins. Which means the total amount of time we spent watching some porno was just under 1/3 of the film.\r There are also these really weird scenes that don't go anywhere. They happen and then that's it.\r I wish there was a way that I could unsee this film and none of you get this film, even if you're curious, don' get it. I wish to never see Tommy Wiseau in anything again, if he even is in anything else and if he is, there's something wrong with this world."
    },
    {
      "rating": "0",
      "text": "The room is a movie so bad that it has to be seen by everyone. One of the best so bad it's good movie of all time a must watch    ."
    },
    {
      "rating": "3",
      "text": "Insanely bad, in a way that literally makes you laugh at the movie hardly. It's pretty much like a porn movie without the porn, the conversations are completely non sense, crazy dialogues with zero speech tone, the acting is so bad that you can have some fun out of it. There a lot of sex sequences it the movie that last for many minutes and just for no reason and no meaning, at the beginning of the movie there are 2 sex scenes with the same woman with 2 different men that took like 10 minutes. Some dialogues are just dubbed after the movie in post production, and it sounds awful in the movie, cause it's easily noticeable the change of voice quality between studio and shooting, not to mention the lip movement that ends up getting very weird. I can feel that they tried to put some epic shots, wiht beautiful ambience and some nice music in the back, and it kind of works like how it's done, just not how it was suposed to. But it really makes you laugh and have some fun, that famous punch line followed by the \"hahaha\" that got me everytime. A terrible love triangle story that becomes a GREAT involuntary comedy. Tommy Wiseau, Thank You."
    },
    {
      "rating": "0",
      "text": "If I'm gonna grade as a movie by ITSELF and not as a so-bad-it's-good movie, then The Room is one of the biggest atrocities I have ever seen. Random, incoherent script, atrocious acting, sloppy framing, nonexistent story, unintentionally hilarious dialogue. It fails on every base level of filmmaking, but OH MAN is it funny! Most bad movies are forgotten because of how forgettable they are, but The Room is so inept, so random, and so bizarre that it achieves cult-status at how horrible it was! It's kind of sad, because Tommy Wiseau did pour his heart and soul in this project. It just ended up being famous for all the wrong reasons.Worth watching with friends. Can't wait for The Disaster Artist!"
    },
    {
      "rating": "1",
      "text": "Really ambitious for a softcore porno.The Room is auteur filmmaking at it's most befuddling. I'm pretty sure Tommy Wiseau had some sort of message about life and love that he wanted to give us. Maybe even one that was deep and insightful. It's impossible to tell though as the movie is incomprehensible.It runs on a loop of the characters having the same conversations over and over again with the occasional nonsensical moment or long, drawn out sex scene thrown in to break up the monotony. The dialog the cast was given is atrocious and they seem to be playing people who are only capable of making the dumbest possible decisions at any given moment. The acting isn't as bad as you would expect. With the exception of Sestero and Wiseau himself I actually thought there were some decent performances for a movie of this caliber. Sestero seems uninterested in really trying as a result of being fully aware of just how bad the project was going to turn out. Wiseau on the other hand is just a block of wood. Even his fits of rage seem devoid of energy.The direction and writing are just all around terrible. But rather than creating something that's painful to watch, Wiseau's ineptness both behind and in front of the camera inadvertently led to The Room becoming strangely lovable instead. It's still an awful movie, but at the same time it's hard to not be entranced by the unnatural interactions between everybody onscreen as it's all just too funny. As uncomfortable as the sex scenes are to watch I couldn't help but laugh. They have the corniest love songs playing overtop of them and Wiseau apparently doesn't know where the vagina is located. I couldn't tell is he was putting it between her breasts or just had some sort of weird bellybutton penetration fetish. The whole thing is a great source of unintentional hilarity. I'm not sure that's cause enough to recommend it though.1.3/10"
    },
    {
      "rating": "2",
      "text": "What's so bad about this is... well... that R rating is suspicious. What's with the many football scenes though? I guess the Room is all about all these repetitive football scenes while it doesn't really pull out a story."
    },
    {
      "rating": "0",
      "text": "This movie really resumes itself to a sequence of awkward conversations and overly long sex scenes. Even at 2x speed it was really hard to finish it. There's no excuse to highly rating it, it is not funny at all."
    },
    {
      "rating": "0",
      "text": "Of course this movie is terrible, but it is equally loved. There is no redeeming aspect to this film critically but it is an enjoyable ride and example of how not to make movies."
    },
    {
      "rating": "1",
      "text": "Was going to give it a ten just for the jokes, but I can’t deny how much of a fail this movie is. It almost makes me want to watch Troll 2 again, which is saying something."
    },
    {
      "rating": "0",
      "text": "This movie is so awful it is hilarious, but it doesn't take away from the fact that the movie is awful.  There is literally nothing good about this movie."
    },
    {
      "rating": "0",
      "text": "Oh God, this movie sucks............................................................................................and thats why you should watch it."
    },
    {
      "rating": "0",
      "text": "Ohhh my god. This movie. This movie is like a gruesome, horrible train-wreck. You can't look away.\r It is easily the worst film I've ever seen. I've seen elementary school plays that had better direction and more cohesive plot than this. Not to mention the acting. Oh god, the acting. Everything about this is just powerfully bad.\r But honestly... I'm glad that I watched it. It was just so bad, my husband and I were rolling on the floor every five minutes. It's even better if you watch it with Rifftrax.\r Seriously. There is nothing technically good about this movie. That's why it gets a zero. But that doesn't mean you shouldn't watch it. Watch it. Do it. Seriously."
    },
    {
      "rating": "9",
      "text": "The Room is a masterpiece of bad movies, one which actually made Tommy Wiseau change the genre from straight-up drama to a pitch-black comedy. But I think we all know the reason we watched the film in the first place: to say that you've watched The Room! In the same vein of Birdemic and Plan 9, this movie has no dramatic value whatsoever. I can safely say, there were laughs all the way through when I watched this cinematic **** But at its heart, this movie was Tommy's best shot, and I respect him for that. Keep on making movies, Mr. Wiseau."
    },
    {
      "rating": "0",
      "text": "Oh, goddamn, this movie was so awful. Tommy Wiseau, the director of this film, was also an actor. I'm going to say this right now. He is the worst actor I have seen my entire life."
    },
    {
      "rating": "10",
      "text": "Call me crazy, but this movie is sooooo bad that it's a masterpiece. The horrible acting, dialogue and story makes it so fun to watch and laugh at. Especially with friends. This is ironic because usually when there's a bad film, you want to avoid it, but with this one, everyone should check it out."
    },
    {
      "rating": "2",
      "text": "The Room is one of the worst movies that I have ever seen.  The only reason that it gets the two is the scene where they play football, two feet from each other in tuxedos."
    },
    {
      "rating": "0",
      "text": "This movie is so far below what is humanly possible for incoherence, incompetence, and cringeworthy, it goes by far without saying, this is the worst film I ever saw. Worse than Battlefield Earth, worse than any raunchy Hangover ripoff flick, worse than anything. Yes, the ineptitude can sometimes make you laugh, but it doesn't change anything about how this movie is, in one word, bad. If 'The Disaster Artist' is true, then Tommy Wiseau is simply a freak of nature. And I feel sorry for all the cast members whose careers were ruined because of him."
    },
    {
      "rating": "1",
      "text": "This movie is bad. Just downright bad. Every single aspect of it is just horrible. The writing, the acting, the music choices in most of the scenes. Everything in this movie is wrong. But that's what makes it so great. It just so horrible and pretentious that you can't help but laugh and enjoy the movie. Okay, most people would probably get a headache from watching it, but a fair share of people will also get a good laugh out of it. Now if you are gonna get into filming, I recommend you give this movie a watch. Just so you can learn what NOT to do when you make a movie"
    },
    {
      "rating": "1",
      "text": "The Room is considered one of the worst movies of all time. It has horrendous acting, an atrocious script, and god awful cinematography. I gave the movie a 1/10 instead of a 0/10 because it made me laugh from how bad it was sometimes. If it was meant to be this bad, it would get a 10/10. But unfortunately this movie took itself WAY to seriously. It defines \"so bad it's good.\""
    },
    {
      "rating": "10",
      "text": "No movie could possibly be this bad by accident.I submit that Tommy Wiseau—or at least the people who could have stopped him but didn't—set out to produce the single crappiest piece of cinema ever made, possibly as a send-up of the contemporary standards. Assuming that unparalleled mediocrity was his aim, I give this film a perfect 10. My mind actually refuses to believe otherwise, because it would take a psychotic mind—nay, a gathering of several—to look at this and go \"this is good.\"The entire cast is absurdly bad at acting... the script could have been written by a grade-schooler... the dark soundtrack plays at the most pointless times, and disappears when it's needed... the \"moments of insight\" in the dialogue are impossibly cliched and shallow... the story takes 100 minutes to do what it could in 10... unintentionally  side-splitting sex scenes are interwoven with boyish football tossing scenes while the remaining 30% of running time (a.k.a. the most insipid plot ever, anywhere, ever) spins its wheels at or under 1 mph...  the ADR is off by a mile...You reach bad movie nirvana when protagonist Johnny actually says another character's lines while the latter's voice is still dubbed in.It's as if Wiseau wanted people to experience what happens when the absolute worst of everything comes together. Worst actors, worst director, worst screenwriter, worst lighting, worst editing, worst cameramen, and poof! Genius.Nobody anywhere could ever make a worse movie no matter how hard they tried. In my humble opinion, that's why The Room is a monumental success. I mean, anybody could throw a handful of crap at a wall, but it takes a special kind of person to evenly paint the entire room with it."
    },
    {
      "rating": "10",
      "text": "The room is the best movie EVAR! Evaryboby in da world needs to watch DA ROOM!"
    },
    {
      "rating": "10",
      "text": "There is so much emotion in this movie, as seen in the part where Johnny says \"You are tearing me apart Lisa!\" I give this comedy movie a 10 because of the drama and suspense from how awesomely bad it is."
    },
    {
      "rating": "1",
      "text": "This one is either a 1 or a perfect 10 depending on what you watch films for. In my case, I watch film to be entertained, sure, but first and foremost, I watch it to see artistic quality. When it comes to The Room, it certainly delivers entertainment, but it's only because of its blatant disregard for all that makes film great. Quality acting, directing, writing, cinematography, production design, and editing, are all left behind in this tale of love, deceit, and I am honestly not sure what else. While it delivers many laughs, it is at its own expense, as the comedy is to be found not in the quality comedic writing, but in the acting and horrendous dramatic writing. A serious film, this one could be mistaken to be a comedy if you did not know better. Really, the best quality brings to the table is an additional running joke for you to have with anybody you watch it with. Thus, I recommend gathering a group of friends together, popping some popcorn, and sitting back and enjoying everything that makes The Room the film it is. Honestly the worst film I have ever seen, but probably one of the most entertaining and rewarding experiences of my life."
    },
    {
      "rating": "2",
      "text": "This movie is right up there with Birdemic in the category of \"how is this a thing?\" movies. The acting is crappy in its best moments, the set pieces are shoddy at best, and it contains so many WTF moments, I can't count them all. And why does Tommy Wiseau read lines HE WROTE like he doesn't understand them? WTF?"
    },
    {
      "rating": "0",
      "text": "I don't enjoy reviewing this movie so low because of the sheer amount of enjoyment I've gotten out of it, however, in the name of objectivity, I must say that this movie is not good. And not even like the regular amount of not good. Like really, really bad. So bad that it would be almost impossible to make a movie that is this bad accidentally. They say that it takes almost as much skill to answer every question incorrectly on the SAT as it does to answer every question correctly. I don't know just food for thought."
    },
    {
      "rating": "0",
      "text": "After so much noise about The Disaster Artist, I decided that it was finally time for me to see The Room, I will be honest, I wasn't really excited or interested, I had been putting it off for quite some time and it is not because I was worried to see a garbage film, I have seen many movies that could earn the nickname of the worst that cinema has given quite easily, but it's very simple, the movie has nothing to attract you, absolutely nothing.But anyway, I did it and the damage is already done but what can I say? How can I avoid releasing a torrent of anger wrapped in objective criticism?The Room is perhaps the worst movie I have ever seen in my life and yes it is probably one of the worst in history, this movie is an argumentative and narrative vomit that lacks of all the basic rules of cinematic language, it is as disconnected as stupid and boring, is as unsuccessful as indescribable and lets say it, the background story of the script has a thematic full of clichés but any screenwriter with some talent could have made something respectable from it, but Wiseau's script is a **** disaster. A **** disaster to which he gave a beginning and an ending but everything else is just crap.Believe me, unless you are someone like me who always finishes a movie or worse you enjoy it, I do not know how a regular audicence could find reasons or excuses to continue after the first twenty five minutes.And it's not only the lousy script or the bad direction, The Room is also plagued by such miserable performances that I cannot understand how they moved forward when they were editing. Everything looks neglected, false, overacted and most importantly, everything looks lost and out of focus, not only is the stupidity of the dialogues and the abandoned narrative threads, it's the way in which these things come out of the mouth of the actors. What was their motivation? I ignore it, maybe I should read the book or Franco's movie will throw some answers, otherwise it will remain an incredible mystery for me.Leaving aside the film a little, what concerns me now is what the film has become, because for those who do not know this movie is now considered a cult film, yes a cult film, with special screenings in which Wiseau finally has some success and hhe embrace it without any kind of reluctance, let's say that it was the success he longed for, but it's worth asking if it's valid to find success in mediocrity.Who are to blame for it? Who creates it or who consumes it? And don't get me wrong, I always advocate for what people enjoys or love, but you have to be able to draw a line, because if they convert this type of mediocrity into success what does it says about the spectators? What about the great films that are ignored annually and are condemned to the dark while this is the object of admiration and success? What do we aspire to? Failing in order to achieve fame by being a joke? Honestly with what I've seen in the trailers and the interviews, that's precisely what Franco is doing, maybe Wiseau ignores it or if he doesn't, he let it go, in one way or another the recognition is already his.Honestly, avoid it, stay away from The Room, there is nothing in it nor you will learn anything from it, it is a miserable movie, a crushing failure with all its letters, is bad and yes, not even the involuntary humor works for a ****"
    },
    {
      "rating": "10",
      "text": "This is one of those once-in-a-generation movies in which the script, acting, visuals, and social significance all combine into one to make a near-perfect masterpiece of a film that will surely be watched and loved for generations to come. The main character of Johnny instantly made an impression on me from the moment he stepped on screen, and the supporting actors only made him better. Tommy Wiseau is one of those men who can produce, act, direct, and edit all at the same time on a godly level that no one had ever witnessed before now. His performance cemented himself as one of Hollywood's elites and made the already-great supporting cast even more enjoyable to watch. The plot is perfectly paced and varied, with all scenes coming together at the end for an impeccable finale. No talent is wasted or misdirected, and the dialogue is so hauntingly realistic that it makes it hard to believe that the actors were given a script to work off of. Overall this film gets a 9.9/10 from me, the only thing that is holding it back is that the 1.5 hour run time is just painfully short, and makes the film seem like only a snippet of what these talented people can really do."
    },
    {
      "rating": "10",
      "text": "The best movie I've ever watched in my entire life. The story... was beautiful. It was so in depth and original but the thing that really sold it for me was the acting. Simply amazing. If you are a fan of any type of movie ever, this is definitely for you."
    },
    {
      "rating": "10",
      "text": "The Room is the king of  \"So Bad It's Good\" cinema. Cringeworthy dialogue, acting, dubbing, story, and more are to be found (and laughed at) in the best worst movie ever."
    },
    {
      "rating": "10",
      "text": "This is an excellent movie, top-notch cinematography and acting, nuanced characters, well-structured dialog and character arcs- so, anyways, how is your sex life?"
    },
    {
      "rating": "10",
      "text": "You betrayed me! You're not good. You, you're just a chicken. Chip-chip-chip-chip-cheep-cheep.YOU ARE TEARING ME APART, LISA!YOURE NOT MY **** MOTHERI did not hit her, it's not true! It's **** I did not hit her!enough said"
    },
    {
      "rating": "10",
      "text": "An emotional rollercoaster, a beautifully executed classic that has gone down in history as a cult classic. I have watched this movie billions of times, and will never think twice about re-watching it even more in the future. Masterpiece."
    },
    {
      "rating": "10",
      "text": "This film is absolutely brilliant. The cinematography and green screen effects are superb. I love the bit where Spagget spooks Johnny, and then cheeky Denny walks in while shoving a toaster where the sun don't shine. But then Lisa walks in because to bark at everyone, which satisfies Mark. But Saujanic is having none of it  and uses the speakeasy to kill Lisa, while simultaneously saying, \"BUT! BUT! BUT! SPEAKEASY!!!\" Then shortly afterwards, Naruto comes in and scopes Pingu, who is smoking a massive joint. But Robbie Rotten isn't having any of this either, and grabs Stephanie and Sportacus and hurls them at Denny. Deny iss deed. Jhnny rns ova tu hm nd shds a single tear."
    },
    {
      "rating": "10",
      "text": "Just like the best pieces of Shakespeare The Room is filled with drama.Just like the best film by Kubrick The Room is directed to perfection.Just like the best script written by Sorkin The Room has perfectionist writing.Just like the best sonata by Beethoven The Room's score is masterfully done.To conclude, this film made me, a blind deaf man, more than happy."
    },
    {
      "rating": "4",
      "text": "In one word: Wow. This film is just... It gets everything wrong. The acting is wrong, the writing is wrong, the directing is wrong, but it makes this film so much of a laugh that it just catches me off guard every time with clips on Youtube, like the infamous flower shop scene or the part on the roof with Mark.    There isn't anything I can really say about this movie which hasn't already been said about it, but with friends this film is less of something to avoid, but something of near infinite hilarity, with moments so funny you will have to pause the movie just so you can watch it normally again, utterly laughable moments are almost constant too, not just the odd few clips you see around the web, the WHOLE movie is like this.    If you have some friends and stuff around, you cannot pass this movie up if they all find those little clips of the film funny, despite how bad it is, I would watch it with a group of friends any time, I would rate it lower for being an absolute abomination of a film, but its just so laughable that I can grant it a four."
    },
    {
      "rating": "3",
      "text": "Wiseau may very well be the worst actor ever to be on screen. The characters are ridiculous, the plot is indescribable and the dialogue is just downright unbelievable (not in a good way). The only thing that the movie had going for it was it was so bad, it was kind of entertaining."
    },
    {
      "rating": "0",
      "text": "A complete pile of trash, its so bad it has you in tears at times, the person behind the film surely cannot believe this was good enough to be released, its just plain awful, the acting is abysmal, the story is non existent. the scenery seems messed up, its just bloody awful but the HI MARK scenes are funny (again because its so bad/cheesy)"
    },
    {
      "rating": "0",
      "text": "You will love this movie. You will hate this movie. It is the best movie ever made. It is the worst movie ever made. This movie will change your life. This movie will take 10 years off of your life. This movie is a masterpiece and triumph in film-making. This movie is an unmitigated disaster. This movie is a blessing from God. This movie is a curse from Hell. I've seen The Room 33 times, and I honestly find new things to love/hate about it with every  watch. This movie is a BLAST to watch with friends, and I honestly highly recommend it! The flowershop scene alone defines modern cinema, and Tommy's greeting of \"Oh hai doggy\" will echo through time just like Citizen Kane's \"Rosebud...\""
    },
    {
      "rating": "0",
      "text": "The Room....I just don't know how to describe this...garbage. The worst part about this film is that the director/star/executive producer/producer/writer Tommy Wiseau thinks he's making a modern masterpiece and I'm sure he is surprised that this didn't get Oscar attention. See this movie only to laugh at how horribly bad it is. If you don't like laughing at bad movies, burn every copy of the film you find."
    },
    {
      "rating": "10",
      "text": "There are movies that are so bad that they become good again, The Room is one of them. It’s a great source of memes providing us with memorable lines like: “YOU ARE TEARING ME APART, LISA!”, “I did not hit her, it's not true! It's **** I did not hit her! [throws water bottle] I did *not*. Oh hi, Mark.”, “Chip-chip-chip-chip-cheep-cheep.”, “No, I can't. Anyway, how is your sex life?” and “Hi, doggy.”"
    },
    {
      "rating": "10",
      "text": "This is obviously a good movie not because of top notch acting, interesting plot, and insane action. No, this movie is so great because at how laughable this movie really is. In order to enjoy this movie, you honestly need to like this type of humor because if you watched this movie with a serious tone, of course it's gonna suck. It's so bad you'll love it. I sure as heck did"
    },
    {
      "rating": "10",
      "text": "God bless you Tommy Wiseau, you mad genius. The world just isn't ready for filmmaking of this calibre. This movie is so good, it's tearing me apart."
    },
    {
      "rating": "10",
      "text": "After watching The Room, I got myself thinking \"why in the hell did I watch this movie?\" However, it turns out that after watching this film by Tommy Wiseau, it lead to a realization why the poor acting, directing, production, and the writing became a cultural phenomenon that literally had me laughing in tears. To be honest, I would rate this film a 0, but I decided to give it a 10 because of it's laughable quality of satire. This movie without a doubt, is considered to be the greatest bad movie ever made."
    }
  ]
}