{"id": 4601, "title": "The Adventurer: The Curse of the Midas Box", "starring": ["Aneurin Barnard", "Michael Sheen"], "runtime": 99, "genre": ["Fantasy", "Adventure", "Family"], "description": "Seventeen-year-old Mariah Mundi's life is turned upside down when his parents vanish and his younger brother is kidnapped. Following a trail of clues to the darkly majestic Prince Regent Hotel, Mariah discovers a hidden realm of child-stealing monsters, deadly secrets and a long-lost artefact that grants limitless wealth—but also devastating supernatural power. With the fate of his world, and his family at stake, Mariah will risk everything to unravel the Curse of the Midas Box.", "releaseYear": "2013", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/31ykUoOS2RNdARk3B8z3y25gD8b.jpg", "categories": {"plot": 8.0, "acting": 9.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 9.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "This film is a good old fashioned adventure film. Set in the 19 th century, it takes a happy academic family and tears it apart. Following the disappearance of their mother and father, Mariah Mundi ( Aneurin Barnard) and his younger brother Felix (Xavier Atkins) are chased by two villains, who make a great criminal double act, leading to Felix also being captured. Mariah is then aided by a family friend, Will Charity (Michael Sheen) to track down his brother whilst also looking for an antique weapon of mass destruction, the Midas Box. The path leads to the Prince Regents Hotel run by the enigmatic Otto Luger (Sam Neill) where the solution to the mystery lies. This film might not go onto win awards, but is is entertaining, and certainly worth watching. Great performances from all cast including the smaller roles, Mellor Caron as Mariah's companion, Sacha, is a worthy assistant, and Xavier Atkins gives a great performance as the annoying younger brother who goes through some serious danger as his world collapses. Aneurin Barnard gives a measured performance. Michael Sheen certainly helps to give life to all scenes in which he appears and Sam Neill is excellent as the master criminal. I would recommend seeing this film."}, {"rating": "0", "text": "I can't understand those three reviews with 9, 9 and 8!\rThis movie is utter garbage, a shame, bad as anything, worse than a toothache. Avoid this \"thing\" and please, don't spend a single penny on it."}, {"rating": "9", "text": "Secret doors, villains, steampunk and mystery. :) i loved it. I watched this film, not to find holes in the plot, but to have my imagination run wild. And it did.  :) And i loved Sam Neill as the villain."}, {"rating": "8", "text": "Like most movies nowadays - this tells us that there is more to the bedtime stories we were once told. This is like the continuation of those childhood days, where some of us always asks what happens after the \"ever after.\" Overall the movie served its purpose AND Charlie Sheen is LOVE."}, {"rating": "3", "text": "A waste of a talented cast and source material, with cheap production and obvious rip offs of much better movies (they outright steal from \"Indiana Jones\").  Not even worth your time."}], "recommendations": ["the_judge", "blow", "the_fugitive", "black_mass", "going_in_style", "the_town", "frequency", "as_good_as_it_gets", "the_iceman", "the_fighter", "daredevil", "the_lincoln_lawyer", "the_founder", "robin_hood_prince_of_thieves", "the_terminal", "live_by_night", "snitch", "lawless", "the_marksman", "spider_man_homecoming", "wall_street_money_never_sleeps", "silver_linings_playbook", "joy", "john_q", "donnie_brasco"]}