{
  "id": 1620,
  "title": "The Texas Chain Saw Massacre",
  "starring": [
    "Marilyn Burns",
    "Allen Danziger"
  ],
  "runtime": 83,
  "genre": [
    "Horror"
  ],
  "description": "When Sally hears that her grandfather's grave may have been vandalized, she and her paraplegic brother, Franklin, set out with their friends to investigate. After a detour to their family's old farmhouse, they discover a group of crazed, murderous outcasts living next door. As the group is attacked one by one by the chainsaw-wielding Leatherface, who wears a mask of human skin, the survivors must do everything they can to escape.",
  "releaseYear": "1974",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9s8uSm5K1W0vhGPHv2icM6SFib8.jpg",
  "categories": {
    "plot": 7.2727272727272725,
    "acting": 7.526315789473684,
    "ending": 8.666666666666666,
    "soundtrack": 5.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.5,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Definitely a classic. Made long before attention deficit cinema came along and made everyone, collectively, a little dumber than we once were. The establishing shots in the early parts of the film are so moody, slow and dread inducing - a fitting set-up for what comes later. This is how it's done."
    },
    {
      "rating": "10",
      "text": "I first saw this movie back in 98 when i was about 15 years old, and at the time, i was so terrified to even walk along my street at night it affected me that much, I refused to watch it again until someone as a laugh bought it for me for Christmas a few years later. It was only then i began to appreciate the movie and the intensity of the atmosphere that surrounded the whole movie in general, Yes it still scares the *bleep* out of me but thats why i love it, It makes me feel every emotion under the sun, Claustrophobia, Fear, Tension, Joy, Reflection, and bloomin' well thankful that i wont ever come across Leatherface anytime soon!"
    },
    {
      "rating": "6",
      "text": "I quite enjoyed the 2003 remake and the two prequels that followed afterwards so I kind of wanted to go back to where it all began and see what the original was like. Considering it's mid 70's I still managed to enjoy it and can see how effective this would have been back then, perhaps not so much now but still its a very well done Horror film, and was probably the first of its kind back then. All things considered its not a great film, but I'll give it props for still making me jump!"
    },
    {
      "rating": "5",
      "text": "it was alright in terms of horror it was creepy and unerving but the movie started out boring and things only started getting good in the last 20-30 minutes of the movie. It was good i can see why people like it but i didnt find it the best but i will admit the leatherface in this creeped the hell out of me"
    },
    {
      "rating": "10",
      "text": "Arguably the greatest horror film of all time.  In my opinion, it is.  I'm not a big horror fan but this is definitely a fantastic film.  Great acting and is incredibly realistic.  Not gonna spoil it but the ending scene was brilliant and very suspenseful.  Personally, I don't think you can call yourself a horror fan if you haven't seen this movie."
    },
    {
      "rating": "10",
      "text": "TCM is the most horrifying movie ever.It blows the socks off of most other horror movies.I defy anyone to name me a more horrifying movie."
    },
    {
      "rating": "6",
      "text": "I don't quite get the 'artistically' brutal gore & blood, but what makes the movie worth watching is the last 15 minutes."
    },
    {
      "rating": "9",
      "text": "En mi opinión, es una de las 10 mejores películas de terror de siempre. Me parece increíble lo que hacen en 1h y 15 minutos de película con \"dos duros\" de presupuesto, consiguen crear una obra maestra. Como está dirigida, sin filtros... Eso sí los actores pésimos. En definitiva, un tío corriendo durante media hora con una motosierra matando gente, ¿Hace falta más? (Risas)"
    },
    {
      "rating": "10",
      "text": "One of the greatest movies of all time!"
    },
    {
      "rating": "7",
      "text": "I think the acting is the strongest part of this movie. It helped get me involved with the characters and did manage to scare me. Still a good horror flick."
    },
    {
      "rating": "10",
      "text": "Sigue siendo repugnante, inquietante y perturbadora aún después de 46 años"
    },
    {
      "rating": "6",
      "text": "On the face of it, it looks pretty amateurish but looking deeper the extensive dolly shots, moody imposing angles and intense zooms make for very original cinematography. It is so gritty and so ugly but it fits the content perfectly. It sounds messy and the music is ill timed at places but this adds to the believability and intense realism. Compared to the relatively soulless remake The Texas Chainsaw Massacre (2003) which utilises much higher production-values I think that the sound and vision really complement the content. This is really scary and so intense considering the age of the film. It contains many memorable moments and you can understand why it spawned so many sequels which took the characters and turned them into eighties franchise clichés. This first film was totally original and brutally fascinating to watch. It is unrelenting. I forgot how amazing this horror really is. Although technically not perfect this is the perfectly constructed horror."
    },
    {
      "rating": "10",
      "text": "Scariest movie of 70s along with"
    },
    {
      "rating": "10",
      "text": "What the hell can I or need I really say here folks? This is certainly one of the most beloved horror films of all time. It might also be one of the most notorious horror films of all time, especially to mainstreamers and non-horror fans. The mention of its name is sure to get you some kind of reaction from a person one way or the other. The best film Tobe Hopper will ever make has stood the test of time for nearly 30 years. It would be great to have an awesome 30th anniversary theatrical release in 2004 wouldn"
    },
    {
      "rating": "9",
      "text": "I have only watched this version of the Texas Chainsaw, and it had a good story. The sounds really spooked me, and I had to lower the volume. I was scared in some scenes but I wished those scenes were expanded more, I did not felt so much is some of them. Since this film was made in the 70s I had to give a bigger credit and give it a 9."
    },
    {
      "rating": "7",
      "text": "The Granddaddy of all slasher films. It does an amazing job with such a low budget. Great camerawork, fine direction and it is definitely scary. The screaming girl gets to be a bit much though."
    },
    {
      "rating": "6",
      "text": "I left the theatre wanting my $6.50 back. It really was that bad. Better acting than expected though. Plenty of gore but not nearly scary enough, and I can spook myself out with my own shadow..I expected to be up all night, scared silly...I slept like a baby and only felt silly I wasted my time and money. [Ed:  If you paid $6.50 in 1974, you were ripped off, my friend.]"
    },
    {
      "rating": "10",
      "text": "The movie speaks for it self."
    },
    {
      "rating": "9",
      "text": "Excelent! impresionant film, the best horror movie of the world."
    },
    {
      "rating": "10",
      "text": "Way, WAY more intense and disturbing than it's numerous remakes and, in fact, almost any horror film made in the last decade."
    },
    {
      "rating": "8",
      "text": "This movie is an atmospheric powerhouse. I don't think I've ever seen a film that quite portrays so unique a feel. Although some scenes seem overplayed today, and splatter-fans wont be too disturbed by it, 'Massacre' still packs a punch with its nightmareish dusty red visuals and slow but determined development. The deaths themselves are rather unique, since they are done in a brutal but almost offhanded manner, in contrast to the \"look, see? He's dead! Isn't it horrible??\" style of many modern horror movies. The final piece of the puzzle is the experimental but fitting musical score, which compliments the visuals very well. A movie that holds its own, even today."
    },
    {
      "rating": "6",
      "text": "It kind of pains me to have to criticize this movie for not aging well. I mean it was made it 1974 for crying out loud and it's not hard to imagine how terrifying it must have been to people back then. Today however it's not scary in the least and can be rather boring. Sometimes it's even annoying.\r The excellent portrayal of the crazy, backwoods family is still kind of creepy and absurd in a black-humor sort of way. However outside of that and the influence it had on the genre there's nothing else that stands out about it. At least not in a good way.\r The pacing has aged mostly well, but some scenes just drag on for too long. Was it really necessary to have a prolonged section where Marilyn Burns is just screaming non-stop for several minutes? It's old-school filmmaking decisions like that which make the film kind of hard to watch today.\r It's definitely a classic of the horror genre. However it's just not one that's aged well at all. Due to it's legacy it's one I can say I'm glad I watched. I just can't say that I enjoyed it. It's a piece of horror history that any hardcore genre aficionado should check out. However doing so means putting up with a lot of issues brought on by age. Because of that it really is only for the most hardcore of horror fans."
    },
    {
      "rating": "10",
      "text": "An essential horror classic. A very disturbing slasher film that can't be ignored or forgotten."
    },
    {
      "rating": "10",
      "text": "Best horror movie ever. Period. Even hooper himself cant come close to this extremely bright flash in the pan. gunnar hansen's performance is pitch perfect. its extremely easy to screw up leatherface as the sequels showed. also an extremely disturbing ending. halloween cant touch it with a javelin. friday the 13th...lets not go there shall we?"
    },
    {
      "rating": "8",
      "text": "Hooper directs a powerful story about a serial killer and a group of people that eventually are terrorized by it. I was scared, I was shocked and even more impressed. This movie is a true piece of cinema that one can not just ignore, but feel the impulse to watch, and enjoy the elements of a horror film unfold before the eyes."
    },
    {
      "rating": "10",
      "text": "I was watching Hooper's Classic  movie Texas chain saw . I was just grossed when i saw the film, not only is it sick , gross , distrubing  Its Awesome !!!!!!!!!!!!! . \" Hopper's Chain saw massacre is the new horror movie but amazing \". Grade A+"
    },
    {
      "rating": "5",
      "text": "Is this a horror or comedy? As a comedy and spectacle snippet of total insanity I think it passes. There is no plot or movie here. Just a bunch of increasingly unhinged scenes. The film could easily have had a lot of development with a more serious tone but I guess that isn't what they were going for. There's no music or anything. The scariest part of the whole movie is the intro, the vibe of which is totally abandoned afterwards. It is surprisingly light hearted for what you are actually witnessing. It gets points for being different but its another cult film where you go is that it? The name The Texas Chainsaw Massacre has carried with it a lot of weight and gravitas ever since I first heard it. After seeing the movie any mystique that the movie earned has certainly gone out the window."
    },
    {
      "rating": "10",
      "text": "There has been a time that I wasn't really that fond of horror films, finding some had cheap excessive gore, bad acting and scripting and a lack of genuine thrills and suspense. I couldn't have been more wrong, some of the best of the genres are anything but these. The Texas Chainsaw Massacre is one of the best, it screams horror classic from the character Leatherface to the many times it's been imitated/parodied but never equalled. I think the use of the documentary-style realism is masterful, and the fact it is low-budget makes no difference to me, in fact to me this adds to the gritty, harsh and creepy tone this film conveys. The gore is not at all excessive, in fact its count is quite low, and when it is used, it never feels cheap or gimmicky. The script is razor sharp, the story is compelling and Tobe Hooper's direction is probably Texas Chainsaw Massacre's strongest asset. I was fine with the acting as well, Leatherface is genuinely unnerving. In conclusion, a classic. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Super scary, super thrilling, super entertaining this movie has it all but not being my favorite but totally in my top ten. Whoever didn't see this movie hasn't lived yet."
    },
    {
      "rating": "9",
      "text": "I have a love/hate relationship with this movie.\rLove: The scares you get. The horrific villain. The 24 hours you get where you literally can't sleep. The horrific, torturous last 40 minutes.\rHate: (spoliers) The one guy that that girl runs into just happens to be the father/uncle of that one mother******. I mean I know they're close to the house and everything, but realistically what are the chances of that.\rAll in all, I rate the movie a 9 because the whole last 40 minutes of the film are absolute torture. That's were most horror movies fail these days. You get too many breaks in between the action. This does the complete opposite of that. The first 40ish minutes of the film you get sporadic scares. Couple of shots of Leatherface killing people no biggie.\rIn the last 40 minutes $hit starts getting fu**ed up.\rIt is basically torture what you have to endure in that last part of the film. Leatherface and his disturbed family just abuse the **** out of Sally the little cute blonde girl. Even at the last second when she's barely getting away and it looks like she's gone, she can't get into the damn pickup truck and you're still gasping for air trying to not get your heart to reach 200bpm.\r(no spoilers now)\rI like to compare this movie to one of those drop of death rides in theme parks. The buildup is gold, and then the culmination of the ride is so heartrushing you can't even breathe."
    },
    {
      "rating": "8",
      "text": "Based slightly on a true case, and add a fresh idea and a low budget, from there a film is born that would become a trend in the horror genre. Despite being almost 50 years old, this film does not show the weight and passing of the years. What is a shame is that the idea fell into sequels, prequels, rehashes and generic versions as infamous as Nazism."
    },
    {
      "rating": "8",
      "text": "**** insanity, especially the whole ending scene... just pure hellish horror; it felt like staring into an endless abyss of darkness and despair."
    },
    {
      "rating": "8",
      "text": "So much later horror takes a lot from this movie. The mise-en-scene is a terrific example of how to make the audience terrified and tense. While the acting is terrible, given the low budget, this is a phenomenally directed slasher."
    },
    {
      "rating": "8",
      "text": "When Sally (Marilyn Burns) hears that her grandfather's grave may have been vandalized, she and her paraplegic brother, Franklin (Paul A. Partain), set out with their friends to investigate. After a detour to their family's old farmhouse, they discover a group of crazed, murderous outcasts living next door. As the group is attacked one by one by the chainsaw-wielding Leather-face (Gunnar Hansen), who wears a mask of human skin, the survivors must do everything they can to escape. Thanks to a smart script and documentary-style camerawork, The Texas Chainsaw Massacre achieves start-to-finish suspense, making it a classic in low-budget exploitation cinema. I give The Texas Chainsaw Massacre (1974) an A-."
    },
    {
      "rating": "5",
      "text": "Hooper's adaptive gore vision is frankly too much even for the the audience of this genre.The Texas Chain Saw MassacreHooper's adaptive gore vision is frankly too much even for the the audience of this genre. There is one thing to exaggerate in order to leave a scaring harrowing impression on you to communicate the magnitude of the stakes and another to just mess with you. And yes, that is probably the reason why no matter how much you keep yourself reserved from it, this tale does get you and it is because Hooper is enjoying himself. His clear and- contrary to popular belief- clean vision is what amps up the ante of this ambitious project. This indie low budget cinema is actually an inspiring case for the newcomers out there to choose both style and substance through brilliant execution.Now coming down to the cons, it is annoyingly loud and not just the screaming but its repetitive nature that it is fixated on. It makes sure everything is double checked, it is productive but also at times irrelevant, few deaths could have been lopped off. It is more mano-y-mano than your usual horror drama, it also resembles eerily with Halloween, the concept may be shared by Hooper, but his pathos cynicism cannot be matched. To add more to its troubles, the solution of the antagonist doesn't even exist. It gets so brutally loud and poignant that you feel paralyzed to its circumstances and leaves you floating in its abyss.The performance is another weakness of it, that itches you throughout the course. Neither the frightened actors are able to express the fear nor the people on the other side of the door are dogmatic enough to give you the chills. The Texas Chain Saw Massacre is a mind numbing tour gone wrong case, it has its moments that stays with you, but it surely isn't something you'd be able to trade with for its unnerving psychology."
    },
    {
      "rating": "3",
      "text": "Movie full of mindless murdering, I really dont understand why this movie gets so much praise."
    },
    {
      "rating": "10",
      "text": "Historia, roteiro, visual, pra um filme da época e que foi titulado como um dos 1* slashers, um filme muito bom, vale muito apena assistir e assistir denovo, classico"
    },
    {
      "rating": "9",
      "text": "The chase scenes are some of the most terrifying I've ever seen.Something about the way they are shot. With Leatherface always behind the victim.He's always getting closer.It really makes you feel like if they stop running, if they get too tired, they're dead.This entire movie is shot really well.Ugly and beautiful looking at the same timeIt's incredibly disturbing and it feels very real.Some scenes go on for a bit too long, but this is one of the most intense horror movies out there.It's exhausting, in a good way"
    },
    {
      "rating": "9",
      "text": "This movie was one of the first good slasher movies and an immediate classic."
    },
    {
      "rating": "7",
      "text": "This is a decent horror movie. It’s definitely influential in the horror genre, but I don’t think the influence is as drastic as certain fans may portray it to be. The concept of violent depravity wasn’t new (Last House on the Left); the concept of backwood delinquents wasn’t new (Deliverance); the concept of cannibalism wasn’t new (Cannibal Holocaust). What this film did was take those taboo subjects and put them in a movie that was offensive enough to garner attention, but, at the same time, easier to play to a wider audience than the previously mentioned films. It more or less just IMPLIES, or simulates, the worst things that happen in the story so that they still happened but the film could avoid being censored. The “controversy” surrounding the film also helped push it to the mainstream, but that seems to be more of a result of this film capitalizing on the organic controversy that the previously mentioned predecessors actually garnered. The story was written in a way that when people recounted the movie to friends, it made the movie seem worse than it really plays out. In all honesty, with all respect for its influence on the genre as a whole (which is overblown), you have to really be able to drown out the constant screaming of the lead actress to enjoy the last third of the movie. Plus, the “smart writing” that I saw described by much more informed critics must have been from another movie since these characters seem to be on Valium; aside from the main girl, who seems to suffer from schizophrenia. Don’t expect this film to be what critics play up to be. If you’re looking for a real classic 70’s horror movie, The Exorcist and Halloween are far and above this one, hands down."
    },
    {
      "rating": "4",
      "text": "I went into this movie with high expectations because of its reputation. And had I seen this in 1974 when it was released, those expectations may have been met. But that is not the case.The plot was good but not detailed. It had so many gaps. The acting was bad especially the last surviving girl who just kept screaming till the movie ended. There was no scene which made any impact except the the scene when we are first introduced to Leatherface. The pace was good and running time was also sufficient. But at this running time they could have easily made a detailed movie, which they didn't.Overall, I do not understand how this movie became so popular. If I saw it when it first came out my opinion might be different but for now, I didn't like it that much."
    },
    {
      "rating": "10",
      "text": "Masterpiece Masterpiece Masterpiece Masterpiece Masterpiece Masterpiece Masterpiece"
    },
    {
      "rating": "10",
      "text": "This horror classic is a grisly descent into a nightmare of a situation. The whole thing is unsettling from the get go as the teens pick up the greasy hitch hiker and have to deal with his unhinged lunacy. I also like the foreshadowing of the first kill as Franklin talks about the slaughterhouse methods. It's all the more jarring when the first guy it hit with a hammer and begins seizing on the floor before being put down and concealed by the iconic steel door slam. From there the group is whittled down in exceedingly scarier ways. It is a tour of grisly depravity and shocks at every turn. If you've not seen this movie yet, you're missing out."
    },
    {
      "rating": "9",
      "text": "This was very unsettling and disturbing, the last 30 minutes is a wild ride, legit shock when the grandpa stuff starts kicking off."
    },
    {
      "rating": "8",
      "text": "Acting of the villains was cool, good pacing, super creepy asthtetic, main charecters could have been more interesting, but overall a great film"
    },
    {
      "rating": "7",
      "text": "Solid, enjoyable horror movie. I don't have a whole lot to say about it but it's fun."
    }
  ]
}