{
  "id": 1058,
  "title": "The Electrical Life of Louis Wain",
  "starring": [
    "Benedict Cumberbatch",
    "Claire Foy"
  ],
  "runtime": 111,
  "genre": [
    "Drama",
    "History",
    "Comedy"
  ],
  "description": "The extraordinary true story of eccentric British artist Louis Wain, whose playful, sometimes even psychedelic pictures helped to transform the public's perception of cats forever.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zWtI3BI6dnfwRIr7xk2xC84Zian.jpg",
  "categories": {
    "plot": 7.875,
    "acting": 7.4,
    "ending": 8.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This true story is about the titular British artist (played by Benedict Cumberbatch), who was eccentric, neurotic and wildly talented. He became famous with his “humanized” paintings of cats in the 1800s, but he also went thru a number of endeavors, struggling to help the 5 women in his family avoid poverty, while falling in love with their governess (Claire Foy). The first 30 minutes of this film are delightful, quirky fun, but as the story progresses it turns from sweet to rather dark. Throughout, Cumberbatch creates a wonderfully peculiar character who’s funny, sweet and ultimately charming. Visually, there are picturesque moments that sometimes reflect the artist’s work. Will Sharpe’s direction amiably captures the beauty and bleakness of the narrative, but can’t manage to keep the final third from losing some of the charm momentum. Still, there’s a unique approach to this film that make it enjoyable, esp. Cumberbatch’s performance."
    },
    {
      "rating": "8",
      "text": "Quite a surreal, moving, charming movie. The two leads are well matched and other than the big age gap between Louis and his wife (in real life) they stuck to historical facts quite doggedly. Quite unlike anything I've seen before and it was unpredictable as well."
    },
    {
      "rating": "6",
      "text": "A dedicated performance by Benedict Cumberbatch fails to elevate this uneven drama that desperately seeks a direction.The contrived tone that pervades most of its running time makes me wonder if this was the approach intended by its makers, or if they simply never sought to give the material more seriousness.Either way the mix is not the most adequate, but at least the work of the cast is enough to keep the rest of the story from getting lost in oblivion so easily.However, I doubt this film will be mentioned again in the future when talking about them and their work."
    },
    {
      "rating": "8",
      "text": "The Electrical Life Of Louis Wain – Challenges Us To Feel Some films can firmly claim to be one-of-a-kind, such as; ‘The Life of Pi’, then there’s this one, about a painter I had not heard of from the late eighteen hundreds. Louis was a tortured fellow bordering on several psychotic spectrums while being extremely gifted in the arts, etc - leaving behind his remarkable (and much copied) Cat paintings that took the era by storm.  Its style is dazzling all the way, and impresses on many levels – it starts off with a rather convoluted opening, that may not suit viewers with a short attention span or an impatience for understanding what drives a character’s actions.  This is a fact-based story running the gamut of human emotions - seeking to open doorways into the lives of troubled souls who existed during unsympathetic, and rather medically ignorant times (think also of Van Gogh). Production design, performances, cinematography and, music are exemplary, leaving patient audiences with a unique and precious gift. Director, co-writer, Japanese/English Will Sharp is no stranger to Bipolar disorders being type 11, and injects powerful understandings into Louis’s character.  Will’s brother, Arthur Sharp, imparts wonderful emotional support supplying a stand-out Theremin based music score. Story writer Simon Stephenson has created a rich human experience giving us much to feel and think about (perhaps there’s also a nod to Australian pop artist Martin Sharp here).   One aspect that created a little disappointment was the decision to photograph in a variation of the old 4 x 3 frame. It added nothing to the story, in fact, gave the film a cramped, claustrophobic feel, that can be better achieved in production design.  Modern moviemakers sometimes, mistakenly, think they need to go backward - away from the vast improvements in aspect ratios, this can sacrifice vital elements within their work.  The end credits were neat but why so small?   Otherwise, it’s quite a special experience from Studio Canal and Amazon Studios."
    },
    {
      "rating": "7",
      "text": "Flew by, did 'The Electrical Life of Louis Wain'.It's a well paced film that holds solid emotion to it, while it's nicely acted by the likes of Benedict Cumberbatch and Claire Foy. I dig the costumes/set designs too. It also gets bonus points for cats, because... cats. It's not a perfect film, for example the humour is quite off, but it's definitely an interesting watch. I knew nothing about Louis Wain beforehand but that didn't hamper my enjoyment, fwiw.Cumberbatch is very good as the main man, he brings across all the quirkiness and necessary emotion of Wain. Foy supports strongly, I loved her in 'The Crown' so I'm happy to see more of her. Speaking of that television show, her successor on it, Olivia Colman, is also involved; as narrator. Andrea Riseborough also stood out to me, while I note the appearances of Toby Jones, Adeel Akhtar (Wilson Wilson, to me!) and, unexpectedly, Taika Waititi.I almost gave this 3½*, but I think 3* is about right. Good film."
    },
    {
      "rating": "9",
      "text": "The Electrical Life Of Louis Wain is a beautiful looking film that amazingly written and perform, it's an amazing true story film that captured exactly the same like what Louis Wain himself do, as a painter, the movie looks gorgeously shot and sometimes the shot is really like a real beautiful painting, it's so gorgeous, Benedict Cumberbatch performance is simply one of his best, the score was beautiful, and despite one cons of the film that i have which there is some quite a lot of scene in the film that feels slow but not bad, the movie overall is still great."
    },
    {
      "rating": "10",
      "text": "A curious, poignant blend of auteurial whimsy & biopic. Cumberbatch in his wheelhouse but oh SO good at it, a grounded Foy (together making magic), and the great Toby Jones. Can’t wait to see where director Will Sharpe goes next. A unique visionary."
    },
    {
      "rating": "10",
      "text": "This movie was amazing and fun although poignantly sad in some parts. Through the great acting, the vulnerability and beauty of the characters are captured perfectly.  You really get pulled into the story, how one man, perceived as odd was able to change public perception of cats"
    },
    {
      "rating": "5",
      "text": "Amazing film and amazing acting - cried throughout. Benedict plays this role incredibly."
    }
  ],
  "recommendations": [
    "finding_neverland",
    "anna_karenina",
    "carol",
    "the_grand_budapest_hotel",
    "dances_with_wolves",
    "the_dig",
    "chocolat",
    "belfast",
    "nocturnal_animals",
    "american_beauty",
    "the_walk",
    "youth",
    "motherless_brooklyn",
    "amadeus",
    "loving_vincent",
    "phantom_thread",
    "the_great_gatsby",
    "21_grams",
    "20th_century_women",
    "spencer",
    "the_light_between_oceans",
    "thoroughbreds",
    "jackie",
    "the_master",
    "the_english_patient"
  ]
}