{
  "id": 3881,
  "title": "The Five-Year Engagement",
  "starring": [
    "Jason Segel",
    "Emily Blunt"
  ],
  "runtime": 124,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Exactly one year after Tom meets Violet, he surprises her with a wedding ring. By all accounts, Tom and Violet are destined for their happily ever after. However, this engaged couple just keep getting tripped up on the long walk down the aisle.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/drsY910CSoSkROYypNVwUxI875T.jpg",
  "categories": {
    "plot": 5.625,
    "acting": 5.35,
    "ending": 6.333333333333333,
    "soundtrack": 3.5,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.416666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Sounds and music effects created this childish atmosphere in complete contrast to the story of two adults, having decision-relationship-life problems. That's a characteristic in dramedies, but because the line is toо thin, most of them fail to be either funny or exciting/interesting. Plus characters were unlikable and annoying. The film could be at least bearable, if it doesn't last so long."
    },
    {
      "rating": "5",
      "text": "There's no doubting that this 'Engagement' is well-over-due, standing in at about 124 minutes, it tries arduously to remain funny, smart, and slickly-written, but not even its cohesively-paired leads can keep it afloat of the persistent rawness that just won't let it go. Drowning and ultimately running out of gas from its incessant unevenness, and pacing, 'Engagment' is a few edits away from being several notches above the average rom-com, however, as is, neither the supporting characters' development, nor the much-needed tightening of its improvised sequences are made apparent. Although Blunt (Violet Barnes) and Seigel's (Tom Solomon) performances will be more than enough to pacify casual followers of the genre--even despite the impressive degree of realism derived from two and the central premise--it's simply not funny enough to rationalize its overlong trip of meandering. And, while Blunt and Seigel, together, make a great team, they very quickly, lose empathy from audiences, who after, say, 80 minutes, are no longer interested in watching them anymore, or even concerned with what happens next; this too, especially for the casual moviegoer--the intended audience--becomes more of an exercise in patience than an outing of pleasure. In short, 'Engagement' isn't short enough."
    },
    {
      "rating": "3",
      "text": "Blunt and Segel are both very good.  I see them both being very successful in both comedy and drama.  They are both in the select category of actors who act with their entire faces.  Many of the supporting actors were quite good as well.  Sadly, the film wastes their considerable talent.  The film is just too full of raunch with no good explanation why.   Too few truly funny scenes and way too many ugly, raunchy, awkward scenes which added nothing to a good story idea, only made the movie too long."
    },
    {
      "rating": "7",
      "text": "I found myself laughing HARD at many lines and situations throughout this film.  It's not the most original story, but I love the way the writers and directors really put out for laughs.  They dwell on the funny and the pervers, and it pays off.  The lead actors are solid, but the variety and skill of the very broad supporting cast truly made the film. So yes, I definitely recommend the film - just don't expect Wedding Crashers, Old School, or even Forgetting Sarah Marshall.   Just go in ready to laugh at some off-center humor."
    },
    {
      "rating": "10",
      "text": "Jason Segel's films all suffer from the same two problems:  editing and raunch.  It keeps his movies from being classic chick flick comedies and relegates them to the status of mild chucklers soon forgotten.  The funny gets lost in a sea of pointless footage.  Since women are a primary audience for films like this, I think it's better to err on the side of less raunchy humor. No woman ever left a movie yet saying, \"I wish there had been more raunchy humor.\" Watch Love, Actually to get the feel of how to do this.  It may just be the difference between what constitutes raunchy to a male producer... and if so, maybe hire woman editors."
    },
    {
      "rating": "7",
      "text": "I heard very many mixed reviews of this movie so i became very intrigued. I decided to finally see it and i found myself walking out of the theater with a smile on my face. Its one of those films you become very attached to, and you actually feel what the characters are feeling. I thoroughly enjoyed this film. The only issue i found with it is it was overly long. It dragged on at different points throughout but overall it was a good film. I'm actually a pretty big Jason Segel fan, hes a very good actor, and also a veryy good writer as well. I am also a big Emily Blunt fan too so it was definitely a great cast in my opinion, all in all this film was great and it will leave you with a smile on your face, not to spoil anything, but everybody knows how these films end. Great writing, great cast, laugh out loud comedy, drags a bit through the middle and leading towards the end but overally this is a good film. 7/10"
    },
    {
      "rating": "8",
      "text": "This move was HILARIOUS! So much better than \"Bridesmaids\". Extremely well written, a little awkward and slow at times, but overall great cast and great script! GO SEE IT! One of the better movies of the year."
    },
    {
      "rating": "9",
      "text": "The excellent performances overcome a mostly predictable plot. Nevertheless there are some very funny scenes which make the film light and breezy and of course , enjoyable."
    },
    {
      "rating": "9",
      "text": "I this movie was HILARIOUS!!! they could have done a little better when it came to casting, however.... I do recommend you see it. you will be laughing ur booty off!!!!!! -THANKS!!!!!!!!!!!!!!!! -Me"
    },
    {
      "rating": "9",
      "text": "This was an extremely funny movie. Jason Segel's writing was brilliant and his acting matched it. Emily Blunt was delightful. Not quite as funny as Bridesmaids, but close. The movie may have been a little long but it was so funny that I didn't care. A must see."
    },
    {
      "rating": "7",
      "text": "Blunt and Segel play a charming couple that you root for throughout the film. Their dynamics were always spot on and I never once viewed their interactions as \"acting\". Very sincere. Unfortunately, the secondary characters were either over shadowed or were not up to par either comically or emotionally. Not believable. I was surprised by the amount I enjoyed this picture as am not a major fan of Apatow. As a rule I try to stay away from anything he has his hands in. Overall, funny, romcom that dudes can like."
    },
    {
      "rating": "10",
      "text": "Works  on nearly every level. It's clever, funny and self aware. Segel has the ability to draw us in, make us feel something deeper than we're accustomed to. I like that. I like that a whole lot."
    },
    {
      "rating": "5",
      "text": "The classic case of a movie that should have been 95 minutes being extended, to its own detriment, by 30 minutes. The good: Jason Segal and Emily Blunt have terrific chemistry and it's easy for a lot of people to empathize with their situation.  The bad: the movie is very chatty, the supporting cast doesn't add a whole lot and are annoying at times, and it drags in several sequences that could have been powerful."
    },
    {
      "rating": "1",
      "text": "More like the Five-Year Coma. Boring and depressing characters and dialogue, made worse by the fact that most of the movie is set in the perma-depressed, Detroit."
    },
    {
      "rating": "3",
      "text": "It is such a pity as this movie has a really sweet movie somwhere in it!! I really wanted to like this and have really enjoyed all the other segel/apatow etc productions, but this movie just seems confused. It starts out as a rom com and quite a good one at that, but then all of a sudden it becomes a gross out comedy...then back to a sweet movie...then gross out...and so on...aaaaaghh!!! Its tone is way off and i just wish they could have stuck with what worked and not tried to squeeze in every toilet and f%%$# joke out there!!"
    },
    {
      "rating": "3",
      "text": "What a drag!  Worryingly enough the title should have been a clear give away that this would be a long and tedious process, but I didn't listen.  And it felt sooooo stretched out and ironically unengaging!"
    },
    {
      "rating": "5",
      "text": "The title pretty much sums it up. Jason Segel and Emily Blount are madly in love, but her career causes the delay. It gets predictably, mildly complicated from there. This is a mediocre chick-flick that tries to spice things up with lots of dick jokes and four-letter words. It is mildly amusing, but nothing about the dialogue, situations or performances elevates into any memorable category."
    },
    {
      "rating": "3",
      "text": "They're are a lot of people who are not me who would probably love this.  I lived in San Francisco for 20 years so I enjoyed how beautiful the city is as a background.  But I'm not a marriage person and I would have preferred a little less Anglophilia (even though Emily Blunt is the star).  But I can see how lots of people would think this was 'super cute'.  And it was, until suddenly it wasn't anymore (about an hour in). Good looking people, commonly quirky situations, and very generic/middle brow wit.  If you are part of a couple contemplating the 'big plunge', put this on your cue.  If you're a confirmed bachelor/bachelorette, or not in a couple..it can wait.\rETA;I'm going through an Anti Social-Programming phase and THIS film absolutely warns of the dangers of not conforming to social expectations.  If you're okay with cute little lessons in 'how to be normal' but still acceptably quirky, then this is definitely for you.  If you don't care to walk the same path as every other person who every pretended to be happy and don't need another example of how to do it, avoid this.  It's just the same couple you've seen a million times."
    },
    {
      "rating": "5",
      "text": "I like Jason Segel, and I think Emily Blunt is fantastic in this movie. On paper this movie should have been a lot better, but clocking in over two hours?! This film is dragged out far too long and there's really very little to be excited about, or laugh at. The jokes are few and far between and around the one hour mark I just wanted it to be over. Cut about 40 minutes out and it could be a lot more solid."
    },
    {
      "rating": "6",
      "text": "A romantic comedy that actually provides a mature look at relationships and marriages while bringing some truly hilarious moments to the table. It's true this movie can be very funny at times, but ultimately I feel that it falls short of being, what I would call, a good movie. Instead it manages to be a decent experience with some hilarious moments. What made the movie fall short for me was the two lead characters. I just didn't care about them or their relationship that much at all. Combine this with the fact that 99% of the humorous moments come strictly from the excellent supporting cast (Kevin Hart!) and it's not hard to lose interest in the main characters. Honestly I wished the movie focused more on the supporting cast. In the end it's an ok movie, and there are some touching romantic moments, but for me the whole movie just kind of fell short."
    },
    {
      "rating": "2",
      "text": "I love Jason Segel... normally, but after The Muppets and then this he should give up writing. this is truly one of the worst romantic comedies I've ever seen."
    },
    {
      "rating": "6",
      "text": "The first half was like yeah that's it , a classic way to start a good Rom-com . Story going reat , some funny moments , funny jokes nice impressions . But after the first half it was like so boring ! even the actors was like they got so bored doing the film . it wasnt funny then and the story went rom-com to crappy drama . This could have been a great rom-com if they would look into the story/script more !"
    },
    {
      "rating": "3",
      "text": "it has a few funny moments . The jokes are overrated, it feels like if Nicholas Stoller [ writer, director ]  is tired of doing this . The timing in the acting with the secondary actors is so bad, and the music even is by itself good ... gets cheesy 3 or 4 times . The runtime is 124 min but if you decide to watch it you are going to feel like if it lasts 3 1/2 hrs ."
    },
    {
      "rating": "3",
      "text": "It's a pity the humour got lost along the way, I mean, the film was funny to begin with, but the jokes just became so few and far between. About halfway through the film, I was wondering if the painful drag out to 2 hours was ever going to end. I mean, if this was supposed to be a romantic comedy, it suddenly became a headache-inducing bore-fest. There were so many scenes that could have been removed and many of the characters apart from the main ones became incredibly pointless. If it wasn't for my sister, I would have dived out of the cinema the second I realised I was wasting my time."
    },
    {
      "rating": "10",
      "text": "Finally, a romantic comedy which does not take the same ol story template and puts whatever pretty boy face on the cover.  very original writing and mature.  EG. how many romantic comedies to you watch where their career actually has any influence on the story?"
    },
    {
      "rating": "7",
      "text": "The Five-Year Engagement is definitely unique, that's for sure. It's a romantic comedy that's not really all that romantic or funny. It's not really entertaining at all but it is well made with solid acting and a great cast. While it doesn't have much in the way of entertainment value, there's something very pure and real about the story being told that I think anyone could relate to. It almost felt like a modern-day satyr play in cinema form with the way the tragedies of life were very subtle and almost brushed aside but yet still powerful regarding the plot development. And while this certainly wasn't my favorite Jason Segel movie, it's still worth watching; It just wasn't really what I expected. Emily Blunt is stunning as usual. How she doesn't get more mainstream recognition for her beauty, acting ability, and versatility is beyond me. Also, the minor cast members and cameos really stood out and almost stole the show. Chris Pratt and Alison Brie were absolutely hilarious as were, well, just about everybody else. Honestly, Segel and Blunt might have been the least funny characters in the film. I think that's part of why they stood out so much though as relatable protagonists."
    },
    {
      "rating": "1",
      "text": "This movie was a straight TURD. It never gets going and it is depressing to watch. Instead of feeling engaged in the movie you feel put off by it and it makes getting engaged seem like a drag. The writers were trying to too hard to get laughs and the whole donut thing was a total waste and awful analogy. Writers these days are trying to be too outlandish and weird and this movie is a great example of when it doesn't pay off."
    },
    {
      "rating": "6",
      "text": "This was an above-average comedy that made two grave errors.  The first was attempting to stretch and hour-and-half worth of jokes and plot into a two hour time frame.  The second was creating selfish, unsympathetic leads."
    },
    {
      "rating": "8",
      "text": "Does a lot of coasting at a lengthy 130 minutes, but Segel and Stoller's show makes up for the drag by breaking up the filler with heartfelt humor and hilarity."
    },
    {
      "rating": "7",
      "text": "This review contains spoilers, click expand to view. The Five-Year Engagement is surprisingly a decent movie.I`t had a bunch of funny lines. Personally I loved when they made fun of him for moving from San Fran to Michigan, cause really who would want to be a Chef in Michigan when you was one in San Fran."
    },
    {
      "rating": "7",
      "text": "As long and tedious as it may get, I never checked out of \"The Five-Year Engagement's\" endlessly entertaining story. The lovably adorable couple at the film's center - as well shockingly funny humor throughout - elevates this indie-esque comedy above the droll nature of its inferior cohorts."
    },
    {
      "rating": "8",
      "text": "The rare romantic comedy that is a real movie, rather than a series of genre conventions. And it doesn't shrink on the comedy in deference to the romance. There were also a healthy dose of melancholy sequences to make everything more real."
    },
    {
      "rating": "9",
      "text": "This is a funny movie with a lot of heart.  Segel and Blunt have great chemistry which leads to some very funny and heartfelt moments.  The film maybe a tad long, but overall a very fun time."
    },
    {
      "rating": "6",
      "text": "This type of romcom is new, and feels very fresh. It has very little movie clichés in it, and tries to avoid them completely. Instead, it goes for being different and quirky, and somewhat funny. The story and plot points are weak in the middle, but the beginning and end are definitely worth it."
    },
    {
      "rating": "7",
      "text": "The failure of this film to capture the imagination of the american public can be attributed primarily to the american public's inability to tolerate films of any subtlety, preferring overt comedies and overt dramas to mixed bunches such as these. A good film, and self-explanatory."
    },
    {
      "rating": "8",
      "text": "writer-director Nicholas Stoller and co-writer/star Jason Segel make a great team, the script's humor is charming and even though it's  not original we've have sort had the feeling we have seen the same romantic comedy, they make it work! The dialogue is funny and heart felt it takes a cliche'd formula and turn into and a good comedic one. Segel and Blunt have sparkling chemistry you know that their trying their best and have a charming relationship off screen. This comedy that producer Judd Apatow produced is not a \"Apatow\" raunchy comedy which is fine. My problems with the film is that It should have been shorter. Grade A-"
    },
    {
      "rating": "6",
      "text": "The Five-Year Engagement is a romantic comedy that is more romance than comedy and its too bad considering the cast. Its so hard for Jason Segel to be not be hilarious but I really didn't find him funny and Emily Blunt was not overly funny either. The people who are funny in the movie are the supporting cast, which boasts Chris Pratt, Kevin Hart and the underrated Randall Park. The movie is also quite a bit too long, which is a common problem for Judd Apatow's films (although he only produced this film)."
    },
    {
      "rating": "5",
      "text": "you should do what you feel is right..The Five-Year EngagementThere are few scattered but good ideas and they are depicted with all the conviction but these kind of movies work on actors and it is quite clear that weren't able to pull it off."
    }
  ]
}