{
  "id": 1597,
  "title": "The Happening",
  "starring": [
    "Mark Wahlberg",
    "Zooey Deschanel"
  ],
  "runtime": 91,
  "genre": [
    "Thriller",
    "Science Fiction"
  ],
  "description": "When a deadly airborne virus threatens to wipe out the northeastern United States, teacher Elliott Moore and his wife Alma flee from contaminated cities into the countryside in a fight to discover the truth. Is it terrorism, the accidental release of some toxic military bio weapon -- or something even more sinister?",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v1Cw6WaCjNqInpAzUwbXB4LGgoX.jpg",
  "categories": {
    "plot": 2.75,
    "acting": 2.8636363636363638,
    "ending": 2.3333333333333335,
    "soundtrack": 7.5,
    "cinematography": 2.3333333333333335,
    "familyFriendly": 3.0,
    "funny": 4.142857142857143,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "No more time in this world should be wasted on this film"
    },
    {
      "rating": "1",
      "text": "He is a pathetic human being who (now) lacks talent and should be sued and placed in jail for defrauding hard working viewers of their $10.00. He is truly a pathetic human being and a bad person for duping us out of our money with this banal movie about nothing. I have no respect for him as a human being and won't ever mention his name or support his work again. I hope he goes bankrupt and his poor storytelling ends forever!"
    },
    {
      "rating": "5",
      "text": "If you're going to see an M. Night Shyamalan movie, you're going to be disappointed. This isn't a good movie at all really. What it is is a cheesy horror flick with a budget. The music and cinematography is great, but the mood is sort of ruined as a whole. If you go into this movie, expecting to crack jokes and laugh, then you'll have a slightly better time. I honestly think if the focus was more on the story, and less on the shock, it could've been better. This is coming from a long time fan, I enjoyed all of Shyamalan's previous works, including Lady in the Water, but The Happening was legitimately bad. I won't hold this against him, though; even the best film makers have made a bad decision, and I still regard him as one of the best film makers of our time. He should just stay away from B-horror movies in the future."
    },
    {
      "rating": "1",
      "text": "I'm actually angry that I contributed to this weekend's box office gross for this film."
    },
    {
      "rating": "8",
      "text": "I am surprised by all the horrible reviews. I'll admit, there was some bad acting, but overall, I loved this movie. I though the premise was timely and I enjoyed the suspense. If you like movies about escape and survival, you like this one. I felt it was thought provoking and a lot of fun to watch. I'm sorry critics are being so harsh and I think it's unjustified. I'm not sure why Shamalyan is getting so badly skewered here. It does not make sense to me. See it and decide for yourselves."
    },
    {
      "rating": "7",
      "text": "I found The Happening to be much better than most of the reviews led me to believe. Solid performances from a good cast. Shyamalan creates a sense of dread from the very beginning that effectively builds through the first half of the film. Creepy scenes of death are punctuated by humorous touches throughout. An enjoyable homage to end-of-the-world B movies. Exactly what Shyamalan set out to make!"
    },
    {
      "rating": "5",
      "text": "One of the funniest bad movies I have ever seen and in my opinion, it's up there with The Room. This film is just dumb, dumb, dumb. The premise, plot and its logic don't make any sense, the concept and execution of the neurotoxin or plant or whatever it is that makes people commit suicide is laughably bad, the actors are dull and boring and it's not scary at all. In fact, it's absolutely hilarious. If you don't take this film seriously , you might get many hilarities when there's a really dumb or over the top moment. In a broader prospective, it's Shyamalan at his usual worst. A very stupid film."
    },
    {
      "rating": "5",
      "text": "While this movie doe s pose an idea that could have been made into something interesting, M. Night Shyamalan fails to tell us a compelling story with characters that don t make you want to slit your wrists every time they open their mouth, or do anything. Mark Wahlbergs acting is horrible, the little girl acting was better. The suicide scenes become distasteful. The character actions are unbelievable to the circumstances. M. Night Shyamalans earlier work was good, this is not. Pass."
    },
    {
      "rating": "5",
      "text": "Despite pulling off one or two tricky shots, \"The Happening\" is severely undone by its vastly distasteful screenplay, filled with implausibility, unforgivably strange characters, and painful dialogue."
    },
    {
      "rating": "1",
      "text": "An aesthetically beautiful mess of a film featuring terrible casting, actors given bad direction, awful pacing, nonsensical 'bad lip-reading' style dialogue and a poorly delivered-yet-somehow interesting plot. \"What? No...\""
    },
    {
      "rating": "0",
      "text": "I heard this movie was awful but that doesn't even begin to describe how terrible it is."
    },
    {
      "rating": "2",
      "text": "I understand that Shyamalan can have a very particular style and specific angles he wants to define. That being said, this movie, while having interesting ideas tossed around, finished with nothing but gore and jibberish for acting. I can see that the approach is that maybe plants have the capacity to effect the human brain and its processing. So due to that it makes everyone's interactions with each other just odd and confusing. In that sense, the performances were not that bad. But that doesn't make it an entertaining experience. This is disappointing because I know there was a lot of wasted talent and ability here. It is an interesting idea to think the planet could get defensive against humans in that way but in the end I think Shyamalan tried too hard. There were a lot of positive elements that were in the wrong places. The genre wasn't really all that clear either. Pretty graphic and gruesome, while being light and humorously sarcastic almost...I mean what is going on? I am confident there was a well defined point in the director's mind but how it was relayed and delivered was too cryptic. Its just like, what are you trying to say here? Because whatever it is, its not getting across. There was no emotional time to connect to any of the characters and relate to them, there was no self involvement in the struggle. Whatever the struggle was exactly...  Definitely a dip in Night's consistency in movie making."
    },
    {
      "rating": "3",
      "text": "M. Night is at it again bringing us a... really bad movie. However, its a great party movie that your friends and you can laugh all night at. But if you're looking for a movie to analyse, this probably isn't the one to watch."
    },
    {
      "rating": "0",
      "text": "The Happening is one of the most hilariously bad movies I have ever seen. This is up there with The Room in terms of cinematic disasters. I don't know what M. Night Shyamalan was thinking when he made this, but boy am I glad he did. Mark Wahlberg and Zooey Deschanel give stupefying performances. The cinematography is overly dramatic and boring at the same time. The script is puzzling at best and downright incomprehensible at worst. If you love bad movies, make The Happening one of your movies!"
    },
    {
      "rating": "3",
      "text": "Only some scenes were decent, the acting was decent at times, but it was overall dumb and showed little to no violence, and is just there"
    },
    {
      "rating": "0",
      "text": "Awful dialogue. Horrible acting. Ridiculous plot. I’D GIVE NEGATIVE 10 IF POSSIBLE"
    },
    {
      "rating": "10",
      "text": "Finally Score = Planet 1, Humans 0, I see Genius where humans took a back seat and you can tell by these ignorant reviews how lost we really are and sensitive to the possibility of nature being sensitive and defensive too. Truly a masterpiece and respects to all participants in down playing humans and upscaling the breathing breeze."
    },
    {
      "rating": "9",
      "text": "I rather pay for this than pay for other hero doing tha same."
    },
    {
      "rating": "2",
      "text": "There was a time when the name M Night Shyamalan was effectively a synonym for the new generation of  writing: plots that could turn on a dime, characters that were interesting, and generally movies that could be counted on to be interesting and a good use of your time. Well, that era appears to be over. So let's run down The Happening. On its positive side (and there is a considerable positive side), it is a unique execution of an uncommon premise: the environment has turned on us. But unlike most previous versions of the plot, this isn't about animals rising up en masse against us (whoops, sorry James Patterson...but Zoo was a real piece of cheese), but rather nature subliminally convincing us to do the dirty work for it. So, neat twist on a not-new idea. Unfortunately, though, Shyamalan's \"new approach\" completely wrecks what could, should have been an outstanding movie. Remember that in all of  great works...and Shyamalan's early stuff...that they held to a basic maxim: tension is built most by not letting the audience see. Keep them guessing and off-balance.  knew it, and Signs did it, too. (So did The Village, but a little less so.) The Happening? Total screwup. Where the camera should cut away, it doesn't. Shyamalan completely jettisoned any hope of creating an atmosphere that keeps the audience off balance. Instead, the film goes for splatter-gore shock value, and it goes way over the top. Where there used to be finesse in these films, all that is present in The Happening is the most pedestrian, hamfisted attempt to rattle the audience. What should have been a shocking nature-doesn't-like-us film ended up being Maximum Overdrive with trees. The sad part is that the plot had some actual ability to work; it didn't have to be a self-parody, but the absolutely classless, talentless writing doomed it. Characters were wooden and unconvincing, but NOT because Mark Wahlberg or Zooey Deschanel did a poor job; they did well with what they were given. The problem is that they were given drivel. Wahlberg was, well, Wahlberg. He really doesn't have a lot of gears as an actor, but he is dependable. Deschanel turned in a surprisingly touching and believable performance which was quite out of place in this pile of junk. (Allow me to clarify: the surprise was not that Zooey Deschanel could turn in such a performance; we know she can. What's surprising is that she was able to do that with this bucket of sludge script.) So, frankly, when you get right down to it, you do not watch The Happening because you want a cerebral, atmospheric thriller. You watch it because...well, frankly, I can't think of a reason to watch it deliberately. Maybe if you're a fan of splatter-horror. But for everybody else, there are much better things to watch. Much better. A sorely disappointed 2 out of 10 for the total misfire that was The Happening."
    },
    {
      "rating": "1",
      "text": "This is what you call a joke. Mark Wahlberg was absolutely terrible. The story was disgraceful. Bad cast, story feels long and drawn out for a 90 minute film. The Happening is just another flop from M Night"
    },
    {
      "rating": "8",
      "text": "I don't get why so many bad critics xD the movie was good! No special effects needed, just nature to scary us. And also there were funny moments followed by creepy ones. It was definitely NOT a bad movie."
    },
    {
      "rating": "1",
      "text": "Ugh, what a waste of time, not really a spoiler but it's basically a bunch of people killing themselves, and that's it. The whole mystery element gets lost when you realize that the answer is pretty simple and just downright boring. Not to mention the seriously bad acting, although I suppose you could blame that on the 5 year-old that wrote the script, I mean seriously, in some situations I was expecting the actors to just burst out laughing, and at some points it looked like Zooey Deschanel really, reeeeaaallyyy, REEEEEEAAAALLLLLYYY wanted to, and I honestly can't blame her. It was like all the actors involved sort of gave up half-way through probably thinking to themselves \"well, this piece of junk movie isn't going to sell itself on it's story, hopefully our lackluster acting will convince people to want to watch it just for ****s and giggles\""
    },
    {
      "rating": "7",
      "text": "A decent B grade movie which stays true to its genre.If you go with low expectations you will be entertained."
    },
    {
      "rating": "8",
      "text": "A ferociously entertaining thriller with sympathetic characters, stunning set pieces and pulsating excitement. As viscerally compelling as smash-mouth filmmaking gets. It is brutal and almost exhaustingly terrifying, as any respectable zombie movie should be. It is also bracingly smart, both in its ideas and in its techniques."
    },
    {
      "rating": "6",
      "text": "This movie is OK at best. It's decently fun to watch but most of the performances are just so down right terrible its hard to believe the amount of hype and marketing behind such a let down. M. Night better make a good film and make it fast."
    },
    {
      "rating": "7",
      "text": "Apart from the noticeable terrible dialogue, 'The Happening' is somewhat disappointing. 40 minutes of goosebumps and suspense followed by almost an hour of boredom. And the surprise ending is that there is no surprise ending."
    },
    {
      "rating": "6",
      "text": "Not a great movie by any means, but it certainly doesn't deserve the trashing it's taken from critics. The first half hour is good creepy fun even if the last hour doesn't measure up."
    },
    {
      "rating": "8",
      "text": "Verry comparable to \"lady in the water\" No... I actually Loved that movie... his charcters are fresh to me... so much more real then reality.... but most people want the same old, same old."
    },
    {
      "rating": "10",
      "text": "Much better than the bad ratings. Subtle, good message, and not a moment of dull."
    },
    {
      "rating": "10",
      "text": "I know some of the critics didn't like it, but I thought it was excellent. To each his own."
    },
    {
      "rating": "8",
      "text": "Some people on here have an agenda. They are strictly  trying to ruin Mr. Shyamalan's career with negative reviews any which way. I saw Lady in the Water. Yeah, it was weird and I wasn't impressed. But The Happening? I watched it yesterday expecting the worst, after reading all the bad press surrounding it I thought it would be an absolute disaster. 90 minutes later I walked away feeling I have just watched a very original and thoughtful movie. Mark Wahlberg and the ever beautiful Zooey Deschanel act their way through this strange premise and it's not bad at all. I've seen much worse movies that weren't thrashed nearly as badly. I say watch it and see for yourself. It's by far not your typical script and the story weaves in an uneasy way. Good job Mr. Shyamalan!!"
    },
    {
      "rating": "1",
      "text": "This is one of the worst movies I have ever seen.  The plot, once you figure it out, is so stupid you will not believe that someone actually approved this to be made into a movie.  The movie moves along at a droning pace, just like most M. Night Shyamalan movies.  Usually, this is acceptable to me because the payoff is worth it, like The Sixth Sense.  In this case I was painfully bored until I figured out the ridiculous plot twist and by that time I was ready to call it quits.\r Mark Wahlburg is generally an okay actor but in this film I think even he realizes how stupid it is and just gave up.  The rest of the acting doesn't really matter because you will have lost interest long before judging it.\r The only reason I even gave this movie a 1 is because I actually endured it till the end, otherwise it would have been a 0.  You will miss nothing by not seeing this movie, except for the regrets of wishing you had not wasted 2 hours of your life on it."
    },
    {
      "rating": "3",
      "text": "if you think of this movie as a comedy it works. From the ridiculous premise to the awful all kinds of horrid dialog, to the c-grade acting, this stinker will have you laughing at its \"serious\" moments. Wahlberg is miscast as perhaps the dumbest movie science teacher this decade while Deschanel delivers line after line of horsemanure dialog with an amusing look of mock self-awareness and disbelief that she's actually being paid to act in this turkey. Just pirate and dont pay for this."
    },
    {
      "rating": "3",
      "text": "Starts strong with a good story but is ultimately botched by poor film making and a sour acting performance from all involved, especially Mark Wahlberg."
    },
    {
      "rating": "6",
      "text": "A dark, mysterious and generally entertaining environmental thriller, The Happening may not appeal to everyone's taste from what we know the director for but still manages to bring enough horror elements in It's  time to be worth while."
    },
    {
      "rating": "1",
      "text": "Without a doubt one of the worst films i have ever seen. How M. Night Shyamalan could get something so wrong after getting other films so right is outragous. AVOID"
    },
    {
      "rating": "4",
      "text": "It's not so horrible that you'll run out of the theater, but you'll at least consider walking about half-way through. It's main weakness seems to be Mr. Wahlberg, who seems to only have one mood throughout the entire film. Otherwise, it's just a chase movie between running people and inanimate objects."
    },
    {
      "rating": "9",
      "text": "I like movies like this, specially for being created by one man's mind. It has a message but only if you have an open mind you'll catch it."
    },
    {
      "rating": "9",
      "text": "I saw this movie before reading the reviews and liked it, but so far I have liked all of M. Nights movies. if you liked lady in the water you'll like the happening, movie critics just like writing negative movie reviews, just read some of the reviews on transformers, and you'll see what I mean."
    },
    {
      "rating": "2",
      "text": "The happening? What actually happens? Not much. Marc Wahlberg is truly appalling- much like his cop role in Boogie Nights. This 90 minutes seemed along, long time."
    },
    {
      "rating": "0",
      "text": "I never take the time to rate movies bbut this one is an exception. Without a doubt this is the worst movie I have ever seen in a theatre, and possibly the worst movie I have ever seen in my life. And yes, I saw Gigli, I saw Battlefield earth and several other awful pices of filmaking and this trumps them all. Worst plot of any movie I have ever seen. I was laughing the entire movie it was so bad. The acting was also just terrible. I don't know how Mark Walhber accepted to be in this. M. Night Shamalany (or howveer you spell his name) should never be aloud to make a movie again in his entire life. I feel cheated just for wasting two hours and $10 or my life. Excuse me while I go throw up."
    },
    {
      "rating": "10",
      "text": "ME CARES this movie !!, because I found it interesting and important for the age of our world, were you able to see the cinematography?, the art direction?, the smart of the script?, did you hear the wonderful music by the composer James Newton Howard?, pay attention and you will find art, but maybe many of you just go to the teathers to eat pop corn."
    },
    {
      "rating": "0",
      "text": "Worst movie i have ever seen. I almost fell asleep."
    },
    {
      "rating": "1",
      "text": "I went in with very low expectations and every one of them was met with this boring film. This isn't a responsible time to be making puesdo science environmentalist movies."
    },
    {
      "rating": "10",
      "text": "Always creative, with a mind full of original ideas, those who attack him don't lose any of his movies before get released at theatres. For me is pretty good."
    },
    {
      "rating": "9",
      "text": "Another misunderstood movie, that works perfectly for who search more originality."
    },
    {
      "rating": "9",
      "text": "This movie is good and it has born to kill all the bad movies of horror or suspense this year."
    },
    {
      "rating": "9",
      "text": "Well done, well directed, this is the kind of movies I enjoy, sorry for others...you all can cry, an idea!, ask your money back, I will see it again."
    },
    {
      "rating": "10",
      "text": "Better is going to see movies with no expectations, so you don't lose the ability of get surprised. Relax and see more...hear more, find the details."
    },
    {
      "rating": "9",
      "text": "Not so bad, not so good !, but the rates of critics are not fair, for me Shyamalan's movies are full of originality."
    }
  ],
  "recommendations": [
    "hereditary",
    "old",
    "shut_in",
    "the_mist",
    "knowing",
    "the_bye_bye_man",
    "house_at_the_end_of_the_street",
    "midsommar",
    "seven_pounds",
    "shadow_in_the_cloud",
    "the_twilight_saga_breaking_dawn_part_1",
    "next",
    "the_devil_inside",
    "bird_box",
    "the_room",
    "slender_man",
    "the_day_the_earth_stood_still",
    "2012",
    "poseidon",
    "awake",
    "the_new_mutants",
    "ouija",
    "national_treasure_book_of_secrets",
    "the_eye",
    "doctor_strange_in_the_multiverse_of_madness"
  ]
}