{
  "id": 1523,
  "title": "The Flintstones",
  "starring": [
    "John Goodman",
    "Elizabeth Perkins"
  ],
  "runtime": 91,
  "genre": [
    "Fantasy",
    "Comedy",
    "Family"
  ],
  "description": "Modern Stone Age family the Flintstones hit the big screen in this live-action version of the classic cartoon. Fred helps Barney adopt a child. Barney sees an opportunity to repay him when Slate Mining tests its employees to find a new executive. But no good deed goes unpunished.",
  "releaseYear": "1994",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ocsb0qiGlcn6UlcDRHa3xxSCc8Y.jpg",
  "categories": {
    "plot": 4.8,
    "acting": 6.9375,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.5,
    "funny": 5.25,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "don't listen to the critics. I had a yabba yabba doo time watching this awesome compared movie to the animated TV series. the four actors who played the Flintstones and the Rubbles were great!"
    },
    {
      "rating": "10",
      "text": "You'll find it very hard to find a live-action movie rendition of an animated series that does a better job of capturing the feeling of the cartoon that this movie manages to contain! The set locations, props, special effects, and miscellaneous tools used within the movie all look like vintage stone age high tech, the plot is grade-A and is carried out magnificently by the actors and actresses picked to portray the Modern Stone Age Family. John Goodman is the heart of soul of all that Fred Flintstone is; Elizabeth Perkins is perfect as the red-haired hot wife Wilma who takes no nonsense no matter what Fred tries to tell her otherwise, Rick Moranis does a superb job of acting as the well-meaning, but often trouble-making neighbor that is Barney Rubble; Rosie O'Donnell is great as the warm and caring Betty Rubble who wants to be a loving mother to her adopted child; Elizabeth Taylor has rarely ever been better than in her last big-budget movie appearance ever, as Fred's insufferable Mother-In-Law, Pearl; Kyle Maclachlan plays the role of a scheming, greedy tycoon named Cliff Vandercave; while Halle Berry is the charming, seductive accomplice named Sharon Stone; Harvey Korman provides hilarious voice-work as the Dicta-bird who tries to provide advice to Fred Flintstone, Johnathan Winters has a surprising bit part as an out-of work Rock Quarry worker, and original cartoon series alums William Hanna, Jean Vanderpyl, and Joseph Barbera (sometimes omitted) even make cameo appearances! If you want to have a Yabba-Dabba-Doo time watching a big, live-action movie version of a cartoon series, than this is the movie to watch! Fun for children and adults of all ages! :D Enough said, true believers! ;)"
    },
    {
      "rating": "2",
      "text": "Whoever had the idea to make a Flintstones live action movie based on the popular Hanna-Barbera cartoon named the same thing has to seriously get fired right now."
    },
    {
      "rating": "10",
      "text": "don't listen to the critics. I had a yabba yabba doo time watching this awesome compared movie to the animated TV series. the four actors who played the Flintstones and the Rubbles were great! Fred Flintstone is voiced by John Goodman (Monsters Inc.), Barney Rubble is voiced by Rick Moranis (Spaceballs, Honey, I Shrunk The Kids and Brother Bear), Wilma is voiced by Elizabeth Perkins (Finding Nemo and Big) and Betty is voiced by Rosie O'Donnell (Tarzan and Sleepless in Seattle). This sure is a great movie."
    },
    {
      "rating": "6",
      "text": "I liked this movie. Yes, the plot is predictable and weak, and in some cases over-familiar. Yes, the script is a bit weak in places. Yes, it is a little lacklustre, and doesn't quite capture the feel good nature of the show. But it is far from the worst movie ever. I really don't know what people were thinking when they gave this film such a low rating. Some of the worst movies I've ever seen, are Home Alone 4, Thomas and the Magic Railroad, Cat in the Hat, Disaster Movie, Epic Movie, Pokemon the First Movie and Batman and Robin, but this film doesn't deserve to belong to this category. On the most part, due to the enthusiastic performances of the cast, it was quite entertaining. John Goodman was born to play Fred. He looks the part, and put a lot of much-needed enthusiasm into the role. Rick Moranis is fine as Barney, very like what I imagine him. The prequel is probably better, but Mark Addy and Stephen Baldwin don't quite fit the bill as Goodman and Moranis. I also liked Elizabeth Perkins and Rosie O'Donnell as Wilma and Betty. As the villains, Kyle McLachan and Halle Berry play their clichéd characters more than adequately. I do miss Elizabeth Taylor when she was pretty, but she was game as Wilma's mother, though not quite in the same league as Joan Collins in the prequel. The sets and costumes are spot on, and the design of Dino was superb. All in all, I liked this movie, it's not perfect, but it is far from the worst movie I have ever seen. 6/10 Bethany Cox."
    },
    {
      "rating": "4",
      "text": "Fred and Barney work mining rock at Slate and Company, and when a chance for promotion arises Fred gets the executive position, but little does he know that he's being manipulated by his boss to be the fall guy for an embezzlement scheme.The Flintstones movie does it’s best to capture the spirit of the much loved cartoon series in terms of visuals, but the lacklustre script and predictably dull plot makes this a bit of a drag to sit through."
    },
    {
      "rating": "7",
      "text": "To be fair, I actually really enjoyed this movie, for what it is: A live action movie based on an old cartoon. And for me that is exactly what this movie is. It looks like a cartoon, it feel like a cartoon and almost everything in the movie feels like a cartoon.\r The only real gripe I have with this movie is casting. Rick Moranis and Rosie O'Donnell are not Barney and Betty. It is obvious they are really trying to play the parts, but they just don't quite pull it off.\r Overall:\rCasting a side, this movie is clearly trying its hardest to be loyal to the source material, and to that end I think it does a good job. A fun movie, that is perhaps a bit too kid friendly, but still a good time."
    },
    {
      "rating": "8",
      "text": "This was a very enjoyable film and a good parody of the TV series, very similar to what the Brady Bunch films did. All four actors chosen for Fred, Wilma, Barney & Betty were spot on and portray them perfectly! It's corny with cheese on top but in the right way as this is exactly what the film needed. The film set also looked just amazing! A little predictable, sure, but fans of the series will be right at home here as they stay very true to them to give us a very enjoyable movie"
    },
    {
      "rating": "7",
      "text": "Better than the bad professional critics reviews say. If the movie was made today. It would definitely be less faithful to the show than this movie was."
    },
    {
      "rating": "3",
      "text": "This one was one of the hardest movies we had to talk about. Every time we tried to break down the plot of this movie we found ourselves derailing into completely unrelated nonsense. Got some great jokes out of it though. Listen to our podcast here to find out how we made The Flintstones Better: https://soundcloud.com/opinionatethis/ep-59-make-it-better-the-flintstones-1994"
    },
    {
      "rating": "4",
      "text": "Not GoodDespite a almost perfect cast (Especially Goodman and Moranis), Some degree of faithfulness to the cartoon, Creative visuals, And some fun in bits and pieces, This adaptation of The Flinstones has a terrible script, A pretty bad performance from O’Donnel, Hit and miss humor, and is pretty boring at times. It’s not the worst cartoon adaptation (Trust me, The adaptations of Alvin, Garfield, and Smurfs are WAY worse than this) but it’s a very disappointing one."
    },
    {
      "rating": "4",
      "text": "I always liked the cartoon \"Flintstones\", which I went on TV when I was a kid, but this movie proved to be much weaker than I thought it could be. The plot starts well, puts Fred in a morally reprehensible position, getting an enviable promotion at the expense of his faithful friend, Barney, and confronting him with regrets and consequences. But this ends up making the film too serious and thoughtful, erasing the very fragile attempts to make comedy that are tempted through it. I confess I was expecting a stronger bet on comedy and this disappointed me but, after that, I was able to appreciate this work better and enjoy it for what it is: a family film, with a moral lesson behind and emotional moments, but able to please both children and adults.The work done to recreate scenarios and props of the cartoon is quite satisfactory and shows us most of environments we have become accustomed to associate with it. John Goodman is a good Fred Flintstone. The physical similarities have helped but the psychological construction of the character also deserves congratulations. Elizabeth Perkins gave life to Wilma in a very interesting way. Rick Moranis was OK as Barney, but made the character too naive to be worthy of credibility. Rosie O'Donnell was OK too. Halle Berry was decent in one more character where the actress does not have much to do (well, since I never considered her particularly talented, maybe it's better). It was nice to see the diva Elizabeth Taylor, although in a small cameo Wilma's mother."
    },
    {
      "rating": "4",
      "text": "Not like the very worst but definitely not good, Guilty Pleasure at my part."
    },
    {
      "rating": "5",
      "text": "No esta mal para un domingo familiar pero es una de esas películas que solo se tienen que ver una vez en la vida."
    },
    {
      "rating": "3",
      "text": "Bad. Really bad.Not funny, a dumb plot and an icon of tv animation that just doesn't work as a live action movie."
    }
  ]
}