{
  "id": 278,
  "title": "The Sixth Sense",
  "starring": [
    "Bruce Willis",
    "Haley Joel Osment"
  ],
  "runtime": 107,
  "genre": [
    "Mystery",
    "Thriller",
    "Drama"
  ],
  "description": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4AfSDjjCy6T5LA1TMz0Lh2HlpRh.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 8.538461538461538,
    "ending": 7.833333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The mother practically made me break down in tears, and not to mention the awesome ending. Amazing film."
    },
    {
      "rating": "10",
      "text": "Love it so much especially the ending. Haley Joel Osment's acting is so good and he deserves the Oscar nomination, too bad the movie didn't win any Oscar though it had 6 nominations."
    },
    {
      "rating": "10",
      "text": "A unbelievably well thought out story balanced out with enough chills and shock as well as suspense for the audience to leave the theater completely satisfied."
    },
    {
      "rating": "10",
      "text": "A milestone of the genre, and probably the best psychological thriller of the decade, with stunning performances of both Willis and Osmond. Quite sad to see that many critics at the time didn't see this masterpiece for what it was."
    },
    {
      "rating": "10",
      "text": "True, this first blockbuster from writer/director M. Night Shyamalan's may be the downbeat responsible for the deluge of twist endings that eventually consumed his - now infamous - filmography. However, what \"The Sixth Sense\" also does outside of its game-changing final reveal is simply tell a compelling story. In fact, the plot threads and characters in play are so frightfully addicting to watch that I knew full well what the twist was going in and I still had an unmitigated blast seeing everyone get to that final, cathartic revelation. This is a rich, jet black study of death and the macabre, the dangers of psychological trauma and isolation, the raw power behind human regret and reconciliation, and how all the aforementioned thematic devices can influence one another in life. It really is a carefully-constructed, laser-focused achievement in cinematic storytelling, with a stunning collection of lead performances (especially from that of young Haley Joel Osment) and, yes, a wallop of an ending. Make no mistake though, this didn't make over a half of a billion dollars because of its final two minutes. Indeed, with \"The Sixth Sense,\" it's all about the journey. For me, the destination, seems like a footnote in comparison to all the beauty at hand throughout this one."
    },
    {
      "rating": "10",
      "text": "Its an instant horror classic and will definetly go down in my history as one of the best horror films of all time. As for Shyamalan, he goes down in my history as the guy who did 3 awesome films and then was forgetten for just ruining his career."
    },
    {
      "rating": "9",
      "text": "A great debut feature by M. Night Shyamalan.  It's chilling with great performances by Haley Joel Osment and Bruce Willis.  Plus the twist ending is perfect."
    },
    {
      "rating": "10",
      "text": "The Sixth Sense is a fantastic film that is quite calm yet surprisingly eerie throughout. Everything about the movie; the performances, writing, cinematography, music, etc establishes this creepy tone. Watching it your first time, you will become engrossed in the story and will want to uncover all its secrets. As the movie comes to a close and you finally unravel the whole plot, it will make you want to watch it again just to pick up on more things you may have missed the first time. It is both entertaining and is a movie that makes you think about the world around you. A must watch for all."
    },
    {
      "rating": "10",
      "text": "Absolutely FantasticThe Sixth Sense is terrifying, suspenseful, mysterious, and chilling."
    },
    {
      "rating": "10",
      "text": "A masterpiece, not only the best movie of 1999, but the best thriller of all time, everyone comments on the twist at the end, but it's just the icing on the cake, the script is fabulous, the acting is the same, and the direction Shyamalan's style is precise and no less than genius, stunning photography has made the most of the city's gothic style, not a single scene that is not filled with powerful symbolism and meaning that elevates the quality of the film culminating in a cathartic ending that revolutionized the genre in its time .. How good to know that 20 years after its premiere, the film remains relevant, unique and immortal, a true classic, brave !!!"
    },
    {
      "rating": "9",
      "text": "Following an assault from an ex-patient psychologist Malcolm Crowe meets a young child named Cole, who suffers from the same diagnosis as the ex-patient and claims he can see dead people. Determined to help the boy Malcolm attempts to teach Cole to overcome his fears.\r Throughout the film M. Night Shyamalan creates an eerie atmosphere making for fascinating viewing. It is difficult to say much more about The Sixth Sense without spoiling the finale for those that have not seen the movie (although there can't be many people who are unaware of how the film ends) but it certainly is one of those rare films that is almost better when watched for the second time when you know what to look out for. As for the cast Bruce Willis puts in another good acting performance but Hayley Joel Osment steals the show in, what I believe, was his movie debut making for an almost perfect movie package."
    },
    {
      "rating": "9",
      "text": "Goof movie, I liked it!I am 24 and forgot the movie, I couldn't remember whether I watched it or no."
    },
    {
      "rating": "10",
      "text": "\"The Sixth Sense\" is an unbelievably well-made movie. The acting from Bruce Willis is great as always, but Haley Joel Osment at only 11 years old gives arguably the best performance in the film. The story is always interesting, and there are quite a few legitimately scary scenes. The end twist was also extremely unexpected and, after a second viewing, it all makes sense with the rest of the plot. What happened to you, Shyamalan?"
    },
    {
      "rating": "9",
      "text": "Extremely high 9. One of the best horror/thriller twist I've seen. M. Night Shyamalan set his career off for me with this film. Excellently draw and executed with phenomenal actors. Couldn't have asked for a better film"
    },
    {
      "rating": "9",
      "text": "A classic, but it moves both slow and fast, sometimes annoying but it was creepy, and a little sad. Great acting as well."
    },
    {
      "rating": "9",
      "text": "Amazing movie that totally blew my expectations. I only went into the movie with the short description from Netflix, so the twist spoiling wasn't a problem for me. The best thing about the movie is the suspense that rivals the master of suspense himself Hitchcock. My only complaint is I wanted to know more about the young girl and why her mother poisoned her or at least see more of that family in the movie."
    },
    {
      "rating": "9",
      "text": "●°●°●°●°●°●●°●°●°●●°●°●°●°●●°●°●°●°●°●°●●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_="
    },
    {
      "rating": "10",
      "text": "One word you can say about this movie is \"Perfect\". This movie captured all the emotions in a perfect way. The direction was perfect, the acting was perfect, the storyline was simple but shown in a perfect way, pacing was perfect, the environment created was perfect, the twist and suspense were mind-blowing. Now, I got to know why this movie is called one of the best movies of 90s. Overall, this is in top of my list of recommendations. Totally, loved it."
    },
    {
      "rating": "9",
      "text": "A creepy, suspenseful thriller that is one 1999's best movies.Osment, Willis & Collette are fantastic in what still is Shyamalan's best movie."
    },
    {
      "rating": "10",
      "text": "giihihigughjguugihihhkhkhihhteeghkhihihihihihjhihihjguguguguguguguguguguguguguguguguguguguguugugugguihihihihihhh"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "M. Night Shyamalan's \"The SIxth Sense\" is a masterfully created horror movie that, with solid care, actually scares you and tears you the same time. It's a great movie that will make you think throughout the whole time, especially with the shocking twist at the end."
    },
    {
      "rating": "10",
      "text": "The one successful movie M. Night Shyamalan has to his name, TSS is one of the most frightening, thought provoking and most genius thrillers to entertain audiences in recent years. Bruce Willis gives a cold performance that makes you believe he is a ghost himself. Haley Joel Osment and Toni Collete also give good performances. The twist at the end is utter genius and smacks you right between the eyes , making you think you should have seen it coming all along. The best of its kind."
    },
    {
      "rating": "9",
      "text": "One of the most effective thrillers of all time, and probably the most spoiled movie ever, if you know the ending. So I will not say what the spoiler is, but I will say this: once you figure out the ending, you will want to go back and watch the film all over again to see how this event played out. The film just got a lot more smarter and intelligent with the end scene. Besides that, the film also has probably the most quoted line from movies ever, and just by saying it will put the title in your head: \"I see dead people.\""
    },
    {
      "rating": "10",
      "text": "A great debut feature for M.Night Shyamalan. A chillingly, unbelievably well thought out story that balances out with enough scares and chills to please any member of the audience.  Bruce Willis gives one of the best performances of his career with the young Haley Joel Osment and Toni Collete also giving good performances. The Sixth Sense is a milestone of suspense with the typical Shyamalan twist at the end that hits you right when you expect it would but leaves you with a reaction that is more satisfied than frustrated which is not the case with M.Night's later career choices."
    },
    {
      "rating": "9",
      "text": "A truly great suspense film.  Shyamalan hits every nail on its head perfectly and creates a masterpiece of tension, timing and terror.  It was a long and embarrassing downhill tumble for him after this, however..."
    },
    {
      "rating": "9",
      "text": "It's safe to say that this film will clearly be remembered for the twist, and if you don't know it even without seeing the film I'm quite surprised. Overall its a solid film that is probably best when you first saw it, but its fun watching it again and picking up on some of the clues and hints. Both Bruce Willis and young Haley Joel Osment give great performances, and this film remains to be one of those traumatizing films from my childhood  Overall a fantastic Thriller well worth seeing."
    },
    {
      "rating": "9",
      "text": "I think it's better to view this movie as an paranormal drama thriller and not as a horror movie what it would be called when it came out today. I heard a lot of hype about this movie. I heard it was scary and disturbing. But I actually wasn't scared nor disturbed at all. I can imagine though that this movie can scare or disturb people, but I just wasn't. But it wasn't a bad movie at all. It was actually pretty good and entertaining. First off, all the actors; Bruce Willis, Haley Joel Osment, Toni Collette... they all deliver good performances. The writing is pretty good too and the story is compelling and well told. M. Night Shyamalan direction was also really good. And off course the twist at the end was great, maybe a little predictable if you really pay attention to it."
    },
    {
      "rating": "9",
      "text": "Sometimes, If the movie isn't Hollywoodian, it isn't too valued as it should be. Unfortunately, M. Night Shyamalan isn't too known in theater's world, but 6th sense is amazing. He delivers us a lot of thrilling and tension, mindblowing moments and a masterful cast. To be watched."
    },
    {
      "rating": "10",
      "text": "I have to say I am not a fan generally of M Night Shyamalan's films, but I absolutely loved The Sixth Sense. It is a beautifully made film with an afterlife that is anything but angels and harps, and the score has lots of subtlety and atmosphere to it. The script is chilling, intelligent and poignant and the story complete with a knockout twist ending(easily the best and only wholly believable ending of Shyamalan's movies) is simplicity at its finest. Shyamalan's direction is wonderfully controlled, which is exactly what the story needed. Haley Joel Osment gives perhaps his best performance here, though he's superb in AI too, while Toni Collette plays the troubled mum very convincingly and Bruce Willis is suitably quiet and reflective. Overall, a wonderful film and Shyamalan's best by a mile in my opinion. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "One of the best movie twists ever.  Unfortunately my sister spoiled it for me and told me before I ever saw it and really, that IS the movie.  Done very well and great acting."
    },
    {
      "rating": "8",
      "text": "This is a very, very good movie. For some reason during a second viewing I was so much more absorbed and engaged, especially on an emotional level. The characters, plot, direction, and acting are all so extremely well done. The only complaints I have about this movie now are that the scary scenes really aren't that scary and occasionally a little silly. Also, you're going to have to be in the mood for a slow paced ride. But those are just nitpicks in the face of such an extremely well constructed, written and acted film. I'm so confused now about how Shyamalan made The Happening, but this movie shows that he has undeniable talent in him."
    },
    {
      "rating": "4",
      "text": "Bit boring. To predictable. Wont recommend it to anyone.We spent 3 lessons watching it, kept on falling asleep."
    },
    {
      "rating": "8",
      "text": "Pretty good movie. When it first came out more people seemed to find it scary. I just thought it was plain good. The ending while obvious in hindsight was actually covered up just enough throughout."
    },
    {
      "rating": "8",
      "text": "Shyamalan has really outdone himself with this one. This is is best film, without any way of comparison. The acting is actually good, which is an amazing fact for Shyamalan. Too bad his other films aren't as good as this one."
    },
    {
      "rating": "1",
      "text": "Sadly, the sixth sense was a missed opportunity  because of its badly written plot that relays on the twist ending. no real suspense, underwritten mother character , some scenes lead absolute nowhere, scenes  contradicts each other.the main plot ends in a lame way and the twist ending comes from the subplot tries to save the film. Therefore, no suspense not even hints of suspicion to create tension ."
    },
    {
      "rating": "8",
      "text": "Packed with suspense and featuring a smart twist ending, The Sixth Sense is by far the finest M. Night Shyamalan movie to date as it passes the boundaries of modern horror and suspense movie tropes."
    },
    {
      "rating": "8",
      "text": "I can't classify this as a horror film, because it never really scared me.  In truth, I'm not sure exactly what to classify it as.  Maybe the best thing to do is just not to lump it together in a category and instead realize that with its famed twist ending and Oscar-worthy performance by Haley Joel Osment, The Sixth Sense is a film that really isn't like any other."
    },
    {
      "rating": "8",
      "text": "The Sixth Sense is a truly great film, though since it has been 16 years since it was released, I knew the twist, so that portion of it was spoiled for me sadly, but all the same, I really, really enjoyed this one. Well directed by M. Night Shyamalan, this one manages to be scary, touching, and above all, incredibly entertaining. There are numerous scenes here that manage to do all three, but above all, I found this film to be incredibly moving. A study of ghosts (and what they want), as well as the mind of troubled children, The Sixth Sense manages to really move its audience in a truly unexpected way. I did not expect to be practically moved to tears by this one, but there I was, fighting back tears towards the end. Bruce Willis, Haley Joel Osment, and Toni Collette, are all great here, especially Osment who really shows how talented of an actor he is. It also underscores how sad it is that Shyamalan lost his magic touch, since this one shows so much talent. Truly a great film, The Sixth Sense is another top-notch entry in what was a fantastic year for film in 1999."
    },
    {
      "rating": "8",
      "text": "A decent thriller with a nice story. The beginning is intriguing, the middle is so-so and the ending is really intense! I liked Bruce Willis, Haley Joel Osment and Toni Collette screenplay. There was one annoying thing  the loud \"screamers\" in the most scary moments, I do not like this kind of method to make suspence."
    },
    {
      "rating": "7",
      "text": "Superb movie with great plot. It is good to watch, scary (sometimes) and it keeps you watching it because it hardly makes you bored (if you get the movie meaning)."
    },
    {
      "rating": "4",
      "text": "A modern classic in the thriller genre, The Sixth Sense is proof that the standards have been lowering themselves since Hitchcock, and by a lot. It's not clear whether this film is at times trying to be actually scary or is simply hightening the tension, with half jump scares and some sketched attempt at a scary soundtrack. I don't see how people call the final \"revelation\" (and note the inverted commas) a \"twist\", when it was clear from twenty minutes in what the situation was. Maybe, as I said, standards have been lowered so  much that people go see thriller movies with their brains turned off. To put the icing on the cake, everything is whispered in the hopes of giving dialogue depth, obviously failing.\r Anyway, not everything is terrible: the idea is brilliant on paper, and it was supported by somewhat decent performances by Bruce Willis (we don't get to say that often) and Toni Collette. In fact, I think their performances were great when you wager in the childish script they had to deal with."
    },
    {
      "rating": "8",
      "text": "this movie is absolutely amazing, the writing, the directing, the performances, the plot, and finally the twist was one of the best twists ever, it's almost as good as the twist from \"fight club\", this movie keeps surprising you with every element, i mean who would thought that a kid will give such a memorable performance, the sixth sense is unique and over the top and once in a life time experience."
    },
    {
      "rating": "8",
      "text": "Slow at the beginning, having a surprise twist at the end."
    },
    {
      "rating": "8",
      "text": "M. Night Shyamalan's best, if not only, good movie. An even paced supernatural thriller with intensive and realistic acting, with Haley Joel particularly amazing, and with a shocking that's the perfect payload. I can't understand how a man who wrote and directed this would direct 'Last Airbender'. This will be his magnum opus, the rest is s**t."
    },
    {
      "rating": "8",
      "text": "A bold chilling mystery thriller.\rBruce Willis is electric in this thought provoking mystery that will leave you absolutely breathless. Witness this cinematic achievement."
    },
    {
      "rating": "5",
      "text": "\"The Sixth Sense\" equates to little more than M. Night Shyamalan trying to compensate for his script's narrative shortcomings with an audacious twist ending that is illogical and does not make sense. Sound familiar? The atmosphere is built effectively enough for some chills, but the narrative is poorly thought out and meandering, and completely undercuts what suspense Shyamalan creates. With a placid, probably miscast Bruce Willis in the lead and Toni Collette performing well in an underwritten role, it is Haley Joel Osment who salvages the film with an empathetic and star-making portrait. It's a shame the rest of the film couldn't live up to his example."
    },
    {
      "rating": "7",
      "text": "this one of the movies that is not scary ( like the Poltergiest) but it's a devil paranormal activie. But it's a classic of the 90's. ( actually writer , director M. Night Shyamalan does have a quite of a good imagination). Bruce willis is entertaining indeed. Grade B"
    },
    {
      "rating": "8",
      "text": "Wow, this is a really good movie, great performances by Haley Joel Osment and Bruce Willis and a very good twist. Although my first thoughts at the beginning of the film could have predicted it, but I was still surprised. It really is an unexpected turn, while also well hinted."
    }
  ]
}