{"id": 4571, "title": "The Last Summer", "starring": ["K.J. Apa", "Maia Mitchell"], "runtime": 109, "genre": ["Romance", "Comedy"], "description": "Standing on the precipice of adulthood, a group of friends navigate new relationships, while reexamining others, during their final summer before college.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/nAn3MRAUwbjVApN3qYkvsTEOAvx.jpg", "categories": {"plot": 3.0, "acting": 0.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 2.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "Similar to most Netflix Rom-Coms, The Last Summer does not have any substantial to offer other than the same old cheesy romance about fresh starts. The only storyline that's unrelated to the romance is the friendship between the little girl and her babysiter which seems to be out of the place when all the other stories are about finding short-term or potential long-term romantic relationships. With a little twist and turns, the film can be deemed mediocrely enjoyable but nothing exceptional."}, {"rating": "2", "text": "It's boring and silly, same cliche of comedy/romance movies except ''The Last Summer'' wasn't funny or even romance, I think the story written in one day.Even if you don't have something to do, don't watch it, you can watch Tom and Jerry it would be better for you."}, {"rating": "0", "text": "This is one of the worst written movies that I've ever seen. The are so many plots going on simultaneously, and many of them don't matter. I'm not sure the actors in this film are bad or if it's the script, but nothing anyone said felt natural. Just give this awful piece of garbage a pass. I wouldn't neccesarily give it a 0/10, but something just above that."}, {"rating": "6", "text": "O filme está cheio de clichés e a comédia é praticamente inexistente (é uma rom-com, certo?). No entanto, as personagens são carismáticas e o filme acaba por ser agradável.6/10"}], "recommendations": ["the_best_of_me", "vamps", "the_five_year_engagement", "27_dresses", "holidate", "the_cobbler", "that_awkward_moment", "hancock", "the_kissing_booth_2", "murder_mystery", "life_after_beth", "the_lake_house", "the_vow", "sleeping_with_other_people", "rough_night", "the_princess_bride", "friends_with_benefits", "50_first_dates", "ready_or_not", "thor_love_and_thunder", "no_strings_attached", "the_lucky_one", "summer_of_84", "bedtime_stories", "before_i_fall"]}