{"id": 4612, "title": "The Manor", "starring": ["Barbara Hershey", "Nicholas Alexander"], "runtime": 81, "genre": ["Horror"], "description": "After suffering a stroke, Judith moves into a historic nursing home, where she begins to suspect something supernatural is preying on the residents. With no one willing to believe her, Judith must either escape the confines of the manor, or fall victim to the evil that dwells within it.", "releaseYear": "2021", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/eNf7Dp1m6eTKDY7p56iZdterZkL.jpg", "categories": {"plot": 3.5, "acting": 6.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "3", "text": "With the aging Boomers, nursing homes have become the settings for more films, including these 3 recent ones: Queen Bees (awful), Poms (awful), I Care a Lot (clever). That last one is the closest to this film because it trades on the same paranoia that comes from becoming a helpless senior in one of these homes. Barbara Hersey moves into the titular residence, only to suspect that something sinister is happening. This Blumhouse production trades in the familiar spooky themes, but the holes in the logic and the predictable plot interfere with any suspense. Meanwhile, the pedestrian direction never lends itself to any real scares."}, {"rating": "8", "text": "The scares are not 100% there but it still has a great feel to it as a horror movie.  I did have trouble with trying to visualize the actors as residents of a nursing home, however."}, {"rating": "4", "text": "Of all the films to be released in the Welcome to the Blumhouse anthology, The Manor was the one that had given me the most hope, and sadly it turned out to be one of the most disappointing.The proposal with Barbara Hershey as the lead, and with a story that takes place in a nursing home, sounded pretty good, but The Manor makes the mistake that even with its short duration, it takes a long time to tackle its twist, and when you find out about it, it's very late, because the way in which the concept is brought to life is quite boring, and it's far away from any horror perception.At its climax, it becomes almost a comedy, both for the bad performances and for how painful it feels in terms of resolutions. What a waste."}, {"rating": "3", "text": "(Mauro Lanari)Harmless \"Dorian Gray\" lacking in inventiveness. That's all."}, {"rating": "7", "text": "Woman in her 70s moves into a nursing home where other residents are having unexplained deaths and she's seeing a tree-person hovering over her at night but, it's actually three of the other residents using witchcraft to keep themselves young at the expense of others and getting their family members jobs at the home."}], "recommendations": ["greta", "the_autopsy_of_jane_doe", "the_rental", "jessabelle", "the_night_house", "winchester", "his_house", "the_skeleton_key", "prey", "panic_room", "evil_eye", "the_woman_in_black_2_angel_of_death", "the_forest", "hotel_artemis", "orphan", "annabelle_comes_home", "what_lies_beneath", "a_cure_for_wellness", "lights_out", "annabelle_creation", "flightplan", "unforgettable", "the_uninvited", "the_mothman_prophecies", "lady_macbeth"]}