{
  "id": 1281,
  "title": "The Virginity Hit",
  "starring": [
    "Matt Bennett",
    "Zack Pearlman"
  ],
  "runtime": 120,
  "genre": [
    "Comedy"
  ],
  "description": "Four guys, one camera, and their experience chronicling the exhilarating and terrifying rite of passage: losing your virginity. As these guys help their buddy get laid, they'll have to survive friends with benefits, Internet hookups, even porn stars during an adventure that proves why you will always remember your first time.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/krUYZAjEZ5n5GL7tuLoQGfxja0S.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 2.0,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "It's not for nothing that \"The Master of Suspense\" gets a shout-out in \"The Virginity Hit\"(a thoroughly modern movie about the intersection between youth culture and cyberspace), when Zack, the ersatz auteur tells his best friend Matt, \"I'm going to do to your virginity what **** did to 'The Birds'.\" After all, the subject of voyeurism was a **** mainstay, a theme that he explored often, most notably in \"Rear Window\", the 1954 movie where a wheelchair-bound photographer(played by Jimmy Stewart) spies on the tenants in an adjacent apartment building(read: the movie screen) from the comforts of his own room. Individual vignettes unfold in partitioned flats, some more arresting than others, but save for the man with the trunk(played by Raymond Burr), the daily actions of the unaware subjects are meant to be ephemeral, and L.B. Jefferies, gentleman that he is, allows these private moments to go undocumented. But those analog days are long-gone. If Miss Lonelyhearts(Judith Evelyn), the aging spinster who hosts intimate dinner parties for imaginary gentleman callers, was transplanted in our time, she would go viral, and be seen by thousands, if not millions of people on YouTube, with some misogynistic title like \"Miss Lonelyhearts Need to Get Laid\", because everybody has a video camera these days. What Alfred **** never could have possibly anticipated was that the passive nature of voyeurism would grow to be so pro-active. Dying at the age of eighty in 1980, he never lived to see the phenomena of people recording other people, even themselves, as if every move they made were worth preserving. Documented by film scholars and theorists, and admitted by the man himself, **** had a predilection for humiliating women, so Zack, by some stroke of luck, namechecks the right director and an appropriate title, since in \"The Birds\", Melanie(played by Tippi Hedren) is punished for having a sex drive, for flirting shamelessly with Mitch(Rod Taylor) in the pet shop. In \"The Virginity Hit\", Nicole, the girl that Matt plans to lose his virginity with, allegedly boinked some anonymous college guy at a frat party, so a revenge plot is hatched, in which the jilted party plans to f*** and dump his significant other of two years, on film, with all their friends(not only guys, but birds(\"bird\" is British slang for a young woman), as well) in the next room, enacting as an auxiliary audience(hence, the pro-active voyeurs), while the real audience, us, the moviegoers(some of us, anyway), watch in horror. At the last minute, Matt has second thoughts about the porno-in-the-making, but not just for her sake; it's not all chivalry and charity on the male subject's part; it's for his sake, too, as modesty sets in, when it occurs to the virgin that his rite-of-passage is being recorded for posterity. So the jig is up, enraging Nicole, who disappointingly, never retaliates, and never finds another boyfriend to protect her honor. Instead, it's another girl, Becca, someone from the Internet, a total stranger who volunteers to bust Matt's cherry, that ends up humiliating the virgin as part of her masters thesis on human male sexual behavior. The scene where Matt performs cunnilingus on a male(!) blow-up sex doll, deconstructs the teen sex comedy, because the clinical environment of Becca's lab replaces the spirit of anarchy(that's alive in films such as \"American Pie\" and \"Porky's\") with the enervation of control. Sex, or rather, the lack of sex, becomes no laughing matter, when celibacy is put in a real world context, as evidenced by Matt's incident. Although he learns a lesson about the amorality of surreptitious recording, it should be the victim who evens the score, like Ellen Page, the lolita with a cunning disposition in David Slade's \"Hard Candy\", who teaches the sex predator(played by Patrick Wilson) she met on-line a thing or two about the consequences of attempted statutory rape. Quite tellingly, \"The Virginity Hit\" sees nothing terribly wrong about Matt's ruse, since Nicole forgives(!) him, and agrees to the filming of their first time. In a poorly lighted room, the moviegoer catches a glimpse of Nicole's breasts, just before Zack pulls away from the outset of their lovemaking. It's Zack's decision, not hers, to keep their private moment from being turned into a pornographic movie. ****, who took delight in degrading his female subjects, time and time again, would probably be turned off by the women of this generation(e.g. amateur porn sites such as \"Dare Dorm\" and \"Money Talks\") who debase themselves without any prompting by a man."
    }
  ],
  "recommendations": [
    "below_her_mouth",
    "greta",
    "monte_carlo",
    "the_next_365_days",
    "lady_macbeth",
    "shame",
    "bride_wars",
    "the_craft",
    "the_miseducation_of_cameron_post",
    "bloody_hell",
    "home_again",
    "phantom",
    "ingrid_goes_west",
    "eat_pray_love",
    "young_adult",
    "tully",
    "afternoon_delight",
    "american_murder_the_family_next_door",
    "college",
    "room",
    "deliver_us_from_evil",
    "cherry",
    "colombiana",
    "erin_brockovich",
    "crazy_rich_asians"
  ]
}