{
  "id": 334,
  "title": "The Voyeurs",
  "starring": [
    "Sydney Sweeney",
    "Justice Smith"
  ],
  "runtime": 117,
  "genre": [
    "Thriller"
  ],
  "description": "When Pippa and Thomas move into their dream apartment, they notice that their windows look directly into the apartment opposite – inviting them to witness the volatile relationship of the attractive couple across the street. But what starts as a simple curiosity turns into full-blown obsession with increasingly dangerous consequences.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8Y4XOIWhpOvSOEn8XrxbkH9yAXO.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.4,
    "ending": 4.777777777777778,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "difficult start but worth it. strong performers and strong plot. can lead to discussions."
    },
    {
      "rating": "7",
      "text": "This is gonna be the first time that i hate the movie from the beginning till near the end, then an unexpected twist come, and it change my mind completely, the performance was average, and yes there is some pretty a lot of cringy and corny moment, and yet there is some cool shot in the film, The Vayeurs have lot of potential being a really good movie, and if it's not because of that clever twist, it's not gonna be at least \"pretty good\", this is the first time that a twist in a movie really change my mind from hate it to say that this is a pretty good movie."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "6",
      "text": "In an extension of Hitchcock’s Rear Window concept, a young couple  (Sydney Sweeney and Justice Smith) moves into their new loft and discovers a view of their sexually-active neighbors (Ben Hardy and Natasha Liu Bordizzo). What starts as a fun curiosity, expectedly turns dark and twisty. This erotic thriller doesn’t deliver a lot on either account. Sure, there are some steamy scenes, but they don’t have much passion. Sure, it has some plot surprises, but never generates much tension. The performances aren’t especially compelling either. Overall, this film sufficiently fills in the blanks without being exceptional."
    },
    {
      "rating": "6",
      "text": "I seriously thought this was going to end a different way. The ending is so sad and I knew right away the bf didn’t kill himself. Is this movie going to get you out of your seat cheering? No. Is it nerve wracking? Yes. Twisted and a lot of sex and sexual situations. It is interesting and makes you wonder ab neighbors. I give it 6/10. The twist and turns make it better. Give it a chance and sit through the first 30mins."
    },
    {
      "rating": "4",
      "text": "There will be a lot of talk about other films that have to do with a plot that involves voyeurism, but by doing so, you will be sinking this film even more due to completely wrong expectations and results.I think it's a bad film, that tries to make use of a very cheap eroticism to hook the viewers because of its obvious lack of an intelligent and more interesting plot.In any film, the viewers are voyeurs, the nature of cinema is like that, and what we have left is to react to what we see.The same thing happens here in this film.The story forces them to react when watching is no longer enough, and the way in which the protagonists, especially the female character, get into the lives of their entertainers, is to a certain extent absurd, because it feels completely built to force them to make it happen. This in order for the twists to work.The whole story is built on Sydney Sweeney's character getting reasons to be unfaithful. Her partner Justice Smith couldn't be more irrelevant in this film.Her character interferes in a marriage, causes an apparent suicide, and ends up destroying her relationship and causing another suicide by consummating her infidelity with the man she accused of being unfaithful in the first place, who, as the film mentions, was a depressed widower whom she stalked.All of this happens in a way that is not only implausible but it feels just ridiculous and stupid. And reaches hilarious levels when the film reveals its plot twist that concludes with a totally unsatisfactory revenge climax.So underwhelming."
    },
    {
      "rating": "3",
      "text": "The Voyeurs is a fundamentally stupid film and it's important to recognize that before getting angry about the time it's stolen from you that you will never, ever get back. It bills itself as a sexy, playful inheritor to voyeur genre films like Rear Window, Blow Up, the 'Burbs, and would-be-solved-if-she-got-a-job movies like Puzzle and Woman in the Window. Detective Pikachu and Sydney Sweeney make an unlikely pair of mousey hipsters, living their best life writing jingles for American pharmaceutical commercials for ED and helping people find their best selves in new glasses. Despite the fact that there are some overtures at trying to make biracial sexy--most of the pairings for sexy sex scenes are between our impossibly ripped and disappointingly puerile-faced boy next door--Detective Pikachu is neutered and the climactic tryst is between the two white characters of the movie who've been magnetically pulled toward one another the entire time. The movie is poison because it takes about half an hour for the girl next door to kill herself in a fit of passion after her husband's infidelity is revealed to her anonymously through a printer (presumably because it was the cleanest visual they could come up with without involving texting?). The husband doesn't bother to investigate the anonymous notes directing his suicidal wife to search for condoms in the bathroom, because why would he? Which is one of the many problems with the premise. All the plotholes don't matter, because they're not plotholes, they're intentionally suspended, so that Sweeney has more rope to hang herself, so to speak. Which, oddly enough, leads me to the second suicide, which is really when this movie goes into warp speed stupid. Instead of getting the emotional climax here, we shift into some lazy, numb montage of grief which has the effect of sweeping what is going to become the pivotal death of the movie under the rug. Sweeney's heart-to-heart with her coworker, revealing her complicity in not one but TWO suicides is a template for the worst possible movie advice, equal parts synopsis and nonsense logic meant to ease Sweeney into a false sense of security for long enough for her to feel sexually desirable enough to put on some makeup and show up for a gallery showing at the boy next door's show. Just in time to discover that--yes, you guessed it--the suicide was performance art the whole time. The first one, not the second one. Detective Pikachu is still dead. But don't worry, his death isn't actually a suicide. It's a murder. This is going to give Sweeney the opportunity to lure the performance artists into her place of work, which is visually important, because we've been primed by cut scenes involving eggs for the past hour to expect that someone's eyes are gonna get crushed. It's also delightfully retrograde that their punishment is that they become visually impaired.It's hard to overstate how impossibly thirsty this movie is for your attention by the 90 min mark. And as someone who recently spawned a gremlin it's hard not to feel personally victimized by this movie's click-baity approaches.Simple Google search might have uncovered the fact that the photographer-model couple are, in fact, canny performance artists and--importantly--collaborators, not mismatched lovers caught in an abusive relationship. The premise relies on you accepting that the entire action of the first act of the movie is entirely choreographed for the solipsistic benefit of the Detective and Sweeney, giving it some intense Truman Show vibes but without the benefit, drama, or comedy, of Truman's turn, when he begins to take advantage of the restrictions of his own surveillance.The Voyeurs would've benefited from cutting their losses early, also, including a pokemon or two? Cannot imagine a film better suited to roll out directly to streaming and fall directly to the bottom of your queue."
    },
    {
      "rating": "8",
      "text": "This is a good movie with plot twists, some predictable, some less, that inch this moves towards great. Sex scenes are fun, plot has some flaws. Characters and acting are a bit half baked. So yes, less than great, but interesting, compelling. In all, I enjoyed and recommended this movie to friends."
    },
    {
      "rating": "0",
      "text": "This movie is bearable for about 30 minutes.  Then it just becomes boring.  At about the half-way point, I was just mildly annoyed with the characters.  Then the final act comes, and the movie transforms itself from mildly annoying to infuriating.  This is hands down the worst movie I've ever seen.  If it didn't try to take itself so seriously, it would've been passable as standard, run of the mill erotic-thriller trash, but the writer seems to genuinely believe he's the next Hitchcock, so he preemptively tries to close up some of the *many* gaping plot holes.  The problem is, the explanations are way dumber than the movie would have been if he just left them as gaping plot holes.  Absolute trash."
    }
  ]
}