{
  "id": 2879,
  "title": "The Perfect Date",
  "starring": [
    "Noah Centineo",
    "Laura Marano"
  ],
  "runtime": 93,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "No beau? No problem! To earn money for college, a high schooler creates a dating app that lets him act as a stand-in boyfriend.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rrAYdezO3h1mjdYTaQyTXoj8IZ4.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 2.75,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "\"The Perfect Date\" possui alguns momentos foleiros, mas o filme é fofo. Realmente, Noah Centineo e Laura Marano funcionaram bem juntos.7/10"
    },
    {
      "rating": "8",
      "text": "Brooks Rattigan wants it all. The perfect girlfriend, a sweet ride, and to go to Yale. The problem? He's broke. Luckily, there's an app for that. One that lets women go on fake dates with him where they get to customize his personality to their liking. Unexpectedly charming and hilarious antics ensue.It doesn't deviate from standard teen rom-com mold much. Brooks neglects his friends, screws things up with a girl he's actually compatible with, and ultimately learns his lesson ending everything on a happy, sentimental note. The morals of finding out who you are, not becoming someone you aren't, and money not being anything are still relevant to teens today despite not being anything new. It's light, fluffy entertainment and that's not always a bad thing despite what you might here from people with their heads too far up their pretentious rectums.Noah Centineo is really the main reason all of this works. The dude is just so incredibly charismatic. Managing to come off as your average, everyday relatable guy while still looking like he's been chiseled from marble. The supporting cast is all pretty great too. All very attractive and good in their roles. The absolutely adorable Odiseas Georgiadis being the standout for his non-stereotypical portrayal of a gay person. The dialog they're all given can be kind of unnatural. I've never met a single teenager with even half the verbal wit these kids have, although they've all been twice as snarky. It breaks the illusion a bit by revealing just how much the movie is trying to show us a picture perfect version of life, but whatever. I still laughed a bunch and despite all of the clichés think it's actually pretty exceptional at making these well-worn tropes feel fun again."
    },
    {
      "rating": "9",
      "text": "This is my second favorite 2nd favorite Netflix original movie, one of my top 5 favorite romcoms, one of my favorite movies of 2019, and one of my favorite movies of all time. Laura Marano and Noah Centineo gave stupendous performances. Camila Mendes, Odiseas Georgiadis, Matt Walsh, and Maureen Brennan also gave great performances. The story was fantastic and it was very cool concept the whole stand-in app story. The writing and screenplay were terrific and really funny. A+ for this movie."
    },
    {
      "rating": "3",
      "text": "This movie was truly a mediocre waste of time. The entire plot is shallow and seems to be an attempt by Netflix to once again profit off of Noah Centineo's popularity without having to produce any actual good content. Even as a teen, I couldn't stand it. I watched the entire movie despite wanting to stop watching within the first 10 minutes. and I have to say, my initial judgment was correct."
    },
    {
      "rating": "1",
      "text": "Once again Netflix provides a teen romcom that is vastly beyond predictable and repeats the same, being there done that, plot of almost every mass produced romcom movie these days. This movie sells to viewers the idea of \"finding yourself\" through the main character hiring himself out for numerous dates in exchange for cash, however at the beginning of the film he seems somewhat solid on his goals and future aspirations. This wavering character then somehow ruin all his relationships, between friends and family, but like all other teen romcoms miraculously pulls it all together within the last 10 minutes. The acting is corny and the inside FRIENDS jokes even cornier. It quotes \"chivalry is not dead\" but this movie proves quite the opposite and weakens all hope I have left for this generation, the one I am unfortunately stuck in. A complete waste of time, and honestly if you have seen one Netflix original romcom then you have also seen this one too. For once I would love to watch a film with some real craftsmanship that can fit into this category from this century but I am yet to find one, and something that you can preferably not foretell the entire movie from the first 15 minutes into the movie. But I guess that's what a high percentage of the masses want so just provide what sells, again the industries putting profit as their highest priority above the true artistry of film..."
    },
    {
      "rating": "6",
      "text": "Aunque no aporta nada que sea novedoso, tiene una historia que se deja disfrutar."
    }
  ]
}