{
  "id": 524,
  "title": "The Dark Knight Rises",
  "starring": [
    "Christian Bale",
    "Michael Caine"
  ],
  "runtime": 165,
  "genre": [
    "Action",
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/85cWkCVftiVs0BVey6pxX8uNmLt.jpg",
  "categories": {
    "plot": 6.732394366197183,
    "acting": 7.985074626865671,
    "ending": 7.604166666666667,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.75,
    "action": 8.16
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The Dark Knight Rises is without a doubt one of the most interesting movies I've ever seen. It was nothing like I expected and kept me on the edge of my seat the whole time. I love how Nolan's Batman movies have evolved and feel so different than the ones before it because you do not get tired of them. The movie is different from The Dark Knight and Batman Begins because it is more grandoise and complex. There are several twists in The Dark Knight Rises that add a level of complexity that the previous two films did not have. That being said, The Dark Knight Rises is not better than The Dark Knight because of its muddled plot and rushed ending sequences.\rThe muddled plot comes from the fact that Nolan relies to heavily on the ending sequences to explain earlier events. For some that is good enough, but I expect more from Nolan. Also certain events in the film seem over the top and in some cases there is no explanation for how they came to be. Especially, the French Revolution like court scenes. There are many other examples, but I do not want to spoil the movie. Despite these flaws, The Dark Knight Rises manages to keep you engaged because of the wonderful characters and the outstanding perfomances from the actors. The newcomers, Tom Hardy as Bane, Anne Hathaway as Selina Kyle, Joseph Gordon Levit as John Blake, and Marion Cotillard as Miranda Tate are all wonderful additions that add compexity to the film and some wicked twists at the end. So overall I think the film is good and worth seeing, but not a masterpiece like The Dark Knight was."
    },
    {
      "rating": "8",
      "text": "\"The Dark Knight Rises\" is a brilliant summer blockbuster that succeeds responding its massive hype by gloriously ending The Dark Knight Trilogy. Despite some stretched-out plot holes and cliches the movie's story-line is tight and packed with visual eye candy, stuff that you gotta watch in IMAX. Most of the actors from \"Inception\" are brought down into the film and they boast solid performances. The tone of the movie isn't as dark as \"The Dark Knight\", but it still is mature and realistic (in a sense...). However what Christopher Nolan hit dead right was, in my opinion. the ending. I won't spoil anything but I can say that the ending is very refreshing and interesting; it's different from the usual linear endings brainless Hollywood blockbuster directors/producers think of. Long story short, WATCH IT. It's not quite the same level as of \"The Dark Knight\", but it has big scope visual eye-pleasers as well as a somewhat sensational and wise ending; a finishing touch for director Nolan's epic trilogy of the lonesome dark knight."
    },
    {
      "rating": "10",
      "text": "The Dark Knight Rises concludes Christopher Nolan's dark and triumphant Batman trilogy. For seven years, Nolan's reboot has reached acclaim and this final Batman flick has easily been one of the most anticipated movies of all time.\r After eight years of no Batman, a terrorizing masked pro-wrestler has come to burn Gotham to ashes with a master plan to overthrow the higher classes. After his stock market stunt he leaves Wayne Enterprises wiped out financially. Bruce Wayne reaches out to Miranda Tate (Marion Cotillard), a millionaire who can help Wayne. Selina Kyle (Anne Hathaway), a cat burglar also known as Catwoman, comes across Wayne after steeling his mother's pearls but is also after a \"clean slate\", that Wayne can give her. John Blake (Joseph Gordon-Levitt) is a young cop who is nothing short of heroic. Nolan provides us with many new characters and manages to present them as fresh instead of overwhelming.\r The Dark Knight set the bar very high for this movie and with the absence of the Joker, who Heath Ledger made one of his most memorable performances of, finding another villain who could top that brilliance was seen as almost impossible. Bane (Tom Hardy), a B-list villain was something of a genius idea. A villain who is as powerful as Batman and makes Batman's job nearly impossible. Although we didn't get the humor that we were left with by the Joker and still, Bane doesn't quite live up to the Joker's glory, Hardy did leave us with a  great villain and Nolan succeeds at making this B-lister feel like an A-list villain. The mask does take away a bit of personality but Hardy does give an impressive performance only using his expressions with his eyes and body language. you will leave the theater withe the epic and evil voice that Bane provides us with, done so well, stuck in your head. The presence of the other new characters like Catwoman and Miranda Tate also help make up for the missing Joker.\r Nolan's final Batman film doesn't fall short of it's predecessors. The legend ends with one of the greatest superhero movies of all time. We are left with a truly triumphant finale."
    },
    {
      "rating": "10",
      "text": "Definitely, this movie has a 9.6, Nolan did what no one else was able to did before, to make the perfect trilogy, everyone has failed with the third movie, even Francis Ford Coppola failed with The Godfather III, but Nolan gave us a surprise,The Dark Knight Rises was the epic final, for the epic trilogy, as I said before, he did what no one else was able to do before, make the third movie better than the second, Batman Begins was really good, Batman The Dark Knight was better, but The Dark Knight Rises is even better, in so many ways, it is impossible to dislike this movie, if someone says that he or she doesn't like this movie, is lying, and is a hater, because it is impossible, this movie is epic, the end was just amazing, I almost had a heart attack, this final movie had everything, it touched my emotions to the very end, I just have to say that Nolan did an amazing work, and sorry to say this Francis Ford Coppola, but my new favorite trilogy is now directed by Nolan."
    },
    {
      "rating": "8",
      "text": "A wonderful end to the finest superhero-themed trilogy one has ever seen. Every character is developed fantastically, from the villainous Bane to the ever loyal Alfred, the hardened Commissioner Gordon and finally the Caped Crusader himself. A must see for anyone who wants more than their admission ticket's worth."
    },
    {
      "rating": "10",
      "text": "The Dark Knight Rises was gloriously the best moment of my life in a movie theatre. It stands alone, peerless in the pantheon of superhero movies. There will be no spoilers here and if the impulse to spoil yourself before watching the film is too excruciating to bear, remember this, it'll be the equivalent of Selina Kyle robbing you blind. When Batman Begins came out, I was very sceptical about watching another one of those Batman flicks, such is the enduring traumatic impression Joel Schumacher's films left me. Thank goodness I did and from that point on there's no turning back. Christopher Nolan's finale made all the recently released superhero movies look like child's play to be honest, it is the appetizer to the main course that is the final chapter of The Dark Knight trilogy. The typical critique of Chris Nolan's movies is that it might be too cerebral for the casual moviegoer, no it's not. His films are universal, it's so well-layered, directed towards everyone. If you're more of the \"intellectual genre\" you'll notice the political undertones and social commentaries and what have you, but even if it goes over your head, it doesn't detract your experience from the film. Fanatic fans of the Batman comics will love all the little nods and references, even the major ones from the comic books thoughtfully implemented throughout the film.\rChristian Bale is just magnificent, as he puts it he plays three characters, the billionaire playboy Bruce Wayne, the true persona of Bruce Wayne still grieving the lost of his parents and the Batman. He's the defining actor of The Dark Knight, his portrayal of all these characters are just perfect and even though he's a man dressing up at night as a bat beating criminals to a pulp with his bare hands, we empathise with him. Returning inhabitants of Gotham and Bruce's fundamental foundation of his lifestyle is Gary Oldman's aged and weary morally-strayed Commissioner Jim Gordon, the Q to Batman's James Bond, Lucius Fox and possibly a Best Supporting Actor nominee perhaps, the closest thing to a father figure Bruce can get, his moral compass, oozing with words of wisdom, Michael Caine's Alfred Pennyworth. Scenes between the trio are so poignant, beautifully crafted and presented, it's so hard to watch without getting a lump in your throat, to describe it as tear-jerking ia an understatement. One of the newcomers is Joseph Gordon-Levitt's solid portrayal of beat cop John Blake and Marion Cotillard's enviromentalist Miranda Tate. The chief antagonist is Tom Hardy's full time terrorist Bane, He's frightening to watch, Tom embodies and embraces the sheer brutality and monstrosity of \"the mercenary\" flawlessly with half his face covered up, the way he conveys his emotions with only his eyes is amazing. Anne Hathaway's morally ambiguous Selina Kyle is a wild card, it's really fun to watch the development and chemistry between Bruce/Selina and Batman/the cat burglar. The 2 hours and 44 minutes running time didn't feel long at all, the story flows seamlessly as it comes full circle with flashbacks from Batman Begins and The Dark Knight, it's all beautifully balanced between the intimate moments of character development that's unusual in a summer blockbuster film and the really elaborate and simply put awesome all-out war action sequences and the choreography of the brawls between Batman and Bane is much improved than the previous films. The most important element of The Dark Knight Rises however and what makes it a gem is that it manages to amp up the suspense and anxiety to incredible heights knowing that every single character is dispensable including the Batman. When was the last time you watched a superhero film and feel a genuine concern that our hero is not going to come out alive? Exactly.\rThank you Christopher Nolan for not giving in to the public and I'm assuming studio demands to continue this magnificent 7-year journey we have all been through together, to truly end this great vision of the legend with integrity, to give this great story a great and true conclusion to let the Batman ride off into the sunset if you will. It was the ending this iconic character deserved. And to anyone who thinks the Rises in The Dark Knight Rises is just a convenient way to name the film, it makes complete sense, it"
    },
    {
      "rating": "10",
      "text": "This movie was an absolute perfect conclusion to the batman trilogy. It had action emotions effects and an incredible story. The acting and directing were captivating and harmonious and The fight scenes were thrilling. I could not have asked for a better conclusion."
    },
    {
      "rating": "10",
      "text": "Nolan was able to bring his Dark knight trilogy full circle with the dark night raises. You can not compare it to either of the other two films.  Unlike the Joker from the dark knight.. Who was more crazy and just rolled with the punches. Bane is pure evil wanting to destroy everything or everyone in his path and he has a plan! Tom Hardy does a great job playing the villain with just his eyes and body language over all! Bale filled out the role of batman perfectly again. The effects were  the best out of the 3 films. Just when you think, How can Nolan make this bigger or better. He does, dont doubt  the man he is a genius at movie magic . He stays with his own story, yet still sticks well to batman lore. With sprinklings of a little modern day troubles within our own world. The one that was the best and only thing I will give you from the movie is Bane and his men Go into the Gotham stock exchange. One guy says \"what do you think your going to steal this is the stock echange there is no Money here?!\" Bane replies \"If there is no money here then what are you doing here!\"  With Nolans Batman Trilogy to a satisfying close. The next person that tries to revive the batman series. I wish them the best of luck they will need it. Nolan has placed a big foot print in that department that I dont believe anyone can fill!"
    },
    {
      "rating": "10",
      "text": "SPOILER FREE REVIEW: There is no word grand enough to describe the closing film in the Dark Knight saga.  Epic doesn't even come close.  It is an experience that is truly transcendent for any big summer blockbuster, let alone a comic book adaptation.  The movie is set 8 years after the previous film and in the new Gotham crime seems to no longer be the problem, however a new one has begun to grow from the depths of Gotham's sewers, as an increasingly corrupt and greedy 1% take and take and leave nothing for the rest.   It is set in a world that so closely resembles our own world in so many ways and Nolan touches on this subject in a way that no other big time director would dare to fathom, nor accomplish with such precision.  Some will say that this film is a scathing rejection of socialism, when in fact it shows us the danger of ignoring social and economic injustice, which is at it's extreme a Russian style revolution.  But politics and economics aside, the film is still wholly carried by it's intensity and its action, and the action is simply breathtaking.  Nolan seems to be the only big budget director left who uses CGI only when absolutely necessary and the effect is very real and impressive, especially during the jaw dropping last 45 minutes of the film.  The cast of The Dark Knight Rises is, I think, the best ever assembled for a Batman movie and the surprise best performance comes from Anne Hathaway who is fierce as Catwoman, but also surprisingly human and genuine.  She embodies the message of the movie, showing us that all people can change and everyone should have a second chance.  Tom Hardy's Bane is perhaps the most fearsome villain I've ever seen on the screen, even if he lacks the electricity that made Heath Ledger's performance in the Dark Knight so monumental.  And then there is Marion Cotillard who, even though she wasn't given enough screen time, still managed to steal many of the scenes she was in.  Joseph Gordon-Levitt gave a good performance as well, though I don't think he was given enough of a chance to show off his skills.  The returning cast was all great as well, particularly Michael Cain.  It is inevitable that this film will be compared in every way to it's towering predecessor, and in many ways The Dark Knight Rises is better.  For example, the Screenplay seemed much tighter for this film and was almost 100% devoid of cliches that somewhat dogged the first one, and the amazing score by Hans Zimmer seemed to be more thrilling in this film.  However, as a whole I think audiences will respond less to this one because of it's much more pensive nature.  It doesn't all fly at you with lightning speed like The Dark Knight does.  To fully appreciate this movie you have to be fully engaged and you have to come at it with an open mind and a willingness to want more than just a lot of action and violence.  My only big complaint about this movie is that even though it was 2 hrs and 45 min long, it still felt to short."
    },
    {
      "rating": "10",
      "text": "It is an amazing film.Although Tom Hardy as Bale isn't able to match the performance of Heath Ledger as the Joker, but he gives a very solid performance.The acting of Bale too is great along with a brilliant plot.I think it really is the epic conclusion to the Batman Trilogy.Thanks Nolan for this film:)"
    },
    {
      "rating": "10",
      "text": "Okay, Marvel fanboy here, and I'm saying that the Avengers was just surpassed here. Let's be real, The Avengers was a cheesy explosion of special effects. A very good one, but it doesn't match the gripping emotions, the stellar acting, and grand directing of this film. The Avengers is great pop culture entertainment, Rises is simply great CINEMA."
    },
    {
      "rating": "10",
      "text": "The movie content is fantastic. Must see,btw. It's one of a kind. Christian Bale did it again , hope it tops the charts yet again .Guys please try and give it a 10/10 rating , I just want this movie to break all records and set its position on cloud nine."
    },
    {
      "rating": "10",
      "text": "awsome movie. i was shocked at bane character ! nice plot. critical thinking. i love bruce wayne spirit. i can feel the pain.uhhh....anyway..4 years i wait for this sequel.....wow....i was so happy last nite..most of the audience clap hands at the end...thank you NOLAN.."
    },
    {
      "rating": "10",
      "text": "Now I see it, it sounds like batman's struggle against the Avengers. but there is no point of comparison, because batman does not compare to the movie of the advengers child."
    },
    {
      "rating": "10",
      "text": "Incredible and satisfying end to the Dark Knight trilogy. This is as good or better than the previous movie, and it is probably the best way they could have ended the series. The acting is great, the action scenes are amazing, the music is epic, and the story is very well executed. Highly recommended. The best superhero movie since the Dark Knight, and perhaps the best of all time."
    },
    {
      "rating": "10",
      "text": "I'm going to go out on a limb and say this is the best Batman movie ever. The action, scale, and emotion involved is breathtaking. Bane rivals the Joker as one of the best villains I have ever seen. This movie will have you on the edge of your seat and keep you holding your breath the entire time."
    },
    {
      "rating": "10",
      "text": "Just when i didn't think it was possible, i was proven wrong. \"The Dark Knight Rises\" tops \"The Dark Knight\". Wow, talk about an amazing film. Amazing performances all around. Definitely the best goes to Tom Hardy and his exceptional work as Bane, while being excellent, he still wasn't as good as Heath Ledgers job as \"The Joker\" though, but Bane was still bada$$. Christopher Nolan is a genius and a mastermind. He has just created the best trilogy ever! I'm sad to see it end but at the same time i have to give a hand for Mr. Nolan and the amazing work he has done and its a good thing he doesn't overdo it and he knows that, one of the reasons why he \"ends\" it with \"The Dark Knight Rises\". Whether you're a Batman fan or not, you simply must enjoy this film because it is a pure stroke of genius. Everybody needs to witness this awesome, pulse-pounding, heartracing, and exciting film. Christian Bale, Tom Hardy, Anne Hathaway, Joseph Gordon Levitt (who was amazing especially) Gary Oldman, Morgan Freeman, and Michael Caine all had outstanding performances in this movie. This movie in every sense of a way deserves a 10/10. The Dark Knight Rises will leave you with your mind completely blown, and the people who have already seen it know exactly why i say this. Now stop reading this review and go witness Christopher Nolans latest and last Masterpiece of our favorite vigilante \"The Batman\"."
    },
    {
      "rating": "10",
      "text": "The movie is about equal to the dark knight, which is a superb thing. the start is kind of slow and there are a few minor unexplained things, but just an overall brilliant film. the ending is the best i have ever seen in a film!"
    },
    {
      "rating": "10",
      "text": "The production values are brilliant. Camera, costumes, sets, production design and the rest are superior and, with the roller coaster ride Nolan gives us, make the 164-minute film fly by. My Favorite batman Flim yes Better than TDK :)"
    },
    {
      "rating": "10",
      "text": "Chris Nolan did it again. The dark knight rises  topped the the dark knight. Rises had the best cast  and best plot making for a entertaining edge of your seat summer block busting box office hit. I  would recommend seeing it  and i will see it again."
    },
    {
      "rating": "5",
      "text": "I liked this movie.  But the problem is I really wanted to LOVE this movie.  There were just so many small plot holes and inconsistencies throughout the film that kept creeping in and jarring me out of the experience as well as several secondary characters that really served no purpose at all.  I would list them out but I won't to avoid spoilers.  All in all, this felt kind of sloppy for a Christopher Nolan movie."
    },
    {
      "rating": "4",
      "text": "It's not a bad movie, not by any stretch of the imagination. It's certainly superior to Prometheus. However it lacks any impact. There are no memorable performances, ideas, moments, scenes or effects- good or bad. I didn't walk out angry but I was certainly disappointed.\rBane was horribly realized. I'm sure the mask was a severe burden on Hardy's acting but I never connected with Bane the same way I did with the Joker, or even Ras. And given that he is probably my favourite Batman villain, that was a severe disappointment too. The voice is also frankly atrocious. It sounds like a stereotypical old man but through a Darth Vader filter. Half of his lines were unintelligible and the rest had any menace robbed from them thanks to the ridiculous tambre. The more we learn about him, the less sense he can his motivations make. Apart from that, the rest of the movie was just... just there. Anne Hathway made a pretty decent Femme Fatale, but the role never really evolved beyond that. I think there were just too many characters and development was spread too thin. I never got emotionally invested in any of the characters, and consequently the action and drama just didn't carry much weight.\rSpeaking of spreading too thin, for a Batman film we see very little of Batman, and only marginally more of Bruce. He spends the entire first act hobbling around and then after two or so action scenes he spend most of the second act wallowing in a cell while what can only be described as 'Stuff' happens.\rThe take home message of the film is shocking. Apart from pissing all over the 'people are essentially good' message of the second film, it also seems to be giving a great big middle finger to the idea of socialism and the Occupy movement. There's also a big thumbs up for authoritarianism. Did Frank Miller write this? Not to mention another subtext which seems to infer you should be grateful if you grow up in poverty or hardship as it will give you strength.\rAll in all it's a deeply flawed film in its conception and execution. It's crime isn't so much that it does things badly (not to say that it doesn't do things badly), but that it doesn't really do anything well. It's the epitome of 'meh', neither good nor bad, but with some shoddy characterization and ideas. A plain cheese sandwich made with slightly stale bread.\rI think Nolan was too focused on referencing and drawing from comic source material and desperately trying to create a historical parallel, and not paying enough intention to just making a good film off his own talents. All in all, it's a big step back from The Dark Knight, and an unworthy ending. It's worth a look simply for closure, but probably as a rental."
    },
    {
      "rating": "4",
      "text": "After watching The Dark Knight, I knew right away that Rises wasn't going to top it. That was the mentality that I had going into the theater, hoping to be pleasantly surprised, yet expecting, at the very least, a satisfying conclusion. I got neither. To put it simply, this was both underwhelming and dumb. The movie opens with an entirely too elaborate plane heist for what amounted to the abduction of some arbitrary nuclear physicist that doesn't become relevant again until halfway in, only to be killed off just as soon as his importance is explained. If you really think about it, he wasn't necessary. All it really amounts to is some pithy moment at the football stadium where Bane establishes that the physicist was the only person capable of decommissioning a bomb, then kills him immediately to shock everyone. That was **** stupid because he wasn't even in Gotham before he was abducted, but I know everyone else in the audience was mesmerized and got chills. Idiots. Speaking of which, Bane's voice was impossible to understand and surprisingly wimpy sounding behind that mask. Maybe it's just me, but I seriously had no clue what he was saying when he talked in the microphone, further distorting his already hard to comprehend voice. Honestly, the movie jumps from plot point to plot point so quickly that you barely get the gist of what is going on before the shot changes again. Something else that was noticeably absent was the grittiness of the first movies. The emotions felt more genuine in the first two movies, whereas the acting in Rises felt phoned in. No one character really gets a whole lot of screen time. You don't get a chance to give a damn about them before the scene ends. Lotta plot holes in this movie, too. First, the movie establishes that Bruce Wayne has no cartilage in his knees any longer for some reason, forcing him to walk around with a cane. That's remedied by a quick scene showing him using high tech joint support devices that solve this problem while also enhancing his strength to the point that he can break through stone without effort, but then as Batman, he gets the case of the stupids and gets his dumb bat ass kicked by Bane, captured and stripped of his Bat Suit as well as joint support gadgetry, and abandoned in some underground prison. Not only that, his back is broken. So, magically, he's cured of his joint problems with absolutely no explanation, and being hung by a rope fixes his broken back. Dumb. Catwoman barely has any screen time, and arbitrarily wears a fetish leather suit with goggles later in the movie. Also she is an implied lesbian/bisexual with the scant couple of scenes and dialogue with her blonde friend or perhaps roommate. It's not really explained or necessary, but does it really matter? You're not doing the math when all you can think about is sex, are you stupid? Robin is a cop who actually doesn't help the situation even one god damn time. Nothing he does actually affects anything, so I have no clue why he's in the movie other than for the one line where someone tells him he should use his full name, \"Robin.\" Wow, was that supposed to shock me? You think I didn't know who he was supposed to be? Oh, and somehow Batman is able to fly a nuclear bomb out to sea with his Bat copter thing with only 40 seconds left on the timer, then escapes from a 6 mile blast radius, when just two scenes before we see him just barely outflying tank missiles inside the city. The movie even confirms he somehow did this by indicating that he flew his copter back to Luscious' weapons depot without being noticed. I found this movie very hard to watch because of how brain-dead it was. This movie obviously wasn't meant for me. It was meant for morons with 3 second attention spans. Frankly, I'm shocked more people aren't pissed."
    },
    {
      "rating": "3",
      "text": "Ultimately the problem with the movie is the plot makes no sense at all. As I'm endeavoring to not give away anything, so I'm going to be intentionally vague. There is no logical explanation for the actions of the villains in this movie. Nothing to justify why they are doing what they are doing, and even if you work past that and accept that they just are, what they end up doing doesn't even make sense in the context of their stated goals. Unlike the insane, but methodical plans of the Joker in the second movie, the bad guys in this are just plain insane, and yet they play it far more straight-faced than the aforementioned previous antagonist did.\rThe next problem is the action. The whole \"comic book movie\" excuse that gets banded around so often can really only make up for so much. The core of the issue is that in Nolan's Batman universe, bullets seem to be more precious than diamonds. For some reason this did not feel quite as obvious in the previous two installments as it did in this one. Every action scene has mooks running up to Batman or other characters with guns in their hands to be easily disarmed. The frequency with which this happens in staggering. Barely anyone ever fires their guns throughout the movie and when they do, they make Stormtroopers look accurate. This culminates in a massive all out battle in which literally thousands of people suddenly forget the deadly projectile launching devices more or less all of them are holding and start laying into each other with whatever is available on hand. The sheer absurdity of the scene makes it impossible to ignore the issue even if you'd intentionally not payed attention everyone running up to martial arts specialists to be easily disarmed up to that point. All of this casts an absurd, practically silly light on the action that really detracts from the movies tone.\rNext problem: Exposition, exposition, exposition, exposition, exposition...you can see where I'm going with this. A character enters a plot important room and they start spouting exposition about it to people who quite obviously and unmistakable already have this knowledge beforehand, and nobody questions why they are being told something they already know. The sheer volume of exposition in this movie pushes the already ridiculous runtime past the point of tolerance.\rHonestly, I feel tired of this movie. I felt tired of it by the time it finally ended on it's awful cop-out ending, I felt tired thinking of all the things that really did not work in it, and I feel tired listing them here. I'm sorry, it just really isn't a good movie on almost any level, which is a crying shame seeing as it's predecessor is one of my personal favorites."
    },
    {
      "rating": "3",
      "text": "It is not our own fault, as a collective audience, that the third film in the trilogy is often so pressurised into being a fantastic, ugly and plot-less mess.  We get overexcited and speculate endlessly and wildly about the plot and twists of the film to the extent where the creators are left with no option but to go hell for leather and overload, over-complicate and overextend themselves when it comes to actually making the damned thing!  Nolan has in the past provided massively entertaining well written, scripted and directed works of cinema, (TDK, Inception and YES prestige) I do not doubt his talent.\r TDKR was not one of them, the dialogue lacked the wit and pithy impact of the previous film to the point where everything felt rushed and miscued.  The plot 'twists' were obvious, unnecessary and entirely  un-intriguing.  The action scenes were fine, a little drab although I appreciate the 'broken Batman' concept.  Bane was good and would have appeared better if the rest of the plot had stood well around him.  A suitably frightening bad guy I loved the voice and the interactions between him and his army (although why they are so willing to die at his command is never fully explained).    The prison scene could have worked in another film, similar to Batman Begins for example, but were an irritating and contrived side plot, especially the whole rock climbing bit (was this the key scene? Not sure).  Give a director enough budget and he will drop your expectations through a trapdoor."
    },
    {
      "rating": "4",
      "text": "The Dark Knight was the best superhero film to date.  However, TDKR was not.  It wasnt even good.  The entire movie was slow, boring, preachy, pandering,  and had practically no action.  If you know Batman lore, you know who Miranda Tate is, so the \"surprise\" at the end, wasnt a surprise.  And even if you dont know the lore, it still wasnt all that much of a twist.  It felt like an afterthought to throw into the movie.  All the people who say TDKR was the best movie ever and gave it a 10, have not seen the movie yet, or are just insane fanboys that will love anything with a bat symbol on it."
    },
    {
      "rating": "5",
      "text": "Underwhelming. The Dark Knight Rises had a lot to live up to with the superb previous two movies and it simply doesn't. I don't want to knock this film for not being the previous two though, that'd be hard given how staggering the Joker was in the last movie, but as a film in itself it just isn't that spectacular. First the good; some of the characters are excellently portrayed. Bane in particular was fantastic, both built like the proverbial brick privvy but educated sounding and melancholy, although it's hard as hell to hear him at times. Catwoman was also very good and most of the regulars in general, though this in itself seemed to make Bruce Wayne/Batman seem somewhat sidelined. The visual were good and clear with nice scenery and the like, special effects not being too over the top and so forth. The ending (what we've all realistically been yearning for) was a mixed bag and that leads me onto the weaker aspects. The road to the ending was ridiculously convoluted. The plot is jarring and it felt at points that my suspended disbelieve had been hanged from the neck until dead and hung from a skyscapper. Gaping plot holes present themselves as the story weaves and back tracks and slides from here to there with a few unsubtly placed references that will no doubt crop up later in some significant way. Hey! Hey! You see this thing? Notice how we are mentioning it now?!\r So convoluted is the plot that it makes a review hard because I don't want to give much away for the folks who want to see this movie. Allegiances change and new villians crop up so much I gave up trying to understand their motives and just waited for the finale. The final twist regarding characters almost made me facepalm and mutter to myself 'seriously?'. In short, with out giving it away, Bane is the big villian who wants to use a doomsday weapon on Gotham (you've all seen the trailer with the stadium, don't pretend you haven't). But the way he goes about this evil genius plan is just bizarre and left me questioning who the hell is actually running Gotham? From bizarre police tactics, to a lack of massive fire outbreaks (earthquakes = gas line ruptures) to the outside world just going 'meh' at tense situation, plus a utterly weird mechanic for forcing the plot resolution, the film veers from silly to stupid amidst long stretches of not really very much happening. I was actually a tad bored about an hour in for a few minutes and when the action did resume my brow was knotted with disbelieve. I think in particular to a scene with police versus baddies in a scene not unlike the film Zulu with regards to firepower. What ensues just doesn't make sense but provides a wonderful showdown for the heroes/villains. And while the acting is one of the strongest ponits of the film (with a genuinely touching scene with alfred and bruce wayne) some of it is just hacky and truly 2D. There's even some special cameo's which instead of making me more excited, as they should, actually gave me the impression the film was just trying to hard to fit every significant character in. Appart from the tragically dead ones, of course. And then there was the ending. I can't say a great deal without spoiling this and I wouldn't want to do that, but then that's the point. Put it like this; a film is about the journey, not the ending. If I spoilt the ending the film wouldn't seem that worth it. The sixth sense, by comparison, you might think that the progression of the story was enough that even knowing the ending (he's dead. If you didn't know it by now, shame on you), you still were taken on a journey by the film. The DKR didn't feel like that. At first I was angry (Batman being my favourite superhero), but then I thought, no, it's a brave way to end things that Mr Nolan's done and I respect that, I respect that he's taken this, probably unpopular, path to conculude the story  and that he's- on now wait he hasn't after all. Hey!! Remember that thing we kept shoving in your face!!! Surprise! Even the tying up of the loose ends sadly seemed a little forced and unsubtly, leaving an overall bad feeling in my mouth, washed down with now flat cola. Pros: Some excellent actors for roles of Bane, Catwoman, Alfred, Blake and Gordon.\rGood special effects.\rGood scenery and cinemtography.\rAn attempt at a unique and unorthodox ending to a superhero trilogy.\r Cons:\rSome dodgy acting and bad voice work, especially for mumble mumble Bane.\rRidiculously convoluted plot.\rGaping and fatal plot holes (five month old sweaty cops anyone?)\rNot enough balls to go through with the supposed ending to make a unique film.\r Overal a rather sad 5/10 (would be 6, but I don't want this showing up as a green).\r P.S. To those that have seen this and are reading reviews to justify their own opinions (we all do it), speeds of over 360 mph would be needed for the ending, right? Yeah, right."
    },
    {
      "rating": "4",
      "text": "While not the worst film ever made, The Dark Knight Rises is certainly a major letdown. The film is mired by numerous plot holes, logic errors, jarred storytelling, amateurish editing, bad pacing and transitions, and lack of explanation as to who the new comers are and why we should care. Not to mention the plot twist after plot twist that is thrown at the audience during the dull 2 1/2 hours you'll spend watching the movie. There are numerous things touched on in the beginning that are ultimately thrown to the wayside (see: Bruce's \"brace\") that distracts from the viewing experience and breaks the immersion of the film. There are also problems with the voice acting given during this movie; Bane is the primary culprit, but even Bruce, Alfred, and of all things Batman have issues with clarity and not sounding ridiculous. The logic of some of the characters in the movie is absolutely stupid as well (see: acting police chief when Bane makes his move).  I just want to conclude by saying that \"Auto-Pilot\" doesn't mean \"magical plot transporter\".  You'll see what I mean when you watch the film to it's non-nonsensical conclusion."
    },
    {
      "rating": "5",
      "text": "The Dark Knight Rises was slow, often boring. It makes a few assaults to the audience's intelligence. Implausible, convoluted, often predictable, and cliched. The worst parts were the boring and convoluted.\r Few action scenes, waaay too many mopey emotional scenes. The bad-guy-plan, well it was like building a 100 part mouse trap to catch a fly you could swat with your hands. This was a long movie, but instead of reinforcing some of the more interesting plot points and developments they spend most of the time investigating and re-investigating Bruce-Wayne's **** attitude. There are many uninspired and uninteresting lines. Cliched phrases are tossed around without ever making real sense. Bane explains so many of his motivations, but they all somehow fail to make any sense as to why he's doing what he's doing. When you arrive near the end you find out that all Bane's talking was irrelevant anyhow. Some scenes, especially the ones with Alfred or flashbacks, were complete copies of scenes that had already appeared previously in the movie, with maybe a subtle difference. This made those scenes, boring and predictable.\r So many flashbacks, but not to shed light on the story, but to misdirect you. The sad part is, even with the misdirection and the \"twist\", they hardly spent enough time on the character involving the \"twist\" to make you care, all this effort placing your attention on a plot point that ends up being irrelevant. 5 out of 10. If yer bored, watch it. I would have been more entertained doing something else."
    },
    {
      "rating": "5",
      "text": "This movie reminded me of a combination of Weekend at Bernies (especially part II) and the video game Burgertime.  This becomes especially apparent toward the middle of the film.  Toward the end, the film picks up speed and Hans Blix's score really helps keep you awake.  I also suspect that that movie theater I was in was pumping in something more than oxygen to keep the audience beyond awake as I went to the 3 am viewing and by 3:30 am, people were clapping at scenes that did not seem to deserve clapping and at several points during the film the guy next to me stood up and yelled: \"Go Batman, Go!\"  As to the end of the film, what can I say but that it is truly amazing.  The closest movie ending I can think that compares is the end to Cannonball Run when Captain America/Captain Chaos rescues a woman's dog and he and Burt Reynolds lose the race, but win the moral victory.  The parallels are indeed almost frightening and I wouldn't be surprised if Christopher Nolan eventually reveals that Cannonball Run (and its precursor, Smokey and the Bandit) was his template for this movie.  A solid film that stands alone as a pretty decent film, but is lacking in that Burt Reynoldsesque/Don Knotts levity that a dark movie like this sorely needs."
    },
    {
      "rating": "3",
      "text": "Unfortunately the benefit I thought I'd get by seeing the entire Trilogy tonight of Christopher Nolan's brilliant Batman world actually worked against me.  Seeing Batman Begins, by far the best of the three, again had just as much of the magic as my first opening night screening.  The Dark Knight, too, continued to set the GOLD standard for superhero filmmaking.  That is why seeing those two masterpieces bumped up against this awful excuse for a Batman and an even worse excuse for a Christopher Nolan film, made the evening purely miserable.  First, the opening scene introducing Bane and the ending wrapping up the Trilogy We're the best 20 total minutes of the movie.  That, and a fantastic, yet not-used-as-much-as-she-should-have-been Catwoman portrayal by a very sexy Anne Hathaway, pretty much summed up what was worth seeing in this clumsy, poorly written, poorly acted travesty of a sequel.  The vast majority of its 2:45 running time resembled not one ounce of a Christopher Nolan film, save for the above caveats.  Christian Bale even appears to have forgotten how to play Batman and Bruce Wayne.  The cast was almost unrecognizable, and for that I blame the script.  Color me disappointed."
    },
    {
      "rating": "9",
      "text": "The Dark Knight Rises completion of the iconic Batman trilogy from Nolan. And although The Dark Knight was difficult to surpass, especially in terms of antagonist. Joker certainly looks a lot more serious and interesting than Bane. But Tom Hardy played a great role. Again a magnificent cast. And most importantly, The Dark Knight Rises logical completion of the trilogy, all plot branches are completed, the main plot is completed. In the modern world, there are not so few series of films, even less often series that are completed on time."
    },
    {
      "rating": "8",
      "text": "A very good ending for the trilogy, although I wouldn't put it on the same level as the second movie, it's still a damn good one. The amount of tying into the first two movies is unreal and everything around Bruce, Alfred, and the rest of Gotham is resolved beautifully."
    },
    {
      "rating": "8",
      "text": "Perhaps it is in fact the weakest one of the Nolan Trilogy in my opinion. I don't think it deserves a lot of the hate it gets as it is still a great movie overall. The action was good, acting from everyone is good and it is still overall a pretty good movie."
    },
    {
      "rating": "10",
      "text": "The fight scenes are very well choreographed with the whole mix of martial arts that Batman is famous for except perhaps this time he has met his match.One might say that this is perhaps the last great superhero movie DC comics will ever produce but nobody knows what the future might bring."
    },
    {
      "rating": "10",
      "text": "This is the best movie of the trilogy. It ties everything together in an awesome and cohesive way. A worse director would have fumbled with the twist villain thing, but I thought Nolan handled it spectacularly."
    },
    {
      "rating": "10",
      "text": "The latest film in the Nolan trilogy, a perfect closing to one of the best superhero trio lodges, the cast behind it does a magnificent job plus the photography, action scenes, choreography, becomes an immersive film, me I've seen this movie more than 30 times and I'm not tired, it's just the best that the director has"
    },
    {
      "rating": "10",
      "text": "The Dark Knight Rises was gloriously the best moment of my life in a movie theatre. It stands alone, peerless in the pantheon of superhero movies. There will be no spoilers here and if the impulse to spoil yourself before watching the film is too excruciating to bear, remember this, it'll be the equivalent of Selina Kyle robbing you blind. When Batman Begins came out, I was very sceptical about watching another one of those Batman flicks, such is the enduring traumatic impression Joel Schumacher's films left me. Thank goodness I did and from that point on there's no turning back. Christopher Nolan's finale made all the recently released superhero movies look like child's play to be honest, it is the appetizer to the main course that is the final chapter of The Dark Knight trilogy. The typical critique of Chris Nolan's movies is that it might be too cerebral for the casual moviegoer, no it's not. His films are universal, it's so well-layered, directed towards everyone. If you're more of the \"intellectual genre\" you'll notice the political undertones and social commentaries and what have you, but even if it goes over your head, it doesn't detract your experience from the film. Fanatic fans of the Batman comics will love all the little nods and references, even the major ones from the comic books thoughtfully implemented throughout the film.Christian Bale is just magnificent, as he puts it he plays three characters, the billionaire playboy Bruce Wayne, the true persona of Bruce Wayne still grieving the lost of his parents and the Batman. He's the defining actor of The Dark Knight, his portrayal of all these characters are just perfect and even though he's a man dressing up at night as a bat beating criminals to a pulp with his bare hands, we empathise with him. Returning inhabitants of Gotham and Bruce's fundamental foundation of his lifestyle is Gary Oldman's aged and weary morally-strayed Commissioner Jim Gordon, the Q to Batman's James Bond, Lucius Fox and possibly a Best Supporting Actor nominee perhaps, the closest thing to a father figure Bruce can get, his moral compass, oozing with words of wisdom, Michael Caine's Alfred Pennyworth. Scenes between the trio are so poignant, beautifully crafted and presented, it's so hard to watch without getting a lump in your throat, to describe it as tear-jerking ia an understatement. One of the newcomers is Joseph Gordon-Levitt's solid portrayal of beat cop John Blake and Marion Cotillard's enviromentalist Miranda Tate. The chief antagonist is Tom Hardy's full time terrorist Bane, He's frightening to watch, Tom embodies and embraces the sheer brutality and monstrosity of \"the mercenary\" flawlessly with half his face covered up, the way he conveys his emotions with only his eyes is amazing. Anne Hathaway's morally ambiguous Selina Kyle is a wild card, it's really fun to watch the development and chemistry between Bruce/Selina and Batman/the cat burglar. The 2 hours and 44 minutes running time didn't feel long at all, the story flows seamlessly as it comes full circle with flashbacks from Batman Begins and The Dark Knight, it's all beautifully balanced between the intimate moments of character development that's unusual in a summer blockbuster film and the really elaborate and simply put awesome all-out war action sequences and the choreography of the brawls between Batman and Bane is much improved than the previous films. The most important element of The Dark Knight Rises however and what makes it a gem is that it manages to amp up the suspense and anxiety to incredible heights knowing that every single character is dispensable including the Batman. When was the last time you watched a superhero film and feel a genuine concern that our hero is not going to come out alive? Exactly.Thank you Christopher Nolan for not giving in to the public and I'm assuming studio demands to continue this magnificent 7-year journey we have all been through together, to truly end this great vision of the legend with integrity, to give this great story a great and true conclusion to let the Batman ride off into the sunset if you will. It was the ending this iconic character deserved. And to anyone who thinks the Rises in The Dark Knight Rises is just a convenient way to name the film, it makes complete sense, it"
    },
    {
      "rating": "10",
      "text": "What should you do? As incredible as it seems, you should just sit back in the movie theater, relax and be blown away as much as I was for sure. the best movie of 2012!"
    },
    {
      "rating": "10",
      "text": "It's the best movie I've seen. Magnificent performances, nolan IMAX uses very well. Spectacular. Bale, Anne and Hardy are great. No one should miss. 10/10"
    },
    {
      "rating": "10",
      "text": "It concludes this trilogy in such a great way that makes the three movies function as one piece of storytelling. Most importantly, it's an amazingly written and acted story that lives up to the hype generated by the previous ones and faithful and honest towards the comics that originally brought The Dark Knight to a legend status."
    },
    {
      "rating": "10",
      "text": "Rounding out the list is the final installment of Christopher Nolan’s trilogy; The Dark Knight Rises. Knowing that this would be the last movie in the best Batman trilogy to date made it a must see and brought everyone out to the theaters to watch Christian Bale put on the costume one last time. The  movie featured two other star performances from Anne Hathaway as Catwoman and Tom Hardy as the huge villain Bane. The Dark Knight Rises was another massive hit that was the perfect sendoff for this series and brought in just under $1.1 billion worldwide"
    },
    {
      "rating": "0",
      "text": "The miracle of Nolan’s Batman trilogy is the way it imprints those myths with the"
    },
    {
      "rating": "9",
      "text": "All the suspense and action we have come to expect from Nolan, a great film and certainly a worthy ending to such a successful franchise."
    },
    {
      "rating": "8",
      "text": "Bane is a boring villain. There was too much Bruce Waine drama for too few Batman action. We were required to take too many leaps of faith. The people from Gotham (I mean, the good citizens) should have had more participation in the movie. The story feels a bit recycled, with the difference that this time it also feels nonsensical at parts. Despite all of this, I truly enjoyed the conclusion of the trilogy. Anne Hathaway and Joseph Gordon-Levitt really enhanced the movie. The climax of the movie was well developed and I liked the ending."
    },
    {
      "rating": "8",
      "text": "http://www.youtube.com/watch?feature=player_embedded&v=BQyLjWXiTl0\r A comedic Review of The Dark Knight Rises. Take with a grain of salt. Enjoy and don't be too serious."
    },
    {
      "rating": "10",
      "text": "Its hard to give a 10 because of its given representation of perfection, and The Dark Knight Rises is not perfect. Its starts slow and it may find itself a little tricky to understand at some points given its wide resemblance to the first movie, but the truth is that this movie when it ends leaves an impression. The impression of a work of class. Thats what ultimately enables such a score, because for me it is not about the perfection, but the experience, and the experience was awesome. The story concludes the trilogy in a very satisfactory and emotionally way, the characters and the actors portraying them are incredible, the music and special effects are spectacular. Nolan had already conceived an amazing villain with The Joker with the unforgettable performance of Heath Ledger, but Bane, Bane is the representation of evil and surely is the most brutal villain Batman has ever encountered. Overall, this movie is a work of mastery, one that would not be forget in years, pretty much like most of the director's work."
    },
    {
      "rating": "9",
      "text": "Its between The Dark Knight and Batman Begins. Better than Batman Begins but worse than the Dark Knight.  I really liked the ending though."
    },
    {
      "rating": "10",
      "text": "First things first, this is definitely not too long, I finished watching and still wanted more of the awesome action. It is not as dark as the Dark Knight, but is almost as good. The acting again (like the first two) is top-notch, with the Batman regulars all acting at their best alongside the new recruits (other than there were a couple of times when I didn't understand what was being said). Catwoman is pretty much perfect in the film, leaving me with a \"Year One\" taste lingering in my mouth afterwards and Bane was awesome, not Joker awesome but awesome enough, as you really do feel the power of Bane in his punches and character. However, there were a couple of things that just happened, firstly, when Alfred leaves, he just leaves with no more explanation (a minor fault really, as it is explained why he leaves). Secondly, Bane's death was just a little too... fast, but he did break Batman's back which is all kinds of good :) The film wasn't very complicated, and the ending was absolutely fantastic, perfectly rounding things off. While the film wasn't quite up to the incredibly high standards of its predecessor, it is by far the best film I have seen for two years (Toy Story 3 was the last \"masterpiece\" I saw in the cinema) and definitely lives up to the hype. The Dark Knight Rises is a perfect mix of Batman Begins and the Dark Knight and will (probably) be the best film released this year, so go watch it for goodness sake!"
    },
    {
      "rating": "10",
      "text": "An absolutely brilliant film, a fantastic conclusion to a phenomenal revival of a franchise. The overall feel to the film was amazing, along with the score (thank you Hans Zimmer) the film had a mixed vibe of Begins and The Dark Knight which was a great thing. To those who are a Batman/ comic fanatic, this does it justice. Although there are minor plot holes in the film- the \"major plot holes\"  that many speak of are actually misconceptions as there were explanations regarding these plot holes but not in an obvious form because they needn't be- Plus He's the GOD DAMN BATMAN!!!!"
    }
  ],
  "recommendations": [
    "avengers_infinity_war",
    "avengers_age_of_ultron",
    "superman_returns",
    "glass",
    "thor_the_dark_world",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "man_of_steel",
    "creed_ii",
    "ant_man_and_the_wasp_quantumania",
    "the_batman",
    "10_cloverfield_lane",
    "the_hunger_games_mockingjay_part_2",
    "x_men_apocalypse",
    "unbreakable",
    "maze_runner_the_death_cure",
    "batman_v_superman_dawn_of_justice",
    "bumblebee",
    "thor_ragnarok",
    "harry_potter_and_the_half_blood_prince",
    "spider_man_no_way_home",
    "the_invasion",
    "terminator_3_rise_of_the_machines",
    "thor",
    "sherlock_holmes_a_game_of_shadows",
    "the_karate_kid_part_iii"
  ]
}