{
  "id": 4771,
  "title": "The Faculty",
  "starring": [
    "Elijah Wood",
    "Josh Hartnett"
  ],
  "runtime": 104,
  "genre": [
    "Horror",
    "Science Fiction",
    "Mystery"
  ],
  "description": "When some very creepy things start happening around school, the kids at Herrington High make the chilling discovery that their faculty is being controlled by body-snatching aliens.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/l0rz4vB0FfxraTd1mLGoaydSQd1.jpg",
  "categories": {
    "plot": 7.055555555555555,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 7.2,
    "action": 7.818181818181818
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I don´t know why, but this is the kind of movie that makes me feel comfortable. It could be because of the characters; all of them have a particular personality. It also could be because Robert Rodriguez is one from few directors interested in camera movements and shots. Or because the music from the movie is good (the offspring, class of 99). Anyway, i feel good when i see this movie. Thanks Mr. Rodríguez"
    },
    {
      "rating": "10",
      "text": "During the cast pictures at the end, the science teacher who was 'killed' in the film is shown very much alive with a patch over his eyes and bandages over his fingers."
    },
    {
      "rating": "10",
      "text": "AlvaradoKTAJun 16, 2014Even on such a low budget, this is the best in the Mexico-trilogy films. Well paced from the opening title to the to be continued promise, every scene has a humorous note. An original script with a good amount of shoot outs, this film"
    },
    {
      "rating": "10",
      "text": "This is one of the best science fiction movie with teenagers ever. Everyone is great and they can act very well. Also, the movie has a very good concept of combining The Breakfast Club with Body Snatchers."
    },
    {
      "rating": "10",
      "text": "The Faculty has great actors, action, storyline and witty dialogue. The Faculty was made for a low budget,\rbut the effects look expensive because they're elaborate. Overall the whole movie is exciting and\rentertaining."
    },
    {
      "rating": "9",
      "text": "The Faculty is well paced and exciting from start to finish, essentially Invasion of the Body Snatchers meets high school. Gotta love the late 90s"
    },
    {
      "rating": "10",
      "text": "Tina Rodriguez: (at around 10 mins) the tattooed girl whom Marybeth asks where the office is, is director Robert Rodriguez' sister."
    },
    {
      "rating": "10",
      "text": "()()()()()()()()()()()()()()()()()()()()()()()()()()()(){}{}{}{}{}{}{}{}{}{}{}{}{}{}{}■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "10",
      "text": "Teenage movies from the 90’s were the best. Jordana Brewster was HOT! Nice one Frodo for scoring her"
    },
    {
      "rating": "10",
      "text": "Tina Rodriguez: (at around 10 mins) the tattooed girl whom Marybeth asks where the office is, is director Robert Rodriguez' sister."
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "10",
      "text": "When some very creepy things start happening around school, the kids at Herrington High make a chilling discovery that confirms their worst suspicions: their teachers really are from another planet! As mind-controlling parasites rapidly begin spreading from the faculty to the students' bodies, it's ultimately up to the few who are left -- an unlikely collection of loners, leaders, nerds, and jocks -- to save the world from alien domination!"
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●"
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$..$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "*\"*\"*\"*\"*\"**\"*\"**\"*\"*\"*\"**\"\"**\":*:¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}{}[][][][][[[][][][]()()()()()()()()!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%%&%"
    },
    {
      "rating": "9",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "9",
      "text": "A brilliant mix of science fiction and teen horror. This is without a doubt one of the best sci-fi films of the last decade. In a recent trip to the U.S. I had the pleasure of viewing this film(seven times) and loved every minute of it. It is a perfect example of both Kevin Williamson's and Robert Rodriguez's talent. It has a silly-sounding story, aliens taking over a school disguised as teachers, but you don't think about that as you are blown away by brilliant special effects, fast-paced action, smart-worded script and brilliant acting from both the teachers and the students. There is also the sexy Famke Janssen, Jordana Brewster and Laura Harris, and for the girls there's Josh Hartnett(I suppose). As for who the queen alien is, it will be easy for some people to guess, but surprising for others. For those who don't like horror there's the science fiction factor, including a brilliant shot of the alien in the school gym at the end. And for those who don't like science fiction, there's quite a lot of horror(or horrible scenes) like fingers running around on their own, a head crawling around on octopus-like legs, while its body searches for it in the background, and teacher being stabbed in the eye with drugs that affect it, it then begins to splurt white stuff, similar to that of the androids blood in ALIENS But it does take a teens perspective and is aimed at a younger audience(although not that young) and is so not that gory. So there's something for everybody, you should go and see it as soon as you can."
    },
    {
      "rating": "10",
      "text": "andkdneinomvpdmsosmqwaszxcderfvgtbhyuioolpkkmmjjhnbhxjskskdmerrqwkookpclmvmnbzcvbbfdj"
    },
    {
      "rating": "9",
      "text": "=:=:=;=;=;=;=;=;=;=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:____________________________♡◇♡◇♡◇♡◇♡♡"
    },
    {
      "rating": "9",
      "text": "Zusammenfassung: Als einige sehr gruselige Dinge in der Schule passieren, machen die Kinder an der Herrington High eine erschreckende Entdeckung, die ihre schlimmsten Vermutungen bestätigt: Ihre Lehrer sind wirklich von einem anderen Planeten! Da sich gedankenkontrollierende Parasiten schnell von der Fakultät auf die Körper der Studenten ausbreiten, liegt es letztendlich an den wenigen, die übrig bleiben – einer unwahrscheinlichen Ansammlung von Einzelgängern, Anführern, Nerds und Sportlern –, die Welt vor der Herrschaft durch Außerirdische zu retten!"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■"
    },
    {
      "rating": "9",
      "text": "This is a Brilliant filmThis film is brilliant I love it from start to finish,  it has plenty of cute lads in it too like Elijah Wood and Josh Hartnett, but I prefer Elijah Wood, he is brilliant in it. And im glad he's the one to save the day. If you want a exciting film from start to finish rent or buy this you wont be disappointed. I'm glad I watched it. The Faculty is pure originality, with a knockout cast & eye popping special effects."
    },
    {
      "rating": "9",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "9",
      "text": "Best Studio Sell Out Ever! Robert Rodriguez, best known for the startling dichotomy of the Mariachi trilogy to the Spykids trilogy, makes studio teen horror cool here. With a cast that can't be beat, including my favorite actress of them all, Famke Janssen, and a script that holds together despite its far-out premise, this movie has all the makings of a repeat viewing attraction. Most of the young cast, Josh Hartnett, Jordana Brewster, Clea Duvall, have gone on to great careers, and it started here. Add in veterans like Robert Patrick, Bebe Neuwerth, Salma Hayek, and my all  favorite actress Famke Janssen, and it all clicks. The movie has enough thrills and chills to keep most horror fans engaged, and enough of a sci-fi premise to have the nerds drooling. Plus some partial nudity and a lot of sex talk adds a lot. I always enjoy this flick, seeing as was on on TV frequently. It never gets old, kind of like The One and Drop Dead Gorgeous. As for it being a sell-out, it was Rodriguez's first major studio flick, and had the master of sell-out Kevin Williamson writing it."
    },
    {
      "rating": "9",
      "text": "☆◇☆◇☆◇☆◇☆◇☆⊙☆⊙☆⊙☆⊙☆⊙*:*:*:*:*:*:*:*:*:*:**:*:☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙°•°•°°°•°•°•°•°•°•°•°•°•°•°•"
    },
    {
      "rating": "10",
      "text": "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\""
    },
    {
      "rating": "8",
      "text": "A very good horror film that creates an excellent character in Coach. The Faculty is well paced and exciting from start to finish. Modern day horror films seem obsessed with gore and violence, yet this shows how films within the genre should be made. Almost no gore is necessary, yet the film is still scary and much better because of the lack of gore. The plot is very good and the film is helped by excellent performances from all of the teaching staff. As previously mentioned, the Coach steals the show with a string of brilliant lines and encounters."
    },
    {
      "rating": "8",
      "text": "I do not think this movie would appeal to a person over 18 years ... But I loved it! The argument made ​​me think \"what if my school really happen?\". effects are not very good because the movie is from 98."
    },
    {
      "rating": "8",
      "text": "A lost teen horror classic of the pre-Scream era, and might be one of the few if not the only good one. While the characters are comparatively static to what one might like, the whole movie is an extremely fun and thrilling story with likable characters and a few cool plot twists to boot."
    },
    {
      "rating": "6",
      "text": "The Faculty delivers exactly what you expect from a highschool-comedy-horror. It has all the usual character archetypes played by soon-to-be megastars: the oppressed nerd (Elijah Wood), the whip-smart rebel (Josh Hartnett), the goth outcast (Clea DuVall), the misunderstood jock (Shawn Hatosy), miss perfect super-b*tch (Jordana Brewster) and the new girl (Laura Harris). Kevin Williamson's writing is sharp, funny and self-aware as always, and knowingly refers to the numerous earlier films The Faculty pays homage to. The film is consistently fun, with the best scene being the students driven to playing a rather unconventional version of Russian roulette through intense paranoia of possession by the film's parasitic invaders. The final act of the film does disappoint a little - its big, loud and unnecessary, and showcases the film's unfortunate lack of a decent budget. Though it doesn't have any glaring weaknesses other than this segment, The Faculty does still feel like it's lacking something. Perhaps its the fact that it would be fairly unremarkable teen schlock were it not for Williamson's contribution, or maybe its that Robert Rodriguez is allowed very little opportunity to inject his zany creative style into the film, and consequently it feels like it was helmed by any old mercenary director-for-hire. Even so, The Faculty is pretty consistently entertaining, with good performances across the board, a pleasing amount of laughs and horror and sci-fi movie references aplenty for the buffs in the audience."
    },
    {
      "rating": "6",
      "text": "Robert Rodriguez follows up his other B-movie (From Dusk Till Dawn) with another B-movie The Faculty, which screams for a cult following. Robert Rodriguez seems to like settling for mediocrity.  The writer Kevin Williamson tries to keep the steam rolling from his work on the first two Scream movies, but is running on fumes. After all that being said I enjoyed the movie for what it is."
    },
    {
      "rating": "4",
      "text": "\"Why are you naked?\" - Zeke\r Because what sexist film would be complete with a completely naked girl being the source of all of this mayhem and chaos at this school? How could a woman not be to blame for all that has occurred in The Faculty? It is really only the natural progression for a film that asks us to identify with Casey (Elijah Wood). A dorky kid who is constantly bullied, Casey is the classic underdog hero in film and despite obvious character flaws such as sniffing Delilah (Jordana Brewster) while hiding in the closet and despite creepily having a shrine dedicated to Delilah (okay, Jordana Brewster is attractive, but Jesus that is not anywhere near a free pass for being a 100% creep). I am not one to sit here and criticize how sexist a film is, but I feel is truly that obvious in The Faculty, which is a shame.\r With sexism as its main argument against, The Faculty comes armed to the teeth to appeal to kids who were marginalized (read: boys who were not popular in high school) by having Casey be bullied, pine after the hottest girl in school, have parents who cannot give two **** about him, not be athletic, and be a complete loner not just save the school, but also manage to scoop up the girl of his dreams in the process. Written like a wet dream, The Faculty is a creepy film that continues to dehumanize women in its treatment of women throughout. Not just Delilah and Marybeth are marginalized, but girls are all frequently called **** and shown to be quite **** and aggressive **** You Girl\" and Ms. Burke, in particular). Additionally, when Professor Furlong (surprise appearance from Jon Stewart) hits on Nurse Harper (another shock appearance from Salma Hayek) in a creepy manner, we are left to sympathize with him because how could anybody ever turn down such  Oh and, lest we forget, the demonization of the unseen wife of Mr. Tate (Daniel van Bargen). In spite of his alcoholism, somehow she is the evil one for leaving him for somebody else. God forbid.\r Other than latent and prevalent sexism, The Faculty is faulty in many other ways as well, if you are left unswayed. I can deal with a wildly unoriginal film, but this one is truly revolutionary in this regard. References to prior science fiction films does not get you off the hook for ripping them at every chance you get. It honestly felt as though ever line mentioned a different film and how it is possible that the events of this one were going to follow the same line. I love the Amazon Prime X-Ray feature, which shows you goofs, trivia, continuity errors, cast on screen, and other little tidbits about a film while you are watching it. For The Faculty, I was floored. Practically every shot had some tidbit about how it referenced a film. Some shots had multiple films. Truly impressive level of copying. I get the sense that if Robert Rodriguez had to use Turnitin for this film, it would come up with 0% originality.\r Now, there are a few positives. In spite of these concerns, it is quite a fun film. I was certainly entertained by the film and I am sure many who can overlook my aforementioned problems will enjoy The Faculty. Rodriguez's films certainly always have flair to them and this one is no exception. A fast paced thrill ride, The Faculty may be unoriginal, but it does ape many of the better qualities of past films and is filled with camaraderie, high school hijinx/personalities, thrills, and teenage angst classic rock hits that many would request of a science fiction/horror film set in a high school. These overtures on the part of the film are, admittedly, hard to resist. It hits all the right notes with its plot and the return is pure enjoyment.\r Additionally, Rodriguez has great attention to detail that clues you into characters or are simply quality jokes. From Zeke (Josh Hartnett) having \"USA Sucks Big Time\" in his locker to a car supporting the Herrington High School Hornets having \"Me So Hornet' written on it, there are some subtle jokes along the way. The film also showcases attention to detail in delivering thrills by having a banner hanging in the gym the reads \"Feel the sting\" as the monster corners Casey. These details were not lost on me as a viewer and were among the reasons why I was so disheartened that it opted to be so unoriginal and sexist in its plot and characterization, respectively.\r A fun and detailed film from director Robert Rodriguez, The Faculty has a solid cast filled with recognizable faces, plus Josh Hartnett with significant bedhead. That said, despite its boyish charms, the film is overtly sexist and as unoriginal as they come, thanks to familiar plotting, characters, and references. The film often feels as if Robert Rodriguez had just caught up with all of John Hughes' 1980s teen comedies, Invasion of the Body Snatchers, The Thing, all films by Steven Spielberg, and all of Stephen King's books before opting to just smash them into one film."
    },
    {
      "rating": "7",
      "text": "The main advantage of this movie is a number of great actors (most of them were pretty young and not famous at the moment of  production). The story is rather average for Sci Fi, there are some stupidities along the plot. The visual effects are not so good even for 1998. But still it's pretty nice to check it out if you haven't!"
    },
    {
      "rating": "6",
      "text": "Creo que el User Score le da un excesivo mérito a esta película, no es mala, de hecho es bastante entretenida, pero está muy lejos de ser aclamada ya que es básicamente Invasion of the Body Snatchers con adolescentes y a menor escala geográfica, el elenco lo hizo bien pero los efectos especiales son muy pobres, incluso la versión de 1978 de la película anteriormente mencionada tiene mejor aspecto. ¿De culto? Tal vez pero sólo un poco."
    },
    {
      "rating": "2",
      "text": "Too gory for my taste. The acting was average, and the actors looked straight out of a soap opera. I would skip The Faculty and watch a better sci fi."
    },
    {
      "rating": "4",
      "text": "Rodriguez est un peu le fils spirituel de Tarantino, il aime à s'abîmer et se viander dans le nanar à pop-corn et dans le cas de cette \"Faculty\", à se vautrer sans honte dans le film pour ados avec tout ce que cela peut comporter en termes de vicissitudes basses de plafond.On se tape donc les jeunes acteurs idiots (Josh Harnett, le blaireau de ces damoiselles) ou les jeunes actrices idiotes (la parité est respectée) mais pas seulement heureusement, car il faut bien des profs dans le bahut et un entraîneur gueulard en la personne de Robert \"T1000\" Patrick : c'est sans doute lui qui s'en sort le mieux en comparaison de Famke Jansen (la vamp à cervelle de blonde) ou Salma Hayek (l'insupportable poufiasse) ou même d'autres seconds rôles très inconnus au bataillon.The Faculty s'inspire et reprend à son compte l'Invasion des Profanateurs et The Thing dans le monde très scolaire des **** cons qui luttent contre la xénomorphie rampante (et galopante à ses heures perdues) avec des stylos de poudre stupéfiante (la plume est plus forte que l'alien).Entre gaudrioles et poncifs et effets digitaux à tentacules, le film sait néanmoins (presque) garder le rythme jusqu'à son final grand guignol trololol et se laisse (presque) regarder grâce à sa mise en scène maîtrisée. Je suppose qu'il faut sniffer des rails de sucre glace et descendre des shots de sirop pour apprécier à sa \"juste\" valeur cette regrettable série B."
    },
    {
      "rating": "6",
      "text": "There were already this type of stories before this movie came (Aliens land in small town, start taking over the humans and a group of people try to save humanity).I watched it because I heard about this movie from social media and learnt about it's cult-classic status. There was nothing special in the movie. But I liked a few things about this movie like main characters and suspense. Overall, it was one time watch and would recommend everyone to give it one time watch."
    },
    {
      "rating": "6",
      "text": "Aliens have invaded a high school, assimilating the staff and students but they can be killed with caffeine-filled drugs."
    },
    {
      "rating": "7",
      "text": "When Casey Connor, Herrington High School's newspaper photographer, witnesses the murder of a nurse and sees her alive again, he decides to investigate the bizarre happenings. (7)"
    },
    {
      "rating": "10",
      "text": "Excellent. A unique way of twisting the teenage horror genre. Instead of relying on the usual hack n slash tactics that many horror film makers have come to rely on, this film sneaks in a sci-fi undertone to add suspense. The cast of characters is diverse and wonderfully acted. Sure there are a few stock roles but the actors and actresses who fill them do a great job at putting themselves in the roles. It's a shame that this movie didn't gain the same cult following that other teen dramas such as Donnie Darko obtained but all the same, it is a thrilling film."
    },
    {
      "rating": "9",
      "text": "One of my favourite films!This is the greatest teen horror film!The cast are brilliant, especially Elijah Wood, Josh Hartnett, Clea DuVall and Laura HarrisIt's funny, exciting, scary and shocking. A beautiful collection of people making a film which isn't demanding or overwhelming, but still worth the 10+ times I've seen it!"
    },
    {
      "rating": "9",
      "text": "Williamson has redeemed himself.After spewing out garbage from I Know What You Did Last Summer, Kevin Williamson has redeemed himself with \"The Faculty\" First off like Scream and Scream 2 it is not necessarily scary but it was very entertaining. The plot is good but it transposes the typical \"Breakfast Club\" high school strata(the jock, the nerd, the druggie, the loner, ms. popular)typical 80's characterizations. But none the less a good plot. The actual action scenes were cool and the plot was fluidly flowing and the cast was excellent. A DEFINITE MUST SEE IF YOU LIKE PREVIOUS WILLIAMSON FLICKS."
    },
    {
      "rating": "9",
      "text": "Wosodnmdjvtxhgufuhjvyhycuu8fiuufutgjgyhivhuicrsttigyfkuhghgftxtfydestghigutdxrgihohisrrsfyigkhjguggujggjgj"
    },
    {
      "rating": "9",
      "text": "Scream meets The Thing. Great cast with superb direction though its not without it's formulaic drawbacks. I still love this movie"
    }
  ],
  "recommendations": [
    "wrong_turn",
    "from_dusk_till_dawn",
    "house_of_wax",
    "vacancy",
    "ouija_origin_of_evil",
    "the_babysitter",
    "the_prodigy",
    "the_conjuring_the_devil_made_me_do_it",
    "red_riding_hood",
    "the_house_with_a_clock_in_its_walls",
    "freaky",
    "disturbia",
    "case_39",
    "bone_tomahawk",
    "cooties",
    "annabelle_comes_home",
    "hell_fest",
    "the_collector",
    "carrie",
    "it_follows",
    "insidious_chapter_3",
    "fright_night",
    "the_curse_of_la_llorona",
    "pride_and_prejudice_and_zombies",
    "lucky_number_slevin"
  ]
}