{"id": 4072, "title": "The Lake House", "starring": ["Keanu Reeves", "Sandra Bullock"], "runtime": 99, "genre": ["Drama", "Mystery", "Romance"], "description": "A lonely doctor who once occupied an unusual lakeside home begins exchanging love letters with its former resident, a frustrated architect. They must try to unravel the mystery behind their extraordinary romance before it's too late.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/tHpc1118dYWLnHZleGhwZxRbpae.jpg", "categories": {"plot": 7.041666666666667, "acting": 7.0, "ending": 5.5, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "We see romance flicks so often today that sometimes we don't bother to look for the underlining layers that define them, bad romances just use cheap sex scenes and sexual dialogue to past the time so that you won't be lost in the horrible script and bad acting. Good romances on the other hand have unshakable romantic stories that touch the heart and uplift he soul, they have acting that almost renders you speechless and an unimaginably great script and story that you just love. \"The Lake House\" has all the qualities of a great romantic drama and so much more. This supernatural love story is something of a stand alone in the modern romance genre it follows protocol down to almost every layer of Romance. But somewhere along the line it takes a really long detour down the path of unique and mind blowing. This film is nothing short of brilliant and remarkable I haven't enjoyed a good Romantic drama since \"Titanic\" and \"Rome + Juliet\", this film was extremely entertaining, very sweet and movingly touching to the point that your almost in tears. This movie has the makings of greatness but it's mired down by the people calling it clique, predictable, unoriginal and unmoving. But I'm sorry this film doesn't have cliques, it's unpredictable, it's very original, and it's extremely moving. It resonates with the heart and with the soul on a whole new level, it makes you feel great and gives you that sense of love and enjoyment that you've been searching for in a romantic drama. It's so beautiful and so touching that you just can't ignore the romantic freshness that resonates from this film as you watch the story unfold right in front of you, It's story and plot are so warm and gentle and I loved every single minute of it. And if your forgiving and open your mind and look past everything you see today and look at this film with fresh eyes and a born again sense of love and happiness, than I can promise you this film will conquer. All in all this film delivers a very romantic, very touching and very unique love story that just happens to transcend time itself. The Lake House delivers."}, {"rating": "10", "text": "Great Love story; must see it."}, {"rating": "9", "text": "Great movie, my wife is going to love it, great themes, nice twist and good music. It's a remake from a Korean film that was also well done. Great casting too. I was surprised how far Keanu Reeves has come with his acting. I recommend it, although I'm an action/comedy guy. Also, for those who like to learn something or take away something from movies, this one had me reflecting a lot on the value of live and love. Maybe it will do the same for you."}, {"rating": "10", "text": "What I really like about this film is that it reunites Keanu and Sandra for the first time since they starred in Speed. After 12 years, they're BACK! And their romantic chemistry is still there. This time, it's drama and romance which powerfully strengthens their chemistry and feelings. Ever since they did not reunite since Speed 2: Cruise Control, I thought they would never reunite. Also, the plot may seem a bit too convoluted for scientists because there's a science-fiction wrinkle time difference of two years. What you don't realize is that it's not time travel. If you actually believe in the magic of this story, this romance fantasy will come to life! It's about realizing that the best moment of your life (meeting or getting to know a friend, not just in person but by letter) can happen unexpectedly. It's truly heartwarming and powerfully. Without Sandy and Keanu reunited, this film would flop. And this adorable, romantic couple is the only thing that makes this film shine. It's a love story about two friends who live two years apart and \"magically\" reunite. It shows that they truly have feelings for each other and care for each other no matter what. This film is a must watch for the Keandra fans."}, {"rating": "8", "text": "When two people like each other, the chemistry flies around them. That bond was evident in Speed, Sandra admitted, Keanu was probably insecure about sharing his feelings. And they seem to be great couple. A couple is always looking great when love is bidirectional. The Lake House is a symbol of unrealized love. Cried couple of times during the movie, it’s worth watching."}, {"rating": "7", "text": "Why are there so many idiots out there. You didn't like the movie, I get it....that is fine. But why are you saying its hard to follow/confusing?? For anyone looking for a short review, here it is. This isn't the best romantic film out there. But it is a little different than normal. Two lives unable to truly connect because they are separated by time. I wish they did things differently, but its not a film and is at least a 6/10.  I'll do 7/10 because it is memorable, sweet, and you are rooting for the characters. Its drawn out on purpose...its called suspense people. If you want the couple to get together in the first 30 minutes what would be the point to the rest?"}, {"rating": "9", "text": "Okay the plot was, shall we say “quirky” but I still liked this movie so very much.\rBullock and Reeves make for a perfect movie match to the point that if one didn’t know they would think the couple were either dating or married in real life."}, {"rating": "0", "text": "This is possibly the worst movie ever made. Everyone involved should be taken outside and beaten with sticks :-) The people behind this steaming pile of poo have obviously never heard of causality."}, {"rating": "3", "text": "The dog is a female whose name is Jack...talk about confusion. Unfortunately, most of The Lake House doesn't make any more sense than this misnaming of a canine. I like films that play with time as long as they also play by the rules. This one doesn't, and so comes to a conclusion that makes no sense and is quite dishonest. Had it ended several minutes earlier, it would have had some semblance of truth and believability. Sandra Bullock, Keanu Reeves and Christopher Plummer deserve much better than what they were saddled with here. Incidentally, \"The Magic Mailbox\" should have been considered as a title."}, {"rating": "0", "text": "Take the two most boring people in the world. Now imagine that you're an observer to a romance between them. You observe every small talk word, every move, etc. That's pretty much what the movie is. Any reasonably intelligent person can figure the movie plot out in the first few minutes of the film. Most of the film is just filler that serves to stretch a five minute story out to an hour and a half."}, {"rating": "1", "text": "What a disapointment. The slow and predictable development of this story was painful. What a waste of 2 great names."}, {"rating": "0", "text": "That anyone watched this movie and enjoyed it is beyond me. Most definitely the worst film that I have ever seen in my ENTIRE LIFE. And I usually like Sandra Bullock but she didn't have much to work with...awful dry script, a mailbox, Keanu Reeves who hasn't changed facial expression since the Matrix, and a plotline that will make you either vomit or fall asleep. There literately is a line in the movie that goes as follows: Did you have clown for breakfast? Enough said."}, {"rating": "0", "text": "this is probably the worst movie i have ever seen. i dont know what the world is comming to when movies like this are produced."}, {"rating": "5", "text": "The concept is here. It's actually quite clever in parts. But there is something about Sandra Bullock and Keanu Reeves that didn't seem to click for me."}, {"rating": "5", "text": "The Lake House is a unique idea to American cinema. From a monetary standpoint it attempts to attract both sides of the moviegoers, by blending the supernatural with the romantic. Nevertheless, what we have here is a transparent plot with every so-called twist preceded by enough clues to tell you what would happen not only in this film, but subsequent sequels. Bullock delivers, but Reeves continues to fail to engage the audience as a true leading man. It is good that they are rarely seen in the same frame. The director makes several attempts to incorporate the supernatural elements while maintaining the love story, but instead rams them together into a sometimes-unrecognizable wreck. Though I do give him chops for using such mixed-frame shots (ala Annie Hall) to make Bullock"}, {"rating": "10", "text": "Forget all critics. This movie is so great, so wunderful. best movie 2006 so far."}, {"rating": "9", "text": "Keanu and Sandra are a Hollywood pair that exhudes romance without even being romantic..this moviefits them well and the plot though sometimes ridiculous is somewhat extra-ordinaryly romantic..."}, {"rating": "1", "text": "Just awful. Two stars well pas the prime picking up a paycheck. The storyline is ridiculous and the acting even worse. REFUND."}, {"rating": "8", "text": "Movie was great until the end. They should have stopped it when she heard about his demise."}, {"rating": "10", "text": "I absolutely loved The Lake House. I think it deserves many awards, for someone to think this up and then put it on film with 2 amazing leads, is fantastic."}, {"rating": "0", "text": "Definetely the worst movie I've ever seen! I saw it at the theatre, but halfway I just had to get out of there. It was predictable and unbelievable and the caracters weren't well developed. I didn't feel any connection to either of them. I still don't understand why 'big' stars as Keanu Reeves and Sandra Bullock wanted to play in such a bad production."}, {"rating": "10", "text": "This was a very entertaining movie. and even if it hadn't been I would love Sandra Bullock and Keanu Reeves anywhere."}, {"rating": "0", "text": "I thought this movie absolutely sucked, it didn't make and sense and it was the worst movie I"}, {"rating": "10", "text": "I anticipated the release of the Lake House more than of any other film. I fell in love with the trailer and I watched the movie twice on the day it came out. Everything about it is beautiful - the characters, the setting, and the plot. My all-time favorite movie. :)"}, {"rating": "2", "text": "This movie was completely cliche, I had such high expectations that quickly came crashing to the floor."}, {"rating": "0", "text": "Just didn"}, {"rating": "10", "text": "It started off slow, but picked up towards the middle. I really enjoyed this movie. Quite original. Reeves isn't the best actor for romance movies, but his intensity made the movie that much more enjoyable."}, {"rating": "10", "text": "The Critics don't know a thing. This is great."}, {"rating": "9", "text": "This is a nice relaxing romance with a twist."}, {"rating": "0", "text": "This is an insult to women. I love romantic films. This one is so slow it is like watching moss grow on a rock. When it finally ends it is so preposterous that you leave the theater disgusted. Hated it."}, {"rating": "0", "text": "This movie is a dog. And the dog and slow developing story near a mailbox is symbolic of just how boring this film truly is. Get to the point. Did these two ever hear of email, the Internet or Google?"}, {"rating": "3", "text": "If you were one of the millions and millions of moviegoers who fell in love with both Keanu Reeves and Sandra Bullock in 1994's slam-bang Speed (the movie that made Sandy a star in the first place), and you weren't adequately chastized for doing so by suffereing through the inept, Keanu-free Speed 2: Cruise Control 3 years later, this impossibly drippy, artificial, molasses-slow romantic reteaming will pretty much finish the job. Bullock and Reeves play star- and time-crossed potential lovers who share both the title dream home and a chess-playing dog (who, even in a film whose supporting cast boasts Christopher Plummer and Shohreh Agdashloo, is its liveliset performer by far). [***SPOILERS***] The catch is that, since he lived there in 2004 and she in the present, they can only communicate with one another by letters left in the house's magical mailbox, a gimmick that might have resulted in something remotely believable and affecting were the movie made in 1945, but it's ridiculously naive and unbelievable today, even by fantasy standards: he's an architect/ builder and she's a doctor, for the love of Pete! Have they never heard of cell phones, text messaging or e-mail?!? (Heck, I would've settled for a guest appearance by another Warner Bros. movie star...Harry Potter's postal owl Hedwig!) The fact that I was so quickly able to figure out early on WHY 2004 Guy and 2006 Gal were perpetually unable to get together and consummate their epistles in person (the tip-off for me was something that director Alejandro Agresti DIDN'T do in a key early scene) is no crime; the fact that these two don't write or speak English like any human being I've ever known is a major felony. (Even allowing that films that mostly consist of characters writing to one another are for obvious reasons difficult to pull off, and understandably aren't attempted very often doesn't make the task impossible; ever see the poignant 1987 Anne Bancroft/ Anthony Hopkins drama 84 Charing Cross Road?) Reeves is at his wooden worst; Bullock is acceptable but stuck with an impossibly glum role that totally and irresponsibly wastes her sparkling personality and luminous smile; I would have happily dashed off a $100. check to a charity of anyone's choice if once, just once, Bullock had broken into one of her trademarked Miss Congeniality giggle-snorts. (And anyway, why is it that an actress this attractive, who can grab almost any man she wants, keeps getting cast in lonely-wallflower roles such as While You Were Sleeping, The Net, Murder by Numbers and this?) I have a greater tolerance level in general for romantic dramas than most people of my gender; 2004's surprise summer smash The Notebook (which this obviously and desperately wants to be the 2006 equivalent of) wasn't one of my favorites, but compared to this, it's Casablanca. A genuinely lovely Paul McCartney soundtrack song to the contrary, The Lake House is exactly the kind of movie that if Everybody Loves Raymond's Debra Barone dragged hubby Ray off to, Ray would insist on three of HIS movie choices plus ten golf games and two bedroom adventures that he's a lot more interested in pursuing than she is as a tradeoff...and who can blame him?"}, {"rating": "1", "text": "I love the two stars. As for the movie, there is no chemistry and is it ever so slow. Has more holes than swiss cheese and is forgotten as soon as you leave the theater. Terrible movie that even a hopeless romantic cannot appreciate."}, {"rating": "0", "text": "I was just dragged screaming to see this turkey. My date wanted to leave after a half hour. I pretended I was really into this stupidity and made her stick around for the entire snoozefest. Hey guys those of us who remained laughed last. What a bomb."}, {"rating": "0", "text": "Nodoze anyone? Is this how bad movies are these days? You have to be kidding to believe this junk."}, {"rating": "0", "text": "The worst of the worst now playing. If you want something that makes no sense and can put you to sleep to cure your insomnia then you came to the right movie."}, {"rating": "10", "text": "I love this movie, and the chemistry between the two stars is wonderful. All love should be as good as this."}, {"rating": "10", "text": "I fell in love with this movie at the theatre. Sandra Bullock and Keanu Reeves created a great love story."}, {"rating": "10", "text": "My girlfriend asked me to watch this movie and i did not. Then she got pissed so i watched it. This movie is great.! Everyone should watch this movie. Everyone! Time travel!"}, {"rating": "9", "text": "Great movie. Non-traditional love story and compelling idea. There were clichés but what movie formula now does not have those? Loved it."}, {"rating": "10", "text": "I totally loved the movie, it was confusing in the beginning but Sandra and Keanu brought it to life, amazing chemistry. Love those two, hope to see them in another movie soon. Its actors like them that keep people going to the movies."}, {"rating": "4", "text": "My head hurts from trying to figure out what the hell the is going on. I would have been easier trying to understand nuclear science."}, {"rating": "10", "text": "Wow! I rented and watched this movie tonight and then I watched it again. I was totally emersed in the love that grows between these two. And the fact that this all takes place between two parallel periods in time is what makes it that much more captivating. It is no surprise that I love this movie since my all-time favorite movie has been,"}, {"rating": "10", "text": "i laughed, i cried, but mostly i recognized the attitude of the restaurant hostess. does she work at any other restaurants in town?"}, {"rating": "8", "text": "This is the first movie this year that I will definitely see again. This is a beautiful romaance with great scenery and good dialog. I was pleasantly surprised that I loved it so much. Keanu and Sandra were good. I too, laughed and cried, but what surprised me the most was that the audience clapped at the end which is rare these days. Forget the cynical critics and see this movie."}, {"rating": "9", "text": "If you never get chane to see the Orignal Korean Film , this is a very good chance to know this beautiful story. The story is wonderful even it is a little bit different than the orignal one. Perfect for your first date."}, {"rating": "8", "text": "The couple has delightful chemistry, and if you can suspend a bit of your disbelief (and apparently cynicism...) it's a lovely little comedy where you do root for them to get together, and are given an old-fashioned happy ending. Not a bad way to spend a summer afternoon."}, {"rating": "9", "text": "My wife and I loved it! Sure there are some areas of the movie we couldn't figure out, but it's a time travel type movie! It's all in the imagination anyway! Just go and enjoy and don't try to figure out the holes in the plot."}, {"rating": "1", "text": "I loved the stars, loved the premise and then settled into my seat in a packed theater. I was waiting for the fireworks to arrive. Midway through I foolishly held out hope for this boring tedious drawn out disaster of a movie. When it finally ended an hour and a half later I could not believe how truly awful it was. Even the most hopeless romantic if they elect to tell you the truth, will have to say it was excruciating boring. Avoid at all costs. Sorry."}, {"rating": "9", "text": "I think it's a little gem of a movie - I found it quite delightful. Surprisingly refreshing. There are so few of these films around."}], "recommendations": ["the_vow", "the_notebook", "a_walk_to_remember", "if_i_stay", "the_lucky_one", "stardust", "paper_towns", "midnight_sun", "seeking_a_friend_for_the_end_of_the_world", "last_christmas", "how_to_be_single", "fantastic_beasts_the_secrets_of_dumbledore", "the_adjustment_bureau", "we_bought_a_zoo", "about_time", "the_best_of_me", "the_holiday", "seven_pounds", "friends_with_benefits", "me_before_you", "palm_springs", "titanic", "the_bucket_list", "passengers", "sleeping_with_other_people"]}