{
  "id": 4305,
  "title": "The Last of the Mohicans",
  "starring": [
    "Daniel Day-Lewis",
    "Madeleine Stowe"
  ],
  "runtime": 112,
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "History",
    "Romance",
    "War"
  ],
  "description": "In war-torn colonial America, in the midst of a bloody battle between British, the French and Native American allies, the aristocratic daughter of a British Colonel and her party are captured by a group of Huron warriors. Fortunately, a group of three Mohican trappers comes to their rescue.",
  "releaseYear": "1992",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fYVQRcgnOv998bKEplzrD3faGgt.jpg",
  "categories": {
    "plot": 7.133333333333334,
    "acting": 7.25,
    "ending": 5.0,
    "soundtrack": 7.666666666666667,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I'm not an expert on US history, but I think I can say that this film, as far as historical accuracy is concerned, is one of the best I've seen. The uniforms, combat tactics, clothes, scenery, everything fits perfectly in the time and historical context that the film seeks to portray, and this is extraordinarily pleasing to people like me, who like to see a historically realistic film.The screenplay is based on an extremely famous novel by James Fenimore Cooper, although it did not faithfully follow the book. This may be good for dramatic effects, but it inevitably leads to choices and decisions that each viewer can judge good or bad. I, in particular, saw nothing that shocked me. Actors' work is very good, particularly Daniel Day Lewis, in the role of Hawkeye, a European who was adopted by a Mohican elder and grew up in Native American culture. We can consider this to be one of the most remarkable works of his career, opening the doors to a series of other projects where the actor would come to shine (\"Gangs of New York\", \"There Will Be Blood\" etc.) Madeleine Stowe was equally well in the role of Cora. Finally, a note of praise for the soundtrack of the film, of excellent quality."
    },
    {
      "rating": "7",
      "text": "[7.5/10] -- Michael Mann's rousing, triumphant, and majestic departure from the gritty immorality of the urban hell -- \"The Last Of The Mohicans\" -- may not be his best work, but it is certainly still something to behold. With incredible action sequences, brilliant special effects, and an inarguably brilliant sense of period, the film not only does Cooper's eponymous novel justice, it does right by the viewer as well."
    },
    {
      "rating": "5",
      "text": "Dull, unpleasant and tedious.\r The Last of the Mohicans is an interesting movie with an incredible story and great actors. At the same time it felt a bit overrated, like the movie is trying to be something that it's not. The action-sequences are great but not more, and it's a very realistic movie with entertaining events. But when it comes to the basic of the film like the characters and the script, it doesn't impress me. The conversations between the characters are slow and boring, and the film overall felt very slow and it didn't get my intrest. The last aspect of the film that totally irritated me is the soundtrack, it's superb but it just to excessive.\r The Last of the Mohicans is not a highly unique film, but it got some good aspects.\r The Last of the Mohicans get a 5.5/10"
    },
    {
      "rating": "7",
      "text": "This film is blessed with great acting, directing, and a great soundtrack. But, it is squandered by the forced and unnecessary elements of romance, which play a key role. The film would be better without it."
    },
    {
      "rating": "10",
      "text": "I first watched this movie when I was six years old. I loved every milisecond of it. The story is amazing and so goddamn emotional. I don't think I've ever seen a movie that makes you feel so many emotions at once like this. The way they travel around the country, form amazing relationships, and battle the nefarious Magua is awesome10/10."
    },
    {
      "rating": "7",
      "text": "Pretty awesome epic film with good acting, directing, visuals and excellent music."
    },
    {
      "rating": "10",
      "text": "It's one of my favorite movies all time.  The score is great, the story is classic, it's just a great north american movie.  I am biased because of my love of this film, but it is worth a watch for sure."
    },
    {
      "rating": "1",
      "text": "Récit filmographique d'aventures historique sur la guerre en Amérique entre les Français et les Anglais, 'Le dernier des Mohicans' raconte aussi celui des différentes tribus indiennes dont les allégeances vont aux tuniques bleues ou aux tuniques rouges selon le temps qu'il fait, mais évidemment selon le point de vue américain de cette histoire, le Mohican pactise avec nos ennemis Rosbeefs (ça, c'est mon point de vue franchouillard) en dépit de son ignorance, et tout cela en ce qui concerne cette andouille, juste pour une donzelle britannique qu'il trouve fort à son goût......la donzelle \"jouée\" par la quiche Madeleine Stowe, ce simulacre d'actrice évidemment ! (hélas). Voilà donc (déjà) qui ne laisse pas de déplaire considérablement. Quant au Mohican incarné ici par le sans peur et sans reproche Daniel Day-Lewis, pas un mauvais acteur au demeurant, son personnage fait davantage penser à un chevalier du Moyen Age, on ne peut plus ringard déjà à cette époque, de par sa colossale fatuité et naïveté. Bref, c'est un Amérindien de pacotille qui ne leur fait certainement pas honneur.Bien que l'action ne soit pas totalement absente, le film manque singulièrement de rythme et se perd en bavardages sirupeux inutiles et ennuyeux. Quant à l'action elle-même, sa mise en scène est plutôt brouillonne... même si on a vu pire (au royaume des aveugles etc). Un mot en passant sur la musique pédante et patriotique : une jolie musique pédante et patriotique.Devant tout ce fatras bien chiatique, je dois avouer que je n'ai pas tenu jusqu'au bout bien qu'à dire vrai je m'y attendisse (mon vieil instinct détecteur de daubes en puissance sans doute). Le Dernier etc... n'est pas totalement mauvais si l'on reste très bon public peu exigeant mais n'en reste pas moins... très mauvais en définitive."
    },
    {
      "rating": "9",
      "text": "Just a “simple” awesome and emotional movie, whit good story, and good actors/actress."
    },
    {
      "rating": "10",
      "text": "This movie is brilliant in terms of the plot, acting, cinematography, music score. I rate it as one of my all time favourite movies. It is a masterpiece!"
    },
    {
      "rating": "6",
      "text": "The setting of the movie and the world they created are great. Also the music is unforgettable....because they are playing it almost all the time.But the story and the dialogues are slow somehow and and also simple, so the movie gets boring."
    },
    {
      "rating": "9",
      "text": "Great period piece, the acting was solid, and the story was well developed. Daniel day-Lewis is at his finest, with Madeline Stowe also giving a good performance. There were a couple dead spots, but they were more then made up for."
    },
    {
      "rating": "9",
      "text": "I genuinely mean that when I say that Last of the Mohicans is spellbinding and that there is a lot to admire from it.Firstly, Michael Mann's direction is brilliant. Mann is a more than competent director seen with the likes of Manhunter and Heat, and while everything you expect in a Michael Mann film is here(not a bad thing, quite the contrary) it is all done in a professional way.The story is a sprawling one, but again that is not a bad thing in itself. Because while it is sprawling in nature, it is also a compelling story lifted by its sweeping action sequences(notably the climax), the love story that is kept in the background but remains prominent and emphatic characters.The pace helps too, as while the film clocks in at just under two hours, Last of the Mohicans flies by with no scene feeling too rushed. I also appreciated that the quieter and more subtler moments, as seen with Russell Means' character, didn't drag.That's not all. The cinematography is splendid and the settings are stunning that gives the film its epic, sweeping feel. Trevor Jones' score is outstanding, and probably his best since The Dark Crystal.Last of the Mohicans has fine acting. Daniel Day-Lewis is a commanding lead, and Madeline Stowe is both alluring and convincing, likewise with Jodhi May. Russell Means is suitably composed, wise and well-meaning, but for me Wes Studi's marvellous and quite malevolent performance is the standout.All in all, a spellbinding film. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "What a great movie about the American frontier before it was America.  Life was hard, times were tough, I never imagined this when I was studying American history in school.  You were on your own; how many of us could survive under these circumstances?  On top of that, war is on between the British, who the colonists live under, and the French, who have enlisted the Indians.  The settlers are at the mercy of both.  This movie gives a graphic portrayal of life during these times.  Great cinematography, great actors, great movie.  I don't have many DVDs but this one is in my collection."
    },
    {
      "rating": "5",
      "text": "Cover. Ambush.The Last Of The MohicansMann's ruffian ideology is undoubtedly tough and on the other hand is incredibly brittle. This political thriller that was aspired to be thought provoking feels like you tuned in a prime time news show that grows into a preaching to the choir tone within its first act. It is a long tiring process that Michael Mann, the co-writers and director, wants you to be a part of, why? Also, I couldn't imagine a film confined in its doomed script to ever come off winning, this wannabe Lawrence Of Arabia lacks the romance between the audience and the character that David Lean made sure his film was fueled of.On the positive side, the hard work is transparent as water and pays off more than enough when it comes to create these behemoth action set pieces on such a large scale. Michael's passion and Daniel Day-Lewis's skin in the game makes all the effort worth. No matter how many times you find yourself watching the clock, you'd also want to see Daniel pouring his soul in on the magnanimous and generously fierce character. Madeleine Stowe and Russell Means is supporting Daniel and the film thoroughly to reach to a better end.The script mainly works on the duality of the war and not the characters, and after its first act, the film gets pretty simple and unbearingly hard to watch. There is a lot of political correctness in the film, which unfortunately is turned up a notch that often undermines the emotions these characters go through and its major asset, the one dramatic scene that it all hinges upon is the major victim of this disease. The Last Of The Mohicans feels more like an Oscar bait than a deep dive on a rich Americana culture."
    },
    {
      "rating": "10",
      "text": "Best movie in history, you don't see true love nor true warriors like this anymore. If this movie doesn't show you the meaning of life, than nothing will."
    },
    {
      "rating": "8",
      "text": "This is probabily the most refined and disciplinated movie by director Michael Mann who manages here to direct a great action period drama involving native Americans and 7 years War in 1757.The main interest falls on the clash between cultures in which only the habitat is distinguished by purity. The colonizers are greedy and there is no more naivety in the host people because their presence is already part of the New World. Yet the division is still clear, with the invaders told to respect their duties and the indigenous people committed to safeguarding their rights. Daniel Day Lewis is as fantastic as usual here and score is astonishing. Fights are maybe too spectacularzed and a bit too distant from reality but this movie works well and deserves to be a classic."
    }
  ],
  "recommendations": [
    "the_assassination_of_jesse_james_by_the_coward_robert_ford",
    "kingdom_of_heaven",
    "gladiator",
    "once_upon_a_time_in_america",
    "amadeus",
    "casino",
    "the_great_gatsby",
    "lincoln",
    "rush",
    "whiplash",
    "the_aviator",
    "chinatown",
    "troy",
    "braveheart",
    "the_grand_budapest_hotel",
    "youth",
    "catch_me_if_you_can",
    "the_patriot",
    "news_of_the_world",
    "the_hurricane",
    "the_last_samurai",
    "the_godfather_part_ii",
    "the_untouchables",
    "casablanca",
    "hell_or_high_water"
  ]
}