{
  "id": 579,
  "title": "The Incredibles",
  "starring": [
    "Craig T. Nelson",
    "Holly Hunter"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Adventure",
    "Animation",
    "Family"
  ],
  "description": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
  "releaseYear": "2004",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2LqaLgk4Z226KkgPJuiOQ58wvrm.jpg",
  "categories": {
    "plot": 9.11111111111111,
    "acting": 9.375,
    "ending": 9.5,
    "soundtrack": 10.0,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 9.411764705882353,
    "action": 8.88888888888889
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Being a big fan of both action movies and Pixar movies, I knew this movie was right for me. And sure enough, I ended up really enjoying the movie. Felt just like watching some of the great superhero movies out there."
    },
    {
      "rating": "10",
      "text": "Brillance cannot begin to describe this movie. Pixar has made its best movie since Toy Story. A wonderful story, with compelling charcters mixed with action scenes that are better than action films. Pixar has put out a true masterpiece with The Incredibles."
    },
    {
      "rating": "10",
      "text": "Let me say this is my favorite movie of all time. The storyline is one of the best i've ever seen, i mean come on, a family of superheros, who ever thought of that. It is so original and well written that it deserves a 10 across the board. Each character is built magnificently and fully, i never feel like one of the characters is just a sideshow, each on has a specific role and they fill it perfectly. What makes this movie so great is how you can relate to it, even though its about superheros. Their family and characters can easily relate to yours or people you know. overall this is one of the best animated films of all time. And i read the negative reviews and i mean come on, you just wrote those reviews to hurt its overall rating, there was no other point"
    },
    {
      "rating": "10",
      "text": "Didn't like this when it first came out and ignored it when it aired on cable TV. I gave this movie another try and I realized what I was missing. This is a great family film. It's action-packed and most importantly its got a wonderful message that Pixar never fails to deliver."
    },
    {
      "rating": "10",
      "text": "Bird has created the unprecedented film that is not just a grand feature-length cartoon but a grand feature, period, a piece of animation that's involving across a spectrum of comedy, action, even drama."
    },
    {
      "rating": "9",
      "text": "I thought it was great. Some parts in the film are a little slow but overall its a great film. I enjoyed it from start to finish. The one flaw is that it could have been a bit shorter but besides that its still good."
    },
    {
      "rating": "10",
      "text": "in my childhood, it was my favorite animated movie\rafter years, it still continuing very amazing\rthe pixar disney don't let down in their epic 3D animations"
    },
    {
      "rating": "10",
      "text": "Pixar's greatest film, this is a great superhero movie which not only portrays superheroes as people, but makes their conflicts interesting and exciting. It plays with numerous superhero tropes while doing its own thing with very human characters. Syndrome is an excellent villain, and the whole movie, from start to finish, is full of great moments. There's comedy, there's compassion, there's sorrow, there's feelings of danger, there's deconstruction and reconstruction of tropes...\r Pixar hit it out of the park with this one. One of the best movies of all time, animated or not."
    },
    {
      "rating": "10",
      "text": "I don't know how they do it, but Pixar just does it. \"The Incredibles,\" being Pixar's first PG-rated film and their first film centered around humans, still stands as one of their best. With superb animation, a great story, plenty of action, great humor, and some fantastic characters (including one of the greatest villains in film history in the form of Syndrome), \"The Incredibles\" more than lives up to its title. It's a wonderfully-made film that continues to age beautifully."
    },
    {
      "rating": "8",
      "text": "This is a great movie to watch on the weekends for sure, it's got action, comedy, and the hint of love throughout the entire movie. It had its boring points of pointless scenes that were added as fillers, but still, a solid film! I do hope they release \"The Incredibles 2\" after they introduced the new villain at the end (The Underminer)."
    },
    {
      "rating": "9",
      "text": "The Incredibles is easily some of Pixar's best work. It's story is so serious and risk taking that, that alone makes it a very good movie. You can just feel the tension in Bob's and Helen's marriage and you can feel the depression of Bob not being able to be a Super. Edna Mode steals the show though. She is funny, fassionale, and blunt. Syndrome is my only gripe. He is much too cheesy to be an amazing villain in my mind. Overall The Incredibles is one of Pixar's most serious and at the same time funniest flicks out there."
    },
    {
      "rating": "9",
      "text": "Here it is. The single greatest superhero movie of all time. And it's not made by Marvel, nor is it made by DC. It's made by Pixar. Like many Pixar movies it takes an old concept-a family of superheroes-and makes something completely new and astonishing from it. The animation is breathtaking, the voice acting is great and it features talented direction of Brad Bird-our generation's Walt Disney-to make it even better. The jokes are witty and brilliant and the characters are interesting. WHY MUST WE WAIT A YEAR FOR THE SEQUEL?! UPDATE: we must now wait four years. No. No. Nooooooooooooooooo!"
    },
    {
      "rating": "10",
      "text": "This was my favorite movie of all time when I was a kid. While not my favorite movie anymore, it still is one of my favorites as a teenager. Even then, through a critic's point of view, it's still a fantastic movie, and is arguably the best Pixar movie of all time.\r Fantastic voice acting, lovable characters, unique idea with breathtaking execution. This movie is also really hilarious in a way that can have you connect with the characters. The movie is also quite unpredictable for a movie intended for kids; however, this isn't really a \"kids\" movie. I see many elements in the movie adults would love. The movie also makes a successful attempt at being an uncliche ending for a cliffhanger. This is really bold for a kid's movie, and even for Pixar. However, this movie will leave satisfied and filled with glee with the best \"superhero\" movie of all time (until The Dark Knight came around)."
    },
    {
      "rating": "10",
      "text": "Perhaps second only to 'Finding Nemo' on Pixar's finest achievements list, 'The Incredibes' is one of the most exciting and action packed animated films ever made. The story is simple but perfect for a bucket load of special effects, the characters, especially Edna Mode, are memorable, the music is terrific and the animation is typically stunning for Pixar. A wondeful achievement."
    },
    {
      "rating": "9",
      "text": "I have no idea just how often I have seen this movie, and yet, I still enjoy it every time. It isn't my favorite Pixar movie but it's definitely somewhere at the top of that list. I love the animation. I love the voice acting. I love the characters. Such a wonderful parody, like watching the Fantastic 4 in a more \"realistic\" setting (I use that word very loosely for obvious reasons.) But, if I had to critique, I would say that the movie does focus a bit too much on Mr Incredible, particularly the first half of the movie. It does, however fix this in the second half, but I felt the rest of the family could have been a bit more included in the beginning and given a bit more time each to see how they were coping being \"normal.\" Overall: A highly entertaining movie that will always be a centerpiece of my collection."
    },
    {
      "rating": "9",
      "text": "The Incredibles is one of Pixar's finest features with wonderful special effects and a tremendous heart not often found in many films, animated or live action. Children and adults alike will be blown away by The Incredibles."
    },
    {
      "rating": "10",
      "text": "i love brad birds animated films but even better the incredible's . sometimes i look at animated films in a different way but hey it i see a story about a super hero family which i actually enjoy at least it was better  then watching tyler perry's meet the browns ."
    },
    {
      "rating": "10",
      "text": "The Incredibles es una película de animación con mucha acción que no solo logra obtener un buen resultado entre la fusión de vida personal y vida de super-héroe, si no que también es un buen film del género familiar."
    },
    {
      "rating": "7",
      "text": "Fun classic super-hero movie, with some touching character moments and visually stunning action sequences. Seeing it now feels a little bit dated, but that's nothing that overshadows my entertainment from it.\r Final Score: 7/10"
    },
    {
      "rating": "10",
      "text": "Another great achievement from Pixar, but with human characters. The film definitely reminds me of The Simpsons because of the great connection between the family. The character of Bob Parr has a passion of being a superhero which really shows through his character. It's got action, suspense, and is probably one of Pixar's most grown up films"
    },
    {
      "rating": "10",
      "text": "From the creators of \"Toy Story,\" \"Monsters, Inc.\" and \"Finding Nemo,\" comes this hilarious action-packed animated adventure about superheroes and their lifes."
    },
    {
      "rating": "8",
      "text": "When a Pixar movie comes out, you know it will be great every time. And this is no exception. It has great humor and an awesome plot line. Not to mention the consistent animation, which is the best out of all the animation companies."
    },
    {
      "rating": "8",
      "text": "The Incredibles may become the first Disney/Pixar film not to dominate at the box office. That statement has nothing to do with the film's quality - in fact, The Incredibles is among the best of Pixar's digitally animated movies. However, it's going up against The Polar Express, which has a number of advantages, not the least of which are its built-in audience and seasonal appeal. More than anything else, The Incredibles is likely to be a victim of bad timing. Don't shed any tears for its makers, however. The film will still keep the cash registers ringing until it attains \"blockbuster\" status, although it won't be the runaway hit that Pixar's last production, Finding Nemo, was.\r As the crop of digitally animated films becomes more abundant, audiences are likely to demand increasingly more from such movies. The early efforts mostly had everything: beautiful visuals, great voice acting, and superior writing. But, as more of these pictures reach screens and they become \"routine,\" it's natural to speculate whether there will be a slip in quality. Fortunately, such a trend (if it ever develops) is not in evidence in The Incredibles. As with Toy Story and Finding Nemo, Pixar has again struck gold. The Incredibles isn't just fine family entertainment, it's superior family entertainment.\r One thing immediately noticeable about this picture is that it is markedly more mature in tone and approach than any previous digitally animated movie (excepting Final Fantasy, which was intended for - and did not reach - an entirely different audience). That's not to say that kids, even young ones, won't enjoy The Incredibles, but it appears that writer/director Brad Bird composed his film with older children and their parents in mind. Also, because of the long running time (nearly two hours), boys and girls prone to restlessness may have trouble sitting through everything.\r With its amazing variety of locations (the streets of a city, under the sea, a tropical island, etc.), The Incredibles may be the most visually daunting animated film to reach the screen to-date. And it's close to flawless. Only the people are rendered more like cartoons than reality, and that's a conscious decision. (If you want to see almost-real humans, The Polar Express is the closest you're likely to get at this time.) Digital animation has become so commonplace that we take its detail for granted, but a little consideration of the needed effort will result in a reaction not far removed from awe.\r Although The Incredibles has plenty of action (including chases and battle scenes), its strength is that it makes the characters and their relationships more important than the fights and pyrotechnics. This is a close family - they just happen to possess some rather unusual abilities. Think Spy Kids, only animated. Mr. Incredible and Elastigirl are still in love, even after 15 years of marriage (although she has adjusted better than him to domestic life). The children have believable love/hate relationships with their parents. Dash is willful and disobedient because he's bored - he wants to use his super-speed to excel in sports. And Violet has entered that gawky stage of life when her body becomes uncomfortable to inhabit. She uses her invisibility to spy on a boy she likes without being seen.\r The film's director is Brad Bird, who fashioned the uncommon The Iron Giant, a traditionally animated effort that has developed a large following amongst adults. For his latest outing, Bird keeps the same audience in mind. Where some animated movies attract adults using pop references and sly one-liners, Bird keeps older viewers interested by not dumbing down his screenplay. It's inevitable that some of The Incredibles' themes (such as that of a middle-age crisis) will go over the heads of kids, but it won't hurt the experience for them. They'll still thrill to the action scenes and laugh at the jokes. And they'll get the overall message about parents being the most important superheroes. But Bird's approach makes this a richer and more worthwhile experience for the over-18 crowd. No need to don a trenchcoat and sneak into this movie.\r Ever wonder whether retired superheroes are subject to widening midsections and bad backs? Do they have problems with male pattern baldness? Wonder no longer. Those are just a few of the lighter questions that The Incredibles answers. Bird's feature is appropriately titled - it describes how most viewers will react to this exemplary mixture of top-notch storytelling, visual razzle-dazzle, accessible humor, and involving action. The Incredibles is without question one of 2004's most accomplished and enjoyable family-oriented films."
    },
    {
      "rating": "8",
      "text": "Built on the hackneyed premise that people in adversity are the true superheroes, “The Incredibles” is itself anything but hackneyed. Debuting helmer David Valero invites himself and his camera into the lives of three very different protags, and the result is a compellingly intimate, wonderfully human docu that swings smoothly from hopeless tragedy to utter hilarity by analyzing lives under stress. The docu’s combination of humor and heartbreak reps a good opportunity for daring fest programmers.\r Recently, Spanish helmers have done good work with the fly-on-the-wall format, perhaps most notably Sandra Sanchez with “Behind the Lights.” Adan Aliaga’s multiple prize-winning 2006 docu “My Grandmother’s House” is clearly one of the inspirations here (Aliaga himself takes an associate producer credit).\r “The Incredibles” shuttles with agility between its stories. Its subjects are Maria Moreno, a spirited 94-year-old who supplies most of the laughs; Joana Martin, a thirtysomething mother of two who has recently been diagnosed with terminal cancer; and Juan Eulalio Lopez, who lost his arm, and subsequently his marriage, in a traffic accident.\r Moreno goes about her daily business, which involves polishing her extensive collection of religious statuettes, bickering with her daughter and delivering some wonderfully surreal dialogue. Lopez records himself on video, as suggested by his psychotherapist, reflecting on how the women he meets tend to reject him because of his missing arm. His story reps a midpoint between the comic/tragic extremes of the others. (Among lots of little human details, the pic unveils the mystery of how a one-armed man cuts his fingernails.)\r Martin is seen having fun with her family, including her long-suffering husband. But the docu spills over into morally awkward voyeurism when she tells her hairstylist that she’d prefer not to watch her hair being shaved off, a process the aud can see. But several later scenes are almost unbearably moving, mostly because Valero respects Martin too much to be sentimental about her.\r The film’s direction developed as shooting progressed, and inevitably, many scenes have the immediacy of homevideo. The pic’s winningly direct air is the result of crafty work by Valero, who has chosen his subjects well and is happy just to let them be themselves, and editor Aurora Sulli, while ensuring that not a single scene overstays its welcome, neatly teases out the counterpoints and echoes among the three stories. When Martin’s doctor tells her it’s important to stay optimistic, Moreno’s irrepressible optimism immediately springs to mind.\r On the downside, the project’s rebranding of its protags as “The Iron Lady,” “Broken Wing,” and “Radioactive Woman,” respectively, feels like a contrived and unnecessary attempt to yoke the stories together after the fact."
    },
    {
      "rating": "9",
      "text": "Great pixar movie with a ton if action. It's like a animated superhero movie, which is a genre I love! Predictable at times, but still highly entertaining for kids and adults. I feel like the studio Pixar is focusing on adults more than kids at times, but still VERY fun movie for the whole family. Can't wait for the sequel!"
    },
    {
      "rating": "9",
      "text": "PIXAR shows a history of superheroes but these are not of Marvel or DC Comics. But this film debut was spectacular, but when superheroes are family members."
    },
    {
      "rating": "9",
      "text": "It comes as a surprise that Pixar's \"The Incredibles\" is the greatest and most entertaining out of all the superhero movies made to date, as unlike Marvel and DC, Pixar have had no experience in the genre before 2004. It has an intriguing and well told story, as well as likeable main characters and a well-crafted villain."
    },
    {
      "rating": "9",
      "text": "Mi favorita de Pixar, buena animación, gran historia y entrañables personajes."
    },
    {
      "rating": "10",
      "text": "I watched this movie the first time when I was six years old. Today I am 17 years old and i still love it. One of my favorite movies! 10/10"
    },
    {
      "rating": "10",
      "text": "My opinion the best pixar movie of all time. Brad Bird does a great job in putting this thing together and keeping story interesting and stylish from the first second to the last. Its still mindboggling that they havent released a sequel for this. Luckily we will finally get one in a couple of years."
    },
    {
      "rating": "10",
      "text": "this is the best pixar movie ever The Incredibles is a 10/10 one of my favorite movies of all time AMAZINGGGGGGGGGG and i love helen she is AMAZINGGGG"
    },
    {
      "rating": "10",
      "text": "The Incredibles is very inappropriate for kids but is an amazing film for teens and adults. It is very funny and has amazing characters. I can't wait to see the sequel."
    },
    {
      "rating": "9",
      "text": "One of the best Pixar movies that is very enjoyable, funny, but not as good as \"A Bug's life, Toy Story, Toy Story 2, or Monsters inc.\""
    },
    {
      "rating": "10",
      "text": "My Favorite Animation Movie Ever! From Start To Finish, It Was Completely INCREDIBLE!"
    },
    {
      "rating": "10",
      "text": "Finally, a good movie! This is one of Pixar's best, knocking off the first Toy Story. It slyly skewers the classic comic book movie and action movies in general, all while being hilarious and fun!"
    },
    {
      "rating": "8",
      "text": "Overall I enjoy The Incredibles. While I feel that he movie may have a little too much going on at times, which causes it to feel a little length and slow at times, the film makes up for it with likeable characters, some great action scenes, and an interesting plot. It does not hurt that the presentation in this movie Is fantastic.  If you like family films, action films, and/or superhorse films, I’d say give it a watch. While the movie has its flaws and in my opinion is not as enjoyable as the last Pixar film Finding Nemo, The Incrediblesis an entertaining film that I have seen many times and will continue to watch until Pixar makes an Incredbiles 2, which I pray will happen."
    },
    {
      "rating": "10",
      "text": "Brad Bird does it again!!! If you like action movies, Pixar movies, and Brad Bird, this is totally the film for you. The Incredibles takes what made The Iron Giant great and makes it 3D.  Brad Bird made The Iron Giant a masterpiece, and now he has made The Incredibles a masterpiece. The Incredibles is definitely worth watching."
    },
    {
      "rating": "10",
      "text": "One of my favorite Pixar movies of all time. Pixar outdid itself by tying a genre that is unusual for a child's viewing - action. It is weaved perfectly, still giving themes of perseverance, family and courage. Notable scores were composed to perfectly suit several situations in the plot. Simply beautiful and stunning."
    },
    {
      "rating": "8",
      "text": "More brilliance from Pixar, Incredibles is wickedly entertaining and funny."
    },
    {
      "rating": "10",
      "text": "Pixar are no strangers to pushing out strong, emotionally driven and groundbreaking, but when The Incredibles came along it really created a whole new landscape for its films.\rIn a world where superheroes are just about everywhere, there is a complete reliance on them from the general public, but they of course keep their identity..their most valuable asset, secret.\rMr. Incredible is the cream of the crop, superhuman strength and loved by the public. He is also getting married to ElastiGirl. But when  he makes a judgement call by saving a suicidal man, who in turn decides to sue the hero, which sets off a chain of claims and court cases for \"supers\" all over the world, eventually driving them into exile.\rThe film then plays out in an almost sitcom like manner, with many quips of daily life and menial jobs, with Mr Incredible now under his real name of Bob Parr, working for an insurance company, bored with his routine life away from saving the world.But when he is set up to be the face of an unknown corporation which needs heroes, he soon suspects that something larger is afoot, but he must also tread carefully as he has yet to tell his wife of his activities.\rThe Incredibles combines the perfect blend of storytelling with plenty of animated action, but also throwing in a large message in the importance of family values and never to forget the past, as you will indeed be condemned to repeat, embrace and cherish those moments in your life which perhaps won't happen again.\rNot only is this one of the best Pixar films to date, but could very well be one of the best superhero films to come around, live-action or animated, it simply doesn't matter, director Brad Bird has managed to find balance to how the modernisation of our current world can impact such events and phenomenons such as those with superpowers.\rThere is a perfect voice cast to push along this excellent film including Craig T. Nelson, Jason Lee, Holly Hunter and even Samuel L. Jackson, all separate characters with very different agendas, Mr Incredible would truly do anything for a trip back to the good old days, while his wife ElastiGirl may be content with normal life, but is more concerned about the well-being of her children.\rThere is also excellent comedy to be had, with hilarious characters in the form of Edna Mode, the heroes costume designer, and a little kid who sits outside waiting for something amazing to happen.\rIt truly adds up to a unique and brilliant take on being accepted in an unfamiliar society, which equals to a riveting and glorious film."
    },
    {
      "rating": "10",
      "text": "Sometimes i really wonder why oscar snubs animated movies, i mean in terms of storytelling, humour and the entire chemistry among the animated characters is so real and satisfying that at one point u think that they're real people with a true emotions facing the daily crisis and learning to deal with it. The protagonist anguish and self denial is correctly drawn and younger character's reluctance to mix with daily life depiction is though humorous but there ia a sense of loss. It could have won the best picture had it not fallen into the trap of utter prejudice and lobbying. Also academy's attitude of shunting somebody's work for long time and then present them when they did not deserve."
    },
    {
      "rating": "8",
      "text": "The Incredibles lives up to its name as being incredible. Pixar have brought to life the average comic book world full of heroes and villains that exist in everyday suburban life perfectly.\rBob Parr (Mr Incredible) is super strong and one of the most well known and celebrated superheroes, however on the night when he causes a tram to crash injuring several civilians superheroes are outcast and must go into hiding. Now several years later, married to Helen Parr (Mrs Incredible/Elastagirl) and father of three children (Dash, Violet and Jack Jack). Working in an office and becoming tired of his 'normal life' Bob is contacted into doing an investigation into a mysterious project going on in a remote part of the world. It is not until he gets there that he realises that it is a sinister plot to kill all the superheroes that are still alive. It will take all of the 'Incredibles' and a few old friends to stop this evil plot and keep the world safe another day.\rThe Incredibles is exactly what we have come to expect from Pixar, a well written, emotional storyline with some excellent voice talent and masterful animation skills. The Incredibles gives Pixar a notable place as good action film makers too though  due to the nature of the film, does this mean that Pixar have other plans than just being the family friendly animation studio we have come to know and love over the years? Only time will tell"
    },
    {
      "rating": "10",
      "text": "Bursting with eye-popping visuals, fast=paced action, a viscerally clever plot, a satirical twist flavoured with old-school comics and witty humour, The Incredibles is the shining example of Pixar's storytelling mastery."
    },
    {
      "rating": "10",
      "text": "One of the best superhero movies ever made. The Incredibles is kind of a step in a different direction for Pixar, who are used to making brilliant G-rated kid movies, and this one was aimed for grown ups as much as it was for kids."
    },
    {
      "rating": "7",
      "text": "A good movie, but couldn't get into the concept of family superhero team. Not one of my favorite Pixar films."
    },
    {
      "rating": "8",
      "text": "\"The Incredibles\" is truly one of Pixar's greatest achievements, as it not only provides thrills and beautiful animation, but it successfully bridges the gap between child and adult entertainment."
    },
    {
      "rating": "9",
      "text": "Perhaps the best animated movie ever made.  It's actually more like an actual superhero movie than something you'd expect to come out of Pixar (not that their other movies are bad.) It's just written in a way that adults can relate to more than little kids can, which is a good thing.  The concept of a retired superhero who's tired of getting old is clever, and the animation itself is also really good.  I'd say it's definitely Pixar's best."
    },
    {
      "rating": "10",
      "text": "I love the movie and I love the game. So memorable, and enjoyable. It's a really well made movie all around. Some parts were kind of cheesy, which I didn't like. That and everything always blew up."
    },
    {
      "rating": "9",
      "text": "In my opinion this is pixar's 4th best film (behind the toy story movies). This is a fun, action packed family movie that I would recommend to anyone who hasn't seen it. This was my first theater experience, and what an experience it was."
    },
    {
      "rating": "10",
      "text": "What a whimsical and hilarious way to invent new superheros! This film is excellent for children through adult, containing gut-busting comedy and talented actors. It may mot  be quite as suited for the younger end of children, as it contains material that may not be understandable to them."
    }
  ],
  "recommendations": [
    "how_to_train_your_dragon_2",
    "up",
    "onward",
    "big_hero_6",
    "kung_fu_panda_3",
    "spider_man_into_the_spider_verse",
    "the_croods",
    "ratatouille",
    "how_to_train_your_dragon",
    "finding_dory",
    "zootopia",
    "the_iron_giant",
    "finding_nemo",
    "atlantis_the_lost_empire",
    "shaun_the_sheep_movie",
    "the_book_of_life",
    "kubo_and_the_two_strings",
    "soul",
    "your_name",
    "the_good_dinosaur",
    "rise_of_the_guardians",
    "cars",
    "toy_story_3",
    "my_little_pony_the_movie",
    "raya_and_the_last_dragon"
  ]
}