{
  "id": 764,
  "title": "The Equalizer",
  "starring": [
    "Denzel Washington",
    "Marton Csokas"
  ],
  "runtime": 132,
  "genre": [
    "Thriller",
    "Action",
    "Crime"
  ],
  "description": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg",
  "categories": {
    "plot": 6.897435897435898,
    "acting": 7.054054054054054,
    "ending": 7.285714285714286,
    "soundtrack": 8.5,
    "cinematography": 7.333333333333333,
    "familyFriendly": 3.0,
    "funny": 7.4,
    "action": 7.491803278688525
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The Equalizer was one of the most underrated shows of the 1980s, it was a great show, but it always lacked a certain intensity that the lead character needed. In this 2014 film adaptation of the series, Director, Antoine Fuqua, made sure that didn't happen again. Denzel Washington stars and can play anyone, but I find he's at his best when he's playing a dark loner like Robert McCall. McCall, a former CIA operative has retired and is attempting to live a normal life. Everything is going as planned, until he sees a young girl being abused, and decides to take action. McCall believe he's just going up against a local pimp, but discovers it's a lot more complicated than that. Washington continues to be at the top of his game, as the ageless wonder is once again spectacular. This film is everything I loved about the series, with a whole lot more action and intensity. Director, Antoine Fuqua, has been on a role after films like Training Day, Shooter, and Olympus Has Fallen, and he has become THE guy when it comes to action films. Playing off an established franchise and paired with Denzel Washington, The Equalizer has come back to life and is one of the most refreshing action films I've seen in a long time. Sometimes with a different team, what was once old, can become new again, and I was practically jumping out of my seat with excitement. As far as the continuation of the series goes, Fuqua is in the early stages of a sequel. It may not be a new TV series, but it's still something exciting for the fans, and I for one can't wait to see more."
    },
    {
      "rating": "10",
      "text": "Denzel can etch another mark into his decorated career with The Equalizer; which is the best film and best thriller of 2014. I think that, while it takes a while to take off, when it gets going the story is very compelling, and draws you in. The action sequences are very well thought out, and amazing to watch. The best being the hardware store scene. Not to mention that the soundtrack is superb. Denzel offers a memorable take on the classic in the English series, with a stellar performance. He even packs in some intelligent humour. Overall, this is an action film that will have you hooked until the end."
    },
    {
      "rating": "8",
      "text": "Good solid Denzel film. The action scene in the trailer with timer is probably the best part of the entire film. I'm really excited for the sequel. However, I must say I was so excited for the film that when I left the packed theater, I was slightly disappointed. The villains were kind of weak and I wish the film had a better villain."
    },
    {
      "rating": "7",
      "text": "Dark, gritty, outrageous and at times powerful, The Equalizer is certainly a film worth watching. Denzel Washington and Chloe Grace Moretz star in what is a sadly realistic portrayal of the American underworld, particularly focusing on the issue of sex trafficking. The film is at times painful and disturbing to watch, however, it is necessary in presenting an accurate representation of such aspects. Denzel plays his role extremely powerfully, adding to the tense drama with moments of subtle comedic humour and outrageously unnecessary acts of violence. With the addition of well developed antagonists, the film questions our sense of morals expertly."
    },
    {
      "rating": "7",
      "text": "What differentiates a trashy, loudly violent action film from an entertaining, genuine guilty pleasure? If there’s a line, The Equalizer walks on it like an acrobat on a tightrope. Antoine Fuqua’s most recent work establishes itself as a crowd-pleaser, leaving spectators in awe, but every fluctuation between nonsense and coherency creates uneasiness and raises eyebrows. One might think: I hope this guy knows what he’s doing. Fuqua’s previous feature, Olympus Has Fallen (2013), felt like that too: an action packed thriller, forgoing all plot consistency, continuity and common sense for the sake of staging uncontrollable mayhem inside the White House. Since his deservedly acclaimed Training Day (2001), the American director has seemingly found it difficult to keep up with expectations. He has, nonetheless, always had good eye for action scenes, managing to build remarkable and gripping sequences. Much like some of his past works (King Arthur and Brooklyn’s Finest to name but a few), The Equalizer suffers the pains of lacklustre direction. The tasteless use of alarm clock shots to set temporal continuity, or the abundance of dull and redundant digressions, are only a couple of examples. Nevertheless, the film also offers great action, riveting exchanges, and a likeable, cathartic anti-hero.\r Denzel Washington is Robert McCall, our anti-hero, the guy we’d all want in our neighbourhood watch. He tries to lead a normal life, but his past is quite ambiguous, as two minor characters conveniently point out at the very beginning of the film. We’re never quite sure what he used to do for a living, but we soon find out that he’s good at killing people. To compensate for his brute instincts, Robert has developed a form of OCD that forces him to put everything right. He obsessively checks the time, follows a strict routine, aligns surfaces, equalizes things. Self control, though, only lasts until a ruthless syndicate attacks his friend Teri, forcing him to put his skills back to use. Everyone on Robert’s path to justice (better called revenge) then becomes cannon fodder, in a bloody chase between him and the pitiless mobsters.\r If you go see The Equalizer because you like the idea of good ol’ Denzel decimating the bad guys, you will be served, but don’t expect much more than that. There’s little substance beyond the already-held idea of righting all wrongs. There’s very little passion (let alone depth) in the canonical moral messages, clumsily delivered in the banal form of literary quotes. Chloe Grace Moretz and Marton Csokas do a decent job of playing Teri and Russian hired gun Teddy, but Washington outshines both, carrying the whole film on his shoulders with the usual talent. His character comes from an old TV series of the ‘80s, although die-hard fans claim that similarities end there. Washington’s Robert McCall is a half avenger half psychotic hitman, mixing Taken’s Liam Neeson and Unbreakable’s Bruce Willis. He has no real dramatic depth, but we still like him because we like to see the bad guys get beaten up. Whereas Training Day is all about discovering Washington’s Detective Alonzo Harris, appreciating his dark personality by observing his evolving attitude and actions, The Equalizer settles Robert’s background with two lines of dialogue. While Det. Harris is an Oscar-worthy protagonist with a powerful connection with the audience, Robert remains a tool, merely exploited to fuel the action on screen. If you’re planning to watch The Equalizer, prepare for a factitious thriller with unusual dark comedy shades. You’ll spend hours wondering if you liked it or not, before accepting that, in spite of everything, you actually enjoyed it."
    },
    {
      "rating": "7",
      "text": "Solid simple action romp well acted by Denzel. The action is great and Denzel is very convincing as the former CIA agent McCall."
    },
    {
      "rating": "7",
      "text": "While the acting was very good, the action sequences were well made and quite violent and the plot was interesting, it was just way too over the top and unbelievable at times. The movie was also a little bit too long. But all in all, The Equalizer is a very watchable movie and a very welcomed addition to the action genre."
    },
    {
      "rating": "8",
      "text": "I give this film a 7.5 rounded up to 8 because it's nice to see a fictional vigilante serving justice with brains and ingenuity while avoiding most of the primitive cliches we see in virtually every other action flick of the past two decades.This is not the Equalizer of the TV show.  The character is very different, lives very differently, and has been transplanted to Boston.  But this Robert McCall is very much worth knowing and Denzel Washington gives a fine performance.  I recommend this film without reservation."
    },
    {
      "rating": "7",
      "text": "I liked it, was interesting, had good actors, powerful moments etc. Good action movie"
    },
    {
      "rating": "8",
      "text": "Actually impressive expert-assassin-comes-out-of-retirement movie, because it stays closer to the realistic side and succeeds in creating the necessary contrast, unlike bad jokes like John *ick. Plus this one has a good motivation for all the fighting, not just the tired old \"they killed/kidnapped my helpless girlfriend/wife\". (Also check out \"De Zaak Alzheimer\" if you're into the whole expert assassin comeback thing.)"
    },
    {
      "rating": "8",
      "text": "This is a nice reenvisioning of the Robert McCall character to bring him up to date.  Denzel Washington does a good job of portraying this man of mystery and secrets.  Always happy to help his work colleagues and the downtrodden... and a cold calculating exterminator.  The direction is sharp, the acting strong, and even though there are some holes in the story it's still entertaining.  Hopefully, more will be revealed about McCall in future films."
    },
    {
      "rating": "7",
      "text": "When we look at the poster we say that this film is cold .. Well not so much and it makes it pass like a movie lambda. The actor is gigantic but it remains interesting that a Jack Reatcher, because it has a depth and a hidden past that is only touched. The two is expected. What are you waiting for?Quand on regarde l'affiche on se dit que ce film est froid.. Et bien pas tellement et cela le fait passer comme un film lambda. L'acteur est ci gigantesque qu'il reste néanmoins intéressant qu'un Jack Reatcher, car il possède une profondeur et un passé cacher qui nous est seulement effleuré. Le deux est attendu. Qu'attendez-vous ?"
    },
    {
      "rating": "10",
      "text": "A good movie again went underrating ! The best action thriller a long years to come."
    },
    {
      "rating": "7",
      "text": "While the acting was very good, the action sequences were well made and quite violent and the plot was interesting, it was just way too over the top and unbelievable at times. The movie was also a little bit too long. But all in all, The Equalizer is a very watchable movie and a very welcomed addition to the action genre."
    },
    {
      "rating": "8",
      "text": "Denzel Washington plays a very fine part in this tense thriller. At first it appears to be a slow burner, but the pace soon hots up with some great action set piecies."
    },
    {
      "rating": "8",
      "text": "Dark serious and entertaining!the music and soundtracks were phenomenal specially at climax,the acting was good,screenplay and story was decent.1st half was slow and dark it took the time for things to happen until then it was little boring then the Teri incident it was brutal.from then on it was entertaining ride although its predictable but the actions were literally great and well performed the side characters were good,love the 1st interaction between Robert and Teddy it was iconic.the calmness and skills of both were amazing to watch,the 2nd half was fully entertaining and amazing although some things felt little over the top and hate the slow motions scenes.the interrogation of officer and taking down of money thing it was impressive.the last 30 mins were literally cherry on cake the music and silence killing one by one cleverly it was awesome.Overall entertaining movie!"
    },
    {
      "rating": "9",
      "text": "Der Film hat sehr gut gemachte actionsequenzen und ist professionell gemacht worden"
    },
    {
      "rating": "7",
      "text": "I didn't mind this movie. A lot of it had to do with Denzel who is as captivating as ever."
    },
    {
      "rating": "7",
      "text": "Robert McCall: \"Progress. Not Perfection\".\r The story is about a former black ops commander has settled down in Boston - having faked his own death in order to enjoy a normal life. But when a young girl gets herself in trouble, his need for justice brings him out of retirement - even if it means going up against a group of dangerous Russian gangsters.\r I always like Denzel Washington in every movie that he was in. He always brings that cocky, smart-ass, know it all kind of person; and The Equalizer is nothing different. Denzel in this movie is a pure bad-ass that will end your life if he had to, just like Liam Neeson from Taken. The villain in this movie is pretty much the same villain that I've seen in every other Russian gangsters mob movies out there. The movie towards they end dragged a little bit for me.\r But overall I still think this movie was entertaining film with a lot of cool stuff with Denzel. It's not a perfect movie, but the film knows what it is and it goes for it."
    },
    {
      "rating": "9",
      "text": "Why is everyone saying this movie is a cliche??! I am not saying this isn't one. I am asking why is everyone surprised that it is? The movie plot (Like many other action movies) is about one tough guy fighting the wrong and helping the right. So when I watched this movie, I wasn't going for the \"great\" movie script. I was going for bad ass action, explosions, and super cool killing scenes. Don't go to this movie if you are excepting it to be different from the hundreds of other action. Because the equalizer is exactly like all the other action movie, where the bad guy dies and good guys win. This movie isn't suppose to be original, it's suppose to be kick ass and look cool. And it has delivered that purpose."
    },
    {
      "rating": "10",
      "text": "This is a great movie with a good message. Denzel was awesome what a city hero. One of the most amazing movies i have ever seen. This is a must see hands down!"
    },
    {
      "rating": "8",
      "text": "This is a good action drama movie. I'm a sucker for the quiet, unassuming, and underestimated heroes. I'm also a sucker for pretty much anything Denzel Washington stars in since he's one of my favorite actors. Worth a watch."
    },
    {
      "rating": "9",
      "text": "A little cliche? Maybe so. What I do not see very often these days is great action movies and this one fulfilled what the cliche action movie fans wanted! This is a must see if you want to see an action that us action movie fanatics have sorely missed."
    },
    {
      "rating": "9",
      "text": "The Equalizer was a knockout. Washington was brilliant and Mortez was mesmerizing. The action is by far, the best I saw in 2014. Director Antione Faqua, who brought us action marvel- Olympus Has Fallen and tense thriller- Training Day, comes with a story of a man with a violent past trying to settle down in his new job, while getting tangled with Russian mobsters along the way. The dynamic performance by Denzel Washington is what holds this movie together, along with the action. The Equalizer is a powerhouse movie, that deserves a buy on BluRay."
    },
    {
      "rating": "9",
      "text": "I am compelled to write a review about this movie because it struck me near the end that this had a message in it, an important philosophical one. It may appear as a standard action movie to some. Big star role, violence, guns, and explosions may be all this appears. If one pays attention and tries to look closer you will see that the message in the movie may be the same message that the book \"Invisible Man\" by Ralph Ellison was trying to portray. I say this not only because of how the movie was directed, the plot, etc, but I say this also because near the end of the film, the main character (Denzel) was shown with this book. It was zoomed in on to get clear full screen view of the title and author, this of course is of no mistake.\rI looked up the book and it appears to be one of great importance, a classic (1953), has a great message, and has received great awards. My final conclusion for the film is that the director was likely inspired by the \"Invisible Man\" and wanted to tell an interesting story portraying a similar message in a radically different way. From this perspective I believe this movie could be marked down as a future classic with a convincing message that is wonderfully directed. Denzel always does fine work, but this one is really up there. The director also deserves much praise and recognition."
    },
    {
      "rating": "7",
      "text": "Reasonably entertaining action film with a competent performance from Denzel Washington. I feel I must comment about the astonishingly bad performance by Marton Csokas as the principal villain. Not since David Harewood in Homeland have we seen such truly appalling acting. Marton Csokas is suffering from ANTS - Absolutely No Talent Syndrome. I fear Mr Csokas will soon be working at the home supply store we saw featured in the movie, though I doubt he would be effective there either."
    },
    {
      "rating": "9",
      "text": "The Equalizer is stylish and fun.The action is amazing,and so is the acting.Overall has a good message and has Danzel Washington kicking ass.What more could you ask for ?"
    },
    {
      "rating": "7",
      "text": "Simply put, it's another worthwhile and fun addition to Denzel Washington's line of action thrillers. Surprisingly, it has really good editing to where you get to see a lot of the action and blood without it cutting away so many times like countless other films have been doing lately. Also, great action sequences throughout, even though some of it may not be entirely original. Overall, check it out if you like Denzel and his films, or if you simply wish to see a fun film."
    },
    {
      "rating": "7",
      "text": "It sure entertains you and the character is pretty badass, even if at some point the question \"why the **** would he do that?\" struggle to find an answer"
    },
    {
      "rating": "8",
      "text": "For the most part, critics have been good with their ratings this year with a few exceptions. However, this is not one of those cases. I don't get the critics sometimes. Giving ridiculous movies like Maze Runner, Lucy, etc., good reviews is mortally wrong. They gave this a 59%, barely rotten, but should be higher. It's not Antoine's best work but it surely dishes out a blood justice good time. It's bloody, violet, meaningful (whatever rotten), and shouldn't br taken too seriously. This isn't as masterpiece or Denzel's best work, but it's clearly should be fresh. If you're going into this movie thinking it's going to be nothing but a fun movie, then you're setting yourself up for a bad time. It has its smart moments, but it's basicaly the rated R version of taken, which I loved. Overall I loved this movie, not for the smart and master piece of a movie, but for the violet and action packed movie. 8.5/10"
    },
    {
      "rating": "9",
      "text": "Nice to see Denzel Washington and Antoine Fuqua working together again as Training Day was one of my personal favorites. Not exactly the best performance Denzel has ever had but solid nonetheless. This is about the closest he has been to playing a super hero. Washington has never been more badass. The Equalizer is a movie that really keep your heart racing and it is entertainment at its best."
    },
    {
      "rating": "4",
      "text": "I like \"The Old Man and the Sea\" references in this movie. That's about the only thing that stuck out to me. The pacing is bad. The story is underdeveloped in my opinion. Based on what happens throughout the entire movie, the plot could have resolved itself within the first hour. I think the biggest problem is that this movie follows the formula of \"unstoppable protagonist\" where Denzel is basically a black superhero smacking around mobsters who look like they've never been in a fight before. I take back the black superhero description, I think \"Home Depot Warrior\" fits him better."
    },
    {
      "rating": "3",
      "text": "The Equalizer is \"revenge-porn\", but not much else. Maybe \"The Equalizer\" just isn't my cup of tea, but I'm surprised it got as many favorable reviews as it did. The movie felt kind of aimless, pointless, and unmeaningful IMO (just as Robert's life was portrayed in the film). Robert McCall is just a widowed man living through the motions, not doing much except visiting diners at 2 AM, reading all the books on a list of 100 classic \"must-read\" novels, chatting politely with strangers, helping people out, and keeping his apartment very clean. Robert (and the movie) have no sense of clear direction or purpose. And suddenly comes the one (actually, multiple people/events) destined to send him back into his old ways, and one thing leads to another. Besides exacting brutal justice on helpless goons with his \"very particular set of skills\" and simultaneously leaving lots of very obvious loose ends that are just BOUND to catch up with him, (enforcer & problem-solver/Russian villain) Teddy also impulsively kills for no reason! (He murders a Irish mob boss, which SHOULD start a gang war, but doesn't.)\r There are quite a bit of reckless actions done throughout this movie, and most of them hard to ignore. Besides the aforementioned logical fallacies, its hard to believe that of all the times Robert McCall witnessed injustice in his life (since having faked his own death as a former black ops commando), one random act of violence perpetrated against a stranger makes him go back to his former ways. NOTHING before that ever even slightly tempted him to exact violent and brutal justice? If he could so easily do good (as he takes down baddies and cripples a criminal empire with ease), why hadn't he done it before?\r The film has action and gore, yet even that fails to be entertaining--as Denzel/Robert is far too badass to ever even feel threatened. He seems super-human, which makes it hard for you to connect/relate to him. Victims in the movie don't have enough development to have the audience sympathize with them. As the action is not suspenseful, the plot hard to believe, and the characters underdeveloped/only used to advance the plot, The Equalizer doesn't have much going for it. It's too long and mundane. It doesn't even bring much new material to the table, similarly to Jack Ryan: Shadow Recruit. Both do little to establish themselves as different from the many movies out there. The Equalizer is too reminiscent of other vigilante/action films (TAKEN!), and it even reminds me of Home Alone (mostly during the finale)! Denzel's acting style is the only saving grace of the movie.\r Remember the Titans, Man on Fire, and 2 Guns were better Denzel Washington films, and Olympus Has Fallen was a more satisfying product from director Antoine Fuqua. I don't hate \"The Equalizer\", but it was a \"flimsy pretext\" stretched to last two hours and filled with meaningless violence (mostly used to establish the film as grisly and dark). It's a \"rejected Taken plotline\" repurposed to give Sony an unnecessary action movie franchise. This should remain a stand-alone film. It honestly doesn't warrant a sequel. I hate to say this, but \"The Equalizer\" feels like a \"regurgitated cash-grab\".\r I have reviewed 36 other movies, including the 2014 films: The Interview, Exodus: Gods and Kings, The Hunger Games: Mockingjay Part 1, Dracula Untold, The Maze Runner, The Expendables 3, Teenage Mutant Ninja Turtles, Guardians of the Galaxy, The Giver, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, Blended, The Amazing Spider-Man 2, Divergent, Transcendence, Jack Ryan: Shadow Recruit, The Lego Movie, and more.\r I review TV shows, such as: The Flash, Arrow (Season 3), Gotham, The Last Ship, Sleepy Hollow, Marvel's Agents of SHIELD (Season 1 and 2), The 100, I Wanna Marry Harry, Crisis, Gang Related, and more. I also have reviewed the mobile Android games: Minecraft Pocket Edition, Clash of Clans, and Five Night's at Freddy's.\r (P.S, some of the quotes are from other online text sources.)"
    },
    {
      "rating": "3",
      "text": "This is a remake of Man on Fire without the fire.  Weak at best Another regurgitated cash grab.  A good movie to watch at home on a Monday night when its too cold to go outside, the football game is a replay, all the  painting is done, the dishes are washed,........"
    },
    {
      "rating": "7",
      "text": "It's a super-entertaining flick, and Deznel is at the peak of his \"less is more\" powers here.  Have we noticed that all these aging actors (Neeson, Denzel) are becoming Charles Bronson?  Hey, give the people what they want."
    },
    {
      "rating": "9",
      "text": "I really enjoyed the movie, great acting, compelling story not super original, kept me engaged and wanting more, Denzel is a bad ass as usual. This is nothing like the expendables that's laughable. Go see it !"
    },
    {
      "rating": "2",
      "text": "Horribly cliched and predictable and despite the storyline being poor it still managed to drag on for two hours. No surprise in guessing the nationality of the bad guys and no surprise the main character kills everything in his path. Usual big budget film that insults the intelligence of its viewers."
    },
    {
      "rating": "7",
      "text": "Denzel is back, with the same director of films such as Training Day, and Olympus Has Fallen. This film is about a quiet man who meets a young prostitute who is dictated by the russian mafia, and through this he becomes very upset of what they are doing to her/treating her and he decides to fix this. This movie has some gory scenes here and there, but turns out to be a pretty good action movie overall... 6.5/10"
    },
    {
      "rating": "7",
      "text": "Based on the 80's television show, the Antoine Fuqua (Training Day) directed adaptation \"The Equalizer\" has solid action and a story that has been told many times but it's told very competently and the acting is top notch. It's one of Denzel's most physically active roles and his charisma goes off the charts as he takes down baddies in many violent ways."
    },
    {
      "rating": "8",
      "text": "Let me begin this review by saying that I've never seen the Equalizer tv show, so this review will be based on how I thought of the movie alone. This isn't the first time director Antoine Fuqua and actor Denzel Washington have worked together. Training Day was a film that produced a Best Actor for Denzel, so I was particularly excited for the two reuniting in an action film. However, this ain't your average action film. Fuqua really knows how to direct compelling action with an artistic framework. He's not like other directors who feel the need to unnecessarily shake the camera to hide the atrocious fight choreography and create cheap adrenaline, he actually uses the action to tell the character's story. You learn more about Washington's character through his fighting than you do through his dialogue. The film also had a strong antagonist, played by Marton Csokas, who had as much screen presence as the protagonist himself, which most action films lack, however, like I said before, this ain't your average action film. All that and a riveting action sequence that takes place in a hardware store should be enough to get your blood pumping for days on end."
    },
    {
      "rating": "2",
      "text": "generic shoot em up, which would be straight to dvd without its famous lead actor. The acting is good, but the script, direction and tone are poor. The action scenes are badly edited which, given that the movie has no reason to exist except for action, makes the entire thing pointless. Most annoyingly Denzel is a typical modern Hollywood \"hero\"- an unstoppable killing machine."
    },
    {
      "rating": "8",
      "text": "An excellent thriller in the retired-spy-becomes-vigilante genre, AKA Taken. Based on the 1980s TV show with the same theme, except in the TV show the spy is a stuck up old British guy and in the movie it's an old black guy who works at Home Depot and hangs out with bums. That is sort of the most unbelievable part of the movie, that this dumpy old bald fart that looks like somebody's dad, could be so agile with Spiderman reflexes.\r If you suspend your disbelief that far, the movie is actually really entertaining because its got that Max Paine, bullet time, stop action effect. The hero is sort of this invincible Flash. Also, the bad guys are a bunch of low life Russian mobster illegal alien pimps, the kind of villain you love to see getting whacked. Luckily, there are goodly supply of them to be terminated. The head villain is an ex-Spetsnatz contract killer psychopath who looks and talks like Kevin Spacey and is oddly named \"Teddy\". Basically it's the return of Kaiser Soze.\r The most annoying thing about the film is all the time spent on \"character buildup\" in which the Equalizer does community service trying to help his loser buddies at Home Depot. Super spy donates charity time to pathetic wannabe security guard. Its just incredibly stupid United Way stuff that just has you taking bathroom breaks until the killing starts again.\r Another oddity of the film is director Fuqua's obsessive cinematography. You always know you are in trouble when the director starts taking control of the camera. There are more shots of Denzel Washington's eyeball than you will ever want to see in your lifetime. You will also get electron microscope closeups of other obscure parts of his anatomy such as his septum, his thenar, etc. In retrospect the overkill on the art shots is not too bad, but it definitely makes the film more \"interesting\" at a certain level.\r Part of the fun of the movie is The Equalizer getting stuck in situations no ordinary person could possibly survive, so you are like, \"I wonder how he is getting out of this one\" and he always has these cool MacGiver solutions to the situation.\r Overall, a pretty entertaining film."
    },
    {
      "rating": "4",
      "text": "The Equalizer was a very disappointing film because it was so uneven – schmaltzy parts and vicious action and both types of scenes could be boring. The one really interesting thing was the creative ways the villains were dispatched, although The Equalizer was cheating a bit because all his “equalizing “was done on his home turf. Also I wasn’t quite sure where the director and screenwriter were going with the character (I never saw the TV series.) At one point the Equalizer tells a story to the main villain about an orphan boy who was adopted, and he speculates that the boy ended up killing the people who were kind to him. I thought he was talking about the villain, but someone cleverer than I suggested afterwards that he could just as well have been talking about himself since he had such a talent for unadulterated, sadistic violence. If this subtlety was deliberate, then it was a better movie than I thought. But I still am not impressed. (PS: I am a Denzel Washington fan.)"
    },
    {
      "rating": "7",
      "text": "The Equalizer is in the \"noir\" genre of film so don't go in expecting a huge shoot 'em up. That being said it was extremely well done and pretty violent while presenting interesting moral questions. Denzel does a great job as usual and I think the overarching story is pretty cool. I also think the movie does a good job of drawing you in to actually care about some of the lesser characters. Think it is worth a watch for sure!"
    },
    {
      "rating": "8",
      "text": "For all the people that claim the movie's plot is not original enough, it is worth noting that this is based on a tv series that ran from 1985 to 1989. That being said, this remake does what the show took a while to do. The show was campy, the acting was pretty bad, and it was nowhere near as violent as this movie. Denzel Washington did a good job of playing the Black Ops badass in this movie, and I enjoyed when the Russian scumbags pushed his buttons and forced him to act. This movie was entertaining, which is why I go to the movies. If I wanted a cerebral movie about a broken black ops operator, I would watch Man on Fire. This was basically a sequel to Man on Fire with a different character and story. In the end, the girl causes him to snap and do bad things to people who deserve it. Don't have a problem with that, and got good entertainment for what I paid for."
    },
    {
      "rating": "10",
      "text": "I thought the movie was great! The character Denzel plays has a good heart...like me!! I thought the movie had a real good storyline. Most of Denzel's movies are really good...just like this one. I wanted to see this movie ever since I saw the trailer. It was better than I thought it was going to be."
    },
    {
      "rating": "10",
      "text": "IF you like watching denzel act like denzel and kick ass, then go watch this movie. If you dont, then go watch this movie. Movie was excellent. Good popcorn flick. Great action, some cliche's but who cars.......The equalizer aka black panther."
    },
    {
      "rating": "7",
      "text": "As generic and 'done-oh-do-many-times-before' as the plot/storyline/premise is - among other minor flaws - , The Equalizer still delivers the goods of a solid and badass Action Thriller. Antoine Fuqua proves that he still has the knack for making great movies. Denzel Washington and Marton Csokas are nothing short of amazing, delivering some brilliant dialogues and performances that definitely try to break the mold of typical characters in likewise movies. The cinematography is (mostly) beautiful, mixing gorgeous views of Boston with moments of solemn slow pace as well as moments that actually push you to hold your breath and expect the unexpected on several occasions.\r As said before, the movie is far from perfect. The pace does tend to be too slow (going as far cas reminding people of the great but often slow \"Drive\"), the camera work becomes sporadic during action scenes, the only Boston accent in the movie is profoundly horrendous (this may be nitpicking, but as a former Bostonian, that one \"attempt\" threw me off), and the bad guys, while portrayed amazingly, are nonetheless your typical mafia members who want to spread chaos when things do not go their way. Finally, the story is not the most original, and may in fact be reminiscent of other slightly better movies.\r But overall, The Equalizer is a great watch and a good time. I look forward to the announced sequel."
    },
    {
      "rating": "7",
      "text": "The Equalizer is a rare breed of movie: it borrows from other films, everything from Sin City to Mr. and Mrs. Smith, yet it manages to be original enough to deserve a high rating. Unlike most generic action flicks, this one has round, multi-dimensional characters who you actually care about, and the script and screenplay are smart and well thought out. The movie is over-the-top and extreme, but it is very entertaining, thanks to smart action sequences and good acting."
    },
    {
      "rating": "2",
      "text": "The Equalizer is a decent film, nothing amazing , Training Day, American Gangster, Man on Fire, Malcolm X, The Hurricane. Remember the Titans,  Best Denzel Washington Movies"
    }
  ],
  "recommendations": [
    "the_mechanic",
    "the_equalizer_2",
    "shooter",
    "run_all_night",
    "angel_has_fallen",
    "the_commuter",
    "jack_ryan_shadow_recruit",
    "taken",
    "a_walk_among_the_tombstones",
    "the_accountant",
    "wrath_of_man",
    "3_days_to_kill",
    "safe_house",
    "american_assassin",
    "gangster_squad",
    "infinite",
    "man_on_fire",
    "triple_frontier",
    "the_ice_road",
    "creed_ii",
    "nobody",
    "john_wick",
    "safe",
    "skyscraper",
    "2_guns"
  ]
}