{
  "id": 284,
  "title": "The New Mutants",
  "starring": [
    "Blu Hunt",
    "Maisie Williams"
  ],
  "runtime": 94,
  "genre": [
    "Horror",
    "Science Fiction",
    "Mystery",
    "Action"
  ],
  "description": "Five young mutants, just discovering their abilities while held in a secret facility against their will, fight to escape their past sins and save themselves.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wI95esQmT9F8eC1wchoRm2ua2HX.jpg",
  "categories": {
    "plot": 2.5555555555555554,
    "acting": 2.730769230769231,
    "ending": 1.8235294117647058,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.7142857142857144,
    "funny": 0.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Would perhaps appeal to teenagers, but not to anyone with a discerning opinion. Inappropriate for young teens and too abysmal for anyone over 18."
    },
    {
      "rating": "0",
      "text": "I thought waiting so long to see this movie would be worth it, but no, it turned out to be a total disaster. The movie hasn't set its tone, sometimes you feel like it's from the horror genre and other times from the superhero genre."
    },
    {
      "rating": "6",
      "text": "I'm not sure why the reviews are so negative, as I really enjoyed the film. Yes, if you were expecting an x-men film or a horror film you will be disappointed, but as a stand alone piece, it works very well.There are some spooky bits, some mild jump scares, and a nice a nice introduction to to a new set of mutants."
    },
    {
      "rating": "3",
      "text": "Not a terrible movie, but not a great movie.The casting was more-or-less well done, though Heaton and Zaga don't fit well with their comic book counterparts (an optimistic farm boy and a Brazilian soccer star, respectively).The romance between Rahne and Dani is fast paced and irrelevant to the story. Even as a member of the LGBTQ+ community,  I can see the pandering. The movie's climax is, unfortunately, anticlimactic and obvious with each character getting their 'power spotlight'. The character of Cecilia Reyes is horribly destroyed in the film given that she's a dedicated medical professional in the comics (i.e. Do no harm).Overall a good watch, but glad it won't be part of ongoing efforts."
    },
    {
      "rating": "5",
      "text": "The New Mutants is a film directed Josh Boone and is about Danielle Moonstar played by Blu Hunt who wakes up after an incident to find she is in a \"hospital\" for mutants. This will most likely be the last X-men related project to have the 20th century logo. The X-men happen to be my favorite superhero team so I always have high hopes for any film remotely related to them. However this is a minor disappointment. The concept of blending superheros with horror though interesting is executed terribly. The first half of the film just drags its feat so you end up wondering when something is going to happen. Add that to the fact that the characters are written in such away that they all feel cliche, yet the actors do portray there respective characters well, especially Maisie Williams who played Rahne Sinclair and Anya Taylor-joy who played Illyana Rasputin. However, good acting wasn't enough to save this film. In conclusion unless you are a hard core X-men fan who needs a movie fix than stay far away from this film."
    },
    {
      "rating": "4",
      "text": "Long before Disney's acquisition of Fox began, the X-Men franchise was a mess in terms of cohesion and quality.The original trilogy ended on very bad terms with The Last Stand and the first Wolverine spin-off was a disgrace.They tried again with First Class. Good, but forgettable.They were able to restart everything in a better way with the ambitious Days of Future Past, because that film's ending was pretty much a reboot but, no, Fox **** it up again and they chose to deliver the terrible X-Men: Apocalypse and then it became quite evident that the franchise was dying and it was dying in a very ugly way.Logan gave a satisfactory conclusion to the character, but let's be honest, that Wolverine was very, very far away from being the Wolverine that we deserved.X-Men Dark Phoenix was the last nail in the franchise's coffin and I say this because New Mutants, even after its brutal delays, is nothing more than the leftovers of the rotting corpse.I don't know what kind of story they tried to tell here but it's quite easily to see that the narrative approach never fits these characters.I know they were trying to separate this film from what the others of the franchise did but it doesn't work.I admire they tried because it's an example that you can try different stories with characters from comic books but you also have to know how to do things right and do some justice to the characters.It's no surprise that the only person who leaves an impression is Anya Taylor-Joy, maybe this job will get her a better future character in the MCU or maybe in DC, but she could definitely be in a better film.From what remains, I can only say that this is finally the farewell for the mutants at this stage of their life on the big screen.What's in store for them in the MCU? I can only hope for better stories."
    },
    {
      "rating": "6",
      "text": "Decently acted with excellent special effects. Well worth a watch for fans of the comic. Seeing Magik and Lockheed in live action was done quite well! Hopefully this won't be the last time we see this acted play Magik. She was really good. The other characters were portrayed fine, but Magik was the standout.Now that all the good stuff is out of the way, I can't help feeling that the story was just not worthwhile. Having the whole thing revolve around one character's manifestations got boring. I could not help thinking that the story would have been better had the focus been on the characters working through their differences and eventually coming together to figure out that they are being groomed not for the x-men, but some other evil purpose. Then battling that entity.  This was set up and is part of the movie of course, but the story never explains who was holding them, who was pulling the strings and why. It just gets brushed aside. Could have made an excellent tie-in to the larger franchise if they did it correctly."
    },
    {
      "rating": "0",
      "text": "What a waste of time ... it was just .... really ... BAD..................."
    },
    {
      "rating": "0",
      "text": "Absolute pap.  Adding a zero to counter the obviously fake reviews.  I can’t believe how badly they misfired on this.  The Buffy episode they clip and clearly stole from is exactly 1,000 times better."
    },
    {
      "rating": "0",
      "text": "This film has so many issues I am going to simply bullet point them:Acting Plot Editing Cast Story Effects Setting Trailer (Completely misleading) DialogueI could honestly go on and on, you pick this film apart over and over and could find nothing redeeming, I know this film had issues with getting released, and numerous push backs for re-shoots and re-writes.... whatever other excuse they could come up with, personally, the film should have stayed in production limbo, stayed on the naughty step till the parents came home cos you will regret ever watching this film, if there are any reviews over 3 stars are lying to you, you will regret every moment, you will hate your life, you will wish you could scream at the tv till they could hear you and be ashamed of what was the final product. I hate myself for ever giving this film the time, and if you get to the ending spoiler everything was given away in the trailer.... Also that trailer OMG WTF, there should be a law against misleading people on films just like products in shops.I am making myself angry just thinking about how bad this film was! Therefore I must stop and take a breather"
    },
    {
      "rating": "0",
      "text": "I hesitated watching this for a while then I gave up cause I'm fan. Even though I had o expectations from it it still managed to let me down? How could they give this kind of budget to an awful movie like this? The acting was out of tone and terrible I believe the actors could've done better if there was any good writing. Their accents inconsistent. The production so lame. I could go on and on about the CGI and many plot holes but I just make myself more furious. Don't waste your time and money!! We learned from Dark Phoenix that we better say good bye to the franchise. Maybe now is the time."
    },
    {
      "rating": "0",
      "text": "just pure garbage. it's worse than TLS and XM:Origins and as bad as Dark Phoenix."
    },
    {
      "rating": "0",
      "text": "Awful. Everything about this movie is terrible, the only thing i liked in this mess was the soundtrack."
    },
    {
      "rating": "1",
      "text": "The X-Men storyline has been lost. It has forced sidelines not related to original 'mutants'. Better not to mention anything to connect to the successful X-Men dynasty."
    },
    {
      "rating": "5",
      "text": "Okay Hollywood, no more superhero-horror movie hybrids. You had The Crow. You had the first Hellboy. You even had Blade 1 and 2. Unfortunately, every other attempt you've made at marrying these two genres together has proven to be pretty disastrous, and this latest effort is no exception.To be fair, The New Mutants does have a GREAT premise. Take a bunch of teenagers struggling with the unfortunate consequences of their newly awoken powers, lock them in a psychiatric facility with a doctor operating under the guise of wanting to \"help them,\" and then give one of them the ability to literally bring all of their fears to life. It's an borderline brilliant idea, but the execution is so awful that only occasional and very brief flashes of the excellence that otherwise could have been ever show through. The lead actress can't act, its most interesting character (Magik) is underdeveloped, and the way it transitions from serious moments to ones where the cast are behaving like you would expect a bunch of horny, damaged pubescents to out of nowhere leads to a lack of tonal cohesion between a lot of the scenes. It has all the right elements to be the perfect millennial/Gen Z cape-and-costume flick, but never gives any of them enough room to breathe causing to whole thing to feel more like a janky pilot for another inevitably disappointing CW show rather than a well-executed proof of concept.Case in point, these teens have some of the coolest powers I've seen in a comic book adaptation since Bloodshot, but they don't really get to use them outside of the admittedly exciting final battle. Each character is compelling and seemingly layered in their own unique ways, but aren't explored much beyond the surface level. The plot also ultimately ends up going nowhere as it saves the major developments and inevitable showdown with the real big baddies for a sequel that we now know doesn't have a chance of getting made. I enjoyed this movie the most when it was trying to scare me. It's actually quite effectively creepy at certain points. Things like the smiley face men made my skin crawl showing that Josh Boone could have some potential as a horror filmmaker should he decide to go further in that direction at some point in the future. Which makes his upcoming remake of Stephen King's The Stand have some appeal to me whereas it otherwise didn't. However, given how strongly Magik's backstory ties into this side of things it only makes the fact that they sidelined it all the more frustrating.Like Spawn, Venom, and so many others before it, the final entry in Fox's X-Men universe is a misfire. Largely because it squanders so many of its most promising aspects more than anything. I can't think of another film I've seen that fails to capitalize on or sometimes even recognize its greatest strengths in the same way this one does. Which made me walk out of that theater feeling like I had seen where things could have gone right and ultimately disappointed with what we got instead."
    },
    {
      "rating": "3",
      "text": "We knew it was going to be a mess, but could it at least have been fun to watch?"
    },
    {
      "rating": "0",
      "text": "boring as hell not thrilling you want to finish more than half of the movie a boring romance and a copy of glass"
    },
    {
      "rating": "2",
      "text": "muy aburrida, lenta y parece slenderman no los xmen y es políticamente correcta osea caca"
    },
    {
      "rating": "0",
      "text": "This movie... from the initial trailer seemed to have potential with the combination of horror and superhero but this execution of it, however, was completely lifeless. The dialogue from the very first lines are just juvenile and flat as are all the characters and both remain so through the end of the movie. There are no redeeming qualities to this movie unlike some of the other X-Men movie flops that still carry fragments of something worth watching through."
    },
    {
      "rating": "1",
      "text": "Save your money, don't even bother to go, simply boring, nothing exciting about it and the plot is just lame.. such a disappointment"
    },
    {
      "rating": "1",
      "text": "Horrible movie! Boring, bad cgi, and typical plot. One of the worst X-men movies I’ve seen in my life. My god can Disney make an X-men movie already?"
    },
    {
      "rating": "4",
      "text": "There were some good ideas, but they were lost in the reshoots.  Clearly the studio knew this given they had it in 'post production' for years.  This belonged on their streaming service, not released to theaters even in this barren stretch."
    },
    {
      "rating": "3",
      "text": "I thought it was a mediocre movie, the elements of horror are not scary, and how a superhero movie can't get excited. It's a movie to watch only once, which could even be a Netflix catalog, not something for the cinema."
    },
    {
      "rating": "0",
      "text": "omg this movie is so cringe!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "0",
      "text": "I went to watch with my teenage son. We both love Comic based Movies1) about 20-30 minutes in I was so bored I pulled my phone to play a game 2) my son didn't ask me to put my phone away (he HATES if I view a txt etc during a movie) 3) the suggestive child rape scenes were not good - just enough to go yuck but so surreal - you weren't sure if it was a twisted memory 4) it doesn't work as a Horror movie - you never feel any of the main protagonists are in any danger 5) it doesn't work as a Superhero movie - too much mystery about the evil corp with the main antagonist too confused about herself to really build to any kind of climax 6) it doesn't work as a Teen coming of age movie - its all cliche and doesn't create the type of empathy it shouldSuperpower to bring to life nightmares is a cool idea, but the way that is personified is weak and the resolution doesn't show growth for or explain whySome of the acting was good - but the pacing was way to slow, the action brief, the motivations of the characters confusing (which is really weird given all the screen time spent on character development), the \"scary\" misty black cloud that becomes corporeal is banal, etc."
    },
    {
      "rating": "0",
      "text": "There was nothing exciting about the film, probably the most boring film I have seen in cinemas, a shame really, I feel like it could’ve had much more potential. Very disappointed."
    },
    {
      "rating": "1",
      "text": "Ужасный фильм, это точно не новые Люди Х которых мы ждали, ещё и толерантность туда впихнули, странно что нет ни одного афроамериканца, вы что расисты? Где геи? Вы что не толеранты? Задолбали уже со своей толерантностью Концовка просто полнейший бред с этим медведем. Если бы это был фильм просто про мутантов, но ок, но фильм позиционирует себя как новый мутанты Людей Х, даже не вздумайте продолжать что-то дальше делать.A terrible film, this is definitely not the new X-Men whom we were waiting for, they also pushed tolerance there, it's strange that there is not a single African American, are you racists? Where are the gays? Are you not tolerant? Already tired of their tolerance The ending is just complete nonsense with this bear. If it was just a film about mutants, but ok, but the film is positioning itself as the new mutant of the X-Men, do not even try to continue to do something further."
    },
    {
      "rating": "0",
      "text": "Personally, I feel that that essence of what it is to be a mutant has been lost"
    },
    {
      "rating": "0",
      "text": "No esperaba nada de esta película y igualmente me decepcionó. No vale ni pagar la entrada."
    },
    {
      "rating": "0",
      "text": "This movie is not worth watching. Its story has no twist and turns but that's not the worst part, the worst part is the acting. There are no actors that match their characters. except for Adam. Maisie Williams is even the worst-performing actress.  Don't waste your money."
    },
    {
      "rating": "0",
      "text": "For all the money, the talent, the cool effects that went into this. As a fan of the X-men and mutant universe, I'm Disappointed by the writing. Trying to say a lot ending up saying nothing."
    },
    {
      "rating": "0",
      "text": "I've been waiting for this movie a long time. Now that I've seen it, it was a waist of time. It could have been so much more."
    },
    {
      "rating": "0",
      "text": "Boring and predictable, they took too much time to do something that bad, i was so hype to watch this, it wasnt worthy"
    },
    {
      "rating": "5",
      "text": "As both a horror and X-men fan, I was looking forward to this mashup since the first trailer dropped. Even recently with mostly bad reviews and press, I wanted to see it for myself. And ... it pretty much sucked. That doesn't bode well for future work from Josh \"The Fault in my Stars\" Boone (e.g. \"The Stand\" mini-series. We pretty much know the gist from the trailers. Young mutants are haunted/harassed by something in a mental hospital. The best parts are pulled from the X-men series in which mutants first find out their powers, typically represented effectively on screen. Most times these scenes are fun, but the special effects are a mixed bag, jumping back and forth from decent to cheesy. Most of the ensemble cast are relatively new up-and-coming stars such as Maise Williams (\"Game of Thrones\"), Anya Taylor-Joy (\"The Witch/Queen's Gambit\"), and Charlie Heaton (\"Stranger Things\") but the acting is mediocre, and worst of all, they butcher whatever accent they are supposed to have (Irish, Russian[?], and U.S. southern respectively). And the story -- disappointing to say the least. If you drop your expectations to a bad 90 minute \"Buffy the Vampire\" episode, then maybe you'll find something to like."
    },
    {
      "rating": "1",
      "text": "Seems like they used a template for a teen movie + diversity check boxes. The result is a perfectly safe movie and perfectly predictable and boring. 1 point for being not the worst movie in the x-man universe but for more they would have to do a little bit more than filling check boxes in a template."
    },
    {
      "rating": "1",
      "text": "The story too slow and boring. Acting is not good. I think you should to skip this one"
    },
    {
      "rating": "3",
      "text": "Was excited to see this. Finally get to the theater popcorn and soda at the ready. And...... it was a let down. I wasn't really sure what to expect with this one to begin with but and that's what made me excited about this. What great idea did they come up with? I have a few ideas that would have made this film better. Some stuff I wanted to see happen that I think would have it much more interesting  of a tale. I don't get paid to throw those ideas to the studios so I wont say. By the end of the film all I kept thinking in my head was \"This is it!?\"  And  \"Now it makes sense why this kept being delayed\"."
    },
    {
      "rating": "1",
      "text": "it was so bad that i regret watching itwhy they even made this stupid movie?why they are ruining the franchise?the only thing that i liked was the Smiley Men"
    },
    {
      "rating": "0",
      "text": "Embarrassing and at other times, its downright awful. I can’t believe this was made for the theaters"
    },
    {
      "rating": "0",
      "text": "What do you get if you start with Stranger Things, add a dash of super hero-iness, strip out the 80s kitsch, ignore character development and leave good writing and acting out? You get this sorry excuse of a Marvel film. If you've seen the trailer, you've seen all of the supposed horror elements. If you've seen Stranger Things, you've enjoyed a far better version of the \"mysterious facility for kids with powers\" story. The characters are flat and predictable. The plot is barely there. The film makers left so much material untouched. Where were the back stories of each character? Where are the revelations about who is really behind the hospital? What is the bigger picture Of the world surrounding this story? I literally laughed out loud during the silliness of the the final battle scene. Bummed to see another whiff on what could have been the start of a decent Marvel franchise."
    },
    {
      "rating": "0",
      "text": "I Remember a few years ago when the \"New Mutants\" was being advertisedas the new X-men for the new generation . Good Grief, this wasn't that. I have to be honest here: from the first second to the last second this was just sub-par. It began with a quote we'e heard 1000x before beginning with Sitting Bull & most recently with Tomorrowland...and Idc if you replace wolf with a bear or not its still just as Cringey...in fact 100x more so... Then it just progressed into pure teen agnst nonsense & terrible CGI & effects. Ended with a lackluster & totally anticlimactic ending. Good God. This was JUST AWFUL. Maybe it it was the Online Streaming super hero shoes like Titans or Umrella Academy or Runaways that made me expect more from this but this was bar none the worst super hero movie or series Ive ever seen. Yes I am including the original 1994 Fantasic Four."
    },
    {
      "rating": "0",
      "text": "This junk they call a movie is like a blind man trying to herd cats utterly pointless avoid avoid avoid"
    },
    {
      "rating": "0",
      "text": "I had low expectations going in but daaaaaaaaaaaaaaaaaaaaaaaang this was bad."
    },
    {
      "rating": "0",
      "text": "This is the first movie I've seen in a theater since the pandemic ruined everything. Did I have high hopes? No, I was just happy to get out of the house. I have the unlimited pass so this movie didn't cost anything and I'm still upset for wasting my time. The plot was bad, the dialouge was boring and by the end of it I was cheering for the bear to just eat everyone."
    },
    {
      "rating": "0",
      "text": "Had to give this 1/10 because you can't give 0/10. Save your money. This is just awful"
    },
    {
      "rating": "0",
      "text": "Waiste of time , doesn't worth watching this movie or giving your time on this movie"
    },
    {
      "rating": "0",
      "text": "Shallow characters, poor plot that was marketed deceitfully (this has only 5-10 minutes of horror the rest is a forced love story that happens after only 2 days) and above all a perversion of one of the wisest most renowned Native American stories."
    },
    {
      "rating": "0",
      "text": "Probably the first worst movie I've seen since the amazing spider-man with jamie foxx... I've never seen such bad acting in a single movie. idk what marvel was thinking w this one. Like they was rushing during the pandemic to throw something together and that's exactly what they did. Mfs was on a budget cut making this one. I could go on and on but imma just leave it alone."
    },
    {
      "rating": "0",
      "text": "Wow, i mean, could you imagine a movie that was projected in 2015, casting was done in 2016, and the filming was done in 2017, and then got delayed for 2,8333... years,and during the delay, there was no improvement in 2,8333... years and they just went along with it.2,8333... years should be quite enough for a story's improvement, but guess it didn't work for this. Very dissapointing."
    },
    {
      "rating": "0",
      "text": "This shouldn't even belong to the X-men series. Terrible story and directing."
    }
  ],
  "recommendations": [
    "dark_phoenix",
    "doctor_strange_in_the_multiverse_of_madness",
    "the_twilight_saga_breaking_dawn_part_2",
    "shadow_in_the_cloud",
    "x_men_apocalypse",
    "the_old_guard",
    "riddick",
    "bird_box",
    "teenage_mutant_ninja_turtles",
    "independence_day_resurgence",
    "the_tomorrow_war",
    "the_cloverfield_paradox",
    "terminator_genisys",
    "the_twilight_saga_eclipse",
    "shut_in",
    "unfriended_dark_web",
    "wonder_woman_1984",
    "next",
    "the_darkest_hour",
    "jumper",
    "i_am_number_four",
    "the_maze_runner",
    "the_matrix_resurrections",
    "poseidon",
    "the_twilight_saga_breaking_dawn_part_1"
  ]
}