{
  "id": 2355,
  "title": "The Departed",
  "starring": [
    "Jack Nicholson",
    "Leonardo DiCaprio"
  ],
  "runtime": 151,
  "genre": [
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
  "categories": {
    "plot": 4.7894736842105265,
    "acting": 4.702127659574468,
    "ending": 5.625,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The film is not a film like taxi driver or Raging bull but, it is instead a regular crime thriller film with scorcesse's special touch. This film would have been just an average film if it werent for 2 things. Scorcesse's direction and the acting ensemble. The films writting is also masterful but, it works extremely well because of the acting. Overall a great film."
    },
    {
      "rating": "9",
      "text": "An excellent film with an outstanding cast brilliant direction and genius writing and a spectacular ending. This is one of the finest films of Scorsese since Goodfellas & Taxi Driver."
    },
    {
      "rating": "0",
      "text": "This is not a film Scorsese will be or should be remembered for - though fans of Goodfellas may relish the profligate bloodshed,It was really boring and i didnt like it at all."
    },
    {
      "rating": "10",
      "text": "It seems as if the Christian fundies have invaded this site. This film is truly one of my favorite films, ever. A true gangster film, with a great story, great acting, and overall an exceptional film."
    },
    {
      "rating": "9",
      "text": "Great story, great acting, great film."
    },
    {
      "rating": "10",
      "text": "I think it will be the best movie of 2006. If you haven"
    },
    {
      "rating": "9",
      "text": "What a nice return to the good stuff from the director. I don't think it's his best since \"Goodfellas\" ( I think \"Casino\" is) , but it is really one of his best. And definitely best Dicaprio's work."
    },
    {
      "rating": "8",
      "text": "Slightly overrated. The acting was superb from all quarters, EVERYONE. But Di Caprio carried the movie. I actually wanted to see more of Mark Whalberg in this film, his character was intense. Matt was Matt (his best work for me with regards to Damon to this day still remains to be the first remake of the Bourne Identity, but he did a good job here too). Jack was Jack and you can't say anything more. But Leo was definitely the character I empathized with the most and like I said he carried the film. Maybe it was all the hype leading up to me seeing the movie that let me down a bit though the ending was really good. 8/8 Worth the $$$."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have ever seen! It keeps you on the edge of your seat the whole time. The actings fantastic, the music is great. This movie is thrilling, unpredictable, and amazing!"
    },
    {
      "rating": "9",
      "text": "the film was great. all of the complaints people have about it are invalid. the plot was great, the acting suited the film perfectly, and character development worked well. if people can't understand the motivation of a character in a film directed this well, it's the fault of their incompetence, not poor screenwriting or directing or acting. the film is by no means \"safe\", the editing was very sporatic for effect and necessity and the cursing realistic... if you want to be shocked for shock's sake, watch hobos fight on the internet."
    },
    {
      "rating": "10",
      "text": "Solid performances from all actors but once again DiCaprio especially impresses me.  He's undercover, struggling with unimaginable anxiety and paranoia which he barely manages to keep a lid on through abuse of anxiolytics and he delivers us a solid and believable character.Mark Wahlberg's outrageous swearing and in-your-face attitude reminds us there are few, if any, true heroes out there.  Faced with the reality of sociopathic criminals and blood-ridden crime scenes even the good guys get gritty.  And on the topic of sociopathy, Jack Nicholson unflinchingly becomes the personification of depravity.  For me, the graphic violence and bad language is justified: these are men pushed to their limits.  And the death of the characters (especially the unexpected death of DiCaprio's character) is shocking and therefore the violence of their deaths should also be shocking."
    },
    {
      "rating": "10",
      "text": "Being a bit skeptical going into this movie knowing that it is going to be a bloodbath and use f*** as a space-marker, the story telling, acting, and overall plot totally diverts your attention away from the gruesomeness. DiCaprio's performance deserved and Oscar as well as Scorsese's direction. Brilliant movie."
    },
    {
      "rating": "10",
      "text": "i've never seen a more gritty and dramatic insight into mob families. will brilliant performances from the entire cast. this is a brilliant action packed movie. brilliantly directed by scorcese, this is one of my favourites."
    },
    {
      "rating": "10",
      "text": "What can I say? Martin is a genius. Perfectly casted, directed, written. Why are some people giving it 1/10? It's almost an insult to give it a low score like that. The movie is brilliant"
    },
    {
      "rating": "9",
      "text": "Just a fantastic film. Each and every actor does such a marvelous job and the movie leaves you wanting more, which is the key reason why this is a 10. The end was great, but yet, I still want more. I'm almost sad that the movie is over. Highly recommend. Fantastic film."
    },
    {
      "rating": "7",
      "text": "What is it about Matt Damon, that's driving me crazyy?! He is simply annoying, his face is antipathic and his smile is complacent. He is on the top of my hate-actors-pyramid. This guy is 100% not for the cinema. He is like those young divas, who can't sing, but dad has money. And I don't know why they choose him for such good movies, he destroy them all!!!Back to the movie. :) Great. But my score is mainly due to the badas* ending."
    },
    {
      "rating": "0",
      "text": "This is one of the worst, most overrated movies I've ever seen. Critics pretended it was good so that Scorsese could win his best picture that he never won before for the times he really did deserve it like Goodfellas and Casino. This movie was ridiculously unrealistic. Jack Nicholson was horrible in his role. Why would the mob boss be personally involved in all the day to day business? Unrealistic. Why would he personally meet with his police dept. mole in the adult movie theatre and then whip out a s*x toy and do a weird joke thing? That was one of the worst scenes I've ever seen. He was annoying and not all likeable or interesting. He constantly wore that stupid hat and ugly glasses and when he didn't, he had his overly long hair which flared on the sides like they were little wings. Stupid and frustrating to look at. Also, there was the constant offensive language and profanity. Why the need for all the racial and anti-LGBT language? Another horrible scene: when Alec Baldwin's character tells the other guy, \"You one of those guys who works out? Go f*ck yourself\". Yes, that's how bad the dialogue was. The script was unbearably bad. Also, the main female character of a psychiatrist? Why would she sleep with her client who acts like a total lunatic and is extremely insulting to her? Is this Scorsese's fantasy of women? You can treat them like crap and then they break their professional ethics to sleep with you? Horrible. I just watched Casino the night before and was on a Scorsese kick. Wow, what a comparison. Casino is about 100 times better than this one. I can't believe I thought this was a good movie when it first came out. What was I thinking? I guess if you are desperate enough to believe the hype, you can like just about anything. I guess that explains all the positive reviews here. Sad. Deeply painful movie to watch and not at all worth the 2.5 hours of my life I'll never get back. Don't waste your time watching unless you enjoy watching movies just to see how terrible they can get."
    },
    {
      "rating": "2",
      "text": "I really wanted to like this movie considering the cast and Scorcese, however, I found it jumped all over and was hard to follow. The plot was ok and the acting was mediocre at best as there was a lot of over-acting for dramatic effect which diminished the realism and believability. It felt like I wasn't watching fictional characters with any depth, instead just actors acting with bad fake Bahstun accents. I think this would have been a much better movie with some quality new or unknown actors instead of the typical multi-Millionaires, of course, that isn't how the movie business works - it's all about the money and the A-listers get more cattle to the box office. Finally, the cover of Pink Floyd's classic Comfortably Numb was absolutely terrible, I actually cringed when I heard this beautiful song being completely butchered. The band, singer, and anyone involved with this decision should be lined up against a wall and pelted with rotten cantaloupe until they sob, apologize, and promise to never do this again."
    },
    {
      "rating": "10",
      "text": "Phenomenal. Definitely as good (if not better) than Goodfellas."
    },
    {
      "rating": "6",
      "text": "The Departed has good acting and a pretty good story but it felt like just another gangster film; violence, drugs, and a bunch of thugs after one thing, money."
    },
    {
      "rating": "10",
      "text": "One of Scorsese's most brilliant works. It may be an adaptation, but the rebirth is stronger like a phoenix. Strong, strong acting, excellent directing, and involving storyline make this mob thriller one of the highlight films of the year."
    },
    {
      "rating": "9",
      "text": "Mr. Scorsese just put me in a position, after watching this movie, to be appalled at how gruesome and unnecessarily violent this movie is, or to say, \"What a masterpiece!\" I think I'll go with the latter."
    },
    {
      "rating": "10",
      "text": "Marty does it again!! and I really really hate DeCaprio (this is baseless old fashioned, old school unreasoning hate, like a clan member but instead of ethnic groups I hate the beautiful people who get to eat cheese burgers off of super model asses!)"
    },
    {
      "rating": "10",
      "text": "This Movie is one of the best on the past decade. Excellent job."
    },
    {
      "rating": "10",
      "text": "Not as good as Scorsese's transcendant \"Goodfellas\", but what film could be compared to that masterpiece other than \"The Godfather\"? It's pretty shocking to see that this is the only film directed by Scorsese that ever won Best Picture (not that it matters), because I can think of four or five films that I prefer of his over \"The Departed\". Maybe what this film does more than anything is show how illustrious and superb Scorsese's career has been."
    },
    {
      "rating": "6",
      "text": "I honestly do not know why many people say it's a masterpiece. For me it was a good movie, but not a masterpiece. However, the actors do a great job.."
    },
    {
      "rating": "6",
      "text": "At least 30 minutes too long, which cost it a point from my point of view. It starts very slowly before building to a slow but intriguing pace. I didn't find myself caring about the fate of any of the characters, which ultimately left me feeling detached from what was going on.However, it was intriguing and I genuinely did want to know what happened in the end. I struggled a bit in the middle because it was so long. Ending did disappoint, however. It made little sense and lacked payoff."
    },
    {
      "rating": "3",
      "text": "This movie is pretty much an overrated remake of Infernal Affairs. When I first saw this movie I thought it would be AMAZING since it had won the oscar fo best picture and all. I was very disappointed and all I remember was mostly people saying the F word over and over again. Some parts of the movie tries to have crude humor but it fails miserably. Now I saw this movie before I saw the original infernal affairs I saw infernal affairs about a year after an thought the original was much much MUCH better. This movie lacks proper character development and we feel no emotion for the characters. The only thing better about this remake is the mob boss played by Jack Nicholson. This movie is WAY overrated and I really don't recomend watching it. I however can recomend watching the original movie. The orginal movie \"Inferna Affairs\" has what this movies missing(a heart)."
    },
    {
      "rating": "1",
      "text": "Uninteresting. It is very overrated. It is too bad that Marty won for this film when he clearly had better work that was overlooked. The accents seem so forced and the storyline is just another gangster film."
    },
    {
      "rating": "5",
      "text": "Possibly Leo's finest hour........but as with so many recent Scorcese films the ending seemed rushed and the storyline needed work -[***SPOILERS***] how 'bout Wahlberg dropping the brown envelope on the body at the end?. Maybe the last 5 minutes should have been cut entirely and I think Marty should have had a few less 'Yes' men watch the film before it came out. The Departed = Disappointed"
    },
    {
      "rating": "9",
      "text": "Bottom Line: Crime film is very thrilling, hard to stop watching. Deserving of its Best Picture Oscar.\r Scorsese directs a violent update of the well-known Chinese mob film, INFERNAL AFFAIRS, from just four years prior. Set in Boston, Massachusetts, the story tells of a mob boss named Frank Costello (Jack Nicholson) who sends out a criminal, Colin Sullivan (Matt Damon). Simultaneously, the local police have sent out Billy Costigan (Leonardo DiCaprio) to infiltrate Costelloâ"
    },
    {
      "rating": "6",
      "text": "Martin Scorsese's translation of \"Internal Affairs\" offers nothing new or shocking except for a surprisingly well performed Wahlberg. He ends the movie with his own american twist (everybody dies) and boom, before you know it the movie is barely done. Overall its good, but he barely makes his point in \"The Departed\" with his overaggressive 'American' translation of the stunning original. I recommend Martin Scorsese to try better, like the time where he had the spirit to direct \"Taxi Driver\"."
    },
    {
      "rating": "3",
      "text": "I really wish someone would explain to me how this is a good movie. Is the acting great? You bet. Direction? Sure. But, how about this... There is absolutely no way in my mind that the events portrayed in the movie could ever be considered believable. Leonardo DiCaprios character wouldn't have survived any longer than the amount of time it took Jack Nicholson to find him after hearing that there was a rat in the group. Secondly, if there is a leak in a department, they would bring in from outside the group to investigate, not just tell the guy in charge to do it. I dislike this movie only for the reason that I find it amazingly unbelievable and ludicrous."
    },
    {
      "rating": "3",
      "text": "While the original Hong Kong version was plausible due to their cultural standards, Scorsese's version was way below imaginable standards. While the HK verison had some plot devices, there was a lot implausible gaps and forced concepts that didn't work out in the American version. Like a boss sitting in the front of a car so the mole can communicate in the back. A gang boss will never sit in the front of a car! Using cell-phones to bring down a gang is just lame and un-inspiring! Colin Sullivan, who claimed to not be able to use the password on his computer all of a sudden uses it to delete Costigans profile on his very own computer seconds later. The list goes on and gets very tiresome to mention. Didn't anyone review these forced issues and plotholes before making the film? That's right, they just tried to copy IA, forgetting about the lost in translation consequences. Its a shame that America never bothered to release the IA trilogy instead in theaters. The original stories encompassed balanced story-telling, better suspense and emotional content, slick cat-and mouse chase, psychological dept, and well-developed and intriguing characters. We also get to see how being in the police and triads truly bring grief in their lives. The Departed was done sloppy in comparison only saved by typical Scorsese violence and swearing. The characters in Departed were lame and boring. Billy Costigan (Leo Dicpario) is the only character probably that got his role right. Matt Damon, a good actor, had a very dull and typical bad guy character in comparison to Andy Lau's tormented role in IA. Martin Sheen was a poor father figure and a watse of time. and of course, there are other lame, pointless filler characters that aren't worth mentioning. Sadly, Scorsese will get praises from the audience no matter how he makes his films. Had Scorsese's name not been on the director's list, this film would had got a worser rating. All in all, it was IA that was more realistic. People say Departed is, but tell yourself this, not one person swears that much, nor do you see bloodshed like that in reality. 4 guys getting bullets in their heads one after another? There was a reason why IA had the bullet in the head scenerio but Scorsese and Monahan just really never knew what it meant, did they?"
    },
    {
      "rating": "1",
      "text": "Overrated. Unfortunately, overexcessive swearing and violence makes this film too unrealistic. Scorsese is starting to lack polish in his films."
    },
    {
      "rating": "6",
      "text": "Solid acting through out by a very talented cast. I think they got a bit full of themselves plot wise with the constant twists, Most of which were rather eh and not in the least bit surprising. There are a few needless sub plots too. At 2 and a half hours, It's a bit long to sit through as it did lose my interest a little more than half way.Overall, I didn't mind it but I didn't think that it was a movie that deserved a near 90 overall score."
    },
    {
      "rating": "2",
      "text": "For once ,I agree with the negative reviews here. I simply didn't like the film and Scorsese's way beyond fictional views. I don't see how anyone could give this film a 8 or above."
    },
    {
      "rating": "0",
      "text": "Not necessary. Martin, William, leonardo, Matt, Mark, and Jack put together a performance that goes way over the top and totally unexpected. But 90 minutes in the movie, you can expect the violent killings at the end due to a non-stop functional randomly made-up look into crazy lives that is impossibly accurate."
    },
    {
      "rating": "2",
      "text": "Why is Mark Wahlberg affecting a Bostonian accent in this movie: he's FROM Boston! And, as usual, Scorcese can't direct a believable female character at all. Ever. This-- ALL this said-- it is certainly a better movie than his post-2000 attempts: the tedious GANGS OF NY and the unwatchable THE AVIATOR...faint praise, indeed."
    },
    {
      "rating": "0",
      "text": "Martin Scorsese is obsessed with sinful everything. This movie is written, and every character never does follow the ten commandments, only the devils."
    },
    {
      "rating": "5",
      "text": "Better than awful, but really the most artificial, least compelling, 2d characters, standard run of the mill crap crime movie. If you don't have integrity, you'll enjoy the whole movie. If you do, you might think it's occasionally touching when the lead men interact with their shared love interest. The rest is just Tarantino-style violence/vulgarity porn for cheap thrills. Worst Mark Wahlberg movie I've seen. WTF?"
    },
    {
      "rating": "5",
      "text": "James Hoberman was completely on target: Neither a debacle nor a bore. The film's first two-thirds were well constructed. The interlude sequence with Costello (portrayed by Nicholson) lured the audience in with a certain mood. With a technical and fictional (story telling) plan, Martin Scorsese, accompanied by his skilled editor Thelma Schoonmaker succeeded with engaging the audience with a tight cast of characters furthered by precise directing from Martin Scorsese"
    },
    {
      "rating": "4",
      "text": "Be sure to take a pillow for the long nap."
    },
    {
      "rating": "4",
      "text": "Casting Decaprio as the undercover tough guy ruined the movie. He was only convincing as the innocent young cop and since much of the movie revolved around a sense of sympathy or at least belief in the tribulations of his character, Decaprio's cardbard portrayal destroyed any emotional engagement in the characters. As usual Mark Walburg stole the show becuase his character was lovable but Damon really showed his prowess in creating a character of depth, with frailty and orginality. Unfortunatley brilliance on his part was dependent on Decaprio's reflection. The script was a little heavy handed and frankly seemed to try to be a little too hard in the final sequences to be a Tarintino movie. The Gen Y's I went with seemed to think it was the \"pulp ficiton\" of thier generation.. hopefully they will get something more uniquely thier own than this canned attempt."
    },
    {
      "rating": "6",
      "text": "The critics worship at the shrine of Scorsese., but this is a good, not great, movie.. Good actors, well-directed and a pretty good story, but this film does not deserve to be called great and is way overrated. Too long, too much of the same thing... Jack's great and some of his lines are classics., but the film is , really, pretty thin and fairly average-not in the league with Goodfellows, or GF 1 and 2-as some critics are saying."
    },
    {
      "rating": "0",
      "text": "A waste of film on every level. Scorsese is in bad need of a dominatrix."
    },
    {
      "rating": "3",
      "text": "I've noticed that most of the positive comments of this movie tend to come from people who are essentially Scorcese worshippers - people who will praise anything the 'great director' comes up with. While this film might have its merits, this movie suffers from terrible characterisation, enough to kill this film. As somebody called JR M posted earlier, \"Since much of the movie revolved around a sense of sympathy or at least belief in the tribulations of his character, Decaprio's cardbard portrayal destroyed any emotional engagement in the character\". It was hard to care about a guy who spent the whole movie whining. [***SPOILER***] I cheered when Dicaprio's character got shot, and then I asked myself, 'Hey, aren't I supposed to be rooting for this guy?' His character was poorly concieved, poorly written, poorly characterised, and above all poorly (over) acted."
    },
    {
      "rating": "3",
      "text": "I don't see how this movie made anyone's \"Best of 2006\" list -- except that the critics love Scorsese. It's a far-from-groundbreaking \"rat in the police dept\" story with tons of bloody gun violence and almost no satisfaction plotwise. Acting is OK, but It's like \"Goodfellas\" and \"Pulp Fiction\" minus any style or humor ... and you'll hear the f-word enough to last you the rest of your life."
    },
    {
      "rating": "2",
      "text": "Steven is right about this movie getting high ratings due to Scorsese worshippers. This movie is poorly contrived in comparison to the original HK movie. The cast is either poorly used or miscast. In the HK one, the Matt Damon character is more interesting and has a dual personality. Martin Sheen is so dull as Leo's supervisor. This movie also lacks the emotion of the original . How this movie is getting high ratings seem to be pure propaganda to boost Scorsese's failing career. To simply put it, America lacks in the ideas department. If this film gets any oscar at all, there goes any integrity Americans have for foreign films."
    },
    {
      "rating": "7",
      "text": "America has forgotten what makes a truly great movie. Is this movie way better than most in recent years? Yes. Is this movie Shawshank Redemption or The God Father 2? No. Why? It lacks inclusion. It's an art that is hard to master and hard to explain. Basically, it's a lack of connection between myself (the audience) and the characters. At the end when everyone gets shot, I really didn't care too much about any of the characters' fates. Maybe it's the tabloid cast. We know so much about these people personally, it might as well be our parents or friends on screen. We know that DiCaprio gets up from the floor, cleans off the fake bullet hole in his head, and goes back to his perfect \"real\" life of fame and wealth. We weren't so certain about that back in 1992 with Morgan Freeman and Tim Robbins. We need to either stop with the tabloids or find new actors that will enable our suspension of disbelief again."
    }
  ],
  "recommendations": [
    "gran_torino",
    "lucky_number_slevin",
    "inside_man",
    "the_gambler",
    "suicide_squad",
    "the_guardian",
    "eastern_promises",
    "american_gangster",
    "rocknrolla",
    "black_panther_wakanda_forever",
    "mystic_river",
    "captain_marvel",
    "inherent_vice",
    "changeling",
    "elektra",
    "logan_lucky",
    "tenet",
    "the_tax_collector",
    "poseidon",
    "the_many_saints_of_newark",
    "abduction",
    "the_equalizer_2",
    "21",
    "the_suicide_squad",
    "triple_frontier"
  ]
}