{
  "id": 316,
  "title": "The Truman Show",
  "starring": [
    "Jim Carrey",
    "Laura Linney"
  ],
  "runtime": 103,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Truman Burbank is the star of The Truman Show, a 24-hour-a-day reality TV show that broadcasts every aspect of his life without his knowledge. His entire life has been an unending soap opera for consumption by the rest of the world. And everyone he knows, including his wife and his best friend is really an actor, paid to be part of his life.",
  "releaseYear": "1998",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vuza0WqY239yBXOadKlGwJsZJFE.jpg",
  "categories": {
    "plot": 7.9523809523809526,
    "acting": 9.0,
    "ending": 4.0,
    "soundtrack": 9.0,
    "cinematography": 9.333333333333334,
    "familyFriendly": 5.0,
    "funny": 9.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Seriously, hands down- one of my favorite movies. The story is orginal. The cinematography is perfect. Jim Carey is excellent. Surely this movie is a comedy and it has it's fair share of funny moments however, the depth of this movie is what brings me back time and time again."
    },
    {
      "rating": "9",
      "text": "A fantastic movie with a interesting plot that makes you think, and a very good performance by Jim Carrey."
    },
    {
      "rating": "10",
      "text": "The Best Movie of 1990s. Jim Carrey gave a performance of his lifetime."
    },
    {
      "rating": "10",
      "text": "All you tools that don't have the brain power to understand the simples plot of The Truman Show should go back to your tool racks and rust. And for all you kids crying about there not being action in the move, it's because IT\"S NOT AN ACTION MOVIE!"
    },
    {
      "rating": "10",
      "text": "This is a movie about ideas. The drama is well crafted and the movies prediction to the ethics of modern media and reality TV is brilliant. There is much to think about with the themes and analogies this movie presents. The Truman Show is one of my favourites. HIGHLY RECOMMENDED."
    },
    {
      "rating": "10",
      "text": "Brilliant movie idea and a great performance by Jim Carrey how he did not win an Oscar for this suggests that perhaps they do have a thing against some comedians."
    },
    {
      "rating": "10",
      "text": "\"The Truman Show\" can truly be considered a cult classic. This is one of the best Jim Carrey movies to date, and even a fantastic movie period. Nothing short of a masterpiece."
    },
    {
      "rating": "8",
      "text": "This movie might be the trigger of all reality shows in television industry. Yeah, who knows? Only this one is the realest reality show ever. No script and no drama. But surely I don't wanna live like this. It's like being betrayed, right?\rWatching this movie made me think how God rules this world and the humans. How God tries to \"control\" Truman's life and finally gives up to his persistent will, which finally leads to the change of his destiny. Isn't it interesting? It's just like being given the primary secret on how to get what you really want. Great!!! I hope I can practice it in my life"
    },
    {
      "rating": "10",
      "text": "wow, some of these user votes have the most retarded, ignorant opinions. this is one of my favorite movies, and is a genius film if you think about it...and whoever thought that this was an action flick is a moron."
    },
    {
      "rating": "10",
      "text": "My favorite movie. This film silences even the harshest Jim Carrey critics. This man was robbed of an Oscar nomination for his performance in this movie. Great supporting performance by Ed Harris as well. This movie will really make you think and you won't be shy of things to talk about after you watch it. This is quite simply the most original movie I have ever seen. The greatest film of the 90s."
    },
    {
      "rating": "10",
      "text": "This movie is amazing and anyone who thinks oherwise is wrong... Jim Carey was amazing in it. The movie was easy to understand and follow."
    },
    {
      "rating": "9",
      "text": "A brilliantly made movie, with fun, suspense and even a little action. Jim Carry does a great job selling the role and is supported by great actors/actresses."
    },
    {
      "rating": "10",
      "text": "Jim Carrey may have more notoriety for his zany humor-driven titles like Ace Ventura or The Cable Guy, but they're all second to the authentic performance delivered in The Truman Show - a movie that in some ways reinvented reality TV and inspired other films to be made (ED TV).  The cast is excellent and the movie has a charm about it that is undeniable.  If you haven't seen this movie yet, add it to your list because it's one of the greatest films of the 90s.  Some may say of all time."
    },
    {
      "rating": "8",
      "text": "The Truman Show is an undeniably great movie. However, I feel the TV show aspect should have been kept a little more secret and only revealed at the end. It would have made a great mystery or rug pull movie. But The Truman Show we have is excellent anyway."
    },
    {
      "rating": "10",
      "text": "This movie is so awesome in every way. It manages to prove that a funny man can break our hearts (which would happen again in Punch Drunk Love with Adam Sandler some time after). This film has one of the most original story-lines from '98 and is written to perfection. The balance of originality and great writing, not to mention Carrey, isn't the only thing that delivers a power punch. It is the message, that is explained in such a manner that even the people not searching for depth in the first place can find it, that is amazing. The depth of thought that the writers went through to get to the theme that \"whatever world we are born in, we will instantly believe is real\" is astonishing. The Academy made big mistakes in '98: 1. Saving Private Ryan not winning Best Picture, and 2. The Truman Show not being nominated for Best Picture, Actor, Score and Cinematography (the first two getting a win wouldn't have been an upset to me). Basically, if you want a wholly original film that is funny, heartbreaking and thought-provoking, The Truman Show is one of the best picks."
    },
    {
      "rating": "10",
      "text": "This is my absolute favorite movie ever.  Jim Carrey is brilliant in a role that isn't slapstick comedy--I much prefer him here.  The movie is well crafted all-around, from the casting to the soundtrack.  The story is compelling and unique, drawing you into the artificial world Truman lives him.  Follow him in his journey towards knowledge of the truth!"
    },
    {
      "rating": "9",
      "text": "The figurine was simply perfect. The script, I should say that if you don't count the cliche's, so is too. The acting was amazing, but the scenario could have been better. The soundtrack would have been better if it wasn't for one single song that was bad. The skin of the film was bad. Like, really, really bad. The choice for the actors was great, if you don't count that they chose that actress to do Sylvia. She isn't beautiful enough to do a woman who makes a men fall in love with her at the first sight. But she was a great actress. The special effects (that were supposed to be bad) were really perfect, as was the make-up and the hair. And finally, the photography of this film was absolutely perfect."
    },
    {
      "rating": "9",
      "text": "This gripping film is not what it looks like, when you see Jim Carrey on the cover. This very emotional and profound comedy drama with this light provoking note between the lines is featuring Carrey's performance of a lifetime, a evil and mean Ed Harris and a memorable climax. Big cinema!!!"
    },
    {
      "rating": "9",
      "text": "An original, thought provoking, and deeply affecting movie; The Truman Show is not only funny, and emotionally draining; It correctly predicts a world gone crazy over reality television.  It's very smart, directed with unique style, and contains what is one of Carrey's best performances.  This movie also has the power to make you paranoid; even more so than The Matrix.  You'll feel great empathy for Truman throughout the whole movie.  He's a great character.  It's a great movie.  It's a classic."
    },
    {
      "rating": "10",
      "text": "Wonderful movie with a though. A though of many people lives. Good storyline, music, idea, actors performance and whole movie is amazing. One of those movies where you speak about it when it ends."
    },
    {
      "rating": "10",
      "text": "Weir's impeccable directing and the brilliant script give this film the deserving title of a true masterpiece. Carrey proves his versatility as an actor and the supporting cast help deem this a true work of art."
    },
    {
      "rating": "9",
      "text": "Plato's Cave from 20th (almost 21th) century. Cativant, acid, tense and very clever. Hard not feeling bad about truman and intrigued about entire movie."
    },
    {
      "rating": "8",
      "text": "\"The Truman Show\" dares to question the reality. It's original, complex, and philosophical. It manages to make you feel truly frustrated and claustrophobic.\r Perhaps many of us can relate to Truman as we live in a time of routines. We often live our lives without giving a second thought to the simplicity and meaninglessness of life itself. Our limited perspectives keep us from seeing. The lies we are told keep us from the truth. If we could push the boundaries of our reality, what are the odds that we'd face what Truman faced in the end?\r It was a joy to watch \"Jim Carrey\" as \"Truman\", it is yet another proof that Jim isn't just a comedian."
    },
    {
      "rating": "10",
      "text": "Proving that a blockbuster doesn't have to be big, brash, vacuous and wedged with a ton of eye-stinging special effects, The Truman Show is practically an anti-Event Movie. Instead of taking a low-brow/high-thrill approach to its ingenious idea, Peter Weir has given us a thoughtful, intelligent, wholly character-driven masterpiece. Nor is it just a great movie in its own right; it's a great mainstream movie. Watch it by yourself, take your girlfriend/ boyfriend or go with a bunch of friends, you'll enjoy it just the same. Like Titanic, The Truman Show is a rare multiplex crowd-pleaser that doesn't begin to insult your intelligence and, because of this, it more than makes up for big disappointments Godzilla, Lost In Space and Armageddon.\r Of course, the less you know about the plot the better, as this is an extraordinary experience from start to finish. It's the sort of movie that you wish Hollywood made more often: the perfect combination of a witty script (mercifully unhacked by gag-adding writers-for-hire), a refreshingly short running-time and a small principal cast so perfectly suited to their on-screen roles they might have been born to play them. Harris brings a controlled God- complex to the role of The Truman Show's creator/producer/director Christof and Linney excels as Truman's slogan-spouting wife. McElhone, meanwhile, has the difficult task of playing the plot-advancing, rebellious love interest who tries to convince Truman that it's all a lie. Yet, although their performances are faultless, these actors are constantly being eclipsed by the two real stars.\r The first is the bizarre premise. Truman Burbank (Carrey) has grown-up in the artificial town of Seahaven, a prefab suburban nirvana jammed in a happy timewarp sometime between the '50s and the '90s. Five thousand mini-cameras (hidden in plants, car radios, shirt buttons and the like) survey this mammoth television sound stage, following every aspect of Truman's existence and broadcasting it 24 hours every day to an eager world. Actors play his friends and relatives, while Christof (who gets to utter such lines as \"Cue the sun\"), manipulates this goldfish bowl-style micro-reality from an office concealed behind the Moon. It's only after a series of on-set accidents (a spotlight falls out of the sky and Truman tunes into a radio frequency instructing the show's actors), that our hero starts to question the world around him.\r Naturally, the impact of this concept would be lessened without a believable central character, and Carrey turns in the performance of his life. Forget his rubber-faced zaniness in comedies like Ace Ventura and Liar Liar. It doesn't matter if you've never liked him before. Yes, there are still traces of the OTT comedian in the character of Truman, but Carrey approaches his role with gentle, honest kindness, creating a real human being with real emotions, who's about to discover his life has been a carefully-orchestrated lie. It's a powerful, masterfully understated and moving performance, veering perfectly between moments of humour and heart-tugging seriousness. Carrey deserves full credit for his part in making The Truman Show the huge success it so evidently is.\r Clever, funny, enjoyable, this is not just the best mainstream comedy of the year, it might rank as the best of the last five years. With a multitude of subtexts, social comment and satirical sideswipes, it's a beautifully-crafted, emotional piece with an original heart and an irresistible storyline. It's so good you don't want it to end. Films this great don't come along often. Queue to see what is surely one of the defining movies of the '90s.\r Jim Carrey proves he has more than one acting dimension in this original, clever tale of junk-culture excess. The Truman Show makes every other block-buster look empty and stale. Hollywood take note: intelligent film-making can work. More please..."
    },
    {
      "rating": "9",
      "text": "One of the best ways to represent the postmodernism\rThe best movie that Jim Carrey could ever have\rAnd that saying much. I enjoyed it watching it, im sure im gonna to watch it over and over."
    },
    {
      "rating": "9",
      "text": "There really isn't a movie quite like The Truman Show. Funny, thought-provoking, heartwarming, a commentary on consumerism and society, charming, and deep are just some of the phrases I would use to describe this one-of-a-kind movie. Easily one of Jim Carrey's best performances. Andrew Niccol's script and Peter Weir's direction go hand in hand. The cinematography is so subtle that you almost forget about it. The Truman Show is almost a perfect philosophical film, and one I highly recommend."
    },
    {
      "rating": "10",
      "text": "Wow, I've just seen it again in 2016.\rThis movie aged very well, and this is a clear indicator of the quality.\rGood script.\rGood performances.\rGood screenplay.\r26 years later and -as the good wines- it gets better with time."
    },
    {
      "rating": "7",
      "text": "The plot may rarely override itself in some moments, but nevertheless \"The Truman Show\" is a funny but sad movie that uses wonderful performances by Jim Carrey and innovative direction from Peter Weir as its main fuel."
    },
    {
      "rating": "10",
      "text": "One of the best Jim Carrey movie ever made. This movie shows that Jim Carrey is more than just the wacky guy off of Dumb & Dumber. He can act and he can act very well in dramatic movies."
    },
    {
      "rating": "10",
      "text": "Hands down, this film rocks. The world created for Truman and the way they movie plays out is truly amazing. I love seeing films like this make their way into theaters and into our hearts."
    },
    {
      "rating": "9",
      "text": "Magnífica atuação de Jim Carrye, em um fantástico filme com uma ótima história"
    },
    {
      "rating": "9",
      "text": "A brilliantly written and directed dramedy, featuring easily the best performance Jim Carrey has ever committed to film."
    },
    {
      "rating": "9",
      "text": "Amazing movie! Other then Eternal Sunshine my favorite Jim Carrey movie ever. Carreys acting, the direction, the story and just about everything else in this movie is fantastic."
    },
    {
      "rating": "9",
      "text": "Taking reality TV taken to its ultimate extreme everything Truman Burbank has done since birth has been seen live by a worldwide audience of millions. Unfortunately for Truman he is unaware of this as he lives inside a giant Hollywood dome containing a made for TV town. Everyone in his life, his friends, his neighbours, even his wife are all actors hired by the shows creator.\r Jim Carrey is unusually reserved, but brilliant in the title role importantly making Truman likable so that we really begin to feel for him as the movie reaches its climax. Part satire, part comedy and part drama The Truman Show is one of those rare movies that takes an original, intelligent and interesting concept and truly makes the most out of it. It is rare for a film to entertain whilst also making you think but this is one movie that certainly manages it."
    },
    {
      "rating": "9",
      "text": "Just absolutely love the movie. It is a weird one that really makes you think, but as Truman begins to get wise to everything, it is hard not to root for him. The drecting was great, Jim Carrey was funny and great, and all of the supporting actors did well. The movie is certainly funny, but is more than just a comedy."
    },
    {
      "rating": "9",
      "text": "In the world of Jim Carrey, all he does is basic stuff. Making people laugh at his comedic skills, but with the Truman Show, things are beginning to change for him and his moviegoing industry. Okay sure this was also comedy, but it's by far more than that."
    },
    {
      "rating": "9",
      "text": "The whole concept of this movie is just amazing. It's an original idea that is developed perfectly. The acting and cinematography are both extremely well done. In general, this is an all around great movie and one of my personal favorites."
    },
    {
      "rating": "10",
      "text": "By far the best screenplay I have ever seen, and Jim Carrey does the performance of the year. It's the one film that you actually want Jim Carrey to go crazy. Laura Linney was surprisingly dazzling in her performance and the events happen in the smartest way possible. This film is absolutely beautiful."
    },
    {
      "rating": "2",
      "text": "This film, in my opinion, was nothing more than a steaming pile of garbage. Jim Carrey should have stuck to what he does best, and that is, of course, comedy. He simply doesn't work as a dramatic actor. The rest of the cast sucks, too. The only thing that saves this from being a total disaster is Peter Weir's directing ability. But, even he was hampered by the terrible script."
    },
    {
      "rating": "10",
      "text": "An amazing film with and with a great ending, a rare thing.The writing is great and I never knew what was going to happen next and when it did, it was an awesome thing to see.Jim Carrey is most definitely a LEGEND!!!Good Morning, oh and in case I don't see ya. Good Afternoon, Good Evening and Good Night. :D"
    },
    {
      "rating": "5",
      "text": "I did not like the movie because there was not much action. I was kind of funny. It was boring and did not make much since. I got lost a few times in the movie and did not understand what was going on."
    },
    {
      "rating": "6",
      "text": "I didn't really care for the movie all that much. I got lost quite a few times during the movie. But they changed scenes a lot more than I had expected they would, which that's where I sort of got confused. And didn't understand the point in the movie."
    },
    {
      "rating": "5",
      "text": "I didn't like the movie at all. It wasn't interresting at all. It wasn't really fun at all. All I liked a bout was the funny Jim Carrie. How he was in the film of filmen the videos."
    },
    {
      "rating": "8",
      "text": "I'm usually an action/sci-fi fan, and don't give much a care about movies outside of that genre, save for war dramas. However, this one proved to be quite an exception. I just get lost in this film, absorbed in it like nothing else."
    },
    {
      "rating": "2",
      "text": "An absolute bore, sure the performances were goodbut the movie just dragged on."
    },
    {
      "rating": "0",
      "text": "An excruciatingly empty film with the most annoying characters, script and pace, surely making this movie one of the worst I've ever endured. The more simplistic a movie gets, the greater it's general acclaim? Must be... Should be listed under 'Horror'."
    },
    {
      "rating": "8",
      "text": "Quite brilliant quasi-satire that's well-directed and features a great Jim Carrey performance."
    },
    {
      "rating": "7",
      "text": "One of the rare occasions when Jim Carrey is actually good as an actor, and the supporting cast fit in their  roles really well too. The director and  writer made a movie that has the right amount of comedy, drama and social-criticism. Recommended if You are interested in an entertaining and rather original movie."
    },
    {
      "rating": "8",
      "text": "The story is about a man whose life is a TV show, everyone knows that, except himself. Later he realizes it and struggles to end this show. The main topic is a problem of choice: to live your life as it is even if you are not satisfied with it or risk everything to change things around. Good and original plot and great actors. A must see."
    },
    {
      "rating": "3",
      "text": "I've always been a fan of Jim Carrey's movies since i can remember,\rand the Truman show is critically acclaimed which i should like automatically right, NOPE.\ri admire that the story is creative and coming from high imagination but the problem with a high imagined movie is the end,\rbecause with your imagination you can create a perfect movie world with perfect events,\rbut the hardest thing to do is to close this world with an eventful plot, unfortunately the end in this movie was so bad,\rthat it actually pissed me off, Truman was born and raised in this fake world, so he have no idea about the actual real world,\rso you'd think he's very excited and anticipated to get out but a huge character development was missing from the plot and ending the movie like this with a fake smile \"good morning, good evening and goodnight\"\rwas the worst ending to a movie i have ever seen.\rthe end actually left me speechless for about 9 minutes."
    }
  ]
}