{"id": 116, "title": "The Harder They Fall", "starring": ["Jonathan Majors", "Idris Elba"], "runtime": 139, "genre": ["Western"], "description": "Gunning for revenge, outlaw Nat Love saddles up with his gang to take down enemy Rufus Buck, a ruthless crime boss who just got sprung from prison.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/su9WzL7lwUZPhjH6eZByAYFx2US.jpg", "categories": {"plot": 7.142857142857143, "acting": 7.5, "ending": 7.625, "soundtrack": 7.714285714285714, "cinematography": 7.25, "familyFriendly": 3.0, "funny": 7.4, "action": 6.125}, "reviews": [{"rating": "8", "text": "The comparisons to Tarantino are inevitable: A revered genre re-imagined, copious casual violence and snarky dialogue. The big difference is that all of the main characters are Black and based on real people who roamed the Wild West. The plot follows a young outlaw (Jonathan Majors) who’s out for revenge, which also leads to 2 gangs fighting it out. The cast is loaded with exceptional talent doing great work, including Idris Elba, Regina King, LaKeith Stanfield, Delroy Lindo and R.J. Cyler, who provides the film’s few humorous moments. This is an impressive first-time feature for director Jeymes Samuel (also known as British singer/songwriter The Bullitts). His mastery of staging and his unique visual comments show a surefire flair for the job. His script succeeds in making almost every character sympathetic, even though they rob and kill with impunity. It’s always interesting to see a Hollywood genre reworked and this Western hits a snappy and entertaining new angle."}, {"rating": "9", "text": "What brings freshness to this homage to the spaghetti western is a mostly African-American cast. Why not? The plot gains momentum from the first minutes, maintaining consistency, and with an explosive climax. It is enjoyed as it is, and it is a pity that it will not be seen in theaters."}, {"rating": "6", "text": "The Harder They Fall never quite clicked with me. Some interesting directorial choices and fun western aesthetics withstanding, I found it to drag quite a bit, and I never fully bought into the story. Finishes strong though!"}, {"rating": "5", "text": "Pros: good cinematography, good acting given what they had to work with, good action scenes.Cons: dialogue is garbage, longer than it should be, film doesn't know what it wants to be."}, {"rating": "0", "text": "It sucks!!!................................!!!!!!---!!!!!!!......it blows!!"}, {"rating": "3", "text": "It's hyped up and it does not deliver, it's supposed to be a western then they cut into a musical number which is pretty stupid if the movie is supposed to be a western but then it feels like it's a movie set in this year 2021 not back in the late 1800s or early 1900s, movie is made for this generation and not for lovers of movies, weak directing producing writing and acting, especially when they have really good actors in the movie and the music I don't know if there confused or didn't know  what they were making cause it just sounds sometimes so out of place and irrelevant to the movie and scene. All in all piece of **** movie when it could of been a great movie."}, {"rating": "3", "text": "First 5 minutes cool. 2 hours of jarbled dialogue. Last 5 minutes cool. Just giving a real review instead of jumping on Jay Zs knob. Nothing special. Compared to the hateful 8 or Django unchained. I don’t know what to call this. Not even sure if this was a comedy or not"}, {"rating": "1", "text": "Just a ridiculous movie from the dialogue, to the acting, to the action. Do your eyes a favor and save them from rolling for an agonizing two hours."}, {"rating": "2", "text": "Exhibits colorism in a cast member, scenes that don’t fit the plot, makes a failed attempt at riding a classic western style while cramming strong unreinforced odd soundtrack into what turns out to be an upsettingly lost and distasteful picture."}, {"rating": "3", "text": "Just another intelligence-insulting garbage from Netflix.The Age of Idiots is upon us."}, {"rating": "9", "text": "Great Action!   A little over the top but loved every minute!   Standouts were Regina King and  Lakeith Standsfield!   Must watch!"}, {"rating": "3", "text": "The Harder They Fall could've been a fascinating look at the real life black cowboys of the wild west, instead we get a silly MTV inspired cartoon - 3 stars for the historical stuff it's based on."}, {"rating": "10", "text": "It's an excellent movie, with an impeccable cast, with an amazing script. Everything in this movie fitted well and turned out well, I'm looking forward to a sequel. They could put this movie on for 20 hours that I would watch without sleep."}, {"rating": "6", "text": "Well directed. Excellent acting. A cowboy movie with an all black cast. That’s an interesting take on the genre. My problem was with one scene. After a clever remark relating to the horrible Dredd Scott decision (Supreme Court decision that ruled blacks were not citizens),  the only white people in the movie, union soldiers, are gunned down in retaliatory glee. 250,000 union soldiers died to bring an end to slavery. That point seems lost on the movies’ producers and cast."}, {"rating": "8", "text": "Who doesn't love a bloody revenge tale? If it's set in the wild, wild west, then that's even better. Nothing can be more entertaining than shoot outs, saloons, and outlaws. The Harder They Fall, which opened in limited release last Friday and premieres on Netflix next week, has it all in spades. I took a trek to the theater to catch this stylish Western with a stacked cast; and here's how it went down.The plot of The Harder They Fall is relatively simple and like most Westerns it centers on one man's quest for revenge. Nat Love (Jonathan Majors) is on a quest to avenge the brutal murders of his mother and father. Love has to track down Rufus Buck (Idris Elba) and every member of his gang, which includes the brutal and devious, Trudy Smith (Regina King) and the quickdraw Cherokee Bill (LaKeith Stanfield). Love's crew of outlaws, which has otherwise been preoccupied with robbing bank robbers, sets out to find Buck after he has been busted out of prison. Bloody hijinks ensue. (Side Note: I kept thinking about bloody Tarantino movies - there may be some inspiration from those films)Jeymes Samuel directs this stylish and anachronistic Western filled with an all star cast. While this is Samuel's first major motion picture as a director, he has a background in music and it shows. On top of that, Jay-Z is involved as a producer. The bona fides of Samuel and Jay-Z are front and center with a top notch soundtrack that infuses each scene with cool energy. Although the plot is pretty basic, the dialogue has an amount of wit and swagger that bring such fun to this film. The director has been able to bring modern sensibility to the old West through the language, casting and production values. The technical achievements here in the costumes, production design and sound only make the film that much more enjoyable. There are a few lulls in the action here and there, but for the most part, it's a wild ride that doesn't let up.I'll note that this cast is a who's who of Black Hollywood. Let me run this down for you right quick. Jonathan Majors keeps getting great roles and knocking them out of the park. It is good to see him in the lead, and he does a good job centering this film. The specter of Idris Elba looms large throughout. He is perfectly cast as Rufus Buck and gets to be the menacing presence behind the curtain. Regina King kills it in this fun role. She gets to kick butt and take names. I would not want to meet her character in any dark alley. Then, LaKeith Stanfield brings his swagger and cool to Cherokee Bill. These four are highlights, but Delroy Lindo, Zazie Beetz, Deon Cole, RJ Cyler and Damon Wayans, Jr., each, get great moments too.Ultimately, The Harder They Fall is a great Western that has fun music cues, a cool cast, and epic fight scenes worth your time. This is an easy big box of popcorn, especially when it debuts on Netflix."}, {"rating": "6", "text": "A very stylized western with an all-black cast that is as entertaining as dull. 'The Harder They Fall' walks the thin line between being derivate and being authentic.I had a good time watching it, but there were very boring moments throughout it. Of course, the film is very tarantinesque, but it feels like there's a lack of substance, especially with the development of the characters.Nevertheless, I appreciate new takes on genre films like this one."}, {"rating": "10", "text": "Great movie. The actors did a magnificent job and the soundtrack is amazing. Definitely recommend watching."}, {"rating": "9", "text": "One of the best westerns in recent years. top notch cinematography, witty and entertaining dialogue with a star studded cast. Just a tad slow in the middle but then ramps up all the way to the end."}, {"rating": "0", "text": "Fantastic actors.. but the unrealistic action scenes were impossible to overcome.. and not enough time to get into the terrible dialogue."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "1", "text": "The story was mediocre. The characters all seemed to be dumb whick points to poor writing. The action was kind of ridiculous. However, what really got the low score was the reverse racism. A simple test is if you reverse the colour of skin, will the new plot be acceptable. If it's not then you shouldn't do it. I don't think racism is acceptable in any form."}, {"rating": "10", "text": "The Harder They Fall for me is Tarantino's alternate/version 2 of Django Unchained, from the style, the choreography, cinematography, even music really gives me Django's vibes, though it's nowhere near as good as Django, The Harder They Fall is perfect as their own, it's an impressive film with a powerful performance by all the cast, the movie is successful on each of every character, making me care even the one's that doing nothing, overall, The Harder They Fall is an incredible revenge movie, worth 2 hours and 19 minutes."}, {"rating": "9", "text": "Great storyline that grabs you from the very beginning and entertains you throughout. And it has very memorable characters and good action scenes. A really good movie."}, {"rating": "10", "text": "Great movie…great storyline. Superb acting…Great soundtrack. I have watched this twice so far…trying to get in all of the great dialogue. This movie delivers!"}, {"rating": "9", "text": "I loved how they gave a modern spin on an old genre. The music choice was great as it differentiated the film from the others in the genre. The cinematography was amazing and the set design was top notch. I loved how some of the camera work synced up with the gun shots. The only thing that keeps this movie from being a 10 is the dialogue. That is something that I think they should've kept more consistent, some characters talked with a western drawl while some talked like someone would today. Overall must watch as it is like nothing else."}, {"rating": "10", "text": "Amazing, love the cast. Regina king shines in this. A realistic storyline told in a beautiful artful way."}, {"rating": "10", "text": "Best movie 2021 touch down; this should have had a 100000000 rating no movie in the united states beat this so wake up folks time to open ur eyes to the new south"}, {"rating": "7", "text": "The Harder They Fall (2021) is a western film with a complete Black cast as the main characters portraying real people who existed back in the day in a fictional story. It's a tale of revenge split between the outlaw group whose leader is hunting the people that did him wrong and the outlaw group whose leader did the wrongdoing. As a whole in terms of story, it's nothing new, but where this movie shines and gives you a fresh experience is in its execution. From the getgo, you can tell that this is a passion project for Jeymes Samuel, the director and co-writer, who wanted to give a unique or different feel to a well-known genre. The madlad also did the soundtrack and worked tightly with the cinematographer and editor so that his clean and polished vision of westerns can be properly brought on to the screen. The film is oozing with style and slickness as all the technical elements synergize together properly and seamlessly flow. It looks great and sounds great, and the odd mix of hip-hop and classic western music works surprisingly well. The main attraction of the film, though, is the amazing cast. Idris Elba, Jonathan Majors, Lakeith Stanfield, Regina King, Zazzie Beats and the rest of them were on top of their game and since they were inhabiting colourful/interesting characters, it was an absolute blast watching them go at it. Couple that with fun and often interesting dialogue and I could watch these characters interact with each other for a long time. While not a full-blown action film, whatever thrilling scenes it did have were entertaining and bloody. The pacing can be slow for long stretches, though, as you go through the 140 mins runtime while things are being set up but it's not boring. I was enjoying the characters a great deal regardless of whether they are shooting each other or are just conversing. In fact, the first 40-50 mins or so were amazing. I was hooked and was loving the larger-than-life feel of some of the characters as well as the visuals and sounds accompanying it. It's a pleasure in a Home Theater.  However, where the movie faltered for me was in the second half where it lost some of that steam and intrigue. The biggest issue for me was that the writing couldn't balance all the main characters well and some remained on the sidelines throughout as well as the expectations that get built up early on and not being delivered fully. There was also a lack of Idris Elba that kinda annoyed me and I was so wishing that the creators could somehow channel Tarantino to have long stretches of dialogue for key scenes. I kinda wish they focused a bit less on the romance and more on the smaller characters as well as the personal vendetta. Also, the final shootout, while thrilling and enjoyable, did ask for a lot of suspension of disbelief. The stormtrooper aim got ridiculous at points. And had the movie ended that way, I would have been disappointed but thankfully it had a trump card that was played wonderfully in the end and brought it home nicely even if I wish it was given a few mins more. All in all, this was a welcome surprise. I honestly wasn't expecting to get something fresh from a genre that has been done so many times but here we are. Sure the film has its faults that keep it from being a truly great experience for me but it is still damn good and I'd recommend it without a second thought. It's on Netflix, so you can easily access it. And if I were to rate it, I'd give it a 7.8/10."}, {"rating": "3", "text": "The irony of the film made it watchable. The premise of a utopian city run by a specific race, through gangs, crime and violence is too close to reality, and the obviously predictable result is clear, with any alternative reality being a power trip."}, {"rating": "7", "text": "The Harder They Fall is a solid western movie. The cinematography is excellent, the characters are interesting and the story was good. Worth a watch."}, {"rating": "3", "text": "Music took me out of the time period.  Overly long shots on faces that seemed to say \"hey look at this actor/actress!\" rather than give a feeling about the characters. Kind of a lame ending.  It's like the movie wanted to be \"cool\" instead of good but succeeded at neither."}, {"rating": "6", "text": "Stylistic. Strong cinematography and performances. Subverts genre conventions and presents an alternate reality that may challenge expectations."}, {"rating": "8", "text": "Stylish western, with a great cast. Had an old fashioned 'feel', mixed in with a touch of Quentin Tarantino. Many bigger than life characters and a number of memorable, drawn out scenes throughout. Good watch."}, {"rating": "6", "text": "I really liked the first part of the movie and how it looked and all the characters, but the end part of it felt so simplistic and loaded with cliches from past that I felt it couldve been better if story would be different at end. For example, classic cliche was when Zazie's character just went to search for Elba's character alone, like it would not be predictable, that they would not fall for it that she is going there to just buy saloons or whatever. Anyway, I enjoyed the movie style etc, but did not like the ending."}, {"rating": "7", "text": "É um bom filme, com um bom elenco, que por vezes nos deixa na duvida de quem vai ou não morrer e que tem um bom final. Sem duvida um filme que vale a pena ver"}, {"rating": "6", "text": "I'm not the type of person who likes to highlight this kind of thing, but it was inevitable because I find it incredible that what is most talked about about this film in terms of professional reviews, is that it's a western starring black actors, and was directed by a black British director.For an industry that keeps saying it doesn't see people's skin color, I find it ridiculous that it's something they need to emphasize, showing that it's a lot of what they see.Now speaking of the film, I must mention that the influences of Tarantino and Sergio Leone are more than notorious, although it managed to retain its own identity. That was a positive thing.The presentation is straightforward, although its narrative and structure are not always concise.There are points where the dialogue feels too elaborate, lacking in better fluidity, while the director also fails to create a really interesting tension until the very last act. An understandable mistake for a beginner.The Harder They Fall is not a western that is trying to invent something new at all, nor does it ever show those intentions, but it really does open a very interesting door for variants of this type of stories to be approached more quickly, and by more experienced filmmakers."}, {"rating": "8", "text": "It is certainly a bit slow in terms of pacing, but the cast compensates it and really elevates the film."}, {"rating": "5", "text": "(Mauro Lanari)The more the pop star Jeymes Samuel insists on making his directorial debut something unusual (reggae and split screen in a western) and the more vice versa he emphasizes the paucity of the content. When, on the other hand, he lets himself go as in the conclusive twist, he finally conveys some emotion."}, {"rating": "9", "text": "The Classic western vibe with such brilliant soundtrack and usual stylized cowboy stuff and awesome action its a good western movie, the cinematography is pleasing, The music is just masterpiece. The story is \"usual\" decent and the execution is good although felt little slow at middle , The character entries and the music combo is just awesome, The starting killing was just dark and cold and then the train sequence with the team introduction it was badass, The straight to the point sequences and the no drama stuff between lead and his revenge made surprising with the bank robbery and then the ending with such 30 mins mayhem the stylized killings and the equals fight, The ending one on one with the twist although predictable but the acting is so damn good the scene felt amazing and the revenge felt unsatisfyingly satisfying. Overall it was just simply awesome western with brilliant sound and classic style!"}, {"rating": "8", "text": "Really enjoyed The Harder They Fall, but it's far from a perfect film.I really enjoyed the characters and the ending. I would've liked a bit more development, but what we got was \"enough\". The 2+ hours run time was already pushing it a bit and most westerns are not very good when they linger in the first place, so maybe a bit better editing could've made the difference for me.Lots of engaging statements made. Idris is always great to see, but especially in the role of the antagonist. Jonathon majors work continues to impress. Regina King seems to bring her A game so effortlessly these days and is so on top of her craft at this stage of her career. Delroy has a great performance here; he always has a solid vocal and facial personality on the screen. Warming up to LaKeith Stanfield's work; showed some interesting versatility as secondary antagonist here.Film has some interesting visuals. The use of color, camera work and framing were stimulating and kept my attention.All and all, I really enjoyed it. 8/10"}, {"rating": "10", "text": "An amazing movie. Loved the whole scene, great acting on all sides. 2nd time watching this movie. Sawit with my white best friend."}, {"rating": "10", "text": "Movie of the year. Casting was great. Story was great.little to no curse words. I don't remember hearing the N-word. The writers did a Amazing job writing the script. The Director did a great job. Actors"}, {"rating": "3", "text": "Netflix, zniszczył western, jako gatunek filmowy. Nie no to już kolejny film który jest po prostu słaby po Red Notice."}, {"rating": "10", "text": "IT WAS JUST WHAT I EXPECTED IT TO BE A SUPERB AND OUTSTANDING MOVIE... WHAT A TREAT TO SEE SOME OF MY FAVORITE ACTOR'S AND ACTRESSES IN IT... IDRIS ELBA AND REGINA KING❤️"}, {"rating": "5", "text": "Cool cinematic effects, though lacks action (takes nearly 2 hours for the action to happen)"}, {"rating": "9", "text": "The Harder They Fall was a mix between Tarantino’s Django and an all Black cast Tombstone. The cast, soundtrack and cinematography with moments of quick wit made this an instant favorite for me. Idris was bad enough to make me dislike him. Regina is just dayum wcw. Jonathan shined in his role. Everyone did their part to bring the Black cowboys to life. I hope they do a sequel."}, {"rating": "10", "text": "Great movie loved they way each character was based off of a real African American or African American/native American cowboy or cowwoman from the past."}, {"rating": "10", "text": "Great movie. Nostalgia of a 90's Western (Tombstone or Posse) with a contemporary soundtrack. Excellent cinematography."}, {"rating": "8", "text": "First I was a bit sceptic. Like with every Netflix made movie. But I really liked the old school mixed with new school Western focus on PoC gunslinger approach. Sometimes a bit over the top gore but hey. Not bad and an amazing cast. I also did not see the end coming. Nice few twists with the brother story and the early death of the poor fast shooting guy."}, {"rating": "10", "text": "Loved it! Cinematic excellence! Watched it a few times with different people and got something great each time!"}], "recommendations": ["bone_tomahawk", "top_gun", "the_magnificent_seven", "indiana_jones_and_the_temple_of_doom", "bad_times_at_the_el_royale", "the_fifth_element", "true_grit", "news_of_the_world", "hell_or_high_water", "backdraft", "jackie_brown", "triple_frontier", "rocknrolla", "blade_of_the_47_ronin", "blackhat", "the_three_musketeers", "copshop", "rush", "drive", "the_equalizer_2", "avengers_age_of_ultron", "hanna", "django_unchained", "king_arthur_legend_of_the_sword", "lawless"]}