{
  "id": 1077,
  "title": "The Starling",
  "starring": [
    "Melissa McCarthy",
    "Chris O'Dowd"
  ],
  "runtime": 103,
  "genre": [
    "Drama"
  ],
  "description": "A woman adjusting to life after a loss contends with a feisty bird that's taken over her garden — and a husband who's struggling to find a way forward.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gPkaPGNbjZCeRurSYGi0JD63DBa.jpg",
  "categories": {
    "plot": 4.5,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 4.666666666666667,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "3",
      "text": "The concept of this film is as absurd as you’d expect…healing thru an avian friendship. Melissa McCarthy and Chris O’Dowd play a happy couple until an unfortunate event devastates their lives. While he struggles in a psychiatric facility, she starts to face her grief with the help of an especially aggressive bird in her garden. Although their performances are acceptable, the only bright spot is the veterinarian, played by a charmingly amusing Kevin Kline. Otherwise, the narrative is painfully predictable, while the dialogue doesn’t add any  depth. The hokey symbolism that parallels her relationship with the bird is a contrived and downright dumb attempt that feels like it’s dragging the bottom of Hallmark Channel rejects."
    },
    {
      "rating": "4",
      "text": "For a film that in a way is trying to instill optimism, its very nature transforms it into a story in which its entire emotional arc is based on the sentimental manipulation that it can provoke in the viewer.That's not new, hundreds of dramas do it, but when you're doing it with a comedic tone that also includes a lead actress who's recognized for her work in comedy, you provoke that a storyline dealing with depression after the death of a son, feels like many things, except genuine."
    },
    {
      "rating": "6",
      "text": "Es una película de Netflix con Melissa McCarthy; la trama es simple y las actuaciones son decentes; es bastante olvidable."
    },
    {
      "rating": "7",
      "text": "Why are there so many bad reviews about this film? Jesus Christ! It's a feel-good movie. Sometimes the plot is predictable but there are plenty of funny moments to compensate for that. The music is fine. The acting is also fine. And the emotional moments are, you guessed it... also fine. So if you're going to black out a great movie, then you first have to learn that movies also remain movies."
    },
    {
      "rating": "9",
      "text": "We need more movies like this. It deals with loss and how difficult it can be to continue daily living and yet still maintain hope. Well acted. Great music. Moments of laughter. Highly recommend."
    },
    {
      "rating": "7",
      "text": "Esta muy bonita, obviamente chille, tanto así que ya ni la quise acabar de ver"
    }
  ],
  "recommendations": [
    "thoroughbreds",
    "silver_linings_playbook",
    "closer",
    "20th_century_women",
    "21_grams",
    "her",
    "while_you_were_sleeping",
    "the_king_of_staten_island",
    "secretary",
    "me_before_you",
    "trainspotting",
    "manchester_by_the_sea",
    "blue_valentine",
    "i_feel_pretty",
    "the_good_shepherd",
    "the_big_sick",
    "every_day",
    "marriage_story",
    "the_rover",
    "in_bruges",
    "suburbicon",
    "white_boy_rick",
    "jojo_rabbit",
    "the_descendants",
    "a_simple_favor"
  ]
}