{"id": 2041, "title": "The Princess Diaries", "starring": ["Anne Hathaway", "Julie Andrews"], "runtime": 115, "genre": ["Comedy", "Family", "Romance"], "description": "A socially awkward but very bright 15-year-old girl being raised by a single mom discovers that she is the princess of a small European country because of the recent death of her long-absent father, who, unknown to her, was the crown prince of Genovia. She must make a choice between continuing the life of a San Francisco teen or stepping up to the throne.", "releaseYear": "2001", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/wA4lgl8gmoICSShviCkEB61nIBB.jpg", "categories": {"plot": 6.166666666666667, "acting": 5.666666666666667, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.666666666666667, "funny": 7.545454545454546, "action": 5.0}, "reviews": [{"rating": "8", "text": "Just a great movie that really shined all around. It was just funny and sweet. There isn't much more to say than it was pleasant and charming to watch. The cast was great!"}, {"rating": "6", "text": "Entertaining movie with a good plot and some funny scenes."}, {"rating": "8", "text": "This film revolves around the problems of succession to the throne of a fictional European micro-state called Genovia, which was probably inspired by Andorra and Monaco, I guess. The country has been ruled by the Renaldi (almost Grimaldi) dynasty but the succession now depends on an American teenager, who does not know that she is a princess and was not raised for such.The plot has been well thought out and has lots of fun situations. Obviously, a situation like that of the movie (a princess who does not know that is a princess) is impossible. They know that they are royals, even if they live in anonymity (very common in countries that were monarchies but they ceased to be, such Portugal or France). But its still humorous, and the way the situation is explained is almost convincing. Almost because I don't understand how Mia never discovered her true blood before her grandmother came to visit her. That seems quite illogical for me, but... The film puts emphasis on some things that correspond to real life. One of them is the need to prepare the future king, giving him the education and training indispensable to the position he will have. Mia makes a tremendous effort to learn, with successive mistakes that delight the public. Its to die for laughing but it also shows how difficult and demanding it really is. Another point that I saw and corresponds to real life is the public examination that is currently subject to the royal families through the mass media. If a king takes a false step, however small, this step is inflated by the media and quickly creates a crisis. But the central message of the film lies in never forgetting our origins, or the people who were part of our life before we reached the pinnacle. This morally edifying message lacks to many so-called \"plebeians\" who, attaining fame or fortune, soon forget where they came from.This is, I think, the work that pushed Anne Hathaway on the path of fame, and justly. The actress showed talent and ability to explore the psychological dilemmas of her character. Julie Andrews also looked good in the role of queen, though she did not explore much of that division between the public figure and what she is in private. It would make her character more interesting. Hector Elizondo plays a curious part, I never realized what he really is. Driver? Security chief? Chief of Staff? Queen's lover? All mixed up? The support cast also did not look bad. The jokes were very well thought out and were well framed in the film.This is a good example of what I call \"fairytale movies\". But, unlike other films where anyone can be a prince, Mia has always been a princess by right, she just didn't know it. The funny about this film is the teenager's difficulties in dealing with it. It's a good movie for the whole family, with good jokes and interesting moral messages."}, {"rating": "10", "text": "Hilarious teen flick, with welcome performances from newcomer Hathaway and return of Julie Andrews who is perfection as a queen. Lily is my favorite character. \"No YOU, I don't even KNOW you!\" XD"}, {"rating": "1", "text": "Where was the swearing and sexual innuendos?!?! Seriously, this movie was terrible. How any particular group of people, including 10 year old girls, can sit through movies like this astounds me."}, {"rating": "4", "text": "some princess movies are just so stupid to watch these days . but this one was okay as i can see i loved it when i was little . this is just fot 5 or 3 year olds . Grade C"}, {"rating": "3", "text": "A young, everyday girl discovers that she is part of royalty in Garry Marshall's 'The Princess Diaries', the Disney film where a young girl goes through the journey of how to fit in to the royal lifestyle and juggle her typical high school life. Anne Hathaway stars as the young Mia Thermopolis who is told that she is the granddaughter of the Queen of Genovia, Queen Clarisse (Julie Andrews) on her 16th birthday. When she finds out, she begins to embrace this life, and start getting herself a makeover. Throughout her journey, it seems that things back in school is getting difficult, her friend Lilly (Heather Matarazzo) begins to resent her, for some reason, but once she is told, she gets excited for her as well. Also, her love life doesn't get any easier, with the media constantly harassing her at every moment since she qualifies as a celebrity since being a part of royalty. I could go on and on discussing what happens in the film, but all I can say now is; it's unabashedly sentimental and charming in its own right. But, the screenplay written by Gina Wendkos, adapted from Meg Cabot's \"The Princess Diaries\" novel, doesn't allow any realism or character. Everyone here seems like a fictional cartoon character stereotype. You even have teen pop star Mandy Moore playing the school bully, who even pokes fun at Mia, after her makeover. No actual bully would do this, that I know of, but it's just the filmmakers' attempt to make her character less sympathetic. 'The Princess Diaries' is a colossal failure for a fairy-tale attempt of a story. There is nothing in this film that makes you want to see it. Hathaway and Andrews have fun in their roles, and they play off each other's charm really well... but that isn't enough to say that this film is funny and warm enough to recommend."}, {"rating": "3", "text": "De no ser por Anne Hathaway, esta película pasaría sin pena ni gloria de lo sonsa y aburrida que es."}, {"rating": "8", "text": "Anne Hathaway's charm was very entertaining."}, {"rating": "9", "text": "What a great movie for young girls and grown ups alike!  Good clean comedy is very refreshing!!!  I would recommend this movie to anyone wanting a good heartfelt comedy!!"}, {"rating": "7", "text": "A marvelous fairytale through and through. The Princess Diaries is a warm film, heralded by the memorable debut of Anne Hathaway accompanied by Hollywood-great, Julie Andrews."}, {"rating": "7", "text": "The movie is good. Manages to wring some originality out of its fairy-tale plot. It is an ideal family entertainment that doesn't deserve to be viewed on a critical level."}, {"rating": "6", "text": "â"}, {"rating": "3", "text": "A recycled plot along with a string of other cliches make for a film that's a one-trick pony. Princess Diaries is only here to make pre-teen girls squeal, and that's all it does."}, {"rating": "8", "text": "I thought I was highly entertaining and humorous! Wholesome family entertainment we shared by all! A wel thought out comedy romance that only Disney could do!"}, {"rating": "7", "text": "I really liked this. Loosely based on the books by Meg Cabot, Princess Diaries is a charming, if somewhat uneven film, though it does boast a spirited and lovely-looking Anne Hathaway in the title role. Though the film does belong to Julie Andrews as her grandmother, the wonderful actress who brought us classics such as Mary Poppins and Sound of Music. Hector Elizondo is also fun as Joe. The film has some lovely locations and costumes, and the two actresses are well supported by some very talented co-stars, such as the lady who played the **** Lana. The film also has a feel-good nature about it, that just adds to the film's appeal. However, the film isn't without its flaws. The story had an oft-tendency to become predictable, and the script while very funny on the most part, had some clichés here and there. There were some scenes that were a little, and that word I am putting a lot of emphasis on, slow and could have been developed a little more. On the whole, and I genuinely mean this, a charming, likable, if not entirely successful film. 7.5/10 Bethany Cox."}, {"rating": "3", "text": "Julie and Anne are pals, buddy, chums, sista-s, girlfriends. They wanted me to say that, so I thought I mention it.The Princess DiariesI wish the director Garry Marshall's film was something that I could recommend to someone. It is a classic Disney film. In the sense that it could not reek more of stereotypical characters that has made it what it is. From the goofiness to the walking emotional therapy it possesses. Each element of the film is familiar, likeable and pathetically outdated. And I say that considering the fact that it came around almost two decades ago. The script repetitively bumps into montage sequences that is supposed to delight us with various gags. Now these comic sketches has to be and does make us drool over these characters.But the film suffers, sacrifices its integrity or more accurately its consistency in order to serve the purpose of having a firm grip over its audience. It has that. I will give that to it. But after I was halfway through the film, it hit me suddenly that it wasn't their fault- actually, it was. The makers never actually had anything substantial to say in this film. Naturally, then, they would surf around with known, cliched scenarios trying to pass the time. Why does it have to pass the time? Because it has to carry the emotional weight at those final moments.And it could only be achieved after making us stay, follow, drive around these characters for almost two hours in order to get us attached to these royal beings. Anne Hathway's first role couldn't have been better than this. Not only does it capture her goofy hard working personality but also makes her \"first time\" counts. Helping her lose the virginity is none other than Mary Poppins (Julie Andrews) guiding her and us into the royal-esque world. You won't learn anything that you already didn't know, but it is certainly fun to ride along with her and wave by."}, {"rating": "10", "text": "I wished it was true that Anne Hathaway was a princess. The trope was too cliché but it is better than princess movies released latter in 2000s decade. I vividly remember it all too well."}, {"rating": "8", "text": "Hathaway shines as a princess and although The Princess Diaries is not a complete wonder movie, more than one person will enjoy seeing Anne Hathaway and Julie Andrews on screen."}, {"rating": "7", "text": "----------------------------------7.3/10-----------------------------------"}, {"rating": "10", "text": "It´s a nice romantic-comedy movie. Keeping in mind that it´s a teen disney movie, we can expect a story with a happy ending. We can also live the dream of royalty. The character that Anne Hathaway plays is very attractive, possitive and genuin, and it also teach us about commitment and responsabilities. The story shows an unusual life of a princess and everything about finding love. i love it."}], "recommendations": ["love_actually", "endless_love", "young_adult", "about_a_boy", "the_big_sick", "lady_bird", "the_perks_of_being_a_wallflower", "the_glass_castle", "gifted", "crazy_rich_asians", "moonrise_kingdom", "me_before_you", "about_time", "13_going_on_30", "captain_fantastic", "home_again", "me_and_earl_and_the_dying_girl", "the_intern", "christopher_robin", "10_things_i_hate_about_you", "sabrina", "the_edge_of_seventeen", "pretty_woman", "ella_enchanted", "stand_by_me_doraemon_2"]}