{
  "id": 3879,
  "title": "The Karate Kid Part II",
  "starring": [
    "Ralph Macchio",
    "Pat Morita"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Drama",
    "Action",
    "Romance",
    "Family"
  ],
  "description": "After discovering that his father is at death's door, Mr. Miyagi sets out to Japan, to see him with Daniel. Upon arriving, Miyagi must confront an old rival. Meanwhile, Daniel encounters a new love, and some new enemies.",
  "releaseYear": "1986",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k0OwgRR6PNu7h3SiqpCbRdZWNaG.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 8.5,
    "ending": 6.0,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I really like the setting in this one but the villains were too over the top to the point of it being comical, similar problem in the 3rd film. Though at least in this one you can kind of convince yourself it's a cultural thing. His love interest in this one was a good actress. I liked that it focused on Miyagi's backstory as well and we got to see him resolve difficult, old problems he previously escaped from. Still, it isn't the perfect encapsulation of peak teen 80s as the original was."
    },
    {
      "rating": "9",
      "text": "I don’t know why this film is so underrated. I really enjoyed it, great follow up to the first."
    },
    {
      "rating": "5",
      "text": "Has a few decent moments but doesn't match the first film in anyway. Credits song is good."
    },
    {
      "rating": "3",
      "text": "simple and boring story with onesided characters, especially the villains. The only thing that I like was, that the movie took play in Japan."
    },
    {
      "rating": "9",
      "text": "The movie has the hard challenge to follow a prequel that is a cult classic. For itself it does well. A solid sequel that is not as good as the first movie but still worth watching. They try to give us some new stories while also keeping what makes the original great. Again the movies uses themes from an underdog story, drama, clashing philosophies and martial arts. This time you learn more about the past of Mr. Miyagi. After the introduction scene which is set directly after the conclusion of the prequel and shows the true character and awesomeness of Mr. Miyagi there is a small timeskip. Mr. Miyagi becomes a caretaker for Daniel as his mother must leave for a while because of her job. However an event change their plans as he gets a message that his father has a serious illness. So both travel to Okinawa the home Mr. Miyagi left 40 years ago. There are old and new conflicts that prevents this from being just a holiday. I truly enjoyed the story. It is maybe a bit foreseeable and uses also a bit too many tropes but works well here. It does push the right buttons but does not reinvent the wheel. The motives and philosophies however are well done and you see the character growth. Again the story would be less of an experience without compelling actors and the movie delivers. Lets start this time with Pat Morita as Kesuke Miyagi (Yes, Mr is not hist first name as many believed;-). He improved his role and is a stoic hero with a hearth of gold and not a man of many but wise words. He lives by his ideals and would never hesitate to to what is right. He is a better teacher than Yoda for me in this regard. Of cause there is also Ralph Macchio as Daniel LaRusso. He cant shine as much here as in the prequel but does a good job. The chemistry between him and Mr. Miyagi is truly great and a strength of the franchise. Danny Kamekona as Sato is an interesting character. Might look a bit of a stereotype character but has depth, character motivations and development (Has he even  a family name in this movie?). Things like his and Mr. Miyagis backstory happen in real life too. Yuji Okumoto as Chozen Toguchi is a fitting rival or antagonist. He falls into the love to hate category. Does a phenomenal job in his role. Tamlyn Tomita as Kumiko delivers also a good performance but maybe a bit too much damsel in distress for my taste. In total I say we got a solid to great performance by the cast. Visually the movie looks awesome. I like Japanese culture and this is a plus for me even when I recently discovered that it is filmed in Hawai. They did put real effort into making it look believable. The soundtrack is again good but not entirely my cup of tea. Overall it is an enjoyable sequel that I recommend. I must also warn you that I am not sure how much I am under the influence of nostalgia here. Maybe less then I think because I do not enjoy the next 2 movies in the franchise this much."
    },
    {
      "rating": "7",
      "text": "This sequel lacks the heart that the previous chapter has. The idea of going to Japan to visit and say goodbye to the dying father, and pay off an old debt of honor, could have been better; the new opponent and the final fight with him feel artificial and rushed. What we at least learn here is about godliness, and that problems are solved by looking them in the face, not running away from them; that makes this sequel not a waste of time."
    },
    {
      "rating": "5",
      "text": "A disappointment.I gained nothing from 'The Karate Kid Part II', it adds very little to the original. Pat Morita (Mr. Miyagi) is the only plus point for me, he especially has one great and emotional scene with his co-star. Otherwise, no-one else stands out - not even (the still solid) Ralph Macchio (Daniel).Up until the ending I was actually nonplussed about it, neither liking or disliking it, but the conclusion is so uninteresting and lame that I just couldn't wait for 'The End' to appear. I will say it isn't an excruciating watch or anything, but I just expected a great deal more from this sequel. It doesn't feel attached to the first film, which is obviously a negative.Other things that didn't help were the shoehorning out of Elisabeth Shue (Ali) & Randee Heller (Lucille) and the repetitive nature of the story; e.g. another love story that features a jock-like character, Daniel still getting battered and bruised for the majority.Hopefully the next two follow-ups are much better."
    },
    {
      "rating": "6",
      "text": "Es una buena película para pasar un rato entretenido; la trama es decente y los actores son los mismos; la recomiendo si te gusta Karate Kid."
    },
    {
      "rating": "6",
      "text": "After the great first one came the second one, which was a slight disappointment. Okinawa had its charm for me and was definitely interesting, but I was rather bored most of the time. The climax was cool, but still not as much as the previous film. I would have preferred if there hadn't been a sequel. Miyagi's a cool character, but she's like a supporting character. Making the plot mostly about him was a bad idea in my opinion. For me, an above average movie that I would recommend perhaps only to fans of the series."
    },
    {
      "rating": "5",
      "text": "After watching this disappointment it is extremely possible to not have a slitght interest of Part III."
    },
    {
      "rating": "7",
      "text": "I love the dramatic scenes as well as the Japanese village setting. It gives into a couple clichés, but it's still alright."
    }
  ]
}