{"id": 2519, "title": "The Green Inferno", "starring": ["Lorenza Izzo", "Ariel Levy"], "runtime": 100, "genre": ["Horror", "Thriller", "Adventure"], "description": "A group of student activists travel from New York City to the Amazon to save the rainforest.  However, once they arrive in this vast green landscape, they soon discover that they are not alone… and that no good deed goes unpunished.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dTnAYyUwp6lT0cKrt4aNujj5mdF.jpg", "categories": {"plot": 5.230769230769231, "acting": 4.904761904761905, "ending": 5.533333333333333, "soundtrack": 5.0, "cinematography": 4.333333333333333, "familyFriendly": 3.0, "funny": 5.333333333333333, "action": 5.285714285714286}, "reviews": [{"rating": "0", "text": "Easily my most hated film all year.  This film is a miserable experience from start to finish.  The king of torture porn Eli Roth does it again with some of the most distasteful things you will ever see on screen.  Part of me was longing for Human Centipede.  F"}, {"rating": "4", "text": "I have a high threshold when it comes to gory films and I have great respect for directors who can execute/produce a very effective gore film. I have watched tons of gore films in my life and I think I know how to comment on one.\rI've seen The Green Inferno a couple of weeks ago with my colleagues who are eager to watch it. At the beginning of the film, I got this idea that it looked really similar to Cannibal Holocaust.\rBlood and brutality is there. The creativity of the whole setting is there. What it lacks is the dialogue and the storyboard that'll grip you by the throat."}, {"rating": "7", "text": "This isn't a \"horror\" movie. Yes, it's horrifying but the visual effects don't make it a horror movie. The story isn't great but if you want to see college students getting chopped up and eaten you'll love this. It's really just an a experience."}, {"rating": "7", "text": "A modern cannibal exploitation film classic. A girl ends up on a missionary trip to Peru to save the rainforest from getting bulldozed, meanwhile her peers are very un-likable, but doesn't draw from the film because of what happens to them later, plus there is some good acting among certain characters. The film is funny how it portrays the arrogance of the young adults, the leader being all about the attention and fame he'll get from it. Sh*t gets real when their plane crashes and the survivors are captured by the tribe they are trying to save, turns out they are viscous cannibals! Actors actually were in the Peruvian jungle with a real tribe that willingly and happily participated in the making of the film. One tribe member even offered director Eli Roth a very young child when leaving as a gift, Roth refused politely. All in all a very fun movie despite all the negative reviews. Honestly you know what you're getting into so fans of the genre should be pleased."}, {"rating": "1", "text": "Shock movies are great and all, and the gore is pretty ok in this one, but the story is the true offender in The Green Inferno. A worthless script and even more worthless characters with terrible direction and camera work will make you more ill than any of the gratuitous violence on screen. The Green Inferno is one to be MISSED."}, {"rating": "8", "text": "Some college kids (social justice warriors) travel to Peru in order to protest miners cutting down trees while looking for precious minerals. The students put themselves in harm's way as the miners have armed guards, but the tech-savvy SJWs protect themselves by live streaming the whole event via their cell phones. They were a smashing success and are soon trending over Twitter worldwide. As they are departing the country, their plane crashes into the jungle. The liberal do-gooders are greeted by the local Indian tribe who teach them a lesson in multiculturalism. Soon, the great liberators return (in the form of White men with bulldozers and rifles...kinda like Rainforest Schmainforest when Cartman was rescued from the green hell), but are too late to save more than one of the bleeding-hearts. A similar formula to the jungle-cannibal films popular in the late 70s/early 80s (the best being: Massacre in Dinosaur Valley, Eaten Alive!, Cannibal Holocaust, Cannibal Ferox, Jungle Holocaust, Emanuelle and the Last Cannibals, and Mountain of the Cannibal God). Very strange there was minimal nudity (the Indians were even prudish) despite rather grisly depiction of torturous violence."}, {"rating": "7", "text": "This review is for a certain type of horror fan. I know this is a movie that will disgust most people. I get that. But some of us really enjoy watching stupid college kids get brutally murdered. I don't know why. I don't question it. So if you're like me and you get a huge thrill out of excessive blood and gore, then I think you will enjoy this film. There are some very creative death scenes here. And with Howard Berger handling the special effects, you know there won't be any pulled punches. There is one scene in particular where a fat guy gets his eyes and tongue pulled out and his limbs hacked off one by one. Then his torso and head are baked and eaten by the entire tribe. If that sounds like a good time to you, then what are you waiting for? Go see this movie with a bunch of friends and laugh your ass off."}, {"rating": "6", "text": "Nasty and mean, The Green Inferno shoves a few moments in your face that are going to require a strong stomach. In the end though this throwback to 70's era exploitation flicks isn't as hard to watch as you might have heard. At least not in any way related to the gore.\r No, the hardest part of the movie to watch is the plot. There aren't really any likable characters in this bunch. The story centers around main character Justine and a group of social activists she meets on her college campus. These characters are little more than a club of douchebags and idiots, most of whom think way too highly of themselves. Justine however isn't totally like them. Don't get me wrong, she's definitely an idiot. Just in a different way than the others. Justine actually doesn't care about any sort of cause. She's just there to get the attention of the group's leader \"Alejandro,\" who turns out to be a total scumbag.\r You are able to root for a few of these numbskulls, but there's no way to support their motivations. The plot toys around with a handful of themes, morals, and messages but is too scattershot with them to end up actually saying anything. Well, I shouldn't say that. It's clearly making fun of social activist warriors. With the exception of Lorenza Izzo as Justine, the cast is largely mediocre. Not everyone here can act all that well.\r With the plot and characters falling so very short, the movie is left relying on whether or not it can deliver satisfying gore. In this department it does alright. It's actually not as bad as you might have heard. With the exception of the shocking and downright horrifying first kill by the cannibals, this isn't that gruesome of a movie. The rest of the violence you'll see here isn't any worse than your average zombie flick. Granted, this has the extra screwed up angle of it being actual people eating other people, but this is far from the stomach-churning, barf fest many have called it.\r There are moments where you can tell that director and writer Eli Roth pulled his punches. He could have taken things into some seriously disturbing areas, but mercifully spared us viewers from what could have been serious torture porn.\r Now at this point it may be sounding like I'm saying that this actually a pretty tame movie. Let me be perfectly clear and say that's NOT what I'm saying at all. This is still an incredibly sadistic and gruesome film. I'm just saying that you don't need an iron constitution to make it through the entire movie, but rather just for a few scenes. This is still a movie only for the most hardcore of gore loving horror enthusiasts because it is still a very brutal movie.\r I've referenced and singled out the first kill the cannibals commit a couple of times already. That's because it's the movie at it's most shocking. Roth shows no restraint in this scene, allowing the blood and mutilation to occur in one horrifying and shocking display. One so graphic and disturbing that it's intentions feel vile. After that though, yeah, we get into the zombie movie level of gore I was talking about.\r While gore is the main focus, there are other kinds of gross out horror on display. However, these moments are where Roth delivers some weird moments of immaturity that I assume are meant to add in humor to the mix, but just end up clashing gaudily and oddly with the rest of the madness onscreen. Diarrhea, masturbation, and barf the rest of the attempts made to get us to say \"ew\" and maybe have a laugh. These moments are super juvenile, but not un-amusing.\r The Green Inferno gets off to a rather slow start, ramps up with an unbelievable display of violence, and then turns into a rather standard, but still brutal cannibal flick that never manages to capture that same level of shock and, well, horror it started off the madness with. Mix in the sucky characters and bland plot, and you're left with a not so satisfying horror movie that isn't actually scary, but definitely manages to horrify.\r Eli Roth does successfully manage to pay homage to the cannibal exploitation flicks of the 70's. It's the just that the writing and pacing are so off that even when it's firing on all cylinders the movie still falls short. For hardcore horror and gore lovers there are still some thrills to be had here. It's a throwback that emulates it's influences well. The result is a type of horror film they just don't make anymore and is definitely not for mainstream audiences. The execution just isn't completely up to snuff so even The Green Inferno's intended audience is likely to be left a little disappointed."}, {"rating": "4", "text": "Their worst fear came from outside of their protest.I have enjoyed the Eli Roth's films, even though in some cases I've rated them lower than average rating it had received. But this is not what I was looking for. This is a terror-horror, not actual horror with supernatural or sci-fi viruses. I've learnt the storyline before the watch, but the film was too violent. Even for most of the grown ups. Usually I won't feel a thing for film tortures, because 'fake' is the word always pops up in my mind whenever I see gore.Anyway, these days, killings in the films are considered entertainment. There is a separate group of fans who follow this kind of theme. But for me, the cannibalism was the one most disturbed. I have no issue with killings, but cannibalism brings totally uneasy. The story was decent, but intentional. You would guess most of the parts. But this film was not about that, just to make you go off of your seat with discomfortable and it succeeds on that.It was totally opposite to 'Embrace of the Serpent'. It was inspired by the 80s Italian film with the similar storyline. The film was about fighting for the survival of passengers after their plane got crashed in the Amazon forest who are now hunted by Amazon tribes. There's already a sequel on making titled 'Beyond the Green Inferno'. I don't think so, it is a recommendable film, but some are doing that for fun, and some to challenge their friends. Overall, a decent production, with casting, locations and visuals. But I won't favour it.4/10"}, {"rating": "4", "text": "I remember when this was supposed to come out about a year ago and then its release got yanked less than a month before it was supposed to come out due to legal issues with the studio or something like that. So when I heard it'd finally be coming out this year, I figured I'd check it out since it looked somewhat interesting and the fact that Eli Roth hasn't done a film in a while. Well all I can say is man, what a joke! I was expecting to at least have a little bit of fun with the bloody and gross stuff in the film, but that couldn't even make up for how uneven the rest of the film is. Pretty much everything in this film was ridiculous.  The acting and dialogue was pitiful, the story was far more laughable than it was intense or terrifying, some scenes near the middle became confusing or unexplained, and worst of all, the cannibals don't show up until nearly an hour into the film! In addition, the ending and the credits scene were both ridiculous and felt like a loose end left untied. Overall, it's simply a mess of a film and easily Eli Roth's weakest film to date."}, {"rating": "4", "text": "This is my reaction to watching The Green Inferno: o_o\r Eli Roth is one crazy motherf**ker but he's also unique in a strange way. I honestly think he's trolling us as an audience and I think it's catching on, because while I do enjoy watching some of Eli Roth's films, I must admit that the movies itself are not what I call \"great\", and I think Eli is aware of this and he's just messing with us. And The Green Inferno isn't a good movie but as I said before it was enjoyable...in some parts.\r The acting was pretty bad, the movie tries to be funny and fails hard, the screenplay is awful and the movie dose start really slow at the beginning. It's not until there get to the tribe is where it starts to get entertaining and also shocking. I got to praise the make-up artist who did the make-up for the tribe people and the gore. It really was effective stuff and I got to give them praise for that. The gore itself is shocking and gross as I expected for a movie about a tribe filled with hungry cannibals.\r Overall The Green Inferno isn't a good movie, but if you love gory movies or just want to be grossed out then this is the movie for you. But for me, I can't see myself watching the movie again."}, {"rating": "3", "text": "Horribly written and acted and more laughable than terrifying, \"The Green Inferno\" is a dull horror film, that doesn't entertain the audiences, in any way."}, {"rating": "6", "text": "Scathing critique with genuine dread gets slightly bogged down by (unnecessary) stupidity in its second half - where it should have crackled. Loved Lorenza Izzo's performance, and I cannot deny that I laughed more than I expected to. My favorite Eli Roth film so far - by a lot."}, {"rating": "0", "text": "não sei qual é pior, se é esse filme o aquele antigo Cannibal Holocaust, que lixoooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo"}, {"rating": "7", "text": "Hope you have a strong stomach for this one. Extremely gory. The ending was ok if you believe in forgiveness.\r Watch it online for free: https://www.primewire.ag/watch-2769593-The-Green-Inferno-online-free"}, {"rating": "4", "text": "Not too gory, not too bloody, not satisfying..\rBut pretty funny though, to include a moral story : don't ever think that cannibals on high will high five on you.."}, {"rating": "4", "text": "Eli Roth's gore shock horror piece started out generally well. What is barbaric? Well, everyone is. The so called 'good guys from the west' to the vicious 'jungle people', which also counts as the timber men. There is nothing civil about this movie, everyone is greedy in some respects with their own self-absorbed drives. What stops this film from reaching higher potential is it's derivative script. Some of the worst screen writing I've ever seen along with pretty mediocre acting combined. The Green Inferno overall will be impressive to most gore fans, but for everyone else, some of it's gore is just stupid and meaningless. And one huge unresolved arc hanging at the end creates an unsatisfying atmosphere around the green inferno, a foreshadowing circle jerk."}, {"rating": "5", "text": "Just like Knock Knock was a nod/remake/reboot to an earlier home invasion movie, The Green Inferno seems to be a nod to Cannibal Holocaust. It's basically college students who believe they're acting on behalf of the environment and the jungle, find out the jungle has no use for them except as foodstuff. It's really that elemental. If you ever wondered what it would look like if your local butcher treated a human body like a side of beef, then here's your movie."}, {"rating": "4", "text": "Hilarious movie. Because it's funny? No, because it's so uneven and badly made that you'll keep wondering what the hell they were thinking. Here's an attempt. Eli Roth clearly loves horror movies and has watched many of them. He however doesn't seem to have to skill to either bring a homage or a twist to the horror/gore tropes he seems so infatuated with. Having a gruesome ritual execution and then following it with a farty poop joke (including cartoon noises) requires a lot of skill to make it work. Here, it doesn't, it just comes off as clunky. As with all Roth movies, many characters a cynical, and they certainly are all  stupid. Some moments are pretty creative, but usually ruined by the following silly slapstick. The low quality of pretty much every aspect doesn't result in a bad movie. Most of the time you'll be looking at the screen thinking either \"wait, what?\" or \"eew\", which is better than many other recent gore/horror movies. Lastly, Eli Roth, your wife can't act for ****"}, {"rating": "0", "text": "Stupid. There's exactly one reason that Eli Roth is in show business and it's not talent or racial sensitivity."}, {"rating": "7", "text": "This plays nicely as a documentary about the state of American higher education and political activism. Plenty of movies have killed off unwitting college students, but this one hits at the heart of what people are feeling and thinking right now, and its characters feel very much like the sort of people you'd see at a rally.\r As a horror movie, eh, not great. You kind of know what you're in for. The gore is gory, sure. But strangely enough, it isn't as bad as it could have been. It's the sort of movie where virtually every line is a setup for some later event, and at some point it starts to feel like you're completing a checklist. At its best, its seething social commentary, juxtaposing the cannibals with what most people would call normal animal agriculture. At its worst, it's just cheesy.\r The tribal aspect is somewhat fascinating. The two identifiable leaders obviously don't belong, but the rest of them are real tribespeople. On the surface, it's a nasty depiction of them that calls back to past horrors of the real world. And yet, one hardly walks out of this movie thinking that the uncontacted peoples of the Amazon are the bad guys of the world.\r All told, it's an interesting and subversive concept, not really fully executed."}, {"rating": "8", "text": "Obviously not as gory,shocking and good as they promised us but, it's still a damn good movie.Lorenza Izzo was pretty good in the leading role and Alejandro was definitely a memorable douchebag.Even though the end was disappointing and the rest of the movie is not as good as everybody thought it would be, it's still a damn fine movie."}, {"rating": "6", "text": "A movie inspired by the ultra-violent 70's Italian cannibal movies seems perfect for a director like Eli Roth. If you're not a fan of his films already, this won't win you over, but if you his brutal, tongue-in-cheek horror, The Green Inferno is a perfectly serviceable gore-fest. The Green Inferno follows Justine, a freshman in college who joins a student activist group that plans to save the Amazon rain forest. But these guys aren't just all talk: they are going to go directly to a village in Peru to rescue it from impending bulldozers before the village is destroyed, and their mission is successful. They rejoice on the plane ride back home, but their celebration is short lived as the plane crashes somewhere in the vast sea of green. Soon enough, they are taken hostage by a cannibalistic tribe and must escape before they are turned into someone's next meal. Like Roth's previous films, The Green Inferno takes its time before unleashing hell on the victims. The crew doesn't actually encounter the cannibal tribe until about 45 minutes into the plot, so when the violence comes, it really packs a punch. You'll definitely want to finish your popcorn early. Unfortunately, the movie doesn't have much of a plot after the group gets captured, so a lot of it is focused on the gruesome death scenes. I have to give credit where it's due, though. There are some really hard to watch scenes in this, and that's exactly what this movie wants. However, what makes The Green Inferno not just your average torture porn flick is how stylish it is and some darkly funny writing. The humor does sometimes get a little unnecessary at times, but there are many times where I had a laugh with the movie. Mainstream audiences won't appreciate how it homages classic cannibal flicks, but Eli Roth fans should be satisfied with a suitably nasty descent into hell."}, {"rating": "7", "text": "This is not a terrible movie.  The storyline is fairly good and it kept at least two people's attention throughout.  There are some elements of the plot that don't make a whole lot of sense, but really, do we go to horror movies to learn anything?  Heck no!  We want to be scared!  Once the action gets going, my friend and I had to hide our eyes a few times, but we knew that going in.  What we didn't know was how bad - or not - it was going to be.  We are not so much fans of the gory genre, but even though this one is pretty darn gory, we got through it and shared a few laughs to get through it.  Not sure the ending made any sense at all.  We were kind of shaking our heads as we left.  But, we felt that in spite of the gore, it was not bad.  Can't believe I am saying that!"}, {"rating": "5", "text": "The Green Inferno is a disturbing gorey experience that attempts to make gore and killing an art form. Going in I knew Eli Roth had a gore fetish, so I expected some harsh killing, but the film was even more gorey than I expected, and was a little hard to watch. Beware that the film isn't really a horror movie in the sense that it's scary, it's more like Saw with cannibals. This movie takes gore and killing so far that it's really only for those who enjoy overly gorey films. The acting, dialogue, and story are all weak, but the film's preliminary focus is more directed at how many ways can people be brutally murdered. It's the focus on killing that exemplifies that Roth didn't care as much about story, he wanted to take killing and gore, and make them an art form, like Tarantino. The movie did have a dark sense of humor, one example is that these people are being killed, while the tribe has a bunch of cows and pigs that remain untouched. In the end this movie is a cinematic experience, if you see it you'll probably leave the theater with an upset stomach, that being said this film's not for children or the weak stomached."}, {"rating": "1", "text": "Pure poo. Just absolute, pure poo. Dumb as hell. Just skip it. So, so, so bad. I guess my review needs to be longer in order to submit...hows this...bad bad bad bad bad bad bad bad bad bad bad bad bad bad bad POO."}, {"rating": "6", "text": "\"Oh no, they have the munchies!!\"\r After watching and enjoying the first two Hostel movies I was curious to see this movie from Eli Roth. The story in these movies seems very similar: a group of young people travel to a far country for some thrills, but end up being tortured and dying.\r The special effects look realistic enough and there are some moments where you need a strong stomach to keep watching, but the humor takes away some of the darkness. Also the cinematography is colorful and during most of the movie there is a lot of light, which makes things a bit less scary. The movie doesn't have much suspense, you know what will happen and it's all about the blood and gore.\r The nature has been nicely filmed, the images of the forest in Peru are beautiful. Also the tribe looks to be real, they're all covered in red paint just like the recently discovered wild tribe you read about on the internet which hasn't been in contact with modern men yet. Hope the real tribe is not cannibalistic!\r The acting is descent, not special. Eli Roth's wife Lorenza Izzo looks great and she acted pretty well in this movie. The jump scare at the end of the movie, when she dreams about the leader of the team who she left behind to die, was a bit unnecessary and didn't fit with the style of the movie. Also it's a bit questionable that after all that happened to her friends, she would still defend the tribe against extinction by saying they did nothing wrong and she didn't see any proof of cannibalism.\r The story was really simple and it's honestly just copying Cannibal Holocaust (1980) without adding much new. It's funny to see that the tribe treats the captured white people just as they would treat animals, it could even make us ask ourselves questions about the way we treat, slaughter and eat animals.\r All in all I didn't enjoy this movie as much as I enjoyed the first two Hostel movies though. Those movies were a lot more inventive and new."}, {"rating": "3", "text": "The Green Inferno is a huge let down! I went to go see this film with some buddies and we were looking forward to see a fun, gore-fest of a movie. The movie drags along for the first half of the film, while the main characters prance around and protest. Although, when the gore does start, it picks up towards the end, there is really something. There is an over abundance of dark humor in this film. At times it works, but at other times, it makes us uncomfortable. I happened to question if it was right to laugh at certain times. Not only that, but the performances are just over the top. Some work, but others don't. When I talk about the performances that don't work, I'm mainly referring to Ariel Levy's. It is completely over the top and just so phony. Lorenza Izzo was good and Sky Ferreira was absolutely hilarious. The film was really intense, but that was the only decent aspect of the film."}, {"rating": "6", "text": "That's one ridiculous movie indeed. Eli Roth, known for Hostel, Grindhouse & Cabin Fever, as always tries his best in his own movie genre, which can only be described as splatter parody.\rBe prepared for a few crazy splatter scenes, along with some utterly ludicrous ones. This movie will probably be remembered in the future as a B' movie, but I have to tell you that the script is well worked (ecological thoughts mixed with critisism on western life, but at the same time a dose of racism is necessary for Eli Roth's parodies) and the cinematography is perfect. Needless to say do NOT choose this movie for your first date (unless you want to troll her). Choose your most immature buddy instead. The Green Inferno will have you rolling on the floor laughing a few times."}, {"rating": "3", "text": "Eli Roth's newest gorno flick has some intense moments. But, The terrible acting and even worse jokes can make this movie unbearable at times. If you've come for the blood only skip to the last half of the movie because when the characters are just talking the movie is boring. It's offbeat pacing doesn't work at all even without the slow build up."}, {"rating": "2", "text": "From start to finish, I couldn't even wonder what was I doing watching this movie. I looked again and recognized that it was only just to waste time. Smart move."}, {"rating": "3", "text": "I'm not sure what to say about this movie. The Green Inferno is a interesting movie and could have became one of the better horror films in years . But it's not. It seems Eli Roth lost his way in this film . There are two scenes in this horror flick that really ruin the whole entire movie. And the ending ruins what was left of the Green Inferno. If this movie was handled by another director , it would have been a classic."}, {"rating": "0", "text": "this sukssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssswssss"}, {"rating": "0", "text": "Predictable, ridiculous, laughable, stereotypical... even for the low standards of the gore sub-genre."}, {"rating": "9", "text": "If you love a gritty, gory, suspenseful horror movie the Green Inferno is for you. It lacks in certain areas like character building and the CGI isn't great, but I loved it."}], "recommendations": ["hostel", "hostel_part_ii", "cabin_fever", "house_of_1000_corpses", "the_hills_have_eyes", "terrifier", "clown", "malignant", "splice", "texas_chainsaw_3d", "the_curse_of_la_llorona", "the_possession", "chernobyl_diaries", "the_host", "the_collector", "i_spit_on_your_grave_2", "piranha_3dd", "the_collection", "unfriended", "the_pyramid", "crawl", "doomsday", "the_crazies", "devil", "the_texas_chainsaw_massacre_the_beginning"]}