{
  "id": 4310,
  "title": "The Only Living Boy in New York",
  "starring": [
    "Callum Turner",
    "Jeff Bridges"
  ],
  "runtime": 88,
  "genre": [
    "Drama"
  ],
  "description": "When a young man learns that his overbearing father is having an affair, he tries to stop it, only to be seduced by the older woman as well.",
  "releaseYear": "2017",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/8e6Q7N2qJ7utBrf6pyf3EiLADja.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.333333333333333,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.666666666666667,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Callum Turner plays a somewhat aimless young New Yorker, who's struggling with a platonic relationship when he discovers his father's having an affair. He befriends a new neighbor (a quietly wonderful Jeff Bridges), who offers him advice and solace. This is from director Marc Webb, who (in addition to 2 Spiderman flix) directed \"500 Days of Summer,\" which has the same type of appealing interactions and charming characaters.  In addition to Turner's charismatic performance (he's also quite beautiful), there are touching moments from Pierce Brosnan, Cynthia Nixon and Kate Beckinsale. It's a bit slow starting, but thanks to the fine cast, it develops into a sweet little story of frustrated romance and relationships."
    },
    {
      "rating": "5",
      "text": "Directed by Marc Webb, who was behind 500 Days of Summer and the Amazing Spider-Man movies but on the flip-side written by Allan Loab whose written hits like Just Go With It and The Space Between Us, \"Boy In New York\" as I'll just call it is a decently made film by Marc Webb but eventually undoes itself due to Loab's inability to tell a story. Another trend I've noticed lately with Loab is his \"twists\" he likes to throw in his movies. While filmmakers M Night Schamalan at least try to put some effort into their twists, Loeb doesn't. They seem to be kind of thrown in there for reasons I can't seem to comprehend, the same could be said with \"Collateral Beauty,\" another film I felt could have been great had Loeb stayed away from it. The cast on the otherhand is fantastic, I really enjoyed Kate Beckinsale in this. While her character lacks depth, she shows a sense of vulnerability and that sense of insecurity that resonates from her character. Jeff Bridges, Pierce Brosman and the young Callum Turner also do fantastic in their roles. The movie, like Collateral Beauty fails in its execution and writing, you really struggle to think about anything that made the movie really special. The film had near zero eroticism, especially considering it featured an attractive older women who is in multiple affairs. Basically, the film tried to be something but it fails to establish itself on any fronts and doesn't commit to what it's trying to do.Overall Score: C (Kudos to Kate Beckinsale though)"
    },
    {
      "rating": "4",
      "text": "A mediocre drama that does not propose anything new, good or even relativly interesting.It's a shame to see Jeff Bridges wasting himself in that way."
    },
    {
      "rating": "2",
      "text": "Why did I even watch this? The cast is the answer I guess. The story is so mediocre I'm actually surprised this movie was made. Don't waste your time with this and see other movies instead."
    },
    {
      "rating": "6",
      "text": "This extremely uneven but entertaining pic features nice work by Jeff Bridges as a hard-drinking spiritual guide (a part that perhaps only he could pull off with a semblance of credibility) and surprisingly subtle work by Pierce Brosnan as the film reaches it climax.  Cynthia Nixon and Kate Beckinsale are engaging and hit the right notes in underwritten parts.  Callum Turner as the confused twentysomething lead who falls in love with his father’s mistress is effective in a role that doesn’t make a lot of sense.  Turner nails the indecisive, conflicted, privileged only child struggling to find his own path and makes you believe that there is innocence beneath the jaded, world-weary mask of a New York City adolescent but he is undercut by a twist late in the movie that shifts the story to the grown-ups. It’s really not his movie.  It’s a  coming of age story for middle-aged baby boomers who made the wrong choices a generation ago.  If the film had started out with that premise, it would have been a much more original and interesting story."
    },
    {
      "rating": "6",
      "text": "เป็นหนังรัก สามสี่เส้า ที่เหมือนจะซับซ้อนก็ไม่ มันให้อารมณ์อบอุ่นมากกว่าดราม่า 555 เดินเรื่องเนื่อยๆจนแอบน่าเบื่อ (โดยเฉพาะองค์แรก เบื่ออออมาก 555+)แต่แม่เคทดาเมจรุนแรงมากกกก เกือบตายคาโรง 555ชอบบรรยากาศในเมืองนิวยอร์ค สวยและเป็นธรรมชาติที่ลงตัวมาก#รักสี่เส้าก็ใช่ว่าจะจบเศร้าเสมอไป"
    }
  ]
}