{
  "id": 1610,
  "title": "The Matrix Resurrections",
  "starring": [
    "Keanu Reeves",
    "Carrie-Anne Moss"
  ],
  "runtime": 147,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "Plagued by strange memories, Neo's life takes an unexpected turn when he finds himself back inside the Matrix.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8c4a8kE7PizaGQQnditMmI1xbRp.jpg",
  "categories": {
    "plot": 1.5714285714285714,
    "acting": 1.4705882352941178,
    "ending": 2.2,
    "soundtrack": 2.25,
    "cinematography": 2.0,
    "familyFriendly": 1.0,
    "funny": 1.0,
    "action": 1.5263157894736843
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Idk what to say. Huge fan of everything Matrix. Even a defender of Reloaded and Revolutions. I played the games, I’ve bought each iteration from DVD to 4K…yet this movie…this is not a Matrix movie to me. This was a parody. The acting, the lighting, the choreography, the script, the overall story all failed.I went and watched the original after watching this and literally on 4K the 22 year old movie looks better. This was…a waste. Id rather it had never been made. I give it a 3 instead of a 0 simply because I love the Matrix, but there isn’t much to love here."
    },
    {
      "rating": "3",
      "text": "This abomination of a movie should never have been made.  From the re-hashed story, to the constant usage of footage from the first film, to the lack of an intersting story and the bloated 2 hour 30 min runtime.  The casting of Doogie Howser as the big bad guy was the worst casting choice possibly ever in the history of Sci-Fi movies.  This movie also showed  just how bad an actor Keanu Reeves really is.  He is passable is other movies but here he was absoloute trash.  If this is all Wachowski can come up, then please never make another film.  You had a hit with the first film, milked 2 more that were barley passable, and this is a pile of festing dog crap."
    },
    {
      "rating": "3",
      "text": "There is inevitably going to be a lot of political backlash around this film from angry people who don't like some of the changes that threaten the cool masculinity of the original films.  For me, those changes weren't a major issue, and if anything were some of the more entertaining aspects of the movie.  There were a few moments that felt a little overbearing, but nothing too egregious.The real issue is that the movie just isn't very good.  The music was bland, the CGI was ugly, the editing was bad, the choreography was uninteresting and the action was occasionally hard to read a la the Bourne films, the cinematography was lifeless, the script was pretty abysmal, with several interesting ideas all executed poorly.  The use of flashbacks were atrocious.  The meta commentary immediately wore thin.  While this is definitely not a full retread of older Matrix films, it still carries the baggage of one.  Huge swaths of the movie are just people explaining things to the audience.  The earlier movies are somewhat guilty of this, but Keanu just doesn't work as an audience surrogate or as an engaging character here and we are mostly taken out of the film as a result. Keanu lacks the intensity he had when he was younger, leaving him to mostly just appear bored, and the flat framing and editing does nothing to help remedy that.  This especially comes across in the action, such as when he's jumping away from an explosion and it really feels like an old dude jumping in front of a green screen.  The newcomers were fine, but the Morpheus surrogate didn't feel anything like Morpheus or the other character he's meant to embody.  The whole thing felt like a made for TV movie with a bigger budget that went almost entirely to bad CGI.  Carrie-Anne Moss is fine, which is good because her character is integral to the better aspects of the plot, but Keanu really is the crux of the film and fails to carry it.  The new villains do not work.  This honestly just doesn't feel like a Matrix movie.  It feels like a pitch with some salvageable ideas in it."
    },
    {
      "rating": "1",
      "text": "Despite some fun visial effects the below below-avarage movie is another lost opportunity this year. Zero chemistry between characters and lack of Matrix mood ruined the chance. Kids level story. If you missed this movie, you missed nothing."
    },
    {
      "rating": "0",
      "text": "Feels like a fanfiction written by a 15 year old.No clever dialogue, no amazing cinematography, no cool action, no thought-provoking story. Soulless garbage."
    },
    {
      "rating": "3",
      "text": "Honestly, I'm a fan of Wachowski movies. I think they're special filmmakers - unconventional and somewhat profound. From The Matrix to Cloud Atlas to Jupiter Ascending, and even the much maligned Matrix Revolutions I've found them all brilliantly intriguing. However, The Matrix Resurrections is a different movie.It differs so much from its original trilogy the only commonalities they share are their titles and characters. This movie looks modern, polished, and very in the times - a whole lot more than the trilogy that precedes it but it unfortunately, ends up feeling much cheaper and very conventional.There's some beautiful CGI and Visual Effects, some of which is entirely impressive. So the movie looks good enough and properly 2021. It also presents concepts that shine and introduce some new ideas or implementations of AI programs in cinema. And this is one of only a few positives the movie offers - positives are few and far between. While, it also does an OK job of representing aspects of our current world within the context of The Matrix.The movie certainly doesn't take itself too seriously. It does not try to be revolutionary and while that could have been a plus, in the end, it plays out negatively. The plot is weak, sterile and unexciting. Its action sequences are poor and barring the casting of Neil Patrick Harris as The Analyst and Toby Onwumere as Seq most of the cast of the movie while talented - seem completely out of place, and uninspired. As if, they were simply - easy and convenient casting choices.Every Matrix movie from the original trilogy was about a world vast and deep, with consequences that carried a whole lot more purpose for everyone linked to that world including its audiences, this movie however is based upon simpler, less interesting, less impactful - terms. There's some sprinkling of profundity within The Matrix Resurrections but throughout the movie it seems to be battling with the depths and grandeur of its past so much that it fails, and cannot realize its purpose. It cannot escape the shadow of its predecessors, it does not separate itself from them, and it ends up being worse off as a result.It tries to do too much and explain too much all in one movie. So much so that this fourth installment alone could be a trilogy of its own, which I think would have helped the story and its characters - but here, everything is rushed and packed into this singular title that just ends up feeling a little ambitious but truly disjointed. While sometimes literally trying to recreate its past.This is probably not only the poorest Matrix movie but also the poorest and most meaningless Wachowski Movie. Perhaps, the point was to kill any hope, idea, or possibility of the franchise having a future. Because this is a lifeless, conventional, and unfortunate disappointment."
    },
    {
      "rating": "5",
      "text": "Unfortunately The Matrix definitely lost its essence in this movie. Resurrections is easily mistaken for a marvel superhero movie. 2 hours and 28 minutes of unnecessary scenes and boring jokes, which even for me, a big fan of the franchise, got tired of watching the movie halfway through. Yes, it has good points like good special effects, good music and good acting, but that stand out only for the budget of the movie, after all this was the minimum to be given to the fan. Definitely a 5 out of 10."
    },
    {
      "rating": "0",
      "text": "God i wanted to like this movie so badly but it's just awful.  The opening 20 minutes might as well be a fan film."
    },
    {
      "rating": "2",
      "text": "This script, story, and movie are an absolute jumbled mess, It was so forced. I can’t believe how bad everything was. The whole opening scene you can just tell they are on a movie set. The directing was god awful. But, yeah, that script/story…. So stupid (that attempt at comedy in the beginning, facepalm). What a shame."
    },
    {
      "rating": "2",
      "text": "2 points for the Merovingian quotes because he sums up this movie and Hollywood nowadays. Matrix is now Netflixed, well done sisters ! Terminator, Indiana Jones, Star Wars, Matrix, Ghostbusters : who will be the next victim ?"
    },
    {
      "rating": "0",
      "text": "Wow!! What a trash, no cool music , no cool fight scenes , everything is so awful… why?? Why was this movie made like this???? Why???? Stop it please !!!!"
    },
    {
      "rating": "0",
      "text": "One of the worst possible iterations you could imagine for this film. A truly horrible movie."
    },
    {
      "rating": "2",
      "text": "Overall this is very bad and I think it was a mistake to make this.  If we are looking for positives, there are decent special effects and we learn a tiny bit more about the machine world and their motivations.   That’s about where it ends.  Even the first point about the special effects is countered by the fact that the effects in the first Matrix were pretty revolutionary when it came out, but now in 2021 there is really nothing special and in particular the characters look very silly when they are flying.  Next, the endless pointless shooting and fighting scenes in this movie really highlight a fundamental issue with this entire story, which is that it makes no sense for the humans and machines to be fighting in this way.  Both the fights themselves and the reason for the fights are severely lacking.  There’s are dozens of times in this movie when 10+ guys with automatic weapons are unloading on the good guys from feet away and I’m pretty sure no one got hit by a bullet the entire movie.  We are supposed to just accept this because Matrix.  As I watched all these nonsensical scenes it really makes you think, why is this even happening.  In this future dystopia where machines have enslaved the whole human race, why are they even bothering to punch and shoot each other inside the simulation.  It does not appear to be lethal for either side and really just feels pointless and silly.  Next, The dialogue was pretty garbage;  just lots of cliche throwbacks (“I still know Kung fu” are you kidding me!?)  Well I have a lot more thoughts that head into spoiler territory but overall I think this movie was unnecessary and has tarnished the overall quality of the trilogy.  I can’t give it a 1 because I made it through the whole movie but damn it was dumb."
    },
    {
      "rating": "2",
      "text": "This isn't a reboot or reimagining of the trilogy.  It's more like a bad parody, just without any humor.  Honestly, it's so bad I am not sure how to feel.  It's almost like it was tailored made to enrage fans of the original Matrix while blatantly cashing in on the IP.  Yet another great series falls casualty to idiots.  At least it was free on HBO."
    },
    {
      "rating": "0",
      "text": "I consider myself a hugh fan of the originals, specially the first one. I m so sad to see what they did here ...I was not prepared for such a bad film. The plot, the kung fu fights, the action scenes ... nothing works. Do not go to the cinema, don-t support this garbage."
    },
    {
      "rating": "1",
      "text": "Cringe-worthy pastiche of the original, capturing none of its climate and impact. Retreads the same general plot, but with confusing caricatures of the familiar characters and plain parodies of the best scenes from the series. It shows no respect for the material (as absurd as it seems from one of the original creators) or the viewers that hoped for a meaningful expansion of the Matrix universe. The returning actors definitely try their best, but could only do that much with the atrocious material they were given.Shockingly enough, watching it on a dual screening together with the first movie, Resurrections doesn't even look or sound particularly well – the editing feels chaotic, CGI is mediocre and the soundtrack forgettable. The only way I can explain to myself how this movie happened the way it did is going along with the meta-narrative – maybe WB really forced Lana Wachowski to make this sequel and it's an act of industrial sabotage. If it was meant to make a laughing stock out of Warner Brothers and make sure to kill off the whole series for the future, that'd be the one thing it very much succeeded with."
    },
    {
      "rating": "2",
      "text": "Terrible, nonsensical, **** garbage. With some pretty special effects. The first hour is intriguing, and then the entire story plummets off of a cliff and goes splat."
    },
    {
      "rating": "2",
      "text": "The final scene is laughable. They are trying to bait us for a sequel of this! Hilarious.Every fight scene does not advance the plot. There is no character interaction, just punching each other.The main \"crux\" of the story is the love between Neo and Trinity. They focus on worst  part about all the previous movies.Trailers made me hopefull. I thought this would tell some metaverse story, they would explain something about the real world being a 2nd level of the matrix. They could focus on quantum computing and make the world much broader and deeper, while explaining new sci-fi concepts.First matrix was deeper and more technologically advanced than most viewers. This one is stuck in the past, and is far dumber than most people watching it. This is honestly an embarassment, and im embarassed i have seen it. Hopefully the sequelbate wont come true, because i cant imagine them somehow making an even less thoughtfull movie than this."
    },
    {
      "rating": "0",
      "text": "One of the worst movies I have ever seen. It really is an accomplishment how much worse this one is compared the the orginal Matrix. It is Star Wars disney level bad and cringe."
    },
    {
      "rating": "0",
      "text": "The worst thing I’ve watched in a decade, maybe longer. It’s not even funny bad, it’s just bad-bad. It’s so bad I’m going to cancel my HBOMax subscription.  When Hollywood is completely dead here in the near future they will cite this film as a prime example of just how bad things got."
    },
    {
      "rating": "2",
      "text": "If you liked the last jedi the rise of skywalker and the  terminator dark fate you gonna like this one too. This movie was like a poor fan fiction or a cheap netflix movie, 20 years for this?! I knew it wont reach up to the original movie but holy **** I'm sad :("
    },
    {
      "rating": "2",
      "text": "Garbage scenes that are rammed together without any actual story.  Lazy, woke, and boring."
    },
    {
      "rating": "0",
      "text": "Another stinking pile of hollywood garbage trying to live off the nostalgia of it's better originals. Couldn't help but feel similar feelings as i did when watching the Disney star wars movies. The problem with trying to live off the nostalgia of the originals is; your constantly reminded how much better they were to the stinking pile of **** your currently watching. Dog crap."
    },
    {
      "rating": "0",
      "text": "The film is a disgrace too the legacy!The casting is utterly awful! And the visuals look cheap and ugly!"
    },
    {
      "rating": "0",
      "text": "The movie is absolutely horrendous. Fell asleep during my first watching of the film, the movie drags on and on without a single ounce of plot to capture my interest. The only reason to watch this film is to see how low this franchise has gotten."
    },
    {
      "rating": "0",
      "text": "Worst film I’ve seen this year. The first film was fantastic, it made you question your reality, was life just your 9-5 job at your desk? How deep does the rabbit hole go?The 2nd and 3rd film are what they are.. weren’t the best sequels but we’re watchable in that era.This fourth film.. I want to gouge my eyes out with bleach. I can’t believe Keanu signed up for this, and I’m glad Lawrence and Hugo haven’t made an appearance they must have respect for their work and craft. The story is god awful, why they’ve decided to dig up the old story and add onto it I have no idea. The fight scenes are like watching your drunk uncle trying to fight other people at the Christmas party, and the portrayal of Morpheus leaves a lot to be desired the same goes for agent smith. These characters were brought to life by the actors and to replace them and to try again just feels lazy and sub par to the originals I didn’t have high hopes but I didn’t think it could be this bad. And why that guy from how I met your mother is in it makes it even worse. I’m glad I didn’t pay money to see this in the cinema."
    },
    {
      "rating": "0",
      "text": "If you're a fan of the Matrix make yourself a favour and don't watch this garbage."
    },
    {
      "rating": "1",
      "text": "Boring, fell asleep, woke up and started the movie again (HBOMAX) and fell asleep again, I hope the action in John Wick 4 is not as bad as the action in this movie, too many flash backs and the story was to hard to get a grip on, it was all over the place."
    },
    {
      "rating": "3",
      "text": "Disappointing action and plot. Waste of money and time. Not recommend to anyone."
    },
    {
      "rating": "2",
      "text": "So dumb.  Throw in a blue hair Pat, teen references to Chad, some shaky cam, and really poor cinematography, then you get this...high-school fan \"film\".  Also, how did the mumbling get through the editing room?  I'll tell you how, they edited the film while stoned and laughing at the WB sugar mommas.After all, this movie is the epitome of getting back at Mom and Dad, who raised the spoiled brats who made this.I'm actually embarrassed for the folks that created this cringefest. There must be something truly awful going on in Hollywood when you realize just how poor these people are at story telling.  What was once an admiral art form has really fallen into something lazy and ugly; the politicization and subversion of everything for the sake of the Twitter mob.  The premise of the film was almost interesting but then again, it wasn't executed well at all.  I came into this realizing that the blue haired trans was there to tell some woke diversity story and was willing to look past it, but then everything else happened.  It was quite boring and I turned it off.This thing was cringe and lazy.I'm sure they don't care though.   This was probably not meant to be a real film but a middle finger to anyone who ever worked at making something memorable and creative.  After all, socialists and communist cannot create...they only consume and destroy."
    },
    {
      "rating": "0",
      "text": "This time of age noone respect source of anythink . this inclusion and paint everythink pink stuff started to annoy me .wtf did i watched. i opened this acc just to wrote this. if u are like me fan of matrix movies+anime and if u are doing every year  matrix maraton dont even see this and destroy somethink u love. if u even see this movie 1 time they will make the money they want and it doesnt matter for  them fans are happy or not but if we destroy them on box office and made them lose money this sh**t wil not happen agein hopefully......"
    },
    {
      "rating": "1",
      "text": "There are a few things I don't understand at all.1) Didn't the authors see what they were doing? When was the script written or when filmed or when editing a film??2) If they saw the result, then why didn't they try to fix anything during preparation and production?3) And if they saw what it turns out ... then what happens, why was it to be released to the public at all?I just go crazy for what I looked. It's just a downfall into cinematic hell.In this film, everything is done wrong. Hands did not come off the face after the first fifteen minutes until the very end.How did they manage to do it so badly? Why didn't anyone take the liberty of stopping the process and sending it back for revision? Where they were in a hurry is not clear at all.Fights? Disgusting.You did great fights in the first three films. Why couldn't you do the same in this?Dialogues? Disgusting. The characters are incoherent. They just ... I have no words.Music? I don't remember her at all. Was she even in this movie?The characters in the film ... oh my god, I don't understand why you did all this. They just took everything and flushed it down the toilet.What the hell was the point in all this? Everything in this film is very, very poorly done.In no case do I recommend watching this. And fans of the trilogy should be doubly careful not to approach this \"movie\" even a single step."
    },
    {
      "rating": "2",
      "text": "The Matrix Reloaded was inadequate, the Matrix Revolutions was irredeemable, but this is absolutely inexcusably, incomprehensibly bad.A convoluted, incoherent mash up of conflicting story, inane dialogue, banal action set pieces and atrocious acting. Some scenes are so overwhelmingly awful that they feel like a genuine student-made parody film.Two stars awarded for reminding me with all its pretentious metacinematic tripe just how great the original film was."
    },
    {
      "rating": "1",
      "text": "Is a comedy and romantic movie that put a Neo like “nobody” and Trinity is the the one. This movie push the meta-trans message to another level, is sad to see the matrix like a joke. Matrix 4/Resurrections is a garbage of non-binary cult."
    },
    {
      "rating": "0",
      "text": "Really bad movie.After 1h watching the movie a was waiting to finish as soon as possible a go back home.Very disappointed."
    },
    {
      "rating": "0",
      "text": "Did the cgi get worse this time around or is it me?I fell a sleep like a lot of people did.I can remember a single fun or cool thing from this movie."
    },
    {
      "rating": "1",
      "text": "Seriously. What did you really expect? Much closer to the second film than the first. The CGI and special effects quality will surprise you on how low level they are. The characterization is just off to an uncanny valley level. Reeves is not really neo. Hes still stuck in Johnny Silverhand mode from Cyberpunk 77. The propaganda is amped up to 11 like you would expect. Everything about this is either bad or just off. Leaving you a similar bad taste in your mouth that the Matrix 2 did. Only instead of the flavor of body sweat this film leaves you thinking you just got a face full of urine. Far more insulting. Barely cohesive enough to function.Its truly a bizarre sight to see a director so oblivious as to why people liked the original source material. Then again it should not really be that shocking. The matrix never actually was about what the real matrix is. If you were online during those days and somewhat knew these hidden stories that are now the lore of the internet and proto dark web, you would know things like The Black Vault. The Matrix document has NOTHING to do with this franchise and it was basically leeching off something much more fringe and dark. So its that sort of drop off and disrespect for the orignial film from the true source material do you see here with this \"film\" from the Original Matrix movie. Basically unrelated. Simply sharing the same name.Dont bother watching unless you want to be underwhelmed, disappointed by a preachy and bloated vanity project."
    },
    {
      "rating": "0",
      "text": "Parece que Ressurection só tem uma boa fotografia a entregar, o filme carregado de nostalgia para o telespectador não supre as expectativas de um dos blockbusters mais esperados do ano, triste fim para uma das maiores trilogias da história."
    },
    {
      "rating": "3",
      "text": "Netflix-grade expensive 2 hours 28 minutes long feminism advertisement video."
    },
    {
      "rating": "0",
      "text": "Woke trash!There is absolutely no redeeming quality to this train wreck of a \"film\".This is nothing but a corporate cash grab"
    },
    {
      "rating": "2",
      "text": "If I was to sum up my feelings about this film, it would be this: it is a parody of itself. It is a shell of a Matrix movie without the soul of the original. The film is such a departure from the first Matrix movie that the filmmakers needed to constantly insert clips of the original to remind the audience of what they are watching. This film drags on for far too long during the first half, and lacks a cohesive plot. Why did we need this movie?"
    },
    {
      "rating": "0",
      "text": "what a horrible waste of my time and precious hard drive space. the writing is incredibly bad, it feels like fanfic with a budget of a couple millions."
    },
    {
      "rating": "1",
      "text": "No substance. No style. No character. A meme and parody of its former self. Do not make a sequel to this. Start over."
    },
    {
      "rating": "0",
      "text": "After watching the film, I was disappointed. It really turned out to be a half-sequel, half-remake of the original film - that is, the main story is almost the same as in the first part, even some scenes are copied almost frame by frame, only some details are changed and new characters are added, which cannot be compared with the old ones.The original Matrix still looks better and passes the test of time, it is better to revise it (well, the whole trilogy at the same time)."
    },
    {
      "rating": "2",
      "text": "1 for Keanu and 1 for Carrie-Anne that's allWhen I watched this movie, I felt that my childhood was raped."
    },
    {
      "rating": "7",
      "text": "It's not that bad. I like how wachowski got a big dump on marketing team and warner brothers themselves. Not that bad for fanfiction but it's definitely not a sequel."
    },
    {
      "rating": "10",
      "text": "Incredible in very unexpected ways.  Looking forward to watching it again.  There is a lot going on that isn’t just surface deep."
    },
    {
      "rating": "0",
      "text": "A truly horrible movie. The final scene is laughable. The only reason to watch this film is to see how low this franchise has gotten."
    },
    {
      "rating": "1",
      "text": "There is simply no excuse for the sloppy, lazy debacle, that is Matrix Resurrections. Compared to the original masterpiece, this just looks bad. The grading is off, the cinematography is bad, the fight choreography is slow and almost apathetic.The \"powers\", Neo uses, are boring, because is kinda like a one-trick pony. The plot is non-sensical, lacking the drive and clarity, that made the original so mesmerising. You don't care about any of the secondary characters.And I really don't understand why agent Smith does what he does, and why the hell we get an agent in f***ing loafers!!!! And why hell Morpheus is dressed as as pimp!!!The movie also just kinda brushes over what happened after \"Revolutions\" and offers a very vague explanation of why thing are the way, they are.It's just a badly conceived movie with an even worse execution.On the plus side, this is hopefully the last movie in the Matrix-franchise"
    },
    {
      "rating": "2",
      "text": "\"Look how they massacred my boy!\"Is what comes to mind upon finishing this movie. Some fun ideas but none of the amazing aesthetic, tone and storytelling. It felt like the Disney/marvel version of the matrix without the possible charm that could have."
    }
  ]
}