{
  "id": 2031,
  "title": "The Lego Ninjago Movie",
  "starring": [
    "Dave Franco",
    "Justin Theroux"
  ],
  "runtime": 101,
  "genre": [
    "Family",
    "Animation",
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "Six young ninjas are tasked with defending their island home of Ninjago. By night, they’re gifted warriors using their skill and awesome fleet of vehicles to fight villains and monsters. By day, they’re ordinary teens struggling against their greatest enemy....high school.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vUo0pNXGhp2ffTJxiStWt6fHL7F.jpg",
  "categories": {
    "plot": 6.275862068965517,
    "acting": 5.666666666666667,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 7.666666666666667,
    "funny": 5.913043478260869,
    "action": 6.6
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A mediocre film that is ok; this was a somewhat disappointing experience. There are a few solid laughs. but the storyline drags, has clunky moral messaging, and the script lacks the subtle flair of other Lego offerings. Sadly, there is little in the plot to necessitate this being a Lego movie, with a lacklustre script, and the various big names seemed to be under utilised as well. The film looks great, and the cat is brilliant, but otherwise this feels like a marketing exercise to sell Ninjago Lego, rather than a polished and clever story that we've come to expect. 4.78/10"
    },
    {
      "rating": "5",
      "text": "While it does have it's moments, The Lego Ninjago Movie doesn't quite have all the parts and pieces together like in the previous Lego films. Storyline is predictable, Animation is good but not as grand, Characters not all that impressive. Maybe good for a die hard Lego fan but for everyone else not so much"
    },
    {
      "rating": "5",
      "text": "I'd never heard of ninjago but thought i'd give it a shot. It is about a group of power rangerish heroes who battle a vaderish villain for control of city of ninjago.It has some pretty funny moments but is just mediocre as a kids film even.Last 20 minutes is lame pablum ."
    },
    {
      "rating": "6",
      "text": "The Lego Ninjago movie didn't live up to its predecesors. The story became very boring at some point, and the humor wasn't Always funny. The makers have been creative with the Visuals, but the story laks that creativity."
    },
    {
      "rating": "7",
      "text": "It is not the awesome LEGO movie from Chris Pratt but neither the boring Batman one."
    },
    {
      "rating": "9",
      "text": "Unpopular opinions, this is amazing movie, to be honest, come and fight me, everyone! :)"
    },
    {
      "rating": "6",
      "text": "The Lego Ninjago Movie doesn't have what previous theatrical Lego movies have. What makes this movie very lacking compared to The Lego Batman Movie and The Lego Movie is that it wasn't built to make the laughter last longer if someone would see this again and again."
    },
    {
      "rating": "6",
      "text": "The entire movie is just \"eh\". It's an ok movie with amazing animation, good performances and some great laughs, but unfortunly is the weakest LEGO Movie relese in a wild. The experence will be exactly as you expect with The LEGO Movie and The LEGO Batman Movie. At least i enjoy it more than Storks"
    },
    {
      "rating": "6",
      "text": "With a surprising and touching adventure like The Lego Movie, followed by a funny and self-aware hero flick like The Lego Batman Movie, The Lego Ninjago Movie had a lot of expectations to fulfill, both from fans of the Lego sets and moviegoers. While the film boasts some great animation and a few great laughs, The Lego Ninjago Movie is a fairly disappointing but still fun romp through the ever-expanding Lego film universe. If you were expecting a funny but heartfelt adventure populated by the iconic five (or six, now, I guess) ninja, prepare to have those expectations ruined. Aside from Lloyd and Garmadon, there is little to no screentime or character development for anyone on the roster. Considering how well the other two Lego movies have tackled this, I'm surprised the writers dropped the ball so bad. The main four ninja can't even summon the effort to be one-dimensional. If you can't stand Lloyd and prefer the other ninja instead, this is a movie you can skip. Additionally, the action and animation feel a bit lackluster this time around. Instead of the exciting and spectacular chases in The Lego Movie or the hilarious and epic fights in The Lego Batman Movie, we're left with a few mediocre and rather poorly choreographed battles that can't even manage to be particularly hard-to-follow. Confusingly, the funny and clever smoke, fire, and water animation which utilized Lego bricks instead of simple CGI is gone; rather favoring a simpler animation that looks rather ugly at times. Even some of the landscapes aren't Lego. The story was okay, to be honest. It didn't have the heart of the first Lego film, nor the self-aware but also self-contained humor of the second. But the message got its point across, even if the plot itself was very bare-bones and frustrating at times. Lastly, the jokes in this film rely more on parodies, references, and drawn-out gags a lot more than the first two, making it feel like a crummy Marvel movie. While not completely unfunny, it signals a worrying turn for the future of the Lego Movie franchise."
    },
    {
      "rating": "10",
      "text": "When The LEGO Movie first hit theaters in 2014, audiences weren’t prepared for it’s refreshingly fast-paced, eccentric style of comedy nor its surprisingly emotional third act. Now, three years later, Warner Bros. has begun its first step towards building out this unlikely franchise with The LEGO Batman Movie and, now, The LEGO Ninjago Movie, which hits theaters this weekend. While both films have managed to maintain the same comedic style and emotional themes of the original LEGO Movie, they’ve also both shown signs of how quickly this formula can start to wear thin.Fortunately, The LEGO Ninjago Movie has a different enough backdrop and story to keep it from ever becoming too familiar or boring. Based on the LEGO property of the same name, Ninjago keeps the self-referential and parodical style of its two franchise predecessors, but swaps out the underdog and comic book movie settings of those films for a ninja-themed coming-of-age story. The result is an exuberantly told, if occasionally familiar and comedically uneven, story about a family learning how to come together for the first time.Borrowing the same general plot of the Ninjago TV series, the film takes place in the titular island city where the citizens are left constantly in fear of the frequent destructive takeover attempts by the evil Lord Garmadon (Justin Theroux), a maniacal warlord hellbent on ruling over the city and everyone in it. And when the film begins, the only obstacles in his way are a team of six young ninja, led by Garmadon’s personal archenemy, the mysterious Green Ninja."
    },
    {
      "rating": "0",
      "text": "La peor pelicula de Lego Que He Visto En Mi Puta Vida, es malisma, aburrida, repetitiva, y muy olvidable un 0 es lo que se merece, maldito Warner, devuelveme mi dinero"
    },
    {
      "rating": "6",
      "text": "\"The LEGO Ninjago Movie\" turned out to be a slight injury, but also a slight success, the characters were good, less Garmadon, how dare they play a villain role?, that was the guason in the Batman movie, and the story and effects are good, but How do you dare put a kitten as an enemy?, because the exaggerated creativity ended up affecting the film."
    },
    {
      "rating": "8",
      "text": "Great movie! The Lego Ninjago Movie is not quite the must-see that its predecessors were, but it is still hilarious and it's plot is pretty good. I recommend it!"
    },
    {
      "rating": "6",
      "text": "How soon can you say that you will bore your audience with your own franchise? I think Lego can answer that with its new movie; The Lego Ninjago Movie and don't misunderstand me, this movie is not a failure in every sense of the word or a disappointment, it is simply that what worked so well in The Lego Movie and The Lego Batman Movie is not present in this one.Yes it does have a good dose of comedy, the animation is still excellent, the movie is entertaining but it does not feel different, it does not feel better, it does not feel like something has advanced especially because the movie never seems to be sure which direction is trying to follow, what we see seems only a succession of gags that lack order.Is it worth it? yes, you can watch it without complications and have a pleasant time but in my personal opinion this entry stayed short and very far from its predecessors."
    },
    {
      "rating": "10",
      "text": "Before delving into the merits of “The Lego Ninjago Movie,” it’s worth pausing to reflect on just how remarkable it is that the third film in a cinematic franchise based on plastic children’s construction toys comes with high expectations attached. Before Lego launched its own film empire, other toy companies like Hasbro had established assembly lines of often profitable, invariably awful branded theatrical entertainments, and there was no reason to expect anything different from Lego. Yet 2014’s “The Lego Movie” and last spring’s “The Lego Batman Movie” surprised just about everyone by being smart, sophisticated, cognizant of their own synergistic origins, and most importantly, actual movies. That the Lego Cinematic Universe (LCU) became a recognizable acronym isn’t surprising; that it came to signify quality is almost miraculous.Superficially, “Ninjago” is very much in line with its predecessors. Based on Lego’s ninja-themed original property – already a Cartoon Network TV show – the film is a hyperkinetic assault of eye-catching faux stop-motion animation; packed with clever, self-aware, and sometimes boldly absurdist humor; and all anchored by a father-son conflict that the film takes more seriously than is strictly necessary. Yet for the first time, the franchise’s house-style is beginning to show signs of wear. Whereas “The Lego Movie” and “Lego Batman” seemed to come by their cheeky irreverence naturally, the sketchier “Ninjago” sometimes strains to keep up the pace, with its anarchic sensibility now having the air of a mandate – and few tones are harder to maintain than “mandatory irreverence.” Still plenty entertaining and occasionally very funny, “Ninjago” nonetheless displays symptoms of diminishing returns, and Lego might want to shuffle its pieces a bit before building yet another film with this same model."
    },
    {
      "rating": "10",
      "text": "I do not understand negative reviews. The movie is fun. Animations are great, the plot is good. the movie really feels like you took Transformers and mixed it with Lego. nothing really to complain about. i will buy it once it is available on Blu-Ray."
    },
    {
      "rating": "7",
      "text": "Personally, I think the lukewarm response to this film is a little much. Yes, it's definitely the weakest LEGO installment thus far, but I wouldn't go so far as to call it mediocre, like what many critics and others have been saying so far. I still found it to be quite enjoyable and amusing for the majority of it, and it still has that zany style that the previous two installments employed. But yes, I will admit that it has become a bit formulaic at this point. Nonetheless, it was still an overall enjoyable experience for me, even if it didn't have me laughing out loud too much like 'The Lego Movie' and 'The Lego Batman Movie' did for me."
    },
    {
      "rating": "10",
      "text": "Why is this getting so much hate?! The story may not be as strong as that of Lego and Lego Batman, but the humor, total goofiness, and colorful supporting characters still have their wit and are enjoyable. I have to give this a 10 because of the highly underwhelming 4.9, it's still an enjoyable movie made of Legos, just like the first two!"
    },
    {
      "rating": "7",
      "text": "The LEGO series strikes again. Ninjago is a (perhaps un)surprisingly poignant family tale with ninjas, robots and Jackie Chan. It shares its same striking stop-motion style with the other films but is somewhat narrower in scope, being a character-examining drama like LEGO Batman but lacking the same sense of wonder as the first film, probably only because it's the third one and we're not quite as amazed by the fact that LEGO movies exist anymore."
    },
    {
      "rating": "6",
      "text": "Лего Ниндзяго фильм- хороший, но одноразовый фильм. После таких фильмов, как Лего Бетмен и Лего фильм, ожидаешь крутой фильм, но выходит, что-то среднее. В фильме очень много рекламы игрушек. История отца и ребенка, уже всем надоела, поэтому здесь эта история не работает, как прежде. Фильм довольно средний детям понравиться, но взрослые будут скучать!"
    },
    {
      "rating": "10",
      "text": "The LEGO Ninjago Movie, a big comeback. When the LEGO movie hit the 2014 goal, and the LEGO Batman movie hit the 2017 goal, hopefully the LEGO Ninjago movie can hit the goal,funny and entertaining."
    },
    {
      "rating": "6",
      "text": "Better than Lego Batman with some quite funny stuff though inconsistent. Great animation."
    },
    {
      "rating": "2",
      "text": "Ninjago was a pretty generic kids animated movie that fails to be anything special or anything memorable. It was just a bland quick-release intended to capitalize on the Lego film franchise craze, which thankfully died out, and it honestly shows. The story is so on the nose that it couldn't possibly be any more straightforward. The characters are as uninteresting as the plot and the jokes couldn't even make my young nephew laugh."
    },
    {
      "rating": "7",
      "text": "As Gotg Vol.2 told us:\"There are 2 types of human beings in this this world: Those who dance,and those who don't.\". This is how i would describe the quality of The LEGO Ninjago Movie. A (half) disappointment.Though its quality doesn't make it a true block-buster (just like the wonders of The LEGO Movie or the Bat-giggles of LEGO Batman),there's not that much to talk about issue-wise,given the fact that it's a Warner movie,and they usually have things under control. The plot of this movie is something you most likely don't want to mess with at times,altough it gets confusing,and it HARDLY tries to reach Pixar levels of emotion with its morals. Act 1 felt a bit Batman V Superman-ish tone-wise,but it still managed to be fun,as the jokes rolled in. Getting to the 2nd and 3rd act probably made the movie more energetic,as it was getting more and more interesting. Lloyd and Lord Garmadon luckily do something in the movie,but what about the other charachters (you know,Kai,Zane,Nya,Sensei and the others)? Oh yeah,they're just there to sell some atrocious puns (especially Zane. I get it,he's a robot,but the more puns he was saying,the more i was quickly putting them into Batman And Robin zone. Ever heard of 'Ice is nice'?). There's also a giant cat in some scenes,and that's one of the moments where the audience TRULY bursted out of laughter. And,as i said,the morals were pretty surprising for a kids' flick (yeah,ok,we already saw the 'try and get along with your'...Wait,try living without weapons and wars? A Cars 3-ish moral about being a trainer? Am i looking at Warner Bros. or is this Pixar?!?)The animation is still great,even if you expected it,so yay? Tho,i was disappointed with some pieces of it,like the water and the forest being traditional and only Ninjago City being the only thing filled with LEGO.There are some issues,as i said,with this movie. One of them being the score by Mark Mothersbaugh (SO. OUT. OF. PLACE.) and also the jokes,where it's a hit-or-miss.The LEGO Ninjago Movie is definetly the worst LEGO Movie i saw so far,but that doesn't stop it from having a charming story and some decent jokes,as well as a bright animation. If they don't get The LEGO Movie Sequel right,then this and LEGO Ninjago could potentially be signs of  the apocalypse for the 'now' LEGO Movie Franchise,but for now,let's enjoy our lives."
    },
    {
      "rating": "6",
      "text": "Very AverageThe LEGO Ninjago Movie May have some creativity and funny lines, But unlike the 2014 film or LEGO Batman, This one’s pretty much only for kids and that’s a damn shame."
    },
    {
      "rating": "2",
      "text": "Jackie Chen is angry at his cat for a recent scar to his hand, and he hijacks the LEGO Ninjago story to portray the feline as a city-destructing monster. The film is so painful to watch (thanks to incessant bad comedy and jittery animation) that I only managed to watch any of it because my daughter was prodding me to wake up. The sour cherry on the sugarfree cake was the use of non-diegetic objects such as the laser pen and the above-mentioned feline. Number one rule for audience immersion is to not break consistency. And having the real-life cat appearing in an otherwise LEGO-based world (named Legoscope - I see what you did there) is all against the rules of consistency. My 11year old son claimed that the series is much better - take his word for it and stick to TV."
    },
    {
      "rating": "5",
      "text": "a seven... point... arm ripped off.. The LEGO Ninjago MovieIt's strength lies within the earthiness and a sense of amusement towards the outer reality; that a regular LEGO movie consists, along with the runtime which helps the movie flow but it still doesn't make it a smart movie with anything new to offer except for some relationship drama; which frankly the audience is familiar with. Justin Theroux shines all over the movie as Garmadon; the evil lord whose son i.e. Dave Franco as Lloyd, apparently battles against him. But the Jackie Chan here plays as a masterful trump card as Dave Franco's mentor Master Wu who is also the creator of the LEGO world and has a perfect comic timing with some good one-liners. The LEGO Ninjago Movie is barely standing on the script and more on the mockery which leads to the disappointment if taken the previous LEGO movies in account but still it's amusing screenplay and fast pacing won't let you regret any of it. It had a smart idea and a great cast but a disappointing climax."
    },
    {
      "rating": "4",
      "text": "Disappointing to say the least.  This movie adds silly aspects that don't make a whole lot of sense at all.  The story is bland and this film just doesn't have that feel we got from it's predecessors.Rating: F"
    },
    {
      "rating": "9",
      "text": "Laa-Loyd and his friends are soo funny! Admittedly, I started watching it because I was too lazy to get the remote... but I found myself LAUGHING HARD every minute.   I mean, if you give this a poor rating check your pulse!Let us not forget this is 'animated', which in itself is a work of art.  And the cast... Everyone is awesome!"
    },
    {
      "rating": "4",
      "text": "The worst lego movie so far. Had none of the charm of the original and was just a boring high school comedy for kids most of the way through."
    },
    {
      "rating": "4",
      "text": "Una vergüenza la película. Si bien es graciosa a veces, la animación es muy cutre, Garmadon (uno de los mejores villanos en mi opinión) lo hacen quedar en ridículo con lo débil que es y el gato ese del final no combina para nada. Ademas la historia es mala, al igual que la música y hay muchas inconsistencias con respecto a la serie. Mejor véanse la serie original, esta película es una decepción total."
    },
    {
      "rating": "6",
      "text": "Forget the ninjas, the robots, and the giant cat; THE LEGO NINJAGO MOVIE is about a son willing to sacrifice himself to salvage his evil dad. Evil cannot be stopped, it always finds a way to return - but it can be changed, transformed into an agent of good, and thus is evil conquered."
    },
    {
      "rating": "6",
      "text": "It's really corny at the beginning and the ending and also really boring. This isn't as good as what I had seen in the Lego Ninjago Tv Series"
    },
    {
      "rating": "7",
      "text": "Another lego film - not as funny as previous ones perhaps but still amusing at times never the less and very entertaining overall. It features more good CGI and is a good family friendly film, with some music referenced that might appeal to the adults, while the visual effects etc. will appeal to kids. A good bit of fun I'd recommend, yes."
    },
    {
      "rating": "2",
      "text": "this movie to me seems so lazy. Warner bros are clinging onto the success of the first lego movie by hoping that these new movies would do the same but in reality they are getting stale. I couldn't watch this all the way through because of how boring and pointless this film was. The characters were not likeable in any way, the comedy was not funny and the story was messy. The only positive i can find in this movie is that the animation is beautiful and that is it."
    },
    {
      "rating": "9",
      "text": "This may not be on the level on the other 3 lego movies but its still enjoyable and funny."
    },
    {
      "rating": "10",
      "text": "LEGO Ninjago Movie, большое возвращение. Когда фильм LEGO достигнет цели 2014 года, а фильм LEGO Batman достигнет цели 2017 года, мы будем надеяться, что фильм LEGO Ninjago сможет достичь цели, забавный и развлекательный."
    },
    {
      "rating": "5",
      "text": "Has the lego franchise already lost its flame? This movie is reusing an old show for nostalgia in younger viewers in order to sell more tickets. It lacks what the old show did and what its predecessor movies had."
    },
    {
      "rating": "10",
      "text": "a masterful movie for any former lego fanpros- great animated graphics even if cartoonish- kid friendly- adult needed - plot was perfect- environment was appealing to anyone - a minor but very great superhero team- lot of wisdom cons- virtually none"
    },
    {
      "rating": "10",
      "text": ""
    },
    {
      "rating": "0",
      "text": "Is this a movie! Once again, I will see the wall and not watch this movie The sound performance is very bad and the animation is bad. I advise everyone not to watch this nonsense"
    },
    {
      "rating": "10",
      "text": "It feels so rightI'm where I belong'Cause I found my placeI found my place(Hi-ya!)What a rideI knew I was strongNow I found my placeI found my place"
    }
  ],
  "recommendations": [
    "the_lego_batman_movie",
    "guardians_of_the_galaxy",
    "hotel_transylvania_3_summer_vacation",
    "penguins_of_madagascar",
    "the_lego_movie",
    "incredibles_2",
    "tmnt",
    "thor_ragnarok",
    "bumblebee",
    "despicable_me_2",
    "the_lego_movie_2_the_second_part",
    "kung_fu_panda_2",
    "my_little_pony_the_movie",
    "monsters_university",
    "minions",
    "cloudy_with_a_chance_of_meatballs_2",
    "hotel_transylvania_2",
    "turbo",
    "peter_rabbit",
    "the_a_team",
    "deadpool",
    "free_birds",
    "megamind",
    "shazam_fury_of_the_gods",
    "justice_league"
  ]
}