{
  "id": 3798,
  "title": "The Jungle Book 2",
  "starring": [
    "Haley Joel Osment",
    "John Goodman"
  ],
  "runtime": 72,
  "genre": [
    "Family",
    "Animation",
    "Adventure"
  ],
  "description": "Mowgli has been living in the man-village with his little stepbrother Ranjan and his best friend Shanti. But the man-cub still has that jungle rhythm in his heart, and he misses his old buddies Baloo and Bagheera. When Mowgli wanders back to the wild for some swingin' fun, he soon finds the man-eating tiger Shere Khan is lurking in the shadows and planning his revenge.",
  "releaseYear": "2003",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/DhuskQc9lSjPiYKr9hy0AZ7uiC.jpg",
  "categories": {
    "plot": 1.4444444444444444,
    "acting": 1.5,
    "ending": 5.0,
    "soundtrack": 1.5,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "When I first saw this movie as a kid, I loved it, but now that I'm older, I can see how it's actually a disgrace to the first movie, which I still love."
    },
    {
      "rating": "0",
      "text": "I love the original Jungle Book. It's one of my favourite childhood movies and I still consider it one of the best animated movies of all time. It had great songs, unforgettable characters and animation that still holds up pretty well. This movie has songs that are mostly forgettable, one-dimensional characters, and mediocre animation. John Goodman gives it his all, but there's only so much he can do with a script that is so content to steal from the original. Baloo the bear has been made into a bland parody of himself, Bagheera does nothing but nag constantly and Mowgli has lost any character that he had. Overall, this is pretty much any inferior copy of the original. If you want a good version of Rudyard Kipling's book, either watch the first movie or the recent remake. Both are much better than this."
    },
    {
      "rating": "2",
      "text": "I was a huge fan of the original. This however, is simply horrendous. I don't remember much about the movie, however I do remember that I thoroughly hated it! I remember stating it was the \"worst movie I had ever seen!\" Appalling!"
    },
    {
      "rating": "5",
      "text": "This sequel is just an exact replica of the original, but it is not nearly as amusing the second time"
    },
    {
      "rating": "7",
      "text": "I enjoy it. I'm not pure anti-Disney sequel, this could have been made a direct-to-video instead theatrical release, but this is better than the first one."
    },
    {
      "rating": "3",
      "text": "I love the original Jungle Book. It's one of my favourite childhood movies and I still consider it one of the best animated movies of all time. It had great songs, unforgettable characters and animation that still holds up pretty well. This movie has songs that are mostly forgettable, one-dimensional characters, and mediocre animation. John Goodman gives it his all, but there's only so much he can do with a script that is so content to steal from the original. Baloo the bear has been made into a bland parody of himself, Bagheera does nothing but nag constantly and Mowgli has lost any character that he had. Overall, this is pretty much any inferior copy of the original. If you want a good version of Rudyard Kipling's book, either watch the first movie or the recent remake. Both are much better than this."
    },
    {
      "rating": "4",
      "text": "This was just an exact replica of the original Jungle Book that would only work for kids of the 90's and it should've been straight on to video instead of being theatrical."
    },
    {
      "rating": "3",
      "text": "Due to the relevancy of the recent remake, I decided to pay a retrospective to the original  classic from 1967. Unfortunately since it is not available for review, I am stuck reviewing the sequel. This was made during the time when Disney was in clear financial ruin so they had to make many direct-to-DVD and Video sequels to get a profit for their box office performances. This sequel unfortunately reflects the quality of most of these sequels though. It is a shame because some effort was put into the production side of things. The animation is bright and colorful with an attempt to put some attention to detail. The voice talents also try to add life to the performances. John Goodman, Tony Jay, Jim Cummings, and Haley Joel Osmond do an admirable job at replacing the original voice cast. Unfortunately their talents are wasted in a script that has no passion behind it. Granted the opening title sequence was creative with the shadow puppet animation but no other bits of the film follow that line of creativity. On top of that, the new characters that has been introduced are either annoying or inconsequential to the plot. The new musical numbers are also generic. Granted this film is inoffensive to the younger children watching this but they are better off sticking to the original."
    },
    {
      "rating": "1",
      "text": "I loved the original Jungle Book film that I watched as a child and adult. So much so I thought I could take a look of this sequel created by Disneytoon Studios. However as I watched it, I was not impressed. The story is unoriginal, pointless, lackluster, and predictable. Even the plot is reminiscent to the original, making the film less entertaining and flat. The personalities of every character in the sequel were hammered down just for the sequel. The music is also unoriginal and cringy, making the songs unlistenable. The Bare Necessities was played 4 times without a point and that made me sick. Mowgli and Shanti doesn't look like they are really into each other as boyfriend and girlfriend because he had still cared much about the jungle where he grew up with the wolves, which is heartbreaking. Also they never kissed in the movie, which was very disappointing because I was expecting for them to have a real close relationship for each other after Shanti purposely brought Mowgli into the man village with her stalking girl eyes from the last movie. Now the worst of all this is that the film is INDEED pointless. Disney's Disneytoon Studios never inteneded to make this movie to smile their audience or entertain them. They just did it only to get over $100 M, in which that was surprising, giving that the original movie was also successful. But I think it's best for this movie to NOT be made, or maybe it would've been re-written as an animated short by Walt Disney Animation Studios. Because if it was an animated short film, it would've been a better, well-written, joyful, purposely entertaining, appealing, and fun short film sequel with Mowgli and Shanti having a stronger and close relationship. Despite all the negatives I can find in The Jungle Book 2, I do have the positives to give out. The voice acting was surprisingly great for most characters in the film, and the animation was top-notched for modern day traditional animation similar to Walt Disney Animation Studios' animation style. But that's really all the positives I can give to this movie. Overall, this movie is a waste of time and you better think twice before you watch it because you won't like this one. Just always watch the original and/or the new remake that was equally pleasing and fun as the original. **** Disney sequels and this one."
    },
    {
      "rating": "3",
      "text": "EmbarrassingThough Goodman as Baloo was really good casting, This sequel to The Jungle Book is a near insult to the original."
    },
    {
      "rating": "2",
      "text": "Not sure why they made this movie. It was very boring and the music sucked too. It almost seemed like they were trying to ruin a classic."
    },
    {
      "rating": "0",
      "text": "It amazes me how Disney decides to make things worse and ruin one of their best movies in years."
    }
  ]
}