{"id": 542, "title": "The Tax Collector", "starring": ["Bobby Soto", "Cinthya Carmona"], "runtime": 95, "genre": ["Action", "Crime", "Drama"], "description": "David Cuevas is a family man who works as a gangland tax collector for high ranking Los Angeles gang members. He makes collections across the city with his partner Creeper making sure people pay up or will see retaliation. An old threat returns to Los Angeles that puts everything David loves in harm’s way.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3eg0kGC2Xh0vhydJHO37Sp4cmMt.jpg", "categories": {"plot": 4.583333333333333, "acting": 4.517241379310345, "ending": 3.8, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0, "action": 6.230769230769231}, "reviews": [{"rating": "3", "text": "I really like all of David Ayer’s films, and at least Suicide Squad has style, but this is just boring and ugly and bland. Disappointing."}, {"rating": "3", "text": "This is the worst episode of Mayans ever. Seriously, this is crap. No idea who the lead is, but it ain't Mr. The Beef. David sucks. The character and the actor. He has no gravitas whatsoever. The bad guy is so over the top, he could be in the next Far Cry. I think this is simply a casualty of the pandemic. I should have known since it was so.cheap on Amazon, but I still want my money back. Ive seen better Tele novela plots."}, {"rating": "3", "text": "The funny thing is Shia got a real full chest tat for this movie that he completely sucked in. The \"karate kid\" type ending was stupid af. Best part is when Shia gets his head bashed in, best acting job hes ever done."}, {"rating": "4", "text": "Have you SEEN the crap loading on Netflix lately? Like the $5 bin at Walmart.At least THIS movie kept me awake and interested. Creeper character should have stayed in to the end.  Not anything original in the overdone cartel plot and it was a murky “totally bad psycho guys” versus “not totally bad guys who actually had a code of honor among thieves” BUT:  still worth watching.I love seeing the general audience reviews when they flip off the so called, pompous, woke “official” critics."}, {"rating": "7", "text": "This movie was entirely passable, it was no Training Day, but not garbage either. Worse ways to spend 2 hrs. I also liked Bright, a lot, so sue me."}, {"rating": "9", "text": "I watched this as soon as it dropped on Amazon at 2am. Short and sweet review. A slow burn crime thriller. Solid acting. A handful of legit action/gun shootouts. I’ll say it’s no Shooter, but it stands on its own feet. Awesome antagonist. I’m not disappointed with my purchase. I’d recommend not listening to these negative reviews. I personally loved it and I’m all about crime/gangster films. I’m not gonna say it will win any awards, but for 2020 it’s dope."}, {"rating": "9", "text": "FIRE!! LaBeouf & Soto GREAT, George Lopez was AUTHENTIC, and Conejo was THAT BOY. If you can’t relate to this, it’ll hit different. Best Gangster Film I’ve seen in a while."}, {"rating": "2", "text": "Based on the trailer this seemed okay.I was quite wrong. Narratively derivative, unpleasantly paced and just an overall misguided mess. The casting choices and performance choices made by certain actors are also pretty dreadful. Avoid."}, {"rating": "9", "text": "Modern Day Life of Street Gangs. Shia Labeouf character was my favorite. It’s like when Actor Al Pacino played Tony Montana in “Scare Face” 80’s Cuban persona"}, {"rating": "10", "text": "Creeper: Open your mouth![puts his gun in the man’s mouth]David: He’ll splatter your brains, and I don’t want that.Creeper: I do. I want that."}, {"rating": "9", "text": "Good movie, but way to short needs more they needed to slow it down best actor was conejo."}, {"rating": "10", "text": "Love watching these types of movies. Who knew I wanted to see George Lopez In this type of role."}, {"rating": "10", "text": "I loved it. Finally a movie that kept me on the edge. I would have liked to see Creeper ride until the end of the movie but still enjoyed the foundation of loyalty none the less."}, {"rating": "9", "text": "Slow at the beginning but it let you see so much about gang member and then the action starts and it goes wild. Please don't be a baby and think this goes against latinos. I am one myself and i did not complain about the movie. I hope you will enjoy it as much as I did."}, {"rating": "10", "text": "You have to be latino or know about the situation before you watch this, its bout the best movie you can watch especially when bloods lock in the best part!"}, {"rating": "8", "text": "This film depicts an old style of chicano culture found through LA, with families associated with gangs or the cartel. Most Meta reviewers are Caucasians that think right off the bat think that the film is racist and full of stereotypes, but have no idea what it was like living in the ghetto or the projects in California. From La to Oakland drugs, money, and violence has plagued the streets, but nothing matches to what the cartel or Mexican, Hispanic, Chicano gangs are capable of and this film shows that true darkside of it all. Images that you only could find on bestgore rides through this movie keeping focused on every character especially Shia LaBeouf's. Kreeper is just a straight up sicario and just by watching his character you can feel the natural psycho extert off Shia and realize why Hollywood won't give him roles anymore and its just because he makes it feel too really. The gruesomeness throughout film just reminds you of what Mexico deals with on the regular and could not imagine this happening today in California since it takes place in the ghettos of LA. But the movie did fall short with feeling rushed kind of loosing character development and moving so quick that it felt like you missed so much from the main characters that weren't kreeper. But the film was overall enjoyable and not the worst thing that has been released this year and can find yourself relating to the film if you grew around the a ghetto area because thats the only way you'd figure out if they just straight stereotyped everyone in the film which they did not because the main characters wife works for a large company and is actually the smart one since she handles the accounts or if thats really how they act at times. The film could have been better, but i was glad to see something realistic instead of a special effects film that makes no sense for once. So all and all I recommend this film much more than anything Netflix is making at the moment."}, {"rating": "2", "text": "No issues with the cast but you can only take such mediocre material so far and try as they might, They just couldn't make it work. The story is your generic plot that we have seen time and time again, the characters too shallow due to awful writing and there is also a severe lack of action in this \"action\" film, which honestly relies more on drama than anything else to get a point across. You're honestly better off not wasting your time on this."}, {"rating": "10", "text": "Thought the movie was great, definitely going to buy the film on dvd when it comes out to watch again."}, {"rating": "2", "text": "For those clamoring for David Ayer's cut of \"Suicide Squad,\" watch this and you'll change your tune."}, {"rating": "2", "text": "So Shia, you killed stray dogs in preparation for this movie in order to get into the mind of a murder? You also tattooed your chest, which is real by the way, for the role. Was it worth it? Nah, I don't think so.'The Tax Collector' is hot trash fire. Such a boring movie with no characters to attach yourself to. A very obnoxiousness movie as well. David Ayer is a hack fraud of a director. I've lost all faith in him to make anything decent again. Any new movie he releases in the future, am not interested."}, {"rating": "3", "text": "While I like Shia Lebouf and his acting was ok here, the other actors - most of them - the acting felt so bad. At times I felt like I'm watching Spanish telenovela level acting from 90s. The story was kinda all over the place too and while I had heard the movie was bad, by what I saw in trailer I thought ok probably just people not liking some parts of it but yeah in the end I found it too boring for good action movie (given that I allow action movies have a bit worse plots if they have good action) and too weak plot for any drama etc. Plus the bad acting or whatever it was (felt like it, maybe how it was made or dialogue on its own felt bad) made it worse.I'm only putting 3 here as I managed to watch it all."}, {"rating": "6", "text": "I'll keep it short & simple.It's a cool action movie a decent one but had potential to be much better.Best thing is we have never seen Shia LaBeouf like this this was pretty cool."}, {"rating": "3", "text": "In terms of entertainment, frankly there isn't much, especially when Ayer's approach seems more interested in exalting the deplorable narcoculture, in addition to the fact that the conflict is practically as predictable as it is unsatisfactory.Another problem results from its Latino cast, which gets the opportunity to be the lead characters and unfortunately re-nurtures the idea that in the Latino community everyone is either a gardener, a gang member or a cartel member.The Tax Collector doesn't contribute anything relevant or exciting and is perhaps David Ayer's most disappointing work to date.Here the only name that deserves mention is Shia LaBeouf and it's not because he does much with the character but because of his commitment to the role. Something known in him, and even if the material is poor, the guy works."}, {"rating": "1", "text": "Just a complete waste of time. From terrible performances to unfulfilling tension. Skip this all together."}, {"rating": "6", "text": "No action at all till the very end. Trailer made creeper and david seem so badass but they hardly did anything in the movie except stand around looking tough and saying things to look tough. You never get to see them in action to show why they were so feared except for like two 10 second scenes of creeper's flashbacks. All they did the whole movie was go around and collect money from the gangs. The whole time I was waiting for something climatic. However the acting was great! Probably the best thing about the movie."}, {"rating": "8", "text": "Trust the audience score across the board. It's not a masterclass in character development, nor should it be. It's a solid action flick, great acting, well shot, and a fun ride! If Shia's character was not outrage fuel, the critics would probably review it higher. Why do our favorite comedies and action flicks always get bad reviews? Because people get paid money to jump on bandwagons and crap on our taste. Watch this movie, I'll bet you like it."}, {"rating": "2", "text": "This movie was an absolute let down with an out of no where ending and the movie didnt do justice to the character of Shia LaBeouf.The bad ass who dies in the first gun fight."}, {"rating": "1", "text": "Let me just say this movie is all over the place. Hard to read the context and the ending in my opinion was just not good."}, {"rating": "9", "text": "The vivid realization of what goes on in the underworld of gangs is thrilling , could go for a bit more bloodshed on the collectors part , and a bit less of the politics but it was overall a good movie id watch again, hope ayers puts out more like this , cause whats considered to be movies in this day and age are trash, tired of the monotonous cliched action thrillers that are usually made. Need more like this showing the dark grizzley side of things . and this movie shoulda been made into a tv series instead ahowing the coming up of the tax collectors woulda been a series that would be exciting to watch"}, {"rating": "4", "text": "1 word to some up this dark underbelly story. Dissapointing. All the makings where there but it falls flat pretty quickly, the diologe felt quite cheesey and forced and the only character who felt they had a presence was Creeper who was nothing really but a suit flapping hard arse with no real progression. Craptacular!"}], "recommendations": ["jumper", "the_old_guard", "next", "polar", "the_marine", "suicide_squad", "poseidon", "the_a_team", "shadow_in_the_cloud", "terminator_genisys", "lockout", "the_guardian", "red_dawn", "abduction", "nobody", "i_am_number_four", "gamer", "the_twilight_saga_breaking_dawn_part_1", "wild_card", "kingsman_the_golden_circle", "the_twilight_saga_eclipse", "dark_phoenix", "teenage_mutant_ninja_turtles", "hancock", "national_treasure_book_of_secrets"]}