{"id": 4755, "title": "The Assassination of Jesse James by the Coward Robert Ford", "starring": ["Brad Pitt", "Casey Affleck"], "runtime": 160, "genre": ["Action", "Drama", "Western"], "description": "Outlaw Jesse James is rumored to be the 'fastest gun in the West'. An eager recruit into James' notorious gang, Robert Ford eventually grows jealous of the famed outlaw and, when Robert and his brother sense an opportunity to kill James, their murderous action elevates their target to near mythical status.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/2d1S6fJS80fvseg6mJE8eq5o7Kx.jpg", "categories": {"plot": 7.733333333333333, "acting": 7.804878048780488, "ending": 9.0, "soundtrack": 9.571428571428571, "cinematography": 8.9, "familyFriendly": 3.0, "funny": 5.0, "action": 8.6}, "reviews": [{"rating": "8", "text": "U have to be very psychologically prepared for this drama feast of fabolous performance by Casey Affleck and ofcourse Brad Pitt. At first, the movie seems hard to be watched but as time passes (movie last for about 3 hours) u become more curious 'bout things that would eventually happen, though aware what will be in the end. Name of the movie itself is the mini-synopsis, but this one is definitely slow-paced drama NOT written for mass audience. For what is worth its not commercial..."}, {"rating": "10", "text": "Phenomenal film. Aimed at people who aren't stricken with, how should I say, stupidity. The Assassination of Jesse James is why I watch movies in the first place. There's no good or bad guy, the audience is not asked to pick sides, but only to witness the path that these two men have placed themselves upon. The film is beyond gorgeous, and evokes a certain awe during each and every scene. Casey Affleck gives the performance of a lifetime. Just see it if you're not retarded."}, {"rating": "8", "text": "A good movie that I'm sure was a flop at the box office. It's too long, too thoughtful, too nuanced, and too talky for most viewers. It's another Scott father son vehicle, and like the recent \"The Grey\" it's focus is on the underlying themes and not the overt action. The movie does dispense with the \"Jesse James was a hero\" pretty conclusively after he beats a young boy, and we all know what's coming (don't take off that gun belt Jesse; don't dust that painting) and while his death was long past necessary his killer went on to infamy and also an assasinators bullets. Casey Affleck is great as a whispy hero worshipper who slowly develops traitorous thoughts. Pitt continues his under valued work as a very competent performer, but the kudos should go to the direction. Beautifully filmed, scored, and dialogued. Not a film for those with ADHD."}, {"rating": "8", "text": "The Assassination of Jesse James by the Coward Robert Ford is a masterful, slow-burn piece of revisionist western art. Static camera work, detailed acting and inferred subtexts are order of the day here, with almost no gunplay to speak of. The tone is nailed just right and the acting is phenomenal. The assassination of Jesse James by the Coward Robert Ford is intriguing stuff indeed."}, {"rating": "10", "text": "A flawless meditation of a time literally brought to life through skillful acting, immaculate research and a knowing understanding of the not too distant past."}, {"rating": "9", "text": "This western meditation on the perils of celebrity is certainly one of the best films of 2007. There is no denying the integrity and subseqent execution of Mr. Dominik's most singular vision; with this film he has elevated himself to the fore of American filmmakers. And I might add that Casey Affleck gives perhaps the performance of the year."}, {"rating": "10", "text": "An excellent film. Its plodding pace mirrors the slow boil of youthful fantasy turned matured disillusionment. Affleck is perfectly cast as the designing, dangerous Ford. Pitt possesses greater range than I have previously given him credit for with a wonderfully deep performance. Rockwell continues to inhabit his on-screen personas with such ease and skill; he's frighteningly good to watch."}, {"rating": "10", "text": "One of the films of the year. It blew me away with the masterful cinematography; there are some powerful shots in this. Say what you will of Brad Pitt, but he is a good actor. I must say I was surprised by Casey Affleck having 100 times the talent of his brother. I saw Atonement, and I still believe that a few of their Oscar nods should be replaced with this masterwork."}, {"rating": "9", "text": "Slow, yes. But brilliant, too."}, {"rating": "9", "text": "Id like to see it again. A fantastic movie, such a beuatiful portrayal by Affleck (Pitt is also good). The interplay between James and his killer was brilliantly drawn out, how I long to see movies like this where you actually get to know the person and their frailties without having it shoved in your face by obvious dialogue. It was quite long a la LOTR, but i respect that because it didnt end where we expected it to. I cant help feeling this film draws parallels with two of my other favourite films and predecessors in the Western (style) genre, The Proposition and Dead Man. Nick Cave wrote The Proposition and Warren Ellis its score. Beautifully slow cinematography and exceptional realism take you right back to the mid-19th century. Just lovely to watch."}, {"rating": "9", "text": "I had no idea what I was walking into when I went to see this. Some people might find this film slow or boring, but I was glued to my seat for the entire duration. It is very emotionally intense, and if you really get into it, it won't seem nearly as long as it really is."}, {"rating": "10", "text": "an instant classic western anyone who rates this movie poorly has no taste! Seriously I am surprised more people aren't talking about this movie. I guess real movies (not crap edited down to 100 minutes) aren't suited for today's audience. Watch it!"}, {"rating": "9", "text": "really a terrific atmospheric western. like nothing you're gonna see around right now. there are more than a few movie watchers who won't be alble to handle it , so beware."}, {"rating": "10", "text": "I was a little hesitant to purchase this D.V.D., considering the fact that I don't like western films at all. However, knowing that the movie was based on historical facts encouraged me to go ahead and take a chance. All I can say is WOW! I've never seen a movie with more intense visuals, a better sound track, or more intense acting performances! This isn't a movie, it's a masterpiece of art on the Widescreen! The adaptation of the story is phenomenal, the panorama of the visuals is amazing, and the soundtrack is haunting. Casey Affleck gives the performance of a lifetime as the nit-witted, apparently harmless, yet ruthless Robert Ford, and Brad Pitt plays the part of Jesse James to perfection. In fact, all the acting performances in this movie are top notch, not to mention the fact that the cinematography is out of this world, the sound track is hauntingly surrealistic, and the story itself compelling. While watching this movie, I felt as if I myself had been transported back in time to 1881, and was watching the whole drama unfold before my very eyes! Incredible!!!!!"}, {"rating": "9", "text": "Not only was it beautifully shot- the music also fitted effortlessly and dramatised the effect. You can listen in full to the Nick Cave soundtrack and listen to director Andrew Domink's playlist on the Last.fm Jesse James group page- have a look! Join the group and lots of goodies to win."}, {"rating": "10", "text": "Excellent movie, no hollywood-flick but an emotional, historically correct masterpiece, that builds it's tension not by surprising plot-twists (everyone actually knows how the story goes) but by the great atmosphere, cinematography, the A+ musical score, the acting, cought in long, brilliant close-ups. If you're easily bored and rather entertained by car-chases and explosions, and you don't like the setting, than this film is indeed not recommended for you."}, {"rating": "9", "text": "Excellent movie! Casey Affleck was superb."}, {"rating": "9", "text": "One of my favorite films this year so far. Beautiful cinematography and scenery, great soundtrack by Nick Cave and Warren Ellis, and excellent acting. The film manages to feel authentic and mythic at the same time. It is a 'slow' film, yes, but an extremely compelling one for viewers with patience and an admiration for the genre"}, {"rating": "10", "text": "I am a connoisseur of cinematic detail. Especially in historical movies that I have a fair knowledge of the times they depict. And I am often absolutely, verbally, anal. I drive my wife nuts on this but to me even a background set filled with accurate prosaic items is cause for a private gasp of wonder for me. Hey--someone connected with the movie I am watching actually CARED about attempting to render history halfway realistically! Someone once said that the past is another country: \"They do things differently there.\" Kudos to the screenwriter and the others who cooperated on this masterpiece. The dialog and diction (supported by the splendid cinematography!) transported me back to the late 1800s. The film seemed to me to be about as linguistically/historically perfect as it could possibly be. If the speech was not exactly \"factually correct,\" it nevertheless rang profoundly true. These old flesh and blood American characters probably and actually talked like this--a mixture of transplanted British courtliness and low-down--often obscene--countrified slang. The clothing was right there along with everything else. I don't believe I will ever look at Kirk Douglas or John Wayne with their smart and silk perfectly-knotted neckerchiefs below their ostentatious Stepsons the same way again. A word or two on the film's cinematography.... This is the first time I have seen color photography that evoked both the beauty of western landscape, the stark, papered-over gritty poverty of frontier life and the \"blurred-at-the-edges\" sepia daguerreotyped glass plate images of a century ago. This movie was an outstanding experience for my wife and I."}, {"rating": "8", "text": "Not to dismiss John Wayne; but this is the best movie ever in the Western genre."}, {"rating": "10", "text": "Hmm, I finally got around to watching this on DVD, and WOW! I like Brad Pitt a lot, although something tells me I shouldn't. All I can say is this has to be his best acting ever. His sense of existential pain is harrowing. But the movie as a whole brings up something I always wondered about while watching westerns as a kid in the fifties: If there's just one mean boss and a bunch of weak other guys in the gang, why doesn't one of them just off him and get it over with? I mean, it seems like it would be so easy!"}, {"rating": "10", "text": "The film of the year... bar none. Long ? Baloney! If anyone calls himself a film buff and complains about length of this film, he should stick to 30 minute sitcoms. I wouldn't want to see a second clipped. Great performances down the line. The best film of 21st Century. When they want to, they sure can make 'em like they use to."}, {"rating": "9", "text": "Very involving and textured film. If you have any sort of cinematic attention deficit disorder, you will probably find it boring. Others will revel in its beauty"}, {"rating": "10", "text": "Best film of the year. A masterpiece."}, {"rating": "9", "text": "A fierce and beautifully stylized requiem to an era- easily our own- a post-apocalyptic monochrome Book of Hours, all quirky medieval illumination in Prairie Sampler simplicity. Pitt gives a majestic and leonine portrayal of Jesse, as much trapped animal as hunted outlaw and Affleck is superbly contemporary as an empty and cowardly vacuum of vengeance."}, {"rating": "10", "text": "The long title gives away the plot, but damn is the movie good. The cinematography and atmosphere is incredible and the acting by Affleck is great, too. the music is awesome and the final 30 - 45 minutes are awesome. The film is better than 3:10, and if you liked this film >>> go watch the proposition."}, {"rating": "9", "text": "although a rather long movie, the movie captures the last few months before james' death. I highly praise Affleck's performance. this is possibly the best western movie ever"}, {"rating": "10", "text": "A realistic depiction of Jesse James. This is probably the most historically accurate version of his story that has ever been told on film."}, {"rating": "7", "text": "Well the first hour sort of plods along then the last hour & a half is excellent. Casey Affleck is very good as Bob Ford as is Brad Pitt. Music is also excellent & a nice cameo by Nick Cave (who did some of the music)."}, {"rating": "9", "text": "Some may find it tiresome (they should watch more action-packed Westerns then), for me it is the best Western ever made. Not that it's a perfect representation of the genre per se, but it's a perfect, psychologically energetic, beautiful drama about human nature, about identity, loneliness and friendship, fatherly bonds, rivalry, vulnerability and affection, and maybe above all, the human need of creating and believing in myths.Also probably the best acting I've ever seen in a Western, Casey Affleck is outstanding."}, {"rating": "6", "text": "For a synopsis of the film, see the title, an essay in itself.  The film is similarly lengthy, unfolding leisurely over two hours and forty minutes.  While nominally a Western, TAOJJBTCRF quiets down after the only gunfight, less than 45 minutes in.  That’s just as well, because what’s on the screen is a character-driven drama about hero worship as self-realization—and that’s self-realization of the destructive kind.  Character is well portrayed, dialog realistically written and well played, and the extra-wide 2.35:1 aspect ratio constantly brings in the bleak natural environment as an additional role, one that is in a sense voiced by a narrator.  Photography and editing are beautifully done, and the tinkly musical score works better than might have been expected.  A decent film, if a bit mannered, worth a second look.  DVD has no special features about the film itself, Blu-Ray notwithstanding."}, {"rating": "10", "text": "This movie is simply amazing.  The writing, acting, direction, and production are all perfect.  Some may call the movie slow, but I didn't think so at all.  I was engaged throughout the entire movie."}, {"rating": "7", "text": "Brad Pitt is clever and convincing as the legendary Jesse James; however, it is Casey Affleck, as Robert Ford, that really allows us to sink our teeth into this one. It's a western, but there's more than that here."}, {"rating": "9", "text": "This is a tremendously ambitious movie. Clocking in around two and a half hours, it is a hefty investment for a movie whose scale and action is more implicit and controlled than grandiose and bombastic. This is to say that the movie dragged a bit. But, taking it aside from this fact, if you can make your way through it in one sitting, it is the most compelling character study I have ever seen. Everything is acted to a near perfect level and the cinematography is engrossing. For me at least, the artistic value of this piece outweighs the length and it is by far my favorite movie of 2007."}, {"rating": "9", "text": "Thanks to slick lighting, immersive storytelling and nuanced character depth, Andrew Dominik's Neo-Western drama is visually and emotionally gripping throughout. The film offers a fascinating exploration of idolisation and myth-making, and Casey Affleck is superb as nerve-stricken adolescent Robert Ford. Dominik's balance between art and entertainment is spot-on, and although (like its title) the film is a little on the long side, the story of America's best-known outlaw has never before been told with such spellbinding energy and emotion."}, {"rating": "8", "text": "This one is certainly very good. It is slow, but never creeps into \"boring territory\". Rather, it commands your attention and full wraps you into its world. The storytelling here is really is most unique element, as it essentially feels like a visual book in the way it is told and it really benefits from it. Not only does it set it apart from other Westerns, but it breathes a certain amount of life into the film that is very beneficial. The acting from a great cast including Brad Pitt, Casey Affleck, Sam Rockwell, and Jeremy Renner, is great as always. Pitt and Affleck both really stand out as stars in this one for sure. The writing here is also very strong and the relationship between James and Ford is very well done. Really, all the relationships here are very diverse and well written to the point where it feels as though we know everybody and their motivations. This film is really about the characters, in large part thanks to the great writing of the characters. And finally, Roger Deakins kills it with the cinematography here. Just absolutely stunning cinematography that is really picturesuqe at every single turn. Each shot is just breathtakingly gorgeous and really give this film a fantastic look. Overall, this one has a long, unconventional title and a unique way of telling its stories and is a rounding success."}, {"rating": "10", "text": "Haunting, Spellbinding, complete badassery. Easily of the best movies ever made!!\rDefinitely the best soundtrack ever made. Yes Nick Cave is a serious rockstar when it comes\rto making a soundtrack sound so honest to its tone that is makes you feel six emotions at once. Give this\rmovie a chance and it will change your life."}, {"rating": "10", "text": "Equally barren and majestic with an affective anti-western motif running through it's doom-laden story.  Pitt; equal parts sociopath and charming snake plays the character for what he realistically probably was is matched in some ways exceeded by Affleck's callow and servile Ford.  A study of perverse hero worship gone awry.  Where the movie really delivers is not so much the killing of James, but the aftermath and consequences of murdering a pseudo Robin Hood is the most compelling material, and worthy of its prolonged running time which gives us the time to see how these characters develop their sad trajectories."}, {"rating": "8", "text": "This is the most underrated american film of the decade, it has wonderful cinematography and storytelling. Casey Affleck is so brilliant in this and the whole cast in general as well"}, {"rating": "10", "text": "Absolutely spellbinding. An endlessly interesting character study that's flawlessly written and directed. Casey Affleck delivers in this career-defining role, and both he and Brad Pitt give two of the most complex performances I've ever seen in cinema. I understand that this film will actually bore many people. It is described as a western but it is an artistic western. It is about the film-making; the story; the characters, and not about the all so cliched shoot-em-ups and explosions you see in old westerns. If you can handle art, and steer away from action for just a little bit, \"The Assassination of Jesse James by the Coward Robert Ford\" will truly move you if you can view this in the correct context. If historical accuracy means anything to you, this is THE film to watch."}, {"rating": "8", "text": "Just as Kubrick did with \"Barry Lyndon,\" Andrew Dominik presents the story of Jesse James with a sweeping exposition, exchanging all dramatic cues in favor of character closeups, avant-garde style and a revealing narrator. Thanks to great performances by the whole cast and the expansive Western setting which complements the style surprisingly well, Dominik pulls it off."}, {"rating": "10", "text": "Point blank, this is probably the single most underrated film in the last decade. Absolutely **** amazing, and one of the best movies I have EVER seen. The acting was beyond incredible, as was the cinematography, music, directing, writing, plot, and everything else. This is a true masterpiece."}, {"rating": "5", "text": "Moseying along for 160 minutes, this revisionist western by writer-director Andrew Dominik makes a wan attempt to present the Jesse James legend as the dawn of celebrity culture in America. This film is far too long but the central relationship of James and Ford is fascinating.\r...it's got a title that perfectly matches its subject matter: They're both too long by half."}, {"rating": "3", "text": "The film keeps you dozing around for a while and makes you painfully snore later on, but once a violent image appears. Your brain couldn't respond to the act quick enough that it turns into mush. What a disaster."}, {"rating": "2", "text": "This movie gets a 2 only for the, at times, beautiful cinematography. Otherwise, it was plodding, overly obvious, and ran like a book on tape. The unenthusiastic, sleepy narrative all throughout the film never gave the actors a chance to do their job: act. Brad Pitt is like a mournful ghost, flitting in and out, never really committing or digging his heels in to the grit and substance of his character. Affleck is just plain uninspiring and unconvincing. At the end, the whole theater was asleep. They were waking each other up, going: 'Is it over?' I thought it was impossible to make a boring movie about Jesse James, but - apparently, you can."}, {"rating": "4", "text": "Okay, you don't have to like characters to be interested in their story, but, really... let the dweeb shoot the psycho in the back and lets get it over with, already. The pictures are beautiful, there's a level of professionalism to the work and, admittedly, some dynamic scenes, but with narration tricky enough under the best of circumstances; how did they convince themselves they could get away with aping the narration from \"Ken Burn's Civil War\" without inducing groans."}, {"rating": "1", "text": "Wow, how spectacularly uneventful! For 3 hours, absolutely nothing happens in this film, either emotional or action-wise - because the narrative tells you 'how it is' without letting the true drama unfold. The scenes are ponderous, monotonous, and disjointed. The characters are one-dimensional, completely awash in a sea of pretentiousness, this desperate striving for depth and a misguided attempt to create an 'art' film. Affleck in particular is made to carry this film, and his performance is fair, but not extraordinary. It just emphasizes the fact that he is not leading man material."}, {"rating": "0", "text": "Half of this film are people sitting around a table or a campsite eating. Eating... and... talking. And then someone says something and everyone get really quiet until the \"tension\" which you never feel, is broken by a lame, thought-up-at-the-last-minute crude supposed cowboy joke. Huh huh huh. The film is all about taking forever to get to the point, if there is one. The actors look like they came out of the 20th Century. The accents are obviously not natural. The film is tedious, and insulting- in the first half an hour, I was glad I got to see it for free, but near the end, I just left. This is a horrible film made by a man who must've been getting paid by the minute or something."}, {"rating": "1", "text": "Easily the most boring movie I've seen in 10 years."}, {"rating": "8", "text": "In \"Almost Famous\", the late rock critic and founder of Creem magazine, Lester Bangs(Phillip Seymour Hoffman), advises his young protege to not make friends with the rock stars. William Miller(Patrick Fugit) doesn't heed his mentor's sage warning and gets chummy with lead guitarist Russell Hammond(Billy Crudup) of Stillwater. The Jesse James memorabilia that Robert(Casey Affleck) collects in his shoebox is the equivalent of the posters that hang on the budding rock critic's wall. Their idols, for the time being, exist only in the abstract. Although he doesn't visit his own home, the famous gunslinger's sudden appearance at the house of Wood Hite(Jeremy Renner) does echo Russell's surprise visit to the Miller residence at the end of the Cameron Crowe memoir. Bangs had told William to \"be honest, and unmerciful\" if he wanted to be a true friend. This is exactly what Robert does when he recreates his execution of Jesse James for the stage. Since \"The Assasination of Jesse James by the Coward Robert Ford\" plays like \"Good Fellas\"(the DeNiro character goes after all the airport heist participants just like how Jesse James eliminates his train robbery cohorts) more than any film that John Ford ever directed, it makes perfect sense that Robert shoots Jesse in the back. The Scorsese film informs us that gangsters are often shot by those closest to them. Since Jesse is Robert's friend(well, sort of; my ass-talkin' theory isn't airtight), he has the authority to kill. The staged play is equivalent to the article William writes about Stillwater. They're both non-fiction pieces; official documents of a true-life event. By not smudging the facts surrounding his vigilant gunfire, Robert respects his craft(assuming that playwriting and the dramatic arts are important to him) and the memory of his boyhood idol."}], "recommendations": ["the_last_of_the_mohicans", "nocturnal_animals", "kingdom_of_heaven", "casino", "a_most_wanted_man", "once_upon_a_time_in_america", "rush", "magnolia", "the_walk", "lincoln", "chinatown", "youth", "the_untouchables", "the_irishman", "the_aviator", "the_great_gatsby", "catch_me_if_you_can", "whiplash", "a_most_violent_year", "the_devil_all_the_time", "the_grand_budapest_hotel", "body_of_lies", "amadeus", "the_place_beyond_the_pines", "hell_or_high_water"]}