{
  "id": 1261,
  "title": "The Green Mile",
  "starring": [
    "Tom Hanks",
    "David Morse"
  ],
  "runtime": 189,
  "genre": [
    "Fantasy",
    "Drama",
    "Crime"
  ],
  "description": "A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cell block's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/o0lO84GI7qrG6XFvtsPOSV7CTNa.jpg",
  "categories": {
    "plot": 9.6,
    "acting": 9.65,
    "ending": 9.166666666666666,
    "soundtrack": 8.0,
    "cinematography": 9.0,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It makes me angry to see many low scores from critics, this is probably one of the best and most emotional movies I have ever watched."
    },
    {
      "rating": "10",
      "text": "I watched this for the third time yesterday, the thing that one critic pointed out is that this film has something extremely rare: soul. This is the most emotional movie I have ever seen, it's not just a drama movie with plot twists and unexpected tragedies; it has extremely lovable and disliked characters. Characters that we connect with, and when anything happens to them in the movie we feel like crying our guts out. It's also bound to make you take a different look on the use of the electric chair, and there are many other underlying themes and subjects with this movie. This film is a 3 hour experience that will change your mental attitude completely, highly recommended movie. 5/5 stars"
    },
    {
      "rating": "10",
      "text": "Critics gave this movie red or yellow rank must be clinically insane for sure. This is one of the best movies I ever saw, one of the best melodrama movie. You know, I'm not young man, I dont cry when I get kicked, when I feel pain, but this movie made me cry. Not just a single tear, but I cried like a river. Just watch this, you will never forget The Green Mile."
    },
    {
      "rating": "9",
      "text": "As with the fantastic Shawshank Redemption, The Green Mile is based on a Stephen King story and directed by Frank Darabont and I can give no higher praise than to say it is just as good.\r The film centres on a stretch of death row known as The Green Mile in which a giant of a man known as John Coffey, accused of murdering two young girls, has been imprisoned. King is widely known for his horror books but, while there are supernatural elements to this story, as with The Shawshank Redemption this film is all about relationships between people in difficult circumstances.\r The Green Mile may be three hours long but every minute of that is used to develop the characters and story so that by the end we really do care what happens to them. Those that dismiss Kings work as chart filler may be pleasantly surprised by what they find in this movie."
    },
    {
      "rating": "10",
      "text": "It's incredible seeing so many low scores from critics for probably one of the three best movies ever. Its intensity and brilliance is something just amazing. There are no movies of this level nowadays. Three hours of emotions"
    },
    {
      "rating": "10",
      "text": "The Green Mile was a great movie. It didn't make my top ten (no more than ten do, so it was a hard decision), but it absolutely made my top twenty. Frank Darabont. You wouldn't think he could do a follow-up adaptation of Stephen King's media, after The Shawshank Redemption, of all things. But no, The Green Mile is just as good and better than The Shining and Stand by Me."
    },
    {
      "rating": "10",
      "text": "A movie based on stephen Kings book the green mile does not disappoint! It makes you feel lots of different emotions at different times in the movie. Like most of stephen Kings books it is well thought out. The acting produced by Tom hanks is just amazing, this is probably one of his best films! It is exciting, and gives the watcher an insight on what really happens when someone used to get the chair. At times this movie will probably make you cry. This is a good 3 hours so you've really got to dedicate some time to watching it. Overall this is probably one of my favourite movies of all time, and you should definately watch it before you die!"
    },
    {
      "rating": "10",
      "text": "This movie is an absolute masterpiece. Not even The Shawshank Redemption is as good as this movie (in my opinion). I have never seen a movie made with skill such as what can be found in The Green Mile. Most of this movie is just tuning in on these prison guards lives at their jobs and it is never at any point boring throughout the 3hour runtime. Stephen King wrote this book brilliantly and Frank Darabont brought it to the big screen brilliantly. Every single character in this movie is memorable and amazing. You will never hate someone as much as you will hate Percy, my personal favorite character form the movie. He was done so perfectly that it makes me feel bad for the actor because I might accidentally hit him if I ever see him in real life purely by instinct. *semi spoiler (but not really)* The other antagonist is also highly hateable. All the protagonist are very likable. The story is beautiful but might be difficult to swallow for people with certain religious beliefs. This is a must see, just don't watch it when you are sad and need a happy tale or comedy because this movie is full of tragedy."
    },
    {
      "rating": "10",
      "text": "brilliant movie. but sad thing is, the kind of thing that happened in this movie still goes on in this world we live in. terrible to think about. like Barry said, probably the movie that had the biggest emotional impact on me out of any movie ive ever watched in my life. i just wish i knew the criteria these \"critics\" use to review movies."
    },
    {
      "rating": "10",
      "text": "A true cinematic achievement from start to finish. \"The Green Mile\" is equally beautiful, horrific, heartbreaking and satisfying all throughout, with perfect performances and an unfathomably beautiful score."
    },
    {
      "rating": "10",
      "text": "Energetic, deep, and sad. I've never burst into tears watching any movies. It makes me upset to see bad mediocre reviews from critics. I loved this movie. It was worth the 3-hour sit through."
    },
    {
      "rating": "10",
      "text": "Seriously? Metascore of this movie is 61!!!What a disaster. Then what are these so called critics expect from a movie.It's interesting,thrilling,emotional ,well directed movie with an amazing story and screen play .\rActors are really mind blowing.Story and screen play as what i expected from the great 'King'.The Drabaont-king gang have presented us one another gem not  lesser than that of 'The Shawshank Redemption'\rgot more than i wanted.\rthe critics who gave thus a movie a low rating ,at the same time garnishes the 'waste of time movies' like syriana,up in the air,michael clayton with scores more than 75 .Fools."
    },
    {
      "rating": "10",
      "text": "this movie is awesome ... the first movie made me cry ... i hate when i see low ratings on this grate movie ... it deserve to spend 3h ... Michael Duncan was brilliant .. RIP"
    },
    {
      "rating": "10",
      "text": "3 hours of your time that you will not regret. As a massive Stephen King fan I could not wait to see this movie after I'd read the book, and boy was I ever impressed. The story in itself is heartbreaking and gut wrenching, so grab your tissues, but by the end of it don't be surprised if you want to watch the entire thing all over again. Tom Hanks is absolutely fabulous in the role of Paul Edgecomb, and the performances by Michael Clarke Duncan, David Morse and Sam Rockwell add all the necessary depth to their characters. Thrilling, magical, funny, traumatising... The Green Mile is all those things and I believe it would be impossible to be bored by this film. It's another one that requires your undivided attention and it is quite long but it doesn't feel that way by the end. There are characters you will love and ones you will hate but you will be touched by the stories they tell. I am always blown away by this movie, it is one of my all time favourites, and I highly recommend it."
    },
    {
      "rating": "8",
      "text": "Based on one of Stephen King's few non-horror novels, THE GREEN MILE is a long, moving, poignant prison drama with an interesting fantasy twist. Starring Tom Hanks and Michael Clarke Duncan, it tells the story of Paul Edgecomb, a guard working at a prison where a man named John Coffey is brought into custody. Though he has been convicted of brutally murdering two girls, Paul soon enough discovers that John has a special healing power and really comes across as a kind man. Though clearly demented at some points in the plot, THE GREEN MILE was overall a great film. I plan on reading the serial novel on which it is based sometime soon, as it is sitting on my bookshelf, collecting dust and waiting patiently to be read; but as for a recommendation for anyone who hasn't seen this, see it. I can't guarantee you'll like it--there's always a movie not to like, after all--and I can't exactly guarantee you'll make it through the entire three hours and eight minutes, but it is most certainly worth a try. Rent it on Netflix, find it broken up in segments on YouTube, find it on TV, get it On Demand, buy it--whatever. Just make sure you see this film."
    },
    {
      "rating": "10",
      "text": "Add something magical apparently some people will immediately hate it. Too bad for Metacritic that this landmark movie received such a meager metascore mostly due to some preposterously low ratings by some of the critics. Must see movie, one of the very best ever made, right up there with Saving Private Ryan, The Silence of the Lambs and The Fellowship of the Ring. At least the users know a great movie when they see one."
    },
    {
      "rating": "10",
      "text": "I cannot name a film that better imagines the harsh realities of life and the disturbingly twisted events that follow. 'The Green Mile' certainly makes me walk to the nearest store to pick up some more tissues, as its three-hour length is ultimately justified and proves to be very effective. You do not need to be knowledgeable on Stephen King's novel from which this film is adapted, as the journey we follow with these characters is cruelly realistic, for the most part."
    },
    {
      "rating": "10",
      "text": "This is one of those films that everybody has got to watch at some point in their life. It really is a stunning film, there's very little else I can say about it. But beware, you will weep like a child."
    },
    {
      "rating": "9",
      "text": "A emotionally powerful, miraculously acted, exceptionally written, and unique drama.  The direction is incredible.  Darabont gives the film a vivid sense of place.  You are completely absorbed when watching the Green Mile.  All the actors rise to an incredible level of convincingness, and the prison feels like an actual place.  The supernatural scenes also pack a punch, and some other scenes could make a robot cry.  It is pretty long, and not for people with a low tolerance for graphic violence, but it's without a doubt a great movie."
    },
    {
      "rating": "9",
      "text": "An amazing movie by Stephen King! I highly recommend it to almost everyone (don't watch it if you're getting bored too easy, because this movie is 3 hours long). 8.5/10 but i'll give a 9/10 because of the ending!"
    },
    {
      "rating": "9",
      "text": "It may not be as good as \"Shawshank Redemption\" but it's still one moving film. Michael Clarke Duncan gives a powerful performance as John Coffey. Along with a great cast and story, it's a powerfully entertaining drama. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."
    },
    {
      "rating": "10",
      "text": "Awesome!!! One of the best pictures ever made. Based on a Stephen King's unputdownable novel!!! Well-acted!!! Brilliant, brilliant and brilliant!!! Watch it!!"
    },
    {
      "rating": "9",
      "text": "Superb movie in all aspects. Great acting, very solid story (also considering there are not many locations), and definitely some very emotional aspects. It's one of those few movies that has really taken you somewhere when it has finished."
    },
    {
      "rating": "10",
      "text": "I am starting to lose the faith in metacritic's rating... this movie was one of the best I have seen since ages, and 3 hrs isnt that long for it."
    },
    {
      "rating": "8",
      "text": "It's actually not as perfect as some other users say here. That John Coffey was pictured as a naive and very simple minded guy was improper to me. Also they could've cut out some scenes, 3 hours are a bit too much. Anyways, this is a rememberable masterpiece and a brilliant-made movie. Must-see!"
    },
    {
      "rating": "10",
      "text": "The Green Mile is a milestone for Darabont. Of course the high-brow critics will think this an overly long snore-fest, but the real movie watchers will realize its accurate portrayal of the passage of time and what it feels like for a death row inmate. Described as his favorite movie he's made, it combines the magic of a Disney film with more adult themes and a soaring story that moves you and makes you judge your own life. Even the title is a metaphor as this film conveys complex themes about life, set in Louisiana in a death row cell block."
    },
    {
      "rating": "10",
      "text": "Incredible adaptation of Stephen Kings book.\r The late Michael Clarke Duncan is perfect in the role of Coffey  a mentally challenged black man sentenced to death for the murder of two little girls. Tom Hanks gives a stellar performance as mild-mannered prison guard in charge of death row.\r One of the best Stephen King adaptations yet (alongside The Shawshank Redemption)."
    },
    {
      "rating": "10",
      "text": "This movie….I can't explain it in words but, this is the best sob movie in time. I'm not going to say its \"one of the best\" or \"probably the best\" because I know. This movie is the best. Why? When I was young, about the time you can't walk, I somehow opened the tv and saw this. I only saw a scene of it but, it was so, how to say this, close? I think. Whatever, I couldn't get that movie out of my mind then a 9ish years later, I found the name. I saw the whole movie and now, I feel accomplished. A part of the scene in this movie is so moving that I searched and searched when it was possible to search. I came from a poor family once so I didn't have the internet or a phone or a computer, just a tv. So now, since I have a laptop, I want to say this to the world. This movie changed my life."
    },
    {
      "rating": "8",
      "text": "Finally had a chance to see this, and as much as I enjoyed it and it deserves most of the praise it gets; I couldn't help but feel a little bit underwhelmed. Maybe the expectations were a bit high. It dragged a bit for me at the start, and going into this completely blind, the fantasy twist to this film caught me off guard a little. Make no mistake though, the acting is superb, the music choices are pretty great and overall, it is still a very, very good film."
    },
    {
      "rating": "10",
      "text": "The hreen mile is cinema at its best. An exceptional production with a perfect alignment of story, cast, soundtrack, visual effects and direction. It is a classic movie."
    },
    {
      "rating": "10",
      "text": "It hard to take your eyes off the screen while watching the Green Mile. Tom Hanks is at the peak of his career and its on display in this movie. The Green Mile will get you emotionally engaged like very few other movies will. Its hard not to cry while watching it. The late Michael Clarke Duncan is at his best in this movie. Sadly that he never got another chance to shine like he did in this film. This one is a flat out classic."
    },
    {
      "rating": "9",
      "text": "I am starting to like Stephen King's work more now, and I read the book. A wonderful book, that is faithfully(mostly) adapted into an equally wonderful film. My only complaint of The Green Mile is the length, I do think it is too long. However, The Green Mile is a film that is haunting, thought-provoking, moving and engrossing.The film is beautifully directed by Frank Darabont(director of the slightly superior The Shawshank Redemption), is beautifully shot with a foreboding setting and atmospheric cinematography and lighting and has an engrossing and haunting story that is well-paced too. Thomas Newman's score is positively hypnotic and very beautiful, with some great authentic song choices, my favourite being Wrap Your Troubles in Dreams(And Dream Your Troubles Away).The script is thoughtful too, and the movie also has a big emotional impact without feeling manipulative, I honestly couldn't help crying at the end of the movie. I have to say as well, the execution scenes were really quite harrowing. The performances are strong, Tom Hanks is excellent as the warden, as is Doug Hutchison who gives a credibility and complexity to a character that could have easily been clichéd and David Morse as Brutus. But Michael Clarke Duncan is the actor I want to give the real kudos to, he has a wonderful character and he absolutely nails it.Overall, a very, very good movie. Had it been shorter, it would have been perfect. 9/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "A little far from The Shawshank redemption but Darabont makes his best effort for this screenplay based upon a book of Stephen King. Sensitive drama that works in the background as a plea against the death penalty, showing it as a cruel, useless type of revenge. Remarks Tom Hanks and newborn Clarke Duncan."
    },
    {
      "rating": "10",
      "text": "I absolutely love this movie! I am so disappointed in the critics for giving it a lower score. In my opinion this is one the best movies of all time. This movie is an example of how movies should be made, so emotional and touching. RIP Michael Clark Duncan :("
    },
    {
      "rating": "10",
      "text": "The problem that I have with every negative review of this film is that the negativity stems purely from the length of the film. This is a terrific, emotional film that you never want to stop watching. If there is a negative review out there that addresses a fault present in the picture, I have not seen it."
    },
    {
      "rating": "10",
      "text": "Not gonna lie im a Stephen King fan and a fan of Darabont so this review is gonna be very biased... Anyways this movie is so **** great, its got its philosophy super tight, its got an amazing cast with suchn great performances. Darabont knows how to immerse his viewers just like King to his readers it has a strong view on prejudice at least in my opinion. The movie from top to bottom is such a great watch not a dull moment and moments from small to big impact the story in many ways I highly recommend this movie. Also its 3 hours long not many movies can handle such a big time frame and maintain their viewers like this one has."
    },
    {
      "rating": "10",
      "text": "It makes me angry to see many low scores from critics, this is probably one of the best and most emotional movies I have ever watched."
    },
    {
      "rating": "10",
      "text": "An other excellent adaption from Frank darabont (Shawshank redemption) a film filled with real raw human emotions just like Shawshank"
    },
    {
      "rating": "9",
      "text": "it was one of the best movies i ever saw.especially its end sequence.the play of tom hanks was great."
    },
    {
      "rating": "10",
      "text": "The best movie in the world! Looked at tears more than when watching the movie Titanic! Very emotional movie. The actors played their roles perfectly."
    },
    {
      "rating": "10",
      "text": "One of the best moovies of all time. For me its slightly better even than shawshank redemption."
    },
    {
      "rating": "10",
      "text": "I'd estimate I've seen over 5000 films in my life from multiple countries and continent's and from all era's of film-making, The Green Mile has never been surpassed by any film.It is at one some point during it's runtime touching, sad, horrific, funny, haunting, provocative and very emotional. A supremely satisfying experience that surpasses The Shawshank Redemption in every way most notably with it's characters who are more colourful and memorable. The acting from everybody is incredible, the score is fantastic and the directing flawless.It's what cinema is at it's best a great story just like a novel. Totally engrossing for it's entire runtime, if it was a single minute shorter it wouldn't be as good a film, the runtime is a strength not a weakness."
    },
    {
      "rating": "10",
      "text": "Отличный фильм.С интересный персонажи.Сильная драма"
    },
    {
      "rating": "10",
      "text": "It's longer and it's better, Frank Darabont and Stephen King reunited after a previous Masterpiece, The Shawshank Redemption, the two have some similarity and the one that we can easily see is the prison, both of the movie is a prison story, The Shawshank Redemption is sad and depressing, same like The Green Mile, but how unfair the thing is, that make The Green Mile more sad and more depressing, with Tom Hanks and Michael Clarke Duncan amazing and incredible perfomance, so do the other, not only make The Green Mile have one of the most powerful perfomance i've ever watch but one of the most powerful movie i've ever watch, i highly recommended."
    },
    {
      "rating": "10",
      "text": "I have a very critical point here that I havent seen anyone ask or havent ever seen anything online about it...but maybe just maybe someone on here has thought the same thing thats on my mind. What made me even question this is I am watching the series in John Wayne Gacy the Killer Clown. And one of the victims child asked why did it take so long and there was supposedly some cops involved in the 33 crimes. So I started to think about The Green Mile and wondered...was this movie showing us that they did fake executions? You know movies reveal alot of things. Well you all ask what do I mean. Well the part when they were practicing the execution and they had the inmate acting like he was getting electrocuted. Well for one why wpuld they do that? With a inmate anyways. Why didnt they just do it with another officer? I believe they actually did stuff like that to fake executions on sime people. Because you know they put people out there to do things like this. I mean murder people and stuff. This is an evil world. How hard wpuld it be to fake an execution really? And they never let the public see it...why? Someone with a depth of intellect please dialogue with me on this. Thanks."
    },
    {
      "rating": "10",
      "text": "so sad :( the ending could have been a little better but it's one of the best movies I've ever seen."
    },
    {
      "rating": "10",
      "text": "Just a masterpiece.A wonderful story about the wrong person who got into the wrong time, the wrong time. There are excellent actors in the film, you empathize with the main character and the mouse or hate it.The best film adaptation of Stephen King, in my opinion."
    },
    {
      "rating": "10",
      "text": "What's with the low scores? This is the second best, and second saddest, movie I have ever seen. Then again, I haven't seen many sad movies If you haven't noticed already, I love this movie. Nobody beats Tom Hanks when it comes to acting, and Michael Clarke Duncan is brilliant too."
    },
    {
      "rating": "10",
      "text": "One of the best movies I ever saw!! If you don't cry I don't trust you.The story is so moving and the casting is also really good.RIP Michael Clarke Duncan"
    },
    {
      "rating": "10",
      "text": "Thought-provoking and emotional dynamite!"
    }
  ],
  "recommendations": [
    "the_shawshank_redemption",
    "the_lovely_bones",
    "joker",
    "changeling",
    "titanic",
    "man_of_steel",
    "magnolia",
    "harry_potter_and_the_deathly_hallows_part_2",
    "seven_pounds",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "mystic_river",
    "glass",
    "vanilla_sky",
    "john_carter",
    "it_chapter_two",
    "there_will_be_blood",
    "the_illusionist",
    "the_hobbit_an_unexpected_journey",
    "ben_hur",
    "the_prestige",
    "eternals",
    "cinderella_man",
    "eternal_sunshine_of_the_spotless_mind",
    "alita_battle_angel",
    "perfume_the_story_of_a_murderer"
  ]
}