{
  "id": 1007,
  "title": "The Blind Side",
  "starring": [
    "Sandra Bullock",
    "Tim McGraw"
  ],
  "runtime": 129,
  "genre": [
    "Drama"
  ],
  "description": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg",
  "categories": {
    "plot": 8.375,
    "acting": 8.333333333333334,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.857142857142857,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The Blind Side is a funny but overrated film that somehow is nominated for an oscar for best picture. I think some of the jokes are just plain stupid but some are clever. The film has a great story I think it is very uplifting but at times it is so unrealistic it make me roll my eyes. Sandra Bullock had a good role not great because it wasn't anything new to her I have seen her play these type of roles plenty of times. Overall the movie is so overrated and should not be nominated for an oscar. But its a above average movie."
    },
    {
      "rating": "8",
      "text": "It's funny when a true story of kindness is made into a film, some people see it as racist. I get the horrible feeling that those people are racists themselves. It's almost like they can't stand seeing a blackman do well and being accepted for who he is.\rGreat film by the way."
    },
    {
      "rating": "9",
      "text": "In these very troubled and difficult times in the world, this is an optimistic view, and the best is it is based on a true story, which makes it more beliavable. Sandra Bullock is way far away from her usual characters, and floats up beautifully! (much more so after her participation in the awful \"All About Steve\"."
    },
    {
      "rating": "10",
      "text": "First, the criticisms of this movie are ridiculous. How this movie gets misconstrued as racism is crazy. The purpose of this movie is not to show white people as the saviors of black people, and any such suggestion is malicious, hateful, and racist. This movie gives nothing to complain about. It had plenty of laughs, a few tear-jerking moments, a quick-paced story that was engaging... All the elements necessary to keep most people entertained. Why do you think it did better in the box office in its second weekend? Because this movie is good. It achieves its goals effortlessly, and its goals are to show that people have the ability to drastically alter the course of each others' lives through our actions."
    },
    {
      "rating": "9",
      "text": "Wonderfully told tale full of hope, breaking many prejudices and Bullock is simply brilliant. An Oscar winning display."
    },
    {
      "rating": "9",
      "text": "A rare film that both men and women can enjoy. Sandra Bullock is terrific! While her role as a Christian woman doing good is primary and that of Michael Oher, the promising offensive lineman, is diminished from what it was in the book, there is still enough football action to hold the attention of guys who follow the game. (Oher became an All_American at Ole Miss after departing the Tuohy household after his high school graduation and then a first round draft choice and now a starter for the Baltimore Ravens.) Audiences are much more positive about this film than the critics. In this case, I think the audiences are to be trusted more than the critics."
    },
    {
      "rating": "9",
      "text": "Critics who downgraded this movie(based on a true story) simply do not like feel good movies,=. I guess they just want lots of action with no base for the plots.These critics need to give up this profession because they are unqualified to rate anything. Movie was very good. Sandrs Bullock was bsolutely fantastic ant the supporting cast was also.I am glan I don't pay ant attention to these so called critics. If I did,I surely would miss some good and entertaining movies. The box office doesn't lie. Just look at the numbers idiots!"
    },
    {
      "rating": "10",
      "text": "A great story with great morals and spirit. We all must learn to admire the good and stop making fun of it. I can only wish we will have more people like this family around us."
    },
    {
      "rating": "7",
      "text": "Not exactly full of compelling drama, but a nice story about nice people doing nice things. So sue me, I liked it, okay?"
    },
    {
      "rating": "9",
      "text": "I liked the book better because the football scenes in the movie are tough to reproduce accurately."
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie more than I expected. I have absolutely no interest in football. Zero. But I usually enjoy Sandra Bullock, so I went. It is a nice human-interest story, well done. So I do recommend it. It feels a tad long, but it held my interest well."
    },
    {
      "rating": "10",
      "text": "This is by far Sandra Bullock's best performance that I have ever seen her in and this is really a great film, best on an inspiring story."
    },
    {
      "rating": "8",
      "text": "It's movies like this that give you the \"you can do it too\" spirit for another person that needs it like Michael Oher."
    },
    {
      "rating": "8",
      "text": "It appears most critics want to rate this movie based on delicate racial sensibilities and not on the entertainment value of the film. Look at the wide rating disparity between critics and average movie goers. I liked the film and would recommend it for its entertainment value."
    },
    {
      "rating": "10",
      "text": "The feel good movie of the holiday season. Sandra Bullock is terrific in what may be her best role ever. Don't miss this wonderful human interest story."
    },
    {
      "rating": "9",
      "text": "So much has been said in finding fault with the story, with the perceived racism in the storytelling, with the fault in the characters. I find little fault with the film. The characters are... true. Notably three New York-based critics gave the movie a failing grade. Why? Because the acting was so poor? Or because they did not connect with the message? This is one of those rare moments where I find that the most condemning critics are in the wrong, because it is not the MOVIE they disagree with per se, but the premise. The mere idea that such a series of events unfolded as such is perceived as de facto racist. But you know what, much of life has racial overtones. And I don't find the too-good-to-be-true story any less valued just because it doesn't live up to certain standards as a story of overcoming the odds in a racially segregated (or rather socially racially segregated society.) On a side note, love Sandra Bullock. But the accent is close.... but just not there."
    },
    {
      "rating": "9",
      "text": "A great story, which was well cast and acted. This is an inspiring feel good movie."
    },
    {
      "rating": "10",
      "text": "Best movie I've ever seen. Entire family (10 in all) and everyone enjoyed it. Tim McGraw and Sandra Bullock were great."
    },
    {
      "rating": "10",
      "text": "This movie was such a positive, wonderful story. Sandra Bullock and Tim McGraw are both wonderful in this movie. The family's love for each other and for Michael is overwhelming. It is a charming movie that you will want to go see again. I know I do!!"
    },
    {
      "rating": "8",
      "text": "Of course they couldn't be nice people, that would be to unpessimistic of a view. Of course they could not do it for the fact that they wanted to be decent, they had to be \"hell bent boosters\", wanting to get Ole' Miss a championship tackle. Get a grip. It tells a very un-cliched tale, of a boy who finally finds the right spot in life. It also avoids many cliched sports movie moments (very rare). Some of the parts are awkward, and it does get slightly confusing here and there, but none the less this movie is very good. Don't listen to any of the critics, they just need to take the awkwardly placed football, and take it out of their you know what."
    },
    {
      "rating": "10",
      "text": "This movie has some of the best acting and dramatization I have seen from a movie in a long time. Sandra Bullock normally plays in goofy, ditzy roles, but she did a wonderful job in her serious role. The other thing that I liked to see is that she played the dominant role in the house even though her husband played by Tim McGraw created most of the income. So all in all this movie was an all around great movie and Sandra Bullock deserved the Oscar that she won for it."
    },
    {
      "rating": "6",
      "text": "Oh, they're boosters. In a funny way, this bit of late-breaking information functions the same as the \"he's dead\" revelation in M. Night Shyamalan's \"The Sixth Sense\", because it forces the moviegoer to reexamine all the preceeding scenes under a new frame of reference. Whereas Shyamalan situated the Bruce Willis character sans conversation among the living, this filmmaker too stages scenes that hide the truth in plain sight, then blindsides the moviegoer with a game-changing moment of epiphany. Here, it's in a surprisingly terse scene between Michael(Quintin Aaron) and a NCAA investigator, in which the Touhys are cast in a surprisingly unfavorable light, complicating the film's emotional uplift ever so slightly. Good samaritans or hell-bent boosters? Although the Touhy's are never labeled as such, the evidence of their vested interest in a good left tackle is right in your face all along. An Ole Miss football game on Thanksgiving Day dominates the Touhy household, in which the family gathers around the television from the sofa with their turkey-stuffed plates. When Leigh-Ann(Sandra Bullock) observes her charge sitting by himself at the dining room table, she shuts off the game, and has them join their permanent guest for a more traditional familial holiday arrangement. This is the moment, perhaps, that Leigh-Ann starts to understand how their football-centric lifestyle might need some toning down. (Even the Touhys' young son is put to work as Michael's trainer.) To what extent is her paternalism motivated by a rabid love for Rebel football? Unfortunately, \"The Blind Side\" bails the University of Mississippi alumnists out, during an exchange where Leigh-Ann and Sean(Tim McGraw) suss out their motivations with a proper amount of self-flaggelation, so we don't have to. But in a telling scene, Miss Sue(Kathy Bates), Michael's tutor, tries to recruit the future NFL star away from hated SEC rival Tennessee with a crazy story about Neyland Stadium(where the Volunteers play its home games), which validates the possibility that a well-to-do couple would feed and clothe an offensive line prospect for their beloved team."
    },
    {
      "rating": "8",
      "text": "Gr8t flick! Bullock does a wonerful job as the \"momma bear\" you dont mess with. SJ is a hoot and uses all of his freckles to good use!!!"
    },
    {
      "rating": "10",
      "text": "Despite the reviews, Sandra Bullock is STILL on my Oscar-watch."
    },
    {
      "rating": "9",
      "text": "This movie works because it is a straight-forward story of hope and one woman's determination to make a positive difference. The reviewers (they call themselves critics) that rated the movie yellow or red would also have panned Capra's \"It's A Wonderful Life\". REM"
    },
    {
      "rating": "10",
      "text": "Thoroughly enjoyed this movie."
    },
    {
      "rating": "9",
      "text": "Seriously. How can you not like this movie? It's a delight. Sandra Bullock finds her voice! It's all true. People do noble things."
    },
    {
      "rating": "8",
      "text": "Without question this is a feel good movie based on a true story. At the NFL Draft when Michael took the stage after being drafted #1 by the Baltimore Ravens nary a word was said about how he got there. Michael is befriended by a rich southern family who accepts him for who he is. His IQ is 80 but then again he never recieved an education. To see his desire in which he eventually made the Deans List at Mississippi and becomes an All American transcends the football story. Talk about second chances in life this is a true feel good story about an exceptional young man and an exceptional family that we would all like to be part of."
    },
    {
      "rating": "6",
      "text": "This movie is pretty harmless Holiday fare, A true story ,yet it's not all that uplifting and the acting is nothing special either. I like Sandra Bullock , but so far she's pnly shown acting abilities in one movie - Crash. This film is pretty to look at and very standard Family stuff."
    },
    {
      "rating": "8",
      "text": "Not exactly sure why this movie received such mixed reviews. Sometimes I think critics only like really artsy flicks. If you want a heartwarming movie about a great story this movie will leave you entertained."
    },
    {
      "rating": "10",
      "text": "Inspiring, true story. I loved it, one of those movies thats stays with you afterward. The critics are way out of line on this one and they have zero credibility, that's why I always check out USER COMMENTS and not Critics Comments"
    },
    {
      "rating": "10",
      "text": "Why is it that all the negative reviews are claiming the film is racist? The only racists are the bigots who can't stand that a hollywood film actually depicted conservatives in a good way. This film is fantastic! Not about race, not about republican vs. democrat, its about Michael Oher and his journey to the NFL! GET OVER IT!!"
    },
    {
      "rating": "9",
      "text": "The Blind Side is very well done on all points. It is well written, well acted and well edited. It is the first film in several months whereI did not feel robbed of my hard earned money (Damn you Surrogates!). I notice that a number of the critics of the film find fault and even racism in how the story plays out. Considering that it is based on true events I don't see how they can blame the film for how these people lived. The film is simply reflecting the reality as seen through the eyes of the participants. I guess it would have been a very different film if told from the perspective of the project dwelling drug dealer - but his was not the story being told."
    },
    {
      "rating": "7",
      "text": "It's a touching titled, but tends to feel dumbed down to the point of almost being insulting to the audience. The way that it approaches the whole idea of racial tension in the film gets rather annoying at time, but the tale of the protagonist's steadily bonding relationship with a family that took him in when he had nothing is incredibly heartwarming. Overall I say it's definitely worth feeling, even if it can be irritating on occasion."
    },
    {
      "rating": "10",
      "text": "My whole family enjoyed this movie. Sandra Bullock perfectly portrayed an upper-class, Southern woman, and it was great to see Tim McGraw in a different setting - he also did a fantastic job. The screenplay was well written and engaging for the whole two hours. Some people may not like the story, but it's true and it's fantastic."
    },
    {
      "rating": "9",
      "text": "For the life of me, I cannot understand those who see racism here. The story is true, and the truth is that a poor black youngster was helped by a rich white family. I am so happy that this very well-written, acted and directed film is doing so well at the box office."
    },
    {
      "rating": "7",
      "text": "Rich family takes in homeless teen, help him get grades, starts playing football, gets good at it, tough childhood keeps haunting him.True story based on a book about Michael Oher who went on to play in the NFL.Sandra Bullock shines as the very driven Leigh Ann Tuohy with her no-nonsense approach and mentions too for good performances by Tim McGraw, Jae Head and of course Quinton Aaron as Oher.Slightly predictable pacing but an enjoyable watch."
    },
    {
      "rating": "7",
      "text": "Good movieee . it was sadd and amazingg .. not as greatt as country strongg ! but Tim Mcgraww is awsomee ! and yess this was a good moviee !!! If you haventt seen it yett you need to soon ! its gonna be one of your to favoritess !!!"
    },
    {
      "rating": "10",
      "text": "A great movie for you and the family its truly touching and amazing how a southern rich girl would take in a poor young african american boy it is truly touching i certainly reccomend it 10/10"
    },
    {
      "rating": "4",
      "text": "This movie is held on a level that I don't understand. Sandra was not brilliant and the movie lacks any creativity or originality in it. Contrived and predictable. This is just an ok cliche movie that is kind of boring."
    },
    {
      "rating": "9",
      "text": "If you fail to see that they're just human beings helping each other, you are the racist ones. The movie is worth watching, very inspirational and sad at times. And yeah, Sandra Bullock is outstanding."
    },
    {
      "rating": "7",
      "text": "Love this movie. Sandra Bullock deserved her main role. 'The Blind Side' gives hope, positivism and justice. Great movie."
    },
    {
      "rating": "8",
      "text": "This is definitely Sandra Bullock's film. She was extraordinary, and more so considering how she usually is. No one expected this from her, including herself. It is a very nice story, which could be seen as the \"white saviour story\".. but since it's a true story, that kind of falls in the background of it. Overall, definitely a touching and moving story about a woman who has a lot of love (and money) to share and who actually does it, regardless of what other think or say. Good film!"
    },
    {
      "rating": "5",
      "text": "\"The Blind Side\" isn't a movie where you cry at amazing performances and heart throbbing dialogue. It's a movie that will roughly intercept your mind for a painful tear."
    },
    {
      "rating": "7",
      "text": "The film belongs to Sandra Bullock who delivers a brilliant performance (possibly the best one of her career), but the focus of the overall effect is sloppy. The story is boring at times and I think the film was too long. I didn't live up to expectations. Newcomer Quinton Aaron wasn't a good fit, he wasn't the best of actors. He definitely looked the part (being tall and all) but his performance was very wooden. Another newcomer Jae Head is the heart of the film. It's probably one of the highlights of the film. Overall, the film is warming but tiring that is full of unnecessary scenes, forgettable characters and elements of the story that just don't work. I have it's cute and worth the watch but only for Bullock, Head and again, the football aspect of the story."
    },
    {
      "rating": "9",
      "text": "The performance by Sandra Bullock TOTALLY deserves the Academy Award.If you forget this is a movie based in real life facts it wouldn't matter, the movie would still be great, with great performances by all their actors and they develop their story of \"white guy/girl saves poor boy\" in a way never seen before, making it a great drama that will keep you hooked up from the beginning.I don't give it a 10 because there was a scene or two that don't add anything to the movie, but there should be a 9.5 score in this scale, because that's what this movie deserves."
    },
    {
      "rating": "4",
      "text": "This movie feels like a racist Disney Channel movie. I mean the idea that some white lady changes a black guys life is demeaning. Sure, an okay performance from Sandra Bullock but an Oscar?! That's ridiculous."
    },
    {
      "rating": "6",
      "text": "I have to say this is pretty much a great film for a person who still alive and active in what he/she does. It had great acting, but the only flaw on why I gave it a 6 is well it seemed to look too much of as a \"family film\" when it really isn't."
    },
    {
      "rating": "10",
      "text": "Sandra Bullock is absolutely fantastic! Why? Because she's so believable in her role; most of the time a big name actor gets in the way of their own character because all the audience recognizes is the face. In \"The Blind Side\" Sandra pretty much disappears into her character of Mrs. Tuohy, which allows the movie itself to have a life of it's own as it's big name actor is replaced by a charismatic southern mom. Yes, Mrs. Tuohy does drive the movie, yet she is not too overpowering to where the other characters are drowned out. Michael and the rest of the Tuohy's act superbly within their roles; the scenes with the smallest Tuohy (SJ) and Michael are very humorous and impactful when they need to be. They really portray a good brother to brother relationship. The movie as a whole is more of a drama than a sports film, about the power of family and what it means to challenge yourself: if that means going out of your way to help another, pushing yourself to achieve what you once thought impossible or looking inwardly to see if you really are the person you want to be. Fantastic performance by Sandra, the story is told wonderfully with enough humor to balance the sometimes dramatic or intense turns. Overall a grand accomplishment for feel good cinama! And a final comment: for all the people that seem to think the movie is about a poor black child helped out by the more privileged white angels, I think you are projecting your own prejudice onto a film that clearly does not have that kind of message in mind. Point in fact: I doubt the Golden Globes would recognize an actress for her role in a obviously racist picture if that were the case at all. (Hope Sandra gets the Academy's recognition also, she, and the film, deserve it!)."
    },
    {
      "rating": "9",
      "text": "I love this comment - \"This movie is despicable.\" Excuse me it's a TRUE story bozo. Like it actually happened, like the \"racist\" family actually helped a black kid and now he's star. Great film. Very uplifting."
    }
  ]
}