{"id": 4040, "title": "The Fighter", "starring": ["Mark Wahlberg", "Christian Bale"], "runtime": 116, "genre": ["Drama"], "description": "Boxer \"Irish\" Micky Ward's unlikely road to the world light welterweight title. His Rocky-like rise was shepherded by half-brother Dicky, a boxer-turned-trainer who rebounded in life after nearly being KO'd by drugs and crime.", "releaseYear": "2010", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/gmTLorYhXJZgdzUsUhvm1ZkRTl0.jpg", "categories": {"plot": 7.6923076923076925, "acting": 7.851851851851852, "ending": 8.2, "soundtrack": 5.0, "cinematography": 5.5, "familyFriendly": 3.0, "funny": 9.0, "action": 7.956521739130435}, "reviews": [{"rating": "8", "text": "It could have easily been yet another underdog boxing film we have seen before, but the subtle lead performance of Wahlberg, the flawless supporting appearances of Leo and Adams but most importantly the dynamite dominating portrayal of his hero/waster/catalyst brother make this a great film to watch."}, {"rating": "7", "text": "A good movie that had two serious false notes.  1) It portrayed Micky Ward, a boxer who in reality was always willing to go toe-to-toe with his opponents, as a defenseless punching bag.  The only conceivable reason was to manipulate the audience into worrying about him.   2)  The Cambodian crack-whore character didn't look remotely strung out.  Not only was she gorgeous, she looked healthier than anybody in the theatre."}, {"rating": "7", "text": "To the head, to the body, to the Budweiser:  The Fighter (a true story, yet a thinly-masked Budweiser commercial, to be sure) deserves accolades, yes, but why is every punch delivered with the same video-game sound effect? Never loud for some punches, fainter for others -- just punch-sound, punch-sound, punch-sound: Get real, sound editors. Of course, it's nothing new that fighting sounds have always been exaggerated in Hollywood (with the possible exception of Jeff Bridges' punch in Peter Bogdanovich's \"Last Picture Show\"), and there is indeed much integrity in the history of boxing, but why is knocking someone out still a sport? Isn't boxing just romanticized human rooster-fighting? For the same reason we hire babes in bikinis to hold up \"Round 1\" signs, we (more often than not, males) are apparently just animals out for sex, blood, and Budweiser (and if we are not, that makes no difference for what Hollywood sells). That said, I thought Wahlberg (strangely, no nomination) and Mellisa Leo (nominated for best supporting actress [and later winning that award with an historical (expletive!) acceptance speech]), were both excellent, and the mother's 7 white-trash daughters were both intentionally amusing and scary. Is it worth seeing? Sure -- it's a true story, and Wahlberg and Bale (who also later won an oscar) offer genuine portrayals. Lastly, you had to love the clip tagged on the end with the real brothers from Lowell, Mass. They did not need to tell you who was who--it was a charming tag after an unsettling story."}, {"rating": "9", "text": "Awesome film. As per usual, both Wahlberg and Bale do an outstanding job of acting, as does Amy Adams as Micky's girlfriend. At the end of the day, it's a sports movie, but it's an extremely good one that has characteristics most typical sports movies do not have. It draws you in with the in-depth and at times depressing story of Micky Ward's life and then his turn around into a champion."}, {"rating": "10", "text": "\"The Fighter is an Emotional , compelling , Truly inspirational film. Christan Bale and Mark Whalberg give the performances of there career in One of the finest boxing films i have ever seen. The Fighter will have you stand up and cheer .. SEE THIS MOVIE!!\" .. A+"}, {"rating": "9", "text": "A great sports drama, elevated by powerful supporting turns from Bale, Adams, and Leo. The story is uplifting, without being melodramatic, and is greatly helped by Russell's realistic direction. If Bale does not win, let alone be nominated for, an Oscar for this, I'll be shocked, as it's right up the Academy's alley."}, {"rating": "8", "text": "Most realistic boxing action yet to grace itself on the big screen. Memorable and convincing roles from Adams and Bale make this one of the best movies of the year. Wahlberg takes us somewhere special in the ring, but loses his rhythm amidst the side plots and out-of-ring action. Overall, you have to give credit where credit is earned, and The Fighter does just that as it throws you with a hook that you can't seem to dodge. Highly recommended; a can't miss holiday outing."}, {"rating": "10", "text": "I was suprised. I expected it to be good, but it was awesome. The Drama was realistic, the fighting was exhilerating, and the acting was superb. Go see it"}, {"rating": "8", "text": "The Fighter is a very complex film that catches you from the beginning to the end, and this is for the topics that treats; with this I do not refer to the boxing, but family conflicts, drug problems, free thought and a society that lost the sense of right and wrong.The Fighter portrayed a failed boxer called Micky, who is trying to improve, but because of his situation that is impossible: he is hunted by the shadow of success of his older brother Dicky; he is constantly attacked by his family and that is way he cannot think by himself; he is crushed by the idea that has his hometown about him (Micky is a fighter that is used by the other ones in order to category up).The ironic thing is that his life (a healthy boxer trying to balance his feelings between his girlfriend and his family) is control by a drug addict with a false success in life brother and by a fanatic and bipolar mother. This two support characters are the foundation of the film, because they both are trying to project a life to a utopic future, but Dicky and his mom are too blind to see the reality, because they live in the past, where Dick had dignity and Alice had common sense.These two characters are awesomely played by Christian Bale and Melissa Leo, those dazzling performances and the no expected one of Amy Adams, cover the wasted one of Mark Whalberg."}, {"rating": "8", "text": "The story is consciously repeating what it does, which results in a frigid ending. However, its Christian Bale that you will like, not Mark Wahlberg or David Russell."}, {"rating": "10", "text": "Wahlberg not Warlberg...sorry. My impressions remain the same with regard to my earlier review of this fantastic movie !!!! Additionally, I must also compliment the other actors who all played an integral role in without this total chemistry it may have just been good rather than fantastic."}, {"rating": "8", "text": "Though it might not be the next \"Rocky\" or \"Raging Bull\", \"The Fighter\" is built by a very strong supporting cast that should make this a strong addition to the Boxing Genre in movies."}, {"rating": "9", "text": "I thought it was going to be a tiresome cliche movie with manufactured scenes, but I was dead wrong. The movie as a whole has a lot of CHARM. The cast was outstanding from top to bottom and Bale nailed every scene with perfection! Naturally,  people will compare this to Rocky base from the trailer alone and boxing element, but if you watch the Fighter entirely, you will see that its a totally different. Rocky and The Fighter deserve to be known as their own. Another thing to keep in mind is the Rocky was art imitating life (inspired from a true event), while The Fighter was life imitating art (a true story).\r I deducted one point from this movie because I thought they could have rephrased the info in the aftermath of film. [SPOILER alert]. After the last scene, they should have written \"After winning the title, Micky Ward began his epic career including his trilogy with Arturo Gatti.....Three of  his boxing matches were voted Fight of the Year........Dicky Ecklund was by his corner at all times.\" [END Spoiler] ."}, {"rating": "9", "text": "Great performances by the four core actors (Whalberg, Bale, Leo, Adams) but also a great story that takes you on an emotional ride in the Ecklund/Ward family. A classic story of redemption."}, {"rating": "10", "text": "This is the best movie I have seen in a long time. Great acting all way around. Good script and the action was superb. I heard several people watching saying they got goosebumps from several scenes. Hard to imagine a better movie this year."}, {"rating": "6", "text": "As a huge fight fan, and a fan of Micky Ward, I was hugely disappointed that this movie isn't better than it is. Mark W plays that same character he always plays.  I love Melissa Leo from \"Homicide\" and \"Frozen River\", but her role borders on caricature.  Similarly, Christian Bale completely overplays his part.  The 6 or 7 sisters are hilarious, but not at all realistic.  Amy Adams does a terrific job, however - she's the standout here.  And on a final note - I was very disappointed that they didn't get to any of the Gatti bouts.  Those were incredible fights and said so much about Ward's character."}, {"rating": "8", "text": "The principal characters - Wahlberg's gounded soul, Bale's troubled druggie cloud, the mother's controling nature - are superb. Kind of a 2010 version of Rocky. However, the supporting cast of the seven trailer park trash sisters were just too stereotypical. Bale should receive a supporting actor nomination."}, {"rating": "5", "text": "I really wanted to love this movie. After reading the reviews and seeing the trailer, I had such high hopes for The Fighter. I was so very disappointed. The acting was outstanding, however, the characters never drew me in. I felt bored throughout the whole movie. It was just so predictable, and long."}, {"rating": "10", "text": "The Fighter is one of the best movies I have ever seen! Everything from beginning to end is amazing. The acting is beyond perfect, especially Christian Bale. He's so talented, personally, I think he's up there with Johnny Depp, Gary Oldman, Anthony Hopkins, etc. Mark Wahlberg was pretty great too, but is accent was inconsistent. It went from light to non-existent to heavy. Still, he gave a wonderful performance. If you guys are at the movies and don't know what to see, definitely check out The Fighter!"}, {"rating": "10", "text": "Oscar-bait gets a near perfect score from critics and cretins alike. Who would have thought! Oh, the tears in my eyes. The performances, the script...magnifique!"}, {"rating": "6", "text": "Sports dramas can fall either into \"rousing entertainments\" or more the way of a \"character study\". \"the Fighter\" belongs to the first group, where it sits about as high in my esteem as \"the Boxer\" with Daniel Day-Lewis does on the \"character study\" side: it's fair and has redeeming qualities, but in it's group it sits behind \"Rocky\" and just a notch passed \"Cinderella Man\" as \"the Boxer\" sits behind \"Raging Bull\" and \"the Wrestler\" in it's group. Mark Wahlberg is not quite comfortable yet as a leading man, and the movie considers too much of the archetypal blue collar behavior that surrounds him and drowns out his performance. Not a bad movie. It passes the time. But after the hype fades over the next couple of weeks, people will come to their senses on this one, I think. As far as rousing entertainments go, \"Secretariat\" beats this one by a length."}, {"rating": "9", "text": "I was very hesitant to see this film, because I hate sports movies about the underdog that wins the big game/match at the end.  There are a hundred of those movies and I'm sick of them.  This movie, happily, is not about the boxing.  It is about the family dynamic.  Christian Bale is the standout performance.  He's barely recognizable in the film, having lost a lot of weight for the part and made up to play the crack addict brother.  The movie straddles the line between humor and drama and you get attached to the characters.  Definitely one of the 10 best films of the year."}, {"rating": "10", "text": "This is a masterful movie. Everything from the script, to the direction to the acting is superb. You wait all year for a movie this good. Don't miss it. Oscar nominations to come."}, {"rating": "5", "text": "You can't necessarily blame Wahlberg, as his modest performance is the one element that feels truly authentic and heartfelt. follow  review in http://www.cinscreen.com/?id=1107"}, {"rating": "5", "text": "If I'm going to watch a film about a bunch of classless characters  (with the exception of Wahlberg's) at least show it to me with some class...throw me an original music score, exercise style with the camera, instead of relying in only hand held close-ups. The fighting sequences were awful..they felt artificial and under-rehearsed (specially the one in which Ward knocks out the boxer from mexico). Walhberg played it soft, but maybe too soft....Bale's performance was mostly shocking, and although for some moments it felt too chaotic and over the top, it should be the only reason for anyone to watch this film.-5.5-"}, {"rating": "10", "text": "If you stay for the credits and see the real Dicky and Micky, you realize you've just watched the truth.  This movie is the truth.  Pure and perfection.  Hiring the guys who actually do the fights for HBO added to the authenticity.  I just have to wonder who yelled the most... Bale or Russell.  But who cares.  They made a classic.  Bravo."}, {"rating": "4", "text": "This movie is  not a boxing classic--whoever said that.  The characters seem to be something of a caricature--do people like this really exist?   I just can't imagine there are real people so 'in your face.' Bale was barely recognizable--too much over the top as a crack addict.i don't understand the attraction of Mark Wahlberg.  He seems to have no range with either physical or emotional acting.   It was hard for me not to leave in the middle of the movie.  It was trying to be edgy but was basically uninteresting."}, {"rating": "9", "text": "One of the better sports films of the last decade, The Fighter combines great acting, exciting fight sequences, and a powerful script to make an overall great film. Likely to be nominated for best picture at the Oscars."}, {"rating": "5", "text": "This film would have been better without the constant intrusion of the mother and family ties, half their input and more about the boxing would have been a big improvement."}, {"rating": "1", "text": "Horrible movie. Another boring boxing movie filled with unnecessary drama? We need something new. I would much rather watch Reel Steel than this rubbish of a movie."}, {"rating": "3", "text": "How the heck this movie got such good reviews is completely beyond me. Its a joke of a film. Bales performance is way overthetop and not believable whatsoever; it boarders on fascicle and stupid. The fighting is ruined by the camera and the added sound effects which take away from the seriousness of the film. 3 is being generous its probably worth half a point. Waste of a film"}, {"rating": "3", "text": "The Fighter sorry to say is another typical boxing movie only with the screwed up  family, a brother who is a crack addict and a girlfriend who is just trying help mark wahlberg along. yet of all the strong acting the leading role fell flat in which made the movie flat as well."}, {"rating": "9", "text": "Exactly how uneducated and emotionally stunted are the fighter's seven sisters, the hairspray-addled girls who give Charlene(Amy Adams), a barmaid, such a hard time? Very uneducated. Very, very stunted. That's how much. Concerning adulthood, the \"girls\" put to mind that old adage, \"they know the words, but not the music\". Set in 1993, the Ecklund sisters, some of them clearly pushing forty(Asian women age better), are like eternal teenagers, catty and fiercely cliquish, under the watchful eye of a domineering mother, so eighties, it hurts just looking at them. That Alice(Melissa Leo), she's a real piece of work. Her kids are all messed up. The movie's use of Whitesnake's \"Here I Go Again\" suggests that Nirvana never made it to Lowell, Massachusetts. While it's the brothers who know how to take and deliver a punch, the sisters seem to be the ones who ended up punch-drunk. To them, a college...dropout, not a graduate, mind you, is cause for class warfare. Any man alive, let alone a woman, has to be brave to enter the Ecklund household; enter the fighter's girlfriend, a former URI high-jumper, categorically dismissed as that \"MTV girl\", a woman deemed by the \"white trash\" Greek chorus to be something akin to a fleshy hood ornament on David Coverdale's car, weathers the name-calling and wouldn't be faulted if she chose to fight fire with fire, by pointing out the elephant in the room that Dickie(Christian Bale) brings into the open during the film's most telling scene. Tired of living in his brother's shadow, Micky finally summons up enough intestinal fortitude to set his vampiric family straight, when the aging pugilist announces his plans to tarin year-round in Las Vegas, while Charlene sits not-so-quietly on the couch, lending moral support throughout this long-overdue ostracization process. The wisdom of the move, of course, is challenged. First, by Alice, who resorts to emotional blackmail so transparent, a panel of judges, if there was one present, would have awarded the fight to Micky, by unanimous decision, and then by a brother whose rhetoric functions like punches that never land. Swing and miss, swing and miss goes Dicky(whose claim to fame was a moral victory over middleweight boxing legend Sugar Ray Leonard...almost fourteen years ago), and his mouth, spouting out the pros of staying home to train, just like he did in his prime, without a trace of self-awareness about the ramifications that this tragic decision entailed. Because Dicky remained staunchly local, and surrounded himself with the dope fiends of this working class borough(he's known as \"The Pride of Lowell\"), he helped contribute to his own demise, succumbing like he did, to the crackheads and the prevailing milieu of social and economical decay. He had help, of course, but nobody has the heart, not even Charlene who claims to hate him, least of all, the fighter's father(henpecked to death by Alice) and the fighter himself, to lay bare the facts about this almost famous fighter's life since his brief taste of fleeting fame. \"The Fighter\" doesn't spell it out for moviegoers, but everybody can plainly see how the matriarch's sick promotion of familial tribalism(it's sick because Alice is willing to repeat the same mistakes with Micky) led to he favorite son's downward spiral, not to mention, the smaller roundabout southbound spirals of her cartoonish sisters. Speaking of cartoons, that's what the multiple incidents at the neighborhood crack house resemble, a Warner Brothers short, in which the mother and first-born son take on the personas of the Road Runner(she's fast, beep-beep, nine kids) and Wile E. Coyote. (Dicky has a friend he calls \"Boo-Boo\", which makes him Yogi Bear, I guess.) Like the feral dog, the crackhead constantly finds himself in the same fatalistic predicament; he's falling down from a high place, a \"cliff\"(an open window), that ends with a thud(instead of the canyon floor's hard surface, he lands on a bed of garbage bags), in which he miraculously walks away from with nary a scratch. The coyote nearly kills the lightning-fast bird. Likewise, it's what Dicky does to his mother each time she surprises him at his drug den, that is, until Alice's compartmentalizing skills takes on a life of its own, by which she compartmentalizes the truth away. So Micky stays east-side, and eventually breaks away from his Looney Tunes family, but it's only temporary, since the whole clan is back in the fold before Ward's title bout with Englishman Shea Neary. As a result, Micky's victory feels somewhat tempered by Dicky's all-consuming hunger for recognition, co-opting his brother's success into his own, by feeding on the championship boxer's afterglow. True to form, during the post-script, some doc footage shows Ward struggling to get a word in edgewise from his showboating older brother, trying to steal the movie, and perhaps, succeeding."}, {"rating": "9", "text": "A strong cast--Christian Bale, Mark Wahlberg, and the dysfunctional family, sound pitch-perfect as people caught in the riptide of addiction.  The mother from hell and her harpies add punch to the major characters.  We're in Lowell; we want out."}, {"rating": "10", "text": "Great story, great performances.   I see a lot of movies but seldom am as moved as I was with this one.  There was a lot of ugliness in the movie, but a lot of beauty too.  Great performances by Mark Wahlberg, Christian Bale, Amy Adams, Melissa Leo, Mickey O'Keefe (who played himself), and Jack McGee."}, {"rating": "10", "text": "Spot on brilliance,realness,beauty and the kind of movie that new movies should take notes on.The kind of movie that you can really watch over and over just for the acting performances."}, {"rating": "8", "text": "Some of the best acting you'll see in any film this year. Adams and Leo are both great while Bale takes it to another level as Dicky Eklund. Every scene with Dicky in it is mesmerizing. The boxing scenes are very realistic, and the movie kept me entertained throughout. My only complaint would be the timeline displayed in the movie which ignores several key Micky Ward fights while completely ignoring his amazing trilogy with Arturo Gatti."}, {"rating": "9", "text": "Painfully real at times, this movie touches on big, lofty themes while retaining a small, intimate feeling -- and even some oddly humorous moments. Christian Bale once again is astonishing, though it's painful seeing him really thin as in \"The Machinist.\" Somehow I felt Mark Wahlberg could have done more with his character; it's not as if he's terrible, but I could picture any number of other actors in the role."}, {"rating": "8", "text": "This is ultimately a film about relationships so don't expect a film with fight scenes ever fifteen minutes. The acting in this film is generally outstanding making ever character lovable and frustrating in their own ways (except of course Wahlberg). Christian Bale is fantastic in his role, absolutely fantastic. The only thing that limits it is its grinding pace but otherwise, a great film."}, {"rating": "8", "text": "Uniquely written, floundering back and forth between drama and comedy, then depressing, yet optimistic. Christian Bale displays one of the finest acting performances I've ever seen. Although pieces of it played out as too Hollywood, especially the ending, it was beautifully shot and very entertaining."}, {"rating": "10", "text": "O.k., so I am working my way through the films that were nominated for best picture, The Social Network...I don't understand that nomination at all, what the heck is so good about that film?  When I talk about a movie that I've seen, I try to not ruin it for people that have not yet seen it, so that usually means that I can't really say anything about the ending, because just by characterizing the ending, you can say too much, so that's why I'm not going to say anything about the endings, but I will try to tell you whether it's worth your time or not.  The Kids are Alright, was pretty good, so I can see it being on a list of ten films.  Inception, was great, and there were some aspects of it that I loved, but I thought that it ran a tad long, and got confusing in places.  Winter's Bone, I guess that you would have to characterize that as a \"sleeper\" film, because I don't think that it's getting the audience that it deserves.  Before I saw The Fighter, I would say that Winter's Bone was the best film that I saw from 2010, it is gritty, understated, and so very worthwhile, the atmosphere in that movie was so real, so palpable, a fantastic movie to me, certainly on the list, and a contender for number one.  I have my copy of The King's Speech, but I am watching it tonight, haven't seen it yet.  I can be pretty critical of moves, but after watching The Fighter last night, I bow down in awe.  Masterful is not too strong of a description, I can't say enough about how much I loved it, and it's based on a true story, which doesn't happen all that often.  The performances were amazing and riveting.  I am not one to watch movies that I've seen over again, but this one and Winter's Bone, I will, gladly."}, {"rating": "8", "text": "With films such as Rocky or Raging Bull, it would seem as if that boxing-based movies would be a died out and worn out genre. While I will not say director David Russell's The Fighter brings a new aspect to the table, his film extensively brings out the talent of its actors overshadowing the ensemble of other 2010 favorite Inception. The Fighter is a well-directed and captivating piece, and is as true as its performances.The Fighter is a biographical film depicting the life of aspiring professional boxer Mickey Ward, played by the surprisingly multi-dimensional Wahlberg, and his half-brother Dicky Eklund (Christian Bale). Ward is living under the shadow of Dicky, a former boxer who falls into the nightmare of crack addiction and violence. When Dicky faces a full decline, Ward, with the aid of love interest Charlene Fleming (Amy Adams), he learns he must rely on his own decisions to find success. Complimented by Wahlberg's acting, Adams puts on her finest performance since 2008's Doubt. Melissa Leo, who plays Mickey's overbearing mother, also gives a commendable act.The film is not solely based on the sport and Ward's effort to \"rise to the top.\" Instead, The Fighter also diverges into two trails illustrating the drug addiction of character Dicky Eklund, who is magnificently played by Christian Bale. Let me say this, Christian Bale gives an unforgettable tour de force performance.  No matter what opinion you may have on Bale, from his viral outburst to his laughable performances in the Batman series, the actor is unbelievably good. Bale puts underlying passion and grit into his performance that will crawl under the skin causing either a sense of deep pathos or disturbance. The Fighter is a captivating film with an ample spectrum of emotion. While telling a \"rags to riches\" story, it also gives an illustrative view into the lower classes of White America. Although the movie's story is overall somewhat cliche and predictable, the depth put on the ensemble and direction makes it solid entertainment and subtle commentary. It at first is slow to buildup, but The Fighter, led by its magnificent trio, will grab and toss you in multiple directions."}, {"rating": "9", "text": "The advertising leads you to believe this film is about Mark Wahlberg's character \"Irish\" Micky Ward, who once held the world welterweight boxing title. But this film is as much about his brother (astoundingly played by Christian Bale) and his mother (an incredible performance by Melissa Leo) and the twistsed/loving relationship they all had. Director David O. Russell has created a world that feels completely real, a bit freakish and almost stylized in its comic moments (especially the sisters). Every scene is layered, dynamic and a virtuoso spectacle of directing and acting."}, {"rating": "7", "text": "It was a decent film. The story was ok but never really hit as hard as it could have. Bale is simply amazing in this and is perfect for this film. Wahlberg is ok but he doesnt really seperate himself from other roles that he has been in. Overall its a solid film that is worth watching simply for Bale."}, {"rating": "8", "text": "the cast did a wonderful in this movie. everybody did a great job. the cast made this movie good. Very good script. One of the best boxing movie I seen. Fantastic movie. I didn't think it was going be good at all. I usually don't watch movie about sports and bade on a true story. This movie deserve all the awards it getting. This is Amy Adams best movie so far. I love Amy Adams now because of this movie she is one of my favorite actress. I think everybody should see this movie. It is definitely  worth your time."}, {"rating": "8", "text": "Based on a true story of professional boxer Micky Ward, The Fighter is about how Micky Ward (Mark Wahlberg) fights his way of family and friends to the championship title. Dicky (Christian Bale), Micky's half-brother and trainer, is a drug addict that always fail to show up for training. Their relationship is complicated because Micky wanted more than just a crackhead brother who doesn't know what he's doing. Supporting along that line come Alice (Mellisa Leo), the brothers' mother and manager, who also wants Micky to stay with her and Dicky instead of going to someone better. After meeting the love of his life Charlene (Amy Adams), who convinced Micky that his family's no good, he decided to go on and try something else. Success with the new manager and trainer, Micky got the shot of the title match. Mark Walhberg who plays the boxer is to many critics the lowpoint of the film. Everytime the camera focuses on him, it seems like he doesn't have anything to say. Perhaps the writing for Walhberg isn't as concentrated and too vague compare to his co-stars. Walhberg was suppose to carry the film with his role but instead it felt like his co-star Christian Bale did all the heavy lifting. Playing a drug addict who went to jail for resisting arrest and assaulting an officer, Bale (Dicky) was at his best. Emotionally understanding and physically confused by years of sitting on his ass, Dicky's only job was to train his brother into the championship. Bale gave up this amazing vibe that he knows what he's doing but at the same time too confused to do it right. The film, rather than focusing on Mark Walhberg, did a completely different character study on Christian Bale. Carrying along the heavy loads are Mellisa Leo and Amy Adams who played the mother and girlfriend of Walhberg. Leo and Adams had a chemistry in which both hated each other and both share the same goal of helping Dicky. Delivering explicit lines, Amy Adams is the best I've seen her in years. With two Oscar nominations already, she might even earn her third. Though the cast is above average, the writing in some parts were off. It seems like the writers wanted the actors themselves to carry the film without dialogue. They thought they can depend on the actors, but it is impossible for the actors to do any good without a solid script. David O. Russell finely crafted the film, but at times, it looked as if only the fighting scenes count. Focusing too much on the fights instead aiming to offer drama, he made the movie looked like an ESPN fight show. But set aside all of that, David O. Russell's got a talent in him and the fight scenes do look amazing. Perhaps his biggest contribution to the film is his directing of the cast.\r The Fighter has a predictable plot yet it pulls out so much depth offered by the cast that we can say The Fighter is finely entertaining. OscarBuzz: Best Picture (with 10 nod this year, it will be nominated), Best Supporting Actor (Christian Bale, win), Best Supporting Actress (Mellisa Leo, Amy Adams, both have a good chance), Best Score, Best Cinematography"}, {"rating": "7", "text": "Love the genre. This film is all about Bale's ability to fit into character and steel the movie from a supporting slot. Also, it relays on the intense Mom (Melissa Leo) and great ensemble of spinster sisters. Yet, it shouldn' t be named The Fighter but My Brother's Keeper -in a perfect reference to James Joyce. Overall it is a good genre film + Bale is a must see. @cinemaquote"}, {"rating": "9", "text": "rich, complex characters.  incredibly well told story.  christian bale should win.  i can't believe i'm saying this, but it was my favorite movie of the year.  definitely a must see."}, {"rating": "8", "text": "The Fighter is an excellently acted, scripted and paced pugilistic bio-pic. It entertains and uplifts. What more could you want from a boxing movie? Amy Adams in a black lace bra? It's got that too!"}, {"rating": "10", "text": "Amazing movie with very believable actors and a classic portrayal of Micky Wards life. Christian Bale absolutely deserves the Best Supporting Actor award. I only wish they would have put at least the first Gatti fight in. BTW the kid who said the KO of the Mexican was unbelievable and ill rehearsed is a moron, don't listen to him, it was IDENTICAL to the actual fight."}], "recommendations": ["million_dollar_baby", "silver_linings_playbook", "fighting_with_my_family", "scent_of_a_woman", "invictus", "hustlers", "raging_bull", "moneyball", "good_will_hunting", "lawless", "black_mass", "american_hustle", "as_good_as_it_gets", "42", "warrior", "the_blind_side", "the_judge", "eddie_the_eagle", "changeling", "rain_man", "rush", "trouble_with_the_curve", "revolutionary_road", "joy", "creed"]}