{
  "id": 2805,
  "title": "The Show",
  "starring": [
    "Josh Duhamel",
    "Famke Janssen"
  ],
  "runtime": 104,
  "genre": [
    "Drama"
  ],
  "description": "An unsettling look at reality television, where a disturbing game show has its contestants ending their lives for the public's enjoyment.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tg3hztSt33hf1OopspKVjVY7jC4.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Almost ten years ago, Eva Mendes starred in a movie called ''Live!'' and even though the premise of that film is different from this one, the development and the moral are basically the same.And what a surprise, the quality of both films is just as bad."
    },
    {
      "rating": "10",
      "text": "The formula for The Show is a little tired, but I really enjoy what they did with it this time. We’ve seen plenty of films where “reality TV” is satirized (The Truman Show, EDTV) and we’ve seen an arguably equal number of them that glorify televised or live deaths (The Hunger Games trilogy, Hostel: Part III). But what sets The Show apart from these other films is the message it sends. I read several reviews both before and after viewing this film and I find a lot of the negative reviews to be very narrow-minded in scope. But that’s my opinion. One you may share or one you may not. Read further and watch the film (or don’t) and decide for yourself.Many of the reviews I saw accuse The Show of being garbage and “[a] waste of talent” I disagree. No, it doesn’t have a super deep philosophical dialogue that will keep you up thinking at night, but the message I feel it has will, I hope, at least make you think twice before picking up you phone and engaging in social media. This is not, as many have said a commentary on, or satire of, reality TV. At least, it isn’t only that. This film makes a dark commentary on humanity’s desensitization to things in the world such as death, pain, and misery. Here is a brief synopsis:In the movie, reality tv show host Adam Rogers (played by Josh Duhamel) is nearly killed during the season finale of a hit show (something similar to The Bachelor/ette shows we are all familiar with). The losing contestant pops off a few rounds, killing the bachelor before taking her own life. How she managed to get the weapon in set (and why she would have had it to begin with) is never addressed in the film. Rogers is traumatized by the event and “go[es] rogue” during a live interview on the news. As a result of the nation’s dialogue over the finale and the interview, Ilana Katzenberg, the President of Programming for the fiction network, conceives of a show where individuals will kill themselves live on television. At first, Rogers and producer Sylvia Rowland (Caitlin Fitzgerald) are appalled at the idea, but later Rogers agrees, on a few conditions. He wants to make the show a platform he can use to change the world and people’s perception of it. He wants to make a positive impact. Yes, I get the irony there, using a show about live suicides to improve people’s lives. But suspend disbelief for a moment. Obviously the show derails at some point and things don’t go quite as planned and BAM! movie. But Duhamel’s character is the one we focus on if we want to get the message i believe the writers were trying to communicate.Rogers is us. He is society at large. Over the course of the film he goes from being traumatized to wanting to using the show to make a name for himself and gather fame. He becomes so desensitized to the process that it’s nothing more than a job and entertainment to him. And the public loves it. They stop caring about the people and tuning in just to see HOW they die. It’s a lot like how society is today. Other people’s misery and pain become entertainment. We stop caring about each other and start exploiting our neighbors. Taking advantage of and ridiculing the desperation of people. Less than caring about our fellow man and more interested in the next trendy thing. I don’t think the film paints a perfect picture of society, by any means. But I do believe it brings to light some things we need to consider more.All-in-all, I think the movie is an interesting watch. It does get a little emotional (if you take to caring for any of the characters), but it is also a little cliche. It does start off with that “I’ve seen this 100x” vibe, so you’ll have to get through that. But after the first 20-30 minutes, that should be gone."
    }
  ],
  "recommendations": [
    "united_93",
    "war_room",
    "the_lobster",
    "vivarium",
    "cartel_land",
    "overcomer",
    "the_shack",
    "before_the_flood",
    "the_forever_purge",
    "spree",
    "zero_dark_thirty",
    "the_butterfly_effect",
    "donnie_darko",
    "antebellum",
    "children_of_men",
    "idiocracy",
    "the_tree_of_life",
    "goodbye_world",
    "courageous",
    "voyagers",
    "noah",
    "downsizing",
    "munich",
    "crash",
    "machine_gun_preacher"
  ]
}