{
  "id": 2296,
  "title": "The Book of Eli",
  "starring": [
    "Denzel Washington",
    "Gary Oldman"
  ],
  "runtime": 118,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "A post-apocalyptic tale, in which a lone man fights his way across America in order to protect a sacred book that holds the secrets to saving humankind.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1H1y9ZiqNFaLgQiRDDZLA55PviW.jpg",
  "categories": {
    "plot": 4.071428571428571,
    "acting": 5.5,
    "ending": 5.454545454545454,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 2.0,
    "funny": 5.0,
    "action": 4.866666666666666
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The Hughes Brothers' \"The Book of Eli\" is a entertaining movie with a solid grim tone and quick, fast paced action. However, it could have done so much more than consistently managing it's apocalyptic mood..."
    },
    {
      "rating": "6",
      "text": "What is really interesting about this movie is the contrasting views on religion(Christianity) as being a dangerous in that people will follow and put too much faith in it(Carnegie's idea). And the other that people need something to have faith in no matter how desperate or bleak the situation(Eli). It gives you something to think about but overall the movie itself is rather slow. The action in the trailers is about all the action you get in the actual movie. really an average movie. not terrible but not a must see."
    },
    {
      "rating": "5",
      "text": "Denzel is great, I'm always happy to see him un a fresh movie. But as for the movie itself - huge disappointment:the plot has giant loopholes, a lot of questions remain unanswered. And the general religious message is rather silly, considering all the gun-blazing head-chopping action going on screen."
    },
    {
      "rating": "2",
      "text": "The Book of Eli\", should have been titled \"The book of Insufferable Naval-gazing\", what a horribly dull nonsensical \"movie\"! Instant Walmart $5.00 bin farce!"
    },
    {
      "rating": "4",
      "text": "So overtly a religious film it's sad. One really bad thing was the bible in braille, anyone with half a brain can de-code the alphabet from braille. It's just another god and good violence in his name is ok. Who do they think they fooled, oh, you I guess."
    },
    {
      "rating": "1",
      "text": "This was great if you are a Christian. IT was horrid, slow and the action sequences looked better on the preview. And the amazing twist at the end? Not even worth it."
    },
    {
      "rating": "6",
      "text": "Decent post-apocalyptic movie. Washington's acting is good, Gary Oldman is so-so as villain (I consider him a real chameleon actor, who can play brilliant villains, but here the character He portrays is somewhat weak). The twist of the movie is totally unrealistic (Yeah I get it, but anyway it is very unrealistic). Overall it worth a look, but that all. Ps: I do not like how American centric the movie was. I am sure there are a lot more Bibles in Europe, that survived, so Eli hardly saved the last remaining one (It might be the last one there, but the world is a lot bigger place than that.),"
    },
    {
      "rating": "2",
      "text": "The film is a piece of christian propaganda. The twist that happens made every scene before unrealistic. Yes... he is the saviour himself... he can do it... *yawn*."
    },
    {
      "rating": "3",
      "text": "Denzel and Oldman are great but..... How many times has some variation of this plot been used in a movie? Originality be damned full speed ahead."
    },
    {
      "rating": "10",
      "text": "This movie is the greatest, most inspirational movie that I have seen. It completely renewed my faith in movies to see somthing that totally relies on God to make it what it is. I am so proud Denzel for making this movie so that others might see just how important it is to rely on God. I totally give it an A+++."
    },
    {
      "rating": "2",
      "text": "This film starts out being difficult to believe, then transitions into a decent action movie for 20-30 minutes but afterwards returns to being proselytizing Christian fairy tale that is simply impossible to believe. Some reviewers have called the ending unpredictable. That"
    },
    {
      "rating": "1",
      "text": "Why does it seem that writing is so poorly valued. Sure this film had reasonable production values. That is most of the shots were well done ( if a little ponderous) and even a couple of inventive ones (the sideways shot that scrolled |\"up\" was at least relatively novel). But the story is lame, not just derivative, not just the standard (and sometimes enjoyable) shallowness of the action genre BUT actually BAD. The dialogue is terrible, hardly a single memorable (in the good sense) line in the film. The narrative makes no sense on so many levels: 1) Here's a book that Carnegie thinks will help him control people - even though *not a single person other than himself and Eli seem to have heard of it*. 2) Eli makes grave sacrifices to protect a book that he doesn't actually need. 3) Eli acts more like someone who was raised in a specific Christian tradition than someone who just read the bible. i.e. the saying of grace is a ritual likely descendant from certain events in the New Testament. There is no actual moral instruction to do so. 4) People seem to have forgotten things in a single generation (like what a TV is) ... I could go on."
    },
    {
      "rating": "4",
      "text": "Geez, hasn't anyone ever seen a Boy and His Dog, or the Zatoichi, The Blind Swordsman series and then Beat Takeshi's homage to it, complete with musical numbers?? You can dredge up every post apocalyptic film that has been made since Arch Oboler's Five and see where The Book of Eli is stealing from. Throw in some mumbo jumbo judeo christian eschatology, some homages to Leone/Morricone and voila, a pretty predicatable and boring film. But the cars get awesome mileage and they aren't even solar powered. Is Denzel going to be our new Heston? Do we smell another Planet of the Apes remake down the road?"
    },
    {
      "rating": "4",
      "text": "The movie was, for the first part beautifully shot (although the opening scene is ponderous and needless) and there are about two really good action scenes in there. With some original material but the script is crap. The dialogue is boring and uninspired. The character motivations don't make any sense. Eli:If he's memorized the book why take such risks to preserve it). Oldman: If most people can't read but will listen to you if you read from \"the book\". Then it stands to reason that you could tell them anything, or read from any other book. Solara: Is she really that naive that she thinks she will be safer with Eli? All culminating in an ending so disjointed that I was shocked to see a single writing credit. The most annoying thing is there are a half dozen ways to have made this movie. When studios don't even devote five brain cells to the plot is sort of like getting a big F-U from Hollywood."
    },
    {
      "rating": "2",
      "text": "I thought the movie looked nice but the script and plotting were ridiculous. Come on, the \"post apocalyptic farmhouse with a crazy family\" is there anything more cliche in the genre?"
    },
    {
      "rating": "9",
      "text": "Great cinematography with good acting. I thought the story wasnt as far fetched as most think. I'm glad that Christianinty was shown in a good light for once."
    },
    {
      "rating": "0",
      "text": "Another pathetic, post-apocalyptic, Christian, houlier than thou, Look at me Im-a-gonna-save-the-world with my Bible offering. Horrible."
    },
    {
      "rating": "0",
      "text": "If the idea of Christian Propaganda makes you hurl, stay away from this film. More nonsense trying to \"edgy\" -- No thanks."
    },
    {
      "rating": "2",
      "text": "Boring 3 action scenes,all about going west to do gods orders ofcourse its got to be the christian god that were talking about the only god I mean really we worship on this little rock about what 10-20 diffrent things but thats the one and only truth LOL LOL."
    },
    {
      "rating": "0",
      "text": "This movie is like Mad Max, without cars or irony or any meaning, everything is replaced by christian propaganda. In a world starved and lacking fuel people wouldn't bother very much about chasing a fanatical blind fencer but they would try to find a way to recover their technological knowledge. Everything else is better: The road, Mad Max, Escape from New York, even Red Dawn...\rIf you want a post apocalyptic fiction about the importance of religion for the recovery of civilization you could read \"A canticle for Leibovitz\" by Walter M. Miller jr."
    },
    {
      "rating": "3",
      "text": "This movie squandered it's great look and feel and cast, wasting itself on hocus-pocus laced fairytale. If he'd been carrying the Dead Sea Scrolls and the Gnostic Gospels, spilling a bit of blood might be justified, but the King James version? Oh please. - A simple tale of a loner wandering the post holocaust wilderness, would have been enough. Hollywood is crap with stories; either none or way too much. Eli loses it's humanity in preaching and high concept it can't live up to."
    },
    {
      "rating": "2",
      "text": "It's an unoriginal mix of Mad Max, without cars and The Road without the depth of character, with bits of The Postman without the scale. Unoriginal and bland in the extreme, you will regret watching it."
    },
    {
      "rating": "0",
      "text": "Wow!! What an over the top silly movie. I do have to give credit for the opening scene. That was done very nicely. I had high hopes after the intro and I was waiting for an \"action\" very gof the movie \"The road\". What I got was garbage. Avoid this movie."
    },
    {
      "rating": "0",
      "text": "A bible thumpers apocalyptic action movie. Makes you feel like you just got tricked into going to a surmon. Not really for those of us whom don't believe in idiotic made up religious beliefs. My advice. Stick to THE ROAD."
    },
    {
      "rating": "9",
      "text": "Solid acting, comfortable pacing, impactful action, a strong sense of direction, a few welcome laughs, and just enough weight to make you feel something more than ur average action flick based on a simple idea."
    },
    {
      "rating": "3",
      "text": "This movie have a lot of great possibilies... but just falls in the same things we have seen hundred times... Bored, simple and previsible... Just have some good action moments."
    },
    {
      "rating": "0",
      "text": "Why does everyone in this movie speak in an ADD?ADHD manner ? And walks like in one of those early Charly Chaplin movies ? The story has been done a hundred times before, what is the added value here ? Nauseating to watch...please speak SLOOOWERRR. Horrible waste of a good cast..."
    },
    {
      "rating": "5",
      "text": "The real title should have been \"Fallout 4: When Zatoichi Found God and what happened after\". Not much. I am a big fan of post-apocalyptic movies but this actively annoyed me most of the time."
    },
    {
      "rating": "1",
      "text": "Dumb.  I can't believe I payed to see a movie about a post-apocalyptic black ninja sword fighter who kills everyone left on earth.  The final scene of the movie is the worst I've ever seen, please leave before it happens!"
    },
    {
      "rating": "8",
      "text": "What I liked the most about this movie was the setting which I find very interesting."
    },
    {
      "rating": "10",
      "text": "This movie was just amazing. I give it ten stars, the ending was very ironic!"
    },
    {
      "rating": "10",
      "text": "A good action movie.You should judge movie for storytelling and for it's packaging."
    },
    {
      "rating": "9",
      "text": "WOW I thought it was a very good movie. I love the twist at the end. Definitely worth watching."
    },
    {
      "rating": "10",
      "text": "Movie was epic and amazing! Dont believe what the critics say and go see this movie!!!"
    },
    {
      "rating": "9",
      "text": "Denzel makes for a incredible performance as usual. And coming from an Atheist I'd say the Christian \"propaganda\" does well to give meaning to the story. And since the movie was made in America I'm assuming that's why its Christian and not Buddhism or any other \"holy\" book in the world. I loved the twist. This movie proves that Christians can make good movies without smothering it with Christ."
    },
    {
      "rating": "10",
      "text": "A great film, like no other."
    },
    {
      "rating": "10",
      "text": "Contrary to what haters out there are saying, it's a very unique, thoughtful, and well executed film. To counter the zero below, you certainly will NOT regret watching it."
    },
    {
      "rating": "7",
      "text": "The movie wasn't that bad. I agreed with the Onion's review. Gary Oldman was AWESOME. Ultimately, the studio played a bit too much with this one."
    },
    {
      "rating": "9",
      "text": "Reminds me of my favorite game, Fallout. Life isn't always pretty, and when it comes down to 'kill or be killed'....its best to be the one left standing. Denzel gives you that sense, that HE will be the last one standing."
    },
    {
      "rating": "9",
      "text": "One of the more satisfying post-apocalyptic movies I've seen. Some find the pacing a little slow, but it worked for me. The cinematography and score were excellent. They really made it look and feel like the end of the world. Denzel and Oldman were great and there were a lot of great supporting roles, too. The fight scenes were pretty intense, I thought."
    },
    {
      "rating": "8",
      "text": "Didn't like the whole religious aspect of the movie but as others said, totally reminded me of my favorite game series Fallout. Love post apocolyptic movies loved this one for the most part."
    },
    {
      "rating": "2",
      "text": "This movie really sucked and I felt, for the first time in my life, that I probably deserved a refund for having to sit through such a mess. The characters are shallow, things seem to happen without cause, and the plot just winds its way arbitrarily throughout the movie. Every major actor in this movie is horribly unbelievable. How is Mila Kunis living in a complete hell and still manages to have jeans that fit her and aviators? Don't go see this if you've already seen The Road because you'll be severely disappointed."
    },
    {
      "rating": "9",
      "text": "Great movie, keeps you thinking. If your a human secularist like most movie critics you probably won't like it. Your better to go watch Avatar instead."
    },
    {
      "rating": "9",
      "text": "Sadly most movie critics are intolerent of a moral character with a christian worldview."
    },
    {
      "rating": "7",
      "text": "Mix a little western, a little Mad Max, a little mystery, a couple of good actors, and you get a decent film. Denzel does a good job, and Oldman does his usual schtick as the big bad boss (which he always does well), but the other actors, and the script, just quite aren't up to making this a top-notch film. But for what you get, it's enjoyable and intriguing."
    },
    {
      "rating": "6",
      "text": "Set up and scenes fantastic. Though, the story has some really stupid religious background. And the ending is just ridiculous. If I would have watched until 15 minutes before it ends, I would rate it way better."
    },
    {
      "rating": "10",
      "text": "I thought it was a good movie it keeps you thinking throughout and it has great fight scenes in it and a suprise twist at the end. So overall, I give the film a 10."
    },
    {
      "rating": "5",
      "text": "Yet again another movie about the apocalypse. Well it's certainly nothing like 'The Road'. There more people, and no cannibals in 'Eli'. The plot is slightly smart, but yet very confusing.There are a few entertaining and eye popping action scenes in 'Eli'. That still isn't saying it's a good movie though. This isn't one of Denzel Washington's worst work, yet it's not his best work. 'The Book of Eli' is just a bit out of control."
    },
    {
      "rating": "10",
      "text": "Part horror and part action, this movie rocked. I never became bored once, and I like very few movies. It was original, which is a rare thing for movies nowadays. The only reason I saw this movie was because Gary Oldman was in it, but I was highly impressed with Denzel Washington as well. I wish more movies of this quality were made."
    },
    {
      "rating": "10",
      "text": "Great film. Another Denzel Washington masterpiece."
    }
  ],
  "recommendations": [
    "v_for_vendetta",
    "the_tomorrow_war",
    "gods_of_egypt",
    "surrogates",
    "knowing",
    "red_dawn",
    "terminator_genisys",
    "jumper",
    "world_war_z",
    "bright",
    "the_mist",
    "gamer",
    "the_darkest_minds",
    "polar",
    "repo_men",
    "riddick",
    "i_am_legend",
    "poseidon",
    "morbius",
    "the_twilight_saga_eclipse",
    "pandorum",
    "shadow_in_the_cloud",
    "hercules",
    "the_maze_runner",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull"
  ]
}