{"id": 2375, "title": "The Godfather Part III", "starring": ["Al Pacino", "Diane Keaton"], "runtime": 170, "genre": ["Crime", "Drama", "Thriller"], "description": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing.", "releaseYear": "1990", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/lm3pQ2QoQ16pextRsmnUbG2onES.jpg", "categories": {"plot": 6.27906976744186, "acting": 6.428571428571429, "ending": 6.5, "soundtrack": 4.333333333333333, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.5}, "reviews": [{"rating": "6", "text": "Big step down from previous films, has some of the sublime elements but just isn't as well written."}, {"rating": "2", "text": "This film has SO MUCH to dislike in it, you can get lost before you realize what is the central flaw.  Coppola got away pretty much with not recasting Brando or Richard Castellano (\"Clemenza\") in GF, but those avoidable failures did not mean he could just skip Robert Duvall in III to save a few more bucks.  The first scenes didn't work for me, and Diane Keaton's Bronze-ish angered-wife costume looked bad.\r Inadequate performances were by goofy Eli Wallach, wooden George Hamilton, the guy playing Tom Hagen's son, even Mantegna, and Cuban-American Andy Garcia didn't quite pull off the Italian thing.  Much-criticized Sophia C. was okay to me, but many people couldn't deal with it.\r The Church mumbo jumbo was for the birds.  And this guy is worth a billion dollars or so and he lives in a sub-average suburban little house?  The helicopter attack on a conference room was completely ridiculous - nothing in any way like that happened in the whole history of the mafia..  And murder-by-eyeglass frames was a groaner.\r But hat was really wrong was the central premise:  Don Corleone the mass murderer wants redemption and to live a church-goer's life?  OMG, please!  Coppola's on video asking if the Don's heart betrayed him, didn't protect him?  Heart smart for Chrissake, this is supposed to be a gangster movie!  The old Michael and this Michael don't even seem to be relatives.\r I am reminded of a line from Barton Fink where the studio boss get's angry at the misguided director:  \"We don't put Wally Beery in some fruity movie about a guy wrestling with his soul!\"  Similarly, Paramount Pictures don't put some fruity movie about a guy wrestling with his soul in the Godfather franchise!  Moralizing Coppola's so far off track wringing his choir-boy hands because he ignored the main lesson:  It's not a story about you and It's not personal, Francis.  It's only business, movie business gone terribly wrong."}, {"rating": "9", "text": "Not as good as the originals, but defiantly gripping and intense."}, {"rating": "4", "text": "As a nice little film about a bunch of hoods and their involvement in some complicated conspiracy involving the Vatican, The Godfather Part III works just fine, boasting first-rate performances from its two leading men and displaying enough clever directorial touches to suggest that this Francis Ford Coppola chap is a name to look out for. As the slavishly-awaited sequel to two of the finest films of the last 30 years, however, as the third episode in what may well be the Greatest Movie Story Ever Told, The Godfather Part III is, frankly, a dreadful disappointment.\r It is, perhaps, unfair that this new production should be so smothered under the reputation of two films made nearly 20 years ago. By so closely adhering to the exact structure of his previous two instalments, however, and through his liberal employment of flashbacks, Coppola himself seems to beg for the comparisons, making it abundantly clear throughout that what is on offer here is no new departure, but simply part three of that old familiar tale of the familia Corleone. And as such, it simply doesn't work, lacking the strength of narrative, the menace, the sheer epic sweep of all that has gone before.\r For about the first 30 minutes, however, everything seems to be very much in order. The familiar strains of Nino Rota's theme music never fail to send a shiver, the introduction of Andy Garcia as the suitably hotheaded bastard son of Sonny is a welcome addition to the ranks, while Pacino, all grey and shrunk, immediately conveys a telling portrait of immense power and obscene wealth, made all the more impressive by its confinement within such a wizened old frame.\r The first hint that we may be going slightly off the rails comes with the gathering of the clans and the subsequent Die Hard-style interruption from the skies, a badly-handled set piece more reminiscent of Bond than the beautifully understated brutality of the tollbooth.\r From here on, the violence becomes increasingly cartoon, notably Garcia riding a horse through the inevitable street festival, while things go from bad to worse as it gradually becomes all too apparent just how far out of her depth Sofia Coppola really is, floundering helplessly in her vain attempts to convince as both the Garcia love interest and daughter of the Don. By the time the much-vaunted operatic climax comes along, it is hardly surprising that proceedings finally slip into near-farce, as the supposed top assassin in all of Sicily takes a good half-hour and a fair portion of Cavalleria Rusticana to line up his sights. Miss Sofia manages to provoke the giggles amidst such supposed tragedy and all that is left is a basic re-run of your actual Don Corelone coil-shuffling routine to round things off.\r Fans of the first two instalments are likely to find The Godfather Part III an unworthy heir to the tradition. First-time voters, meanwhile, will surely wonder what on earth all the fuss was all about.\r Fans of the first two instalments are likely to find The Godfather Part III an unworthy heir to the tradition. First-time voters, meanwhile, will surely wonder what on earth all the fuss was all about."}, {"rating": "5", "text": "It is not as awful as I remember it being, but the final film in the Godfather trilogy is clearly the weakest.  At the center of the story we have an older, more sympathetic Michael Corleone - now a respectable, rich businessman and philanthropist who is trying to reunite his family and make amends - but his mafia past keeps reaching out and dragging him back in.  He begins grooming his illegitimate nephew (Andy Garcia) for a leadership role, and this hothead gets a romance going with Michael's daughter (his first cousin - yuk - in a part played by the director's daughter).  A lot of the story involves the Catholic church and Michael's involvement in their finances - this was obviously based on a scandal that took place in the 1980s.  Maybe I'm too much of a stickler for realism, but I never understood the financial picture or who was screwing who out of what.  This should have been about the fall of the Corleones if it was to be a real \"rise and fall of...\" story, but they never really fall.  Instead there is a wild series of murders at the end, intercut with an Italian opera taking place on a stage (referring to the similar sequences in the first two movies), but the logic of it was never clear to me."}, {"rating": "9", "text": "Get a grip you lot - it's only a movie. And it's a really good movie too."}, {"rating": "9", "text": "I just saw Godfather Part 3 for the first time two days ago. While it still ranks as a great film, it lacks the emotional intensity of the first two films. The earlier two movies had incredibly well-acted and engrossing supporting characters like Fredo. Godfather Part 3 with Sofia Coppola, Joe Mantegna, and George Hamilton (while none of them were bad) just do not measure up to the quality of the first two movies."}, {"rating": "6", "text": "This film follows the story of \"The Godfather,\" which chronicles the journey of the Corleone family through the violent world of organized crime. In this film, an elderly Michael Corleone lives haunted by the crimes he committed and looking desperately, but unsuccessfully, to clean his family of any taint through its legitimation and links to the Vatican.Directed by Francis Ford Coppola, based on the novels of Mario Puzo, who collaborated in the writing of the script, it kept most of the cast of the previous films, made in the seventies, and bring new and important characters. The soundtrack goes from Nino Rota to Carmine Coppola, father of director and Talia Shire, actress who also enters this film. It didn't won any Academy Award but was nominated for seven statuettes.More than fifteen years after \"The Godfather II\", this film is, almost, the black sheep of the \"family\". Criticized, misunderstood, even somewhat ridiculed, will always live in the shadow of the two films that preceded it, and which are undoubtedly two giants of cinema. And if we want to compare them, this is the loser because it can no longer surprise us, despite maintaining excellent action scenes and a Michael Corleone much more paternalistic, living threatened by his ghosts (in particular his brother, which is a very smart way to explore the cruelest act of the criminal life of this mobster). I didn't quite understand his position on the daughter's romance with Vincent, her cousin. The connection to the Catholic Church also seemed a bit forced, as if it had been snapped on in the script. Al Pacino has remained up to the challenge and managed to perfectly display the psychological contradictions of his character. Andy Garcia also had a great performance and Joe Mantegna can say that this, probably, it was the best performance he did. This is a film that is worth seeing, mostly if we didn't compare it to the previous two films."}, {"rating": "6", "text": "Infelizmente, não conseguiu superar seu antecessor. aqui, vemos mudanças absurdas nos personagens. não a nenhum problema aqui com isso. mas...nao me agradou muito. eu esperava uma conclusao epica. nao e ruim, e bom eu gostei. mas, faltou uma coisa, varias coisas. elementos importantes que precisavam estar aqui presente."}, {"rating": "3", "text": "Many of the reviews of this seem too positive. The movie was deeply flawed and love for the early Godfather films should not blind us to the fiasco that was number 3.Casting problems: Diane Keaton said all she needed to say in part 2. Her presence in the part 3 added nothing whatsoever. We learn from her dialog that she will always love Michael but that she will never accept his gangster ways. Yeah. We learned that in part 2. George Hamilton as the lawyer/confident. Lame. Sophia Coppola as Mary. She comes across like a dull-witted 16-year-old that doesn't know a thing about acting but thinks it is fun to be able to stand in front of a camera. (spoiler alert) the primary dramatic event of the movie involved her death. By that time I was hoping that she would be killed off (or at least get no more screen time), so my ability to feel any emotional impact at the death of this air-headed monstrosity.Dialog problems: The dialog in Michael's study in the initial scene is painful to hear. The movie gets better, but very awkward dialog pops up every 20 minutes or so throughout the movie. Part of the problem is the screen play and part of the problem is that at times the actors don't know how to effectively deliver their lines.Plot problems: Awkward casting & dialog aside, I think this is the biggest problem. when you get to be one of the wealthiest business men in the world, wacking people no longer makes any sense. When you have untold millions at your disposal, you find that you a wide range of tools to accomplish your aims, and most of these tools work better than bullets (anyone remember the last time a Fortune 500 CEO was taken out in a mob hit?). (spoiler alert) There is a scene in which one of the baddies flies a helicopter outside a penthouse ballroom in a high rise building and then occupants of the helicopter riddle the ballroom with machine gun fire killing dozens of wealthy business men. This would be par for the course in the Matrix, or True Lies, or Commando, but this type of violence is not part of the real world we live in. It's cartoonishness is at odds with the other Godfather films and makes it difficult to take this film seriously. As well paced and tense as the final opera house scene was, it was also in the category of cartooney violence. Did the best assassin in all of Italy really think the cleverest way to kill one of the richest men on the planet was to slip into a well guarded public place, kill off a bunch of hired body guards and then shoot a man in front of 1000 witnesses? Well, I guess the screenwriter thought so. The end result was a complete mess. The narrative flow of the final film was a train wreck. The plot elements went back from somewhat believable to overblown Hollywood insanity and back again."}, {"rating": "3", "text": "So this is the Godfather film that I can say is bad and not get a bunch of fanboys attacking me. Yay.Unlike the subtle and quieter tone of the first 2 films, this is loud noise. The story is more of an over the top satire about ties to the Vatican bank, the pope, and even a subplot about incest! EW, I DO NOT WANT TO SEE A YOUNG GIRL HIT ON HER COUSIN!The acting and writing are also inferior, and not done well.There's even a part where a helicopter tries to kill a group of men. It's loud, obnoxious, and goes against the quietness of the first 2 films. Then there was that piss poor written part where this one idiot is like \"MY LUCKY COAT!\" What idiot wrote that dumb sh*t?!The film is also 2 hours and 42 minutes. UGH! At least the first 2 Godfather films had a better tone, and way better writing.So yeah, this film is bad."}, {"rating": "5", "text": "Overall, as a standalone movie, it is definitely very flawed, but it has its moments. As a Godfather film, it is somewhat of a clunker. I didn't hate the movie, but with unconvincing and very less powerful performances, a somewhat cliche plot at some points, and overall a slow pacing, The Godfather Part III is definitely a step bellow its predecessors. It wasn't a bad conclusion, and I didn't hate it, but if you are worrying that this will ruin the great series for you, then you might want to think twice about seeing it."}, {"rating": "9", "text": "Not perfect, but certainly better than part two. Ultimately, after hearing about how everyone was so disappointed with three, I was surprised by how good it was."}, {"rating": "0", "text": "I love the first two. I would even dare to say they are two of the greatest American movies ever made. Then number three comes along and just ruins it all. Sofia Coppola does no favors to the already unbearably slow movie. Not to mention the whole opera scene.  They also do not have the decency to give Michael a good death. I do realize that they are based off novels, but goddamn."}, {"rating": "4", "text": "An enormous disappointment for Al Pacino and for the whole film. I'm expecting a lot about this movie thinking the fact that its predecessors are great (especially the first one which is one of the best films of all time). The acting is horrible, the script is lousy and the whole plot was ridiculous and boring. An incredibly terrible film, but still, it does not belong to the worst............."}, {"rating": "5", "text": "The Godfather 3, released 16 years after Godfather 2, has lost its cinematic touch. It's still a long film and follows Michael when he is older and in the process of retiring. The biggest let-down is how there is little connection between some events, and the story is very thinly linked together and at points not well explained or explored deeply. It almost feels as if it was dragged out, and produced with few intentions other than for profit. There's no real story to tell. However, I can give it credit for somehow managing to make it feel engaging and entertaining for the whole length. It only really picks up in the last 20 minutes or so, but it's worth watching if you've got some spare time and have seen the other two films."}, {"rating": "6", "text": "It loses its feel entirely but the acting and still sorta good plot keep it together."}, {"rating": "6", "text": "this movie is not an masterpiece as it was the two first godfathers but it didn't mean it's an ok movie.Of course that is a lot of mistakes but it is still an nice movie."}, {"rating": "10", "text": "The amount of suspense towards the end is crazy and the ending really lets it all out, I haven't seen a scene more heartbreaking. There's less of the Godfather theme to it because its not as dark and it has no Marlon Brando, but its still the same characters and actors and it doesnt fail to show the fate of the Corleone family. One of the greatest movies Ive ever seen."}, {"rating": "5", "text": "Far too similar to the previous films, Lacks originality and its actually pretty boring and not all that interesting either. While it does end perfectly, The build up to that moment is shallow and shows just how far the one great franchise has fallen."}, {"rating": "0", "text": "I can't bring myself to give this movie in form of score, a pure \"0\". It's sad when a series goes from \"good\" to masterpiece\", and finally to \"garbage\". There's nothing worth seeing in this movie."}, {"rating": "4", "text": "It lacks originality and is far too like the previous 2 films. The acting is fine but not as great as the previous films were. Overall it was a disapointing end to an epic series."}, {"rating": "5", "text": "Nada que ver a las otras dos partes, \"The Godfather: Part III\" mantiene un buen enfoque a la vida mafiosa y una historia mejor que muchas otra películas a las que uno le puede poner mas nota. Pero es un tanto aburrida con respecto a las anteriores."}, {"rating": "10", "text": "Yeah - definitely flawed - but still really great. Not so much a godfather film, as an attempt by Coppola to understand himself in middle-age."}, {"rating": "6", "text": "Mikey returns in the the twilight of his life, to replenish himself and his 'family' of crime. After watching part I and II of Mario Puzo's: The Godfather, I have to say, this movie was a disappointment. It still is a great movie,  but from my view, Al Pacino was greatly trying to re-enact what Marlon Brando perfected in part I. He failed. The whole point of Brado's performance was that he was always subtle. 'Michael' is a good character in his own right but a shadow in the greatness of 'Don Vito'. 'Vincent's' part in the movie was well executed by Andy Garcia, but yet again, Coppola tries to re-enact 'Michael' with 'Vincent'. This worked out better than the other one, but still had missing elements. The story was compelling with suspense and was a fitting end to 'The Godfather' trilogy. 6/10. Above average movie!"}, {"rating": "5", "text": "It's not so bad, not like everybody says. Sure, Sophia Coppola's acting sucks, but not throughout - a good portion of it I can stand. I would say if anything, it's Al Pacino's effort that's the most disappointing. It has a pretty weak plot - very weak compared to the first two and the dialogue is weak. It's too long - doesn't deserve or earn the length, like the first two. There aren't so many layers like the first two. If anything, repeat watches lessen my opinion of the film, because I just keep finding more and more flaws. The final couple scenes are nice, but maybe not worth a three-hour watch. Coming into the third, I expected very little, so it was a nice conclusion, but as a standalone, it's terrible. Don't watch it if you didn't like the first two, but then again, if you loved the first two, there's a good chance you'll hate this one. So maybe only watch out of morbid curiosity, or if you're one of those die-hard fans who will give it a 10/10 no matter what."}, {"rating": "9", "text": "(85/100)It's the worst one out of The Godfather Trilogy but still a very good movie. The acting was a bit weak with Mary (Sofia Coppola) and Anthony (Franc D'Ambrosio), but that doesn't take away your focus too much. Vincent (Andy Garcia) was definitely the best new character. The Godfather, Part III is a strong movie with a relatively good plot."}, {"rating": "8", "text": "It's almost common knowledge that this film gets a boatload of flack, but I actually found \"The Godfather Part III\" to be quite an engaging and gratifying conclusion to the truly epic trilogy. While the film does have a few flagrant problems here and there, I find its merits to outweigh them deftly."}, {"rating": "4", "text": "Horrible, horrible, horrible. How is it possible that Al Pacino could give such an inept performance. I hated it, hated the whole damm thing. Bad acting, lame cliche script. Coppola took one of the most complex characters in cinema and made him paper thin. Sophia's terrible performace is just icing on the shit cake. The only thing that was good was the ending. Everything else was dull beyond beliefe. At least the Matrix sequels were entertaining."}, {"rating": "3", "text": "The film music alone made me dislike the movie from the beginning. It has been \"hollywood-ized\" - the atmosphere of the first two parts its missing entirely. I couldn't even watch it at once - I actually wouldn't have watched it to the end at all if it weren't for the money that I spent on the DVD. One thing they managed to get on screen though: The decline of the family by the decline of the movie itself."}, {"rating": "3", "text": "Abysmal film. Unbelievable work from Scorcese. The film has lost all its glamour character and depth."}, {"rating": "10", "text": "Sofia Coppla isn't nough to ruin this. The cast is stellar!"}, {"rating": "1", "text": "This one is the weakest film of 1990. The acting is poor. And Sofia Coppola is mistaken for being cast in the movie. Andy Garcia played his part well. Call that the most powerful film? NOT!"}, {"rating": "0", "text": "Terrible acting, plot (what little unbelieveable amount there is) doesn't hold together. Took 4 viewings to watch the entire thing, that's how bad it is. Garcia acts as well as the average wrestler and shire/little coppola may as well have entered a hog calling contest."}, {"rating": "0", "text": "The first part fascinated me, the book is amazing, the film isn't as good, but part 2 wasn't as good, it was all right, but it never worked with Al Pacino. And this, Al Pacino is more tuff, grumpy, and more compromising, I found cheesy and terrible. Either it is good, all right, or terrible. Classics can be either of the three since I know what a classic is. And this is terrible."}, {"rating": "9", "text": "I know this movie has been subject of harsh criticism, especially when compared to the previous two. It is important to emphasize, however, that this film has merit by its own. At first, one may not feel very connected with this movie because the absence of those characters that we learnt to love in those 2 previous 'The Godfather'...but I think we all know the reasons why they were not there. Thus, there was a need to think in a new storyline that was also engaging but could survive without those old characters. The plot is different and it may be perceived as forced and lame..Yet when located in the right context it does make sense. I believe the performances were good, and I enjoyed seeing the other side of Michael Corleone...here we see that he was after all human, although he never regretted what he did. In The Godfather I and II his character was all negative. Michael is presented as emotionless, controlling, obsessive, and ruthless. Governed by his ego and desires of revenge. Here...we can see a different side, the one of a lonely man...one that in spite of his power can never be in peace and doesn't seem to get anything he wants no matter what he does. As a result, he questions his means..especially considering the fact that his children have chosen different paths. Overall, I have to say that I enjoyed this movie more than The Godfather II . Finally, I would like to add that even though I have heard that some disliked Sofia Coppola's performance. I did not.. He performance was not outstanding but I do not believe it was bad. Her character was relevant to the plot but it was never meant to be central...thus; her characterization doesn't really affect the value of the movie. I give it a 9"}, {"rating": "7", "text": "This one is not as good as the first two for sure, but it has many positives. For starters, Al Pacino is great once again in his role as Michael Corleone. The changing landscape of the families is also well presented as we see many youngsters trying to come into the business, while many of the key players from before are now on their way out. In addition, the homages to the first two films and footage from the first two were brilliantly used and really added a nice touch here. For the most part, it was nice to see some things brought to a closure from the first two and how the family has progressed and regressed over all of these years. However, the negatives here really are what hold the film back. Firstly, the plot can be overly complicated at times, likely due to poor storytelling. At times, things would happen and you are trying to figure out what just happened and why. However, the major issue is the acting. Andy Garcia is fine for the most part, but at times, he fails to step up to the plate. I still feel like he had the charisma and energy for the role, I just wish his performance did not slump at times. Sofia Coppola was horrendous. I always thought people were overstating how bad she is, but you simply cannot overstate it. I think my dog could have been a better Mary than her.\r Overall, this final entry into the Godfather trilogy is much like the raisin cookie to the first two's chocolate chip. No matter what, you are disappointed that it is not chocolate chip, but if you like raisins and can overcome that disappointment, you somewhat enjoy the cookie anyways. But, not everyone likes raisins and can overcome that disappointment."}, {"rating": "7", "text": "The last instalment in the Godfather trilogy, The Godfather Part III, has some obvious flaws. Including real life events out of the time of the Vatican’s crisis in the late 70’s and early 80’s, for one, let the whole plot seem a bit weird and didn’t work all the time. Even more crucial, the casting of Sofia Coppola as Michael’s grown-up daughter Mary. Although we’ve come to experience her directing qualities a decade later, she just didn’t succeed in her role and was utterly unconvincing throughout the film. And, as in the two first films, it’s also more than a tad too long, which makes for some rather dreary moments.\rNevertheless, The Godfather Part III is a very good film and can very well compete with the rest of the series, despite being yet another step back from The Godfather’s initial quality. Not only can the audience still enjoy fabulous cinematography, set design, and score work (all of these securing the film’s respectable amount of Oscar nominations), but also some final 20 minutes that will keep The Godfather Part III in your memory. As we can relish in the insanely well-made shots of all the people that have just died under most unnatural circumstances, the crew concocts what are, in my opinion, the three best shots of all three films: Frederick Keinszig, hanging dead from a bridge, Calò stabbing Don Lucchesi with his own glasses, and Archbishop Gilday falling  to his dead.\rIt may be just a bit too little of everything to establish Part III’s place on the same shelf as the first two films in the series, but it’s still the great Francis Ford Coppola that directed it and made the most out of a story significantly less interesting than I had expected."}, {"rating": "10", "text": "The best film by Coppola. This is a King Lear film, a Shakespearean tragedy. Sophia Coppoplla's performs was not great, but suitable. It's better than part 2 because this was much an conclusion."}, {"rating": "10", "text": "Only the ending was good I think. Francis For C., after many many years, thought to close the Godfather with a third film. Not a good decision at all!!! I didn't like so much. The worst movie of the trilogy."}, {"rating": "7", "text": "Although it can never live up to the first two, Part III isn't totally horrible. However, many problems are abound, and I can't decide which one is the worst. Maybe it's Sofia Coppola's botox-looking face with her wooden, emotionless, \"I don't give a damn I'm the director's daughter\"-like acting. Maybe it's the occasional dragging scene that weighs the movie down. Maybe it's the fact that Andy Garcia looks way too Cuban to be of Italian descent. I don't know. The first 2 hours are just kind of there, but the movie does come to a stunning climax at the end, and is a nice resolution to the trilogy. Yes, it might be a cash-grabbing sequel effort, but you must watch it to close out the series."}, {"rating": "8", "text": "I think the Godfather 3 is still a good movie but it falls flat especially with the pressure from the first two. Still captivating and capturing but some of the acting really just didn't catch me that well. (Again comparing to the first two.)A great way to end it too with especially with that very powerful ending."}, {"rating": "9", "text": "The Godfather Part III is a 1990 American crime film written by Mario Puzo and Francis Ford Coppola, and directed by Coppola. It completes the story of Michael Corleone, a Mafia kingpin who tries to legitimize his criminal empire. The film also weaves into its plot a fictionalized account of two real-life events: the 1978 death of Pope John Paul I and the Papal banking scandal of 1981–1982; both are linked with the affairs of Michael Corleone. The film stars Al Pacino, Diane Keaton, Talia Shire, and Andy García, and features Eli Wallach, Joe Mantegna, George Hamilton, Bridget Fonda, and Sofia Coppola."}, {"rating": "10", "text": "This movie is really good contrary to the comman belief that this is\rnot the good film. Just omit and see the movie... This is the best end\rof the trilogy.... Don't go for negative review... Cheers"}, {"rating": "10", "text": "Overall, as a standalone movie, it is definitely very flawed, but it has its moments. As a Godfather film, it is somewhat of a clunker. I didn't hate the movie, but with unconvincing and very less powerful performances, a somewhat cliche plot at some points, and overall a slow pacing, The Godfather Part III is definitely a step bellow its predecessors. It wasn't a bad conclusion, and I didn't hate it, but if you are worrying that this will ruin the great series for you, then you might want to think twice about seeing it."}, {"rating": "8", "text": "I think this is the most underrated movie of all time. Despite what people think i think this movie is great, a good way to finish the best trilogy in cinema history, and quite entertaining."}, {"rating": "7", "text": "[PT-BR] A parte final de uma das melhores trilogias já produzida por algum humano na face da terra, Part III é mais fraca de todas infelizmente, mas o final ainda é satisfatório, o meu maior problema com esse filme é a Sofia Coppola que dizendo a verdade não é uma boa atriz, ela é uma boa diretora como o pai mas não uma boa atriz, e o papel que ela exerce nesse filme é um grande papel e a má atuação dela não ajuda e as vezes o filme não consegue equilibrar entre o Michael e o seu aprendiz, o filme te tenta criar algum afeto pelo aprendiz do Michael mas você não vai se importar com ninguém nesse filme a não  ser o Michael."}, {"rating": "8", "text": "The first two movies are two of the highest cinematic achievements ever and it's really comprehensible how hard for this movie is to top that. It just doesn't, but the directing, writing and acting (excepting Sofia's awful performance) are still good since there's experienced people doing it. It's certainly the \"less good\" of the trilogy, but it's not a bad movie."}, {"rating": "9", "text": "Superbe conclusion de la saga mafieuse que l'on pourrait résumer par \"le crime ne paie pas\" ou bien par \"le crime tue\", car comme de coutume, la voie de la facilité, la voie de l'assassinat et du nettoyage par le vide n'arrange pas les choses... bien au contraire mais ainsi va la violence de ces gens-là...Cette observation, cette évidence, presque une tautologie -non que dis-je, une lapalissade- m'est venue à l'esprit à la fin de ce Parrain troisième du nom, une fin assurément dramatique digne d'une histoire à la sicilienne dans laquelle de vendetta en vendetta, tout le monde finit par s'entretuer alors que les prétendus marionnettistes tombent dans la toile de ceux qu'ils croyaient manipuler.Ainsi, Michael Corleone le mafioso en quête de rédemption qui tente une opération \"mains propres\" afin de tirer un trait sur son passé et comme -si souvent- afin d'assurer l'avenir de sa et de \"la\" famille se retrouve encore une fois pris dans l'engrenage infernal de Cosa Nostra.Conclusion édifiante et touchante mais sans complaisance, ce dernier Parrain est un véritable accomplissement pour Al Pacino qui a gagné en maturité et en expérience et délivre ici une extraordinaire prestation. Le jeune poulain, Andy Garcia, s'avère à la hauteur, ce qui n'est pas rien même si on sait déjà qu'il s'agit d'un acteur très estimable en règle générale. Quant à Eli Wallach en vieux grigou retors, que dire sinon que ce monstre sacré tire encore davantage le film vers le haut !Moins long (tout de même !) que les deux précédents -mais un peu long quand même- Le Parrain 3 est toujours d'une ambiance inimitable faite de réunions de pontes duplices et de rencontres discrètes où l'on fomente les prochains meurtres comme l'on avance ses pièces sur l'échiquier du double jeu et de la fourberie.C'est aussi bien évidemment un lourd passif familial -et sentimental- dont même un Don -ou certain Don- peut éprouver quelque remords et regret. Contrairement au Parrain 2, le scénario reste assez clair et suffisamment développé pour qu'on en suive les tenants et aboutissants sans migraine, alors que chacun tire les ficelles en coulisses.Quasiment un sans-faute donc pour le grand final et le meilleur opus de la saga."}, {"rating": "8", "text": "The movie would have obviously been worse than both the first and second movie since they had set such high standards for any moviegoer. The reasons why this movie has been panned is because of the various subplots, the unnecessary romance scenes, its inadequacy of being a standalone film (unlike Godfather II), and the atrocious acting of Sofia Coppola. However, the highs in this movie are very high. VERY high. I loved the second half of the movie, especially when Michael tours Kay around Sicily, as it is one of the more tender and beautiful scenes of this movie, if not the Godfather trilogy. The chemistry between Diane and Al is utter beauty. The opera scene is the greatest poetic justice I have seen in the trilogy. Heck, I even find that scene better than the baptism climax of the first movie. Andy Garcia was fully fit as Sonny's bastard son Vincent, and his character is one of the best of the Godfather trilogy as it depicted a fruitful change from a brash, rowdy man to a more responsible, sacrificial Don. The family struggles are a vital part of the movie, as you would see from the start where Michael quarrels with Kay about Anthony becoming an opera singer. The religious undertones too are commendable, especially the subplot on the murder of Pope John Paul I. The climax of this movie, where Michael Corleone contemplates shows what he has lost: his three loves of his depressing life. He lost Apollonia due to mistrust, he lost Kay due to his business, and he lost Mary due to gangster rivalry. On paper, it may seem he died of old age, but he actually died due to these three aspects. In short, it is a flawed masterpiece."}], "recommendations": ["american_gangster", "creed_ii", "the_godfather_part_ii", "suburbicon", "true_grit", "the_departed", "the_magnificent_seven", "man_on_fire", "the_karate_kid_part_iii", "public_enemies", "knives_out", "changeling", "hereafter", "body_of_lies", "the_invasion", "ben_hur", "reminiscence", "the_prestige", "no_country_for_old_men", "donnie_brasco", "mystic_river", "creed", "the_devil_all_the_time", "the_gambler", "what_happened_to_monday"]}