{
  "id": 3808,
  "title": "The Tale of Despereaux",
  "starring": [
    "Matthew Broderick",
    "Dustin Hoffman"
  ],
  "runtime": 93,
  "genre": [
    "Adventure",
    "Animation",
    "Family"
  ],
  "description": "Once upon a time... in the far away kingdom of Dor... lived a brave and virtuous mouse with comically oversized ears who dreamt of becoming a knight. Banished from his home for having such lofty ambitions, Despereaux sets off on an amazing adventure with his good-hearted rat friend Roscuro, who leads him, at long last, on a very noble quest to rescue an endangered princess and save an entire kingdom from darkness.",
  "releaseYear": "2008",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yADB4GsH2AvSHPsBVGjj8wByonk.jpg",
  "categories": {
    "plot": 5.5625,
    "acting": 4.642857142857143,
    "ending": 5.5,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 9.0,
    "funny": 3.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "This film was a mess. The plot was like three very crappy early-morning children's TV shows stripped of all personality and quirk and rolled into an hour and a half of extremely dull, artsy-fartsy, fragmented storylines. They obviously pushed the 'morbid' theme as far as they could while still advertising as G-rated.I thought the voice acting was pretty bad despite all the big names that worked on this movie. Every time Sigourney Weaver jumped in to preach at us through the narration, I couldn't help groaning a little ... it was that bad.I haven't read the book, but I have a feeling that most of the parts I really loathed were invented for the film."
    },
    {
      "rating": "6",
      "text": "Two years ago during Christmas of 2008, I got this book of the same name written by author Kate Dicamillo. I read it, enjoyed it, and was desperate to see this CGI movie-adaptation of a great book. I did saw it at the Clifton Park Mall at Albany, New York during my visit with my cousins at Christmas. Throughout the whole movie, it didn't meet my expectations, but for a kids movie, its just pretty decent.\r The storyline was weak and scrambled, it had some very dark moments and the villain's death in the movie was very mediocre, but the animation was excellent, The characters were worth-seeing, The acting was great, and The music score by William Ross was lovely.\r Although, did I forget to mention that it had every single actor I've known for the past few years? Man, was that awesome! H*ll, Even Matthew Broderick (The Lion King, Bee Movie), Emma Watson (The Harry Potter Series), and Dustin Hoffman (Kung Fu Panda) were so freaking good.\r Bottomline: \"The Tale of Despereaux\" isn't the best CGI cartoon and its not intended for adults, but for the kids, its definitely worth a watch on DVD rental only.\r Rating: 3 1/2 out of 5 stars"
    },
    {
      "rating": "8",
      "text": "Maybe this movie simply suffers in comparison to a virtuosic film like Ratatouille? My family found it to be a great sweet story, well-animated, with none of these bullsh*t, Brooklyn-accented wiseacres that plague lesser animated films. A fine, quality entertainment."
    },
    {
      "rating": "3",
      "text": "This tale is long in duration but short in plot, action, humor, character development, and everything else that makes an animated movie good. The bad guy, a rat, is recycled, part and parcel, from the critic in Ratatouille - I think they took the same CGI model and made it a rat. I was so disappointed - the premise had so much potential, but the follow-through was flat and utterly uninspiring."
    },
    {
      "rating": "9",
      "text": "I was inspired by the visuals, enthrawled by the meathod of story telling, and encouraged by the unapologetic moral themes. Plus my 9 year old was entertained!"
    },
    {
      "rating": "9",
      "text": "I must have missed something. My wife and I took our 3 kids to this movie (7, 5 and 3) and we ALL loved it! It is multi-layered, requires some thought and attention and is a very enjoyable movie! A few scary parts? Yes, but my kids got passed that quickly. They enjoyed the dreamy sequences of the story, the drama and, especially, the chivalry of Despereaux. A real treat!"
    },
    {
      "rating": "9",
      "text": "People telling been scared because of this movie, they're as coward as the mice in it. This movie is about honor, bravery and not to give up, even in the worst situations. A very nice movie."
    },
    {
      "rating": "5",
      "text": "A food loving rat ends up messing around in the kitchen with a soup, which unleashes a mayhem like never seen before. Sounds familiar, a bit like Ratatouille? Well, it's not. The Tale of Despereaux has some very beautiful passages to it, some wonderful artwork, but the animation sucks and the story is a bit too fractured to really work for this type of a film."
    },
    {
      "rating": "6",
      "text": "Nicely animated, but it just seems they took a lot of ideas and characters from other animated films and made a movie out of it. It lacks imagination and freshness, but I was still entertained."
    },
    {
      "rating": "8",
      "text": "Sweet and sweetly made."
    },
    {
      "rating": "1",
      "text": "This was a dark, scary movie to take kids from 8 & under to... my grandkids said they wanted to go home less than halfway through it ! ( I wanted to leave too !) We did leave .... sorry to have wasted money... wish we had read the reviews before we went !"
    },
    {
      "rating": "6",
      "text": "6/10, surprisingly, it should have been a lot better. Told by Sigourney Weaver as a narrator, it sounds just like a fairytale of an enchanted princess who confronts a talking mouse, who, just like in Ratatouille, is banished by his mouse clan for talking to humans. There are well-intentioned messages here about a rat and an"
    },
    {
      "rating": "9",
      "text": "Great Movie! So cute. Great Music. Very original."
    },
    {
      "rating": "9",
      "text": "I almost didn't take my newly 5 year old son to see this based on the reviews I read here. I am glad I didn't take heed. Both my son and I really, really enjoyed it. He was engrossed the whole time and only once asked where Despereaux was. I laughed out loud quite a few times and thought it was truly good. It was beautifully animated and the story was great too. It actually reminded me of seeing a story book come to life. Go see this. Finally to all of the \"professional\" reviewers out there; please don't review a movie based on what you think a child's mind or attention span can handle. If children can handle Wall-E then they can handle Despereaux. Unfairly underrated."
    },
    {
      "rating": "2",
      "text": "Terrible. I saw this with the family prior to christmas day, and even the 7 year old kids didn't like this. The story was filled with more holes and cracks then the wartorn streets of Baghdad. The annoying voice over of Sigonry Weaver constantly manages to detach the audience from any illusion of disbelief, she also manages to confuse the audience by saying that mice and rats can't talk, then having a movie about Mice and Rats constantly arguing and lamenting over the loss of soup. The worst thing about this movie though, the one thing that managed to beat the horrible animation, disgusting shrek looking peasents, unlikeable characters, the drawn out plot, the over sensual voice acting from emma watson(even through voice acting she was suggestive) and the horrible, horrible cliched dialouge was the morals it might spread to children. The morals this movie manages to be preach might actually be the opposite of what Mufasa was trying to teach in \"The Lion King\". Desperaux goes out of his way to get into trouble to prove he is brave, I only hope children realize this movie is as terrible as I know it is and ignore it all together. It gets two points because It has a lot famous voice actors and that should give it SOME points. right?"
    },
    {
      "rating": "0",
      "text": "i don't usually bother rating movies online but this atrocious mess prompted me to try and save someone from making the same mistake i did. do not go see this movie. there are no redeeming factors to be considered here, this is an utter stinker, not for kids not for adults. peeeeyouuuuuuu."
    },
    {
      "rating": "2",
      "text": "Nice animation, but my husband, myself and our 9 year old daughter quickly became lost in the plot. We also found it to be somewhat dark and violent for a rated \"G\" movie."
    },
    {
      "rating": "2",
      "text": "A boring pseudo-legend with unconvincing characters, phoned-in voice acting, a completely unnecessary narrator, mediocre visuals, poor dialogue, a bad plot, and, despite the potential for comic brilliance, was completely unfunny after the first half hour, and would only be funny if you hadn't seen the trailer in which they threw away all the good jokes. This is strictly a kids' movie, and not a very good one, at that. Definitely not worth the first viewing, much less a second."
    },
    {
      "rating": "6",
      "text": "Overall, this was a good movie for kids under the age of 8. The film could have been about 20 minutes shorter and had a bit less violence for a G rated movie, but everyone under 8 enjoyed it."
    },
    {
      "rating": "9",
      "text": "Very good movie."
    },
    {
      "rating": "5",
      "text": "Has some interesting visuals but the plot struggles to stay engaging. Voice acting is fine."
    },
    {
      "rating": "4",
      "text": "They changed several things about the book that simply didn't work for the film. One thing, where Despereaux is a just a boy and has Dustin Hoffman's older than dirt voice, the cook' s friend made from kitchen ingredients and the bad rat just kept jumping around the side he was on."
    },
    {
      "rating": "6",
      "text": "Let's get this out of the way first and foremost: \"The Tale of Despereaux\" is not another \"WALL-E\" or \"Kung Fu Panda.\" It's not revolutionary filmmaking or anything like that, and it won't be an awards contender. That said, it's still a relatively entertaining flick. Not the most well-written film, \"The Tale of Despereaux\" still benefits from some solid visuals, decent action scenes and good performances from its great cast. You might not want to walk in with super high expectations or anything like that, but if you keep your expectations tempered, you might end up finding something to enjoy in this decent animated adventure."
    },
    {
      "rating": "4",
      "text": "This movie is not the greatest. It's actually slightly worse than Ratatouille. The storyline was okay. The voice acting was fine. The animation sucked. Tales of Despereux was not funny at all but if you have no sense of humor, then watch it. If you do like me, avoid it. Watch Harry Potter instead."
    },
    {
      "rating": "5",
      "text": "Impeccable computer effect, but the who movie needs a better story as a backbone. The characters are rather stereotyped as most of them are given protagonist/ antagonist- face."
    }
  ],
  "recommendations": [
    "dolittle",
    "wonder_park",
    "hotel_transylvania_2",
    "chicken_little",
    "the_lego_movie",
    "hotel_transylvania",
    "alvin_and_the_chipmunks",
    "ice_age_the_meltdown",
    "ferdinand",
    "free_birds",
    "incredibles_2",
    "meet_the_robinsons",
    "the_smurfs",
    "peter_rabbit",
    "monster_house",
    "the_spiderwick_chronicles",
    "the_secret_life_of_pets_2",
    "storks",
    "the_croods",
    "uglydolls",
    "minions",
    "captain_underpants_the_first_epic_movie",
    "frozen_ii",
    "rio_2",
    "turbo"
  ]
}