{
  "id": 830,
  "title": "The Heat",
  "starring": [
    "Sandra Bullock",
    "Melissa McCarthy"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "Uptight and straight-laced, FBI Special Agent Sarah Ashburn is a methodical investigator with a reputation for excellence--and hyper-arrogance. Shannon Mullins, one of Boston P.D.'s \"finest,\" is foul-mouthed and has a very short fuse, and uses her gut instinct and street smarts to catch the most elusive criminals. Neither has ever had a partner, or a friend for that matter. When these two wildly incompatible law officers join forces to bring down a ruthless drug lord, they become the last thing anyone expected: buddies.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yERBa1y5zNUOTRKQPiDCPIc2fuv.jpg",
  "categories": {
    "plot": 6.684210526315789,
    "acting": 6.866666666666666,
    "ending": 5.8,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 6.450549450549451,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Yes, it's loud and sometimes crude, but it's fast, sharp and funny.  McCarthy and Bullock are strong actresses with great natural comedic timing and terrific chemistry together.\r If your sensibilities are easily rocked by women acting less ladylike?  Then stick to your boy buddy films... but good luck finding one this funny.  This film is unapologetic  which only makes it funnier...\r I haven't heard that much laughter in a theater in ages...  Looking forward to Heat 2."
    },
    {
      "rating": "7",
      "text": "Even though the movie was completely predictable, Melissa McCarthy made me laugh quite a bit, so I am giving this movie a pass.  Sandra Bullock was also good as the nerdy straight man, or straight woman in this case.  I enjoyed their chemistry.  The movie also has some politically incorrect humor involving an albino, and a lot of other crude, low brow humor.  If you're at all prudish when it comes to profanity, stay away."
    },
    {
      "rating": "7",
      "text": "A very funny movie that will bring a lot of laughs. Melissa McCarthy and Sandra Bullock make a perfect comedic team. It's surprisingly crude and downright vulgar at times, proving that these ladies can pull off dirty humor just as well as any male actor can. It's a not stop laugh riot, but it does have some issues that ultimately bring down the experience but do not ruin it.\r Admittedly some of the more violent moments here come across as more shocking than I think was intended. Mostly just because it's somewhat awkward to just get done laughing out loud only to see someone get shot in the face. I get that this is a cop movie but the transitions between humor to the more violent moments that this movie can offer can be a little more than awkward at times. Melissa McCarthy's character over-excessive use of profanity can be a little irritating as well. I get the whole tough cop character, but there's a time when all the cursing just becomes a little too much.\r Still, I can't tell you how much I laughed throughout this movie. There are so many hilarious moments that you will find yourself quoting with other people who have seen the movie. It proves that women can star in a vulgar and loud comedy just as well as any male actor, and is just a heck of a lot of fun to watch. So if you're looking for a laugh riot of a movie to watch then \"The Heat\" is for you."
    },
    {
      "rating": "7",
      "text": "The Heat was actually a really funny movie. Sandra Bullock and Melissa McCarthy are both really funny, though McCarthy's character is quite annoying early on. Also, a lot of the humor is a bit over the top so that can get old but a lot of it is still quite funny. I did love the Bill Burr cameo though. Overall, this film isn't for everyone but it provides some laughs and has decent plot and character development."
    },
    {
      "rating": "7",
      "text": "The Heat is Paul Feig's follow him to his smash hit comedy, Bridesmaids. The trailers for this film made it look absolutely hysterical, a completely can't miss comedy, but it's extreme raunchiness turns out to be it's worst enemy. When an ambitious FBI agent (Sandra Bullock) is sent to Boston to catch a monster, she sees it as an open and shut case. What she didn't expect was to run into a local detective who is anything but conventional. The background story and case the pair are working on is really terrific and very well written, with just the right amount of comedy, this really could have been the female version of Lethal Weapon. Instead, the Heat goes so far over the top, that by the end it just isn't that funny anymore. Sandra Bullock is terrific, despite playing her usual whiny loner character. When she finally has had enough of McCarthy and snaps, it really is the best part of the whole film. Mellisa McCarthy is the problem here, as she too is playing her usual character, but to a real extreme. I find her to be very funny, but in this film, nothing is serious and every other word out of her mouth is an F bomb. Every time the story really starts to take off and become interesting, she shows up to screw everything up. Don't get me wrong here, this film is much better than some of the other comedies to come out lately, but as it's destine for a sequel, my hope is that they will tune it down a bit. The right line at the right time can really make a film like this and some scenes are hilarious, but the truth is, when the jokes are non-stop and the action is few and far between, it really hurts the film. Lethal Weapon would be the perfect template for a team like this and with the right jokes at the right time, they could find even more success than Glover and Gibson did."
    },
    {
      "rating": "8",
      "text": "Don't listen to the critics, this movie was hilarious from start to finish. Melissa McCarthy has yet to disappoint me, and Sandra Bullock's return to comedy movies is very welcomed. These two ladies have surprisingly good chemistry, and this movie also has elements of drama cleverly blended in with the comedy. You really start to feel sad for the two main characters and their short comings, but the two as a duo come to compensate for each others lacking qualities. The only gripe I have about this movie is that there is alot of cursing. Much of what came from Melissa (shocking  and from other characters for no reason. The cussing should have been toned down a bit. But overall, this is the best comedy to come out this summer so far, you wont be disappointed"
    },
    {
      "rating": "8",
      "text": "I thought The Heat might be another unfunny buddy cop comedy. But the critics and the audience have raved about the movie so I decided to check it out, and to my surprise, I can see why.\r The Heat’s main highlight was its shocking, brash, yet funny humor. I could not stop laughing at what’s going on in the movie. The comedic timing is great.\r The chemistry of the duo, Melissa McCarthy and Sandra Bullock is a bit weird but it worked out for this movie thanks to their comedic talents. You can see that they had fun making the movie on set.\r The plot is okay. It seemed cliched with the conflict and the plot twist, though I was shocked about it too but it’s a comedy movie, what do you expect?\r The action scenes weren’t that dramatic, but that’s the point.\r I never thought I would care about the characters in the movie. I keep cheering for them to solve the crime, which is rare to root for in a movie like this.\r If you wanted to laugh for 2 hours, this is the movie you should see. I recommend you should watch it with friends for enhanced entertainment. Would I see it again? Sure, especially with friends around."
    },
    {
      "rating": "7",
      "text": "There are some laugh out loud moments in The Heat and the performances by Bullock and McCarthy are great. When there aren't laughs though you realize how predictable and pedestrian the story is. Therefore the movie  probably won't have much replay value. But if your looking for a raunchy comedy with some laughs then The Heat will do just fine."
    },
    {
      "rating": "9",
      "text": "This movie is all about the two leads, Bullock and McCarthy. They are hilarious together and work so well off each other, but there's no denying McCarthy is the star as she provides the majority of the laughs. It has a lot of swearing so be warned already about that, but its a clever concept as an FBI agent and Police Officer try and take down a drug lord with hilarious results of course. As long as you aren't taking it too seriously you will certainly enjoy this very funny Comedy"
    },
    {
      "rating": "6",
      "text": "The Heat attempts to flip the buddy cop genre on its head by making the two leads female. To some extent, it succeeds. Unfortunately, the most original thing about this movie is that it's two leads are female. The story is really bland, \"go in and stop a drug ring\" type thing. It's filled with laughs yes, but this is really just a somewhat less amusing version of The Other Guys, which managed to be wittier and have a better plot, all while sticking to a PG-13 rating."
    },
    {
      "rating": "7",
      "text": "Melissa McCarthy is definitely the star of this film her comedic timing is exceptional and her and Sandra Bullock play well off each other.  There are a few scenes that fall flat, but overall this is a real solid comedy."
    },
    {
      "rating": "8",
      "text": "One of the funniest movies of the year. Had me laughing at something in every scene. Melissa McCarthy is the funniest actress living today. Sandra Bullock is also hilarious. A must see!"
    },
    {
      "rating": "10",
      "text": "The heat has to be one of the best movies I've seen, Sandra Bullock just made the movie GREAT! Mostly because of the mean things she would say or just the actions, in the major events! I would really recommend you to watch it!"
    },
    {
      "rating": "9",
      "text": "If you didn't find these two wonderful actresses as funny and compatible as I did, I don't know what movie you saw, but it definitely wasn't The Heat!"
    },
    {
      "rating": "10",
      "text": "I have not laughed so much in a movie since Hangover 1. My jaw was aching and I had a grin on my face for an hour after we left the movie. Such great chemistry/interaction between Bullock and McCarthy. This what a comedy is meant to be."
    },
    {
      "rating": "7",
      "text": "It has to be one of the most amusing raunchy comedies I have ever seen. McCarthy shows no mercy taking on the role of fearless Shannon Mullins, along with Bullock as uptight FBI agent Sarah Ashburn. This comedy will (or should) tickle the fancy of any comedy fan."
    },
    {
      "rating": "10",
      "text": "Melissa Mcarthy is a cursing bad ass which  i love i did not  look forward in her performance in bridemaids but i did forward in other movies like identity theif ."
    },
    {
      "rating": "10",
      "text": "As if Melissa McCarthy isn't funny enough, add Sandra Bullock's funniest performance to the mix and you will not stop laughing from start to finish. A great time had by all... Bravo!"
    },
    {
      "rating": "8",
      "text": "Non stop laughs! One of the best comedies ever.  You will truly enjoy the movie. It's a must see!! If you need a quick \"escape from reality\" then take a time out and have some fun!"
    },
    {
      "rating": "5",
      "text": "What a disappointment. I was expecting great things from this movie. I thought McCarthy was great in Bridesmaids and likewise Bullock in Miss Congeniality. The two ladies together would be comedy gold, right? Wrong. This movie failed not because of these two talented actresses, but because the screenwriters were just flat out lazy. The story was terrible, and the jokes just lame. I believe I lost all respect for this film when they introduced an albino character where they continued to insult him on various \"white\" jokes. Just lazy. There were some funny moments in the film, and just one I would consider hilarious. Overall, this movie had a good concept, but the filmmakers blew it."
    },
    {
      "rating": "9",
      "text": "The Heat starring Sandra Bullock and Melissa McCarthy cop buddies! How on earth, can this go wrong?!?!?! The Heat is capricious fun with hilarious dialogue and some smart ass entertainment. Bullock and McCarthy comic energy makes it almost impossible to find flaws in this movie, which there is, but deniable. The Heat is by far the funniest movie 2013. Bravo!!"
    },
    {
      "rating": "3",
      "text": "In “Bridesmaids”, “Stolen Identity” and now in “The Heat” Melissa McCarthy proves that she can out pouty mouth any man, tell more poop and crotch (men and women) jokes and be more base than any of the “Hangover” guys so I am hoping she got that out of her system. I would like to see her tackle a deeper role as her Molly in her hit TV sitcom certainly shows a lot more depth as an actress than her movie roles. As it is she becomes very irritating each time she uses the “F” words, and forms of it, and it would make for s super drinking game as it seems every other word or motion starts with F. She is a very funny lady but the crudeness does not help her or the picture.\r I’ve been a big fan of Sandra Bullock’s from her ’girl next door’ roles to the nuttiness and comedy of “Miss Congeniality” and after reaching 40 she got serious, made “The Blind Side” and won an Oscar. In “The Heat” she shows she can keep up and match McCarthy for slapstick and ‘schtick’. The chemistry between them works in a movie that is all over the place and almost begs you to forget it is suppose to have a plot.\r The two women play that old stand by--a mismatched couple.  Sarah (Bullock) is an FBI agent who is a perfectionist and too smart for her own good while Shannon (McCarthy) is a Boston detective who never heard a dirty word she didn’t like and is always very expressive regarding people’s anatomies plus seems to never have had her hair done, taken a shower or changed her clothes! They are assigned to work together, don’t get along and yet bring down a major criminal!\r There is a lot of knock about comedy, with some working and some falling flat and even old prudes like me laughed at a few of the things the women have to say and do. This movie succeeds  though not due to the script by Katie Dippold or the direction by Paul Feig but by the antics of Bullock supported by McCarthy.  It is almost as if the two actresses got up in front of the camera for 2 hours and improvised what they could come up with. This is definitely Bullock’s movie.\r “The Heat” is rated R for good reason and I hope they make a ‘serious’ picture together as the two women bring out something special in each other in the quiet moments.."
    },
    {
      "rating": "2",
      "text": "Hard to believe this was done by the same Director as Bridesmaids. Melissa McCarthy as Mullins is just plain irritating and rude instead of funny. All of the male characters in the show are flawed and pathetic. A large proportion of the humor is based around the fact that McCarthy is obese, which constitutes cheap, childish laughs, I had to switch the film off when Sandra Bullock said the word 'Anyhooo.' Completely unacceptable"
    },
    {
      "rating": "1",
      "text": "A series of tired sight gags, each drawn out to a cring-inducing length.  Sloppy camera work, haphazard editing,\rgave it a while then walked out.\rThe Production Budget: is reportedly 43 million dollars.\rThey should have spend a few thousand dollars on a WRITER   !\rDVD if your totally smashed, and have never seen a really bad film"
    },
    {
      "rating": "1",
      "text": "Movie was poorly written and jokes are not funny at all .Bank on foul language to make it interest but thats really annoying .Also movie is so long and hard to watch it when no action or joke in it.Dont buy Blueray because its not worth it all."
    },
    {
      "rating": "10",
      "text": "I almost skipped this movie because of the horribly photoshopped poster.  The marketing people really messed up with this one  because this movie was refreshingly hilarious.  I'll admit my expectations were low, but i saw it on opening night with a packed house, and people (including me) were doubling over with laughter.  It was just fun.  Plus, it wasn't bogged down with side stories about someone's boyfriend or a romantic entanglement that derailed the mission or created an inner conflict for one of the characters.  These women are badass and they don't apologize for it.  We need more films like this:  written by women with strong female characters that everyone (including men), will relate to and be entertained by.\rKudos to Bullock and McCarthy for their commitment to the funny, honest, raw, raunchy, poignant, gritty roles.  More please!"
    },
    {
      "rating": "10",
      "text": "A Ladies Day Out movie! Sandra and Melissa rocked as partners. Only the villain was weak. i rate this movie 10/10.  Can't wait for Heat 2!!!!!!!!!!!!!"
    },
    {
      "rating": "0",
      "text": "This is the second movie this year where the majority of the story line is the F word. The lack of creativity and thoughtful script writing is evident."
    },
    {
      "rating": "10",
      "text": "I have not laughed so much in a movie since Hangover 1. My jaw was aching and I had a grin on my face for an hour after we left the movie. Such great chemistry/interaction between Bullock and McCarthy. This what a  comedy is meant to be."
    },
    {
      "rating": "8",
      "text": "One’s got a long track record and an Oscar on her mantel, the other’s lighting up the comedy circuit on large and small screens everywhere. So both are generating A-list box-office heat. Thus their summer pairing in the odd-couple police-action thriller The Heat, in which Sandra Bullock and Melissa McCarthy play disliked loners with the social skills of skunks who are in pursuit of an elusive Russian mobster, a murderous drug lord. Yep, you’re right, we’ve been there a million times. Yet even if every plot point in The Heat were suffocatingly familiar in this male-dominated genre, the film would still feel fresh because it remains an absolute rarity:  finally, a female buddy-cop flick! Bullock is prim-and-proper, by-the-book FBI special agent Sarah Ashburn, an accomplished and respected investigator who has gained a high degree of self-respect with more than a dash of arrogance, and who is actively seeking what she perceives as a well-deserved promotion. So when she’s paired with street-wise Boston PD detective Shannon Mullins, played as a slovenly loose cannon with a mean streak by McCarthy, she’s understandably unimpressed. The key element here, as you can imagine, is the comic chemistry between the two leads.  And it’s considerable and entertaining. Bullock is her usual dependable self, calibrating her character effectively without overdoing it within the confines of the action-thriller genre. As for breakout star McCarthy, so fine in a supporting role in Bridesmaids, then so overbearing when her talent was squandered as the female lead opposite Jason Bateman in Identity Thief earlier this year, she reunites with director Paul Feig, who knows how to showcase her hilarious, motormouth, scatological line readings and her flair for physical comedy. Producer and director Feig, who directed McCarthy to her out-of-nowhere Oscar nomination in Bridesmaids in 2011, gets another strong contribution from McCarthy, who matches and complements Bullock insult by insult, embellishing the scripted narrative with extensive, skilled improvisation. The tried-and-true screenplay by Katie Dippold, definitively formulaic but gender-bending as it is, benefits tremendously from sterling execution by director Feig and his two able leads.  But it goes beyond the surface contours of an action comedy, even though it qualifies as one, by managing to remain relatively character-driven all the way through. As for the film’s missteps and excesses  overemphasized bursts of graphic violence, generically obligatory narrative clichés, characters verging on caricature, too much improvisatory indulgence  well, this unique female version gets the same leeway that all those loose-as-a-goose male buddy-cop flicks have gotten down through the years. Welcome to the boys’ club, girls.  Thanks for the yuks. And in terms of R-rated mainstream franchise possibilities and the odds of there being at least one sequel, The Heat is on."
    },
    {
      "rating": "1",
      "text": "i was going to go see it till a reviewer on tv said there was 190 F words. If you need swearing to provoke a laugh in my opinion your not funny, your just crude and vulgar. Probably not as bad as hall pass which we walked out on. Don't waste your money on the DVD, might be okay edited on TV."
    },
    {
      "rating": "0",
      "text": "This movie was so bad I wanted to leave the theater after about 45 minutes.  The jokes were not funny at all, they're just stupid.  McCarthy yells a lot and uses the f word way, way too much for my enjoyment.  It's too bad because the acting was ok but the writing was just horrible.  Avoid this movie if you are looking for a comedy, it is not funny."
    },
    {
      "rating": "2",
      "text": "One long, angry but unfunny insult  especially to viewers. Plot is a retread of \"Beverly Hills Cops,\" and the \"jokes\"  if that's what they are  are just as old."
    },
    {
      "rating": "0",
      "text": "Poor plot, poor acting, annoying unlikeable characters.....\r And more importantly it was incredibly sexist towards men with constant belittling of men throughout the film.\r The gags were just vulgar and completely un called for, you can tell the script was written by a man hating feminist...\r Utter garbage"
    },
    {
      "rating": "7",
      "text": "It's hard to do another project after having successfully pulling off a big hit. Director Paul Feig doesn't fully fit the envelope in this one, but for sure leaves us something funny to laugh at. This movie is surprisingly funny. Melissa McCarthy and Sandra Bullock somehow manage to work together. The story is typical, but original at the same time. It's a buddy cop movie, but it's a female buddy cop movie (Which is what makes it original). There are also some other funny characters, but for sure, Melissa McCarthy (Once Again) steals all her scenes. She really makes this movie work and without here, this movie probably wouldn't have it's funny appeal. Overall, it's a funny female buddy-cop movie."
    },
    {
      "rating": "7",
      "text": "Great \"heat\" between the two female leads as they learn to bond against type.  Two problems keep this from being a really good summer comedy:  editing and a villain.  As others have noted, scenes go on to long and we're left waiting and wanting to move on.  The biggest fault is, however, the lack of a real villain.  There's absolutely no heat when we discover oh, that's the villain, and he's about as interesting (and evil) as a college fraternity boy caught peeping in a sorority house window.  What were they thinking???"
    },
    {
      "rating": "5",
      "text": "All funny scenes we saw in trailer, the rest of the movie is kinda dull and stupid. An ok acting combined with badly written plot equals average comedy!"
    },
    {
      "rating": "5",
      "text": "It seems they can not produce a very good comedy these days, forced humor, the story is not a strong thing in it. I do not lay out in laughter. Weak medium."
    },
    {
      "rating": "1",
      "text": "I found the film to be completely sexist and offensive to men without being funny at all. There are several scenes where they approach the line and then go over it taking their attempt at comedy completely into the unacceptable depths. The film also takes a pop at black people and albinos again completely uncalled for and not funny.\r Apparently the film was written by a feminist so that explains the hatred towards men but not the racism and mocking of those with incurable afflictions."
    },
    {
      "rating": "2",
      "text": "Sadly this film was one of the biggest disappointments of the summer lineup it features two women leads who I have liked in previous films but in this one are just annoying.\r The film tries to take conventional gags and take them to a level where no one is comfortable. Vulgar and over the top violence result in a film that is not suitable for anyone that is uneasy with blood.\r The film also has a think layer of sexist content aimed at men which is a shame because it shows how desperate they were for material for this film.\r Overall I was left with a bad taste in my mouth after watching it and would not recommend this film."
    },
    {
      "rating": "1",
      "text": "Utter garbage movie, I walked out of the movie after suffering the obvious sexism and offensive humour for about 45 minutes at that point I had had enough.\r If this is what women have to offer the world of comedy then I don't want any part of it\r Avoid at all costs"
    },
    {
      "rating": "6",
      "text": "Melissa McCarthy got hot after \"Bridesmaids,\" which was directed by Paul Feig who also did this. She's been on a roll since, but her style is wearing thin. She plays a rough, rowdy, renegade cop, who's teamed up with a straight laced FBI agent (Sandra Bullock). This trite buddy cop pairing has potential for comic situations and there are some amusing, even funny moments. The dialogue is crammed with McCarthy's foul-mouthed litany of insults and threats, but they're simply too much. While the abuse sometimes produces laffs, the situations and writing is mostly contrived for best comic effect. Sadly, it fails more than it succeeds."
    },
    {
      "rating": "4",
      "text": "Well, you can forget about expecting any kind of plot from this movie. Pretty generic stuff. As for the comedy, there is some chemistry between Sandra Bullock and Melissa McCarthy, but it doesn't make up for the few laughs in this flick. And all the \"F\" words in the world don't make up for it either.\rOverall, it was okay; but you don't have to see it. You're not really missing anything."
    },
    {
      "rating": "6",
      "text": "Directed by Bridesmaids' Paul Feig, The Heat tries to use the red hot star rating of Melissa McCarthy to produce comedy gold yet again and for the most part it is a genuinely funny crime thriller. When FBI agent Sarah Ashburn (Sandra Bullock) is sent to Boston to track down an arms smuggler she is paired with Boston detective Shannon Mullins (McCarthy) and the two use their interesting police techniques to bring down the illusive villain. Bridesmaids had the benefit of having a huge cast of extremely talented comedians while The Heat is quieter but still stuffed full of comedy. Bullock is excellent as the buttoned up agent as she manages to use the improvisational approach to the filming to benefit her characters nervous nature. While it takes a while to get going, the film is really built around its finale and its really is a fast paced, joke filled climax that lives up to all the setups. It lacks the comic timing of Kristin Wiig but McCarthy picks up the slack aplenty but its still not quite the same. Mullins is an abrasive character which unfortunately makes McCarthy's comedy very loud and ever so slightly ear shatteringly screechy. Another problem is the volume does remove any sense of subtlety to the jokes. However Bullock and McCarthy make an impressive comedy duo towards the end thanks to some much needed character development in the 2nd act, but the opening with its growing pains is dull as dishwater and it drags on the rest of the films riveting comedy antics"
    },
    {
      "rating": "6",
      "text": "Sandy B is back in the saddle as an all-powering comedienne alongside her Oscar-friendly intrepid astronaut in GRAVITY (2013, 9/10), in THE HEAT, she plays Ashburn, an F.B.I. agent, a divorced career woman and even more strait-laced than Grace Hart in MISS CONGENIALITY series, directed by Paul Feig who has brought us the sleeper-hit comedy BRIDESMAIDS (2011, 7/10), which has ricocheted the scene-stealer Melissa McCarthy onto a rarefied leading actress status in the primarily male-domineering comedy branch, who has successfully discharged a one-two punch in the domestic box-office last year with generous profits, this one and the critics-panned IDENTITY THIEF (2013).\r read rest of the review on my blog, google cinema omnivore"
    },
    {
      "rating": "6",
      "text": "Paul Feig's follow-up to Bridesmaids is certainly miles away. Much of The Heat rests upon it's too very funny and gifted actresses. There's a certain magic between Sandra and Melissa--it has us craving for more."
    },
    {
      "rating": "4",
      "text": "The Heat is boring with a drop of funny. But the worst is Melissa McCarthy being abusive, obnoxious, vile, over the top and begins to grow irritating every minute the movie goes by. By the end the entire movie is irritating."
    },
    {
      "rating": "8",
      "text": "\"The Heat\" is a formulaic movie. It’s about two female officers who don’t see eye to eye that have to overcome their differences in order to take down a drug lord. Along the way, they have some misadventures as they discover more about themselves as well as each other. However, the formulaic structure is not an issue as the movie really delivers on the laughs. This movie had me smiling, grinning, giggling, and laughing out loud from beginning to end. There are so many variations of humor from slapstick and situational to awkward and raunchy. The film isn’t short on heart either, but instead of being sappy and melodramatic, a lot of these moments are done brilliantly with some great humor.\r The film stars America’s sweetheart Sandra Bullock and comedic gold Melissa McCarthy. Bullock plays Ashburn, a awkward straight faced FBI agent, who puts her job above everything else. She isn’t really funny at first, but when she meets McCarthy’s character her social ineptitude really brings the laughs. McCarthy plays Mullins, a in your face, but passionate Boston officer. From the get go, she really brings the laughs and really sets the movie into motion. These two women have great chemistry together and play off each other very well. McCarthy’s loud character is a great juxtapose to Bullock’s more toned down and awkward character. They have a lot of fun on screen and they make us believe that they had some really great fun making the film as well.\r Overall “The Heat\" is an incredibly funny film and my personal favorite comedy of the year. The humor is so funny that you don’t  mind the formulaic structure of the plot. It’ll have you laughing from beginning to end. The chemistry between Bullock and McCarthy is just pure gold and they bring a lot of life and energy to the movie. Even though this movie focuses mainly on the laughs, it has heart and some really sweet moments between the two leads. I give this film a strong 4/5, a movie where the journey is more important and fun than the destination."
    },
    {
      "rating": "6",
      "text": "Comedy is a difficult thing to deliver, and for the most part The Heat is constantly enjoyable and quite funny. However, the story was not all that interesting."
    },
    {
      "rating": "6",
      "text": "Some fun funnies. Some editing problems. Some plot jumps. Very predictable. Good comedy if you have superhero origin story fatigue. This is the type of movie you can see being played on cable tv over and over later this year."
    }
  ]
}