{
  "id": 2810,
  "title": "The Willoughbys",
  "starring": [
    "Will Forte",
    "Maya Rudolph"
  ],
  "runtime": 92,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "When the four Willoughby children are abandoned by their selfish parents, they must learn how to adapt their Old-Fashioned values to the contemporary world in order to create something new: The Modern Family.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9WrMmjdZvpxLQh1tCQ9tOd1asOb.jpg",
  "categories": {
    "plot": 6.588235294117647,
    "acting": 7.75,
    "ending": 5.75,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 7.857142857142857,
    "funny": 5.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The titular family is headed by 2 parents who are so self-involved that they scorn and ignore their offspring. As a result, the kids devise a plot to get their freedom by sending their parents on a dangerous vacation. The result takes them on a series of zany adventures with their new nanny. What makes this film so entertaining is the sarcastically irreverent writing, zany animation and manic pace. Sometimes, this genre of dark children's comedy gets overshadowed by the nods to adult humor. While there's some of that here, it never gets in the way of the charmingly cynical fun for all ages and a refreshingly modern take on family."
    },
    {
      "rating": "7",
      "text": "It's pretty good. It's far from great, but it's a worth-watching animated movie."
    },
    {
      "rating": "6",
      "text": "Based on a Roald Dahl story in a parallel universe.The vast majority of the jokes fall entirely flat and I think an insanely fast-paced movie with an hour-and-half runtime should have been way more entertaining. The major issue I have with this, though, is that it keeps shifting from one interesting storyline to another, and trying to convince us every time it that this would be the basis of the plot, before almost abandoning them and settling on a rather far less interesting and original plotline to serve its message, which is very problematic.That said, I did enjoy this. It's so silly, for better or worse, and has a tinge of freshness, extremely eccentric and quirky characters (I think these parents are the creepiest I've seen in any movie) and breezy animation style similar to what Kris Pearn has done in Cloudy with a Chance of Meatballs 2. But, to be honest, the intrusive meta-narrator cat is the true highlight of the movie.(6/10)"
    },
    {
      "rating": "6",
      "text": "It looks like the animators and artists did a great job in making this movie look very visually appealing and different from many current mainstream animated films. So, if this movie did something right, it's the presentation and the animation.Other than that, this movie was pretty meh. The story had the potential to be great but it ended up being kinda fine, and sometimes it's just...Frustrating. The parents are literally the worst parents I've ever seen in a movie. They have absolutely no reedeming qualities and act as if they legit would kill their children. They do something in the movie that's so stupid and unrealistic that it's just baffling. I was constantly like \"Why would they do that? That didn't make any sense\". I guess it did a great job in wanting me to hate them but they are so ridiculously written that it gets annoying. The rest of the characters are okay. The twins had the potential to be a pair of Minions (annoying and obnoxious for the sake of cheap \"humor\") but they weren't annoying, thank God.If you don't overthink the story and the actions of the characters, then this movie is actually fine. It has some good comedy here and there. I loved the cat narrator, he has a lot of charisma, and while the ending was a bit predictable I was actually satisfied because I thought it was going to end in some other way (and if it did, I would've hated the movie). It's a decent way to kill an hour and a half. It's harmless family friendly entertaining."
    },
    {
      "rating": "8",
      "text": "Wow! Good movie for the family! Definitely a good Netflix original! Good for kids, and adults!"
    },
    {
      "rating": "10",
      "text": "Hands day great family film! It’s a sensitive but relatable topic for many children in the world today."
    },
    {
      "rating": "4",
      "text": "Has some creative visuals but I found it really hard to like this film. It's very stupid."
    },
    {
      "rating": "10",
      "text": "I loved this movie, it was so cute and had a beautiful message about family that your family is more than just who you are related it is who you choose as your family too. The animation was exceptional beautiful, I loved how they used computer animation but gave the characters textures that made them look like stop-motion animation. The writing was outstanding and beautiful. The voice-over performances were fantastic especially from Ricky Gervais, Will Forte, Alessia Cara, Seán Cullen, Maya Rudolph, and Terry Crews. The music was excellent, I loved the song I Choose it is such a beautiful song. This is my 3rd favorite animated movie of 2020, one of my favorite movies of 2020, one of my favorite animated movies of all time, and one of my favorite movies of all time, this was an A+ movie."
    },
    {
      "rating": "10",
      "text": "it’s a wonderful movie that teaches a lot about family and how NOT treat your childrens"
    },
    {
      "rating": "10",
      "text": "this film is so cutie! The story is magical and necessary, talks about not tradicional families and trauma, with music and love. The quality is insane, an perfect 4K with shining colors. Great Netflix’s production. Jane is the star of this film by the way."
    },
    {
      "rating": "10",
      "text": "beautiful visuals, good story and message about family. this movie is so cute, i had a lot of fun watching it"
    },
    {
      "rating": "10",
      "text": "A little bit dark but quirky and full of charm. Watching the Willoughby kids navigate their situation with fun and adventure was refreshing. Amazing visuals and beautiful reminders that we all get to choose the family that means something to us. A must watch for me."
    },
    {
      "rating": "0",
      "text": "What a dark and terrible movie that’s supposed to be meant for children. Not good."
    },
    {
      "rating": "3",
      "text": "I enjoy dark humor and I enjoy it in a children's movie. However it's execution here I found very cringey. The jokes didn't land for me.The animation is fantastic, that's a definite positive. It's unique, colorful and pleasant.There's a story about true family here, but it's delivered in cringey, unfunny packaging. My 6yo and 3yo watched this with me and laughed only a couple of times. They didn't even want to rewatch it and they want to rewatch EVERYTHING.Maybe this movie resonates with you, it just didn't for me. There are much better kid's film with dark humor in them that you could watch. At least it was on Netflix and I didn't pay movie theater prices to see it."
    },
    {
      "rating": "10",
      "text": "good!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Not gonna lie, I loved it! The parents are pretty dumb, but it's got a nice message in the end, I'd recommend it. Made in BC too ;-)"
    },
    {
      "rating": "7",
      "text": "No matter where we come from, we can always choose the people who do us good. The family is not the one that put us in the world, but it is the one that welcomes us and loves us. Even though they are not loved by their parents, the siblings are always together and overcome challenges that test their union. It reminded me of Lemony Snicket's A Series of Unfortunate Events. Good to pass the time."
    },
    {
      "rating": "9",
      "text": "A new breed in stop-motion and CGI is this adventure of two disgraceful, selfish, last descendants of an ancestry family, uncapable of look after their children, and the efforts of siblings for emancipate. A little dark for kids due the dark humor, and the difficulty of sympathizing with the characters, However, have certain charm."
    },
    {
      "rating": "5",
      "text": "This movie taught me the same thing that Tall Girl did and that is, if Netflix is hardcore pushing you to watch one of their movies, it's probably a good idea to ignore it. I hesitated on watching this movie and, ya know, some times you really should just go with your first instinct. Things started okay. We see a setup with the leader, Tim, explaining the Willoughby family lineage of prodigy's and how his parent's are trash and don't take care of him or his siblings. Ok good, that's all the setup we need. \"Bad parents, what do we do?\" Except, suddenly, there's this whole sub plot line with a random baby that gets abandoned on the Willoughbys' door step and the Willoughby children go out of their way to find it a home before going back to resume their own plot.The pacing in this movie is really weird. The movie spends an unusually long amount of time setting up the whole \"send parents away\" plot line and then just kind of juggles the plot in the air until the movie ends on a cliche and predictable note. The parents aren't good people but it's hard to pinpoint their reasons for hating children other than just being stuck up aristocrats. After all, there has to be some reason why they keep the children around as opposed to putting them up for adoption. At one point, the father tells the children not to come back until they get rid of the baby. Well, if he wanted them gone, wouldn't this be his chance to do so for good? Why does he allow them back?Again, we see the parents straight up abandon their children to go on vacation. And also they get a nanny, not because they want their children to be taken care of, but because they don't want their house to be ruined.None of the characters, aside from the children, are particularly likable largely because the movie never takes enough time to establish their character. The nanny is most certainly the most annoying and unlikeable character despite her role in the story. She just comes off as some dumb millennial who represents the \"new\" people of this generation (I don't particularly like the way she looks either (especially her tiny Squidward nose), but that's just me).The animation itself is good and fun to look at in a Walace and Grommit claymation sort of way. The actors all did a wonderful job, so no problem their.A lot of messages in this story are plain and simply not good. First, I'm sick of seeing the idea of tradition being painted as this thing that chains people down to the horrible fate that they've been given and is a thing that we should break and just end up not having any traditions because traditions are awful. This is a ridiculous and dangerous message being thrown around now days. Traditions are ideas that are rooted in the values and beliefs of a community. If you get rid of these ideas, then the community has no common ground and is more likely to be polarized. They are good commonalities to have, not rules to be broken.Another is the message that, if your parents are bad or you think they are bad or you don't like them, then it's totally okay to go find new parents as we see with the Willoughby children sending away their parents and going out to seek a new home. Sure, these children needed a change, but this movie is for families including children. Children are easily impressionable and may think that a simple punishment on them is comparable to the parents portrayed in this movie. The one really good message this movie does have is the importance for siblings to stick together. A far less cliche than families sticking together.Honestly, this movie is not great. It's visually appealing but is creatively and narratively lacking."
    },
    {
      "rating": "6",
      "text": "The Willoughbys es una película que propone conceptos bastante interesantes, pero que no sabe explotarlos. Para comenzar, el humor de la película es bastante excéntrico junto con los modelados de los personajes que a nivel artístico es innovador, aunque el escenario en si pinta ser muy simple. Los padres se podría decir que llegan a incomodar bastante mas que hacerte reír, y los chistes en si son genéricos, pero al menos la personalidad de los personajes esta muy bien definida y me gusta bastante. El problema que tengo con esta película es que no sabe si ser seria o cómica, ya que no sabe equilibrar la balanza bien, siendo que a veces abusa de un elemento o del otro, es decir, no te causa gracia porque después te ponen algo serio, pero no te lo podes tomar en serio porque después ponen otro momento \"gracioso\". Sumado a que la historia al final termina de manera muy genérica, a comparación del otro final que el narrador ofrecía que por cierto, siento que se podría haber explotado mas, ya que fue el personaje que mejor me cayo de la película. Este narrador (que por cierto es un gato), incluso llega a burlarse en varias ocasiones de las situaciones cliches que hay en las películas de animación, pero el problema es que esta película también los comete, por lo que es algo contraproducente. Y sin duda alguna me hubiera gustado que profundizaran mas en la historia de la familia Willoughby mas que en la nana y el heladero, ya que en ningún momento explican porque la familia se volvió así, y siento que a nivel narrativo hubiera sido mas interesante que el típico final de familia feliz, pudiendo haber desarrollado mas la relación de padres e hijos que tanto la película se esfuerza (pero no logra) desarrollar. Y por ultimo, hay un hueco argumental gravisimo en la película, y es que al final tanto la nana como el heladero adoptan a los Willoughbys.... Entonces, no podrían haberlo hecho desde un inicio en vez de hacer toda una escena de escapar del FBI y viajar a la montaña nevada en vano? Se nota que esta parte esta hecha de relleno.En fin, es una película que recomiendo ver, pero que tenia muchísimo mas potencial si hubiera explotado algunas partes y no cometido tantos errores narrativos con los personajes. Es que ese es el problema. La película tiene personajes muy buenos, pero la historia en si me termina debiendo bastante..."
    },
    {
      "rating": "5",
      "text": "O filme é super educativo e não apenas para crianças, para todos nós, não tenho do que reclamar, a direção de arte, a produção de áudio, ficou tudo perfeito!"
    },
    {
      "rating": "10",
      "text": "This movie is stunningly beautiful in every way. It offers something different and unique to the animation table in a way that wasn't shown before. Netflix has certainly done it again with outstanding, outlandish animation and visuals that craft a handmade feel that compliments the story. The meaning of family and bonds with people you are close to feels like a great message to be told through this way of visual style and animation. The characters, especially the main one, Tim have alot of emotional depth, and throughout the overwhelmingly short runtime they evolve as characters and learn from the conflicts of the story. This criminally underrated award-snubbed masterpiece deserves to be recognized by the public, more than the overly familiar, bland Over The Moon. Might I add, the Ricky Gervaiscat is freaking hysterical."
    },
    {
      "rating": "7",
      "text": "It's that kind of really weird animated movie with black comedy but very colorfully. I had liked to see this one nominated on the Academy Awards."
    }
  ]
}