{
  "id": 4339,
  "title": "The Best Exotic Marigold Hotel",
  "starring": [
    "Bill Nighy",
    "Maggie Smith"
  ],
  "runtime": 124,
  "genre": [
    "Drama",
    "Comedy"
  ],
  "description": "British retirees travel to India to take up residence in what they believe is a newly restored hotel. Less luxurious than its advertisements, the Marigold Hotel nevertheless slowly begins to charm in unexpected ways as the residents find new purpose in their old age.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gNWiOKTWDvPTpr7QfPWk18gLftz.jpg",
  "categories": {
    "plot": 7.181818181818182,
    "acting": 7.0,
    "ending": 6.6,
    "soundtrack": 5.0,
    "cinematography": 7.333333333333333,
    "familyFriendly": 6.0,
    "funny": 6.615384615384615,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "An absolutely delightful and pleasurable movie to watch. Let it make your day. Superlative cast of characters taking you to an exotic location. The cream of the British acting aristocracy. Music byThomas Newman directed by Madden. No computer effects, no botox. Just  a pleasure to watch and enjoy!The audience actually applauded for the joy they had been given,"
    },
    {
      "rating": "9",
      "text": "The Best Exotic Marigold Hotel, is an interesting movie, that have an interesting and great plot, the development is really fantastic, and the characters are incredible. This movie is really interesting."
    },
    {
      "rating": "8",
      "text": "Seven retirees travel to a lush resort in India, but discover a rather rundown result. Of course, the charms of the city work their magic and change their lives forever. The cast, including some of England's finest (Maggie Smith, Judi Dench, Billy Nighy and Tom Wilkinson), is uniformly winning and the stories are sweet, if not predictable. Younger viewers may not appreciate its mature values, but the target audience is sure to find it charming, amusing and ultimately uplifting."
    },
    {
      "rating": "5",
      "text": "Some good lines - all of which were in the trailer - and competent perfomances fom some of Britain's best actors can't make this any more than a tepid, but reasonably entertaining, time-killer. It could have been something much better."
    },
    {
      "rating": "10",
      "text": "This novelistic tour-de-force takes us to the Anglo-Indian genre of E.M. Foster's \"Passage to India,\" but in modern, post colonial dress. It is literate, funny, and a reminder of what great acting and warm humanity can mean in a film - as opposed to robots and aliens romping in 3-D."
    },
    {
      "rating": "3",
      "text": "This movie wouldn't be as frustrating if not for the colossal waste of talent. A gathering of some of the best actors in the English speaking world are hamstrung by a script chock full of Anglo-Indian stereotypes and cliches.  A disheartening missed opportunity."
    },
    {
      "rating": "9",
      "text": "Great cast playing off one another effortlessly and a nice story.  The audience applauded at the end, people genuinely happy that they had gone to see the movie on it's first day out."
    },
    {
      "rating": "10",
      "text": "Open your bag of popcorn, take a sip of your soda and get ready to spend enjoyable timesome of the cream of the crop British actors in â"
    },
    {
      "rating": "2",
      "text": "Too many characters that are boring, irritating and offer nothing significant to distinguish each other in this overlong bore of a film. It seemed like an artificial attempt at adding depth to an otherwise run of the mill story, that actually ended up having a million clichés."
    },
    {
      "rating": "9",
      "text": "The film's only flaw of predictability is heavily outweighed by the wondrous performances of the film's superb cast and beautiful setting. It's genuine, sweet, and even has a bit of humor!"
    },
    {
      "rating": "3",
      "text": "Manipulative British starrer which has an air about it of being an important film. The actors are not served well by a script that is cliched. Plot development is also illogical, for example Maggie Smith's grouchy and tiresome character becoming all accommodating at the end. Also, the son's arranged marriage is all of a sudden conveniently thrown out of the window without so much as a pout. As if! The Indian locations, however, are gorgeous."
    },
    {
      "rating": "8",
      "text": "It's a feel-good movie that works.  Carpe-diem city.  It encourages you to make more of your life and to live more grandly.  The cast is superb.  I especially enjoy the storyline surrounding the Indian family which owns the hotel.  But Maggie Smith, Dame Judy, and Bill Nighy, and Tom Wilkinson are truly outstanding. Wilkinson's journey to find his lost love was a surprising but great addition to the story."
    },
    {
      "rating": "10",
      "text": "â"
    },
    {
      "rating": "7",
      "text": "This is a coming of age movie for old people. Our geriatric crowd loved it, and for once the Brits avoided the sap, mostly. The locale alone makes it worthwhile, although somewhat cleansed of it's abject poverty India shines through as a colorful, noisy, energetic place for old tattered folk to find some renewal. Dench is great, and all the great actors in the cast are unsurprising, hewing to a script without too much risk that tries to mix in pathos with the humor. Now if only the Brits would make a great movie that did not fit into Masterpiece Theater!"
    },
    {
      "rating": "8",
      "text": "Beautifully shot showcasing all the vibrancy of life in an Indian city; I was impressed with the look of the film. All the performances were excellent, with Judi Dench and Tom Wilkinson standing out; I thought Dev Patel was a tad underused though. I liked the fact that the writers didn"
    },
    {
      "rating": "8",
      "text": "The film tells the story of a group of British retirees who are finding it hard to make ends meet in England and decide that they can do better in India. The get the brochure from the aforenamed hotel in Jaipur, which advertises that it is \"for elderly and beautiful people.\" When the guests arrive, they discover that they are the hotel's first guests and they go through all the hassles of dealing with any new business. Their story is a bit of a \"fish out of water\" story as they adjust to their environment, but it also depicts the character growth of not only the Brits but also of the hotel owner/manager and his family and friends. It finds both characteristics to celebrate and characteristics to make fun of in both cultures. And it has the requisite happy ending for most members of both groups, because \"everything will come out all right in the end. If it is not all right, then this must not be the end.\""
    },
    {
      "rating": "8",
      "text": "Parts of the story you've seen many times before and are predictable (the romance between the hotel's owner and his girlfriend comes to mind) but most of the movie is fresh and eminently watchable.  The acting is superb across the board as you would expect with a cast of this magnitude.  The storyline of Tom Wilkinson's character is especially moving.  The exotic location of India and it's wonderful people make you want to visit the country.  Overall a nice movie-going experience."
    },
    {
      "rating": "6",
      "text": "A very charming movie that manages to feel very human. A fantastic cast helps bring the movie up. It basically brings several characters together, each with their own story that we get to see come to a close. It manages to bring some touching moments together but in the end I couldn't help but feel some of what this movie has to offer was wasted on me because I was too young to understand it. Still I do admire this movie. Some of the plot lines end in a predictable manner but still managed to keep me watching. I can't really say a bad thing about this movie, it may be aimed at an older audience but the movie is still charming."
    },
    {
      "rating": "9",
      "text": "This movie is like a really well made martini - certainly predictable - but thoroughly enjoyable.  Delightful ensemble of seasoned professional actors who could make reading an Ikea assembly manual compelling, beautiful location for filming (only wish we saw more of it,) a nice dash of socially progressive. Uplifting and warm, it will inspire a variety of post-movie conversations about foreign retirement options for anyone over 40."
    },
    {
      "rating": "10",
      "text": "I Have a decent tolerance for sweetness in a story, so I didn't squirm when it became obvious where this was headed, and you would have to be foolish to expect otherwise from such British standards. Aside from that, this was a joy to watch. Almost every shot was planned in a way that delivered extra beauty or emotional punch. There was no sense that India was used only for background, the location was in every shot with gorgeous light, grunge and authenticity. And I am glad to be alive in a time where such elderly talent can employed as the focus of the story rather than a comic or tragic sidetrip. Revelatory, really. Humorous, touching, and intimate. My only gripe is that there were too many storylines, and I could've easily done without the romance by the younger Indian couple (the fact that their dialog was delivered in English didn't help). But to carp about this misses the point, that this was made in an EPIC manner.... the art direction and photography were STUNNING and there is plenty to enjoy in the story and quality acting. Like many movies, I only think it would've been stronger if it was 15 minutes shorter."
    },
    {
      "rating": "5",
      "text": "Somewhat entertaining but really for a particular crowd that isn't expecting much in the way of plot or action."
    },
    {
      "rating": "6",
      "text": "The film works very well overall.  It's greatest strength is, of course, the amazing cast.  The standouts are Maggie Smith as a hilariously racist old woman stuck in a country full of \"others,\" Judi Dench as a still grieving widow looking for change, Bill Nighy as an unhappily married man, and Tom Wilkinson who's spent his whole life thinking of the man he once loved, who he left behind in India.  These four are just wonderful to watch and they provide a lot of good humor.  But then their is Dev Patel, who is less spectacular.  The story follows these elderly people in India, and then randomly brings in Patel's character as another side plot, even though it breaks from the continuity of these elderly people looking for meaning in their life now that they are old and retired.  I also found issue with the fact that the characters often spoke of the color and beauty of India, yet they didn't show much of it, other than many crowded streets.  Lastly, the end of the movie was a mad dash to try and resolve all of the loose ends in under 15 minutes and it ended up failing.  Even with these problems, the cast alone is more than capable of carrying this movie smoothly from beginning to end."
    },
    {
      "rating": "6",
      "text": "Oscar-nominated director John Madden"
    },
    {
      "rating": "9",
      "text": "Wonderful how they communicate what happens in India when westerns first land there, I've never seen a movie put it so well like this one. The images, the reactions, the needed adaptations - and the spirit of each one when facing it. I liked very much the insights that go inside the seven main characters and their relationships with themselves, with aging and with what's suddenly highlighted but the colors of India. Great movie."
    },
    {
      "rating": "8",
      "text": "Had no expectations and left very pleasantly surprised. Nothing exceptional, nothing overly dramatic, yet wonderful, emotional and interesting story that should not be missed."
    },
    {
      "rating": "7",
      "text": "It's reminiscent of other Indian extravaganzas--but somehow it shines through with its charming and memorable ensemble. The Best Exotic Marigold Hotel goes deep and hits hard."
    },
    {
      "rating": "6",
      "text": "The movie throws together some great actors in a tired script, but it still is a well made engaging movie. It is funny and pleasurable and the location is really an extra delight."
    },
    {
      "rating": "5",
      "text": "The actors and actresses in this movie did a splendid job. Their characters were mostly likable and believable. The story fell flat though, and the unneeded intrusion of controversial topics wasn't needed. It seemed like an artificial attempt at adding depth to an otherwise run of the mill story.\r Don't get me wrong. I enjoyed the movie, but it left me with yet another reassurance that Hollywood is out of touch with the values of the majority of Americans. What's worse is that many of the more risque or controversial topics seemed tossed in solely to convince us this was indeed a \"deep drama.\" However, at further inspection you can see this movie is about a few elderly people who are delusional to think that living out sexual fantasies will make them feel young and worthwhile. You'd think after living an entire life they'd have realized there is more to life than that.\r Enjoyable movie, but not one I'd see again or even recommend. Go see something else. Save yourself some money."
    },
    {
      "rating": "6",
      "text": "A pleasant if conventional crowd-pleaser that makes great use of its seven experienced lead actors, 'The Best Exotic Marigold Hotel' is an enjoyable moviegoing treat with heartwarming performances and some great imagery of India to please our eyes. At times, the film suffers from extreme pacing problems and overall predictability (you won't find any surprises as far as plot is concerned). Along with being a bit too melodramatic, the characters' problems feel somewhat slight and the general tone of the movie is one of low stakes and leisure fun. All that being said, the performance aspect is grade-A and every actor receives a fitting vignette worthy of their talents. Tom Wilkinson's character, an aged gay man returning to India to find his long lost love, has the best side story by far and there is an air of seriousness and dramatic pull in the scenes depicting his search that is sorely lacking throughout the rest of the film. It's great to watch all of these inspired performances birthed from less-than-inspired characters (Judi Dench playing against type as a vulnerable widow and Maggie Smith as a hardened wheelchair-bound racist are some other highlighted spots), but sometimes we could use a little more heft to the story. Still, this is a very warm movie in general and is so far one of my favorites from 2012."
    },
    {
      "rating": "7",
      "text": "The Best Exotic Marigold Hotel is not exactly an artistic achievement, so it is tough to assess it as a piece of art. Instead, it is classic feel good cinema that is easy to digest and settles easily in the stomach, rather than making a big fuss about the whole thing. Unlike the Indian food on display in the film, this is not a film that will cause diarrhea, except for those who may struggle to digest sweets. A funny and deeply endearing flick about a bunch of British people coming to teach Indians how to live life the British way, The Best Exotic Marigold Hotel may be a bit too much for some, but is largely pleasant cinema. It is funny with a great cast that hardly ever puts a foot wrong acting-wise. Though a bit quaint, the film's endearing charm is really hard to overcome.The film, to some, could be described as racist. Yet, it often feels like a film that is conflicted in this arena. On one hand, you have Evelyn (Judi Dench) teach professional call center workers how to talk on the phone to British people, as if they have no idea. Evelyn has no experience calling, yet talks down to them as an authority. Sonny (Dev Patel) is a charming kid who is just a scattered foreigner who has no idea what to do with running a hotel because he is a dumb foreigner (right?). Toss in repeated jokes about how bad India smells (it probably does for those who are new though, not being racist, but Indian food is a rather strong smelling food so until you adjust to being in areas where the food may be, it definitely will hit your nose hard) and jokes about Indian marriage customs and it is not hard to see why some would take offense. It is rather low-brow with this humor and these depictions, even if Muriel (Maggie Smith) oddly changes all of this for the better to a degree. Initially quite racist with broad and sweeping stereotyping attacks against Indians, Muriel grows over the course of the film to respect Indians and other races for how they help her in spite of her rude behavior. Even then, she winds up being a white savior for poor Sonny and his crappy hotel. Thus, I would have to lean towards this one being quite a bit offensive and racist, even if it does not actively intend to be this way.Fortunately, it is incredibly funny. Bill Nighy, Judi Dench, Maggie Smith, and Dev Patel, are all an absolute pleasure to watch. Nighy, obviously, steals the show as he always does, though Patel's frantic and nervous turn gives him a run for his money. As an entire cast, this charming collection of British screen actors and the one Indian actor that Hollywood will allow (quotas and all) really make this film zip by with light enjoyment. The smart comedic script plays perfectly into the wheelhouse of its actors, allowing them to all deliver their lines with zip and comedic timing to make the lines really pop. The film may be a bit too quaint and giddy in depicting old age, but it is hard to deny that the film is funny. The comedy does not always work, but it is a film that can keep you laughing throughout and that is rather hard to come by nowadays.Set in gorgeously designed locales, one of the major appeals of The Best Exotic Marigold Hotel is certainly its visuals. Throughout much of the film, the film is shot rather plainly, hardly ever capturing the eye. However, whenever director John Madden's camera slips out of his firm grip and captures some terrain or India at sunset by the water, it is hard not be gripped by the beauty. While the film does not really explore the terrain too much, the pieces of the set it showcases - especially the hotel - are very nicely designed and fun places to explore. Toss in some nice depictions of the hustle and bustle of India, as well as the natural beauty of the country, and you have a film that is rather pleasant to look at, even if it is rather unadventurously shot.Funny, engaging, and largely quite pleasant, The Best Exotic Marigold Hotel is simply easy breezy entertainment. It is easy to find fault in its picture perfect facade, but why nitpick a film that I found so pleasant and fun to watch? Honestly, however, watching Bill Nighy do anything in a film is going to garner at least a lukewarm positive response from me and this film is hardly an exception to that rule. Though not the most artistic film ever made, The Best Exotic Marigold Hotel is the type of cheesy and idealistic Hollywood film that just feels good to watch. It is like the ratty pair of sweatpants your mom begs you not to wear in public, but I want to wear them BECAUSE THEY ARE COMFORTABLE DAMMIT."
    },
    {
      "rating": "9",
      "text": "After seeing this film advertised on TV I decided to see what the fuss was about. I began watching it although I thought there was a slow start to it I found it enjoyable to watch. However, around 65minutes into the film I had to turn the film off due to distractions (visitors) I then left it for a few days before finishing watching it. I wouldn't usually go back to a film after only half watching it but there was something different about this film that made me want to see how it finished. The film gave a insight into each characters life at the beginning  which made you feel closer to the characters throughout. As I am British I found it great how I could recognise the actors/actresses. I believe  Judi Dench really made this film what it is, great acting and she really shows good emotion in her speaking. Overall Wonderful film and certainly a must see film."
    },
    {
      "rating": "5",
      "text": "The high quality actors present here were deserving of a better script.  A wonderful story, vibrant direction, and great cast were all let down by a below sub-par script."
    },
    {
      "rating": "7",
      "text": "From the point of view of an Indian, Dev Patel's character - and indeed the roles played by all of the Indians - is poorly conceived and entirely unbelievable. From the point of view of a movie buff, one witnesses subtle and stunning performances delivered by its lead actors (and thankfully, Dev Patel is not one of them) despite an oversimplified plot line."
    },
    {
      "rating": "10",
      "text": "One is never too old to take a risk and experience something new. This movie is a real life story of people who dare to confront their destinies and tell it's not over. It is a story that changes lives and fulfills dreams. But more than just a lesson, it is life itself with all the good and bad things."
    },
    {
      "rating": "8",
      "text": "I was surprised by this movie. I didn`t expect to like it at all, but it was a good story. I found something peaceful about this movie even though the location is terrible in reality."
    },
    {
      "rating": "8",
      "text": "Delightful in every respect, \"The Best Exotic Marigold Hotel\" is a brilliantly acted \"going-of-age\" tale that manages to pull off what a lot of its ensemble-movie predecessors have failed to do; it seamlessly places emphasis on and individualizes every character in its stellar roster."
    },
    {
      "rating": "10",
      "text": "This is a sweet, poignant, warmly funny, character driven movie that I can recommend highly since it is not a quick action, car chase, explosive, fight filled, special effects film. You have to devote some easy time to become familiar with these older people and yes, older people have problems of their own that are just as worthy and significant  to them as ours are to us. When all too often movies are made to to provide some type of satisfaction quickly before we become bored, this film moves along slowly drawing you in to caring about these people. It takes more devoting of time by the viewer than the normal action movie but it's worth it. I wish they made more movies like this."
    },
    {
      "rating": "6",
      "text": "I wouldn't say that The Best Exotic Marigold Hotel is a masterpiece but I surely can give it credit for its sweetness, tardiness and raunchiness. Gay relations and petty lovers in this veteran drama are mixed like a rancid salad but when the climax unfolds all the characters have a meaning of life. India's beautiful scenery is really good mixed but watching the climax makes you cry over its undeniably long runtime."
    },
    {
      "rating": "10",
      "text": "With the most talented cast ever and the most warmest stories ever, this is one of the best touching movies that I´ve ever seen. This is a most see movie"
    },
    {
      "rating": "9",
      "text": "A one-way ticket to a wonder land full of color, smiles and scents, supported by a strong cast and witt british humor. All about elder floks who looks for a final place to retirment and pardon. More than other fell-good- movie, that will grab you a smile."
    },
    {
      "rating": "0",
      "text": "Sous couvert d'un humour très britannique (qui n'est pas ma tasse de thé), ce film interminable a le toupet de nous faire chier pendant deux heures avec ces pauvres vieux et leurs retraites délocalisées en low cost dans un pays sous-développé (oh pardon, je voulais dire \"pays émergent\" !). Choc des cultures et caricature ridicule de celles-ci, personnages grotesques, un peu de violon ici et là pour faire bonne mesure... peu importe, on a déjà décroché depuis longtemps et le troisième âge a zappé direct."
    },
    {
      "rating": "5",
      "text": "A feel-good movie with a cross-cultural theme, formulaic storytelling, uninteresting storylines and a top-notch cast who made the most of their otherwise stereotypical characters. The predictable resolution of the conflicts of the plotlines is really what brings this down. As if the clichés and melodrama that pervade the entire film weren't enough! This definitely failed to bring anything fresh beyond its title, but it sure has its moments nonetheless. (5.5/10)"
    }
  ],
  "recommendations": [
    "the_second_best_exotic_marigold_hotel",
    "20th_century_women",
    "paddington_2",
    "eddie_the_eagle",
    "belfast",
    "the_intern",
    "hell_or_high_water",
    "moonrise_kingdom",
    "scent_of_a_woman",
    "news_of_the_world",
    "the_big_sick",
    "the_help",
    "the_florida_project",
    "the_upside",
    "chef",
    "lady_bird",
    "thoroughbreds",
    "the_edge_of_seventeen",
    "captain_fantastic",
    "hugo",
    "the_secret_life_of_walter_mitty",
    "legends_of_the_fall",
    "me_before_you",
    "joy",
    "the_terminal"
  ]
}