{"id": 2773, "title": "The Upside", "starring": ["Kevin Hart", "Bryan Cranston"], "runtime": 126, "genre": ["Comedy", "Drama"], "description": "Phillip is a wealthy quadriplegic who needs a caretaker to help him with his day-to-day routine in his New York penthouse. He decides to hire Dell, a struggling parolee who's trying to reconnect with his ex and his young son. Despite coming from two different worlds, an unlikely friendship starts to blossom.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/hPZ2caow1PCND6qnerfgn6RTXdm.jpg", "categories": {"plot": 7.086956521739131, "acting": 7.35, "ending": 6.4, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.36, "action": 5.0}, "reviews": [{"rating": "5", "text": "Cranston and Hart are great together, in fact put them together in a buddy cop movie or something, but everything else here feels drawn-out and cliché."}, {"rating": "8", "text": "This movie is very good. I came out of the theater happy. The movie is a feel-good, uplifting film that really leaves a mark on you emotionally. Despite some minor subplot problems. Kevin Hart and Bryan Cranston deliver a wonderful performance with amazing on screen chemistry. Would definitely recommend!"}, {"rating": "8", "text": "I'd have given it a 7 if it was fictional, but since it's a true story I felt I had to give credit for a story well told and decently acted.  I agree that Cranston and Hart are really pretty good together."}, {"rating": "0", "text": "One of the worst films I have ever seen.  Kevin Hart is a terrible actor.   Just awful."}, {"rating": "10", "text": "An amazing film that can be classified under any category. Great acting, Great plot couldn't ask for more"}, {"rating": "7", "text": "This is an enjoyable and entertaining movie.  It is not “The Intouchables” by any stretch!  But, it is done well, and Bryan Cranston and Kevin Hart have a sweet chemistry that I enjoyed.  If you have never seen the French made original, which starred Omar Sy in Hart’s role, it is worth trying to find a way to watch it.  I did appreciate this version, and I think for anyone who has never seen the original, it will be very entertaining."}, {"rating": "10", "text": "Pasé un buen momento viendo esta película, es entretenida, gentil e incluso emocionante, la dupla protagonista es encantadora, se nota que hay verdadera química."}, {"rating": "5", "text": "Despite Kevin Hart being the poster boy for the need for botox (he always looks perplexed), the onscreen chemistry worked.  Major flaws with plot, eg. catheter without sterility, coffee burns while not felt, still require medical attention.  No awards for this one I'm afraid.  Still offers enough for you to root for the main characters, flaws and all."}, {"rating": "9", "text": "A great film based on a true story and Kevin Hart just makes things so much better! My only criticism here is that I only wish this was maybe a Rated-R film only because of some of the content from the actual jokes themselves. But that's just me being overly nitpicky. I highly advise you to see this flick when you can!"}, {"rating": "8", "text": "This remake of a popular French import (The Intouchables) stars Ryan Cranston as a paralyzed billionaire, who hires a round-around-the-edges ex-con as his caretaker (played by Kevin Hart). The seemingly incompatible combo turns out to be perfect partnership of support, humor and friendship. Fortunately, director Neil Burger has managed to rein in Hart's typical manic frenzy, while still taking full advantage of his comic skills. Every actor is engaging (including a delightful Nicole Kidman) and the film sparkles with a lively attitude and plenty of laughs (although some might fault the easy conflicts and resolutions). Expect to be charmed, touched and entertained. A bonus: this film features Aretha Franklin's songs and is dedicated to her."}, {"rating": "6", "text": "The Upside is not complex in any regard of its narrative. There are few, if any plot twists or subversions in the movie. It is straightforward and does not diverge from what it is. What carries the film is the chemistry between the two main characters played by Hart and Cranston. Their interactions with each other, and how they play off each other is the driving force of the enjoyment of this film. While the jokes can be juvenile at times, it is a fairly enjoyable watch."}, {"rating": "8", "text": "As another reviewer said this is movie made me feel good which is to say it entertains and moves. Never boring. Funny. Sad. Which is really what I want in a movie these days. Enough explosions."}, {"rating": "2", "text": "The big issue with Hollywood over the last 15 years, is no one can come up with an new ideas.  Instead, they take ideas that have already be made and crafted into very good films and produce a re-make which ends up being pile of festering garbage.  The original was titled \"The Intouchables\" which was a funny and very well made french film.  Even with having to read sub-titles, I gave that film a 9/10.  Great acting, perfectly timed comedy and real emotion.  This film is absolute garbage.  Kevin hart is not believable in his role, nor is he even a tiny bit funny.  Go watch the original, it is close to being a masterpiece of story telling.  The French have been making films forever and they now how to execute an idea to perfection.  america, truly has no idea have to craft good films these days."}, {"rating": "5", "text": "This American remake of 'The Intouchables' simply doesn't have the heart of the original."}, {"rating": "9", "text": "I just watched this movie and absolutely loved it. Parts were funny, parts were poignant, parts were inspiring: it left me a happier person for having seen it. Perhaps my \"white privilege\" or whatever other imaginary maladies Leftists ascribe to normal people prevented me from noticing how \"preachy, manipulative, and frustratingly cliched\" it was. The critics seems to have the long knives out for any movie--even a movie based on real occurrences--that suggests that people can overcome racial, cultural, and socioeconomic differences and come to care for each other. When I contemplate the many horrendous movies the critics thought were pinnacles of the film making art, I realize they are incapable of venturing intellectually beyond their insular little politically correct worlds and that their opinions are vacuous. When there is a significant disparity between the critics and the audience, the critics might benefit from a bit of reflection."}, {"rating": "4", "text": "A remake that tries too hard and fails anyway.Honestly, there was no need to do this but they did it and yet that's the least of its problems.If you already saw Intouchables, you have nothing to do here."}, {"rating": "5", "text": "The Upside is a fine film to watch on a lazy afternoon when it comes on FX or something. You can half pay attention to it as you mess around on your phone or computer. As a theatrical release, though, it's bland. There are a few laughs to be had and there are a few emotional moments, but the majority of the film is the definition of average."}, {"rating": "9", "text": "I felt amazing.Personally, I felt this film was amazing. As usual, Cranston delivers an outstanding performance but that wasn't surprising. Kevin Hart was also great in it ; proved he is really a talented actor. Lots of great chemistry between the 2 actors. Thoroughly entertaining and enjoyable. And, the more I think of it, this is a film that has many life lessons that we can all think about and take in as a society. Those include the idea of 2nd chances and refraining from automatically judging a book by its cover. And, the boldest message in the film is that people should be more accepting and try not to look at everyones flaws, more importantly, to not let others opinions or thoughts get you down and to live your life regardless of what others think of you as a person. With lots of negativity and discrimination in the world, whether it be between different races, religions, etc, we as a society must learn to look past these differences and be more accepting. The film presents this in a very positive way and makes you feel genuinely good at the end. It is also a funny film with lots of good jokes and smart comedy as well. The film definitely made me think of how I could relate to it and could not agree more with the lessons in it. I would give this film 9 stars if I could as it is rare that the entertainment world produces anything so meaningful and significant.."}, {"rating": "9", "text": "I felt amazing.Personally, I felt this film was amazing. As usual, Cranston delivers an outstanding performance but that wasn't surprising. Kevin Hart was also great in it ; proved he is really a talented actor. Lots of great chemistry between the 2 actors. Thoroughly entertaining and enjoyable. And, the more I think of it, this is a film that has many life lessons that we can all think about and take in as a society. Those include the idea of 2nd chances and refraining from automatically judging a book by its cover. And, the boldest message in the film is that people should be more accepting and try not to look at everyones flaws, more importantly, to not let others opinions or thoughts get you down and to live your life regardless of what others think of you as a person. With lots of negativity and discrimination in the world, whether it be between different races, religions, etc, we as a society must learn to look past these differences and be more accepting. The film presents this in a very positive way and makes you feel genuinely good at the end. It is also a funny film with lots of good jokes and smart comedy as well. The film definitely made me think of how I could relate to it and could not agree more with the lessons in it. I would give this film 9 stars if I could as it is rare that the entertainment world produces anything so meaningful and significant."}, {"rating": "8", "text": "This movie is better than you would expect. Another prime example of critics missing the mark. Hart and Cranston are a great combo together"}, {"rating": "10", "text": "Sooooooooooooooooooo gooooooooooooooooooooooooooooooood!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "If you liked blind side with Sandra Bullock, then you should love this movie as much as I did. I find so many similarities between the two; the characters, the acting, the writing and the directing in both movies is pure genius as far as I am concerned. Kevin Hart shows he is much more than just an actor specializing in comedy roles. IMHO this is one of the best movies I have seen in a long time."}, {"rating": "4", "text": "Don’t waste your time - watch the original French version. Read some subtitles if like me you don’t speak French."}, {"rating": "8", "text": "A good movie. I enjoy the concept of someone learning how to do something as they go in film, and this movie builds on the idea. Also, the plot elements are relatable and heartfelt. It's a good movie."}, {"rating": "4", "text": "If you past some minor differences between this version of the story and the original one you should find, in essence, the same story. About the characterization I prefer in this case the french version, they put more emotions in it. Bryan Cranston was, in some parts, a little lazy in his characterization. Kevin Heart on the other hand was very lazy."}, {"rating": "8", "text": "Kevin Hart take on a dramatic role? He knocks it out of the park. With that being said, how was the movie? I can say this is a movie that everyone should see if they are having hard times in life or some medical problems. It truly makes you see that no matter what problems you have, anything is possible to make it better. We first see Dell (Kevin Hart) driving a sports car down the nighttime streets with Phillip (Bryan Cranston), sporting a ginger beard, looking saddened. This leads to cop cars chasing down their speeding vehicle and Dell making an excuse that he is taking Phillip to the hospital just so he can get out of being arrested. After these moments, the movie jumps back six months earlier. The events leading us to their meeting take some time to get going. Moments of the first 35 to 40 minutes did move slow at times. The buildup takes us through Dell's background and his criminal background and difficulty with his parole officer while we don't get much of Phillip's backstory until Dell starts working for him. Odd choice to make us wait this long to learn about the other main character but this does not hurt the film, I just thought it was a interesting choice to put all the focus on Dell for the first 25 minutes without any screen time from Cranston. Once Dell begins working for Phillip, things really get going. We are treated to lots of good funny and warm moments between them which Hart of course plays well but what is nice is, this isn't his typical comedy shtick. Something about his humor hear feels different and it's quite nice. It allows the audience to see that Kevin Hart can truly act and pull of drama and not just comedy. His chemistry with Cranston is what carries this movie and the banter and play off one another works. How their work friendship evolves throughout the movie is heartwarming. Bryan Cranston plays this role so well and he made it so believable. I truly felt for his character and was able to really feel what he is going through physically and emotionally. I truly disliked Nicole Kidman's character in the beginning but the way they transform her cold soul to a caring and loving business partner of Phillip's, is quite sweet. She truly cares about Phillip and it begins to show near the final act of the film. If there is one thing that I think should have changed is was to see more of her emotion with Cranston earlier in the film. By the time the end of this film comes, I truly had my heart in it and just wanted to be able to be a help to Phillip like Dell was. Their friendship is something truly special because when it comes down to it, they both needed each other to move forward in their lives and what they do for one another is really special. What ends the film is what makes this film work as a whole. The performances and chemistry from Hart and Cranston and telling a sad but inspirational story that connects you with things in your life and how no matter what, you can always make things better. This is why I enjoyed it. It made me laugh and filled my heart with warmth and care .Rating: B+"}, {"rating": "6", "text": "A ok movie. Again like everyone says their chemistry is great but it's too cliche."}, {"rating": "5", "text": "This movie is average at best. That being said, I enjoyed it a lot more than I thought I would. The Upside is an inspiring tale that suffers from melodrama and a slow script. The cast is passable and Kevin Hart does a decent job stepping into a more serious role. Overall, the movie is far from great and not rewatchable but if you're bored on a Sunday afternoon and desperate for something to watch, The Upside is satisfying and enjoyable enough."}, {"rating": "6", "text": "(Mauro Lanari)Fourth remake of \"The Intouchables\", the 2011 French buddy movie, it's like Puccini's \"Nessun dorma\" performed by Aretha Franklin at the 1998 Grammys, an evergreen almost impossible to ruin. Its consolatory function is equally hated by critics and appreciated by the public. The director Burger is a dignified craftsman, and it's a good sign that the Millennials' supermanhood shows cracks."}, {"rating": "8", "text": "This is a remake of the French film 'Intouchables' by Eric Toledano. I've seen that film and so I was suspicious that this film would be a disappointment, as I really enjoyed the original film a lot, giving it a 5 star rating. However, I needn't worry about being disappointed because I found this surprisingly amusing. Its true that the subject material is a little taboo - namely the main character, Philip, being cared for being a quadriplegic and his new assitant (Dell) being quite a sharp witted person, a bit of a social outsider from the working classes who, lets say, isn't afraid to tell things as they are. As in the original film, its got quite amusing moments and I didn't feel too guilty laughing at them, as (much like in the original film) its clear that the assistant is quite friendly with him and that its a genuine friendship, not faked/forced.I thought that both Kevin Hart and Bryan Cranston come across well on screen as the main characters seem pretty witty and self aware - actually Cranstons character, Philip, probably seems more self aware than Dell, which may seem a bit of a surprise to some. One example of an amusing piece of dialogue is as follows:- (following Dell being irritated Philip wouldn't do something) 'you shook my hand!' (i.e. to agree to it) 'hah - I'd like to see that stand up in court!'. It does seem a bit uncomfortable given Philips disability but its honestly an enjoyable film - I liked that we (as the viewer) can visibly see the two main characters seemingly genuinely laugh at each other at different times, while at other times Philip opens up about his past and Dell is shown to be quite moved by what he learns. I also enjoyed seeing Nicole Kidman playing the rather strict and no-nonsense, looking-down-her-nose-at-Dell, member of Philip's staff, a lady called Yvonne Pendleton, who is clearly (certainly aspiring to be) upper class. I suppose this film, like the original, is thought provoking in terms of social class, assumptions of who can help those better off, of who will naturally get along with who and so on, with Dell coming from the Projects in NYC and Philip being a fan of classical music etc.I recognised a number of scenes in the film from the original film - I reckon they've kept certainly most of the main script of the original film in this one, only with (obviously) different settings and US slang etc. present instead of French, of course.It seemed quite genuine and I had assumed this may not be the case, so I was greatly surprised and pleased by this. I would still recommend the original film but this one is a solid 4 star film regardless. It may not be to everyones taste but its still a good film and if it interests you then I'd say its worth a watch."}, {"rating": "6", "text": "The Upside is a delight that draws its energy from the charisma of its lead actors, their inexhaustible chemistry, and the objective lens that dramatizes and finds humor in the everyday experiences of people with disabilities without being maudlin or clinical–which is sort of Phil’s point when he picks Dell to be his attendant in the first place. If you can get past the fact that this movie tells the story of an incredibly thin slice of the disability community, you’ll love this fun, brisk romp.This film has been a long time coming for us. We first started seeing the trailers in December and Wife seemed approving. The script deftly heads off the most salient criticisms of privilege with a few exchanges between Phil and Dell–the resolution to the stolen book and the recurring “strike” system shows off Phil’s unexpected forgiveness and open mind and deepens the mystery of why Phil chose Dell in the first place.The love triangle side plot gives Phil a chance to examine different facets of romance from the perspective of a guilty widow, an unobservant friend (Yvonne), and a smitten but anxious admirer (Lily). One of the film’s strengths is its interest in the sexuality of people with disabilities (see also, Don’t Worry, He Won’t Get Far and The Shape of Water).By digging deeper into a place often buried, The Upside finds a trove of humor and insight into the emotional life of Phil. Phil resists some of the nastier tropes of people who acquire their physical disabilities late in life, like suicidal tendencies or excessive self pity (see most recently Me Before You and check out Erin Clark’s funny, insightful critique from refinery29). He’s wracked with guilt because of his recklessness, but much of the film is about his interest in art, music, women, and hotdogs (the hotdog scene is maybe one of my favorite in the whole film). The Upside to me shows that movies can feature people with disabilities as protagonists without having to be about having a disability.The Upside‘s observations about the humor of everyday life as someone who needs an attendant show that new perspectives in storytelling open doors to humor and drama that has been mostly passed over previously."}, {"rating": "7", "text": "I saw the movie a few days ago and it was fantastic, Loved it, almost made me cry. The great cast and especially the chemistry between Brian Cranston and Kevin Hart was outstanding."}, {"rating": "8", "text": "With great performances from Kevin Hart, Bryan Cranston, Nicole Kidman, and Golshifteh Farahani, The Upside told a feel-good story that I enjoyed from start to finish."}], "recommendations": ["greenberg", "eddie_the_eagle", "the_king_of_staten_island", "the_blind_side", "the_intern", "the_fault_in_our_stars", "the_social_network", "me_before_you", "paddington_2", "revolutionary_road", "3_idiots", "the_disaster_artist", "inherent_vice", "eternal_sunshine_of_the_spotless_mind", "me_and_earl_and_the_dying_girl", "the_secret_life_of_walter_mitty", "her", "hustlers", "palm_springs", "manchester_by_the_sea", "the_gambler", "hereafter", "instant_family", "good_will_hunting", "the_devil_all_the_time"]}