{"id": 359, "title": "The Last Duel", "starring": ["Jodie Comer", "Matt Damon"], "runtime": 153, "genre": ["Action", "Drama", "History"], "description": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg", "categories": {"plot": 7.254901960784314, "acting": 7.0, "ending": 7.230769230769231, "soundtrack": 9.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 6.75, "action": 7.619047619047619}, "reviews": [{"rating": "4", "text": "Started out strong and seemingly right up my alley, period piece with top shelf actors, made by one of my favorite directors, but turned into a slog.  The first POV act was interesting, the latter two were just simply rehash, and I lost interest."}, {"rating": "9", "text": "Great film. It’s not perfect, but it’s consistently engaging once you get immersed in what’s going on(which takes a little bit). Fantastic performances from the entire cast, with Jodie Comer being the standout. I think they did a really good job with the story, and overall it made me feel better about living in the current times that we do now. I say that because this film shows you exactly how brutal things were for women during that period(not just the 1300s, but all the way up to less than a century ago). The film is a display of how men were superior in that era and women were property; viewed lesser than men themselves. A time when silence was the only answer to most of women’s issues. NOTE: This film is NOT some SJW propaganda or about dogging men. I hope my review does not come off that way. It’s simply a realistic perspective in the life of a woman and two egotistical men who lust for dominance and her love. Really enjoyed it. 8.5/10."}, {"rating": "9", "text": "The best performance of Matt Damon and Ban Affleck is definitely performed in this movie. The film does exactly what a historical novel and drama does without giving ransom to the literature.. making in parts is really necessary and should to be. But Scott can't show violence in the true way yet."}, {"rating": "5", "text": "(Mauro Lanari)\"Forty-four years separate the rivals of 'The Duellists' from those of 'The Last Duel'. Yesterday as today Ridley Scott does not conceal the senseless character of the duel. Nothing is more vain and foolish ...  [These] medieval squires are no less absurd\". Why write such a nonsense? In the film with which Ridley Scott made his debut in 1977, Carradine is persecuted by the obsessive belligerence of Keitel, Napoleon's alter ego. Unlike this last work, back then there were a hero and an anti-hero. Now, however, within a context of Shakespearean tragedy there is the heroine who, following the tradition of Ripley, Pris, Thelma and Louise, G.I.Jane, breaks the perspective equivalence of Kurosawa's \"Rashomon\" and, as a female figure, is the holder and depositary of The Truth (sic). So a de-merit not due to the screenplay written by Nicole Holofcener together with the award-winning couple Damon-Affleck, but to the simplistic dichotomy of \"Gladiator\" and of the #MeToo: is nothing else possible?"}, {"rating": "8", "text": "To be honest I've read a few reviews before voicing my opinion. I was fascinated by how people saw this movie so differently. Someone thought there was only one true story in three perspectives we saw in the movie. The other one I’ve read claimed that the film tries way too much to please the current #metoo narrative. In my opinion, the film doesn't give a definitive answer to what is an undeniable truth, at least in regards to certain aspects (I'm not refering to the main question of guilt, that one is obvious). It does show that every person sees himself/herself as the hero of the story and that is what I liked about it. I thought performances were great. It was great seeing Ridley Scott do medieval stuff. I just couldn't miss that. The only minor issue I have with the film is that it was heavily advertised to have lots of action and it doesn't deliver on that part. It's great whenever sword fighting happens but there wasn't much of it."}, {"rating": "4", "text": "I watched this last night in the cinema.I think the film was kind of boring. The duel was a bit short. The battle action sequences were too short.Gladiator (2000) / The Duellists (1977) were better films because they had stories and character development. The Last Duel was more like just historical stuff happening. Although it was fun to watch all the medieval stuff going on like candles for night lights lol, all the armor wearing, the medieval music/dancing and stuff like that. But yeah overall pretty boring."}, {"rating": "3", "text": "Beautifully shot, with quick-but-calculated action sequences (which are only enhanced by the wonderful acting). However, “The Last Duel”, brings nothing new to the real-life case other than lies and speculation."}, {"rating": "4", "text": "A review already posted here by JimiJons explains in detail my EXACT feelings about this movie, plus articulated better than i probably could have anyway. This was another pseudopornographic hijacking of an otherwise visually striking film. Hollywood's PR machine at play."}, {"rating": "3", "text": "This movie was ruined by a just a couple of frames, when the text \"The Truth\" lingered on screen before the woman's account, taking a clear stance that the woman's account was \"The Truth.\" This invalidated the first 2/3rds of the movie. It flat out tells us, everything you just saw was false. Now for the real story. So everything you had come to understand about the characters was now deemed false. In this TRUE final 1/3rd of the movie, you discover that every man in the movie is pure evil. Matt Damon is pure evil - he rapes his wife more than Adam Driver, even raping her after she has told him she was raped. The more interesting character we had come to know - the uneducated war hero who tried to be a good husband - did not exist. Just a purely evil character. Adam Driver's character too was pure evil. It wasn't a consensual affair that turned into obsession that turned into a rape that the man convinced himself was consensual but deep-down knew was not - no, it was just a straight violent rape by a man of pure evil who enjoyed torturing the woman.Other women in the movie laugh about hoping their husbands die in war. Their husbands are all pathetic, none of them know how to have sex, good riddance if they all die. Other male characters are also straight garbage. Ben Affleck is an evil man who has orgies with sex slaves and his wife hates everything about him.The movie ends with Matt Damon dying in the Crusades and his wife lives happily without him. The movie tells us she never re-married, implying that's why she was happy.So the message appears to be: Men are inherently evil. Women are inherently good. Men and women should not be together (therefore the human race should end.) Believe women. Don't believe men.Ridley Scott said that Millennials didn't watch this because they don't want to \"learn\" anything. There is absolutely nothing to learn from this movie."}, {"rating": "6", "text": "Does this movie make sense?  The obvious reason (in the historical record, I assume) for raping another man's wife is to demean and insult him.  This is esp. so if he's your enemy.  But this motive doesn't even seem to show up in the film.  The rapist (a man of honor to some extent) apparently believes the wife 'loves' him -- courtly love conventions notwithstanding, this makes no sense to me."}, {"rating": "2", "text": "This is an extremely disappointing outing from Ridley Scott. The set pieces, cinematography, and general aesthetic would all necessarily be great, save for Matt Damon's redneck mullet and Ben Affleck's platinum blonde, 90's boy-band haircut, both looks fitting to the awkward, silly acting portrayed by two American Hollywood stars forcing antiquated French antagonists. Adam Driver and Jodie Comer do much better, offering complexity in their performances despite restrictive and blindingly singular dialogue.The writing and plot lack all subtlety, outright prescribing fictionalized guilt in the central conflict of the story halfway through the film and tossing out any remote flirtation with moral ambiguity and nuance, two elements that thoroughly pervade the actual circumstances surrounding the real-life 14th century case of the rape of Marguerite de Carrouges, and which would have made the film a thousand times better.The effect of a multiple-perspective storytelling technique is rendered entirely moot by a text transition screen which literally denotes one perspective, Marguerite's, as \"the truth,\" ironically the single perspective which has the least basis in reality or history, being entirely fictionalized given the lack of a single spoken word or recorded account from Marguerite in the entire real-life case. Worst of all, in an overzealous attempt to decry toxic masculinity and rape culture in a way that resonates with modern #metoo audiences, the writers alter real medieval judicial systems and gender norms and invent make believe ones (i.e. every single scene invoking \"rape and pleasure\" dialogue) to unnecessarily make those already-harsh times seem far worse and far more uncomfortable in every way. Does any normal, healthy human being want to watch the same long, traumatizing, minutely detailed, over-dramatic rape scene multiple times in the course of a single film? The idea that medieval times were bad for men, worse for women, does not need to be ham-fisted into a film through factual inaccuracies and a visual-auditory simulation of PTSD.This is a film designed to evoke disgust and anger, not thoughtfulness and conversation. Every male character with any semblance of power is flawed and evil scum, abusing and oppressing every female, regardless of status (save for one internalized-misogynistic step-mother), who are perfect, flawless, and submissive victims. This singularly dystopian vision of the feminist nightmare has, fortunately for reality, never existed. In an utter and cowardly acquiescence to the socio-politico climate of modern Hollywood and an abject disdain for actual history and the culture of Medieval Europe, Damon, Affleck, Nicole Holofcener, and Ridley deliver an entirely modern tale with a distastefully masqueraded 14th-century backdrop that demonizes every man and victimizes every woman."}, {"rating": "10", "text": "Visceral and timely. An unbelievably powerful story with fantastic performances from all involved."}, {"rating": "0", "text": "Ah.... the time period has changed, but the message is still the same.Men are rapists. All of them. It does not matter when or where. Men are evil, men are rapists.It is a good thing this monstruosity bombed. It is an awful film. Too long, too violent with too much violent sex. But it somehow shows the awful mindset of Hollywood. What is the point of making a film about rape? Only the woke crowd can see value in it. Do we need it? Who needs it?It also shows that Riddley Scott has seen better days. Lately the guy has only made garbage.Any regular person, with some good old sense, see \"The Last Duel\" as it is: a cheap mix of violence and porn with actors wearing stupid costumes."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "8", "text": "The Last Duel is a historical epic done right. It's probably Ridley Scott's best effort in many years. It's a huge achievement for everyone involved."}, {"rating": "10", "text": "Never heard of Jodie Comer before this movie. Having said that, I felt she was the star of this superb effort by Ridley Scott.  Matt Damon showed range in this performance.  Well acted by all but those two stole the show. This was an excellent 2 1/2 hours of drama."}, {"rating": "10", "text": "Great authentic historical movie. Brings late middle ages to life. Shows how unique and alien our past is and also just the same as today in some essental ways."}, {"rating": "7", "text": "Relevant and well acted. Is able to portray women's role in the 14th Century as well as to  manifest that we haven't changed that much in some matters. Jodie is the stand out.Unfortunately it sometimes results to be bland, forgettable and boring."}, {"rating": "8", "text": "Medieval epic, directed by Ridley Scott, with dazzling action scenes and a sensitive and thrilling story."}, {"rating": "10", "text": "The Last Duel—at least in the brutality of its eventual climax—achieves strong emotional blunt force. A sign that its lightly boring morality play and history lesson before the very pre-determined destination was worth the time"}, {"rating": "9", "text": "This movie is great! Fantastic! All the performances are solid. Jodie Comer and Ben Affleck are flawless. One of the best Ridley Scott movies of all time."}, {"rating": "7", "text": "I can confirm now that Ridley Scott is back! 'The Last Duel' may very well be his best film since 'Gladiator.'Don't let the runtime frighten you. Yes, it's long, but I don't think of another way it would've worked. Matt Damon, Ben Affleck, and Nicole Holofcener's screenplay give us three distinct perspectives about a terrible incident: the raping of a woman. It's not hard to guess which version it's the truth, I mean, the film is very obvious about it, but it's the details that make this approach interesting.Each side of the story portrays different versions of the main characters, depending on whose turn is. \"The truth doesn't matter\", tells Carrouge's mother to Lady Marguerite (Jodie Comer) towards the end. And, yes, it didn't matter until very recently. With this film, everyone involved points at the patriarchal system that has held women hostage for so long. Of course, we're still a long way to go to change it, and 'The Last Duel' is not very optimistic about it, but there's light at the end of the tunnel; a moment in history when the victim's truth will be that: the truth.The weakest part of the film is Damon and Affleck's acting, which goes from funny to over-the-top and back all the time. Adam Driver is fine (not great), but it's Jodie Comer who saves the day with the vulnerability and stoicism she gives to her character. There are also some issues with the editing; a lot of scenes end pretty fast, taking you out of the action or the drama. The dialogues are bad sometimes, especially those of the male characters. And, of course, Damon and Affleck's characterization is wild, almost funny.But, despite these problems, the ending is very satisfying. The actual last duel is brutal and spectacular. Reminded me a lot of those Coliseum scenes in 'Gladiator.'Go see this film on a big screen!"}, {"rating": "8", "text": "In this medieval drama from director Ridley Scott, set in 14th century France, Matt Damon stars as knight Jean De Carrouges, who challenges his squire Jacques Le Gris (Adam Driver) to a duel to the death after De Carrouges' wife, Lady Marguerite (Jodie Comer) accuses Le Gris of raping her. The story is uniquely separated into three chapters and is told through the points of view of each of the three aforementioned characters, depicting each of their versions of how the events unfolded. Of course, Ridley Scott is no stranger to making historical epics, what with stellar films like 'Gladiator' and 'Kingdom of Heaven' under his belt. He always seems to be genuinely fascinated by history or whatever time period he's depicting in each of his films, and this film is certainly no exception. The attention to detail, the set pieces, and costumes all transport us to this gritty and dark ancient time quite effectively. Each of the three chapters are engaging and intriguing. Scott essentially borrows a page from the 'Me Too' movement and shows what it's like for powerless women to suffer at the hands of powerful men who go on to deny any wrongdoings and sets it in a far more ancient time, wielding fascinating and poignant results. On top of that, we're graced with harrowing and intense performances from all involved. Damon is fierce and committed, as is Driver who brings a similar level of sinister that we've seen in his villainous turn as Kylo Ren in 'Star Wars' but adds even more depth and layers here. It was also great seeing Ben Affleck reunite with Damon here at long last, and he too gives a rather playful and humorous performance as Count Pierre d'Alencon. However, the real MVP here is without a doubt Jodie Comer, who commands the screen with an equal amount of rawness, heartbreak, and resilience all at once. She's incredible here, and more than holds her own against the rest of the Hollywood heavyweight men of the film! At two and a half hours long, and repeating some scenes due to the three different perspectives, the film doesn't necessarily drag, does take its time with building up certain elements and aspects of the film, but manages to remain quite captivating nonetheless. Overall, it's an epic and worthy addition to Scott's mighty filmography, a bold showcase for all involved in the cast, and a welcome, unique, and thought-provoking look at sexual misconduct and misdeeds through a historical lens for a change."}, {"rating": "10", "text": "Great film. When I watched the trailer in the cinema, I thought it was some kind of boring nonsense. But the film kept me in suspense for two and a half hours. The score should be higher."}, {"rating": "8", "text": "Jest brudno, jest krwawo, jest brutalnie czyli średniowiecze zostało oddane tak jak być powinno. Miejscami się dłuży jednak samą historię oceniam na plus"}, {"rating": "9", "text": "This is a hell of a movie. The screenplay is great. Jodie Comer and Ben Affleck, what a big and wonderful surprise. They steal the movie. The best of Ridley Scott since Gladitor. Go watch this movie in cinemas!"}, {"rating": "10", "text": "The best epic historical drama film ever. I applaud to the writers (Ben Affleck, Matt Damon and Nicole Holofcener) the way how they could make three different versions of a whole story very well adapted from the book \"The Last Duel: A True Story of Trial by Combat in Medieval France\". The performances are incredible, I could feel a lot of emotions very different each one another with the same characters, in some point I felt identified with a character, but after I felt a lot of anger of him. Ridley Scott was an extraordinary choice to have directed this film. All the technical aspects are excellent. And the last duel is the most intense and cardiac fight I have ever seen."}, {"rating": "2", "text": "Super boring. Basically nothing happens in the movies besides people \"talking\" to each other. Just don't bother with this nonsense."}, {"rating": "0", "text": "1. The script is a disaster2. A poor man version of Rashomon.3. It's just a waste of talents of an amazing cast.   Simply awful."}, {"rating": "8", "text": "It looks incredible and is well-acted, and leaves most things up to the viewer to decide. Could’ve been a bit more trimmed, but overall one of Scott’s better recent outings."}, {"rating": "8", "text": "I have not seen such a complex movie as this one is for a long, long time. Phenomenal writing, the cast at it's best, beautiful and dark setting, hardcore battle scenes - a true experience for history and drama fans.I wish the soundtrack was a bit stronger as the plot is heavy and length of the movie being also a bit shorter."}, {"rating": "8", "text": "I was expecting a by the numbers medieval action flick, expertly done by a master in his prime (I'm a sucker for Ridley Scott most of the time), but I was pleasantly surprised by this new take on Roshomon. I love how there is no one answer, but rather you are required to paint the picture in your own mind, given some pretty set clues. Each version has some absolutely solid truths they all agree upon, and some subtle, and not so subtle, differences based on who's telling it. I loved that in both pics and Scott pays appropriate homage to the Kurosawa's masterpiece.I thoroughly enjoyed this and everyone in it. My only minor complaint is the bit of wokeness around Jodie Comer's version, which leaned heavily into the narrative that women had little power in the 14th century...der. I think that's well-trod ground, and at the end of the day, she didn't have to fight a dude who had seen a **** ton of combat like her husband did. Sure, the actual action doesn't take place until the third act, but even with its brevity, the duel itself is a great piece of action cinema a la Scott and a well-earned payoff. Everyone in this did a great job.This also led me to another one of Eric Jager's other books, Royal Blood which could be a great flick too."}, {"rating": "8", "text": "Todos os fatos têm três versões: a sua, a minha e a verdadeira. Provérbio Chinês\"O Último Duelo\" é uma crua, necessária e verdadeira versão sobre o provérbio supracitado.Dividido em exatos três capítulos, como o provérbio, ele pode parecer desengonçado de início, mas sua direção e montagem te envolvem até tirar seu fôlego no capítulo final, montagem essa que expõe sua excelência em uma simples cena de um beijo, mas vista de três âmbitos completamente diferentes. Jodie Comer deixa claro o porquê de ser uma das maiores atrizes de sua geração na cena em que descobre qual será sua penitência caso o duelo não resulte em seu favor. E é difícil respirar enquanto assiste a cena da luta. Parece que a verdade de várias mulheres que passaram pela mesma situação está em jogo junto com a da personagem, mesmo que o contexto de envolver a vontade de Deus em uma questão como essa seja ridículo. Vemos ainda várias percepções diferentes envolvendo um caso tão delicado como o de um estupro. Quem já passou por um e decidiu ocultar e seguir em frente, quem não acredita na palavra da vítima, quem não se importa com a situação e etc. Um drama medieval abordando esse assunto é de suma importância, pois mostra que um grito por justiça sempre foi dado. E você foi ouvida, Marguerite. Você foi ouvida!"}, {"rating": "8", "text": "The movie was well done in giving the different perspectives to the story. The little hints given through the movie allows the viewer to come to a conclusion while still giving closure."}, {"rating": "8", "text": "Really well acted and it looks gorgeous. Maybe a bit long and messy in its narrative, but I really appreciated a $100 million adult epic being played in theaters…"}, {"rating": "10", "text": "Epic action packed film about honor and bravery. Ridley Scott’s best movie since the Martian shows us a  creative new plot with incredible actors and visual."}, {"rating": "10", "text": "Oh boy.... this is going to be a hard movie for some dudes to watch.  I can hear the male outrage echoing through the privileged halls of Regal Cinema already.  The Last Duel needed to be told three times for guys the like one sitting behind me at our viewing today. He said \"She lead him on!\".  He marched out of the theater after Jean's less that triumphant march through Paris.  We have all learned to look at the world through the male gaze. When we are asked not to, it's uncomfortable and disorienting.  It's this disorientation that you leave the theater with. Who is the good guy? Who is the bad guy? Who do we cheer for? Why do we stay silent? Because it is easier and more reassuring to stay within our mapof the world than to destroy it. How you felt about this movie after viewing says so much more about your view of yourself and your place in the world than it does about the movie. Bored, crying, angry... or all of the above like me. I wanted to be entertained! I wanted a thunderous ending to tell me when to clap! I was left with the empty feeling that there are more Jean's and Jaques  in this world than heros. I just don't want it to be true."}, {"rating": "9", "text": "Matt Damon and Adam Driver play squires and best friends, until Driver’s character rapes his friend's wife (Jodi Comer). In 14th century France, the only way to settle this accusation is the titular showdown (which is a truly gripping encounter). The story is told 3 times, from the perspective of each of major characters. The script by Damon, Nicole Holofcener and Ben Affleck (who also plays a main character as a blonde) creates the conflict with depth. Director Ridley Scott’s skills with grand battles and bigger-than-life storytelling are in full glory. Add solid performances all around to make this a compelling historical epic."}, {"rating": "10", "text": "So many great actors, such a cool setting. The music is phenomenal, the battles are brutal, but it's the story that carries this film and sets it above so many others for me. I love this idea of three different versions of events being told and it fascinates me how some of them are twisted to suit that person's opinion of themselves or to suit their survival needs. One of the ways I know I've seen a great movie is if I can't wait to watch it again and when I do I enjoy it even more. Its exciting, funny, touching and disturbing. Its about honour, love and bravery. There are heroics, but they are relative to the day and age so don't be shocked if your hero is himself a fallible and petit man. Ben Affleck steals the show for me here as an actor. He completely transforms himself and is a joy to watch."}, {"rating": "8", "text": "Ridley Scott has done it again. Why this film flopped has more to do with Covid than anything else. Mature age audiences are not coming back to the cinemas due to its high risk. Hence, The Last Duel joins many of Scott's so called 'flops' including Blade Runner that will become a revered classic in the future."}, {"rating": "8", "text": "This is a Ridley Scott epic, much in the same vein as Gladiator. The medieval setting is intriguing and the way that the 14th century is fleshed out is sublime. The story is told from different views, which I quite liked as it allows for perspective and interpretation however some may find it a tad slow. The movie moves towards a earth shattering climax that I'd say I'll never forget.. This is one for people with attention spans - 8/10"}, {"rating": "8", "text": "The Last Duel is based on real life events that took place around the time of France’s last sanctioned trial by combat. A duel between bitter rivals Jean de Carrouges (Matt Damon) and Jacques Le Gris (Adam Driver). Marguerite (Jodie Comer) is savagely attacked by Le Gris and despite the huge risk she takes by speaking out she refuses to stay silent. Bravely stepping forward to accuse her attacker. Le Gris of course denies the charges and the battle to the death must take place putting the fate of those involved into the hands of God.With an expensive production budget that clearly shows, the audience is immediately immersed into 14th century France. It’s a compelling story and hugely tense as the movie builds to its inevitable climax. My main issue with The Last Duel is the three separate narratives and the need for them. Due to this you’re seeing many of the same scenes again from a different perspective and I don’t think the audience needed to see a brutal rape scene twice. Jodie Comer gives an absolutely brilliant performance and I feel telling the story from her point of view alone would have had more of an effect. She really is the strongest thing about this movie and with an impressive supporting cast all bringing their A game, particularly Adam Driver, who let’s face it is great in everything. It’s an impressive movie but not quite Gladiator standard.As for Ridley Scott’s comments about The Last Duel performing so poorly at the box office due to “those damn millennials and their cellphones” it’s coming across very Clint Eastwood in Gran Torino. Maybe Ridley, before immediately blaming the young people addicted to their phones, you might want to have look at how many cinemas even bothered showing The Last Duel at all, along with the number of showings per day and how long it ran for before it was gone. Honestly if you’re hoping a medieval movie that was barely advertised is going to be able to compete against No Time to Die and Dune then I don’t know what to tell you. What did you expect would happen? Anyway I’m not going to let the words of a grumpy old man get to me, the sooner these clickbait articles about the latest director’s criticisms of superhero movies/millennials etc. are gone the better.I don’t need to give a recommendation for you all to see The Last Duel in the cinema, partly because this review is quite late and those who wanted to see this on the big screen already have. For the rest of you, The Last Duel is recommended as “only going to watch this once kinda movies.”"}, {"rating": "6", "text": "Affleck, Damon, and Holofcener want to say things about society, and they want us to quibble over what exactly they are saying about it. I’m sorry, but I can’t seem to care what they have to say about society. I bought my ticket for something that would affect me on a visceral level, not for a discussion prompt."}, {"rating": "7", "text": "The Last Duel has the pedigree that characterizes Ridley Scott's best epics, but for some reason it feels like an attempt to replicate himself and it just doesn't quite work for him.Let's just say this film is a more closer relative to Robin Hood than to Kingdom of Heaven.Some comparisons that have been made have branded it as a kind of medieval soap opera, and I admit that there are some points in it to validate that argument, but at least Scott is a director who has too much experience to make it so easy.The Last Duel is a film for adults. Even with all its flaws, but it's for that very reason that it will hardly appeal to audiences looking for a more basic entertainment.And it's not that I want to minimize other people's tastes but a period film, with performances that border on the operatic, with a gray and cold staging that does not really involve much action and lasts two and a half hours, will hardly be attractive for the masses.I recommend it because I didn't think it was a bad film, but I also have to admit that it added absolutely nothing to Scott's résumé, and it doesn't have to. My point is that there are better options in his filmography.Yet, there's nothing better but to forge your own judgment."}, {"rating": "7", "text": "I think the movie try too hard to make Margerite \"the hero\" and to make the other 2 version of the story look bad. Also, to watch almost the same thing 3 times is kind of heavy or tiresome, but i guess it was needed for the story.There's not that much combat compared to other R.Scott medieval movies, but the final duel was actually worthy, thanks god. I was tired of the sh!tty combat on the Hollywood movies of this last 2 or 3 years, so this movie feels refreshing... Combat in this movie feel real, painful, gritty, bloody and dirty, i appreciate that.Probably the most decent thing i watch on 2021."}, {"rating": "7", "text": "Mostra varios pontos de vista de um crime, apesar das lutas do filme serem boas são muito rapidas."}, {"rating": "9", "text": "You can literally split the tension built up here with a sword. The Last Duel is a medieval drama set in France with a heavy and drastically staged theme.Structured in a change of perspective, the film tells the perspectives of the individual protagonists. Although scenarios are repeated here, they are always supplemented with interesting thoughts and statements. It is a game with how one's own perception can deviate very massively or even very slightly from the perception of the other person.A film that is shot very cold and somber and partly in its rather few action sequences it is full of it and can be uncomfortable. At the beginning the film needs some time to get going, but then it even turns into comedy at times. But if you internalize the narrative structure, the tide turns and the tension increases more and more and finds its climax in the story of Marguerite de Carrouges, played incredibly well by Jodie Comer. But the rest of the cast is also strong with the outstanding Adam Driver (I've become a real fan of his), Matt Damon and Ben Affleck.For me it's a great film that ends in a brilliant finale and only has some starting problems 9/10 perspectives."}, {"rating": "9", "text": "A very interesting experience. Watching the story through the eyes of each of the main characters is truly interesting. I advise fans of interesting stories. Acting is on top. Ridley Scott did a great job, he made a great movie!"}, {"rating": "7", "text": "Huzzah and greetings, Streamers! A new weekend has brought the latest Ridley Scott historical epic, The Last Duel, to theaters. This unexpected offering has more than just the titular duel. The film depicts the power differential between men and women in 1300's France as well as how those issues continue to permeate modern times. Here's how it goes.Based on true events, The Last Duel tells the story of Knight Jean de Carrouges (Matt Damon), the Knight's wife, Marguerite (Jodie Comer), and his squire Jacques Le Gris (Adam Driver). Essentially, Knight Jean de Carrouges challenges his squire, Jacques Le Gris, to a duel in order to defend his wife's honor, as she has accused Le Gris of assaulting her. Damon and Ben Affleck co-star in the film and co-wrote the screenplay with writer/director, Nicole Holofcener. The story is recounted from the different perspectives of de Carrouges, Le Gris and Marguerite in order to illuminate their differences and to emphasize Marguerite's truth. In this way, the action of the film centers upon the drama of what led up to the \"last duel\" and not so much on the duel itself.Ridley Scott has directed historical epics before like Gladiator, Kingdom of Heaven and Robin Hood. But, The Last Duel has a deeper importance considering that it's based on true events and it reflects the little progress our society has made in dealing with sexual assault. Scott does a good job with the action aspects of the film. Some of the more dramatic elements can get kind of hokey. The story is told in relatively equal thirds, from different perspectives with clever alterations to each version. However, there is a repetitive nature that affects the overall pacing of the film, which can feel long in the middle. Thankfully, the film perks up when Marguerite takes center stage. As a side note: the movie looks good in terms of setting, production design and cinematography - it's believably France in 1386.Jodie Comer is great in this. Really, Marguerite is a really good role, and Comer lives up to it. Marguerite has to be demure to her husband, enticing to Le Gris, and steadfast and self-possessed in her own version. Comer does such a good job of embodying each version of Marguerite that the truth of the story is apparent when she steps into her own story. The Last Duel ends on such a high because of Comer's powerful performance. The rest of the cast is fine, but they suffer from wonky accents and unsatisfactory dialogue. At points, the dialogue is too on-the-nose; it's as if Damon and Affleck lifted a Facebook argument and plopped into a scene in France 1300's. The point is well-made, but not necessarily well-executed.Final note: when the duel does occur, it is exciting and tense. I'll give credit to Scott's great direction of the fight. Both Damon and Driver are totally invested in the brutality of it all. You can absolutely understand why other duels weren't sanctioned by the king after this. Lastly, again, Comer, in the duel scene, is remarkable and it wouldn't not be as emotional without her performance.Ultimately, The Last Duel does a good job of telling a story from France 1300's that is relevant today. While telling the story from three perspectives isn't always successful, the attempt to illuminate the differences is admirable. The powerful performance by Jodie Comer makes it all worthwhile in the end. If you're looking for a swashbuckling, heart-pounding fight to the death epic, this isn't that thing, so don't be fooled. For what it is, I'll say it's a bowl of popcorn at a Sunday matinee."}, {"rating": "10", "text": "such an amazing movie! i enjoyed it. It's Ridley Scott's best effort in many years"}], "recommendations": ["allied", "the_good_shepherd", "hostiles", "the_monuments_men", "the_last_king_of_scotland", "the_experiment", "nocturnal_animals", "the_book_thief", "valkyrie", "no_country_for_old_men", "alexander", "the_eagle", "hereafter", "first_man", "the_1517_to_paris", "legends_of_the_fall", "12_angry_men", "hidden_figures", "spotlight", "darkest_hour", "patriots_day", "hacksaw_ridge", "only_the_brave", "child_44", "the_reader"]}