{"id": 2056, "title": "The Rock", "starring": ["Nicolas Cage", "Sean Connery"], "runtime": 137, "genre": ["Action", "Adventure", "Thriller"], "description": "When vengeful General Francis X. Hummel seizes control of Alcatraz Island and threatens to launch missiles loaded with deadly chemical weapons into San Francisco, only a young FBI chemical weapons expert and notorious Federal prisoner have the stills to penetrate the impregnable island fortress and take him down.", "releaseYear": "1996", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/j5mxLNWjUlXUUk8weFBtnF4afIR.jpg", "categories": {"plot": 7.285714285714286, "acting": 7.266666666666667, "ending": 6.714285714285714, "soundtrack": 7.428571428571429, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.6, "action": 7.60655737704918}, "reviews": [{"rating": "10", "text": "I have to disagree WilliamO. You have to understand that this movie was made in the 90's, back then the movies weren't as good as they are now. Also the movie shows what goes on in the marines mind, what they think should happen. Over all \"The Rock\" is and will always be my number one movie. This movie is Michael Bay's best movie besides transformers."}, {"rating": "10", "text": "Along with Entrapment (1999), this was Sir Sean Connery's favorite film of his own during the 1990s."}, {"rating": "10", "text": "higuughghgjgfyguyfughiihhoinknongjgugjhiugyfdtyfhkhjgguinhiguinugsreawqwryippkmjudtdrsrstfugugihinininihjhjjbhjj"}, {"rating": "10", "text": "Sir Sean Connery insisted the producers build a cabin for him on Alcatraz, as he didn't want to travel from the mainland to the island every day. He got what he asked for."}, {"rating": "8", "text": "Believe it or not, Michael Bay did make a strong, GOOD action movie, and here it is."}, {"rating": "7", "text": "Awesome Nicolas Cage. He his one of the best actors ever. I love watching everything he does."}, {"rating": "10", "text": "[][][][][][][][][][][][][][][][][][][]][[][][]][][]]][].________________________________________________________"}, {"rating": "10", "text": "Here's a shocker... one of my favorite films of all time is a **** Michael Bay movie! But ya know what, that doesn't matter, because Michael Bay managed to actually combine his great action sensibilities with superb storytelling. Everything here is outrageous and explosiony and exciting, but without going so far over the top that it becomes incredibly retarded and irritating, e.g. Armageddon, Bad Boys 2. This is, in my opinion, the perfect modern day action flick. Navy Seals, U.S. Marines, jet fighters, a deadly nerve toxin, Sean Connery being a bad ass, Nicholas Cage being crazy **** Nicholas Cage and allowing us to laugh at him... it has it all.  I wouldn't even say that The Rock is all that smart. If you really think about it, Hummel's reason for turning traitor and holding an entire city hostage is just kinda weak. It's just that the moments in the film all work. When those Navy SEALs are ambushed in that shower room and hold their ground, you can feel the terror in their eyes, you can sense the tension and dread looming in the background. You know something tragic is about to happen, and then it does and there's tears in your eyes and your heart sinks. It's one of the most masterful and emotional scenes in any action film.And of course, the relationship between Cage and Connery just hits on all cylinders. Their back and forth banter and grudging friendship, it all comes together and elevates the entire film. And really, you can go outside of that. It's not just Cage and Connery, but Connery and anybody. Connery trading quips with Michael Biehn, Connery joking with the hair stylist, Connery in a verbal duel with John Spencer's character, it's all just really entertaining and fun to watch. It's sad that all of Bay's films after this have failed to live up to the promise that The Rock showed us. Perhaps he was just more hungry and determined back then, who knows. But even if Transformers 3 turns out to be a turd on the order of the Star Wars prequels, I'll still remember him as the director of this great action flick."}, {"rating": "10", "text": "Never thought Michael Bay could make a movie like this, a classic!\rWatch this even if you are not a Michael Bay fan, it deserves your attention, there's nothing more I can say."}, {"rating": "10", "text": "..............................................................................................................................................................................................................................................................................A Classic Masterpiece of action,this one is for the haters of Bay..."}, {"rating": "10", "text": "Geese ciritc do take sthings serouisly about the movie being bad but THIS is a good action movie with the breakthrough of nicolas cage and sean connery. They had great chemistry."}, {"rating": "10", "text": "This is one of my favorite films. It has everything you could possibly want in an action movie: action, drama, humor, a car chase, a love story, suspense and the voice of Sean Connery. And the music is also great. Watch it, rent it or buy it, you won't be disappointed"}, {"rating": "10", "text": "Critics are stupid.At least de negative scores.This film is a GREAT action movie.I got a real pleasure watching it.Very good actors,good music,good story,good everything."}, {"rating": "10", "text": ".................................................................................................................................. AWESOME Flick, 95's,96's and 97's Were the Years for Nicolas Cage Career."}, {"rating": "9", "text": "yup i find it hard to believe but micheal bay did actaully at one point make a good movie . that would be the Rock. might be that he had some great actors like sean connery and ed harris and others  ... also nick cage didnt do to bad eather . its a fun action packed fun ride having alkatraze prison takin over by some ex military soldiers seekin restitution for fallen solders who did not get the credit they deserved for dieing for there country . the govermnet seeks the help from a lab rat FBI agent and a old prisoner with a mysterous past . its actaully all blends together well the action the story and the acting by ed harris who does frank hummel was great . why cant bay make fun films like this instead of crap like transformers and perl harbor."}, {"rating": "9", "text": "Where the hell is movie critics going when this film got average reviews. I would give it 7 just for music and for Sean's, Ed's and Cage's good acting 8. Plus this movie does have a lot of sence because, its very true what it is said about American politics and secret missions. There is a loat of drama involved here and a strong ending. You wont be disapointed with this movie, actualy you wont be disapointd at all."}, {"rating": "9", "text": "Exhilarating, thrilling, and all around intense without taking it over the top, The Rock is an strong Michael Bay work that has the strength to entertain thanks to the fantastic performances, effects, and powerful dialogue."}, {"rating": "9", "text": "Bad Boys. Armageddon. Pearl Harbor. When arguing with people who believe the Jerry Bruckheimer/Michael Bay collaboration is a cinematic axis of evil, that trio provides evidence that's hard to dispute. Yet just introduce The Rock into conversation and watch them founder.\r Yes, it's got all the hallmarks of a standard B 'n' B production - it's loud and bombastic, it's crammed with orange filters and epilepsy-inducing editing, and it doesn't make a great deal of sense. But set against that is the fact that it's breathlessly exciting, as Nic Cage and Sean Connery break into Alcatraz to thwart Ed Harris' disgruntled general from bombing San Francisco with lethal nerve gas.\r The superb action is choreographed with zing by Bay, before he mutated into Jim Cameron-lite. And the film has a real trump card in Harris' conflicted bad guy - it's a rare and intelligent move for a big budget studio venture to feature a villain with an agenda that's hard not to sympathise with.\r Luckily he's matched by the quality of the heroes. While The Rock proved that Connery could still cut the mustard as an OAP action star, it was the making of Cage as action hero, his wild and wired approach gelling perfectly with Conneryís gruff demeanour.\r And when theyíre not shooting Alcatraz to bits, they're the funniest buddy-movie double-act in years. In short, The Rock has more pizzazz than an entire roomful of Dwayne Johnsons.\r Loud and bombastic, it's crammed with orange filters and epilepsy-inducing editing, heroic leads and it doesn't make a great deal of sense. Entertaining action, nothing more nor less."}, {"rating": "9", "text": "Bad Boys. Armageddon. Pearl Harbor. When arguing with people who believe the Jerry Bruckheimer/Michael Bay collaboration is a cinematic axis of evil, that trio provides evidence that's hard to dispute. Yet just introduce The Rock into conversation and watch them founder.\r Yes, it's got all the hallmarks of a standard B 'n' B production - it's loud and bombastic, it's crammed with orange filters and epilepsy-inducing editing, and it doesn't make a great deal of sense. But set against that is the fact that it's breathlessly exciting, as Nic Cage and Sean Connery break into Alcatraz to thwart Ed Harris' disgruntled general from bombing San Francisco with lethal nerve gas.\r The superb action is choreographed with zing by Bay, before he mutated into Jim Cameron-lite. And the film has a real trump card in Harris' conflicted bad guy - it's a rare and intelligent move for a big budget studio venture to feature a villain with an agenda that's hard not to sympathise with.\r Luckily he's matched by the quality of the heroes. While The Rock proved that Connery could still cut the mustard as an OAP action star, it was the making of Cage as action hero, his wild and wired approach gelling perfectly with Conneryís gruff demeanour.\r And when theyíre not shooting Alcatraz to bits, they're the funniest buddy-movie double-act in years. In short, The Rock has more pizzazz than an entire roomful of Dwayne Johnsons.\r Loud and bombastic, it's crammed with orange filters and epilepsy-inducing editing, heroic leads and it doesn't make a great deal of sense. Entertaining action, nothing more nor less."}, {"rating": "8", "text": "The Rock is a fun time at the movies. It's implausible as hell, no doubt, but it's still thrilling. Its scenes of action are tense and well-edited. It might not contribute anything new to cinema, but it's still worthy of a watch or two. Michael Bay directed this one, so expect many an explosion."}, {"rating": "8", "text": "The Rock is Michael Bay's best film without a doubt. The action is great and the plot doesn't get too out of hand. The movie is fun as hell and the cast is excellent. Nick Cage was becoming one of the biggest action stars of the 90's and Sean Connery was well established, even legendary. After watching this film it makes me miss Connery a bit, I thought he was amazing. There are also a few laughs to be had throughout the film. If you are a action fan please check out The Rock even if you aren't a fan of Michael Bay's other movies."}, {"rating": "5", "text": "I forgot the bad directing, camera work, and illogical script for this \"masterpiece\".  I guess we were all mentally giving it a serious bump for Connery, and a half-decent performance from Cage.  The total lack of continuity and accuracy is all down to  Weisberg, Cook, and Bay.  The terribly cliched camera work and stunt scenes that make little sense, or impact, are down to Bay alone."}, {"rating": "7", "text": "With silly and unbelievable action scenes, quotable lines, lots of explosions, a likeable villain and great acting performances from the main cast, The Rock is a great, entertaining guilty pleasure action film. If you enjoy silly 90's action movies, you will without a doubt enjoy this one."}, {"rating": "8", "text": "This is literally Michael Bay's best movie, The Rock is so much fun. One of the best 90's action movie, this is also Nicholas Cage's  best movie he was perfect as Stan Good speed. Sean Connery was cool in the movie as well, His Best line has to be \"Your best,losers always talk about their best, winners go home and **** the prom queen.\" hilarious scene, The action is a lot of fun to and a pretty good plot.What I liked about Nick Cages character is he is \"a fish out of water\" he has never experienced combat before, which is interesting. All in all the movie is a little cheesy but still a really good time, the Rock is definitely a movie to see"}, {"rating": "7", "text": "How could Michael Bay have fallen so far in just 20 years? Though it is largely a picture that doesn’t require much use of one’s brain, “The Rock” succeeds in its goal to entertain with frenetic action, likable leads, and one of the better screenplays Bay’s brought to the big screen (though that should probably tell you something). Hell, watching this he even seems like a promising, talented director, and he probably once was before delving into a world of big paydays in exchange for sh**ty acting and CGI overload.The film opens in stereotypical revenge film fashion: with the main antagonist visiting the grave of a dead loved one. That would be General Frank Hummel (Ed Harris), a bona-fide American hero who’s seen at least three decades of war. Yet Hummel is upset by the US government’s failure to pay the families of Marines under his command slain on covert missions. His respect for his fellow servicemen follows over into a raid conducted by him and some of his men on a top-secret government storage facility, telling them “no casualties” (something he seems to forget later on in the film). When all is said and done, they’ve made off with 15 rockets armed with V-X gas (though not the normal kind, a scarier-looking version that melts one’s skin for some reason) and proceed to Alcatraz, where they hold a group of tourists hostage and threaten to kill the population of San Francisco unless $100 million is transferred from a military slush fund. Sent to stop him are John Mason (Sean Connery), a former SAS captain held prisoner by the US government for over 30 years without due process for stealing a microfilm filled with state secrets, and Stanley Goodspeed (Nicolas Cage), an FBI chemist who curiously works well under pressure but is terrified by the idea of having to do so. Once their Navy SEAL escort is killed by Hummel’s forces, Mason and Goodspeed must brave the treacherous island while avoiding the General’s men and disarming the rockets. From there, it takes only a knowledge of “Die Hard”-esque action movies to guess what’s going to happen from there.Something that works against the film in my opinion is Hummel’s characterization, which is constantly in conflict with itself. He is depicted in the movie as having a strong sense of honor, which undercuts some of the more ruthless actions he attempts by making it seem like he will be unable to follow through on them. In what world is the man who threatens millions of lives with nerve gas-enhanced ballistic missiles the same man who tells a group of kids to leave the island he plans on taking over so that they’re not in danger? What ruthless terrorist threatens to gun down enemy soldiers if they don’t drop their weapons but then gives them plenty of time to surrender and tries to stop his own men from firing on them? Hummel seems like too good and honorable of a man to pull off the attack, and though Harris plays him well a little more ambiguity might have served the character well. Don’t get me wrong, though, this movie does possess its strengths. Connery brings dry wit to the character of John Mason that makes him resemble an elderly James Bond, Cage is good and even likable as the reluctant hero, Harris generates sympathy and concern for General Hummel, and the supporting cast ranging in star power from 80s action icons like Michael Biehn (Corporal Hicks in “Aliens”) in the role of a SEAL commander to others like William Forsythe (who I first discovered by watching the Rob Zombie flick “The Devil’s Rejects”) playing a more typical FBI Agent (interestingly enough, a lot of Forsythe’s previous roles had been as “tough guy” gangsters) occupy their allotted space well. Nothing about the story is particularly new, but it’s executed with enough vigor and energy to give the genre clichés contained within it fresh life. The film also provides a welcome change of pace in villains by switching gears from Russian or Iranian or wealthy megalomaniac terrorists to American terrorists. Quite the change, I know. But in an era when we are becoming more and more wary of the world around us and the people who inhabit it, a reminder that we can just as easily face enemies at home is both refreshing and a little frightening.Michael Bay’s first film is probably his best, which should probably tell you something about the state of his career. If he could somehow return to this phase, the director who once showed promise and didn’t kill brain cells and acting careers with his movies, and start over, he could have possibly done some great things in cinema. But alas, what’s done is done and we’re left with only a hair lip reminder of what could have been. 7/10"}, {"rating": "4", "text": "Probably Michael Bay's best film... and I did NOT mean that as a compliment!"}, {"rating": "3", "text": "THE ROCK is a strange one to review. It was made in 1996 and is a thriller action film with Nicolas Cage, Sean Connery, Ed Harris and Michael Biehn... Unfortunately this movie was sadly caught in the crossfire and collided with films such as Con Air, Broken Arrow and Face/Off and this didn't help The Rock as a movie. Sean Connery is fairly decent and respectable actor but Nicolas Cage is crap in most movies if not all and can't act even if his life depended on it. This film is violent and entertaining with action but it also feels depressing and horrible. Ed Harris and Michael Biehn are also great actors but this film was horrible and that's all I remember about it about it."}, {"rating": "0", "text": "On of the worst movies ever. Unrealistic in almost all aspects , it screams Hollywood cliche at every corner. The Bad Guys are sophisticated and an deadly at the start, while the recue team is shown to be reminiscant of the Keystone cops, with the exception of the 2 men least suited for the Job. But when thesesame to go against the rest of the Island weare suddenly led to believe that the Bad guys are bumbling fools. Only an idiot would find this movie entertaining, Definetly one of Micheal Bay's worst."}, {"rating": "8", "text": "Michael Bay's second and second best film. Sean Connery and Nicolas Cage work really good together, and Ed Harris is great as usual. Since it is a Michael Bay/Jerry Bruckheimer film, it has it's share of big explosions and fast edited shots. Good story and acting all the way around. A much better effort for Michael Bay this time around then Bad Boys."}, {"rating": "8", "text": "Yes, there was a time when Michael Bay made movies that actually had a plot to go with the explosions, and some, like The Rock, were terrific. I had never seen The Rock from beginning to end, having just caught glimpses of it on TV, but watching it in it's entirety proved what I'd long suspected, it was a great film. A Marine General, upset that his lost soldiers never received the compensation they deserved for their secret missions, takes control of Alcatraz island, and aims chemical weapons at San Francisco. The FBI is at a lost as to what to do and decide to go with an unconventional idea to try and stop the general. A team of Navy seals prepare to take the island back, lead by the only man to ever escape from Alcatraz, now in his sixties, and a chemical weapons specialist who has never been in combat. Sean Connery stars and even though he was nearing the end of his illustrious career, he gives a truly great performance, that reminds us of just how great his movies were. Connery was the premiere action star, in a time before special effects had been computerized. He really gives an old school attitude and feeling to the film, which helps The Rock stand out from it's competition. Connery is paired with Nicholas Cage who is always terrific, especially when he's playing some type of law enforcer. Cage adds humor, unintentionally, with his inexperience, and winds up doing some pretty amazing things. While I don't like to mention specific scenes in a film, I'd be remiss not to mention the incredible chase scene Cage has through the streets of San Francisco, in the beginning of the film. It was reminiscent of the great car chases of the Lethal Weapon series, and really stood out to me. The Rock is a terrific story, featuring a cast in which old school and the younger generation collide, and to top it all off, it has that Michael Bay spin and over reliance on special effects. It's a terrific action film which sadly is rarely seen anymore in the world of computer generated effects and muscle headed action stars."}, {"rating": "7", "text": "Why did I watch it?\rThis is one of those films that I should have seen but for no particular reason I haven't. Instead I've managed to see Con Air probably half a dozen times. What's it all about?\rEd Harris plays disillusioned US general Frank Hummel, who leads his rogue team of Marines to seize control of Alcatraz, taking 81 hostages in the process. Armed with biological VX missiles aimed at San Francisco, Hummel demands funds for the families of those marines who have died in deniable operations. The US governments teams up FBI chemical specialist Stanley Goodspeed (Nicolas Cage) with former SAS operative and Alcatraz inmate John Mason (Sean Connery) to save the day.\r Should you watch it?\rThe Rock is a straight forward action film with no regrets. Bang for your buck director Michael Bay's second film delivers gun fights, car chases, explosions a plenty, all tethered to a pretty zany plot. He finds time to squeeze in some instantly recognisable shots, namely the slow motion shots of Cage getting to his feet a la Will Smith in Bad Boys.\r The three leads play there characters well. Harris plays Hummel dead straight and manages to give him several dimensions. Cage is his fairly usual character, the goofy, funny, out of place hero. Connery brings some extra class to the film although he does have a few cheesy lines that would make a Bond script look Shakespearian. Producers Bruckheimer and Simpson gave soundtrack duties to Hans Zimmer, who delivers another fantastic Zimmer special.\r As 1990's action films go, The Rock is up with the best of them."}, {"rating": "6", "text": "The Rock is one of Michael Bay's best works, though it does pale in comparison to his best film, Armageddon. Released two years prior to this peak, The Rock features a lot of positive elements. From spectacular action sequences, solid acting, and being gloriously over-the-top, the film has a bad ending that too fully embraces lunacy to feel appropriate. Featuring a cast led by Nicolas Cage, Sean Connery, and Ed Harris, The Rock is hardly restrained and is in danger of careening off the edge throughout, but it remains a wildly entertaining and bombastic experience that highlights some of the best elements that Bay has to offer the world of cinema.With masterfully shot action scenes, Bay graces the film with a style all his own and, though he indulges a bit too much in explosions, the film is still a great action movie. Throughout, Bay laces the film terrific tension as Dr. Stanley Goodspeed (Nicolas Cage) and John Mason (Sean Connery) race through Alcatraz to try and save San Francisco from assured death at the hands of General Hummel (Ed Harris). In the scenes in Alcatraz, The Rock really soars with great tension, fun set pieces, and incredibly well shot action scenes. Here, Cage and Connery feed off of one another with great chemistry as the duo ham it up in this insane action movie. As the villain, Harris is oddly sympathetic. Hardly a killer in the vein of many movie villains, Harris merely wants recognition for his fallen comrades, not to kill thousands of people. A true leader, Harris' Hummel is a man who instills fear, but is well-developed enough to make him an admirable foe. Compared to modern action movies, creating a villain that is incredibly worthwhile and not just after world dominance sets The Rock apart and makes it a thoroughly enjoyable experience.Yet, aside from this, The Rock loses weight compared to a film such as Armageddon. Both show that Bay knows action, as all of his work honestly does. Armageddon, however, showed that he knew how to create pathos. Throughout, you root for the good guys for a variety of reasons and there are incredible stakes. The Rock does not boast this quality. It tries to create it with Dr. Goodspeed and his pregnant girlfriend or Mason and his adult daughter, but both fail. Neither woman is given enough screentime, Goodspeed's girlfriend is a moron and never in harm's way, and Mason's daughter comes and goes as quickly as a Michael Bay explosion. As such, The Rock has thrills and tension, but lacks an effective emotional edge to really given the film depth and punch. As a result, it is a largely hollow experience with very few lasting moments from the film.More egregiously, the ending is nearly comical. Yes, the rest of the film is over-the-top and insane, but with the bombing of Alcatraz and the scene in the Church at the end, The Rock goes a little too crazy with the hilarity. In particular, the final line of the film and underlying element throughout regarding what Mason knew about top secret information hardly adds to the film and instead makes it an exercise in stupidity.Fortunately though, The Rock remains action-packed with killer action sequences such as the one in the showers or the moment before with John Mason rolling through the flame throwers. Over-the-top and exaggerate, Bay shoots these moments with incredible style that leaves you wanting more and fully engaged in the sheer entertainment of the film. Throughout, Bay gets incredibly creative with a good backstory about the weapon. He also does add some depth story-wise with an appeal to recognize fallen soldiers and to step back from the ledge in regards to biochemical warfare. A worthy message, this film serves as a wake-up call as to what is possible if we lose our ethical mindsets.Overall, The Rock is an entertaining film that stands amongst Michael Bay's best work. With campy performances, a great villain, and an interesting story with great action and tension, The Rock simply falls apart by lacking pathos and a suitable ending."}, {"rating": "5", "text": "One of the better films from Michael Bay. At least its not completely soulless."}, {"rating": "4", "text": "Awesome cool action film great fun watch this a lot on DVD. But over done use of overly dramatic close ups but still a very watchable movie  Back when Nick Cage was stable and Sean Connery was capable,"}, {"rating": "7", "text": "“The Rock” is about a hostage situation on Alcatraz. An FBI agent specialized in chemical weapons (Nicolas Cage) and a former prisoner from the Rock (Sean Connery) has to venture into the infamous prison to stop San Fransisco to be destroyed…\r The core cast of “The Rock” consists of Ed Harris, Sean Connery and Nicolas Cage. Nicolas Cage is probably one of my favorite actors of all time. Yes, he has been in some, hrrm, questionable movies lately but he is a tremendous actor with a broad range. In “The Rock” we see the crazy, sany, Cage and the dramatic Cage as well. Sean Connery is always Sean Connery. He is just great in the film. Him and Cage’s chemistry is electric. Ed Harris is also solid, delivering a very human character in the form of the general keeping the hostages.\r “The Rock” is directed by Michael Bay, you know the guy who uses explosions, hot girls and American flags in every single movie he makes! His movies have been, hrmm, questionable for a while but this movie is very well directed. He brings out fun performances from all his actors and the tone fits the movie well. Since this is a Michael Bay movie it is sure to feature a lot of action and it does. “The Rock” has one of the most enjoyable car chases I’ve seen and the suspenseful shootouts are very well made.\r The soundtrack in “The Rock” is composed by none other than my favorite composer Hans Zimmer! His soundtracks are always fantastic and this one is no exception! Suspenseful, and reflecting the action, it is an awesome score.\r Fun performances, solid directing, an awesome score and a suspenseful plot makes “The Rock” a very fun movie!"}, {"rating": "8", "text": "Seems to be the only lovable Michael Bay film as this far. If he can actually work out and make movies that doesn't have to be the same old clichés every single time (I'm looking at your explosions, Michael Bay!), maybe this might be the first lovable film."}, {"rating": "7", "text": "A tense tale of rebel military officers who take over Alcatraz Island and threaten to unleash rockets on San Francisco unless their demands are met, this is a pure popcorn picture that benefits heavily from its trio of highly skilled, charismatic leading thesps, an unusual setting that provides plenty of visual stimulation, and a confrontational standoff that actually stems from a legitimately provocative premise.\r The yarn has its share of gaping holes and jaw-dropping improbabilities, but director Michael Bay sweeps them all aside with his never-take-a-breath pacing that refuses to allow more than a few minutes to go by without some new dilemma that only action, not talk, can resolve.\r Opening stretch is given over to the perpetrator of the dastardly scheme, Brig. Gen. Hummel (Ed Harris), a veteran of every U.S. military engagement since Vietnam. Considered a legend and a super-patriot, Hummel has overseen dozens of covert operations in which men were lost and has reached his limit with the government’s refusal to acknowledge these soldiers’ contributions or to provide their families with the benefits received by those of other combat victims. He is, without question, a rebel with a cause, and a plausible one at that.\r But his scheme is off the wall. With an elite unit of like-minded mutineers, Hummel absconds with a bunch of rockets loaded with deadly V.X. liquid gas, takes 81 hostages from a tour group on Alcatraz and promises to launch the missiles on the Bay area unless Washington forks over $ 100 million from a secret slush fund within 40 hours.\r Furthering the conspiratorial air of illegal activities and under-the-radar government shenanigans is the emergence of the only man who can save the day, John Patrick Mason (Sean Connery), a former SAS operative who was secretly imprisoned for making off with J. Edgar Hoover’s most closely held secrets.\r He also happens to know Alcatraz better than anyone, having successfully escaped from “the Rock” before being put away forever.\r Officially, Mason doesn’t exist, but he is nonetheless compelled to lead a team of Navy SEALs underwater to Alcatraz. His job is to guide them up through the bowels of the old fort, and FBI biochemical weapons expert Stanley Goodspeed (Nicolas Cage) will disarm the rockets.\r Hummel has other ideas, however, and his men ambush all the commandos except for Mason and Goodspeed, who must then try to finish the job by themselves before the Air Force is obliged to attack and kill all the hostages along with Hummel and his outfit.\r If you can’t tell it’s a Simpson-Bruckheimer picture within the first reel or two, the tip-off comes soon enough, when Mason, looking like John the Baptist and about as old, demands a suite at the Fairmont Hotel and a complete makeover (from an incredibly caricatured gay hairdresser) before cooperating with the authorities.\r Once he looks sufficiently dashing, he dangles the FBI chief, his old nemesis , over the edge of the hotel and leads Goodspeed on a gratuitously and disagreeably destructive car chase.\r He follows that with a brief chat with the daughter he never met, then dons his wetsuit in what is, for Connery, a little homage to the aquatic interlude of “Thunderball.”\r Bay, who debuted with the same producers’ “Bad Boys” last year, seems right at home with the macho posturing, tough talk and military logistics, as he delivers a hard-hitting, fast-moving thriller that, if anything, works overtime to make sure the audience will hang on every incident and maneuver.\r Script seems tailor-made to extract the particular charms of each of the three leading men. With occasional sly references to his British intelligence background and other Bondian traits, Connery trades winningly on his sophisticated, elegant sense of cool, and callowness of many of the youngsters around him is nicely shown up by his older-but-wiser finesse.\r Cage, in his first appearance since his Oscar win, proves equally engaging as a sort of goofy chemical-set geek who must rise to the occasion of proving he’s a man among the he-men elite.\r He makes Goodspeed’s early, bumbling attempts to act tough genuinely amusing and provides a necessary human connection in a world otherwise populated by ultra-pumped military types.\r Technically, pic is the most well-oiled of machines, with loads of rockets, heavy artillery, planes, choppers, cars, a Humvee and underwater gear providing plenty of toys for big boys to drool over. Lensing by John Schwartzman bathes certain key scenes in blues and blacks so that the blood doesn’t show too much. Richard Francis-Bruce’s editing never lets up, nor does the synthesizer-dominated score by Nick Glennie-Smith and Hans Zimmer."}, {"rating": "6", "text": "Great action movie that wears out its welcome a little.  Sean Connery is awesome, Harris starts wooden but warms up, and while I'm not a fan of Nicholas Cage, he is good here. Michael Bay's directing is slick and keeps things moving, and the music score, while maybe not quite as good as the soundtrack for the first Bad Boys, has some great tunes and impact. The story is maybe not the greatest, but all the actors commit (especially William Forsythe) and as long as you don't stop to think about it, it's fine.\r All of the above starts to blur together after the fifth (or sixth, or seventh) big action set-piece, though. A great movie to watch for kicks, or to scratch the action movie itch.\r Bonus points for The Rock not being filled with CGI garbage (CGI was only just getting started at the time it was made)."}, {"rating": "9", "text": "La mejor película de acción que vi en mi vida, si, hay mejores, pero esta me gusto porque el malo no es tan malo, porque Sean Connery se hace un homenaje a si mismo y a Bond y es muy bueno, porque es el mejor Nicholas Cage, porque la acción esta muy bien planteada y porque los malos son también estadounidenses. La banda sonora es excelente. La tensión esta muy lograda y como hay directores bueno que tienen siempre una mala película esta es la viceversa: Michael Bay tiene una buena película y es esta.  ."}, {"rating": "8", "text": "Gains relevance when Connery makes his way trough the movieA classic that does not get worse when is watched for the second time    ....... .n....."}, {"rating": "8", "text": "Michael Bay's blockbuster action epic began here. Even though Bad Boys came out a year before and was moderately successful. This was the movie that really made his career and even watching over 20 years later it's easy to see why. The movie is fantastically entertaining. Some military dudes that were wronged by the government take some hostages at Alcatraz and demand a whole lot of money from the government for the families of their fallen comrades. Things escalate when they threaten to release a deadly chemical. So they call up scientist fred rookie Nicholas Cage and pair him up with a disheveled but bad ass Sean Connery as the only man whose successfully escaped the rock. The action is brilliant and in true Michael Bay fashion it can be a bit silly at times but overly entertaining. Funny, action packed and edge of your seat with a surprising amount of character depth. The movie also stars Ed Harris, Tony Todd, Claire Forlani, Michael Biehn and David Morse.Budget: $75mDomestic Box Office: $134mWorldwide Box Office: $335m4.25/5"}, {"rating": "8", "text": "This is one of the only Michael Bay movies I consider good. It follows an old action movie formula - a charismatic protagonist(Connery), a menacing villain(Harris), a comic relief(Cage), and a ridiculous plot. Everyone is decent in their roles, the action is good, and the directing is tense."}, {"rating": "7", "text": "In this film, San Francisco will be threatened by a general with an important arsenal of chemical weapons hidden in the old prison of Alcatraz. Directed by Michael Bay and scripted by David Weisberg, it has the participation of Sean Connery and Nicolas Cage.Alcatraz is one of the most famous and feared prisons in the world. During decades of work, virtually no one could escape from there and tell the story. Now a museum, still retains its charm, and that was wisely used in this film. The wards of the old prison gave excellent scenarios for the film, filling it with a rusty and decadent beauty. The cast is good and the participation of Sean Connery and Ed Harris (the villain) stands out. Nicolas Cage has also played well, despite being erased by the two older actors. Nevertheless, this film is not usually considered one of the best in Connery's career (always pursued by Bond in people's mind). Ed Harris was surprisingly positive and managed to humanize his character. We see that its a man with feelings, acting in accordance with his conscience, despite the ends don't justify his means. The script is interesting, covering a topic rarely seen in action movies: chemical/biological terrorism. It contains several plot twist of great quality, becoming more unpredictable in more dramatic moments. The end is quite good.The film has some problems when using some very common action clichés such as putting Mason as a \"lone hero\" or that mediocre car chase full of accidents, too sensational to be credible. There are movies where the use of these clichés is good because it manage, in some way, to innovate or to look different than we've seen. But this was not achieved here."}, {"rating": "5", "text": "This ordinary action flick that at times is unintentionally funny is probably Michael Bay's best work. That's saying something."}, {"rating": "10", "text": "Audio/visual unsynchronised (At 1h 27 mins) While Agent Goodspeed is describing the horrible effects of VX gas, the part where he says \"it melts your skin off\" does not match his mouth movements, and sounds different than the rest of the audio (since real VX gas does not melt skin (see above), it was probably added to make VX gas seem scarier to the audience)."}, {"rating": "10", "text": "Absurdly, 1996 film critics also thought 'Independence Day' was only *okay*, which like this film, is masterfully paced, full of charisma, fun characters, suspense, humour, excitement and even touching moments (\"Jade, I'm not an evil man. If you believe that, it's a start!\") and has an amazing soundtrack."}, {"rating": "9", "text": "An absolute classicWhat can I say other than Connery at his savviest as usual? It's good to see Hollywood remembers the best. It's also good to see an American film portray us little Brits in such high regard.When else would you see a 60+ year old retired SAS agent who's been wrongfully banged up for 30 years and kept away from his daughter, break back into Alcatraz (after successfully breaking out all those years ago), take out an entire SEAL team almost empty handed, save 81 hostages held at gun point and a city of 5 Million held ransom with 15 deadly poisonous VX gas rockets?? Generally excellent acting by Ed Harris as you could expect and an almost convincing performance by Nicolas Cage....and thats half of the film 's entertainment value."}], "recommendations": ["tomorrow_never_dies", "lethal_weapon_3", "mission_impossible_ghost_protocol", "lethal_weapon", "die_hard", "lethal_weapon_2", "air_force_one", "the_last_stand", "heat", "speed", "true_lies", "mission_impossible_rogue_nation", "angel_has_fallen", "broken_arrow", "lethal_weapon_4", "shooter", "enemy_of_the_state", "demolition_man", "killer_elite", "gangster_squad", "the_incredible_hulk", "iron_man", "homefront", "armageddon", "the_world_is_not_enough"]}