{
  "id": 4026,
  "title": "The Road",
  "starring": [
    "Viggo Mortensen",
    "Kodi Smit-McPhee"
  ],
  "runtime": 111,
  "genre": [
    "Adventure",
    "Drama"
  ],
  "description": "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind and water. It is cold enough to crack stones, and, when the snow falls it is gray. The sky is dark. Their destination is the warmer south, although they don't know what, if anything, awaits them there.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qLaXnLzqleBWQtjvZ6JGVSaKoC3.jpg",
  "categories": {
    "plot": 7.027027027027027,
    "acting": 7.9,
    "ending": 5.583333333333333,
    "soundtrack": 7.0,
    "cinematography": 4.25,
    "familyFriendly": 3.0,
    "funny": 9.5,
    "action": 8.222222222222221
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Well crafted film overall but a bit choppy at certain points and some unexplainable character shifts. Viggo Mortensens acting itself was great but the film failed to properly demonstrate his progression. The sons acting was a bit stale but Robert Duvall stole much of the show in a very well done scene. Weak, depressing themes stressed too much over actual substance."
    },
    {
      "rating": "9",
      "text": "The road is not just an ordinary movie, it not about action or anything it's about something deeper, the ambiance created is insane from time to time. The music provided also suited the movie well and served it's purpose well. The story was sometimes really dark but in a really strong way. It is a movie which will not win prizes for the special effects or anything but it really comes close to you, makes you think. This may movie isn't just a movie sometimes is just an artwork."
    },
    {
      "rating": "7",
      "text": "Loving the book was easy -it was poetic, stark, brutal and uncomprimising. Thinking of yourself without heat or electricity for 2 weeks can give you just a taste of what it would be to survive in 60% of North America in the face of an energy catastrophe, let alone of a nuclear scale or massive environmental rupture. But what did this movie lack that reduced empathy or trivialized the book? What could have made it the celluloid equal? The CGI was adequate and not over-bearing. The score was bleak in all the places. The casting of Theron and the boy was inspired as they literally look to be of the same DNA - that was uncanny. The characters that were scattered through out the movie were barely recognizable, but were. And I never forgot (nor was allowed to forget), for one instant, that they loved the book too and fought with their agents for those parts. I'll tell you what I think it was. The Road was empty. As a book you never saw the face of the man or the boy: they were as elemental and tortured as their environs. Not that the casting wasn't inspired but I'll be damned if I want the Returning Lord of All Rings as my 'Man', or a 'monster' or moll such as Charlize as the Woman. This is one movie that required unknown actors to lend the vehicle it's providence and impact, randomness and believability. It was that simple. The Road's universal message of paternal love is washed away and marred by Hollywood and it's agents. Viggo and Guy and Duvall and Theron were all amazing, but that is beside the point. In order to display the true and majestic truths and magnitude of the loss portayed in this adaptation, these had to be players you could not associate with any other plot. It's that simple. Not that Viggo didn't method un-wash, and unshave himself or didn't stink like a bear but this movie needed a... unknown face to portray a fearsome and unknown future."
    },
    {
      "rating": "6",
      "text": "If you were a fan of the book then you'll enjoy the move, everyone else should proceed with caution."
    },
    {
      "rating": "6",
      "text": "Bleak, gritty, discouraging to be sure, but mostly just slow and dull."
    },
    {
      "rating": "6",
      "text": "A dark and depressing drama that treads into the horror genre. Bleak doesn't begin to describe the lifeless landscape in which survivors scratch and claw the depths of their humanity. Absent any glimmer of hope -- even the ocean has turned gray -- life is reduced to a masochistic exercise. Too dark, even for this dark-movie lover."
    },
    {
      "rating": "8",
      "text": "Finally a movie that presents a post-apocalyptic story in a dark, realistic manner. The actors play very well, while the story is very well described and interesting. Good movie."
    },
    {
      "rating": "9",
      "text": "While the movie adaption does fall short of doing the novel complete justice, it is a still powerful, heartbreaking film for the ages."
    },
    {
      "rating": "10",
      "text": "Emotionally devastating and utterly, crushingly, eye-wateringly bleak. Do not watch this on a Sunday night before going to work. I can't say I enjoyed The Road but I admired the craft of enormously."
    },
    {
      "rating": "9",
      "text": "\"The Road\" is a astonishingly masterful film that greatly succeeds re-imaging the original book. The movie is filled with unexpected tension and profound quietness most films fail to create. It also presents a well made, re-designed future apocalypse that looks realistic. Possibly in this case one of the most thought-provoking films of the year."
    },
    {
      "rating": "5",
      "text": "I loved the book but was disappointed by this adaptation. The performances were good (OK, Viggo and Duvall were both great) but the music and the CGI skies grated on me. It's not that it's too bleak, it's that it wasn't bleak enough. Too many flashbacks to Charlize that just felt focus grouped. The book is uncompromising, but the film has been compromised."
    },
    {
      "rating": "3",
      "text": "Well acted and well filmed, but really rather monotonous and dull when it boils down. And the ending - very poor. Too long with too little going on."
    },
    {
      "rating": "0",
      "text": "Utterly unbearable and not because it's grim. It pastes together every post-apocalyptic cliche into a directionless mishmash. The dialogue is worn and tired when it isn't downright stupid."
    },
    {
      "rating": "5",
      "text": "Rushed to the theaters to capitalize on the success of \"no country for old men\" despite the lack of a worthy director or screenwriter. redefines terrible child acting. amazing cinematography that ultimately doesn't save this soulless disappointment."
    },
    {
      "rating": "5",
      "text": "A long bore with some plot holes that didn't explain some of the action of the father, a man who'd been careful not to put himself and the son in danger. The production design was good, the acting good to great, but the story is just not quite there. When the movie can be summed up by Robert Duvall in his 5 minutes scene of remembrance, it failed its intention."
    },
    {
      "rating": "2",
      "text": "Oh my God what a lousy, boring movie! You don't fool me by trying to be artistic or artsy farty! This is one sleeping pill of a movie. And that lame kid! How many times can you sa Papa! before the audience puke? Bring back the good old days when postapocalypse movies stood for Mohawks, sawed off shot guns and naked barbarian babes."
    },
    {
      "rating": "1",
      "text": "This is a movie that pretentious people will pretend to enjoy in order to seem artistically savvy. It's really bleak visually and thematically in a tedious way and leaves you wondering why anyone would want to make a movie this depressing. And I enjoyed Precious."
    },
    {
      "rating": "0",
      "text": "I expected it to be half-decent judging by these reviews, yet I was extremely disappointed. The entire movie was just a mesh of plain, thoughtless dialogue with little explanation of what the driving events were."
    },
    {
      "rating": "2",
      "text": "This movie made me suffer, a lot!  If this is what the post-apocalyptic world looks like then release me out of my misery a.s.a.p. I couldn't even survive the few hours this movie lasted, let alone a lifetime. This was pure torture, it gave you glimpses and teases of something was going to happen but it never did. The worst part is everything looks and sounds so promising, you actually want to give this movie a chance. You want it to be good and give you that satisfaction. But it doesn't. This movie is the ultimate teaser!"
    },
    {
      "rating": "3",
      "text": "A painfully boring and shallow view of the apocalypse. The plot to this film literally goes nothing by the end of the film nothing is accomplished. It just ends. Viggo does the best he can and the cinematography is top notch. But that doesn't change the fact that this movie is overly bleak(not one single questions is answered) and that the story goes nowhere. This is truly painfull to watch."
    },
    {
      "rating": "4",
      "text": "Dumb movie, the kid is gay and i wanted all along to choke him with my bare hands, he wouldn't survive 5 min without hes father and yet he wants to spread love in a cannibalistic post apocalyptic world, of course at the end of the movie the producers conveniently avoid putting him in harms way situation by making him meet a good guy, but we all know that such gay and useless prick will end up raped and eaten in a true post apocalyptic world"
    },
    {
      "rating": "0",
      "text": "I never read the book (even though I knew it was adapted before hand.) I actually was excited to see this one, boy was I disappointed. No wonder it only stayed in my local theatre for one week. It's a whole lot of boring. Don't get me wrong I like a psychological movie but this movie didn't really have a point. In any good story you need to create enough tension for you to at least care about what happens to the main characters. This is the first movie (other than the Twilight movies) I literally just turned off and say I'll finish this later. I don't know how this movie ends but from what I watch I got bored just waiting for something to happen. I only got as far as when Viggo's character meets Duvall's. And the grainy cinematography (while I understand why it was chosen, it does fit the film's subject matter) just made the film unwatchable on my wide-screen HDTV."
    },
    {
      "rating": "9",
      "text": "truly interesting and memorable movie. Couldn't take my eyes off it from start to finish."
    },
    {
      "rating": "8",
      "text": "For Christs sake! How many movies are there about the apocalypse? I do know that not very many of them have good stories, or lessons to the story. 'The Road' has both. 'The Road' is also a dark and highly intense film.It seems like the dark and intensity increases by the minute. It is unbelievably scary and a breathtaking movie. It also shows a good lesson to parents that they need to teach their children to take care of themselves, because their parents are't going to be around forever. It's really sad when it gets close to the end of the movie. Almost got me a bit teary eyed. Even though this is no family movie, I think families need to see this. It is a bit extreme, I will say that. But like I said, it has a good morel to this great story."
    },
    {
      "rating": "10",
      "text": "I agree with Q, loved the book and the film was exactly what I'd pictured it to be. I thought it captured the essence of the story perfectly. Amazing performances too, from Mortenson and Duvall, but especially from the boy, who was an absolute revelation."
    },
    {
      "rating": "10",
      "text": "Awesome book and awesome movie. Not a feel good movie as it is very dark."
    },
    {
      "rating": "8",
      "text": "Thank god for a quiet apocalyptic movie that DOESN'T have zombies in! Thoroughly convincing world created, focusing on the purpose of survival, not blockbuster destruction or exaggerated horror. It's enough to allude to the grimness of the vision without rubbing our noses in it. For those that want gratuitous horror, look elsewhere. Good playing by Viggo Mortensen and Smit-McPhee."
    },
    {
      "rating": "9",
      "text": "This is not for the Avatar crowd. It's bleak but intense and not for everyone. Loved it."
    },
    {
      "rating": "9",
      "text": "Left me thinking about it for weeks. That is the mark of an impressive movie!"
    },
    {
      "rating": "8",
      "text": "Yes it did lack a little plot development, as in nothing much happens but I could feel the father and sons struggle throughout and the end was genuinely sad."
    },
    {
      "rating": "10",
      "text": "The Road: A tale of a father and a son making their way across a trechorous wasteland, heading south, hoping to find others whilst being cautious of those around them. First things first: This is a grim film. You can see that just by looking at the surroundings. Corpses swinging from nooses, trees void of life, crashing to the ground one by one, snow stained with blood, water dirty as hell. It is quite the spectacle, yet for something so horrific looking, it is quite beautiful. Striking, how the director has perfectly captured the film's tone. It isn't just the surroundings that are bleak, the characters successfully empthasise this as well. Groups, in order to survive, slautering innocent people. Theres a scene in the film of a woman and her child being chased by a large group of these savages, where the surroundings are skulls displayed on pikes and the aformentioned blood stained snow. Food is scarce in this post-apocalyptic world, so one group keep people chained in a basement, to bring them out and kill them one by one, for sustenence. The father knows that the world is a bleak place, and his one driving point is his son. He teaches his son how to shoot himself in the head, if the time ever comes. He keeps two bullets in a gun specifically for them two, if the time ever comes. He very nearly shoots his son, so that a savage group do not take him to be chained and later eaten. The characters have become paranoid in this world, with the father not trusting any one in case they could be a cannibal, not trusting Ely, refusing to let him come with them for their food wouldn't last long, and he would slow them down. At one point, a woman shoots the man with an arrow and he kills her husband with a flare gun, because they both believe the other was following them. This shows how paranoia has set into these characters lives, how they cannot trust anyone, because it could spell for their end. Kudos to the actors of this piece. They all perform their roles perfectly, from Charlize Therons suicidal mother, not wanting to live in such a terrible world, to The Thief, whom instantly regrets robbing the main characters. Viggo Mortenson and Kodi Smith-Mcfee perfectly play their roles as father and son. You truly believe their roles, and their character relationship. The man's death, whilst his son is curled upto him, is a scene which, i'm not ashamed to say, brought a tear to my eyes. The ending of this film really shows the boys trusting ways paying off, as he now travels with a family, across the trechorous landscape. Conclusion: Quite a bleak film, with many grim moments, but wonderful character interaction makes it all worth while"
    },
    {
      "rating": "8",
      "text": "Slow and gray, this post-apocalyptic film isn't likely to be everyone's cup of tea. The emphasis isn't so much on the survival aspects these characters must go through, but more on the emotional bond between father and son. Don't come into this expecting a lot of action. The movie barely has any at all.\r It's a touching and dark tale. The son really is the only thing that keeps the man going, and thanks to the strong acting and direction the love the father has for his son is completely real here. It adds a sense of beauty to the bleakness of their world. It's emotionally affecting to see how the boy acts as the tether that keeps the man's humanity.\r It's emotion over action here. Lot's of dialog and reflecting are the core of the experience. There are a few scenes where the tension is ramped up to add a little pulse to the affair, but nothing really happens. It's clear that humanity has gone to crap and other people are a danger to the characters. There are no real moments of conflict though. The majority of the movie is rather silent.\r That's not really a bad thing. I like the emphasis on emotion over action. The way the apocalypse is used as a tool to show the hopelessness of the father and son's situation, rather than just how screwed up humanity can get. It's a very personal tale that leads to a strong, powerful drama that's admittedly slow on pace and many thrills. There were moments where I was left wishing something a little more exciting would happen, but for the most part I really enjoyed this different angle.\r It still includes the elements of violence and survival that one would come to expect from a post-apocalyptic setting. Those elements just aren't the focus. It's all about the love a father does (or should) have for his son. It grabs at your heart and shows the cruelty of the end of the world in a different way than other films of this ilk. It has it's boring moments, but I was never once not invested in the characters fates. It's grim and emotional in almost all of the right ways.\r 8.6/10"
    },
    {
      "rating": "0",
      "text": "Utterly depressive. I cannot understand all those positive reviews. If I had done simply nothing for the two hours. I would have least not feel that kind of exhausted!"
    },
    {
      "rating": "5",
      "text": "Bare pass for this movie. Very depressing fare without even the smallest glimmer of hope basically. Good strong acting from the lead didm't raise it much due to the overwhelming weight of the script. Absolutely leaden in places. I don't think there is another film out there that is darker in terms of theme. I don't recommend this movie much. Probably has big fans in people who think that half decent SF like Aeon Flux were awful. Even if AF was based on a cmic it was still better than this black napkin of a movie."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I've ever seen.  Both boring and depressing.  Not much of a plot line.  If you have a problem with depression don't watch this movie or you'll probably kill yourself.  How did Robert Duvall and Viggo Mortensen end up in this stinker?  It's just awful."
    },
    {
      "rating": "9",
      "text": "A truly powerful and emotional film. Bleak, depressing (in a good way) and realistic take on the post apocalyptic genre. With next to no real action in the film, it relies heavily on the performances and thankfully all of the main actors do an incredible job of bringing the world to life. Some scenes could have been longer and explored in more depth but given the amazing source material, there is not much that can be done. Overall an thought provoking and emotional experience that shouldn't be missed."
    },
    {
      "rating": "9",
      "text": "I could not stop thinking about this powerful movie the day after I watched it. If I imagined how a post apocalyptic earth would look, and how one would have to survive, then the movie portrayed it brillantly. Probably not one to watch when you are feeling down as it is very depressing and unforgiving, yet the small snippets of happiness you see throughout (though there are not many) kind of help keep the faith in man kind's strong desire for survival and hope."
    },
    {
      "rating": "9",
      "text": "The world has been destroyed by natural causes, and the few survivors that are left are mostly insane caravans of cannibals. Sound fun? Maybe for a video game, but the way The Road depicts it sure doesn't look like fun. This movie is based on the novel of the same name by Cormac McCarthy, which I have never read, but if the book is as good as the movie, I'm down for a good reading period. The story follows two main characters as they try to survive in the treacherous wasteland, neither of which is ever named. They are just called \"Papa\" and \"Son\". The mother/wife is only shown in series of flashbacks from before the natural disasters and at the very beginning. \"Papa\" is played by Viggo Mortensen, and it is an incredible performance. Mortensen does an amazing job creating a father that will do anything to keep his son safe. He has to be tough on his son to teach him the harsh realities of this dangerous world. At the same time as this he deals with the loss of his wife. I couldn't imagine a better performance. The kid is acted by Kodi Smit-McPhee, who also does an outstanding job. A very interesting side character also comes in part way through the movie who is acted by Robert Duvall. The story is all together dark and dreary. This movie does not try and make the end of the world look all cool by using a sepia lens filter or slow motion killing. It shows a depressing, scary, and perilous world. A terrifyingly real world. There are really no laughing moments in this movie. The faint of heart should stray away from this road, because they will find nothing to smile about until the end, and that only if the viewer looks hard enough. I'm not going ruin the end for you guys, but I will tell you that it is beautiful. The Road is a tough film, but through all of the cannibalism and death, there is still a small glimmer of optimism seen through the life of a child and through the fact that even in times of severe suffering and distress, all hope is never lost."
    },
    {
      "rating": "6",
      "text": "I agree with Hoberman that this was essentially a pale imitation of Children of Men, which was a far superior film in my opinion. I will give it points though for the realistic landscape depicted."
    },
    {
      "rating": "9",
      "text": "Bleak sad and powerful brilliant acting really enjoyed it i really don't understand some of poor reviews this film has received."
    },
    {
      "rating": "7",
      "text": "Some of the shots, those post-apocalyptic panoramas that the man and boy traverse, in my estimation, beg for a longer take. (A European filmmaking sensibility is needed to do the Cormac McCarthy novel justice.) Let the images of the dead physical world linger on the screen; let the futility of their journey leave an imprint in the moviegoer's mind. Zombies should be roaming through these landscapes, not a father and his son. The woman(Charlize Theron) knew best; the woman's wish that the boy follow her in suicide was not a selfish act. All the wildlife and vegetation are gone. She could take a hint. The father couldn't, so he subjects his son to hell on earth. To the detriment of \"The Road\", hell on earth is constantly interrupted by flashbacks, a storytelling device that, in this case, gives the moviegoer a reprieve from having to deal with the sobering present. The filmmaker should trust its audience to handle tough material, like Michael Haneke did with the much superior \"Le temps du loup\". In dramatizing the backstory, \"The Road\" becomes a sentimental road, as it overstates the obvious: the boy misses his mother, and likewise, the father misses his wife. The film is at its best when the moviegoer can see the absurdity that goes along with living in a world, literally, where there's no future. The boy can't be a doctor, or a lawyer, but he can still be a \"good guy\", in which the father teaches him to just say no to cannibalism."
    },
    {
      "rating": "10",
      "text": "This movie is bleak and the story goes nowhere? An apocalypse movie with no happy ending's certainly a different perspective. Original, haunting, beautiful and provocative. Loved it."
    },
    {
      "rating": "9",
      "text": "Was almost exactly as I envisioned it when I read the book. Very well done - terrific acting by all involved and a superb, resonating score In the book, I felt there were too many instances where the father and son were eating food, which would occur less often in a post apocalyptic wasteland. Then again, they may not be alive to make the story, but the movie emphasized starvation, so in that respect it was an improvement. A couple scenes of the murderous chaos following the depletion of food supplies, described briefly by Macarthy, would have been nice, and I agree with others who desired some lingering panoramic shots of devastation, but these quibbles are a trifle. Not much more can be asked of a screen adaptation from an awe inspiring novel - very moving. The crazy thing is that the possibility of Macarthy's world becoming a reality is not beyond comprehension."
    },
    {
      "rating": "10",
      "text": "This movie is amazing. It's sad, thrilling and it was a great plot! This is a must see."
    },
    {
      "rating": "10",
      "text": "I cannot believe some of the reviews. This movie was one of the most powerful things I have ever seen. The book is equally astonishing. They compliment one another adequately. I simply loved it. Bravo to everyone involved."
    },
    {
      "rating": "9",
      "text": "Fantastic film. I was awestruck by this beautiful adaptation of one of my favorite book of all time. Viggo Mortensen and Guy Pearce truly brought the pages to life."
    },
    {
      "rating": "10",
      "text": "While I will admit that this flick is not for everyone, I don't see how a better adaptation of the book could be made. It's a masterpiece of sadness. Perhaps the most terrifying moments in the film are the beautiful flashbacks ... glimpses of a paradise that is gone forever - if we had only realized it then. Very very powerful."
    },
    {
      "rating": "7",
      "text": "This is a decent adaptation of the novel. On the surface, the music often overpowers rather than underscores and there are too many 'cameo' performances casted in a story that explicitly seeks to remove almost all familiarity of the known world from the audience. Viggo Mortensen offers great work in this film; Viggo's portrayal of a man who has witnessed a world lost and who struggles to protect and equip his son against the horrors that now threaten the new one provides equal measure intensity and subtlety. Thankfully, most of the horrific examples of desperation in McCarthy's novel are intact, but the sense of the passage of time between them is condensed to the point where they don't really exist. This is, understandably, an obstacle in the film medium. However, a story that features \"starvation\" as a strong thematic element requires attention to time and pacing. The story is simply better suited to the pacing afforded in novel form."
    },
    {
      "rating": "10",
      "text": "Captures the tension and conflict of the book perfectly. Incredibly relatable, sad, inspiring, and terrifying all at the same time. I don't understand what all the criticism is about."
    },
    {
      "rating": "9",
      "text": "This film hit a perfect emotional point for me. I haven't yet read the book and therefore am not biased from that foundation, but found the portrayals of love, kindness and relationships to be beautiful. In addition, the cinematography was superb. The small nods to materialism in our society were generally done well too. The two key reasons I did not give this film a 10 were the ridiculous product placements during the scene in the shelter (I refuse to believe that such a thoughtfully stocked cellar would contain a 99c bag of Cheetos and bottles of Vitamin Water) as well as the ending, which had a little too much cheese for my liking (perhaps the Cheetos were resurfacing)."
    }
  ],
  "recommendations": [
    "a_monster_calls",
    "into_the_wild",
    "the_book_thief",
    "babel",
    "the_grey",
    "children_of_men",
    "the_florida_project",
    "no_country_for_old_men",
    "machine_gun_preacher",
    "greenland",
    "her",
    "a_ghost_story",
    "the_hunt",
    "i_kill_giants",
    "sin_nombre",
    "incendies",
    "crash",
    "the_boy_who_harnessed_the_wind",
    "the_good_shepherd",
    "donnie_darko",
    "alpha",
    "first_man",
    "the_killing_of_a_sacred_deer",
    "melancholia",
    "the_giver"
  ]
}