{"id": 340, "title": "The Purge: Election Year", "starring": ["Elizabeth Mitchell", "Frank Grillo"], "runtime": 105, "genre": ["Action", "Horror", "Thriller"], "description": "Two years after choosing not to kill the man who killed his son, former police sergeant Leo Barnes has become head of security for Senator Charlene Roan, the front runner in the next Presidential election due to her vow to eliminate the Purge. On the night of what should be the final Purge, a betrayal from within the government forces Barnes and Roan out onto the street where they must fight to survive the night.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/dx5pKJpGbJc9xrFQ8UR1XrrqmPj.jpg", "categories": {"plot": 5.897435897435898, "acting": 5.3076923076923075, "ending": 5.666666666666667, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 1.5, "action": 4.4375}, "reviews": [{"rating": "4", "text": "I am sorry guys, its a disappointment for me. I loved the previous two installments but there is something missing here in Election year. May be the story line is a bit rusty. But I have to say there were some shots which will definitely give you chills. Elizabeth Mitchell (Charlie) cannot act for sure, she was a huge turn off.In short, its a good one time watch."}, {"rating": "3", "text": "Easily the worst of the Purge films. This feels more like a cheap cash-grab that banked on election year hysteria than an actual film. The dialogue is cringeworthy. The characters are bland and forgettable. It markets completely to the left, and even I as a liberal was turned off by it. Who greenlit this unnecessary installment?"}, {"rating": "3", "text": "Aside from the two main characters, the acting is mostly terrible. With that we have a terrible script, and a plot that is not one bit cohesive."}, {"rating": "1", "text": "A terribly written movie filled with political/social propaganda. Off the top of my head, this movie is implying that:-Old rich white people want to kill/oppress blacks and other minorities-Armed white men (probably implying the police) are literally neo-Nazis and deserve to be killed by black gang members-Black/mexican/other minority groups are oppressed and running some freedom fighting insurgency-Being a gang member is ok (Joe used to be a Crip)"}, {"rating": "1", "text": "These directors need to look up the definition of subtlety. They tried to make many political statements, which is a good thing, but these directors aren't skilled enough to do it. The black jokes were funny at the beginning, but they double down on that aspect to the point of being ridiculous. In fact, that last statement describes this entire movie. It's sad that an interesting concept, that is the purge, was handled by such inapt directors. This is an alcohol required movie. If you're not a drinker, skip this garbage."}, {"rating": "0", "text": "The left sure knows how to project their violent tendencies. Political movie intended to trick voters into electing an oppressive Democrat government. Tell me again who is it that riots when an election does not go their way? Hint: It's not the conservatives."}, {"rating": "7", "text": "UK Review:\r I'm a serious Horror fan, with a constant desire for gore and being left numb from shock, however, the genre rarely delivers.\r Purge Election Year has a few moments of violence on par with the previous instalments, and having recently enjoyed \"Green Room\" in the same week, it felt a little off the rawness and brutality that came with that.  That said, this is a return to form for Purge movies.  I loved the set up in the original film, it was a dark look at what could exist and reflected an elitism that we see everywhere in society today.\r After a rocky and somewhat race-based sequal, the 3rd film returns with a set-up of a presidential candidate wanting to see an end to the annual purge, and then trying to survive the night after the 'establishment' change the rules and try to have her assassinated.  The characters feel like they represent the #blacklivesmatter movement, and these are portrayed well I feel, completely aware that the system is rigged against them, not in a whoa-is-me way, but literally they are stitched up.  The female candidate as the lead is acted very well, and I really enjoyed her righteousness, right up until the end - no spoiler - but it hit me that this film is a pro-Hilary piece.  Rebublicans are almost outright Klan members, and it works much better as a story than the second film.\r All in all, it's a hoot.  An hour in I was hooked and it was a great thriller, maybe not so much a Horror film, but it was worth the watch"}, {"rating": "2", "text": "The third installment to a series that was never that good but made too much money on how underdeveloped the movies are. The movie is too over the top, cliched, dramatic in certain points and it thinks it's so funny but it's not. The movie had some nice action scenes and cool uniforms that the Purger's had. But yet again the movie does not live up to its ambitious themes and ideas."}, {"rating": "7", "text": "This Year, The Elections Will Purge Our Deepest Fears\r DeMonaco evolves its subversive franchise satisfactorily, the third installment of \"The Purge\" is concentrated in please the bloody craving of the public and the delight critical about socio-economic problems of movie critics, as well, it takes advantage of the political event shakes to the country, currently, and makes use of the popular July 4th for its pre-release.\r Despite carry one theme in common, James DeMonaco has emphasized to give own personality to every film and apparently, \"Election Year\" goes beyond in a nuanced plot and an absorbent atmosphere; It integrates new ideas such as criminal tourism, lack of legal protection to governmental personalities and, of course, the emphasis on the political and human atmosphere.\r Frank Grillo resumes his character from \"Anarchy\", the former sergeant, Leo Barnes, who leads the Special Security Group of the controversial presidential candidate, Charlie Roan (Elizabeth Mitchell), who proclaims and longs for the permanent suspension of the annual purge. \"No one else deserves to die!\", many people (usually, belonging to the less-favoured social classes - Florida -) defend and support her proposals, on the other hand, her adversaries plan to eliminate the root of the problem. They conceive a dystopian world embellished with bloody sequences of murder, nevertheless, this utopia is really close to stop being so. Roan obeys its principles and determines to spend the night of the extermination like everyone, inside of her own house, nevertheless, the protection is betrayed, so Barnes and Roan will be faced to save their lives, walking within a hell of flesh-and-blood. The Mission of Barnes: keeping alive to the senator, at the cost of his own life; The Mission of Roan: Playing clean and win the elections without the dementia from her competitors. After the 'home invasion', the film runs with intimidating and twisted sequences such as diabolical dances around hanged men in a lugubrious tree or families tied up to a car and cruelly killed with flails, a 'survival' better designed than in the previous installments.\r Annually, on March 21–22, 7 p.m. – 7 a.m., any crime is legal, all health care center public is suspended until dawn. The election year brings along with the dismantling of the true aim of the apparent catharsis, liquidate to the poorest people (among them, some main actors) and absorb the capital of health insurance, pensions and others of the deceased people, illegally, enriching to  \"The New Founding Fathers of America\". The government manipulates the minds of the weak and they camouflaged their dishonest intentions as a need to cleanse their souls, Did their souls clean with violence?\r It visually striking, \"Election Year\" permeates visual hyperrealism, accompanied by a not-so-ingenious narrative; its potential to create the vulnerability effect that the senator feels and distressing atmospheres is provides by bright neon lights, masks with important personalities in the North American country, bizarre costumes, such as the wedding dress accompanied by the mask with saw-tooth, where reads \"KISS ME\", a brown bear disguise and even Abraham Lincoln's monument bathed in blood and burning in flames. Executioners celebrating the purification childishly, a muscular man soaked in blood, a extravagant decapitation through the medieval guillotine (excellent handling of lights), a parade of iconoclastic masks, gangs and redeemers theatrically represent a modest, but somewhat foolish treatment to such storyline.\r For the third time, DeMonaco raises the success flag, with a rooted manichaeism and representations of foreign ethnic groups, \"Election Year\" explores new and dangerous areas and goes beyond than its predecessors, with marked current themes and strenuous visuals,however, it is the script, which reaches the risible, even evident in the so unusual plot. As horror movie is predictable and regularly is transform in a Eli Roth's gore, nevertheless, it works pretty well like a sociopolitical thriller film, corresponding with these dates perfectly (election period, Hollywood has it all carefully timed). This year, \"The New Founding Fathers of America\" are waiting for us, though, apparently, we will have to purge with fervent desires in this final year. May God bless you!"}, {"rating": "7", "text": "12 horas para sobrevivir continúa con el mismo estilo de su antecesora, demasiado dramática. En mi opinión, las tomas son muy malas, la cámara se mueve de una manera sin sentido y confunde mucho. Aunque el diseño de producción es bueno, las máscaras están muy bien diseñadas, así como el entorno en general. La película es entretenida, recomendable para pasar el rato.\r The purge continues with the same style of his antecesor, too much dramatic. In my opinion, the takes are very bad, the camera moves on a non-sense way and confuses. Though the production design is good, the masks are very cool, like the enviroment in general. The movie is funny, recomendable to pass time with fellas."}, {"rating": "5", "text": "The Purge: Election Year boasts an astounding feat: a second sequel that is much better than the original movie. However, it doesn't mean it excuses itself from the seal of mediocrity.\rWhile it's conflict is better developed, it's not as deep or as exploratory as it thinks it is. Furthermore, the characters have an okay motivation and are mainly one-dimensional and the plot, though engaging, takes quite a while before it starts kicking into full gear. Its script is just okay as well despite offering a few good dialogue exchanges.\rIt may have great thriller elements and promising potential, but Election Year mostly underutilizes those and doesn't work as well as it wants to. Therefore, it's just okay at best, nothing better, but nothing worse."}, {"rating": "3", "text": "The worst Purge yet. Went completely off the rails and made a certain group of voters warm and fuzzy inside at the end. Another film this year that distracts with worthless political points."}, {"rating": "5", "text": "Even though the idea is a pretty good criticism of capitalism, it went to a completely different point by using the psycho religious fanatics. The characters were also poorly written, nothing was new or impressive including the ending."}, {"rating": "2", "text": "WORST SCREENPLAY 2016! I don't often cringe at bad dialogue but I did it a few times here. This movie is the typical bad horror movie where the victims make bad decisions at every turn. And for a movie that appears to be politically incorrect, it uses just about every politically correct cliche in the book. By the end, I just didn't care about anyone."}, {"rating": "2", "text": "The Purge: Election Year exceeded my expectations of being a bad film. It shows inadequate characterization and character development, a dull-witted and misleading storyline, and unnecessary amount of excessive violence that gets you cringing in your stomach throughout it's time span. This was an awful conclusion to an already dull trilogy and I am happy to see it let go. Hopefully we won't get horror films -- or even thriller films -- like this in the future.\r Rating: 2/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"}, {"rating": "4", "text": "The 2nd one was pretty mediocre and this one isn't any better. The stakes are Presidential: There's a senator who wants to stop the annual purge (when all crimes are allowed for one nite), but the establishment is out to end her crusade. Once again, the situations are absurd and the action is mostly dull and uninventive. Some of the auxiliary scenes are artistically shot or visually inventive, but that doesn't elevate the quality. It's not exciting. It's not scary. It's a disappointment."}, {"rating": "1", "text": "I've seen bad movies before.  I've seen movies so bad, they were funny.  This is not one of those.  The character's are 1-dimensional cookie cutters worse than b-movie characters, with terrible actors to boot.  The dialogue is worse than what I'd expect from prehistoric cave drawings, and the cinematography is non-existent, presumably because they paid some hobo off the street to do it.  There's no story either, so if all you want to see is a bunch of random people bleed, you'd be better off playing a video game.  At least the effects would be good.\r I'm neither a pessimist or a realist.  I'm not one to exaggerate, and I don't use words like \"best\" or \"worst\" lightly.  However, this is the worst, if not second worst movie I have ever laid eyes upon.  I didn't even finish it, because at some point I could not possibly cringe any harder.  I reached my limit of cringing.  It became impossible for me to cringe any harder at it, and I felt my time would be better spent watering my lawn or doing the dishes rather than wasting anymore time with this garbage.\r If you don't like these types of movies, you'd be better off lighting your money on fire than spending it on this.\r If you do like these types of movies, pull up your DVD collection because you'd be better off rewatching an older movie than watching this worthless production."}, {"rating": "3", "text": "The Purge: Election Year is frankly a sign that the franchise is running low on steam, has got more pretentious and full of itself than it was before.  The whole thing feels preachy and unnecessary.  The film’s ending suggests that this will be the final film in the franchise with only real possibilities of going forward being prequels and frankly if this is the final one I will be really glad because this franchise has really run thin and its getting annoying now.  The first film wasn’t any good, the second didn’t do much to improve and the third makes me wonder why sequels keep coming out for this.  The acting is terrible, the dialogue is atrocious and the film goes from being shot well to incredibly poorly.  If you liked the Purge films you will probably enjoy this one because it’s more of the same as what we got before, but if you are not a fan and are curious about the franchise, I wouldn’t recommend starting it.  There are a lot better film series that deserve your time."}, {"rating": "2", "text": "This concept was better when barely touched as a context for the horror/thriller/whatever kind of movie....\r They dropped the ball and chicken out when they had to actually write about politics \"for real\" (I mean, in the world they created)...\r Because they didn't wanted to say anything for real, no message, no allegory, not even a tiny subtext... they made the \"villains\" as ridiculous as you can possible think... The concept was: People is crazy and killing that day, but the oligarchy has an agenda (an obvious one)...\r Well, in this movie we see now that the oligarchy is just \"crazy, build on fanatics, extreme religious people, a sect\"... Therefore, there is no middle ground... OF COURSE the people in power is wrong... \"They are crazy!\"\r Such a coward way to NOT take seriously the politics... Why you even go there? Just leave it in the context and make more crazy and big settings if you don't want to say anything"}, {"rating": "1", "text": "first, I did not seen first two movies, and known absolutely nothing about the movies before seeing them. no trailer, no reviews, no friends seen it, not talk in radio, no nothing.\r second, this was quite possibly worst cinema movie of 2016.\rat first it looked like jump scare gore horror, and then it turned into lame action movie. acting, action scenes, story, characters...  junk.\rit is kind of movie you watched in 90s at 1AM drunk just because there was only telephoning on other channels.\r and then it got worse! you notice more and more parallels with upcoming presidential election in US. with obvious PC democratic bias. good women going for president supported by people of colour, fighting against old, rich, white, insane, murderous, racist evil bla bla bla. that would not be that big of deal, but the stereotypes are so overblown it is beyond joke.\r insane. do not watch under any circumstances."}, {"rating": "4", "text": "The movie had decent action sequences and kind of good story line, but the problem they need to fix with the Purge movies is that the actors don't seem to be quite professional. Yes, some of them do try hard to fit in and fix it but it doesn't work. The chemistry between characters brings a not so joyful feeling. If you watch this movie for sets of action pieces than you will get a good disturbing amount of fight scenes but if you watch it for a good story and good characters than just move on. In my opinion, I think they can do much better than this."}, {"rating": "7", "text": "Little less blood than what we usually expect from this series.  Grillo was awesome as usual.  Even through the Purge, you won't be able to mess with his hair.  Would recommend"}, {"rating": "0", "text": "Its better to watch USA presidential election year than this election year. Its complete waste of money and predictable movie . Movie can be predicted after 10 minutes."}, {"rating": "9", "text": "This is good as baddest purge movie as of now. This is such a good work. It is a little predictable but really a lot of fun to watch, some of the characters had some decent backstory to them and you actually cared for them a bit."}, {"rating": "10", "text": "This is the ultimate thriller movie for the family. The film has stunning visual effects, perfect story and amazing music. It even has awesome characters."}, {"rating": "2", "text": "No one has enough of the obvious horror sequel bait? Watch \"The Purge: Election Year\", otherwise, stay away from it and watch a different movie. Keep America great for movies, guys. Movies like this make America look like a trashy place to watch movies. You can start by not watching this in theaters and not even buying it for Blu-ray/DVD."}, {"rating": "9", "text": "I held my pee for a long time because I didn't want to miss a thing in this phenomenal film. It entertaining as hell. Jim DeMonaco did a great job building a brief backstory on all of the main characters and making them all likeable. People were cheering during this film on some of the parts - it's very satisfying. This is the best film I've seen all year. Great action, fast pacing."}, {"rating": "7", "text": "Good movie! It is a little predictable but really a lot of fun to watch, some of the characters had some decent  backstory to them and you actually cared for them a bit. However I felt like some of the characters in the film were a bit too stereotypical and extremely one dimensional. Also, I didn't understand why the one main villain couldn't have just been a normal mercenary, why did he have to be riddled in confederate gear and have nazi signs tattooed all around him?\r Overall, it is a really exciting film and you should definitely go and check it out!"}, {"rating": "7", "text": "\"The Purge: Election Year\" is the Purge movie that we've been waiting for; its a movie that is intelligent, political, and full of all the action and suspense we would expect when America goes into anarchy for 12 hours!\r You'll probably like this movie if you are a fan of the Die Hard series,action films, apocalypse films, and/or conspiracy films."}, {"rating": "8", "text": "Let's go out to the streets! again...  the story is like a copy of the sequel and... the blood wasn't really too much necessary(the jumps-cares either...)i mean... this movie need to have suspense,not horror(don't forget\rpsychological horror)WTF WITH THE START?!  was really creepy and the... SPOILERS(little ones)\r The lady sitting... with a body in the ground on fire warming up O.o\r Well,i was REALLY waiting more to this film(and with the girl \"liberty statue\")"}, {"rating": "7", "text": "Great movie. Scare but great. What scares me is that something like this might actually happen - there might be some sick government in the future who allows for something like this and this is what makes this movie even more scary. I haven't see the first 2 movies yet but I am planning to watch them soon.\r Overall, a good film!"}, {"rating": "10", "text": "This was definitely the best movie I've seen in a while  it was worth the money. It was so good I will be seeing it again! If your're looking at other peoples reviews, **** that I'm telling you GO SEE IT! The first Purge movie was boring and I was hesitant to go so see this one but it was sooooo good, and I hope they make more movies for the series!"}, {"rating": "8", "text": "The acting, action and production value are good. The mediocre reviews are likely because the film only caters to a narrow demographic. If you're into the purge concept then I highly recommend. Like the 2nd film this one is well done."}, {"rating": "9", "text": "Election Year proves to be the first Purge movie to truly blow us away. It essentially does so by amplifying everything that worked in Anarchy, while avoiding it's misguided political and social messages. The plot is tighter, the characters are better, and the events are more deranged.The horrifying events and depictions of brutality are handled better than ever. There's a sense of shock and tension that was missing from the other two. Themes of human cruelty are still on display, this time more maniacal than ever. The deranged costumes of the psychopathic purgers and the well-crafted action make for a more exciting experience. When it comes to horror this is the best Purge yet.It's actually the best Purge all around. It focuses on the best aspects of the first two movies, while scrapping most of the problems. Writer and director James DeMonaco even handles his political and social commentary better this time around. A few familiar beats in the plot are noticeable. The bad guys have that oh so familiar tendency to go on pre-kill rants that last just long enough for our heroes to save the day, but it's got enough twists, turns, likable characters, and brutal violence to keep us going. If this is in fact the last chronological Purge, the series concluded it's story on a very high note. One that makes the future of the series, no matter where it takes place in the timeline, look brighter than ever. Election Year is even strong enough to make Purge haters change their minds. It's that much of an improvement.9.2/10"}, {"rating": "4", "text": "Rick and Morty's \"Look Who's Purging Now\" is the best version of The Purge we've had.\r The Purge series has one of the greatest premises in a long time, but too bad it was in the hands of **** film makers who have no idea how to execute it properly. Three movies in and I'm still not into these movies.\r Frank Grillo and Elizabeth Mitchell are both strong leads and the only thing I can think of that I liked in this movie. The acting from everyone else was so awful and way too over the top that after awhile it came off laughable."}, {"rating": "8", "text": "Deutsche Review - KritikDer folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden?Dann sind hier meine Punkte.Mein persönlicher Score = 77/100Mein User Score = 8/10"}, {"rating": "9", "text": "GREAT!\rI really enjoyed watching this amazing movie. It had me interested from the start till the end\r& I wasn't bored at all through it.\rFrom the best movies I have ever seen on its genre."}, {"rating": "8", "text": "The timeline is confusing, but I really liked this film. I like these characters, the story, and the terror. I like this more than Purge: Anarchy (which is a 7.5/10 for me), because this film shows us more of the political views."}, {"rating": "8", "text": "The Purge Election Year is the third entry in this franchise and it is still good it is crazy that the third entry to the series can still be as good as its second film which is Leo Barnes returns he was the best part of the second film and he returns and he is great in this movie he does the right thing in this one also he was suspicious and the good people trying to kill the other elector Senator is the main second the main character in the movie where everyone is trying to get her because she wants to end the Purge which does make sense why everyone would do that also Dante returns from the first movie which is awesome I really did not like him in the first movie he is a lot better here so yeah The Purge Election Year is a fun movie with returning characters also has a good reason to why the villain is doing what he is doing so I give The Purge Election Year a B"}, {"rating": "10", "text": "GOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOODGOOD"}, {"rating": "5", "text": "Grillo is good but otherwise this film is utterly braindead. Visually decent but very dumb."}, {"rating": "3", "text": "The weakest film of the series thus far. The story is a recycling of the premise film with characters feeling underdeveloped and the pacing yet again feeling inconsistent. The focus is clearly on being an action film first and everything else falls by the wayside. This one felt rushed and uninspired, as if they had no idea where to go with the franchise so they just rehashed stuff we have already seen."}, {"rating": "5", "text": "Putting aside the fact that I feel these films have a really dumb premise there are some redeemable qualities here.  Similar to the last Purge film the best part is Frank Grillo, he is really trying.  Unfortunately all the silly dancing with masks and cheesy over the top acting masks this a real miss at times.  This is more like the second film better than the horrid first film, though it's still very average.  C"}, {"rating": "6", "text": "The Purge Election gave me exactly what I wanted with some issues. This is by far the best installment. It's story pulls me in far and it had an emotional ending. Overall I just thought it was a decent movie!"}, {"rating": "1", "text": "La tercera parte de esta saga de películas,  que nos narra sobre una sociedad llena de Psicopatas donde solo por un día al año todo es legal, principalmente asesinatos. El argumento empieza bien pero poco a poco empieza a decaer mostrando situaciones ridículas y exagerando todo, las actuaciones mas que 1 o 2 todas son muy muy malas, lo peor es que la película trata de tomarse en serio y ese es su principal problema, poco a poco se va volviéndose lenta,absurda, aburrida y muy plana. The Purge 3 Electión Year es recomendable quizá si estas con tu novia,o si buscas gore absurdo, pero si lo que buscas es un buen Thriller no esperes nada de ella."}, {"rating": "7", "text": "So unlike in first movie, here we get a character who returns from the second movie and again is heavily involved it all. Action and suspense is really good and if you watch it for fun and that part I think it is a really good movie. For the actual plot - lots of it does not make sense and I do not think this film is made for that really, it's more for the popcorn culture. If you did not like any of the previous ones don't bother with this one, if you did like them, I think this one will be ok for you."}, {"rating": "6", "text": "The Purge: Election Day was a movie full of action, but more violent than the previous one, it had a good plot and a good level of terror, but the performances and the action scenes themselves, but that does not rest on the film."}, {"rating": "6", "text": "This movie is not that far away from being realistic especially if you lived in the big cities of America after an election. Overall, the movie is decent, but it starts getting predictable as the film reaches its completion that you could just skip it and not missed much."}, {"rating": "7", "text": "Mucho mejor que las anteriores, me gusta que el \"lore\" de la saga se expanda tan bien. Me gustó el desarrollo de la historia y los nuevos personajes ."}, {"rating": "5", "text": "The Purge: Election Year may have a more interesting story, and some interesting characters, but there is a big lack of fun missing which was present in Anarchy."}], "recommendations": ["repo_men", "what_happened_to_monday", "the_tomorrow_war", "london_has_fallen", "the_kingdom", "infinite", "riddick", "the_girl_with_all_the_gifts", "antebellum", "the_darkest_minds", "x_men_apocalypse", "elysium", "maze_runner_the_scorch_trials", "geostorm", "the_new_mutants", "code_8", "surrogates", "independence_day_resurgence", "world_war_z", "the_forever_purge", "the_purge_anarchy", "bright", "the_invasion", "the_first_purge", "sicario_day_of_the_soldado"]}