{
  "id": 1863,
  "title": "The Salvation",
  "starring": [
    "Mads Mikkelsen",
    "Eva Green"
  ],
  "runtime": 92,
  "genre": [
    "Drama",
    "Western"
  ],
  "description": "In 1870s America, a peaceful American settler kills his family's murderer which unleashes the fury of a notorious gang leader. His cowardly fellow townspeople then betray him, forcing him to hunt down the outlaws alone.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xQsv3OI8UT6s9Rn3C0WxO24bnEx.jpg",
  "categories": {
    "plot": 7.545454545454546,
    "acting": 7.857142857142857,
    "ending": 7.0,
    "soundtrack": 3.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This is a great movie. But it isnt a Terminator movie. It isnt about Schwarzenegger going back in time, and I am okay with that. Salvation is... its something new. But they never made more sequels to this movie, with leaves this movie as unfinished."
    },
    {
      "rating": "7",
      "text": "Basically a violent revenge story with a plot that feels a bit like a video game. Clocking in under 90 minutes (excluding credits), the movie never really digs into any of the characters' pasts or gives any indication of their future hopes or goals, and the line between good guys and bad guys is very black and white. If you're looking for a lot of character development or intriguing twists, you won't find them here. At the same time, the straight-forward story is relatively free of plot-holes and pointless scenes.\r What little we do know about the characters is engaging. The bad guys are appropriately despicable, and you root for them to get their comeuppance. The few good guys aren't exactly angels either, but they are likeable. Mads Mikkelsen is well-cast as the main protagonist. He has a good look for Westerns, and he is believable both as a blue-collar family man and as a steely gunfighter.\r One aspect of the movie that stood out was that--unlike most westerns or Hollywood shoot-em-ups in general--villains didn't always go down with a single shot. Even nondescript henchmen might take a shot to the leg or abdomen and keep fighting, as opposed to the old plummet-off-the-roof routine seen in so many westerns. This added to the grittiness and authenticity of action scenes."
    },
    {
      "rating": "9",
      "text": "Gritty and intense. Much more enjoyable than I expected. The acting was excellent. Based on some of the reviews I had read I was concerned the opening scenes might be too much, but I was pleasantly relieved that much of what could have been shown on the screen actually wasn't.  Other reviews said there were no captions for the few Danish lines in the movie, but there were English captions in our local theater. An overall very engaging Western."
    },
    {
      "rating": "7",
      "text": "It had good acting, great cinematography and it was pretty entertaining. Unfortunately, it was predictable, the story wasn't very original, the CGI wasn't very good and it had a serious lack of blood. It's another example of how a movie can be affected without an R rating."
    },
    {
      "rating": "10",
      "text": "Wonderful and exciting is what I got from this cowboy saga. This film definitely has  very good directing, casting and location. This is close to how  the spaghetti westerns from the 70's without the voice dubbing."
    },
    {
      "rating": "7",
      "text": "A throw back to the old spaghetti western genre. Few spoken words, lots of killings and clearly defined good and bad guys. The town is burned to the ground. 1/2 its citizens are dead and the a handsome guy and nice looking girl ride off into the horizon . Whats wrong with that ?"
    },
    {
      "rating": "10",
      "text": "Just gorgeous. It's the gladiator of the western movies. A must see, a movie underrated"
    },
    {
      "rating": "6",
      "text": "A pretty cool if very derivative Danish western, Mikkelsen is always good. Decent."
    },
    {
      "rating": "9",
      "text": "A beautiful, if brutal revenge western, that brings real style and class to the genre. The screenplay and story are full of surprises and tension and one begins to expect the unexpected. Following on from his excellent performances in films like ‘The Hunt and ‘A Royal affair’, as well as his TV outing in ‘Hannibal, Mads Mikkelesen proves once again that he is a commanding presence on screen and an actor one looks forward to watching. High production values across the board and a stunning South African location also make the film both aurally and aesthetically pleasing. However, it must be said that the cinematography is the star of the show. With its vibrant use of colour and the almost surreal beauty of its night time shots the film belies a probable small budget and looks better than most blockbusters ever could. This is a real gem that will reward those who seek out its treasure. Small, maybe, but perfectly formed."
    },
    {
      "rating": "8",
      "text": "Revenge for a revenge.\r It is a Danish western revenge flick set in the American soil, so 99 per cent it was in the English language. Well, in my opinion, it is underrated for sure. It was not anything stylish like QT's recent western films, but quite usual presentation yet very majestic. The story takes place in a couple of days in a small town in the 1871. The turnaround in the theme was great. Initially, it leaves an impression of a revenge based tale, but later becomes oil warfare, something quite resembles the original situation of the American at that time.\r In the last few weeks I have been watching lots of comedies, dramas and other soft themed films, so suddenly I felt too much violence from this. But as always I get used to it after some time in the watch. Great cast and their great performances. The writing was superb along with the settings. I watched it quite late, but the best western I have seen in the recent time, so I strongly recommended for western fans and others who're seeking a fine entertainment.\r 7.5/10"
    },
    {
      "rating": "7",
      "text": "At first I thought this will be the usual western movie where somebody is attacking the town and some hero guy decides to help them and save them. In a sense it still were like that, but it had a twist on it - the town did not ask the main guy to help them, he was against the bad characters mostly because of revenge and because they killed his kin. Also most of the good town folk already left anyway or got killed by the bad guys. I really enjoyed the movie because of this as most other westerns they make or remake these days involve quite a standard plot. Also the acting was quite nice too."
    },
    {
      "rating": "6",
      "text": "Le grand et très appréciable Mads qu'il est toujours agréable de voir, y compris dans ce western quelque peu étrange, plutôt bien filmé et... assez inspiré du western-spaghetti dans le choix de ses cadres, ses plans et son atmosphère.Etrange disais-je, car le scénario un tantinet mollasson n'est pas avare de nombreuses incohérences et de raccourcis tandis que la violence qui y est dépeinte se veut ma foi assez brute de fonderie mais sans en faire trop non plus (un bon point), ce qui rejoint cet aspect \"spaghetti\" réhabilité en quelque chose de plus \"moderne\" si j'ose dire.La merveilleuse Eva Green est de la fête, entièrement muette, ce qui n'entache en rien sa prestation (elle parle avec ses beaux yeux et ses divins sourcils) malgré son rôle secondaire voire même en porte-à-faux. Signalons la présence de notre abruti de footballeur qui se prend pour un acteur et qui dispose d'un rôle mono-expression à la hauteur de son air ahuri : c'est fort distrayant. On l'a compris, The Salvation manque décidément d'équilibre mais ne s'avère point déplaisant tout compte fait."
    },
    {
      "rating": "5",
      "text": "The Salvation is a western in all rule, and that is both its strongest point as its weakest point, its quality is undeniable, it is certain that there are problems with its script, but otherwise complies."
    },
    {
      "rating": "3",
      "text": "The Salvation – No Saving Graces Here  Seeing this was listed as a Danish movie had hoped for something different, tuned out to be a Danish Dumper. There should be a law stating that when a movie maker copies another’s work they should pay some sort of fine – this Danish flick is a dismal rip-off of Leone’s equally overblown ‘Once Upon a Time in the West’  which in turn was a rip-off of numerous American westerns and John Ford. All the tired old clichés are trundled out shamelessly – the town full of cowardly citizens (including the sheriff) afraid to stand up to a bunch of ruthless bullies (who they actually seem to outnumber) The peace-loving settler whose family are for no good reason, cruelly destroyed - followed by the impossibly contrived revenge plot. The baddies are badder-than-bad and kill for little or no reason (just to manipulate an easily pleased audience into wanting them violently slaughtered)  The music imitates Morricone all over again, as do the camera angles and desert settings. This set-up is so tired it’s almost sleep-inducing.  Strictly for lovers of copycat movies or the easily conned western geeks."
    }
  ]
}