{"id": 1808, "title": "The Girl on the Train", "starring": ["Emily Blunt", "Rebecca Ferguson"], "runtime": 112, "genre": ["Thriller", "Mystery", "Drama"], "description": "Rachel Watson, devastated by her recent divorce, spends her daily commute fantasizing about the seemingly perfect couple who live in a house that her train passes every day, until one morning she sees something shocking happen there and becomes entangled in the mystery that unfolds.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/AhTO2QWG0tug7yDoh0XoaMhPt3J.jpg", "categories": {"plot": 3.3333333333333335, "acting": 4.5, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "1", "text": "Once again the critics got it wrong. This movie is a cure for insomnia. The story is weak, there's no suspense, the characters are uninteresting. Avoid this turkey."}, {"rating": "8", "text": "“The Girl on the Train” is the film version of the best selling novel by Paula Hawkins. Directed by Tate Taylor with a screenplay by Erin  Cressida  Wilson, the movie stars Emily Blunt, Justin Theroux and Haley Bennett. Not having read the book it’s difficult to compare the two vehicles but, standing alone, the film is a series of complicated flashbacks, convoluted scenarios and difficult to follow story lines so that it is more of a struggle watching it than a pleasant experience sitting through it. With all that being said, I did, nevertheless, find myself engrossed in the film and perhaps, even more so, because I was trying to follow what was happening and how it would all ultimately end. Ms. Blunt is an amazing actor and exemplifies extraordinary talent as she dominates and appears in almost every scene and is indeed one of the main reasons I give the film an ;8  for, despite all of its shortcomings, it’s a “train ride” the viewer will want to take to the end of the spoken \"line\"."}], "recommendations": ["the_girl_with_the_dragon_tattoo", "the_fault_in_our_stars", "inkheart", "murder_on_the_orient_express", "harry_potter_and_the_goblet_of_fire", "tinker_tailor_soldier_spy", "harry_potter_and_the_order_of_the_phoenix", "child_44", "the_golden_compass", "the_snowman", "a_most_wanted_man", "the_theory_of_everything", "odd_thomas", "before_i_go_to_sleep", "nocturnal_animals", "match_point", "inferno", "fifty_shades_darker", "artemis_fowl", "the_giver", "gone_girl", "the_devil_all_the_time", "magnolia", "sherlock_holmes", "the_prestige"]}