{
  "id": 4569,
  "title": "The Kid Who Would Be King",
  "starring": [
    "Louis Ashbourne Serkis",
    "Dean Chaumoo"
  ],
  "runtime": 120,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy",
    "Family"
  ],
  "description": "Old-school magic meets the modern world when young Alex stumbles upon the mythical sword Excalibur. He soon unites his friends and enemies, and they become knights who join forces with the legendary wizard Merlin. Together, they must save mankind from the wicked enchantress Morgana and her army of supernatural warriors.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kBuvLX6zynQP0sjyqbXV4jNaZ4E.jpg",
  "categories": {
    "plot": 6.285714285714286,
    "acting": 6.324324324324325,
    "ending": 7.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.076923076923077,
    "funny": 5.375,
    "action": 6.714285714285714
  },
  "reviews": [
    {
      "rating": "6",
      "text": "+Great premise+Excellent pacing+Memorable adventure genre set pieces-Overall film budget isn't quite enough to do the idea (of this scale) justice-Lead actor is decent enough but feels like casting should've been stronger hereI expected very little and this film delivers a LOT more! What it lacks in budget it makes up for in heart... Its a classic tale that reminds me of the dungeons and dragons cartoon mixed with a touch of time bandits for action adventure lark. Certainly not cinematic perfection, but none-the-less TKWWBK is a great film to watch with the kids."
    },
    {
      "rating": "6",
      "text": "Maybe the kids of today are much more cynical than innocent but this film has a heart I must say. Even though it may seem too corny at times.It's not genius but I found it more enjoyable than I expected at first."
    },
    {
      "rating": "6",
      "text": "And The Kid Who Would Rule.The Kid Who Would Be KingCornish has made a delightful treat for the kids and the adults. This '70s textbook plot breeds the sincerity it had decades ago with a taste of the 21st century humor and ideologies. And this is something that we get fresh right out of the oven, since these teenage kids are dipped into this more practical world where everything has to be mocked and questioned. Filtering out those exact characteristics, Cornish polishes his story more and more as the characters themselves starts putting it into trial. The first act is rudimentary with spiraling out the usual introduction which personally I feel is his biggest bluff. Contradicting you in every step on rest of the film, this adventure that these brave kids have chosen to go through keeps giving you back enough reasons to be giddy up for more.Aforementioned, the characters are well aware of the assumptions that film might lead you to, hence quoting Lord Of The Rings and Game Of Thrones and plenty other references it keeps the tone light and breezy. Cornish is still aware of the practicality of the storyline or how does it appear as a whole picture. And this is how he makes sure that his film is mythological, through all the exceptions are prophecies or their special characteristic.For instance, the action is written maturely, it never jumps on a conclusion of the battle, it makes sure that the stakes are always the same and putting up such kids in the battle field requires lots of character insight to be developed. Lopping off all that work, Cornish is speaking behind the screen with notions that actually comes off as mumbo-jumbo in such genre but not in here; the rules set by Stewart plays a vital and probably the best part of the film. This prophecy-like plot kick in its middle act which is the smartest of all for it puts the king on a test that everyone was already in, circling back the humane part of the character.As far as the performance is concerned the younger cast has done a decent work if not anything extraordinary. Stewart and Ferguson gets a scene to share where probably is the only point where they are completely themselves but the performance is surprisingly disappointing. The script is absorbing and gripping with its main asset being the characters that are three dimensional and are analyzed through and through; even after out team teams up, they still have to go through plenty of issues to fight as one.Taylor who plays Lance, hence, gets one of the best role to play since it is the one with a complete cinematic arc. The background score and visual effects could have been a lot better but with good sound mixing and action packed sequences, it sails off smoothly on technical aspects. The Kid Who Would Be King has a king that we haven't seen before- at least not for a while- it is a triumph on civilizing that king and then make him rule along with his army or perhaps friends."
    },
    {
      "rating": "6",
      "text": "This is a solid kids King Arthur film with good visuals and some decent acting."
    },
    {
      "rating": "4",
      "text": "Why don't they understand that King Arthur belongs to the books?We have gone from ageless classics such as \"Camelot\" by Joshua Logan, \"Monty Python and the Holy Grail\" by Terry Gilliam and Terry Jones and \"Excalibur\" by John Boorman to insufferable \"reimaginations\" and lifeless adaptations such as Stuart Gillard's \"Avalon High,\" Michael Bay's \"Transformers: The Last Knight,\" Guy Ritchie's  \"King Arthur: Legend of the Sword\" and even Otto Bathurst's \"Robin Hood\" — which features many of the ingredients that made Ritchie's film what it is.— Exactly in the middle of these two categories lays the latest effort as writer and director of Joe Cornish, which rethinks the timeless legend within a world of smartphones, homework, bullying and chicken wings; while simultaneously trying to condense a fantasy adventure à la Spielberg, a Disney Channel film and a subtle anti-Brexit commentary; of course, not everything works out.First and foremost, \"The Kid Who Would Be King\" means an irrefutable improvement over shameful adaptations Hollywood has insisted on producing. 20th Century Fox's delightfully British new take is likely to be far from covering its production and advertising costs, but quality-wise, it does redeem and save Arthur from ending up, again, on a \"worst of the year\" list in the face of the failures/flops from studios like Warner Bros. and Paramount Pictures.After the reckless 2011 hybrid between sci-fi, comedy, and horror he used as his directorial debut, Joe Cornish jumps from playground to the most 80s fantasy, which is called Amblin. It opens with a didactic, gorgeously animated introduction to give some context about what sort of film we are about to see, enjoy and suffer in equal parts. Just like Spielberg, Cornish almost completely restricts parent prominence, using them uniquely as dramatic supporting vehicles. For this reason, Alex, played by Louis Ashbourne Serkis — son of motion capture pioneer Andy Serkis, — his bestie Bedders, portrayed by Dean Chaumoo, and bullies Kaye and Lance, by Rhianna Dorris and Tom Taylor respectively, are the story's eyes. Each one does a great job portraying his roles, especially Serkis, who with his tenderness and unbelievable drama range makes a short part of the film compelling. But when it comes to juvenile performances, Angus Imrie and his hypnotizing and elaborate hand gestures steal the show. It's a huge surprise to learn that stars Patrick Stewart and Rebecca Ferguson are here standing by the project; the former with quite short yet meaty appearances as adult Merlin, and the latter as Morgana, a female villain that even though Ferguson tries her best to deliver a credible, menacing antagonist, the script only makes her look like a one-dimensional cartoon figure that wants to take over the world. Brilliant moments are at a premium, but still, the film treasures some touches of brilliance. From clever commentary against controversial withdrawal Brexit to writing jokes adapting the well-known Arthurian mythology to the 21st century manners; from dazzling blockbuster-like set-pieces to pieces of training as imaginative as catching, Cornish manages to pull several easter-eggs and comical interludes off thanks to his careful, faithful writing and the professionalism and commitment of his actors portraying their roles.As for the rest, \"The Kid Who Would Be King\" has the potential to become a headache for some adults, nonsense for some teenagers and for most kids an endless fascination. Due to its abusively drawn-out running time, many viewers could stand in a position of radical skepticism midway, not receiving equally the other sequences and narrative moments, which can get to be dull, boring and ridiculous if you don't get into it from the beginning. The film tends to use its purpose of kids entertainment as an excuse to produce visuals and narrative threads that don't work well. From ridiculous to boring, young Merlin's slapstick and Bedders' naive humor might not land so well for grownups, because it handles a kind of humor that even today's children don't understand it as children used to.  \"The Kid Who Would Be King\" by Joe Cornish is not only a taste of its own medicine for majors that don't get tired of re-visiting existing IPs, but a production of British flavor severely diminished by an unnecessary lengthening of the events, a too mild treatment to resonate among today's audiences, some uninspired visuals and a story that fails to create interest for unlikely sequels.  Those who grew up in the splendor of the 80s and 90s will certainly be willing to be carried along by the homages and easter eggs of the last century— for starters, the parallelism with films such as \"The Man Who Would Be King\" —however, those who, like me, belong to the new millennium will have a hard time trying to connect and stay connected with the idea for more than a quarter of an hour."
    },
    {
      "rating": "7",
      "text": "I was completely blindsided by how good The Kid Who Would Be King turned out to be. I went into this movie expecting a mediocre children's movie. While the movie is absolutely aimed at a young audience, I was surprised by how mature the acting performances, action scenes, and story were portrayed. This is a movie with a ton of heart, really good lessons, a great cast, and a well crafted production. I found myself smiling and cheering a lot more than I thought I would. The Kid Who Would Be King does take a while to get the ball rolling, but this children's epic is well worth the investment."
    },
    {
      "rating": "6",
      "text": "The Kid Who Would Be King will invite his audience to go back to enjoying the classic adventures of past history with the present settings without exaggeration. The film also presents a relaxing but meaningful and moral message through the journey of life from the perspective of children. So that this film is very suitable to be enjoyed with family, especially with children."
    },
    {
      "rating": "6",
      "text": "First of all, the musical score, which is composed by Christophe Beck and Electric Wave Bureau, was incredible. You could just listen to the score and understand what is going on in the film at that point in time. It helped to understand what was going on in the scenes and what you should feel in that moment. The scenery in this film looked well done and you could tell a lot of detail went into them. At certain times in the film, the CGI and special effects were decent to look at but for a majority of the film, it looked like the special effects department was rushed to get something done. The transitions in this film were awkward and made no sense. At some points, it would feel like the scene had more in it but they had to cut out something to get to a shorter run time. Now, I understand that a majority of the actors are kids and I believe they all can go far in the future is just their acting in this film was really bland. There was very little to no emotion given in any scene from the four main characters. There was only one actor who actually showed emotion and that was Angus Imrie, who plays young Merlin. His character was weird and outgoing and he was probably one of my only favourite things in this film. Although at some parts he probably should have toned his acting down a notch. The villain in this film was just bad and made no sense. I think if they had a longer run time this film could have fixed any of the flaws the had. The last thing I want to mention is how this film relies on certain things to happen and if one of those things didn’t happen the entire film wouldn’t happen. In the end, this film is a good time for younger kids but not for the whole family."
    },
    {
      "rating": "4",
      "text": "First and foremost, let me just say, The Kid Who Would Be King is intended for children of very early ages, no matter how \"fun for the whole family\" the trailers may make it out to be. It's a lot of CGI and young actors who've clearly never worked with the likes of it as they awkwardly and unconvincingly battle imaginary trees and ghostly horsemen. The villain has a poor character build and doesn't come off being the big, scary threat she's made out to be, nor does our hero's quest to defeat her seem meaningful. He's told, \"she's evil and needs to be stopped,\" and he generically sets out to do just that. The most disappointing part of the film is that it's not the least bit funny. There are so many moments open to funny and witty banter, but instead the writer(s) try to take kids battling demonic, ancient forces seriously. I went in expecting Goosebumps and instead I got Goosebumps 2: A Haunted Halloween."
    },
    {
      "rating": "8",
      "text": "There was humor, a bit of heart and some really epic fight scenes between kids and morgana, mortes milles. The movie had tried its best not to let you throw your popcorn away"
    },
    {
      "rating": "7",
      "text": "The Kid Who Would be King is the perfect movie for families to share together. It brings back the adventure and fun without neglecting important themes that parents and kids can discuss long after the film is over. Movies like this need your support, so take friends and family and enjoy."
    },
    {
      "rating": "8",
      "text": "f you’re like me, every time the trailer for KWWBK came out, you rolled your eyes and wondered out loud why it hadn’t gone straight to streaming in the land of forgettable originals, Netflix. For the last week, Wife had counted me out on seeing it altogether, so she was surprised when I elected to see this with her instead of going to see blonde Anne Hathaway in the self-inflicted career wound that it sounds like Serenity has become. But within the first few minutes of Star Wars references and generally adorable middle school embarrassments, KWWBK reveals itself for what it is: an unassuming, unexpected delight.We’re doing things a little differently for the next few hours while I recover from a month of slacking on reviews. The past two weeks have been hectic, filled with moving boxes and late nights, so I’ve been letting things slide. At the suggestion of Wife, I’m gonna try to review backwards in hopes that it helps with recall.As I sat in my seat, pleasantly surprised by how funny these child actors were and how, for the first time in months, AMC had remembered to use the correct aspect ratio for its screen (it forgot to turn off the house lights until someone asked, but you can’t get ’em all), I was transported to the time Wife and I saw the Rock play Hercules in what I still feel is one of my all-time favorite classical themed movies of all time.I remember going into it thinking it would be a way to kill a couple hours before I had to go back to doing homework, and after the first few references to zombies, it became increasingly clear to Wife and I that this movie was so far away from taking itself seriously that it had actually found a way to start making fun of itself in the script with some reliability. It was only after we walked out of BWWBK that Wife looked it up and noticed that the actress who played Morgan, Rebecca Ferguson, was, in fact, also in that ground-breaking schlocky film from years gone past, Hercules.Attack the Block director Joe Cornish proves that lightning can strike the same place twice. His deployment of lovable, charismatic young actors and a self-aware, snarky script with moments of sentimentality is the magic recipe for a great kids film. Older Brother said that he and his colleague loved the film, even if it was a little long, which scans pretty closely with what Wife said. Wife added that if you think about the two concepts that the film wants to build its story around, Alex’s quest to learn of his lineage and the structure of the three nights before a final confrontation, there wasn’t a lot that could be cut.I like that the film didn’t try to shove the four kids and Merlin into a single cohesive group with a single storyline, but rather it tracked the relationships between the two older kids, Lady Kaye and Lance, and the two younger kids, Alex and Bedders, separately. The script let them wrestle with different childhood struggles at different stages of development. Merlin and Morgan have their own kind of kinship when they confront one another on the rooftop of the school–Wife recalls Merlin’s line, “This is their world not ours”–which simultaneously gives the young Merlin an implicit power spike, but also in some ways humanizes the villain and maps their struggle into an issue of generational change.Morgana’s ability to toggle between a humanoid form and other more monstrous shapes was very satisfying for someone who prefers a humanized depiction of evil rather than a disembodied Sauron-type Enemy. Morgan’s vice in this film’s interpretation is so perfectly apt for the times: it’s not that she’s ruthless or callous or corrupt. It’s that she feels “entitled” to the throne. Her sense of privilege is a marker of her villainy.Wife thought there would be more about the aftermath of the final battle, I guess in Stranger things style where the carnage at the school requires the kids to take responsibility for damage they didn’t necessarily cause.The simple magic of removing adults at twilight worked really well, both of us thought. It allowed for the kids to do a lot of dangerous things that would’ve just bogged the audience down with logistical questions otherwise. Speaking of bogs, the bog scene was fun. As was the physicality of the trees in the training scene.BWWBK restores my faith in the genre of kids films, shows that the emotional lives of children, as Mr. Rogers was wont to say, are just as complex as any adult’s. The film has something to say about the paralyzing sense of helplessness that comes from being a child in this period of doom and gloom, both political and artistic."
    },
    {
      "rating": "10",
      "text": "SPIRITUAL MOVIE ALERT - Another authentically uplifting, professional movie unappreciated by critics. The film's title needs work.  This is a Goonies-like movie addressing the negative, depressing world situation with a great deal of heart.  Much better than I expected.  Much better than it needs to be in script and in all production departments.  The young cast, and Patrick Stewart have an UNUSUALLY EXCELLENT SCRIPT to plug into.  This melding of script and acting is not usually seen in this genre outside of he best of the Marvel movies.  The script was either excellent to begin with; or, it was improved with the extensive pre-vis work.  Script is a textbook perfect example of setting up and paying off narrative devices; and, of a littel ending followed by a big ending.  Contrast this with the Mission Impssible movies et al, where 3-4 endings, even taken together often don't add up to much. Patrick Stewart alternates between two roles:- The weak, aged Professor Xavier from Logan (great acting courage turned again to wonderful dramatic effect); and,- A plucky aged cheerleader foil to the young untried characters.One of very few excellent kids movies adults will enjoy equally."
    },
    {
      "rating": "9",
      "text": "this movie is a total surprise. normally a movie that seems mostly for kids is often too goofy or too silly and if you are not with your children, it is terrible. yet this movie is none of those things.  it is very well directed and has enough humor so as not to take too seriously.  if it is flawed it is because the end battle may be a little much to expect all those kids to be well enough trained against the evil and skilled dark forces but it was just too much fun. with or without your kids i would say see this film, one of the best films of this genre i have seen. what a surprise!"
    },
    {
      "rating": "9",
      "text": "This is my favorite King Arthur movie, one of my of favorite movies of 2019, and one of my favorite movies of all time. The acting was excellent especially Angus Imrie, Louis Serkis, Rhianna Doris, Tom Taylor, Dean Chaumoo, Denise Gough, Patrick Stewart, and Rebecca Ferguson. The writing and story were outstanding. The visual effects were terrific. The makeup and hairstyling was superb especially on Rebecca Ferguson. The costumes were awesome especially on Rebecca Ferguson and all of the armor. Overall a great movie."
    },
    {
      "rating": "7",
      "text": "The Kid Who Would Be King, is a film that is certainly not without flaws. And my grade of it is honestly probably based on a bit of a curve. But I couldn't help but enjoy it. Despite a noticeable lull around the end of the second act, the movie for the most part tapped into the childlike side of myself, I feel that I would have really liked this movie as a middle-schooler. As it stands though, I still enjoyed it enough. It reminded me of how Arthurian myth can be fun; which is something a movie hasn't done in a long time for me. However, the villain, Morgana, is one of the least developed villains I've seen in a while. Her character motivations matching, or BARELY surpassing in effectiveness, the motivations of the villain Steppenwolf from Justice League (2017). But I must admit, I got a kick out of seeing the mythology brought to the modern day, and experiencing it with the kids of the film. The movie also suffers from being quite predictable. Anyone who's seen three movies in their life can guess the plot as it trods along. The CGI work isn't great, and also isn't very creative. There's exactly two designs, the generic CG army of flaming undead, and Morgan as a Percy Jackson monster looking harpy thing. It's... not great. But the movie also has a good message for kids and is fairly effective at delivering it. All in all, not a bad movie, in fact a pretty good one if you can tap into that childlike part of yourself and/or have an affinity for Arthurian legend."
    },
    {
      "rating": "6",
      "text": "A serviceable little movie. Nothing special, quite predictable. Liked the false ending towards the end, though to be honest I was ready for it to end by that point. I also feel like the lead actor was outshone by the others, particular the bully and his female friend."
    },
    {
      "rating": "5",
      "text": "Well done for a kids movie, but it's still a kids movie, not really something you'd want to go see as an adult without the kids along, young kids at that, 10 tops. The kid actors do the best they can, but let's face it they're hardly professionals. Only the young Merlin manages to pull off an actually pretty good performance. A nice, albeit very predictable childrens' story with a rather poorly developed villain but mostly passable FX on a budget. Though this movie does have a few good moments, some funny, it's still the type of movie that would only appeal to little children. A 5 is pretty generous already."
    },
    {
      "rating": "7",
      "text": "Not a bad kids movie. Lots of heart and action, not ground breaking by any means but enjoyable. The only thing is the young Merlin looks exactly like Richard E. Grant and yet they cast Patrick Stewart to be his elder form."
    },
    {
      "rating": "6",
      "text": "Was excited to finally get a chance to see this film, since I didn't get a chance to see it in theaters. It has a great premise with good acting from the leads, Patrick Steward is of course incredible but its poorly paced and the entire third act is hard to take seriously when its kids going to battle against demons"
    },
    {
      "rating": "6",
      "text": "This is really a kid movie and with a limited budget. The story is passable. They try to present the legend in a more modern way, but with very mix results. The young actors were pretty good and they have solid adult actors around them. The CGI were not always very good, especially with the villains. I am not sure that even for kids, the movie wouldn't be boring. I give it a 55%. Maybe the intentions were good but I think this movie would have been better in the style of anime, it started with..."
    },
    {
      "rating": "6",
      "text": "After many years, Cornish was able to tell a very powerful, yet super fun story that delivers a very important message which anyone could enjoy. While not as streamlined as his first outing with Attack The Block, it is incredibly impressive how well he brings out great performances from young actors. Two very different movies, one being a rated R sci-fi alien film and one being a PG Arthurian tale told through the eyes of a 12-year-old, Cornish does not lose his creative touch at all. Hopefully, it won’t be another eight years before his next endeavor as Cornish has proved his incredible talent once again."
    },
    {
      "rating": "8",
      "text": "This is the long-awaited (for me) follow-up to Joe Cornish’s directorial debut, the cult-classic sci-fi/horror British comedy, Attack the Block, which I really love and not enough people have seen. It was a big flop when it came out, but it’s growing more and more of a following with time. Check it out, it has John Boyega, Nick Frost and Jodie Whittaker. It’s good. Now, The Kid Who Would Be King isn’t as subversive or original as Attack the Block. That movie was a social commentary about inner-city communities. The Kid Who Would Be King is a kids movie, inspired by the Arthurian legends. It’s a damn good kids movie though, and probably the best King Arthur movie since Excalibur. It’s about a kid who finds Excalibur and discovers that he is of a royal bloodline, destined to defeat Morgana once and for all. The child acting is excellent. It’s like Stranger Things, there are so many talented young performers here that I hope go places! The story is fairly simple, but engaging and full of twists. This is going to sound kind of weird, but this movie, to me, feels like what the Star Wars sequel trilogy should’ve been, or at least what it seemed to be building up to until Rise of Skywalker came in and ruined everything. I can’t really go into detail without giving things away, but you’ll see what I mean if you see the movie. The lead character is very similar to Rey. The effects and action are solid too, and it’s very funny! Overall, this is a super solid and fun movie that the whole family can enjoy. I’m super bummed that this was a box office flop too. Come on, Hollywood! Give this guy a Marvel movie or something! He’s such a talented filmmaker! Give him a movie that will actually make money to get his name out! Anyway, it’s good. Check it out."
    }
  ]
}