{"id": 3025, "title": "The Infiltrator", "starring": ["Bryan Cranston", "Diane Kruger"], "runtime": 127, "genre": ["Crime", "Drama", "Thriller"], "description": "A U.S Customs official uncovers a massive money laundering scheme involving Pablo Escobar.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/758F57DxVRLe38S1Je4O1Bjx2u6.jpg", "categories": {"plot": 7.285714285714286, "acting": 6.827586206896552, "ending": 7.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.222222222222222}, "reviews": [{"rating": "8", "text": "This is a well made, well paced, thrilling true story.  Bryan Cranston is nearly perfect in every scene.  He shows a real vulnerability and the film succeeds because it.  A-"}, {"rating": "7", "text": "'The Infiltrator' may not be the most exciting film in 2016, but thanks to the strong performance by Bryan Cranston and the excellent chemistry added by Diane Kruger... 'The Infiltrator' works better than it should on its own merit.\r Set in the 1980s, we see special agent Robert Mazur (Bryan Cranston) of the U.S. Customs Service going undercover using the name \"Bob Musella\" as a drug dealer for the drug lords making tons of money from the dodgy business. He needs to go undercover with a fake marriage, so they bring in Kathy Ertz (Diane Kruger) to play his fake future wife. She also tries to crack down the drug lords and attempts to let them reveal information about themselves.\r The money laundering is headed by Roberto Alcaino (Benjamin Bratt), whom Mazur tries to get close with and tries to get information out of.\r 'The Infiltrator', at 2 hours and 7 minutes, can have some pacing issues here and there, and the ending is a little rushed to the point where everything seems resolved quicker than expected... but there is no denying the terrific performances by the lead cast. The direction by Brad Furman is also tremendous, if at times, when the pacing is a little off.\r Other than this, this is worth seeing if you're interested in the subject matter... it's a film that deserves whatever attention it can get."}, {"rating": "5", "text": "The problem with this film was mainly the script. With a few judicious (short, one-line) explanations by the characters, the film would have been much clearer and less dull in spots. The cast was good, and once the film got going (about halfway through), it moved along. The cast was fine, especially Diane Kruger. I can only guess that it got as good reviews as it did because critics are tired of sitting through remakes, dumb comedies, and cartoons. This is a movie for adults, just not a very good one."}, {"rating": "8", "text": "This actually turned out to be a pretty great little crime thriller! Despite there being not as much action as you'd expect (especially if you've seen any of the trailers or TV spots,) the film still manages to maintain a well-engaging story throughout. The acting involved from everyone was great as well, with Bryan Cranston nailing it once again! Overall, definitely worth a view if you're interested in seeing an entertaining and worthwhile summer thriller!"}, {"rating": "8", "text": "A damn good drama that's slow to start but picks up quickly in the latter half and delivers a great overall experience. Marvelous performances all around, and Cranston is absolutely fantastic. A great, solid movie. Definitely would recommend it."}, {"rating": "8", "text": "Undercover cops, money laundering, Pablo Escobar and based on a true story. Starring the fantastic Bryan Cranston, giving a flawless performance as always. This was really great, solid well told story, although it's a little dragged out it will have you on the edge of your seat the entire time."}, {"rating": "7", "text": "Pure genius is told right here and I didn't even expect this Infiltrator to be such a great drug master. Okay, maybe that was me. Now to forward on, just watch it yourself. Not even going to spoil it for you. Yeah, go on. Just watch it, not going to tell you what happened. I'm going to watch it a second time and maybe a third time. That's how I would tell these people if they don't have any movie to watch for the middle of the week."}, {"rating": "5", "text": "I had high hopes for this film after viewing the trailer. The acting is solid, the stars are fun to watch, and the visual palette is right on the money. Sadly, there's something in the writing/directing mix which just makes this very exciting true story a little... flat. The connective tissue isn't compelling enough for me to recommend it.  I want to make a special call-out to the performance of Joseph Gilgun (Cassidy from \"Preacher\"), who has a relatively small part, but he absolutely nails it. I love him in Preacher, but I had been a bit worried that he wouldn't be able to translate to more serious parts.  Put that baby to bed. Dianne Kruger is great - though not dynamic; Bryan Cranston is solid; and John Leguizamo is a treat - I just wish they were all working with better material."}, {"rating": "5", "text": "As much as Cranston tries, he can't uplift what is a really mundane by-the-numbers flick. While most of it was technically well done, other than the generic dialog, it lacks a backbone, a real meaning and purpose behind the characters and the whole story. It's entertaining enough if you like drug and crime stories, but otherwise not really worth seeing."}, {"rating": "5", "text": "The Infiltrator boasted great acting from Bryan Cranston, but that doesn't mean it didn't suffer from a series of shortcomings. Like many based-on-a-true-story movies, the conflict was always more engaging than the characters, who are mainly cardboard cut-outs. For many who have seen this type of premise, it is also predictable for the most part. When conversations happened, it was telling that the script wasn't a focus, as the acting sold the lines of dialogue much better than the script could.\rThe last half is definitely the best thing to watch in this 130 minute movie that could have shorter in the first act. Perhaps the only thing that sold this movie to me was Bryan Cranston and the scenario at hand. Everything else was primarily a letdown, and I can only grant this movie a seal of mediocrity at best. Personally, I was expecting more from the characters."}, {"rating": "6", "text": "Bryan Cranston plays a real-life Federal agent who assumes the identity of a money-laundering exec to burrow undercover in Pablo Escobar’s drug trafficking operation. There's nothing original about this story or especially stimulating about this film. Cranston and the rest of the cast do credible jobs. It's interesting to watch the scheme develop, but there's almost no tension or conflict to create compelling drama. I’m sure the intention was to take a somewhat businesslike approach to telling the story with some personal struggle sprinkled on top. That was accomplished, but it's in no way memorable."}, {"rating": "8", "text": "Bryan Cranston turns in an excellent performance.  The movie is well directed, acting is good, storyline is slightly weak but still delivers excellent drama."}, {"rating": "7", "text": "This movie is based on real facts and autobiography of Bob Mazur, a special agent who worked undercover and managed to infiltrate Pablo Escobar’s drugs and money-laundering empire in 1980-es.\r Bob Mazur’s work led to a fall of a few international banks, BCCI (or Bank of Credit and Commerce International) being the biggest one, and an arrest of over 100 drug traffickers and money launderers.\r Besides the interesting story, the movie is done quite professionally, it is intense, it has an excellent casting, and performances across the board deserve praise."}, {"rating": "7", "text": "It may have certain aspects of its narrative embellished for effect, and it may also feature a host of cliches and elements that you've seen in other undercover/crime/drug films, but by and large \"The Infiltrator\" was never boring. It's shot, paced, and directed in a terrifically engaging way, featuring all-star performances from its great cast. And, though the exaggerated/fallacious scenes may threaten the film's integrity as a retelling of the biographical subject's actual life, the scenes the filmmakers decided to jazz up at least made for some of the film's more memorable moments. Again, it's not perfect, and -- if I'm being honest -- probably not for everybody. But I enjoyed the ride overall."}, {"rating": "8", "text": "In this game, there's no room for any mistake!An undercover theme based on the real event. In the 80s when the drug trafficking was so high in the United States that came from the Latin America through the southern border, the US customs service sent its members to infiltrate among them to bust red handed. So this is one of the events where a married man with two children takes a most challenging assignment that might end up badly if he makes a single mistake. In such a tight spot how he and his team are going to achieve the one of a biggest crack in the history revealed in the remaining.So now we know the story, but this is not an easy game. There are many scenes that would pull you to the edge of your seat. After the wonderful performance in 'Trumbo' that got him an Academy Awards nominee last year, now he's back with another great character display. I'm talking about Bryan Cranson. Another Oscar's nod is quite possible in a second year row, but lets wait and see. This story mainly focused on him, but John Leguizamd was also impressive in an important supporting role and so the Diane Kruger.I think it was a most realistic undercover film among others I have seen. The drugs were not shown much and so the sex and nudes, despite the plot revolved around that. Even the stunts were minimised, but those rare action sequences were so good. The majority of the film was drama with lots of thrill scenes. The two hours long film, and the story were narrated with a good pace. Not to be missed if you like cops and thieves game.8/10"}, {"rating": "8", "text": "Cranston brings a wonderful performance to the screen and the film itself is focused and straightforward, complete with an exciting ending scene. It's not for everyone, but it's progressive enough to capture my attention."}, {"rating": "8", "text": "A well acted gripping drama for sure. Well worth the admission price. Can't fault some of the predictable scenes since it's relating a true story. Will definitely make you jump in your seat a few times."}, {"rating": "10", "text": "I actually really enjoy the movie. The tension is great. You could almost feel the insecure feeling and uncertainty from the character that they might die in the next second. Great movie."}, {"rating": "8", "text": "A really good movie, Bryan Cranston's acting is really good as usual and the whole plot, which is based on real events, makes the story more interesting."}, {"rating": "7", "text": "This movie was a blast from beginning to end. The acting was fantastic from \"Bryan Cranston\" as usual. The story was riveting throughout and it keeps you on edge the entire time."}, {"rating": "9", "text": "I remembered the story at the time it occurred but as portrayed by the cast, it is one huge terror ride from beginning to end. Someone wrote that the movie was not exciting; I agree. It was terrifying. That someone put themselves in that position and took down drug dealers and a Middle Eastern bank in the process . . . it's all the the history of the event but to see it on screen . . . WOW!"}, {"rating": "8", "text": "Amazing to see how low tech crime busting was in the 80's.  Also amazing to see that undercover cops infiltrating drug cartels went to their homes every night.  YIKES!  how come families were not massacred?  Well done movie, tense moments, not terribly action filled, more like real life detective work."}, {"rating": "3", "text": "What a waste of a good story. Terrible directing, bad cutting and confusing. No background on the characters, no character development. Would not recommend it"}, {"rating": "8", "text": "The Infiltrator is another great true story movie having a less is more attitude to it. One thing that can't be doubted is that the movie is well acted as I believed each person was who they were supposed to which is the film's best strength as well as the film having some great scenes of drama and even tension. The movie also was visually interesting because of the 80s style filter on the lens so it felt even period correct. the only missteps for the film was sometimes cutting scenes together didn't work or didn't need to be in the movie and the relationship between the Undercover agent and his wife is somewhat weak. All and all this is a very solid film and in my running for the top ten films of 2016"}, {"rating": "7", "text": "MAN! This was like torture. The entire movie I was on pins and needles worried that Walter was gonna get merc'd. The betrayal of someone you call a friend and family is too far for me so by then I was worried that wouldn't get it. Good acting, and great scene for his secretary's birthday."}, {"rating": "5", "text": "and the guilty pleasures of encountering those close calls..The Infiltrator Furham's close call philosophy may not wear down but it surely isn't a brighter picture if accounted the entire venture. It thrives on intensity that makes you and the characters sweat but it's the performance that makes you recall the stakes and not the writing or execution. But it also doesn't suggest that it isn't worth exploring the world, it's just that the actors deserved much more like we did. Ticking for more than two hours, it also fails to differentiate the terms of an elaborative script and an overstretched one. The narration is gripping and adaptive but is also repetitive especially if considered the entire first half that resonates eerily with the second one. The conversations are pragmatic but the writing isn't as layered as the writers might suggest. It just floats on the surface and scraps off the thrills and chills by focusing entirely on the crispy part while neglecting the husky essential bits. Cranston at the heart of it, is what makes the entire two hours worth diving into as he delivers in each frame with a more reserved yet expressive emotions. He is way too cunning, he can be lethally cruel (the birthday cake sequence is one of its finest) and unequivocally generous. But between that, he gets caught multiple times and it's that resistance of not giving in, is what makes him stand alone. Kruger is decently convincing along with Leguizamo and Ryan. Fruham's execution is appropriately up to the mark and nothing above the line, its mediocrity fails to elevate few flat moments on the script which could have factored a lot in here. Cranston and the guilty pleasures of encountering those close calls are the peak moments of The Infiltrator, if a goer for either of it, it is then thoroughly entertaining as it is in plethora."}, {"rating": "7", "text": "This is a somewhat stylish film, with a heavy use of yellow tints in many scenes and it certainly has the look and feel of a relatively urban, gritty watch. I didn't feel there was a great deal to the plot though and that was its downfall, in my mind. There is, of course, inevitably, some strong bloody violence and throughout I felt unsure of the true intentions of the main character, Robert Mazur. I struggled a bit with the sort of inherint tackiness present but I concede that its interesting in terms of observing how such a lucrative underground industry worked. Suffice to say, if your squeamish about blood or violence then this is best avoided but as a drama based on a true story its not bad - I just felt it was missing a bit of extra substance that would have made it more engrossing. I did feel that Bryan Cranston gave a reasonably decent performance in the main role of Robert Mazur though, particularly towards the end. If your a fan of his then its worth seeing, otherwise I wouldn't go out of your way to see it though."}], "recommendations": ["breach", "widows", "good_time", "a_most_wanted_man", "the_accountant", "the_equalizer_2", "white_boy_rick", "donnie_brasco", "end_of_watch", "beirut", "the_place_beyond_the_pines", "bad_times_at_the_el_royale", "american_gangster", "broken_city", "man_on_fire", "prisoners", "a_most_violent_year", "arbitrage", "the_bank_job", "triple_9", "the_next_three_days", "flight", "no_sudden_move", "knives_out", "the_experiment"]}