{"id": 2555, "title": "The Strangers: Prey at Night", "starring": ["Bailee Madison", "Lewis Pullman"], "runtime": 85, "genre": ["Horror"], "description": "A family’s road trip takes a dangerous turn when they arrive at a secluded mobile home park to stay with some relatives and find it mysteriously deserted. Under the cover of darkness, three masked killers pay them a visit to test the family’s every limit as they struggle to survive.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/vdxLpPsZkPZdFrREp7eSeSzcimj.jpg", "categories": {"plot": 4.0606060606060606, "acting": 4.32, "ending": 4.733333333333333, "soundtrack": 8.142857142857142, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.375}, "reviews": [{"rating": "9", "text": "Watch The Strangers: Prey at Night Full Movies Online Free HD Watch here --> http://ifsanmovies.cf/movie/371608/the-strangers-prey-at-night.htmlWatch here --> https://ifsanmovies.co/movie/371608/the-strangers-prey-at-night"}, {"rating": "9", "text": "The Strangers: Prey At Night might be filled with horror cliches, but the extraordinary acting, catchy song choices, and the 80's John Carpenter horror throwback will definitely make those cliches much more entertaining. In addition to making this film stand out among other slasher flicks, this one hour and thirty minute bloody roller coaster was definitely worth the long wait."}, {"rating": "9", "text": "8.6/10  A truly surprising near perfect homage to old school 80s slasher/horror, that improved upon the mediocre first film by a massive amount. The John Carpenter influence within the ominous atmospheric camerawork and soundtrack was prevalent and worked flawlessly. The old trailer park setting was so fitting for the overall story and served as an unsettling playground for brutality to set in. This film upped the intensity to an extremely entertaining level with some very unexpected scares and some truly bizarre and grotesque imagery. While some of the cheesy cliches were around, they felt like they belonged there for it to truly be an old school slasher. Instead of random knocks and stupid games played by the strangers in the first film, there were vicious bouts of action packed visceral brutality and damn right insanity by the villains. Johannes Roberts is a director to watch after this awesome film and his style is seeping with foreboding fun. Overall one of the more enthralling and exciting horrors I've seen."}, {"rating": "8", "text": "I really enjoyed this movie. You know what to expect if you've seen the trailer or the original film, and it doesn't disappoint. There are plenty of horrifying moments, and I could feel the energy and positive reactions of others in the theater around me at key moments during the movie. It doesn't break any new ground, but it is a good follow-up to the original. If you like horror films (of the serial killer variety), you will like this one as well!"}, {"rating": "10", "text": "Bigbinininigjgfrssefyjbonomomiguteqassszxsfbmmlnklljbcdfhjinnomoniihugfyyfguuhiihyftdyg"}, {"rating": "9", "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"}, {"rating": "10", "text": "Great, scary movie that made me jump.After seeing this movie and reading the reviews, I was totally scared by it. What's even more horrifying is that its based on true events. Yes the acting was somewhat comedic with the family barely having survival skills, not keep their phones on them (granted I think the mom was tired of the lack of family connection and wanted the phones off) and not hiding better. Why the daughter was allowed to run off as she did, I dont know. My butt would have been blistered if I spoke to and acted towards my mom as the daughter did. Those strangers were dang freaky and always popping up, you thought there was more than three. The music was classic. Crazy to die by an air supply or bonnie Tyler sappy song. Sounds like the strangers have relational issues, to say the least."}, {"rating": "9", "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "10", "text": "◇¡◇¡◇¡◇¡¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡¡◇¡◇¡◇¡¡◇¡◇¡◇¡$*$*$*$*$*$*$*$*$*$*$*$*$*$*●⊙●⊙●⊙●⊙●⊙●⊙"}, {"rating": "10", "text": "Better than the Original !!!!I am a die hard horror fan and thoroughly enjoyed this movie. Much more fast moving than the first film, and somehow more believable. I loved the kills, the creepiness, and the overall vibe. I'm surprised because it exceeded my expectations! The Strangers 2 is easily an improvement over the 1st on every level."}, {"rating": "10", "text": "Intensely terrifying !!!!!The original in 2005 is still the scariest 'could really happen' horror movie I've ever seen. The second is more intense with the emotionally taut death scenes and timely background tunes. I jumped twice at the theatre."}, {"rating": "10", "text": "The Strangers 2 is scarier than the 1st is. This sequel takes place ih a trailer park. The actors and director are different. I enjoyed the 80's music utilized throughout the film. The techniques used were great and the film has more of an 80's feel than a modern horror feel. The strangers are slaughtered which was more rewarding, in the 1st movie they disappear, A-."}, {"rating": "9", "text": "+×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆⊙☆¡"}, {"rating": "9", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "10", "text": "Perfect horrorI remember when 'The Strangers' came out in 2008. It was such a unique film, I remember feeling like I'd never seen anything like it. It certainly stuck with me long after leaving the theatre. The sequel was announced almost immediately and yet for some reason we had to wait 10 years to finally see it. So was it worth the wait? You better believe it was.This film is nothing short of incredible. There isn't a single poor scene in the film. Each and every one of them is like a little mini masterpiece. A lot of that stems from the characters. They are perfectly created. They are flawed (thus realistic) and yet likeable and relatable at the same time. This is a crucial element to what makes this film so good, because I desperately wanted these characters to survive.The same trio of villains are back again and they are even more menacing this time around. They are relentless in their pursuit and it has to be said that the pacing of this film can take your breathe away. There is also a jump-scare (I'm not sure it even used music, simply the visual and a line of dialogue) that is unquestionably one of the most effective I've ever seen.Don't expect the film to play out the way you expect it to. I know it certainly didn't for me. It went to places that I never foresaw and I loved them all. The music, the camera work, the creation of tension - they all combine to produce a horror masterpiece that is even better than the already brilliant original. Please see this film."}, {"rating": "8", "text": "Change is the name of the game for this sequel. Prey at Night ditches it's predecessor's slower, more methodical approach in order to go all-out '80s slasher throwback on us. It's a darn good one too.While callbacks to the first film show that many of this masked, serial killing family's rituals are still very much alive, it's clear that they've been up to a lot in the 10 years since we last saw them. They've evolved. They're bolder, more experienced, and even a little sloppier as a result. One of the interesting things about the first movie was finding out that Dollface was a beginner who maybe even struggled a little with the act of taking lives. To see her now as a seasoned murderer without a single speck of hesitation or remorse is haunting. All three of them have a greater level of confidence. Gone are most of the mind games. These psychopaths are ready for the chase.The location fits their new approach well. A wide open trailer park replaces the more confined setting of the earlier remote vacation home. It's got a Camp Crystal Lake vibe (sans lake) and allows for bigger set pieces to alongside the increased amount of gore. I love how the \"Strangers\" are still making great use of shadows to eerily watch their prey from a distance. It was one of the defining aspects of the first film for me and it's just as creepy as ever.The soundtrack is once again a notable part of the experience. Just not as frequently as before. '80s pop replaces the country music and delivers some great moments. Kim Wilde's \"Kids in America\" is used to make one of my favorite openings to any movie ever.Did I mention it's gorgeous too? Johannes Roberts loves showing off each killer's creepy mask with beautiful cinematography. The colorful lights and underwater shots of the pool scene are stunning in their everyday nature. This definitely feels like a real place families would go on vacation and the movie makes every average inch of it look great.So what didn't work for me? Only two things really. The expositional family drama is rather cliché and doesn't do anything more than focus on the antagonistic side of the protagonists' relationship with one another until they reach their (final) destination. At which point the action ramps up. Nothing too bad, but kind of \"eh\" overall. Then there's the ending scene which I hated. I get that this is part love letter to the slasher classics from back in the day. Shoot, one of my favorite scenes is a clear homage to the ending of Tobe Hooper's The Texas Chain Saw Massacre. But right before the credits roll it kind of goes a bit too far and steps on the fact that these killers are supposed to be average people. It's part of what made the previous Strangers so special.I think watching this in close proximity with it's predecessor is the best way to do it. Doing so increased my enjoyment a lot as it provided some nice catharsis after the events of that film. You'll also get the full picture of just how strongly the antagonists have grown into their career of senseless violence. This is an almost entirely different kind of horror movie than the one it serves as a follow-up to, but the way it handles the killers makes it feel like the next logical step. The way it borrows from it's inspirations makes it more than just a good emulation, but a slasher strong enough to maybe even stand beside those greats it so clearly looks up to.8.5/10"}, {"rating": "8", "text": "As someone who really enjoyed the first film I'm quite surprised that a sequel took so long to appear. I wasn't sure what to expect but I knew that I wanted to like this... and I did! I actually liked it even more than I thought I would, I was prepared for a lesser copy of the first film but that's not quite what we got. Yes, it has the same basic concept, but other than that it's got a totally different vibe this time; 80s homage, stylish, hip, gruesome yet tongue-in-cheek and it works. You can tell that the director and the performers really cared about what they were doing and this entirely makes up for a fairly empty script. Visually, this is full of eye candy; and scares-wise it's pretty good too, I definitely jumped a few times and felt very unsettled the whole way through which to me. There was merely one moment towards the very end that I genuinely didn't like that I thought was one step too far in homage but overall my expectations were met and exceeded and not only am I interested in following this director but I'd like to see another sequel but only if the same level of effort is put into it."}, {"rating": "3", "text": "How in the world does this have a 50 on here??? Terrible movie. The characters were SO dumb, like the dumbest characters I've seen in a movie in a while. Just such a cheap, conventional straight to DVD cash grab."}, {"rating": "3", "text": "I've got more questions than critiques.1. It's been 10 years since the first movie came out and this is what we got?2. There's been so many slasher movies, what makes this different?3. Why even make a sequel when your ideas are dry?4. Why dose it have an 80's-like style to it? None of it adds anything to the overall quality of the film. It's not even set in the 80's, by the way. For style purpose I guess.5. Why is the only good scene in the whole movie takes place at a swimming pool?And finally...\"Oh My God There's a Bang at the Door\""}, {"rating": "0", "text": "This is the sort of movie you should walk out on. I wished was over once I reach the climax of the film. The plot was ridiculous for a number of reasons, one of them being that certain things don't make sense. Although based off a true story, there are too many physical elements to the movie that are impossible/unlikely in real life. There were so bad elements that you may end up laughing at how bad the realism is. If you happen to see the movie (albeit a bad choice) you'll notice the antagonists draw out their actions. It is irritating. Don't waste your time with this film, as there's a strong chance you'll regret your choice."}, {"rating": "6", "text": "Easily the best part of the movie is the music -  Bonnie Tyler's Total Eclipse of the Heart is so money.  However, the complete randomness of the killing is just sort of weird.  Hollywood is anti-gun, yet they promote guns in this movie as the only practical solution when facing knives and axes. It's also crazy short."}, {"rating": "4", "text": "I think the film, much like the first film, does a great job at making the characters relatable and the great acting by the cast really helps sell the situation that they find themselves in. It's everything else that is kind of eh.The Strangers 2 focuses less on suspense, more on outright action and features an incredibly generic, predictable plot that you can guess from beginning to end without issue. It's not a terrible watch but it's unoriginal and doesn't really live up to the hype despite the decade wait between sequels (for whatever reason)."}, {"rating": "0", "text": "This has got to be the laziest, brain dead, idiotic \"horror\" movie I have ever had the displeasure of experiencing.  I'm surprised the main characters lived long enough to make it to these events as they are so stupid, you would have expected them to forget how to breathe long before.  Not only do they make decisions no rational human would make, they essentially stand there and wait to be killed.  There is nothing scary about the antagonists other than they seem to be able to teleport and mystically sense where the protagonists are at all times.  At one point the protagonists have a gun... A GUN!.. and their persuers have only used knives or sharp objects.  So... the movie is over right?  They have an extreme tactical advantage over their opponent.  Surely there is no possible way they can combat a gun with a few knives.  Except, the gun dissappears a few scenes later!  It's never fired, despite having one of the people who murdered their mother and father dead to rights in point blank range, it's never shown to be taken or dropped or even holstered.  It's just magically gone so the rest of the movie can happen.  The creators of this film believe that if someone's throat is slit, they die immediately.  Do they believe that your heart is in your throat?  You have to bleed to death!  Many people have survived getting their throats slit.  This movie was made by braindead people for braindead people.  You have to be dumber than a rock to think this movie is plausible in any reality.  People are not dumb enough to just sit there while a psychopath stabs you.  Arms are a thing, and it's instinct to move them in front of things that could hurt you.  Yes, the people in this movie had to fight their instincts in order to be complacent in their own murder!  Watching stupid people make decisions bound to lead directly to their deaths is not scary, or fun to watch in any way.  This \"movie\" is garbage through and through."}, {"rating": "4", "text": "A film that takes a 1980's slasher horror style but does little with it. It's hard to get behind any of these dumb horror characters and besides an interesting pool scene it not really worth your time. Overall I didn't hate this film but it's forgettable a high 4. C"}, {"rating": "5", "text": "Undoubtedly, there were better continuations of horror films and it seems that despite the efforts of the creators to warm up the adopted productions, even the most catchy titles may fail. The defeat the more ignominious because from the first part passed a decade and you would expect that nothing of this production after that time will not hurt - you guess... it is a disappointed production."}, {"rating": "5", "text": "Appart from two surprisingly decent scenes in the last half hour of the movie and a good soundtrack, \"Strangers: Prey at Night\" doesn't offer much in terms of scares and originality. If you liked the first \"The Strangers\" movie you might find something to like in this one, but it really isn't anything special."}, {"rating": "5", "text": "\"The Strangers: Prey at Night\" was a movie that had moments of tension and danger that ended up liking, but the performances, the beginning and the end of the film were extremely bad. It was undoubtedly poorly executed, for a writer who directed a decent first film."}, {"rating": "3", "text": "The Strangers: Prey At Night, a sequel to a movie that no one even remembers let alone wanted. Remember that movie from 2008 where these crazy people broke into a house, killed some people and then left? No? Well here’s the sequel anyway cause why not? Everything is worthy of a sequel these days so let’s join The Strangers on their quest to terrorize and brutally murder more people for an hour and a half. They’re crazy, they wear creepy masks and they kill people. Not much to it so if you’re expecting The Strangers 2 to build enough atmosphere and tension to keep you entertained well don’t.A family of four are staying in a super creepy secluded mobile home park and are stalked by everyone’s favourite masked psychopaths, The Strangers. After a ten year break it doesn’t seem like the Strangers have learned anything from its previous film. Yet another completely unnecessary sequel that you can throw into the “never gonna watch it again pile.” Yes, The Strangers: Prey at Night really does have it all. Everything from “based on true events” drifting across the screen in the hope of creating a spooky atmosphere, the main character falling while running away from the bad guys and characters dying but not really. It’s got a couple of interesting scenes and at one point it looked like it was paying homage to classic 80s horror flicks but The Strangers 2 did not pull itself together and brings absolutely nothing new to this genre. The mind dulling horror movie clichés are forced into every scene which builds into a bitterly brutal ending that only leaves the audience unsatisfied. Not recommended, I don’t care if you’ve already seen Infinity War twice and looking for something new, go see Infinity War again because The Strangers 2 is not worth it."}, {"rating": "0", "text": "Es casi lo mismo de la primera película, sinceramente no vale la pena una película tan mala, o sea, se tardaron 10 años en traer esto al cine??? hubiese quedado mejor si la hubiesen estrenado directamente a video, ojalá no se les ocurra sacar una tercera parte, ya que si van a hacer de nuevo lo mismo no valdrá la pena, a menos que desarrollen aunque sea un poco, la historia de los villanos, estoy seguro que mas de alguno se pregunta ¿Quienes son? ¿Por qué se dedican a matar? ¿Serán enfermos mentales o simplemente asesinos psicópatas/en masa?"}, {"rating": "4", "text": "Un desastre argumental no hay por donde pillarla.La pelicula da la sensacion que quiere ir muy rapida y peca de muchos fallos."}, {"rating": "5", "text": "An average Horror movie although I did not kind like the end. I mean the very end."}, {"rating": "7", "text": "I went in with quite low expectations, which in hindsight may have helped with my overall enjoyment of the film. I actually really enjoyed it and was surprised at the quality of the soundtrack. While not a great film, for horror fans and fans of the old slashers, this film delivers a fairly tight paced, horror film that I feel most horror fans should get into. The premise, as shown in the trailer, is simply, a family are stalked in a trailer park by 3 'strangers'. Not much else really too it, but I found the characters to be ok (no-body particularly annoyed me) and some of the deaths were well done. Overall I enjoyed it and can recommend to those who enjoyed the first and to those that are into horror slashers."}, {"rating": "5", "text": "Forced in every way and its characters don't matter at all, even when they start to die and yet it wasn't as disappointing as I thought it would be.But of course is completely forgettable, the main characters are exasperating especially for the repetition of situations.There's an incredibly ridiculous moment where the young dude asks his father directly if he really plans to shoot the guy with a mask that is threatening them with an ax, counting the fact they're coming from a room where there are two dead bodies. Really?If you manage to pass those elements I think you might enjoy it as an ideal film for a Sunday if there are no better options.I give it a 5 because I liked the atmosphere and the handling of the camera at certain times. Those approaches from the old school were a nice touch."}, {"rating": "5", "text": "I think going into this movie you should know what to expect from the trailers, or if you have seen the previous Strangers film.  That being said it is right on par with the previous, some definite scary moments, a lot of tension throughout, and a fight for their lives.  Don't expect a gripping, thought-provoking movie, and you should be pretty entertained with the movie."}, {"rating": "4", "text": "The original The Strangers, which came out in 2008, wasn't particularly loved by critics (it got a 45% on Rotten Tomatoes), but I was quite a fan of it. It was enjoyable and I dug the somewhat realistic take on the slasher genre. So when The Strangers: Prey at Night was announced, I was fairly hopeful that we'd get a solid sequel. Unfortunately, we did not. The Strangers: Prey at Night is directed by Johannes Roberts and stars Christina Hendricks, Bailee Madison, and Lewis Pullman. It follows the same trio of killers from the first movie as they prey on a new group of unsuspecting folks, and the setting is probably the movie's best aspect. The concept of setting this story in a trailer park is pretty compelling and interesting, and it held my attention throughout the film. Alas, this movie is dragged down to a fairly low level by a mediocre script and all of the characters being unbelievably stupid. I mean really, really stupid. I understand that this is a slasher film, and the characters in slasher films aren't typically the smartest peeps on the block....but still, the characters in this movie make decisions that legitimately don't make any sense. I also have some issues with the story itself, but my issues are mostly towards the end so I'll shy away from them so I don't spoil anything. Just know that I'm not a fan of the direction that they go with the trio of killers late in the movie. There's still some enjoyment to be had with this movie. As I said, the setting is interesting, and I still do find how nonchalant the trio of killers are to be compelling, but ultimately, in my opinion, it falls short of the first film in almost every way."}, {"rating": "1", "text": "The Strangers: Prey at Night is the worst movie I've seen so far this year and that's including Summer of 84. With atrocious character writing, worse than the first strangers film, this movie has no idea who to focus on. You don't really get a glimpse as to who the main character is really at all. Not to mention, the characters aren't interesting in the slightest. The film gives you nothing to cheer for. The family drama in the first 20 minutes is rushed and forced upon the audience and doesn't pan out well throughout the film. The first strangers film was memorable for its suspense, yes the character writing in that film was bad as well, but at least I was on the edge of my seat throughout certain scenes in that film. In Prey at Night, there's no suspense. Absolutely zero elements of horror. It's like stalker porn on crack. I'm not exactly sure why there's an 80's style score in this film either. Prey at Night adds nothing new. Its ideas are dull and dry and it produces honestly the worst ending to a film I think I've ever seen. I would have liked to see some connection to the first film, or at least give us some sort of motive for the actions of the killers. At least make the film of interest and let us know about the attackers, but we get none of that. They just kill because \"why not\" and to me that's lazy writing and extremely boring to watch. The one redeeming quality to this film was the 5 minutes pool scene, that's it. The rest is utter nonsense.10/100"}, {"rating": "6", "text": "The Strangers Prey at night is very boring the characters are awful the scenes I liked was when Cindy dies and her son and husband see her the pool scene that scene was cool good fighting in the pool was cool I did not see the first but this movie was not scary at all I believe that movie is better oh yeah there is a cliff hanger at the end super boring and uninteresting characters also the villains were not impressive at all so disappointing I did not see the first I know that movie will be better so I give The Strangers Prey at Night a D-"}, {"rating": "5", "text": "Just watched it and thought it was a funny movie with some gore in it.Dude, the girl just killed your mom and stabbed your sister! Shoot her!!! But nooo, he decides to tell her to put the knife down and run to hide in the most stupid places.Why take the perfectly working car and flee if we  can run around yelling each other's names for the killers to know where we are?The Wyatt Brothers would be completely unable to make fun of this one"}, {"rating": "4", "text": "Standard modern slasher stuff here folks. Only real improvement from the original Strangers is the brighter colours. Gonna be 100% honest with you all, I was piss drunk watching this and don’t remember much so I guess I’ll watch it again sometime but not anytime soon.4/10 Jay x"}, {"rating": "3", "text": "Although the first one left me bored, it still felt watchable. This one had it all with an edgy teenager, brother who teases, dad trying to make everyone happy, mom who tries to relate but feels oddly suspicious, horror movie logic where things make sense one second and absolutely no sense the very next. I wouldn’t call this a horror movie or even a suspense movie, thriller at best."}, {"rating": "6", "text": "The Strangers: Prey at Night is a sequel to the 2008 horror movie The Strangers, in which a family is stalked by three masked assailants. The sequel takes place in a trailer park, with the family trying to survive against the same attackers. However, the sequel is not as good as the original due to a reliance on cliches and weak characters. The pacing is slow, and the plot is predictable. The villains are the best part of the movie, but the movie is bogged down by the bad decisions made by the characters. The soundtrack is good, and the visuals are well done. The final scene is unbelievable and the ending is unsatisfying. Overall, it is not a terrible movie, but it is not as good as the original._______________________The Strangers: Prey at Night es una secuela de la película de terror de 2008 The Strangers, en la que tres asaltantes enmascarados acechan a una familia. La secuela tiene lugar en un parque de casas rodantes, con la familia tratando de sobrevivir contra los mismos atacantes. Sin embargo, la secuela no es tan buena como la original debido a la dependencia de clichés y personajes débiles. El ritmo es lento y la trama es predecible. Los villanos son la mejor parte de la película, pero la película se empantana por las malas decisiones que toman los personajes. La banda sonora es buena y las imágenes están bien logradas. La escena final es increíble y el final es insatisfactorio. En general, no es una película terrible, pero no es tan buena como la original."}], "recommendations": ["dark_skies", "chernobyl_diaries", "house_of_1000_corpses", "insidious_chapter_2", "texas_chainsaw_3d", "paranormal_activity_2", "malignant", "devil", "paranormal_activity_the_marked_ones", "insidious", "countdown", "final_destination", "vacancy", "happy_death_day", "p2", "final_destination_2", "terrifier", "the_ring", "the_possession", "the_ritual", "happy_death_day_2u", "the_last_house_on_the_left", "the_forest", "it_follows", "crawl"]}