{
  "id": 2019,
  "title": "The Ridiculous 6",
  "starring": [
    "Adam Sandler",
    "Taylor Lautner"
  ],
  "runtime": 119,
  "genre": [
    "Western",
    "Comedy"
  ],
  "description": "When his long-lost outlaw father returns, Tommy \"White Knife\" Stockburn goes on an adventure-filled journey across the Old West with his five brothers.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kPc80jywR5Nm2KIQjkY5i4VXSx4.jpg",
  "categories": {
    "plot": 3.769230769230769,
    "acting": 4.029411764705882,
    "ending": 2.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.833333333333333,
    "funny": 4.824561403508772,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The Ridiculous 6 is purely another example of Adam Sandler's crap. Its official he has invaded our theatres and our homes. Netflix certainly doesn't value quality after offering him a movie deal. The cast is full of typical Sandler collaborators and some talented names like Nick Nolte and Luke Wilson. Sandler co-wrote this movie and if he gave a damn he maybe could've created a notable comedy franchise with this movie because the story has a good amount of potential but the delivery is terrible. The characters are extremely undeveloped and unfunny. Then you have the completely terrible character played by Jorge Garcia who does not speak a comprehendible word in the whole movie. Then the movie is too long and is filled with plenty of obvious Sandler stunt doubles in the action scenes. Then the tone is some unpredictable and sometimes it even difficult to see who the main character is because there it seems like different actors get too much attention at times. As far as I'm concerned Netflix just pissed away 60 Million."
    },
    {
      "rating": "10",
      "text": "To say that The Ridiculous 6 is art is to spit in the face of The Ridiculous 6, for the Ridiculous 6 transcends art in its hilarity. The movie has a fairly simple premise as White Knife (Adam Sandler) goes on an adventure with his 5 brothers played by some absolutely hilarious actors. This 119 minute masterpiece had be giggling like a small baby that i kidnapped and put in my basement. With this beautiful movie, which transcends all emotions and even life itself, Sandler has forever put himself on a high and might chariot soaring above bad film makers like Kubrick, Fincher and Scorsese. This movie has a single flaw, and that flaw is the lack of Kevin James as Paul Blarts great great great great great grandpa Graul Blart. With Graul Blart the Paul Blart canon would be tied with The Ridiculous 6 forever making the most perfect series of movies ever knows to man"
    },
    {
      "rating": "7",
      "text": "I really enjoy this movie. Makes me laugh and one of Sandler's films I like, not too bad."
    },
    {
      "rating": "5",
      "text": "The script by Sandler and Tim Herlihy has a bunch of western cliche's, it's predictable and this comedy gets one laugh so sad, but this film was sort of interesting. But the other hand I am glad I'm on the couch. Adam Sandler is Tommy, he was raised by Indians he is approached by his long lost father Frank Stockburn (Nick Nolte) who tells him that he needs 50, 000 or he'll get killed by his own gang. Tommy goes on a journey to find his 5 brothers (Rob Schneider, Taylor Lautner, Jorge Garcia, Terry Crews and Luke Wilson). This film is just painful, these talented people (expect Sandler) are just stuck in a lazy Adam Sandler film. But I found some moments. 2.5 out 5 stars"
    },
    {
      "rating": "5",
      "text": "Certainly expected something better given how many comedic actors are in the movie (and I don't hate Sandler as much as others do). But was too ''ridiculous'' in the end and not funny or just dumb at too many parts. Not that it's completely bad, the story ain't that bad and there are certainly lots of worse movies."
    },
    {
      "rating": "2",
      "text": "Adam Sandler’s straight-to-Netflix film, The Ridiculous 6, represents an even larger fall from grace for the once successful comedian. After seeing the trainwrecks that were Grown Ups 2, and That’s My Boy I figured Sandler couldn’t stoop any lower, I was wrong. The Ridiculous 6 is unfunny, terribly acted, overly silly, dumb, and truly terrible in almost all facets. It seems sad because Sandler is talented, but if he continues making films like this, he can’t maintain an audience.\rAdam Sandler has become increasingly lazy over the last few years, but this film goes beyond that. Ridiculous 6 features an odd type of humor, which is a combination of dumb, silly, and racist. The humor is so stupid, it rarely registers as funny, but often feels like awkward moments of randomness. The film features a ton of cameos, most of them are distracting and not funny, except Vanilla Ice as Mark Twain.    The humor was not only dumb, but it was exceedingly silly too.\rThe film’s acting is terrible, on every level. Sandler feels like he’s mailing in his performance, while Taylor Lautner takes a giant step backwards as an actor. While Rob Schneider, Luke Wilson, and Terry Crewes manage to not come across as distractingly bad, almost every performance is awful. What doesn’t help the acting is that the film has almost no story, terrible dialogue, and characters that are just racist stereotypes. It’s sad looking at it, because many talented actors appear in the film, but they are all totally wasted.\rThe story of Ridiculous 6 is more a bunch of random situations sloppily put together, built entirely on logical fallacies. Since the story is terribly constructed it feels bloated, and the film drags on. In retrospect the film is really about a half-hour too long. On top of that the film’s villains are weak, and thus the film’s conflict feels fake, and forced. Really when looking at closely it all comes down to the fact, that the film was lazily constructed.\rIn conclusion The Ridiculous 6 represents a new low for Adam Sandler, who continues to get lazier, and lazier. The film is dumb, silly, racist, boring, not funny, and features a story that is so poorly written a 4 year old could have produced a better story. Hopefully, Sandler feels a negative backlash and finally takes some pride in his work, because he clearly has none now."
    },
    {
      "rating": "5",
      "text": "It provides hit and miss laughs, some laughs being genuinely from the diaphragm, there are some good morals sprinkled in as well. However, Sandler always produces something with a pathway of toilet humour and the occasional causal racism/sexism. I would've bumped this up to a higher rating as pixels deserved but it lacked the magic and well executed action scenes of Chris Columbus."
    },
    {
      "rating": "0",
      "text": "Mr. Sandler, what you've just released is one of the most insanely lazy movies I have ever watched. At no point in your rambling, incoherent film were you even close to anything that could be considered entertainment. Everyone in this subscription video service is now sadder for having realized that you got money from them that could've funded something actually entertaining. I award you no points, and may God have mercy on your soul."
    },
    {
      "rating": "2",
      "text": "More Sandler-infused crap. Some parts hint at a funny scene only to be smothered by the usual nonsense.\r Rob Schneider and the Left-Eye Gang were probably the high points for me. Taylor Lautner and Sandler himself being the low points."
    },
    {
      "rating": "0",
      "text": "Honestly I'm thinking of canceling my subscription to Netflix, only to express my discontent towards them. It's amazing that this mess come from the same managers that Daredevil or Beast of no nation."
    },
    {
      "rating": "2",
      "text": "Well the title certainly does the film justice. Yes Adam Sandler has made much worse films in the past, but this is also easily up there with some of his most idiotic attempts. First off, don't even get me started on his pathetic attempt to sound \"cool\" with that deep and raspy voice of his the whole film. As for the rest of the film in general, with the exception of a slight chuckle or two, I found myself cringing and shaking my head in disbelief at almost every pathetic attempt at a joke or one-liner. I should've known better with it being a Sandler film that every other joke would be a fart or poop joke. And much like the characters, the whole film also felt jumbled and confused as to what direction it wanted to go in or what its intention was, especially towards the end, which by then made the film feel even more pointless. Overall, if you don't mind killing two hours of your life (along with some precious brain cells), then don't hesitate. Otherwise, I'd steer clear of this one. Surely Netflix can do better. They've usually offered much better original content than this."
    },
    {
      "rating": "1",
      "text": "The best part of this movie is that it ended. What a dog. I'm guessing Sandler wrote each scene as the director was yelling \"Action!\". And what's the point? If you're going to make a comedy, then add some humor... or do an actual parody. This was neither. Aren't you trying to make people laugh? The premise was doable, but then, this happened(?) Adam, send me your scripts. I will re-write them for you. Stop pretending to be a screenplay writer - you're not. I love westerns and I love comedies, but god good this was embarrassingly bad. I'm so glad I didn't pay for this in a theater."
    },
    {
      "rating": "4",
      "text": "Well. It's not as heinous as the majority of critics make it out to sound, but goddamn is it bad. At the very least, I smiled. It's not a laugh, but it's better than nothing."
    },
    {
      "rating": "0",
      "text": "Péssimas atuações e roteiro completamente ridículo, é um fiasco total. Nada a se salvar! É simplesmente a pior coisa que a Netflix já trouxe até hoje!"
    },
    {
      "rating": "1",
      "text": "This movie is so bad, even Adam Sandler is getting bored with this one. It's lazy, poorly written, and devoid of any entertainment whatsoever. It's like they weren't even trying."
    },
    {
      "rating": "4",
      "text": "What: The Ridiculous 6 (2015)\rWho: Adam Sandler, Herbert Love, Hurley, Team Jacob, Rob Schneider Is a Carrot, a Royal Tenenbaum, MacGruber, Jack Monk Jr., Mr. White, Mr. Pink, Four Leaf Tayback, Machete, Blake Shelton (Like, the real Blake Shelton), and Vanilla Ice as Mark Twain (Like, the actual Vanilla Ice plays the actual Mark Twain, I could not make this up)\rWhere: That wacky Adam Sandler Universe where fart jokes reign, Taylor Lautner does whatever you tell him to do, and Jon Lovitz somehow finds work\rWhen (can I watch again): The next time you finish a Beer Olympics and are waiting for the Papa John's guy to show up\rWhy: Because all Happy Madison movies are GUARANTEED $100 Million in the box office, just give in and watch some lowest common denominator comedy"
    },
    {
      "rating": "7",
      "text": "Has the world forgotten to laugh?\r Everybody takes themselves way too seriously these days.  Are these movies as bad as a Uwe Boll or M. Night Shomolongodindong movies?  I don't think so.\r Hateful, self loathing critics just need to realize Adam Sandler is just making silly, funny movies to entertain people.  That's all.  So all you critics out there just try to sit back and relax and maybe laugh if can find it in your cynical, shriveled black hearts to do so."
    },
    {
      "rating": "7",
      "text": "I'll just say this. If you enjoy movies like Blazing Saddles, Men in Tights, and Spaceballs but \"hated\" this one, you need to take your Adam Sandler hate goggles off for a moment. This was the equivalent of a Mel Brooks film starring Adam Sandler and it was good for some laughs."
    },
    {
      "rating": "0",
      "text": "This movie is bad.\r .\r.\r.\r.\r.\r Your review must be at least 150 characters long.\rYour review must be at least 150 characters long.\rYour review must be at least 150 characters long."
    },
    {
      "rating": "3",
      "text": "Filled with crude, offensive and off-putting humour and overwhelmed by countless wasted cameos, disastrous effects and sickly poor dialogue, The Ridiculous 6 is a ridiculously bad film. Terrible acting all round and an extremely flat performance from Adam Sandler don’t help its cause. It looks at this point as if Adam Sandler has given up on trying to revive his career."
    },
    {
      "rating": "2",
      "text": "Its pretty bad when the only actual laugh comes during the title sequence, when \"The Ridiculous 8\" is \"filmed in 4K\", poking fun at Tarantino's Hateful 8 boasting 70MM. From there it's downhill all the way. Despite fine cinematography from Dean Semler (Dances With Wolves, Road Warrior), everything in this film is ugly. The casual racism/sexism is alongside childish poop jokes that only a child would find funny. Thing is, this isn't a movie for children. The usual ex-SNL suspects show up..Schneider, Spade, Lovitz, cameos from McDonald and Kattan. And his movie road company buddies Buscemi, Torturro, and Keitel. Add to that Nick Nolte, Will Forte, Steve Zahn, among many others (Vanilla Ice as Mark Twain? Blake Shelton as Wyatt Earp? Why not.) But the major problem is Sandler himself. If he was accused of playing the same type film after film, he now underplays to the point of practically sleepwalking, muttering his monotone dialogue (also see Pixels, or don't). This makes A Million Ways To Die In The West look like Citizen Kane. Interesting casting fact. You may remember when some American Indians walked off the set because of some offending tribal names. So who was cast as Never-Wears-Bra? Jackie Sandler. Sandler's wife. Hey, a role's a role, right? Gotta support the hubby... As long as Sandler surrounds himself with the same \"talent\" as in writer Tim Herlihy and director Frack Coraci, he'll keep making the same crap. Seriously, Sandler-ites. What was his last good, funny movie? Pixels...Blended...Grown Ups 1 & 2...That's My Boy...Jack and Jill...shall I go on?"
    },
    {
      "rating": "1",
      "text": "Even for just being a Netflix original, this movie was awful just downright awful and atrocious to watch. There is literally nothing redeemable about this movie, yeah you may chuckle here and there but there is literally nothing redeemable about Adam Sandler's latest attempt to make a even mildly entertaining movie. Thats the frustrating thing, I believe Adam Sandler can act and can make a good movie. Hes proven it in in the past with good movies like Reign Over Me, Spanglish, Punchdrunk Love, Funny People, or even Click but he continues to waste away his career with these pointless and downright lazy films that he actually thinks people will find funny. His performance in this movie even seems phoned in,  Taylor Lautner is bad and while the rest of the cast manage to do a decent job at being not as bad. It almost doesn't help their case that the film has almost no story of substance, the dialogue is laughable, and the characters are lower than anything youd come to expect in an adam sandler flick. Its lazy film making and a perfect example of just how lazy Adam Sandler has become."
    },
    {
      "rating": "1",
      "text": "This is a modern Adam Sandler movie.  Whether that is your thing or not determines if you will like this movie.  For me, this is yet another unfunny, terribly offensive, overly long slug of a time that I would never in my wildest dreams pass off as comedy.  The worst part about this one is that it looks like Sandler is trying to be dramatic, and that's just terrible.  I give this movie a 1 for not making me spend money to sit through this pile of garbage, but that doesn't mean there's an excuse that a movie this bad was made."
    },
    {
      "rating": "2",
      "text": "This movie was awful. I can't say too much good about it. I suppose the script was coherent enough, and it at least felt like a movie. That's about the only good thing I can really say about the movie.\r The movie was supposed to be a parody of westerns, but it was not funny. Racism was a big part of the script, but I know that for whatever reason a lot of people are going to just dismiss that as \"SJW\" nonsense, and the racism has been pointed out enough times that it doesn't need another mention by me. I think everyone knows that part.\r Even if you're willing to dismiss that on the grounds of it being \"liberal\" or \"SJW\" crap, you can't deny the movie was insanely boring. This movie did not deserve to be 2 hours long. It was not that good, nor was it good at all. Gross out comedy and being intentionally offensive are just lazy humor. That's all this movie was: Pure laziness.\r I know some people want to claim that this movie pokes fun at racism. Maybe it did try that, but if it did it failed and became racist itself. If you want to watch a good film that parodies the western genre while actually making fun of racism then watch \"Blazing Saddles.\""
    },
    {
      "rating": "1",
      "text": "The right wing nut job media will always review a Sandler movie well. They only watch them because they can't understand regular films. They spew out their agenda driven rhetoric because they can only laugh at lowbrow humor, and have wallowed in Sandler movies in the past. They will  be the only ones who get a kick out of this drivel."
    },
    {
      "rating": "0",
      "text": "Watched the first half hour and didn't get as much as a smirk from this so-called comedy. The other hour and half might have been the funniest ever for all I know, but I wasn't going to risk it."
    },
    {
      "rating": "0",
      "text": "There is a fine line between amusement and stupidity, which means that Adam Sandler's Happy Madison films can have only two outcomes. Both of these types are stupid, offensive and awkward. The first type makes you laugh and when you try to calm down, you realize you were laughing because of something really not that funny and probably very awkward, which makes you laugh even more (Strange Wilderness, That's My Boy).\r Unfortunately, the second type makes you want to erase from your memory all the traces of how lame and boring that was and bury all the copies of that film in the bottom of the ocean, so nobody would ever make this horrible mistake of watching that film, like you just did.\r The Ridiculous 6 is according to me the worst scenario of the second type. Probably even worse than Jack & Jill, which i thought I would never say in my entire life."
    },
    {
      "rating": "0",
      "text": "\"The Ridiculous 6\" is the laziest attempt at a comedy I have ever seen. It is excruciatingly painful and is the newest form of torture available to your enemies."
    },
    {
      "rating": "3",
      "text": "The Ridiculous Six joins the ranks of Happy Madison failures. While none of the characters in this film nail biting obnoxious as in previous Madison films like Eight Crazy Nights and Jack & Jill it’s still not enough. After the six are assembled they go from one distraction to another on their slow journey most of which is unmemorable and leads to a dull a film. None of the Ridiculous Six are entertaining each of which leading to one the Happy Madison comedy wheel of poop, race, and stupid voices. Except for Sandler who plays the role surprisingly serious contrasting to the supposed comedic tone of the film. The deadpan role is so serious you’ll somewhat miss his stupid voices or at least wish he was doing red-face. While last year’s western comedy A Million Ways to Die in the West occasional found some gold in its dry river The Ridiculous Six is as dull and dry as the desert it is set in."
    },
    {
      "rating": "1",
      "text": "I wanted to see how bad this movie could possibly be. And I was not surprised to find that it was just as bad as one could imagine. Sandler gave quite possibly the worst performance of his career. I gave it a 1 because it appeared to have good production value."
    },
    {
      "rating": "0",
      "text": "Orcs! used to be my benchmark for being the worst movie ever. Orcs! isn't meant to be funny, but it sometimes is. The ridiculous 6 is meant to be funny. It never is.\r Moon caps mountain\rChilled valley, no laughter\rSun sets to nothing."
    },
    {
      "rating": "7",
      "text": "Lets get this out of the way. This is not a historically accurate movie so don't get your panties twisted. You'll meet some historical characters and they will be completely out of context. Next if your sensitive to racist jokes leave now. And if you don't understand that their are different types of comedies out there this movie most likely won't be for you. After all of that this movie is ridiculously funny. Almost every scene has something to have you smiling and laughing about. Everyone in this cast does their job. Everyone in the \"Ridiculous 6\" is funny from the moment you first meet them. Not all the joke are super funny but most of them are. If your looking for a smart witty, sorry no not here. This is more of your sit back and lets not take life so serious kind of movie."
    },
    {
      "rating": "1",
      "text": "Adam Sandler and (most of) his friends are here to make you wish he could make a good movie again. Another rehash of the same stupid jokes that haven't worked, ever. Just when ou thought he couldn't possibly make a stupider movie, he does. Skip this. Go watch Happy Gilmore again instead."
    },
    {
      "rating": "0",
      "text": "The movie is far more awkward than funny. It may seem like a movie to watch with the whole family, but it is not. It's full of nonsense, dumbness and really wrong things.\rThe plot of the movie is predictable and pointless.\rAdam Sandler is the good and special guy that faces a mediocre situation to end the movie with the highest number of friends once again. He poses as a skilled boss-like character, which is not funny, on a comedy movie.\rRob Schneider's role hide his potential as a comedy actor, not even quite funny. He is a Mexican guy that has a mule that literally jets sh*t. Whoever thought this was a good idea has a disgusting sense of humor.\rTaylor Lautner has the best acting, but his role is excessively dumb and is not even close to funny.\rJorge Garcia's role is the most disgusting character I ever see. He doesn't say a single word and the character is pointed to have sex with animals.\rTerry Crew's role, and Luke Wilson's, has no reason to exist. Really. Not funny, once again.\rIn summary, don't watch this movie. Even a knock-knock joke is funnier than this movie."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious! Adam Sandler and his crew put together an enjoyable movie for everyone to enjoy. Some complained that it made Native Americans look ridiculous, but it's satire! The movie is making fun of old westerns and they stereotypes that they presented."
    },
    {
      "rating": "3",
      "text": "Man, sincerely not that is of Sandler, but for of doing this type of movies, please I cannot see any more movie of this actor. Well, returning to the movie, I did not understand it in any minute of his duration."
    },
    {
      "rating": "6",
      "text": "It is Fun, but is toooo long (really to long) but i laugh so much times wit adam"
    },
    {
      "rating": "0",
      "text": "Managed a man full 10-15 mins of this **** before I turned it off. This film has a minus numer of redeeming qualities, it literally made me dumber watching it not to mention angry.Whoever sanctioned its production must have had their family held at gunpoint because I cannot think of any other reason why such a dire film would make it off a script checking level.The portrayal of First People in this film are truly horrendous not to mention a complete travesty of any sort of accuracy (I am aware it was supposed to be a comedy) this wouldn’t be a problem if it were done in a clever ,self aware way a la Snatch but I got no hint that this film was even aware of quite how offensive and damaging it’s abuse of a nations people it was trashing.I know sandler has some sort of watertight deal to make films akin to Princes record deal but holy **** this stinker was a new low for him and that really is saying something. If you are reading this avoid this film like you would a maggot filled corpse dangerously bloated in the full sun.I truly hope someone sues sandler into obscurity for this shower of ****"
    },
    {
      "rating": "7",
      "text": "I feel compelled to write a review about Ridiculous 6 just to counter all the negative ones that people are writing lately.  Adam Sandler has been getting routinely lambasted by people who just don't seem to understand that he's not going to change. His form of comedy is still aligned to his fans.  In short, Adam Sandler will be Adam Sandler.\r In a social climate where writers are too cautioned to tell any kind of stereotypical joke, Sandler comes in swinging with South Park tenacity.  He may not be as witty as the Stone and Parker combination, but it hardly comes across as racist.  It's too easy to call things racist today, and that word is being flung around too much lately that it's lost all meaning.  The characters are diverse, and everyone gets it, including white people. You won't find many critics ever bringing that part up, either.  The narrative is that this movie is \"racist\" towards Native Americans.\r Now, this is far from the best Adam Sandler movie he's made, but it's also far, far from the worst he or his studio has made (Strange Wilderness receives that accolade from me).  It's framed as a Western parody, but it flows like your average Sandler film. A huge cast peppered with Sandler regulars such as David Spade and Rob Schneider deliver silly jokes and slapstick bits. The humor tends to go a little past my threshold for crude humor at times (a donkey with explosive diarrhea for example) but also has some outrageously hilarious moments like a botched hanging of Taylor Lautner.\r Speaking of Lautner, he honestly has stolen the spotlight of this film.  He plays a slow-minded but innocent-spirited half brother (of which all six of the Ridiculous 6 are of relation) to Sandler and this is just a career defining moment for him. It's a goofball role that ranks right up there with other actors who've cut loose like Duane Johnson, Justin Timberlake and Brad Pitt.  Honestly, the aforementioned botched hanging was one of the funniest scenes for me.\r To be honest, though, there are two points constantly brought up in the negative reviews that I agree with. First point is that Sandler's acting is simply limp.  The character he is trying to for perform just isn't very enthusiastic,  It's not that it's designed to be that way; you can just tell he isn't putting any energy into it.  It's not that bothersome to me, though, because the movie is put on the shoulders of its supporting cast., which again, is quite large.  The second point is that it's about 30 minutes too long.  There are many skits, including a scene with John Turturro and the origin of baseball, that don't really serve the story's progression.  As a result, some scenes lose a bit of comedic impact because they feel like filler.\r If you don't like Adam Sandler, you're obviously not going to enjoy this movie.  Good, because it's not made for you.  Instead, this is a pure Sandler film through and through and if you've been a long time Sandler fan, there's little chance you're going to be disappointed by it.  If you're one of those Sandler fans that loved his older work and wished he could return to that era, your only option is to give it a try.  Good news if you're already a Netflix subscriber: it won't cost you a cent more to watch it.  Give it a shot."
    },
    {
      "rating": "0",
      "text": "Adam Sandler should have been stripped of his citizenship and deported years ago. Now is finally the time to see if ISIS might have a use for him. Wake up, America. This man is a cancer on the art of cinema and the nation."
    },
    {
      "rating": "9",
      "text": "A lot of people out there need to grow a pair and grow up.  Most of Sandler's movies are comedy.  If you go in and believe that he's out there to insult... that's on you.  People that understand logic thought can tell you that this movie is funny.  People just love to hate Sandler these days because he's not putting out Happy Gilmore quality movies....well hell, that was almost 20 years ago.  Time to let it go and be happy he's still out there making people laugh.  Everyone I know that has watched this film has loved every minute and don't understand where people are getting their panties in a wad.  Face it people... if you don't laugh at this, you don't understand humor.  The 'in your face' jokes, the friends joke, the inside jokes (between actors), genre jokes...list goes on.  there is so much to this movie that all people care about is if it makes a few people... hate this phrase, 'BUTT HURT\" over nonsense.  If you think it's being insulting to the native Indians... what about the being insulting to WHITE PEOPLE for having us use that language towards them?  Oh wait... that's how they use to talk back in the day.  Political Correct people need to shut the hell up and just ENJOY what's out there instead of hating everything because it's 'popular' to do.\r Great film.  Lots of laughs.  I support Sandler since his days of SNL, Billy Madison, Longest Yard, Little Nicky, Growns Ups... he has made me laugh for years and still continues to do his job with The Ridiculous 6!"
    },
    {
      "rating": "10",
      "text": "Better than Jack and Jill , that's for sure.\rBetter than Jack and Jill , Grown Up 1 & 2......ehh\rI don't know, i just think this movie is not as bad the reviewers say it is.\rBut there's one factor that makes it worth some of the scores, the movie is way too long."
    },
    {
      "rating": "10",
      "text": "Watched this with my partner, and was thoroughly entertained. I've seen a few reviews about it being a movie  revolving around 6 half brothers, and some WTF moments, and the reviews are not positive. There is little suspense, a shallow plot line and some very questionable acting in places. This is most certainly not Nolan's Dark Knight, nor is it Inception, or Shutter Island.\r I am not a fan of Twlight, and to see \"Jacob\" on the screen was not something I looked forward to. In actual fact, I should not have judged so quickly! The Ridiculous 6 played their individual roles well, fulfilling every comedy stereotype to facilitate my roaring laughter!\r This, in true Happy Madison this is a feature length film of satire, humor and the story of 6 main characters in a ridiculous situation. We thoroughly enjoyed the movie, and would happily watch it again! Well played Netflix, well played Sandler.\r For those who disapprove of the plotline following a group of 6 people in a ridiculous situation, perhaps next time Happy Madison and Netflix could warn you, by titling the movie appropriately. Like calling it the Extraordinary Half Dozen, or the Outrageous Sextuplets, or perhaps the Ridiculous 6?\r Oh...wait...hang on a second...\r 10/10 from me!"
    },
    {
      "rating": "8",
      "text": "ok this was not like the best movie this year or anything but to take it as far as others have and give it  such terrible reviews i dont see i enjoyed it laughed out loud alot found it sweet for an adam sandler movie i say  give it a chance u will like it"
    },
    {
      "rating": "5",
      "text": "Despite the constant drivel of racial stereotyping in the movie with mixed results in eliciting laughs, I'd say Ridiculous 6 is one of the funnier Adam Sandler movies that have been released so far but that's not saying much because the quality of Sandler comedies have been plummeting ever since... since the last ten years? This flick is a tad better than that redonkulous Zohan movie. That's for sure."
    },
    {
      "rating": "10",
      "text": "Personally loved it, been a while since I enjoyed a Sandler movie. The different characters were excellent and well played by the actors. Hopefully a sign of things to come, definitely a return to form."
    },
    {
      "rating": "0",
      "text": "pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me pls kill me"
    },
    {
      "rating": "2",
      "text": "Thanks for giving us this awful movie, Netflix. Yeah, really.... thank you very much, Netflix. Come back when you can stream better movies online. At least try, okay?"
    },
    {
      "rating": "8",
      "text": "I don't really get the hate for this one. It's nowhere near the level of \"Jack and Jill\" or that \"That's My Boy\" and closer in quality to \"You Don't Mess With the Zohan\", if not quite \"Happy Gilmore\" level. I thought this was well-shot, decently acted, harmless fun for the most part, and unlike most recent Adam Sandler films, this one actually had something resembling a story, plus his performance as a knife-wielding purveyor of mystical **** is actually kind of badass. The script isn't written by Shakespeare, but it's serviceable and let's be real, we're talking about Sandler here. I was actually pleasantly surprised by the cohesiveness of the story. As one might expect from a Happy Madison production, not all of the jokes hit their targets, but that doesn't mean there aren't some memorable sequences. It was great seeing Harvey Keitel onscreen again. Terry Crews pulls off every reaction shot perfectly, proving his comedy chops, and Taylor Lautner goes all out in portraying the dumb brother with a heart of gold. Rob Schneider has some fun moments, too, though Luke Wilson and Jorge Garcia are somewhat under-utilized. John Turturro's sequence as Abner Doubleday is a standout that points out how the rules of baseball seem totally arbitrary. But it's Vanilla Ice as Mark Twain that steals the show IMO. I would normally give this film a 7 but I'm giving it an 8 to counter-balance all the negative reviews. Seriously, did the people who hated this really find nothing enjoyable at all? The gorgeous cinematography and decent soundtrack? The respectful treatment of the Apache? I'm not a fan of most of Sandler's filmography, but this was not a bad or unwatchable movie by any metrics. In fact I'd say it's something of a return to form for him."
    },
    {
      "rating": "7",
      "text": "It's no \"Blazing Saddles\" but The Ridiculous Six is a pretty entertaining parody of westerns, and a notable step-up from some of Sandler's recent efforts. The cast were great, and the set pieces were pretty impressive. I laughed on more than a few occasions (the baseball scene and the bank-robbing montage in particular) and I really don't see why everybody thinks it's so racist. Sure, there were a few scenes that might seem kind of offensive, but overall, there wasn't anything as racist as Rob Schneider pretending to be a Native American in \"Bedtime Stories\". Some of the jokes were a bit gross, but there were still more laughs than the average Sandler flick. So overall, The Ridiculous 6 isn't for everyone, but it's still a fun movie, and one of the better recent Happy Madison films. Just lighten up and enjoy."
    }
  ],
  "recommendations": [
    "zoolander_2",
    "thunder_force",
    "this_is_the_end",
    "grown_ups",
    "tropic_thunder",
    "dinner_for_schmucks",
    "little_fockers",
    "dirty_grandpa",
    "paul_blart_mall_cop",
    "norbit",
    "zoolander",
    "a_million_ways_to_die_in_the_west",
    "hubie_halloween",
    "trainwreck",
    "the_wrong_missy",
    "ted_2",
    "anchorman_2_the_legend_continues",
    "the_change_up",
    "30_minutes_or_less",
    "the_hangover",
    "identity_thief",
    "the_watch",
    "couples_retreat",
    "tammy",
    "baywatch"
  ]
}