{
  "id": 3331,
  "title": "The Rundown",
  "starring": [
    "Dwayne Johnson",
    "Seann William Scott"
  ],
  "runtime": 104,
  "genre": [
    "Adventure",
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "When Travis, the mouthy son of a criminal, disappears in the Amazon in search of a treasured artifact, his father sends in Beck, who becomes Travis's rival for the affections of Mariana, a mysterious Brazilian woman. With his steely disposition, Beck is a man of few words -- but it takes him all the discipline he can muster to work with Travis to nab a tyrant who's after the same treasure.",
  "releaseYear": "2003",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cwNeP2fz0vqNhmKIcSgLD0xc6g2.jpg",
  "categories": {
    "plot": 7.285714285714286,
    "acting": 8.25,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 7.944444444444445
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This was fun, really entertaining and probably deserves a sequel.Engaging chemistry between The Rock and Sean William Scott.Kudos also to Ernie Reyes, Jr. who provided one of the most memorable action scenes - his best performance since Ninja Turtles 2 and Ninja Surfers."
    },
    {
      "rating": "10",
      "text": "The Rundown is one of the greatest action packed movies of all time, and it is probably my favorite movie from The Rock. Dwayne Johnson and Sean William Scott are great together in this movie. This movie is full of action, humor and of course thunder and lightning, The Rundown is truly a classic and is one of my favorite movies of all time."
    },
    {
      "rating": "10",
      "text": "dope movie one my favorites  to il Walsh's watch it hope comes next one please"
    },
    {
      "rating": "9",
      "text": "An awesome action movie with touches of genuinely funny humor. Dwayne \"The Rock\" Johnson is awesome in this movie, Christopher Walken makes an awesome villain, and Seann William Scott does a decent job as the comic relief character but I couldn't help but feel like the writers didn't add enough humor for him. The action packs one heck of a punch. I frequently found myself saying something out loud when someone got punched because of how brutal it looked. All in all it's a fantastic action movie that I highly recommend watching."
    },
    {
      "rating": "8",
      "text": "A cheesy action film starring the Rock? How good can it be? You'd be surprised. It's funny and surprisingly clever. The actions scenes are good and very well filmed (think the exact opposite of the Bourne Supremecy). It's cliched and unamazing, but it's a well done, high quality action film. If you're looking for a really good, deep thinker of a movie, then you know better to not look here for it. If you're looking for a throwaway action film, this is it, and you will be surprised at how good this one turns out to be."
    },
    {
      "rating": "9",
      "text": "igguguugughihjihihihighiihihihihihihyfyfyfyguguguguguguguguguguguguguguguguguguhigyfygughiihinihihihihihihhiihih"
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "9",
      "text": "○●○●○●○●●○●○●○●○●○●○●○●○●○●○●○●○●○●+,+,+,+,+,+,+,+,+,×,+,+,+,÷÷,÷,÷,÷,÷,÷,÷,÷,=,=,=,=,=,...."
    },
    {
      "rating": "9",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "9",
      "text": "++++++××××××××÷÷÷÷÷÷÷÷÷÷======++++++++=÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "8",
      "text": "The Rundown is not especially clever or engaging when it comes to storyline. In fact, it's fairly simple. But when you put The Rock and Christopher Walken and Seann William Scott in an action movie together, you certainly can't go wrong. Here is proof."
    },
    {
      "rating": "9",
      "text": "Still pissed they never made a sequel to this, especially with the success that Peter Berg and The Rock have been having lately. In terms of action, its a fun movie with a great sense of humor, great shots and really cool bare knuckle fight scenes. It's still The Rock's best movie, honestly even though hes gone on to have success in the Fast and Furious movies, ect. Still holding out hope for that sequel"
    },
    {
      "rating": "10",
      "text": "A+ ************************************************************************"
    },
    {
      "rating": "5",
      "text": "Somewhat entertaining but also pretty clichéd and unoriginal. Johnson is good."
    },
    {
      "rating": "8",
      "text": "Peter Berg fans, don't miss this.  A bunch of tropes, thrown together, are somehow, with an A list cast and many plot twists, turned into a diverting, grounded, funny, surprising ride. If you like this, don't miss Battleship, by Peter Berg, it has the same filmmaking integrity, directorial and stunts derring-do with a better script."
    },
    {
      "rating": "6",
      "text": "\"The Rundown\" was a good movie, judging by the views, it was loaded with a lot of action, with a fairly regular story, and a very Indiana Jones Dwayne Johnson."
    },
    {
      "rating": "6",
      "text": "Reminded me of a newer Arnold Schwarzenegger movie, with Dwayne playing Arnold's part.  As with Arnold's successful formula, humorous interludes separate the action sequences.  The story line was weak by comparison, Dwayne ain't no Arnold."
    },
    {
      "rating": "10",
      "text": "This movie is the greatest action movie Rock rules and do u want a little thunder how bout some lightning."
    },
    {
      "rating": "10",
      "text": "Suprisingly good. Sean W.S. and The Rock actually work well together, and Walken's lines were funny. This is a treat to the MILLIONS [and millions]...etc."
    },
    {
      "rating": "4",
      "text": "Good action film, but also flagrantly disposable."
    },
    {
      "rating": "7",
      "text": "This is an action adventure film, with comedic elements and it features themes including hunting and bounty hunters, jungle environments, archaeology and poaching. I've seen a few  action/comedy films starring Dwayne 'The Rock' Johnson and I've quite enjoyed them, so I thought I'd probably enjoy this too. I like that he doesn't always take himself too seriously in films like these.Its fair to say this is a decent piece of escapism - its an easy watch, it doesn't require too much analysis/thinking and there are some relatively good instances of action and of comedic moments. Its by no means an excellent, above-average film but its entertaining none-the-less. In this film, 'The Rock' is clearly a fish out of water, when he finds himself away from his more usual urban, city environments and instead in the middle of the Amazon rainforest. He tries to maintain his cool, reserved suave-ness but it doesn't entirely go to plan, as may be expected. The characters are somewhat stereotyped, with the sexy female role going to Rosario Dawson, who plays Mariana, a local in the Amazon and the lazy local beach bum type, someone who isn't especially clever, in this case a guy called Travis Walker, played by Seann William Scott. Meanwhile, Christopher Walken is also present, playing a guy called Hactcher - I enjoyed the scenes where Dwayne Johnson and Christopher Walken were with one another, they both being somewhat determined and tough guy types. At times, the film was a bit reminiscent of a wild west film, one of which being when Beck (the main character played by Dwayne 'The Rock' Johnson) walks in to the locar bar via the traditional swinging doors. I almost expected him to say 'this town ain't big enough for the both of us' or some such but alas that wasn't to be. There are some decent action scenes, with violence including gunfights and the like, which are quite frenetic and reminded me a bit of the sort of scenes present in films featuring Jackie Chan, with swift movements done almost karate style. It is impressively fast paced at times. The dialogue was alright, sometimes it was relatively sharp but other times it was a bit predictable. I found myself feeling quite surprised and shocked even by some of the turns of events - the dialogue is probably slightly more predictable than the plot overall, which isn't necessarily a bad thing. Content wise, the film contains no graphic nudity or sex, although some scantily clad women are shown in a scene at the very start of the film, set in a night club. There are some scenes featuring violence but again nothing graphic is shown, with no blood injuries clearly depicted. There are some examples of strong language present but nothing particularly explicit. This film was given a 12 rating to reflect this.Yes I'd recommend this film, as its quite entertaining, amusing and with some good action scenes. Its an easy watch and has a good cast as well, although it is a bit cheesy and some of the dialogue may make you cringe a little but overall its worth a watch, I'd say."
    },
    {
      "rating": "10",
      "text": "Konlabos, the fruit used to paralyze Dwayne Johnson and Seann William Scott's characters, is actually a fruit called chirimoya or custard apple, depending on where you buy it. This fruit does not cause paralysis and is actually eaten all over the world for its delicate flavor."
    },
    {
      "rating": "9",
      "text": "\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",\",◇¡◇¡◇¡◇¡◇¡◇◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡◇¡"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@;@;@;@;@;@;@@;@;@;@;@;@;:@:@:@:@:@:@:@:@:@:;@;@;@:@:@:@"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤♤¿♤¿♤¿♤¿♤¿¿♤¿♤¿♤♤¿♤♤¿¿♤♤:;:;:;:;::;:;:;:;:;:;:;::;:;:;:;:◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    }
  ],
  "recommendations": [
    "kingsman_the_secret_service",
    "last_action_hero",
    "true_lies",
    "boss_level",
    "desperado",
    "red_2",
    "extraction",
    "demolition_man",
    "copshop",
    "the_italian_job",
    "bullet_to_the_head",
    "first_blood",
    "the_expendables",
    "rush_hour_2",
    "american_ultra",
    "the_losers",
    "knight_and_day",
    "16_blocks",
    "gangster_squad",
    "spenser_confidential",
    "the_long_kiss_goodnight",
    "red",
    "hercules",
    "the_mummy",
    "spy"
  ]
}