{"id": 3008, "title": "The Devil All the Time", "starring": ["Tom Holland", "Bill Skarsgård"], "runtime": 138, "genre": ["Crime", "Drama", "Thriller"], "description": "In Knockemstiff, Ohio and its neighboring backwoods, sinister characters converge around young Arvin Russell as he fights the evil forces that threaten him and his family.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bVL7LGq528h3KzeNI90HOVbV5uW.jpg", "categories": {"plot": 7.7, "acting": 7.811320754716981, "ending": 7.857142857142857, "soundtrack": 8.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.5}, "reviews": [{"rating": "6", "text": "This sprawling tale stars Robert Pattinson, Tom Holland, and Bill Skarsgård. It’s packed with murders, corrupt characters and all manner of dark dealings. The narrative follows 2 generations as they deal with various unfortunate outcomes. The members of this impressive ensemble assume roles as relatives and sinister supporting characters, but it’s Holland and Pattinson who are the most impressive (with convincing Southern accents). The seemingly unrelated stories have interconnected characters…reminiscent of the Coens at their most sinister…without the depth of enthralling storytelling or humor. It moves slowly (2:18 running time) and even with all the unfortunate events, never achieves any powerful emotional effect. Still, it remains compelling for the performances."}, {"rating": "6", "text": "I think this film is ahead of the game when it comes to films that squander its extensive and famous cast.And it cannot be denied that to some extent it, that was a disappointing experience.Although I haven't read the book, I'd heard quite interesting things about it. Now after watching the trailers and seeing all the people who were involved, it goes without saying that I was quite interested.But it happens that those expectations are often not met.The Devil All the Time is not what you could say a bad film, but it's a mixture that's very, very messy.The way all the narratives are connected is far from coherent and this is because the main goal, which in my opinion is to show the evil inside the characters (The reason for the movie title) never feels immersive and more than anything, because the characters aren't deeply explored even when they seem to have incredible backgrounds stories.The film never opts for that option and only comes down to presenting an interesting story yes, but unfortunately also very messy.The cast does their job and among all of them there's none that really stands out but that as I said is more because the script doesn't give them anything to explore, they just have enough to present themselves.And I say this because of all the people involved, the only one who shows that he can finally go elsewhere is Tom Holland, because from there, all the main actors are already proven actors, so thanks to them the film manages to remain stable.I firmly believe that audiences can give it a chance, but you also have to admit when this standard just doesn't make films worthy of being remembered."}, {"rating": "9", "text": "Totally engrossing, character driven drama with amazing performances across the board.  Tom Holland, Robert Pattinson, Riley Keough, and Harry Melling stood out.  Nice appearances by Mia Wasikowska and Bill Skarsgard also.  Not always an easy watch, but American gothic at its finest."}, {"rating": "10", "text": "Amazing storytelling. Tom Holland is a brilliant actor. Exceeded my expectations!"}, {"rating": "3", "text": "Sure, there is some decent acting in this movie, yet the entire thing is depressing, horrific, and sickening. I wish I could un-see it."}, {"rating": "9", "text": "Excellent movie. Very surprised at the average critics score. If looking for gritty drama then this is movie for you."}, {"rating": "10", "text": "It's a dark tale, with awesome cast and crew members. awesome story....give it a watch!"}, {"rating": "10", "text": "This movie is one of the best creations this year brought. Tom Holland finally isn't Peter Parker and Bill Skarsgard isn't creepy clown. In my opinion this movie can easily be nominated for Best Cinematography. One of my favourite movies this year and honestly one of my favourite last couple years."}, {"rating": "6", "text": "Seguindo uma narrativa de crescimento exponencial - ou quase isso; The Devil All the Time explora bem seus personagens e atores. Tem cenas bem elaboradas e uma boa fotografia. \"Engata\" da metade pro final e cria uma tensão gostosa, inerente aos personagens pela imprevisibilidade mas presentes conosco.Dito isso, deixo claro que gostei do filme, mas algumas coisas me incomodaram, mais no cunho pessoal mesmo. Primeiro de tudo: os arquétipos dos religiosos fanáticos. Eu entendo o argumento sobre a crítica a religião e tudo mais, porém, a obra não cria um equilíbrio factível entre personagens \"bons e ruins\". Quase todo mundo no filme é um maldito sem alma, e por conta disso, não parece nem um pouco verossímil. Acaba que a crítica perde o propósito e sua força quanto a influência a realidade do expectador.Os diálogos expositivos também me incomodaram bastante. O voice-over quebrou minha imersão no filme várias vezes. Quando havia uma cena onde poderíamos nos habituar, ou tentar entender o que se passa pela cabeça do personagem, a narração interrompe EXPLICANDO TUDO. E o pior é que em diversos momentos a situação já ficou clara. Ao invés de construir um plot ou deixar em branco - sem o fator replay; falar foi mesmo a melhor opção? A cena da aram descarregada é a prova que isso não dá certo. Fora alguns flashbacks completamente desnecessários.No que se diz respeito a atuações, estou satisfeito. Bill Skarsgård, Tom Holland e Robert Pattinson estavam excelentes, dando alma aos personagens e criando cenas maravilhosas. Harry Melling também estava bem, mesmo exagerando num momento ou outro.Como conclusão, eu gostei do filme, mas tive a sensação de que tudo é tão na cara que a profundidade se perde completamente. Logo, do início ao final eu tinha certeza de que o que eu estava vendo era um filme escrito por alguém. Os personagens não parecem reais, muito menos suas angústias, medos, etc. As conveniências foram demais pra mim e a crítica a religião e outros aspectos é tão forçada que perde a credibilidade, principalmente pelo fato dos personagens não saírem muitos dos seus respectivos arquétipos. Fora a narração e os diálogos expositivos. Eu sei que não é fácil adaptar um livro, só que dessa vez, pra mim não deu."}, {"rating": "8", "text": "Vivia pensando como o mal que vive nas pessoas podem passar de geração para geração.  Um pai que é preconceituoso pode acabar passando esse preconceito para o filho que vai passar para o neto e assim por diante. E é muito interessante ver todo esse conceito em tela, mas usando a violência como a herança. Elemento que é usado no filme de forma literal quando um dos personagens ganha uma arma que era do pai.  Mas o interessante é que aqui não observamos a violência como só uma herança de família, e sim da sua semente que aqui está representado com o final da segunda guerra mundial e todas as feridas deixadas nos sobreviventes. Uma semente que fez muitas pessoas se agarrarem muito mais na fé em Deus, acabaram se tornando fanáticas e usando dessa fé para promover mais violência e consequentemente também deixando seus filhos violentos. O que torna toda essa passagem de tempo e como as influências do passado na nova geração um dos pontos mais interessantes de assistir do longa.  Claro, com toda essa temática, o filme tem cenas um tanto fortes, o que é mostrado pelo diretor com naturalidade, afinal de contas o mal rodeia aqueles personagens, logo ela se torna algo quase trivial dentro da lógica visual do filme. Ele nunca deixa o gore como ponto principal da cena, tornando um efeito de desconforto forte no público.  O longa nos apresenta diversas histórias e todas são muito bem amarradas. Gosto de como ele usa a ironia de alguns encontros, algumas que só nós do público sabemos. Mas é inegável que o personagem do Sebastian Stan tem uma subtrama que não serve muito bem a história, o personagem dele podia ter menos cenas. Mas todo o elenco está ótimo, com um destaque pra Tom Holland que aposta em um papel mais sério e não deixa a desejar e Robert Pattinson que chega a dar nojo de tão bem que está.  Durante o filme sentimos raiva, desconforto, nojo e temos umas sequências que nos deixam nervosos, principalmente as que envolvem o Tom Holland. O Longa tem seus momentos que poderiam ser encurtados, mas nada que afete demais a experiência. Um baita filme que me fez refletir sobre o que eu vou passar adiante e se isso vai ser benéfico ou não. Recomendo."}, {"rating": "9", "text": "You'd be hard-pressed to find a movie as grim as this one this year. The Devil All the Time explores fate and morality by way of intertwining storylines much like The Place Beyond the Pines did. It requires patience and it certainly isn't a comforting watch, but I found it to be spellbinding, with a stacked ensemble that all bring their A-game. This one will linger with me for a while."}, {"rating": "10", "text": "This film's more like a nine but I'll probably give it a ten because the critics don't seem to have a &*#@! clue nowadays about what constitutes a good movie. Yea, it's violent and dark but it's really REALLY good! - 10 stars."}, {"rating": "8", "text": "Once again Robert Pattinson shows his acting skills in a thrilling and diverse story that is told pretty standard but has really big moments."}, {"rating": "9", "text": "This movie had me on the edge of my seat half the time, and glancing at my friend the other half at the violent portrayals of the characters' inner selves. Tom Holland is freaking ridiculous in his performance, as is Bill Skarsgård. You can see the rage and pain within them throughout their time on screen. There are some weaker characters, and some slower sections, but to see how they (and the sins they represent) intertwine over the film's otherwise lengthy duration, is well worth your time. As a bonus, the music is subtle yet haunting at parts, and in an interesting dichotomy, beautiful and hopeful during some of the darkest scenes. I was really gripped throughout the score."}, {"rating": "3", "text": "Holland and Pattinson do very well with their limited screen time but let's be honest people, This movie is a narrative mess with events loosely tied together in a very unappealing and unsatisfying way. The flow of the movie: Here's some vague out of sequence event, followed by a violent (or implied violent) act and followed up the events immediately following said act and then another out of sequence event.It seems like the director relied too heavily on the cast and the attempts of shock value rather than delivering a more solid narrative that closely tied these events together. And the fact that the director had to rely on voice-over narration to explain everything just goes to show how poorly of a job he did at explaining these explains onscreen."}, {"rating": "3", "text": "A well shot film with great acting, but it's not enough. The film left me depressed, failing to deliver sense or meaning beyond the plain surface level takeaway. I judge films by how much I could recommend them, and how much fun I had watching them. I can't recommend this movie, and while I enjoyed the performances, I don't relish in the visual portrayal of \"evil exists\". The narrative just meandered from here to there until the credits. Blah."}, {"rating": "10", "text": "There is a good dog in this movie. Nothing else to add. If you like good dogs, watch it."}, {"rating": "8", "text": "The Devil All the Time - 8/10 (Maybe 7.5, can't honestly decide)The Devil All the Time reminded me a lot of The Place Between the Pines but darker and more violent - and mixed a little with Lawless. It's a story that tells mirroring story arches of a father (Bill Skarsgard) and his son (Tom Holland); unlike The Place Between the Pines however, the emphasis is put on the son rather than the father which is to the film's detriment a little. Not a lot (see my rating) but I found myself enamored with Skarsgard's performance as well as his plot more than with Holland's acting and plot. Both are good, but I wish the father was more of the focus in the film. But that is only a minor complaint as I enjoyed both parts of the movie.For the most part the acting is great; Skarsgard especially steals the show but Harry Melling is also surprisingly superb. I say \"surprisingly\" only because I have not seen him since his turn as Dudley in the Harry Potter franchise and was not aware how talented of an actor he is. Jason Clarke and Sebastian Stan also put in great work and although I am not particularly a fan of Holland or Pattinson's work they were not distracting in their performances. Although, you could argue they were distracting as it was plain they were cast in this film to try to broaden the audience of a film that would likely have been merely a cult classic (and honestly, most likely still will be regardless.)This film is dark and twisted and certainly will not win any award for \"Feel Good Movie of the Year\" and is more of a character study. But in all honesty it is not much of a character study either as it remains fairly shallow in its study of the characters. So what is it then? It's a story of what happened between these interconnected characters at this point in time - the writers and director do not tell you what to make of it but instead challenge you to make of it what you will. A strategy that I am intrigued by personally, but rarely works among the masses. At least the general audience members in America.That is why I deem this movie to be more of a cult classic than a hit with the general public or even critics; from its dark subject matter to slow-burn pacing and lastly its ambiguity it will not draw in a large crowd. But those who are drawn in just might become obsessed with this movie."}, {"rating": "10", "text": "Es tensa, inquietante y dramática, además tiene una historia que logra interesar al espectador."}, {"rating": "10", "text": "MASTERPIECE !!!!!!!!!!!! 100/10 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "7", "text": "Another film that drags on way to long. It was an Okay film, but why make it so long? With this amazing cast it should have been so much better. Very dark and Brooding, it reminds me of a Coen Brother film or in parts a Christopher Nolan film only not as good."}, {"rating": "10", "text": "Its such a great movie! Tom Holland is great for the role, he did a pretty god job."}, {"rating": "10", "text": "This movie is very good. Netflix needs to go after more films made like this.  Tom Holland is a far better actor than he's getting credit for, and this performance shows that."}, {"rating": "8", "text": "Director Antonio Campos has delivered one of my favorite films of the year with #TheDevilAllTheTime. I expect the movie will divide audiences, but this violent, provocative story of murder and mayhem held my attention from start to finish. My review: https://youtu.be/b-pDac4pmro"}, {"rating": "10", "text": "A cruel tale that can very well may be a portrait of religion in real life, and that’s why critics will try to shut out this film. The roles of Pattinson, Skarsgård and Holland are awesome, this last guy surpassed all my expectations.This film talks about delusions of humanity in necessity of identity and fulfillment, how people are so cruel to convince themselves that they are up to no good. People think they are attending God’s plan, but in reality they are just delusional, serving nor god or religion, just performing some fictional necessity inside them that instead of pleasing God, they are pleasing the devil all the time..."}, {"rating": "8", "text": "I’m smart people; promise. It’s rare I bother to share my opinion on such forums. Critics are dicks and algorithms can hunt you down and kill you. Regardless, Metacritic still pretty cool and the film is nowhere near a friggin 10. I get the whole counsel on the morons with the excessive on the other end of the older spectrum score a routine… It’s really good though. You should watch it."}, {"rating": "10", "text": "Excellent performances from everyone, especially Robert Pattinson. Very dark and disturbing."}, {"rating": "7", "text": "Awesome narrative.  I am glued to the characters and their stories.  Stan should be given a breaking role ASAP and he will get an Oscar."}, {"rating": "6", "text": "In this 50s-set backwoods western, Tom Holland stars a young orphan who, over the course of several years as he comes of age, finds himself dealing with faith, sin, corruption, and murder all around him while remembering his troubled past with his family and his father in particular. For starters, I wish there could be more said about this film from me, cause I found myself thoroughly underwhelmed with the film as a whole. The pacing, editing, and narrative just weren't satisfactory for me, as the film jumps back and forth between past and present at somewhat random times, and despite being based off a novel, the story still felt remarkably lacking and uninspired to me. Throw in some clunky narration and you get a film that definitely feels more tailor made for Netflix rather than theaters. This isn't to say that there weren't some pros as well. Holland gives what I'd easily consider to be his best and most mature performance to date, for once finally shedding his Spider-Man image. The all-star cast does a great job here, but apart from Holland, the other big standout here is Robert Pattinson as a corrupt preacher that Holland finds himself face to face with. Overall, the film does feel like it simply borrows a lot from similar past films that deal with a western backwoods setting ('Lawless' is one such film that comes to mind for me), but what the film lacks in story and originality it more or less makes up for in its all-star cast and their performances."}, {"rating": "8", "text": "Sinister characters converge around a young man devoted to protecting those he loves in a postwar backwoods town teeming with corruption and brutality.First and foremost, this movie IS NOT for the faint of heart. Its extremely violent, bleak and twisted and dark, they really pulled no punches with this movie. The Devil All The Time is a slow burning tale set in a rural post war backwoods town. I never read the book but the real draw here is obviously the extremely large cast of box office stars, all superb in their roles. I was especially impressed with Tom Holland here, who really brings it in a role I've never seen him partake in before.All in all, this a dark and disturbing film that's only real downside in my opinion happens to be its jumbled narrative. People will obviously complain about the pacing and the array of terrible characters in this that makes it an uneasy film to sit through. But thats what makes it a real gem in my opinion. Its incredibly well acted and well shot and despite it being a rather long film, it manages to keep you glued to the screen with its darkness and intensity. Check it out when you can, its a win for Netflix"}, {"rating": "10", "text": "Para ser una producción de Netflix, posee una enorme calidad cinematográfica siendo digna de estar entre una mega producción hollywoodense. Es sombría, truculenta, imperante y en cierta forma retorcida sin llegar a notarse demasiado, la cinematografía es muy buena, las actuaciones son impecables, en especial Tom Holland y Robert Pattinson, los cuáles desempeñan las mejores interpretaciones de la película, encontré algunas falencias en el guión, tiene coherencia pero la cohesión es un poco confusa, sin embargo, considero a esta cinta una de las mejores del año."}, {"rating": "10", "text": "I did not expect to even like this film, much less find it near-perfect.  But despite its bleakness, it does treat its themes seriously and responsibly.  It's a hard watch, but worth the time."}, {"rating": "7", "text": "As an radical atheist, this movie absolutely aggravated me. I just wanted to plant a fist straight trough my TV.The acting and performance was solid and all and pacing was all right. Top notch music score. But all the madness of religion that was back then and still is today (even worse) really cooked my brain."}, {"rating": "9", "text": "im giving utva 9 even if i would give it a 8... but reading the critics its **** cause its a good movie... of course i isnt perfect but the cast is excellent  and it deserves to be watched by much more people ... dont believe bad reviews... its a good movie"}, {"rating": "7", "text": "To be completely honest, I didn’t expect to like this movie as much as I did. Obviously I had issues but it doesn’t take too much away from what the film did well. An issue I had with the film is the pacing. Certain plot points in the movie feel rushed as if it was a check in the box and not something the Director cared a lot about it. It was a lot worse in the first 45 minutes because everything happens so fast that it’s hard to care about some of these characters. Once Tom Holland shows up though, the film gets drastically better. Tom Holland does an excellent job here and I was surprised at how much I enjoyed his performance. This is easily his best performance to date. This is the same for Bill Skarsgård. I love him as Pennywise in IT but I found his performance here to be much more engaging. Robert Pattinson is excellent as always and he did a really good southern accent here. This is definitely a Top 5 performance from him but not my personal favorite. Everyone else here did a good job but it was harder to care about their characters than Holland, Skarsgård, and Pattinson. Some people might be put off by the narration but I didn’t mind it because it was narrated by the author of the book that this film is based on. It gave the film a book like feeling which worked for me. The directing by Antonio Campos is pretty great. He definitely has a great visual style and voice here and he is great at showing these themes of religious extremism and trauma. The cinematography and score also really added to the experience here too. Go check this out on Netflix if you want but beware of it’s very dark themes and violence."}, {"rating": "8", "text": "Fantastic cast with an amazing narrative and world development, it’s like a Coen brothers film."}, {"rating": "10", "text": "I think this movie is really a 9/9.5 but I think the critic reviews are kind of ridiculous and I'm going to round up. The cast was phenomenal, especially Tom Holland, he was absolutely amazing. The storylines were all excellent and came together beautifully."}, {"rating": "8", "text": "I was captivated by the characters and their grim tale. It kept me in front of the screen 'till the credits rolled, and that's something of a rarity these days."}, {"rating": "10", "text": "Didn't that from a young actor like Tom Holland, Such a brilliant performance!"}, {"rating": "10", "text": "Possibly the most miserable movie I’ve ever seen and I love it. The performances are amazing, the script is great, and the story is great. If you don’t like miserable movies then this might be hard to watch."}, {"rating": "10", "text": "Tom Holland at his best. A really grim and fascinating story with dark characters and moments. And there is a scene in which Spider-Man kills Batman. What else you want. Robert Pattinson deserves a mention too. He plays a sinister priest and his actions justify his murder by Arvin.b Overall a great movie with great acting."}, {"rating": "6", "text": "Dark, I mean really D A R K.\rVerdict: The Devil All the time (2020) is a gothic thriller, tells the story of evil and the danger of twisted faith. With all multiple storylines, it lacks depth and meaning, but enjoyable for some degree. Tom Holland, Pattinson shined with their newfangled roles. Riveting performance by everyone. My rating is 6.5/10. [link omitted per site rules]"}, {"rating": "10", "text": "Excelente Película! Una interpretación muy seria por parte de los actores y una ambientación que llama la atención desde el primer momento"}, {"rating": "5", "text": "Acting is great and some of the best performance yet from those actors but the movie isn’t about anything. There seemed to be no theme and was essentially tragedy porn."}, {"rating": "10", "text": "The deaths in this movie are not overly dramatic but also don’t feel like a side note. You really feel all these events wearing down on what could be considered the two main characters (Arvin Russell and Sheriff Lee Bodecker) as we see most events through their points of view. Throughout the movie you are guessing how the two characters lives will converge in the climax and it’s done really well. By far my favorite part of the movie was seeming how characters in authority were able to influence the behavior and actions of others. You were never asking “how’d that happen?” Throughout the movie due to it having a good structure and never doing anything that went against the established behavioral expectations set for characters"}, {"rating": "8", "text": "Una película muy bien hecha y distribuida, con un elenco dónde hacen que sus papeles se reluzcan brillantemente, la trama te atrapa en todo momento y te pone en evidencia toda la clase de pensamientos que tiene nuestra sociedad, desde los más puros hasta los más \"diabólicos\"."}, {"rating": "9", "text": "Don’t listen to the critics on this one! Imagine the story structure & violence of “Pulp Fiction,” except set in the 50s & 60s in a super religious rural town. The last 45 minutes are some of the most intense scenes I can ever remember, in any movie or TV show I’ve ever seen.This is a GREAT movie, and if a famous, well-known director made it, we’d all be talking about Oscar noms. I see similarities to the movie “Running Scared,” because, like Paul Walker’s character in that movie, Tom Holland’s character keeps running into crazy, horrible people, (especially in the final act) #TheDevilAllTheTime @TomHolland1996"}, {"rating": "10", "text": "Muy buena película realista sin agregar basura iré al ni romantizar ecenas"}, {"rating": "8", "text": "I had no expectations since I rarely feel American movies are complex or tragic for any \"reason\" and it's rare that they leave me lasting emotions. Or any surprising events after 5-10min.This is definitely a good movie, maybe great but while I really enjoyed the ride, I still can't understand how a movie so packed with events could feel so long. I definitely think it's worthwhile but it doesn't feel like one I would enjoy a second go with. The darkness is well portrayed, not very graphic but enough to get uncomfortable and the imagination fills in what's not shown, so that depending on how accustomed to real dark plots you are, it adapts smoothly. But it felt a bit afraid to actually let the viewer take in and reflect since it moves on sometimes way to quickly. While it's a more realistic and easy to understand and predict to cause many surprises, the acting and impressive way it ties together a red thread of almost thin air. It's not a mind blowing story but still worth a view. And that's the issue, I can't imagine enjoying or finding much new perspective, it's dark for sure but lacks depth. Though given that \"Joker\" was to violent dark or whatever it was for some audience not to long ago, I feel like the sadness of it all at points become over bearing but still not rly thought provoking. It's not as tragic as the packaging makes it, it's simple and while hard to forget. No questions remains once we reach the end. It doesn't deal with many Grey areas. It's a good story but more like a tale of evil then a tragedy that invites reflection. The characters are simple, unpure but it lacks that depth, it's sad but very straight forward. Evil - tragedy but most characters or their motives are explained to much to make me feel for them most of the time. Pattinson is great at being evil but it's so on the nose that it makes the characters around look clueless. Comparing it to say, Fate Zero or Code Geass it's not actually that tragic, it's not much character development so the acting might be great, but it's also straightforward in what role they have. While it might be to dark for some, I feel it's almost cartoonish in how evil is portrayed by Pattinson, looks good but but since you never really get to think about much, Skarsgård was the only one whose character didn't feel one dimensional. It ends decently but while it is full of just sadness brought by evil, it's not rly time, room or need to reflect, it's sad and evil However I can't tell what is missing from it, but when I think about my favorite tragedies, typically anime I feel like the time to fullt dwelve deeper"}, {"rating": "8", "text": "This movie is all about Tom Holland, he showed that he is not just a superhero, he is the superhero. A slow burn movie, which builds up the heartache as it drags on, like the list of bodies in it. Such fine acting!"}], "recommendations": ["magnolia", "the_place_beyond_the_pines", "arbitrage", "a_most_wanted_man", "odd_thomas", "the_good_shepherd", "nocturnal_animals", "the_prestige", "unbreakable", "child_44", "mystic_river", "murder_on_the_orient_express", "donnie_brasco", "the_accountant", "hereafter", "body_of_lies", "the_hunger_games_catching_fire", "news_of_the_world", "the_rover", "the_experiment", "changeling", "hell_or_high_water", "eternals", "legend", "american_gangster"]}