{"id": 3525, "title": "The Princess Diaries 2: Royal Engagement", "starring": ["Anne Hathaway", "Julie Andrews"], "runtime": 113, "genre": ["Comedy", "Drama", "Family", "Romance"], "description": "Mia Thermopolis is now a college graduate and on her way to Genovia to take up her duties as princess. Her best friend Lilly also joins her for the summer. Mia continues her 'princess lessons'- riding horses side-saddle, archery, and other royal. But her complicated life is turned upside down once again when she not only learns that she is to take the crown as queen earlier than expected...", "releaseYear": "2004", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/9GkLjwvqjwDfLZkWLGjLLfQf2Be.jpg", "categories": {"plot": 7.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "As with any sequel, some of the original zest is lost. Nevertheless, Anne Hathaway and Julie Andrews are a match-made-in-heaven. They keep us entertained and what more could we ask for?"}, {"rating": "10", "text": "Mia Thermopolis is right on: Every girl can be a princess. Mia shows us how a princess is kind, selfless, generous, and gracious to everyone.  This positive message is only one of the great things in this movie.  The fashions are gorgeous, Chris Pine is really handsome, and Julie Andrews makes an invaluable addition. An amazing sequel all-around."}, {"rating": "7", "text": "Good fun! While it was unnecessary, and the falling in love with the guy plot was stupid, we still get great laughs, and the wonderful Julie Andrews to sing to us once more"}, {"rating": "5", "text": "The film is meant only for girls. A sequel that has nothing to do with its front. It's like a Disney Princess movie but modern version."}, {"rating": "5", "text": "The performances are over the top from actresses Anne Hathaway and Julie Andrews, the British comedy jokes are not clever; it's not a necessary sequel, with beautiful sets."}, {"rating": "0", "text": "La primera no fue buena en lo absoluto, esta secuela no lo hace mucho mejor, sino peor."}, {"rating": "3", "text": "Being totally honest, I gave it a 3 having liked this movie before. The reason is that the message is misleading: instead of teaching anything to girls, or showing how can they also be good role models (being a queen, being a princess, etc) it's just showing them as materialistic, clumsy and lazy.I know the princess stereotype in this movie is more like the princess a little girl would like to be, with tons of dressess, jewelry, good looking guys, etc. I should not be that hard, but I think kids deserve more than this.It just looks like a product of this time, does to girls what transformers does to boys."}, {"rating": "10", "text": "The Princess Diaries 2: Royal Engagement is as quirky as it's title hints at, but is sweeter than expected. Hathaway's charm and the movie's message makes the magic come alive."}, {"rating": "10", "text": "Sometimes, we really hate responsibilities but we absolutely weigh in possibilities if a step we  will take will cause an imbalance to everything. Great movie for dreaming on being a princess with real responsibilities."}, {"rating": "6", "text": "----------------------------------5.5/10-----------------------------------"}], "recommendations": ["enchanted", "leap_year", "clueless", "the_santa_clause_2", "maid_in_manhattan", "mean_girls", "easy_a", "17_again", "godmothered", "what_a_girl_wants", "hannah_montana_the_movie", "bride_wars", "labyrinth", "10_things_i_hate_about_you", "13_going_on_30", "the_princess_diaries", "nanny_mcphee", "pretty_woman", "the_holiday", "the_christmas_chronicles", "tooth_fairy", "ella_enchanted", "stardust", "a_cinderella_story", "you_again"]}