{
  "id": 12,
  "title": "The Vault",
  "starring": [
    "Freddie Highmore",
    "Astrid Bergès-Frisbey"
  ],
  "runtime": 118,
  "genre": [
    "Action"
  ],
  "description": "When an engineer learns of a mysterious, impenetrable fortress hidden under The Bank of Spain, he joins a crew of master thieves who plan to steal the legendary lost treasure locked inside while the whole country is distracted by Spain's World Cup Final. With thousands of soccer fans cheering in the streets, and security forces closing in, the crew have just minutes to pull off the score of a lifetime.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kWhXubAiIcHW0xn5GThflqaKZqh.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.5,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It's clear to me that James Franco is incredibly prolific but it's also clear to me that many of his projects are of medium to poor quality and this simplistic movie is a perfect example of it.No doubt he will redeem himself with The Disaster Artist but I think he should start being much more selective."
    },
    {
      "rating": "5",
      "text": "Interesting idea at best, poorly implemented at worst. The Vault is a mish-mash of two movie genres, that being bank heists and paranormal horror.A group of people plan a bank heist, what they don't know is that something is lurking in the darkness below.The whole affair starts off pretty good and gets the ball rolling and it doesnt take long for the paranormal aspects to kick in, the biggest issue here, is after the ghosts do show up, the move becomes a really, really slow burner. Further, there was audio problems with the copy I saw. The music and stuff was always just loud enough to make out what the actors were saying."
    },
    {
      "rating": "0",
      "text": "surprisingly incompetent story. stupid. boring. it is banal. not interesting and not believable. watch not recommended. thriller and horror are poorly compatible genres, especially if these genres try to combine an incompetent scriptwriter"
    },
    {
      "rating": "6",
      "text": "Nothing is as it seems to be. In the particular dark vault with the mystery and traces of turbulent history. A simple plot with a good story line and lively acting does not need a special effects and cheap tricks to scare the viewer. Good movie with predictable finale and ridiculous James Franco’s mustache."
    },
    {
      "rating": "5",
      "text": "The movie starts out really promising and you do have to know that it is not just heist movie, it actually is more of a horror movie or something like that, but when the horror part actually starts the movie gets down to be quite simplistic and a bit boring fast, even though they made it to have the other effect."
    }
  ]
}