{"id": 1137, "title": "The Legend of Tarzan", "starring": ["Alexander Skarsgård", "Christoph Waltz"], "runtime": 109, "genre": ["Fantasy", "Action", "Adventure"], "description": "Tarzan, having acclimated to life in London, is called back to his former home in the jungle to investigate the activities at a mining encampment.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/eJrfz178xBGlxjDGxnBXTzWWa4w.jpg", "categories": {"plot": 5.745454545454545, "acting": 6.071428571428571, "ending": 7.0, "soundtrack": 3.0, "cinematography": 8.666666666666666, "familyFriendly": 6.0, "funny": 8.0, "action": 5.964285714285714}, "reviews": [{"rating": "7", "text": "I saw this with my son prior to seeing the reviews.  100% glad I did it that way - we both enjoyed it tremendously, and seeing the massive amount of negative reviews would have spoiled the fun.  We both enjoyed the massive-scale landscapes, the back-and-forth between George and Tarzan (and Jane and evil Belgian guy), the action sequences, and the overall story arc.  This felt like old-fashioned story telling with a generous helping of digital cinema thrown in for effect.\r The story itself is straightforward - Tarzan is brought back to Africa to unwittingly help exploit its population and satisfy an old grudge at the same time.  BUT...he obviously isn't having that any time soon.  Sam Jackson comes along for the ride an a flimsy (but disbelief-suspendable) reason that ends up adding to Tarzan's motivation.  And then there is Jane...one should not mess with Jane and expect Tarzan to be cool about it, right?\r I see reviews calling the back-story heavy-handed revisionist history.  Maybe, but I will say this - the movie gave me a chance to talk to my son about colonial Africa for the first time.  The history may have off a little (a little...), but this movie has created at least one discussion about mistakes our forebears made, and that can't be a bad thing."}, {"rating": "10", "text": "Absolutely LOVED it!  Very surprised....extremely entertaining.  Great casting.....can't wait to see it again.\rThe casting was unexpectedly great.  Wonder how they came to chose him for Tarzan, but he knocked it out of the park."}, {"rating": "10", "text": "Don't make the mistake that I almost made!!  GO SEE THIS MOVIE!!!  My friend and I were trying to decide on a movie on a kind of the spur of the moment thing.  We read the user reviews on Ghostbusters and decided against it.  Then I mentioned that a co-worker at work was raving about the Tarzan movie-which wasn't on my list to see.  We read some of the reviews here on Metacritic, and the majority were favorable-the user reviews.  We figured it would be an OK movie, but in actuality were totally blown away.  What an amazing movie, the full scope of the movie was incredible-storyline, plot, acting, action, and most of all the cinematography!!  This is not the Tarzan movies that you grew up with!!  This is the coming of age Tarzan movie that is finally deserving of the big screen and all it entails!!  Don't make the mistake I almost made and let it slip by me.  My friend and I agreed this was our favorite movie of the summer so far!  Whats up with the reviews from the Critics on Metacritic??-shame on you!!  I am sure many of you have been mislead before by the critics.  Well don't let it happen here, believe me take my word for it you won't be sorry!  The only thing in the movie that was a little out of kilter seemed to be Samuel L. Jackson.  That said I love him and in the end I was glad that he was in the movie, as he provided some light heartedness to the movie and some needed comedic moments.  I won't hesitate buying this movie when it comes out on DVD as I want to watch it over and over-still you need to see it on the big screen to do it justice, as again the cinematography is over the top!"}, {"rating": "9", "text": "Sometimes a cigar is just a cigar... Tarzan was a product of another age- an American looking back on the Victorian Age of Empire and the African colonial experience with rose colored glasses. The book was considered progressive and enlightened, sad as that may seem now...\rYates et al have attempted to rediscover the rip-roaring adventure with modern sensibilities, and i think succeeded. Unfortunately it is in the age of BlackLivesMatter. They do matter, really and truly, but this is just a movie. Not an attempt to rewrite history. An attempt to reconcile a childish story from another age with our desire to right wrongs but any nuances have fallen on deaf ears.\rI enjoyed the movie a lot, and i refuse to fall prey to political correctness and condemn it as white paternalism. There is no way to tell Tarzan in the modern era without ruffling feathers. As such i see this as probably the last retelling of the story, but at least he goes out with a bang. All his animal friends were there (i recall the old serials on weekend morning tv before internet or even cable in the backwoods i grew up in) but in a \"believable\" fashion. Jane is fabulous, and the Tarzan yell finally makes an appearance. The flaws of the film stem from attempts to avoid paternalism, but in this day and age you avoid these types of stories if you're trying to be \"safe\". Kudos to all involved for the attempt."}, {"rating": "10", "text": "Very  entertaining. Worth taking the family to. Wasn't  sure what to expect but was pleasantly surprised by the range of the movie. My friend and I both had some laugh out loud moments as well as picturesque ride. Tarzan was never meant to be brain surgery.\rDidn't mind the CGI it was better used in this instance than many others I've seen recently. I understand it's make belive.\rLoved it for what it was. Great fun"}, {"rating": "8", "text": "When I heard they were making another Tarzan movie I was a little worried that would ruin the story, but this film did not disappoint. The atmosphere of this film was perfect from beginning to end. The acting was great and the film was well written. I say if you want see a well rounded film than give this movie watch."}, {"rating": "10", "text": "My children loved the movie, my wife and I loved the movie. For those complaining there wasn't a plot, well some people are impatient due to the instant gratification age we live in thanks to cellphones.\r Great movie, great acting and great CGI. Even my 58 year old father in law liked this movie. He hates CGI!"}, {"rating": "7", "text": "If you just go to be entertained, you will be - my family was.  Oscar worthy - no.  Perfect - no.  CGI too much at times - yes.  Slow/silly at times - yes.  Entertaining - yes.  Just go enjoy the film"}, {"rating": "7", "text": "I enjoyed this movie. It has a serious tone overall, which I enjoyed.\rThere were plenty of captivating scenes with the animals that really drew me in.\rThe movie kept me interested and engaged throughout.\rThe story isn't deep or complex, but enjoyable nonetheless.\rThere were few minor cliches and the realism got confusing toward the end.\r Would definitely recommend this movie to people who like tense serious movies, are captivated by the beauty of the wilderness, like hot guys with hot bodies and aren't obsessed with perfect gem-mint hole-less plots."}, {"rating": "10", "text": "Critics are wrong! Audiences love this movie. Everyone in the theatre left in a good mood and I certainly felt it as well. Yes its campy and ridiculous, it's Tarzan! Who cares!? Bad critics!! Bad! For a fun time at the movies go see The Legend of Tarzan!"}, {"rating": "10", "text": "I have been a Tarzan fan for 40 years and the movie The Legend of Tarzan did not disappoint! Over the years many Tarzan movies have left me let down. This one did not,  I loved it !  I wanted to re-watch it immediately."}, {"rating": "10", "text": "If you liked the trailer, you’ll love the movie!! Trust audience ratings, and not the biases of cynical professional “critics.” Generally, critics gave high ratings to The Jungle Book, including its CGI effects, yet are critical of the CGI in The Legend of Tarzan. Isn’t it odd that the same company that produced the fine CGI effects for The Jungle Book completely lost those abilities while working on The Legend of Tarzan? [perhaps this illustrates the pre-determined bias of some critics?] And the non-CGI actual scenery filmed in Gabon makes a stunning feast for the eyes. Anyway, this movie is about a story, a good script, and fine acting, not CGI eye candy. Prominent critics keep saying the story is worn out and out-dated, but to those who loved the Edgar Rice Burroughs novels, the story has never been accurately portrayed on the big screen. I read my collection of 24 Tarzan novels many times as a youngster during the ‘60’s. The challenge for moviemakers has always been that the character changes and develops so much over the course of the series, and conveying Tarzan’s complexities in a 2 hour film was daunting. With a 32 year span since the last movie effort to bring a live action, not animated, Tarzan into a movie adaptation, the need to appeal to older lovers of the novels, and to explain the story to next generations, presented a major challenge. Yates has effectively pursued both objectives. If one objects to remakes of classic adventure heroes, or to Edgar Rice Burroughs, or his novels, in general, then this is not the film for you. But if you would like to see an effort to seek to realistically enable the character of the novel series to come to life in a movie, you will not be disappointed. And it is CGI technology that enables this effort to authentically bring the nearly superhuman, yet still vulnerable, Tarzan of the novels into a live feature film. There are so few well-made, uplifting, and exciting movies, and especially ones also including an emotionally connected romance, that it is a shame so many will miss out on this one due to critics with negative bias who never gave the film a chance. The Legend of Tarzan, due to negative reviews, will likely not have a sequel, so it seems this film will become the best representation of the genuine Tarzan from the novel series. And that is quite an accomplishment. Try it in IMAX 3D. Impressive! I will definitely see it again - many times."}, {"rating": "4", "text": "The Legend of Tarzan is directed by David Yates and stars the likes of Alexander Skarsgård, Samuel L. Jackson, Margot Robbie, Djimon Hounsou, Jim Broadbent, and Christoph Waltz.\rWith a director such as the amazing David Yates, you'd except your fantasy movie experience to be special considering his brilliant previous work on the Harry Potter franchise but you'd just be left disappointed - like me.\rThis movie had it all going for, a big budget, an amazing cast and director all they had to do was come up with a simple script that pushes Tarzan towards his adventure on the jungle, and they failed miserably. The story is so confusing and even worse uninteresting that at a point you're left asking yourself - is Tarzan even on this ?\rAnd when we finally do arrive at the ever so expected Tarzan classic sequences such as, swinging through the jungle, it is so disappointing and terribly done that you realize it was not worth the wait at all. Heck, even the fight scenes with Tarzan in it were so poorly shot, with intense shaky cam that makes it nearly impossible to tell what's going on. Then there are a lot of side stories that are just thrown in there for the sake of the story that you do not care about at all.\rOn a more positive note though, Samuel L. Jackson looked like he was having fun on the role and his character gave the film that much needed energy from time to time. Christoph Waltz however was generic to an unbelievable degree, his character's motivation for doing the things he's doing make very little sense, not that anybody even cares about it either way. Even the CGI was mediocre, in a year when we've had movies like The Jungle Book where the talking animals looked almost photo-realistic, Legend of Tarzan just fails on that and many other levels too.\rThere were a few scenes here and there that were fine-ish to look at and slightly interesting but overall I would not recommend this film at all. It is filled with potential but only ends up being a major disappointment that suffers from terrible pacing and a story which is all over the place to say the least."}, {"rating": "6", "text": "I went to see The Legend of Tarzan because I'm a huge fan of Alexander Skarsgard, and in that regard, it doesn't disappoint. He has screen presence to spare and gives a great understated performance, which is quite refreshing in a summer blockbuster. He has the perfect balance between English aristocrat and animal, and does a convincing job selling his bond with wildlife.\r Skarsgard's chemistry with the rest of the cast is on point, especially with Samuel L. Jackson. Margot Robbie was also pretty good, especially considering that she's relegated to be a glorified MacGuffin. However, I'm afraid I can't say the same about Christoph Waltz, who at this point, has gotten pretty tiresome because of his same old mustache twirling (literally) jerk shtick. He almost single-handedly ruined the movie. Where's Gary Oldman when you need him?\r The Legend of Tarzan has its heart in the right place, since it wants to go for the most politically correct route possible, even though it relies on cliches like the mighty whitey, the damsel in distress or the aforementioned mustache twirling villain. Its story isn't particularly engaging or nuanced, but it has the decency of never being boring thanks to an agile pacing.\r I've never been a fan of David Yates' direction, and this movie didn't do anything to change my mind about it. He still likes to use the same dull and dark color palette, which is a baffling choice for a film set in the Congo jungle. The action scenes are decently staged, but many of them feel pointless and contrived. And since the villain is more annoying than menacing, there's not much sense of urgency in them.\r I won't go as far as saying that The Legend of Tarzan is a bad movie. But I can't help but feel that it's a missed opportunity to be a deep exploration of complicated themes like poaching, race relations or cultural identity."}, {"rating": "10", "text": "This movie is just great! The pace is not sluggish at all. The story actually flows very quickly and clearly. You could felt the characters, the animals and the actions. The cinematography is just beautiful - very much like the \"Revenant\" earlier this year.\rMost importantly, don't think it's a bad or boring movie just because the critics are so low. It's a quite enjoyable and exciting movie to watch! Go to see it, and you will love it!!"}, {"rating": "4", "text": "The Legend of Tarzan does represent some of the finest Tarzan moments in movie history, but its story is generally corny for moviegoers. Tarzan fans, go yell in the jungle because Tarzan's here. Its corny story, usual characters, (Actually, I don't feel bad for Alexander Skarsgård, but his performance is bland enough. At least he tried...), even better, the director wanted to take Tarzan to the next dimension, but failed to even try to fit the Tarzan world into the normal world. The Legend of Tarzan may look interesting by covers and posters, but it failed as a movie itself."}, {"rating": "4", "text": "The Legend of Tarzan missed every point on entertainment, story and originality. This CGI-heavy motion picture failed to deliver a convincing tale of a really interesting character by trying to be way too serious and uptight, which results in an unpleasant pile of boring images that have no consistency or chemistry."}, {"rating": "10", "text": "The critics really go this one wrong! In an election year I understand - easy to get lost in politics, but call the movie what it is! It's fun! The characters are engaging, the dialogue and chemistry gets you lost. I couldn't believe the time flew by so fast, and you find yourself just happy for everyone at the end! Could the CGI be better? Well, I suppose... but why quibble when you find yourself joyously watching the scenery and rooting for the course of true love? And what's not to love? The good guys win (all of them). The bad guys lose and there's animals! So put away your own baggage and go see the best adventure romp of the summer. I know I'll go see it again!"}, {"rating": "5", "text": "It's almost 1:45 into this movie before Alexander Skarsgård slips off his fancy English duds to reveal his jungle-bred physique (and it's worth the wait!). That's because he starts this story as a civilized Lord back home in England, putting the jungle behind him. To make him \"go native,\" it takes a tired plot about Belgians (led by the inevitably evil Christoph Waltz) mining the Congo for diamonds and slaves. Margot Robbie does make a lively, lovely Jane. Even though the story is somewhat clunky, often predictable and just a tad absurd, there's lots of magnificent scenery and jungle spectacle (although some of the CGI flora and fauna isn't convincing). The few action scenes are cut too fast and become a blur of movement and by the preposterous finale, Tarzan has demonstrated superhuman powers. The only thing that's special about this retread is Skarsgård in his Tarzan tights."}, {"rating": "10", "text": "Under-rated by Critics!  I went with  one expectation it was a Tarzan remake, but none other than to enjoy the movie.  No way do I think \"it is just that\" now.  Yes, the theme is certainly there. But substantial, realistic, content gives Tarzan himself a purpose, and gives added meaning to me as a viewer.  This unique content was nicely and seamlessly interwoven.  I think I  looked over at my family maybe three times (if it was more than that, I don't remember)  From beginning to end, my eyes were glued and drawn to the emotion and intensity of the screen.\rI give standing applause for extraordinary acting for every character.  Each performed role to the \"t\". The role of G. W. Williams was refreshing and without him, we would never have known what this movie could have been.  But he was there, and how awesome it is.  Tarzan and Jane strong, resilent, and (appropriately dramatically) in love.  Tarzan himself \"real\" to the character.  Chief M solidly established leader, confident as a person, and wise. Director's attention to \"detail and capturing the moment\"  are spectacular.   The moments of pause and silence well done!  The \"unexpected\" at the most un-expecting moments- right on!  Action and scene playouts - on time and solid!   Scenery and background design authentic to the theme and nicely orchestrated.  Animal scenes pretty cool, and the personalities of each  well portrayed and contrasted.   Elephant moments....intimate, kind, and meaningful.  Suitable for mid teens on up. Parent is the best judge for those under 13. There are a few places that would have scared me when I was 12 or younger, but then I sometimes get scared at at the wind blowing open the door.   What do I take with me from this movie:   Pure satisfaction I chose  a movie with substance, emotion, action, outstanding sound effects at the right time, and a tad of intellectual (historical)  tidbits while enjoying every bit of it.  Would I watch this movie again.  Definitely and not just once over the years ahead.  Would I pay to see it again: Probably yes, at least one more time"}, {"rating": "10", "text": "Phenomenal music, phenomenal acting, and great storyline. African cultures are portrayed in a positive light with dignity and respect. Other than some obvious CGI (honestly, what CGI isn't obvious?), the overall scenery and animal characters were amazing. I was on the edge of my seat through all the fast-paced action sequences. I'm skeptical of live-action remakes of movies from my childhood, but this one didn't disappoint. It had just the right doses of action, morality, humour, and darkness. The message I came out with is, truly, \"home is where the heart is.\""}, {"rating": "8", "text": "Surprised this didn't wow at the box office. I thought this was an enjoyable and competent popcorn adventure.The film looks great with its lush jungle African nature environment. Also, nice to see a film that isn't completely grey-screen these days. Action and fight scenes were also good, especially the fight scenes involving animals.I found it refreshing that the story wasn't a simple rehash of the first time Tarzan met Jane. It's a completely new adventure.Margot Robbie and Samuel L. Jackson kill it in the film. Robbie is a spitfire and Jackson does what he does best. Before this film, I was worried about the casting of Waltz as the villain. He's played a lot of them lately and I was afraid he'd suffered villain decay like he did in Spectre.  I was pleasantly surprised to find his villain was a different type in this. His Leon Rom is an understated survivalist. It's interesting to see a villain who's self-aware that he isn't always at the top of the food chain but masterfully rolls with the punches.Skarsgaard is a good Tarzan, but I do fear he suffers from being more serious than the rest of the characters and there's a bit of a disassociation.Yes, the film does suffer from \"white savior\" syndrome. A white guy is responsible for saving a lot of black people. It is uncomfortable.Still, overall, I found this to be an action-packed thrill ride."}, {"rating": "4", "text": "What is there to say about a movie called “The Legend of Tarzan” that doesn’t have the title hero ever appear in a loincloth? Or where his sidekick, a Black man, is the wiser man, a philosopher and has funnier lines than Cheetah ever had? Or where Jane is a 21st century feminist.\r This update of the legend of Tarzan does have him swinging from vine to vine, diving into trees, carrying a man on his back as he swings onto a moving train. He fights computer generated apes, losing some, winning some, and he never utters “Me Tarzan, you Jane”, which is a good thing. There has never been a Tarzan as muscularly defined as this one is nor who’s face, including the eyes, are never involved with what emotions he tries to express.\r The stars of “The Legend of Tarzan” are production designer Stuart Craig and cinematographer Henry Braham who make Gabon, Africa, look like a Paradise, along with visual effects by Tim Burke including all the animals who are computer generated.\r Alexander Skarscard as Tarzan serves a hefty dish of eye candy while Margot Robbie brings feistiness to Jane. Christopher Waltz’s villain is becoming old hat while Samuel L. Jackson brings a much-needed smile or two, along with heroics, while Djimon Hounsou, as a tribal chief, does what he can with the role.\r “The Legend of Tarzan” is one of 6 movies opening this July 4th weekend and I think I could have done better with any other of the 5!"}, {"rating": "8", "text": "The pro critics missed the boat on this one.  It's highly engaging, highly entertaining, and the 4 lead actors are fantastic in it.  It's not for kids, but it's kind of a nice book-end to the Jungle Book from earlier this year.  Eric Northman is pretty fantastic in the lead role, and Robbie shows enough restraint to let him shine.  I won't go into the beats of the film other than to encourage you to see it.  It's FAR better than the other \"superhero\" films of the summer."}, {"rating": "6", "text": "Boasting impressive set pieces, true-to-life CGI, and taut direction from David Yates, The Legend of Tarzan is well made, even with it's long run time, recycled story, and weak acting and dialogue."}, {"rating": "6", "text": "this isn’t that great of a Tarzan film and I think people that are unfamiliar with the extended novels of Tarzan might be a bit surprised to find that they are not getting a Tarzan origin story with this film.  It’s got some decent action, some decent performances but I don’t think they got into the psychology of Tarzan well enough.  I also felt they tried too hard to turn Tarzan into a super hero movie, not that is necessarily a bad thing, but it you are going to do that it’s got to be well executed."}, {"rating": "5", "text": "THE LEGEND OF TARZAN: With all the superhero movies out there today it was inevitable that one of the first 'superheroes' was bound to get a remake. It is rather ironic however that it is Tarzan that fails to set any kind of benchmark and instead is one of the most generic out of the lot. The plot at its heart is a simple damsel in distress as a rehabilitated Tarzan (now John of Greystoke) returns to his animalistic ways in order to save his beloved Jane. However the narrative of this straightforward plot takes many bends in the road as we include subplots of slavery, jurisdiction, politics, and a rather odd and perverted infatuation. It is all far too much with a lot going on and nothing focused on. The characters are one dimensional with very little tension and emotion feeding through, and Tarzan's connection with the animals is either ham-fisted or unreliable. We are made to believe that he can cope in this wild and then given an on the nose flashback to just remind you of who he is. The flashbacks are unnecessary but I believe are there to pad out the story as with the lack of depth there is very little to sustain the running time, despite it being less than two hours. The cast are rather bland with Skarsgaard fighting a dull character, Samuel L Jackson being Samuel L Jackson, Margot Robbie given little to do and Christoph Waltz basically phoning it in. It isn't the worst film to hit the big screen this year but with the talent involved in it there should have been a much better film produced. Too much and yet too little completely wastes The Legend of Tarzan."}, {"rating": "0", "text": "The king of self-indulgence, David Yates manages to squeeze the soul out of yet another charming childrens tale, ruining it with a silly story and distracting special effects."}, {"rating": "9", "text": "Honestly I feel like the better movies are severely underrated by the critics recently. First X-Men: Apocalypse with a 52, and now this one with a 44. I'm not trusting Metacritic for movies anymore.\r But, *ahem*, let's actually review the movie instead of complaining, shall we?\r.\r.\r.\roh who am i kidding i'm too lazy to actually write anything here"}, {"rating": "0", "text": "There was absolutely no point to this movie whatsoever. What a SLOG. Nothing happened and for 2/3 of the film tarzan is in civilian attire. Just ridiculous. Such a bore. There were like 2 or 3 action sequences. HOLLYWOOD NEEDS A WAKE UP CALL. Look at all the bad movies they consistently put out. People should boycott any movies that don't earn a 70 on metacritc"}, {"rating": "4", "text": "Yet another CG snorefest with no heart. A mindless action flick where Tarzan has matured and makes his way back to the jungles to stop slavery except that Tarzan as we know him was largely absent. Instead he was more like a brooding vampire which is exactly what his actors played in a unrelated TV series named True Blood. All his scenes were boring and the action was plain silly. The movie reminded of a real bad 80's style action cartoon... you know... one of those scenes where all the heavily armed bad guys are waiting to spring a trap, only to run away at the 1st sign of danger. All except the evil leader, who can apparently kill anyone using a necklace which makes awesome swoosh sounds whenever it is whipped around. But worry not, because nothing stands in the way of the mighty Tarzan who can break anything with his neck muscles alone! Puke. Still, it was better than the latest Independence Day movie which does not say much."}, {"rating": "0", "text": "Terrible on so many different levels. Unlikable broody for no particular reason Tarzan, feminist appealing unrealistic Jane. Completely screwed up timeline. Boring love affair with no chemistry between actors."}, {"rating": "1", "text": "Absolutely terrible movie. Cheesy beyond limits, a boring storyline which considers 2/3 of the movie just exposition and that leads really nowhere, and action scenes that seem to come straight out of a comic book in their believably. I was also very uncomfortable with the latent \"white-guy-helps-the-natives\" complex underlined with African children singing songs etc. which is really inappropriate. What's worse is that it doesn't take its historic context seriously in which 10 million Congolese were slaughtered in a Genozide by the Belgians (and none of the major powers at the time prevented). Does leave a bitter taste to the small victory that Tarzan and his gang celebrate at the end. Stay away from this garbage!"}, {"rating": "0", "text": "The Legend of Racism...\r I felt this movie was incredibly insensitive. It takes more than a british director to slap a couple bandaids on an issue he cant even fully comprehend. To continually 'white cast' actors also offends me deeply. Is it too much to ask for a more diverse cast, especially in lead roles?"}, {"rating": "3", "text": "Brace yourself. This is Africa, where wealthy white guys walk digital alligators on leashes as though it were outside the cantina on Mos Eisley. Aside from a few touching moments, a few chuckles aimed at children, this movie is pure, unadulterated Hollywood drivel. You can tell by the generic soundtrack theme, as it swells at the most predictable moments. Samuel Jackson, perhaps looking for a paycheck and having seemingly no fun at all, is tiresome as the obligatory comic relief sidekick, and now and again the character digs into soulful narratives about war and his regrets, groping for soul and coming up empty. The flashbacks are awkwardly timed and paced, particularly those of the young Tarzan, and are spliced in randomly throughout the narrative. Sometimes the gorgeous scenery makes for a scene in itself, and the few times I had that thought, breathing at the chance to relax for a second, there was an awkward cut to some other random shot. The Jane character is pure eye candy, the quintessential damsel in distress, revamped for the politically correct feminist era, though not quite to the point where she can actually take care of herself in the wild. The villain, who's motivations are wildly unclear, comes to her rescue when she finds herself cowering before a awkwardly rendered CGI Gorilla. His modus operandi is to choke people with a bracelet, and for some reason, that renders him almost invincible (the villain, not the gorilla, though neither would have been plausible in the slightest). There is a joke about priests in there somewhere, I guess, because the deadly bracelet, the deadliest piece of jewelry in a movie in decades, has a cross on it. The evil 'mercenaries' are as faceless and nameless as the soldiers guarding the slaves, who Tarzan mercilessly beats to a pulp, with his uncanny animalistic version of martial arts. I couldn't tell if the characters or the CGI creatures were more lifeless, so this inquiry was almost entertaining. It's one of those movies that is made in tandem with the video game, and I could almost predict where the different levels would be. Level one, shoot dust covered africans guarding the diamond mine. Level two, wrestle with gorillas. Level 3, run along faux digitally rendered branches with a rifle, etc, etc, ad nauseum. Now, there are some pros. The general message of man living in gentle harmony with nature, as contrasted to the more exploitative traits of the slave traders, is relevant. Looking into a digital elephant's eyes was sweet, though Samuel Jackson's stiff period acting ruined that; Tarzan rubbing heads with lionesses, and Samuel Jackson's rote astonished look. Jane and Tarzan had some chemistry, if in a predictable, cologne ad sort of way. Now, I still like the Tarzan archetype, so it was watchable. I just had to squirm in my seat to overlook plot holes and limp characters. The digital gorillas bonding with the young Tarzan is touching. Oh and Tarzan eventually meets with the tribal leader who's son he killed decades before (obviously), and that fizzles out almost immediately after some anticlimactic scuffling... there is supposed to be some subtle catharsis (I guess), and Tarzan runs ahead, leaving behind a teary african in a leopard head suit. Oh, and I'm glad Jane birthed a jungle baby at the end. I hope that's not a spoiler. I saw it coming from the first flicker of the first scene."}, {"rating": "7", "text": "A flawed epic. Not everything in Tarzan's return to Africa is up to par, but once Tarzan sets off to save Jane we get treated to quite a few thrills to keep us watching.The biggest issue is it's flawed start. We are treated to way too many flashbacks into Tarzan's origin story, the animal CGI is a little behind the times, and the characters just aren't given much to do. Then the story gets started and on top of being treated to the already beautiful landscapes, we get some impressive action sequences, a charismatic and dastardly villain in Christoph Waltz, and great dialog between Skarsgård and Jackson. The latter of whom turns out to be a real show stealer.Yes, when the movie dives finally lets Tarzan be Tarzan and interact with his excitingly dangerous former home and it's inhabitants, the movie really takes off. The flaws almost melt away in the face of the exciting set pieces and wild animals. The movie takes a turn from kind of a bore into something quite a bit of fun. The plot begins to take on more substance as well, giving you a reason to root for our hero outside of just wanting to see him save his girl. The movie still suffers from lulls whenever Skarsgård and Jackson aren't onscreen, but Waltz and Robbie do an admirable job of keeping us going until they are back onscreen. Robbie in particular is given some sharp dialog. Shame about that standard damsel in distress role.Overall this \"legend\" is quite flawed. Not without it's high points though. It manages to overcome it's issues in just enough ways to still be enjoyable. There proves to be just enough thrills to keep you going, even if nothing here will blow you away."}, {"rating": "9", "text": "Wasn't really expecting much but i gotta say hands down the best live-action Tarzan film.\rPros\r-The actors are perfect for their roles.\r-The action was surprisingly good but i wish there was more.\r-Tarzan swinging through the forest was particularly awesome but once again there wasn't much of it. (he didn't even slide on branches/logs, but atleast he did do the yell a couple times.)\r Cons\r-The whole overarching plot of the movie seems a bit forced but it''s passable.\r-A bit too romancey ( Very slow flashbacks that could've been done in less time or don't really add much but just kill the momentum of the film).\r-Felt like they were torn between playing to an audience of people who know who Tarzan is supposed to be and an audience that's never heard a thing about Tarzan. Mainly felt like they were playing to people who knew who Tarzan was (especially the beginning part with Samuel L Jackson) but backtracked and tossed in some backstory wherever they could."}, {"rating": "5", "text": "Director David Yates' \"Hook-esque\" take on \"Tarzan\" feels more like a sequel to David Yates' nonexistent \"Tarzan\" predecessor than anything else. Lacking the life, vim, and vigor of most other filmic adaptations featuring the classic Edgar Rice Burroughs character, \"The Legend Of Tarzan\" plods along on sluggish pacing, spotty CGI, and muted performances from all cast members except the lovely Samuel L. Jackson. It's not to say there isn't some enjoyment to be had. I just simply wanted more rope-swinging and \"uhhh--ah--uh--ah--uhhhhhhhhhh--ah--uh--ah--uhhh--ing.\" And, yes, that's the closest I could get to a phonetic spelling of the Tarzan yell."}, {"rating": "2", "text": "I do not understand what Hollywood has before. Will it destroy itself?\rThe umpteenth Tarzan film we presented one and then also the worst so far.\rHere is unacceptable. Just beautiful pictures are not enough today."}, {"rating": "6", "text": "If you like Tarzan you would probably like this movie.  It's a big grand production serious in tone with state-of-the-art animal effects and a few laughs.  Most importantly it doesn't go on way too long as is the stupid trend.  Is it somehow underwhelming though?  Yes.\rMy problem with it is I am bored out of my mind now by all these big Hollywood formula flicks, and I don't much like Tarzan.  I still can recognize its accomplishment on some level and the fact that it delivers on its title for the most part."}, {"rating": "7", "text": "As a long time Burroughs fan I greatly enjoyed this attempt to capture the original concept of Tarzan as imagined and written by the author. This film is not the movie Tarzan. Th film successfully reconstructs Tarzan as ERB wrote him in 25 novels. Although the director and screenplay writers have altered the story, they also have managed to visualize the original Tarzan. However, the film lacks the sense of adventure that the movie versions of the 'wild boy' so successfully exploited. The version of Tarzan might be a bit too human for audiences looking for a superhero. So with some reservations, I recommend this film, especially for other long time fans of Edgar Rice Burroughs who have always desired to see a Tarzan film done right."}, {"rating": "6", "text": "Nothing impressive in my opinion and at some points a bit over the top with Tarzan being able to fight against anybody or even against masses of people. Don't get me wrong, it was a fun movie, but I did want to see something more here."}, {"rating": "1", "text": "You would think a Tarzan remake directed by David Yates, starring Alexander Skarsgård, Margot Robbie, and Christoph Waltz would be good or at the very least entertaining. Instead why not subject yourself to the longest hour and 50 minutes of what can only be described as torture. This is by far one of the worst movies of 2016, nothing remotely good about it. Amongst the endless mess of CGI there is a story that is constantly being interrupted by a pointless flashback attempting to add depth to its characters and failing miserably. I couldn't wait for this to be over. Not recommended, even a shirtless Skarsgård is not enough to pay money for this rubbish."}, {"rating": "6", "text": "The very definition of your average summer blockbuster movie, improved by the presence of Christopher Waltz and a more detailed backstory than in previous adaptions of the legendary character."}, {"rating": "2", "text": "One word, BORING. Samuel L. Jackson is funny but not enough to redeem this long snooze fest. Though the plot tries to divert from the original story, it is too simple and thus very predictable. A disappointment."}, {"rating": "3", "text": "The issue with \"The Legend of Tarzan\" was that I didn't give a rat's ass about any of the characters. It tries to create a romance between Tarzan and Jane so heartfelt and magical, but  it doesn't have the slightest bit of affection in my eyes. There chemistry was like a bag filled with garbage about to be burned by an incinerator filled with fire. In addition, it has a big issue with it's pacing. The film starts out slow by introducing us to the important characters, but it stays that level throughout the entire two acts. When the third act commences, it starts to build up into this brutally action-packed load of nonsense. I would rather have that dispersed in those two acts and then have another over the top scene at it's conclusion. You want to watch a good Tarzan film? Watch the animated version of Tarzan back in 1999. The Legend of Tarzan ain't Tarzan the Monkey Man I know and love.\r Rating: 3/10\r A+ = 10\rA = 9\rA- = 8\rB+ = 7\rB = 6\rB- = 5\rC+ = 4\rC = 3\rC- = 2.5\rD+ = 2\rD = 1.5\rD- = 1\rF = 0"}, {"rating": "5", "text": "Deutsche Review - Kritik Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden? Dann sind hier meine Punkte. Mein persönlicher Score = 46/100 Mein User Score = 5/10"}, {"rating": "5", "text": "This is a movie that kinda bored the hell out of me. I thought that it would be an epic adaptation of Tarzan but it wasn't that. The main problem I had with this movie is that, it's slow. It takes a while before the action happens. Speaking of the action, there's actually a few well done action scenes. The cast was alright, I thought that Samuel L. Jackson was the best thing in the movie cause it's Samuel L.Jackson! The cgi on the apes is meh, it's not really that spectacular or anything. The Legend of Tarzan overall is not really that great but it does have a few great moments. If you love Tarzan then you might be a little disappointed with this movie. If I were you, I would stick with the Disney Tarzan movie."}, {"rating": "3", "text": "both me and my partner watched this film and the first thing we said to each other upon exit was 'did you get it?'. the graphics were great as we watched it in 3D but there was absolutely no story line. there was a bad guy who was trying to catch Tarzan for an unknown reason (something to do with these crystals) and there was barely any detail about Tarzan growing up from a child to a man. all of a sudden at the beginning he was a grown man in Britain planning to return to Africa to protect something or prevent something from happening. albeit, me and my partner were both drunk and alternated going to the toilet to urinate but there was never a point where neither of us were watching the film and filled each other in upon return. I personally didn't understand the motive of Tarzan's feud against these ivory hunters, who knows perhaps I am wasted but it ended so abruptly that I had to entertain myself somehow."}, {"rating": "1", "text": "L'histoire est nul,Tarzan aussi, les ennemis sont inintéressant, Les effets spéciaux on été fait par un stagiaire.\r1 point pour Margot Robbie car en plus d'être harley, c'est la moins mauvaise par rapport aux autres."}], "recommendations": ["the_hobbit_an_unexpected_journey", "king_arthur_legend_of_the_sword", "mowgli_legend_of_the_jungle", "blade_of_the_47_ronin", "maleficent_mistress_of_evil", "beowulf", "bumblebee", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_bfg", "x_men_apocalypse", "spider_man_into_the_spider_verse", "avengers_age_of_ultron", "the_call_of_the_wild", "thor", "alice_through_the_looking_glass", "fantastic_beasts_the_crimes_of_grindelwald", "the_witcher_nightmare_of_the_wolf", "the_13th_warrior", "sin_city_a_dame_to_kill_for", "9", "300_rise_of_an_empire", "maleficent", "the_hobbit_the_desolation_of_smaug", "man_of_steel", "wonder_woman"]}