{
  "id": 555,
  "title": "The Expendables 3",
  "starring": [
    "Sylvester Stallone",
    "Jason Statham"
  ],
  "runtime": 126,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "Barney, Christmas and the rest of the team comes face-to-face with Conrad Stonebanks, who years ago co-founded The Expendables with Barney. Stonebanks subsequently became a ruthless arms trader and someone who Barney was forced to kill… or so he thought. Stonebanks, who eluded death once before, now is making it his mission to end The Expendables -- but Barney has other plans. Barney decides that he has to fight old blood with new blood, and brings in a new era of Expendables team members, recruiting individuals who are younger, faster and more tech-savvy. The latest mission becomes a clash of classic old-school style versus high-tech expertise in the Expendables’ most personal battle yet.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d63qz4XeNtbpDC5c70AlSUIbnTQ.jpg",
  "categories": {
    "plot": 5.872340425531915,
    "acting": 5.372093023255814,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.636363636363637,
    "action": 5.830985915492958
  },
  "reviews": [
    {
      "rating": "6",
      "text": "I actually thought it was a pretty good film. Let's face it it is what it is and it blows my mind that people expect something that will rank as something akin to a classic in years to come. I stil think the first one was the most fun but this has some great set pieces."
    },
    {
      "rating": "7",
      "text": "I'm not really a big fan of the Expendables series.\r Between friends and family I've wound up watching all of them, however, and I'd have to say that out of the bunch number 3 is the best. The main characters developed enough over the first two movies so as to have some backstory, its still fun to see the action stars of my youth teamed up, and the pacing was good.\r The plot is pretty much what you'd expect from an 80's action flick, but that's okay because the movie never billed itself to be anything else. All and all a solid 7 out of 10."
    },
    {
      "rating": "3",
      "text": "Stallone en 2010 nos anunció la primera parte de los Mercenarios, donde reuniría a toda la creme de la creme del cine de acción, Bruce Willis, Chuache, Lundgrend, Statham etc. El resultado en términos generales fue.... aceptable y a la vez decepcionante, porque la película NO cumplió con las expectativas, una dirección mediocre, personajes desaprovechados,y su gran cagada... QUE SE TOMAN EN SERIO EL FILM, el resultado es un direct to dvd con demasiado Hype por detrás. Dos años después nos llego su segunda parte donde se unía al reparto Chuck Norris, Van Damme y Stallone deja la dirección al director de la fantabulosa CON AIR y abandona el rollo \"Zerio, ojcuro y realishta\" y no se la toman en serio, y como resultado sale algo QUE ES LO QUE STALLONE NOS PROMETIÓ, una película de tiros, acción desenfrenada y muchas coñas sobre el cine ochentero.\r Y llegó la tercera....Y LA CAGÓ.\r A ver Stallone, la primera no convenció, la segunda si (que es totalmente opuesta), entonces ¿Que te hace pensar que volver a ese tono que no funcionó, volverá a funcionar? Además de intentar vender un mensajillo de relevo generacional y que luego rectificas a la ultima parte del film. ¿Que intentabas sugerir? ¿Que los actores de acción de ahora son mierda?, vale, ya nos demostraste en la 2, que vosotros sois los amos del cine de acción, no nos hace falta esa burda sátira con tal escasa sutileza.\r Aparte del mensajillo cutre y de la involución de la franquicia, la película esta completamente lastrada por elementos que estropean la película.\r 1-Un PG-13 que roza el insulto, las dos anteriores estaban calificadas R, violencia, mutilaciones, sangre (tanto bolsitas como digital) y esta NO HAY NI UNA MISERA GOTA DE SANGRE, los tiroteos parecen partidas de Airsoft, da la sensación  que se les ha olvidado comprar la sangre en el ultimo momento y no podían retrasar el rodaje o que en postproducción alguien con un crucifijo colgado en su pecho, no la ha añadido.\r 2-El reparto de yogurines, cuando parte de un reparto que tendría que tener relevancia se pueden sustituir por sacos de patatas, macetas u Hombres-Cartel de COMPRO ORO, algo no va bien, y desearía que no volviesen a salir mas, en la hipotética (porque no ha recibido buena recepción en taquilla). Suerte que luego el reparto de abuelos arregla el percal y Banderas, porque les das a esos mastuerzos la voz cantante del film y la hunden en la mierda mas inmunda.\r 3-Los Efectos Especiales son UNA PUTA MIERDA, se puede pasar que tenga PG-13, que una parte del reparto sean puro relleno, es hasta soportable.... pero me parece de vergüenza que los efectos especiales sean una verdadera PORQUERÍA, No solamente ha involucionado en el estilo, sino que encima involuciona visualmente.\r 4-La dirección cae en manos de un patán juntaplanos sin personalidad que esta a las ordenes de lo que le dice Stallone, donde se la machaca con peliculas de la calidad de El Marine o cualquier peli random de Stone Cold Austin. Y que encima va a encargarse del remake americano de The Raid.\r Lo  poco potable, al menos entretiene, ves a gente jugando una partida de Airsoft y ves lo mismo y El Personaje de Antonio Banderas, que me parece el mas divertido del film (Siempre me ha caído bien ese señor).\r En Conclusión, ya empiezo a entender de donde han venido las criticas negativas y me parecen muy lógicas, Una involución de la saga, malos FX, y un PG-13 ridículo. No merece la pena pena pagar por un direct to dvd de tercera regional, cosa que es este film."
    },
    {
      "rating": "3",
      "text": "When there isn't any action happening, which there is a HUGE chunk of the film where there isn't any action, brace yourself, because it's a long sit."
    },
    {
      "rating": "3",
      "text": "This is the most disapointing movie of the year. I like the first 2 films becuase it showed a bunch of old action heroes doing stuff they really shouldnt because of how old they are. This one completely forgets that and says \"let's add some fresh faces to atract young girls.\" Are you people high? Dull action, script, characters. I really can't find anything I liked. 3/10 - Terrible."
    },
    {
      "rating": "4",
      "text": "The only way to up the stakes is to toss in a few more names, so Mel Gibson, Harrison Ford and Kelsey Grammer join some of the stalwarts. After leader Sylvester Stallone fires his old gang, he recruits a bland new group of younger talent (and Antonio Banderas for laffs). The gun-heavy action scenes are a confusing blur with odds that are even more absurd. Some of the one-liners manage a chuckle, but the \"serious\" moments drag down the pace. This is pretty much an action in-joke with nobody trying very hard."
    },
    {
      "rating": "10",
      "text": "The Expendables 1 was awesome.\rThe Expendables 2 was weird.\rThe Expendables 3 sucks too much.\r Luckly they won't make another one because they will lose money."
    },
    {
      "rating": "5",
      "text": "Horrible story, boring conversations and of course the same dull action sequences. That’s what defines this third installment of The Expendables.\r Just as the previous movie, it suffers with to much focus on the characters and to little on the story, which makes it so boring. Yes the actors are incredible, but if you focus to much on them and you forget the story, what’s the point then?! There are also to much talking that just made me roll my eyes of tediousness, and the CGI is a bit vague at some places. The only positive aspects with this movie is that the opening scene is great, and there are some funny scenes that I truly enjoy. But it’s not one of the movies of 2014 that I would recommend anyone to watch.\r A bit better than the first film, but worse than the second.\r The Expendebles 3 get a 5.7/10"
    },
    {
      "rating": "0",
      "text": "I can stomach an action film but this one was absolute garbage and I agree with other reviews in saying that it may have well killed this once promising franchise. Terrible acting, Far too many cast members (probably would have had better dialogue with thinner numbers), and a god awful plot that was painfully predictable."
    },
    {
      "rating": "6",
      "text": "¿Las causas de que Los Mercenarios 3 sea peor que las dos anteriores?\r1. PG-13: le resta mucha gracia a la película, eliminando así la sangre y el gore de las escenas de acción. Demasiado \"light\".\r2. Los buenos actores. Los clásicos. Salen muy poco. Demasiado poco... El nuevo reparto es muy mediocre y, maldita sea, ¿quien quiere verlos?\r3. Dura 2 horas (unos 20 minutos mas que las anteriores) y le sobra casi 1 hora de metraje. Mucho diálogo que no lleva a ninguna parte y escenas un poco aburridas.\r4. Mel Gibson hace un papel muy pobre. Podrías perderte su pelea final solo con pestañear.\r Lo mejor de la peli es Antonio Banderas. Es el único personaje divertido de toda la película. Las escenas de acción han perdido mucho sin la sangre, aunque parezca una tontería.\rSi hacen Los Mercenarios 4 y va a ser igual que esta, mejor que lo dejen aquí..."
    },
    {
      "rating": "1",
      "text": "So really quick, did you catch this in theaters or did you watch it online?\r Stallone and crew (sort of) are back for Expendables 3 and the movie sucks horribly. It's a horrible action movie, it's a horrible Stallone movie, it's a horrible Expendables movie. Ask yourself, \"Why do you like the Expendables?\" Your answer should because it's a movie that brings together the action stars of the 80s and 90s in a explosive, action-fest we've been dreaming about. This movie throws that premise out the window quick and gives you modern action crap that's as dull and boring as modern dramas. We came to see our action favorites battle it out on screen with the bad guys, not a bunch of new nobodies no one cares about. Seriously, they toss out Stallone's team for most of the movie for the sake of introducing a load of new people you won't care about. We even get a VERY dull montage of Stallone picking up the new recruits with Kelsey Grammer's character and this is where the film dies for about 30 minutes. It was so long and boring I had trouble staying awake. We get  2 dull White guys, a girl who looks like a guy and a INCREDIBLY ANNOYING Antonio Banderas to round out the new additions. Really though, why did they make Banderas so F-ing irritating? Speaking of new additions Wesley Snipes, Mel Gibson and Harrison \"I shot first!\" Ford make their Expendables debut. While seeing these guys on screen for this was kinda cool they really didn't do anything, especially Ford who came off as tired and looking bored. I never expected this movie to have Oscar quality acting, but at least give a damn. The action scenes were flashy, although not interesting, seriously how come we went from the gore and guts of Expendables 1 to the no blood and knives in the back crap of Expendables 3. These movies are supposed to be love letters to the action packed movies of a begone era right? So how come they can't get the level of over the top violence right? As far as action movies go this one was bad, real bad. It's a bad action flick and it's a slap in the face to Expendables fans who like/loved the first 2 movies. If this movie were to play on TNT on a Saturday afternoon they wouldn't have to worry about editing anything out. It's that tame. Do yourself a favor and skip this one and hope the 4th one is better."
    },
    {
      "rating": "0",
      "text": "The movie is wrong. The concept is great though - starring all the action movie celebrities. Remember Cowboy and Aliens with Harrison Ford and Daniel Craig? Same happened here. Explosions, shooting, fake drama isn't just wrong - it's annoying! I felt like this movie forced me to become stupid so that I can enjoy it. And I would enjoy it, had they wrote a better story. Awful"
    },
    {
      "rating": "1",
      "text": "I thought this movie was a complete waste of time. It was nowhere near as entertaining as the first two Expendables that I really enjoyed. The plot was extremely weak, chock full of cliches and was completely predictable. I know that's kind of the point with these films, but this one doesn't pull it off well. You always know whats coming next with this film, it doesn't have any surprises or interesting scenes. The actors are far too good for the plot.\r It was also a bad idea reducing the rating to PG-13, I had a bunch of inconsiderate kids in front of me that couldn't stop texting every 5 minutes. In trying to expand the market for this film the producers have just made it suck more. I doubt I'll be watching 4, if it ever gets made."
    },
    {
      "rating": "6",
      "text": "On what should have been a routine mission the Expendables crew runs into one of their ex-members that, rather than being dead as they all thought, is actually a wanted and dangerous war criminal. That's basically all there is in terms of plot, despite some dull musings on the frivolity that make little sense in a movie where the body count must come close to the one thousand mark.\r If you've seen either of the first two Expendables movies you'll know exactly what to expect here, namely a bunch of 80's and 90's action stars spouting cheesy one-liners and over the top action sequences. The dialogue is still mostly awful and few of the 'stars' can actually act but when things kick in to gear, such as during the opening train heist or explosive final act, it is undeniably entertaining. In the end it’s not quite as good as the second movie but certainly better than the first and, if you know what you’re getting into, makes for a fairly enjoyable couple of hours."
    },
    {
      "rating": "6",
      "text": "Well The Expendables 3 is an ok action movie, the characters played their parts well, amazing action scenes, and by the way fantastic homour from Antonio bandereas I loved his character he made the film more lighter and fun. But I feel the Expendables didn't develop it's characters well we see snipes half of the movie with no development of his caracter which was disappointing as he stared out strong, as well as jet li who hardly features at All in the movie.\rThe movie has ambition but really lacks that drive to keep viewers focused on the theme and storyline which is covered up by some old school action, which we all remember from the likes of silvester, spines and dolph.\rBut overally it's a movie worth watching just forget about the storyline it's funny, action packed and absolutely FANTASTIC."
    },
    {
      "rating": "2",
      "text": "It's like someone put all my favorite actors into a blender with all the wrong ingredients.\r The story was just pathetic and reminded me of those foreign B-grade knock-offs of action movies. The scripts were just horrible, the dialogues were awkward and felt forced. Jet li in particular didn't appear to put any effort into his part, not that I could blame him.\r There was no chemistry going on at all and the relentless cheese-ball anecdotes made me cringe in embarrassment. Time to fold up that directors chair Sly."
    },
    {
      "rating": "5",
      "text": "I was unsure when I went to see this third entry in the Expendables series and it was very disappointing.\rThe first two movies are great reunions of your favourite action stars from the 80's and 90's and were great for the set pieces done for real with no special effects for pretty much the entire with one or two exceptions.\rAnd Jason Statham throwing knives at peoples necks is really cool. But that was when it was 15a and 16's.\rNow they decided to make it 12a so that stupid kids can go see another toned sequel to more violent movies. Same thing happened to Die Hard 4 and it's because the studio wanted to make more money.\rThen they decided to bring in the most irritating people to be the next generation of Expendables which completely **** up the whole point of the franchise in the first place. Lutz, Rousey, Powell and Ortiz are all there just to draw in the younger audience but I doubt any kids want to see these idiots, they can't act for **** and there jokes made me want to vomit it was just so painful to listen to them and I wish they could have been killed off but no luck there, the actual Expendables are gone for alot of the movie and we are left with just Stallone for about 45 minutes with the new ones. This really dragged the movie down alot, When the actual ones came back then the film picks up a bit but the final 20 or so minutes are set in a pretty generic abandoned town with tall tower blocks and some tanks, which went on for a while and bored the hell out of me. Another problem for me is that Terry Crews is only in the movie for 5 mins in total which really annoyed me as he was so funny and entertaining the first two and Jet Li just decides to show up right before final fight which was pretty stupid as well with Schwarzenegger who isn't as entertaining as he was in the second movie. The biggest mistake of the movie isnt even the annoying\ryoung actors but the lack of practical effects which were very present in the first two and replaced with digital and cgi explosions which really takes away from the overall effect of the film.\r In short, just kill the series before you can screw it up anymore Stallone but if you must make a fourth movie, just get rid of the annoying kids and go back to practical effects.\rOne last thing Mel Gibson is a terrible villian but Antonio Banderas is THE funniest part of the film."
    },
    {
      "rating": "5",
      "text": "Lets just say that this is the third movie in the series and should be the last... Its not complete garbage as it has a good soundtrack with TONS of action actors. The reason this should be the last is because it ends the plot for the Expendables, which you should suspect it to. Stallone gives some good acting here and there and there are indeed some stunts, I would give this review higher because I personally am a fanboy of Stallone, Statham and others, but it wouldnt be an honest fair/ unbiased review. So therefore, 5/10"
    },
    {
      "rating": "2",
      "text": "The end of the movie was the sigh of relief. My eyes needed to take a break probably every minute. Hilarious much? Nope. Corny as hell. Wouldn't even re-watch this piece of junk if they paid me a billion dollars."
    },
    {
      "rating": "5",
      "text": "Worst out of the 3 which is why i gave it a low score, it delivered action and star power, but it fell short in story which is the most important part. The potential was great, but the underdevelopment of the bad guy Conrad  Stonebanks (Mel Gibson), to make time for recruiting nobodies was a big failing. Mel is capable of being  a stronger character than the script allowed.\rI enjoyed Kelsey Grammer's character, was funny and saved a part of the movie from being extremely boring. Antonio Banderas's character annoyed me as much as the characters in the move, stupidly funny but more annoying.\r The main reason this wasn't great was because i simply didn't care what happpens to the characters, they seem invincible, there was no emotional connection to the movie.\r Its worth seeing because of the great actors and action sequences, despite the poor story and character development. They could do better than this, they must be running out of ideas, and just throwing more past prime actors at it."
    },
    {
      "rating": "8",
      "text": "Expendables 3 actually is surprisingly entertaining.  This is a straight up action movie, so you are not going to get a great story.  But what is there actually works.  I found while the younger actors were terrible to watch, the additions of Mel Gibson, Antonio Banderas Wesley Snipes, and Kelsey Grammer brought some weight and humor to the movie.  Stallone actually wasnt terrible in the movie too.\r The action scenes were great, the end climax action was suberb.  The only gripe is that the end fisticuffs between Stallone and Gibson were done too quickly.  I miss the days of longer fights between the main hero and villan.\r I found myself entertained and felt this was the best Expendables movie yet.  Too bad it hasnt done well in the box office.  But if you havent seen it, go check it out.  Its a good time if you like action movies."
    },
    {
      "rating": "6",
      "text": "If you are at all inclined to see an action movie like this, with an ensemble cast, you MUST see it opening weekend.  My audience was whooping it up every time a new long-time star hit the screen, which couldn't help but making everyone smile.  The entire movie is tongue-in-cheek, and if you don't take it that way, you don't get it.  Arnie trots out, \"Let's Go to the Choppa!\", which gets a roar.  Rhonda Rousey is not terrible in her first major acting gig - though not nearly as good as Gina Carano.  The worst thing you can do is see this on DVD - or by yourself."
    },
    {
      "rating": "1",
      "text": "I saw this movie, instead of Guardians Of The Galaxy... now, I'm regretting this. This movie was pretty and it killed this franchise.  Just... just watch Guardians Of The Galaxy instead."
    },
    {
      "rating": "5",
      "text": "While not the worst movie ever, it completely lost it's identity when Stallone went off and hired those new guys. I didn't recognize any of them except the female MMA fighter so I didn't really care much for any of them. The action (mainly the gunfights - hand to hand was enjoyable) was laughable. It's like the enemies are shooting with blindfolds on while the heroes have aimbots. Seriously, one of the fires backwards, not even looking and kills 5 baddies. I would still watch the Expendables 4, but only if they stop with the campy-ness of the movie and bring it back to Expendables 1 action. And focus on the core group, they are the people we actually like (kind of)."
    },
    {
      "rating": "6",
      "text": "The movie is almost non-stop action, with an ensemble cast that spans the genre. If you are looking for a fast paced adventure film with more EXPLOSIONS than a Michael Bay film, this will fill your needs handily.\rLaughed out loud at Snipes quips, new cast members were likable, and while the story was not quite as good as the first movie it was leaps & bounds better than the second film.\rMel Gibson is easily THE reason to watch this third installment."
    },
    {
      "rating": "9",
      "text": "If you want non-stop action this is your movie.  Very entertaining and always great seeing the great action  heroes from the last few years!  The best group of action heroes ever!"
    },
    {
      "rating": "0",
      "text": "Hands down worst movie of 2014! And it's only August!\r there cant possibly be a worst movie than this with all the cheesy **** dialogue. Plot was hilariously bad. So\rmany actors that were pathetic and just pointless. And **** all you idiots that pay money for dumb **** like this, don't EVER mention this piece of **** again. ****ing embarrassing"
    },
    {
      "rating": "1",
      "text": "This movie is an absolute piece of crap! It is worst than the first and second movies put together. Never in my life have a seen such a overblown and pointless movie. The only character to watch is Mel Gibson as he makes a pretty good bad guy but everyone else is lazy and uninteresting. Please do not send your money watching this movie.....u have been warned."
    },
    {
      "rating": "7",
      "text": "If you were expecting academy award performances mixed with a compelling storyline, clearly you were mistaken.  This film offers just what one would expect from a sequel to the first two Expendables, a stellar cast of former action stars, big guns, big explosions, and garbled lines.  It is a fun popcorn movie and should not be rated on the basis of artistic merit.  That's why I gave it a 7"
    },
    {
      "rating": "5",
      "text": "The Expendables are back again! With the long A listers acting and boom blam action, what is there not to love? Well, The Expendables 3 is the worst in the series. The film starts out with The Expendables- Sylvester Stallone, Jason Statham, Dolph Lundgren, Kellan Lutz (a new entry) and Yin Yang (Jet Li). They are trying to rescue Wesley Snipes for some reason, I think its because he was a part of The Expendables. The opening scene is fun, it's has great action. And thats what this movie is good about! Action, explosions and Stallone with his deep voice. The characters were great in the previous films, but this movie kind of shows them as grumpy people who just want to kill. Yeah, it could have been improved. Director Patrick Hughes never finds the plot of the film, you are left wondering what happened to that guy or where is that guy gone to. The action is good, plot? Not so much. Mel Gibson, as the villain, was good. The acting is okay, Stallone and supporting are good. TE3 is full of cameos as well. Wow, A LOT of cameos. Well, I can't say it's the best film of the series. Why did I say worst? Because the previous films had charm and and cool story to look up to. This one doesn't so, yeah. Because of those reasons, it's just another mediocre action movie, unless you want to see cool action and old (famous) guys kick butt. And why is it pg-13, why?!!!!"
    },
    {
      "rating": "7",
      "text": "I really liked this movie a lot more than the second one. It's just.. Very fun. Banderas and Gibson just steal every single scene they're in. The only downsides I saw were the sometimes bad CGI effects, poor characterisation of the \"new\" Expendables and the very, very annoying PG13. Other than that - It's almost as good as the first part. Tongue-in-cheek all the way, with some hilarious lines. It was just so nice to see and hear that the entire cinema I was in had such good fun while watching this film. I can only hope for an unrated version.."
    },
    {
      "rating": "4",
      "text": "Excessively violent and completely unbelievable, The Expendables 3 injects more worn out and recycled actors into a very worn out and recycled franchise."
    },
    {
      "rating": "7",
      "text": "I haven't seen any of the expendables movies before, but this threequel shows me that the previous two are also tons of fun and I have to go back and see them."
    },
    {
      "rating": "10",
      "text": "Critics, you **** never change. Audiences around this great nation will TRULY appreciate this exciting 3rd chapter in The Expendables franchise. And a commercial will appear on television saying that The Expendables 3 is the \"#1 film in America\". So suck on that! This is an ACTION-WAR film which focuses mainly on a group of ELITE MERCENARIES, which is even a much bigger team now because there are 16 mercenaries in this team. What's not to like? The Expendables series is a perfect series. It has taken a very large cast of stars to come together in order to form an even bigger team of elite mercenaries for The Expendables 3."
    },
    {
      "rating": "8",
      "text": "Some don’t seem to like this franchise, with it formula of action over story and plot. Some don’t like the decision to make this third installment PG-13. But, rating it PG-13 lets a bigger (and paying!) audience see the film (specifically younger people). I guess one of the reasons people liked the films in the first place was because of the bloody and gory violence, with language. However, that’s not the only thing that makes this movie series interesting—it’s the chance to see a bunch of your favorite (well, if you’re older) childhood movie actors kick-ass. Maybe a “water-down” Expendables isn’t appealing to some, but for others it lets them see the movie.\r If you haven’t seen The Expendables 1 and 2, you can follow along on the story fine without them. To be blunt and honest, the first two films weren’t too well received by some critics anyway. IMO the plot and story are OK—probably a bit too simple. It’s not the best, but I don’t care about that much anyway. In a similar fashion to the Fast & Furious and Transformers series, I just come to be entertained. I leave my brain at the door, and throw logic out the window. I honestly disagree with the critics over both TMNT and TE3. Both are fun and entertaining, and that’s all I care about. I think the movie is just fun with comedy, crazy action stunts/scenes, and a big cast. It tops absurd action stunt after absurd action stunt.\r One thing I noticed was that most of the characters had weird names: Barney, Christmas, Galgo, Toll Road, Hale Caesar, John Smilee, Mars, Goran Vata, , Max Drummer, and Trench Mauser. But who cares. Most of the cast members were interesting and fun, some more than others. The Expendables 3 has too many cast members, with a bigger focus on the new blood; the younger generation of “The Expendables”. They’re not horrible, but I care more about old people kicking ass. Most of the younger actors are unfortunately too similar to over-done generic archetypes/stereotypes. We should get to know them better if we’re going to care about them (especially when they get kidnapped in the movie).\r Anyway, too large a cast. The best actors don’t have enough screentime. The plot is too simple (for a team called “The Expendables”, most of them don’t seem expendable enough to be left behind). However, tanks and explosions and guns and motorcycles and helicopters make it fun enough.\r If you liked this review, read my other ones on movies, TV shows, and videogames. I have reviewed the 2014 films Teenage Mutant Ninja Turtles, Guardians of the Galaxy, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, Blended, The Amazing Spider-Man 2, Transcendence, Jack Ryan: Shadow Recruit, Blended, The Lego Movie, and more. I also review TV shows, such as : TNT’s The Last Ship, Fox's Sleepy Hollow, ABC's Marvel's Agents of SHIELD, CW's The 100, Fox's I Wanna Marry Harry, NBC's Crisis, Fox's Gang Related, and more.\r Good bye! Sincerely, AG732."
    },
    {
      "rating": "9",
      "text": "I was a little bit worried that Stallone would run this series into the ground with this sequel, but surprisingly the large cast is well managed and everybody gets something to do.  The practical effects are refreshing and the action is well choreographed.  The plot while thin is better than the previous two films and is bolstered by Gibson's charismatic performance.  In particular, Banderas, Gibson, and Stallone get a lot of screen time and the characters are more interesting this go round as opposed to Part 2.  It was also refreshing to see Snipes again.  I do not believe the film suffers at all due to a lack of gore and the PG-13 rating makes the film more accessible to a younger audience.  The younger cast do a good job trying to keep pace with the older veterans of the series as well."
    },
    {
      "rating": "7",
      "text": "Basically what you would expect from an Expendables movie. The great cast of action stars team up once again with some new faces and it's a heck of a lot of fun. I gotta give special praise to Wesley Snipes and Kellan Lutz. Snipes character is a blast and Lutz proves he can actually act. I found Banderas to be pretty entertaining as the comic relief character, but others might find his motor-mouth character to be grating. The rest of the newcomers fail to make much of an impression.\r As far as plot goes it's very similar to the second. One of the team gets taken out and Stallone's character is out for revenge. It manages to stay entertaining thanks to Mel Gibson being awesome as the villain. However the plot isn't the appeal of this series. It's seeing the best action stars of the past and present coming together in some crazy awesome action scenes, and there the movie delivers. However it's also directly tied to the movies biggest problem. A lack of urgency.\r There's no real threat to our heroes. Much like in the first two movies you'll watch the team blow through huge amounts of goons while barely taking a scratch. The Expendables? More like the invincibles. Still it's not hard to enjoy all the explosions and gunfire, especially when they're delivered with humor and a tongue-in-cheek style like they are here.\r It's an entertaining movie. One that benefits greatly from it's plethora of great stars. It might be the weakest in the series, but it's got enough fun to entertain action movie fans. I give it a 7.5/10."
    },
    {
      "rating": "7",
      "text": "The best expendables yet! Look, don't go in there expecting a story worthy of an oscar. But the action sequences are very well done. All my favorite actors are there too! Lots of good old school action with a movie not afraid to poke fun at itself. Recommend if you're in the mood and you know what you're getting into."
    },
    {
      "rating": "7",
      "text": "This movie is a good movie the action is great the story is.....well there's barely any story the acting is alright i have seen better love mel gibson in this movie he stole the show!"
    },
    {
      "rating": "8",
      "text": "Have seen the previous films and thought this one had plenty of action in it to make it worthwhile watching. If you like action this is one to watch. Have to admit my heroes do look old these days but they act well still. I am one for action and don't worry too much about much more as long as the story line is ok, this was. The only thing I had to moan about was the cinema seats."
    },
    {
      "rating": "10",
      "text": "You never look at a movie review on metacritic. No point. The critics are **** who don't appreciate the great 80's style movies, like this one. The plot is good, maybe needed a little work, the acting is fantastic, and the choreographed action blows your mind. Unfortunately, it WAS an 18 (a lot of blood, violence, gore) but it had to be cut down to a 12A. Of course, the version with the violence would have been better.\r People who say there is 'dull action sequences'. Watch the film first, please, instead of being a pet dog to the critics. Anyway, here is the point. The Expendables 1. Ok. The Expendables 2. Brilliant. The Expendables 3. Fantastic. The films seem to get better and better as they go on.\r Now stop wasting your time looking at crooked and brain-dead reviews, watch the damn film!\r Arnold Schwarzenegger: Let's GET TO THE CHAPPA!.\r 10/10. **** the critics."
    },
    {
      "rating": "8",
      "text": "With this amount of huge action stars in the figure you can only expect one thing, action. There is no need for strong monologues or anything like that. This movie is as good as a shoot em up as it gets. All the one liners are still in tact. There is a reasonable amount of comedy in the mix. Antonio Banderas was hilarious which I didn't expect in this one. I'm hoping Stallone gears up for the 4th because I'm in!"
    },
    {
      "rating": "10",
      "text": "The most fun ive had at the movies all summer! Tons of great action and actors.Sly and Mel Gibson are on top of their game.Lots of funny lines and great additions to the team! A Must See!"
    },
    {
      "rating": "7",
      "text": "Sometimes in life you don't always need a decent plot, a narrative or even a believable scenario and this is a prime example of it.\r What the movie provides is pure unadulterated adrenaline fueled entertainment so none of that other stuff matters, if your looking for nostalgic memories with a huge cast of unforgettable people and stuff getting blown up this movie is defiantly for you."
    },
    {
      "rating": "0",
      "text": "this movie sucked and isnt worth watching I have seen it and the others if both my hands had nothing but thumbs id give it 10 thumbs down.....I will not recommend none of my friends or family to watch nor spend a single dime watching it.....Expendable movie no doubt i would burn it if it was given to me."
    },
    {
      "rating": "8",
      "text": "Assisti a versão estendida. Não sei como é a outra versão, de cinema. Minha avaliação é baseada na versão estendida. Mais um filme da franquia \"Expendables\" do mestre Stallone. A ideia de reviver todo o espírito dos filmes de ação dos anos 80/90 é incrível. Quem diria que viríamos Stallone lada a lado com Schwarzenegger?? Enfim, os pontos negativos desse terceiro filme são: A história, que é muito fraca. E a classificação PG13, que visivelmente fez muito mal ao filme! Entretanto o filme é divertido, as adições dos \"atores\" novos passa despercebido em meio aos clássicos atores antigos que todo mundo ama. O destaque fica realmente para excelente interpretação de Antonio Banderas, o insano Wesley Snipes e o incrível vilão interpretado pelo Mel Gibson!!! O filme não é nenhum espetáculo, sendo o mais fraco da franquia. Mas de qualquer forma, é legal, divertido, e vale a pena ser visto, sem grandes expectativas. A sequência final de ação e também o fato de poder ver novamente todo o pessoal reunido, e agora com Jet Li de volta e atores que não vimos em cena há algum tempo, como Antonio Banderas, Wesley Snipes, Mel Gibson e o grande Harrison Ford, fazem a experiencia valer a pena!! Que venha o \"The Expendables 4\", quem sabe com o GRANDE Clint Eastwood e com o Steven Seagal!!! Sera épico!!"
    },
    {
      "rating": "10",
      "text": ".........................................................................................................................................Incredible................"
    },
    {
      "rating": "7",
      "text": "Best one yet. With noticeably higher production values, better action and 5 of the biggest action stars in motion picture history mixing it up. Sly, Arnie, Mel, Ford and The Stath. Great to see Snipes, Banderas, and other big name cameos"
    },
    {
      "rating": "6",
      "text": "After disbanding his old crew and recruiting a younger team, Stallone finds himself in trouble going up against old adversary Mel Gibson. The third in the series is way better than the second instalment, having regained its sense of humour, and the addition of more big name stars ups the fun factor, but it still feels like a missed opportunity. Antonio Banderas however deserves a spin off of his own!"
    },
    {
      "rating": "5",
      "text": "I felt that the Expendables 3 should've stick back to its R-rated form filled with all but blood, gore, more violence and some cheesey 80's one-liners. But this year, I kinda lost touch with the 3rd movie. The first 2 was beyond awesome showcasing 80's and 90's action gems into nothing more than a testosterone Rambo meets Road House-style nostalgic reminisce of kick-ass guns blazing action. The 3rd, however, is kinda dumb and not in a good way. For starters, the new cast is weak (except \"Rowdy\" Ronda Rousey, the first female UFC women's champion, she did a great job in her first acting role) because I don't know why who told it would be a great idea to add an action nobody Kellan Lutz (from the crappy Legend of Hercules), an MMA legend (Victor Ortiz), the actor from \"The Goonies,\" and an unknown actor (Glen Powell) to be in the list of weared-down action heroes. The action scenes were almost as good as usual, but they toned down the violence and the blood that was supposed to be covered were dreadful. The script is lackluster at best, character conversations feels like Love Connection, there's no Jet Li on it, and But the biggest problem is that they make an excuse to make this an unnecessary PG-13 rating to aim less on mature audiences an drew at kids and parents as well. Adding insult to injury, it was the piracy to blame for this one-note joke of a sometimes almost good sequel. Maybe the studio just thought about this to happen once it was released three weeks before the movie even have to wait to buy it on DVD once the movie's run in the theater is over. And that's leading to the supposed downfall of The Expendables. I know they're making a 4th film soon, but can they just end the series right about now? I'm not saying the movie is terrible and all, but my only concern is Arnie and Sly's action movie status. I think it's about time they should hang it up and retire because there's not much left for the fans what they want in a action movie."
    }
  ],
  "recommendations": [
    "the_expendables",
    "the_expendables_2",
    "xxx_return_of_xander_cage",
    "the_marine",
    "bullet_to_the_head",
    "mission_impossible_iii",
    "bloodshot",
    "the_transporter_refueled",
    "mechanic_resurrection",
    "transporter_3",
    "6_underground",
    "the_a_team",
    "angel_has_fallen",
    "salt",
    "hercules",
    "lockout",
    "furious_7",
    "transporter_2",
    "venom_let_there_be_carnage",
    "brick_mansions",
    "teenage_mutant_ninja_turtles",
    "the_losers",
    "skyscraper",
    "red_notice",
    "sabotage"
  ]
}