{
  "id": 1759,
  "title": "The Card Counter",
  "starring": [
    "Oscar Isaac",
    "Tiffany Haddish"
  ],
  "runtime": 111,
  "genre": [
    "Crime",
    "Thriller",
    "Drama"
  ],
  "description": "William Tell just wants to play cards. His spartan existence on the casino trail is shattered when he is approached by Cirk, a vulnerable and angry young man seeking help to execute his plan for revenge on a military colonel. Tell sees a chance at redemption through his relationship with Cirk. But keeping Cirk on the straight-and-narrow proves impossible, dragging Tell back into the darkness of his past.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/y5DNLVg0gPiGSkuK4yFc4fjQ42Q.jpg",
  "categories": {
    "plot": 6.457142857142857,
    "acting": 6.371428571428571,
    "ending": 5.714285714285714,
    "soundtrack": 5.0,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Writer/Director Paul Schrader was raised by parents who were strict Calvinists (a form of Protestant Christianity that heavily emphasizes the belief that people are predestined to a life of sin because of their universally corrupt natures).  His upbringing heavily influenced Schrader’s screenwriting, which gravitates toward themes like sin and salvation.  After bursting onto the scene as the screenwriter for Scorsese’s “Taxi Driver” (1976) and following up by writing 1980’s “Raging Bull,” Schrader got behind the camera and began to explore the dark side of human nature in earnest.  His previous film “First Reformed” (2017) is the character study of a minister grappling with internal personal despair as well as an existential angst brought on by the climate crisis.In “The Card Counter,” Schrader again takes a deep dive into the concepts of revenge, redemption and self-loathing.  William Tell (based on the fable? a reference to a tic/mannerism that causes a poker player’s undoing?) is a professional gambler tortured by his role as an interrogator at Abu Ghraib.  He tries to keep other humans and his own past at arm’s length by traveling to mid-sized cities to participate in lower-level poker tournaments.  Playing cards is the mechanism for keeping himself at bay.  Keeping his expectations low is his defense mechanism against hope.  An award-worthy Oscar Isaac (see what I did there?) is simply spectacular in the role. Along the way, Tell meets La Linda (Tiffany Haddish, playing it straight) who offers him financial backing and, perhaps, more.  He befriends Cirt (Tye Sheridan), the bitter son of a fellow interrogator at Abu Ghraib who eventually committed suicide.  Tell decides to change his modest career plans to redeem Cirt from his destructive focus on revenge.Along the way, Schrader uses this story line to speculate about some very big questions:  Is interaction with other people truly worthwhile and rewarding?  Is the American adventurism of the early 2000s, represented by Abu Ghraib, an indication of a nation rotting from the inside?  Is the main constraint on humans the self-limiting choices they make, made worse by their lack of imagination?Because this is a Schrader film, there are a few predictable elements.  As in “Taxi Driver” and “First Reformed,” the protagonist/anti-hero is a diarist, using his writing to describe an internal agony that he cannot vocalize to another human being.  This weightiness is offset, occasionally, by some absurdist comic relief.  In several scenes, a Ukrainian poker player, decked out in red, white and blue for no apparent reason, is serenaded by loyal fans who chant “U.S.A., U.S.A.” whenever he wins a key hand.It’s hard to evaluate whether to recommend this film for regular moviegoers.  Critics, steeped in the work of Robert Bresson, transcendentalist filmmaking and French New Wave cinema will adore it.  For us regular folks, the film’s unflinching examination of its characters, particularly Tell, offer their own rewards.  But be forewarned, this film requires moviegoers to fill in some narrative blanks and interpret their own meanings at key points.  (That’s a kind way of saying that I left the theater saying, “What the hell was that about?”)"
    },
    {
      "rating": "8",
      "text": "After the first 75 minutes, I thought that The Card Counter was an intriguing but messy film. Then the third act arrived, and my mind was changed completely. The twists and surprises were extremely impactful and will leave me pondering the film for weeks to come. I also think that Oscar Isaac gave a terrific performance as William Tell, who may just be the most interesting character put to screen this year. The cinematography in this film is also fantastic. My only critiques would be the lifeless performance of Tye Sheridan as well as some unclear character motivations."
    },
    {
      "rating": "5",
      "text": "The Card Counter is essentially another First Reformed, but without any of the qualities that made the latter brilliant. Isaac is good, but the plot is so contrived that his performance feels wasted. I’m not buying Haddish as the love interest either. They don’t have nearly enough chemistry, and her playfulness comes across as jarring next to Isaac, who is doing his best brooding Joaquin Phoenix impression.Willem Dafoe, who could’ve brought some much needed color to the film, appears on screen for barely five minutes of the excruciatingly paced runtime. By the way, this movie is an absolute SLOG.I appreciate the symbolism, the social commentary, and all that jazz, but it’s just not interesting to watch. It’s almost like Isaac exists within a different film, while everything else around him struggles to keep up. When it does pick up, there’s a handful of striking scenes and then it just ends. While there’s some shock value in the final stretch, it doesn’t make up for the snail’s pace of the first hour.I can’t imagine anyone “enjoying” The Card Counter unless you like your movies immensely allegorical and boring."
    },
    {
      "rating": "5",
      "text": "Paul Schrader is known for writing intimate character studies about people on the periphery haunted by their past. This time, a glum and intense Oscar Isaac plays the low-key, low-stakes gambler who goes from playing 21 to poker tournaments with the help of a handler (Tiffany Haddish playing it straight but holding on to some of her personality). He also teams up with a troubled young man (Tye Sheridan continuing his impressive career). One key aspect of Shrader is his use of voiceover to relay crucial info. It gives an intimate feel but also imparts a feeling of introspective narcissism. This film glimpses into the world of casino professionals, while establishing some relationships and glimpses of his haunted history. It's interesting, introspective, but a bit pretentious if you view it from the wrong angle and ultimately, lacking much emotional power.[usr =3.0]"
    },
    {
      "rating": "5",
      "text": "Solid, traditional movie-making. Acting was good, pace was slow/deliberate. But the scene set ups at times felt forced or exposed: back and forth Medium Close Ups during conversations, felt like the lines weren't in conversation but each shot during the actor's MCU or CU. At times it felt like a student \"continuity\" edit assignment. The ending was not satisfying. There were some questionable \"real world\" issues (like, how long does it take to drive from Panama City FLA to Virginia?). And there's a difference between a military prison for crimes committed in military and a state or federal prison for criminal offenses."
    },
    {
      "rating": "5",
      "text": "thought the Card Counter was excruciatingly patient and slow paced, making it a drag to sit through. It’s an uninteresting story populated by undeveloped and flat characters. Though it picks up some steam as it goes along, I never quite found myself invested."
    },
    {
      "rating": "0",
      "text": "Dull, boring and so full of holes one could drive a Mac truck through the.  The entire movie is ostensibly about character development without a single indication of motivation.   With incredible star powerbehind the film, no one recognized that this was a movie in search of a script.  Save your money."
    },
    {
      "rating": "0",
      "text": "Utter garbage! Do Not Waste Your Time. It's a travesty that reviewers went ape shipt over this crud..."
    },
    {
      "rating": "4",
      "text": "Oscar Isaac plays a former Army interrogator who is playing with the idea of getting revenge on a cruel man from his past. Isaac is great as always. I can't say the same for Tiffany haddish. She doesn't quite, but almost ruins every scene she's in. When it comes to Comedy, she's the best. But when it comes to drama, she's too twitchy and doesn't seem to know which way to play a scene. This movie is so low-key that it barely has a heartbeat. What we want to see is a story arc where a man who has come to terms with his bad deeds, slowly convinces himself to do justice to a bad man. But most of the movie concerns itself with his quiet life as a card counter. And his relationship with the young man who is pushing him to violence. It's not bad. But you lose interest about halfway through."
    },
    {
      "rating": "4",
      "text": "While I enjoyed Isaacs performance and the cool, disconnected portrayal of a gambler who has seen some **** this ultimately went nowhere. Reminded me of Rounders, but without the tight plot. Sheridan is just there and Haddish, per usual, is terrible. I really don't see why she is in anything, let alone everything these days. She's not attractive, she can't act, and she sounds like she smokes a carton of Camel non-filters every day. She's also bowlegged so when she tries to make a sexy entrance, all I can think of is Red Foxx. Nothing more pathetic than a woman who is not sexy acting like she is. Her and Isaac have zero chemistry. Dafoe is criminally underutilized. I didn't care for First Reformed either. In fact, Taxi Driver was the only thing of Schrader's I've liked."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "1",
      "text": "This is beyond frustrating, as a poker player the movie is flawed (no flop on a major tournament hand ?) , as a human being the movie is flawed. Maybe i'm not deep enough for this artsy stuff but i think your supposed to care about the characters, and i couldn't understand why i didn't.. Oh that's right the whole premise of the movie is to see a dark sub-culture of the poker world, with mr empty suit jacket himself as your tour guide. Sorry big fan of Paul and Martin's work, but why is Tiffany H in this movie, i've had bowel movement's with more chemistry than the dynamic between  her and Oscar. Sorry if i come off as overly, but come on... I'm very disappointed"
    },
    {
      "rating": "2",
      "text": "I honestly have no idea why this film has such high Audience scores. I couldn't even sit through the entire thing."
    },
    {
      "rating": "7",
      "text": "In 'The Card Counter,' Oscar Isaac plays a troubled man who hides his sins and his trauma on the winning cards he constantly lays on the table. As William Tell, Isaac gives a haunting performance with so many layers. By being impenetrable, his character becomes mysterious and incredibly lonely, just like your regular Paul Schrader protagonist. I found it not as good as 'First Reformed,' and Tiffany Hadish is kind of distracting with her performance; nevertheless, there's a deep discourse here about USA's decadence that is worth checking out."
    },
    {
      "rating": "5",
      "text": "The Card Counter tries so hard to capture the magic that made First Reformed so good without trying to be its own unique experience. Isaac does a great job as the lead and is the only reason to really give this movie a shot. I feel like the movie explores too little, features some rather uninteresting characters, and ends up in a pattern of predictability that makes fall flat at times. I expected better."
    },
    {
      "rating": "6",
      "text": "Great performance by Oscar Isaac in a flawed film.  Its just terribly slow, and therefore not very entertaining.  It is dark, and mysterious, and does make you want to keep watching, to some degree, but it took me a 2nd viewing to finish it...waiting, hoping...expecting...some kind of payoff at the end.  It has an ending.  But I wouldn't say it was worth the run time to get there.The biggest issues are the slow pace, and the wierd dialogue and character choices. The film and premise had much potential but what you end up with is a great peformance, an interesting premise, but an under-whelming film.  Only watch if you have the patience to see a slow  brooding mystery.  Isaac's performance is worth seeing for those with the patience, but the film should have been far better."
    },
    {
      "rating": "7",
      "text": "The latest from writer/director Paul Schrader (of course best known for penning the screenplays for 'Taxi Driver' and 'Raging Bull), sees Oscar Isaac as a man drifting from casino to casino playing his hand and counting cards as a means of escape from his troubled past that he can't quite seem to let go of. While this isn't the high stakes gambling thriller that you might expect, what we get instead is a slow burn yet rather fascinating character study from Isaac who gives an always reliably great performance here, along with great support from fellow actors Tiffany Haddish, Tye Sheridan, and Willem Dafoe. The writing and conversations are sharp and crisp, which is what really kept me invested throughout more than anything. And while the story may feel a little abstract at times, the performances and writing are what really make this one worth the watch. Overall, it's not quite as harrowing or thought-provoking as Schrader's previous film 'First Reformed', but it still further solidifies him as one of the most thoughtful and insightful screenwriters in the business"
    },
    {
      "rating": "6",
      "text": "There's no mistaking a film made by writer-director Paul Schrader. The signature look, feel, mood and subject matter of his pictures are easy to spot, readily characterizing the singular style of this veteran filmmaker. The problem with that, however, is that, over time, his movies have increasingly begun to run together -- easily distinguishable collectively but less so individually, especially as the filmmaker's output has aggregated over several decades, And that's the primary issue with this offering, one whose ambiance, themes and troubled protagonist have all been seen before in many of his previous works, despite a change of venue from prior works. As a storyteller who generally delves into the darker side of life. Schrader does so here again with this tale of a former special forces intelligence officer who is prosecuted and imprisoned for war crimes during intensely inhumane interrogations. During his 8-year incarceration, with plenty of time on his hands, he learns how to become an expert gambler/card counter, a skill that he parlays into a lucrative lifestyle upon his release. But the enigmatic loner is haunted by his past, particularly when he meets the son of a deceased colleague bent on getting revenge against a superior whom he believes was responsible for his father's death, a plan the high-stakes card shark tries to discourage. What's odd here, though, is the narrative's pervasive ambiguity, which initially keeps viewers engaged but tends to grow tiresome as the story progresses and resolution remains elusive. This tendency clearly shows that there's a big difference between cultivating suspense and remaining perpetually and inexplicably cryptic, particularly when its comes to discerning the characters' (and even the picture's) motivations. Except for occasional voiceover hints that are dangled before viewers, the intents driving the protagonist remain largely obscured with a definitive lack of satisfactory resolution. That's unfortunate given the fine lead performance of Oscar Isaac, as well as the film's superb stylish cinematography (unexpected for subject matter that wouldn't seem likely to lend itself to such treatment) and unusual location settings. The production works reasonably well as a character study, but, as a thriller/revenge tale, \"The Card Counter\" comes up decidedly short. Perhaps that's due to the director having over-mined the material he draws from as a screenwriter and filmmaker. Or perhaps it's a case of not being able to adequately define and express what he wants to say. In either case, however, this is one bet worth hedging given the underwhelming hand that the director is trying to play."
    },
    {
      "rating": "4",
      "text": "In my view it was a pretty boring movie - while yes the idea behind the plot was not bad, the movie feels so stretched out and boring - so many parts of it just characters walking for many seconds or doing something not that important. Also some of the poker doesn't feel like realistic plus it is not really even about gambling that much (I get that they put it like analogy, but anyway)"
    },
    {
      "rating": "7",
      "text": "To judge this film in the first instance as a simple poker film, is basically to degrade it.However, this is an element that Paul Schrader in my opinion cannot balance with the other and much deeper storyline that is part of it.Putting the cards on the table, The Card Counter is a film that has enough elements to easily stand out, but it's also a film that never seeks to risk anything. Even with the darker tone it gets as it progresses.Basically we're seeing two very different stories at the same time, that never manage to combine themselves properly.The two involve the character played by Oscar Issac but they're so different that there are constant drops in terms of tonality and atmosphere.His character is a lonely man that lives driving from one casino to another, being basically invisible earning a living.He earns little while risking little.So far, everything is generic, even the necessary explanation of how he does what he does, because obviously we need the character to let us know his intelligence and to explain to us, because apparently we cannot intuit that he's counting cards.Until then, that's the life his character leads in his present.But what about his past and the glaring evidence that he suffers from emotional and psychological trauma? That's the other plot that the film introduces.It turns out that he's a former military who participated in the torture of prisoners at Abu Ghraib.He appeared in the photographs that were taken with the prisoners, and when these were made public, he was one of those who had to pay for the broken dishes of his country's politics, ending up in Leavenworth.The two stories themselves feel completely alien to each other, and in my opinion I think Paul Schrader never manages to balance them properly. Between the scenes at the card tables and the flashbacks that show glimpses of what happened at Abu Ghraib, there's a clear disconnect in tone.And the elegant and solid but restrained performance of Oscar Issacs also fails to balance both sides.And it's inevitable to ask yourself: Am I watching a poker film, or am I watching a political criticism film about torture?The story leads the character to eventually confront what he clearly seeks to repress by living the way he lives, but Paul Schrader does not make it clean or cathartic, much less emotional.Perhaps it gives some kind of absolution for the character, and along the way he seems to find something else, but unfortunately for The Card Counter, the message doesn't get across in a more powerful and convincing way."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)Schrader and Scorsese are employing two entire filmographies to express a poetic that Ferrara and St. John of \"The Funeral\" (1996) knew how to summarize in a single scene."
    },
    {
      "rating": "8",
      "text": "Like Travis Bickle in Taxi Driver, the war has scarred Oscar Isaac's card counting poker/blackjack player William Tell. He is a loner traveling up and down the East Coast winning small pots at poker games in B & C level casinos, and stays off the griad as best as he can.  Tiffany Haddish's character sees him at various tournaments and is intrigued.  Someone out of William Tell's militay past seeks him out and  William Tell see's the opportunity as a chance @ redemption.  Sadly, things don't always work out the way we hoped. Fascinating character study.  Great cast, directing and script"
    },
    {
      "rating": "9",
      "text": "Outstanding movie that explains the origins of PTSD, the Abu Ghraib prison scandal, the origins of the debacle in Afghanistan, etc. Well timed for the US exit from Afghanistan."
    },
    {
      "rating": "8",
      "text": "A film that traces in the most absolute way the typical modus operandi of Schrader (which we remember him for having started his film career as a screenwriter, and having written masterpieces such as Taxi Driver, Raging Bull etc ...): so what do we get? Voice-overs, characters in full existential crisis, who do labile jobs, in full sexual abstinence (topos that eviscerates a lot the director-screenwriter), and who roam at night in their car, whether they are drivers or passengers, it doesn't really matter, the important thing is that they are perpetually searching for balance, like a man back from Vietnam who kills time as a taxi driver, or like a drug dealer in search of safety, while in this case, a very skilled poker player with a terrible affair at the shoulders that pushes him to live in the shadow of his own life; it is therefore the story of William Tell, a mysterious man who earns his living by playing cards: his intertwining with Cirk, a boy who has a common enemy with the expert William Tell will finally lead him, perhaps, to redemption and redemption. It will therefore be their journey into human madness, revenge and redemption, which will make the viewer aware of the real horror of loneliness, madness and violence, just like a genetic disease, which is handed down from generation to generation. , as in the case of Cirk, whose father committed suicide for having committed terrible crimes, and the son, almost inheriting the gene of the criminal inheritance, dreams of revenge, and tells us, through his bloody words of lucid madness, what he would like to do to the common enemy, outlined by a magnificent and morbid Willem Dafoe, mostly crippled by the fish-eye lenses, which make everything even more hallucinated and visionary. Direction that perfectly manages to recreate the reality that surrounds the protagonist with raw realism: all the lights, although at first glance warm, are felt terribly cold by the viewer; we also find impeccable coherence in the music: as if they were antithetical to the story, they gently caress us, and while in the background the voice of Robert Levon Been whispers a love story between the protagonist and a woman, the wide-angle lenses slam us into face unprecedented violence like a slap, with physical but also psychological nuances. The actors are perfect: Oscar Isaac's inexpressiveness gives grace and depth to a man who has lost the sense of lucidity, and who lives on a razor's edge; an equally remarkable Tye Sheridan goes after him, but Willem Dafoe as always steals the show: in a few minutes he makes us fear what we see, painting with a few glances and a few jokes, a man irreversibly torn apart by the most unjustified violence, animal, primordial and brutal . Very good photography, clean and at times sensational. Excellent reflection on good and evil, and on how even the best person, with excellent intentions, can turn out to be the real evil in the end."
    }
  ],
  "recommendations": [
    "miss_sloane",
    "the_good_shepherd",
    "the_guilty",
    "dark_waters",
    "first_man",
    "personal_shopper",
    "beirut",
    "the_way_back",
    "swallow",
    "richard_jewell",
    "philadelphia",
    "patriots_day",
    "sicario",
    "just_mercy",
    "judas_and_the_black_messiah",
    "snowden",
    "nightcrawler",
    "21_grams",
    "allied",
    "fracture",
    "the_last_duel",
    "thoroughbreds",
    "elle",
    "stillwater",
    "only_the_brave"
  ]
}