{"id": 2841, "title": "The House with a Clock in Its Walls", "starring": ["Jack Black", "Cate Blanchett"], "runtime": 105, "genre": ["Fantasy", "Family", "Comedy"], "description": "When ten-year-old Lewis is suddenly orphaned, he is sent to live with his Uncle Jonathan in a creaky (and creepy) old mansion with a mysterious ticking noise that emanates from the walls. Upon discovering that his uncle is a warlock, Lewis begins learning magic, but when he rebelliously resurrects an evil warlock he must find the secret of the house and save the world from destruction.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/qM66Hv4ByAxnilr0jaqCA9uOD4Y.jpg", "categories": {"plot": 6.0, "acting": 6.026315789473684, "ending": 6.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 6.083333333333333, "funny": 6.066666666666666, "action": 7.0}, "reviews": [{"rating": "6", "text": "A recently-orphaned boy goes to live with his uncle (Jack Black) in an enchanted mansion, where he learns about enchantments that lead to the inevitable threatening showdown. This adaptation of the children's book is a hybrid of many magical fantasies, so there must be something more than the plot to make it appealing. Director Eli Roth (best known for his violent horror films) is bringing his skills to the PG-genre and manages to create a few creepy moments. Even with all the fantastical effects (and Cate Blanchett's charms) there's a certain blandness that keeps it from ever being original or exciting. Still, for the youngsters it'll provide plenty of visual pop and mild thrills."}, {"rating": "5", "text": "A film that never really catches on under that Amblin umbrella. It's not all bad and Jack Black and Cate Blanchett are giving it all they got, but poor scene structure and a plot that bored me for much of the first half makes this film unremarkable. Still probably Eli Roth's best movie though that's not saying much. Overall a middle to low 5 a C."}, {"rating": "9", "text": "Cinematography: 9.439/10 The trailer does not do The House with a Clock in Its Walls justice. The film flows a lot better in viewing and is not as corny as the trailer makes it seem (at least to me). Costume Design: 8.974/10 I like the tie-ins with the wardrobes to a theme on being one's self throughout the film. Film Editing: 9.543/10 Solid. Each scene is enough. Make-up and Hair-styling: 8/10 Decent.Sound Editing: 8.782/10 I wanted to hear the clock more. Visual Effects: 8.732/10 Decent. I wanted to see more magic.Story: 8.792/10 The story is the first surprise for me. I find myself enjoying The House with a Clock in Its Walls more as the film progresses. It's a fun simple film that gets its points across with just enough. There are some torturous (yes, torturous - I've seen people walk out of theaters or fall asleep torturous -  films in general, but in this case - ) family films: this is not one of them.Acting: 9.213/10 The acting is the second surprise for me. (I don't actively seek trailers, they show before the film I'm viewing, so sometimes it becomes a bit of a comparative-referential point). Plus, my interest in seeing Mid90s has grown even more watching Sunny Suljic and Owen Vaccarro acting together (that whole motley crew of kids is nice to see in The House with a Clock in Its Walls though).Personal: I'm glad about the film's turnout. Bullying is really terrible. Playing is fun. It's good to be weird in good ways. The actual process of growing is fun especially with everything in order (cause not too many kids have to pay bills, it's sad about the ones that have to and had to at far too young an age - but, no one is ever too young to begin doing what they are good at - enjoy -  and making money). A kid from a well off family once told me he felt like he was losing his imagination. I told him he has to continue working on his imagination to build it - stimulate it. I do know circumstances may affect individuals in varying ways. I think The House with a Clock in Its Walls does a great job of showing the importance of belief and imagination as well as the processes occurring from experiencing a loss - of grieving and recovering. Good creativity and the imagination are so important to life.Overall: 8.934/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."}, {"rating": "6", "text": "This film had two kids crying in my showing. It has the kid humor with some adult jokes for parents to get but at its core this film is just another kids book adapted into a mold for cinematic goers. Necromancy, demons, and holocaust references are a little too much for kids."}, {"rating": "8", "text": "I'll be honest, I was a little worried about this considering that: a) This is the first children's film from torture porn horror director Eli Roth not to mention the first time he's helmed a film with an attempted big visual flair. b) The film is more humorous than the book. I was afraid it might be too hard to be Goosebumps. Luckily, both my fears were abated.Jack Black and Cate Blanchett have excellent chemistry together. They're both quite humorous, but they also nail the characters' more serious moments. It's weird that a trifecta of children's/family films has produced some of Jack Black's best roles. Although, you feel a bit more of the Jack Black personality here than in his other two roles, he does manifest the character of Uncle Jonathan, the fun uncle who also has a secret undertaken. Overall, all the characters are really well-fleshed out here.Visually the film looks great from the 50s' setting to the entire look of the lavish house from the title, especially the scary visuals. Really, they rank with the likes of Tim Burton or Krampus. The film knows when to have fun, but it knows when to bring on the scares. As a child I preferred the original book and the other works of John Bellairs over Goosebumps, because the horror was played more directly and seriously, and this movie understands that. Cautious parents be aware that this is as scary as a PG movie can get. Well, maybe not as much as The Witches, but what is. This is definitely Coraline level.The only downside is that at a running time of one hour and forty-four minutes, the second act, which is heavy on the character bits, drags a bit. Most of the action doesn't happen till the third act.Roth surpassed my expectations here, and I hope he gets a chance at adapting the second book in the series."}, {"rating": "0", "text": "This movie was being marketed to small children as an innocent, fun, magical adventure. It starts out with an intriguing story about a boy exploring his new life in his weird uncle's enchanted house. \"Innocent\" wizardry and magic is introduced, and very quickly the movie took a DARK, MENACING, and DEMONIC turn. Now the boy is bringing evil wizards back from the dead, facing walking devil dolls, and learning how the evil wizard got his power from a demon in a very graphic and gory visual. My girls were terrified of the movie, and the only reason we stayed is because they wanted to see good triumph the bad and make some sense of the whole debacle. I am furious that this movie has a PG rating. There is blood, gore, scary themes, witchcraft, dark magic, and much more that should have brought this to a PG-13 with cautionary warnings. As a parent, I should have done some very easy-to-find research on this movie, but as this was a spur-of-the-moment decision, I assumed that the trailer would be enough. How wrong I was. The trailer is light and whimsical compared to what was hidden inside this film. I will tell you what the critics will not... This is not a movie for children."}, {"rating": "4", "text": "In just one month, it will be time to hand candy out to kids at your door wearing cheap costumes. It will be time to pull out the Halloween classics: Hocus Pocus, The Nightmare Before Christmas, just to name a few. Those seasonal favorites are admittedly low in artistic quality, and The House with a Clock in Its Walls is no exception as it takes a similar tone to the numerous quirks of Halloween-ish children’s entertainment. Yet despite this completely ridiculous plot reliant on gags over sensical situations, a decade or two from now a cult following could very well be picked up amongst a full generation!I was ready to hate this goofy family entertainment much like I did A Wrinkle in Time, but for some outlandish reason, I found a soft spot for this flawed motion picture despite the MANY unmotivated performances that lowered the quality. I somehow don’t mind the bad acting and dialogue, because the twistedly magical artistic scale so strongly amplifies the size of the orphan protagonist, Lewis’s new teeny tiny house. In his new home, he along with his uncle (Jack Black) and neighbor (Cate Blanchett) must embrace a common concept of being the family’s black swan, since they each share a weirdness outside their front porch adorned with jack-o-lanterns. With trusty goggles, Lewis takes on an indominable insect virtue, his little ant size made smaller by the mundane brown hues of his school. But that’s still quite tame compared to a climactic lunar eclipse that eventually casts a giant blood red tint across the screen to tear down all life.It’s certainly a wicked sense of cinematic appeal, but this glamorous fantasy also beautifies witchcraft, even giving a tutorial of blood payment that shows young minds how cultic practices works. At a more personal level, some of the more tasteless jokes include lingering on one slow boy on crutches in gym class, who gets lightly mocked, “good hustle” by the coach. Thus, viewer discretion is advised.But hey, at least it’s funny as expected, once Jack Black pulls out a saxophone solo, dogs start howling while his live griffin bush covers its ears. Then that griffin bush, as if it were the family cat, poops into the backyard pond against its master’s orders, which sounds gross, but personally got a decent laugh out of me. But this mock Addams Family also stays grounded into reality with the appropriate 1950s tunes, until the heartbeats behind the moonlit walls tick-tock to set off the inner adrenaline. It’s a nice balance between funny filler guaranteed to entertain kids, and fun unsettlement from the perspective of a poor little orphan.Yet despite the frightening imagery, it’s very unlikely that kids will relate to this style over substance experience. The boys have Lewis to connect with, who doesn’t have that much of a personality anyway, but the girls have no characters to relate to except one pointless girl from Lewis’ school who is around for approximately three scenes. She’s also one of the worst actors in the film, almost like they brought out a crew member’s daughter last minute. The adults are not out of the clear in being easily relatable either, as none of the veteran actors receive proper direction to be anything but doofuses. Case in point: there is a montage that forces Jack Black to levitate, which is admittedly a funny scene, but the wires he dangles on are obvious to notice, much like Winona Ryder “levitating” at the very end of Beetlejuice.The cast members simply can’t enlighten the awful screenplay, since when the writing doesn’t abuse plot driven exposition through film reels, it implants bothersome name-calling between Jack and Cate that concludes its arc with a tossed around sense of heart. Now Cate, I particularly detested in this feature, she is supposedly written to be a “new” mother figure to Lewis but can’t generate sincere drama with a voice of reason. However, Cate still doesn’t annoy as much as Owen Vaccaro as Lewis, who overacts to force everyone’s attention on him, screaming loud enough to crack cement. He doesn’t even give a hint of emotion to hearing that this new uncle he’s living with has complete freedom of house rules. These visions he has at night of his dead mother are particularly hard to watch, as the actress playing her just stares at what seems like a total stranger, not who is supposedly her own son. Yeah, unfortunately, aside from Jack Black (who even then is mediocre at best), I have virtually nothing nice to say about any of the actors or actresses in this entire feature.Despite the fun I had while watching this, understand that it’s still my job to discuss the negative qualities of every film I review. So odds are, you aren’t missing anything with The House with a Clock in Its Walls, but if you’re willing to take a chance, it could very well be the perfect jumpstart to your Halloween!"}, {"rating": "9", "text": "Mix Crimson Peak with Goosebumps and throw in a dash of Harry Potter and you get a film that’s surprisingly fun for all ages"}, {"rating": "9", "text": "The casts performances were stupendous especially Jack Black, Cate Blanchett, and Owen Vaccaro. The banter between Jack Black and Cate Blanchett's characters was hilarious. The visual effects and set designs were spectacular. The story and screenplay were fantastic. I also thought the film score was well done."}, {"rating": "0", "text": "Caution to Parents! This movie and rating is a ruse. This should have been PG-13 at best. Not suited for young children,Christians or anybody with any sense. It is all about Witchcraft and satanic rituals. This is where Hollyweird is going and we need to resist it."}, {"rating": "3", "text": "I thought it was rather boring, compared to the Harry Potter Series.  Perhaps it would have been better if there had been a serious background story, which was a strong feature of Harry Potter.  Of course, if there had been a serious background story, then this movie would have been entirely different!"}, {"rating": "8", "text": "“House” was a pretty good movie. The beginning and climax of the story were SO good (10/10 worthy), I just wish I could say the same about the ending. This part of the story relied too much on CGI. While I don’t mind a little bit of it used now and then, I felt a little hit over the head with it. I also would have appreciated less “bush-lion” poop jokes about using the litter box instead of blasting people with leaves (poop?). Besides that, I had a great experience with House, and I would recommend it to people who enjoyed the Harry Potter films, Doctor Strange, and the Goosebumps movie."}, {"rating": "2", "text": "I went to see \"The House With A Clock In Its Walls\" not with high hopes but expecting to find it entertaining, fun and energetic. As a fan of both Jack Black and Cate Blanchett I expected it to be at least good. Both Blanchett and Black do their best with the material provided and do elevate the movie frequently. The young actor portraying Black's character's 10 year old orphaned nephew is played by Owen Vaccaro. He shines throughout. His character's desire for childhood friendship and acceptance is genuine and heartfelt. It's the writing and plot that sinks this movie. I'm not sure who the target audience is for this movie. Although it aims clearly for a \"Harry Potter\" and \"Goosebumps\" audience it misses the mark wildly. It tries to be fun and occasionally is but then turns very dark. Occult and demonic themes do not cater to young audiences. It tries to be whimsical at times and at times succeeds at whimsy but this movie is ALL over the place. Teens seem bored with the movie as I witnessed a number of walkouts during the movie. It's too dark for small children. Speaking for adults, I found it tries too hard to be too many things and target wide audiences, clearly aiming for fans of the Harry Potter and Goosebumps franchises."}, {"rating": "8", "text": "At first glance, Eli Roth may be considered an odd choice to direct the adaptation of The House with a Clock in Its Walls, from the book by John Bellairs (with illustrations by Edward Gorey – hell yeah!). Roth, after all, is most famous for the the gory and violent Hostel and Cabin Fever series. For feature completion, we also have the Italian jungle cannibal  throwback Green Inferno and the remakes of Knock Knock and Death Wish. None of these are particularly good, although I enjoy the majority of his films on an entertainment level; I note here I’ve not seen his take on Death Wish, or any of the original series. Much of that enjoyment comes from how obvious it is Roth loves the horror genre. This is likely why Spielberg himself reached out to Roth to direct the Amblin produced A House with A Clock in its Walls.  Apparently he told Roth he wanted to scare the hell out of the kids. While I wouldn’t describe the movie as scary, it sure reached in and grabbed my horror-loving heart. It’s not perfect, but Roth made a damned good film.Roth imbues this adaptation, it was adapted once before for a Vincent Price hosted anthology show (note to self: seek this out), with a love of the family-friendly horror of the past. Yes, it’s based on Bellairs book; but I haven’t read it, so my memories went to Bradbury and the feels of his October Country. Set in 1955, the story finds young and recently orphaned Lewis Barnevelt moving to a small town in Michigan to live with his eccentric uncle Jonathan. Jonathan (Jack Black) is a warlock, living in a deceased warlocks house, a house full of magical and sentient objects, along with that pesky clock in the walls counting down to…. Something.  Next door is a witch played in purple by Cate Blanchett. This house is awesome. Production design – hell yeah! Sure, most of it is made by CGI, but it’s good CG – mostly. Some shots don’t seem done but for the majority, seamless. I want to go to there. I want to live there. I want to explore it. So long as I can burn the room with the dozen automatons, please.Getting a director like Roth on board, and being told to scare the kids, was a great choice for the film. I don’t know how much comes from the book, or its eleven sequels, but I was glad with the places it went to. Too many people think kids can’t handle horror and certain levels of it.  House went into darker territory than expected. Necromancy and blood majick places. In not holding back, it also doesn’t hold the audience’s hand. There is no talking down the expected audience, thus making the film just as entertaining for adults to watch without children (like my wife and me). Lewis is as precocious as many of his lead-kid brethren, but not annoyingly so. He love his dictionary and learning new words. He’s well played by Owen Vaccaro from Daddy’s Home; although most of what he has to do react to everything. The times where it moves to him to carry emotional weight there is something lost – especially as his fake crying is pretty awful. But when you’re competing for attention from Jack Black, Cate Blanchett, and Kyle McLaughlin, it’s hard not to get lost. Black and Blanchett are wonderful, with more chemistry than most romantic comedy partners. In a refreshing change from most movies, they are a platonic couple – just friends who love to jab at each other.  Blanchett delivers every line with relish and has a surprisingly emotional backstory as well. Black is more Jables than he was in the more restrained R L Stine in the surprisingly good Goosebumps from a few years ago (here’s to the sequel next week). On the not so good side is almost-friend/bully Sunny Suljic. Kid was bland and bored here; he’s the leading Mid90s; here’s to him being better there. Ultimately, his part could and should have been cut. Biggest issue with the film is the school subplot is distracting and useless; a quick rewrite would have gone around this.  While I’m talking negative – dammit fart/pee jokes. You don’t’ fit here and took me out of the film.A House with a Clock in its Walls is a real treat for horror loving families. With strong chemistry in its leads, a Bradbury/Spielberg feel, and allowed to go where it needs for the story, the film is a lovely throwback that should appeal to any horror person who will allow themselves to be a young person looking at the genre.A-"}, {"rating": "2", "text": "Despite a solid cast, The movie does little to be truly unique or imaginative. The plot is very bland and leaves a lot to be desired. It's instantly forgettable and could be guessed from start to finish. It's a shame because you want to like it but it's hard to like."}, {"rating": "6", "text": "+Beautiful 4K hdr presentation+Great cast+Excellent production value visual effects/sound/sets-Lacklustre screenplaySome odd pacing choices in combination with the well produced visual designs result in a film that seems unable to commit to a particular genre... As a result the interesting story fell flat for me... The House With A Clock In Its Walls Looks beautiful though!"}, {"rating": "7", "text": "A bit too fast paced but fun. The kind of family film we haven’t had much of since the 90’s. Think Addams Family and Casper, While Jack Black and Cate Blanchett make a great combination start to finish. They charm throughout."}, {"rating": "7", "text": "When I heard that Eli Roth would be tackling a family adventure story, it reminded me of that time when Martin Scorsese - known for gritty crime films - tackled 'Hugo' (2011), in that, you have an artist stepping out of their creative comfort zone in favor of doing something completely different. I think Scorsese succeeded greatly with 'Hugo' (2011), and Eli Roth only just about succeeds with 'The House with a Clock in its Walls'. Based on the novel by John Bellairs, the movie focuses on a young orphaned boy named Lewis Barnavelt (Owen Vaccaro) moving in with his Uncle Jonathan (Jack Black) and his neighbor Florence (Cate Blanchett). Jonathan and Florence are two very powerful wizards and the house they live in is full of dark magic. Lewis is still feeling sad that his parents have died in a car crash, this happened off-screen of course, and it seems like a tired cliche that the movie's opening and development of our main young character had parents who died in a car crash. Why don't these people learn how to drive? Or, if it wasn't their fault, why don't any of the safety equipment in their cars work? Seat belts, Airbags etc. anyway, he discovers that his uncle always lurks around the house every night to try and find something that's been frustrating him. It turns out, as he's told, that there is a ticking clock hidden inside the walls of the house, and that each tick is a sign that they are close to death at any literal second. They must find this clock before it's too late. Lewis also wants to learn some magic tricks since Jonathan is technically his family. The film is surprisingly good at capturing some good spirit and heart, even if the drama and comedy are a little uneven from time to time. I think it works best as an Eli Roth movie more than anything else, considering that he is known for his gory and sadistic horror films such as 'Hostel' (2005) to 'Knock Knock' (2015), Roth clearly shows that he can choose to switch genres as well. The performances from the cast are good, and the movie will probably entertain your children too, some of the story does get a little lost in focus and some of the whimsy can feel a little underwhelming, but overall, I enjoyed it enough, and am curious to see what Roth will do next."}, {"rating": "9", "text": "A marvelous bit of dark fantasy.  Please note: in addition to being enchanting, this movie is legitimately spooky and darkly atmospheric, so I'm not sure I'd recommend it for younger children.Having read the books I was confused when I saw the movie listed as a comedy, but it worked quite well overall.  During a couple of the comedic moments Black veered a bit too far toward melodrama, but otherwise his Jonathon was delightful.  The rest of the cast was also good, but Lorenza Izzo (Lewis' mother) was absolutely perfect.  I really hope they make more movies based on books from this series."}, {"rating": "6", "text": "Decent movie, but nothing outstanding. I think more intended for kids, which I am not. Was fun either way"}, {"rating": "6", "text": "This movie was slightly entertaining but also funny, with a new atmosphere and decent performances, especially the characters of Jack Black and Cate Blanchett, but with a regular story and special effects."}, {"rating": "6", "text": "So I had no real interest in watching this film really. There wasn't much out and my mom wanted to see this movie, and I begrudgingly went because it looked like the best option out, plus it has Kyle MacLachlan in it (Twin Peaks forever!!!). So I went and I honestly got to say it was surprisingly decent. I won't say this movie is good, given that I rated it as an average film in my books, but it was better than what I expected.Owen Vaccaro is okay as the lead role. I won't say it's amazing, but for child acting he's passable. There are a few bad deliveries from him, but for the most part he didn't annoy me. Most of the child acting here is alright too. The adult acting is far better, and no one foamed in a performance as they all really cared about making the film, which is a huge plus! Jack Black is probably the weak link of the bunch as his usual Jack Black shtick sticks out in the 1950s setting, but for the most part he was pretty good. Cate Blanchett is great as usual, and her and Jack Black do have great banter and funny quips at each other. Kyle MacLachlan doesn't get a ton to do, but he's good as usual, plus his role as the big bad is actually rather menacing than what we usually get from family films.The biggest surprise for me was that Eli Roth of all people did a decent job directing. And I am not saying that because he diverted from his usual extreme horror and gorefest films, I actually do not like him as a director honestly. He usually relies more on cheap thrills than on actually making interesting or fun movies to watch, which is very clear given the terrible remake to Death Wish earlier this year. And while I still don't think he's all that great of a director, the shot composition is basic and uninspired, the movie does come to life whenever the film gets to the magical, weirder, and darker moments of the film, which are the highlights of the film. The more creepy and strange the movie gets, the more alive it feels. There's a lot of charm and a reminder of earlier Tim Burton films like Beetlejuice and Edward Scissorhands, which is always a plus. Roth did make a ton of effort in making the film and it does show. There's a ton of energy and enthusiasm that comes from the film with the cast and terrific production design. The costumes, makeup, and prop design do a great job creating a strange looking film, and more than makes up for the by-the-number film-making.However I cannot really say this movie would make up for how generic the film is. And I don't mean the premise is generic, it certainly is unique of a premise. However when it comes with the structure, you've seen this before in a lot of children's films, right down to the cliched conflicts and character traits. It's a very safe film even with the scary elements that do manage to spice up the average structure of the film. The charm of the film does make up for it, but if the movie does not have any interest in this film, you don't have to watch it. Families and kids will enjoy it, but for the most part you can just rent it or watch it on TV or Netflix as background noise. Again not bad, just kind of pleasantly average."}, {"rating": "6", "text": "Now the main stand out on the acting department for me was Cate Blanchett. She had the comedic timing down packed and was still able to have some serious scenes. The visual effects in some scenes looked pretty good but others just looked out of place. But for a majority of the film they did look very good. This film is classified as a horror film so it's supposed to be scary right? Well, it’s scary if you’re thirteen and below unless you’re scared easily then it might be scary for you as well. Now you don’t get to meet the villain of the film until it’s halfway done and it’s not even that captivating of a villain. In a movie like this, the villain should be somebody that you fear and want to be against, but he was just a laughably bad villain. His plan is generic and not original, and his entire plan revolves around one thing that only happened by accident. Then there’s the pacing in this film. Remember how I said it took it halfway through the film to finally meet the main villain? Yeah, that was all because the pacing in the entire film was off. It seemed to drag out way too much like they thought they had a longer run time. Due to the first half and part of the second half is slow it caused the climax to seem rushed and not flow smoothly. There didn’t seem to be any character growth either, again probably due to the terrible pacing. In the end, “The House With a Clock in its Walls” is a good time for kids who like being scared."}, {"rating": "8", "text": "it was actually pretty good! I wish fantastic beasts was like this !it's an interesting story, and it have potential for becoming a series of movies!"}, {"rating": "7", "text": "I put 7, but I think that maybe is a 6.5The story of the movie is good as based on a book, but is good to kids. If you are teenager or adult, this movie have a chance to not impress you, but who knows? I have a aunt who loves any type of magic movie so... I can't say that is a good adaptation of the book of the movie as I never read, so I owe you this. The plot-twist (let's call that) is interesting, but as the movie is not all this, just make you pay more attention to the screen and that's it. I don't know, but the world they showed makes me think that would be great on a cartoon show. Again, who knows, right?The characters are good, especially Jack Black and Cate Blanchett's characters. This two makes the movie better with their charism and good acting (yeah, I like Jack Black acting skills). The boy, who is protagonist, isn't a very interesting character, but that don't annoy me. The villains are... ok. They aren't scary, evil (they are evil, but not that kind of evil we expect) or interesting in any ways.As I say in my resume, \"The House with a Clock in Its Walls\" is a good-to-okay movie. Your children will like, you maybe not so. Jack Black and Cate Blanchett are a good duo and I would like to see them together again. The boy have potential, but the movie not explored. As I say on every review that I make, go to the movies and watch by yourself to make your vision of this film. Don't depend of others words to you say what is good and what isn't. I don't care about someone finds my review useful or not, I'm just writing what I think about it.My motto continues: Go to the movies, and draw your own conclusion"}, {"rating": "5", "text": "An entertaining albiet familiar story with nice visuals. Unfortunately it’s very forgettable and relies uncomfortably on potty humor.Rating - 53%"}, {"rating": "7", "text": "Eli Roth made a really enjoyable kids horror movie. Jack Black is amazing, as always."}, {"rating": "10", "text": "I like this movie so cool, a cute trama and one of the most interesting ones"}, {"rating": "7", "text": "This wasn't bad. I was a bit surprised. To me it seemed to start off really slow, but it picked up... & Cate Blanchett was an absolute gem. Sincerely loved her character so much."}, {"rating": "5", "text": "Jack Black The Movie... oh yeah and some magic bits.tHWaCiIW is average at best.  That may be hard to believe if you haven't seen the movie yet.The problem is, the trailers are good, but they contain the best of the movie and the rest is bland.I'd say it could be fun for kids, but depending on their age, could unnecessarily scar them.Everyone should skip this movie."}, {"rating": "5", "text": "Watch this is you like:Beautiful Victorian home interiorsMagicAnimated toys, garden fodder and household itemsA peculiarly unique and overly elaborate sinister plot to rule the worldHappy, and not unforeseen, endingsThe MunstersHorologyCreepy cemetery scenesThe orphan seeking new loving parents storylineSimple and easy, family-friendly entertainmentDon't watch this if you don't like:Jack Black in kid-friendly movies (which is all he seems to be in lately)Cate Blanchett in roles that do not match her talentSlow-moving stories that lack any stylish verveLudicrously easy escapesA child actor's voice that is far too high-pitched and whiny to be enjoyedBulliesWay too nosy, and thus annoying, neighborsKids that do things that are outrageously foolish to get others to like themPumpkins that spit orange glueStories with too many storylines and not enough focus on any one of themA movie title that gives away an important mystery in the plot"}, {"rating": "7", "text": "This movie has a theme of accepting weirdness, which goes from the main character accepting his weirdness to the movie accepting it's own weirdness."}, {"rating": "7", "text": "I don`t really think that this is a kids movie. It tries to balance out creepy scenes with scary stuff with poop jokes that don`t really work. Though it is an interesting adaptation of the book (I didn`t read it myself) despite the cliches."}, {"rating": "2", "text": "A kid’s movie directed by Eli Roth... I was bored out of my mind and almost fell asleep. I’m not the target audience for this film but I’m sure most kids will find it lame. Jack Black will always be the man, but I guess I’ll just have to keep wishing for a Tenacious D 2 Movie *Sigh*"}, {"rating": "5", "text": "Such a predictable, bland movie.The cast of characters is decent enough, but the story is so weak that this comes acoss as a bunch of ideas thrown around to make this movie without anything pulling it all together."}], "recommendations": ["goosebumps", "monster_house", "it", "nightbooks", "goosebumps_2_haunted_halloween", "ouija_origin_of_evil", "annabelle_comes_home", "the_spiderwick_chronicles", "incredibles_2", "the_kid_who_would_be_king", "hotel_transylvania_2", "krampus", "shazam", "gremlins", "the_babysitter", "nanny_mcphee", "red_riding_hood", "turbo", "mama", "insidious_chapter_3", "the_croods", "brightburn", "bumblebee", "dora_and_the_lost_city_of_gold", "it_chapter_two"]}