{
  "id": 262,
  "title": "The Expendables",
  "starring": [
    "Sylvester Stallone",
    "Jason Statham"
  ],
  "runtime": 103,
  "genre": [
    "Thriller",
    "Adventure",
    "Action"
  ],
  "description": "Barney Ross leads a band of highly skilled mercenaries including knife enthusiast Lee Christmas, a martial arts expert Yin Yang, heavy weapons specialist Hale Caesar, demolitionist Toll Road, and a loose-cannon sniper Gunner Jensen. When the group is commissioned by the mysterious Mr. Church to assassinate the dictator of a small South American island, Barney and Lee visit the remote locale to scout out their opposition and discover the true nature of the conflict engulfing the city.",
  "releaseYear": "2010",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tDynwDj3pvexrEQ8wb0uy8EdcGQ.jpg",
  "categories": {
    "plot": 6.205128205128205,
    "acting": 6.392857142857143,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.375,
    "action": 6.746987951807229
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I don't understand the bad reviews. The movie isn't trying to be anything other than a hark back to the action films of the 80's; lots of explosions, lots of violence and a cheesy plot. The acting is good for what it is (we're not talking Oscars here people) and the actors are all veterans of the silver screen, with the exception of Stone Cold and Randy Couture who actually did a fine job of playing their parts. Stallone movies will always be what they are, good, fun, mindless action flicks. He's had a couple of better roles (First Blood, Cop Land) but for the most part he always plays the unsung hero. Get over yourselves and just grab a bag of popcorn and have a good time."
    },
    {
      "rating": "4",
      "text": "Action movies like this (think \"Tropic Thunder\" without the irony) will always have their, mostly male and indiscriminate audience satisfied with endless shoot-outs, explosions, beat-downs and big shiny guns and knives, but there is a way for such movies not to be this tired, unoriginal and humourless - a talented director and/or a good script. With a cast and budget like this, someone like Tarantino might have made a classic. Still, I hope Eric Roberts and Dolph Lundgren jump-start their careers with their villainous performances."
    },
    {
      "rating": "5",
      "text": "no much of a story in it. screenplay was tight and gripping in the last 15 minutes. first half had its own dose of some humor sentiment and a bombing scene. second half picks up and ends as a action feast. direction by stallone is good in parts. jason sthatham himself and jet li performed very good. the girl character did not get importance. villain was wasted. casting was average as arnie and bruce willis did cameos for a while. sylvester and jason along with li are show stealers. technically movie is awesome. we have some striking background score , some rich visuals captured. good action scenes with fast camera movement, editing was abrupt at parts and second half was saved. over all expendables is average movie to normal viewers and it will be a good movie if script would have been tuned."
    },
    {
      "rating": "6",
      "text": "Not a bad movie with lots of great action, violence and explosions. The critics haven't really been gentle to veterans with their long careers and the minor issue: do each epic actor have an equal amount of acting? Not really, until the sequel."
    },
    {
      "rating": "2",
      "text": "If people expect it to be good because it had a ton of hit action stars when they are stupid. I had low expectations for this film and I was suprised that it turned out as decent as it did. The plot was rather generic and had very little of it. It did have far too much over the top (and highly unrealistic) action for my taste as well. It was like watching a modern day 300 imo. Overall it was ok for an action movie but trash when considered anything else."
    },
    {
      "rating": "8",
      "text": "A wonderful piece of good old-fashioned action movie entertainment! Although Bruce Willis and Arnold Schwarzenegger should have had more than one scene!"
    },
    {
      "rating": "4",
      "text": "\"The Expendables\" isn't a movie you would visualize, a movie pertaining Macho man with AK's and M16's kicking asses with a mind blowing plot twist. What you will see instead is old Stallone running around with his Macho grandpas, following a extremely fragile plot with 2% character development."
    },
    {
      "rating": "4",
      "text": "This movie was seriously disappointing. In my opinion, there was too much Stallone face-time and not enough of the actors who had good performances such as Terry Crews, Mickey Rourke, and Randy Couture (better than most people thought he would be). Also, they built up Schwarzenegger and Willis being big roles, but instead they only had like 2 minute cameos.And in that cameo Schwarzenegger was billed as Stallone's rival which could have let to some sort of plot twist involving Schwarzenegger, but that was too much to expect. Anyone could of been in those 2 minutes, they were completely worthless other than just to barely include Schwarzenegger and Willis so they could add them to their list of stars, that said, the President line was great. Overall the movie had amazing action scenes, but wasted a lot of potential  that could of led to the movie to be the greatest macho movie of all time."
    },
    {
      "rating": "5",
      "text": "You know, it is possible to make action movies that are intelligent as well (Ronin, the Bourne Ultimatum). Frankly all those so called action flicks from the 80s and 90s blew huge chunks (with admittedly a few exceptions).  Anytime a movie asks you to leave your brains at home, avoid it."
    },
    {
      "rating": "10",
      "text": "wow wonderful of using the whole cast. the way each actor big name was used in the film was the best anyone could of done. Stallone is an action genius. Chuck Norris, Jean-Claude Van Damme, and Steven Segal should of accepted their roles."
    },
    {
      "rating": "3",
      "text": "Action: Yes. // Plot: No, convoluted is an understatement // Fun: a little at times. // Characters: Forgettable and some are hard to figure out if they are a good or bad. // Disappointing Moments: Jet Lii not kicking butt but getting his butt kicked and Mickey Rourke having a decent size part but doesn't participate in any of the actual action. // Best Actor: Terry Crews with a pretty neat gun and the only one that took bad lines and made them passable // Summary:  Most people going to see a movie like this know what to expect, however that being said the story/plot is exceptionally bad.  You could write a novel size review of all the problems this movie has; but, If you don't mind turning your brain on mute and just going with the flow you might enjoy the experience. // Worst Line: Kidnapped Chick \"How are you here?\" - Stallone \"I Just am\""
    },
    {
      "rating": "10",
      "text": "The critics couldn't be more wrong on this one. The Expandable is one of the best action movies of all time, it delivers on everything it promises and then some. Every time there was a fight scene, I was overwhelmed by the incredible action on the screen. Bottom line, don't listen to the reviews. Watch this movie."
    },
    {
      "rating": "2",
      "text": "From the very beginning, I knew this movie would be boring and predictable. If you have seen some 1980's action films, then you already know what is going to happen with the movie. There are not twist, turns, or surprises to be had. The best thing about this movie was the stars of yesterday all coming together into the movie that never was. However I found myself bored during the movie just wishing for it to be over. The expendables is not a good movie, it's not even a good action movie. There is a reason 1980's style action films are dead, watch this film and you will know why."
    },
    {
      "rating": "0",
      "text": "The Expendables reminded me of the films Dirk Diggler (Mark Wahlberg) and Reed Rothchild (John C. Reilly) make in Paul Thomas Anderson's 1997 film Boogie Nights (Angels Live In My Town, et al.), both because of its preposterous plot and the terrible quality of the acting. Of course, Boogie Nights was a masterpiece, whereas The Expendables could have easily been renamed The Inexplicables. Another point of coincidence between both films is the ridiculous nature of the names of the characters. Obviously, Brock Landers and Chest Rockwell (from Boogie Nights) are meant to be humorous, whilst the plethora of asinine monickers in The Expendables (Lee Christmas, Yin Yang, Toll Road, Gunner Jensen, Hale Caesar, Dan Paine, even the somewhat appropriately named Mickey Rourke as -simply- Tool) are all employed without an ounce of irony. And I think that might be where The Expendables fails miserably: it takes itself all too seriously, even though it is the silliest of affairs. It takes itself all too seriously, even though no-one else will. The screenplay is childishly obvious. Puppet-like Latin American dictator, badder-than-bad baddies, beautifully exotic girl, good-hearted tougher-than-nails group of protagonists, and explosions galore. But someone should have told the producers that if you are going to make a FILM you need to have at the very least ONE ACTOR in it. The cast list looks like an inventory logbook at a meatpacking plant, or the VIP door list at the Gym from Hell. Jason Statham's idea of acting is talking the way Tom Waits sings, all the way through the film. Stallone invariably looks like a wooden mannequin with no flexible joints whatsoever. And the rest of the cast... well, you get the idea. Not a good film."
    },
    {
      "rating": "1",
      "text": "In all honesty, making this film was the biggest error in judgement in film history, until this film was bought for me as a present. I would have preferred to be the poor guy appointed as Messrs. Stallone, Willis, Rourke, Schwarzenegger and Lundgren's personal masseuse to knead lumpy knots out of their ageing liver-spotted backs on-set than sit the whole way through it again. There are some larger-than-life explosions; always entertaining, as well as some pretty cool knife throwing but the very thin space between over the top and unnecessary is constantly misjudged and fallen over clumsily rather than toe-d in the Die Hard spirit of things."
    },
    {
      "rating": "6",
      "text": "This movie is exactly what you expect it to be. An action movie with lots of explosions, car chases and shooting. The problems I had with the movie were the character development and the humor. There are multiple characters that really are not developed. Jet Li falls into the back ground as does Lundgren. Rourke is even hardly a character in the movie. Putting Schwarzenegger or Willis on the bill is honestly false advertisement. Neither one of them are in the movie beyond 10 mins. The other problem is the humor. There are attempts at humor but they are honestly not that funny. So overall this movie does have its problems. However, if you are looking for an Oscar caliber movie then this is not it. If you are looking for a decent action movie then give this a try."
    },
    {
      "rating": "4",
      "text": "This movie was pretty much a mashup of all the stars and movies like Rambo 2 and Commando. Although it had some iconic moments and funny jokes the action scenes were far from satisfying. The heros just spray and spray and explosions go on and somehow the bad guys always miss... Overall, I think this movie could have been much better considering the number of great actors that it had."
    },
    {
      "rating": "10",
      "text": "Exactly what I expect from a good action movie - guns, explosions, violence, gore, cheesy dialogue and a standard action movie storyline. Obviously the critics were expecting something more substantial, but I couldn't have asked for anything more."
    },
    {
      "rating": "9",
      "text": "What is with all bashing on movies these days, not just this movie, but every other that comes out? Does it make you feel cool to bash something? Well, I'm going to follow this formula, should you see it, wait til it comes out on DVD, or skip it entirely.  Sounds pretty simple. Well, what can a say it's a action packed, cliched, enormous body count, explosion, testerone fest. And that's what makes it great. It's a simple action movie not trying to be anything but what it is. Anybody expecting more go see Inception. This is a dumbed down, stunt filled, slug fest. While not the cleverest movie of all time it's a nice little homage to action movies of old. The movie is a little deceiving in it's trailer, since this movies is mostly about Statham and Stallone's characters, with the others only as background, and Willis and Awnold doing a cameo. If you can take this movie at face value it's a quite entertaining movie. Not Stallone's best work (don't expect Rambo or Rocky) but if you go in knowing what to expect you walk away satisfied. It's not one of those let's tap into the hip, cool, new action, CGI fests of current movies (such as The Dark Night, Star Trek, Iron Man movies, or others in that vien). My verdict, for the old school action fan, go see it. For those who aren't wait to rent it on DVD, for people who can't stand gratuitous violence skip it."
    },
    {
      "rating": "9",
      "text": "It was **** awesome. Sure, the story is a \"been there, done that afair\", but who cares?  We don't go for story in these types of films.  Anyways, most of the appeal of it is generated towards its ensemble cast.  They mostly deliver, but the few screen-time given to Arnold, Bruce and Mickey is a shame.  There isn't too much action in the beginning, but the end more than makes up for it.  I do have to point out that the action can be too hectic at times, making it hard to know what's going on, but it sure is brutal and bloody violent. So go and see The Expendables. It isn't the \"Greatest Action-Film of All-Time\" or the \"Manliest Movie Ever Made\", but I promise you that its worth your time and money.  A 9.5/10."
    },
    {
      "rating": "6",
      "text": "My only complaint with this movie is that the story isn't as good as the action scenes,and Schwarzenegger's cameo yet cool is totaly pointless.Can't wait for the sequel."
    },
    {
      "rating": "0",
      "text": "Sorry but I found the movie completely stupid. Stallone's talent has long deserted him and the other action heros would have been better off staying retired and remembered for their successes.  The plot was lousy, the special effects looked more fake then usual, the dialogue was retarded and the fight scenes were pathetic. Third rate action rehash!"
    },
    {
      "rating": "6",
      "text": "Cathartic and fun. Great seeing Dolph Lundgren again. It's mostly playful, but when it comes time to blow stuff up and break bones, it delivers in the ways you need it to when you decide to see a movie like this."
    },
    {
      "rating": "6",
      "text": "The Expendables was a little okay,not bad,but just alright. Stallone finally returns and he's alright in the movie,but please he's very old for the entire movie and I wish that he definitely retire right now since Rocky Balboa & Rambo. The characters are fine,I like only Statham,Li,Rourke,and Couture. But Lundgren was almost not that great,he's again way too old as Stallone does,since his bad action films. Arnold returns in cameo and so does Bruce Willis,I just wish that Bruce Willis could be join forces with other guys since I love him in Die Hard,but it's just three minutes with these two cameos in the movie. I liike the two villians in the movie,Eric Roberts & Steve Austin and they are the most baddest guys in the movie. I just love the way when Steve Austin was so mean and being as a baddest character and baddest henchmen. Same as Roberts,he also did good on it! The action scenes are pretty solid cool,lots of explosions,too much sounds,corky dilaogue,great edgy scenes,very greusome with blood,and pretty descent film. But it's a fun action film to enjoy,but an A to F scale film that I seen that is too crappy for an action film. It is a crappy film? Of course Yes,it's same as Commando & Rambo,First Blood,Part II. Very entertaining film,but not quite special and that's what it is. Stallone finally did okay!"
    },
    {
      "rating": "10",
      "text": "This movie defines action movies. It's not (quite) about explosions, it's not about special effects or CG, it's not about accurate warfare depiction, and it's not about drama. This movie is about The Expendables; It's about six badass dudes... Well, being badasses. That's it.\r There is nothing modern about this movie, and therefore can't do too well in the box office. Too few people these days want a genuine action movie, but I, for one, loved it. The acting was impressive for the genre and the direction was spot on. There is no reason not to see this movie, unless you find yourself at odds with the majority of human males."
    },
    {
      "rating": "10",
      "text": "One of the best old school action movies I have seen in a while. Practically team Rambo with a few characters having a back story. The critics as usual are too stuck up to see this movie for what it is, then again is there actually anyone that takes any notice of critic reviews other than to laugh at them? Throwing knives, honestly what more can I say."
    },
    {
      "rating": "7",
      "text": "The movie is as you might expect, maybe less.  The issue with an \"all star\" cast such as this is that you simply can't give the screen-time to them all.  Instead, you basically get to see Sly and Statham 90% of the time and Li, Crews, Austin, et. al. are left to steal the movie with 2-5min scenes that make the movie worth while.\"Ahrnold\" is also not looking well.  As a huge Arnold, seeing him as thin and wearing the most god aweful baggy cloths was a bit of a shock and he had to have some of the worst directing with the most unnatural reactions and oddest edit cuts.However, you of course come to see the action and there's some decent action.  The only problem I have is that it's too \"2010\" canned action.  This was suppose to be a ode to 80's/90's action films and it was anything but.A good \"2000\" action film with the typical \"look, he shot the guy and his [insert body party] blew off\" (best part of the film was arguably Terry Crews (the other Old Spice guy) and his 'loud' gun).I admit, I was coming and looking for more of the \"never reloads\", \"waves an uzi at an army and they all fall down\", \"blows up a building with a arrow and a stick of dynamite\", etc kind of 80's action.So, I was left a little disappointed.That and I can't get over Sly being 64 and trying to play a 40 year old or something.  What's wrong with his neck?"
    },
    {
      "rating": "10",
      "text": "the movie was fun.the good guys win and the bad guys die. they did one bad thing they never gave eric roberts the credit he deserved as the bad guy.other than that the movie was enjoyable,"
    },
    {
      "rating": "9",
      "text": "if you go to watch this expecting a life changing movie you'll be disappointed.if you go watch this you will however see a life affirming movie.harks back to everything that was great about 80s action.  loads of good stuff here.  great cameos, great action, big stars reviving a lost art.  loved it."
    },
    {
      "rating": "8",
      "text": "Plot... ridiculous, body count.... massive, HGH and roid usage.... hmmm, explosions.... huge. Ladies and gentlemen I give you the expendables! Awesome! Doesn't pretend to be anything other than balls to the wall fun and it delivers the goods. Those movie critics slating it should go back to watching their Kubrick-ian masterpieces and listening to their Bob Dylan whilst pretending they are holier than thou! One word of warning. Sly Stallone's general bodily and facial disfigurement can at times be disturbing"
    },
    {
      "rating": "8",
      "text": "Critics are always looking for things that the movie never pretended to offer. An exciting story with M. Night Shamylan plot twists is the only thing that gets them high marks. If you're looking for some awesome action, and want to see all the badasses together as one awesome commando unit, you've got it here! The only thing that might knock it down a few points is the shakey cam does get a little annoying. At certain points in the movie you wish they would zoom out and show a wide angle to establish their current situation. Also something in the final scene was so illogical it really annoyed."
    },
    {
      "rating": "9",
      "text": "I saw this movie last night and I wasn't disappointed in any way.  The plot of the movie is very thin but I actually thought a lot of time was taken to push the story forward.  It wasn't just all action like you may think, which I thought was good.  On the other hand, when the action does start, it comes fast and furious.  I enjoyed the banter between the characters, especially Stallone and Statham.  The dialogue was funny without being cheesy.  The big scene with Stallone, Willis and Schwarzenegger was a huge addition in my opinion even if it was only about five minutes long.  Overall, a very well done action movie and a great throwback to the movies of the 80's, like Stallone intended it to be.  If you like any of the actors or any of their previous movies, I think you would like \"The Expendables\" as well.  I eagerly await a sequel with more of everything this one had.  \"You look nervous\"-Stallone as Barney Ross, The Expendables.  I loved it!"
    },
    {
      "rating": "9",
      "text": "Not a movie for everyone for several reasons.  One of the most intense action movies out there and also one of the best.  Stallone chooses to up the action and gore instead of story in order to create a true action movie masterpeice.  Funny dialogue throughout the film and references to current and old popculture abound, which make the movie all the more like the comic-bookish action movie the critics clearly failed to identify it as."
    },
    {
      "rating": "10",
      "text": "This movie is a mans movie and a mans movie only but I think thats exactly what Stalone wanted it to be and it worked out great and had a perfect cast."
    },
    {
      "rating": "6",
      "text": "Way cheesy dialogue and tired story line but some seriously funny one liners (Jet Li is awesome).  The action scenes are what make the movie fun of course.   As long as you understand that this movie is junk food for the brain, you will enjoy it.  Oh and wow, Mickey Rourke â"
    },
    {
      "rating": "6",
      "text": "This is one the Critic's got wrong, If you went into this movie expecting a strong plot or interesting characters then you were doomed from the start, Critics fail to remember this is an \"Action Flick\" you rate it for what it is.  It's like me going into \"The Pianist\" and expecting action and when not finding it giving the movie a low scoreThis movie does what it promises and does it well thats why in my eyes It's a 8"
    },
    {
      "rating": "8",
      "text": "Filing out of the theater at 2am in a crowd full of adrenaline-fueled action movie junkies, that was all I could think about what I'd just seen, and pretty much all I was hearing from the movie-goers around me. The Expendables is the perfect midnight movie, the kind of flick that's so loaded with action, so ridiculously over-the-top, so smoothly paced and fun that it literally won't let you be tired. This isn't an epic blockbuster or a groundbreaking mind-bender. This is action, straight no chaser. And it is just... awesome. More: http://cinewise.blogspot.com/2010/08/expendables-2010.html"
    },
    {
      "rating": "9",
      "text": "This movie does what it is expected to do. Have a shallow BUT more than passable plot, and have the best modern action movie stars making a movie with the best action scenes in theaters. The movie went by so fast, but it isn't a short movie, it is just a good one. One of the best qualities this movie has is its excellent pacing. It isn't 100% action, you have a chance to breathe. Every action scene is different. One might be a fist fight, while the other is a car chase. Each action scene has its own tempo, its not all gun fire and people getting mutilated. This movie has one of the greatest action movie climaxes of all. It lasts around 30 min. and it is all jaw dropping heart pounding action, once again proving how well paced this movie is leaving the best for last.I am one of those people who believe its okay for kids at the age of 9 or 10 to starts playing M-Rated games, or watch 18A/R-Rated movies. DO NOT BRING YOUR KID OR SOMEONE ELSE'S KID TO THIS MOVIE. THEY WILL HAVE SHELLSHOCK FROM A WAR THEY HAVE NEVER BEEN TO."
    },
    {
      "rating": "7",
      "text": "What do you get when you have a film that is set in the jungles of South America and has action stars from the 80s and 90s including Sylvester Stallone, Bruce Willis, Jet Lee, Arnold Schwarzenegger, Dolph Lundgren, and every other action movie hero you can think of? The Expendables is an action film like no other.  The main characters have to go into the jungle to stop a ruthless dictator from enslaving the country. The plot felt kinda weak at times and thin like paper. However  the film was just getting started. From the first Explosion to the last bullet The Expendables sucks you into a world of action like no movie before it. The violence was over the top and there was plenty of action everywhere you looked from punches, to kung fu kicks, to explosions, and even body slams that reminded you of the ones used in WCW Smackdown. One problem was when the fighting would happen that involved any of the characters I felt there were too many fights at certain times going on at once. In one scene I counted three fights going on at once in one shot. I wish the fights would have been more spread apart rather than mushed together like peanut butter and jelly. Overall the movie does its job of being one of the best action movies that I have seen since Rambo First Blood. Be warned though theres a lot of violence in this movie so be aware of that. However if your looking for a hard hitting, gun ripping, body slamming, action extravaganza  than this film is for you."
    },
    {
      "rating": "9",
      "text": "Thank you stallone for making an action movie like the ones of decades past, where you dont need much CGI or fake muscle suits to tell a well played story of high voltage and massive explosions.  All new movies seem to be made by computers and not actors, this was a true testament to the true action fan."
    },
    {
      "rating": "6",
      "text": "A movie made entirely for adrenaline-seeking individuals who find giant explosions and unimportant dialogue entertaining. Besides some noticeable script errors and unnecessary (as well as utterly stupid) jokes, The Expendables is an action movie that is best seen in theaters, and an exciting adventure for anyone looking for a thrill."
    },
    {
      "rating": "2",
      "text": "Remember when we all thought, how cool would it be to get all the 80s action stars together in one movie. That would kick ass! Well, Stallone was the man to bring this idea to the screen and the resultsâ"
    },
    {
      "rating": "10",
      "text": "80's action has returned on explosive form.  Fantastic entertaining film that is being panned by critics taking it more seriously than it should be.................."
    },
    {
      "rating": "10",
      "text": "Seriously,i don't understand all the bad reviews.We watch Movie for entertainment,and this is the kind of entertainment i'm looking for.This movie stands out because of the actors inside.You got Sylvester Stallone,Jason Statham,Jet Li...and more.Who else do you need when all these famous action stars inside ? If you love Rambo/The A-Team kind of movies,do not let this slip past :/ This movie keep me at the edge of my seat from start till the end."
    },
    {
      "rating": "2",
      "text": "http://getyourfilmfix.com/2010/08/18/the-expendables/"
    },
    {
      "rating": "7",
      "text": "Easily one of the best movies of the year, I can't recall seeing anything like it, 'The Losers' has got nothing on this movie (not sure about 'The A-Team'). It has got loud and nut-grabbing action scenes that put a smile on your face, people that keep up with shooter games will especially enjoy this one as there are a range of well known guns that you will be looking around to spot, like the Browning Deployable, M4A1, Glock 18, and the AA-12 ;)There was a list of well known actors in the movie, though I am disappointed that Schwarzenegger did not play a bigger role, and the fact that Van Damme, and Chuck Norris were not in there. Though with the characters that were already there, a good level of detail and personality was given to each one compared to the amount of time they had. It's in a similar position as 'Transformers Revenge of the Fallen', were there are multiple characters but not enough time for each one, but in the situation of Expendables, it does it better than most movies out there.The story is not too deep but the movie is extremely fun, and that is why it deserves a 7, critics have to stop judging movies by how deep it is and stupid little details (not saying that depth is a stupid little detail), they just have to pay attention to how much they enjoy the movie, one way or another, one way being in the form of 'The Expendables' and other forms being (for example), 'Shutter Island' or '2001 A Space Odyssey'. All around I would recommend this movie to any one and a sequel would be great and I would recommend to to Stallone (who did a fare job at directing)."
    },
    {
      "rating": "2",
      "text": "Stallone's effort to recreate the heyday of 80s/90s action flicks is a tired look-alike that doesn't even meet the low expectation of sitting through a collage of high-adrenaline and explosions. What he seems to forget is that in order to make your heroes look badass you really need a good villainous plot for them to fight against. In this case, the evil bossman (I don't even remember his name, but he was played by Eric Roberts) doesn't have nearly enough motive or screen-time to develop himself as a villain worthy of the collective of action heroes. On top of that, this collective isn't even that great of a team - Jet Li and Mickey Rourke seemed like they just showed up for the paycheck because their characters are completely useless. This, along with the tired storytelling, leaves us with a movie that could only possibly be enjoyed by unwavering action aficionados who need their fix."
    },
    {
      "rating": "7",
      "text": "I have to say that this is the most violent film I've ever seen. It's also pretty humorous and now I'm considering Jet Li's character the best character ever. However, one of the expendables literally had 1 line!  This film is still great and it even features Arnold Schwarzenegger."
    },
    {
      "rating": "8",
      "text": "I enjoyed this movie. Dialogue wasn't very strong but I wasn't expecting it to be. Basically this movie was another Rambo with a strong supporting cast. I knew what I was getting when I bought the ticket and this movie met my expectations. A good amount of badassery left me satisified."
    },
    {
      "rating": "10",
      "text": "The cast is hands down probably the best ever. The movie is basicly what you except going inot it. A \"MAN\" movie. It had action, guns, explosions and motorcycles. The story was basic but we didn't buy a movie ticket to Inception so its 100% ok that the story was straight forward."
    }
  ]
}