{"id": 1265, "title": "The Craft", "starring": ["Robin Tunney", "Rachel True"], "runtime": 101, "genre": ["Horror", "Drama", "Fantasy"], "description": "A Catholic school newcomer falls in with a clique of teen witches who wield their powers against all who dare to cross them -- be they teachers, rivals or meddlesome parents.", "releaseYear": "1996", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8bW2RdRkloYtEPhbQZN4wcdmJP4.jpg", "categories": {"plot": 7.833333333333333, "acting": 8.666666666666666, "ending": 8.0, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "An official website of the film said: \"The crew had to return to the location a second time to complete filming interrupted by several weird occurrences that even caused witch consultant Pat Devin to raise an eyebrow. As the fog rolled in at midnight, the four actresses used actual Wiccan rites and language to invoke powerful forces. Then, as Fairuza Balk's character Nancy attempts to invoke the deity Manon, a flock of bats hovered over the set and the tide rose dramatically, extinguishing the circle of candles. Witchcraft consultant Devin recalls that 'Manon, a fictitious creation for the film, sounds very close to Mananan, the Gaelic god of the sea. Luckily, we weren't all swept to sea!'\" Director Andrew Fleming is quoted: \"'Every time the girls started the ceremony, and only when they would start the ceremony, the waves would start coming up tremendously fast, pounding heavily. Then, right when Nancy says her line, \"Manon, fill me,\" right at that exact moment, we lost power. It was a very strange thing.'\""}, {"rating": "9", "text": "One of the best movies of 1996. ::::::::::::::::::::::::::::::::::::::::::::"}, {"rating": "9", "text": "The craft is an effective horror ride. Neve Campbell & Skeet Ulrich are great in the movie, as are all the actors. The movie revolves around a foursome of teenage witches who go to a catholic school. They start using black magic to get what they want and soon their spells start misfiring with tragic consequences. The craft is a must see horror movie."}, {"rating": "9", "text": "One scene involved using over 3,000 snakes including pythons, boas, water snakes, garter snakes, rat snakes, and a 10-foot Amazon constrictor - even rare albino snakes."}, {"rating": "9", "text": "With the threat of a new version I decided to revisit this childhood classic of mine which actually inspired me and my friends to try goth for a couple months, or maybe it was just me, lol. Well the movie holds up surprisingly well and some part of that may be due to nostalgia but I really loved it, maybe even more than before. Robin Tunney(End of Days) stars as Sara the new girl at school who falls into a group of outcast witches after being burned by the popular kids. Once she joins the coven the stars align and they begin to experience some real power. The only problem is the maniacal and charasmatic leader Nancy played by a feisty Fairuiza Balk (Island of Dr. Moreau) gets power hungry and takes her vengeance to another level. Rachael True (Half Baked) and the always awesome Neve Campbell star as the other two members battling their own problems and insecurities. What makes the film work so well is the sisterhood and sometimes twisted friendship of these girls. They feel genuine and their stories are relatable  as they deal with every day problems ranging from rumors to racism, abuse and body issues. The witchcraft is an added bonus and unlike most films of it's kind it delivers on that aspect including a slightly short but effective finale. Christine Taylor (Brady Bunch), Skeet Ulrich (Scream) and Breckin Meyer (Clueless) also star. The film is confidently directed by Andrew Fleming of one of my favorite 80s flicks Bad Dreams with a screenplay by Peter Filardi of Flatliners. It also features an amazing soundtrack with songs by Our Lady Peace, Letters to Cleo, Love spit love and more. I'm sure who's ever reading this has a love for this film as I do, so maybe it's time for a revisit.Budget: $15MBox Office: $55.6M9/10"}, {"rating": "9", "text": "The Craft is one of my fave horror thrillers. The cast is top notch as are the special effects. This is a movoe you have to see ASAP, if you have not already."}, {"rating": "9", "text": "One scene involved using over 3,000 snakes including pythons, boas, water snakes, garter snakes, rat snakes, and a 10-foot Amazon constrictor - even rare albino snakes."}, {"rating": "9", "text": "There is foreshadowing early in the film to Chris Hooker's (Skeet Ulrich) fate later on in the film. When Sarah goes to watch him practice football his jersey number is 86. Eighty-sixing is a slang term for getting rid of something or someone, reject, discard, or cancel."}, {"rating": "9", "text": "Plot holes Nancy Downs is very poor and living in a trailer, yet she goes to an expensive private school in Southern California."}, {"rating": "9", "text": "One of the first films to use Kodak's EXR 200T 5287 film stock. Cinematographer Alexander Gruszynski had been planning to use it sparingly, but liked it so much during tests that he decided to shoot most of the film with it."}, {"rating": "9", "text": "akdmfffkekskekekdkdkdkdkdkdkdkekekekkkkkkkwnkqjjiicnskmfmggknhthoolkdodmsomqkqmsksmk"}, {"rating": "9", "text": "^^^^^^^^^^^^^^^^^^^^^^^^^^^^^_^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^_^^^^^^^^______^^^^^^^^^^^^^^"}, {"rating": "9", "text": "This was the first Neve Campbell feature film to have a huge worldwide release. °□°□°□°□°□°□°□°•°°°□°□°□°□"}, {"rating": "9", "text": "\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"••••••••••••••••••••••••••••••••••••••••••"}, {"rating": "9", "text": "Character ErrorIn the French lesson, the teacher wrote on the board \"Si vous aviez faites vos devoirs, vous comprendriez\" (which means \"If you would have done your homework, you'd understand\"). Actually, it is supposed to be \"Si vous aviez FAIT vos devoirs, vous comprendriez\"."}, {"rating": "9", "text": "Storyline A newcomer to a Catholic prep high school falls in with a trio of outcast teenage girls who practice witchcraft, They need a quartet so their spells will work. They then conjure up various spells and curses against those who cross them."}, {"rating": "9", "text": "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡"}, {"rating": "9", "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "9", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_==_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_="}, {"rating": "9", "text": "++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "9", "text": "aodmdosmsodmd+×÷=/_€£¥₩@#()$%^&*-\":;!?,.`~|{}[]▪○●□♤♡◇♧☆⊙°•¤《》¡¿`````````▪○●□■▪○●□■.............."}, {"rating": "9", "text": "♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♡♤♤♤¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿¡¿>>>>>>>>>>>>>>>>>>"}, {"rating": "8", "text": "[][][][][][][][][][][][][][][][][][][][][][][][][][][][]!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,.!,"}, {"rating": "8", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷$$$$$$$$$$$$$$$$$$$$"}, {"rating": "8", "text": "MisunderstoodSome reviewers seem to have the wrong idea about this film. It is not supposed to be scary, not in the traditional sense anyway. The 90's brought a resurgence of teen horror and comedy movies onto our screens. 90% of these are awful, but this one was different. The Craft refuses to be labeled as horror or comedy, but has strong elements of both, and it is more akin to Heathers, than any other recent film. Campbell is as gorgeous as always, and her performance is good, Balk is superb, while the rest of the cast is respectable, and both the script and effects are sharp, giving the movie a darker tone than any of its contemporaries. The clichés are there, with the outsider becoming the hero, and the non-conforming females of the period show they can be happy and free. If happy means Goth. Forget your knowledge of magic if you have any, and your preconceptions about teen movies, because this one is cool, dark, entertaining stuff. ☆☆☆☆ out of ☆☆☆☆☆"}, {"rating": "8", "text": "+×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++×÷÷×++@÷÷×++#☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆◇☆⊙☆⊙☆⊙⊙⊙⊙⊙☆⊙☆⊙⊙"}, {"rating": "9", "text": "----------------------------¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "9", "text": "______________________________________________________________________________"}, {"rating": "9", "text": "...............treerrftgedssgnjhhh+×÷=_€£()*&^%$#@\":;!?,▪○●□■☆⊙°•¤《》¡¿♤♡◇♧{}[]~`●●■■○○▪▪☆☆⊙⊙•¤》"}, {"rating": "9", "text": "°°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》》¡》¡》@;@;@@;;@;@;@;@;@;;@;@;@;:@@::@@:@:@:@;@;@;@;@;@;@;@;;@@;"}, {"rating": "9", "text": "In the scene as the four girls enter on to the beach to invoke the spirit they each carry an animal familiar that represents themselves or their wants. Rochelle carries a clown fish - her hobby is diving and the pool is featured where her bully Laura-Lizzie bullies her. Bonnie carries a butterfly - it represents beauty this is in reference to her scars. Sarah carries a budgerigar - a budgerigar is also related a \"Love bird\" which is what she wanted Chris to be in love with her. Nancy is a snake - A snake is rebirth and renewal as Nancy wanted a better life for herself and her mother including power and being a leader."}, {"rating": "9", "text": "$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$%$$%$%$%$%$%$%$%$%$%$%$%$%$$%$%$%$$%$%$%$"}, {"rating": "9", "text": "&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&=&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+&+"}, {"rating": "9", "text": "\",\",\",\",\",\",\",\",\",\"..\".\".\".\".\".()()()()()()+×÷=+×÷=+÷÷=,》》¡¡¡¡¡¡°°°°°●●●●●●■■■■■■■{}[]{}[]{}[]{}[]{}[]°"}, {"rating": "9", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:::::::::::::::::::::::::::\";\";\";\";\";\";\";\";\";\";\";\";\";\";\""}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°°"}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"}, {"rating": "6", "text": "Group of girls bond over their interest in magic, use a love potion on a guy, make a girl's hair fall out, give a wife-beater a heart attack and then, fall out with each other."}, {"rating": "9", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡°¡°¡•¡•¡°¡•¡•¡•¡•¡•¡•¡•¡•¡°¡•¡•¡•¡•¡"}, {"rating": "5", "text": "Some of the effects were good and some were pretty ropey. Look at the floating scene and then look at the colour-changing hair scene. Worlds apart in terms of convincing! Watched in stereo and it was fine. Nothing notable. This is not scary or shocking! It is a bit gross. It is also a teen movie. It has a lesbian feel. The main girls are sometimes great but other times annoying. I found some plot turns very forced. It is a predictable cliché of a witch movie that fails to make a good impression. Not that great at all. Reminded me of a TV-movie made for SyFy."}, {"rating": "8", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "8", "text": "A Suspenseful and Creepy MovieThe Craft isn't a new story about Witch Craft among girlfriends but enough twists, surprizes, effects to rise above most. Very well done by all especially Robin & Fairuza. Very well done effects and the Good vs. Evil conflict really kept you in the movie. Great to see in a theater or on a large screen TV."}, {"rating": "8", "text": "Has surely held up!You know, I love the movies Ideal Home and Bad Dreams. I'd never guess that they were both written and directed by the same person, Andrew Fleming. You may not know the man, but chances are you know his 1996 film, The Craft.Producer Douglas Wick (he produced Stuart Little and also co-wrote the sequels) wanted to create a movie that mixed the high school experience with witchcraft, which he worked on with screenwriter Peter Filardi (Flatliners). Well, he sure did it. This is a movie that was a quiet hit but has never gone away. Take it from someone who has dated plenty of goth girls.Sarah Bailey (Robin Tunney, wearing a wig as she had shaved her head for Empire Records) is the new girl in town, having moved from Los Angeles to San Francisco with her father (Cliff DeYoung, Shock Treatment) and stepmother. She soon becomes friends with a group of outcasts who are rumored to be witches: the scarred Bonnie (Neve Campbell), trailer trash and totally awesome Nancy (the legit Wiccan Fairuza Balk, who was also in Return to Oz) and Rochelle (Rachel True, CB4), whose black skin in a nearly all white school makes her a target of ridicule. The witch rumor? Yeah, it's true. They all worship an entity they refer to as Manon.Sarah becomes attracted to the popular Chris Hooker (Skeet Ulrich, who was very much a thing in 1996), but he claims that they slept together and ruins her reputation before it gets started. That leads to the girls finally completing a big spell that gives them everything they want: Chris falls in love so hard that he can't live without Sarah, racist bully Laura Lizzie (Christine Taylor) loses her hair and popularity, Bonnie becomes gorgeous and Nancy's abusive stepfather dies and she gets rich.However, it's not enough. After a rite called the \"Invocation of the Spirit,\" Nancy gains even more power because, you know, she got hit by lightning (actual Wiccan Pat Devin was the on-set advisor, so maybe this really does occur). Now she can't be stopped and all of the girls other than Sarah have gone wrong. The coven turns on her, but Sarah ends up stronger than all of them.Of course, Blumhouse is remaking this, with Zoe Lister-Jones directing. There was talk of another remake and a direct to video sequel which never happened. I had hoped that that luck would have stopped this new version, but it's already finished production.I learned a really important lesson from The Craft. The girl I was dating at the releasal of the movie, asked me which member of the coven I found most attractive. I said none of them. She kept pressing and begging for my answer. Of course Fairuza Balk is the right answer, but I kept quiet until finally, after an entire meal of her asking, I told her. She instantly grew angry and said, \"The right answer is none of them!\" Somewhere inside this story is a lesson.I love the scene where all the fish wash up and the coven realizes how much power they possess. You don't know how many occasions the women in my life have made me watch this movie. I have become smarter and not said a single thing about Nancy."}, {"rating": "8", "text": "The best movie about witchcraft everAlong with The Witches of Eastwick. This tells a very entertaining story about 3 beautiful girls and Fairuza Balk who get into witchcraft and find out that power corrupts. The effects are great and so is the acting. I just wish it didn't get so dark near the end."}], "recommendations": ["monte_carlo", "little_monsters", "labyrinth", "tooth_fairy", "the_space_between_us", "sky_high", "darkness_falls", "young_adult", "mama", "home_again", "endless_love", "colombiana", "the_rite", "mirror_mirror", "the_hunchback_of_notre_dame", "you_again", "13_going_on_30", "footloose", "the_house_with_a_clock_in_its_walls", "fifty_shades_freed", "greta", "knock_at_the_cabin", "cruel_intentions", "bride_wars", "moonrise_kingdom"]}