{"id": 4280, "title": "The Eagle", "starring": ["Channing Tatum", "Mark Strong"], "runtime": 114, "genre": ["Adventure", "Drama"], "description": "In 140 AD, twenty years after the unexplained disappearance of the entire Ninth Legion in the mountains of Scotland, young centurion Marcus Aquila arrives from Rome to solve the mystery and restore the reputation of his father, the commander of the Ninth. Accompanied only by his British slave Esca, Marcus sets out across Hadrian's Wall into the uncharted highlands of Caledonia - to confront its savage tribes, make peace with his father's memory, and retrieve the lost legion's golden emblem, the Eagle of the Ninth.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/e7rcJQWplGZWz57yGlP87rlPmI.jpg", "categories": {"plot": 7.0, "acting": 6.6, "ending": 7.166666666666667, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 7.0, "action": 7.5}, "reviews": [{"rating": "8", "text": "I don't know about you, but im often bored of the formulaic samey slow motion action flicks that seem to be churned out (and hey i really enjoy a good action flick). Id class this as more of an action/ adventure - interestingly shot, and with a great atmosphere - which sticks surprisingly well to the plot of the book - helped by some decent acting."}, {"rating": "6", "text": "I'll simply say that Shiira's review (below) is awesome.  Long-time user reviewer on the site - excellent work.  I enjoyed the movie, but scoring it is tough. It seemed to have some pacing problems, but the tone and feel of the movie were pitch-perfect.  Tatum was born to play the role, and Jamie Bell is perfect as the slave-turned-friend.  I don't think I'd easily recommend this film to friends, but I enjoyed it."}, {"rating": "7", "text": "No mincing of words, this slave, who tells the Roman centurion in second century terms that he doesn't want to be friends. No uttering of thanks is coming forth from the northern tribesman, this Caledonian lad, only vitriol, which has been compounding itself over the intervening years with new each new increment of loss life at the hands of his people's long-standing enemy, \"The Empire\". \"I hate everything you stand for but I must serve you,\" Esra(Jaime Bell) begrudgingly tells Marcus(Channing Tatum), the day after the Roman saves the slave's life in the amphitheater, where the centurion prevents a one-sided gladiator match from taking place. Possessing the power to determine life and death, Marcus gives the thumbs up sign, swaying the other spectators to do the same, therefore sparing Esra from being hacked to pieces by an executioner-sized man swinging an executioner-sized axe. It's the young boy's lucky day: a pacifist Roman? Was there such a thing? No. This is an anachronism. The Romans were as bloodthirsty as they come, an unconscionable bunch. \"You have stolen our lands, killed our sons, and defiled our daughters,\" shouts the spokesman of an angry mob, who hold Marcus' patrol hostage, and instigates a fight in which we gravitate toward the centurion, and root for his survival, even though we know the Celtics have a right to their rage. The politics in \"The Eagle\" is tricky; it's pro-Imperialism. These Roman soldiers were depraved and incorrigible, responsible for countless crimes against humanity, and yet the filmmaker has the audience backing up this omnipotent regime in their attempt to signify their imperialism by capturing the legion's eagle standard back from the Seal People, a Pictish tribe up north. Against the backdrop of an unofficial holocaust, \"The Eagle\" has the gall to concern itself with Marcus' angst, the shame he inherits from his militaristic father, who twenty years earlier, lost a campaign against the Seal People, in which the Legio IX Hispana(Ninth Spanish Legion) and its gilded bird went missing.\"The Eagle\", based on the 1954 historical adventure novel \"The Eagle of the Ninth\" by Rosemary Sutcliff, is a throwback to that unenlightened era, whose denizens still subscribed to the manifest destiny principle, as it was reflected in its racist westerns, where Indians were slaughtered wholesale by cowboys without the moviegoer ever batting an eye. In Esra, the film has in its employ a morally compromised character to fulfill the retrogressive ideology of the movie. At the killing grounds, where the elder Aquila's legion was slaughtered, we're supposed to be horrified by the brutality enacted by the tribesmen, who, according to Guern(Mark Strong), a legionnaire survivor, had  \"hacked the feet off the dead so they couldn't walk in the afterlife.\" His words strongly recall those of Ethan Edwards(John Wayne) from John Ford's \"The Searchers\", a rhetoric that forces the moviegoer to associate the racism of the cowboy with the Scottish rebels, which positions the Romans as Indians, the victims of a despicable act, and the Pictish tribes as cowboys, the cold-blooded killers. Although the slave is prejudicial toward the Roman Empire, whose waves of marauding armies had decimated so many families like his own, the orphan joins forces with Marcus, adopting and internalizing the centurion's quest for familial redemption, and the moviegoer is supposed to accept this unilateral shift in loyalty as a byproduct of the deepening friendship between the two disparate men. That's because \"The Eagle\" merely tells us about the violence that the Romans practiced on the the wild Brits, whereas the film shows us Roman skulls, Roman bones, which has a visceral impact on Esra, we assume, since it has a visceral impact on us. Rome ends up looking like the victim. \"The Eagle\", in actuality, a western dressed in a historical epic's clothing, reimagines a \"Dances with Wolves\" that dances with hunters, where the Indian lives in isolation among the American soldiers and participates in the genocide of its own people. In a nutshell, that's what Esra does when he befriends Marcus. Marcus is like Dunbar, the union soldier played by Kevin Costner, in which the centurion has the same innate kindness and humanity, but here, these benevolent attributes are in service of the colonizing faction. \"The Eagle\" sides with the empire by overemphasizing the barbarity of the indigenous people(just like an old western), most emphatically, when the Seal father slits the throat of his young son after he allows the prisoners to escape. This indescribably cruel act gives Esra the impetus to remain with his natural born enemy. By becoming a Roman, he'll become civilized."}, {"rating": "3", "text": "This movie sucks, it was just that boring, and am actually surprised it got such a high rating on here, 56 is a huge stretch. I got dragged into this movie because I did not want to see The Roommate. I came into the movie with no hype or anything and expected an alright movie, and all I got was a drool fest, generic, piece of **** acting movie."}, {"rating": "0", "text": "Messy plot + pointless cause=Horrible Movie. The Eagle + good writing=what the f*ck are you thinking. One of the worst films ever."}, {"rating": "6", "text": "The Eagle feels a little amateurish in parts.  The acting and writing is not stellar, and the battle scenes with the camera moving all over the place is ridiculous.  You cannot tell what is going on during the battle scenes.  However, I did feel there was good chemistry between the two leads, and the main crux of the story is the loyalty and trust between master and slave.  The best part of the movie is when they are captured by a barbaric tribe, and the master becomes the slave and vice versa.  It can be slow moving in parts, but I was not bored.  Donald Sutherland was a waste - he has a small role and his character is never developed enough to give him much personality.  Another plus, however, is the beautiful countryside where the movie was shot.  Overall not bad, but could have been better."}, {"rating": "10", "text": "A+With morals and plot devices that have been sadly lacking in cinema for the past ten years, The Eagle is a true epic.The movie takes place about ten years after the (real) event titled the \"Lost Legion,\" where an entire legion of Roman troops in the post-Christianity era (117 AD) \"vanished\" after marching into unfriendly terrain in Northern England. Marcus Alquilas (now we are talking fiction) is the son of the Roman general who commanded the legion at the time of their demise(?); and he is distraught over the loss of his father, respect for his family, and the honor of Rome. Brave and intelligent (if nearly-mad with his obsession), Alquilas rises through the military ranks and is offered a variety of posts throughout the empire--not surprisingly, he chooses the northernmost fort to Hadrian's Wall, a barrier built to block off the upper half of England after the events of his father's command. After an injury, Alquilas needs an aid for recovering. His kindly uncle then gives him Esca, a slave Alquilas rescued from a lopsided gladiatorial combat. Recovering, Alquilas decides he will depart to the uncharted area on the other side of the wall. With Esca as his guide, Alquilas steadfastly pursues his goal of finding the Eagle of the Ninth, a treasured golden standard of the Lost Legion shaped like a chicken. No, actually it looks like an eagle.While I understand Focus Features' reasoning, it is sad that a movie with this merit and talent behind it got released with little fanfare in a time of year not associated with great films. No one who watched the trailer would know this is from Jeremy Brock and Kevin Macdonald, the writer-director team behind Oscar-nominee The Last King of Scotland. The book it is based on (Rosemary Suttcliff's The Eagle of the Ninth) is considered critically acclaimed classic. Channing Tatum (G.I. Joe, Dear John), a very underrated actor, plays Marcus, while BAFTA nominee Jamie Bell (Billy Elliot, Hallam Foe) plays Esca. Also worth noting is that The Eagle''s cinematographer is Anthony Dod Mantle, who did the Oscar-winning work on Slumdog Millionaire.All the talent comes to good use. The movie is surprisingly old-fashioned--promoting honor and nationalism over liberty and personal-gain. It also deals with many dark issues without becoming unnecessarily grim. This is probably much due to the fact that the book is from the 50s; it is still impressive, though, that a 2011 film about ancient Rome managed not to be anarchistic. Even better, the movie has powerful morals which (while probably not discussable in a spoiler-free review) definitely make this better than most Academy Award-nominees.The movie's action scenes are slightly disjointed, probably due to the fact that the movie seems to really not want its PG-13 rating. Still, there are so many fight sequences (the movie keeps away from any tacked-on romantic subplots) I am sure that the action crowd will be pleased if they attend. Best of all, though, is the fact that this is not mere popcorn-fare: The Eagle is a moving epic in the vein of Ben Hur.Powerful morals, an exciting plot, and a well-crafted story make this cinematic experience exceptional."}, {"rating": "5", "text": "Despite its potential, \"The Eagle\" adheres too closely to formula and is driven by stunted dialogue with sparse action scenes that do little to keep it interesting as well as a cast that aren't up to the material. It's the type of film that may have thrived in the '90s and been nominated for lots of awards, but instead ends up being one that may finally retire an overused genre."}, {"rating": "7", "text": "A surprisingly solid, at times near-great film, one with a clear unapologetic drive, purpose and execution that you rarely get these days. Not every historical movie is supposed to be muddled with every last subject depicted as monstrously dasdardly. Sometimes it's ok to have a clear story. So thoroughly enjoyed this film and I wish directors had the balls to make more of these. Also 1000 extra bonus points for being one of the very, very, very few not to have dumb romance plots thrown in to appease the romance mandate for every film."}, {"rating": "8", "text": "The Eagle was a very thrilling movie, that brought all that it promised and more. It brought a good share of action, as well as a plot that would make since for the time period. The characters were relatable, and had a good chemistry with one an other. The main reason that I mark this movie down was because the way they spoke. The dialogue was far to modern for the time period. Other then that and the somewhat abrupt ending, a very exiting movie that's worth the watch."}, {"rating": "5", "text": "Tatum feels emotionally unattached and never quite connects, making the  whole project a bit of a bore.  He should not be  casted in anything that does not address teen girls.  And the depiction of the Scotts seemed odd - more like the men in the Amazon in Apocalypto."}, {"rating": "6", "text": "Channing Tatum stars as a Roman soldier on a quest with Jamie Bell, who plays his \"body slave\" (insert appropriate homoerotic comment here). Even with the historical histrionics, Tatum turns in an earnest performance. The film is shot with an artful eye: lots of beautiful scenery and interesting setups. However, the battle scenes are a useless blur that's edited in a confusing frenzy. Overall, the film is a competent effort in the genre."}, {"rating": "8", "text": "The Eagle is well worth the price of admission. The plot is slow moving at first but it keeps you wanting more as do the action scenes where is concentrates more on the battle then blood and gore.the pace of the movie again is slow at some parts as they try to introduce ever one.  But  hopefully by the end of the Eagle it will make you beg for a prequal as it did for me."}, {"rating": "8", "text": "Great film where Jamie Bell once again proves himself as one of the World's most underrated actors. The film is there between Gladiator and things like Troy. Far better than Troy, Alexander etc with greater emotional ties to the characters and a more engaging story. Not as powerful or profound as Gladiator however. Went into the film with little expectations and was pleasantly surprised. The cinematography and scenic sets are breathtaking alone in High Def.Thoroughly enjoyable and watchable numerous times. This film Soars like the bird of prey it name-checks!"}, {"rating": "7", "text": "Better than I thought it would be.  The action was pretty good and it was nice to have a movie without all the CGI and 3D.  The scenery was nice, the acting was not too bad, and the story was interesting enough.  The ending was disappointingly trite, I could have done without the walk off scene which was really dumb and almost ruined the movie for me, but otherwise an OK movie."}, {"rating": "8", "text": "This film is about what symbols mean to soldiers. They mean more to them than civilians will ever know. The eagle is a film that shows this brilliantly. It is well film and surprisingly well acted. Be warned however, this is by far the bloodiest pg-13 film I have ever seen. The ending kinda was cliche, but  the screen with Channing Tatum holds up the eagle before a \"last stand\" battle is incredibly moving. Well worth a rental or trip to the movie theater!"}, {"rating": "8", "text": "Predictable? Yes. Suspenseful? Perhaps, at times. I found it to be engaging despite the aforementioned qualities. Having lived in a similar type environment allowed me to engage in the characters revealed and the terrain on which they lived. The seal people creation is historically inaccurate on so many levels but it is a movie and such depictions, IMHO, should be permitted for the sake of entertainment provided it doesn't slam any obvious group of people or culture. There was a nice strong, masculine bond between lead characters and the non use of profanity was a welcomed rarity. I have friends who have watched it multiple times. Once was good for me, however, I did enjoy the experience."}, {"rating": "4", "text": "Not much that is good that I can say about this movie. There are long periods of nothing that make you want to go to the grocery store for more popcorn. The lines are absurd at times. And I am still trying to understand how a handful of Romans, who had aged more than 20 years, killed many times their number in much younger seal people. All in all this movie wasn't even a good waste of time."}, {"rating": "10", "text": "This was a huge disappointment for me, I was hoping for another Ancient Rome based movie to compare to Gladiator.  The movie starts off well, with a little bit of suspension.  But as it goes on it keeps on going down, it just became a generic/cheesy/horribly acted movie.  Especially when the main character meets up with his father's old soldiers and that point I was ready to walk out of the movie theater (and i did indeed see many people leaving).  The only commendable thing is that it had very beautiful landscape shots."}, {"rating": "6", "text": "Passable action/buddy movie with a good storyline but poor cliche ridden acting. The action scenes are good but sparse. It could have been so much more."}, {"rating": "4", "text": "The Eagle starts well - director Kevin Macdonald is clearly concerned with providing the viewer with an immersive, authentic historical world, and the details of the everyday life of a Roman soldier are fascinating to witness. Channing Tatum's Marcus Flavius Aquila also begins the film as a well-developed, compelling protagonist. Where the film begins to falter is somewhere early in the second half. Allegory between the actions of the Romans and the modern American military is heavy-handed and unsubtle, and the representation of the main Pict tribe as very akin to Native Americans is more than a little jarring. What is also laughable is the completely blatant homoerotic subtext between Marcus and Esca (Jamie Bell). The Eagle could have been a clever, compelling and believable historical epic, but instead is overburdened with pretentious intellectual baggage and some drastic misjudgements in tone."}, {"rating": "6", "text": "Hadn't it been for the plot, scenery and tremendously Jamie Bell, this movie would have been a disaster. The lead guy was just awful to watch, so unconvincing, so general. Jamie Bell did a much better role, although he didn't receive the spotlight."}, {"rating": "8", "text": "I don't really understand much of the negative reviews towards this movie. People really expect to much and it seems like a movie isn't praised unless it has a 200 million dollar budget with top line actors and some crazy over the top special effects. This movie had a great atmosphere, some heart wrenching scenes and a great plot. Not the best movie I've ever seen but far from the worst."}, {"rating": "5", "text": "Halfway-decent Roman film with some good visuals but boring characters and muddled plotting."}, {"rating": "6", "text": "This movie is alright. It's aimed towards a target audience so if you are not part of the fans who love Gladiator, braveheart and movies of the like, then you might find this film luke warm, but if you do like those movies, you will love to add this film as another anglo-saxon/roman genre movie to your collection, the movie starts off well with a couple of well done fight scenes, moves on with some travel which many other reviews have panned as boring, which is rubbish because travel time is a necessity, see movies like The Lord of the rings. Simply put, This movie is not as good as some of the greats mentioned earlier, but is not poor in quality and un watchable. It's simply an alright movie, which you would likely watch if it was on tv at the time, but probably wouldn't be your first thought when choosing something to watch"}, {"rating": "5", "text": "I actually really enjoyed this film. I had very low expectations, but I was completely surprised. Obviously, this is no Gladiator or Braveheart, but the film still was enjoyable and entertaining.  I still am not not a Channing Tatum fan, but he and Jamie Bell were fine here. The acting did not appear bad to me by any means. It was definitely only decent at best, but where the acting lacked, the film made up for it with other elements.\rI liked the story. It was a bit cheesy, but I think it was told in a good way and was executed very well. Also, I thought there was a nice blend of story and action. This easily could have been a low budget gore fest. Overall, this is a good movie. I liked it and I'd recommend it!"}, {"rating": "7", "text": "A strong cast, top tier cinematography and high production value breathe life into the story of a young Roman soldier's journey to restore the lost honour of his father by travelling across enemy territory with only his slave companion. In such an oversaturated genre there is little original material to be found but the quality is such you can easily forgive it's shortcomings. Very entertaining watch."}, {"rating": "7", "text": "Easily one of the best 2011 movie because of is action and his goos acting.There is some good characters and good fight scenes.The only thing i didn't like is that there is not enough action."}, {"rating": "8", "text": "I was shocked seeing the bad reviews over this movie, i freaking love it. They really should make more epic journey's like this in roman style. The visuals are great, the actors do a good job. That it takes place in england adds even more flavour to the movie. The ending could have been better but overall this is a movie that i have revisited a couple of times because it is just very good"}, {"rating": "7", "text": "Un péplum qui se passe en Bretagne (la Bretagne du temps des Romains, pas notre Bretagne communiste à nous...) où l'on suit un jeune centurion qui veut retrouver l'Aigle de la Neuvième pour restaurer l'honneur de sa famille et la gloire... sauf qu'il y va tout seul ou presque, par delà le mur, ultime frontière entre l'Empire (de la civilisation romaine) et les barbares, indigènes du cru particulièrement féroces...L'histoire n'est pas forcément crédible (ou si peu) et sort vers la fin quelques lapins de son chapeau : on en reste coi d'incrédulité...! Elle fait en tout cas la part belle à l'aventure pour un péplum pas comme les autres dans des paysages écossais magnifiques, servant de cadre au poids des boucliers, au choc des glaives et à la culture du pas_vivre_ensemble. Les barbares sont de vrais sauvages et font honneur à leur légende hargneuse, cette partie de l'île d'Albion jamais conquise et qui a résisté encore et toujours à l'envahisseur...Quant aux Romains, leur légende est bien rendue elle aussi par le truchement de cet aigle, symbole de la puissance de Rome, de son engagement et de sa fierté. Discipliné, courageux, ambitieux, c'est ça un vrai légionnaire mon petit gars ! Ainsi, le film s'appuie sur des stéréotypes mais le fait bien et si le détail historique en fera tiquer plus d'un, le spectacle le remplace par son emphase.Dans le rôle du centurion, Channing Tatum, bellâtre pataud de son état est beaucoup moins insupportable qu'on aurait pu le craindre : il est d'ailleurs la plupart du temps presque convaincant grâce à son personnage bien écrit ; Jamie Bell dans le rôle du Breton s'en tire bien mieux, ainsi que plusieurs seconds rôles.La musique signée par deux inconnus au bataillon participe à cette étrange ambiance, souvent mystérieuse, soulignant le désarroi de ces Romains qui n'en mènent pas large tandis que les sauvages, eux, courent plus vite que deux canassons (ça doit être ça la potion magique).La réalisation est très correcte sauf dans les combats... l'on a cru bon en effet d'attacher les caméras à des pruniers et de les secouer ensuite dans tous les sens... J'ai déjà vu pire à dire vrai mais ici, on est pas loin du pire en la matière !L'ensemble n'en demeure pas moins très sympathique malgré ses défauts évidents... On ne s'ennuie jamais et il se révèle à notre grand étonnement une bonne surprise, fournissant au genre un film moins superficiel que d'habitude."}, {"rating": "5", "text": "This film is based on a mystery that has long intrigued historians: the uncertain fate of the Ninth Hispanic Legion (Legio IX Hispana). Founded in the Republican period, it participated in military actions such as the Gallic Wars (under Julius Caesar), the Battle of Pharsalus (where Caesar crushed the troops of his rival, Pompey) and the Battle of Camulodunum, where the British tribes, led by famous Queen Boudica, resisted the attempt of conquest by the Romans. It appears that this legion, which for a long time integrated the Roman garrison in the British Isles, was transferred in uncertain date to Nimegue (Noviomagus Batavorum), where it was suppressed. However, the doubts persist, and it is upon them that the film works, proposing the idea that the legion was crushed in a disastrous battle against the barbarians. An idea that existed in the historical community but is now considered improbable. Its likely that the film was also inspired by a totally different event, which was the disastrous Battle of the Forest of Teutoberg, where the German tribes crushed two Roman legions.The script is pretty good but it lacks logic when we look at what the Roman mentality was like at this time. There is clearly a current approach behind how actors behave, especially the protagonist, but I am able to excuse this. The best advantage of the script is its ability to tell the two perspectives of the story (the conquerors and the conquered). About the historical veracity of the script, I confess, I have some doubts. It seems to me that the Roman military uniforms used here are closer to the Republican period than to an average imperial period. I found the British tribal costumes interesting. Channing Tatum was competent and satisfied us as the protagonist, even though he did not shine. Donald Sutherland also remains in this middle line, without shine or disappoint. Jamie Bell is, perhaps, the most prominent actor here, in that he has played the most difficult and psychological character of the film in a moral, psychological and relational way.In short, it's a movie that delivers on what it promises and it has high-quality notes, without ever becoming grand or memorable. Above all, it entertains quite well and gives us an appealing story, good action and fighting scenes that do not let us sleep in front of the screen."}, {"rating": "7", "text": "The background to this story is as fascinating as any involving ancient history. It’s the search for the lost Roman Ninth legion - 500 Centurions who vanished in the highlands of Scotland in 140AD – just one of the events that prompted the building of Hadrian’s Wall. The look of this movie is sumptuous with good direction, cinematography by Anthony Dod Mantle (Heart of the Sea ’15) and reasonable performances. The script tends to amble between historical drama, mythological adventure and master/slave buddy story, mostly it succeeds but has tendencies to losing its way. The locations in Scotland and Hungary are stunning, with actions scenes that make you realise how deadly painful these ancient one-on-one battles were. The main asset to this production is the evocative music score by Icelandic composer Atli Orvarsson who captures the beauty, brutality and haunting atmosphere of the landscapes and human moments – Other assets; CGI is not overused and, it doesn’t outstay its welcome, clocking in at under 2hrs."}, {"rating": "8", "text": "Solid acting, realistic settings and plot (perhaps excluding some northern tribes' mud face masks and hairdos as if they were from another continent far south). Being based on an actual novel, the narrative is rich and the action will keep you engaged throughout."}], "recommendations": ["centurion", "hostiles", "master_and_commander_the_far_side_of_the_world", "allied", "the_last_duel", "enemy_at_the_gates", "the_monuments_men", "valkyrie", "12_strong", "captain_america_the_winter_soldier", "king_arthur", "anthropoid", "red_tails", "the_magnificent_seven", "troy", "hellboy_ii_the_golden_army", "the_last_samurai", "wonder_woman", "the_great_wall", "news_of_the_world", "13_hours_the_secret_soldiers_of_benghazi", "conan_the_barbarian", "pearl_harbor", "captain_america_civil_war", "lord_of_war"]}