{
  "id": 3353,
  "title": "The Art of Racing in the Rain",
  "starring": [
    "Milo Ventimiglia",
    "Kevin Costner"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Romance",
    "Comedy"
  ],
  "description": "A family dog - with a near-human soul and a philosopher's mind - evaluates his life through the lessons learned by his human owner, a race-car driver.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mi5VN4ww0JZgRFJIaPxxTGKjUg7.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 7.166666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 5.0,
    "funny": 6.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I could smell the stink of cliches from miles away but I gave it a chance and trust me: I'm a dog loving person, I have four but this story is incredibly predictable and to make matters worst it uses one of the elements I hate the most in films which is emotional manipulation and it hits you hard with it.I'm aware a lot of people will find it emotive and I know it because the story is crafted that way but that doesn't connect with me at all and therefore the whole thing becomes irrelevant.Special mention for Milo Ventimiglia and Amanda Seyfried because both of them tried to make things more enjoyable, while Kevin Costner as the dog's voice contributes very little. It could have been any other actor and it would hardly have made any difference."
    },
    {
      "rating": "2",
      "text": "We're not sure if there's one producer in Hollywood who keeps making these magical talking dog movies or if there's an entire cadre of them. Either way, we wish they'd stop."
    },
    {
      "rating": "0",
      "text": "Heres a spoiler. It's a terrible movie. So many like it exist and this is just one more in a pool of garbage that pollutes everything it touches. Fact: Enzo is more dog than a person. Fact: Dogs cant drive racecars."
    },
    {
      "rating": "10",
      "text": "If this film doesn't put your emotions to the test then you don't have a sensitive bone in your body. By far the best movie I've seen this year. Please ignore these absurd negative reviews. The acting was superb, the scenes well directed, and the cinematography was outstanding. GO SEE IT AND BE SURE TO BRING LOTS OF TISSUES. YOU'LL THANK ME LATER  :)"
    },
    {
      "rating": "10",
      "text": "Puede que parezca ser la simple y típica película de un perro y su amo, pero en realidad está mejor construida y desarrollada que la actual La razón de estar Contigo, que si bien es buenísima, la de Enzo me parece mas realista, mas cruda y seria con oportunos toques de humor, con personajes que amarás y situaciones que te llegan directamente al corazón. Para mi es de las mejores del 2019 sin duda alguna."
    },
    {
      "rating": "7",
      "text": "Did not read the book, but Jesus Christ does this movie just go and not stop. I went in with absolutely no expectations, and was pretty surprised by how much I ended up invested."
    },
    {
      "rating": "7",
      "text": "The thing about the cliche's in this movie is that even when you see them coming, it doesn't make it any less sad.  While it definitely has it's flaws, \"The Art of Racing in the Rain\" injects meaningful life lessons into this formulaic tear-jerker. If you've ever loved a pet dearly, this movie is for you"
    },
    {
      "rating": "9",
      "text": "I don't think the negative reviewers here ever read the book, so if they didn't you can't take much heed in their comments. The film actually follows inline with the book quite well.  I really appreciate the fact that it doesn't divert from the original story, unlike my favorite book, \"Ready Player One\".  That movie was a bit of a train wreck for me and I really love SciFi and gaming. I only reserve a 10 for exceptional movies that really leave me remembering scenes or lines like Shawshank.  The film will probably leave you emotional, but a good movie can do that."
    },
    {
      "rating": "8",
      "text": "Framed from the point of view of man's best friend, The Art of Racing in the Rain is a pretty good movie about a man fighting for his family.  The framing device reflects similar movies, such as A Dog's Journey, and - as with that one - is only used to set an outsider's perspective for the actual story.This movie may be better suited for a direct-to-video release, but it was definitely worth the price of the ticket.  The narrative was pretty straight-forward if a bit thin, and it's that thinness that keeps it from pushing past \"pretty decent\" and into greatness.Worth the watch, but probably won't be all that memorable afterwards."
    },
    {
      "rating": "10",
      "text": "It's a fantastic movie for me because I have a favorite and dear pet (my first) and I was able to feel Enzo's life.Maybe it's the merit of the actor's voice in dubbing (in Russian), but I've never seen such a perceptive film, which is so believable and realistically narrated by the eyes and thoughts of a dog.After watching this film, I will no longer be able to look at its poster - it is simply impossible"
    },
    {
      "rating": "8",
      "text": "Um filme bonito de cachorro, gostei bastante do enzo não abrir a boca para falar e sim fala somente na sua mente"
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)A myriad of tragedies commented by the wisdom of a dog in a film for animist animal activists. A joke? Unfortunately not."
    },
    {
      "rating": "7",
      "text": "I hadn't read the book that it is based on, so only armed with the knowledge of a short synopsis, I really didn't know what to expect. It was actually quite good.I thought listening to Kevin Costner drone on for a couple hours as a dog's inner monologue would be tedious, but the nuggets of wisdom peppered with the occasional witticism provided ample entertainment. I often felt like I was watching the \"Thoughts of Dog\" Twitter account played out in cinematic form. I absolutely loved both Milo Ventimiglia and Amanda Seyfried in this. The daughter was also played especially well by Ryan Kiera Armstrong. The relationships between themselves and also with Eve's (Seyfried) parents was perhaps a bit banal at times, but overall was still believable and endearing - although I felt like hitting the dad with my car at several points.Afterwards, I overheard several people tell the studio rep that they hadn't expected the movie to be a \"tear-jerker\", and the sobs coming from the gentleman seated next to me seemed to confirm that. However, I found the story to not be overly sorrowful or sad, but inspirational. A guide, if you will, for how to become an exemplary person shown through the filter of a dog's belief that by gaining this knowledge he'll be reincarnated as a human in his next life. (I know it sounds silly, but it was actually quite poignant.)"
    },
    {
      "rating": "10",
      "text": "Best movie i ever watched, a dog, a car racer, a dog who tries to understand us humans,a little sad too, but its good and it touchs in heart all the time. Enzo its is name, Enzo its a name of a Ferrari, and here its a good quote from Enzo 'The best drivers focus only on the present. Never dwelling on the past, never committing to the future. Reflection must come at a later time.' - Enzo"
    },
    {
      "rating": "4",
      "text": "There's a few laughs in the first third of the movie, then it gets serious and dramatic.  I was expecting something more light-hearted then this HallMark style weeper."
    },
    {
      "rating": "10",
      "text": "Such a wonderful movie! It goes through different aspect of life: neverending difficulties, the left of someone close and the strength that is needed to follow our dreams.A particular note to the racing part that achieve to give the sense of what moves racing drivers that when they have their wheels in hands they feel free and in power of their destiny, or better, of that moment, in each second of the race"
    },
    {
      "rating": "10",
      "text": "This is not enough good movies, without all the Hollywood garbage, made these days. This is one of those GOOD movies."
    },
    {
      "rating": "7",
      "text": "This is a sad film but a good one. It's one of very few films where I can say I've read the novel its based on. I'm not really sure why its categorised as comedy, as I wouldn't call it that, if anything its quite sobering - its more of a family friendly drama really. Its thoughtful and somewhat sentimental, cheesy and perhaps a bit predictable but mostly a good watch, so overly I'd (perhaps cautiously) recommend it, yes."
    },
    {
      "rating": "5",
      "text": "Worth streaming if you've got nothing better to watch on a sad and rainy day.  C"
    },
    {
      "rating": "10",
      "text": "La mejor película para disfrutar en familia, sin duda te hace reflexionar sobre el valor que tienen los animalitos y el propósito que tenemos en la vida."
    },
    {
      "rating": "8",
      "text": "I thought it was a good a dog's purpose like movie. it was emotional and funny and gotta love the Alice Cooper song!"
    },
    {
      "rating": "8",
      "text": "I think this movie is underrated. You can try to watch this movie by DVD or streaming services."
    }
  ],
  "recommendations": [
    "bridge_to_terabithia",
    "soul_surfer",
    "the_bucket_list",
    "the_butterfly_effect",
    "pay_it_forward",
    "up",
    "her",
    "vanilla_sky",
    "seven_pounds",
    "chappie",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "slumdog_millionaire",
    "the_adjustment_bureau",
    "tomorrowland",
    "the_lego_movie",
    "where_the_wild_things_are",
    "fight_club",
    "flipped",
    "the_last_naruto_the_movie",
    "titanic",
    "soul",
    "the_13th_warrior",
    "the_vow",
    "cloud_atlas",
    "lost_in_translation"
  ]
}