{
  "id": 1318,
  "title": "The Other Woman",
  "starring": [
    "Cameron Diaz",
    "Leslie Mann"
  ],
  "runtime": 109,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "After discovering her boyfriend is married, Carly soon meets the wife he's been cheating on. And when yet another affair is discovered, all three women team up to plot mutual revenge on the three-timing SOB.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yHnbb6z8REuFIyBLT2Nj3MX54dY.jpg",
  "categories": {
    "plot": 7.25,
    "acting": 7.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Ridiculously over-dramatic, almost to the point of being the 21st century's \"Mommy Dearest\".  Stepmom would be a very slight step better than this one."
    },
    {
      "rating": "6",
      "text": "I know one very similar to this movie and much better too, called \"Stepmom\" with Julia Roberts, Susan Sarandon and Ed Harris. The truth is that this drama (call it the novel would be too absurd) can have the most unsympathetic characters possible. Natalie Portman strives to give credibility to Emily, but the abuse of recurring return to the premature death of the daughter is the actress crippling any attempt to make her character more three-dimensional! Nevertheless, it is the best on the scene because her husband apparently indifferent and soothing, the conflicted ex-wife and the son verbally aggressive and nasty drawback is sufficient reason to abandon that Emily left the life in the midst of that family. It's a tearjerker poorly done and most obvious example of this is the final 30 minutes to extend into dialogue with another party of Emily solving not only the loose ends of the film as a whole, but of her life, as if only a simple conversation could unlock and enter the core of the personality and feelings."
    },
    {
      "rating": "3",
      "text": "Natalie Portman and Lisa Kudrow give fantastic performances, but sadly they are featured in a terrible dramatically uneven awkward film that won't get them noticed anytime soon. I give this film 28%."
    },
    {
      "rating": "8",
      "text": "A guilt for losing the own baby and being labelled as a bad step-mother.It is also known as 'Love and Other Impossible Pursuits', which is the name of the book the film was adapted. According to me this is a very underrated film. Especially Natalie Portman was never seen before. This film was beautiful because of her. Might have been the same if any other actress who had played that role, but the thing is the character Emilia makes this story great. I would have given any top award the available around the globe for that incredible character display. It should have been recognised, sadly that did not happen because of the filthy film critics.Feels good watching it. This might not be a biographical film, but surely this is happening around us. The writing was so impressive. How the character Emilia was portrayed is the film's highlight. It was a simple character, that does not mean the life has to be simple as well. She falls in love with a married man and later she get married to him to become a step-mother to his child. That's where the problem arises when her baby dies in her arm, everybody points her for not being cautious with her step-son. This is a big task and how she comes out of it was revealed with lots of small twists and turns in the tale.Not just Natalie, but all the supporting cast was brilliant, including the husband, the kid and the ex. The story of loss, marriage, taking care a child and other struggles in life. Initially it did not look good with those affairs, but when it got past the half way mark, the rest of the film rebalanced the entire film. I liked how it ended. That final scene was very good. Even if you are an atheist, that end dialogues makes the major difference to favour the film. I haven't read the book, but seems the film was better than the book. Being a film fanatic and failing to recommending it to you would be a mistake. So I recommend it to particularly the grown-ups.8/10"
    }
  ],
  "recommendations": [
    "my_cousin_rachel",
    "our_friend",
    "the_descendants",
    "the_glass_castle",
    "about_a_boy",
    "marriage_story",
    "disobedience",
    "the_bridges_of_madison_county",
    "leave_no_trace",
    "blue_valentine",
    "brothers",
    "gifted",
    "lovelace",
    "stillwater",
    "the_hunt",
    "closer",
    "still_alice",
    "miracles_from_heaven",
    "the_judge",
    "the_father",
    "the_other_boleyn_girl",
    "sleepless_in_seattle",
    "elle",
    "the_reader",
    "the_fault_in_our_stars"
  ]
}