{"id": 3072, "title": "The Texas Chainsaw Massacre 2", "starring": ["Caroline Williams", "Dennis Hopper"], "runtime": 101, "genre": ["Horror", "Comedy"], "description": "Chainsaw-wielding maniac Leatherface is up to his cannibalistic ways once again, along with the rest of his twisted clan, including the equally disturbed Chop-Top. This time, the masked killer has set his sights on pretty disc jockey Vanita \"Stretch\" Brock, who teams up with Texas lawman Lefty Enright to battle the psychopath and his family deep within their lair, a macabre abandoned amusement park.", "releaseYear": "1986", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/gW5kdDrogbjlBAmTzlJZARMfivE.jpg", "categories": {"plot": 6.5, "acting": 6.333333333333333, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 7.5, "action": 7.5}, "reviews": [{"rating": "10", "text": "Awesome movie,has great and funny moments,the first slasher movie i ever watched. I watched in theaters when is was 6 and now i am 40!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "5", "text": "The original is such a tough film to follow up because it's so unique. So I really do appreciate how they managed to at least make a decent sequel to that movie. The dark humour really stands out, The characters rival that of the first film. It's not perfect, I felt that it did drag at times and the ending was too similar to the original but other than that, It was pretty solid."}, {"rating": "9", "text": "With a great lead, great gore, a nice wild adventure, and a new family member, Chop Top, I love this outrageous horror comedy slightly more than the original."}, {"rating": "1", "text": "La peor de toda la saga, si piensan que las últimas películas que han salido desde el 2013 son horrendas y esta una preciosidad es que tienen serios problemas cognitivos."}, {"rating": "7", "text": "I wasn’t the biggest fan of The Texas Chain Saw Massacre (1974). I found it interesting and memorable but far better films had come after it. I also found it a little slow and tonally inconsistent which made it less entertaining than the concept implied. The sequel does something really different with the franchise. It is hard to put it strictly into a genre, it has shades of horror, action and comedy. Some might argue that it doesn’t have a high enough body count to be a slasher, not enough tension to be a suspense, too silly to be a scary film, not enough action to be thrilling and nott funny enough for a comedy. So you could argue that you are left with a pretty pointless sequel. I would argue that with such a mixture of styles it is actually more entertaining as it’s hard to anticipate what’s going on! It has some really cool bits. Sadly though one of the coolest looking practical effects of a chainsaw cutting through someone’s head isn’t actually in the film, numerous stories surround its exorcism from the movie which I will leave you to read about at your leisure. Apart from this infamous deleted scene I would argue that the violence is a little light and too sporadic, it could do with an all-out massacre to live up to the title. There are no major jump scares. The comedy is odd, making the characters very memorable. Not a good film as such, it is entertaining though."}, {"rating": "7", "text": "\"The Texas Chainsaw Massacre 2\" gets better and more fun every time I watch it."}, {"rating": "9", "text": "This is my favorite horror sequel because it has a good after story to its also amazing original, has awesome graphics, and has good comedy."}, {"rating": "7", "text": "7.5/10The Texas Chainsaw Massacre 2 is a silly, stupid, funny sequel yet it's still scary, terrifying, and crazy at the same time, and i like it, it's definitely not as good or even near as the original but The Texas Chainsaw Massacre 2 is definitely way crazier than the original, praise to Caroline Williams that not only did a great job, she have to through more than Marilyn Burns in the original movie, the sequel flaws is in some of the performances by the cast and i think besides Caroline Williams performance, everybody's including Dennis Hopper was ok, and the stupidity and sillyness that kinda too much though i'm ok with some of them, but overall i have a great time with The Texas Chainsaw Massacre 2 and the movie itself? surprisingly pretty good and i can definitely say that i like it."}, {"rating": "4", "text": "A very uneven 1st act. 1 very solid sequence and jump scare that got me pretty good. A little confused by the mass murderer cannibals doing all this killing to sell chili and make a buck but what they spend the money on is very unclear. A dramatic tone change compared to the original. Bad guys went from twisted, demented, and scary monsters to downright silly idiots."}, {"rating": "9", "text": "Well, this was better than the first one. I don't know what to think about the fact that I enjoyed this movie. It's the craziest **** More to it than that though, but still."}], "recommendations": ["the_texas_chainsaw_massacre", "the_return_of_the_living_dead", "the_texas_chainsaw_massacre_the_beginning", "wrong_turn", "i_still_know_what_you_did_last_summer", "army_of_darkness", "fright_night", "evil_dead_ii", "goosebumps_2_haunted_halloween", "halloween_ii", "zombieland", "scream_2", "poltergeist", "final_destination", "scream_4", "hell_fest", "the_amityville_horror", "friday_the_13th", "the_omen", "werewolves_within", "a_nightmare_on_elm_street", "predator_2", "halloween_h20_20_years_later", "piranha_3dd", "jaws_2"]}