{
  "id": 351,
  "title": "The First Purge",
  "starring": [
    "Marisa Tomei",
    "Patch Darragh"
  ],
  "runtime": 97,
  "genre": [
    "Horror",
    "Action",
    "Thriller"
  ],
  "description": "To push the crime rate below one percent for the rest of the year, the New Founding Fathers of America test a sociological theory that vents aggression for one night in one isolated community. But when the violence of oppressors meets the rage of the others, the contagion will explode from the trial-city borders and spread across the nation.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8qev1papxnzWVrXxZvEUqI8Z3n5.jpg",
  "categories": {
    "plot": 5.245283018867925,
    "acting": 5.157894736842105,
    "ending": 4.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.052631578947368
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The original movie in this series featured gripping action and a compelling concept: all crimes (including murder) are permitted one nite a year. The 2 sequels are pretty bad and this 3rd continues the slide in quality. It's set in the US, where a new super-conservative party has come into power and announces the \"experiment\" to deal with growing national problems. This paranoid political premise drains even more life from the series. What I wrote in my review of the last one still applies: \"Once again, the situations are absurd and the action is mostly dull and uninventive. Some of the auxiliary scenes are artistically shot or visually inventive, but that doesn’t elevate the quality. It’s not exciting. It’s not scary. It’s a disappointment.\" These films have just become an excuse for gratuitous violence."
    },
    {
      "rating": "2",
      "text": "You seen 1 you seen them all. This one was a BLM style movie and it follows a gang banger and a mum and kid and somehow the gang banger is like a jackie chan of guns yet never fills in if he was Ex military or whatever he was just a gang lord. So boring. Literally every single one is the same just different actors. Just as bad as SHARKNADO..."
    },
    {
      "rating": "3",
      "text": "Purge. So get to it. Literally 1/2 an hour before anything happens. Advice: deliver on the title when you make a movie. Skyscraper - tall building. A Quiet Place - minimal sound. Isle of Dogs - Dogs on an Island. And Purge - Purge."
    },
    {
      "rating": "3",
      "text": "Easily the worst movie in the franchise, it breaks its own universe rules and has one of the most poorly written storyline scripts iv ever watched in a mainstream movie.It felt more like a SCYFY copycat movie.This movie brings nothing new to the franchise and in some ways retro-actively damages the other movies.Avoid if possible."
    },
    {
      "rating": "1",
      "text": "I didn't see the other \"Purge\" movies, and thought on bargain day I might as well to see what the buzz has been about.    Well, I can't say anything about the others in the series, but this movie is nothing but a thinly veiled ultra racist diatribe as the first Purge takes place in the poorest parts of Staten Island, NY.    It makes no bones that African Americans and a few Hispanics for racial diversity's sake, I suppose will be the targets of a horrific 12 hour rampage of genocidal race motivated insanity.    I for one am no racist - I hate those types with a passion, just like millions upon millions of good people of all ethnicities and races do.    We want harmony.    We want fairness in our economic and societal structures, and all the good things that come with those who have the brains and capacity to reserve judgment on our fellow humans as individuals and their actions, not race, religion, sex preference, etc.    \"The First Purge\" either overlooks or pointedly refuses to acknowledge that fact.    The dichotomy here is so divided it's insulting.    As if the idea of the first purge isn't bad enough, the film depicts a stark line between victims and the \"purgers\", which, after a few inner murders of blacks on blacks, becomes a disgusting white ultra KKK fueled attempt at legal ethnic homicidal cleansing with no legal repercussions.    In this film, all whites are evil killers.    Even while the African Americans depicted are sometimes vicious drug dealers and users, they end up the heroes who successfully last the 12 hours to fight another day.    If that isn't enough, the short we see here while looking at the movie online shows a blatantly Donald Trump style \"Make America Great Again\" hat.    When will people understand that this kind of extremist stereotyping is a horrible idea for a movie?    It is not fair to anybody who deplores the Trump lovers out there as much as their intended victims of their hate and hostilities.    Had the writers at least acknowledged that the majority of Americans regardless again of race, religion, etc. detest the far right's message and behavior of its massively hate filled morons, it might have made the message a bit less divided.    Instead it capitalizes on the extremes of society, presents them as the majority, and serves only to galvanize the polarities that are already pulling this country apart.    Of course we who are not racist redneck imbeciles parading around in pointy hoods root for the minority community so viciously murdered in this bloodbath.    Others though are demented enough to think such an event would be great fun, and minorities would have some people too who would react negatively enough that they would not attempt to understand that the overwhelming majority of whites are on their side.    It's just the extremists who fall into this category, but they're out there, and in the face of mass murders in real life going on in epidemic numbers across the country, this idea is mind poison.    While some of the action is suspenseful and the fear that accompanies the purge is well represented, it's only that element that deserves the \"1\" rating.    I do not appreciate the implied assertion I am some hayseed illiterate racist hatemonger just because I am white.    And good hearted minorities do not appreciate the implication that no white people are ever to be trusted as friends, work associates or any other normal human relationship.    It's a terrible plot, and even more sinister concept."
    },
    {
      "rating": "4",
      "text": "All the films in this franchise have been regular and bad, accept it, face it, don't deny it to me, but there is something I must admit. The first film did had in some way an interesting message. A message that was inevitably lost in the mismanagement of the plot and the story and the need to carry everything with violence but it's understandable because after all, the plot of the film dealt precisely with violence but it's not necessary for your story to become just that.The sequels, both the second and the third became something else, changed the scenario and became full-frontal action films and once again we cannot deny that the theme of the stories lent itself precisely for that, but evidently as I just say recently, in action films what becomes predictable also becomes boring and both films were boring, yes they did have action, you could call it entertainment somehow but how long can that last?This prequel doesn't change anything and in fact it's practically irrelevant that it is a prequel. It's true it offers the origin of the purge but was it necessary? no, it wasn't.It doesn't let you see anything that was essential or indispensable to understand the other films, therefore it's more of the same, with the same quality and as irrelevant and inconsequential as you can probably imagine."
    },
    {
      "rating": "2",
      "text": "THE FIRST PURGE wastes chance to elaborate by turning it into another \"Maybe, it's actually an action movie\"-movie, killing by numbers snoozefest, a disorienting prequel. Countdown to the purge to purge itself !"
    },
    {
      "rating": "3",
      "text": "This horror movie is bad throughout.I can say”The Worst Purge”?It’s just a…I don’t want to use F-words.OKAY?"
    },
    {
      "rating": "4",
      "text": "“Think of all the good the purge does.”In 2013, the world was introduced to a small little independent horror film called The Purge. The basis of the film revolves around the idea that, for a twelve hour period, one day out of the year in the United States, citizens, residents and all Americans are able to do whatever it is that they like, without any punishment or laws, including and not limited to; violence, vandalism, theft, rape and of course murder. While the first purge film in the series was revolutionary and kick started a franchise that is now in its fourth entry, the first film unfortunately limited itself to being, quite simply, a thrasher home invasion film with the world of the purge harrowingly surrounding it; the potential for the series was behemoth. Thankfully, the film gained steam and momentum, and more films followed, with the original director and writers on board. With the second entry, the world of the purge was explored to the streets of Los Angeles, where motives of revenge and redemption were explored and showed how regular people handled the deadliest night in America. In The Purge: Election Year, the purge got more political (not that it never was), especially since the looming potential of a somewhat clueless President was on the verge of being elected (he didn’t actually win, did he?).Politics and tongue-in-cheek social/economically charge commentary is something that the purge series isn’t stranger to, especially within the last two entires in the series. But like any good planned B-Movie film series, the fourth entry in the series is also, technically speaking, the first movie in the series, a prequel. The First Purge is an interesting cinematic approach in terms of shock value, only because, the build up of whether the purge is a successful experiment is answered within minutes of the first film, so what is the point of this film?Writer and original director of the first three entries, James DeMonaco, who’s love child is basically this series, decides to use the first purge film to show the divide between people and their thoughts on this “experiment”. Sanctioned by the New Founding Fathers of America, the newest political party, who is coincidentally backed any the NRA (National Rifle Association), and developed by scientist Dr.Updale (Marisa Tomei), “the experiment” (the initial name for the purge) was only taking place on Staten Island, one of America’s lowest income and poorly populated cities (coincidence). If you stay on the island, you get paid $5,000. If you participate in the experiment, you get monetary compensation; if you kill someone, well then you get compensated generously. These are all incentives for the residents of Staten Island.While we quickly become familiar with the main inhabitants of Staten Island, we are also introduced to all the family drama happening on the island as well, for instance, the main protestor and the purge’s biggest rival is the educated and powerfully independent Nya (Lex Scott Davis), whose ex boyfriend Dimitri (Y’lan Noel) is Staten Island biggest gangster, and who’s brother Isaiah (Jovian Wade) is secretly joining in the purge’s festivities, to get back at a local crack addict for nearly cutting open is throat. While the streets belong to Dimitri, his heart still belongs to Nya, despite their past and current relationship woes.As the experiment commences, we quickly see that many of the people involved and brave enough to withstand staying, spend most of their time praying, socializing or partying on the island. With the exception of the freaky looking crack head Skeletor (Rotimi Paul), who fashioned himself his own Freddy Kruger inspired claws made out of needles, Staten Island and its residents aren’t really purging as expected, unless you consider trap-music inspired street festivals as purging. So, like any good social/political experiment gone wrong in the United States, the government intervenes and sends out their own “citizens”, ex-mercenaries to kill and rid of low-income residents on Staten Island and cleanse the American genome. You can imagine, Dimitri, the only resident on Staten Island who profits from other people’s misery, isn’t happy when the government decides to take out his clientele, so, like any good business owner, who goes out himself to rid of his corporate competition.There are many things wrong with the First Purge including the film’s main antagonist and protagonists. Perhaps thats the point, I mean, even the woman who developed the purge has her own scene of redmeption, but then again, how is a person redeemed of concieving such a diabolical experiment, especially when she sells it to the most corrupt clients in the world, the American government?"
    },
    {
      "rating": "4",
      "text": "Loose film with a plot that gave for a better content. The second and third seemed good movies, this is regular. Returns to have the same plot as the previous, forgettable characters and things are explained that did not need a background before. Loose performances, very ridiculous moments (drones that shoot) and in the last act happens to be a movie of genre of action in the style of The Rock. I think he has a good start and there are scenes with a very well achieved suspense, but then he totally deviates and loses everything he was doing well. Marissa Tomei wasted. Movie to watch on TV on a Sunday night."
    },
    {
      "rating": "4",
      "text": "It's purging season everyone. You've seen the Purge, you've seen the Purge two, you probably haven't seen the Purge three but now it's prequel time so buckle up for the very first Purge. Directed by Gerard McMurray and written by John DeMonaco, the same guy who wrote all the other purge movies. Also starring a bunch of actors who I'm not bothering to name, it's a purge movie, do you really care who's in it? Crazy, masked, knife wielding psychopaths, innocent victims and the evil corporate suits, yep it's a purge movie alright.The controversial experiment created by the new founding fathers of America (NFFA) is ready for a trial run in Staten Island. The experiment promises to reduce crime to below 1% for the rest of the year as long as people can release all their anger and rage in one night. Staying on the island for the purge is optional yet the majority simply couldn't afford to leave. On top of that, those who do stay are offered payment and others are strongly encouraged to participate with the promise of even more financial rewards depending on how much they participate. Very much taking advantage of the oppressed and marginalized. Participants must also wear tracking chips and high tech contacts for recording the first purge. They also make the wearer look like zombies, which adds to the horror theme, so bonus. Yet much to the disappointment of the NFFA the purge doesn't have the high level of participation expected at first. But when a whole group of new gangs show up and quickly escalate the purge it becomes apparent that this is more than just a sociological experiment.Gives everything you expect from a purge movie, extreme violence, violence while wearing masks and an unnecessary amount of jump scares. Although I think most of them came from the same person. One dimensional characters in a mediocre film. When it finally gets going it's entertaining in the moment but very forgettable afterwards. I would say this should put an end to the purge franchise but if there's one thing these low budget horror movies can do successfully it's make a lot of money. Recommended for fans of the purge franchise."
    },
    {
      "rating": "6",
      "text": "I'd say the Metascore is just about right for this one, though I probably liked it more than most of the critics.  The gang leader is excellent, and his ex-girlfriend is really good.  I enjoyed the supporting cast of OGs.  The weak point of the story and the series is the band of nameless, faceless white dudes that are mostly all masked.  Sometimes tough to figure whether they represent some Charlottesville-like white supremacists or a generalized menacing group.  Bottom line - exploitation flick that's fun to sit through."
    },
    {
      "rating": "3",
      "text": "The First purge is the actual prequel that people asked for but basically never got because this movie is trash.  The First Purge was a movie excited for but unfortunately I was very disappointed.  The biggest issue with this movie is that it doesn't actually answer the question of how the first purge came to be.  It opens like every other purge movie and we start with a bad montage of violence and rioting and then 10 minutes later we get the first annual purge is starting.  The next big issue is the lead character, while though a compelling performance given the character he plays is completely uncomparable.  There is no reason at all that we would want to route for this man and his friends because they are all basically bad people.the action scenes in this movie are lazy and poorly made, the gun effects and sound designs sound like someone searched up gun noise online and made that the sound effect.  The odd decision to use cgi blood also doesn't help because it always looks bad and looks like blood from an old 1980's shooter, where someone blood always sprays from the one part even when their shot somewhere else.this movie is disappointing and is just another excuse to get more funds and is probably my least favourite of the bunch."
    },
    {
      "rating": "0",
      "text": "Just like the last Purge movie, this is an extremely racially biased liberal hit piece. All the good guys are black or some other minority while all the bad guys are white. They even go so far as to put the white guys in KKK hoods and pseudo-Nazi uniforms this time. The hero’s are a mix of brutal gang banger drug dealers \"with good hearts\" and others \"held down by the man\". The government that starts the Purge is the NFFA, supported by the NRA, of course. It’s a mountain of sick, twisted liberal garbage at a time when minority employment is at historic lows. Movies like this keep black people on the dependent democratic plantation and do nothing but stir the racial hatred magnified during the Obama regime. Garbage."
    },
    {
      "rating": "7",
      "text": "La película buena, la trama es original, sin embargo pudieron explotar mejor los argumentos del inicio de la purga,el inicio y final muy bien, desarrollo algo lento hasta poder ver acción Así que un 7 es mas que suficiente"
    },
    {
      "rating": "4",
      "text": "I very much like the Purge franchise on a conceptual level. I think that the idea of the Purge offers up a very interesting premise that could be turned into some great movies. Unfortunately, though, the Purge movies (outside of the first installment) have not been all that great. They've been decent flicks to watch if you're bored one afternoon or just want to eat some popcorn and watch people die, but that's about it. The story of this one follows the cast of characters on the night of the first Purge. Given this, I figured that the beginning of the movie would give us a somewhat detailed look at how the decision to have the Purge came about. We are kind of given that, I guess. We get an incredibly cringey interview at the beginning between a doctor and a potential Purge participator that basically gives us the origin of the name, and the rationale behind the decision to have it is explained as well. But after those little tidbits, the film dives straight into setting up the characters. I like a lot of the elements of The First Purge's story: how the New Founding Fathers' motivations factor into the experiment, how the people on the island initially act when the Purge starts, and how the Government gets involved later on. It did what a prequel should: add more to the movies that come after it in the timeline. However, this film tries to be so, so timely with its social commentary, and it gets to be a bit much at times. And that heavy handedness really brought down my enjoyment of the film more than I expected. Also, outside of the Government being a bit more involved this time around, The First Purge turns into just another Purge movie around the halfway point. There's some nice action, and some death, but otherwise it's nothing new. The concept here was good, the execution...not so much.Characters: Dmitri (Y'lan Noel) is not only the best character in this film, but he's really the only character worth anything. He's the only one with any real depth, and it also helps that the actor portraying him has some real chops. All of the other main characters are completely two dimensional and are not particularly likable, either. I also have to say that I guess Blumhouse wanted to have as many crazy Purgers as possible in this film, but they are so over the top that they come off as people pretending to be crazy. One of the main \"crazy\" Purgers, Skeletor, is laughably bad. Without Dmitri, this cast would have been extremely weak. And, to top things off, Dmitri is a drug dealer...and he was the most likable character in the film despite not changing much by the end. That's something. Script: The writing for most of this film is horrendous. Extremely cheesy dialogue, but that's nothing new for the Purge franchise. Cinematography/Effects: Blumhouse is known for making decent looking movies on a super low budget, but I think that The First Purge may be their first film in a while that actually shows its low budget quite a bit. The sound effects are often recycled and sound like they came from a cheap sound pack, and some of the visual effects are downright terrible. If you see the film, watch for the blood effects in the scene that involves smoke grenades. It's not good. Cinematography wise, there's nothing special here, but it's decent. Overall: I was entertained by the action and most of the story of The First Purge, and I liked the character of Dmitri, but outside of those things this film is barely passable as a popcorn flick, even by my relatively low standards for Blumhouse movies."
    },
    {
      "rating": "7",
      "text": "Believe it or not, this was actually a good film.  Let me specify, a good popcorn film. If you are looking for a good time to kill 2 hours this movie is perfect for you, just don't expect anything more from the usual purge film."
    },
    {
      "rating": "8",
      "text": "This is definitely a movie you shouldn’t take seriously, none of these movies are anyways, but if your looking for a decent horror/thriller flick to watch during the summer I would give it a go or wait til it comes out and watch it digitally, otherwise this movie is definitely for the fans of the franchise!!"
    },
    {
      "rating": "6",
      "text": "The First Purge: An Elephant On the TableCinematography: 5.932/10 It's simple though not compelling. The acting and story are the films strong points. Costume Design: 6.821/10 There's no way to avoid the significance of the outfits parading the streets. There's a balance between the Carnivalesque and die-hard Purgers. Yet, what I find more important than the actual costume designs is from where these outfits arrive from and for which purpose each serves. Film Editing: 6.312/10 Decent. The scenes are set up for its punches; the moments that draw the audience more into the story are set well and make for a more interesting project. Still - not every scene looks pretty and flows well though the acting and story helps elevate the film substantially. Make-up and Hair-styling: 4.901/10 Some of the people in the actual fights look to be in better condition than the bystanders. Sound Editing: 7.321/10 The beats with lyrical assistance are set well and engages the audience. Otherwise, there doesn't seem to be much else going on.Visual Effects: 4.121/10 Seemingly forgotten. A snarky stab at technology. Story: 8.297/10 The First Purge is mainly compelling due to it's strategically set story, acting - and its punches (check Film Editing). The story presses against drugs and violence within impoverished communities by imbibing them within its core developments. Yet - the story greatly emphasizes seemingly debilitating circumstances are not of the low-income communities themselves but processes of the government which the government has to fix in tandem with communities suffering the effects of government processes the most. I think the actual story has a lot of strong points (more in Personal). Acting: 7.972/10 The acting elevates and fits the film. Dolores, Mugga, is hilarious: her role is set just right for the film. She's the only character that makes sense looking unscathed throughout the film. The sincerity of the acting is present which gives the film a necessary boost. Personal: I feel as though the film attempts to reveal covert organizations within America that affect communities of diverse demographics as well as low-income communities. The lack of specificity concerning organizations throughout the film leaves one to speculate them as mercenaries or members wearing attire blatantly representing particular groups in America. Beyond the film reminding me of The Greenwood Encyclopedia of American Institutions: Fraternal organizations by Alvin J. Schmidt, The First Purge sets a firm stance against illegal activities within communities. The Other Wes Moore: One Name, Two Fates comes to mind as I watch Joivan Wade interacting with Freddy, Steve Harris, in the film concerning other opportunities available in their neighborhood besides slinging dope. The idea that communities have to help themselves as much as possible even without government assistance is ever present throughout The First Purge though The First Purge emphasizes that government assistance should not damper community growth for monetary gain. The First Purge focuses on sensible matters in a comical way which always finds disruption due to matters plaguing a community capable of existing happily though is unable to due to particularly draining aspects of society like addictions, overdraft fees, corrupt government practices, illicit activities, etc. A very strong subtle point is that illicit activities are already happening (as though certain individuals or organizations live like Purgers everyday though plainly or under the pretense of out-of-sight-out-of-mind) and (these certain individuals or - ) organizations are manipulating media outlets as well as societal behaviors through financial maneuvers to promote their agendas. One might assess The First Purge as overly packed or appropriately scanning: I think it has a lot for one to bring to the table to dissect (though leaves one with a lot of ground work to cover due to the lack of specificity in the film concerning specific types of situations available -  like the scene of brutality in a baseball field - the imagery is all one has to procure from).Overall: 6.459/10-K.D.If you're into Poetry and other bits of creativity, check out my Instagram: @Dufreshest."
    },
    {
      "rating": "4",
      "text": "James DeMonaco and Jason Blum bring us this fourth installment in the \"Purge\" franchise -- \"The First Purge\" -- a woefully stupid film that makes an unsophisticated attempt at trying something sophisticated; politics. Sociopolitics and horror don't always mix, and this film is no exception to that very simple fact. Any and all hopes that the creative team behind this film had to drive home some sort of relatable societal message is completely bogged down by the movie's lack of authenticity, logic, or character depth. And despite a couple of serviceable action scenes here and there, this is a largely forgettable effort."
    },
    {
      "rating": "7",
      "text": "Reprehensible, socially irresponsible and racist to boot. It all adds up to a thoroughly compelling popcorn movie. Ain't human nature just swell!"
    },
    {
      "rating": "5",
      "text": "Como fan de esta franquicia debo expresar que esta si bien logró divertirme con sus escenas de acción, me decepcionó en todo lo demás, esperaba que plantearan mejor el concepto de la depuración, básicamente es exactamente la misma idea principal de las demás entregas sin mejorar ni añadir ningún detalle nuevo, pese a la originalidad del concepto nuevamente no supieron ejecutarlo bien y termina siendo mas de lo mismo."
    },
    {
      "rating": "8",
      "text": "This i my first Purge movie. (No pun intended). So, I can't rightly say whether this is just a pale retread of films two and three like others say. All I know is, I stepped into this knowing it wasn't going to be War and Peace, and I was entertained.I really liked the visual style. There is a wide display of creatively creepy costumes. The camera work is pretty nice too. Glad to see a film taking place at night, where you can still see what is happening.The movie is busily paced with a lot of characters and happenings. Kept things varied and interesting. As forced as the plot may be, you do get to feel for the characters.Still, the dialogue could've been better at points. There are some very forced Trump references. The subplot with the government official and psychiatrist overlooking the Purge is by far the weakest, most poorly written part. The only saving grace in these scenes is Marisa Tomei, who manages to do a good performance despite rubbish dialogue.Yeah, I know the whole concept is goofy, but if you like horror action, I think this is a serviceable time waster."
    },
    {
      "rating": "6",
      "text": "The first purge was okay, and there's nothing wrong with that, it was entertaining, but never really captivating. You never really fall in love with any of the characters which means the stakes are never particularly high, it does a good job at setting the picture for the world of the Purge movies but other than than it was okay. The plot was okay, the characters were okay. In short the entire experience was okay."
    },
    {
      "rating": "6",
      "text": "Even through their trivial (and predictable) mistakes, this movie manages to make you care for the main characters through different intertwining story-lines. Without the typical silly scenes and filmography that litter this film as well as the other Purge films, it would score higher."
    },
    {
      "rating": "8",
      "text": "The First Purge this an enjoyable movie and purge movie ok so the problem with this movie is the story for the US it does not make sense of course one of the people for the purge took cops and the military army and try to kill our main character so Fu*** up like I feel like this movie did not have the story but Dmitri I really liked in this movie he saves this movie if that character was not good or interesting this probably be the worst purge movie but he is a great character be is kinda a civilian but if he gets messed with he will go after which made a lot of sense the kill are pretty cool the ending of the fight scenes down the stairs I loved that was such a good fight and a scene this movie to be is good if you are a fan of these movies if not do not check this out all round a movie that I enjoyed wish had entertaining characters and a legit story so all round I give The First Purge a B-"
    },
    {
      "rating": "6",
      "text": "Gerard McMurray makes his mark on The Purge franchise. The thing that's kept me coming back to these movies has been their ability to get crazier with each successive entry and this is easily the most insane so far. A new hyper-stylish approach has been taken to the visuals. The smoky streets with their ethereal glow and flashy block parties make it feel like a haunted house. The mask design is more creative and memorable than ever. As weird as it is to see what is chronologically the opening chapter adding sci-fi elements to the mix, those glowing-eyed contact lenses are a nice touch. It relishes in capturing the B-movie shlock with grindhouse-esque camera angles.The politics of the series have always been questionable. Doing more to promote racism with it's highly segregated casting than not. This prequel might easily be the worst offender. No longer hiding behind the thin veneer of satire established by DeMonaco with the previous three films, McMurray is flat-out unsubtle with the symbolism that feels less timely, and more like fearmongering. The message is at odds with the actual content so even if it were the right time, this would never be the right movie.It's hard to care about any of the characters as they're all a bunch of bland stereotypes. This is also the second dumbest Purge just after the original. The premise is that government is trying this event for the first time as an experiment and offering compensation to people if they'll stay on the island while it's happening with the promise of more money should they choose to participate further (i.e. actually commit crimes such as murder). When the time finally arrives they're surprised to find that no one is really doing anything. Gee, maybe it's because you guaranteed them a life-changing sum of money for just sucking air the night of the Purge. Given that all of this was the brainchild of a supposed social psychologist, you think they would have known going into it that when people realize they'll get paid for doing the bare minimum, that's all most of them are going to do. Especially in a situation where doing more would compromise their morals. That's like psychology 101.Anyone will tell you though that the appeal of this series has never been it's story or characters, but the carnage. So it's a good thing this is one gloriously euphoric bloodbath. Y'lan Noel goes all Rambo in a low-rent apartment complex and a lot of throats are slit. With funny one-liners and tons of bloody action you can come into this expecting the usual entertaining madness. Just know that the subtext is more tone-deaf than ever."
    },
    {
      "rating": "2",
      "text": "A prequel that does little to explain much of anything and only gives the bare minimum of content before once again being reduced into a plain action film. The characters are arguably the weakest in the franchise in this one and it tries a bit too hard to play into current social issues without actually making a statement about them.It is not a good sign that these films are getting progressively worst and worst."
    },
    {
      "rating": "5",
      "text": "Another in the line of okay but sloppy Purge films. Similar to the last two (not to first one, awful), The First Purge has some moments of intrigue mixed with poor editing anand outlandish characters. This is a slight step down with no Frank Grillo. Overall a low 5 a C."
    },
    {
      "rating": "5",
      "text": "The First Purge drags out way too long but is still a good popcorn film. This for sure isn't the best purge but it is better than the first two at least. I can admire some of it's actors and some of its plot points but that's about it."
    },
    {
      "rating": "6",
      "text": "If you liked other Purge movies in the series, I think you will like this one too. It kinda shows how the whole Purge started and what was idea behind it. It kind of also tries to make social commentary about situation in Usa, but in general yeah, nothing impressive, but if you like other Purge movies, you will like this one too. If you don't, then nothing new to expect here"
    },
    {
      "rating": "4",
      "text": "A franchise that succumbs without a taste of its own medicine: purgation.  With all the odds in its favor, Blumhouse has released its would-be summer hit in the form of a prequel of James DeMonaco's successful utopia — at least in box-office terms, — aiming at big dividends, mainly, in American cinemas. If this is true, then it'd surely mean the elongation of this overwhelmingly worn premise for a couple of more years on the big screen, not counting USA Network's TV series. \"The First Purge,\" an origin film about the birth of the controversial law that has grossed almost USD$ 320 million since 2013, is, by far, one of the most generic, tasteless and violent movies of the company since, paradoxically, the highly ambitious second installment of this same franchise starring Carmen Ejogo and Frank Grillo.  \"The First Purge\" is probably the first and unique of the entire franchise that has a really considerable social-commentary dose, still and all its thick-headedness and inefficiency, since if it is compared with its predecessors/successors, Gerard McMurray strives to say something— via bestial, outrageous scenes that find a solution in controversial violence —about caustic inequality, race snobbery, political manipulation and bigotry, all clumsily enclosed in a political bubble that, strangely, never bursts. DeMonaco taking a back seat in favor of a \"new\" voice brings on drastic changes into the narrative and visual field; a moderately healthy decision. Although he doesn't enrich the mythos, neither fortifies its origins, he delivers a balanced approach in content but unbalanced in quality. On this occasion, the film doesn't know what it is, a \"Get-Out\"-ish social freak out or an unsurprising survival thriller, a dilemma drowned, as usual, by a range of ear-shattering stings. The characters, far from throwing away modern action film stereotypes, are easy preys to meaningless, cat's paws running around and butchering to preserve their lives. Fortunately, unlike the thousands of mindless horror offerings out there, here the relationships between the characters involve a sense of humanity, which automatically causes that, at some point in the film, we worry about the fate of these fictitious individuals.  Peculiarly, antagonistic weight doesn't fall on a fixed actor, rather strongly belongs to wicked government intervention distorting the already nefarious experiment. This is one of its few strong suits, however, much like characters, the shallowness of this \"villain\" doesn't even try to fight audience's predictions, falling into \"race against the clock\" field over and over again, a lost race.Y'lan Noel plays the tritely cold-blooded gangster/action hero in a good way, with a strange charm that ends up echoing among the audience. Unfortunately, Dimitri, his character, is portrayed as a violent, vengeful man, two adjectives that clash with the notion of savior in this kind of film. Lex Scott Davis is who delivers the best performance, even if her character is nothing but another indomitable girl; alright, she gets a special plotting push, but, in the end, is one more final girl saved by a super-man. Mugga, the usual Afro-American comedy-horror comic-relief, does quite well her work, is a positive addition to the melodrama that bathes part of the story. I'm absolutely confident that this film will be remembered for two huge disasters: one, R.I.P. promising premise; two, an unfairly wasted Marisa Tomei. They've muted Tomei's character and that's an unforgivable mistake. In the first two acts, the creative mind behind this \"social catharsis\" doesn't say more than six lines — the first one, in front of an egregious green screen —and as soon as the third act kicks off, a certain \"twist\" takes place and destroys everything. Marvel's new Aunt May could have been a dream villain, clearly, with a worthy-of-respect design and treatment; alas, it was the greatest sin of a ramshackle tragedy. \"The First Purge\" by Gerard McMurray is just another run-of-the-mill thriller; a rushed B-movie throwback that doesn't even set up DeMonaco's gloomy, eye-catching visual spectacle. But, at the very least, it does achieve to deliver an obtuse edge of complexity to a premise that was on its last legs, burying a meaty context that hardly will resurface, at least, with brand-new stuff. After an insufferably lengthy period of almost seven hours — the four films' runtime belonging to this franchise, — something has happened: the experiment has expired. Mixing together DeMonaco's ever-aggressive pulp imagery and McMurray's improvement of some storytelling purposes, a perversely violent-yet-juicy cinematic cocktail may have come out from all this madness, unfortunately, said utopia will never be a reality; the experiment is over."
    },
    {
      "rating": "5",
      "text": "The First Purge, was a film that shows us how it all started, but in a very simple and catarchical way, the role they handle with minorities is good, but both the story is regular while the performances are bad, however it affects little The essence of the movie."
    },
    {
      "rating": "5",
      "text": "EhThis instalment Of The franchise is definitely the 2nd weakest in my opinion."
    },
    {
      "rating": "5",
      "text": "I understand why they made a Purge prequel, it was interesting to see how it came to be. As predicted, it was politically driven. But the film itself was pretty dull and didn't remain interesting."
    },
    {
      "rating": "6",
      "text": "This was surprisingly a lot better than I had hoped for, and it does have some genuine suspense and tension."
    },
    {
      "rating": "9",
      "text": "purge is film where theres bad government that dislikes the poor and wants the rich to become spiteful and disrespect the poor so they can stop giving money to people who can't work or has low wage work."
    },
    {
      "rating": "6",
      "text": "This movie is ok.There is a lot of action and violence but you see nothing new in the movie.The first purge with ethan hawke has better actors and part three has a better story."
    },
    {
      "rating": "2",
      "text": "**** kis **** Lovely movie. I think i will watch again. Kinda hard because all the no all ****s  are on the good side."
    },
    {
      "rating": "5",
      "text": "Starting in a predominantly black neighbourhood in Staten Island but nobody is really purging so the new government sends in militia to get the kill count up and thankfully, a group of drug dealers save the day."
    },
    {
      "rating": "0",
      "text": "Of course the domestic terrorist movement loves the idea of violence without consequence and leaped at the chance to fill one of these movies with their wokeness. As a legend once said, \"Everything woke turns to s**t.\""
    }
  ]
}