{
  "id": 3271,
  "title": "The Da Vinci Code",
  "starring": [
    "Tom Hanks",
    "Audrey Tautou"
  ],
  "runtime": 149,
  "genre": [
    "Thriller",
    "Mystery"
  ],
  "description": "A murder in Paris’ Louvre Museum and cryptic clues in some of Leonardo da Vinci’s most famous paintings lead to the discovery of a religious mystery. For 2,000 years a secret society closely guards information that — should it come to light — could rock the very foundations of Christianity.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/j9lsWwnIDN2ZNtqZcE1x2o4ZKyI.jpg",
  "categories": {
    "plot": 5.4,
    "acting": 5.333333333333333,
    "ending": 5.6,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 3.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I absolutely loved this movie! I was completely entertained, and I have never read the book so I had no idea how it was going to end, which was a nice change since I normally have movies all figured out by the halfway point."
    },
    {
      "rating": "8",
      "text": "After reading the critical reviews i was ready to be disappointed. But I found this a surprisingly good film and very true to the book. Don't believe the hype - there are a lot of agendas out there (anti-populist, right wing Christian etc) that want to see this film fail. If you want to see an entertaining film with some good ideas, see the Da Vinci Code."
    },
    {
      "rating": "7",
      "text": "The movie is okay. But the book was definitely better. But I am glad I could watch this movie a decade after I read the book. Helped me refresh my memory."
    },
    {
      "rating": "1",
      "text": "I was completely lost - throws too much information at you in a short time and doesn't even capture your full attention."
    },
    {
      "rating": "10",
      "text": "easily one of the best films i have ever seen i think that it really finds a way to connect with the audience and makes you think about things in a different perspective"
    },
    {
      "rating": "10",
      "text": "Fantastic Movie full of suspense. Of course the story is setup, of course Hollywood is greeting us. But if you want a great entertainment after work see that movie. I very much enjoyed doing so. Same as Part 2 the \"Illuminati\""
    },
    {
      "rating": "10",
      "text": "Excellent and epic!!! I really enjoyed that picture!! The music from Hans Zimmer was perfect and I want to watch it again!!! A surprisingly excellent crime thriller!!!"
    },
    {
      "rating": "3",
      "text": "I read the book; I've got advanced degrees in history and theology; this movie was a real dud. Tedious to the extreme, muddled and academically laughable (like the book), it doesn't do its actors justice at all. Don't bother; see Gigli instead."
    },
    {
      "rating": "6",
      "text": "never read the book, and never seen this before until now. I heard that it was a bad movie, but according to the Wikipedia article of films in 2006, it was one of the grossing movies of the year. so, why a 6/10? well, its not my favorite movie, but good thing it had Tom Hanks and Ian Mckellen in it."
    },
    {
      "rating": "3",
      "text": "I understand that story elements often get changed or condensed in the book-to-movie transition, but this is way out of line. The book is ten times better."
    },
    {
      "rating": "8",
      "text": "Despite the reviews, took a chance and really enjoyed the movie - take it for what it is a great fictional story - hard job to fit in all the details from the book - but RH did a good job..."
    },
    {
      "rating": "9",
      "text": "We saw it last night with a group of 6. We all really liked the movie and cannot believe we saw the same movie that the critics have slammed. The audience clapped at the end and generally seemed to like the movie. It held our interest and told the story without skipping any important points. It is a thinking person's movie- maybe the reviewers didn't want to think. Sure, it isn't the book, but that's a different medium."
    },
    {
      "rating": "4",
      "text": "A nearly completely tired translation of a good story."
    },
    {
      "rating": "10",
      "text": "Best movie of the year. The critics were wrong. If there was never a book before this movie, people would be applauding the film. This beats out anything put out by the film industry lately. Very entertaining. Everyone at the premiere I went to loved it."
    },
    {
      "rating": "8",
      "text": "Very interesting and thought provoking. Sure, it might feel a little slow for today's short-attention span audience and will be despised by religious folk who won't give the movie a chance to tell its story, but if you're in the mood for a good thriller and like puzzle solving adventures, The DaVinci Code is a good bet."
    },
    {
      "rating": "9",
      "text": "This movie is smart, like the book. A lot of idiots are going to see this and not get it.. They haven't read the book, and they don't know much about history, which menas they are lost after the first five minutes. ::shruggs:: I'd ignore idiots/critics alike. God see it if you know your history, read the book, or are just a bright cookie!"
    },
    {
      "rating": "10",
      "text": "I'm suprised at the harsh reviews the movie is getting from a substansial amount of critics, I wonder if they were caught up in the negative publicity the release of it into theaters is causing. I read the book and it was a fantastic piece of literature fiction or not. The Vatican should actually be thanking author Dan Brown to begin with for renewing interest in the church. When I looked at the first reviews that it got from the Cannes film festival I was pretty shocked and as I saw more and more negative reviews pour in from all over I knew something was wrong. Critics cannot always be trusted becuase sometimes they buy into the negative contoversy surrounding something and basically go with the flow. I thought the film was a fantastic adaptation and a very solid thriller even if you didnt read the book. Ron Howard did an excellent job in adapting the material into a visually arresting film that a larger audience can enjoy. My advice go see the film dont always believe what the critics have to say if you read the book you'll definatly enjoy the film and if you didnt you still will because it has a great cast and a great story that will keep you on the edge of your seat until the very end."
    },
    {
      "rating": "8",
      "text": "Under-rated, over-hyped and a darn-fun great translation of a good book."
    },
    {
      "rating": "10",
      "text": "Fantastic movie, very true to the book. But this movie is sure to get mixed reviews, it depends on your beliefs, that's why there is so much contrast in the reviews we are getting by the critics. Plus critics make mistakes sometimes. they're only human. The movies is great, loved it. Casting was well done and the settings were amazing. The acting is pretty good, not as bad as the critics said it was."
    },
    {
      "rating": "8",
      "text": "This was a fine, cerebral telling of an interesting story. Critics hate it, which signals \"good film\" to me. To a population raised on M:I:3 and Spiderman, yes, this is talky and slow in parts. It actually, God forbid, requires some thought. If you go to this movie expecting explosions, unlikely romance, and non-stop impossible missions, you'll side with the critics. If you want a movie that is based in historic facts, plays with religious beliefs, and still manages to keep the educated viewer on the edge of his/her seat, you'll appreciate The DaVinci Code. Most telling comment regarding the mental capacity of today's audiences...overheard leaving the theater: \"Man, one mediocre car chase. Other than that, I was asleep...\" 'Nuff said... Ian McKellan has a field day,and should win an Oscar (but won't), Tom Hanks was good (though I'd have preferred George Clooney), and Audrey Tatou did a fine job. Ron Howard was faithful to the novel. The cinematography, music and editing were top-notch. But, hey, it's no \"Saw 2\", so most viewers will find it boring."
    },
    {
      "rating": "0",
      "text": "This movie was a sorry excuse for a book adaptation. Howard, Hanks and the rest of the gang had a real opportunity to really make some noise in the world with a controversial best seller that is sure to be a hit. Instead, they are so afraid to test the boundaries that they are stuck in their own bubble of boredom and solemn. The character development prunes rather then ripens, the story \"for what it's worth\", is cut to peices and Howard has shown once again that he would rather be the family man then make a controversial movie worth waking up to. Next time I want to see a visionless rendition of a story, I'll just go to sparknotes."
    },
    {
      "rating": "8",
      "text": "Enjoyable movie. After all isn't that what it's all about? Tom Hanks is a wonderful actor( one of my favorites), but may not have been my first choice in this role. There is little connection between Hanks and Tautoo, no sexual energy as in the book (Hanks is unfortunately much older than Tautoo).Those who read the book know Brown spent much time explaining his characters and society backgrounds. It would be impossible to spend the time necessary to go into the detail that Dan Brown did and keep the movie to under five hours. I think Howard did a good job in trying to bring up the salient points and keep the movie flowing. Tautoos accent is very heavy at times and difficult to understand during critical scenes. (A comment by my wife was that she ran through the whole movie with high heels and no limping at the end). Without revealing the plot, I was amazed that the Knights Templar would allow Tautoo to work as a law officer knowing her background. A very entertaining movie and worth seeing on the big screen versus DVD. Go see it!"
    },
    {
      "rating": "8",
      "text": "Great movie. I can understand why some people wouldn't like it (or understand it). The end stretches itself out a little too much and some important aspects of the novel are absent from the film. However, these negative aspects of the film are insignificant, as the movie is awesome. But the book's better. ^.^"
    },
    {
      "rating": "6",
      "text": "Never read the book, but the movie wasn't a total failure. The plot twists kept me entertained and there was just enough action to both reatin the film's propsed heady status and restrict it from falling into an explosion fest. The dialogue was pretty uninspiring and Tom Hanks was kind of dull (for a lead role, he only really did something a few times). The movie became more predictable towards the end, but it was entertaining and considerably better than National Treasure (which DVC reminded me of with the artifact hunting). For what it's worth, I don't think I wasted my money seeing it."
    },
    {
      "rating": "8",
      "text": "My hubby and I really enjoyed this movie (neither of us had read the book). I had no problems with Hanks' acting and I thought the evil monk was a convincing villian. I like the brief flashback to the evil monk's past that gave you insight into the why he became who he is as it made him more credible. I think some of the super-low reviews are based on people either a) taking offense due to their religious views or b) marking the movie down because it isn't 100% historically accurate. People need to remember this movie is fictional, meaning not real. Pirates of the Caribbean and Harry Potter are both fictional creations too -- I wouldn't expect people to pan them for their bending of reality, just like they shouldn't pan this movie for doing the same. I recommend this movie be seen in the theatre, it's worth the cost of the ticket (and a babysitter)."
    },
    {
      "rating": "3",
      "text": "This film's treatment of history was very clumsy: outright untruths are heralded as great \"secrets\" kept from the world by the utterly evil Catholic church. Not only that, but Tom Hanks' performance was mediocre at best. The plotline was moderately entertaining for the first half-hour or so, but then the wild goose chase just drones on and on. Had Brown taken a few more history courses, and had the director dropped another hour or so onto the cutting room floor, this may have been worthwhile."
    },
    {
      "rating": "3",
      "text": "Ive never read the book and to be honest i wasnt really looking foward to seeing it but the wife wanted to see it anyway. normally im pretty good at following plots but as ive never read the book i came out of the cinema having to ask questions even the wife couldnt answer, im sure the book covers why the Opus Dei wants loads of money from the churchand why the bank manager wants to kill them and why there is 50 burly blokes and one grandma at the end of the film, This Movie would have been 10 times better if we had left it to indiana Jones to find out as he done a better job of it in the last crusade."
    },
    {
      "rating": "0",
      "text": "I went to this movie expecting it to be an \"okay\" movie. And, it was about the opposite. This was the first movie that I actually walked out of. I was bored to death, boring story line, cheesy and just lame. I left an hour in. This was the worst movie (from what I saw) that I have ever seen. It seemed like an 'Uwe Boll' movie. Really it's that bad. Avoid at all costs."
    },
    {
      "rating": "4",
      "text": "The book was not that good, but at least it had rythm, totally lost in this totally missed movie. The story is badly told, perhaps the film makers assumed that the public would have already read the book anyway."
    },
    {
      "rating": "8",
      "text": "An excellent adaptation of the book - faithful, but modified appropriately to ensure a deeper understanding of the plot. A bit of perspective, perhaps, would help in realizing that the book was not a textbook and neither is the movie. Rather both are designed to entertain first and foremost. Not Hanks's best performance, but this is not an Academy Award kind of movie! This is a fun blockbuster with stimulating ideas. Dan Brown is not the first to advance some of the Templar/Mary/Grail ideas, but he is certainly the first to make a fun, exciting story from it."
    },
    {
      "rating": "10",
      "text": "Excellent movie. It is well worth your money to see this film. Usually after reading a book, the movie is such a let down, but not this time. Again, this is a great movie."
    },
    {
      "rating": "0",
      "text": "The Da Vinci Code is one of the most predictable and nebulous movies I've seen in quite a while."
    },
    {
      "rating": "4",
      "text": "It seems it solves puzzles to solve puzzles. not worth the hype. Plus out of hudreds of years of having the decoder and knowing its related to Issac Newton and the bible, and needs a 5 letter word to decode, it sure seems somebody would of guessed APPLE. Maybe were all just idiots and not supposed to think that \"complexed\"?"
    },
    {
      "rating": "7",
      "text": "Dear Mr. Howard (\"The Da Vinci Code\" director) and Mr. Goldsman (\"The Da Vinci Code\" screenwriter): Where have all the suspense gone?"
    },
    {
      "rating": "9",
      "text": "Much better than the book! But that's not saying much. I rate it high because I think it is a very tough book to make into a good movie, especially a big summer movie, and I think they pulled it off. Entertaining and interesting."
    },
    {
      "rating": "9",
      "text": "The critics were wrong.The movie was entertaining and fast paced.The actors were good and were faithful to the book."
    },
    {
      "rating": "3",
      "text": "If plot holes bother you, don't see this film. I went and saw this movie just to spite everyone protesting it, and I came away with quite a few laughs. It's not a comedy, but Da Vinci Code is so poorly thought out and assembled that you'll find humor in several of the lines and shots. I didn't read the book, but I can't imagine it being as bad as this film. At the end of the day, the creators walk away with fat checks, so congrats on marketing an awful film. The unintended comedic scenes.bring my score up to a 3."
    },
    {
      "rating": "8",
      "text": "A great book to film adaptation. I think you have to read the book to really get what is going on, but even if you havent you still may catch on. Good film, but the reading book was better and more fun."
    },
    {
      "rating": "3",
      "text": "Awful. The book is gripping. The movie is not; it's a dud."
    },
    {
      "rating": "0",
      "text": "The film and its actors must be inmediatly considered as front runners for the Raspberry awards... they are the sure winners."
    },
    {
      "rating": "6",
      "text": "Good mystery."
    },
    {
      "rating": "9",
      "text": "Never read the book, but I've read the critics reviews and was expecting to be disappointed...seriously, if you want to see this film, go see it, because it is a classic in the making. What's up with the acting? Tom Hanks? he's just his usual self again in this film, on form. I think the response from the media is bizarre to say the least, maybe other powers are at work here... heh. I dont think the critics are really helping by giving away key parts of the film in their reviews, I knew the big bombshell before even seeing it, just because of the spoilers their giving away. Basically I think this film has been hyped so much that it was on the cards that it would get slated... Just too many people have read this book, its not a fantasy film were adaptation can be based around alot of creative elements which most people can not envisage, but a story which every individual has their own perception of what it should be.. and looks like the critics had a collective image of what this should have been, what that is I dont know...."
    },
    {
      "rating": "7",
      "text": "Alfred N B: It is a movie for entertainment purposes. Quit bringing in your religious pontification to the discussion. It is not a documentary, doesn't say it is fact. It isn't a great MOVIE by any means, the pacing is bad, the acting a bit wooden. But don't decry it for going against your religious beliefs. And don't get me started on your complaint that they Catholic church, Jesus, et al are portrayed \"with so little factual truth.\" If you have factual truth about all of this, and I'm not talking about the Bible, please, let's all see it."
    },
    {
      "rating": "6",
      "text": "An OK mystery with too many endings. The hype around it, made me expect it to be great. It fell far short of the hype."
    },
    {
      "rating": "8",
      "text": "I did not get around to reading the Da Vinci Code, although my family did and I knew the premise and a little of the controversy that surrounded it. I was hesitant about seeing the movie after reading the reviews. I thought that it may be a waste of time and money. I generally agree with critics, but this time is an exception. I found the movie thought provoking and entertaining. I am somewhat baffled by the religious zealots, as this is obviously a work of fiction that simply may get you thinking. Nothing wrong with a little thinking! I am glad I ignored the reviews and went to see this film. I thought maybe I enjoyed the film because I had not read the book, often the book is much better than the film, but my husband having read the book enjoyed it as much as I. I invite movie goers to go see The Da Vinci Code with an open mind and they should find it is time well spent."
    },
    {
      "rating": "5",
      "text": "I found that by the half way point my concentration was wandering. Perhaps too much talking and explaining. Perhaps I was just confused as to where the movie was going. I actually thought the movie had ended ... well, at least four times. Finally when the end did arrive I didn't see the point. So what?"
    },
    {
      "rating": "7",
      "text": "It entertained me and the people I went to see it with... also I don't remember such an out cry out the factual inaccuracies in Troy, or in Braveheart!!"
    },
    {
      "rating": "8",
      "text": "Exciting. Critics at Cannes seem to be getting better and better at picking bad movies and missing good ones."
    },
    {
      "rating": "8",
      "text": "This is a great compliment to the book. There are some parts missing but overall it is nothing major. The movie seemed to move a little to quickly in the first half but later finds a perfect pace in the middle. Enjoy the book, enjoy the movie!"
    },
    {
      "rating": "4",
      "text": "Too-safe adaptation of the book. No mistery, no suspense...Hanks and Tatou just ridiculous."
    }
  ],
  "recommendations": [
    "the_mortal_instruments_city_of_bones",
    "eragon",
    "vampire_academy",
    "the_golden_compass",
    "inferno",
    "v_for_vendetta",
    "dreamcatcher",
    "ready_player_one",
    "the_hunger_games",
    "the_chronicles_of_narnia_prince_caspian",
    "artemis_fowl",
    "warcraft",
    "john_carter",
    "it_chapter_two",
    "the_butterfly_effect",
    "the_giver",
    "percy_jackson_sea_of_monsters",
    "tinker_tailor_soldier_spy",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "divergent",
    "green_lantern",
    "the_book_of_eli",
    "cloud_atlas",
    "city_of_ember",
    "bright"
  ]
}