{
  "id": 4344,
  "title": "The Lodge",
  "starring": [
    "Riley Keough",
    "Jaeden Martell"
  ],
  "runtime": 108,
  "genre": [
    "Drama",
    "Horror",
    "Thriller"
  ],
  "description": "When a father is forced to abruptly depart for work, he leaves his children, Aidan and Mia, at their holiday home in the care of his new girlfriend, Grace. Isolated and alone, a blizzard traps them inside the lodge as terrifying events summon specters from Grace's dark past.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/k5E8RCvDY08TntH6Ujxmq1gbOZB.jpg",
  "categories": {
    "plot": 4.461538461538462,
    "acting": 6.4,
    "ending": 6.538461538461538,
    "soundtrack": 5.0,
    "cinematography": 6.833333333333333,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A family of upper-class, oblivious, self-centered idiots, previously unpunished and uncorrected by society or life, uses and manipulates a frail young girl to their own detriment while outside the protections of a self-endulgant society."
    },
    {
      "rating": "8",
      "text": "The Lodge is a surprising horror movie, the tone and vibe it establishes from the beginning is eerie, creepy and unconfortable and it perfectly matches the story told. The scares and the overall horror are done amazingly well, there is one scene in particular that completely shocked me of how unpredictable it was, such brilliance can't be found that often in horror movies nowadays. The acting is soberbe, everyone was great, I think that Lia McHugh deserves a big recognition for this, with such young age, brought unbelievable emotion to this movie.More movies like this, Hereditary and The Babadook, that perfectly settles the tone of the movie and astounish us with such a beautiful cinematography, where every scene is shot with passion and big attention to the use of colours and light, should get more recognition, in a way that we can improve the horror cinematic, and start watching some good movies."
    },
    {
      "rating": "8",
      "text": "Terrible father leaves his children alone in some place that resembles the hotel from the Shining with his new girlfriend, who happens to be the ex-member of a cult."
    },
    {
      "rating": "7",
      "text": "A solid imitator of other, better horror movies (Hereditary, The Witch, even The Shining) with excellent performances and creative and evocative camerawork that frames every moment with intentionality. The first half is extremely strong, and if the movie had kept it up I would highly recommend it. Unfortunately, around the 1 hour mark, you might find yourself losing your patience as The Lodge keeps building its atmosphere after it is already solidly \"built.\" This results in a movie that is probably 15-20 minutes longer than it should be, and that narrative fat ends up draining a lot of tension. For me, the ending was effectively horrifying but also overdue.That being said, if you've already watched all the other highly-rated \"prestige\" horror movies of the 2010s, and you're craving a movie that's at least as classy as them, if not as polished, The Lodge is worth your time."
    },
    {
      "rating": "7",
      "text": "I get it. I really do. I get the message, but that doesn't mean that I didn't hate it. And I get that that is the point. The end is supposed to piss you off. So, hey. It succeeded it what it attempted to do. The acting is great. The visuals are great. It's pretty well put together. Objectively: 8/10. Personally: 4/10"
    },
    {
      "rating": "10",
      "text": "spot on the creepiest freaky movie of 2020 thus far ive seen !!! sound camera and 5 actors and they spit out a classic horror film 10 stars for doing what they intended !!! creppy movie"
    },
    {
      "rating": "7",
      "text": "Potential. And that's what's frustrating about it. \"The Lodge\" has the talent. The atmosphere. The plot, when it shines, is eerie and captivating. Where it leaks...are giant craters. Why would a father practically abandon his children in a cabin with the girl he cheated on their now-deceased mother with? I could believe this concept if he left another family member with them--a grandmother, maybe? Still...We needed more scenes with the father to fully understand his perspective. Otherwise, he is dull and selfish. Like others mentioned, I feel bad for the kids but don't see why they would drag out their prank for so long. Couldn't they overpower her, distract her? Throw ashes from the fire into her eyes, grab something and hit her with it? If they had tried those things, THEN failed, I would have been more convinced. But they never put up a fight. I suppose I understand feeling shocked into silence...but they never try to give it their all? Not once?"
    },
    {
      "rating": "10",
      "text": "Emotionally draining and mentally scarring, The Lodge will linger in your mind for days after viewing. Keough’s performance is profound and particularly shines in the third act. One of the best winter horror movies in the last decade. In the same vein as Hereditary and The Shining."
    },
    {
      "rating": "10",
      "text": "Deeply chilling. A very unique kind of horror. It starts off a bit slow but there’s enough suspense to keep my interest. Loved it!"
    },
    {
      "rating": "8",
      "text": "More creepy and moody that truly scary, The Lodge seems to have been borne in the wake of Hereditary. In fact, it uses the same convention of the model house and miniatures.  However, the performances are uniformly solid.  The father is fairly ordinary, but the kids are incredible, and the girlfriend is excellent.  The back-story - how the father got to know his girlfriend - is pretty fantastic. It's over-the-top, but sets the tone effectively for the rest of the film. There are a couple of nice twists, and some excellent sound cues. I'd recommend this one."
    },
    {
      "rating": "10",
      "text": "So TWISTED!  Best seen in a cold theater, on a cold, dark night. Can't believe that was Alicia Silverstone. Great to see her again. The set-up is wild, and the execution is reminiscent of The Shining and other spine-tinglers. I can see this running on the late night circuit."
    },
    {
      "rating": "7",
      "text": "Relatively good film. The Lodge is relatively similar to films like Hereditary, It Follows and Babadook that are light on gimmicks and more focused on storytelling. The film is a little slow, but if you like films like that. This film is for you"
    },
    {
      "rating": "8",
      "text": "scored mostly for the photography and Riley Keough, the script was too thin to really enjoy fully. lots of potential, definitely Goodnight Mommy was far superior."
    },
    {
      "rating": "9",
      "text": "Great, depressing, eerie, sideways movie.  It was a bit slow unraveling, but what a ride with cutting tension,  Acting was excellent.  Not the typical hollywood farce of cheap tricks and tempo led storytelling.  Riley Keough's resistance is well played and one can't keep from feeling The Shining like dread Riley's fight plays out.  9/10 from me.  Kudos to Fiala and Franz, the directors."
    },
    {
      "rating": "8",
      "text": "Sadly, this movie is going criminally under noticed. This stylish, provocative, terrifying, disturbing horror thriller is brimming with strong performances all around. The movie centers on a pair of siblings who go away with their father and his new girlfriend after their mother has committed suicide. It's uncomfortable to say the least. And things get worse when the father had to leave for business. You see Grace the father's new girl suffered trauma some time ago when she was the only survivor of a suicide cult. Strange occurrences begin to happen from her missing clothes, to their loss of power and creepy voices and visions. The atmosphere is thick with dread and the movie is psychologically tormenting. The movie feels surreal and it's such a strange( in a good way) cinematic experience. I knew from pretty early on what was going to happen but I didn't know to what degree and was still shocked as things began to roll out. This was the movie I wanted Hereditary to be it's a aesthetically pleasing waking nightmare of a film. I would also like to point out Alicia Silverstone does the best work of her career here. In a small role she makes an amazing impression and in my opinion deserves some awards buzz.4.25/5"
    },
    {
      "rating": "6",
      "text": "The plot twists don't always work, but an impressively dark atmosphere and standout performance from Riley Keough will keep you on the edge of the seat through the film's entire runtime. The slow-burn buildup isn't for everyone, but fans of the genre will find The Lodge a satisfying entry."
    },
    {
      "rating": "7",
      "text": "Chilling and surprising movie, turns into a psychotic thriller towards the end. It really gets darker with each scene."
    },
    {
      "rating": "7",
      "text": "Taking cues from classics such as The Shining and Carrie, and modern day prestige horror such as The Witch and Hereditary, The Lodge is possibly the most chilling and unnerving horror film I’ve seen in theaters. Does it, however, stick the landing as a film? Somewhat. The first half of the film is a masterclass in building dread - with its mix of religious anxiety and ripped from the headlines horror - while the remaining half, though successful at keeping the audience at the edge of their seats and causing heart palpitations, makes the inevitable descent into modern, atmospheric horror cliches. The film has a premise that is original enough, but contains too many moments of “we’ve seen this before” to truly rise to the level of absolute excellence. Despite the flaws, however, The Lodge is a worthwhile experience for horror film lovers who seek subtlety and religious themes in their horror."
    },
    {
      "rating": "10",
      "text": "The Lodge (2020)Sinopsis:Una mujer que está apunto de convertirse en madrastra se encuentra atrapada, junto a los dos hijos de su prometido, en una casa alejada de la civilización por culpa de una fuerte nevada. Justo cuando la relación entre los tres empieza a florecer, la mujer adopta una actitud aterradora que proviene del adoctrinamiento religioso que sufrió en su dura infancia.Opinión:Este opresivo thriller psicológico podría ser una de mis películas favoritas y mejores del año, a nivel técnico es excelente, buena dirección, excelente fotografía y diseño de producción, buen y atrapante soundtrack, actuaciones convincentes y una historia prometedora y suspicaz.No todo podía ser perfecto, si bien la historia es impredecible y te atrapa desde el inicio teniendo un ritmo similar a películas tipo Hereditary y The Witch, el clímax y segmento final me dejaron marcando ocupado, deja cabos sueltos que comenzaron a aparecer poco a poco, pero al final los mas cruciales quedan a la deriva dejando al espectador con tremendo signo de interrogación sobre la cabeza, me encantó, no lo voy a negar ya que amo este tipo de películas, pero el final me dejó intrigado, quizás se me escapó algo, quizás no lo entendí, lo que sí es que tendría que verla de nuevo y analizarla bien.A quienes disfruten películas de este estilo se las recomiendo.Como dato, está dirigida por los mismos que dirigieron Goodnight Mommy, la cual también me había dejado dudas la primera vez que la vi y que entendí a la segunda.Valoración:5 ⭐ de 5 ⭐El final no influye en mi calificación final porque por ahora lo dejo al pendiente, si descubro que es un agujero de guión tendré que quitarle media estrellita."
    },
    {
      "rating": "7",
      "text": "Another indie project that turned a nice surprise, the movie is very well done and a great way to spend your time. Give this one a chance."
    },
    {
      "rating": "5",
      "text": "The Lodge has it’s moments but overall doesn’t budget time well and isn’t engaging enough to achieve the atmospheric terror that it’s trying to create.5.5 out of 10"
    },
    {
      "rating": "6",
      "text": "The Lodge is another horror film that bets heavily on atmosphere instead of the cheap scare. Obviously, that will divide the audience, but this is how it works nowadays and it's good that there are enough options that aren't trying to fool people with the same scares over and over again.Although I admit that it will be more to the liking of viewers who don't expect things to be so easy.Admittedly, the balance between intrigue and suspense isn't as ambiguous as I think the directors wanted to imply, but the film never falters in a serious way.Although I acknowledge that a slightly faster pace, not an accelerated one, would've been a little more useful, because as I said, the bet of the film goes for the atmosphere and the tension, but there comes a point where you can abuse of both and this film skims over that line multiple times.The conclusion is simmering but I felt that it didn't manage to be so satisfactory because even though the film embraces the supernatural element, ultimately it doesn't go all the way with it.Without spoiling, let's just say there isn't something great waiting behind the curtain.Personally I can say it deserves the opportunity. Just keep in mind what kind of horror you will be seeing."
    },
    {
      "rating": "2",
      "text": "You don't need much backstory. Suffice it to say that 2 children and their young stepmother-to-be (with a tainted past) are trapped in the titular dwelling. Things get a bit creepy before going off the rails. There's potential here and the 2 kids (Jaeden Lieberher & Lia McHugh) turn in strong performances. Even their dread can't overcome the tedious lulls between the few minor frights. There's certainly an atmosphere of apprehensive expectation that permeates the proceedings, but there's not enuff payoff in scares or conclusion to make it worth sitting thru the slow parts."
    },
    {
      "rating": "6",
      "text": "With \"The Lodge,\" co-directors Veronika Franz and Severin Fiala deliver a film that essentially abides by the same sort of elemental setup as their previous film, \"Goodnight Mommy.\" This time around, however, you're given entirely different circumstances and thematics to weed through as a viewer. Boasting an unforgettably pervasive sense of dread and a terrific assortment of images all throughout — both disturbing and otherwise — I'm quite confident when I say that I believe these filmmakers are amongst the cutting edge of indie horror. My only issue with the film is one that unfortunately trends into spoiler territory, so I'll suffice my thoughts with as much vaguery as I can. Basically, once things wrap up, you as an audience member quickly realize there's not really any character left you wish to root for. Still, though, the bleakness of that revelation kind of bolsters the film's thematic backbone. It's not exactly a satisfying watch, but for fans of other indie horror films that have caught so much attention in the past half-decade or so (i.e. \"It Follows,\" \"The Witch,\" \"Hereditary,\" etc.) I'd say it's borderline required viewing."
    },
    {
      "rating": "3",
      "text": "The cinematography, credible acting and peculiar plot of The Lodge is certainly unable to carry the many missed opportunities that really leave the film without any reason for its run-time. The first half is touching, even eerie at times, but it all culminates to a predictable, uninteresting and inconclusive second half."
    },
    {
      "rating": "5",
      "text": "This is mediocre at best. I find the screenplay to be rather bland with some pretty cringy director moves. This is not  a horror film. If you came to get scared, do not bother buying a ticket. This is a pure psychological thriller movie that leaves your head on a swivel on multiple occasions. Although there are many instances where you are thinking a scare will come, it never happens. The plot seems redundant, with some easily recognizable outcomes to surface while the character development seems to draw blank about 30 minutes in. This movie is also ver boring even though it was suppose to show suspense most of the time. The acting and cast seemed to be one of the weaker parts to the film. With Keough taking majority of the film, I thought she did great. The rest however, not so good. The rest of the cast seem to lack development and do not provide a chemistry that is needed for a film that has this small of a cast. There is only 4 main characters throughout the entirety of the film because most of it is at the Lodge. The cinematography is good. There were some interesting shots with the snow that enhanced the thriller aspect that is not normally seen in this category, which was enjoyable. There is a balance of good and bad, but I do not see the light at the end of the tunnel for this one. Not too bright. This is a film that is beyond predictable, with mediocre screenplay, and below average acting. In the end, cinematography can't save everything. The Lodge is definitely a movie that you wanna see once and never ever ever again."
    },
    {
      "rating": "5",
      "text": "There is a dog in the movie. Let me guess, it dies?YUP. Along with every other overplayed movie trope. Also you end up feeling bad for no one in the film."
    },
    {
      "rating": "0",
      "text": "No plot, no story, characters are flat.They could have taken a deeper approach with a deeper meaning but they chose an easy way out of it.Waisted 2h"
    },
    {
      "rating": "1",
      "text": "The most evil kids. Most evil in front of Omen kid. The movie has all the potentials to be a nice horror movie. But..."
    },
    {
      "rating": "5",
      "text": "I think the 5 out of 10 score is perfect. I had to look online for explanations to the movie after I watched it to make sense out of the movie. These kids were very evil! overall an Okay movie to watch. Not as good as Hereditary by any means."
    },
    {
      "rating": "0",
      "text": "In fact, this movie seemed really brilliant on its first half, building tension and causing some doubts on the audience about the existence of paranormal stuff going on or not. The problem is exactly the storyline, really confusing and lacking some explanations on the second half of the movie and the slow pace.Final twist was expected to save the day but it was the opposite."
    },
    {
      "rating": "2",
      "text": "Wow.... How have the Metacritic scores not gone into the red? I saw the ending coming from a mile away. This whole movie could've been avoided, the dad was so f'ing stupid. At least all the malevolent people in the movie died."
    },
    {
      "rating": "0",
      "text": "Incoherent garbage. It’s slow, boring and lacks any semblance of a plot. The directors spent no time putting together an actual story, they think  dimly lit shots of a frozen lake are creepy enough to scare. Disregard any critic that recommends this trash."
    },
    {
      "rating": "0",
      "text": "This movie is a funny imitation of Hereditary! But the biggest problem with the film's plot is the lack of a serious perspective.Shall we go with Grace or the children? This is a question that screenwriters do not know the answer to."
    },
    {
      "rating": "6",
      "text": "This movie could have been a 7 if only the first 30 minutes would not have been focussing on the relationship between Grace and the kids. I understood it after 10 minutes. Secondly i would have loved to see more on how Grace developed mentally after what has happened to her during her youth. And what effect it had on the present Grace. It just left me with a lot of answers, only because the premise of the movie looked good at the beginning. But the cinematography was awesome!!!"
    },
    {
      "rating": "0",
      "text": "This was one of the worst **** movies that i have ever seen. I do not recommend this anyone dead or alive i have litteraly wasted 2 hours of my **** life staying up for this **** Get cancer."
    }
  ]
}