{
  "id": 2292,
  "title": "The Wall",
  "starring": [
    "Aaron Taylor-Johnson",
    "John Cena"
  ],
  "runtime": 90,
  "genre": [
    "War",
    "Thriller",
    "Drama"
  ],
  "description": "An American sniper and his spotter engage in a deadly cat-and-mouse game with an Iraqi sniper.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8POAZwZpp24l1IgKKM8ZRAQ2kid.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 8.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "While browsing on imdb for interesting scifi flicks to watch I stumbled upon this Austrian science fiction film. A scifi concept movie I should say: there are no lasers or spaceships or any other hi-tech stuff to be seen. A woman (her name is never mentioned) goes on weekend in a mountain cabin with and elderly couple. The couple leaves to take a walk but never returns. Reason: the Wall or 'Die Wand', an energy forcefield which keeps everything from going out or comming in. This leaves this woman completely cut off from civilization, society and basically everything she knows and loved. Obviously this is what this film is about. It's not about explaining why this wall is there or who built it or for what reason. It's about the mental, emotional and ethical problems that arise when there is no more society to live, work and function in. This film was apparently based on a successful 1963 Austrian novel. The whole film is told via the voice-over of the woman (she never has any direct dialogue) and all the acting is delivered through expressions or actions. This was smart on the part of the filmmakers coz it works well and it feels a lot like a book. Although the film lasts only 103 mins it does have a slow pace, but like a book you have to take time to see it at the pace it's intended too. Recommended!"
    }
  ]
}