{
  "id": 3513,
  "title": "The Pyramid",
  "starring": [
    "Ashley Grace",
    "Denis O'Hare"
  ],
  "runtime": 89,
  "genre": [
    "Horror"
  ],
  "description": "An archaeological team attempt to unlock the secrets of a lost pyramid only to find themselves hunted by an insidious creature.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/joPb4PUPP7xClD6XPiQ7laBEtZf.jpg",
  "categories": {
    "plot": 3.2,
    "acting": 3.1666666666666665,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Cheap and just plain bad. I'm better used by the director and can only shake my head for so much trash crap.\r---------- --------------------- ------------------------ ---------------------- -------------------------"
    },
    {
      "rating": "2",
      "text": "Before watching this movie, I set my expectations at non-existent for The Pyramid, a movie that has been claimed as one of the worst movies of the 2014 by some critics, and I can confirm that that statement is true. This film is a compilation of everything that could go wrong in a horror movie while still trying to convince the audience that it's not a parody. The Pyramid could almost be an experiment to see how many cliches they could put into a film, and that reason alone makes this movie an enjoyable exercise in bad taste. For starters, it has the exact same plot as The Tunnel, a vastly superior and terrifying Aussie found footage flick. In that movie, a documentary crew explores the abandoned Sydney train tunnels as they investigate a government cover-up until they become lost and realize something else is lurking in the tunnels. The only difference between The Tunnel and The Pyramid is the fact that it takes place in a pyramid in Egypt. This movie is also half-found footage and half-traditional. What I mean by this is: you'll see an entire scene from the point of view of their cameras, and then in the next scene, we see a scene shot like a normal movie. It's like this movie tried to shoehorn in some found footage just to include another overused horror trope. Along with the inconsistent cinematography, you'll find one of the most annoying groups of people you could ever encounter in a film. The \"protagonist\", if I can ever call her that, looks like she's fresh off the set of Real Housewives while another character screams \"We need to find a way out!\" in between every single line of dialogue. I don't think I even need to mention that the \"villain\" could get the award for Worst Movie Monster. It's almost amazing and certainly entertaining seeing how many things can go wrong with this movie. Just sit back, have some friends over, and laugh at this trashy, ironically entertaining atrocity. The Pyramid is ultimately a misguided and fun monstrosity of a horror film."
    },
    {
      "rating": "1",
      "text": "When I went to see this movie, I had read the reviews and was hoping that it wouldn't be as bad as reviewers said.   I was sadly disappointed.  The idea has/had potential:  discover a new pyramid, go inside to explore and meet an Egyptian god or alien and interact.   With a decent script (this script was absolutely rubbish----PAINFUL to sit through), the movie could potentially have been palatable.    As it was, the movie was just a series of gore and fright filled scenes with no intelligence or creativity or reasonable dialog whatsoever.    This may be the worst movie I have ever seen."
    },
    {
      "rating": "0",
      "text": "I think i saw this movie before... wait... (rustle) (rustle)... (blowing of dust off of VHS tape)\rHere it is \"The Mummy\".\rI HATE camcorder movies, and i hate cheap scares. do not watch"
    },
    {
      "rating": "0",
      "text": "Well this flick gets my worse film of the year award.  I walked out about 30 minutes into it.  Makes me wonder why a producer would put up money on this disaster. Save your money & choose another one."
    },
    {
      "rating": "4",
      "text": "The film had some moments that just make you cover your sight from the screen and sit in discomfort but the film provides great tension throughout certain climactic moments. It could have been greatly improved although it was a rather stable movie, considering most viewers are interested in the jump scares. I was expecting a very harsh ending but it looked like the director run out of ideas and just placed a very unpredictable scene to finish the movie off, which made the film seem much worse than presumed."
    },
    {
      "rating": "4",
      "text": "The claustrophobic and dark corridors that can be found in a pyramid could have translated well to a horror movie by at least giving it an interesting setting. Unfortunately this movie fails to capitalize on it. What we are left with is a scareless horror movie that experiments with some good ideas but ultimately falls short in just about all of them.\r I was kind of hoping for an As Above, So Below style horror film. That movie made great use of it's claustrophobic setting to create an Indiana Jones style horror film that while not scary was still enjoyable (at least in this reviewers opinion). Unfortunately we don't get that here. While the characters in that movie solved ancient puzzles the characters in this movie fumble around in the dark and walk into traps while trying to act intelligent because they can read some hieroglyphics. That's the biggest problem with this movie. It doesn't know just how dumb it is.\r The use of Egyptian history and beliefs ultimately doesn't amount to much. The movie tries to shoehorn in as much of it as possible in order to give as much detail about what is going on as possible. The result is a film that feels like it talks way too much. Rather than actually trying to escape their predicament the characters are too busy talking about what the hieroglyphics are telling them is going on. It's annoying. The inclusion of James Buckley's character just serves as a way to have someone constantly tell the others \"hey, this is interesting and all, but we need to get out of here if we want to live.\" Yeah, the film even makes fun of itself.\r The film is shot in both a found-footage style and a traditional cinematic style. That's actually a good thing as it means we aren't left watching too much of the film in first person through a shaky camera. Admittedly though this film doesn't seem to have much of a problem with the actors holding the camera still. The change between styles also means that we don't suffer through too much of the increasingly overused found footage style. The horror genre already has way too many movies like that so it's nice to see that this movie doesn't overdo it.\r The actual horror is practically non-existent. Everything here is borrowed. It's got your predictable jump scares and totally obvious callbacks to other horror movies. Some scenes are just straight up ripped off from classics. The monster design is actually pretty cool even if the not so great CGI is evident. There's quite a bit of gore here so if you are looking for a more supernatural horror film you may want to look elsewhere. This one feels more like a slasher film with a villain who isn't really present. I personally recommend looking elsewhere regardless. Simply put all of this is just not scary.\r What we get here is a movie with a lot of potential that ends up squandering it by being just another generic horror film that's filled with stupidity. Yeah, it's watchable, but why would you want to? It ends up being as lifeless as a mummy (which sadly aren't in this movie). You should just save your time and watch something else."
    },
    {
      "rating": "10",
      "text": "to be honest, when I walked in, I expected a stupid, low budget horror flick, but I saw a crazy, horrific, hell hole of a blast! It scared me half to death! :D"
    },
    {
      "rating": "3",
      "text": "There was one movie that had a good a formula and isolation  that is \"As above so below\" and The Pyramid has a slightly well formula but with scares that are cheap but some of the script has good scares. Characters are idiotic and that's why the film fails! sure the writers have elegant detail. Just because this movie was produced by the guy who made 'Hills Have Eyes'  Grade D+"
    },
    {
      "rating": "4",
      "text": "The movie is cliché and poorly written,the acting is bad,the CGI effects are horrible and the movie is pretty boring except for the last half hour.If I gave this movie a 4 it's only because of the last 30 minutes.The rest is pretty bad."
    },
    {
      "rating": "1",
      "text": "december 5th is my birthday...i thought the two critic over there mentioned it being a manatee ....what the hell is matinee?  they just said it in the last robin hood....i don't think it means anything ....just looked it up.....means daytime musical or having sex twice......neither of those have anything to do with the movie.....one of my least favorite words now"
    },
    {
      "rating": "0",
      "text": "Dose anybody even remember this movie or is it just me, it's probably just me as nobody has brought up this movie after it's release and for very good reasons.\r The story is about a U.S. archaeologists uncover a pyramid buried deep beneath the Egyptian desert. But as they explore deeper and deeper into the tomb, they become hopelessly lost in its dark catacombs and passages. Anxious for daylight, they try to escape - but they are not alone.\r 6% on RT, 24% on Metacritic, 5.1 on IMDB and the movie also flopped big time at the box office, yep this isn't going to be sit and watch and man I wasn't wrong because The Pyramid has to be the most painful horror movies to date.\r Now is the movie scary? no actually the movie is rather dull and extremely boring. I think the reason the movie didn't build up to anything scary is because the writing felt lazy and the movies atmosphere was creepy or under the skin chilling, it was just flat out there and it wasn't effective enough to be scary. If you want a better horror movie with chilling atmosphere and a real build up then watch The Badadook, at least that movie got it right than this garbage film.\r The directing, the acting, the way the movie is shot is all awful just awful. I couldn't find a single good thing in this movie, it was plan bad."
    },
    {
      "rating": "4",
      "text": "The Pyramid is a found footage horror-film that was released on December 5, 2014. The events in the movie are suggested to have taken place in the Egypt desert in August of 2013. A research team finds a three sided pyramid in the desert and before shutting down the project completely they decide to take a peek inside.\r While I think the story itself had potential, the implementation was not particularly awesome. Part of that (, for me,) might have been because I felt reminded to 'As Above, So Below' a lot. A superior horrorfilm with almost the same premise, that did the implementation way better than 'The Pyramid' ( by the way, I'm not entirely sure if writers and or producers/directors worked on both movies ).\rThat is not to say the movie is all bad. In fact it is strongest in the beginning. I was genuinely excited when things started going south for the group and it became apparent that it was only going to get worse. There was also a scene where one could get a short glimpse of what was lurking in the pyramid in a doorway. Nevertheless this was about the scariest thing in the whole movie to me. Different folks, different phobes I guess. Eventually, I thought a 4 out of 10 was fair.\rThe reasoning behind that is that the characters are all very typecast and stereotypical, you don't really care about too many of them. The suggested monsters and scary features inside the pyramid are not very scary to begin with, which is a shame because with a setting like that there was simply so much more to be done and what supposedly was intended to be the horror and possibly even the plot twist at the end turned out to be just...kind of...weird.\r The pyramid is not the worst movie you will have seen in your entire life and it is not free of entertainment. With a couple of buddies and beer there will be some merit to it, even if it is just to comment on and criticise the characters behaviour.\rSo, in the end, a movie that could have been way better than it turned out to be due to wasted potential.\rTo watch it or don not watch it? That is the question."
    },
    {
      "rating": "4",
      "text": "The exotic pyramid barely offers any spectacle, since it's too dark and wobbly to see anything. It's confusing for a film to use found footage gimmick then change into normal perspective halfway, but still retains the shady shaky cam. The Pyramid attempts to create horror in a claustrophobic space with so called modern mockumentary style. This means despite its effort to build tension from the setting and mythology, it all comes down to running in darkness and screaming while audiences pretend to understand the scenes.\r After uncovering a strange pyramid, a group of scientists and journalists venture to see what is hidden beneath. Meanwhile, the neighboring city of Cairo is in turmoil from civil war, this creates a small timeline to record their findings. Thus, they go into the already proven dangerous pyramid with just a few safety measures. The characters are not that appealing, in fact the journalists are exact stereotype of rigid reporter wanting an award and timid cameraman who follows the on-screen girl as she predictably handles the situation with less elegance.\r The scientists are more audience friendly, at least the family relationship is more presentable. Nora (Ashley Hinshaw) and her father (Denis O'Hare) are the two leading amateur explorers who barely know what they are doing. They are decent, but occasionally become television presenters as they deliver the narrative. It just feels detached from the danger that lurks, the thrill is not consistent enough amidst the Nat Geo inspired description they utter constantly.\r The movie actually has a potential set up, visual has dusty flair and it's focused enough to be engaging. Unfortunately, after diving to the pyramid, the scenes are muddled and very chaotic. This is a persistent problem with found footage genre, but the movie switches back and forth into even stranger viewpoints. It could definitely offer better and brighter angles, and even the first person view should be more than flailing lights and occasional fumbling of a random person. The Descent from a decade ago has proved that it could be done.\r It also utilizes cheap CG that looks inorganic, the result is a rather anticlimactic scenes towards the latter half. The Pyramid has the advantage of exotic location and its myth, although this barely makes any different as it fumbles in the dark for half the duration. If only found footage genre can invest in steady cam."
    },
    {
      "rating": "0",
      "text": "I've watched hundreds of horror movies throughout the years and this\rhas to be the ABSOLUTE WORST so far. Everything is clichéd as hell and\rthe writing is insanely bad. There was NOTHING scary in this movie even\rthough it was meant to be a 'horror'. This film feels like its inspired\rby 'As Above So Below' except its 100x worse and more tedious.\r Pyramids are some of the most famous tropes when it comes to horror\rstories. Seriously how bad of a writer/director do you have to be to\rscrew this up? Honestly the 1999 mummy was 100x better. The acting is\ralmost as bad as porn acting. This is the first horror movie i've seen\rwhere I have ABSOLUTELY no sympathy for any of the characters and I\rjust want them to all die. ONLY watch if you're with friends and want a\rgood laugh."
    },
    {
      "rating": "5",
      "text": "Director Gregory Levasseur isn't able to make use of the claustrophobic sets in any way beyond what an average person with a smart phone can. He can't take the audience on a ride, the way good horror movies do."
    }
  ],
  "recommendations": [
    "chernobyl_diaries",
    "the_blair_witch_project",
    "malignant",
    "annabelle",
    "event_horizon",
    "the_curse_of_la_llorona",
    "the_host",
    "monsters",
    "dark_skies",
    "ouija",
    "bird_box",
    "insidious",
    "midsommar",
    "unfriended",
    "the_strangers",
    "the_devil_inside",
    "blair_witch",
    "the_medium",
    "host",
    "slender_man",
    "unfriended_dark_web",
    "countdown",
    "devil",
    "the_descent",
    "paranormal_activity_the_ghost_dimension"
  ]
}