{
  "id": 1295,
  "title": "The Shining",
  "starring": [
    "Jack Nicholson",
    "Shelley Duvall"
  ],
  "runtime": 144,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
  "releaseYear": "1980",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nRj5511mZdTl4saWEPoj9QroTIu.jpg",
  "categories": {
    "plot": 8.166666666666666,
    "acting": 9.0,
    "ending": 9.0,
    "soundtrack": 7.125,
    "cinematography": 9.285714285714286,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "First and foremost; don't go into this movie expecting a typical horror movie. It's not a jump-out-at-you scary movie. What it does do well is creepiness.\rThe first time I watched it I was pretty underwhelmed. It was one of, possibly the only Kubrick film I'd seen that didn't deliver on my expectations. Often a Kubrick film will go above and beyond my expectations. However the more I thought about it, and after watching it a second time, and watching the documentary Room 237. My thoughts on the film have become much more positive and enthusiastic. In a lot of aspects this is some of Kubrick's best work ever. The carefully thought out shots. The way he creates such isolation and hostility for the viewer. You're off in your own world in the Overlook Hotel. Jack Nicholson is fantastic in it. The music in it is very good and effective to adding a whole extra level to the movie. And it'd have to be the most mysterious Kubrick film ever made. Even more than 2001. There are so many questions you'll be asking about this film. The ending won't solve all your questions; it'll add more. You could interpret this movie from so many angles. If you become intrigued in this film even after you watch it, go on the internet and look at the various interpretations and things the film had that you probably missed. This film still remains a mystery three decades on, it's not a total crowd pleasing film but if you're interesting it's definitely worth a watch."
    },
    {
      "rating": "9",
      "text": "This is a truly great horror film. The movie is very different compared to other horror films. It follows  Jack Torrance (Jack Nicholson) who is staying in an old, empty hotel with his family and begins to go mad. The events in this film spin into the strange and scary. It has many scary moments and it is very creepy. It also boasts excellent acting by Jack Nicholson and Shelley Duvall. It did, however, take a bit of time for the horror to start, and also it was quite long, but it is still great."
    },
    {
      "rating": "9",
      "text": "This film is underrated if you ask me, it's always been one of my favorites if not my favorite horror movies. The best part, I think, is that it manages to be scary even though very few people die, as opposed to modern horror movies that fail to be scary even though everybody dies."
    },
    {
      "rating": "8",
      "text": "Jack was completely deranged and it was funny and scary at the same time. Not a damn clue at what happened at the very end which pisses me off, but everything was on key for this horror story."
    },
    {
      "rating": "10",
      "text": "A great classic."
    },
    {
      "rating": "10",
      "text": "One of the only truly epic horror films ever made, The Shining tops even greats such as 'Psycho' and 'Halloween.'"
    },
    {
      "rating": "10",
      "text": "This film is a classic, it is one of the best horror movies ever. No matter how many times I see it, it scares me all the time. The effect is perfect, you can note very good performances & of course the excellent music that makes the suspense. My favorite scene is when the kid goes inside the bathroom, what a surprise a had seen."
    },
    {
      "rating": "10",
      "text": "Absolutely semiotic, unique and visceral..................................."
    },
    {
      "rating": "10",
      "text": "A classic horror film for the ages, The Shining's genius (besides being directed by Kubrick) comes solely from the fact that there is no certainty of what is real or what Jack is imagining: and this is what makes the film so intriguing. Plus, Jack Nicholson is his most \"Jack-Nicholson-ish\" in this movie, making the faces and movements he's so famous for nowadays."
    },
    {
      "rating": "9",
      "text": "As far as I'm concerned, this will forever be the best horror story ever written for the screen. Incredibly eerie and creepy. It's great when a film can pull you in and intensify your heart rate without the use of cheap scare tactics. Even over 30 years later, this film truly strikes fear in my heart."
    },
    {
      "rating": "6",
      "text": "I think this is a fine film when it comes to the entertainment value. Other than that it's very overrated to me. I mean it's bland at more than one point in the movie and it seemed like Kubrick was just trying to make a shocking film as opposed to doing Stephen Kings book justice. I have to it credit for how gorgeous it was shot and how well acted it was (beside Shelly Duvalls horrible performance) overall a fun movie to watch with friends to me but nothing special at all."
    },
    {
      "rating": "4",
      "text": "Pretty bad movie.  I just watched it first time and it's not what i expected. First, that woman is annoying. I hate her running style, its like from some parody, maybe first 30 minutes she was mysterious and interesting, then later she totally lost herself. Jack did awesome work, he laugh and he's angry in same time, change many faces in one scene so we can actually read his mind, which is pretty cool. Kid was pretty awesome too, one of best kid acting i saw lately in horror movies. But, i dnt think this is horror, it's more like drama. There was few really long scenes, that dnt really need to be that long. Anyways, worst thing about movie is music. You cant focus on scene because you need to take off your headphones because music become too loud on some scenes, and music is just random and weird, i really didn't liked that part. Not to mention that black guy traveled a lot to get one hit in chest after he just walked in hotel lobby. Pretty lame, he got involved in story too much, and he didnt had even one line when he arrived at hotel."
    },
    {
      "rating": "9",
      "text": "\" The Shining is one of the best horror movies of all time. In Shining isn't much gore like in new horror movies, but with good music, camerawork and scary twins this movies still scares me (in 2016). If you like psycho horror movies, not slasher then this is something for you!\"\r GENRE RATING (HORROR): 9.3\rOVERALL RATING: 8.7"
    },
    {
      "rating": "9",
      "text": "Kubrick directing Jack Nicholson on a film based on a Stephen King's novel. So you already know that:1)Directing is superb. Everything is crafted so carefully since the very first minute.2)Acting is fantastic. Although i dislike Shelley Duvalle interpretation Nicholson alone is worth seeing. One of the best performances in the history of cinema.3)It will be scary. And i don't mean cheap jumpscares. I mean the anxiety that haunts you for days after you leave the theater. You will not jump on your seat watching it. But you will never forget it."
    },
    {
      "rating": "10",
      "text": "Definitely the greatest horror film of all time. This movie only has mixed reviews as there is not enough time for everyone to discover and analyse this film to the grand level of intelligent depth it takes psychologically. A perfect movie, never to be fully appreciated or understood."
    },
    {
      "rating": "10",
      "text": "Sod The Exorcist and what you've heard because The Shining is without doubt the scariest and greatest horror movie ever made!!!! Beautifully creepy music throughout and unforgettable performance from Jack Nicholson as the winter caretaker of the Overlook Hotel who loses his mind and finds redemption only in murder using an axe to go after his wife and son, Danny who has the shining ability and talks to some imaginary little helper named Tony but he's very real and warns Danny of danger. Some creepy moments including what Jack Nicholson discovers in the bathtub in room 237 plus the Grady twins and the river of blood gushing from a hotel elevator... Beautifully directed with sometimes amazing scenery especially from the start. The Shining has suspense and horror wrapped in a beautiful red bow and it delivers like no other horror movie has managed to do. Directed by Stanley Kubrick in 1980, The Shining delivers!"
    },
    {
      "rating": "9",
      "text": "This movie in my opinion is the best horror movie ever made there's just so much hidden details and hidden meanings behind it and the writing and cinematography are top tear it's overall a brilliant movie even the ending just leaves you sitting there wondering for a long time what it all meant so it's definitely worth a watch if your into mysterious movies"
    },
    {
      "rating": "8",
      "text": "One of Kubrick's best films.I just think the bathroom sequence should have been taken out of editing. It is insulting....In this film, I learn that grotesque characters are one of the best ways to summarize an adaptation of a long story. That Kubrick has done well."
    },
    {
      "rating": "10",
      "text": "By far, the best horror movie ever made (other than  \"Psycho\"). Its imaginative, chilling, groundbreaking, well acted, well directed, and an all around masterpiece. To be honest, this movie is the reason I love Stephen Kings books and movies, it set the stage. The main reason that I like the movie is that its a horror movie but its not like a generic slasher flick that depends on the gore and violence, its not like that. Its an extremely imaginative movie that is based off of psychological horror, there's a lot of psychedelia in this movie, I'm not going to lie to you. It will put your mind to the test, it makes you think, how many movies can do that in such a beautiful way. The tone of the movie scares me, its a truly memorable film. I recommend this to all movie goers!"
    },
    {
      "rating": "9",
      "text": "This movie was always suspenseful and intense since the first shot. It did an amazing job at keeping me scared, which horror movies nowadays aren't even good at. I don't understand how people don't like this."
    },
    {
      "rating": "10",
      "text": "A masterpiece of horror cinema history. \"The Shining\" is strange, a slow-burning, step by step haunting and disturbing your mind till it blows and your mouth gaped. Stanley Kubrick and Jack Nicholson's outstanding performance bring this film to high level and hard to matched and put it to be a  standard for modern horror film. At last, The Shining is the greatest psychological horror ever made and I'm convinced that credit never switch to another film for long long time."
    },
    {
      "rating": "10",
      "text": "For whatever reason it's taken me nearly 40 years to see this movie. I was familiar with all of the iconic scenes. But had never watched it in it's entirety. I now consider this a total failure of my youth. The Shining is my favorite of Kubrick's movies - and it ages incredibly well (unlike perhaps 2001 where the startling special effects are no longer so startling 50 years later). I'm not sure this is a horror movie, what I am sure of is that it is one of the greatest movies of all time. Brilliant. Kubrick is peerless amongst directors."
    },
    {
      "rating": "8",
      "text": "Great horror movie! The shining is suspenseful will keep you on the edge of your seat till the end! Jack Nicholson performance is perfect if not his best performance. Same people may say this movie is \"boring\"due to its character build up, that's the best thing though.  Kubrick did a great job with directing it, the acting is done well, a classic! definitely worth a watching 8/10 :)"
    },
    {
      "rating": "9",
      "text": "Lets just say even though this movie isn't terrifying, it has an outstanding plot line to it, and is a true creepy classic. Jack Nicholson has outdone himself!"
    },
    {
      "rating": "10",
      "text": "The Shining was another one of Kubrick's masterpieces. From what I've seen, The Shining is Stanley Kubrick's second best film following 2001: A Space Odyssey."
    },
    {
      "rating": "10",
      "text": "The Shining is a timeless classic and is the perfect example of horror. It has intense and suspenseful, yet also creepy and chilling scenes. It has an especially strong performance from Jack Nicholson and great acting in general (besides Chelly Duvalle's part). The Shining to this day remains as one of the great horror films of the 20th century. 10/10 (Legendary)"
    },
    {
      "rating": "10",
      "text": "Happy 4th July Little pigs!Not by the hair of your chiny-chin-chin? Well then I'll huff and I'll puff, and I'll blow your house in.Little slow tonight, isn't it?"
    },
    {
      "rating": "10",
      "text": "Книгу не читал, так что никаких сравнений...Потрясающий классический триллер.Единственное, что не понравилось - актёрская игра сына ГГ, но если ребёнку это ещё можно простить, то уж жена ГГ играет реально плохо, если бы не великолепный Джек Николсон, то с актёрами было бы очень туго. Атмосфера, саспенс, безумие, операторская работа и т.д. и т.п. - это всё выполнено на высочайшем уровне.Итог: Шедевр. Смотреть всем, а любителям ужасов и триллеров - в первую очередь, ведь куча фильмов того же жанра позже позаимствуют кучу идей из этого произведения искусства."
    },
    {
      "rating": "10",
      "text": "Kubrick takes you on a trip you come back different, with a genuine film, a perfect scenario and acting at its finest. Time is incredibly well managed. No embellishment, everything has its role. An uncluttered film deserves a simple review. True masterpiece."
    },
    {
      "rating": "10",
      "text": "The Shining is one of the most recognizable, timeless, and iconic horror masterpieces that has ever been filmed. It absolutely deserves its place in history. This is just a really scary, really enjoyable movie. Its really well made, and the atmosphere and tension driven by the psychological horror is just pure Kubrik. This is a Halloween must-watch."
    },
    {
      "rating": "10",
      "text": "The glow is probably Stanley Kubricks best film for a mass viewer. This is Jack Nicholsons best acting. One of Kings best adaptations (starting he himself does not agree with this). But this is definitely not one of the best horror as many believe. The glow is not horror, but a very good thriller. A vivid example of confirming the fact that not every good film adaptation should follow the original."
    },
    {
      "rating": "10",
      "text": "By far, It's the best Kubrick movie! Also, the best Horror Movie ever(10/10)"
    },
    {
      "rating": "10",
      "text": "One of the greatest movies ever made. A masterpiece of modern horror.  A must watch for any film fan."
    },
    {
      "rating": "9",
      "text": "Great film very overlooked. For sure worth watching. The errieness of the film is just perfect and the acting is out of this world. This movie holds a strong spot in my horror category."
    },
    {
      "rating": "10",
      "text": "A masterpiece by Stanley Kubrick. The film can be very hard to understand to somebody, but if you watch it more times you will understand the genius in it. Also wonderful is the performance of the actors, especially Jack Nicholson who performed fantastically."
    },
    {
      "rating": "9",
      "text": "This is a very atmospheric and distinctly chilling film, with an unsettling and somewhat claustrophobic feel to it throughout. There are numerous hints about what's to come from quite early on and it has a somewhat slow plot but I'd say that works in its favour, for this film certainly as it leaves the viewer trying to second guess when things may suddenly 'come to a head', as it were.Its certainly not an utter gorefest throughout, as horror films go but as you may have guessed, it is very tense at times and I really liked the way the wide-angle camera (pan) shots and the music (quite old fashioned, spooky music certainly, often featuring strings (stringed instruments - it has a Hitchcockian feel to it)) go well together. The cast does a good job, certainly Jack Nicholson as John Torrance and Shelley Duvall as his wife, Wendy. I can understand why this is regarded as a classic horror film, with both of their performances being quite memorable. Wendy's look of sheer terror when things come to a head is quite chilling and certainly memorable, as is Jack's when he embarks on the infamous rampage.If your a fan of horror films and the like, then I'd definitely recommend this film."
    },
    {
      "rating": "10",
      "text": "Essentially the perfect film. From the opening shot, to the final scene, the movies cinematography and gripping story are fascinating."
    },
    {
      "rating": "10",
      "text": "The Shining is an absolute masterpiece of a movie. It is not only one of the greatest horror movies ever made, but one of the greatest movies from any genre. The cinematography is stunning. The setting is both grand and inviting yet claustrophobic and oppressive. Jack Nicholson gives the best performance of his whole career. If you haven't seen this movie yet, go watch it ASAP."
    },
    {
      "rating": "10",
      "text": "My favorite film of Kubrick's. You feel like you're becoming as mad as Johnny while watching, building up cabin fever and fear in a mixture of nauseous scenes."
    },
    {
      "rating": "8",
      "text": "Illustrating the true, crazy countenance of mankind when confronted in extreme isolation and horror, Stanley Kubrick's \"The Shining\" is a modern-horror masterpiece that criticizes not only us, but also the disjointed society. (P.S: This was probably the best movie Jack Nicholson performed in. Ever.)"
    },
    {
      "rating": "10",
      "text": "My favourite horror film, possibly even my favourite film in general. The atmosphere is immensly creepy from beginning to end. The music, the camera work, all spells dread and impending horror. Those two girls still send shivers down my spine whenever I see them. Talk about stmosphere, this film has me gripped from begginning to end every time. Every scene is firmly etched into my mind, every image. Yeah I Ilike it just a bit....to be honest I feel a bit like Jack sometimes...Wendy!!"
    },
    {
      "rating": "4",
      "text": "Really not that good. Boring, dull, lifeless. Acting wasn't the best and the directing was terrible. The only reason I didn't give this a zero is because it scared me"
    },
    {
      "rating": "3",
      "text": "Whoever called this movie a 'masterpiece' was only half right.  It's a piece, all right, but a piece of...  Well... you fill in the blank.  Granted, Nicholson was great, as always, and Kubrick's direction - Though he's done much better - Is acceptable, outside of the casting of Shelley Duvall.  Actually, it is she that is the major problem with this movie, and the kid who played the kid doesn't help any.  Discounting those items, it's got a good feel to it, and creates a creepy atmosphere.  It's got a great music score, and excellent photography, but the script deviates too far from the book.  With Nicholson as the star, and Kubrick as the director of a Stephen King story, I expected much, MUCH more."
    },
    {
      "rating": "8",
      "text": "So disturbing, yet exciting. Jack Nicholson plays a perfect role, and this movie loves to mess around with you. It doesnÂ´t have any real scares, but is way more unsettling than any current horror flick. Some great camera work, too."
    },
    {
      "rating": "10",
      "text": "A brilliant horror movie!! and certainly one of the best stephen king movies. I really dont know why the critics give this masterpiece a 6.1, but thats out sh*tty generation, good movies are given bad reviews, and bad movies are given good reviews, thats just sad. To all people who gave this a good review, you have great taste, to all people who gave it a bad one, suck it!"
    },
    {
      "rating": "4",
      "text": "\"The Shining\" is an unfortunate missed opportunity. Stanley Kubrick's adaptation squanders its source material, sacrificing the complex characterisation, themes and nuance that made Stephen King's novel so distinctive and compelling. Given the sheer brilliance of what it had to work with, and the immense talent attached to it, the film should have turned out to be far more than what it was: a disappointingly basic and stunted \"chiller\" does not do any semblance of justice to King's masterpiece. It lacks any form of suspense, thrills or chills, manages only to be slightly and sporadically unnerving. \"Here's Johnny\" and \"Room 237\" are memorable vignettes. But the film as a whole is forgettable. I will concede Jack Nicholson is excellent - the role of Jack Torrance is a perfect showcase for his talents. But even he cannot override the film's waste of potential."
    },
    {
      "rating": "10",
      "text": "A masterpiece in every form of that word. If you don't like this movie you are living life wrong. Jack Nicholson turns in an amazing and iconic performance while Kubrick uses his brilliant movie magic to craft one of the best Horror movies ever."
    },
    {
      "rating": "9",
      "text": "I do love the shining, but I find A Nightmare on Elm Street, Friday the 13th, and Halloween better than this. The movie's concept is astonishing and Jack is a great villain, but it's not my favorite horror movie."
    },
    {
      "rating": "9",
      "text": "An atmospheric, slow-burning horror film that charts a man's descent into madness. Though the directing and writing is top notch, Nicholson is the real star of the show. His character is fantastically deranged and believable and is the commanding force in each scene he is in. Although not terrifying, the movie effectively builds tension and suspense culminating in a dramatic third act."
    },
    {
      "rating": "9",
      "text": "Quite possibly the creepiest, most well written movie ever. There are so many creepy moments and Jack Nicholson was an amazing actor few actors could top his performance in this."
    }
  ]
}