{
  "id": 1615,
  "title": "The Raven",
  "starring": [
    "John Cusack",
    "Luke Evans"
  ],
  "runtime": 111,
  "genre": [
    "Crime",
    "Thriller",
    "Mystery"
  ],
  "description": "A fictionalized account of the last days of Edgar Allan Poe's life, in which the poet is in pursuit of a serial killer whose murders mirror those in the writer's stories.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/boE0JFhZRpWLLrKOQE6bCBZGerP.jpg",
  "categories": {
    "plot": 5.9523809523809526,
    "acting": 5.851851851851852,
    "ending": 5.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.25,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Let me make this quick, out of respect for the late Poe, \"The Raven\" is a camp, leanly scripted, horribly acted calumny that unqualifyingly slaps its literary predecessor in the face and defecates on the very writing style that made him unique, supplanting the same pervasive and consuming eeriness with a cheesily rote, slice-and-dice murder mystery that tries to look mean with dark-hued tints and wailing screams but instead appears pathetically misguided and unintentionally funny. Director, James McTeigue just doesn't have a skill for wit here, ruining what could have been a fair pastiche and tribute to Poe, and instead channeling attempts to do so through a hard-to-see, black screen with Conan Doyle in the foreground becoming lost in his own self-searching investigation. 'Raven' is an uninvolving potpourri that creates such such a mess for itself, that it doesn't even know what it's trying to do. Just silly. Do yourself a favor: save some time and just read Poe instead; it's sure to be more engaging. This, however, is nothing to rave about."
    },
    {
      "rating": "5",
      "text": "The most I can say for it is that it has enough tension to hold interest, but it never thrills or fascinates.  The ending does payoff, but barely.  The Raven has just the lighting design it needs; Poe and company are drenched in dramatic shadows.   The dialog is filled with clever wordplay, but there's scant investment in those who speak it.    The body count rises, but none of the victims receive an iota of development.  There is blood, there is gore, but we've seen it all before.  Full review on my blog."
    },
    {
      "rating": "2",
      "text": "A plot that just might slide ends up being a painfully bad, painfully boring experience. Bad acting, and pretty much bad everything else. Not recommended at all."
    },
    {
      "rating": "8",
      "text": "Gripping, Suspenseful, and Emotional in all the right places, James McTeigue's \"The Raven\" is a thrilling motion picture which presents in depth characters and a well-made plot portrayed by the skilled actor John Cusack. While the movie itself rarely falls flat in certain scenes, the appearance of Mr. Poe and other characters isn't as canon as some would want it. Despite these fallacies, The Raven will keep you entertained to the end."
    },
    {
      "rating": "9",
      "text": "Original and well inspired, which respect the E.A.Poe mindset, good photography, camera, acting. the thread of the story is also well put together. This is a great movie for the younger generation to help them discover E.A.Poe and encourage them to read the books. If you have read all the novels, you will be able to assign each sentence to novel it refers to: make the movie more enjoyable. Brilliant idea. A must watch for the 13-19 y.o. and the older generation more classically educated."
    },
    {
      "rating": "0",
      "text": "I can't in good conscience countenance any flick that so blatantly rips off a Poe-inspired novel's essential plot and premise.  And then simply transports said plot and premise from the novel's original contemporary setting in San Francisco to its fabricated period piece location of Baltimore.  But the ripped off plot and premise stays intact: a psychotic serial killer inspired by Poe, copy-catting Poe-conceived crimes.  If you don't believe it, objectively check out the book description of this Poe-inspired novel at Amazon.com:EDGAR ALLAN POE'S SAN FRANCISCO: TERROR TALES OF THE CITY Enough said!http://www.amazon.com/Edgar-Allan-Poes-San-Francisco/dp/0943283124/ref=sr_1_15?s=books&ie=UTF8&qid=1335771448&sr=1-15"
    },
    {
      "rating": "8",
      "text": "Great date night movie. My wife and I saw it together and both enjoyed it. I wouldn't say it was a cinematic masterpiece but a thoroughly enjoyable film. I appreciated how contemporary it felt while still being set a century and a half ago. CusacK is well cast."
    },
    {
      "rating": "5",
      "text": "On the plus side, it’s a pretty well made film with all the technical stuff, costumes and sets done very well. On the downside, the dialogue is terrible with everyone trying to sound like they’re straight from a Poe story or poem; it really didn’t work for me I’m afraid. This did have one positive side effect though; it gave John Cusack the opportunity to do some excellent scenery chewing over-acting; which I found quite funny in places. Sadly it’s a film that promised much but failed to deliver. I found I had no connection with any of the characters. I have not read much Poe and so I didn’t get many of the many nods to his work. Over all; quite disappointing.\r SteelMonster’s verdict: NOT RECOMMENDED\r My score: 5.3/10"
    },
    {
      "rating": "8",
      "text": "To start out, this movie is a different kind of movie from one that the majority of the American audience would probably find to be amusing or interesting. The era of speech and just the general subject of the movie isn't a completely action packed event that the majority of people seem to want. I find, however, that this movie is a very fun and interesting adventure. It really throws some wrenches in your viewing experience trying to find out who the killer is, and it reminds me, at least to a degree of the video game Heavy Rain, especially at the end, with the poison. I think that this is something really good for anyone that is interested in conspiracy theory type of movies, or especially detective sort of movie.  It is not for everyone and i don't think that it was intended to be for everyone. The movie provided what i thought was an engaging experience and overall i would say an 8/10 is a fair score for it, just because of the fact that most people will probably not like it but i think overall it is definitely worth a watch!"
    },
    {
      "rating": "3",
      "text": "Well i certainly thought this film had its potential but it just seemed to fall flat. Its one of those films you can go and watch without a brain and enjoy it, but if you start to think, then you realize all of its faults. I have never been a big John Cusack fan, and he certainly didn't better my views of him after i saw this film. He certainly did not give the great Edgar Allen Poe a good service either. His ad everyone else in the supporting casts acting was just lackluster, and the character development was mediocre at best. Their was no explanations or development of the victims, it was all just rushed throughout, and the actual killings besides one in particular weren't shown in great detail at all. This film was rushed, weak, and left me with an empty stomach that it just failed to fill. The costumes and the setting of the film were the only positives i could think of. There wasn't any suspenseful or bone-chilling moments to this film like the trailer promised it would have. This movie just failed to fulfill, and it certainly did a great disservice to the late great Edgar Allen Poe. Don't bother with this one. Wait for redbox or until its on television. 3/10"
    },
    {
      "rating": "10",
      "text": "Reading The Raven, after having seen the movie. I expected mediocrity, but was shockingly surprised by the elaborate plot twists and inclusion of several of Poe's major works."
    },
    {
      "rating": "8",
      "text": "I honestly don't understand why so many critics didn't like this film as I felt it was one of the better mystery crime thrillers in years. In a very creative and well made movie, Edgar Allan Poe's stories are brought to life and Poe himself must help solve the clues and catch the killer in order to save a woman's life. John Cusack does a remarkable job in the role of Poe and the rest of the supporting cast, featuring Luke Evans, Brendan Gleeson, and the beautiful Alice Eve, are strong as well. The plot develops nicely and the movie flows at a constant pace, never dragging or growing dull. It was far from perfect being plagued by the same \"oh really\" issues that plague so many other thrillers. What I mean by that is that many of the plot points hinge on various characters' unrealistically stupid decisions and/or reactions to things. Regardless, The Raven is still very much worth watching and I found it a grippingly entertaining movie."
    },
    {
      "rating": "7",
      "text": "165 years ago, Edgar Allen Poe was on his way from Boston to Virgina, preparing for a new job. He never made it and was found on a bench in Baltimore, near death. He was delusional, wearing someone elses cloths, and kept repeating the name Reynolds, before he died. To this day, the cause of death and his reason for being in Baltimore are unknown. On the anniversary of his death, I decided to watch The Raven, which contrary to popular believe is not a remake of an older film. This story is a fictional take on Poe's last days, as the writers have Poe assisting local police in catching a serial killer. A killer is on the loose in Baltimore and using Poe's stories as the inspiration for his crimes, so who else is more qualified to help catch him than Poe? I am not a big fan of period dramas, as most are historically inaccurate and move at a snails pace, but the Raven was different. As fiction, it is of course extremely inaccurate and features Poe has an eccentric has been and a fall down drunk, but surprisingly the film is fast paced and really keeps you on the edge of your seat. The idea of using Poe's stories as the inspiration for a real murderer, who tries to copy his stories to the last detail was really brilliant and it plays very well, especially to fans of his work. John Cusack plays the mysterious writer and by this point in his career, I'm convinced that the man can play anyone and be believable. In thirty years, there isn't a role he wouldn't take on and I'm hard pressed to remember even one instance of him failing to be spectacular. The Raven is a stand alone film, with a common title for films featuring Poe, however this one is a great mystery that incorporates very little modern day thinking into the story. The Raven has everything you'd expect from this type of film, simply set 165 years ago. From police chases on horse back to wild 1800's costume parties, this film really surprised me with just how good it was and most definitely gets labeled as a must see movie!"
    },
    {
      "rating": "7",
      "text": "The Raven, ok, the movie is not perfect but is interesting, funny, the cast do a great job in their characters, the story is interesting, with some problems in development. The Raven is a good feel movie, no more."
    },
    {
      "rating": "7",
      "text": "This movie was fantastic. But, what I didn't like to well was the acting. But this movie confused the **** out of me but honestly I love movies that do that. I love it, but Emily's character wasn't a very good actress in my opinion"
    },
    {
      "rating": "5",
      "text": "I almost felt as disinterested in writing this review as I did watching the film so this will a short one. The Raven is an average film that never delivers anything above typical cat and mouse serial killer mediocrity. Director James McTeigue (V for Vendetta) manages to create some darkly Gothic settings but it's all shamefully wasted as the narrative never gets its teeth into the audience. When the serial killer was revealed, it lacked any twist, shock or suspense of any form and this sums up the film's general lack of intrigue. While reading other reviews, I've seen mentions to Se7en and when you hold The Raven up against David Fincher's great serial killer film, you realise how wasteful The Raven is considering the Gothic setting and characters involved.\r Leads John Cusack and Luke Evans perform admirably and the producers deserve a gold star for not casting Johnny Depp as Poe (shudder). If you are watching to see Alice Eve, you may be disappointed unless her being trapped in a coffin for the majority of the film is your idea of fun."
    },
    {
      "rating": "8",
      "text": "Although it has weak parts it keeps the excitement till the  end. The plot is well written and has all the necessary parts. It's also not a typical movie which could be found interesting by the big audience so I don't advise it for everybody."
    },
    {
      "rating": "8",
      "text": "The Baltimore police must enlist the help of Edgar Allan Poe when a deranged madman begins staging a series of gruesome murders around the writer's most famous works in THE RAVEN! John Cusack stars as the ill-fated author, although he often lacks the strength and conviction to carry the film. This rendition of Poe seems less tortured and more focused on melodramatics and snappy retorts, though none will accuse the film of attempting to be an accurate portrayal of the man, himself. James McTeigue paints a stylish thriller that resembles the likes of FROM HELL or SLEEPY HOLLOW in its dark Gothic allure. Poe aficionados will appreciate the delicate interlacing of clues that tie several of the author's most famed stories together while piecing together the killer's grand scheme. Where THE RAVEN mainly falters is in creating any real suspense to lock us in our seats as the murders unfold. As Hollywood thrillers go, however, the somber mood and ever-widening mystery will be enough to win over most mainstream audiences."
    },
    {
      "rating": "6",
      "text": "Visually competent., \"The Raven\" aspires towards high art but in terms of being an effective mystery, it sometimes moves too fast for a modern audience--unfamiliar with the setting--to catch up. It is not helped by a slack-jawed Cusack enunciating his lines with less than perfect clarity. Inconstant tension and a weak resolution ensure that the film fails to realise its ambition."
    },
    {
      "rating": "9",
      "text": "A very good thriller, inventive and good acting and effects, Poe invented the mystery story and this film is a mystery, he popularized the horror story and this film has gore.  He was witty and wrote humorous tales, science fiction and was a diabetic alcoholic, haunted by death and love, and this movie \"gets\" it, a lot of people didn't, but here's hoping you do."
    },
    {
      "rating": "8",
      "text": "I loved this movie. It was gripping and suspenseful, a great thriller. The costumes were great and the acting marvelous. I will defiantly be seeing it again."
    },
    {
      "rating": "6",
      "text": "While The Raven was not a great movie, it held my interest, & the critics are being particulary harsh, in my opinion.  John Cusack is always worth the price of admission & his performance in this film holds up.  It is a shame the other actors weren't given a bit more to do."
    },
    {
      "rating": "3",
      "text": "After the promising opening moments of James McTiegue's The Raven are spent with anxious constables rushing to find slashed bodies in a locked room, and the entrance of Inspector Fields (Luke Evans), who approaches the conundrum like Auguste Dupin, John Cusack's Edgar Allan Poe chews the scenery with his superficial temper tantrums and clumsy gyrations, pulled by contrivance instead of subtextual motivations. For god's sake, didn't Cusack and the writers know Poe was a tortured soul with layers of spiritual complexity? Where's the empty pit of isolation and the breadth of despair he suffered through his boozing and melancholy? Yelling the word \"f*ck\" is not a suitable drama substitute. If only the real Poe could have lent a hand. I'm sure his dialog would have been richer and more sensible, and his suspense would have been palpable as well as plausible. Plausibility is a good place to start since this movie adds little of it to tie its sensational events together. A wonderful premise brimming with potential limps instead from indecisive contextual stability as it purloins stock slasher and serial killer tidbits, piecemeal, without understanding their cumulative effect. It's almost like Saw in gruesomeness scale--the strikingly gory pendulum slice and dice on the rotund Rufus Griswold (John Warnaby)--then restrains its visual assault like Horrors of the Black Museum, then jumps from left to right to be similar to Se7en's broader cat and mouse conceit. Each staged execution of Poe's devilish demises by the villain is handled like a fast-food order without condiments, even if imaginatively far-fetched clues propel Poe and Fields one step closer to finding who that killer is and his motive; both of which appear on script cue out of thin air for the denoument's wrap-up, without any explicit or implied discernment along the way to prepare us for the revelation. It just happens. Leading up to this, Poe rants, raves, throws his ego all around, sulks, and looks for his next drink--until his mind clears enough to recognize the clues being left behind; Fields, emotionless, analytical, dissects the problem methodically until he develops brain freeze, allowing Poe's now clear mind to take the lead; the blustery Captain Hamilton (Brendan Gleeson) hates Poe--who wants to marry Hamilton's daughter--until the captain becomes conciliatory and friend to Poe to help solve anothe clue, even though it's Poe's stories that have buried his daughter alive and all of them desperately trying to find her. Hamilton's daughter Emily (Alice Eve) loves Poe, but aside from an out of place allusion about him giving good head, made during an overly long and lifeless romantic interlude, why she would like a destitute, alcoholic, and egotistical ass such as Poe is portrayed is not clear. Her wispy and cold presence in every scene blends into the upholstery much of the time, so unless Poe is infatuated with sitting on her, I'm at a loss to understand the attraction they have. Even when she's clawing at the coffin she's buried in, she's as cold as a corpse already.Then there are the vexing facts in the case of the uneven interior lighting from scene to scene. We go from moody interiors correctly matched with their dim gaslight and oil lamp sources to spectrums of bright white, impossible to be produced by the lamplight available, sandwiched between a few suitably bleak, mist-shrouded exteriors: a memorable chase under a gray sky and through a foggy, barren, forest brings to mind The Fall of the House of Usher.Not much else is memorable except for the murder by pendulum. Its intensity is surprising given the duller deliveries of the subsequent murders. I'm not sure if practical effects were united with digital, but watching that enormous blade slice through Griswold's belly, him screaming, it cutting deeper with each notch of its giant gears rolling into place, all that blood and glistening chunks of visceral meat splashing wildly, and the blade finally bisecting Griswold into two lifeless parts as it comes to rest, stuck into the wooden table between them, is breathtakingly disturbing, but oddly out of place here. I wondered how the villain managed to build such an immense, clockwork precise contraption by himself. Poe even remarks he hadn't imagined the counterweight to be so large when he sees it.I'm torn myself between loving and hating it, given the rest of this movie."
    },
    {
      "rating": "6",
      "text": "Let me break it out to you by guaranteeing that if you watch this movie you will be at a minimum entertained. Since films are made with that intention in mind, we could all agree that this production did their job exactly as expected.Although, something has to be said for the collection of mockeries that continue to test our patience and make us feel like we've been robbed and laughed out of our hard earned cash. Yes. Don't look away. You know who you are... Grab a tub of popcorn, bring your favorite movie companion, sit down, and prepare yourself to have a decent time.The premise is simple. Edgar Allan Poe, famous horror novelist of the time. You do know this is a period piece you are watching? 1800s? ... Ok. So, Poe's finals days on earth are a bit of a mystery, and Hollywood decided what better way for a famous horror novelist to spend those last few days of his life than to get entangled in his own horror fare. Brilliant. Yes? Obviously the guy didn't get enough of it in his factual life.Our guy finds himself in the middle of what appears to be the endless pursuit of a criminal that uses Poe's famous novels as staging for fresh murders of his own. And, to make things a bit more edgy, the bad guy kidnaps Poe's bride to be moments before they're about to announce their engagement. Intense and puzzling. Definitely fun.Since I'm a guy, I'm going to point out to my fellow men that this is not the kind of movie that's going to get you laid. John Cusack used to do those kinds of movies back when. But he's gone from holding a boom box like no one else could in \"Say Anything\" to becoming an irate alcoholic with a penchant for poetry and even a streak of suicide in this one... Well, I did tell you this movie won't get you laid.Now, ladies, I do hear some of you find Mr. Cusack attractive. But if he's not your cup of tea, Luke Evans might just do the trick. He's a handsome foreigner from Wales that holds the eye.Both actors do a good job at the act. Their roles are convincing and well written. It would be superfluous to give Cusack the extra credit for playing Edgar Allan Poe. A clearly challenging role. He's after all the movie star here and expected to get the film to recoup moneys invested.  John! You got a few bills from me! Happy to oblige!The rest of the ensemble played it well. Alice Eve looked fantastic as the lady in distress buried in a basement. Literally. She had a few choice words at the start. Even read some poetry here and there. But her talents were largely invested later on in the picture. Wearing a super tight bustier. Crying, sobbing, begging and screaming from under a pile of dirt. I ran this by an actor friend of mine and he did confirm it is a tough gig to do all that nonsense while laying flat on a hard wood-plank set for 12 hours straight. So, props to you Miss Eve. It looked fantastic from where I was sitting.In fact, I was pleased to see her role was written as a tough chick. There are moments when she actually shows more balls than the largely depressed Mr. Poe, who is supposed to come rescue her. You have to love a tough chick! Right?Brendan Gleeson is worth a mention. For some reason I particularly liked his character. The tough old man that came this far in life. Money. Power. A great -looking beard. And his daughter gets the crap end of the stick. I mean, aren't all parents expected to have their daughters date broke alcoholics with irate tendencies and fans with criminal intent? You see where I'm going with this... But Mr. Gleeson was as convincing as his role firm. When I grow up and get old, probably should say older, can I be just like Gleeson's character? Tough as nails!I am partial to mysteries done a certain way. What can I say, I like beef medium rare. Not any other way.The story line, however interesting, it follows a chain of events that unfold one after the other in a consequential manner as presented in the screen. With no hope from the audience to anticipate much of what will happen next. Personally, just like my steak, I like to see where my story might end up. I want to feel half intelligent and be presented with clues that allow me to participate in the crime solving. Just so I feel a bit smarter leaving the theater. Not that I would be. But a little pretense is nice sometimes. Specially having made a monetary investment in the viewing.Some of you out there, though, like to sit down and eat whatever is served without expectation or involvement. un-plug completely, if you will. In that case, you are in the right theater. This is that film. The puzzle of crimes and locations and little clues and fantastic mask balls and horse chasing in the beautifully photographed mist is quite cool to watch. So, as I said. I'll reiterate. It will all be very entertaining... And that's it."
    },
    {
      "rating": "8",
      "text": "The Raven is sort of like an enjoyable candy bar, filled mostly with a gripping murder mystery and coated with relatively convincing insight into the life of Edgar Allen Poe. Cusack was of course brilliant playing Poe, and Luke Evans also did well as the likable Detective. I also enjoyed the authentic mid 19th century art direction. The movie could have used maybe a little bit of comic relief in it, but seeing as how James McTeigue's \"V for Vendetta\" also lacked it, I'm not suprised he was going for all-out dark and gory. But nonetheless The Raven still keeps your attention for the full 111 minutes. Just when you think the individuals pursuing this psychotic killer have gotten a big break in the case, they keep finding themselves back to square one. Just like in \"The Hangover\" when The Wolf Pack thinks they have found their friend, you sit back and ask, \"Wow, are they ever going to find Doug?\" The Raven prompts you to ask, \"Are they ever going to find this maniac?\" Luckilly the game of cat and mouse doesn't fall flat midway through like some other movies would."
    },
    {
      "rating": "4",
      "text": "Incredibly boring movie that has many plot and filming flaws.  Its a significantly watered down Sherlock Holmes that leaves you neither caring for the victim or the villain - quite seriously.  At no point do you go... hmm, who is this bad guy?  Also, Cusack plays a bad alcoholic.  I hate to say this, but he could take lessons from Downey Jr."
    },
    {
      "rating": "7",
      "text": "I would advise anyone apt to compare \"The Raven\" with Poe's illustrious literary canon to do so with minimal solemnity. To understand the relationship between the film and the man, one must take into account the film's artistic objectives. This film makes no attempt at paying veneration. This film is an unapologetically camp, gothic spectacle that aims to suture the gaps between craft and crux, art and artlessness, beauty and gruesomeness, thriller cinema and macabre literature. It is also, however, a piece of art that must be separated (to a degree) from its literary source in order that it may stand for something beyond it. To compare \"The Raven\" and the works of Poe is to compare a raven to a writing desk. John Cusack's captivating and charming portrayal of Poe (a character that is more a manifestation of a dying art than an homage to the renowned writer) is what holds such a thematically bloated film together. Despite its many and varied artistic aspirations, \"The Raven\" offers a fairly coherent representation of the autumn humour. \"The Raven\" is, most assuredly, an artistic achievement; there are few greater challenges to the creative mind than to address the anxieties of that very intellect in any concrete way---to construct an artistic edifice to the melancholic mind. \"The Raven\" looks across art and across time and assembles, from the vestiges of some lost doctrines of the \"impos[ed] pattern,\" a new philosophy that unites two things many artists understand to be at odds: life and art."
    },
    {
      "rating": "9",
      "text": "A Really Good Movie!\rVery Good Script And Acting! This Movie Should Atleast Be A 7/10!"
    },
    {
      "rating": "6",
      "text": "Basically a whodunit where Poe and an inspector need to find a copycat killer who brings the Poe stories to life. It all sounds better on paper or in your imagination than what you eventually get on the screen. Cusack does a fine job as Poe and as always the movie is well made, good cinematography, nice sets and costumes and all this for a meager 26m$. A good 2 hrs entertainment but not as good as McTeigue's debut 'V for Vendetta'. Raven feels like it had potential that was not fully realized."
    },
    {
      "rating": "3",
      "text": "A great concept but all and all it was very poorly executed. The largest problem is Cusack's portrayal of Poe. It is bad, really bad. Cusack's Poe is prone to speaking in pseudo-intellectual statements, yelling. Also Cusack does this thing when he leaves his mouth partially agape and it makes him look like he has an IQ of about 20. That combined with the lackluster performance by the rest of the cast and the mishmash of under and over directing The Raven ends up being the perfect example of poorly executed."
    },
    {
      "rating": "2",
      "text": "Ultimately, The Raven is just about what most pre-release cynics had been anticipating  a bizarre mishmash of historical elements and subpar on-screen drama capped off with an underwhelming but serviceable performance from John Cusack in the leading role. The project fails to impress at nearly every turn and, for a film with such a rich source material, offers very few surprises, intriguing twists, or interesting murder mayhem. While it’s easy to imagine some movie-lovers could enjoy the film when it hits cable, The Raven is never flitting, still is sitting, still is sitting, And my soul from out that shadow that lies bored on the floor, Shall be interested  nevermore!"
    },
    {
      "rating": "5",
      "text": "This movie seemed like a good concept, the key word is seemed.  Don't get me wrong I was entertained in certain parts, but a poor script pulls this movie down."
    },
    {
      "rating": "6",
      "text": "While this movie certainly has it's flaws, it is not without some enjoyment. The plot is only sloppy once, the rest is actually quite enjoyable. I recommend it, but watch it knowing what your walking into it."
    },
    {
      "rating": "7",
      "text": "Wow a 22% on Rotten Tomatoes, I know I shouldn't compare people's rating to a film but I think it was that bad.\r The Raven follows the tale of Edgar Allan Poe are vividly brought to life - and death - in this stylish, gothic thriller starring John Cusack as the infamous author. When a madman begins committing horrific murders inspired by Poe's darkest works, a young Baltimore detective (Luke Evans) joins forces with Poe in a quest to get inside the killer's mind in order to stop him from making every one of Poe's brutal stories a blood chilling reality. A deadly game of cat and mouse ensues, which escalates when Poe's love (Alice Eve) becomes the next target.\r Before I started this review I did some research on this movie and I found out quite a lot of things about this movie and that's the stress and living hell that these film markers or who every worked on this movie faced while the budget and the production went completely wrong. This stuff always happens, I mean loads of classic and beloved movies had a lot of thing wrong with the budget or the production but it always payed off, but for this movie it didn't and while I didn't see it when it first came out because at the time was watching movies that took my interest. A week ago now I've seen the movie and to out thoughts together I can say that this movie isn't bad but wasn't that good, it's on the level of okay.\r John Cusack is a great actor but at the beginning of this movie was a bit over the top with him chewing up the scene and that's only the beginning, but after a while he actually began to act and for the most of the movie he did great in the role. Nothing Oscar worthy but still a solid performance and he did his best of what he can work with, if only the movie had a better script.\r The rest of cast like: Luke Evans, Oliver Jackson-Cohen, Alice Eve and Brendan Gleeson all did a solid performance, just like I said about John Cusack there all did they best of what they got I mean it's not like they did a terrible performance well actually they were good in the movie, not the best performance but still good in a way that I let them have a pass.\r The cinematography in this movie looks great, every shot in the movie looked like it took forever to do in some scenes. The set, the costumes and the make-up look pretty good. The final positive thing I can say is that the movie at least doesn't look cheap like some other big Hollywood movies.\r Now for problems and there's a lot: The writing in the movie was pretty bland and blah, the movie also felt really short and I normally don't say that before in my reviews but I felt that the movie ended to quick and it rushed a lot of things to end it which I predict that most people wanted but for me I thought the movie may have improved in some way as it went a long but it ended just like that.\r The love triangle between Edger Allan Poe and Emily I didn't really care about and this is a bad thing. What I mean is that Emily is like a plot device, the whole movie is about trying to find Emily before it's too late, but here's the thing I don't care about Emily because she wasn't that development and she wasn't all that special to me, now the problem here is that the story is about trying to find her and solve the murder case, but if your movie audience doesn't care about Emily that means they don't care about the story or everything around it and they want it to be over because these nothing there to care about.\r Overall The Raven wasn't a terrible movie as people are making it out to be but it could have been a lot better then it was."
    }
  ],
  "recommendations": [
    "secret_window",
    "zodiac",
    "terminal",
    "knives_out",
    "lucky_number_slevin",
    "reminiscence",
    "the_little_things",
    "the_conjuring_the_devil_made_me_do_it",
    "inferno",
    "sherlock_holmes",
    "the_machinist",
    "inherent_vice",
    "a_walk_among_the_tombstones",
    "the_invisible_man",
    "the_woman_in_the_window",
    "the_snowman",
    "trance",
    "the_prestige",
    "a_simple_favor",
    "1408",
    "minority_report",
    "cube",
    "a_cure_for_wellness",
    "the_next_three_days",
    "bad_times_at_the_el_royale"
  ]
}