{"id": 1867, "title": "The Legend of La Llorona", "starring": ["Autumn Reeser", "Antonio Cupo"], "runtime": 98, "genre": ["Horror", "Thriller"], "description": "While vacationing in Mexico, a couple discovers their son's disappearance is tied to a supernatural curse.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wtgEJKEOLnyQkWemEdFa5W8Q29L.jpg", "categories": {"plot": 8.666666666666666, "acting": 9.0, "ending": 8.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Feels more like a work of dark fantasy than true horror as it uses the weeping specter of Latin American folklore not as a means of terrifying the audience or even the family she's haunting, but rather to represent a slowly oncoming natural justice from those beyond the grave whose abusers have remained protected by the very systems that should have seen to their punishment. Similar to what Nia DaCosta attempted to do with the titular villain of her recent Candyman sequel, only nowhere near as convoluted. Centered around the Guatemalan genocide, La Llorona pulls from real life tragedy as a fictionalized version of one of the country's biggest political and military leaders during that civil war escapes the legal ramifications of his \"Silent Holocaust\" only to become trapped in his mansion alongside some relatives and a few employees by protestors. At which point he begins to be awakened by the sound of a woman crying in the halls at night that no one else ever seems to hear...At no point does the movie make any bones about what is going down. I mean, it's incredibly obvious who the mysterious new maid actually is from the second she appears onscreen. You know that before things end you are going to see the former dictator and general get what he deserves because that's the entire reason this was made. What keeps you invested up until that happens are the other characters as they struggle with internal dilemmas surrounding the subject and you wonder if individuals like his innocent granddaughter will suffer the same fate so that he may experience the same pain countless natives felt when he saw to it that the lives of their children were extinguished. It's an aspect the story plays on beautifully to create tension.It sort of has to because there isn't a single moment where the film is ever scary. María Mercedes Coroy is certainly a creepy presence with her odd behavior and long black hair that calls to mind the unsettling little girls of any J-horror series, but there is yet a noticeable lack of anything to put you on edge and leave you in fearful anticipation of that which could happen next. What makes me able to recommend this in spite of such an absence when I might not have found it possible to do so in other cases is its intentions. Instead of trying to keep you up for days on end, Jayro Bustamante turns an entity meant to terrify into a force that can right the wrongs of this world in a form of wish-fulfillment that targets the powers specifically responsible for the catastrophe as opposed to condemning an entire people. Making it moving and powerful in a manner the less meaningful releases in the genre designed to put butts in seats for huge box office numbers (e.g. the westernized Conjuring spin-off's take on the ghost) can't be.9.3/10"}, {"rating": "8", "text": "'La Llorona' transports the Latin-American myth into a story based on one of the darkest moments in Guatemalan history. With a gloomy and dark approach, director and co-writer Jayro Bustamente fantasizes about how despots and tyrants should end their days: tortured by the memories of their actions. An Academy Award for Best International Film is just around the corner."}, {"rating": "10", "text": "It’s amazing a movie like this came out from Guatemala it’s pretty cool the way this movies brings to the table the systemic racism against Mayan."}], "recommendations": ["munich", "detroit", "hotel_mumbai", "the_33", "sweat", "found", "22_july", "incendies", "the_way_back", "dark_waters", "a_hidden_life", "high_life", "the_pianist", "dominion_prequel_to_the_exorcist", "silence", "eden_lake", "voyagers", "lone_survivor", "apocalypse_now", "personal_shopper", "greenland", "the_lost_city_of_z", "the_road", "before_i_wake", "13_hours_the_secret_soldiers_of_benghazi"]}