{
  "id": 4553,
  "title": "The Land Before Time",
  "starring": [
    "Gabriel Damon",
    "Candace Hutson"
  ],
  "runtime": 69,
  "genre": [
    "Family",
    "Animation",
    "Adventure"
  ],
  "description": "An orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.",
  "releaseYear": "1988",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wSC2wxFj3ZgrIHlIaePeuHN4igo.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 7.0,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 9.5,
    "funny": 9.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I think every kid's gonna like this classic. The drawings are nice, the story is ok, the characters are interesting. Very adorable animation, i recommend it!"
    },
    {
      "rating": "9",
      "text": "I loved this movie when I was a kid and my 7-year-old loves it now. however, the beginning was slow but dark especially when littlefoot's mother is killed by sharptooth. I don't think kids really understand what is happening during that scene and my daughter asked what happened to his mommy and I just explained and she seemed fine. As far as the dinosaurs fighting-I explained to her that there are meat eaters and leaf eaters, etc, and that is the way Dinosaurs are. Truth be told this film will grip you all the way to the end."
    },
    {
      "rating": "7",
      "text": "Very simple story but quite beautifully told. Good voice acting, characters and drama make this something of a classic."
    },
    {
      "rating": "10",
      "text": "Just like The Secret of NIMH and An American Tail and just like The Secret of NIMH, The Land Before Time is another one of those movies I've watched on Cartoon Network the first time. I only seen this twice as a kid and by that time, I still remembered it to this day. The story I suppose is similar to Bambi, is about a young longneck named Littlefoot who befriends with Cera and the Tyrannosaurus rex known as Sharptooth and the earthquake seperated the families of Littlefoot and Cera. So now it's up to Littlefoot to go find the Great Valley along with his friends, Cera, Ducky, Petrie and Spike. OK, so this movie is really short for about one hour even similar. Actually that how Don Bluth wanted it to be. He wanted to make it similar to Bambi but only with dinosaurs. That explains it the running time! What's even more is that it released in the exact same weekend as Oliver and Company which is my favourite Disney film. They actually prefer to go see The Land Before Time over Oliver and Company. Cause the message in this says it teaches dinosaurs about prejudice between the different species and the hardships they endure in their journey. Steven Spielberg uses the inspiration to Jurassic Park which is always amazing. Okay, while I was thinking about this, it never had any songs apart from the one in the end credits by Diana Ross. It never became a musical and for a fact this is not the only one. In most animated movies, they're never claim as musicals, Disney is and sometimes Dreamworks. It spawned many sequels which I've never watched before and the TV show. However I remember it being on Boomerang. So once again as a Don Bluth fan, I love this movie even when I remember watching it as a kid. Such a phenomenon!"
    },
    {
      "rating": "9",
      "text": "Such A ClassicThis was my brother’s favorite film from when he was little, And I can see why With memorable characters, well drawn animation, and an interesting story."
    },
    {
      "rating": "9",
      "text": "The premise is seemingly simple; it's set at the great extinction of the dinosaurs and the protagonists are trying to journey to the 'Great Valley', a small patch of land where vegetation remains.Yes, it may be 'ootsie cutsie' as some say but this movie is definitely not childish at it's heart. Obviously, it is a children's movie and the story line is atypical in ways but at it's core, this movie deals with serious moments that all of us will face in an incredibly mature fashion and it delivers them in a way that doesn't treat (older) children like imbeciles. We all have to face the suffering these protagonists face one day and though it's not always direct about that, the way it delivers it is heartfelt and sincere. With all due respect to those who think it's 'goofy' or 'cheesy' at times, I would disagree and say that they are a lesson to children and adults alike. That when things are bad and people suffer (which we all will experience), the thing that pulls us through these times is perseverance, acceptance, humour, friendship and love. It might have delivered them in a 'goofy' way to children but unlike most modern children's movie, it's not just about gaining cheap laughs but that when we're in dark times and we are suffering we need to pull through it with some light.Most children movies don't deal with serious life events as a way to convey a moral and philosophical message in the way this movie does."
    },
    {
      "rating": "8",
      "text": "Another great Don Bluth movie and the last great movie from her. Land before time is beautiful animated, well written and majestral composer by James Horner. This movie is great for kids and great for adults, and make Don Bluth a animated legend."
    },
    {
      "rating": "8",
      "text": "this is a really good movie, even after so long i can still watch this movie and have a joly good show."
    },
    {
      "rating": "10",
      "text": "Don Bluth propelled by Spielberg and Lucas, what else ? I can still remember other kids at recess talking about this movie. At the time, I didn't have the VHS, I was 7 or 8 and I had not watched it yet. I first saw a while after at one of my dad's colleagues, but it was only a bit of it, then we had to leave. There is no word to describe the frustration I felt back then. Bluth's talent to stage intense scenes and fluff everything up from there made this movie a great movie for children. The dark yet real themes that are fearlessly dealt with in this monument only make it so much stronger, as it doesn't use any magical wand, only pure talent and the will to make something beautiful."
    },
    {
      "rating": "7",
      "text": "Es una buena aventura con dinosaurios; la trama es decente pero efectiva, los personajes son carismáticos y la música es bonita; es otro clásico de Don Bluth."
    }
  ],
  "recommendations": [
    "the_polar_express",
    "the_star",
    "the_willoughbys",
    "where_the_wild_things_are",
    "coraline",
    "brave",
    "up",
    "moana",
    "the_peanuts_movie",
    "the_good_dinosaur",
    "onward",
    "brother_bear",
    "rise_of_the_guardians",
    "meet_the_robinsons",
    "christopher_robin",
    "zootopia",
    "bridge_to_terabithia",
    "finding_nemo",
    "bambi",
    "my_little_pony_a_new_generation",
    "happy_feet",
    "toy_story_3",
    "enchanted",
    "flipped",
    "soul"
  ]
}