{
  "id": 261,
  "title": "The Hangover",
  "starring": [
    "Bradley Cooper",
    "Ed Helms"
  ],
  "runtime": 100,
  "genre": [
    "Comedy"
  ],
  "description": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uluhlXubGu1VxU63X9VHCLWDAYP.jpg",
  "categories": {
    "plot": 4.882352941176471,
    "acting": 4.583333333333333,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.17910447761194,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Oh what to say, this could be the best comedy of the year, everyone in the film is hilarious, and to top it off with mike tyson, everyone needs to check this film out, acting was superb, and the movie was just genuinely funny. Oh and make sure u stay after the credits, some of the funniest parts are in it."
    },
    {
      "rating": "9",
      "text": "Although I am a huge Zach Galifianakis fan (yes there are some of those) I came into this movie with pretty low expectations. I was extremely surprised by the movie as a whole. The writing and storyline were good, but the acting by Ed Helms, and particularly Zach G. (who carried the movie) was excellent. The entire theater was laughing throughout the whole movie. This was one of the best comedies I have seen in a while."
    },
    {
      "rating": "10",
      "text": "Hilariously funny movie with a brilliant cast. Zach Galifianakis and Ed Helms were absolutely hilarious."
    },
    {
      "rating": "9",
      "text": "There has never been a statue made of a Critic.. and this is why..get a Real JOB and wake up from your Hangover.. how could you not find this Funny?"
    },
    {
      "rating": "8",
      "text": "From start to credits, I laughed with few pauses. Where other comedies have failed, The Hangover doesn't treat the plot as a to-do list to run through after the gags are done, it keeps it fun and involved."
    },
    {
      "rating": "8",
      "text": "This movie is brilliant. I think one of the stupidest movie in the world, but it makes me laugh and has a great cast with actors appreciable and estimable! Great film!"
    },
    {
      "rating": "8",
      "text": "Fuuuuuuuuuuuuuuuuuuuuuuuuun! This is one really good comedy and you'll not regret watching it. It's original and unpredictable with so much funny jokes and situations. We all know, that there are more 2 following parts. And we also know, that they are full crap, extremely unsuccessful, even annoying. They really did a great job with the presentation of the story in the first part, so much, that they run out of originality, ideas and jokes in the next parts. So enjoy the first part and in my opinion don't waste your time with the other 2 parts."
    },
    {
      "rating": "10",
      "text": "Great movie! extremelly true and funny! Very funny, I would say! Will recommend! People who think this movie is not good, I think they should watch The Box...(Cameron Diaz). After that, they will appreciate it a lot more and realize that the money spent on making the move has not been wasted!"
    },
    {
      "rating": "2",
      "text": "I sometimes wonder if i just watched the same movie as everyone else...it was quite possibly the worst film i have seen in years. dumbed down jokes, repeated scenes, terrible acting and poor storyline. I'm guessing it appeals to people who have been in this situation......"
    },
    {
      "rating": "8",
      "text": "The Hangover is one of the best \"straight-out\" comedies in the last decade! It is not the 'intelligent' type of comedy, such as \"Lost in Translation\" or \"Sideways,\" but it's a crowd-pleaser!! The hilarious screenplay is just perfectly written and, quite frankly, though the situations are completely insane, they seem rather believable in the film. The cast is also rather good, so overall it is a great comedy that will make you laugh harder than the vast majority of comedies out there, nowadays! Great film!"
    },
    {
      "rating": "7",
      "text": "\"The Hangover\" is a brazenly brainless comedy that doesn't know what its doing. But guess what; that's why its funny."
    },
    {
      "rating": "5",
      "text": "I wanted to like it, I really did."
    },
    {
      "rating": "3",
      "text": "This movie was stupid...not stupid funny, just stupid. After 45 minutes, my girlfriend and i both looked at one another and completely agreed that this was a waste of time. If you enjoyed movies like Pineapple Express or Strange Wilderness and found them entertaining and clever...then yeah, you'd probably enjoy this movie. If you value well written movies or genuinely good comedy, pass on this POS."
    },
    {
      "rating": "0",
      "text": "This is the most overrated mess known to man. Someone seriously needs to explain the Hype cause I dont get it. Its Stupid, Not funny at all. over rated to the fullest."
    },
    {
      "rating": "1",
      "text": "Take the movie Dude Where's My Car, remove the plot, cast and humor.Then add hire some idiots with no acting experience to play the main cast.Add a common prescription drug which people hardly know anything about.And then you get The Hangover...A bunch of guys completely forgot what happened last night and spent the entire movie trying to figure it out. Extremely dull and unoriginal."
    },
    {
      "rating": "3",
      "text": "This movie barley ever made me laugh. The plot line was terrible, all the humor was childish and the characters were annoying. If you like movie plots were people get drunk wake up in the morning not remembering anything with stupid obvious humor though out  be my guest. This movie is an example of why all the other countries hate us."
    },
    {
      "rating": "5",
      "text": "Funny with a hint of character progression, but the bro atmosphere, random events, and physical comedy, while executed well, become repetitive and boring halfway through."
    },
    {
      "rating": "4",
      "text": "The movie contains a lack of humor rarely found in well reviewed comedies."
    },
    {
      "rating": "0",
      "text": "Devoid of wit or ingenuity. Relies completely on vulgarity and cruelty to be funny. I find vulgar and cruel jokes funny in doses, but an entire movie predicated upon them is just tedious. The fact that most of America seems to disagree with me on this point is depressing."
    },
    {
      "rating": "0",
      "text": "Absolute garbage. The movie tried way too hard and never made any sense. I thought the plot would make for an interesting movie but the amounts of random garbage thrown at the viewer(way way random than one would expect at Vegas).. just felt over the top. I cannot possibly understand how people enjoyed this."
    },
    {
      "rating": "10",
      "text": "The trailer looked great & the film surpassed my expectations. It was non stop laughs from start to finish as we discovered what happened that fateful. A great comedy movie that isn't a \"lads\" film & isn't just full of purile slapstick."
    },
    {
      "rating": "8",
      "text": "Obviously, a real split in opinion on this movie. I guess some people don't enjoy laughing or think a comedy must be ever so tasteful or maybe just walk around with a stick up their a$$ and it hurts too much to laugh. Personally, I thought this was one of the funniest movies I've seen in years. I laughed out loud (along with eveyone else in the theatre) enough times that I lost count. Sure it was crude, but c'mon what did you expect when you saw a tiger, Mike Tyson and a baby in sunglasses in the trailers? Galifianakis, Helm and Jeong (Mr. Chow) were simply hilarious and the reveals became funnier as the movie went on. The credits tied everything together perfectly, contrived or not."
    },
    {
      "rating": "0",
      "text": "Watched half of it, couldn't stand a minute more, just dreadful, vulgar and nothing funny about it."
    },
    {
      "rating": "4",
      "text": "Stereotypical and obvious laughs. Overrated with few laugh out loud moments. Unmemorable and predictable."
    },
    {
      "rating": "4",
      "text": "I thought this movie was bad but not horrible, Zac Galifianakis was funny as usual but everything else was..well horrible. The dentist guy's wife was the queen of bitches for some reason. I mean did they make her the seed of Hitler to draw away from the horrible plot and actors? That must be it, kind of the opposite of comic relief. Well anyway the Chinese guy made me want to throw the remote at the screen, when he jumped out of the car and beat them up was just plain awful. I love crude humor and physical comedy as much as the next guy but taking a movie that has that kind of Big Libowski feeling to it and adding a stupid scene like that just made me want to puke. The guy pulling his own tooth out was absolutely terrible, the fact that they stole a cop car and it wasn't recovered before the next morning was completely unbelievable. Oh yeah its impossible to count cards on a multi-deck table too. After that scene i knew for sure that this movie is bent on amusing stupid teenagers and college frat boys. I laughed at Galifianikis quite a few times so he was basically the only reason i didn't give this movie a big fat zero. Thumbs down be watchable."
    },
    {
      "rating": "0",
      "text": "I wish I had that 2 hours of my life back. Heard all year about how fantastic it was, finally rented it, and I agree with all the other posters here: vastly overrated, not the slightest bit funny, with unbelievably crude and ludicrous situations. I can find humor in raunchy movies like 40 Year Old Virgin or Superbad or Tropic Thunder, but this travesty has none of the charm or plot or character development of those films. One of the worst I've ever seen, and the closing credits will make you want to take a shower."
    },
    {
      "rating": "4",
      "text": "Other than Zach Galifianakis, this one had no redeeming qualities. I don't see how anyone but boys 13 to 18 could relate to this."
    },
    {
      "rating": "2",
      "text": "Such a dumb movie... Scenes that are supposed to be funny but aren't, bad acting, lame script. It was a good idea for a movie but they didn't even come close to pulling it off, for me at least. There was only one part that made me laugh, couple others made me smile slightly. Very surprised it's even rated this high. 2 stars for the one line that made me laugh in the alter lol... The movie was worth it for that one line."
    },
    {
      "rating": "2",
      "text": "First off, I heard everybody saying how awesome this movie was, so I decided to watch it on New Years with some friends on my Xbox. Crap. That's all it was--I laughed maybe twice. The huge amounts of acclaim for this movie makes me thing, more than ever, that I don't belong in this society. Large amounts of Alcohol can't make this movie good. My only explanation is that everybody must've been high--and even then I can't see so many falling for it. I don't understand this country. I'll give it a 2 for 2 Laughs which is generous. I should rate it based on the number of laughs it was obviously trying to get and failing...the score would've been way way worse."
    },
    {
      "rating": "0",
      "text": "Never laughed once. I haven't been into adolescent humor since, well, I was and adolescent. I guess I do not find movies funny that focus on the gross, irresponsible, idiotic and implausible. This is 2 hours of my life I will never get back."
    },
    {
      "rating": "0",
      "text": "Through the entirety of this film I giggled (Note: giggled, not laughed) maybe twice, three times if I'm feeling really generous. Call me humourless but seeing people hurt themselves in many \"wild and whacky ways\" is hardly what I consider to be humour. I mean come on. I could have written all the \"funny\" elements of this film when I was five (but God forbid I was EVER that stupid). Great, the guys constantly hurt themselves, whoopee."
    },
    {
      "rating": "2",
      "text": "It is a comedy as superficial as unoriginal. Movie with moral that can be seen approaching from a distance, you learn without seeing her. In the U.S. has been a surprise box office, becoming one of the great comedies of the summer, but the truth is that the phrase: 'What Happens in Vegas, stays in Vegas', could be trouble in this movie' What happens in the film stays in the trailer '. \"The Hangover\" is a trap for those who hoped for a refreshing comedy. A very heavy and boring pace, where you surprised at any time in the light of crap that happen to the three protagonists. To be more clear, and spared the nonsense and verbiage without foundation, saying it is a comedy that has nothing new to offer, and offer entertainment offers neither."
    },
    {
      "rating": "0",
      "text": "Spot on review. A vile movie. Due to my work schedule I wasn't able to see it in the theater. I couldn't wait for it to come out on DVD. I love a raunchy comedy as much as the next person as long as it's funny. The Hangover wasn't funny at all. I found the references to pedophila frankly disturbing and any parent who would allow their baby to be in a film to do a mock masterbation scene should be locked away for good. Anyone who finds pedophilia to be worth a laugh needs to do a shot of hemlock for the greater good and gene pool cleansing. If this is what passes for humor in America - especially among the American male, we're doomed. Sign of the times as to how stupid we Americans are. We're becoming an Idiocracy. There's a film the inbreds who loved the Hangover should check out but I fear it's message would be lost on them."
    },
    {
      "rating": "2",
      "text": "Sigh...more vulgar than funny. There were a few laughable moments but it falls in line with all the other supposedly slpastick but mostly dirty humored films."
    },
    {
      "rating": "0",
      "text": "Awful. Just Awful. I have no idea why this movie received such good reviews. Its the most predictable and cliched \"comedy\" I've ever seen. Didn't crack a smile even once during this 100 minute torture test."
    },
    {
      "rating": "1",
      "text": "No comedy value whatsoever...i had heard it was clever so was very disappointed. It is totally stupid and not funny at all...I gave it a \"1\" for the baby being such a good sport."
    },
    {
      "rating": "7",
      "text": "It's a good movie, there's no denying that, but it just didn't meet the expectations set by my friends and some of the reviews I read. I'm not the kind of guy who is too critical on comedy movies, but I just didn't find this THAT funny. Some jokes were forced, and some plot elements were just stupid and unfunny. However, the movie did have a lot of extremely memorable and hilarious quotes, and Alan is a hilarious character. The plot is kinda dumb, but obviously it isn't meant to be taken seriously, so who cares? I'd recommend seeing it with friends, and it's definitely worth watching."
    },
    {
      "rating": "8",
      "text": "Director Todd Phillips has a knack for making some of the best buddy comedies. Road Trip, Old Scool, Starsky & Hutch, and the upcoming Due Date starring Robert Downey Jr. and Zach Galifianakis. I didn't care for most of the previous titles, except Old School. It took me a long time to see Old School, but when I did I was thoroughly satisfied. It wasn's the movie itself that I fell in love with, as much as the genuine feeling of comradery and friendship between Mitch (Luke Wilson), Frank the Tank (Will Ferrell) and Beanie (Vince Vaughn). That is the very same feeling I get when I watch The Hangover. The actors all have a chemistry that makes you believe what's happening to them, no matter how outrageous it is. Zach Galifiankis was the best. What a great way to break onto the movie scene, after a decade of extra roles, and tv spots. The slogan, \"Some guys just can't handle Vegas\" is perfect. Without saying, if you saw the trailer you alreay know that the premise of the story is a bit extreme, but I never got the feeling that events from the film were beyond the realm of reality. Another great thing about this movie was the cameos. I'm always a sucker for good cameos, and The Hangover doesn't disappoint. I loved the appearances of Ken Jeong as the gay Chinese gangster Mr. Chow, Rob Riggle as the over-caffinated cop, and Mike Epps as black Doug. Oh yeah, and that other Mike too. Although, they probally shouldn't have spoiled that one in the preview. With so much going on in the story, this film could have easily had a few unfilled plot holes, but I'm happy to say that it didn't. The only question that went unanswered was how that chicken got in the hotel room. The Hangover was one of my favorite films of the summer. That's saying alot because there were quite a few great movies that came out in the summer of 2009. Todd Phillips may use the same basic buddy comedy palette for each of his movies, but why shouldn't he? It works. I can't wait for Due Date. And if theres any truth to this, we should be expecting a sequal to The Hangover. My fingers are crossed for that one."
    },
    {
      "rating": "7",
      "text": "One of the best comedies of recent years and one most people can relate to (although not on such a grand scale) of memory gaps or complete blanks after a good drinking session. The gags are predictable but still make you laugh and the cast is perfectly suited to the roles."
    },
    {
      "rating": "0",
      "text": "if you saw the previews, you saw the movie. it's obvious the guy who wrote it had a few funny ideas about all the funny things that can happen when your drunk and decided to make it into a movie. the movie is basically getting from funny moment A to funny moment B."
    },
    {
      "rating": "7",
      "text": "'The Hangover' is one of those buddy comedy films where you have to stop asking questions, grab a bucket of buttery popcorn, sit back and enjoy the ride. Character development is virtually non-existent and not everything is correctly wrapped up and explained by the end of the movie. Regardless this is a truly funny feature. The unpredictably and random events are what I'm sure most people will highly appreciate. The lack of a proper narrative is fine and although some people might be put off by the nudity I thought it was brilliantly amusing"
    },
    {
      "rating": "2",
      "text": "It shows how bad the movies are for THE HANGOVER to get this score. This movie sucks so bad I shut if off in the middle. I couldn't take it anymore. What were you all smoking when you went to see it? Crack?"
    },
    {
      "rating": "3",
      "text": "I just didn't get it. Everyone kept telling me The Hangover is the funniest movie of the decade so I expected the funniest movie of the decade. I didn't get it. The movie had it's funny moments and it certainly is a quote-able movie, but I didn't think it was anything remarkable."
    },
    {
      "rating": "2",
      "text": "This movie is just bad. The jokes are simple and cheesy, the whole \"plot\" of this movie is about friends who go to Vegas (just like everyone else has for the longest time). after a night they cant remember the guy who is getting married is lost and the rest of the movie is spent trying to find him. If you like simple stupid movies like those who have will ferrel in them then you'll like this movie. If not then skip it and see something alot better."
    },
    {
      "rating": "3",
      "text": "I believe comedy is mostly about the performance, and the theori that is behind the performance. If you want those laughs where your brain tickles anyway (only comedy that does it for me). In this film I wasn't bored, and sometimes I even smiled of the comedy they presentet for me, but not once did my brain tickle. For me that is the art of comedy, too create moments where I actually laugh even if i try to resist. I don't give this low rating because I think the story is boring or the acting doesn't convince me. It simply didnt make me laugh. The movie could possible even have been funny on paper, but the result isn't. To be a little more spesific: the awkward moments arnt awkward, and the bizzarity isn't bizzar. Once again, I dont think this movie was broken already in the manuscript fase (maybe it was, maybe it wasnt), it might look like the performance from the actors and the directing is the blame for this not working. (excuse my bad English grammar, working on it)."
    },
    {
      "rating": "3",
      "text": "Not funny. I wish it were. But I like 'Wedding Crashers' humor, which is crude and clever. The humor in 'The Hangover' isn't clever. It's all reactive. Even a good line like \"you're dressed like a Cholo on Easter\" from 'Knocked Up' is way way funnier than anything in 'The Hangover'. Nobody will ever quote this film, because none of the lines are funny. Mostly sight gags, situational mishpas, and pissing in public jokes. Don't get me wrong. I like crude, so long as it's clever. Galafinkis (whatever his name is) isn't funny. But being unfunny is his schtick, right? I mean he's intentionally not funny. This is SNL/'Hot Rod' grade humor. And there's barely any t and a in it. Also, the pacing is leaden. Poor Cooper is burdened with a lot of lame straight man lines that state the obvious. It's just not funny. Maybe you have to be in college. I don't know. I had high hopes. I'll go watch Wedding Crashers and Mr and Mrs Smith for the sixth time."
    },
    {
      "rating": "3",
      "text": "This movie had sooo much potential!!! I was getting ready for the movie to be laugh out loud funny, but it never got there."
    },
    {
      "rating": "4",
      "text": "After the movie, I felt drowsy."
    },
    {
      "rating": "2",
      "text": "I like JoelZ's response below \"no particaular scene really stands out, just brilliant from start to finish.\" Usually when something is **** brilliant, you can at least pick one stand out scene, my man. One long cliche for the McDonalds public. Enjoy!"
    },
    {
      "rating": "4",
      "text": "Yeah in parts it was funny but by the time I watched it all my friends had told me it was amazing and the hype was just that hype. The film was predictable and if I watched it more than once I would probably give up after about 20 minutes because I would realise how bad it was the first time round."
    }
  ],
  "recommendations": [
    "the_watch",
    "hot_tub_time_machine",
    "30_minutes_or_less",
    "jackass_presents_bad_grandpa",
    "the_dictator",
    "this_is_the_end",
    "miss_march",
    "a_haunted_house",
    "dinner_for_schmucks",
    "ted_2",
    "anchorman_2_the_legend_continues",
    "grown_ups",
    "identity_thief",
    "jexi",
    "knocked_up",
    "rough_night",
    "dumb_and_dumber_to",
    "the_wrong_missy",
    "ted",
    "couples_retreat",
    "deuce_bigalow_european_gigolo",
    "one_year_one_night",
    "movie_43",
    "step_brothers",
    "neighbors_2_sorority_rising"
  ]
}