{
  "id": 3577,
  "title": "The Condemned",
  "starring": [
    "Steve Austin",
    "Vinnie Jones"
  ],
  "runtime": 113,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "Jack Conrad is awaiting the death penalty in a corrupt Central American prison. He is \"purchased\" by a wealthy television producer and taken to a desolate island where he must fight to the death against nine other condemned killers from all corners of the world, with freedom going to the sole survivor.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uC50pDHgQQtoDFNh9bBNDAvpsqu.jpg",
  "categories": {
    "plot": 7.166666666666667,
    "acting": 5.0,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 4.333333333333333,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 7.428571428571429
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Much better than I expected. The critics see that it's a WWE movie and automatically lower their score by at least 3 points. Vinnie Jones was hilarious as usual in this movie. Stone Cold actually was a much better actor then I anticipated. The only thing that really sucked was the camera during the fight scenes. You couldn't really tell what the hell was going on. It's obviously a knock-off to 'Battle Royale', which was much better than this of course. Not half bad though."
    },
    {
      "rating": "2",
      "text": "A bunch of unlikeable jerks grunting and cussing and punching and stabbing and running and shooting and hi-yaaing and sweaty boobs bouncing everywhere until all the jerks are dead and one jerk is left alive.  Roll credits.  So yeah, a WWE movie."
    },
    {
      "rating": "0",
      "text": "This movie was the biggest load of rubbish I have ever seen...the writer says \"I've been watching all these reality tv shows lately and the idea came to me\", get out. Try watching Battle Royale loser. Almost a genuine copy with the storyline. Real hard to enjoy when it's a good idea dumbed down for the masses."
    },
    {
      "rating": "10",
      "text": "This is a great movie! Steve Austin is amazing- I think he is more better than The Rock but I don't want to compare them. I just commend Austins fight scenes and he definitely could act too! I like him and love him! He's an amazing icon- I wish to see another movie from this superstars! Steve Austin rocks! I love you dude!"
    },
    {
      "rating": "10",
      "text": "Hey the movie wasn't that bad. Okay it no way deserves the rating i gave it but still if critics can give an average score of 2.3 out of ten for a movie that deserves atleast 5 or 6, i can surely give a ten to this. The movie was decent with a neat story and mediocre acting. The fight scenes were nicely done. Steve Austin was wooden but perfectly played his role well. Vinnie Jones was okay . The Rosa's rape scene was a little distateful but the rest of the movie is passable."
    },
    {
      "rating": "10",
      "text": "This is the greastest combat film ever with so many great characters. a movie with Stonecold steve Austen has to be good because he is so hard. anybody who gives it less than 10 knoes absolutly nothing about films and should be mauled on sight by stonecold steve austen"
    },
    {
      "rating": "1",
      "text": "Went in to see a popcorn action movie but got a way too serious movie. The preachy ending and the \"message\" dont fit into a movie starring a WWE wrestler and produced by WWE itself. As for the action, to close to see anything and in need of a steady cam. If you like the camera jumping around this is the movie for you. Stone Cold grunts and fights well enough but he is not the next breakout wrestling actor ie The Rock."
    },
    {
      "rating": "4",
      "text": "Yet another viscerally violent and brainless WWE movie. Pray Austin stuns you out cold for the whole mess-- I mean movie. No wait, I do mean mess."
    },
    {
      "rating": "10",
      "text": "Whoever is a hater on this movie obviously has something against the WWE. If someone else came out with this movie it would have much higher ratings. This is the best action/suspense movie I've seen in a long time. The only other movie to compare to it is The Bourne Ultimatum. This movie rocks. Stone Cold doesn't even need to act to play this part. He literally is himself in the movie. A tough SOB."
    },
    {
      "rating": "9",
      "text": "What are these critics thinking? It's a movie not a documentary. Steve Austin did a great job in this movie. This guy can act. He was great in his scenes with Vinnie Jones and demonstrated that he's got a lot more than the Stone Cold character he played during his time at the WWE. If you want to sit back and have a good time at an all out action film, then this is a movie you should absolutely see."
    },
    {
      "rating": "10",
      "text": "A dark, confusing, action-packed, hit ride with abs that fight stronger than any of the 300."
    },
    {
      "rating": "8",
      "text": "This movie was so awesome. I know I should be dissing this movie, but it was so cool."
    },
    {
      "rating": "10",
      "text": "this move is sweet all of the people saying it is crap dont lessen to them they probably never seen it before in their life dont judge a book by its cover dude go see it then rate it i give it what it deserves a 10+++"
    },
    {
      "rating": "5",
      "text": "I mean... a 23?!?! its not that bad. Ya, steve austin isnt a great actor, but I mean he works... All im trying to say is that this movie is a movie you rent, or see with a bunch of buddies, not something you go into expecting \"Battle Royale\"."
    },
    {
      "rating": "10",
      "text": "This movie is totally underestimated by critics, it's the very first of it's kind, and an experience not to be missed."
    },
    {
      "rating": "8",
      "text": "I found this movie to be extremly good, i first thought it would be killed with action, but it had a good amount of fight sceens and was very well made and Steve Austin did very well acting in the movie. I just the movie."
    },
    {
      "rating": "5",
      "text": "So after a couple or 15 Budweisers, me and the old lady and the kid decided to go watch Stone Cold kick ass, but he turned out to suck a lot more ass than he kicked. So an hour into the flick, when I was expressing my displeasure the usual way (making armpit farts at the screen, with nobody in the theater to shut us up because we were the only 3 people there) the old lady said, \"Look, if the movie's pissing you off THAT much, why don't you just write in to Metacritic, like that majorly longwinded dude keeps doing?\" before she turned around in her seat and went back to sleep. So here's all the reasons why The Condemned blows jalapeno chunks: 1.) The idea ROCKS! It's about a reality show about 10 convicted convicts who get dropped on a desert island and told to kill each other until one survives. Since this kind of show is way too cool to show on network TV for free, you have to watch it online and pay for it. What they should of done was have all the REAL reality show contestants who've hacked us off over the last few years show up and let Stone Cold smoke their asses: Omorosa from The Apprentice, Sanjaya from American Idol (if he can find him under all that hair), Richard from Survivor (he's doing time anyway, so it's like a 2-for-1), and that gay couple from The Amazing Race (it doesn't matter WHICH gay couple). And Johnny Fairplay's majorly into the WWE, so he can host! 2.) The friggin cameraman acts like he hasn't taken a whiz in a month plus somebody dumped a colony of red ants down his drawers. When I wanna see eye gougings, I wanna see em close up! 3.) No eye gougings. Or flying arms or legs or ANYTHING decent. You'd think in a movie where Stone Cold goes around blowing everybody up, you'd get at least a good blood mist or two. What is this anyway, a Lionsgate movie or a freakin Miramax? 4.) Speaking of which, part of the time it looked like Stone Cold was trying to ACT!!! WTF?!? If I wanna watch flippin Larry Olivier, I'd go down the hall at the multiplex and check out whatever flick HE'S in! 5.) My gay film-school brother in law keeps talking about subtext in movies, and this sucker has enough subtext to take two dozen piss breaks during! In every other scene (like the one where the chick gets raped and the people in the bar watching it look all shocked and horrified, like if the keg had run out) somebody looks at the camera and gives a Sunday school sermon about how violence is dehumanizing and all that crap, taking up movie time that could be better spent having TWENTY prisoners in the movie and disemboweling them. But my kid's gay first grade teacher, who won't let him be in the classroom alone with the turtles and hamsters, DID say that we should probly show him more Spongebob videos and less Leatherface. So maybe me and the old lady and the kid WILL take a break from violent movies...right after we get done checking out Hostel 2 and Saw 4!"
    },
    {
      "rating": "8",
      "text": "Its been a long time since i watched a good old fashioned action film, i watched it with friends & had a good laugh, mainly at Austin's mono-tone smartass replies, but its violent, fun & easy to watch with the lads, beer & popcorn."
    },
    {
      "rating": "8",
      "text": "I can't believe The Marine got a higher average score than this movie, both with critics and reader reviews alike. This movie is way better than The Marine. Sure it's no Battle Royale, but it's still good. Sure does get dark about half-way through the movie though, and that, for me, isn't such a bad thing, since it allows some themes to stand out, even if they're cliche'. But come on, how many action movies out there don't have cliche's? At least this is a good action movie. Go see it!"
    },
    {
      "rating": "8",
      "text": "Personally, I believe the movie is great, if rated as an action movie. It really depends on what the person expects to see. I watches Spiderman 3 the day before I saw the Condemned, and this movie was extremely better. It had more action, an interesting plot and comedical satire. I read most reviews of the movie, and they all judge it badly because \"the only pupose of the movie was the violence, the blood and the profanity...\". Obviously, you cannot compare the movie to The Departed, The Forgotten, Sixth Sense, Four Brothers, or any other tension-filled movies based solely on the plot, because in reality, this movie was not solely based on the plot; the main focus was the action (hence, \"action movie\"). Therefore, if you enjoy action movies, and you press the play button hoping to see some great stunts, fights, a blood-thirsty villian and a tough outgoing hero, then you will love this movie. However, if you hope for an excellently written script, original plot, a romantic struggle, a history-filled rivalry between the protagonist and antagonist, and a unimaginable climax (thinking this movie to be an outstanding novel), then I would just recommend to turn off your TV, and watch Titanic."
    },
    {
      "rating": "0",
      "text": "This is really horrible. I do not want to play this game. I'm glad i borrowed it before playing. Now I'm recommending that everyone save their money and don't bother buy it. Truly awful. It is boring, tawdry, and the story is so derivative. The acting is third-rate, amateurish. The effects look like they were drawn using crayon. A piece of godawful trash."
    }
  ]
}