{"id": 2267, "title": "The Dictator", "starring": ["Sacha Baron Cohen", "Ben Kingsley"], "runtime": 83, "genre": ["Comedy"], "description": "The heroic story of a dictator who risks his life to ensure that democracy would never come to the country he so lovingly oppressed.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/n0W7kajF4GFMRk2c0wWwMQqTaDM.jpg", "categories": {"plot": 4.555555555555555, "acting": 2.8, "ending": 3.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.049382716049383, "action": 5.0}, "reviews": [{"rating": "5", "text": "No where near the standard of Borat but still funny in places. I think Sacha Baron Cohen's comedy may be starting to wear a little thin and has become rather predictable. Still he has managed to come up with some hilarious new gags and if you do not mind wafting through some pretty poor parts you may enjoy this film."}, {"rating": "7", "text": "Pretty funny film after seeing Bruno which was so ungodly wierd and bad . I found myself laughing alot start to finish through this film . pretty much every thing about the film is rediculas but its what helps make it so funny . Cohen you can tell is having fun with this role and as usaul doesnt hold back from saying any nutty thing he wants to ... but hey as long as its funny . There are also alot of cameos from alot of differnt celebritys in the film but Cohen is the Star and every funny line is his ."}, {"rating": "7", "text": "With Borat it was so shockingly funny you just could not help but piss yourself with laughter, but in Bruno the formulae was stretched thin and the gay jokes just didn't hit the funny bone. The Dictator falls neatly between the two, trading huge piss your pants laughs for steady giggles and the occasional belter. Certainly one of the funniest movies we'll see this year, but not a classic by any means but the chance to see Sasha Baren Cohen do what he does best and offend as many as people as possible is impossible to miss."}, {"rating": "7", "text": "Very funny and a good job by SBC/Aladeen. There were no truly dull parts of the movie. Always funny, no dull parts, an unpredictable ending. The movie was a little too short though. Much better than Bruno, but worse than Borat. If you like a good comedy, see this movie."}, {"rating": "10", "text": "Haha, all people beneath me are hating the movie... I liked it very much tough, just laughing, not the best plot ever, but i can live with that!! not every movie can be the green mile or something. and of course its stupid sometimes, but Sacha Baron Cohen's face makes a lot good."}, {"rating": "8", "text": "Great movie with somewhat great message in the end. Some people may get offended of the racist jokes but overall a truly entertaining movie. Well thought out comedy and awesome actors. Go watch it and be entertained."}, {"rating": "9", "text": "In my opinion, this was just as funny as Borat. Maybe even better. I loved 'The Dictator'. As well as hilariously crude humour, the plot was a great one with great actors, great lines and great...greatness. I was quite sad at the fact it was only 83 minutes as some scenes felt a bit uncompleted and lacking in some more dialogue which could have helped to boost the rating up even more.However, this is definitely the funniest film I have seen all year, in my opinion. Bravo to Sasha Baron Cohen and his character of General Aladeen for giving me an incredibly fun and hilarious 83 minutes."}, {"rating": "9", "text": "Waaaaay funnier than the other garbage that's out there currently passing for comedy cinema.  Don't listen to the humorless nay-sayers.  This film is well worth a look."}, {"rating": "9", "text": "I wasn't expecting much from this movie but it blew me away. It was really funny and worth the money to see it. I didnt like Borat or Bruno but really loved this."}, {"rating": "8", "text": "A new movie of Sacha Baron Cohen, I don't be fan of Sacha, I hate he, but I need say that this movie is really funny, have great and funny moments that do this film one of the most entertaining movies of the year."}, {"rating": "9", "text": "Either you get Sascha Baron Cohen, or you don't! This is him at his best! Or worst! Depending on which camp you reside. There are those fence post riding nanby panbies, who just loved Borat, but just don't get the other films? Wankers! Borat was not just some happy little accident made by an over the top wannabe! It was a piece of a large puzzle, given to you by the worlds next Charlie Chaplin.  Like it! Don't like it, Baron Cohen led you to the choice. But ultimately it's up to your brain to understand. As with all his work, I thought it very mind openingly funny!"}, {"rating": "3", "text": "A real missed opportunity... surprisingly jokeless. The best moment is his speech on the U.S. one day being a dictatorship and doing all the things they are already doing... but that was the one joke the audience didn't seem to get. Sad."}, {"rating": "3", "text": "I saw this in the theater today, well the 30 opening minutes at least.  they were bad enough for me to walk out.  and i never walk out of movies.  Loved Borat and thought Bruno was okay.  But this is no good.  The jokes were all either very simple or very stupid.  Before this review gets too scathing i'm just gonna end here by saying: don't see it, or see it on video later."}, {"rating": "8", "text": "Like every other Sasha Baron Cohen movie, the Dictator is intended for a mature yet good humored audience. I don't blame the several critics who walked out of the theater, but I feel as though the first half did not do the movie justice at all. In order to enjoy the Dictator you need to be able to relax and laugh, and not take everything so seriously. There were several moments where I found myself overwhelmed with laughter. Overall the Dictator was a good movie, not as good as Borat, not as messed up as Bruno but good enough to deserve an 8."}, {"rating": "5", "text": "If you go into The Dictator expecting much, you're going to get absolutely nothing out of it. However, if you go knowing it's not going to be a great comedy, or even a good comedy, then you'll end up somewhat enjoying it. The movie has its moments, but it's not one after the other kind of hilarity. Sacha Baron Cohen is a guy who likes to make movies on a lot of controversial stuff, and he does so again, making mention to things like Bin Laden and 9/11, but it still ends up being funny. Serviceable comedy, nothing great. Anchorman 2 teaser however, it's gonna make you cream."}, {"rating": "3", "text": "I went into this movie expecting light entertainment, and got even less. A few giggles here and there, but for the most part, The Dictator was agonizing to watch."}, {"rating": "3", "text": "85% hacky.  I love 'purposely stupid' as much anyone else, but these jokes missed the mark way too many times.  The ratio has got to be at least one decent joke for every three flat-liners, and the whole first hour of this film belongs in the ICU.  It picked up around the beginning of the third act, but by then I was only watching because I was planning this review.  I'll put it like this, any adult who grew up watching 80s and 90s cartoons has actually heard most of these jokes or similar enough ones to know whats coming.  If you have too much free time, sit down in front of this.  Otherwise you can do better very easily."}, {"rating": "7", "text": "I went into this film expecting about 3 or 4 funny scenes, but I was pleasantly surprised in every way. This is Sacha Baron Cohen's best film in my opinion. It is very similar to Borat, but the context is so much more meaningful and parodic of  politics and recent events in international affairs.The whole concept of the movie and its execution aren't flawless, but the constant humour and jokey style make this a worthy film. And don't be discouraged by the 83 minute run time. It actually feels much longer, and is packed with some original scenes. It's not a professionally made film, as evident by its relatively small budget, but it is definitely worth watching for a good laugh."}, {"rating": "7", "text": "This Dictator is simply funny! it's really random and unexpected with really funny jokes. The movie is kind of short so it doesn't bore like many other movies, and unexpectedly there's an idea behind the movie and it's kind of political. If you want to see a movie that doesn't require anything but some sense of humor you will love this."}, {"rating": "10", "text": "Excellent movie! Sacha Baron Cohen is back with one of the best comedy movie ever!  Simply perfect. I love Aladeen! Excellent movie! Sacha Baron Cohen is back with one of the best comedy movie ever!  Simply perfect. I love Aladeen! Excellent movie! Sacha Baron Cohen is back with one of the best comedy movie ever!  Simply perfect. I love Aladeen! Excellent movie! Sacha Baron Cohen is back with one of the best comedy movie ever!  Simply perfect. I love Aladeen!"}, {"rating": "9", "text": "HilariousOnce Again, Sacha Baron Cohen Steals The Show With Very Clever Humor."}, {"rating": "10", "text": "I loved the movie, it had its laugh out loud moments. The script is great, lots of fun, a little bit of politics, and great jokes by SBC. I highy recommend it!"}, {"rating": "2", "text": "A meandering, occasionally funny let down from a man who should have known better. I barely chuckled and felt as if my intelligence was being insulted at nearly every turn."}, {"rating": "5", "text": "The Dictator suffers the same problem as many comedies these days: The best bits are in the trailer, and many of the jokes rely on pop culture. It's lazily written, but there are strokes of genius here and there. Between the strange almost-surreal type of humor and the Borat-inspired quips, the film can't decide what it wants to be, and it ultimately stumbles over its own jokes."}, {"rating": "0", "text": "Not a funny movie. It takes a genius to write a movie about morons, unfortunately this is not one of those instances. This is a movie written by a moron and never lands a joke."}, {"rating": "2", "text": "Disappointment soon led to anger. The laughs were few and cheap. The Dictator completely missed the nail by a long shot, only people from ages 12 -15 would find the film amusing."}, {"rating": "3", "text": "All in all a very disappointing movie, too much hype with the trailer.... It's watchable but would not say I laughed my head off. will not recommend it. American pie and 21 jump street were of a different league of comedy compared to the dictator."}, {"rating": "6", "text": "Movie was ok but not a classic like bruno & Borat. but you know is was entertaining and it was almost worth the 20 bucks (with popcorn & drinks). Overall the movie was great"}, {"rating": "8", "text": "Brilliant , its as good as borat if not better , the trailer and reviews really don't do it justice. Brilliant progression of constant hilarity.All the best bits are offensive so aren't in the trailer."}, {"rating": "10", "text": "Awsome movie, laughed like 1/3 of the movie. Loved it, i guess that many people find it offensive but cmon, its only jokes. Jews stop dislikeing it!!!!!!!!!"}, {"rating": "10", "text": "It is one of Sasha Baron Cohen's film and his first scripted.  Funny, but cliche.  Decent comedy and worth the price of admission.  Even the Anchorman 2 teaser was worth the admission..."}, {"rating": "10", "text": "What a wonderfully funny movie.  Warning, if you are offended by vulgar humor, this movie may not be for you; but most of the rest of us will be laughing whole-heartedly.So many cute gags, an awful lot of clever writing.Loud laughter came from all directions around me, all throughout the movie."}, {"rating": "10", "text": "i have not laughed like this for a long time, the movie was hilarious and definitely not for everyone, if you have a crude sense of humour and its very un pc"}, {"rating": "10", "text": "One of the funnier movies I've seen in a while. It really picks up steam around the halfway mark. You will probably be offended if you identify with crunchy hipster puss1es  who live in park slope and williamsburg but that's what made it funny for me. Definitely not pc and definitely worth seeing."}, {"rating": "2", "text": "I got dragged along to this movie with my girlfriend and her family - I wasn't going to see it otherwise as I feel Sacha Baren Cohen has been on a steady downward spiral since the Ali G days (which seem so long ago now) when he was actually smart, funny, and enjoyable to watch without cringing.The Dictator is a slapstick gross out film.  Nothing more, nothing less.  It was one of those films that you feel pressured to laugh at, specially in a movie theater filled with people (many who weren't too impressed with the film, as I heard very few laughs).  I feel the move to a scripted comedy was a terrible idea, as EVERYTHING feels forced and pre-conceived.  All the jokes rely on being politically incorrect and shocking to get laughs, but considering the fact that none of them are done 'well' at all makes this the films main failure.  I love a bit of 'non PC' humour, and it can be done really well to great effect.  But in 'The Dictator', EVERY joke is based on racism/sexism/misogynist attitudes that grow stale before they are even said.Gone are the days of Ali G, where SBC would use his characters as a vessel and tool to show truths from other people, in result showing their ignorance and stupidity. Now all that's left is a Z-grade comedy film that is best suited for 13 year old boys who aren't well accustomed with good humour, and get a good laugh from the political incorrectness.  The only redeeming scene in the film is where, after ripping up a new constitution for democracy for his home country Wadiya, SBC goes on a rant saying that 'America should be run by a dictatorship', going on to mention all the 'perks' of a dictatorship, ultimately describing all the ways America has cheated and gone against its democratic constitution.  This is a great scene, and if the film was based more on smart tongue in cheek humour like this then the film could have been a success.  Unfortunately, it isn't, and it is not a good film in any form as a result."}, {"rating": "1", "text": "Boy, did Sasha Baron Cohen ever miss the mark with 'The Dictator.' Like many others have said, I wanted to like this movie. I paused the DVD about 45 minutes in and debated slogging through the rest of it for the sake of finality. Who knows, maybe it would get better. But boy, it didn't. The majority of the jokes were anecdotal, like \"Don't worry, I was the best _______ in Wadiya, I came first place in the Wadiyan _______ competition!\" And the other guy, the nuclear scientist guy would reply with \"But you were its only competitor! You had everyone else killed or disappeared because you're the Wadiyan dictator and that's what you do you **** Let's do slightly different iterations of this joke about 50 more times throughout this film and hope it's still funny.\" The jokes were like Family Guy flashback gags without the cutaways. Well, there were some, but that of course doesn't excuse how horribly written and repetitive the jokes in this movie were. Another example would be Anna Faris's hippie co-op store-owner, that Aladeen would constantly make jokes about her not shaving her armpits. Seriously, he must've said that like twenty times, culminating in a scene where he licked the **** things. Again, like other reviewers said, I started getting angry towards the end of this film. Baron Cohen is so much better than this movie. 'Borat' was a lot more intelligent and politically inclined than 'The Dictator', and THAT movie had a naked wrestling scene for **** sake. If you're a Sasha Baron Cohen fan, skip this film. If you've never seen any of his work, don't watch this movie. Cohen is a lot better when he's messing with real people disguised as \"Borat\" or \"Bruno\", but now that those characters are so popular, and he himself is famous and recognizable, he can no longer make such movies. But hopefully 'The Dictator' isn't all that's left in his comedic repertoire.\r I rate this film 1 out of 10, and it gets rating of 1 simply for the fact that it's a movie."}, {"rating": "7", "text": "It was a really good movie, though it was a little shot on laughs and no quite as funny as I thought but no where near as outrages or hilarious as  unscripted Borat, Cohen has produced another hearty film dealing with sterotypes. Though the magic of Borat didn't work for the dictator its still a funny movie with great moments."}, {"rating": "9", "text": "I did not expect this movie to be good.  I expected this movie to be mediocre at best, as many of these slap-stick comedies are just too stupid and immature.  I was, however, very pleasantly surprised to find that the movie was pretty hysterical, IF you don't take it seriously.  The jokes are not sophisticated and the humor is simple... but IT WORKS.  This movie doesn't take itself seriously and neither should you.  The movie gets off to a slow start but gets funnier farther along.  I found myself chuckling through the majority of the movie, and laughing out loud (loudly) several times.  Most negative reviewers are comparing this movie to Borat, claiming Borat to be the far superior movie.  However, this movie IS NOT Borat.  This movie is simply a very well done \"leave your brain at the door\" comedy (which are hard to come by these days) and contains plenty of laughs, as long as you do not go in expecting to be blown away.  Definitely worth 10 dollars."}, {"rating": "1", "text": "Have never written a review here, actually signed up just to write this and I have been using Metacritic regularly for a few years now. I had enjoyed Borat, Bruno was poor enough, saw the trailers for this and thought it looked crap, then got bribed into watching it, but when I saw the middling metascore I Said I'd go in positive....simply awful film, I laughed once, at the end, at an outtake. Jokes and plot are aggravatingly transparent, acting is poor, characters are painfully stereotypical and although this should be expected in a film like this it just doesn't work anymore."}, {"rating": "2", "text": "Aaah..Sacha completes the fall from 90% fabulous humor and 10% offensiveness with Ali G ten years ago, to vice versa with the Dictator. He's just not funny anymore."}, {"rating": "10", "text": "Excellent film. Film of the year for me so far, Many laughs were had, Thanks SBC for another great film. Actor of the decade. Very creative and original, could watch it again and again."}, {"rating": "0", "text": "Just terrible, I had to walk out after about 45 minutes because this is easily the worst movie I've seen in the past few years - and I've seen a lot of bad ones. In order to be a comedy the jokes need to be funny but all of the jokes in 'The Dictator' just fall flat. All hype, no substance - stay away at all costs."}, {"rating": "10", "text": "I will start off by saying I do enjoy Sacha Baron Cohen and find him very funny even thought I thought Bruno was weak and Ali G was better as a show or short clips I had seen the reviews on this site about people leaving the cinema early and thought  may be the same again. But this ended up being the funniest film I have seen this year the whole cinema was in fits of laughter as well. Some stuff  I can see people being offended by but that's the risk you take with his movie's  but all in all this is up there with Borat very funny movie a must see."}, {"rating": "9", "text": "Angels:  Sacha Baron Cohen-funny, original, gross, satirical, brilliant...what can I say.  Actually, I wanted to stop here Angels, but the site would not let me.Play you harps beautifully Angels."}, {"rating": "5", "text": "As a vehicle to link together a bunch of genuinely funny and deliciously offensive gags, the film achieves what it sets out to do.  But the filler - the story that links it all together  - is just too pedestrian compared to what I feel will be Cohen's best work down the road."}, {"rating": "7", "text": "When I saw the trailer for this movie I was amused but I thought it would be bad. A lot of the good jokes seemed to be in the trailer, one person said once the dictator lost his beard the movie would lose its touch, and when my brother came home he said that he did not like it that much. I went to see it and let me tell you it was funny. The Dictator proves that everyone has different opinions some people get it and some people do not and I got most of it.\tThe Dictator is about dictator Al-Addeen, I think thatâ"}, {"rating": "0", "text": "No redeeming quality whatsoever! I should have known better than to give a Cohen movie another shot.  The only positive thing I can say about it is... It's his best movie yet. The bar is just set so low."}, {"rating": "4", "text": "This effort brings to mind M. Night Shyamalan. The first effort was great but everything after became more and more dismal. Borat was fabulous, Bruno was pretty good but the Dictator, while there were a few amusing moments, is easily the worst of the three. Some parts are downright painfully not funny. In my sick twisted mind, I did find the 911 jokes to be the best of the show."}, {"rating": "8", "text": "I'm still a big fan of Sacha Baron Cohan, I think that The Dictator was a solid but good movie. Although Borat and Bruno were 2 of my favorite comedies from him, The Dictator wasn't quite match to his credit. But I saw the trailer during the Super Bowl. My favorite part is when they made fun of the Olympic Games, General Aladeen started to use a pistol and shoots every athlete in a track & field event, that takes balls. Whether you love Cohen or not, sometimes he may be controversial thanks to the Donald, but slapstick comedies are made to be really funny like the Jackass movies. Probably I'll see it next week or wait for a rental. The Dictator wasn't a disappointment, but trust me, actions speaks louder than words."}, {"rating": "3", "text": "Although  The Dictator offers some funny Jocks but with a bad storyline and Script the movie is too hard to like . The Movie delivers delivers nothing lightened. The whole point of the movie is Useless . Sacha Baron Cohen was a bit flat in his role and others were horrible . Saw the Movie and trying to forget it and don't ever wanna see it again . Its a total wast of time ."}], "recommendations": ["the_hangover", "hot_tub_time_machine", "jackass_presents_bad_grandpa", "a_haunted_house", "one_year_one_night", "this_is_the_end", "dumb_and_dumber", "ted_2", "anchorman_2_the_legend_continues", "the_three_stooges", "dumb_and_dumber_to", "30_minutes_or_less", "wild_hogs", "the_watch", "dinner_for_schmucks", "nacho_libre", "the_interview", "scary_movie_4", "tropic_thunder", "a_million_ways_to_die_in_the_west", "hot_fuzz", "movie_43", "white_chicks", "step_brothers", "grown_ups"]}