{"id": 2587, "title": "The Time Machine", "starring": ["Rod Taylor", "Alan Young"], "runtime": 103, "genre": ["Thriller", "Adventure", "Fantasy", "Science Fiction", "Romance"], "description": "A Victorian Englishman travels to the far future and finds that humanity has divided into two hostile species.", "releaseYear": "1960", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/cq2kBK4t0ADB3Nc83NQ16TZqCiM.jpg", "categories": {"plot": 6.636363636363637, "acting": 6.4, "ending": 6.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.333333333333333, "funny": 5.0, "action": 6.5}, "reviews": [{"rating": "5", "text": "There were some interesting moments in this film. At times it was a lot more exciting than the original, but that is simply because it is newer. But overall, its pretty bad. I would rated a 3, but it visually held my interest longer than that."}, {"rating": "2", "text": "Took all the intrigue out of time travel."}, {"rating": "4", "text": "Dumb, dumb, dumb. Fun to watch, but the acting was about the same quality as Barney, the kids' show, and the plot has holes that are miles wide. Some good effects. The last 1/3 is especially lame. Anybody know what Jeremey Irons said in the climax scene????? I replayed it 5 times and still couldn't understand him."}, {"rating": "6", "text": "it aims to be bigger than it can be, but overall it isn't a completely cheesy waste of time. I just wish they would have shed more light (no pun intended) on the uber morlock. that was the most interesting part and it only lasted 5 min."}, {"rating": "10", "text": "I can't believe some of the reviews on this film. One even complained how bad the future had become, and that they were expecting more technology, advanced people. Did they even bother to read the book, or watch the original film from the 60's. I loved the first film, but I loved the remake just as much. H.G Wells great grandson directed it, and I thought he did a great job. He added a lot of depth, and story to the Morlocks. One person wrote that it took the intrigue out of time travel. This story was never about time travel, as much as it was about what could happen to civilization if there were a catastrophe, and forced some underground, and others to survive above ground. Come on people, read the book."}, {"rating": "9", "text": "This is a really good movie.  It has a very vintage feel to it that is refreshing and classy.  The emotional plot really pulls you in and helps you connect to the characters.  I like it mainly because of the science fiction scenarios and the logical what if elements.  All in all it is 90% better than 100% of the other films made."}, {"rating": "1", "text": "O filme  mais bosta que meu amigo Caio"}, {"rating": "10", "text": "I loved the story behind this movie.  To me it is more than just a love story; it demonstrate different theories of  destiny/time travel and the end of the world.\r This movie favors the Linear time travel theory.\rOn the movie when the fiancé died at the park from a robbery, after her death he builds a time machine in order to change the scenario( from the past) in order to keep his fiancé alive. He traveled to the past and changed the location and every single time she died from a different cause in each different location.   He then decided to travel to the future to be able to understand why he cant change his fiancé destiny.\r“Linear time travel says of you travel back in the past and return to the present, nothing will have changed and thus you can't change the future no matter how much you try. And thus, believing in the linear time travel makes destiny predestined since nothing can be altered.\r Branched time travel aka multiuniverse time travel says you can go back in the past and alter the present/future. Thus this theory arises the idea that destiny is not predetermined, unless you where destined to change the future? But this theory also arises the grandfather paradox”\r End of the world theory:\r I have my own theory that the world will never end, it will just re- born…. In the movie we see when the scientific travels to the future  he traveled to when the world was advance in technology then he traveled further and saw the world on war and when he went even further the world was like it was the beginning  no technology  living like cavemen). And if you think about it in reality that is what is been happening in our world.  According to history, the first civilization was the zomelian and the Egyptians. The Egyptians back then they had the knowledge that now a days we are still discovering. An example are the chemicals that the Egyptians used for the mummification process and these were just recently discovered again by scientists.   Still we don’t know how the Egyptians were able to build the pyramid to perfectly line up to the three stars and it has a perfect geometry.  Egyptians women used to have similar rights to men and decade’s later women lost rights until around the 19th century. In conclusion life is going in a circle!"}, {"rating": "4", "text": "This movie is somewhat disappointing. It started a little good, (beginning of spoiler) with the guy building the time machine to go to the past and save his girlfriend from a terrible death (ending of spoiler). Then he built it and then we saw a incredible scene of him going into the future. Sadly, when he does arrive to that far future it's just terrible. A horrible story that I didn't care about, terrible script, and mediocre performances. I wanted to see more future, more utopias, more technology, but it just showed a tribe of non-evolved people from the future, and a whole story related to that.\rI am just very disappointed about everything in the movie, except the time travel itself. I found it cool and interesting, and it made me think about paradoxes and that stuff.\rReal score: 5.5"}, {"rating": "6", "text": "I've never seen the other versions of time machine or read the book. But this remake is quite entertaining but hollow. You just don't feel emotionally connected to any of the characters or there plight. And because of the way its constructed it's impact is kind of dependent on it. That being said this story of a scientist who builds a machine to try and go back in time to prevent the death of his love is a little formulaic and by the numbers. As you would guess it's something he really can't do and accidentally ends up travelling far into the future where cannibalistic humanoids hunt the remaining population. One of the tribe is played by pop singer Samantha Mumba. As it stands it's a fun film but not very memorable. That being said there are far worse ways to spend 90 minutes.Budget: $80mDomestic Box Office: $57mWorldwide Box Office: $124m3.25/5"}, {"rating": "7", "text": "I found this to be a very entertaining movie, its got a good amount of special effects and some of the futuristic jungle type landscape scenery is quite stunning, I felt that its a shame my TV is quite small (20\") as im sure it would benefit from being watched on a larger screen.This is one of those movies that is quite absorbing and so its a good bit of escapism I feel. There is a sense of it being a bit silly and unrealistic I suppose but of course its fiction based and its really quite engrossing. I'll admit now that I missed the first 20 minutes or so of the movie, it was shown on TV recently and I didn't realise until I was about to switch the TV off for the night and then saw it being played on a channel and realised that it was a movie I hadn't seen before and that interested me, so I set it up to record the rest of it hoping I could make head or tail of it but im glad that I did because having seen it, I definitely did enjoy it. It is quite interesting how it depicts the future in different times being very, well, different and the concept behind it is interesting. Of course its based on H G Wells' novel which isn't one I've read personally but I have heard of, so I can only really comment on the movie itself. I'm sure there are people who will disagree on the movie being faithful to the book or whatnot but for what it is, I thought it was a good movie as it was both entertaining and it made me think. It is mainly an entertaining movie, however I feel that there is a serious message there as well, which some might find a bit cheesy I suppose but personally I enjoyed it and was glad that I'd seen it. Perhaps I'm a bit biased as I'll admit I have been fascinated by the whole topic of time travel and as a kid movies such as the popular Back to the Future trilogy were big favourites of mine, though this movie is rather different with the times being travelled to and the depictions of life then being more extreme.If the special effects had anything of a budget feel to them, I'd likely have a different opinion of this movie, the script I'd imagine was one that would be rather surreal and difficult to fully capture on screen without quite a strong dependency on modern CGI techniques but as I say, the special effects really don't disappoint and there is also a good balance between high action scenes and more I suppose philosophical scenes.At the end of the day, you'll likely think that the movie is a little far-fetched but it doesn't matter because its entertaining and it certainly passes the time. I did feel that towards the end, it went perhaps a little too sci-fi and that might put some people off as well but it is mainly an entertaining movie and it is quite thrilling as well in points and it does that well, so overall im pretty impressed, although there's something about it that makes me feel that it doesn't quite deserve the full five star rating, I feel that its somehow a bit too 'Hollywood', there's something rather cheesy about it and the sci fi aspect of far-fetchedness (I just made that up lol) may well put some people off. Its not perfect but its definitely good.Yes I'd recommend it. Its a diverting movie with good special effects and action scenes and it certainly passes the time. Its quite imaginative and the performances aren't too bad either, so yes, if this interests you then by all means, check it out."}, {"rating": "6", "text": "It was an entertaining movie, the acting was pretty good and the story was fun. Definitely watch it if it's on."}], "recommendations": ["source_code", "the_butterfly_effect", "arrival", "annihilation", "project_almanac", "mortal_engines", "the_day_after_tomorrow", "city_of_ember", "the_13th_warrior", "contact", "back_to_the_future_part_ii", "the_maze_runner", "voyagers", "avatar", "the_midnight_sky", "donnie_darko", "sunshine", "maze_runner_the_scorch_trials", "time_trap", "ready_player_one", "divergent", "interstellar", "cloud_atlas", "predestination", "antebellum"]}