{
  "id": 2574,
  "title": "The Finest Hours",
  "starring": [
    "Chris Pine",
    "Casey Affleck"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Drama",
    "History",
    "Thriller"
  ],
  "description": "The Coast Guard makes a daring rescue attempt off the coast of Cape Cod after a pair of oil tankers are destroyed during a blizzard in 1952.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6UG91TJ4DKI6FGdqXZfDBeRZHX8.jpg",
  "categories": {
    "plot": 5.217391304347826,
    "acting": 6.172413793103448,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 6.166666666666667,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 5.666666666666667
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This film is based on a true incident in 1952, when 4 Coast Guard sailors ventured out into a massive New England storm in a small boat. Their mission was to rescue 32 men who were stranded on a tanker that had literally split apart in the rough seas. The action alternates between the harrowing ride to the rescue (helmed by Chris Pine, playing a determined introvert) and the attempts to stay afloat by the tanker’s crew (led by an equally underplayed Casey Affleck). Toss in a heartfelt romance and you have all the ingredients of a classic adventure. The perilous challenge of the pummeling waves makes for formidable visuals, even though the obviously CGI source lacks a realistic edge. The personal encounters are clichéd and not especially compelling. It’s well made and sometimes bracing, but there’s an earnest formulaic feel that keeps it from being as involving as it might have been."
    },
    {
      "rating": "7",
      "text": "It takes \"The Finest Hours\" some time to find its bearing, afterwards it's a nice sail through the rocky storm.\r As far as disaster movie goes, \"The Finest Hours\" is atypical of the usual mold. It seems vanilla, slightly timid in the execution, which is still fine due to its production quality, but it does overturn it from more harrowing promises. There's also quite a bit of spotlight given to the romance subplot, this feels unnecessary and in some events might break the pace. However, when it gets the steam rolling, it produces a delightful display of blue cold waves and breaking steel.\r This is a real life story of the rescue of the sinking tanker in 1952 told mainly in two perspectives; the Coast Guard Bernie Webber (Chris Pine) and the tanker crew led by Sybert (Casey Affleck). It continuously shifts between the passive yet courageous Webber and equally resourceful though apprehensive Sybert as they struggle through their respective trial.\r Chris Pine is good cast, Webber is not like his previous roles, he's more reserve and quite. It's a \"shine in peril\" kind of role and he delivers well in momentous scenes. Meanwhile, Casey Affleck as the engineer is trying to keep the tanker afloat despite disdain from his colleagues and collapsing morale. These two leads also have the same predicament, Sybert and Webber are not the squad favorite, so it builds up a nice underdog story as well.\r One can argue that Miriam (Holliday Grainger) is given the third point of view since her angle takes a few good chunks of the runtime. It's understandable to introduce motivation of loved ones as well as shedding light on Webber's back story, although her parts seem prolonged as some of them are less crucial and the movie could do without them.\r For a movie filled with nautical terms, it tries to acclimate the audience to the increasing tension as accessible as possible, concentrating on the race against time with daring attempts and ingenious makeshift means. Visual and audio are a match made in stormy sea. The editing for the more extreme sequences are well crafted, it even portrays the ocean so vastly grim it is borderline romantically ominous.\r The ordeal could've been told in crueler and faster fashion, but the direction for an inspiring triumph is appreciated as well. It is a fine venture to the freezing water with warm home to return to."
    },
    {
      "rating": "7",
      "text": "The Finest Hours is an intense movie based no a true story! I think you should diffenitely watch it at least once! Highly recommended! My final rating is 7/10"
    },
    {
      "rating": "7",
      "text": "The Finest Hours is a Disney-produced dramatization of a 1952 nor'easter which split two large ships in half.  In the face of near certain failure and death, four outmatched New England Coast Guard sailors (one played by Chris Pine) set out in a small boat to rescue one group of survivors.  The film plays the expected notes—the burden of decency, the ferocity of the sea, tidy nostalgia for the Greatest Generation—and the third act has enough reassuring half nods (of the you-did-a-damn-fine-job variety) to precipitate the on-set chiropractor's own finest hour, but almost every platitude and dose of syrup is countered by a competent performance and a vertiginous technical flourish, including a series of shots assembled to simulate a single camera move, tracing a piece of information from a ship's rain-and-wind-swept top level to its rapidly flooding interior."
    },
    {
      "rating": "7",
      "text": "Well, i really enjoyed this movie. But, there's something that really annoys me, it's \"the soul\" from this movie. Yeah, i can't find a great nor touching moment in this movie. With a \"save dozens people\" subject, this movie should have a moment that really, really touch our hearts. Well actually there's one or two moments that have a potency to moved your heart, but the execution was not satisfying. Fortunately, this movie has a great visual, beautiful cinematography and solid acting from its cast, especially from Affleck. It's still worth watching."
    },
    {
      "rating": "7",
      "text": "The Finest Hours is overall delightfully old-fashioned and boasts impressive effects and strong performances, despite lacking a few action-packed scenes that may disappoint a few viewers."
    },
    {
      "rating": "7",
      "text": "I’ve finally reached “that age.” Most actors and actresses I see on screen are much younger than I am. I find myself saying, “those kids are too young to be doing stuff like that!” And yet, they aren’t. I’m just getting older.\r The movie takes place in the 50’s and that makes me feel old. There’s all these old cars driving around that were state-of-the-art back then, and kids dating reminds you that your parents and your parent’s parents were once young.\r But in some ways, things are exactly the same. The ocean is still powerful. I heard an interview once with a guy who used to be in the navy. He said the biggest lesson that he learned and knows to this day is that, “The ocean doesn’t care about you.” It is a huge “force” that’ll snap a boat in half like it was a toothpick. That’s what happens here. Two oil tankers, mountains of floating steel, broken in half by a raging ocean. It was a wonder of human perseverance from two ends. A crew on a broken ship trying to stay afloat and a crew on a tiny rescue ship trying to find them.\r It had all the makings of a riveting tale. In the end, it was just pretty good. I liked it, but I probably won’t see it again.\r It was funny during the credits to see the real people from this tale. They looked very different from the Hollywood “pretty people” that played them. If I’m ever in a film adaptation, I want my part to be played by The Rock. Can we put that down?\r When it comes to matters of the ocean, I don’t know that a ton has changed since the 50’s. The ocean is still a deadly place at times. That was cool to watch. Sure, the drama was retelling a 60-year-old story, but it could have just as well been today. Well done, Disney."
    },
    {
      "rating": "9",
      "text": "Saw this movie tonight and thought it was very good. I've seen criticism because it looks \"old\", I mean it does take place in the 1951-52 time period. It was very interesting, and had me squirming in my seat more then a few times imaging myself in those situations. The fact that it's a true story is remarkable. good acting all the way around. maybe I should've given this a ten."
    },
    {
      "rating": "9",
      "text": "The shattering of expectation can sometimes shake one out of one’s complacency, especially if that expectation is low. ‘The Finest Hours’ is one such example. Unenthusiastically reviewed by the majority of critics, it turns out to be a finely mounted and gripping disaster drama. Set during a particularly ferocious storm it tells of the rescue mission of a four man crew to reach a stricken oil tanker cut in half by the adverse weather conditions. Whilst the screenplay itself is merely serviceable it does tell a basically good true story, and the production is elevated by a high standard of performance in both the acting and the craft on display. As the hesitant captain of the rescue boat who has thus far never gained the respect of his colleagues, Chris Pine is extremely good. As his girlfriend Holliday Grainger adds a feistiness to her perfunctory role that at least ensures the film is still interesting on land, even if it is the scenes at sea that offer the most excitement. Although underused, Casey Affleck is subtly impressive as the reflective chief engineer aboard the tanker who takes command more by default than design. The film demonstrates an astonishingly good period feel and the visuals in both cinematography and special effects are momentously impressive. Music, editing and sound all contribute to the prestige look and feel of the movie. The biggest compliment that can be paid to the 3D format, and indeed the film itself, is that it is never obtrusive and just becomes part of the engrossing nature of the adventure. This must be an early candidate for the most underrated film of the year as it is both emotionally stirring and spiritually uplifting."
    },
    {
      "rating": "7",
      "text": "The Finest Hours may have been much more but is nevertheless still an old fashioned, very well acted and tense rescue mission thriller that respects the event it is based on."
    },
    {
      "rating": "8",
      "text": "great movie with a rich history. the movie was great but I do question why they put black actors on the boat but the original photo had no people of color as far I could see. Just a thought. great movie go out and see."
    },
    {
      "rating": "3",
      "text": "The finest hour of the movie is most definitely the first hour of watching this movie. To kick off a movie 'based on a true story' with a sheepishly contrived love story was a downer. The movie is cumbersome in execution jumping to and fro unrelated themes of honor, love and bravery. Somewhere along the first hour of the movie I gave up and decided to add an imaginary ending where the entire cast died at sea. Poorly executed."
    },
    {
      "rating": "4",
      "text": "The Finest Hours tried to surprise me. It did, but it couldn't hide the disguise from it being a disaster movie. Okay, maybe I'm wrong just like the 5th Wave, but it's an opinion."
    },
    {
      "rating": "5",
      "text": "Nostalgic, moving, tearjerking, and thrilling, The Finest Hours still splits in two because of bad acting, writing, and an underdeveloped romance. Starring Chris Pine in a hit-and-miss performance, The Finest Hours features a lavishly shot 1950s America that makes you nostalgic for this bygone era of oil tankers and fishing communities, even if the tanker did split in two. From the music to the set design to the costume design, this film is the 1950s to a tee and benefits from it throughout.\r Additionally, the special effects and rescue sequence are thoroughly thrilling, as are the scenes when the tanker initially suffers from trouble and then tries to save themselves. Here, Casey Affleck shines and is truly captivating as the hated man in the engine room forced into a position to try and save his beloved ship. Based on shore, however, Pine's struggles in acting are matched by a spotty performance Ben Foster and a downright bad and overacted from Eric Bana. To be fair though, the dialogue from the trio of writers leaves this men out to drown in a sea of nonsense. Fortunately, the film is thrilling and handles the disaster element well, which is what we all came to see.\r On this front, the film is not just thrilling, but also incredibly moving and tearjerking, especially the ending sequence. Though I feel the romance is underdeveloped (we see them go on a single date and then it jumps three months with them engaged already...oh and then Holliday Grainger just annoys everyone at the Coast Guard), this does not diminish the chemistry between Pine and Grainger, which shines through in more intimate scenes. A film that could explore this chemistry more with more nuanced writing would be greatly appreciated.\r Overall, The Finest Hours is a largely satisfying disaster film that suffers from acting and writing, but if that is not your concern, this one more than delivers the disastrous goods and provides good thrills and effects along the way."
    },
    {
      "rating": "6",
      "text": "I    watched    it.    It    was    fine. It's    been    10    minutes    and    I already forgot about it."
    },
    {
      "rating": "7",
      "text": "A very much acceptable film that inspired by a real event except long pauses and too much ineffective sentiment.\r A disaster drama-thriller based on the true account of the 1952. So much better film than I anticipated. But there are a few things I did not like; like the frequent pauses in the narration where nothing really happens other that space given for the emotional background score to pull the viewers in. In a result, it did not work, definitely not for me. Yeah, in the many important scenes, it froze like it happens in the chess games before anybody move their pawn.\r In the crucial part of the narration, when the boat was overcrowded, there was an unnecessary pause which annoyed me. It was surely a remarkable segment of the story, but sentimentally failed to appeal or maybe you can call it a too much of the sentiment. Honestly, I liked the story, but the film exceeded its runtime to slow down the portrayal of the event which is surely a drawback than any kind of benefit.\r I loved the performances, everybody was good and so the CGI, which was not a top notch yet acceptable. Especially as it takes place in the dark time, they had the advantage to depict the atmosphere as much as close to how it would have looked 65 years ago and as well to avoid the errors.\r I never saw its trailer or the teaser, but I knew about this project and after seeing its posters I though it would be about the offshore oil rig. When I saw the film, I realised I was wrong and surprise do such thing happen in real.\r The film was also did not let my interest fall. Thanks to the director who always try different genre yet he's not a mega budget filmmaker. A good film, but like I said should have been even better. Especially should have out classed in the sentimental segments. I don't know how good was the digital 3D version of it, but still this regular version is worth to give it a shot.\r 7½/10"
    },
    {
      "rating": "5",
      "text": "The Finest Hours is not a terrible film, but it’s a very forgettable film.  I don’t expect this film to turn up on my ‘worst films of 2016 list’ but I’m not going to be recommending it to anyone, even if you are the sort of person who waits for a film to come out on DVD because this will just sit on your shelf after you have watched it once, you won’t want to get it out again!  It was rather boring in its first half and while the last 20 minutes did have some good moments, it didn’t make up for the bland film that was playing before it.  The cast feels very wasted and the film reeks of a poor script and poor direction.  It really is a film that I expect to forget a week after seeing it!  The effects are rather decent and the cinematography is pretty good even if it does feel like it is ripping off The Perfect Storm and Titanic one too many times, but the fact is, if you don’t get to know the characters, you don’t feel too much for them when the situation gets tense.  This film is based on a true story and it could have been amazing, but as it stands, it’s a rental at best.  I would almost say pick this one up for morbid curiosity because it’s a not really a so bad it’s a good film."
    },
    {
      "rating": "6",
      "text": "I was excited to see this movie, especially since it is based on a true story.  And, honestly, if you didn't know it was true, you never would believe it!   Chris Pine and Casey Affleck are very good in their roles as the Coast Guard that attempts the \"most daring rescue mission at sea ever\" (or words to that effect) and the person aboard the tanker who can think outside the box for a solution to a horrific dilemma, respectively.  For me, the movie was a little too long and too repetitive.  And, I thought Pines's girlfriend was very annoying.  I did not leave the theater with strong feelings one way or the other about this movie.  I likely would have survived just as well not seeing it.  But, I will say that watching it on the big screen would be way more exciting than watching it on DVD."
    },
    {
      "rating": "8",
      "text": "Really enjoyed this one, especially as it is based on real life events and I quite liked how they showed both the struggle on the ship and the struggle of people who tried to help them in a small boat."
    },
    {
      "rating": "5",
      "text": "Pretty good. Lots of tense moments but definitely benefits from very strong performances between Chris Pine and Casey Affleck. Even though it doesn't live up to a great film it still is an enjoyable one."
    },
    {
      "rating": "5",
      "text": "With solid acting from Pine and Affleck and some intense scenes, The Finest Hours had the potential.  However, much of it is wasted on a romance that doesn't work, flat dialogue and a lack of suspense or tension.  Much of the scenes in the water did work for me, but nearly everything on land felt incredibly fake, which is sad considering how amazing the true story is.  The Finest Hours is fine, but it is certainly disappointing."
    },
    {
      "rating": "8",
      "text": "A great adventure movie with a human side story; a good blend.  He's in the Coast Guard, he's a local New Englander, and last storm season, he could not rescue a local fisherman.  This storm season, there's a ship that has split in two and he is sent out to rescue the survivors.  The sea is horrendous, the local fishermen tell him to forget it.  But he goes, why?  We also see the ship's crew and how they react to the situation and how one man becomes their leader."
    },
    {
      "rating": "8",
      "text": "Went to this movie with a group of \"boat people\" who have fortunately never needed to be rescued by the Coast Guard.  I was expecting an OK movie , but was pleasantly surprised. The on the water scenes followed the book fairly well, but varied with Bernie and Miriam's romance(in the book they were already married and Miriam was at home with the flu). This movie gives you an appreciation for what the Coast Guard does. Bravery is a requirement for this job. Now I just wish they would spend a bit more on boat shoes for these guys and gals, when they board you for inspection they always leave black sole marks on my vinyl....just kidding!"
    },
    {
      "rating": "10",
      "text": "a real good movie, with a lot of chilli moments and critic survival moments.\rI was so tight to my sit during all movie, and from the beginning , I knew it was great , sadly it was highly underrated, but it became one of my favorite movies instantly"
    },
    {
      "rating": "5",
      "text": "The Finest Hours tells the tale of four brave members of the coast guard who brave the storm like elements on a small boat to rescue the crew of an fractured oil tanker stranded at sea. This story makes for strong special effects, cgi and cast members shouting into the watery atmosphere and it is within these elements that Craig Gillespie directs his film so well. For the first half the action scenes stand strong with characters using quick thinking to gain as much time as possible to cling on to. It is unfortunately however that the final half becomes rushed and the early tensions and emotions appear to drown. Casey Affleck's character spends the first half manufacturing make shift ides to keep the tanker's crew alive however in the second half he is sidelined and barely features. It is actually the rescue itself which fails to feel as tense as it really should do and leaves actors simply standing around. It needed more near misses, more drama and above all more thrills. The on-shore story also fails to really develop and at times becomes muddled between hinting at a backstory that fails to really get a catharsis. Where The Finest Hours works is in the early stages and with the simpler A-story, it is just a shame that the pacing in the second half and the lack of depth do let it down. It becomes more of a drama than an action adventure that it was calling out to be. Chris Pine is very good playing against type and Casey  Affleck brings a rather two dimensional character to life, however neither could prevent me finishing the film and feeling unsatisfied and ultimately wanting more. Other than the main story and the love story other relationships feel unresolved.If only it could have given me that little bit more."
    },
    {
      "rating": "6",
      "text": "Based on the trailers, it looked liked this would be something different from Disney; an intense rescue drama. However, The Finest Hours turns out to be exactly what you would expect from the Mouse House. This film benefits from very good acting, top- notch special effects, a few heart pounding moments, and it's so authentic to the time period that this felt like it made in 1952. But the problem with the film is that it doesn't focus enough on the sea rescue. The romance takes up to much of the run time and does not add anything to the overall story. In addition; being a Disney movie; useless moral lessons are thrown in that also add nothing to the overall plot. In the end, this is a typical feel good Disney film with fine acting and special effects; but also some useless elements that add nothing more then melodrama and a lack of intensity."
    },
    {
      "rating": "7",
      "text": "The Finest Hours is a typical movie disaster. A good cast, not a bad script and the presence of suspense in the right scenes make The Finest Hours a good period drama with thriller elements. Yes, the story was very embellished, and in the film there is a makimum of pathos, but in another way in the USA they do not know how to shoot. Excellent performance by Casey Affleck, the first half of the film is just watching his acting. And Chris Pine played a great lead role. In general, The Finest Hours is primarily interesting for acting and transferring the historical atmosphere of the early 50s, and only then as a disaster film. If you're not deterred by heroic pathos in American movies, then The Finest Hours is a great movie to watch"
    },
    {
      "rating": "5",
      "text": "It’s kind of tense. Good acting. Special effects are good. It’s kind of okay. It’s pretty boring. Seems too long at almost two hours. Not horrible. Just kind of the movie you’d watch if you wanted to go to bed or it was late at night already.Rating - 56%"
    },
    {
      "rating": "1",
      "text": "Based in a true story this well acted drama is a stagnate rescue tale I just couldn't enjoy. Firstly the tone was oppressively overbearing, secondly the lighting was too dark taking you out of scenes and thirdly the movie felt too dragged ."
    },
    {
      "rating": "6",
      "text": "At the Beginning i thought this would be a different kind of Disney Movie, but i was Wrong. Still this Movie i watchable, nothing great ore Special but you can fairly get enough enjoyment out of it to make it worth your time. The Story is based on an True event were 4 Coast sailors ventured in an Small boat to rescue 32 Men who stranded on an Tanked that split apart. This Movie takes its Time until the Man are finally sailing out. Before that happens we see What happen on the Tanker how the 32 Men are trying to survive, and we see more in the personal life of the Captain who is sailing out Later. There is of course an Romance Story. Because there wasn't enough story on the Real life event that could fill 2 Hours. The romance is nothing Special but at least its not nerve wrecking. The Actors do an good Job with that what was given to them. Also the visuals of this Movie are fantastic. I personally find its a little to Long. It would been good for the Movie if it would been 10 Minutes shorter. Still its an enjoyable Film and for fans of this genre its gonna be an Fantastic time. For more normal Movie watchers it can be an Hit ore Miss. I had a few Problems with it but i still think its was worth my time."
    }
  ],
  "recommendations": [
    "everest",
    "the_perfect_storm",
    "in_the_heart_of_the_sea",
    "apollo_13",
    "deepwater_horizon",
    "reminiscence",
    "news_of_the_world",
    "127_hours",
    "sully",
    "master_and_commander_the_far_side_of_the_world",
    "bad_times_at_the_el_royale",
    "allied",
    "greyhound",
    "hugo",
    "the_infiltrator",
    "beirut",
    "the_beguiled",
    "unbroken",
    "the_walk",
    "the_grey",
    "the_place_beyond_the_pines",
    "pearl_harbor",
    "flight",
    "midnight_special",
    "the_midnight_sky"
  ]
}