{
  "id": 2098,
  "title": "The Boss Baby: Christmas Bonus",
  "starring": [
    "JP Karliak",
    "Pierce Gagnon"
  ],
  "runtime": 47,
  "genre": [
    "Animation",
    "Family",
    "Adventure",
    "TV Movie"
  ],
  "description": "Christmas Eve takes a twisty turn when the Boss Baby accidentally swaps places with one of Santa's elves and gets stranded at the North Pole.",
  "releaseYear": "2022",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iMmMxF6f2OonUrXrHKBLSYAhXly.jpg",
  "categories": {
    "plot": 6.111111111111111,
    "acting": 5.411764705882353,
    "ending": 7.25,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 6.25,
    "funny": 5.9523809523809526,
    "action": 7.25
  },
  "reviews": [
    {
      "rating": "0",
      "text": "The amount of cliches that they decided to use in this are completely unneeded. I really hate how they decided to think that because it's being marketed to children that they can get away with almost everything that every other children's movie has done already."
    },
    {
      "rating": "4",
      "text": "I mean it's fine for a kids movie..but how did this get nominated for an Oscar?"
    },
    {
      "rating": "5",
      "text": "I liked the start of Boss Baby, delving into a kid's imagination has potential.  Unfortunately when the actual Boss Baby gets introduced the film becomes to mixed up with side plots and loses steam. C"
    },
    {
      "rating": "6",
      "text": "Don't be so negative, people! It's not about the amount of cliches! It's the comedy and the fun it delivered. I don't think it's something too special, but i think kids will love it and adults may enjoy it."
    },
    {
      "rating": "4",
      "text": "As someone that's seen a good portion of the DreamWorks CGI films, this was one that I was, at the very least, interested in. The mere concept of Alec Baldwin playing a talking baby had my attention for a minute. Unfortunately, it's clear after seeing the film that the concept alone isn't enough to sell this film. \"The Boss Baby\" often reminds me of why I love animated films, because the actual animation itself is gorgeous and extremely inventive. The film is so cleverly-designed and so beautiful to look at that it reminds me of why I love the medium. Unfortunately, the film also reminds me that breathtaking visuals are nothing without good writing, and they won't do enough to distract from a cliché-riddled plot, unlikeable characters and an extremely lack of funny jokes. It's a shame that all of the cleverness about the film was in relation to the animation, and not the writing. If you're a hardcore DreamWorks fan that has very young children, I would hesitantly say maybe give this a shot, but for anyone else, just skip it. It's definitely one of the weakest in the DreamWorks chronology."
    },
    {
      "rating": "6",
      "text": "I would make for sure my kids watching this animation. For kids I think it would be great - funny, exiting and instructive. Shows how important it is having family full of love and care. For me The Boss Baby was fun. For the first time I see this thematic in a movie- 'people choosing dogs, instead of people', that was surprising, made me think about how current and sensitive this topic nowadays is. Somehow characters were unlikable. Also I didn't like the background sounds and overall music. And I appreciate and love Hans Zimmer's work. What also disappointed me was the graphical view of the animation - both main characters looked too 'modern', too 'nowadays', I can't really describe it. The animation though deserves a watch, especially with your kid."
    },
    {
      "rating": "5",
      "text": "DreamWorks Animation continues to prove that even if they keep on trying, their animated movies will never reach the pinnacle of Pixar's throne. I think DreamWorks Animation here focuses on too much comedy rather than story. It's why films like this Boss Baby fails to surprise the average moviegoer who focuses on story. Not even the comedy here is worth laughing at. Take a chuckle or two if you must but just remember this; DreamWorks Animation, even if Shrek and How to Train Your Dragon prove to be king-tier for the studio's film history, will never ever be as surprising as Pixar. End of story."
    },
    {
      "rating": "3",
      "text": "A few good gags and some great moments from the baby can't disguise the fact that this is a good idea badly let down by a limp and uninventive story. To underline its shortcomings the film keeps disappearing into dislocated scenes and flights of fantasy which are just not engaging. The trailer promised much. The finished film, however, delivers little."
    },
    {
      "rating": "4",
      "text": "The concept maybe interesting but what matters is the execution, and damn how they fail in so many aspect. The film's plot is confusing that children can just ignore while the adults can be like \"what?\". The film can have clever jokes but mostly they try so hard to land the jokes. There better kids film to enjoy with family, but if you want your child to have fun time alone let him/her watch this film or torture your older ones."
    },
    {
      "rating": "0",
      "text": "A stupid, boring concept of a movie. I fell alseep several times and had to re-start the movie. I don't know what they were thinking. I didn't enjoy this film at all."
    },
    {
      "rating": "5",
      "text": "Well animated yet poorly conceived, The Boss Baby wastes its incredible voice talents on a story that settles for nothing more than childish humor and bathroom jokes."
    },
    {
      "rating": "6",
      "text": "The movie did have a unoriginal plot that is straight out of toy story. It was a bit redeeming with the imaginary sections, they were filled with pretty solid animation."
    },
    {
      "rating": "9",
      "text": "Come on people! it's a kids movie. Why are you giving political opinions or too serious. The movie is fun with using their imagination, sometimes a little intense but it's how kids are now days. At the end the movie has a fantastic sense of love for family and brothers love, Have fun pep."
    },
    {
      "rating": "2",
      "text": "Anyone with younger siblings out there? Pop quiz: When you saw your new little brother or sister arrive into the family, what was your immediate reaction? Were you afraid he or she might detract your attention from mom and dad? Did you anticipate you would somehow have to love this factory of poopy diapers? Is it even worth it to have a sibling after all?DreamWorks’ newest feature The Boss Baby, based on the children’s book by Marla Frazee, explores those concepts for all of twenty minutes, then fills in the remaining run time with the usual tasteless humor and adult references expected by the studio made famous by Shrek. While the supporting cast gives somewhat decent voice performances, nothing else of memorable interest defines their characters. The whole focus lands on the one big star on the poster.​After recent critical praise on SNL, Alec Baldwin (30 Rock, The Cooler) now makes his second portrayal of our current blonde, small-handed president in a form for the kiddos. He tells his whole story to us, where he came from, how he got here, and why. You see, a corporation exists out in the heavens called “Baby Corp,” a business composed of babies. No reason going into where they came from, or the intent of their mission statement, you’re not supposed to think too hard about it. Why? Because make-believe, duh!Baby Corp’s workers go across a machine that powders their butts, applies their diapers, and categorizes them based on how ticklish they are. If they’re ticklish, they are sent to a couple’s doorstep. If not, they are sent to management—an enormous office setting built out of baby supplies such as crayons on their desk. Now no more pressure in explaining to your kids where babies come from! DreamWorks’ masterpiece will make them believe their lie, no problem! Then they’ll stop asking you about it and you two can go back to your happy time in the bedroom!Anyway, the one resembling a miniature Trump gets sent to management, then from there to the doorstep to lead a mission against their ultimate enemy: puppies! Specifically, he has his motives set on stopping the new brand by Puppy Co., the “Forever Puppy,” an immortal infinitely young dog breed. Yet he needs the assistance of the family’s seven-year-old son. Yes, I know. Riveting, isn’t it? Well, maybe so if you were the same age as the two leading kids. Then again……if the demographic targets families of kids all ages, why does it include baby powder farts, a censor block over the infant’s privates, pant zipper music, and a doggie inflatable bouncy house with an exit through its anus? There are also subtle signs of mistreatment towards puppies: they are seen hanging from balloons at a convention, as if animal cruelty laws don’t apply. Obviously, the makers of this fast-paced childish noise don’t care about growing up, just painting adults as the villains of a boy’s elaborate imagination where he has to lie to solve his problems. Judging by what we see on Fox News, I say we need some adulthood, and such movies are not helping today’s kids grow up!The main child, Tim, offers a particularly damaging mindset for kids to look through, as virtually everything he sees is filtered through his rainbow-tinted glasses. Even if the fantasies’ altered 2-D style of animation look fun and stylistic, the concept of his talking baby brother back in the 3-D animation style would suggestively reflect how he feels about having a new sibling, which many narrative points blaringly contradict. Plus, a one point, they’re at an airport together, and not one adult notices the unaccompanied minors. I’m sorry, the concept sounds funny and all, but I can’t buy into it until it decides what to be.The Boss Baby is not the type of entertainment you sit down and enjoy together, but rather the type of brash noise used to calm your child’s temper tantrums for a measly hour and a half so you two can enjoy some peace and quiet by yourselves for once. You can count on time getting wasted both in the theater and at home with this heap, so you’re better off using Disney or Pixar to divert your kid’s attention, or even using these modes of entertainment as experiences for the parents and children to enjoy together. Anything to get you away from a miniature Alec Baldwin barfing on screen works just fine."
    },
    {
      "rating": "10",
      "text": "But aside from this barely veiled CGI re-creation of our commander in chief and the fear and lies he sells, what solutions does The Boss Baby offer? The Boss Baby, a grumpy infant who wears diapers because he’s too busy doing business to make a trip to the bathroom, is fundamentally damaged, we learn. The reason he’s in “upper baby management” instead of just being a normal baby is due to a sorting process during which he fails to giggle adorably when tickled by a feather. He has no real parents, and having been sent straight to work on his first day of life, he missed out on his entire childhood. “I wasn’t born, I was hired,” he says.The Boss Baby’s redemption can only arrive when he realizes that he would rather be a baby than a boss. When he finally gets that big promotion and realizes how lonely it is at the top, he quits his post. He rejoins the baby masses and goes back through the baby-sorting line, having now learned to love and feel joy over the course of his adventure with Timmy. He’s redelivered to Timmy’s parents, this time as a cute, normal, gurgling baby.The message is undeniable: Even if a baby says he wants to be a boss, he really wants to be a baby. We should not let bosses be babies, because they are babies. All other films hoping to become the official cinematic standard-bearer of #TheResistance, take a seat. This is the most damning political narrative of 2017."
    },
    {
      "rating": "8",
      "text": "What a cute funny little movie. It's not a masterpiece, but it's wasn't meant to be. This just a family comedy flick."
    },
    {
      "rating": "7",
      "text": "I am surprised by the bad reviews! The voice acting needed some work, but was pretty good. The animation was fantastic, and everything looked great. The story was pretty good, the first half was slow, but the second half was awesome! It was for sure worth a watch."
    },
    {
      "rating": "8",
      "text": "I gave this movie an 8 because there was a good performence but I think that the relations with the brother and the baby were not very polite.It was a funny movie because of the baby.But then the brother and the baby become close."
    },
    {
      "rating": "10",
      "text": "No more grasping for political allegory in the latest episode of Riverdale — The Boss Baby has already done all the work for you. This is a film about a little baby, dressed in a baby-sized suit, the seat of whose pants strain to contain his bulbous baby bottom. When the Boss Baby is (spoiler alert) promoted to CEO of his baby company, he’s given a new office, and sits on his new golden toilet at the top of his baby tower, looking out at the world below. When he’s forced to take a photo with the family he’s been “assigned” to, he refuses to smile, saying that it makes him “feel weak.” His favorite expression is a puckered-lip scowl. At one point the Boss Baby (who does not have a name, because his personal and professional identity are indistinguishable) plays with a toy golf set while his older “brother” Timmy works late into the night doing research for him. When Timmy asks why he doesn’t help, the Boss Baby responds, “I’m very busy delegating.”But beyond that, The Boss Baby is a movie about the imaginary attention economy, first within the family unit (the Boss Baby, being a baby, takes all the attention away from Timmy) and then more fantastically in the Boss Baby’s mission — to sabotage the pet industry. Puppies are becoming more and more popular, and babies are no longer the stars in the cuteness industry. The Boss Baby gathers a cabal of yes-babies and preaches to them about the threat of the encroaching Other, visualized by a pie chart with a shrinking baby slice and an expanding puppy slice. (Birds, cats, and fish are given much smaller slivers of the pie.) “Puppies are winning, babies are losing,” he says ominously to his trembling base."
    },
    {
      "rating": "6",
      "text": "This whimsical concept starts with a baby (voiced by Alec Baldwin), who’s been assigned to a family with a secret mission. His adversary is the imaginative 7-year, who’s happy days are disrupted by this domineering infant brother (voiced by Miles Christopher Bakshi, son of director Ralph). Although it’s not especially funny, there are amusing moments and some enjoyable supporting characters. There is a romping pace and a colorful, creative design. It’s a bit more inventive than some current animated films, but not fresh enough to become a classic."
    },
    {
      "rating": "8",
      "text": "Once again, DreamWorks delivers another crazy concept that is capitalized with frentic action, zippy gags, and a plentiful amount of imagination. The premise is really just a way to talk to both children and their parents about how having another child changes things for the one already in the house. The way the story is presented plays out like a fever dream. Are these events really happening or are they the product of a child's overactive imagination? The jokes come at you fast, furious, and almost non-stop. Only stopping to deliver some sugary sweetness in the form of sibling bonding. There are a lot more gross-out gags than I was expecting. What's more surprising is that they work. The butt jokes don't (\"Hey look kids! There's a butt! Why aren't you laughing?!\"). There are even some more subtle laughs for the parents in the room, including the best blowjob joke ever in a kids movie. The animation and voice acting are superb as always. The former changes in style in the blink of an eye several times throughout to fit the more obvious imagination sequences. The movie is a sugar rush for the whole family. Another healthy dose of laughs and morals. It's not a new formula by any means, but Boss Baby still manages to make it an entertaining one.8.4/10"
    },
    {
      "rating": "6",
      "text": "Yep. I'm as surprised as you might be. Let me start off by saying that, yes, this movie is still as occasionally inane, obnoxious, and nonsensical as you think it may be. However, there's also just something undeniably endearing about the thematics in play here. Something about the film's musings on brotherhood, family, and friendship that struck a righteous and unexpectedly mature chord with me. That, plus Alec Baldwin's highly entertaining turn as the film's titular character honestly made everything that much more watchable in the end."
    },
    {
      "rating": "7",
      "text": "The baby on a mission!If you ask anybody from the pre 90s, they would say their love for animated feature started with 'Toy Story'. But mine was DreamWorks' 'Antz'. So this production house might not be as good as Disney or Pixar, but still a better one than the rest of those who are in the same business, except Sony who comes equal. I wanted this film to be good, yeah, it is a box office hit, but not critically. The regular animated film goer accepted it. And I think as well, it is entertaining, so much fun in parts, if not the entire film.The story of a boy whose happy life being an only child has taken away from his newborn little brother. Then one day he discovers the baby could speak and came to the house with a bigger plan. Knowing what it is and joining hands with him to tackle is what the remaining narration covers. Quite fun film. Animation, story and all the adventures were good. The voice-over was great. Alec Baldwin was awesome, but it's fair to praise the technicians, the animators.At first, I thought some of the jokes were rude, if the film is for families, particularly for the kids. But when I watched the rest of the film, it did not look going anymore worse. A simple story and predictable, but it was enjoyable, that makes you forget yourself for a while. Despite the mixed response in acceptance, I've heard the sequel is on, in a couple of years. I think it is a good decision, even the storyline, how it ended encourages that. It's not going to be your favourite animated film, but surely not to be missed if you love animation.7/10"
    },
    {
      "rating": "7",
      "text": "Let's Hope The Modest Success Does Not End In A Franchise TormentBlessed be the only children who didn't have to stand the discomfort with the intrusion of a new sibling. Arguably, whatever the reason, jealousy emerges innately in humans: in a love relationship, at work, at school, in the family. On this familiar premise, \"The Baby Boss\" hits on the correct artery in order to delight both parents and children with a boyish thinking message that will convince by way of gags even the most skeptical and cerebral movie buff.It's \"freely\" inspired by the children's book published in 2010 by Marla Frazee, \"freely\" because development isn't pulled out from the pages verbatim. It sets Tom McGrath as a filmmaker, the ideal director due to he's directed several movies of the company's orders, has also addressed with different content about childhood in his films in an underlying way. The script embraces high doses of gags and sketches that will look after mostly adults, this inclination is inductive when we find out that his writer, Michael McCullers. Here slapstick and deadpan are mixed with the beautiful thoughts of a 7-year-old child to provide a compendium of occurrences touching deeply in the general public with great assertiveness. Sweeping aside the festive subject, the nuclear story line evokes productions that applied the same central narrative skeleton, a steadfast structure due to the warm welcome by the audience, the nonsense of the jocular pantomime of a baby working as an older man is the strongest fun producer. However, focusing on the plot and its progress, the mind of an infant is the device used to spark a succession of full positions of inventiveness, in addition, it manages to keep pace and dynamic firmly during the three acts, although the second section was prolonged more than it should be had. As a movie chiefly intended for children, lessons must be of great importance. At first, I had to deal with strong headaches about how they could present an appropriate closing to the story, as due to the passing of the situations seemed that it'd be getting an ending out of the ordinary, nonetheless, happy endings will always be. Beyond accepting the newcomer, the film reflects on teamwork, discrepancy-solving and a poorly worked labor aspect, however, children must receive a small explanation by their parents.Despite the fact that it weights the previous considerations, disrupts the impact of topics which aren't explicit on screen and suddenly the arduous search not to adopt the label of the commercial title is eradicated in full. The two cute main leads are engagingly designed, 7-year-old Tim assumes the figure of father and he has the responsibility to select the most circumspect decisions; the counterpoint is the baby, who with the tyrannical voice of Alec Baldwin achieves the execution of adorable effects. Undoubtedly, the title character is the spotlight, however, the real hero is Tim. Although the villain character is prorated between tender canine pets, campaign creator and his henchman, they diverge as soon as the baby appears on the screen.While it falls apart in the formation of some approaches, embraces as a key piece its animation, which keeping in mind guidelines established by Pixar in terms of scrupulosity and concern for detail, loiters between the sweet and the effective, and this doesn't result in a handful of anodyne images exactly, based on two- dimensional lines, on the contrary, these ones' brilliance give rise to concentrate on textures and colors of the fabulous imagination, which from the first minutes run an interesting introduction. Tim's imaginary visions affect the presentation of them, which gamble with a range of designs and arts, beautifully devised by astonishing 3D (the effect with a drop of drool is maddening). The soundtrack isn't high, but it fits in each frame with certain effectiveness, from Beatles' altered melodies to OST, fit together in dramatic scenes or frantic car chases.With a straight-to-the-point start and an emotional mature conclusion, Tom McGrath's \"The Baby Boss\" serves to introduce DreamWorks back into the audiovisual animated panorama, at the same time it expresses, from the perspective of a 7-year-old child, the affective parity that parents must have with the arrival of a new baby and the acceptance and understanding from the only child who should assimilate the arrival of a sibling. In addition, as a mass consumption movie, parents and children enjoy the two fabulous first parts of the feature film, however, it will be fatiguing to digest the last segment going back to a happy ending and the corresponding death of the villain. Perhaps, one day, a movie will break narrative projections of animation, meanwhile, let's enjoy the visual candies of this baby and his corporate mission. The diaper of animation is slowly getting dirty."
    },
    {
      "rating": "4",
      "text": "The boss baby has some funny jokes, some speacially for children, others for adults and a great message. But, if you are an adult, this movie will be hard to watch, but for children this movie will be a blast."
    },
    {
      "rating": "2",
      "text": "I like a lot of kids movies, and my patience is pretty good for them, but this movie really left me wondering who they really were trying to appeal to.  I was able to watch this on Netflix with no extra charge to what I normally pay out, and I still could not make it through the entire movie!  I did not even expect it to be that great to begin with, and boy they did not disappoint!"
    },
    {
      "rating": "4",
      "text": "Boss Baby is a ok movie. i kinda like the comedy it gives us to this flim. But what lack about it, is it's plot. it feels like a 7-year old write the story. The actors in this film did a good job, but it can not help this film."
    },
    {
      "rating": "5",
      "text": "Normalita.Ni fu, ni fa. No es mala, pero tampoco es buena.No le veo sentido a que saquen una segunda película. Normalita.Ni fu, ni fa. No es mala, pero tampoco es buena.No le veo sentido a que saquen una segunda película."
    },
    {
      "rating": "9",
      "text": "This animation is basically the older brother's point of view with the arrival of his little brother. I like it a lot, it's funny (I do not find anything forced), and the end is so \"anww\", I love it when they put hidden messages that only the older ones can see in the animations, it proves that we should not be ashamed to watch them."
    },
    {
      "rating": "6",
      "text": "WHATS UP YOU AMAZING PEOPLE! This is my Review for THE BOSS BABY!!this movie was just amazing with funny humour references to Lord of the Rings through a wizard clock (Amazing) with an interesting and humorous story plot and a happy and also heart warming ending that ends the movie on quite the cliffhanger making it seem like there will be a second movie coming at some point... Only time will tell.Thanks for reading this review and check out my other movie reviews and my VIDEO GAME reviews BBYYEE"
    },
    {
      "rating": "10",
      "text": "quite funny and definitely worth to watch. If you have enough fantasy like baby/child you'd love it. even hard to understand why low reviews. just watch!"
    },
    {
      "rating": "0",
      "text": "I hated this disgusting movie. A baby can ruin the whole movie and this film gave the perfect example of it. I even said in the theater that I'm only watching it because like any other critic, I'm required to."
    },
    {
      "rating": "8",
      "text": "The Boss Baby is a very interesting movie. The plot is simplistic enough to be yet charming. Throughout the movie it will contain some cringe-worthy jokes, but sometimes they can be legitimately funny. I gave the movie a chance, and I don't regret it. For being so silly the story was decently laid out, the characters could've been better but for what we had they were decently relatable, but the movie was beautiful. It was just pleasant to look at in today's technology. All in all, I recommend giving this movie a chance, and to overlook all the other bad reviews."
    },
    {
      "rating": "10",
      "text": "It gives a good message about all the things that kids adopted have to deal with on their lives, even though it is kind of sad it gives you a good message."
    },
    {
      "rating": "2",
      "text": "Simply awful. Only the second film I've not managed to watch the entirety of."
    },
    {
      "rating": "7",
      "text": "Reviews for this film are all over the place.  The previews in theaters did nothing for me so I expected it to be terrible, but I bought the blu-ray at a budget price during Black Friday and found myself laughing quite a bit.  I liked the premise that the older brother, who was used to being spoiled as an only child, suddenly had to share his parent's affection with a new sibling.  They hate each other at first, of course, and grow closer as the movie progresses.  Unlike some people I was never bored and even though the plot turns even more absurd towards the end (taking a road trip to Vegas by themselves) I still enjoyed the movie overall.  It certainly had more laughs than Captain Underpants, the last animated feature I saw."
    },
    {
      "rating": "5",
      "text": "Good animation but seriously unfunny. Writers really phoned it in. Mediocre."
    },
    {
      "rating": "6",
      "text": "It's quite good to go see with the kids, a lot better than Lego Batman, and it's not too bad to have to go along with as an adult. Not that it's something I'd recommend you'd go watch on your own. There's not much of a story there really, just comedy. Babies vs. Puppies, that pretty much says it all."
    },
    {
      "rating": "6",
      "text": "The Boss Baby is cute and well animated however borderlines on annoying and has a weak plot. If it wasn't for the genius of Alec Baldwin, this film would have been unwatchable."
    },
    {
      "rating": "6",
      "text": "Interesting in ideas but scattershot in its execution, The Boss Baby is a mixed bag. While the first act is too zany, the second and third are funny enough to overcome plot inconsistencies."
    },
    {
      "rating": "8",
      "text": "+Excellent voice talent+Fascinating concept with great visual style+Superb soundtrack-very unoriginal storyI went in expecting something sub par but was pleasantly surprised by this high quality family animation. Clearly a lot of heart went into every aspect of this movie. I dare say it's better than some more recent Pixar productions."
    },
    {
      "rating": "6",
      "text": "I didnt like the intro and the animation changes troughout the film. The boss baby is pretty weird at times, not consistently funny, more like a handful of good jokes, like the elvis bit. The interesting idea turns into something generic"
    },
    {
      "rating": "5",
      "text": "Посредственность - самое подходящее слово. Вроде бы местами и видно попытки сделать что-то интересное, но потом зрителю в прямом смысле пердят в лицо.Грустно, что такое кино собирает сотни млн зелёных в прокате, грустно никак не за детей, которые это в основном смотрят, а грустно за их вкусы, которые в корне неправильные, ведь когда им будет по 15 лет, то они продолжат ходит на подобное, а главное - получать удовольствие. Очень жаль, как киноману."
    },
    {
      "rating": "7",
      "text": "Personally not an avid fan of animated films. However this one is worth a watch, if you can get past the many exaggerated ideas in the film. The teamwork between the boy and the baby boss is kinda cute on many levels. The ending is also quite decent.The moral: Even though there might be some people who are 'annoying' you in some particular ways. The right thing to do is to seek to understand/find out what people(others) are going through, before judging them."
    },
    {
      "rating": "4",
      "text": "Really? This movie is nominated for several awards including the Golden Globes and 5 Annie Awards? There's clearly no effort put on this. The Boss Baby is a stupid concept, whit a story really confuising that never tells you what is the reallity and the imagination (There are some scenes that show you that but is mostly confusing), most of the characters are not intresting, the emotional scenes aren't cute or charming to see and the script is a mess. To be fair, there are some funny scenes (Like every time the Boss Baby always trow money to pay something or to somebody), the animation is ok and the voice actors like Alec Baldwin fit really good in the charaters. But yes, this is one of the worst movies that DreamWorks ever made that i could say that i recomend more to go and see Captain Underpants that it is an actual fun movie to watch than to go back to see this durty diper"
    },
    {
      "rating": "6",
      "text": "I'm not gonna lie. I wanted to hate this film. The premise is paper thin and the jokes weren't really funny. But I sort of enjoyed it. The animation is very fun, some jokes were funny, the acting is very well done, and you can tell the people of Dreamworks tried the best they could. But there are some things the team should seriously improve on...like their writing. Here, the movie is predictable and the rest of the humor is...for a lack of better term, as funny as a poopy diaper. But even if the writing is awful, it still seems like a passable film. Oh well, at least Captain Underpants looks really good."
    },
    {
      "rating": "1",
      "text": "10/10 Best movie ever made! Pinnacle of CGI and animation. SMASH HIT at box office. Alright, no, it's trash."
    },
    {
      "rating": "8",
      "text": "I think the film is very creative, they explode the imagination of Tim in an incredible way. It is a very well adapted script, it has many hilarious moments. I loved the animation, the Render is excellent. Every little detail is amazing. Even though it has a great animation, I didn't like the design of the characters. I liked the plot of the movie, but at certain points it seemed a bit confusing because of Tim's way of seeing things. The movie has a very sentimental outcome. I think the film fulfilled its purpose, because it really made me think of my childhood."
    },
    {
      "rating": "9",
      "text": "This movie was terrific, I don't care who says what. Sure it's wildly exaggerated, but remember, it's told through the boy's wild imagination. Alec Baldwin as the Boss Baby is superb. The part that shows where babies come from at the baby factory is mesmerizing, funny, and begs to be watched several times. The other babies in the movie were marvelously hilarious as well. I hope for another BB in the near future."
    },
    {
      "rating": "2",
      "text": "The Boss Baby is a horrible, predictable piece of crap. I hated it. All of the comedy is ridiculous and too immature, even for children. I didn't laugh one time. The only good thing about it is that Alec Baldwin truly does a great job. He knows what character he's playing and he does it very well. Everything else kind of sucked. The voice acting, obviously besides Alec, was atrocious. The main kid, Timothy I believe is his name, is terrible. He sounded congested for the majority of the movie and delivered his lines terribly. The animation is also pretty bad. Everyone looks blocky and strange. The whole concept of the babies coming from \"up there\" is just stupid and makes no sense. I just really didn't like this movie. If you did, more power to you but I didn't like it."
    }
  ],
  "recommendations": [
    "cloudy_with_a_chance_of_meatballs_2",
    "the_willoughbys",
    "cloudy_with_a_chance_of_meatballs",
    "dora_and_the_lost_city_of_gold",
    "the_secret_life_of_pets",
    "astro_boy",
    "hotel_transylvania_2",
    "the_angry_birds_movie",
    "ice_age_the_meltdown",
    "storks",
    "the_smurfs",
    "happy_feet",
    "hotel_transylvania",
    "the_angry_birds_movie_2",
    "despicable_me_3",
    "the_boss_baby_family_business",
    "despicable_me",
    "alvin_and_the_chipmunks_the_road_chip",
    "antz",
    "shark_tale",
    "mars_needs_moms",
    "ice_age_continental_drift",
    "ferdinand",
    "penguins_of_madagascar",
    "turbo"
  ]
}