{
  "id": 4861,
  "title": "The Cable Guy",
  "starring": [
    "Jim Carrey",
    "Matthew Broderick"
  ],
  "runtime": 96,
  "genre": [
    "Comedy",
    "Drama",
    "Thriller"
  ],
  "description": "When recently single Steven moves into his new apartment, cable guy Chip comes to hook him up—and doesn't let go. Initially, Chip is just overzealous in his desire to be Steven's pal, but when Steven tries to end the 'friendship', Chip shows his dark side. He begins stalking Steven, who's left to fend for himself because no one else can believe Chip's capable of such behaviour.",
  "releaseYear": "1996",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iLmtIWy64uIkxLyi0A0vyzFfn5f.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.9,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 6.0,
    "funny": 7.583333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The Cable Guy is one of Jim's & Matthew's funniest movies. The supporting actors add ample comedy & the screenplay is original, letting all the actors contribute in their memorable scenes."
    },
    {
      "rating": "8",
      "text": "In the film, there is a subplot involving the Sam Sweet trial, where Sam Sweet (Ben Stiller) is accused of murdering his twin brother Stan (also Ben Stiller). Although it is not confirmed nor revealed in the film, two scenes in the film hint that The Cable Guy may have killed Stan Sweet and framed Sam. When The Cable Guy is installing Steven's cable, The Cable Guy stumbles upon a newsstory of the trial and comments \"I hope they fry this bastard\". In the 911 scene, the voice on the recording is not Ben Stiller's, but Jim Carrey's. If so, The Cable Guy may have been a fan of Double Trouble (1992), and Sam may had been one of the customers The Cable Guy stalked. When Sam rejected him, The Cable Guy may have shot and killed Stan as revenge, then impersonated Sam's voice when he made the 911 call, framing Sam for the crime. However, this is only a theory"
    },
    {
      "rating": "8",
      "text": "Several scenes appear in the trailer that do not appear in the film. Among these scenes are: The Cable Guy (Jim Carrey) and Robin (Leslie Mann) are having lunch outdoors, The Cable Guy tells Robin that Steven (Matthew Broderick) is \"gonna need some tough love.\" Steven and Robin leaving his parent's house after hitting The Cable Guy, with Robin looking upset and Steven telling her that The Cable Guy leaves him messages night and day and never leaves him alone. The Cable Guy walking up to Steven during the evening at his parent's house and telling him to not mess with him. Another shot of The Cable Guy through the eye hole in the door after knocking excessively and yelling \"Cable Guy!\" Additional footage of The Cable Guy calling through the telephone wires trying to call Steven. The Cable Guy holding two beans in his upper lip to make it look like a mustache. The Cable Guy and someone else popping up from behind a couch and surprising Steven, and a very brief slow-motion shot of Steven staring at something off-camera with an uncomfortable face during dinner (presumably The Cable Guy)."
    },
    {
      "rating": "8",
      "text": "asqwedfrthhyijukolpmnbbvczzajwkdmfomfogmjhikookkmkloiuytreeqqesaszxcvvmbmgnfjgjkgkfofio"
    },
    {
      "rating": "8",
      "text": "《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《《.........."
    },
    {
      "rating": "8",
      "text": "8/10 Laugh-out-loud, on-the-floor hilarious film!In my opinion, THE CABLE GUY is a laugh-out-loud, on-the-floor hilarious film! When the cable guy (Jim Carrey) sang \"Somebody To Love,\" I laughed really hard. One thing I couldn't stand about him was his lisp. Also, he just couldn't seem to leave Steven (Matthew Broderick) alone. If my cable guy was like that, I'd get a restraining order. When the cable guy whispered a part of a woman's body when he and Steven's family played \"Password,\" I was really grossed out! In addition, Robin (Leslie Mann) was a very beautiful woman... especially in the clothing she wore when she went out on dates. Before I wrap this up, I'd like to say, \"Be careful who you trust. Also, find out if your cable guy is really a cable guy.\" Now, in conclusion, I highly recommend this laugh-out-loud, on-the-floor hilarious film to all you Jim Carrey fans who have not seen it."
    },
    {
      "rating": "8",
      "text": ",,,,,,,,,,,,,,,,,,,...........@#$%+×÷=^/&_*()€?,.!;:\"'▪●○□■•¤°☆☆⊙《》¤¡¿◇♡♤♧}}[]●▪°•■●▪°•¤☆⊙●■■●》"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙■●■●■■●■●■●■●■●$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷"
    },
    {
      "rating": "8",
      "text": "qoeprotioeowieorkrooroooommmdl.,?!;:\")(()*&^%@#$$#@@_/=÷×+×÷÷÷☆⊙°•¤《》¡¿♧◇♡♤■□●○▪`|♡□◇□[]][}{>>|♡》》◇◇◇[}●●"
    },
    {
      "rating": "8",
      "text": ";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;•••••••••````````````````````````````````````````````````````````"
    },
    {
      "rating": "8",
      "text": "*:*:*:*:*;*;**;*;*:*:*:*\"**\"*\"*¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "8",
      "text": "Open your mind to this film.I love Jim carrey films, and you have to open your mind for this one and try to see it for what it is, its a disturbing comedy about a mentally disturbed man the cable guy Jim carrey.All he wants is a friend to be wanted and to be loved, the way he goes about winning that friendship is disturbing, and carreys performance is brilliant hes far more than a comedian he a one of a kind actor there's no one else out there that could execute this role as good as he did, the film is shot in a way showing humans obsession with the television set, how we now rely on it and we stray away from what we should be concentrating on (our family life) i think Ben stiller is trying to bring this point forward.This film was wrongly criticised by some critics for what ever reason. I recommend you watch this film twice maybe three times before you make you judgement.For me its a cult classic."
    },
    {
      "rating": "9",
      "text": "The Cable Guy is a great comedy with elements of drama. Definitely one of Jim Carrey's best roles. A good cast, funny and ridiculous scenes that will remain in memory for a long time. A memorable ending, which is rare for comedies. Most comedies involving Kerry operated on the idiocy of what was happening. But The Cable Guy much deeper film that actually talks about serious things in life, just covers up with a smile"
    },
    {
      "rating": "8",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "9",
      "text": "This is such an underrated movie that was probably ahead of it's time. Jim Carrey kills this role and there are so many memorable scenes."
    },
    {
      "rating": "9",
      "text": "This just might be the most underrated movie ever! Don't get me wrong, it has its flaws but as a kid I heard nothing but negativity surrounding this movie when it came out but watching it from start to finish as an adult is highly recommend it!"
    },
    {
      "rating": "7",
      "text": "Time has been kind to this movie.This was not bad at all.In fact, it was really damn good.It's important to know before going in that this is NOT a comedy, this is a psychological horror film.I can see it not working for some as a comedy. The jokes don't always land and the comedy is by far the weakest aspect of the film. It does however make up for it with it's insanely dark horror elements. It's really good as a horror film.It's kind of a deconstruction of Jim Carrey's classic comedic persona. If we met any person like the characters he plays in real life, they would be pretty scary dudes. It can get very geniunely disturbing."
    },
    {
      "rating": "4",
      "text": "Stiller shouldn't have worried about the viewers, the character gets unchecked, more importantly Carrey isn't directed.The Cable GuyStiller has good intentions. He treats his lead as a comic book hero. Unfortunately, he forgets to craft the world in a fantasy land. Now, the director Ben Stiller intends it to be in contrast to each other, the character and the world that doesn't accept or eyes him. This was his window for the laughs. And that is where even the script cheats him. There is this obsession of grounding these characters in a more pragmatic way. Which creates the ultimate tug of war that leaves the film hanging in the air empty handed.The other issue is how much time is spent upon building up the antics and the moments that drives those antics. A lot of cinematography too is directed towards the punch line of a joke. The scenarios are set separately for them, like waiting for Jim Carrey's reaction or the procedure of working hard on something that is about to be mutilated by someone else, the film thrives for such elements and as a result adds up extra irrelevant ten minutes on screen. So why is this that the film has aged well culturally?First of all, it deals with the social rigmarole that everyone goes through. And something that we all can connect instantly especially the track it follows, not only is it catchy but the film grows how it was promised to be. And center of this affection is led by Carrey's eccentric performance. He embodies the character so gleefully that it is almost as if he has been waiting to play a kooky personality as such his whole life. To be frank, it is a juicy role. Any character would love to play The Cable Guy, he has got a wide range that marginally hovers around being funny and wrong, there is a fine line to walk here."
    },
    {
      "rating": "5",
      "text": "This is one of the most tonally inconsistent movies I've ever seen. Is it a drama? a comedy? a thriller with some horror elements in it? Something inbetween all that, although I'm not even sure, if Chip, The Cable Guy, is even a human or a superhuman being of some sort. I have no idea what to take away from this movie, should I not trust my cable guy? Should I not trust strangers in general? I don't know, but I'll definitely not go through the effort and find it out. If you're a fan of Jim Carrey then maybe this one will be for you, otherwise I don't really know what to take away from it."
    },
    {
      "rating": "8",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    }
  ]
}