{"id": 2374, "title": "The Invisible Man", "starring": ["Elisabeth Moss", "Aldis Hodge"], "runtime": 124, "genre": ["Thriller", "Science Fiction", "Horror"], "description": "When Cecilia's abusive ex takes his own life and leaves her his fortune, she suspects his death was a hoax. As a series of coincidences turn lethal, Cecilia works to prove that she is being hunted by someone nobody can see.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/5EufsDwXdY2CVttYOk2WtYhgKpa.jpg", "categories": {"plot": 6.491803278688525, "acting": 7.096153846153846, "ending": 6.285714285714286, "soundtrack": 6.0, "cinematography": 5.875, "familyFriendly": 3.0, "funny": 7.333333333333333, "action": 6.2727272727272725}, "reviews": [{"rating": "3", "text": "What starts off as a mostly competent thriller, descends into an absurd melodrama that has too many twists for its own good. The film borders on the ridiculous and isn’t even quite that terrifying - it’s simply an unnecessarily  sad and exhausting chore. The film had such promise - but with a thin script and weak characters, there’s truly nothing to see here."}, {"rating": "1", "text": "My previous opinion was erased strangely, so here I am again. This movie does not need an invisible man since it is just one more analogy of the #metoo era. Everything was so predictable, that this was more a harassment drama than a horror movie. don't waste your money"}, {"rating": "8", "text": "The invisible man was an intense, thrilling experience that had me on the edge of my seat for the entire viewing. While the storyline sometimes starts to become predictable (mostly the ending), it does have some nice shocking and satisfying twists that left me gasping. All in all the invisible man is as must watch for any horror fan, and could potentially be a cult classic"}, {"rating": "3", "text": "Perfect movie for Generation Idiot. Everything about it is mediocre and not properly thought through. I didn't feel the chills or the thrills but that's the kind of rubbish they make nowadays."}, {"rating": "7", "text": "Despite being predictable in some moments, I liked it. Plot is fine. Loved that Invisible Man isn't scary because of jumpscares, but because the tension."}, {"rating": "9", "text": "So far, The Invisible Man is the best movie of 2020. The jump scares aren't cheap and stupid, it's filmed very well, and Elizabeth Moss did great in this film. It was very suspenseful. The pacing was great, and we didn't get another bad horror movie this year (looking at you The Grudge and The Turning.) Definitely recommend this film. Final Verdict: 9/10"}, {"rating": "6", "text": "Whannell's directing experience with The Invisible Man provides a riveting horror plot that still leaves questions towards some of the decision-making that transpires throughout the movie. Overall, there are areas I really enjoy but also dislike. It is hard to grade this one, not going to lie. I just find myself viewing this movie as \"mediocre\" with potential to be something greater.First off, the plot was great. I really enjoyed the thriller/horror experience with such a foggy perspective of Cecilia's mind from the start. You know something is wrong with her mentally, but it keeps getting worse or clearer as the movie continues. I thought the ending was bland, but understood the mindset behind it. With the amount of intensity that the entire movie provided, I just believe it could have offered more for the ending scene (although, the death scene was insane... in a good way).Cast was fantastic, I really believed everyone did their job well with their respected roles. One issue I did have with the cast was Moss's character as Cecilia. There were some cases where I just believed it was hard to watch her act. The dinner scene with her sister was crazy, but I think her state was too altered to switch from normal to insane every 5 seconds. Do not find it realistic as well. There were times her acting also reminded me of Jordan Peele's \"Us\" movie once her cloned killed her. It was that kind of insanity I did not want to see, but it seemed to show up in some cases which was not what was intended for her character in my opinion.I was split on some of the special effects. Although I understand the complications that come from fighting something invisible, it sometimes just turned funny rather than scary watching them fight the invisible man. Overall, it was not bad, but not super good.One main problem I have with this movie is the amount of things that do not make sense. From the beginning there were many scenes that just provided no significance or common sense to the overall film and it definitely is the main reason why I gave this a 6.5/10. Cecilia cutting her wrist and surviving without bleeding out after a 15+ minute scene. The Invisible Man seemingly surviving almost every blunt force that comes at him expect the bullets at the end. The Invisible Man was essentially a superhero with that costume, almost killing everyone with a single hit. Also, what is the significance to the cameras on the costume? What is the significance of the money if he was going to take it away anyways? Why did they never check security footage at the dinner with her sister? Is the Invisible Man omnipresent (he gets places sooooooo fast)? There are many questions that ultimately leave me baffled with this movie. They could have provided more realism to it and it did not seem to offer that when I saw it.I would recommend seeing it. I believe it is a \"love it or ya hate it\" kind of film. Won't see it again though."}, {"rating": "10", "text": "A brilliant update.  Great atmosphere construction, I was tense most of the film.  The scenes that suggest a presence (even if we are not seeing it) are sensational."}, {"rating": "6", "text": "Serviceable film, watchable film.  Bogged down with cliches and doesn’t fully transcend its genre as it appeared eager to do at first.  I was entertained moment to moment but baffled by the film’s logic.  It fails to pass the test of: why don’t they just use cell phones and videos to solve these problems.  Which gives the script a “written in the 90’s vibe” which is kind of how the movie feels (at its best) but it’s extremely  modern in other ways, having major plot turns rely on email, uber and the suit’s futuristic technology.  So where is the cell phone video?  We’re talking about a story about a woman entirely out to prove that she’s being stalked by an invisible intruder and she doesn’t think to herself “I can film this to prove it.”  If you can look past that sort of stuff, it’s a fine movie.  If you can’t, it’ll feel more like a decent movie.  Definitely not a bad movie though."}, {"rating": "6", "text": "Decent movie full of good acting and terrific scenes of suspense. However, it falls prey to the horror trope of characters who make stupid, irrational decisions and could have shed about 20 minutes easily. Still, it was better than many of the horror flicks I've seen recently and was pretty good at speeding up the heart-rate."}, {"rating": "6", "text": "I was genuinely surprised that a horror movie like this early in 2020 didn’t suck. Most studios just throw out really bad horror movies in January and February just to get rid of them. The Invisible Man is the rare exception. While a had a lot of issues with the film, it still was a very solid effort and did the one thing a horror movie should do, be scary. The film’s biggest trait is that it does not rely on cheap jumpscares. It instead relies on a natural build up of tension that pays off with an interesting and unique scare. The film also doesn’t continuously use the same type of scare. Some horror movies will continuously use the scary face trope to get a reaction but The Invisible Man doesn’t. Each scare is unique in its own way. I won’t spoil any of them because they are quite creepy and need to be seen and not explained. Elisabeth Moss does a great job in this film. She is able to communicate this sense of loneliness while being surrounded by everyone and was able to convey the emotions of fear, sadness, and joy in a natural yet intentionally creepy way. The rest of the cast does a fine job but really don’t compare to Moss. The only thing holding her performance from being top notch is the screenplay. Some of the lines of dialogue were very awkward and took away from some scenes because of how corny or lame they were. That didn’t happen throughout the whole movie but when it did, it was noticeable. The rest of the film’s technical aspects were pretty good. The direction from Leigh Whannell was unique and interesting and the cinematography was pretty great. Each shot was visually interesting and had something to offer. The way they shot some of the scenes was great. Exchanges were shot from many different points of view and the camera was able to spin around and follow characters exact movements during action sequences. One technical aspect I took issue with was the score. While the actual composition of the music was good, the repetitiveness of it was a little irritating. The film kept using the same song for more intense scenes and it got distracting after a while. It didn’t delve into different ways to use music for scenes with high amounts of tension and I really wish it had done that. The film also has a lot of plot inconsistencies and dumb character decisions. One such inconsistency that isn’t spoiler related is when a car crashes. The front of the car is really banged up but it’s shown less than a minute later and it’s completely fixed. Overall, The Invisible Man is a mostly smart horror movie with a great lead performance, story, direction, and cinematography but is almost undermined by a weak screenplay, plot inconsistencies, and dumb character decisions."}, {"rating": "7", "text": "Points for originality, acting and overall mood but falters a lot due to a lot of stuff that makes no sense. Plot holes all over the place. The ending is dreadful. For some reason the super strong pyscho is suddenly able to have his hand grabbed by her and made to slit his own throat. Convenient for the plot, sure, but a total farce. And notice how she is far too confident by the end. She starts off very timid and nervous and at the end she's strolling carelessly out of his place, smiling to herself, having just murdered him. I'm not doubting she'd be relieved, but she handles it all with such ease it just feels wrong. It's all just tied up far too quickly and conveniently - the end. Boring. Still, I love this Director as he makes really original films. This film was, despite it's flaws, disturbing and entertaining"}, {"rating": "7", "text": "Gripping, suspenseful, and truly badass, \"The Invisible Man\" makes for an excellent movie night for any drama/thriller aficionado. Is it perfect? No. There is a bit of a lackluster plotline with some odd pacing, and it's not one of those movies that makes you want to get up a cheer at the conclusion, but Elizabeth Moss's acting (along with suspense) make this film a true must-watch for all drama lovers."}, {"rating": "8", "text": "The Invisible Man feels like a merge between Candyman and Enough, with a woman being taunted by an invisible force that she believes to be her dead husband. Overall the acting and story are quite strong, though the visual effects feel a bit stale. Compared to The Mummy, in the Universal 'Dark Universe', this film exceeds all expectations."}, {"rating": "0", "text": "One of the worthless and childish movies i be ever seen, why someone would spend so much energy just to mess with an ex (just to begin with), its not even terrifying but childish..."}, {"rating": "8", "text": "An absolutely incredible horror movie. Elizabeth Moss is a fantastic lead and is truly outstanding in her portrayal of a woman slowly driven mad. Leigh Whannell kept me on the edge of my seat in terror and suspense until the end."}, {"rating": "8", "text": "The Invisible Man successfully reworks one of Universal's classic horror movies into a modern tale of mental abuse and manipulative relationships. Long shots down hallways and extended shots on empty space build tension and a sense of voyeurism due to the innate nature of the beast. The film's climax temporarily loses the sense of paranoia it so carefully crafted, but it manages to recover to a large degree afterwards. The Invisible Man is a must-see film for any fan of the psychological thriller/horror genre."}, {"rating": "9", "text": "Such a brilliant film, perfect pacing, excellent storyline, superb acting especially from the lead Elisabeth Moss. I can't recommend this film highly enough. Definitely the best film I've watched in a long while. Even the ending for me didn't disappoint."}, {"rating": "9", "text": "One of the best movies I've seen in a while. Ending was predictable, but overall a great movie."}, {"rating": "8", "text": "\"The Invisible Man\" is a good example of how to make an exciting movie for little money. In stock: well-developed scenario, strong soundtrack, good acting and directing. Especially worth mentioning is Elizabeth Moss, this work is her benefis. I could recommend this picture to everyone who likes smart and extraordinary science fiction."}, {"rating": "8", "text": "Not my genre really but this is a well-made film through and through. E. Moss gives her usual grounded performance which keeps you in even with some of the wilder plot points (as well as the occasional swerve into slasher-material). Loved the director's previous film UPGRADE which hold up really well."}, {"rating": "6", "text": "ATTENTION SPOILERS AHEAD.The more that I think about this movie the more I get excited and disappointed about it. This movie has some structural plot holes that just cannot go unnoticed for example why didn't the cop did something about Adrian \"faking\" his death, even after he was supposedly kidnapped). Why didn't Cecilia told her sister and to her cop friend about Adrian's cellphone that she found on her **** attick weeks after Adrian was dead? The trailers tell another story, I thought it was going to be a thriller about a damaged person from all those years of abuse. Maybe she had schizophrenia, maybe it was all inside her head but NOPE, man bad wears an invisible cape suit. At this point, I lost all interest. The acting is SOLID especially on Moss part and the soundtrack thank god isn't used just to \"enhance\" the jumpscares. I really liked parts of this movie but really hated some and I don't know, you should watch it and see it for yourself."}, {"rating": "8", "text": "Leigh Whannell’s ‘The Invisible Man’ is about as sharp and ingenious of a reinvention of an old film brand as has been made in Hollywood in recent memory.The story is wonderfully infused with H.G. Wells’ 1897 novel and James Whale’s 1933 adaptation while also incorporating all kinds of modern fears about technology, surveillance, and the seeming omniscience of a truly motivated stalker.The film is powered by yet another harrowing performance from Elisabeth Moss, who uses so much physicality in her emotion that everything that unfolds on screen is hauntingly persuasive.Whannell became a known entity in Hollywood as the co-writer and co-creator of the Saw franchise.  To say he knows a thing or two about torturing people onscreen—and making those at the theater squirm in their seats—is an understatement.  Perhaps now he’s found his new muse in Moss, as these two together are the stuff that horror-thriller dreams are made of."}, {"rating": "9", "text": "They did it. Son of a gun, they actually did it. Universal finally made a GOOD remake of one of their classic monster movies!! (Celebration by Kool and the Gang plays) Not only is it a good remake, I’d say it’s the best Universal Monster movie since Creature from the Black Lagoon! This remake is very different from the original 1933 film as well as the HG Wells novella it was loosely based on so purists may still be unhappy with this movie, but I’m all for updates to the classics (that’s pretty much what the original films were, they’re almost nothing like the original books) so it didn’t bother me at all. The Invisible Man updates the story in very clever ways that I won’t spoil here and it gives a sci-fi horror twist to a relevant story about an abusive relationship. Nobody sees it happening and nobody believes the main character when she tells people about it. Huh. The lead performance from Elisabeth Moss (yes, I’m spelling her name correctly this time) is fantastic, and this movie is SCARY! The original 1933 film was very effects-heavy with a lot of comedy. In this, there is no comedy to be found and the effects are very minimal, but even if the movie is showing you nothing it makes you feel the presence of an evil figure lurking around using only framing, sound design and Elisabeth Moss’ performance. There are tons of tense and creative sequences (very similar to the director’s last film, Upgrade) and a ton of suspense. You never know when the titular character is going to show up next and it keeps you on the edge of your seat! I think the movie was a little too fast-paced, the buildup to what’s really going on could’ve been slower and more effective, and the score can be loud and overbearing at times, but overall I thought this movie was excellent. This is a must-see for any horror fan or fan of the classics! I’m so happy this movie is a hit and we’ll be getting more movies like it! I can’t wait, this is going to be awesome. The Universal Monsters are back and I couldn’t be more happy. The director of this wants to do a remake of Dracula and James Wan is producing a Frankenstein remake, among a ton of other projects in development. Yes. All the yes. Give them to me. I want them."}, {"rating": "8", "text": "Elizabeth Moss gives a fantastic performance though her character does make some questionable decisions which require suspension of disbelief. Having said that The Invisible Man is a great little psychological Horror/thriller and well worth a trip to the cinema."}, {"rating": "9", "text": "\"The Invisible Man\" is the most tense I've been during a movie in the theater since A Quiet Place. Featuring one of the scariest movie villains in a while and a terrific Elisabeth Moss performance, this is a thriller you need to see."}, {"rating": "9", "text": "A compelling and well acteds sci-fi thriller (unfortunately described by some as a 'horror' film), 'The Invisible Man' is a very good re-imagining of the 'Invisible Man' films and books that came before. Although there are a few inconsistencies in character behaviors, they are not plot killers and the cast are all excellent, especially Elizabeth Moss."}, {"rating": "7", "text": "In this new version of The Invisible Man, Cecilia Kass (Handmaid's Tale's Elisabeth Moss), has escaped her abusive, controlling boyfriend (Haunting of Hill House's Oliver-Jackson Cohen). He's been declared dead, but she finds herself menaced by this unseen force. This was a decent film.Though there is violence, this is one of those films that relies on more on suspense, and it's done really, really well. Rather than kill Cecilia, the invisible man is trying to ruin her life. He's subtle at first and there is a lot of tension wondering if he's in the room or not and what he's going to do next. And when stuff happens, it can be pretty startling at times.The movie looks great. Director Leigh Whannell (Upgrade, Insidious 3) continuous his style: a starkly lit look. There are a lot of nice wide shots and pans to give the impression that Cecilia is being watched. (However, I thought that the opening scene was a little too darkly lit.)Moss, whose character is the biggest part of the film, does an excellent job portraying a woman going through trauma but is also wily when threatened.This isn't a perfect movie, though. Running at two hours and four minutes this didn't have to be that long. There are too many scenes of Cecilia being freaked out or people not believing her. The antagonist's plan didn't have to be that complicated. (Though it does mostly make sense in the long run. I've seen other movies with this level of intricacy that couldn't pull it off.) Also, there are several lines of dialogue and decisions that don't feel natural.Overall, I don't think you need to see this immediately, but if you like suspense then this if for you."}, {"rating": "9", "text": "Leigh Whannell crafts a visceral thriller with a new updated take on the classic story.WHANNELL has been in my opinion one of the most underrated director /writers for a long time. He was mostly behind the insidious and saw franchises And came out with the spectacular futuristic thriller upgrade in 2018. His brilliant style is once again back with full force in this new adaptation of the invisible man. many people will just look at this like another Blum house manufactured film at first but realize that just because it has the production name on it doesn't mean it will be another throwaway film. This film much like upgrade thrives with a crisp smart script and fantastic visuals. Whannell has a keen eye for detail and it shows in bunches in this film. Elizabeth Moss also gives a phenomenally dedicated performance And sheds emotion throughout. There are many moments in this vicious film that you will not see coming and I was actually surprised by the amount of brutality which serves the overall story well. This is a new take on a classic universal monster that you will not want to miss and it's definitely worthy of going to see in the theater unlike many films of late."}, {"rating": "2", "text": "To be completely honest, after watching this movie, I am shocked to see a 7.1 from both the audience and critics, that rarely lines up, and usually, both aren't so horrendously wrong. I went in with low expectations from Blumhouse, after their last few movies they have felt like a shadow of who they used to be and this movie reflects that, loudly. The Invisible Man is one of the worst movies I have seen this year and I am an avid moviegoer who goes typically 3-5 times a month. Not only does it have multiple moments where it appears to be ending (sort of like the false endings in LoTR), but it just continuously drags on with so very little going on at damn near every point of the f***ing movie. I'd say the beginning of the movie was the most interesting part, but they never build or show their relationship, we have no way of knowing just how terrible Adrian really was to her. It seemed odd that they refused to show the abusive relationship, I mean, the movie is over 2 hours long, and there's next to nothing about their relationship. I think the movie possibly could have benefitted from showing how **** of a person Adrian actually was in their relationship. Instead, we get he-said-she-said type of **** that never amounts to much.Compared to the original's charm, it has nothing going for it. The twist is lame and illogical (also predictable), and large parts of the movie just do not add up. For instance, during her daring escape from the mental institute, no one is seeing the people get murdered? They all assume it is her and when she passes by the guard station, you can clearly see cameras, RECORDING EVERYWHERE (as a mental institution does), and yet nothing, no one is saying \"Hey, there's a knife floating and she's either killing men with her mind, or her story is legit.\" Most of the big twists in the movie or the big shock moments also take place in a public setting, so you're telling me that no one in the restaurant saw a knife floating except for her and her sister? You're telling me they couldn't have shown footage in the restaurant of a floating knife??? Do you mean to tell me that the cops didn't go to check the footage? You're going to tell me they didn't see A F***ING KNIFE FLOATING??? Give me a break from reality, but not this big of a disconnect. Also, why does the little girl believe she hit her when she's clearly on the other side of the room? None of it adds up, the only suspense and disbelief comes from how laughably unbelievable the film is at moments.Also, after she shoots and stabs the suit, how would it just blink and go in and out? That's literally not how it would work, once she disconnects/destroys a camera it would act more like a dead pixel that would be constant, it wouldn't make half of the suit blink, did no one explain how electric current and cameras work? Drab. The best way to describe this movie is by calling a drab, drag-fest that goes on for what feels like a f***ing eternity, my theater had people walking out or laughing during highly suspenseful and intelligent dialogue such as \"He's invisible! It means you can't see him!!!\" I mean, wow, so profound, thank you for defining the meaning of \"invisible\", I really needed help on that! I'm not sure how this movie has such high ratings, it was just plain-out bad and predictable at every point. Though the writing doesn't treat the audience as poorly as the writers did in The Dead Don't Die (where they explain the f***ing plot and 'hidden' meaning on multiple occasions), it still feels insulting when they introduce us to plot points that just make literally no sense, and that's the problem with The Invisible Man, it almost makes no sense from start to finish. I also feel like the twist where it was his brother was meant to make us think \"Oh my God! What if it wasn't him!!!!\" but, tbh, at that point, I was so f***ing checked out of the movie I was only thinking \"Jesus f***ing Christ, it's going to keep going for another f***ing 40 minutes.\""}, {"rating": "9", "text": "I have to admit my expectations were a bit on the high side walking into this one. Although normally I try to keep them in check because so many movies are utterly disappointing. Well I'm happy to say this film completely blew me away. Leigh Whanell has created his masterpiece. A superb update inspired by the invisible man but something completely new altogether. The brilliant Elizabeth Moss stars as Cecelia a damaged woman in an abusive, controlling marriage. As we begin the film she escapes and soon after finds that her ex has committed suicide. Following that she discovers that she will inherit five million dollars as long as she doesn't commit any crimes or is ruled mentally incompetent. All of that is a red herring for what's to come. Soon after she comes to realize that her new found freedom is an illusion and that her sociopathic ex is stalking her but is invisible. I don't want to get into the details because I refuse to spoil this for anyone but wow. From the opening moments Whannel concocts a mounting feeling of chest tightening dread and keeps it uncomfortably fluid throughout. The small moments of laughter and a feeling of freedom are only to distract you from what's coming. And trust me it's worth the wait. The film unfolds unexpectedly is utterly driven by Moss's vulnerable yet resilient performance. She's so smart and driven it's easy to root for her and to relate to her seemingly hopeless plight. The film succeeds in establishing Adrian as an utter monster. And the invisibility is a device that works so well because had he been given a steady face and performance, it would have humanized him. And it's all the more effective that it didn't. Despite being a reimagining this is a really new film. It feels fresh in every aspect and even though you might think you know what's going to happen the utter brilliance in which it's executed is utterly astounding."}, {"rating": "8", "text": "I liked the movie a lot. At the beginning it is a thriller of suspense that catches you from the beginning: Gender violence, psychological abuse, drama, tension and manipulation by a gifted psychopath. The film is raised by the magnificent performance of Elisabeth Moss. In the middle it falls and becomes the typical Friday the 13th or Halloween horror movie. But that last turn when they are having dinner for me is great. In the end I am left with the doubt of whether it was him or not, maybe he was telling the truth but she was never going to be able to live with that uncertainty and with the hell he made her go through."}, {"rating": "8", "text": "An Invisible Man entry fit for the 2020's. Elizabeth Moss is a powerhouse and the score/cinematography keeps up. There are a few suspense/horror cliches and predicable turns but overall this anxiety-inducing journey pays off nicely. 87/100 LeisureFeature.com"}, {"rating": "9", "text": "This is a solid psychological thriller. It captures you right from the start and delivers throughout. Thoroughly enjoyed. Moss is great actress in this, giving it real credibility. It's the first good movie I've seen this year."}, {"rating": "0", "text": "An absolutely mediocre film, it was made solely as a means of discriminating against white men, in particular rich white men. What does a multimillionaire and a genius of science care about an absolutely nondescript gray mouse? The logic \"he began to persecute me because I refused him\" is normal for a virgin schoolboy, but not for a successful man. In addition to the stupidity of this plot move, it is also banal. As well as the rest of this film. The heroine's friend is black. Besides mediocrity, the plot of the film is very boring, predictable and full of plot holes. How could the heroine terrorize her walled-up husband? (logic goes to hell) Well, the cherry on the cake is the lack of talent of Elisabeth Moss."}, {"rating": "8", "text": "When her abusive husband commits suicide Cecelia (Moss) has hopes of finally moving on with her life, but thing’s aren’t going to be that simple…Anchored by an exceptional performance from former Mad Men star Elizabeth Moss, this latest re-imagining of the Invisible Man story is a tense and atmospheric thriller that builds to a satisfying conclusion. Well worth a watch."}, {"rating": "6", "text": "First part, fantastic! About half-way it starts to move towards being ridiculous. And the ending was just not very compelling to me.Great acting by Moss though. She carries the movie. And it does have some genuinely scary parts. It's like a ghost movie basically - until it's not. Which is where it stops working in my opinion. A few scenes fall apart completely when stuff happens that just makes no sense. Adrian is super lucky, all. the. time. So much so that it becomes annoying later on in the film."}, {"rating": "8", "text": "Pretty solid movie. Has a lot of plot holes but they tie up together pretty well. Highly recommend it. Great Thriller movie. Really enjoyed it. Was honestly surprised how good it was. A must watch! Solid 8/10 from me."}, {"rating": "7", "text": "It was a good movie, nothing more, nothing less.  Had a couple jump scares just due to long drawn out silent parts becoming loud, like when she just kicked a dog food tray across the kitchen; things like that.  But it definitely lacked scares.  It's more of a thriller/mystery in the second act.  And my complaint with this film is that it is SOOOOO boring and uneventful for the first hour or so.  After that it picks up pretty quickly and turns into a psychological nightmare for the lead actress.  There are a couple WTF! moments like the restaurant scene with her and her sister, but sadly there isn't a whole lot that got me excited, until the end.  One time watch only."}, {"rating": "7", "text": "Pretty great movie that I was looking forward to seeing. It keeps a tense atmosphere throughout and definitely had some moments that I didn't expect. The story and characters weren't amazing, but the premise and atmosphere carry them for the duration of the film."}, {"rating": "8", "text": "Clever, creepy and fun. Between this and “Upgrade,” I can’t wait to see what Leigh Whannell does next. He and Jordan Peele are saving horror..."}, {"rating": "8", "text": "The Invisible Man is another movie that is based of the acclaimed novel by H.G. Wells. Fun Fact: this was originally going to be the second movie in the cinematic universe \"Dark Universe\" with Johnny Depp playing the titled character. However, the flop of the Mummy seems to have made Universal focus on standalone Universal monster movies. This new strategy seems to be the right move as The Invisible Man is an absolute thrill of a movie. The general summary of this movie is that Cecilia (Elisabeth Moss) who has escaped an abusive relationship from her ex Adrian (Oliver Jackson-Cohen) only for weeks later to find out he committed suicide. However, she suspects his death was a hoax and that she is being hunted by someone nobody can see.The biggest praise of this movie has got to be Elisabeth Moss performance.She gives an authentic performance of a character who has been in an abusive relationship.She makes the emotional stakes feel high and her agony feel genuine. However, she is also able to give a ferocity in her performance when her character decides to fight. She does an incredible job in carrying this movie. The score by Benjamin Wallfisch is also incredibly unsettling and intense when it needs to be. It manages to perfectly elevate the scene in every way and really make the audience invested what they are watching. I also have to praise their unique use of camera shots. The director Leigh Whannell uses a lot of wide shots and panning to make it really feel like there is someone else in the room watching our character Cecilia. The story is also really engaging and is a really smart narrative on woman who have been abused or manipulated. The movie has great scares and great suspenseful moments that are not just relying on jump scares(but there are some) and it is just a breath of fresh air for a horror movie.This isn't the director's fault but the trailers kind of ruin a fair amount of the surprise sadly. I highly recommend people don't watch the trailer for this movie cause it will lessen the experience. My biggest issue with this movie is just the amount of plot holes that really make me question things. I will avoid spoiler territory. The first thing I have to question is the lack of cameras? There are security cameras in this world and this movie emphasises cameras but when there is a scene that 100% would have security cameras in the real world, the movie decides it doesn't exist anymore. Also I have to question how a certain character is able to get to get from point a to point b so quick when there is clearly no transportation used by this character. Additionally, this character somehow knows where everyone is just baffling and unexplained. You have to suspend some of your belief to accept these and unfortunately that is kinda difficult especially considering the tech shown in this movie. The last act of this movie also feels really contrasting to the the slower and suspenseful pace of the first two acts of this movie and it kinda makes it feel like a completely different movie. Honestly, I also prefer the first two acts compared to the last one. Overall, this movie is just a great horror movie and a fresh contemporary adaptation of the novel. If you want a unique and vastly different horror movie experience then this movie is a must watch for you."}, {"rating": "5", "text": "Over the past few years, Blumhouse Productions has become a money machine, offering low-budget, pulpy horror films (the “Purge” series, “Truth or Dare,” “Happy Death Day,” among others) that do very well at the box office.  In fairness, they’ve also bankrolled serious theatrical efforts like “Get Out” and “BlacKkKlansman.”  “The Invisible Man” moves Blumhouse outside the traditional horror genre.  It’s a film that is part horror film, part action movie, part support for #MeToo.The concept behind this film originated with the 1897 novella “The Invisible Man” by H.G. Wells, generally acknowledged as the father of science fiction.  This film also owes a debt to the 1933 film with the same name, starring Claude Rains.In the hands of Writer/Director Leigh Whannell (the “Saw” series), the content and focus of this movie is changed dramatically from the original source material.  In fact, the man we sometimes can’t see is actually only a tangential character in the story.  The protagonist is Cecelia Kass (Elisabeth Moss), the long-suffering live-in partner of a rich genius who works in field of optics.  A total control freak, the optics inventor has abused Cecelia in every way imaginable.  After escaping from the fenced-in fortress where she lives with this madman, Cecelia is further persecuted by a series of mysterious events.  Her former boyfriend has donned a body suit that refracts light, rendering him invisible as he performs a series of increasingly horrific misdeeds.   Blood flows. Cecelia is accused of madness and murder.  The game is afoot, Watson.What makes this film rise about the typical Blumhouse dreck is Elisabeth Moss, who has had memorable roles in several iconic TV series including “West Wing,” “Mad Men,” “Top of the Lake,” and most recently “The Handmaid’s Tale.”  Here, Moss offers an acting tour de force.  Her character evolves from terrorized abuse victim to action figure to cold-blooded avenging angel.  As her character transforms, Moss’ facial expressions and body language also evolve strikingly.  If you can get past all the blood, it’s an evolution worth watching.Because this is Blumhouse, who gave us masterpieces such as “The Gallows Act II” (a record-tying 0% on Rotten Tomatoes) and the currently-playing “Fantasy Island” (checking in at 9%), effective plotting is not a strong point in “The Invisible Man.”  For example, while housed on a secure psychiatric ward, Cecelia simply opens the unlocked door to the stairwell, helpfully labelled “Emergency Exit,” to make her escape.  Some of the plot twists made me yearn for the GEICO commercial with the immortal line, “Let’s hide behind the chain saws!”“The Invisible Man” is a worthy addition to the pulp noir genre.  With no particular skills, Moss’ character overcomes impossible odds to preserve her sanity and right wrongs.  Along the way, the cinematography is notably flashy and fascinating.  However, it’s Moss, and Moss alone, who elevates this film and makes the whole endeavor worthwhile."}, {"rating": "9", "text": "The sound and the content is so so amazing. If you want to watch something surprise, you must go to the cinema and watch this movie."}, {"rating": "1", "text": "Two of js went to see this movie, and two of us enjoyed it.  Elizabeth Moss is terrific as an abused wife who plans and executes her escape from her abusive husband.  Just when she thinks her troubles are over, she finds out they are not.  Loved the way things built up over the course of a tight timeframe.  Of course, it is frustrating when no one will believe her.  A couple of scenes where I had to cover my eyes.  But, overall, great suspense, a talented leading lady and a good supporting cast.  Very engrossing!"}, {"rating": "8", "text": "The teachings of H.G. Wells are stretched to their \"2020-iest,\" and followers of the adaptation process's limitless possibilities have yet another feather in their cap in the form of Leigh Whannell's \"The Invisible Man,\" an ambitious, imaginative and twisted return to form for one of Universal's underappreciated \"monster\" properties. Whannell capitalizes and even improves on everything that surprised me about his last entry, \"Upgrade,\" distributing the kinetics of his film in a more even and structurally friendly fashion, using the frame as an antagonist that's just as terrifying to look at as it is impossible to look away from. The narrative is sumptuously deceiving, yet structurally recognizable enough to make you think you know where things are headed, even though the exact destination isn't where you figured you'd end up. The production design and cinematography are sleek, ultimately pairing with the respective looks of his previous films to give Whannell what I'd even call an aesthetic in the making. And though it really shocks me to say it, I find myself really intrigued at the prospect of more Universal monster movies with this treatment of the source material in mind. I'd consider that a success on the part of those involved."}, {"rating": "8", "text": "Really good thriller. Did not expect it to be as good as it turned out to be. We saw it in dolby theater and it enhanced the experience because sound is used very beautifully to create this atmosphere. Highly recommended with a satisfying ending for once."}, {"rating": "8", "text": "The Invisible Man requires more than the occasional suspension of disbelief, but an original story with legitimately tense moments elevate it to the top of its genre. The characters often fall into classically poor horror movie decision-making, but it's not enough to take away from the overall impact of the film."}, {"rating": "8", "text": "Great movie, to turn the original story into a feminist manifest is brilliant and touthfull. Moss is superb."}, {"rating": "7", "text": "A solid 7/10 and deserves a watch. Skip the trailers tho as there are quite a few spoilers in them."}], "recommendations": ["us", "the_lodge", "lights_out", "the_mothman_prophecies", "gothika", "a_cure_for_wellness", "the_machinist", "color_out_of_space", "oculus", "signs", "cube", "mirrors", "the_killing_of_a_sacred_deer", "the_fly", "the_autopsy_of_jane_doe", "eli", "brimstone", "a_quiet_place", "the_ritual", "a_quiet_place_part_ii", "the_conjuring_the_devil_made_me_do_it", "annabelle_creation", "ouija_origin_of_evil", "split", "scary_stories_to_tell_in_the_dark"]}