{"id": 4849, "title": "The Pelican Brief", "starring": ["Julia Roberts", "Denzel Washington"], "runtime": 141, "genre": ["Mystery", "Drama", "Thriller", "Crime", "Action"], "description": "A law student's theory about the recent deaths of two Supreme Court justices embroils her in a far-reaching web of murder, corruption, and greed.", "releaseYear": "1993", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1V9B0fk3dh2Af2yUI5mAEETJNNT.jpg", "categories": {"plot": 5.866666666666666, "acting": 6.5, "ending": 6.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 2.0, "action": 6.0}, "reviews": [{"rating": "2", "text": "A real snoozer, interrupted by a few laughs at the ludicrous plot and dialogue. It goes on forever, and then, when it absolutely has to be OVER, the thing comes back to life with a saccharine epilogue. Big stars, and a (formerly) expert director, in the service of dreck."}, {"rating": "6", "text": "Directed by Alan J. Pakula, The Pelican Brief is certainly a compelling investigative thriller. This is no surprise, considering Pakula knows his way around conspiracy and investigative thrills, with this on full display in the film. Unfortunately, the problems with The Pelican Brief are ones found more in the script and the editing. Overly complicated, contrived, cliche, predictable, and bloated, The Pelican Brief is a film that thrills, compels, and keeps the audience hooked in from beginning to end, but is certainly prone to dragging out the inevitable. We know what will happen in the end, yet the film continues to try to distract from this with additional layers, characters, and encounters, that just seem so forced. If the film could just hone in on and become a trimmed down version of itself, it could have been a great film. Unfortunately, this one was just one editing session away from being excellent.At the heart of this film is a conspiracy theory. After the assassination of two Supreme Court justices, young law student Darby Shaw (Julia Roberts) is intrigued by the murders and tries to assess who could have been involved by looking at similar opinions between the two justices. Showing her results to her lover and Professor Thomas Callahan (Sam Shepard), Shaw's theory - later dubbed the \"Pelican brief\" - is passed onto the FBI and, from there, Shaw's life collapses all around her. As those implicated close down on her and try to suppress the investigation underway by the FBI, Shaw teams up with reporter Gray Grantham (Denzel Washington) to further investigate her brief and bring the allegations to light in an article. A spell-binding thriller, it may be rather cliche but the twists, turns, and general conspiracy element (with a post-Nixon kick to it all) really intrigue rather nicely. It is a film that may be flawed, but one cannot accuse of it not being entertaining or gripping, as the exploits of Darby and Gray as the investigate these deeply influential suspects and run for their lives from the men sent to the kill them tell a believable tale that will you keep you engaged, even when it slips into predictability.Unfortunately, it is this predictability that does harm the film, especially when the plot instances can feel so contrived. As a film that 140 minutes long, The Pelican Brief is obviously far too long for what it is and much of that length is due to constant plot contrivances. Bumping into undercover hitmen or the wrong men at the wrong time, the two constantly are sent running or into hiding as a means of cheaply providing thrills and delaying the inevitable reveal of what is covered in the brief and its fallout. Further elements of the plot - the aforementioned contrivances - seems to occur just because the film needs it to move the plot ahead and provide tension. Constantly bumping into the same hitmen, killing the hitmen, or possible taking Gray off the story, the plot just runs through cliches, contrivances, and convenient plot elements to try drum up tension and anticipation when its central story is good enough to provide both if it just let it breathe.That said, one of the best elements of the film is a bit cheesy, but it works so well. After having experienced a car bomb first-hand earlier in the film, Darby is on red alert after getting into a car with Gray. The audience knows there is a bomb in the car, but neither know. Reading off information they just discovered, Darby casually pulls Gray's hand away from starting the car twice, in order for him to be able to pay attention to what she is saying. Tense and slowly building anticipation for whether or not they will figure it out, the final outcome of the scene may be obvious, but Pakula's tricks in eliciting this tension work phenomenally well and create a scene that really stands out as a highlight. A scene in which hitman Khamel (Stanley Tucci) hides in an FBI agent's hotel room closet and slowly opens the door to kill him is similarly tense, demonstrating Pakula's knack for suspense and thrills, utilizing these slowly drawn out moments of tension that allow the scene's suspense to slowly build before the big pay-off.While the film's predictability is certainly an issue, one element that really holds the film back is certainly how many characters are involved. With a seemingly endless number of indistinguishable slightly balding middle-aged white men in this cast, everybody blends in with one another, as none of the cast are able to really differentiate themselves enough to stand out or become a memorable supporting character. Some folks - the President or editor - are distinguishable to be clear, but far too many of the men tasked with stopping Darby and Gray or handling the investigation for the FBI just seem to blend in with one another."}, {"rating": "8", "text": "A very well-executed and suspenseful political thriller, The Pelican Brief runs along the same lines as \"Enemy of the State\" and \"All the President's Men\" to create a great film."}, {"rating": "7", "text": "Back in 93 when this film rocked box offices, I was 13 and obsessed with it. I was such a weirdo lol. It was mostly Julia Roberts and she is still one of my favorite actresses. She stars as Darby Shaw a young law student having relations with her professor. She creates a document called the pelican brief as an explanation of why some Judges were murdered. Her lover passes it off to his friend in the bureau and it begins to circulate leaving dead bodies in its wait, Including her boyfriend. Suddenly she's on the run and finds solace when she reaches out to an investigative reporter played by a solid Denzel Washington. Together they must try and survive so that can get the truth out. Watching it now it's still quite entertaining but Roberts is a little over emotional and the actual brief is never fully explained. It's undoubtedly fun but their characters and the plot aren't developed enough to truly be effective. The end it's smart popcorn entertainment.Budget: $45mDomestic Box Office: $101mWorldwide Box Office: $195m3.5/5"}, {"rating": "6", "text": "A regular conspiracy in a movie where the script's logic flaws are all too obvious.This is yet another movie involving the US government and far-fetched conspiracy theories. This time, everything revolves around an environmental issue.The plot is simple, but far-fetched enough to confuse the most inattentive audience: After two US Supreme Court judges are mysteriously murdered, Darbie Shaw, a law student, realizes that there should be some connection between the two judges and that they should both have been killed because of a lawsuit in which both participated. From then on, she goes ahead with a theory in a file that will eventually reach the CIA, leading to a series of murders and putting Shaw herself in danger of life. To prevent everything from being drowned out by the government, she contacts Gray Grantham, a journalist investigating the case.Personally, I think one of the biggest shortcomings of this movie is its script: Based on a book I've never read, the movie takes too long to develop and only halfway through we find out what mysterious theory Shaw wrote and why so many people seem to be willing to kill her. That is, we spend the initial half of the movie watching people die or flee so they don't die without us knowing why. The next half of the movie is, however, much less interesting. In addition, there are issues of lack of logic in some details, which the film deftly ignores, but our mind unveils as we begin to think about it.Julia Roberts is a good actress, but I don't know if she will have fond memories of this movie, where she played a damsel in distress and in need of salvation by a Denzel Washington always ready to face the danger. Nonetheless, the two actors worked well enough and established good chemistry in front of the camera. The rest of the cast doesn't stand out much ... except maybe Tony Goldwyn and Sam Shepard, who were great additions to the cast."}], "recommendations": ["the_bone_collector", "fracture", "the_rhythm_section", "hotel_artemis", "closed_circuit", "the_guilty", "greta", "the_card_counter", "the_voyeurs", "a_time_to_kill", "the_conversation", "before_i_go_to_sleep", "hotel_mumbai", "outbreak", "black_and_blue", "all_i_see_is_you", "the_silence", "crimson_tide", "secret_window", "7_days_in_entebbe", "breaking_in", "panic_room", "miss_sloane", "identity", "beirut"]}