{
  "id": 4313,
  "title": "The Devil Inside",
  "starring": [
    "Fernanda Andrade",
    "Simon Quarterman"
  ],
  "runtime": 83,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "In Italy, a woman becomes involved in a series of unauthorized exorcisms during her mission to discover what happened to her mother, who allegedly murdered three people during her own exorcism.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mtyFRIRBmrCE2XKU5EnEK8dtu2X.jpg",
  "categories": {
    "plot": 2.9565217391304346,
    "acting": 2.9285714285714284,
    "ending": 2.760869565217391,
    "soundtrack": 5.0,
    "cinematography": 2.6,
    "familyFriendly": 3.0,
    "funny": 0.3333333333333333,
    "action": 1.75
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I didn't go into the theatre expecting much from this movie. Besides the fact that you're hard pressed to find a good horror movie nowadays, I also can tell that the same format of \"found footage\" and adding info about the Vatican not condoning filming in the church has been done to death ever since the hit of Paranormal Activity - which I find to be great. However, the trailer of 'The Devil Inside' was definitely creepy so I was hoping for an entire movie of scares while setting aside the predicted corniness and thin story line. With this movie, though, if you've seen the trailer then you've seen the only exciting and scary parts in the whole thing. Seriously. Because of its documentary-style format there was a lot of downtime between exorcist scenes and so the viewer hopes for some scares after watching people you don't like doing Jersey Shore style confessionals that are ultimately cheesy and, frankly, hilarious. I'm a huge movie buff in general so I don't mind downtime in movies and I don't have to be entertained the entire time to keep my attention. But 'The Devil Inside' rarely kept my attention as I found myself mouthing the words I had heard over and over in the trailers. Then there's the ending. I understand their reasoning for having it end abruptly because it's an attempt to convince the viewers that they never got to finish the \"documentary\" because other circumstances got in the way. That being said, it was too abrupt as I was expecting some big finale that they seemed to be working up to that might've saved it a little more. But nothing really came in and saved the movie. Not even the turn of events that happen to the main four characters towards the end could save it. The reason that I gave it a four as opposed to a one or two was because had I not seen the trailers then I would've found it scary. So my advice would be to skip the theatre and wait to rent it when it comes out on DVD. Watch it with someone unfamiliar with the movie and see their reactions - cause thanks to the extended advertising the movie ends up being a waste of time."
    },
    {
      "rating": "0",
      "text": "Do not watch this film. Actually offended/raped/molested/emotionally scarred by how **** it is. Two epileptic donkeys with bladder infections wielding a camera could of produced a better motion picture. Please for the love of **** god do not watch this film."
    },
    {
      "rating": "0",
      "text": "My expectations for this film, when I went to see him, they were not very high, but, despite this, there was very bad. I thought that at least he could entertain the audience with a little scare some small but instead ... I got bored. Despite lasted an hour and a quarter was really long. For the first half an hour it did not happen anything (and for a short film that is serious), then when it began the second half with the possessed did not do anything to fear. And then when the actors were very woody, especially in fake documentaries, must be good and make you partaker of their emotions. The only actress that I think you save is one that has played Maria Rossi. Then the ending was the worst blow of all! I never expected such a thing. This meant that they had more ideas towards the end and this thing has angered me and many of those who were in the room. The film, as I said before, it lasted an hour and a quarter and the second one could put scenes that spoke of the main characters or even a few scenes that made fear or anxiety ... time there."
    },
    {
      "rating": "1",
      "text": "\"Connect the cuts, connect the cuts, connect the cuts...\" I can appreciate a bad horror film, but when I say \"bad\" I mean so bad that it's funny. Unfortunately, this movie was just BAD. \"The Devil Inside\" was nothing short of a boring, fake documentary about demonic possession with little to no thrills or scares. It's pretty sad when the scariest part of a \"horror\" movie is a dog barking (literally the only time I jumped during the whole film). This piece of plagiarized garbage attempts to cloak itself as a documentary, but really falls short and delivers its audience less of a supernatural thriller and more of \"priests\" and \"professionals\" vaguely speaking about the topic. The first possession scene doesn't even happen until more than halfway through the movie, and it is lackluster at best. Complete with contortionist-like movements, absurd cursing, and speaking in demonic tongues, this movie's possession scenes aren't anything we haven't seen countless times before. The film ends abruptly and with no real conclusion, leaving the viewer puzzled and more than a little disappointed."
    },
    {
      "rating": "0",
      "text": "I signed up for this site simply to give the pile of fetid dingo's kidneys a zero. At 87 minutes the movie just ends with no resolution of any of the threads. There are numerous other problems with this thing including the shaky faux documentary camera that gave me a headache. I have never felt so robbed by going to a movie. I hope the people responsible for the abomination get cancer for Christmas. Save your loved ones and warn them to stay far away!"
    },
    {
      "rating": "5",
      "text": "I am not one to go see horror movies by far, and on top of this I have never seen a movie that was made like this ever before in my life. However I did really get into the movie, up until the end credits I had honestly believed that it was based on a real story. The story really needs more because there are things in the story that go unanswered, and the ending really sucked ending so abruptly. To be honest they could have done a little more with it, and made it a little more entertaining. But all together it was not the worst movie that I have ever seen."
    },
    {
      "rating": "1",
      "text": "What can I say about this stuped film?! The answer is .... nothing! I like films of horror? but its the worst film in this genre !!! Paranormal Activity more interesting !"
    },
    {
      "rating": "8",
      "text": "I am quite biased with horror movies since it's the only genre I like, but yeah, this generally was a good movie that stays with you a long time after you've watched it. I find myself saying \"Connect the Cuts\" months after I watched the movie - that line was genius. Some scenes were quite disturbing, which is great. The acting was alright as well. But the ending wasn't very good at all, which is why I'll give it an 8. ...Connect the Cuts."
    },
    {
      "rating": "1",
      "text": "One of the worst horror movies of all time. With shaky cameras, terrible plot, more terrible acting, the only abnormal presence here is human stupidity."
    },
    {
      "rating": "0",
      "text": "I am a great movie critic. Always rating movies lower than the average user, I usually give respect to a movie by giving it a 1. But this, no! I can't call this a movie. It's not a horror movie. It is a piece compiled of a stupid story line and horrible acting. It ties with House of the Dead for one of the worst movies ever. And what about the ending? OH WAIT, THERE IS NO ENDING!"
    },
    {
      "rating": "0",
      "text": "Worst movie I have ever seen. You could not pay me enough money to sit there and watch it again.Take Paranormal Activity, get rid of all the suspense and jumpy parts, add in a little commentary to give it the documentary feel and you have this movie in a nutshell. This is my first review on anything, ever. That is how bad this movie was."
    },
    {
      "rating": "4",
      "text": "I should've known that when this movie was promoted by the Jersey Shore cast and that they called it \"good\", hat it would be actually crap. I had good hope for this movie, but right from the start it took time for it to get into its \"groove\". Some parts were indeed scary, I'll admit that much. However, being so damn similar to other movies like Paranormal Activity(which was done on purpose) it just doesn't have the same effect. The movie even opens so questions that you expect to be answered, only to be disappointed that they are barely covered before the end. Oh and the ending, it was too predictable. Fancy in its own way, but pretty much the same crap from recent horror films. The people in the room were pissed, and so was I that I spent hard earned money on a spin-off of Paranormal Activity. It's not a horrible movie, but barely worth going to the movies for, I reccomend renting it instead when it comes out on Bluray or DVD.   --------Wanna go watch a good horror exorcism movie? Go watch the Rite."
    },
    {
      "rating": "1",
      "text": "Im going to be completely honest and say this movie sucked. Did every minute of the movie suck? no, but about 99.9% of it did. Devil possession movie always scare me, but the devil inside didn't, except during one small scene, i don't want to give anything away to you people who havent seen this movie yet (which you shouldnt btw), but to the people who have, the scene with David the priest was a little frightening, but it was just too clouded by the rest of the movie which was an atrocity. The acting was horrible, the plot was dumb, and everything else doesnt even need to be mentioned. This movie was filled with awkward moments and sexual remarks by the devil, which by the way since when did the devil become such a sex addict? It was just pure stupidity all around, the only reason i even saw this film was to see just how bad it really was. Don't see this, save your money, save your time, and most certainly save your brain cells because i certainly feel dumber after watching this .5/10 .5 only for that one scene"
    },
    {
      "rating": "3",
      "text": "Let me first start out by saying this movie isn't AWFUL. it is just very bad. One thing you should prepare yourself for is if you did watch the trailer, you have seen almost all the scary parts. This movie was actually surprisingly not scary. It seemed as if no care was taken to make sure the movie at was sucking the viewer in at anytime. instead this is what seems to be an extremely rushed and very predictable movie. Not predictable in the sense that you will know what will happen at the end when the movie starts. but as the movie unravels, you will be able to tell what is around a corner or what will happen in the next minutes of viewing. The apparent rush that the creators of this movie were in also produced a very \"turn off the lights and walk out of the room\" feeling ending. Just as the movie seems to be hitting a stride it ends. and at about 1 hour and 30 minutes more content could have been easily added to create the basically missing 3rd act of the movie. All in all its not the type of movie you will think to yourself while watching \"what a waste of money\" but after review you will see its half baked plot, characters, and scares."
    },
    {
      "rating": "0",
      "text": "that movie was by far worst movie, if u can call it that, i have ever seen waste of time, please for the love of horror films do not go see that crap, the ending was so BAD every one in the theater booed at the end, everyoneï»¿ was extremely upset myself include, if your looking to be mad then you should watch this movie if not save your money"
    },
    {
      "rating": "1",
      "text": "The trailer for this film is very misleading. The Devil Inside is far from a horror film with the 87 minutes playing out more like a strange documentary than anything else. Everything from the acting to the \"Blair Witch\" style directing makes this movie hard to watch and ultimately a complete bore.  Attempting to piggy back off the success of other recent horror flicks, The Devil Inside instead becomes easily forgettable. By the end, you will disappointed. Members of the theater will either remain silent or verbally ask \"Is that all?\" when the film ends. At least that was my experience."
    },
    {
      "rating": "0",
      "text": "This terrible attempt at a mocumentary is in the same, tired, old, worn out vein as Cloverville.  People TRYING desperately to appear \"spontaneous\" and \"not acting\" when they look terribly rehearsed and like the really bad actors that they are.  The movie is slow, slow, slow and absolutely predictable.  Don't even rent this snooze on video."
    },
    {
      "rating": "6",
      "text": "This Was A Decent Attempt At A Horror Flick..\rIt's Just Not What We Wanted, This Had Already Been Done.. The Script Is Really Bad But The Acting Makes Up.. I Was A Inch Away From Giving This Film A 5... This Is Not A 2/10... Be Nice.. And Comeon 18/100!"
    },
    {
      "rating": "8",
      "text": "After reading all the reviews i thought this would be a really bad movie but i really enjoyed it,For all the people who said there was no ending what did you think would happen that it would all be tied up in a nice little bow i don't think evil is killed that easy and is always around so what ending did you want. My view is its worth a watch."
    },
    {
      "rating": "10",
      "text": "Best scary movie out there since Insidious! It does a good job of making you believe these characters are real and they are possessed by some kind of devil. The ending is good as well despite what others may have you believe. Packed with a ton of scary moments and makes you think that exorcism could actually be real, even though its not. Has more true scary moments(not false ones where a cat jumped down from a table or crap like that) than the woman in black, innkeepers, and paranormal 3 combined. Even the main girl in the movie is decent to look at"
    },
    {
      "rating": "6",
      "text": "The Devil Inside was a pretty decent attempt at an exorcism mockumentary. It had the presentation of Paranormal Activity and the delivery of REC and The Last Exorcism. The editing / mixing of the sound and the timing seemed a bit off somehow, too. It wasn't nearly as scary as it could have been, though the movie is still very tense."
    },
    {
      "rating": "7",
      "text": "If you enjoy Paranormal Activity then you should enjoy this movie. Takes an interesting twist on exorcism movies and plays out as a documentary. Although as other reviews have said it ends abruptly. I give it a solid 7 out of 10. Its hard to find a movie with a satisfying ending anymore keep that in mind. Looking forward to part 2 (because you know there will be one)."
    },
    {
      "rating": "10",
      "text": "Just Ignore the negative reviews.  They are probably the same individuals that give Alvin and the Chipmunks 3 1/2 stars and give this movie a zero.   I am a horror fan.  I am generally not scared at movies these days.  Movies like the typical Halloween slashing genre do nothing for me.  My rating of The Devil Inside is based on similar genre of devil or exorcists movies.  With the classic The Exorcists being the golden bar of devil movies, I have seen most every other exorcist related movies.  I would put this movie (Devil Inside) at number 2 behind \"the Exorcist.\"  It is better than the Last Exorcism, much better than are the sequels  (Prequels) to the Exorcist, better than Exorcisim of Emily Rose, and most recently The Rite.  The movie stars slow and feeds the viewer in morsels until the awesome climax toward the end.  The characters are likable with the exception of the camera guy.  Good acting performance from all.  There were several scenes that made me squirm in my seat.  Many disturbing scenes.  This is the type of movie where you will be glad to live with someone you trust and not alone.  It is one of those movies that will stay with you.  My guess is the negative reviews are from some people who are anti-Judeo Christian or anti-Catholicism.  There is no way this movie is less than 7/10. I liked the ending as it was unexpected and different.  This movie was better than expected and I recommend it be seen in the theatres. Go see it if you like  this type of genre."
    },
    {
      "rating": "3",
      "text": "A documentary film with no real good idea, only and exclusively for those who are crazy about exorcisms. Although even they may be disappointed. Watch it only if you have nothing better to do."
    },
    {
      "rating": "0",
      "text": "Oh my god what a train wreck of a film. If you're going to use an unoriginal concept such as possession in a film the you have to do something unique with it. There's nothing redeemable about this film, the acting, story, the horror - it all sucks beyond belief. One thing that drove me insane more than anything else was the Directors insistence on using camera effects in an attempt to heighten the tension of a scene. This is supposed to be a hand held, documentary style horror, so those effects just contradict what he's trying to achieve. Class A tripe"
    },
    {
      "rating": "7",
      "text": "I watched the movie and liked, the movie is good, but lacked more terror for a movie exorcism. I must confess that I took fright at some moments, however, anyway, the movie didn't convince me much! a 7 is enough."
    },
    {
      "rating": "10",
      "text": "Up there with REC. I've seen quite a few exorcism movies. This is one of my favorites. I have no idea why it gets such a terrible review from critics while terrible movies like Dead Girl get a 65. That was trash."
    },
    {
      "rating": "8",
      "text": "I cannot explain all the negative reviews that this movie is getting.  I went to see it out of curiosity due to the fact that I have an interest in the subject matter.  It is supposed to be a faux documentary, and as such does a very good job of grounding itself in reality.  There are some very disturbing scenes in the movie, which are done extremely well considering the budget constraints.  As for the ending, I thought it made perfect sense given the type of movie this is.  Do not be swayed by the high number of bad comments, this is definitely worth a watch."
    },
    {
      "rating": "10",
      "text": "Don't know why all the negative reviews, this movie is scary and these type of things usually don't scare me cuz They are not Real, the best horror movie of the year, the doc portions seem real, not fake and stupid like paranomal 1 and 2 or blair witch, this is nothing like that, worth giving a shot,  i say 8 out of ten but because people being ignorant, i say 10 out of 10"
    },
    {
      "rating": "0",
      "text": "Entre todas las malas películas que existen en el universo, esta gana por goleada, no sirve ni para pasar el rato, la historia es mala y para nada convincente y el final aún peor, no entiendo como esta basura hizo tanto dinero..."
    },
    {
      "rating": "3",
      "text": "Well, there is no way around it: this is yet another really bad horror flick. And, to an extent, as any horror, it has some interesting concepts that can induce fear. Or if not fear, at least thoughts of it. But that's about it. The cinematography is poor, as is the directing, and the acting is even worse. Screenplay has been written rather clumsily and it just does not work. Why give it even a 3/10 then, you say? Well, I am not sure myself. I guess it's my personal weakness for exorcism films. Or it's just trying to be generous, for some inexplicable reason. Maybe the devil has possessed me, and is making me do it. That would be more scary than this film... Go figure."
    },
    {
      "rating": "0",
      "text": "Let's see...all you need to make this movie is a HD camera, a couple of girls who don't mind acting like they are possessed, and a 12 year old or younger script writer. Pretty much like a 500 dollar budget. Everything about this movie was bad. They spent too much time talking about exorcisms, without actually really getting into detail about them. Too boring for most of the movie. Then when stuff happens it's very mediocre. The dialogue is a joke.   The ending is so stupid and rushed and leaves you at that point like all the PA movies. AVOID THIS MOVIE!!!! You may like PA and think this will be just as good.....IT'S NOT!!!!!!!!"
    },
    {
      "rating": "1",
      "text": "There's not much left to say about this, erm...movie?! I'm a bit concerned to what's happening to cinema these days, specially horror movies, which tend to be ridicularized. What credibility are we supposed to give to anything so freaking bad produced like this? Just hope the budget was deeply low."
    },
    {
      "rating": "0",
      "text": "I thought this was supposed to be as good as last year's \"The Last Exorcism\" until I was too tired of all the horror scenes in the movie. This is not how you start 2012 with a washed up \"Paranormal Activity\" rip-off. Neither critics or audience liked it, and I agree with them. \"The Devil Inside\" is one of the worst and disgusting movies I've ever seen."
    },
    {
      "rating": "1",
      "text": "For a while I avoided this movie based on the huge negative reception. I'll admit my curiosity got the better of me and I must say, I should have listened. This movie is a serious waste of time and if you too are curious to see what all the fuss is about, don't. Do not waste your time with this movie, watch another movie or go outside. Hell, watching paint dry would be a better use of your time than to subject yourself to this. I don't even know where to begin. This is pretty much a combination between The Exorcist and Paranormal activity as well as a few other titles in that mix. There is nothing new that you haven't seen before which makes the movie seem even more pointless and an even bigger waste of your time. Not only that, but it's just downright boring(and that's the least of the problems). There's only really one or two creepy moments and they're in the condensed 2 minute trailer which to me, is a better and more enjoyable experience. Characterization is pretty much non existent so I didn't really care at all what happened to these people. The plot and story are paper thin. The whole story is just Isabella (Fernanda Andrade) going to Rome to see her mother and then convinces these two priests to perform an exorcism on her. That's it, and I don't care(nor do I entirely believe) that this was based on a true story. I'm sure what happened was probably horrible but that doesn't mean that it'll make a great movie, case point: The Devil Inside. The acting is just okay. It's not bad but, none of it is really effective or memorable. The pacing of the movie is off, it starts off slow then picks up when they perform an exorcist on this girl, then it slows down only to pick up again. However, none of these are the biggest problem. The biggest problem and sin was the ending. It's as if the writers didn't know what to do so they probably decided that, \"eh this is good enough lets just end it.\" It's so abrupt and leaves so many things unresolved, it truly is one of the worst endings in history. However, thank god this movie is mercifully short(clocking in at only 75 minutes) because if I had to endure another 10 or 15 minutes of this **** I would have begged for one of those demons to transfer to me. It would have been a less painful experience to be possessed than sitting through anymore of this abomination. Overall, even though there are one or two creepy moments they're in the trailer, which you're much better off watching. This is a rip-off of pretty much every Poisson movie ever made. There's barely any characterization, story, and plot. The acting is so-so and the ending is horrendously awful, just truly the worst. Somehow this manage to make $100 million worldwide on a budget of only $1 million, so because of this expect to see many more of these types of movies, thanks world. Editions like these into the found footage genre are better left UN-found."
    },
    {
      "rating": "0",
      "text": "I remember just watching the trailer of this at the cinema and it looked like rubbish. Had a good laugh when i saw metacritic's 19 score review. Judging from what others have written this would be good for torture"
    },
    {
      "rating": "0",
      "text": "Come on WHAT!!! Really did that really happen? The dumbest ending i have ever seen.  And it does have a ending thank God.  Because if it didn't have a ending i would have smashed my DVD player just to stop the movie. It was not scary. It did NOT seem real. If you watch this movie you will waste 1 hour and 18 minutes of your life that you can't get back. One more time It's not SCARY!!!!!!"
    },
    {
      "rating": "0",
      "text": "The Devil Inside can't be far from a movie. A stupid movie made ​​by bad actors, a non-existent plot and stupid dialogues, all orchestrated by a director who would be better to change jobs. The only thing that really scared of this film is spend good money to go see it."
    },
    {
      "rating": "0",
      "text": "Easily one of the worst movies I ever seen. Not even scary like the commercial showed and probably will make you say \"What?\" The ending is biggest let down too. Just don't waste your money on this piece of ****"
    },
    {
      "rating": "0",
      "text": "APPARENTLY, SOMEONE is feeling greedy to milk off the hybrid horror/found footage genre. BTW, if you're wondering how the film ends, it ends with a car crash with the main characters. nuff said."
    },
    {
      "rating": "0",
      "text": "I CAN'T GET MY MONEY BACK NOR THE TIME INVESTED IN THIS MOVIE.For those of you who are thinking about going to see the movie, \"The Devil Inside\", DON'T, seriously don't. It is a complete waste of time and money. For those of you who have, I'm sorry you had to sit through that piece of garbage.If any of you spent money and saw \"The House of the Dead\", you'll know what I mean. Literally, I cannot get back that 1 hour and 20 minutes and the money I spent on admission and concession. The movie is a 'found' docu-drama which is movie medium too prolific for its own good. It movie tries to be \"The Blair Witch Project\" and epically fails to live up to that standard. The blatant plagarism of a scene from \"Paranormal Activity\" should have been a big warning sign this wasn't going to be good. You figure out the end-plot 5 minutes in at 'Exorcism School' which is transference of multiple possession; the big scare is a dog jumping at a fence at the characters going to their first exorcism; the shocking part is the baby drowing scene by a priest; the gross-out scene is a woman having her 'period' during an exorcisim; and the people who end up possessed or dead you really don't care for - they are either dumb (Michael), egotistical (Ben), forgettable (Isabella), or just plain sad (David). Oh yeah, SPOILER ALERT, but WHO CARES it is in the title! It ends with the demon claiming to be the Devil himself and then the movie ends in a car crash. Talk about a just and final ending much like the movie itself, a wreck. This isn't even a B movie its more like a Z movie."
    },
    {
      "rating": "0",
      "text": "Let's see, where do I start. I was so pumped to see this movie. I would sit in my room and dread the trailor that would come on late at night.. but when me and my ex boyfriend seen the movie I was so mad. It started off slow and just sucked after it started to pick up.. the exorcism scenes were alright but I was so bored by the time they came up I was almost already asleep. And the ending was soo stupid. I get more action at the assistant living facility I work at than this film provides! Save your money"
    },
    {
      "rating": "2",
      "text": "This movie is a movie when it is done that has you going what the hell did I just waste 85 minutes of life on. The plot is jumpy, the movie answers no questions and the acting is sub-par. I could get over the acting if the movie had a few actual plot points or if there was original or new about this movie but there just is not. It was very disappointing. To sum this movie up in a good sentence I would have to say, once you have seen the trailer you really have seen the jist of the movie."
    },
    {
      "rating": "2",
      "text": "Certainly wasn't as bad as the critics and movie-goers made it out to be. There are two or three (max) extremely effective scenes, but the acting is poor at best. Frankly, nothing much happens onscreen.A definite headscratcher, especially by the ending credits, but not totally awful."
    },
    {
      "rating": "2",
      "text": "Wow. Just... wow. The Devil Inside is a movie about Maria Rossi (Suzan Crowley) who back in 1989, she killed 3 people & was possessed when it happened so her daughter Isabella Rossi (Fernanda Andrade) wants to help her mother. This movie had some really creepy exorcism stuff which is truely scary, but the ending, nooooo. When you promise something in a movie and it's cool, but the ending just sucks ass, the good factor drops really low. If your wondering what the ending is, here you go. Everyone DIES in a car crash, then the screen goes to black, shows you a website, andddd FIN. Terrible ending = Terrible movie."
    },
    {
      "rating": "0",
      "text": "This is a terrible joke for the movies, The Devil Inside is one of the worst horror films that I watch in all my life, the only good is the screams of the lady, but the more is terrible, cast, story, an awful film."
    },
    {
      "rating": "5",
      "text": "Isabella travels to Italy along with a documentary filmmaker hoping that together they can unravel the mystery behind her mother's failed exorcism, which resulted in the deaths of three clergymen in the basement of her childhood home. What they discover will be more shocking than anything they could have imagined as they enlist the help of two newly-ordained exorcists to help free her mother from demonic possession. THE DEVIL INSIDE exacerbates an already unlikely scenario using the popular \"found footage\" technique, which works as a disadvantage just as much as it aids in the realism on screen. It is difficult to accept that the governing bodies in the hospitals and churches would allow a cameraman to enter, let alone the fact that he would jeopardize his well-being for the sake of the film. The style does produce some truly unnerving moments, however, particularly in the disturbing basement exorcism in which contortionist Pixie Le Knot performs several gut-wrenching maneuvers. The story quickly loses focus and asks way too much of its audience as we near the final third of the film, at which point it becomes entirely unbelievable. The filmmakers then have the audacity to hock the film's website for updates on the case, as if anyone would visit after being left with such a jumbled and inconclusive ending. Momentary shocks are not enough to win over modern audiences, who crave convincing characters and storytelling with their scares."
    },
    {
      "rating": "2",
      "text": "Isabella Rossi travels to Italy to visit Maria, her estranged mother of 20 years, locked away in an asylum after being convicted of killing 3 people in 1989, supposedly during demonic possession.  Isabella seeks to understand the truth behind the horrific events and to find out if her mother really is possessed.  Attempts to cure Maria using unconventional, Vatican-prohibited exorcism methods go awry, and they discover that Maria is possessed by more than one demon, which will not go quietly.This ever-popular genre of cinema adds to its encyclopedic index a forgettable, lacklustre entry; a clichÃ© lost amongst the listings of its scarier, more effective supernatural found-footage counterparts, such as The Blair Witch Project and Paranormal Activity.The sheer lameness of The Devil Inside is difficult to overstate.  It is nothing more than a cheap, uneventful production made worse by robotic, unconvincing acting and a blatant lack of effort in creating thrills and chills.Despite some genuinely disturbing scenes where innocent characters become possessed contortionists and an unnerving scene with Maria Rossi (Suzan Crowley) in her room at the Centrino Hospital for the Criminally Insane, The Devil Inside is, quite frankly, boring.Amateur in all its constituent elements â"
    },
    {
      "rating": "1",
      "text": "This movie is lucky to even get a one in my eyes. The acting was bad, the ending was one of the worst endings I've ever witnessed in a film before. I can't stress to everyone enough how bad the ending is. This is unfortunately the worst movie I've ever seen in my life. A waste of any money or even time in ones life. Don't watch it if you're even considering it."
    },
    {
      "rating": "0",
      "text": "The worst ending in movie history? Probably. That can apply to the film as a whole as well. Mockumentaries like this came into light by having a sense of realism in horror that The Blair Witch Project admirably captured. Paranormal Activity played out kind of gimmicky, but it still managed to generate pathos and scares. That films' sequels only delivered scares. Then we have this. This utter mess. First of all, in good horror, you have to be able to sneak up to the audience and get us to associate with and care for the main characters and you have to do it being very sly so we don't see the move as cloying. Then, you have to generate a genuine sense of tension and fear for the fate of these characters. None of this happens in 'The Devil Inside'. There are no characters. There is no fear. There is only 80-so-minutes (It felt eternal) of blatantly blasting on the church, exorcism scenes that reek of plagiarism from 'The Exorcist' (what's with all these horny demons?), and flat out unintentionally funny moments. In one part of the film, the possessed mother randomly walks up to the concrete wall and bashes her head into it repeatedly. I couldn't help but envy her."
    }
  ]
}