{
  "id": 1290,
  "title": "The Last Witch Hunter",
  "starring": [
    "Vin Diesel",
    "Rose Leslie"
  ],
  "runtime": 106,
  "genre": [
    "Fantasy",
    "Action",
    "Adventure"
  ],
  "description": "The modern world holds many secrets, but by far the most astounding is that witches still live among us; vicious supernatural creatures intent on unleashing the Black Death upon the world and putting an end to the human race once and for all. Armies of witch hunters have battled this unnatural enemy for centuries, including Kaulder, a valiant warrior who many years ago slayed the all-powerful Witch Queen, decimating her followers in the process. In the moments right before her death, the Queen cursed Kaulder with immortality, forever separating him from his beloved wife and daughter. Today, Kaulder is the last living hunter who has spent his immortal life tracking down rogue witches, all the while yearning for his long-lost family.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qXvOpA2nhK5HQ6I95sN3nnMtfjH.jpg",
  "categories": {
    "plot": 5.148936170212766,
    "acting": 4.782608695652174,
    "ending": 5.444444444444445,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.793103448275862
  },
  "reviews": [
    {
      "rating": "7",
      "text": "If you can get into the witch lore this is pretty good movie, classic vin diesel im sure that means different things to different people. Special effects are awesome, someone claimed a few laughable scenes but I didnt notice one that pulled me out of the moment. The story is decent with a little more depth than some give it credit for. A few missed opportunities to show us the struggles of living with immortality. Some of the dialog choices did make me wonder but with a movie like this its to be expected. Movie is great for what it is action movie + Vin Diesel + witch lore = decent popcorn flick."
    },
    {
      "rating": "10",
      "text": "Much better than anticipated.\r I think this movie's poor rating reflects the nature of mass opinion more than anything regarding the movie.\r I enjoyed it."
    },
    {
      "rating": "8",
      "text": "If there's one description for this movie, it's FUN! If you're down for some entertaining new take on the world of witch-craft hunting, \"The Last Witch Hunter\" might just be what you need.\rThe only downside for this otherwise \"funtastic\" ride of a movie, is Vin Diesel's casting! Yup, really. I think it would've turned out much more awesome if he'd played the fat witch(wizard? Funny, I can't remember that word being mentioned throughout the whole movie) dude, Belial. 'Cause honestly, there's no way the chemistry between Diesel and Rose Leslie could've have worked!\rWord of advice: The \"critics\", the \"professional\" ones, yeah those guys, many times they suck at their job."
    },
    {
      "rating": "5",
      "text": "Really disappointed to be honest. I was expecting big things from this film after watching all the trailers. I normally enjoy these types of movies but this one not so much. The plot has so many flaws which ruins the quality of the film. There is just something missing and things that could have been done so much better. I wouldn't go as far as saying this is one of the worst films ever made but it is a massive disappointment. This film falls in to the category of its really well advertised but the film itself is not so great. Which ultimately, when it comes to watching makes it worse. There are scenes where they didn't go far enough and it felt like they were holding back."
    },
    {
      "rating": "7",
      "text": "Honestly, I expected garbage and was surprised that I could actually sit through it. Diesel proved he could be a lead in anything and still carry a film despite it's flaws. It's a solid open world that introduced enough set pieces to set up several sequels and I liked this one enough to actually want to see the sequel in theaters. I just hope they bring in a better villain next time, The witch queen (main villain) spent most of her on screen time being killed."
    },
    {
      "rating": "6",
      "text": "It's not the greatest movie you ever saw. But it's good, there are action moments, scary moments, even funny moments, great actors, vin diesel of course was just vin dieseling in the movie, but overall, the movie is worth of your money."
    },
    {
      "rating": "4",
      "text": "I went in without expectations or knowing anything about it except for reading the title.\r The actors were great, Vin Diesel cool and like able as always, Michael Cane was Alfred, Frodo didn't do much.\r A few minutes in I thought the movie had potential, but as it went on I slowly realized that it was one of the frustratingly predictable ones. The movie is one massive cliché, with such awesome things like endless dream sequences with a twist, having loved and lost, left with hard shell, woman busts through hard shell, love at last, main character losing power and regaining power, main character being tossed around like a **** doll ending with him lying on the ground for a while... you know the rest.\r It's not ball achingly bad, but if you've seen your fair share of action movies you'll be able to predict every scene, plot twist and ending. In other words, it brings absolutely nothing new to the table. If you're a creature of habit that just can't deal with innovation you'll love this movie."
    },
    {
      "rating": "8",
      "text": "A change of pace using the fantasy genre giving us some cool new characters and ideas. The movie is bogged down by a lot of expository dialog, cannot be denied. But visually there is a lot here borrowed from a lot of things to do it's own thing. From The Witcher to Dungeons & Dragons to The Highlander. Taking the BAMF archetype and chucking them into the modern age isn't a new thing. But I clearly enjoyed it for what it is. There's flaws a'plenty but there was enough here for me to sink my teeth into the crap I like watching, simple as that. Pretty slick CGI for a movie of its budget too.\r We don't see original characters or original fantasy worlds much on the big screen these days, so maybe I'm just hungry for it. But I enjoyed the ride for the most part and I think it's worth a shot if this looks mildly appealing to you."
    },
    {
      "rating": "10",
      "text": "Personally, I thought this movie was amazing. I signed up for imdb, metacritic after using both sites for many years just to post this review.  As a actual college graduate, I have no idea why anyone would think poorly of this film. The effects and sound were some of the best I've seen out of any movie. And that was with only seeing the 2.0 version and not full surround. If so many people got this wrong, I wonder what other films I have missed listening to these self-qualified \"critics\". A must see for 2015/2016.\r A zero review from the guy saying \"I'd rather playing assassin.\" No wonder there are so many bad reviews. They are all done by ADHD pre-teens."
    },
    {
      "rating": "8",
      "text": "I don't understand the hate on this movie.  This is a solid sci-fi / fantasy genre piece with great special effects.  It felt like a \"Dark Souls\" video game come to life, in my opinion.\r John Wick got bad metacritic reviews, Dredd got bad reviews.  Both of those are solid genre movies that deserved more success.\r I wish more professional reviewers (and online reviewers in general) knew how to appreciate genre movies more and rate them appropriately."
    },
    {
      "rating": "4",
      "text": "Vin Diesel is the title character, leading the earthly battle against witches…most importantly the resurrected Queen Witch. The film starts out promisingly with mysterious magic spells, cool special effects and a few noisy confrontations. About midway thru, a painfully predictable plot and tedious talky sequences drag down the action. Tossing in Elijah Wood and Michael Caine adds a bit of class, but by the time it's over, things have deteriorated into unexciting fights and dreary drivel."
    },
    {
      "rating": "5",
      "text": "I love action movies and Vin Diesel too..  But this is not his best film and is so convoluted and meandering that I barely could maintain interest in it.  It was like a bad video game.  But some people like bad video games.  So there you are."
    },
    {
      "rating": "6",
      "text": "The story is interesting and the cast is brilliant. On the other hand, the script's development fails to engage us because of poorly written dialogues and bad choices on the third act, especially the ending. So as much as performances deliver and visual effects are pretty cool, the story disappoints a lot. Still a nice entertainment for those who search for action."
    },
    {
      "rating": "10",
      "text": "What a refreshing story and movie. The actors selected really brought out the stories and their chemistry worked fabulously too. I really enjoyed the use of graphics and set designs. I was interested the whole time and am looking forward to a sequel. Just relax and enjoy the fantasy. Don't over analyse it like most people on these reviews do... Enjoy the fun :) Because it is FUN! Thanks for entertaining me guys (^^) Otsukaresama!"
    },
    {
      "rating": "5",
      "text": "The Last Witch Hunter casts many mismatched fantasy gimmicks like a desperate magician, lacking identity and any real magic.\r Say what you will about Vin Diesel, the guy has performed a variety of roles. From the famous furious action series, sci-fi, family comedy and even the lesser known crime drama, he's a legitimate blockbuster draw. However, in his recent fantasy escapade, he's bogged down by the same flaws from Constantine and even Van Helsing; far too much stylish fireworks and lacking any real focus on narrative.\r The Last Witch Hunter tells the story of Kaulder, an immortal who hunts witches for centuries. Straight from the first act, the movie tries to jam as many expositions as possible while panning through myriad of hidden exotic locations practically every five minutes. It feels like a rushed tour of New York and none of CGI view made lasting impression.\r This is a missed opportunity since the occult version of modern city is teeming with potential. Other movies, even comic books and video games have used this premise to captivate audience effectively. The screenplay could've showcased the mythology with calm pace and imaginative scenery, yet the movie abruptly shifts between uninspiring random clubs, which makes the entire environment seems generic.\r It doesn't have to be Hellboy 2 level of sophistication, but the lore available feels terribly underutilized. Visual is mostly crafted with CG, and the action is mediocre with crude choreography. Underneath the cosmetic spells, the production value feels simply average, far too similar to Constantine from last decade.\r This rushed pace is also translated to the characters, which appear like random strangers meshed together and suddenly given strange development. This is not on Vin Diesel alone, the movie has good acting prowess with Elijah Wood and Michael Caine, among others, however the characters are nothing more than stereotypical eccentric magicians or familiar villain. At some points it even looks like some cop procedural series with awkward buddy gimmick.\r Lastly, Vin Diesel himself isn't that convincing even though he's groomed for superhero epic. In fact, he fared much better as Riddick, at least he had an identity as the stealthy assassin. While as Kaulder he's just another grunting protagonist despite the presentable physique or the grand attire.\r The Last Witch Hunter is a fantasy foray filled with shallow parlor tricks and incompatible hero in Vin Diesel. It had potential to be spectacular, but the shoddy presentation only offers pedestrian exhibition."
    },
    {
      "rating": "5",
      "text": "Well, this was hum-drum.  Vin Diesel, Michael Caine, Elijah Wood, how could you go wrong with these well known actors?  Interesting story line for this genre, but somehow the movie just never catches your interest.  Maybe too much computer imaging?  Maybe good actors but not a good mix of acting styles?  Maybe too many flashbacks so you lose the flow?"
    },
    {
      "rating": "8",
      "text": "I personally liked the movie and I don't see where all the negativity is coming from.\r When I go see a movie, especially an action adventure movie, I want to be entertained and it did that. I thought the story was engaging and it kept my attention. It didn't have that many slow parts and the movie flowed at a good pace. Vin Diesel was awesome like normal and was fun to watch him play a bad @ss witch hunter.\r I would love to see a sequel, but with all the negative press.. might never happen which is a shame."
    },
    {
      "rating": "4",
      "text": "If ‘The Last Witch Hunter’ seems familiar to you it’s because we’ve seen it all before in any number of modern vampire narratives, just replace vampires with witches and vampire slayer with witch hunter. Think ‘The Lord of the Rings’ meets ‘Blade’ but without the narrative and visionary brilliance of the former, or the originality and cool factor of the latter.\r Director Breck Eisner attempts to craft a dark but family friendly contemporary all-action fantasy by combining a well-trodden narrative and mild horror with plenty of CGI and spectacular magic imagery, plus convenient religious iconography and a dash of ineffectively mixed humour & drama.\r The result, although entertaining enough, is a mess that fails to impress or engage despite the efforts of its star, who’s now exhausted “Fast & Furious” charms don’t add layers to the stereotypically badass but shallow character “Kaulder”, and no amount strategically placed dead family flashbacks will convince you otherwise.\r Diesel’s co-stars Rose Leslie and Elijah Wood do their best with pedestrian modernist fantasy dialogue, but even Michael Caine in his now customary mentor/confidant role can’t save the characters in ‘The Last Witch Hunter’ from drowning in the frenzied action and convoluted narrative.\r With impressive action set pieces and striking visuals and with a duration of just shy of 2 hours, ‘The Last Witch Hunter’ is not entirely without merit as fantastical escapist entertainment. No doubt its producers will be hoping they’ve found a Vin Diesel vehicle off which they can build a franchise, and with many of the mass appeal modern components for success there we won’t be surprised if this is the first of many “Kaulder” films.\r The Bottom Line…\rFun, flashy but forgettable, ‘The Last Witch Hunter’ walks a very familiar cinematic path without offering anything much to remember it by, a reasonably entertaining way to burn a couple of hours which you’ll forget as soon as you leave the cinema… that is until the inevitable sequels."
    },
    {
      "rating": "8",
      "text": "I feel like pretty much everyone went into this movie expecting it to be horrible and at every step in the movie they had the chance took it to make it more horrible in their own mind.  Yes Vin has a \"role\" and yes it may have been \"predictable\".  Did you really think that Megatron was going to blow up the world in ANY Transformers movie? Do the bad guys ever win in ANY movie?  Yes.........very very few.  I think this movie was doomed before it started because of peoples idiocy and bias.\r I watch movies for the sheer enjoyment.  I actually like the story and the special effects were NOT as horrible as everyone makes them out to be.  Yes, predictable, blah blah.  I however can know the outcome of anything, know every spoiler and STILL want to know the story as to how it happens.\r If you felt you wasted your money, then I'm sorry that your imagination and originality are dead.  Don't buy it when it comes out. I felt the same way with In the Name of the King...one of the worst movies I've seen.  I get bad movies as long as they're bad for being bad, not because of predetermined bias based on peoples want to see actors fail/directors fail."
    },
    {
      "rating": "10",
      "text": "Amazing. Perfect fantasy genre movie.. Something douchy critics will never understand because they are self absorbed trash. Great fun. Hoping for a sequel!"
    },
    {
      "rating": "8",
      "text": "I had a lot of fun watching this film. There's a bit of a hitch at the end that seemed rushed and out of place but otherwise it was a wonderful ride. The world building was excellent, something many fantasy films struggle with, and the tone and pacing was beautifully consistent with the D&D roots it drew from. All in all a super cool, albeit imperfect movie, and a world I'd love to visit again."
    },
    {
      "rating": "0",
      "text": "This movie was an outright insult.  The set ups simply don't make sense - and the story it is trying to tell is ridiculous beyond measure.  Couldn't bring myself to watch beyond the first half - apparently the better of the two.\r Vin Diesel's commitment to the role seems misplaced.  Elijah Woods and Michael Cain have zero role or character.  The script is so poorly written that you will constantly question it's logic and the dialogue so bad that you will question whether it's self-aware.  This is an un-movie.  Avoid."
    },
    {
      "rating": "3",
      "text": "If I can denominate this moment to call it the first negative review towards this movie, I will do it and I'm not afraid. Poor Vin Diesel is killing himself in acting out there."
    },
    {
      "rating": "10",
      "text": "I get why all the \"movie critics\" gave this a bad review. Its not \"Milk\" or \"Brokeback Mountain\". Its vin diesel. Vin Diesel doesnt do brokeback mountain. This movie was tight. If you're a guy and you don't like Milk or Brokeback, you'll like this movie. 10 out of 10."
    },
    {
      "rating": "7",
      "text": "Certainly better than the average CGI, fantasy flick. While falling into some similar plotting traps we've seen to often from films of the like, the movie as a whole succeeds thanks to a cast made up of likable, talented actors. The impressive visuals and stylized world help as well.\r Plenty of fantasy mumbo-jumbo is floating around. With plenty of lore and magic flying around there are occasional moments that get jumbled and confused. For the most part though it's all pretty easy to follow. Especially since the core plot hits some familiar notes.\r We've seen this before. Powerful guy who lost his family deals with a returning evil. Heck, even the immortality part rings a few bells. That's a death sentence for most movies. For some reason though it feels like slipping into a well worn glove with this one. Comfortable and familiar.\r The cast all play their familiar character types with a lot of charisma and talent. But what else could one expect with talent from the likes of Lord of the Rings, Game of Thrones, Nolan's Batman trilogy, and Diesel himself making up the main cast? Obviously we are going to be treated to more fantastic performances.\r A lot of great special effects bring the magic to life. The world is vibrant and often colorful. The action is a little lacking, but overall very entertaining. This is an all around pleasant film to look at, and not just because of Rose Leslie.\r But what's the real saving grace of the film? What sets it above the average fantasy shlock? Simply put, it's not cheesy. There's no sense of camp, overacting, or inherent goofiness to take all of this into the painful, eye-rolling territory that it otherwise could have landed in. The lack of stupid one liners cannot be under appreciated.\r So despite having a very familiar premise there's enough good here to make it worth a watch. A talented cast and attractive world breath new life into it's recycled elements. While still not perfect it's an enjoyable dark fantasy action movie that somehow manages to defy the odds and elevate above the likes of say \"Seventh Son.\"\r I give the movie a 7.5/10"
    },
    {
      "rating": "5",
      "text": "A surprisingly weak and slow movie. All the action scenes were shown in the trailers. Aside from lack of action it contains a banal story with bland characters. The only somehow decent thing about this movie are visual effects."
    },
    {
      "rating": "0",
      "text": "one of the worst fantasy movie i have ever seen. compare film and the plays to Lord of the Rings or Hobbit. there is no character in the movie. what is van diesel anyway? does he miss her wife and tired of living or does he nourish the life? if i want to experience such a crap I'd rather playing assassin. more fun,excitement, and even fear than this film. and poor acting by Diesel."
    },
    {
      "rating": "6",
      "text": "I went into this expecting to have it feel like another Seventh Son, but what I got was something more akin to Constantine, which was a much less bitter pill to swallow."
    },
    {
      "rating": "9",
      "text": "Having not watched \"The Last Witch Hunter\" on the big screen, I bought the Blu Ray on a whim after seeing the trailers.Turns out that this is another case of \"don't bother with those useless professional critics, they're a waste of space\". If you've watched Vin Diesel in XXX or Fast & Furious or Riddick, then this is the same Vin Diesel in another cool frantic action movie with fantastic, polished CGI. What's there not to like in this? There's Vin Diesel himself, there's witches, there's factions, there's humour, there's special effects. Some people say the story is flawed but honestly, I haven't found any glaring flaw as such. It's a good old fantasy yarn and to me has good pacing i.e. there's regular action throughout the movie so there wasn't a dull moment at all. The storyline kept me interested throughout. Even the twist (I don't want to spoil it for anyone here) was quite comfortable and worked well within the movie.If I watched my movies on the basis of these \"professional critics\", I would've missed 80% of the good movies I've seen. Only reason it's not a 10 is because Vin Disel has made over-the-top amazing movies like Fast & Furious and XXX so I had to make room for rating THOSE 10s!Stuff the critics. Watch it and judge for yourself. It's good!"
    },
    {
      "rating": "4",
      "text": "This is the worst Vin Diesel movie so far. I really regret having watched this movie. It is very cliche, with a terrible script. It is unbelievable that there is people rating higher than 5. If I were you I would not trust any positive rating of this movie."
    },
    {
      "rating": "7",
      "text": "Interesting premise filled with solid lore building and interesting set pieces and enough action to satisfy those who enjoy fantasy/action. Vin Diesel is really good here, he brings a calm yet intense demeanor to the role and has enough charm to make up for a lackluster script."
    },
    {
      "rating": "1",
      "text": "A slightly below average B-movie. The crew tasked themselves with telling too much in a small amount of time so every scene feels like it's told in passing. This movie should've kept to the middle ages and fleshed out all the craziness that was happening there, instead of taking an 800 year time jump just so Diesel can shoot a gun while carrying a sword. All the other characters feel like vague after-thoughts to the plotting, especially Elijah Wood.\r Anyway, would've been much more enjoyable as a period action-flick that started at the actual beginning of this story."
    },
    {
      "rating": "4",
      "text": "The Last Watch Hunter is a fairly lazy attempt to start a franchise and although I did have a good time with this movie its not a good movie. The whole thing is just so ridiculous that at points its really hard to take it all in and understand it. It was still a fun watch as Vin Diesel fights all these witches with these random and unexplained tools. The witches are all CGI and they really don't look that good. I think they took the wrong path and should've went with make-up rather than overloading on the CGI. The dialogue is way too serious and there are several lines that are just not suitable for Vin Diesel. He's fine for most of the film but there are a few scenes where you can tell he's out of his element. There are also roles from Michael Caine and Elijah Wood and neither one of them are really used enough or really even need to be there. Then in the ending we get an even more unneeded plot twist that really does nothing for the story that they just threw in because they could. Don't get me wrong I enjoyed The Last Witch Hunter, it was still entertaining, but so flawed. It may be in so bad its good territory or it may be destined to become a cult classic. Who knows? The ending severely hints at a sequel so there may be more."
    },
    {
      "rating": "7",
      "text": "Good story and great acting. The action scenes could've been better. For example, more magic and more witches should've been included in the movie. This movie did good on surprising you as well."
    },
    {
      "rating": "8",
      "text": "An all-but-incomprehensible supernatural action mish-mash in which Vin Diesel plays an immortal modern-day witch hunter... A passable time killer that will lose nothing once it hits the vending machines.\r Watch this movie here http://www.watchfree.to/watch-2a4526-The-Last-Witch-Hunter-movie-online-free-putlocker.html"
    },
    {
      "rating": "4",
      "text": "The sole reason for the fact that I didn't give it a 2, 1 or 0 and gave it a 4 is because of Vin Diesel.\rWhile I like fantasy-related movies as much as the next nerd, this just blew it all up. The story is fairly decent, but it is executed badly. If it had a remake or a sequel I would probably watch it just to see where the story leads, but this one just didn't feel like a good movie for me."
    },
    {
      "rating": "5",
      "text": "For diehard Diesel fans only, has some decent action but is mostly pretty bad."
    },
    {
      "rating": "4",
      "text": "Someone noted this was Vin Diesel's worst movie yet, but I think they forgot how idiotic\"The Pacifier\" was. But I do think Vin was mis-cast in this film in the role of Kaulder. Vin is really more of a street thug and excels at those characters, not in something like this, his role just seems so contrived. Same with Elijah Wood, just doesn't fit into his role well at all. Also, the pacing was all over the place. Sometimes I was at the edge of my seat but mostly I was about to fall asleep for all the boring dialogue. It could've been a great experience but it just wasn't put together well and that falls on the Director, Breck Eisner - yep, son of studio mega-exec Michael Eisner; doesn't make him a great director though does it?"
    },
    {
      "rating": "6",
      "text": "A descent enough mindless monster action movie.Some pretty cool action scenes and effects. Storywise there is very little original and it is very predictable. However, the characters and the world it's set in are pretty good and I would like to see more of it.Overall: The Last Witch Hunter is a fun film with some great designs and ideas, just a shame that it has such a generic and unoriginal script. With a stronger writing team, there is potential here."
    },
    {
      "rating": "5",
      "text": "Fighting the same witch twice in the 800 years!\r I have seen Vin Diesel in many avatars, from the sci-fi to action, adventure and thriller, they all suits him better, but this supernatural theme seems weird. There was lots of action, so it does not feel like a fantasy film, which is merely the idea of film concept. From the director of 'Sahara', the story of an cursed with eternal life witch hunter named Kaulder. Except the opening, the remaining film sets in the present New York city where he has to stop a witch who is trying to bring back the witch queen from the dead.\r It was just another those films where the ancient meets the modern world. Okay, I agree a few films did impacted from the last two decades since the evolution of the CGI. Even though, they were not considered the greatest, in the meantime, I don't know where did this one come from. It was not based on any book, but I think just to make a few quick bucks using the star power. Other than that this film offers nothing new.\r Yes, I liked the Diesel's presence in this, but he should not do films like this, except if the screenplay and role developed to his caliber. It was not a big box office hit, but merely survived and critically didn't. Even the film fanatics and fans of the star disappointed with it. Now I can't believe the sequel is announced, but I hope it won't take off. Anyway, it could become a decent television series rather than a film franchise.\r Diesel is the reason for this film to look okay and the story was maybe the hundredth time used. Come on we all know this story, but with a new cast and the settings, it looks different. So for me the film was an average, other than that, I don't think it is worth recommending to the others. If you still want to see it, then pick the digital 3D version where you can at least enjoy some special effects.\r 5/10"
    },
    {
      "rating": "7",
      "text": "While the ending could be done better and dialogues sometimes rely on the lore more than they should, the overall movie is a rare blast (especially these days, dominant with emo series like twilight) with traditional representation of witches, dark magic and stuff. What amuses me most is this movie's attention to details, allegories and sometimes even satire for human society.\rThis is not a movie for everyone I might say, but if you find it's tune you will definitely put it to your collection and will watch it again from time to time."
    },
    {
      "rating": "2",
      "text": "It try's to make you enjoy it by using cool special effect and vin diesels charm but it's Warterd down with a confusing story and not enough brains whitch leaves us with this what should of been a cool start for a new franchise"
    },
    {
      "rating": "5",
      "text": "Generic action schlock with vin diesel playing ... well vin diesel basically. If you're in the right mood theres some fun action adventure type thrills to be had with a magical twist to it. Fun enough but few to no surprises."
    },
    {
      "rating": "3",
      "text": "I don't know, maybe I'm just not into witch theme or something? I saw a really similar movie which came out before this one, which basically had the same plot more or less - a witch is coming back and a hunter needs to kill it. And even all the other things in the plot were quite similar, can't recall the movie though, but the fact that it reminded me of that first movie so much, made it feel a bit boring. Also, even though I like Vin Diesel in Fast n Furious franchise, here the movie didn't make me believe that he actually could be a witch hunter. Plus all the actions scenes were so predictable and nothing interesting really happened. Besides that - his strategy at the beginning was to go straight into traps of witches. Just like Bond does in his movies - lets bad guys catch him and then escapes. Here there was a bit of a similar theme, which I find to be a bit dumb. At least explain why he just goes to some witches who try to control his mind etc. Of course it plays out ok for him, but anyway. Only thing which was interesting maybe was that Elijah Wood's character betrayed him, which was unexpected."
    },
    {
      "rating": "4",
      "text": "The Last Witch Hunter , was a bit boring , sometimes with a little cliches , and to believe it if this witch hunter hunting one , not many like both wait , that was the point remains outstanding but very good perfomance of Vin Diesel, and the action scenes."
    },
    {
      "rating": "5",
      "text": "Esse filme é bom mais n dá para criar um apego pelos personagens por que muda eles de uma cena para outra não tem graça mais se fizerem a continuação melhorem isso e tudo eles resolvem com magia"
    },
    {
      "rating": "6",
      "text": "I just would hope they would told more about witches, there was few moments that leaved me wandering how did this happened. Plot was good it had some very good and unexpected twists. So movie was good but not great."
    },
    {
      "rating": "5",
      "text": "Interesting themes and ideas plagued by poor execution and bad writing. The directing relies on flashiness and quick cutting when longer takes and more physicality would have been better. The actors are good enough; this was a passion project of Vin Diesel's, and he fully commits. Rose Leslie is great, but isn't given much to do. Michael Caine is barely on screen. Elijah Wood should have been the emotional and thematic counterpoint, but instead has a handful of scenes that culminate in a massive plot info dump right before the crucial show-down. Overall, it feels like there was a lot left out. A fun enough action film that keeps moving - which is just as well because there is little to savor."
    },
    {
      "rating": "10",
      "text": "Having read some of the reviews that were negatively based, and having watched the film multiple times, all I can say is that this movie will be picked up and watched for some time. Vin is in his element in this movie both bad-ass, and caring at the same time. The cast is very good, with Michael Caine anchoring the whole shebang. As far as lore goes, this movie doesn't follow the mind set that most people would put on Witches, but, with numerous movies changing the way that evil is both perceived and dealt with, I believe this movie stands very high, and is fun to boot. Rose Leslie  is very believable as a witch with a heart, and the Witch queen is a delight of evil."
    },
    {
      "rating": "7",
      "text": "The Last Witch Hunter is a pretty good movie with cool action, mystery, and good performances. The premise of the movie is a little far fetched and the writing at times is predictable, but overall its still an enjoyable film."
    }
  ],
  "recommendations": [
    "hercules",
    "riddick",
    "i_am_legend",
    "i_am_number_four",
    "bloodshot",
    "jumper",
    "poseidon",
    "underworld_awakening",
    "surrogates",
    "underworld",
    "avengers_age_of_ultron",
    "clash_of_the_titans",
    "the_three_musketeers",
    "seventh_son",
    "jupiter_ascending",
    "jack_the_giant_slayer",
    "rampage",
    "van_helsing",
    "underworld_evolution",
    "aquaman",
    "gods_of_egypt",
    "pacific_rim_uprising",
    "edge_of_tomorrow",
    "valerian_and_the_city_of_a_thousand_planets",
    "tomb_raider"
  ]
}