{"id": 4082, "title": "The Last Days on Mars", "starring": ["Liev Schreiber", "Romola Garai"], "runtime": 98, "genre": ["Science Fiction", "Thriller", "Horror"], "description": "On the last day of the first manned mission to Mars, a crew member of Tantalus Base believes he has made an astounding discovery – fossilized evidence of bacterial life. Unwilling to let the relief crew claim all the glory, he disobeys orders to pack up and goes out on an unauthorized expedition to collect further samples. But a routine excavation turns to disaster when the porous ground collapses and he falls into a deep crevice. His devastated colleagues attempt to recover his body. However, when another vanishes, they start to suspect that the life-form they have discovered is not without danger.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kxcQkAhpn8cvJTsU8PXblI5Qq8F.jpg", "categories": {"plot": 6.8, "acting": 6.833333333333333, "ending": 5.25, "soundtrack": 3.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "4", "text": "The Last Days on Mars is sporadically suspenseful but with wooden acting, lame dialogue and a predictable plot, it offers just a pale imitation of similar horror+sci-fi flicks done better."}, {"rating": "4", "text": "The Last Days on Mars is sporadically suspenseful but with wooden acting, lame dialogue and a predictable plot, it offers just a pale imitation of similar horror+sci-fi flicks done better."}, {"rating": "7", "text": "People seem to be kind of down on this movie in general but I thought that it was great. I think the acting is top notch, and I like the story. First of all zombies are not \" dying of thirst \" and do not drink water, and secondly even if someone wants to complain about how the cast was picked off, the same thing happened in the movie Alien and look at the reviews for that movie !!! Maybe some special effects could have been better, but it was nice to see technology that is more realistic than something like Alien. When that thing first showed it's face and grabbed the drill I almost jumped out of my seat !!! And then the red lights flashing was a great dramatic effect and I think the movie really took off and that the situation was realistically portrayed as to what would actually happen and how one would react if in this scenario. I love the strong female characters and the resentment that builds up towards Kim that leads towards her demise and that thing chasing the character Vince through the tunnel !!! Also Zombies do not forget the names and faces of their children before they die and they do not describe how they can not feel their hands either. I also liked the humor, and the fact that the main character Vince has a problem that should have been \" weeded \" out yet ends up being the one who sort of saves the day. I find that thought provoking that perhaps someone with this \" handicap \" could have other attributes that could prove more valuable. So I must say that over all, I really did enjoy this movie !!!"}, {"rating": "4", "text": "The movie is kind of a mess. With a beginning and an end but no middle, nothing is explained. The movie seemed to have an interesting premise but was clearly rushed."}, {"rating": "6", "text": "The Last Days on Mars is a decent sci-fi horror flick. The movie finds itself rooted somewhere between art-house trappings and ultra-derivative schlock. It doesn't help that the characters are wafer thin or that the one subplot (involving a fear of claustrophobia) is left vague and confusing. What makes this movie decent, however, is the art and sound design. It's very well made and has some great chunky special effects. Ultimately, The Last Days on Mars is a harmless yet enjoyable bit of popcorn sci-fi."}, {"rating": "7", "text": "Recently Hollywood was largely contaminated with science fictions, especially space theme after ruling fantasies in the last decade. So it's good to see Britain to join in such competitive subjects. It was a decent science fiction, despite the addition of the horror genre to it. Kinda looks extended version of 'Apollo 18' because of the similar plot. But there are lots of different between both from characters to things that happen around.\r In my opinion, this movie was not bad as many say nor good. Keep delivers what one can expect from a space travel theme, though lacked in originality. The story commences without notifying us about the mission's motivation that happened earlier or what's gonna happen later. So everything about the present situation of the mission's crew and their quest.\r As the story progress, there's no delay in haunting parts of the thriller of the movie to begin. Characters just shatter and go chaos which gives first sign to us to do not blink further. Even it leaves us clueless about the incident due to the undeveloped characters. But sad not to see any heroic attempts among the survivors. They (filmmakers) tried to keep as much as a realistic approach with men in astronaut suits than great stunts like a commercial action movie.\r In another perspective, it is a zombie movie that takes place on an alien planet. What do we call a man wandering around without a brain function or without a pulse, a zombie!. It disappoints a bit for diehard science fiction fans for not being the movie true to its genre. If you're okay with the merge of the genres, then you would find it a decent than disappointment.\r I guess one big known name in the cast would have done a better at the box office. Liev Schreiber carried it out as much as he can but other casts just faded so early without delivering much which cause the movie a downfall a bit."}, {"rating": "6", "text": "Um bom filme de Sci-fi: Mas apenas isto.\rNão há elementos que realmente te prendam na história (ok, há boas cenas) mas em certa parte se torna, digamos, meio morno, parecendo que só está rolando uma repetição de fatores que já foram apresentados ao expectador antes. Nada impressionante"}, {"rating": "2", "text": "Last Days on Mars is a rushed, slapped together, and quickly made film that only gets worse and worse as it progresses. A film can only contain so much. Space is endless, but by watching this film, you'll wish it wasn't. At least on a movie scale"}, {"rating": "5", "text": "Outstanding science fiction set becomes remedial zombiesque romp to nowhere with a no hope ending thrown in fer kicks. I don't know about you but I don't think films like this are good enough to ask people to pay money to see them. I saw it free streaming on the web and I wasn't entirely pleased with it either. I did think the sets were really well done-just like I imagine it would be on a Mars mission. I was also very disappointed to watch it degenerate into what was tantamount to a mindless zombie film that might as well have been shot behind an abandoned gas stain in Arizona. Dismal no hope ending didn't help matters much. No wonder there is a lot of depression out there these days-these kind of movies will take you right down the rabbit hole but after that they do they don't offer any reprise which I think sucks royally. I gave it a five rather than the three it probably deserves due to the excellent set work."}, {"rating": "3", "text": "From this fiasco I can only rescue and mention Max Richter's musicIt hurts me to see him composing music for such miserable films."}], "recommendations": ["pandorum", "monsters", "riddick", "daybreakers", "the_cloverfield_paradox", "captive_state", "event_horizon", "spectral", "sunshine", "independence_day_resurgence", "battle_los_angeles", "science_fiction_volume_one_the_osiris_child", "geostorm", "the_tomorrow_war", "surrogates", "the_darkest_hour", "world_war_z", "predators", "the_predator", "the_day_after_tomorrow", "the_last_witch_hunter", "jurassic_world_fallen_kingdom", "prometheus", "the_core", "chernobyl_diaries"]}