{"id": 4577, "title": "The Square", "starring": ["Claes Bang", "Elisabeth Moss"], "runtime": 151, "genre": ["Drama"], "description": "A prestigious Stockholm museum's chief art curator finds himself in times of both professional and personal crisis as he attempts to set up a controversial new exhibit.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pefcv5VNspSK4Dt8doei5bJmmln.jpg", "categories": {"plot": 9.0, "acting": 9.0, "ending": 7.0, "soundtrack": 9.0, "cinematography": 9.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Not a bad DVD; but sort of the same old type of affair-gone-wrong formula but with Aussie accents.  Also, gives the watcher a bit of a look at life in Australia.  Definitely worth a watch."}, {"rating": "5", "text": "Yeah its ok to watch but there are far too many twists and turns. For a couple of times i thought i had missed some parts but it was all part of the 'intrigue' ; its overly complicates itself as if they did not have enough faith in the original script."}, {"rating": "9", "text": "I absolutely loved this movie. I had it on the backburner for about a year and wish I never had. The cinematography was beautifully framed, the acting was superb and the music set the perfect ambience. I like a good original story myself but people need to get over the fact this film isnt mind blowingly original. The second to last scene in the film was very new to me, little twists scattered throughout made the whole thing feel fresh. I will definately watch it again with some friends. Btw, metacritic, your mobile website sucks, it won't let me change the rating to either zero or ten."}, {"rating": "7", "text": "I like the Edgertons, The Gift was excellent. Photography is a little bland, script was good, it really helps when the original base plan is solid.  Increasingly for me the most implausible thing is is people being honest.  I think a movie where people only backstab is more plausible, a good twist would be having people that betray themselves in order to betray others."}], "recommendations": ["tomorrowland", "the_butterfly_effect", "alice_through_the_looking_glass", "now_you_see_me", "frozen_ii", "the_craft_legacy", "cruella", "fantastic_beasts_the_secrets_of_dumbledore", "shutter_island", "dreamcatcher", "the_illusionist", "the_witches", "the_chronicles_of_narnia_prince_caspian", "old", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "pay_it_forward", "it_chapter_two", "gone_girl", "i_am_legend", "seven_pounds", "the_prestige", "inkheart", "the_number_23", "the_lucky_one", "twelve_monkeys"]}