{
  "id": 1841,
  "title": "The Wedding Ringer",
  "starring": [
    "Kevin Hart",
    "Josh Gad"
  ],
  "runtime": 101,
  "genre": [
    "Comedy"
  ],
  "description": "Doug Harris is a loveable but socially awkward groom-to-be with a problem: he has no best man.  With less than two weeks to go until he marries the girl of his dreams, Doug is referred to Jimmy Callahan, owner and CEO of Best Man, Inc., a company that provides flattering best men for socially challenged guys in need.  What ensues is a hilarious wedding charade as they try to pull off the big con, and an unexpected budding bromance between Doug and his fake\r best man Jimmy.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nh9VKA4LEPKkoCljnDNHtSIhKbF.jpg",
  "categories": {
    "plot": 5.866666666666666,
    "acting": 7.2,
    "ending": 8.333333333333334,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.923076923076923,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Kevin Hart said before the release of the Wedding Ringer that the film was his best work yet and after watching it I agree with him. Hart shows that he is an excellent leading man in a comedy film. Josh Gad is also great, I think that Hart and Gad may be sustainable comedy stars for years to come. The movie is very funny but its also a heartwarming movie that make you realize how much you appreciate the friends in your own life. The Wedding Ringer is what you get when to add I Love You, Man and Wedding Crashers and the result is a film that will likely headline the best comedies of 2015."
    },
    {
      "rating": "9",
      "text": "The Wedding Ringer was hands down one of my favorite comedy movies in years and I honestly didn't expect that at all. From trailers I thought this was going to be the least original comedy possible, merging Hitch and The Weddings Crashers into a cheesy, generic plot. After actually watching the movie, while it does have some of the elements from those films, it feels authentic and original throughout. The cast is all fantastic, with Josh Gad and Kevin Hart not having to carry the film but delivering roles that could've if required. The laughs weren't as abundant as I hoped but the film doesn't rely on them in place of content. The movie is rich with content so it doesn't use cheap laughs as a crutch the way most comedies do. Instead, it builds the humor and then truly delivers incredible comedy when it wants to. The emotions in the movie feel legitimate and the plot and characters develop in a way that makes them seem real... like if you know them and can see this taking place. Bottom line, it's difficult to explain why this movie translates so well. The critics proves once again that they don't understand humor but the actual viewer reviews seem rather positive, which is where I would suggest looking to in determining whether or not to watch the movie. For me, the refreshing take on comedy, where content doesn't take a backseat to laughter but doesn't replace it either, made for a great movie worth watching."
    },
    {
      "rating": "7",
      "text": "\"The Wedding Ringer\" 10 Scale Rating: 7.0 (Good) ...\r The Good: Kevin Hart was amusing, as usual. Unlike most films featuring him, they didn't over-do it with Hart and let other actors (most notably Josh Gad) share the spotlight. Gad was great playing the straight man and the pair made for an excellent comedic duo. The more dramatic and serious elements were well done and a pleasant surprise from a film perceived as a low brow comedy. A solid premise that was a great idea going in and ended up being an amusing and solid film.\r The Bad: A little predictable and you can tell very early on exactly what is going to happen in the end. There were a few scenes that were more crass than they needed to be. I don't mind crass humor, but the film was succeeding without it and the scenes felt out of place and crammed into the movie."
    },
    {
      "rating": "7",
      "text": "I couldn't stop laughing the whole time. Felt like an instant classic. I would re-watch it again just to try to pick up on the jokes that I may have missed while I was laughing. Had some very unique situations."
    },
    {
      "rating": "8",
      "text": "This movie here is a rare one. Its overall a very funny film that was making everyone in the cinema laugh out load countless times throughout. But I do have to say sometimes the film crossed the line from extremely funny to slightly gross at times. It was a great buddy movie and I highly recommended you go into it expecting a lot of laughs from you and the other folks in the cinema."
    },
    {
      "rating": "8",
      "text": "I went to see this with four friends and we laughed the whole way through the film. While the overall storyline and ending was predictable, Kevin Hart and Josh Gad work well together as a comedic duo. A feel-good buddy comedy!"
    },
    {
      "rating": "4",
      "text": "A fairly plain generic comedy that lacks the laughs.  I can't say anyone is terrible here.  All the actors seem to care about their performance, but they lack the script to succeed.  C-"
    },
    {
      "rating": "8",
      "text": "If you go to see this movie knowing this is not Oscars material you will have a GREAT time, there were a couple of moments I literally couldn't breathe because how hard I was laughing. If you want to laugh for an hour and a half give it a try, it's worth it."
    },
    {
      "rating": "6",
      "text": "Is it high art? No. But I enjoyed a toned down Kevin Hart, and despite some cheap low-brow humor there were some clever and inspired one-liners and monologues. If you like Hart then you'll like this movie, and if you just want a breezy, likeable film in the middle of trashy January, you'll appreciate this film."
    },
    {
      "rating": "9",
      "text": "An unrestrained wacky fun comedy with comical performances from Kevin Hart and Josh Gad, it's not better than Hart's other film About Last Night but Hart shines and this is his funniest movie. Gad has ebullience and is humorous as this funny like able character, and is more funnier than Olaf from Frozen. Josh Gad plays Doug Harris he's socially awkward and is two weeks away from marrying the girl of his dreams Gretchen (Kaley Cuoco-Sweeting), but he has a problem Doug can't find any groomsmen, running out of time Doug calls Jimmy Callahan (Kevin Hart) owner and operator at Best Man Inc, Jimmy helps friendless grooms. As Doug tries to makes this con work, an unexpected bromance sparkles between Jimmy and Doug. It's not that painfully predictable but the film makes it work, Hart once again is funny and talented even though if the material is bad Hart makes it work, he has this zest and this film shows that's he more than the hyper active character you seen in Scary Movie or Think Like A Man. Grade A-"
    },
    {
      "rating": "5",
      "text": "If you have seen movies like Wedding Crashers or other Marriage themed comedy you've pretty much seen The Wedding Ringer. It's a fairly semitropical Wedding movie featuring Kevin Heart and Josh Gad who do a great job with their characters. Sadly the rest of the film feels fairly plain and dull other than a few monuments. The dull plot aside there are a fair amount of good jokes and funny scenes to the movie that are slightly redeeming but not enough to save the film. The concept of the film is original, Kevin Hearts character is paid to be the best man for many peoples weddings and makes quite a living out of it but at the same time complicates his day to day life...surprised no one has tried this in real life yet.\rAltogether The Wedding Ringer is a alright comedy for a weekend movie, It's not something you will be going back to but still enjoyable for a night."
    },
    {
      "rating": "3",
      "text": "First, full disclosure here...I don't like Kevin Hart and I don't think he's funny. I do like Josh Gad, especially when he's playing a fat snowman who can sing. I'm not sure who figured that these two would work out together in this film. It's the ultimate example of Hollywood trying to play formula mixer. This just doesn't work and even though it has a great supporting cast it's just all over the place. I should have really trusted my gut instinct and passed on this one."
    },
    {
      "rating": "4",
      "text": "While it's hard to say I was thoroughly entertained by the movie or even laughed during it, I can't say it was a bad film. Other than the occasional \"You put the weed in the coconut\" singalong me and some of my friends join in on randomly, this is a very forgettable movie that could barely hold it's own. It's a lowest-common-denominator comedy that will spew out predictable jokes and go along it's predictable story path, however the chemistry between the two leads did show some hope. If you're looking for a cheap comedy on a Friday night with some pals, this isn't a bad choice. However, you have been warned that this is not a great film, nor is it a bad one."
    },
    {
      "rating": "9",
      "text": "Very funny buddy comedy. Originally written in 2002 and  although it shows it might be dated writing, I still think it fulfilled all my  standards for a solid buddy comedy."
    },
    {
      "rating": "9",
      "text": "I simply do not understand the reviews of this movie! I watched it and I'm very pleased with it. Kevin Hart gave the audience a heart attack of comedy. The Wedding Ringer isn't supposed to smash Box Offices but provide the viewer with a mix of humor, good plot, and non-cliches. This movie has simply done that and above for me. Now if you're comparing this movie to any other movies like Avatar, Chappie, or Kingsman, Than you already lost the comparison. My advice is to at least get this movie on DVD or Blu-Ray if you're a humorous individual. Don't forget to look for the\" Lost\" reference at the end of the film as well!"
    },
    {
      "rating": "5",
      "text": "Overall, \"The Wedding Ringer\" is partly a funny comedy and partly a banal mess that shines and stinks at equal measure. The chemistry between the leads is a grace while the supporting cast is unmemorable."
    },
    {
      "rating": "5",
      "text": "The first hour of \"The Wedding Ringer\" is a funny buddy comedy but as soon as it hits the hour mark, gets sleaze down by cheap humour which gathers no laughs."
    },
    {
      "rating": "1",
      "text": "This is a horrible comedy with one of the worst plots i have ever seen. when the opening joke is Josh gad falling through a glass table you know the writers are desperate. also this has been the film to make Kevin Heart another one of my comedians i expect to make bad movies along with Will Farrell and Adam Sandler. the jokes are seriously not funny and done in a way that is incredibly mean spirited, which in itself isn't a negative but the way is written is so bad i just couldn't laugh at anything"
    },
    {
      "rating": "6",
      "text": "My audience laughed their asses off in this film, and it even got a round of applause at the end.  So, for what it's worth, it's an entertaining movie.  I just wish that the volume had been higher because Kevin Hart tends to walk over his laugh lines, and when the audience busts into laughter, you miss next joke coming in rapid-fire fashion.  The chemistry between Hart and Gad is solid.  The true weak point of the movie?  Kelly Cuoco. She brought virtually nothing to the table, and she's completely overshadowed by the Olivia Thirlby in the much smarter role."
    },
    {
      "rating": "5",
      "text": "Josh Gad plays a friendless nerd who's about to be married and hires Kevin Hart to be his best man and provide all the groomsmen. The only real reason to see this movie is for Hart's manic-mouth comic comments. The plot is painfully predictable, except when it veers off into absurd sequences that are supposed to provide outrageous laffs, but just fall flat. There are a few funny moments, but without Hart's energy this jumbled mess turns into a Hollywood hybrid of too many farces that did it better."
    },
    {
      "rating": "4",
      "text": "Co-writer and director Jeremy Garelick uses the movies premise to deliver a series of random gags and a tale of friendship. The problem is that even with all of the crazy scenarios that take place there's not much humor to be found. There are some clever one-liners and some amusing physical humor, but overall it's not a funny film. A big shock considering it has Kevin Hart as one of it's two leads. Even as a huge fan of his I found myself wanting so much more.\r The plot and it's moments of self-discovery and budding friendship all feel way too familiar. You can even predict how the whole romantic relationship that leads the wedding in the first place is going to turn out. None of this would be that bad of a problem had things actually been regularly funny. Instead what we get are a few good jokes thrown in amongst a bunch of absurd and random moments that fail to hit any comedic notes. Some of the stuff here is just offensive and cruel and not in the right way. Despite having talent like Hart and Gad at the helm of the film, the funny people here are actually the supporting cast that make up the groomsmen and they are barely in the film at all. The rest of the cast is just there to use unnecessary profanity.\r Every now and then a funny moment will pop up, but they are so few in a film that is filled with so much wasted potential and talent. There are some funny people here who either aren't used or aren't used well. The chiefest example of this is Hart. He's a man who has proved that he is hilarious time and time again, and here he's just not. \"The Wedding Ringer\" had a lot of great things going for it, but unfortunately fails to capitalize on just about all of it. What we are left with is a comedy that is for the majority of it's runtime unfunny. This is a pretty big disappointment, especially for us Kevin Hart fans.\r I give this movie a 4.5/10."
    },
    {
      "rating": "6",
      "text": "Good premise of a movie it seemed and fair story telling to keep the movie going-although running long. Hart made this movie funny, or this would have been TERRIBLE. Is he an actor, no. But neither is Gad. He reminds me of a less talented, pre-weightloss Jonah Hill and plays that playful, loser type character. Nonetheless it had a few good laughs, but I feel the promising premise wasn't full developed in regard of all the things that could spin out of control/fun factor stuff. Good for a watch, not to keep."
    },
    {
      "rating": "8",
      "text": "A comedy about to pull off the first ever Golden Tux.\r In any movie if you see a sidekick rule, that has to be the Kevin Hart. He can handle the whole movie by himself and this film is a great example. It totally surprised me, I expected it to be an average film, but it was an awesome comedy. We have seen plenty of bride and groom and marriage related comedies, but this was a slightly different yet a fantastic treat.\r I don't think it was wonderful because of the jokes alone, but unique characters and actors who performed them were brought the fine outcome. I felt like I know what's coming, but the ending was simple and smart. Like always when I like a movie a lot I hope for a sequel to come and they should make one for this as well.\r It's a Kevin Hart's time as a comedian, his top box office films are all from the recent time, so he must make use of it and I am expecting his upcoming projects. This is a perfect weekend movie to have some laughs. Middle finger to the film critics. I definitely recommended it not only for the film fanatics but all. Who knows you might find it much better than the recent 'Get Hard'.\r 7½/10"
    },
    {
      "rating": "5",
      "text": "Some laughs aside, The Wedding Ringer is a mediocre movie at the cheesy writing and mind boggling story. Its a movie that could have been a nice flick, but despite Kevin Hart at his best and the bromance of Josh Gad and Hart is so good, it may be the best since 22 Jump Street. Give it a rental watch, for the bromance, laughs and Kevin Hart."
    },
    {
      "rating": "4",
      "text": "The fact that I sawed this movie back in January and now I'm reviewing it that because I couldn't give a living **** about this movie and I didn't want to watch it, but since I force myself to watch these bloated Hollywood movies that I have zone interest in just because I'm a movie reviewer. So for now on when you see one of my reviews and I don't go into deep detail to them pretty much means that I don't want to talk about the film at all because I simple do not care about that movie.\r The Wedding Ringer has a couple of funny scenes and Kevin Hart & Josh Gad both did okay, but the movie itself isn't anything that I will remember."
    },
    {
      "rating": "5",
      "text": "This movie was a typical R-rated comedy. There was nothing spectacular about it in a cinematic sense, but where other comedies usually succeed, this film failed to be consistently funny. For the first half, I was extremely disappointed. I only laughed a couple of times, but when Kevin Hart and Josh Gad got to their antics, it remained funny from there. This is a sub-par comedy, but it can be worth a check on Redbox."
    },
    {
      "rating": "3",
      "text": "That moment when there are more negative ratings, but there are more positive and neutral (mostly neutral) reviews. I was expecting a lot more negative reviews, but I just got 3 (now 4 because of this review) reviews. Nonetheless, the Wedding Ringer is something you've seen before, but just make it worse and add clichés to it."
    },
    {
      "rating": "1",
      "text": "I watched The Wedding Ringer, for the first time; several days ago.\r I like the diminutive, sharp Kevin Hart. I've liked Josh Gad ever since I saw him in \"The Rocker.\"\r The Wedding Ringer was entertaining enough to not jump the channel; but I was really, really disturbed by scenes from a sexually charged bachelor and after bachelor party; ; that involved sexual participation with and from a dog.\r And, I'm not prudish. Not by a long shot.;but I am unwavering in my feelings that animals have no business being sexualized in film, print, record or screen.\r Who the heck thinks like this. Who the heck is okay with this.\r I fear this envelope has been pushed into the land of acceptable prat fall and potty humor and oversexed under served in her face writers.\r It's a miserable thing to have to contemplate. The what's next for companion animals and human sex."
    },
    {
      "rating": "5",
      "text": "Watched it 4 years ago. Remember I liked it but wasnt nothing impressive and at this point dont even remember much it was about. SO yeah, I guess meh."
    },
    {
      "rating": "4",
      "text": "The wedding ringer is a stupid movie.But it does have some enjoyable moments.This movie is fun and Kevin hart and Josh gud Make a pretty good team.But the jokes are not funny,It was kind of lazy and Sometimes Kevin hart and Josh gud act stupid.So I give this movie a 4.6/10"
    },
    {
      "rating": "4",
      "text": "meet your groomsmen..The Wedding RingerThe Wedding Ringer has all the clichéd recipe in it; from characters to the plot or from jokes to emotions, having said that it also has funny moments and has a great music and Kevin Hart."
    },
    {
      "rating": "10",
      "text": "I dont get it why people hate this movie,its funny,entertaining and Josh Gad and Kevin Hart have great relationship"
    }
  ],
  "recommendations": [
    "identity_thief",
    "date_night",
    "forgetting_sarah_marshall",
    "neighbors",
    "30_minutes_or_less",
    "zoolander",
    "zack_and_miri_make_a_porno",
    "step_brothers",
    "central_intelligence",
    "this_is_the_end",
    "the_watch",
    "rough_night",
    "dodgeball_a_true_underdog_story",
    "tammy",
    "the_other_guys",
    "ted_2",
    "the_longest_yard",
    "friends_with_benefits",
    "dinner_for_schmucks",
    "get_hard",
    "horrible_bosses_2",
    "pitch_perfect_2",
    "anchorman_2_the_legend_continues",
    "the_break_up",
    "50_first_dates"
  ]
}