{
  "id": 2540,
  "title": "The Princess Switch",
  "starring": [
    "Vanessa Hudgens",
    "Nick Sagar"
  ],
  "runtime": 101,
  "genre": [
    "Romance",
    "Comedy"
  ],
  "description": "When a down-to-earth Chicago baker and a soon-to-be princess discover they look like twins, they hatch a Christmastime plan to trade places.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A8XgZE8CsHiYN243MEd07GLCep.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 5.545454545454546,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 2.0,
    "familyFriendly": 6.0,
    "funny": 2.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "First of all, the set design in this film is spectacular. Every set makes you feel like you really are there with these characters. I also really liked the costume designs on them. It was an excellent choice for everybody and to show how the royalty has better-looking clothes compared to everybody else in the film. The acting in this film was marvellous. Nobody seemed like a character but a real human being. You can easily relate to either Stacy or Margaret in a way. For example, you either connect to Stacy because you are the type of person who plans out everything or Margaret who is spontaneous. I had no issues with the pacing at all in this film. Everything seemed to flow from one thing smoothly to the next. I think one of the only things that bugged me about this film was how everything happened like magic and was never explained.There was a character in this film that just kept appearing at the right moment and it was never explained. And two characters would stand underneath mistletoe that magically appeared out of nowhere. Also, it doesn’t seem realistic. Yes, I know this is a fictional film but they make the characters out to be stupid and not question why Stacy or Margaret is acting differently than usual. They show signs of questioning it but again like when things happen in this film they just shrug it off. Other movies who have done this kind of plot had a few characters shrug it off but not all. Also, I’m pretty sure who wrote this movie wrote A Christmas Prince there is a lot of similarities between the two princes. In the end, this movie is good for people who like RomComs or who don’t."
    },
    {
      "rating": "2",
      "text": "Mike Rohl's 'The Princess Switch' is like the annoying guy who sings Christmas Carols in November. It is a film supposedly about the magic of Christmas and love and what-not, but the only representation of the best time of the year is of extravagant, cliche decorations. Seriously, is like walking through a supermarket in December. The cinematography is also highly colorful and while is aesthetically pleasing, it also feels cheap and unnatural.These problems, unfortunately, persist deeper into the film. Vanessa Hudgens plays a double role here. She is Stacy De Novo, a baker from Chicago and also Lady Margaret, the Duchess of... whatever. The point is, these two have conflicting personalities so they decide to switch places for two days. The only thing properly executed here is the creative way in which the two characters have personalities conflicting their social status; Margaret is aching for a normal and spontaneous life, while Stacy is well-organized. Sure, the complexity of the characters is kept to a minimum, but this being a Christmas film, I don't have too many issues with that.What does bother me, though, is the annoying product placement of a certain media-service provider and the overacting of certain characters. There is an unnatural quirk to most of the performances, and while the interactions between the two female protagonists and their experiences after switching do contain some funny moments, they are also blatantly awkward. I cannot stand Hudgens' in-your-face British accent or Nick Sagar's childish and obnoxious Kevin.I will be honest. The only reason I watched this film is because it was filmed in Romania, and a friend of mine was an extra. The location does offer a certain archaic beauty, and this being a Christmas film it can get away with a lot of things, yet if its predictability is not enough to put you down, then the film's insistence on it sucks out all its depth and leaves us with an unnecessary, bland, boring squabble whose over-the-top aesthetics could only be appreciated by 8-year old kids and Christmas Calendar designers."
    },
    {
      "rating": "2",
      "text": "An absolutely appalling example of why cliches and tropes sometimes don't work -- especially when either used too often or relied upon exclusively. \"The Princess Switch\" is a borderline shameful exploitation of grounds that the romantic comedy genre has already stomped into oblivion by way of the Hallmark channel alone. Sure, you could argue it's first twenty minutes are a \"so bad, it's good\" watch, but that's only for the first twenty minutes. This movie's like a weird drug where the first few minutes of use are completely satisfactory (in an ironic sense, albeit). But that is quickly followed by a sudden onset of tolerance that honestly makes you question whether or not using was even worth it. Just horrifically bad. Bad, bad, bad."
    },
    {
      "rating": "5",
      "text": "This is a perfectly fine romantic film to watch around Christmas time. Is there really any comedy? Not really. Is it REALLY a Christmas film? It takes place around Christmas, but that's it. Is the acting the best? Can't say that, neither. BUT, I can't say I felt like I wasted my time after watching it. It's just a sweet, wholesome throwaway film to watch if you want a romance story with Christmas as a backdrop. It's mediocre, but it leans more towards the positive definition of that term."
    },
    {
      "rating": "8",
      "text": "I loved this movie, great plot, story and acting. Sure there are some kinks, but I really did like it. The end left me beaming. I definitely recommend."
    },
    {
      "rating": "6",
      "text": "\"The Princess Switch\" é um filme adequado para ver durante a época natalícia. Não é uma comédia romântica, mas a história é interessante e foi explorada decentemente. Hudgens é fantástica.6/10"
    },
    {
      "rating": "3",
      "text": "Nothing special ! little bit boring. you can expect every scene during watching the movie but characters are cute maybe you can feeling christmas through this movie"
    },
    {
      "rating": "2",
      "text": "Imagine an unnecessary rehash of the Parent Trap but with painfully predictable archetypes, and a stale plot and characters--- and also substantially more painful."
    },
    {
      "rating": "6",
      "text": "Smart and cute story somewhere in  the UK actually filmed in Scotland and Romania. Cheesy dialogues but the plot works OK with lots of fun and some action Best of all of course is the terrific play of Vanessa in two roles"
    }
  ],
  "recommendations": [
    "alice_through_the_looking_glass",
    "the_secret_life_of_pets_2",
    "terminal",
    "maleficent",
    "fifty_shades_darker",
    "thor_love_and_thunder",
    "a_wrinkle_in_time",
    "pan",
    "frozen_ii",
    "last_christmas",
    "cruella",
    "incredibles_2",
    "black_panther_wakanda_forever",
    "a_christmas_prince",
    "bumblebee",
    "the_nutcracker_and_the_four_realms",
    "shazam_fury_of_the_gods",
    "turbo",
    "tenet",
    "the_lego_movie_2_the_second_part",
    "palm_springs",
    "now_you_see_me_2",
    "maleficent_mistress_of_evil",
    "gone_girl",
    "snow_white_and_the_huntsman"
  ]
}